{
  "title": "India says no bilateral sporting ties with Pakistan, but cricket team for Asia Cup won’t be stopped - Sport - DAWN.COM",
  "author": null,
  "content": "India’s sports ministry on Thursday declared that India and Pakistan would not have any bilateral sporting ties even on neutral venues as per an unprecedented new policy but the cricket team would not be stopped from playing the Asia Cup next month as it is a multi-lateral engagement, the Press Trust of India (PTI) reported.\n\nPolitical tensions bet­ween the two nations over the years have cast a sha­d­ow over bilateral sporting events, causing major tournaments to hang in the balance. The countries’ teams have previously refused to travel across the border for sporting events, electing to play on neutral ground via a hybrid model instead.\n\nLast month, the Pakistan Sports Board (PSB) instructed all national sports federations to seek prior consultation and approval before participating in any sporting events held in India due to ’“security concerns”.\n\nAccording to PTI, India’s sports ministry unveiled the new policy with regard to India’s international engagements with emphasis on Pakistan.\n\nIt added that a well-placed ministry source said the policy, which bars Indian athletes from travelling to Pakistan and likewise disallows disallows Pakistani sportspersons from going to India for bilaterals, was effective immediately.\n\nAsked if Indian teams would be allowed to travel to Pakistan for any multilateral competitions, the source was quoted as saying: “In that scenario, we will examine the case before deciding anything.”\n\nAccording to the new policy, “India’s approach to sports events involving Pakistan reflects its overall policy in dealing with that country.”\n\n“With regard to international and multilateral events, in India or abroad, we are guided by the practices of international sports bodies and the interest of our own sportspersons,” the policy read.\n\n“It is also relevant to take into account India’s emergence as a credible venue to host international sports events.”\n\nAccordingly, Indian teams and individual players will take part in international events that also have teams or players from Pakistan, the policy stated, adding that Pakistani players and teams will be able to participate in such multilateral events hosted by India.\n\nEarlier this month, it was announced that the Pakistan-India clash for the T20 Asia Cup would be held in Dubai on Sept 14.\n\nIn July, a cricket match between India and Pakistan was called off after Indian players, refused to play against Pakistan, citing recent “geopolitical tensions” between the two nations.\n\nMore to follow.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/08/21171621ba84ef5.png",
  "retrievedAt": "2025-08-22T00:32:13.319Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932484/india-says-no-bilateral-sporting-ties-with-pakistan-but-cricket-team-for-asia-cup-wont-be-stopped",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T12:14:17.000Z"
}
