{
  "title": "Telecos under scrutiny for mismanagement - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The latest Auditor General (AG) report has raised serious concerns over massive violations in the telecom sector, including misconduct by state-owned PTCL and the Special Communi­cations Organisation (SCO).\n\nThe report also reveals that Jazz, the country’s largest telecom operator, overcharged consumers by Rs6.58bn during 2023-24.\n\nThe report highlights that despite multiple directives from the Supreme Court of Pakistan, the Public Accounts Committee (PAC), and repeated requests from the Auditor-General, PTCL has refused to open its accounts for audit.\n\nSeveral objections were raised in the audit paras of regulatory bodies such as the Universal Service Fund (USF) and the Frequency Allocation Board, where PTCL was found guilty of failing to pay its dues and committing various financial irregularities.\n\nFurther, the audit report also flagged Rs3.54bn worth of financial irregularities related to SCO, a state-owned telecom entity operating in Gilgit-Baltistan and Azad Jammu and Kashmir (AJK). Among the findings were procurement-related irregularities of Rs1.33bn and overpayment issues amounting to Rs2.21bn, particularly in the purchase of equipment at inflated prices and excessive operational expenditure.\n\nThe AG report also delved into overcharging by Jazz, noting that the company charged customers an additional Rs6.58bn beyond the approved rates during 2023-24. The audit has called for a detailed inquiry into this matter to identify accountability and determine who is responsible for the overcharging.\n\nFurthermore, the report raised concerns over the Pakistan Tele­com­muni­cation Authori­ty’s (PTA) failure to regulate the telecom sector effectively. It revealed that Jazz had charged rates higher than those approved by the PTA, breaching several sections of the Pakistan Telecom­muni­cation (Re-Organisation) Act 1996.\n\nThe PTA defended its actions by claiming the sector was deregulated and that it primarily oversees competition while allowing market players to manage pricing within set guidelines. However, the AG report criticised the PTA’s blanket approval for quarterly tariff hikes of up to 15%, arguing that this undermines consumer protection.\n\nLastly, the AG report highlighted the unresolved Rs53.54bn case concerning Zong’s illegal use of spectrum, which remains under litigation, further underscoring the PTA’s failure to address serious sectoral issues.\n\nThe audit report has urged swift action to hold the responsible officials accountable for these violations and to ensure proper regulation in the telecom sector.\n\nResponding to the report, Jazz said in a statement that it had launched all tariffs and services only after formal approvals by the PTA in accordance with clearly defined processes.\n\n“We are reviewing the observations shared in the audit report on the Pakistan Telecommunication Authority (PTA) for Audit Year 2024–25. We remain confident that Jazz has acted lawfully and transparently at every step, in full alignment with PTA’s rules and regulatory procedures, including those related to tariff approvals and mandated contributions,” it said.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a6588b30cbc.jpg",
  "retrievedAt": "2025-08-22T00:32:36.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932169/telecos-under-scrutiny-for-mismanagement",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:39.000Z"
}
