{
  "title": "Ten hurt, 90 arrested as match abandoned following fan violence in Argentina - World - DAWN.COM",
  "author": null,
  "content": "Ten people were injured and 90 were arrested on Wednesday after violent clashes between rival fans during a Copa Sudamericana match between Argentina’s Independiente and visiting Universidad de Chile in Buenos Aires, club officials and police said.\n\nA stun grenade was among the objects hurled by fans as the last-16 second-leg encounter of the regional competition at the Libertadores de America stadium was initially suspended shortly after half-time and eventually abandoned.\n\nIn shocking and chaotic scenes, one fan of the Chilean visitors jumped from the stands to escape attacking opposing supporters after being cornered.\n\nHome supporters beat and stripped some visiting fans of their clothes after storming the away end, an AFP reporter at the scene said.\n\nThe violence had flared at halftime when fans of the Chilean side began throwing stones, sticks, bottles and seats at a section housing home supporters.\n\n“We have 90 people detained outside the stadium because they tried to cause trouble and they have already been taken to the police station,” a source from the security ministry told AFP.\n\nAn Independiente spokesperson said that 10 people were injured.\n\nThe match was 1-1 when it was suspended in the 48th minute, before being called off. The away side, from the Chilean capital Santiago, won the first leg 1-0.\n\nChile’s ambassador to Argentina told Chilean radio station Cooperativa FM that “there were stab wounds.”\n\nJose Antonio Viera-Gallo also told AFP that at least one person was seriously injured, although it was not clear what their nationality was.\n\nChile’s President Gabriel Boric called on social media for those behind the violence to face justice and pointed the finger at organisers.\n\nLater, Boric posted that he dispatched Chilean Interior Minister Alvaro Elizalde to personally accompany and review the status of the injured, given “the severity of the situation”.\n\nAs they left the stadium, Independiente fans expressed anger over the policing of the game and the decision to place the visitors in a section near the home fans.\n\nBoth clubs condemned the violence, the latest in South American football.\n\nIndependiente president Nestor Grindetti blamed supporters of the Chilean club, calling their behaviour “truly reprehensible”, he told TyC Sports.\n\nPlayers from both sides had tried unsuccessfully to appeal for calm.\n\n“This level of violence cannot be tolerated,” Chilean international Felipe Loyola, who plays for Independiente, wrote on social media. “I don’t know where the police were.”\n\nIn April, two people died after fans and police clashed outside the Monumental Stadium in Santiago ahead of a game in the Copa Libertadores between Chile’s Colo Colo and Brazilian club Fortaleza.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/21193828764563a.jpg",
  "retrievedAt": "2025-08-22T00:32:14.575Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932652/ten-hurt-90-arrested-as-match-abandoned-following-fan-violence-in-argentina",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T15:08:00.000Z"
}
