{
  "title": "At least 2 dead, 33 injured following explosion, blaze at warehouse in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least two people were killed and 33 were injured when a massive explosion took place inside a warehouse in a densely populated area near Karachi’s Taj Medical Complex on Thursday afternoon, according to police and hospital officials.\n\nPolice surgeon Dr Summaiya Syed told Dawn.com that 20 injured people were brought to Jinnah Postgraduate Medical Centre, including two with critical wounds, while 14 other men were brought to the trauma centre at Civil Hospital Karachi, with two in critical condition.\n\n“The condition of other wounded persons is being evaluated,” she said. Later in the day, she said the police brought the body of a 16-year-old who was found dead at the last level of the warehouse. A statement from Rescue 1122 also confirmed the body’s retrieval.\n\nIn a subsequent update, she said: “One critical patient has unfortunately expired.”\n\nRescue 1122 spokesperson Hassaanul Haseeb Khan told Dawn.com that there was a three-storey building near Taj Medical Complex in Saddar where families resided on upper floors, while the facility was situated in the basement.\n\n“Raw material used for the preparation of firecrackers was stored [in this facility],” Khan said. “During the initial probe, it was suspected that a short circuit triggered a fire in the store and a huge explosion took place because of the presence of highly inflammable material.”\n\nThe spokesperson added that the building’s pillars and walls were damaged, while thick concrete blocks had fallen on parked vehicles nearby. Windows in nearby buildings were also smashed.\n\n“Twelve fire tenders from KMC’s Fire Brigade and Rescue-1122 were engaged in firefighting,” he stated. “Due to the presence of explosive material, the fire reignited frequently. Firefighters were facing difficulties as there was dense smoke emanating from the basement.”\n\nKhan said that the fire was 60-70 per cent under control and efforts were underway to control it.\n\nHowever, Counter-Terrorism Department senior official Raja Umer Khattab told reporters at the scene that the facility contained explosive material, not raw material for fireworks.\n\n“CTD had seized two tons of explosive material in this area in the recent past,” he said, noting that the raw material in fireworks could also be used in bombs.\n\n“As per the relevant laws, up to 50 kilogrammes of firecracker material may be stored in a shop with certain conditions and SOPs (standard operating procedures) in place,” Khattab said.\n\n“Facilities storing firecracker material should be kept away from petrol pumps and residential areas. The deputy commissioner and other authorities concerned may issue licenses to this effect.”\n\nThe CTD official said that firecrackers and fireworks were both imported and manufactured in Pakistan. In Punjab and Khyber Pakhtunkhwa, only license holders could manufacture firecrackers or import them.\n\nKhattab claimed that there was no “industry or factory for manufacturing firecrackers” in Sindh and estimated that more than 50kg of material might have been stored in the basement of the building. He termed the presence of such quantities of explosive material in residential areas “a highly dangerous thing”.\n\n“People do not consider it dangerous as they just call it firecrackers,” lamented the CTD official. “This shop or godown was illegally established in a residential area, which caused substantial damage to human life and property.”\n\nA statement issued by the Karachi Traffic Police said MA Jinnah Road has been closed to traffic due to the fire, with traffic coming from Numaish being diverted towards Society Signal and Ali Raza Imambargah.\n\nThe traffic police directed citizens to call the Traffic Police helpline at 1915 for alternate route options “to avoid inconvenience”.\n\nSindh Chief Minister Murad Ali Shah took notice of the incident and ordered authorities to ensure that the blaze is brought under control and that no lives are lost.\n\nPer a statement, the CM ordered the Karachi commissioner to provide immediate medical assistance to the injured and submit a detailed report to his office once the fire is controlled.\n\n“There is no permission to produce materials near cities or populated areas which can cause damage,” CM Murad was quoted as saying.\n\nMeanwhile, the Sindh Home Department issued a statement today claiming that 20 people were injured in the blaze, while Sindh Home Minister Ziaul Hassan Lanjar directed police reinforcements to head to the scene.\n\n“Police reinforcements should be sent to rescue the injured and transfer them quickly to the nearest hospital,” Lanjar was quoted as saying. “An investigation must be completed and a report submitted soon.”\n\nThe home minister also ordered that authorities include statements from the injured and evidence from the scene in their investigation.\n\n“It should be checked immediately whether the firework factory has a licence or not,” Lanjar was quoted as saying.\n\nFires frequently erupt in buildings across Pakistan due to a mix of poor infrastructure, weak enforcement of safety regulations, and widespread negligence. Many structures lack proper fire exits, alarms, and emergency protocols, while faulty wiring and overloaded power systems increase the risk of electrical short circuits.\n\nEarlier this month, a massive blaze at a factory in the Karachi Export Processing Zone (KEPZ) near Landhi that injured eight people and damaged at least three other factories was brought under control after hours of efforts.\n\nIn June, a fire erupted in Karachi’s Millennium Mall, ostensibly due to an electrical short circuit, and destroyed several hundred shops, causing substantial financial losses. It was brought under control after hectic efforts lasting several hours.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/211750576fe6cc6.png",
  "retrievedAt": "2025-08-22T00:32:17.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932442/at-least-2-dead-33-injured-following-explosion-blaze-at-warehouse-in-karachi",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T11:31:34.000Z"
}
