{
  "title": "PTI’s parliamentary board formed for upcoming LG polls : Farrukh",
  "link": "https://www.app.com.pk/national/ptis-parliamentary-board-formed-for-upcoming-lg-polls-farrukh/",
  "date_published": "2022-02-23T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Wednesday said a parliamentary board of Pakistan Tehreek-e-Insaf (PTI) was constituted on the directions of Prime Minister Imran Khan for upcoming local bodies elections in Punjab.\nTalking to the media persons after a meeting of the Central Executive Committee (CEC) of the PTI, he said it was top agenda of the ruling party to delegate power to the local governments as Prime Minister Imran Khan wanted to truly empower citizens.\nFlanked by Minister for Information and Broadcasting, Chaudhry Fawad Hussain, he said PTI had won maximum seats during the first phase of local government elections of Khyber Pakhtunkhwa (KPK) while the party workers were mobilized to show better performance in the second phase.\nFarrukh said after enforcing article 140-A (local government) of the constitution in KPK the government would fulfill its constitutional responsibility in Punjab as well.\nThe minister said the party tickets in Punjab would be allotted by ensuring ‘transparency and merit’ in consultations with PTI organizations at Tehsil level to redress their grievances.\nHe said scope of the PM mass contact campaign to mobilize party workers for the local bodies elections would further extend across the country.\nThe party would hold more public meetings in various cities across the country after concluding the PM visit to Russia.\nCommenting on the PTI public meeting at Mandi Bahaudin  addressed by the Prime Minister (PM), he said the party workers demonstrated traditional enthusiasm.\nOn the contrary, Nawaz Sharif and Asif Zardari during their tenure used to hold public meetings through ‘Patwaris’ and the government employees, which lacked enthusiasm at all, he added.\nHe said it was the first time that any ruling party had announced such a mega package of Rs 360 billion in Punjab to start a new era of development at the province.\nTalking about Shehbaz Sharif and Zardari cases, he said both were the masters of corruption. He urged the courts to hear cases on a day-to-day basis.\nHe said PTI had decided to table a resolution in the National Assembly (NA) against Pakistan Muslim League-Nawaz (PML-N) President Shehbaz Sharif, denying him access to speak in the NA until the court gives a decision on his case.",
  "retrievedAt": "2025-08-11T14:23:45.407Z"
}
