{
  "title": "“Right to Self-Determination Week” to be observed in Jan to express solidarity with Kashmiris",
  "link": "https://www.app.com.pk/national/right-to-self-determination-week-to-be-observed-in-jan-to-express-solidarity-with-kashmiris/",
  "date_published": "2022-12-26T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP): The Global Awareness Movement Jammu and Kashmir will observe “Right to Self-Determination Week” from January 2 to 9 to express solidarity with the people of the Indian illegally occupied Jammu and Kashmir (IIOJ&K).\nAccording to Kashmir Media service, the Chairman of Global Awareness Movement Jammu and Kashmir, Raja Ijaz Shaikh, in a statement issued in London said that in accordance with the approved resolutions of the United Nations Security Council, events will be organized in Britain, Europe, Pakistan and Azad Jammu and Kashmir in connection with the “Right to Self-Determination Week” and the international community will be informed about the sentiments of the Kashmiris.\nHe said the people of the occupied territory would further intensify their activities in 2023 to highlight the Kashmir dispute at the international level and for a sustainable and peaceful solution to the lingering dispute.\nRaja Ijaz Shaikh said the people of Jammu and Kashmir, wherever they live in the world, will present the case of the people of occupied Kashmir in an organized manner on every diplomatic front.\nHe said in this connection, the first online conference will be held in Islamabad, in which British parliamentarians, Kashmiri and Pakistani political and other leaders, public representatives, and dignitaries from all regions of Jammu and Kashmir will participate.\nHe added that he would make the conference a success in collaboration with various organizations, political elites, leaders of human rights organizations, and central leadership of women and youth organizations.\nRaja Ijaz Shaikh said that functions would be held in Manchester, London, Birmingham, Bradford, Islamabad, Lahore, Mirpur and Muzaffarabad, in addition to the capitals of the Middle East and European countries.",
  "retrievedAt": "2025-08-11T16:04:03.087Z"
}
