{
  "title": "Nation pays rich tribute to legendary Parveen Shakir on her 28th death anniversary",
  "link": "https://www.app.com.pk/national/nation-pays-rich-tribute-to-legendary-parveen-shakir-on-her-28th-death-anniversary/",
  "date_published": "2022-12-26T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP):The nation paid rich tributes to the eminent Urdu poetess Parveen Shakir for her valuable contributions to the field of Urdu literature on her 28th death anniversary observed on December 26 (Monday).\nWith her unique tone and expression, Parveen Shakir transformed the expression of Urdu poetry and introduced new trends in Urdu poetry.\n“Parveen Shakir was the only poetess who proved her poetic skill and mastery over portraying all the aspects of society with a strong expression which distinguishes her from other poets of her era”, said Executive Director, National Language Promotion Department (NLPD) Dr. Rashid Hameed while talking to APP here on Monday.\nHe said that Parveen Shakir was the first poetess of Urdu literature who transcended the traditional barriers of the time and expressed herself with her own feminine identity at that time when most of the poetesses of her era felt a reluctance to show their identity keeping in view the social acceptance factor.\nDr Rashid further said that before Parveen Shakir, most of the poetesses were not disclosing their gender in their poetry expressing themselves as an individual, not as a female.\nParveen Shakir emerged as a trendsetter in the field of poetry transcending traditional societal barriers. She gave confidence to the poetesses of her era to come up with their own identities and also reflected the feelings of women through her poetry, he added.\nHe said that Parveen Shakir’s poetry reflected a diversity of features including aesthetics, cultural and civilizational identity, ground realities, and social issues.Her poetry was not merely progressive but she stood at par with her male counterparts in terms of her expression in poetic art and giving voice to the females, he said.\n“It was astonishing for everyone how she crossed and transcended the societal barriers and added fresh poetry into Urdu literature”, he observed.Terming the death of a great poetess as a great loss for Urdu literature Dr Rashid said that Parveen Shakir made extraordinary contributions to Urdu literature and the history of Urdu poetry will not be complete without the poetic contribution of Parveen Shakir.\nParveen was born in 1952 and started writing at a very early age with her pen name Beena.In 1977, her first poetry collection was published under the title of “Khusbu” which was much admired by Urdu literature lovers around the globe.\nHer other books include Mah-e-Tamam, Sad-Barg, Khud Kalaami, Kaf-e-Aina, and Inkar.In 1990, Parveen Shakir was awarded ‘Pride of Performance’ for her valuable contributions to Urdu literature. She was also awarded ‘Adamjee Award’ in 1976.\nParveen Shakir lost her life on December 26, 1994, at the age of 42 in a deadly car accident in Islamabad.",
  "retrievedAt": "2025-08-11T16:04:03.864Z"
}
