{
  "title": "Fawad acknowledges women’s immense contributions since Pakistan Movement",
  "link": "https://www.app.com.pk/national/fawad-acknowledges-womens-immense-contributions-since-pakistan-movement/",
  "date_published": "2020-03-07T20:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 08 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain Sunday congratulated women across the country on International Women Day and acknowledged their immense contributions from Pakistan Movement till present.\nHe was addressing a ceremony held here to welcome the delegates of United Kingdom in Pakistan for attending three International Development Workshops from March 9-12.\nThe workshops are being arranged by UK-Pakistan Science Innovation Global Network (UPSIGN), a UK based charitable network of academics and professionals in partnership with UK Research and Innovation (UKRI), COMSATS and other partners.\nSpeaking on the occasion, the federal minister said Pakistan was going to have a joint venture with United Kingdom in research. The similar group will be created in Europe and the United States.\nAround seventeen Pakistani experts working abroad will be participating in the workshop.\nMentioning Pakistan’s potential in scientific inventions, he said that experts in COMSATS had developed artificial skin while NEST had manufactured the Corona Virus Detection Kit for Rs. 1500 which was available for Rs. 10,000.\nThe federal minister said the government will give scholarships worth Rs. 12 billion this year.\nHe said Pakistan imports $ 3 billion worth of chemicals every year but now the focus would be on import of Laptops and Electronics.\nPakistan had also imported $ 2 billion worth of pulses, Fawad Chaudhry said while stressing the need to review our priorities.\nHe said the budget of the Ministry of Science and Technology had been increased by six hundred percent while the target for the next budget was 1300 percent increase.\nThe minister said electronics laboratories will be set up in the country.\nHe said many positions were vacant in the Ministry of Science and Technology and the reason was the policy of fifty years of experience and one million salary which had been changed now.\nThe ministry’s project of battery buses was delayed due to Corona Virus, he said.\nRector COMSATS , Dr. Raheel Qamar said research publications had registered a significant increase in Pakistan.\nLast year, there were 23,000 publications in Pakistan, he said.\nMany research projects will be commercialized soon after completion, he said.\nHe termed partnership between Pakistan and British universities as important for both countries.\nThe UKRI Lead Prof Nicola said United Kingdom will work with Pakistan to address the challenges facing the Sustainable Development Goals\nThousand of research projects have been completed in different countries under Global Development.\nUnder the Global Funds, the UK government has allocated £ 1.5 billion, he said.\nOver 150 distinguished academics from the UK, Pakistan as well as the region will travel to Islamabad to take part in the International workshops addressing thematic areas of regional sustainable development challenges in Food Security, Agriculture and Nutrition, Affordable Healthcare as well as Clean and Affordable Energy and Water in Pakistan.\nThe workshops will create and foster new academic relationships and develop new networks of scientists and researchers to address challenges aligned with the UN sustainable development goals (UN-SDGs).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:55:11.686Z"
}
