{
  "title": "AJK President signals negative, positive impacts of Covid-19 on environment :",
  "link": "https://www.app.com.pk/national/ajk-president-signals-negative-positive-impacts-of-covid-19-on-environment/",
  "date_published": "2021-06-09T14:46:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): , Jun 09 (APP):AJK President Sardar Masood Khan on Wednesday urged scientists, bio-scientists, doctors, and public health researchers to conduct studies on emerging zoonotic and Zoonoses diseases and the transmission of these diseases from animals to humans so that precautionary measures can be taken against these diseases and pandemics.\nHe said this while speaking as Chief Guest at an international webinar on “Impact of Covid-19 on Environment: Challenges and Opportunities” organized by the Women’s University in Bagh town of AJK on Tuesday\nThe President said that we have never seen a crisis like the Covid-19 in human history which has engulfed the whole world and not just one country or the region.\nEarlier epidemics such as Ebola and SARS did erupt in the last century but they were limited to one area and they were not as lethal as the current coronavirus is, he said.\nTerming the coronavirus as the most serious pandemic since the Spanish Flue of the last century, AJK President said that the pandemic has devastated the entire world. He said 174 million people all around the world have been infected and there have been 3.75 million fatalities all over the world.\nHe said that 935,000 people in Pakistan have been infected while more than twenty-one thousand deaths occurred due to this virus in the country. The State President said that the lethality of the virus was also very, very strong in Azad Kashmir as it infected over 19000 people and we have lost 449 precious lives.\nHe said that students and researchers of Women’s University Bagh and other universities would have to focus on this issue. Referring to speeches and lectures of other speakers and participants, Sardar Masood Khan said that the coronavirus had caused both negative and positive impacts on the environment.\n“The travel ban on land, air, and sea routes across the world in the wake of coronavirus had reduced environmental pollution to a large extent,” he said and added that there was a visible reduction in noise pollution and air pollution.\nHe, however, said that on the other hand, thousands of people had lost their lives because of this pandemic while millions of others are still physically suffering in hospitals and their homes. He maintained that coronavirus also caused a global crisis of food safety, and efforts are continuing on the global level to overcome this crisis.\nBesides, he went on to say that masks, gloves, sanitizers, and much other medical equipment which were used and thrown away since the outbreak of coronavirus, had caused a new crisis of environmental pollution. He regretted that we still lack an effective and viable system to waste these items or to safely dispose of them.\nThe webinar was addressed among others by Vice-Chancellor of the University of Bagh Prof. Dr. Abdul Hameed, Prof Dr. Mushtaq Ahmed, and Prof. Dr. Mohammad Irfan .",
  "retrievedAt": "2025-08-11T20:49:42.092Z"
}
