{
  "title": "CM Balochistan inaugurates modern Data Command & Communication Center in Police Central",
  "link": "https://www.app.com.pk/national/cm-balochistan-inaugurates-modern-data-command-communication-center-in-police-central/",
  "date_published": "2021-06-09T17:51:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jun 09 (APP): Balochistan Chief Minister Mir Jam Kamal Khan on Wednesday inaugurated latest Data Command and Communication Center at the Police Central Office in Quetta.\nAddressing at the ceremony of inaugural, the CM said provincial government was taking practical measures to enhance capacity of police in modern lines in order to curb terrorist activities from the province for maintaining durable peace.\nHe said security forces have rendered their precious lives for protection of public lives and improving law and order situation which is commendable efforts saying the province is moving towards to development due to betterment of law and order situation.\nHe said Balochistan Police would detect crimes through modern technology.\nThe Chief Minister also appreciated efforts of police for maintaining peace across the province.\nThe inaugural ceremony was attended by Provincial Ministers, Advisers, member of provincial Assembly (MPAs), Chief Secretary and Inspector General Police (IGP) Balochistan Muhammad Tahir Rai Hilal Shujaat.\nDuring the briefing, the Chief Minister was informed that the Police Command Center has been built with the latest technology, which is a revolution for the police to meet the challenges of the future, which have been set up with the Balochistan Police’s own resources. Its various systems help in the work of the police.\nThe aim of computerization of police is to maximize the professionalism to provide quality service to the public. The FIR system has been digitized. Now only the digital copy of the FIR is provided to the plaintiff and the same copy is sent to the court which will help the judicial system.\nThe records of 300,000 criminals of Balochistan have been preserved and the records of 16 million criminals of Punjab and Sindh have been preserved as part of the criminal record management of which not only districts of the province but other provinces There is a facility to provide information regarding criminals and criminals will not be able to seek refuge in other provinces.\nNow, whenever a new suspect is arrested by the police, they will be able to get all the information about the criminal activities of that criminal from the records kept within this system. This system can help control crime.\nThe police emergency 15-system has also been upgraded. Now any caller’s call data will be received at the command center.\nThe command center will badge the call to the wireless control room of the respective district and using state-of-the-art Cameron Hour drones, police will arrive in a few minutes to help the citizen.\nThe culprit did not get a chance to leave the area. The cow system will be present in all the districts of the province.\nThe completion of this mission of computerization has first of all ensured the principle of IT infrastructure in the police stations in 33 districts of Balochistan. In this regard, all the police officers have been given training on computerization.\nThe concerned official briefed to CM and said that the provinces are vast and extensive and a command and communication center has been set up here to abolish the old traditional system of surveillance police stations. Not only will public service delivery be further improved to modern requirements, but under this system, the data of criminals will be with the Balochistan Police.\nHe said that for the convenience of the public, computerized FIR registration and Complaint Management System, Police Service Center, Character Certificate and Driving License will be issued.\nHe said that modernization of crime would be possible in this system. He said that this system would have the facility of renewal of character certificate, police verification, registration of tenants and domestic workers, inter-provincial and international for the change of police station culture, the entire police station system has also been connected with this modern command center. The dashboard of the system will also be with all District SPs, DIGs and IG Police Balochistan from where all the officers will be able to monitor the police stations through their computers, said in briefing.\nIG police said that station clerks have been provided stationery and other necessary equipment so that they cannot demand any money from the people. Expenditure funds have been provided to the investigating officers of all police stations, he said now they can’t justify the unavailability of stationery. Now, if an investigating officer demands money from the public, he can complain to senior officers.\nHe said Laboratory fees will also be paid from the same fund, these measures will eliminate bribery. He said that cameras have been installed on the vehicles of Quetta police stations, same cameras will make it easier to examine different areas of the city. Cameras have also been installed at 75 key locations in the city, the command center will begin monitoring the city of Quetta before it becomes a safe city and these cameras will help reduce crime, IG concluded.",
  "retrievedAt": "2025-08-11T20:49:40.275Z"
}
