{
  "title": "Farogh reviews progress on implementation of ‘Letters of Administration, Succession Certificates’",
  "link": "https://www.app.com.pk/national/farogh-reviews-progress-on-implementation-of-letters-of-administration-succession-certificates/",
  "date_published": "2021-06-09T18:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): Federal Minister for Law and Justice Barrister Dr Muhammad Farogh Naseem Wednesday requisitioned an urgent meeting in which he was apprised about progress on implementation of Letters of Administration and Succession Certificates, Act 2020 and Civil Procedure Code.\nThe meeting was attended by the Punjab and Khyber Pakhtunkhwa Law ministers and secretaries, National Database and Registration Authority (NADRA) chairman and representatives of the Foreign Office with regard to the implementation of Letters of Administration and Succession Certificates Act, 2020. Parliamentary Secretary for Law and Justice, Barrister Maleeka Bokhari was also present in the meeting.\nNADRA Chairman Brig (R) Khalid Latif presented the latest statistics before the law minister and informed the participants of the meeting that so far 2,366 people had approached NADRA, Islamabad in relation to the issuance of Letters of Administration and Succession Certificates. 1815 were eligible to apply, 279 applications were processed, 218 applications were approved, 202 certificates applied for had been delivered, 16 were in progress and 551 applications had been declined.\nRepresentative from the Ministry of Foreign Affairs informed the law minister that in order to facilitate the applicants who had their relative abroad the foreign affairs ministry had established NADRA desks at 16 missions. 10 missions already had such desks, therefore, in total, 26 desks were operating outside Pakistan.\nBarrister Dr Muhammad Farogh Naseem was also briefed on implementation of the Code of Civil Procedure (Amendment) Act.",
  "retrievedAt": "2025-08-11T20:49:37.158Z"
}
