{
  "title": "Rs 60 bln needed to upgrade railway track to avoid accidents :Minister",
  "link": "https://www.app.com.pk/national/rs-60-bln-needed-to-upgrade-railway-track-to-avoid-accidents-minister/",
  "date_published": "2021-06-09T13:51:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 09 (APP):Railways Minister Muhammad Azam Khan Swati said on Wednesday that an amount of Rs 60 billion was required for immediate repair of railway track to avoid any accident in future.\nAddressing a press conference here at the PR headquarters, he said the recent train accident at Dharki was the second major train accident in Pakistan since 1990 due to derailment. He said that 520 km track from Kotri to Khanpur was dangerous.\nHe said the track had not been upgraded since 1971 which should have been upgraded 20 to 25 years ago, whereas, the sleepers were last changed in 2003, in which 4 to 5 per cent of sleepers were unable to bear the track and train load.’\n“I have inspected every inch of the railway track from Multan to Sukkur during the last 5 months and observed railway track in Sukkur division was dangerous and he had pointed it out many times”, he said.\nHe said the place where train accident took place was 8 km of this track, adding that in case of weak track, the speed of trains was reduced. He said that most probably, the cause of accident was derailment.\nThe minister said that facts would come to light only after the final report came out. He said that if Pakistan’s economy improved, then there was no other solution but to upgrade the infrastructure of track.\nAzam Swati said that he met the Chinese Ambassador 3 to 4 times in 5 months and requested to start ML-1 project. “We have accepted the terms and conditions of the ML-1 and even asked China to start phase-1 of the project, however the improvement of track would cost billions of rupees.\nThe Federal Minister said that one kilometer of Orange Line train was constructed at a cost of 60 million dollars and total cost was 1.6 billion dollars. Similarly, one kilometer of Multan Motorway was completed at a cost of Rs 12 to 15 million at a total cost of Rs 4 billion while Rs 55 billion was spent on land acquisition.\nHe said that such a huge amount of money had been spent for benefiting only a certain part of the city while the railways was ignored.\nGiving details of casualties, he said that 63 passengers were killed and 107 injured in the collision ofMillat and Sir Syed Express trains, out of which, 20 injured were admitted to hospitals.\nHe said the condition of 3 injured was critical. He informed that black box of both the trains had been taken into custody, adding that investigation would take three to four weeks.\nThe Railway Minister said that he was involved in relief operation and spotted small things by himself.\nHe also visited the hospitals twice and met the relatives of injured. He said that two to three passengers had become disabled who would be supported by the Ehsas programme.\nHe said that according to the prevailing rules of railways, Rs 1.5 million would be paid to relatives of each dead and Rs 50,000 to Rs 300,000 to the injured.\nHe said that he would stay in Lahore till Saturday and every day meetings with railway officials would be held to discuss issues related to railways.\nHe said that he was also looking into the matter of delay in relief train and responsible persons would not be spared at any cost.\nTo a question about the late arrival of railway officers on the site of trains accident, the Federal Minister said that an inquiry was being held and those responsible would be figured out.",
  "retrievedAt": "2025-08-11T20:49:46.476Z"
}
