{
  "title": "Islamophobic attack caused anguish among Muslims globally: Qureshi tells Canadian FM",
  "link": "https://www.app.com.pk/national/islamophobic-attack-caused-anguish-among-muslims-globally-qureshi-tells-canadian-fm/",
  "date_published": "2021-06-09T17:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 9 (APP): ​Foreign Minister Makhdoom Shah Mahmood Qureshi, in a telephonic conversation, told Canadian counterpart Marc Garneau Wednesday that Islamophobic attack was a matter of serious concern causing anguish among the Muslims worldwide.\nThe foreign minister was referring to the killing of four members of Pakistan-origin family in a vehicle attack took place on Sunday in the city of London, Ontario province.\nThis terrorism has caused anguish to Muslims worldwide. PM @ImranKhanPTI has consistently called for greater action from int’l community to address trend of Islamophobia; FM @MarcGarneau & I will work together to counter Islamophobia through coordinated efforts at int’l fora. https://t.co/Xt8vNcpWfy\n— Shah Mahmood Qureshi (@SMQureshiPTI) June 9, 2021\nHe particularly lauded strong condemnatory statement issued by Prime Minister Justin Trudeau who termed this attack as Islamophobic. He expressed hope that the perpetrator of the crime would be brought to justice.\nThe foreign minister briefed the Canadian counterpart on the efforts undertaken by the Government of Pakistan to raise awareness and to curtail the growing Islamophobic tendencies.\nHe underscored that the intentional community must show a common resolve against the rising trend of Islamophobia and promote peaceful coexistence and interfaith harmony.\nThe two foreign ministers agreed to work together on countering Islamophobia through coordinated efforts at various international fora and agreed to instruct their Permanent Representatives in New York to work together in this regard.\nBoth Foreign Ministers further agreed to remain in close contact.",
  "retrievedAt": "2025-08-11T20:49:39.960Z"
}
