{
  "title": "Two more die in Karachi, one in Hyderabad as dengue grips Sindh",
  "author": "Faiza Ilyas",
  "content": "• Death toll confirmed by health dept reaches to six\n• Over 1,400 test positive in Karachi, Hyderabad during 24 hours\n• Experts warn situation is turning critical as people fail to take the infection seriously\n• True scale of outbreak unclear as no official mechanism is in place to collect data from private health facilities\n\nKARACHI: The alarming situation over the dengue outbreak in the province, especially in Hyderabad and Karachi, persists as the provincial health department on Saturday confirmed the deaths of three more patients from the mosquito-borne viral infection, raising the (official) tally for the current year to six.\n\nAccording to the department’s data, two patients — a 30-year-old female resident of Malir and a 65-year-old male resident of district West — have died at the Sindh Infectious Diseases Hospital and Research Centre (SIDH&RC) over the past two days (Oct 30-31st).\n\nAn 18-year-old girl, resident of Latifabad, died at the Liaquat University Hospital, Hyderabad, on Saturday.\n\nIt also showed that out of the 5,000 plus tests conducted for detection of dengue fever in the province in 24 hours, a total of 1,411 patients tested positive. Of them, 618 and 793 patients tested positive in Karachi and Hyderabad, respectively.\n\nA total of 106 and 93 new patients were also admitted to the public and private hospitals, respectively, in 24 hours.\n\n“The dengue situation, especially in Karachi, is very serious. Every third patient presenting at clinics these days is being diagnosed with dengue fever,” Dr Abdul Ghafoor Shoro, senior general physician representing the Pakistan Medical Association said.\n\nComplications, he pointed out, were occurring due to self-medication and severe inadequate hydration. “Some medications, including some pain killers, can cause a low platelet count, which can lead to excessive bleeding. Second, patients must keep themselves well hydrated to avoid complications and consult a qualified general practitioner.”\n\nSources said the situation was far more serious than what’s depicted by official data and that the official figures didn’t represent the ground reality.\n\nThey pointed out that there was no official mechanism in place to get feedback from private clinics operating in every nook and corner of a locality as well as private hospitals. Many people constrained by their financial resources didn’t even opt for laboratory tests.\n\nThe sources said the Aga Khan University Hospital (AKUH) this year has so far seen six deaths from dengue, while the SIDH & RC recorded 12 deaths — including the recently reported two mortalities — with 500 admissions from the illness.\n\n“Both patients were brought in critical condition and could hardly survive for a few hours. Unfortunately, people are not taking the viral infection seriously that can turn deadly in patients experiencing internal bleeding,” a senior doctor at the hospital said, emphasising the need for disease monitoring and adequate hydration during the illness and vector-control measures.\n\nAccording to experts, most people with dengue have mild or no symptoms and will get better in one to two weeks. Symptoms may include: high fever, severe headache, pain behind the eyes, muscle and joint pains, nausea, vomiting and rash.\n\nIndividuals who are infected for the second time are at greater risk of severe dengue. The symptoms of severe dengue often come after the fever has gone away and may include: severe abdominal pain, persistent vomiting, rapid breathing, bleeding gums or nose, fatigue, restlessness and blood in vomit or stool.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/02105208a4c84f4.webp",
  "retrievedAt": "2025-11-02T19:06:45.876Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952633/two-more-die-in-karachi-one-in-hyderabad-as-dengue-grips-sindh",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T01:36:29.000Z"
}
