{
  "title": "Peshawar CTD official dead, 2 injured as explosives detonate at police station",
  "author": "Ismail Khan | Zahid Imdad",
  "content": "A Counter-Terrorism Department (CTD) official was martyred in Peshawar on Sunday morning, while two others were injured when explosives stored in a police station went off.\n\nPeshawar Capital City Police Officer (CCPO) Dr Mian Saeed Ahmad confirmed the casualties of the incident at the CTD police station in a statement.\n\n“Preliminary assessment shows that an explosion occurred due to the detonation of old explosive material stored in the police station’s ammunition room. Fire has also spread to other ammunition, causing further explosions,” the statement read.\n\nPolice and security forces cordoned off the area, as “clearance [was] going on”, the CCPO said.\n\nHe added that the Bomb Disposal Unit (BDU), along with rescue and fire brigade services, were working accordingly.\n\nCiting a preliminary assessment, the statement said, “Police sources confirm that this incident does not appear to be a terrorist attack”.\n\nIn another statement, the CCPO’s office said a special investigation team of the CTD reached the police station following the incident to collect evidence. It was reviewing the CCTV footage of nearby areas.\n\nFurthermore, statements of the cops present at the police station when the explosion occurred were also being recorded. Besides the investigation team, the CTD and the BDU also collected evidence from the site.\n\nA part of the building, including the basement, collapsed due to the explosion, police said.\n\nKP Chief Minister Sohail Afridi took notice of the incident and sought an urgent initial report on it from Inspector General (IG) Zulfiqar Hameed.\n\nHe directed that the cause of the explosion be determined and that safety measures be made more effective, according to a statement from his office.\n\nCM Afridi expressed his condolences over the martyred policeman and prayed for the speedy recovery of the injured.\n\nKP Governor Faisal Karim Kundi also conveyed his deep sorrow over the explosion and paid tribute to the official’s sacrifice in the line of duty, APP reported.\n\nHe also conveyed his best wishes for the speedy recovery of the injured police personnel, emphasising the province’s gratitude for the bravery and commitment of law enforcement agencies.\n\nIG Hameed has also sought a detailed report from the CTD Additional IG Jawwad Qamar within five days, according to a separate statement by the CCPO.\n\nThe cop who lost his life was later identified as Bilal Khan, whose funeral prayers were offered with honours at Malik Saad Shaheed Police Lines.\n\nKundi, IG Hameed, AIG Qamar, CCPO Ahmad, other police officers and security personnel attended the prayers.\n\nThe stated cause of today’s incident is similar to how the city police station in KP’s Swabi district was destroyed last year.\n\nOn Sept 26, 2024, an explosion ripped through the second floor of the city police station in Swabi, resulting in three deaths and injuries to around two dozen people.\n\nThe building of the district’s largest and central police station was completely destroyed and still awaited reconstruction a year later.\n\nOfficials said that 600 kilogrammes of explosives were kept in the police station, which caught fire, but it was not known as of last month how those explosives caught fire.\n\nFire incidents usually occur due to a combination of human negligence, faulty infrastructure, poor safety standards, and environmental factors. Peshawar has faced frequent residential and commercial fires, as well as periodic industrial infernos.\n\nIn July, four people were killed and two others were injured after a fire broke out in a house located in Peshawar’s Kochi Bazaar, rescue officials said.\n\nIn October 2024, a blaze at a tissue paper factory in the city’s Hayatabad area was doused after more than 26 hours in an operation involving 130 fighters and 31 fire tenders.\n\nIn June 2024, a fire broke out in the Nauthia Phattak area of Peshawar, destroying at least 80 shops mostly selling used goods and injuring three people.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/021130548ba91e4.webp",
  "retrievedAt": "2025-11-02T19:06:01.639Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952729/peshawar-ctd-official-dead-2-injured-as-explosives-detonate-at-police-station",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T06:40:34.000Z"
}
