{
  "title": "Former Sindh CM Aftab Shaban Mirani passes away",
  "author": "Imran Ayub",
  "content": "KARACHI: Senior Pakistan Peoples Party (PPP) leader and former chief minister of Sindh Aftab Shaban Mirani passed away on Saturday after a brief illness, his party and family said.\n\nThey stated that he had been unwell for several days and was recently discharged from a private hospital in Karachi.\n\nAccording to family sources, his funeral prayers were offered at Masjid Baitus Salam in DHA on Saturday night, and he was laid to rest at the Gizri graveyard.\n\nA large number of people, including Sindh Chief Minister Murad Ali Shah and other PPP leaders, attended his last rites.\n\nMirani, a senior politician from Shikarpur, had a long and distinguished political career spanning several decades. He was among the senior-most leaders of the PPP and was known for his close association with the late prime ministers Zulfikar Ali Bhutto and Benazir Bhutto.\n\nPresident, PM express deep sorrow over demise of seasoned PPP leader\n\nHe served as the 18th chief minister of Sindh in 1990. Later, during Benazir Bhutto’s second tenure, he held the key portfolio of defence minister of Pakistan from October 1993 to November 1996.\n\nMirani was elected multiple times to the National Assembly of Pakistan from his home constituency in Shikarpur, representing the PPP. He won seats in the general elections of 2008, 2013 and 2018, serving as a member of the NA from 2008 till 2023.\n\nOver the years, he played an active role in parliamentary affairs and was respected for his moderate views and strong party loyalty.\n\nPresident Asif Ali Zardari expressed deep sorrow over the demise of Mirani, calling him “a senior parliamentarian and a loyal leader of the PPP.”\n\nIn his condolence message, the president said that Mirani’s political wisdom and commitment to democratic values would always be remembered.\n\nPresident Zardari also prayed for the departed soul and extended heartfelt condolences to the bereaved family.\n\nPrime Minister Shehbaz Sharif also expressed grief over the passing of the senior politician, saying that the late PPP leader rendered valuable services for the country and its people.\n\n“Aftab Shaban Mirani’s political and public service contributions will be remembered with respect,” the PM said, praying for eternal peace for the departed soul and strength for his family in this difficult time.\n\nCM Shah, who visited Mirani at a private hospital last week, also expressed deep sorrow, calling his death a great loss to the province and the PPP.\n\nSindh Senior Minister Sharjeel Inam Memon also expressed deep sorrow and grief over the passing of Mirani and said that with his demise, the PPP has lost a sincere, loyal, and dedicated leader devoted to public service.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0210422056a51a6.webp",
  "retrievedAt": "2025-11-02T19:07:13.270Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952635/former-sindh-cm-aftab-shaban-mirani-passes-away",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T01:36:29.000Z"
}
