{
  "title": "IHC rules PTA’s role limited to licensing, tariffs",
  "author": "Malik Asad",
  "content": "ISLAMABAD: The Islamabad High Court (IHC) has ruled that the Competition Commission of Pakistan (CCP) — not the Pakistan Telecommunication Authority (PTA) — has the jurisdiction to investigate and act against mobile phone companies accused of anti-competitive practices.\n\nThe landmark ruling by Justice Raja Inaam Ameen Minhas settles a long-standing jurisdictional dispute between the two federal regulators and clarifies that the CCP holds statutory authority to ensure fair competition in all sectors, including telecommunications.\n\nThe judgement was issued on Saturday in a series of writ petitions filed by major mobile network operators — Jazz, Telenor, Zong and Ufone — challenging the CCP’s show-cause notices and inquiries. The companies had argued that since the telecom industry is already regulated by the PTA under the Pakistan Telecommunication (Re-organisation) Act, 1996, the CCP could not exercise parallel oversight.\n\nRejecting this argument, Justice Minhas held that the Competition Act, 2010 gives the CCP exclusive jurisdiction to regulate market competition across all sectors of the economy, without exception.\n\nCourt says CCP should act against anti-competitive practices instead\n\nHe observed that the PTA’s functions are limited to licensing, tariff approval, spectrum management, and technical regulation — not issues of market dominance or collusive behaviour.\n\n“The PTA may regulate services, licensing, and technical compliance, but it is the Competition Commission that ensures fair play and prevents abuse of market power,” the judge wrote in his detailed verdict. “The existence of a sectoral regulator does not oust the jurisdiction of the CCP in enforcing the Competition Act.”\n\nThe court emphasised that the CCP’s jurisdiction covers all undertakings — whether in telecom, banking, energy, or manufacturing — and that no special exemption exists for telecom operators. Justice Minhas described the CCP as the “federal watchdog for fair competition,” responsible for protecting consumers and markets from anti-competitive conduct, price-fixing, and cartelisation.\n\nHe also clarified that the IHC had territorial jurisdiction over the matter since both the CCP and PTA are headquartered in federal capital and the impugned proceedings originated from the CCP’s Islamabad office.\n\nDuring the hearings, the CCP argued that the telecom operators’ petitions were an attempt to evade lawful investigation into alleged market collusion and abuse of dominance.\n\nThe commission maintained that restricting such matters solely to the PTA would leave anti-competitive behaviour unchecked in the telecom sector.\n\nJustice Minhas endorsed this view, noting that “the presence of a sector-specific regulator cannot create an enclave of immunity from general competition law”. He observed that Pakistan’s legislative framework, modelled on international best practices, envisions coexistence — not exclusion — between the CCP and other regulators.\n\nConcluding the judgement, Justice Minhas reaffirmed that the CCP has the legal and constitutional mandate to regulate competitive behaviour in the telecom sector, while the PTA’s role remains confined to technical and operational regulation.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/020819352b93f81.webp",
  "retrievedAt": "2025-11-02T19:07:31.109Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952674/ihc-rules-ptas-role-limited-to-licensing-tariffs",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T01:36:04.000Z"
}
