{
  "title": "Stranded Afghans return via Torkham",
  "author": "Ibrahim Shinwari",
  "content": "KHYBER: Hundreds of exhausted but overjoyed Afghan families gathered at the Torkham border  on early Saturday morning, as the crossing reopened for their long-awaited but swift return after a 20-day closure.\n\nOfficials said that adequate arrangements had been made both at the immigration offices and at the exit-zero point to facilitate the return of stranded families, who had been impatiently waiting for the border to reopen since Oct 12.\n\nThey added that Afghan nationals holding temporary identity or registration cards, as well as those without any such documents, were allowed to return to their homeland.\n\nHowever, Afghan nationals possessing valid visas in their passports were not permitted to go beyond the Michni check post. Officials said that the focus was on first easing the burden by sending back “illegal” aliens, while legal cross-border movement would be resumed at an appropriate time.\n\nLocal sources said that the majority of the families which were stranded in Jamrud and Landi Kotal were deported from different parts of Punjab prior to the closure of the border.\n\nThe local administration had arranged temporary accommodations for returning Afghan families at the NLC terminal in Jamrud and at safe roadside locations in Landi Kotal. Most of these families had been staying inside the vehicles they had hired for their journey back, with very limited resources.\n\nIt was also learnt that the Pakistani authorities on Saturday allowed empty vehicles, which had earlier transported returning families of refugees to Afghanistan and became stranded on the Afghan side following the sudden border closure on Oct 12, to return.\n\nThe return of families continued late into Saturday, with officials stating that the process would continue in the coming days.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0207573393eec0e.webp",
  "retrievedAt": "2025-11-02T19:06:19.867Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952698/stranded-afghans-return-via-torkham",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T01:46:21.000Z"
}
