{
  "title": "Why the Taliban turned hostile",
  "author": "Muhammad Amir Rana",
  "content": "WHY have the Afghan Taliban, once viewed as Pakistan’s strategic proxies, turned hostile towards the state that sheltered and supported them?\n\nThis question is gaining traction in Pakistan’s public discourse as tensions between the two sides deepen. Analysts are seeking explanations rooted in political and strategic realities, but the roots of this shift lie deeper in the Taliban’s ideological self-conception and the tribal codes that shape their worldview.\n\nLong before the Taliban’s return to power in August 2021, some observers had predicted that the movement would swiftly discard the perception of its being Pakistan’s creation once it achieved its objective in Afghanistan. That prediction has proved accurate. The Taliban’s behaviour reflects not just political pragmatism but also an embedded sense of honour (nang or ghairat) within the framework of Pashtunwali, the traditional Pakhtun code of conduct that governs social and moral life.\n\nIn Pashtunwali, honour transcends mere pride or courage. It embodies integrity, loyalty, and the defence of autonomy. It demands that promises be kept and hospitality respected, yet it also obliges independence from external control. Loyalty, in this sense, is conditional, not permanent servitude. It must not compromise one’s dignity or sovereignty. For the Taliban, accepting Pakistan’s continued patronage after victory in Kabul would be seen as a violation of their honour, a sign of subordination incompatible with their self-image as victors and rulers.\n\nExpecting loyalty in return for hospitality is common across many South Asian and Central Asian tribal and rural societies. Yet within the same social codes, prolonged hospitality is often seen as a burden and, in some contexts, even a curse. It exposes the inner character of both host and guest, creating emotional and material strains.\n\nThe longer such relationships last, the greater the likelihood that dependency will turn into resentment. Shared resources and overlapping interests frequently become sources of dispute. This dynamic has been visible in many parts of the world where conflict has triggered mass migrations, whether among Afghan refugees in Pakistan and Iran, or the Rohingya communities in India and Bangladesh.\n\nThe Taliban have turned even more hostile towards Pakistan than previous Afghan regimes.\n\nIn tribal social norms along the Pak-Afghan border, demanding loyalty in exchange for hospitality is also viewed as a bargain, one that distorts the moral context of both loyalty and hospitality. When loyalty is demanded, it ceases to be an act of honour and becomes a transaction. In the Taliban’s understanding, the TTP are their guests and brothers-in-arms who once fought alongside them against a common enemy.\n\nFor Pakistan to now demand that they disarm, disband, or be handed over is perceived by the Taliban as a bargain that would stain their code of honour. To betray a guest or comrade under external pressure would violate the very moral fabric that sustains their tribal and ideological identity.\n\nHowever, states operate via different norms. Their honour and codes are rooted in politics and interests of varying nature, from security and economy to grand strategy. When such interests outweigh the fear of stigma, states act pragmatically, and much of the emotionalism attached to a nation’s image erodes. This is what Pakistan did with the Taliban leadership: it applied pressure from multiple directions, strikes, economic embargoes, diplomatic and political incentives, and, over time, helped craft a new domain of bargaining between the two actors.\n\nWhat happened in Doha and Istanbul was a manifestation of that shift, although the sequence of events offers only a sliver of hope for a longer-term resolution of the dispute between the two sides.\n\nOne critical element in explaining why and how the Taliban turned hostile towards Pakistan lies in religious and ideological brotherhood. This argument has been unpacked in several ways, but a central factor is the dogma and ideological architecture that underpins the movement.\n\nPakistan nurtured and supported mujahideen groups during the 1980s and 1990s, and later the Taliban, aiming to create prototypes of madressah graduates and even non-religiously educated cadres through public education channels who would think like Pakistanis and share its anti-Indian outlook. The project was strategic: to limit Indian influence in Afghanistan and to secure a friendly government on Pakistan’s western flank.\n\nThe project failed because the religious dogma embraced by the Taliban, many Pakistani madressahs, and religious elites presents a different vision of the state. They view Pakistan as a polity with weak ideological credentials that ought to be replaced by a ‘proper’ Islamic system. For that transformation, they regard political and armed struggle as necessary.\n\nThis is the argument many Taliban leaders continue to project to their audiences. The Pakistani militant groups, once engaged in Indian-held Kashmir, in Afghanistan, or used by the establishment for internal political purposes, held the same view. The jihadist literature of the 1990s was replete with the notion that once Kashmir and Afghanistan were ‘liberated’, the next turn would be Pakistan itself. Even Harkat-ul-Jihad al-Islami, one of the earliest militant groups, was involved in the failed 1995 military coup attempt aimed at toppling the government and establishing a theocratic state, one not unlike the regime the Taliban have since built in Afghanistan.\n\nFor the Taliban, who have absorbed much of Al Qaeda’s political interpretation of Islamism, loyalty is defined through their religious worldview, their tribal and social code, and the political ethics these codes nurture. They interpret alliances and support during wartime as instruments of divine providence rather than acts of friendship. Assistance from states like Pakistan is thus viewed as part of God’s plan, not a favour that demands reciprocity.\n\nThe result is that Taliban-led Afghanistan has become even more hostile towards Pakistan than previous Afghan regimes, which at least operated within globally accepted diplomatic norms.\n\nWithin this worldview, any assumption among state elements here that the Taliban would remain loyal or act subservient now seems naive. Those who nurtured these groups in the hope of creating a strategic ally failed to grasp the ideological nature of their creation. In doing so, they not only empowered religious extremism beyond control but also harmed Pakistan’s own social fabric, embedding sectarian hatred and militancy as enduring legacies of that miscalculation.\n\nThe writer is a security analyst.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/6906b44697ebf.jpg",
  "retrievedAt": "2025-11-02T19:06:25.206Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952690/why-the-taliban-turned-hostile",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T01:36:54.000Z"
}
