{
  "title": "Policy expert Mosharraf Zaidi appointed PM Shehbaz’s spokesperson for foreign media",
  "author": "Dawn.com",
  "content": "Journalist and policy expert Mosharraf Zaidi has been appointed as Prime Minister Shehbaz Sharif’s spokesperson for foreign media, it emerged on Sunday.\n\nThe notification, shared by Information Minister Attaullah Tarar on X, said that the appointment was made in “supersession of his (PM Shehbaz’s) earlier orders of even number dated [June 4] and Cabinet Division’s Circular No. 3-2/2024-Min-I, dated [June 10]”.\n\n“The prime minister is pleased to appoint Mr Mosharraf Ali Zaidi as Prime Minister’s Spokesperson for Foreign Media, with immediate effect and until further orders,” the notification read. “[The] Ministry of Information and Broadcasting and Cabinet Division are requested to take further action accordingly.”\n\nIn his post, Tarar wrote: “Welcome on board, brother. A great addition to our team. It’s been great working with you these past few months, looking forward to continue this teamwork.”\n\nSpeaking to Dawn, Zaidi said the appointment is “a privilege to serve the Pakistani people—the best people on the planet. And at a time of tremendous potential for this country!\n\n“[I] will try my best to keep pace with the work ethic, resolve and intensity of the prime minister in pursuing transformational change for our country,” he added.\n\nZaidi, who has been serving as the PM’s coordinator on government performance and innovation, graduated from Lahore University of Management Sciences with a BSc (Honours) in Economics and earned a Master of Public Administration in Policy Analysis and Non-Profit Management from Baruch College in New York, according to his LinkedIn profile.\n\nHe has also worked as a policy adviser at the foreign ministry from 2011-2013, before serving as the campaign director and CEO at Alif Ailaan from 2013-2018.\n\nZaidi founded Islamabad-based policy think tank Tabadlab in 2018, where he served as the CEO until June this year, when he worked as a senior fellow until August.\n\nAdditional reporting by Mikail Ahmed Shaikh",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/021901187c4e2b7.webp",
  "retrievedAt": "2025-11-02T19:05:21.230Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952746/policy-expert-mosharraf-zaidi-appointed-pm-shehbazs-spokesperson-for-foreign-media",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T14:31:09.000Z"
}
