{
  "title": "Dar to attend meeting of Arab-Islamic foreign ministers in Turkiye tomorrow to discuss Gaza ceasefire: FO",
  "author": "Dawn.com",
  "content": "Foreign Minister and Deputy Prime Minister Ishaq Dar will depart for Istanbul tomorrow to attend the Coordination Meeting of Arab-Islamic Foreign Ministers, where the Gaza ceasefire deal will be discussed, the Foreign Office (FO) said on Sunday.\n\n“At the invitation of the Turkish foreign minister, the Deputy Prime Minister/ Foreign Minister Senator Mohammad Ishaq Dar will undertake a one-day visit to Istanbul on November 3, 2025 to attend the Coordination Meeting of Arab-Islamic Foreign Ministers,” the FO statement said.\n\n“It may be recalled that Pakistan, along with seven other Arab-Islamic countries, has remained engaged with the peace initiative that led to the signing of the Gaza Peace Agreement in Sharm El-Sheikh,” the statement added.\n\nHamas and Israel signed a ceasefire agreement on October 9, agreeing to free the Israeli captives in exchange for Palestinian prisoners, in the first phase of United States President Donald Trump’s initiative to end the Israeli onslaught in Gaza.\n\nPakistan was one of the eight Muslim countries, along with Jordan, the United Arab Emirates, Indonesia, Turkiye, Saudi Arabia, Qatar and Egypt, that worked with Trump’s administration on the plan to end Israel’s genocide and invasion in Gaza.\n\nDespite signing the deal, Tel Aviv has resumed its attacks on Gaza. On Friday, the Israeli military attacked the Gaza Strip for a fourth consecutive day, killing three people.\n\nDuring the Istanbul meeting, Pakistan will emphasise the need for the full implementation of the ceasefire agreement and complete Israeli withdrawal from the occupied Palestinian territory, especially Gaza, as well as the provision of unfettered humanitarian assistance to the Palestinians and the reconstruction of Gaza, the FO statement said.\n\n“Pakistan will also reiterate the need for collective efforts aimed at achieving an independent, viable, and contiguous State of Palestine, with Al-Quds Al-Sharif as its capital, based on pre-1967 borders, in accordance with relevant UN resolutions and the Arab Peace Initiative,” it added.\n\nPakistan has been, and will continue to be, committed to efforts to restore peace, justice, and dignity to the Palestinian people, as well as to ensure the realisation of their right to self-determination, the statement further stated.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/021645491dc4387.webp",
  "retrievedAt": "2025-11-02T19:05:18.814Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952742/dar-to-attend-meeting-of-arab-islamic-foreign-ministers-in-turkiye-tomorrow-to-discuss-gaza-ceasefire-fo",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T11:38:35.000Z"
}
