{
  "title": "Unanswered murders",
  "author": "Editorial",
  "content": "THE International Day to End Impunity for Crimes Against Journalists arrives at a time when violence against journalists has grown deadlier and justice more elusive.\n\nAccording to the International Federation of Journalists, at least 99 journalists and media workers have been killed so far this year, mostly in Gaza, Ukraine and Sudan. The Committee to Protect Journalists notes that the persistent failure to prosecute perpetrators has emboldened those who target reporters, spreading fear and eroding the public’s right to know. Unesco, meanwhile, warns that nine out of 10 journalist murders worldwide remain unsolved, revealing how deeply impunity has taken root.\n\nThe stories behind these numbers are those of immense courage and loss: Palestinian-American reporter Shireen Abu Akleh, shot dead in 2022 while covering an Israeli raid; Mexico’s Javier Valdez Cárdenas, murdered for exposing drug-cartel links; Slovakia’s Ján Kuciak, killed for investigating corruption. Their families still wait for justice, while governments evade responsibility. CPJ observes that the pattern of impunity stretches from autocracies to democracies. This is proof that the failure to protect journalists is a global moral collapse, not a regional flaw.\n\nThis year’s global theme — ‘Chat GBV: Raising Awareness on AI-facilitated Gender-Based Violence against Women Journalists’ — captures a newer, more insidious front. Technology-facilitated gender-based violence has grown exponentially, with deepfakes, doxxing and algorithm-driven harassment used to discredit women and deter them from public life.\n\nThe anonymity of digital platforms, combined with the speed and scale of generative AI, has created a hostile environment where smear campaigns can spread worldwide within minutes and remain online indefinitely. Such abuse is not only psychological warfare but a deliberate attempt to push women out of journalism. When women journalists retreat from digital spaces, society loses voices essential to fair and diverse storytelling.\n\nThe picture is no less grim in Pakistan. Freedom Network’s impunity report for 2025 recorded a 60pc rise in attacks and legal actions against journalists between November 2024 and September 2025, documenting 142 cases nationwide. Government authorities were responsible in seven out of 10 incidents, while Islamabad and Punjab each accounted for 28pc of violations.\n\nThe Pakistan Press Foundation’s 2025 review corroborates this pattern, listing over 137 cases of threats, arrests, and assaults during the same period — including 35 physical attacks, eight arrests, and 22 cases under the Prevention of Electronic Crimes Act. Both groups warn that such actions are eroding the fragile gains once promised by Pakistan’s journalist-safety laws. Despite the early adoption of these laws, enforcement is weak and commissions largely dormant.\n\nUntil the state shows the will to investigate attacks credibly, reform Peca, and confront the online persecution of women journalists, impunity will remain the unspoken law of the land.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/02083932ccbbc64.webp",
  "retrievedAt": "2025-11-02T19:06:02.194Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952694",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T01:37:06.000Z"
}
