{
  "title": "New Zealand batting great Kane Williamson retires from T20 internationals",
  "author": "AFP",
  "content": "New Zealand batting great Kane Williamson announced his retirement from Twenty20 internationals on Sunday, saying the team needed “clarity” ahead of next year’s World Cup.\n\nWilliamson will depart the shortest format as his country’s second-highest run-scorer, tallying 2,575 runs from 93 matches, including 18 half-centuries, at an average of 33.4.\n\nHe captained New Zealand to the final of the 2021 T20 World Cup — where he scored 85 in a losing cause against Australia — and to semi-final appearances in 2016 and 2022.\n\nWilliamson relinquished the captaincy in both white ball formats when signing a “casual” contract with NZ Cricket, allowing him to pick and choose his availability.\n\nLast week the 35-year-old confirmed he would be cutting back on his international commitments to focus more time on his young family and playing in professional white ball leagues.\n\n“It’s the right time for myself and the team. It gives the team clarity for the series moving forward and ahead of their next major focus which is the T20 World Cup,” Williamson said in a statement.\n\n“There’s so much T20 talent there and the next period will be important to get cricket into these guys and get them ready for the World Cup.”\n\nWilliamson will miss the home T20 series against the West Indies starting on Wednesday and has also made himself unavailable for the subsequent ODI series.\n\nHowever, he will be available for three Tests against the tourists in December, where he will look to add to his New Zealand-record 9276 runs in the longest format.\n\nNew Zealand Cricket chief executive Scott Weenink said Williamson had earned the right to determine how he plays out the rest of his international career.\n\n“We’ve made it clear to Kane he has our full support as he reaches the back end of his illustrious career,” Weenink said.\n\n“We would, of course, love to see him play for as long as possible, but theres no doubt whenever he does decide to finally call time, he will go down as a legend of New Zealand cricket.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/02122631da70f34.webp",
  "retrievedAt": "2025-11-02T19:05:45.101Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952733/new-zealand-batting-great-kane-williamson-retires-from-t20-internationals",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T07:28:08.000Z"
}
