{
  "title": "SHO among 3 cops injured in IED blast in KP’s Hangu: police",
  "author": "Zahid Imdad",
  "content": "Three cops, including a station house officer (SHO), were injured in a blast caused by an improvised explosive device (IED) in the Doaba area of Khyber Pakhtunkhwa’s Hangu district on Sunday, police said.\n\nAbbas Majeed, the regional police officer in Kohat division, confirmed these details to Dawn, further stating that a police convoy was targeted in the IED attack.\n\nHe added that SHO Imranuddin was among the three injured policemen.\n\nSeparately, a statement issued by the Chief Minister’s Office said the provincial chief executive, Sohail Afridi, had taken notice of the incident and sought a\ndetailed report from the KP inspector general of police.\n\nHe directed that the injured policemen be provided immediate medical treatment, the statement said, adding that the CM paid tribute to the police personnel’s “courage and sense of duty”.\n\nThe CM further directed that security in the province be tightened and strictly monitor suspicious elements.\n\n“Elements involved in [such] cowardly attacks will be taken to task,” the statement quoted him as saying.\n\nToday’s incident has taken place as Pakistan continues to grapple with terrorism.\n\nA rise in terrorist activities, mainly in KP and Balochistan, was particularly witnessed after banned terror outfit Tehreek-i-Taliban Pakistan broke a ceasefire deal with the government in November 2022. Ending the agreement, the TTP had vowed to escalate attacks against the security forces, the police, and other law enforcement agencies’ personnel.\n\nIn one such incident, three cops, including a superintendent of police (SP), were martyred when back-to-back blasts rocked Hangu on October 24. According to the police, the TTP was behind those blasts as well.\n\nPreviously, on Oct 19, law enforcers had foiled an attack by terrorists at a police station in KP’s Bannu district. According to police, the failed attack was carried out by the TTP and targeted the Baka Khel police station, and three terrorists were killed as cops opened fire on them.\n\nA day prior to that, on Oct 18, unkn­own assailants had launched a rocket and gun attack on the Azam Warsak police station in South Waziristan. According to police, the attackers targeted the police station from multiple directions, but the police and the Frontier Corps personnel responded swiftly, forcing the assailants to flee. No casualties were reported in the incident.\n\nOn the night of Oct 17, police had also intercepted an explosive-laden rickshaw in the Bannu district, killing three terrorists and foiling a potential suicide attack on a police post in Mazanga in the jurisdiction of the Havaid police station.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/02181753e7a9013.webp",
  "retrievedAt": "2025-11-02T19:05:15.781Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952743/sho-among-3-cops-injured-in-ied-blast-in-kps-hangu-police",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T11:49:35.000Z"
}
