{
  "title": "JI chief criticises Sindh govt’s e-challan system, calls for improving Karachi’s infrastructure",
  "author": "Dawn.com",
  "content": "Jamaat-i-Islami emir Hafiz Naeemur Rehman on Sunday criticised the Sindh government’s e-challan initiative, calling it a “drama” meant to burden citizens instead of improving the city’s transport and road infrastructure.\n\nIn June, the Sindh government decided that e-challans for traffic violations would be delivered to vehicle owners’ registered home addresses. Vehicles with unpaid fines would not be allowed to be sold or transferred. Last month, the system was officially inaugurated, drawing a mix of praise and criticism from the public.\n\nSpeaking at an event in Karachi today, the JI chief said, “While the government was issuing challans worth Rs5,000, Rs10,000, and even Rs25,000 to Karachi’s commuters, it had failed to provide the city with a viable transport system.”\n\n“When the same challan is Rs200 in Lahore, and Rs5,000 in Karachi, isn’t the criticism on the Pakistan People’s Party valid?” he questioned.\n\nCiting World Bank reports, he said Karachi required around 15,000 buses, but the Sindh government had brought in only 400. According to the 2023 census, Karachi’s official population stood at 20.36 million.\n\n“The entire city has been forced onto motorcycles and Qingqi [rickshaws] because no large-scale transport system exists,” he said, adding that the number of motorbikes in Karachi had now exceeded five million.\n\nThe JI leader accused the PPP of “qabza siyasat” (politics of grabbing). “The party has wasted 30 to 40 years of our city and ruined generations,” he said, adding that the PPP had done nothing meaningful for Karachi in the last 15 years.\n\nNaeem also criticised the stalled and poorly executed mega projects launched in the city, including the S-III project, Karachi Circular Railway, Green Line, Red Line, and Orange Line bus services.\n\n“The KCR has been inaugurated six to eight times by different governments, but still isn’t being made,” he pointed out. “The Green Line stopped midway, and the Red Line has destroyed University Road.”\n\nPraising the efforts of JI’s local town leadership, Hafiz Naeem said the party’s leadership had started a “new journey” in nine towns despite limited resources.\n\n“We said earlier that we will work beyond our means. But the problems of sewerage, sanitation, and garbage management, which are the responsibility of the [Karachi Water and Sewerage Corporation] and Mayor Murtaza Wahab, are also being handled by JI’s town chairman and people of the union council (UC),” he said.\n\nHe highlighted that JI’s local leadership had resolved long-running sewerage issues in areas such as North Nazimabad by connecting drainage lines to Gujjar Nullah.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/021500566c7e4f7.webp",
  "retrievedAt": "2025-11-02T19:05:35.589Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952734/ji-chief-criticises-sindh-govts-e-challan-system-calls-for-improving-karachis-infrastructure",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T08:51:39.000Z"
}
