{
  "title": "Gold’s surge erodes dollar’s shine",
  "author": "Shahid Iqbal",
  "content": "KARACHI: The relentless surge in global gold prices has weakened confidence in the US dollar, long considered the world’s safest reserve currency, with analysts warning that the greenback’s dominance in the international financial system is facing its strongest challenge in decades.\n\nOver the past year, gold prices have climbed sharply from $2,700 per ounce in October 2024 to $3,997 per ounce on Oct 31 after briefly touching $4,300 earlier in the month. The rise means buyers now need about $1,300 more per ounce than a year ago — a shift that analysts say has effectively devalued the US dollar by nearly 48 per cent against gold.\n\nWhile the dollar remains central to global trade and reserves, growing scepticism among central banks and investors has led to a historic accumulation of gold holdings. “Central banks are the new miners,” said Faisal Mamsa, CEO of Tresmark, a currency tracking and research firm. “They bought 244 tonnes of gold in the first quarter alone of 2025 — about 800 tonnes annualised, nearly one-third of global mine output. Over 90pc plan to keep adding, quietly shifting reserves away from the US dollar. They’re seeking insurance against a system they no longer fully trust.”\n\nAnalysts say the move reflects growing unease over fiscal deficits, high debt levels, and persistently low real yields across advanced economies. Gold, they argue, is increasingly behaving like liquidity insurance rather than a speculative asset.\n\nCentral banks shift reserves as yellow metal devalues dollar by 48pc in a year\n\n“The world’s reserve currency looks less like a fortress and more like a glass palace,” said Mr Mamsa. “When credibility weakens, gold strengthens — it’s the oldest trade in finance.”\n\nThe pressure on the dollar has been amplified by the rise of digital currencies, faster cross-border transactions, and the gradual internationalisation of the Chinese yuan, all of which have eroded the greenback’s monopoly in global settlements.\n\nGlobal mine production, meanwhile, has failed to keep pace with demand, expanding by just 1pc annually with no major new projects in the pipeline. “Supply can’t keep up, and central banks are still buying near record pace,” said Mr Mamsa.\n\nEmerging and developing economies, however, risk being left behind in this shift. While India purchased around $12bn worth of gold in the past year, Pakistan remains absent from the buying trend, leaving its reserves vulnerable to dollar volatility.\n\nThe State Bank of Pakistan currently holds about $14.47bn in foreign exchange reserves — most of it in borrowed funds — while facing $25bn in external debt repayments in FY26, highlighting the fragility of its dollar position.\n\nMarket observers warn that a prolonged dollar depreciation could further strain economies dependent on foreign loans and imported inflation.\n\nGold’s price trajectory also follows a historical cycle of long-term surges. In the 1970s, amid high inflation, it jumped from $35 to $850 per ounce — a 2,300pc rise. Between 2001 and 2011, prices climbed from $255 to $1,920, an increase of 650pc. In the current cycle, beginning in 2018, gold has risen from $1,160 to a peak of $4,397 in October 2025 — already a 280pc gain.\n\nWith central banks continuing to diversify and supply growth stagnating, analysts expect gold to remain a key hedge against uncertainty — and a persistent reminder of the dollar’s waning lustre.\n\nPublished in Dawn, November 2nd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0210303937faeab.webp",
  "retrievedAt": "2025-11-02T19:07:02.041Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952652/golds-surge-erodes-dollars-shine",
  "dateList": "2025-11-02",
  "date_published": "2025-11-02T01:36:11.000Z"
}
