{
  "article_id": "2025-08-13_2776373bdba53c024e71314fb82e6578",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/public-crowds-mci-stalls-as-free-national-flags-distributed/",
    "retrieved_at": "2025-08-17T20:05:34.712Z"
  },
  "metadata": {
    "title": "Public crowds MCI stalls as free national flags distributed",
    "author": null,
    "date_published": "2025-08-14T00:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 443,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 13 (APP): The Metropolitan Corporation Islamabad (MCI) has set up stalls across various city centres which are offering free green crescent flags to citizens, attracting families, youth and children. According to the MCI, the flag distribution campaign aims to encourage public participation in national celebrations and promote a sense of unity. Staff at the stalls have been guiding visitors and handing out flags throughout the day, with demand increasing as the August 14 celebrations approach. The MCI has placed these stalls in major markets, parks and public gathering points, ensuring easy access for residents from different parts of the city. Many citizens have been seen taking photographs with flags and sharing them on social media, adding to the festive atmosphere in the capital. Alongside the flag distribution, cultural activities are planned to enhance the celebrations. From today, cultural dance troupes will perform at designated locations in the city. These performances, organised by MCI in collaboration with cultural organisations, will feature traditional dances representing different provinces of Pakistan. The events are scheduled in the evenings, allowing maximum public attendance. Officials from MCI said that the dance performances will not only entertain but also showcase Pakistan's cultural diversity. Venues will include popular public spaces where both locals and visitors can gather to watch the shows. Special arrangements have been made for sound, lighting, and seating to ensure smooth execution of the events. In addition to the dance performances, MCI has lined up other activities for the coming days, including art exhibitions, musical evenings, and children's competitions. These events will be held at different locations across Islamabad, aiming to create a festive environment in the run-up to Independence Day. Citizens visiting the stalls expressed their appreciation for the free flag distribution initiative. Many parents said it provided an opportunity to engage their children in national celebrations and teach them about the significance of the day. Vendors and shopkeepers near the stalls also reported an increase in foot traffic, noting that the activities were drawing more people to the area. Street hawkers selling decorations, badges, and other national-themed items have also set up shop nearby to benefit from the crowds. The MCI has urged the public to take part in the events and follow the schedule for cultural performances to avoid missing the activities in their area. The corporation has also deployed staff to manage the events and ensure public safety during gatherings. With the combination of flag distribution and cultural programmes, Islamabad is set to witness increased public participation in this year's Independence Day celebrations. The MCI's efforts aim to make the national holiday a lively and inclusive occasion for people of all ages.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}