{
  "article_id": "2025-08-13_d3ffe7ffc039add10d6714d6ee8e172f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/independence-day-to-mark-victory-in-maarka-e-haq-says-info-minister/",
    "retrieved_at": "2025-08-17T20:06:20.388Z"
  },
  "metadata": {
    "title": "Independence Day to mark victory in Maarka-e-Haq, says Info Minister",
    "author": null,
    "date_published": "2025-08-13T20:31:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 292,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 13 (APP): Federal Minister for Information and Broadcasting, Attaullah Tarar, said on Wednesday that the nation would not only celebrate Independence Day tomorrow, but also mark the victory in the Maarka-e-Haq in a befitting manner. Speaking to media representatives, he stated that this year's Independence Day would be a double celebration, following Pakistan Armed Forces' triumph over the enemy in the Maarka-e-Haq. \"Allah Almighty has blessed us with the gift of freedom,\" he said, adding that people from all walks of life-from young children to the elderly-were coming out of their homes, proudly waving the national flag. Citizens, along with their families, are enthusiastically celebrating by carrying national flags in front of Parliament House and other key landmarks. As Pakistanis, the minister emphasized, people are celebrating Independence Day beyond political differences. \"While some are talking about protests on Independence Day, the nation is focused on celebration,\" he remarked. \"These celebrations are also a clear message to India, showing how vibrant nations cherish their freedom and rejoice in their victories,\" Tarar added. He further announced that a spectacular fireworks display would be broadcast live from various cities, including Islamabad, precisely at midnight. Independence Day festivities will also include national songs, special parades, and flag-hoisting ceremonies across the country tomorrow morning. A special ceremony is also planned at Shakarparian. Congratulating the entire nation on both Independence Day and the victory in the Maarka-e-Haq, Tarar said this historic occasion symbolized Pakistan's unity, resolve, and courage. In response to a question, he said a consultative meeting of the PML-N regarding the upcoming by-elections had taken place in Murree. He noted that Senior Punjab Minister Marriyum Aurangzeb was abroad and did not attend the meeting, as one of her brothers is contesting from a constituency.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}