{
  "article_id": "2025-08-13_bf9da04ef6d16b00492ccba160355bab",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-ports-to-embrace-ai-by-august-14-maritime-minister/",
    "retrieved_at": "2025-08-17T20:06:11.675Z"
  },
  "metadata": {
    "title": "Pakistan ports to embrace AI by August 14: Maritime Minister",
    "author": null,
    "date_published": "2025-08-13T23:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 319,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 13 (APP):Federal Minister for Maritime Affairs, Muhammad Junaid Anwar Chaudhry, on Wednesday, said that significant strides are being made to modernize and streamline Pakistan's port operations through digitalization, transparency, and innovation - including the integration of Artificial Intelligence (AI) by August 14. During the question-hour in National Assembly, Chaudhry dismissed claims of inefficiency in port operations, emphasizing that Pakistan's ports are facilitators of cargo, not producers of industrial output. He said the performance of ports is directly linked to the volume of industrial activity and trade in the country. \"Despite challenges and underutilization concerns, our ports generated a record profit of Rs 109.7 billion. This speaks for itself,\" he stated. The minister announced that Pakistan's ports are being fully digitalized, and a new Artificial Intelligence-based system (AIMS) will be introduced on August 14, making the Ministry for Maritime Affairs the first federal ministry to integrate AI at the operational level. \"With the Prime Minister's policy on AI now in place, we're taking the lead to make our ports more efficient, transparent, and future-ready,\" he said. Chaudhry also shared that the Port Community System and Pakistan Single Window are being implemented to address long-standing concerns related to customs delays, leakages, and port inefficiencies. Responding to concerns over port-related thefts, the minister said his ministry is working closely with FBR and Pakistan Customs to ensure tighter controls, smoother clearance processes, and integrated policy implementation. \"We're not only receiving guidance from relevant authorities but also extending our support to them,\" he added. Regarding the bunkering system, the minister welcomed suggestions from the honorable member and confirmed that we are working on a bunkering policy that would be announced soon. The initiative aims to encourage international participation and investment in Pakistan's maritime fuel supply chain. Chaudhry reiterated his ministry's commitment to accountability and progress, expressing gratitude for the appreciation shown by parliamentarians on the improvements made over the past few months.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}