{
  "article_id": "2025-08-13_aaedc41b02fa815af28a4cfcdf2ea3e4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nlpd-hosts-national-seminar-to-mark-independence-day/",
    "retrieved_at": "2025-08-17T20:04:45.039Z"
  },
  "metadata": {
    "title": "NLPD hosts national seminar to mark Independence Day",
    "author": null,
    "date_published": "2025-08-14T06:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 473,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 13 (APP): National Language Promotion Department (NLPD) on Wednesday organized a one-day national seminar titled \"Marka-e-Haq (Bunyan Al Marsous): Urdu Literature and the Freedom Movement\" to mark Pakistan's 78th Independence Day. The event began with the recitation of the Holy Quran by Dr. Ghazal Yaqoob, while the opening remarks were delivered by NLPD Executive Director Dr. Rasheed Hameed. The seminar was presided over by eminent scholar Prof. Fateh Muhammad Malik, with Dr. Qadir Baloch and Rear Admiral (R) Faisal Shah serving as chief guests. Distinguished speakers included Dr. Humaira Ashfaq, Dr. Amjad Kallu, Amna Syed, and Anmol Fatima. In their addresses, the speakers highlighted the historical struggle for independence and the pivotal role of Urdu in uniting the nation. They stressed that such seminars instill patriotism among the younger generation, thereby strengthening Pakistan's ideological and national security. Prof. Fateh Muhammad Malik, in his presidential address, said that the recent military success had given the nation a renewed spirit. \"Pakistan's independence is the result of great sacrifices, and its protection requires unity from all of us. This country is our home, and its safety is our foremost duty,\" he emphasized. Rear Admiral (R) Faisal Shah termed the Pakistan Armed Forces' victory not just a military achievement but also a symbol of national pride, adding that the events of May 2025 had fostered exemplary unity between political and military leadership. Speaking on the cultural front, Dr. Humaira Ashfaq emphasized that Pakistan, founded on the vision of its leaders, would continue to progress. \"We must safeguard our borders with the same zeal that we apply in academic and cultural fields,\" she said. PhD scholar Amna Syed observed that Urdu poetry not only stirred emotions during the independence movement but also wove together different segments of society into a shared ideological bond. Anmol Fatima described Pakistan as a sacred trust for which \"we are willing to sacrifice our lives.\" Amjad Kallu stressed that, in the age of social media, the positive use of digital platforms could help reinforce the country's ideological boundaries. NLPD Director General Prof. Dr. Muhammad Saleem Mazhar thanked the participants and said that cultural, intellectual, and defense matters were interlinked. \"Pakistan is the only country in the world created by towering personalities like Allama Iqbal and Quaid-e-Azam Muhammad Ali Jinnah,\" he said. Calling Independence Day a time for renewal of commitment, he urged citizens to honor the sacrifices of the founders through action, unity, and sincerity. He noted that the combined efforts of the armed forces, leadership, and the nation had shattered India's image and elevated Pakistan's stature in the world. The event was attended by prominent personalities from literary, academic, and social circles, along with students and citizens in large numbers. A cake-cutting ceremony was held to mark the 78th Independence Day, and guests were presented with NLPD publications as souvenirs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}