{
  "article_id": "2025-08-13_6979f7494d8334afe0acf6f5efe44f22",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pbm-marks-independence-day-with-flag-hoisting-tree-plantation/",
    "retrieved_at": "2025-08-17T20:06:33.952Z"
  },
  "metadata": {
    "title": "PBM marks independence day with flag hoisting, tree plantation",
    "author": null,
    "date_published": "2025-08-13T21:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 244,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 13 (APP):Pakistan Bait-ul-Mal (PBM) marked Independence Day with a dignified ceremony at its Islamabad Headquarters, where Managing Director Senator Capt. Shaheen Khalid Butt hoisted the national flag, followed by a symbolic cake-cutting and Moringa tree plantation. In his address, Senator Capt. Shaheen Khalid Butt paid tribute to the heroes of the Pakistan Movement, whose sacrifices secured the nation's independence. \"Dignified and civilized nations value their freedom, and thus, it is our responsibility to safeguard our independence by promoting unity, tolerance, and national harmony to thwart the nefarious intentions of our enemies\", he said while extending heartfelt Independence Day greetings to the entire nation. Senator Capt. Shaheen Khalid Butt also appealed to include the underprivileged and deserving individuals in the celebrations, by supporting those in need within their communities. He also urged all the employees to perform their professional duties with utmost dedication and commitment, and to serve the neglected people of the country with sincerity and compassion. Captain Shaheen also paid tribute to the Armed Forces of Pakistan for protecting the integrity of the nation, achieving the historic victory against India, and earning a respected position globally. Director General PBM Prof. Dr. Zeeshan Danish also graced the event along with Director Projects Qasim Zafar, Director IT Kashif Nadeem, Director Admin Zafar Khan Safdar, Director Finance Ijaz Hussain, Director Audit Khizar Hayat, Director P & I Rizwan Ahmed? Director R & D Javed Iqbal, Dy. Director Medical Dr. Sadia and other PBM employees.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}