{
  "article_id": "2025-08-13_11f3e49939456f0046e5b73a18dcf042",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/japans-ambassador-joins-pakistan-in-independence-day-festivities-with-heartfelt-message-song/",
    "retrieved_at": "2025-08-17T20:05:49.436Z"
  },
  "metadata": {
    "title": "Japan’s ambassador joins Pakistan in Independence Day festivities with heartfelt message, song",
    "author": null,
    "date_published": "2025-08-14T00:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 182,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "Media error: Format(s) not supported or source(s) not found ISLAMABAD, August 13 (APP): Japan's Ambassador to Pakistan, Akamatsu Shuichi, has extended warm greetings to the government and people of Pakistan on the country's 78th Independence Day, reaffirming Tokyo's commitment to a strong and prosperous bilateral partnership. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/08/pj.mp4Media error: Format(s) not supported or source(s) not foundDownload File: https://www.app.com.pk/wp-content/uploads/2025/08/pj.mp4?_=100:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume. He, in a video message in connection with August 14 celebrations, Ambassador Akamatsu said, \"My dear Pakistani friends, heartiest congratulations to all of you on Pakistan's Independence Day. Japan stands side by side with you for a strong and prosperous Pakistan. Happy Independence Day to all of you. Long Live Japan-Pakistan Friendship.\" To mark the occasion, Japanese and Pakistani staff at the Embassy of Japan in Islamabad came together to sing the iconic national song \"Jeevay Jeevay Pakistan,\" symbolizing unity, joy, and the enduring friendship between the two nations. The gesture added a cultural and personal touch to the diplomatic celebrations, reflecting the depth of people-to-people ties that continue to strengthen relations between Japan and Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}