{
  "article_id": "2025-08-13_f41f1cbbc0e63d32b3437869fe21459b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/chinese-consul-general-calls-on-acting-governor-punjab/",
    "retrieved_at": "2025-08-17T20:04:45.172Z"
  },
  "metadata": {
    "title": "Chinese Consul General calls on Acting Governor Punjab",
    "author": null,
    "date_published": "2025-08-14T06:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 273,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Aug 13 (APP): The People's Republic of China Consul General to Lahore Zhao Shiren called on Acting Governor Punjab Malik Muhammad Ahmed Khan and discussed Pak-China relations, CPEC projects and ways to enhance cooperation in new areas during a meeting at the Governor's House, here on Wednesday. Exchange of parliamentary delegations between the two countries also came under discussion during the meeting. Acting Governor Punjab Malik Muhammad Ahmed Khan, who is also the Speaker of the provincial assembly, said that Pak-China relations are deep-rooted and based on mutual respect, trust and love. He said that China has always stood by Pakistan in every difficult moment. The Acting Governor Punjab said that he values China's cooperation in the development of Pakistan, adding that CPEC is the key not only to the development of Pakistan but also to the prosperity of the region. Malik Muhammad Ahmed Khan said that the Pakistan-China Economic Corridor project has brought development and prosperity to Pakistan. He said that the government has accelerated the pace of work on CPEC projects. The Acting Governor further said that people-to-people contacts between Pakistan and China are also strong. Chinese Consul General Zhao Shiren said that the People's Republic of China attaches great importance to its friendship with Pakistan. He said that cooperation and partnership in the fields of education, agriculture, poverty alleviation, and health will be enhanced with Pakistan. The diplomat said that cooperation between universities of Pakistan and China in agricultural research will be enhanced. The Chinese Consul General also invited the Acting Governor as a special guest on the occasion of the National Day of the People's Republic of China.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}