{
  "article_id": "2025-08-13_904dbd6cffc00c6a0329f0aa6ebfa64e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-for-boosting-economic-connectivity-links-with-azerbaijan/",
    "retrieved_at": "2025-08-17T20:06:42.710Z"
  },
  "metadata": {
    "title": "President for boosting economic, connectivity links with Azerbaijan",
    "author": null,
    "date_published": "2025-08-13T20:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 231,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 13 (APP):President Asif Ali Zardari on Wednesday reaffirmed Pakistan's firm resolve to further deepen its brotherly ties with Azerbaijan, built on mutual trust, shared values, and common aspirations. The president made these remarks during his meeting with the Ambassador of Azerbaijan to Pakistan, Khazar Farhadov, who called on him at Aiwan-e-Sadr, a Presidency's news release said. President Zardari said Pakistan views Azerbaijan as a key partner and seeks to expand bilateral cooperation, particularly in the areas of trade, economy, and connectivity. The president underscored that enhanced trade links, investment partnerships, and improved regional connectivity would bring the two countries closer and contribute to shared prosperity. President Zardari congratulated the Ambassador on the historic peace agreement with Armenia and asked him to convey his felicitations to President Ilham Aliyev and the people of Azerbaijan. He said the agreement would usher in lasting peace, stability, and prosperity for the region. He stated that Pakistan believes in resolving issues and conflicts through dialogue and peaceful means, based on mutual understanding and respect. He welcomed the operationalization of direct air links between the two countries, calling it a step that has opened new avenues for trade, tourism, and people-to-people contacts. The president also thanked Azerbaijan for its steadfast support for the just cause of the people of Indian Illegally Occupied Jammu and Kashmir, particularly as a valued member of the OIC Contact Group.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}