{
  "article_id": "2025-08-13_622b6fb864b46db1386ffe7c154be1ea",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-celebrates-pakistans-78th-independence-day/",
    "retrieved_at": "2025-08-17T20:05:09.349Z"
  },
  "metadata": {
    "title": "ISSI celebrates Pakistan’s 78th Independence Day",
    "author": null,
    "date_published": "2025-08-14T05:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 246,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 13 (APP):The Institute of Strategic Studies Islamabad on Wednesday (ISSI) marked Pakistan's 78th Independence Day with a celebratory event to pay homage to the vision and courage of the founding fathers and to honour the nation's rich history, indomitable spirit, and unshakeable resolve. Speaking on the occasion, DG ISSI ambassador Sohail Mahmood extended heartfelt felicitations to everyone on this joyous occasion. He said Independence Day was always a moment to reflect on the sacrifices rendered by the founding generations for Pakistan's creation; to reaffirm our commitment to the principles of unity, faith, and discipline; and to reiterate our resolve to fully realize the Quaid's vision for Pakistan's progress and prosperity. Ambassador Sohail noted that Pakistan has time and again demonstrated its resilience in the face of daunting challenges, drawing strength from its people's determination, enterprise, and unrelenting efforts for a brighter future. He stated that these qualities have enabled the nation to emerge stronger through every test. Pakistan's success in the recent Marka-e-Haq was a compelling testimony to this reality. He also especially lauded the role of Pakistan's youth, which was to shoulder the responsibility in the future to carry forward the Quaid's mission. As part of the celebrations, ISSI's research Interns presented short documentaries creatively showcasing Pakistan's history, culture, and achievements across various fields. The presentations offered a vivid portrayal of the country's resilience, diversity, and rich heritage, and were warmly received by the participants. The event concluded with a special cake-cutting ceremony.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}