{
  "title": "Anti-Pakistan lobby wants to start hybrid war: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/anti-pakistan-lobby-wants-to-start-hybrid-war-sheikh-rashid/",
  "date_published": "2021-07-20T16:55:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 20 (APP): Minister for Interior Sheikh Rashid Ahmed on Tuesday said that anti-Pakistan lobby including India and Israel wanted to start hybrid war in the country but they would fail in their nefarious designs.\nAddressing a press conference here, the Minister said anti Pakistan elements were hatching conspiracies to create misunderstanding between Pakistan and China and create law and in order situation.\nHe said it would be better if daughter of Afghanistan’s ambassador became part of the investigation. The government would thoroughly investigate abduction issue, he added.\nHe said some international powers did not want Pak-China friendship and perpetrated actions such as the Dasu incident.\nThe Dasu incident took place right before the Joint Coordination Committee meeting of CPEC and the incident involving Afghan envoy’s daughter took place just days before the Afghan peace conference, he said.\nHe Prime Minister Imran Khan has directed IGs and security agencies to closely monitor the security situation in the country.\nHe said the footage pertaining to the ambassador’s daughter case had been sent to the Foreign Office and now it was their responsibility to inform Afghan diplomats about the situation.\nThe fourth taxi driver involved in the investigation had also been traced, he added.\nThe minister said none of the taxi drivers involved in the investigation had a past criminal record that indicated their involvement in the abduction.\nThe minister said the government planned to make the diplomatic enclave a special security zone after Eid holidays.\nTo a question about the situation in Afghanistan, he said it was the neighboring country’s internal matter and Pakistan would accept whatever the Afghans decide.",
  "retrievedAt": "2025-08-11T20:59:19.741Z"
}
