{
  "title": "Govt issues Eid-ul-Adha health guidelines to prevent Coronavirus",
  "link": "https://www.app.com.pk/national/govt-issues-eid-ul-adha-health-guidelines-to-prevent-coronavirus/",
  "date_published": "2021-07-20T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP): The government has issued Eid-ul-Adha health guidelines for the general public, the buyers and sellers of animals for adopting preventive measures during slaughtering of animals, and Eid prayers to mitigate the spread of COVID-19.\nAs per the guidelines issued by the Ministry of National Health Services, Regulations and Coordination here Tuesday, strict preventive measures should be adopted for Eid prayers at Eidgahs and citizens should perform ablution in their homes.\nThere should be separate entrances and exits in a one-way system to prevent bottlenecks besides ensuring thermal screening for all worshipers at entry points of the edge. The availability of hand sanitizer at the entrances and exits should be ensured, making it mandatory for all people to use it before entering and on exiting.\nThe guidelines insisted that every person should wear a face or surgical mask properly to cover nose and mouth and mark out prayer spaces clearly using measuring instruments to make social distancing of three feet easy to follow.\nThe worshipers have been asked to bring their own prayer mat or Janamaz as no carpets or mats to be laid down in mosques.\nThe Imams have been asked to ensure the short duration of pre prayer sermons and post prayers khutbah should be delivered on the topic of the pandemic and preventative measures that the Government of Pakistan has taken in order to slow the spread to give individuals an active role in promoting health and safety of the members of society.\nSimilarly, clean floors for prayers must be ensured by washing them with chlorinated water regularly while water coolers should not to be used and Mosques must close no later than 10 minutes after the prayer ends.\nThe Ministry, through these guidelines, said that close physical contact, holding and shaking hands and hugging pose a great risk of disease transmission must be avoided. It said that the windows and doors of the mosques should be kept open for good ventilation during the duration of the prayer.\nThe Ministry also asked to avoid crowding when entering or exiting the mosques. It directed to discourage the sick, elderly and children under 15 years of age from attending prayers and discourage socializing within the mosques after prayer.\nThe Ministry said that the preventive measures should also be followed during slaughtering activity like the site of slaughtering should be away from the general public and living areas and crowding at slaughtering should be avoided, however only those who are necessary may be allowed at the site.\nIt asked to avoid touching eyes, nose or mouth, especially when hands are not clean and urged to use gloves and masks during slaughter and handling of meat. It added personal protection equipment (PPE) provides a barrier to protect the person from potential exposure to hazards.\nIt also directed to wash visibly soiled hands with soap and water and if soap and water are not available, rub hands for 20-30 seconds with an alcohol-based hand sanitizer that contains 60-80 percent alcohol.",
  "retrievedAt": "2025-08-11T20:59:19.570Z"
}
