{
  "title": "Interior Minister Mohsin Naqvi chairs meeting on the repatriation of Afghan Citizen Card holders",
  "author": null,
  "content": "ISLAMABAD, Mar 28 (APP):Federal Interior Minister Mohsin Naqvi chaired a high-level meeting to review the repatriation process of Afghan Citizen Card holders.\nThe Illegal Foreigners Repatriation Program (IFRP) has been in effect since November 2023, and in its second phase. Afghan Citizen Card holders have been given a deadline of March 31 to voluntarily leave Pakistan.\nInterior Minister stated that continuous coordination is being maintained between the federal and provincial governments regarding the repatriation process, and the federal government will provide full support to the provinces. Additionally, a committee has been formed based on the recommendations of the Chief Minister of Khyber Pakhtunkhwa.\nMinister of State for Interior Tallal Chaudhry will visit the provinces to resolve any issues arising during the repatriation process. Mohsin Naqvi also directed authorities to ensure respectful treatment of foreign nationals.\nThe meeting was attended by Minister of State for Interior Tallal Chaudhry, the Federal Secretary for Interior, the Secretary for Kashmir Affairs & SAFRON, Chief Secretaries and Inspectors General (IGs) of all provinces, the Director General of FIA, the IG of Islamabad Police, the Deputy Commissioner of Islamabad, the Coordinator of the National Action Plan, and representatives from the Ministry of Foreign Affairs, the Ministry of Law, and security agencies.\nDuring the briefing, it was informed that all arrangements for the repatriation of Afghan Citizen Card holders have been completed. A door-to-door awareness campaign is underway, and the mapping of Afghan Citizen Card holders has been finalized. Furthermore, holding centers, food provisions, and healthcare facilities have also been arranged for those returning.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:04:35.869Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/interior-minister-mohsin-naqvi-chairs-meeting-on-the-repatriation-of-afghan-citizen-card-holders/",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T15:28:00.000Z"
}
