{
  "title": "25 to 30 int’l standard hotels to be ready in two years: Zulfi Bukhari",
  "link": "https://www.app.com.pk/national/25-to-30-intl-standard-hotels-to-be-ready-in-two-years-zulfi-bukhari/",
  "date_published": "2021-03-07T14:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Chairman of National Tourism Coordination Board (NTCB) Sayed Zulfikar Abbas Bukhari on Sunday said the country would get 25 to 30, five stars international standard hotels and motels during the next two to three years.\nIt would help provide the best hospitality and boost tourism sector in the country, he said who also holds the office of Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development.\nAddressing at a day-long “Pakistan Tourism Forum” organized by Cutting Edge Group in collaboration with NTCB, he said tourism is a priority of the present government and a renewed focus has been placed to promote the sector as Pakistan has been declared a top tourist destination.\nZulfi said the government would soon launch ‘Brand Pakistan’ to promote the tourism industry as a customized brand. “An e-portal to inform tourists about the hotels’ ratings, weather, traffic and other information regarding tourist destinations\nin the country had also been prepared”.\nHe said, “We have formulated a National Tourism Strategy from 2020 to 2030 and with that we have also introduced a five-year action plan (2020-25)”.\nZulfikar Bukhari said the tourism sector remained a neglected industry and there was lack of modernization and usage of Information and communications technology ICT which were unsuitable for fast-paced development.\n“The government has restructured the Pakistan Tourism Development Corporation (PTDC)\naccording to its new role as a coordination body and to shift its model from an operator to a policy maker and regulator,” he remarked.\nHe said tech savvy and young workforce would be engaged to lead tourism development in the country.\nBukhari said tourism authorities have been developed in Punjab and Khayber Pakhtunkhwa. He said integrated tourism zones were also being developed through master planning for systematic development of tourism destinations.\nThe government has planned to give leading role to the private sector to utilize corporate’s efficiencies and expertise, he added.\nIn this regard the PTDC hotels/motels in Azad Jammu and Kashmir and Gilgit Baltistan (GB) were being leased out to private sector, he added. Similarly properties located in provinces would also be leased out by the respective provincial governments.\n“Punjab Museum Act was being finalized to steer the development of museums and around eight museums has been given under the control to Punjab Museum Authority” he said.\nSpecial Assistant to the Prime Minister said the government has working to transform the Taxila and Lahore museums on modern lines and made them state of the art museums.\nThe SAPM said Pakistan facilitated e-visa and would soon launch a visa App\ne-portal which would contain all booking details regarding motels and other tourism information. He said the tourism portal in Pakistan would be launched later this year.\n“The government has working to establish the infrastructure and provide every missing facilities in the tourism sector with aim to generate multiple jobs through effective promotion of tourism in Pakistan and across the globe” he added.\nThe tourism had been a devolved subject so strong coordination among the provinces was imperative to boost the sector, he added.\nHe said “Better hotels, transportation, infrastructure, good roads, food industry, improved recreation facilities and security contribute vitally for attracting tourists”.",
  "retrievedAt": "2025-08-11T20:27:16.879Z"
}
