{
  "title": "Asad voices for protection of woman’s rights",
  "link": "https://www.app.com.pk/national/asad-voices-for-protection-of-womans-rights/",
  "date_published": "2021-03-07T16:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP):Speaker National Assembly Asad Qaiser and Deputy Speaker Qasim Khan Suri said that protection of the rights of women was imperative for the formation of a progressive society.\nThey expressed these views in their message on the occasion of International Women’s Day being commemorated on March 8 across the world.\nThe Speaker said that protection of women’s rights is essential for the formation of a progressive society, which is the top priority of the incumbent government. Highlighting the positive role of women for the development of the society, the Speaker said that women needed to be brought forward and encouraged through providing them a safe environment.\nHe said the international community should make joint efforts to protect women’s rights and take practical steps to legislate on the issue of discrimination and violence against women around the world.\nThe Speaker said that Islam gives equal rights and respect to women and strictly prohibits gender discrimination. “Through mutual partnership, women can be given their rightful place in society by changing negative attitudes and attitudes towards women’s rights and bringing them into the national mainstream,” he said.\nHe said that in order to empower women financially, women need to be brought forward and encouraged in the economic spheres. “We intend to make Pakistan a place where women have the opportunity to participate in all walks of life with dignity and self-confidence,” he said.\nSpeaker Asad Qaiser said that COVID-19 pandemic had effected the entire world population but it had been more devastating for disabled women. He said that it was right time to join hands for forging common strategy to achieve a common future in a modern world.\nPaying tribute to the disabled women, Speaker Asad Qaiser said that “Differently disabled women face a double challenge because they face the challenges of society along with their disabilities”.\nOn this occasion, the Deputy Speaker Qasim Khan Suri said that more than half of the population of Pakistan is women and the provision conducive environment and protection of their rights was necessary for national development.\nHe said that the Constitution of Pakistan guarantees women fundamental rights and financial security, job, business, education and freedom of choice in their profession, participation in political and social activities. He extended his all out support for achieving the desired objectives in this regard.",
  "retrievedAt": "2025-08-11T20:27:15.805Z"
}
