{
  "title": "Aviation sector gets 60.8% of funds allocated under PSDP for 15 projects",
  "link": "https://www.app.com.pk/national/aviation-sector-gets-60-8-of-funds-allocated-under-psdp-for-15-projects/",
  "date_published": "2021-03-07T08:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP): The government has so far released around 60.8 percent funds against the total allocation of Rs1, 320.879 million to execute 15 aviation sector projects under the Public Sector Development Programme (PSDP 2020-21).\nAccording to the official data as of February 26, an amount of Rs566.223 million has been released for the timely and smooth execution of the projects during the last eight months.\nAs per the PSDP details, an amount of Rs 61.923 million had been earmarked for construction of double storey ladies hostel/barrack with provision of third storey along with mess, recreation hall and allied facilities at Allama Iqbal International Airport Lahore.\nSimilarly, Rs 90 million were meant for construction of double storey barrack with provision of third storey for corporal to inspectors and assistant director along with separate mess, and allied facilities recreation hall at Quetta airport.\nFunds amounting to Rs 50 million and Rs 69.756 million had been reserved for construction of Airport Security Force (ASF) Camp at Islamabad International Airport and building barrack accommodation for ASF personnel along with mess and allied facilities respectively.\nWhile, Rs 20 million had been kept for construction of barrack accommodation for ASF personnel along with mess and allied facilities at Chitral airport, Rs 65 million for construction of double storey barracks for ASF at Faisalabad Airport, Rs 21.280 million for construction of double storey Director South Secretariat offices ASF along with allied facilities adjacent to HQs ASF Karachi, Rs 100 million for construction of rain water harvesting Kasana Dam, Rs 63.553 million to construct triple storey living accommodation for ASF personnel at Lahore Airport and Rs 99.367 million for construction of triple storey living barrack for ASF personnel along with mess, recreation hall at Multan airport.\nAn amount of Rs 55 million had been allocated for installation of Weather Surveillance Radar at Karachi, whereas Rs 55 million would be utilized for installation of Weather Surveillance Radar at Multan, Rs 519 million for New Gwadar International Airport (NGIA) project, Rs 41 million for Reverse Linkage Project Between Pakistan Meteorological Department and Marmara Research Centre, Turkey and Rs10 million for up-gradation of ASF Academy, Karachi.",
  "retrievedAt": "2025-08-11T20:27:20.371Z"
}
