{
  "title": "Key to success in Balochistan is its people identifying terrorists themselves: DG ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry has said that a military operation in an area can only be successful when the people living there themselves identify the terrorists, according to a statement issued by the military’s media wing on Saturday.\n\nThe security situation in Balochistan has worsened in recent months, as militants, long involved in a low-level insurgency, have stepped up the frequency and intensity of their attacks. In February, nearly 62 per cent of the total terrorism-related deaths in the country occurred in Balochistan.\n\n“An operation in any area is successful when the people themselves identify the terrorists,” Lt Gen Chaudhry was quoted as having said.\n\nThe DG ISPR was speaking at a session with students in the ongoing internship programme organised by the military’s media wing.\n\nDuring the session, there was a lively discussion regarding Pakistan, especially Balochistan, the statement said, adding that Lt Gen Chaudhry also gave detailed answers to the questions of students from Balochistan.\n\nOn the demand for a major operation against terrorism in Balochistan, the DG ISPR said: “It is put in our minds that something is festering for Pakistan among the people and youth of Balochistan.”\n\nThe people of Balochistan understand the relationship between Pakistan and the province very well, he said, adding that the people of Balochistan are also now frustrated and fed up with these terrorists.\n\nHe called on the participants “to go to Balochistan and see how sensible and far-sighted the Baloch people are.”\n\n“Hundreds of examples have emerged that Baloch children who have studied have become the masters of their region and their destiny,” the DG ISPR said.\n\nHe quoted the example of scientist Dr Yarjan Abdul Samad, who hails from Balochistan and completed his schooling in the province, later going to graduate from the University of Cambridge.\n\nHe also gave the example of Karate champion Shahzaib Rind, adding that women from Balochistan are currently appointed as deputy commissioners in districts.\n\n“The martyred Major Muhammad Anwar Kakar was a very brilliant officer and a great son of this land,” he continued.\n\nHe added that Major Muhammad Anwar Kakar had earlier also killed many terrorists in the Gwadar PC Hotel attack.\n\nLt Gen Chaudhry said it is not that the army vacates an area, conducts an operation, as when the army leaves, the terrorists will come again.\n\n“We have to do everything with great understanding, that is why it is called an intelligence-based operation,” he said.\n\n“The army has no interest in taking the lives of innocent people in the name of terrorism,” he continued.\n\n“If any citizen shelters terrorists or keeps explosives in his house, they will have to face the consequences.”\n\n“We have to work together with the people and administration of Balochistan,” he said, highlighting that an entire region or village cannot be punished for the act of one individual.\n\n“The people there have to stand up and are standing up against terrorism,” the DG ISPR concluded.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T02:40:28.656Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931260/key-to-success-in-balochistan-is-its-people-identifying-terrorists-themselves-dg-ispr",
  "dateList": "2025-08-16",
  "date_published": "2025-08-16T10:09:21.000Z"
}
