{
  "title": "PM launches Chinese-backed special economic zone - Newspaper - DAWN.COM",
  "author": null,
  "content": "• $100 million project is expected to generate $400m in exports\n• Premier seeks to strengthen bilateral ties with Bangladesh\n• Orders swift completion of delayed IT park\n\nISLAMABAD: Prime Min­ister Shehbaz Sharif on Friday laun­ched a Chinese-led Spe­cial Eco­n­omic Zone expected to draw $100 million in investment over five years and generate $400 million in exports, and he also met the Bang­la­d­e­shi high commissioner to push for stronger bilateral ties.\n\nThe zone will be established by the Chinese garments group “Cha­­llenge Fa­­shion Private Lim­ited” that has already invested $17 million in Pakistan since 2014.\n\nMeeting with a company delegation led by Chairman Huwang Weiguo, PM Shehbaz welcomed the new zone, saying it would facilitate technology transfer, skill development, and sustainable industrial growth.\n\nHe directed officials to provide all possible facilities to the business company, reiterating his government’s commitment to the industrial co­­m­ponent of the China-Pakis­tan Eco­no­mic Corridor and to “benefiting from China’s progress and expertise in the textile sector”.\n\nHighlighting the “time-tes­ted” relationship between the nations, PM Shehbaz said his government desired to take bilateral ties to new heights.\n\nHe told the delegation that a China-Pakistan Business-to-Business Confer­ence would soon be held in China to foster collaboration.\n\nHe said that Pakistan desi­red the Chinese industries to establish their units in Paki­s­tan and also appreciated the confidence of Chal­lenge Fas­hion Group in the Pakistani market.\n\nMr Huwang, thanking the prime minister for the hospitality in Pakistan, confirmed the company’s investment and export targets for the new zone.\n\nThe meeting was attended by federal ministers Ahsan Iq­­bal, Jam Kamal, Attaullah Ta­­rar, Ali Pervez Malik, and Sar­dar Awais Ahmad Legh­ari, Spe­cial Assistant to the Prime Minister Tariq Fatemi, and other senior government official.\n\nMeets Bangladeshi HC\n\nIn a separate meeting, PM Shehbaz focused on regional diplomacy, calling for stro­nger political and economic relations with Bangladesh.\n\nDuring a courtesy call from Bangladesh’s High Commis­sioner (HC) Md Iqbal Hussain Khan, the prime minister reiterated Pakistan’s desire to enhance trade and people-to-people contacts.\n\nThe prime minister expr­es­sed satisfaction over growing engagement between the two countries and recalled his “warm and productive” interactions with Chief Advisor of Bangladesh Dr Mohammad Yunus.\n\nThe high commissioner briefed the premier on steps being taken to facilitate tra­vel and trade and expressed his desire to continue “strengthening of the historic bonds of friendship between Pakistan and Bangladesh”.\n\nThe PM wished the commissioner success, assured him of full support, and expr­essed confidence in positive developments in Pakistan-Bangladesh relations.\n\nTalks with ministers\n\nPrime Minister Shehbaz Sharif was briefed on various government sectors in meetings on Friday with three of his ministers.\n\nMinister for Power Division Sardar Awais Ahmed Khan Leghari, met with the prime minister to discuss issues related to the power sector.\n\nThe discussion also tou­ch­­ed upon the broader political landscape, according to a stat­ement from the Prime Minister’s Office.\n\nIn a separate meeting, Minister for Petroleum Ali Pervaiz Malik addressed matters of mutual interest with the prime minister.\n\nDetailed reviews concerning the Petro­leum Division were conduc­ted during their discussions.\n\nAdditionally, Hanif Abba­­si, Minister for Railways, also called on the premier to talk over railway division matters, emphasising ongoing and future projects.\n\nDelayed IT Park project\n\nEarlier on Independence Day, the prime minister visited the under-construction Tech­nology Park in Islam­abad, exp­ressing “strong displeasure” over the slow pace of work.\n\nDuring what was his third inspection of the project, PM Shehbaz reprimanded officials and directed them to accelerate the park’s completion, which was originally scheduled for March 23, a statement from PM office said.\n\n“Ensure the provision of world-class facilities and double your efforts to finish this project as per the original instructions,” the prime minister told project managers.\n\nPublished in Dawn, August 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689fbb1d95841.jpg",
  "retrievedAt": "2025-08-18T02:40:51.036Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931205/pm-launches-chinese-backed-special-economic-zone#:~:text=Meets%20Bangladeshi%20HC",
  "dateList": "2025-08-16",
  "date_published": "2025-08-16T02:12:44.000Z"
}
