{
  "title": "Floods threaten Charsadda and Nowshera, CM aide tells KP assembly - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Adviser to the Khyber Pakhtunkhwa chief minister on housing Dr Amjad Ali on Friday urged authorities in Charsadda and Nowshera districts to take necessary measures to prevent damage to public life and property due to flash floods.\n\nDuring a provincial assembly’s session presided over by Deputy Speaker Suriya Bibi here, Dr Ali said that floods in Malakand and Hazara divisions claimed several lives and destroyed buildings.\n\nHe said that the chief minister would be approached with a request for declaring emergency in both divisions to help out the calamity-hit residents.\n\nThe aide to the CM warned that floodwaters would soon reach Charsadda and Nowshera. He asked authorities to take all necessary steps to prevent loss of public life and property to the natural disaster.\n\nDr Amjad Ali calls for measures to prevent damage to public life, property\n\nSpecial assistant of the chief minister for population Liaquat Ali Khan claimed that when Pakistan Tehreek-i-Insaf founder Imran Khan was the prime minister, neither the province faced any law and order situation nor did any resident receive extortion phone calls.\n\nHe said that the people demanded early yet effective resolution of their problem.\n\nMr Khan said the terrorists, who were resettled in the province, should be sent back to Afghanistan.\n\nHe sarcastically said that in the past, the PPP and PML-N leaders “fell ill” within days of detention,but PTI founder Imran Khan has not reported any such complaint in the last two years of imprisonment.\n\nThe chief minister’s special assistant said that former PTI MNA and Senator-elect Murad Saeed was named in several cases just for raising his voice for peace.\n\nHe said that the opposition parties jointly got the Mines and Mineral Bill passed in the BalochistanAssembly but were resisting a similar proposed law in KP.\n\nMr Khan said that Chief Minister Ali Amin Gandapur would never allow the passage of that bill in the provincial assembly.\n\nHe accused the opposition members of committing corruption, triggering heated exchanges.\n\nEarlier, during the question hour, member of the opposition PPP Ahmad Karim Kundi said that he had inquired about the number of “regularised surplus employees” in the culture and tourism department and the reply submitted to the house didn’t satisfy him.\n\nHe said that since vacancies in government departments would be advertised and recruitment would be made, those recently terminated by the provincial government should be preferred for those posts.\n\nHowever, law minister Aftab Alam Afridi said that the KP Culture and Tourism Authority was established in 2020.\n\nHe said that since it was a policy matter, the adviser to the chief minister on tourism would brief the opposition lawmaker on it in detail.\n\nMr Kundi said he would be satisfied only if the sacked employees were recruited against those vacant posts.\n\nMinister Mr Afridi said that the government departments should not become limited companies.\n\nHe said that the opposition leadership in the Centre had “overburdened” several departments, leading to their collapse. The chair later referred the question to the relevant house committee for discussion and recommendations.\n\nMember of the opposition JUI-F Adnan Khan said that he, too, was not satisfied with the department’s answer about the “scale and time period for upgradation of an initially recruited police constable.”\n\nHe said that in the upgradation summary laid before the chief minister, the total salary of the initially recruited constable was Rs69,127 compared to Rs73,000 for a constable in Punjab and that it was misleading as according to the salary slip of a fresh recruited constable, he received 43,000.\n\nMr Khan said that there were differences in the risk allowances for different grades as BPS-7 constable received around Rs4,000, BPS-9 head constable around Rs3,210 and BPS-11 assistant sub-inspector around Rs2,100.\n\nHe said that the police rendered sacrifices but had yet to receive a pay raise. He requested the chair to refer his question to the relevant house committee for further deliberation and recommendations.\n\nMinister Afridi said that the government had no objection to the referring of the question to the relevant committee.\n\nMinister for local government Arshad Ayub tabled the KP Local Government Amendment Bill, 2025, saying the proposed change is in connection with the authority of the mayors and chairmen. He added that the law was being amended on the recommendations of the local government association.\n\nMinister Afridi laid the KP Tourism Amendment Bill, 2025, and the KP Press Newspapers, News Agencies and Books Registration Bill, 2025, in the house. The chair later put off the session until August 22 due to a lack of quorum.\n\nPublished in Dawn, August 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/16075116b74d16a.png",
  "retrievedAt": "2025-08-18T02:41:03.951Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931136/floods-threaten-charsadda-and-nowshera-cm-aide-tells-kp-assembly",
  "dateList": "2025-08-16",
  "date_published": "2025-08-16T02:13:47.000Z"
}
