{
  "title": "Two FC men among five martyred in KP attacks - Pakistan - DAWN.COM",
  "author": null,
  "content": "• CTD claims killing three TTP-linked militants in Peshawar operation\n• Two excise officials targeted near Dera-Daraban bypass\n\nPESHAWAR: Five people, including two personnel from the paramilitary Frontier Corps (FC) and two Excise Department officials, were martyred, while three militants were killed in different parts of Khyber Pakhtunkhwa, official sources said.\n\nCounter-Terrorism Department officials said their team ambushed a group of militants affiliated with the banned Tehreek-i-Taliban Pakistan (TTP) in an intelligence-based operation carried out in Regi Lalma, on the outskirts of the provincial capital, on Thursday night.\n\nThey said the CTD had been tracking the group, which was involved in 18 different attacks on police and citizens. These attacks took place along Peshawar’s northern border with Mohmand district, southern border with Kohat district, eastern border with Khyber district and western border with Nowshera district.\n\nThe ambush was based on technical surveillance, the officials said, adding that the militants’ identities were verified.\n\nThe officials said the group was planning an attack on the border between Peshawar and Khyber districts, adding that the militants opened indiscriminate fire when intercepted by a SWAT team. In the battle, CTD gunned down three militants while four others fled.\n\nThe officials said one of the killed militants was identified as Abdullah, alias Jawad, an Afghan national, confirmed through his Afghan citizenship card recovered from him. He was a wanted militant, while the identities of the other two are being determined.\n\nThe officials said technical investigations linked the group to at least 18 militant attacks in Peshawar. “Preliminary intelligence confirms the militants were part of a banned TTP-linked cell operating under foreign-based, foreign-funded handlers, with active plans to escalate attacks on security forces, public infrastructure, and pro-state individuals,” the officials said.\n\nFC men martyred\n\nIn Lakki Marwat, two FC personnel and a civilian were martyred when three armed men targeted an FC official and his brother while they were returning home from a hotel on the Indus Highway in the Wanda Karim Khan area.\n\nThe FC official’s brother, Ihsanullah, initially survived but later succumbed to his injuries. He told police that his brother had returned to the village on leave a week ago and that they were walking home when armed men suddenly attacked them with assault rifles.\n\n“We were injured and fell to the ground while the assailants fled,” he said, adding that his brother died upon reaching the hospital.\n\nPolice said another FC official also died in the attack, and his body was taken by relatives from the crime scene.\n\nPolice registered a case under relevant sections of law at Shaheed Haibat Ali Khan police station in Darra Pezu and launched an investigation.\n\nExcise team targeted\n\nIn another militant attack in Dera Ismail Khan, two Excise Department officials were slain, and a hotel owner injured, when unidentified assailants opened fire near Hashim Hotel on the Dera-Daraban bypass on Friday.\n\nAccording to police, excise and taxation officer Faridullah Khan reported that ASI Syed Ali Shah of the Excise Police Station South Region, along with volunteer Abideen, son of Amir Muhammad Banuchi from Bannu, had left for duty in an official vehicle.\n\nWhile stopping at Hashim Hotel for breakfast and waiting for other staff, two unidentified gunmen on a motorcycle opened indiscriminate fire. The ASI and volunteer died on the spot. The hotel owner, Hashim, 47, of Bhakkar, sustained injuries.\n\nPolice termed the incident an act of terror and said it was part of a recent wave of targeted assaults on law enforcement personnel. The area was cordoned off, and a search operation was launched to trace the assailants.\n\nGhulam Mursalin Marwat in Lakki Marwat and Muhammad Irfan Mughal in Dera Ismail Khan also contributed to this report\n\nPublished in Dawn, August 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T02:42:28.990Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931208/two-fc-men-among-five-martyred-in-kp-attacks",
  "dateList": "2025-08-16",
  "date_published": "2025-08-16T02:12:29.000Z"
}
