{
  "title": "Tharparkar in dire need of rain to escape famine: local community - Pakistan - DAWN.COM",
  "author": null,
  "content": "MITHI: Tharparkar — rendered parched by delayed or erratic rains — is now on the brink of famine, the local farming and herder communities say.\n\nThe situation poses a serious threat to the local population that depends on earning from their crops. The threat of famine looms large as a long dry spell has destroyed crops; and locals have already consumed or disposed of their produce during the period.\n\nLivestock is the second source of income for many families but, at present, no fodder is available for millions of animals being reared in the region.\n\nFor Tharparkar’s farming and herding communities, rainfall in mid-June and mid-August periods is necessary. The timely rainfall is their lifeline. Adequate amount of rain soaks the soil deep enough enabling the farming community to cultivate crops like guar, bajra, sesame, watermelon etc, besides growing fodder on grazing pastures.\n\nGrowers, herders fear erratic or inadequate rainfall in coming days may invite natural calamity\n\nThis year, clouds have reached the region late and the rainfall has also been inadequate as there were a few spells of light, patchy showers. The amount of rain remained far short of the required level.\n\nFarmers fear that if several spells of heavy rains did not lash the whole region soon, both the Kharif crops and the grasslands will wither beyond recovery.\n\nMost growers and herders fear that such a situation might expose the region to a natural calamity.\n\nKhamiso Jhagoro, a grower and livestock owner, said in his recent observation that this year’s rainfall had barely soaked one foot of the upper soil layer which was not sufficient enough for cultivation. Thar needs at least three spells of heavy rain, ideally between mid-June and mid-August, to saturate the soil to a depth of four to five feet.\n\nPartab Meghwar, a farmer, said that erratic rains were often more harmful than no rain. “When scant showers fall, the seeds of grass in the soil begin to germinate. As the grass grows, livestock rush to the pasturelands and mow it down or trample over it. This leaves people and their livestock vulnerable once again,” he explained.\n\nOnce the germinated grass is trampled over, grazed or uprooted, it will not grow again until the next rainfall and its place is often taken over by toxic and useless bushes — harmful for animals’ health. Overgrazing also accelerates desertification, according to Meghwar.\n\nMan Singh Bheel, a well-experienced herder, is of the view that consecutive droughts, changing rainfall patterns, illegal farming on pasturelands and overgrazing are destroying Thar’s ecology and land fertility. He observed that the region’s natural beauty, wildlife and grass cover had declined to an alarming level. He called for sustainable land management to prevent desertification and mitigate the risks and effects of drought.\n\nMubeen Saand, another prominent herder, said that until a few years back, fodder was available near his\n\nvillage, but now he and his family had to travel long distances to bring the same.\n\nIn his view, mechanical farming was harming Thar’s ecology. “For instance, cultivator, a commonly used farm implement, harms soil because its use increases erosion and land degradation by uprooting bushes and plants that once helped prevent erosion.\n\nPublished in Dawn, August 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689f980fe86cd.gif",
  "retrievedAt": "2025-08-18T02:41:15.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931097/tharparkar-in-dire-need-of-rain-to-escape-famine-local-community",
  "dateList": "2025-08-16",
  "date_published": "2025-08-16T02:13:19.000Z"
}
