{
  "title": "Karachi couple killed by dumper as fatalities involving heavy vehicles continue - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Water tanker crushes child to death in Orangi\n• Two girls run over, killed by car driver in Jauhar\n• Petition filed in SHC against officials’ failure to prevent fatal accidents\n\nKARACHI: A man and his young wife were run over and killed by a dumper truck on Friday as traffic accidents involving heavy vehicles continued unabated in the metropolis.\n\nAlso on Friday concerned citizens moved the Sindh High Court on Friday seeking directives for provincial authorities to produce complete records relating to registration and fitness of dumpers.\n\nA fast-moving dumper truck ran over and killed the young couple in the Sultanabad area on M.T. Khan Road in the wee hours of Friday morning, officials said.\n\nSouth DIG Syed Asad Raza told Dawn that the couple was on a motorcycle when the heavy vehicle struck them at around 2:30am. As a result, the man, identified as Bilal Sohail, 18, sustained critical injuries and died on the spot, while his wife, Meher, was injured. She was taken to the Dr Ruth Pfau Civil Hospital Karachi, where she died during treatment.\n\nThe driver responsible for the accident fled the scene with the dumper.\n\nIn another accident involving a heavy vehicle, a fast-moving water tanker ran over and killed a four-year-old boy, Aliyan, in Orangi Town on Friday evening.\n\nThe police said that the tanker driver managed to escape from the scene.\n\nThe two incidents came as a grim reminder to the Sunday fatal accident on main Rashid Minhas Road in which two siblings were killed and their father suffered serious injuries. Following the accident, enraged people set to fire seven dumpers.\n\nCar driver kills two girls\n\nIn the second incident, two minor girls, said to be beggars, were killed when a rashly driven car hit them inside the Jauhar underpass in Gulistan-i-Jauhar on Friday afternoon, police said.\n\nSharea Faisal SHO Iftikhar Arain told Dawn that the girls were crossing the underpass when a car, allegedly being driven at high speed by a driver, struck them. The vehicle went out of control and overturned after hitting a wall. Both girls, aged between 10 and 12 years, were taken to a nearby private hospital, where doctors pronounced them dead.\n\nThe bodies were later shifted to the Jinnah Postgraduate Medical Centre for medico-legal formalities.\n\nThe officer said the car driver, Raja Ibrahim Mansoor, 23, was also injured in the accident and taken to the same hospital for treatment.\n\nHe added that the car was badly damaged in the crash.\n\nThe driver has been arrested and the vehicle impounded while further investigation is underway. The accident occurred at around 2:30pm.\n\nSHC moved over officials’ failure to prevent dumper deaths\n\nAlso on Friday, a petition was filed in the Sindh High Court against deadly traffic accidents involving dumper trucks in Karachi.\n\nThe petitioners, Karachi Restoration Movement, through its convener Ashraf Jabbar Qureshi and others, sought directives for respondents to produce complete records relating to registration and fitness of dumpers and to ensure compliance with orders previously issued by the Supreme Court and the SHC in this regard.\n\nCiting the chief secretary, home secretary, inspector general of police and additional inspector general of police (traffic) as respondents, they also contended that the authorities concerned had failed to fulfil their constitutional and legal obligations and were utterly unable to protect citizens from dumper-related accidents, which have so far claimed over 600 lives.\n\nThey stated that majority of these dumper truck drivers were not Pakistani nationals and did not comply with the laws of the land.\n\nThey maintained that it was the constitutional duty of the authorities to serve the citizens of Sindh by fulfilling their responsibilities in areas such as water supply, sewerage, road construction and to maintain law and order.\n\nThey argued that instead of consoling and supporting the bereaved families, the government officials allegedly met representatives of the dumper association.\n\nCiting a recent incident on Rashid Minhas Road, the petitioners asserted that two young siblings were killed after being hit by a dumper and after the incident members of the so-called dumper mafia set at least seven dumpers on fire and attempted to shift the blame on local youths. The police were acting at the behest of such mafia and arrested over a dozen young men from the area, they added.\n\nPublished in Dawn, August 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/68154eecc8616.gif",
  "retrievedAt": "2025-08-18T02:41:25.935Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931105/karachi-couple-killed-by-dumper-as-fatalities-involving-heavy-vehicles-continue",
  "dateList": "2025-08-16",
  "date_published": "2025-08-16T02:13:19.000Z"
}
