{
  "title": "Four arrested as Dera police foil terror plot - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: The Dera police on Friday said they foiled a major terrorist plot planned for Independence Day by arresting four militants of a banned outfit during an intelligence-based operation in the district.\n\nDistrict police officer Sajad Ahmed Sahibzada, along with Counter-Terrorism Department SP Iftikhar Ali Shah, SP city Ali Hamza, and SP Paharpur Asad Ali Shah, while briefing mediapersons, said that the successful operation was jointly conducted by the CTD, district police, and intelligence agencies in the Mathi Baghwani area in the jurisdiction of Gomal University Police Station.\n\nHe said that the arrested terrorists were identified as Umar Farooq, Asif Ali, Hasnain Mavia, and Hidayatullah. They were stated to have been affiliated with proscribed Lashkar-i-Jhangvi (Bali Khiyara Group).\n\nAccording to the DPO, the arrested individuals were not only planning an attack during Independence Day celebrations but were also previously involved in the killing of over a dozen innocent civilians and police personnel.\n\nHe said that during operation, weapons and explosives were also recovered from their possession, including a ready-to-use IED with magnet, AC/DC circuit, and prima cord, one 9mm pistol and one 30-bore Mauser (SMG-style rifle), three magazines and 28 rounds of ammunition, three hand grenades, six non-electric detonators (without safety fuses), nine electric detonators, 10 yards of safety fuse, two non-electric detonators with safety fuses, 250 grams of explosive material, five AGL grenades, two simple mobile phones, three touchscreen mobile phones with four SIM cards.\n\nA case has been registered under anti-terrorism and other relevant laws at the CTD police station.\n\nFurther investigation is currently underway.\n\nPublished in Dawn, August 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/14150410df4f3c8.jpg",
  "retrievedAt": "2025-08-18T02:41:04.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931133/four-arrested-as-dera-police-foil-terror-plot",
  "dateList": "2025-08-16",
  "date_published": "2025-08-16T02:13:47.000Z"
}
