{
  "title": "Rice import from Pakistan; outcome of meetings with PM Shehbaz: Azerbaijan President",
  "link": "https://www.app.com.pk/national/rice-import-from-pakistan-outcome-of-meetings-with-pm-shehbaz-azerbaijan-president/",
  "date_published": "2022-11-26T11:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Azerbaijan President Ilham Aliyev has said that the decision to import rice from Pakistan with tax exemption of five years was the outcome of his meetings with Prime Minister Muhammad Shehbaz Sharif held in the last couple of months.\nAddressing at an international conference “Along the Middle Corridor: Geopolitics, Security and Economy” held at ADA University, Baku, the other day, the president said during these meetings, they discussed the agenda of their bilateral relations.\nThe president of Azerbaijan was responding to questions raised by Executive Director of Center for Global and Strategic Studies of Pakistan Khalid Taimur Akram, as a participant.\nThe president said he discussed with Pakistan’s Prime Minister, the prospects of further intensifying the bilateral economic and trade cooperation and the decision over special regulations for rice from Pakistan, was a reflection of that.\nHe said they had decided to take this step in order to stimulate the growth of mutual trade between the two countries. He had discussed with Prime Minister Shehbaz Sharif what kind of goods they could provide to each other, he added.\n“Why should we buy rice from some other place if we have high quality rice in the brotherly country. So, that decision was clearly based on our brotherly relations,” the Azeri media quoted the president as saying.\nCommenting further, the Azerbaijan president said that his country enjoyed excellent relations with Pakistan.\nPresident Aliyev further said, “We are very grateful to Pakistan for continuous support which the country demonstrates with respect to Azerbaijan-Armenia relations. During the times of occupation, during the war, and after liberation of our territories, Pakistan was always with us. And this political and moral support is highly appreciated by the people of Azerbaijan.”\nHe said that he knew that the Gwadar Port of Pakistan was transforming into a big international hub. And to connect it with their infrastructure was not a difficult thing, as they had to properly address the issue of tariffs, legal framework, coordination on regulation and to have a teamwork.",
  "retrievedAt": "2025-08-11T15:55:38.343Z"
}
