{
  "article_id": "2025-02-11_ce4da94c25ef9a00943554ed89111fc0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sdg-4-midterm-review-report-released/",
    "retrieved_at": "2025-08-27T12:37:01.528Z"
  },
  "metadata": {
    "title": "SDG-4 midterm review report released",
    "author": null,
    "date_published": "2025-02-11T13:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 388,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 11 (APP):The launching ceremony of the Pakistan Sustainable Development Goal 4 (SDG 4) Midterm Review Report was held yesterday at Allama Iqbal Open University(AIOU) in collaboration with the Ministry of Education and Professional Training, Pakistan Institute of Education (PIE), UNESCO, Taleem Foundation and Provincial Education Departments. Federal Minister for Planning, Development, and Special Initiatives, Prof. Ahsan Iqbal, attended the event as the chief guest, while provincial ministers, including from Azad Jammu & Kashmir, and provincial secretaries were also present. Addressing the ceremony, Prof. Ahsan Iqbal stated that we have entered an era of a knowledge revolution, where a country may survive without natural resources, but sustainable development is impossible without education. He emphasized that wealth creation globally is no longer driven by real estate or traditional industries but by knowledge institutions, citing examples such as Google, Microsoft, ChatGPT, and Facebook. He highlighted the need for special attention to the over 20 million out-of-school children in Pakistan and Early Childhood Education (ECE). He also stressed the 2047 target, noting that 22 years from now, two countries will reflect on their journey since independence, and Pakistan must be prepared to win this race. Furthermore, he reaffirmed the government's commitment to improving the education system and ensuring quality education for every citizen. He appreciated the collaboration with UNESCO and other partners, stating that this report will help refine educational policies for better effectiveness. Director General, Pakistan Institute of Education (PIE), Dr. Muhammad Shahid Soroya, delivered a detailed presentation on the objectives, findings, and outcomes of the SDG 4 Midterm Review Report. He discussed the current state of the education system, its challenges, and future recommendations. UNESCO Pakistan Office In-Charge, Mr. Kar Hung Antony Tam, in his welcome address, remarked that the launch of the SDG 4 Midterm Review Report is a significant step toward educational sustainability. He highlighted that the report underscores our collective efforts in achieving quality education goals and provides guidance for future strategies. Provincial Minister for Education, Balochistan, Raheela Hameed Khan Durrani, Chief Executive Advisor to the Government of Sindh, Dr. Fauzia Khan, and other government officials from different provinces briefed the attendees on provincial education performance. The ceremony saw a large turnout of representatives from educational institutions, education experts, and members of civil society, reflecting a strong commitment to improving the education sector in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}