{
  "article_id": "2025-02-11_0ca08885faf509f391281d56529427c8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-committee-on-gender-mainstreaming-held/",
    "retrieved_at": "2025-08-27T12:35:43.009Z"
  },
  "metadata": {
    "title": "NA Committee on Gender Mainstreaming held",
    "author": null,
    "date_published": "2025-02-11T18:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 255,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 11 (APP):The National Assembly Special Committee on Gender Mainstreaming on Tuesday urged the immediate establishment of the National Commission on the Status of Women at the federal level, along with Provincial Commissions and Gender Mainstreaming Committees, to ensure the enforcement of equal rights as guaranteed by the constitution. The meeting chaired by Dr. Nafisa Shah, MNA, recommended that consistent and synchronized data were available to assist in gender mainstreaming and reporting at the national and international levels. The Committee further expressed great concern on the lack of implementation of 10 percent quota in civil services in Pakistan. It was concerning that only 49,508 out of 1.2 million employees are women and most of them in the lower grades, the members noted. The Committee highlighted an urgent need for both federal and provincial governments to put in place an institutional infrastructure to address the gender gap, in education, health, employment and political participation. The Committee further recommended that there should be no discrimination between Members on General Seats and Reserved Seats while allocating budget for development schemes in the constituencies of the National Assembly Members. The Committee also constituted a Sub-Committee on the Gender Mainstreaming in Parliament with the following composition:- Ms. Shista Pervaiz, MNA, Ms. Munaza Hassan, MNA; Senator Rubina Qaim Khani; Aqeel Malik, MNA. The meeting was attended by Aqeel Malik MNA, Ms. Shaista Pervaiz, MNA, Syed Hussain Tariq MNA, Ms. Shahida Begum, MNA, Ms. Munaza Hassan MNA, Senator Rubina Qaim Khani and Senator Fawzia Arshad and Officer of the concerned Ministries/Divisions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}