{
  "title": "Russell Tribunal highlights Indian atrocities in Occupied Kashmir",
  "link": "https://www.app.com.pk/national/russell-tribunal-highlights-indian-atrocities-in-occupied-kashmir/",
  "date_published": "2021-12-19T19:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Russell Tribunal on Kashmir had expressed concern over the grave crimes against humanity, including genocide, that were occurring in the Indian Illegally Occupied territory of Jammu and Kashmir.\nKashmir Civitas, a Canadian registered NGO, partnered with the World Kashmir Awareness Forum, Russell Foundation (London, UK), the Permanent People’s Tribunal of Bologna, Italy, Nahla (Center for Education and Research), the Center for Advanced Study in Sarajevo, and International University of Sarajevo (IUS), to hold the maiden Russell Tribunal on Kashmir in Sarajevo, Bosnia on December 17-19, 2021, says a press release.\nThe seriousness of these crimes was what motivated the tribunal to bring this to the attention of the world, since it was a direct threat to global peace.\nThis foundational international event, the first of many tribunals being planned over the coming years, aimed to set the stage for exposing the seriousness of the Kashmir conflict. More specifically, the focus of thetribunal was on four thematic areas: (a) Genocide, including a discussion on the Jammu Genocide in which an estimated 230,000 – 500,000 people were killed. (b) De-Colonization, Kashmir is not a secessionist/separatistmovement, but a de-colonial movement; (c) Settler-Colonialism (land grabs, coercive patriotism etc); (d) Crimes Against Humanity and Nuclear War – mass graves, rape as a weapon of war, and the ever present threat of nuclear war in this contested region.\nThe tribunal brought together key global personalities, academics and celebrities to highlight the ongoing genocide, massive violations of human rights, crimes against humanity, and political oppression of thepeople in the disputed territory of Indian Occupied Jammu and Kashmir.\nIn actuality, Russell Tribunal on War Crimes in Kashmir 2021 aimed to replicate the significance and impact of the Russell Tribunal on Vietnam that gained worldwide press coverage and had a clear, discernible impacton transforming the narrative on Vietnam. For that reason, and in payinghomage to the courage of Professor Bertrand Russell, who dared to challenge American hegemony at the height of its power, the tribunal was used to expose the crimes of India in Kashmir.\nLikewise, the Russell Tribunal on Kashmir aimed to reaffirm the primacy of international law as the basis for solving the Kashmir conflict. Moreover, it aimed to raise awareness of the responsibility of the international community to prevent ongoing crimes against humanity and the potential for a genocide to occur.\nThis tribunal’s singular aim was to put forward the facts on Kashmir.\nThis was a critical, dangerous time for Kashmiris – and for all freedom, equality and justice-minded people throughout the world.\nThe Hindutva fascist ideology had swept Indian political institutions and society, and now there were legitimate concerns about a carefully concocted plan to enforce a genocidal demographic change in the disputed territory of Jammu and Kashmir. Worse, the region was at the center of a territorial dispute between India and China.\nThe threat of war was at its highest level since the downing of two Indian fighter jets and the capture of an Indian air force pilot.\nThe tribunal, with a focus on Indian Occupied Kashmir – the epicenter ofresistance — included leading global, political, academic and literary figures and aspired to further clarify the reality of the situation, internationalize the crisis in Kashmir and compel the world to act.",
  "retrievedAt": "2025-08-11T21:44:23.923Z"
}
