{
  "title": "AIOU, JICA join hands to help people exploit CPEC potential",
  "link": "https://www.app.com.pk/national/aiou-jica-join-hands-to-help-people-exploit-cpec-potential/",
  "date_published": "2021-12-20T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):The Allama Iqbal Open University (AIOU) and Japan International Cooperation Agency (JICA) are joining hands to launch a project for provision of skill-based training to the people in the Special Economic Zones (SEZs) that are being set up along the China Pakistan Economic Corridor (CPEC) route.\n“Initially, under the project training will be started in Rashakai and Gilgit-Baltistan Industrial Zones while later its scope will be extended to all other SEZs,” AIOU Vice Chancellor, Dr Ziaul Qayyum told APP in an exclusive interview.\nUnder the said project, the VC said, the varsity has designed specific course for the local people to get them trained keeping in view the requirements of the industrial zones so that they could easily find relevant jobs and get benefit from the multi-billion CPEC project.\nHe expressed the hope that this would be a sustainable model to engage local people, adding the university was already in process of designing courses in this regard.\nTo a question about skill-based education, the VC said that it was basic mandate of the varsity since its establishment to provide skill-based education to the people.\nThe university had devised special courses in computer, tractor repairing, poultry and farming to provide technical training to the people and help them earn respectable livelihood.\nHe said even the university arranged courses in tailoring and embroidery with private partnership to train girls in Gilgit Baltistan region.\nTo a question the AIOU VC told APP that the university was providing education to all irrespective of their age, gender or social status. He said, there no age bar on acquiring education from AIOU, adding free education was being provided to transgender community, jail inmates and children of martyrs while concession was also being provided to orphans and poor students.\nHe said the university was also going to further extend education programme being provided to jail inmates. In this regard, he said that he has already hold meetings with IGs Prisoners so that education could also be provided to those children who were in jails with their mothers.\nRegarding faculty development programme, the VC said 45 members would be sent abroad for Ph.D on university expenses while Human Resource and administrative training would also be given to the staff.\nHe said admission process was also divided into phases for conveniences of the students and papers were also being sent to other regional offices randomly for marking to reduce burden on main campus.\nThe university has also introduced a concept of smarts classrooms in areas where internet facilities were not available, he added.",
  "retrievedAt": "2025-08-11T21:44:19.319Z"
}
