{
  "title": "PM to review rescue, relief activities in Jhal Magsi, Balochistan",
  "link": "https://www.app.com.pk/national/pm-to-review-rescue-relief-activities-in-jhal-magsi/",
  "date_published": "2022-07-30T07:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD July 30 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday will visit Jhal Magsi, Balochistan province to review the damages caused by the recent floods and the ongoing rescue, relief and rehabilitation activities.\nThe federal ministers and other relevant authorities will be accompanying the prime minister.\nEarlier, the prime minister ’s scheduled visit to flood-affected areas of Balochistan province was deferred due to inclement weather, PM Office Media Wing said in a press release.\nDue to severe weather conditions, the prime minister could not visit other flood-hit areas of the country. During his visits, the prime minister had to review the rescue and relief activities in the affected areas.\nA few days back, the prime minister also chaired a detailed meeting over the rescue, relief and rehabilitation measures in the flood-affected areas. The meeting was apprised about the distribution of financial support among the flood affectees.\nUnder the prime minister’s direction, affected families who lost their members during the natural calamity were provided with the monetary support of Rs1 million each. The prime minister had also directed for increasing the financial aid to the injured and enhanced compensation support for the damaged houses.\nThe direction was passed for increasing the amount for the injured and affected from Rs50,000 to Rs200,000. Besides, support for the partially damaged homes had been increased from Rs25,000 to Rs250,000 each and for those completely damaged houses, the amount was amplified from Rs50,000 to Rs500,000 each.\nThe prime minister had also constituted a special committee comprising the federal ministers to effectively supervise the rescue and relief activities.",
  "retrievedAt": "2025-08-11T15:19:10.074Z"
}
