{
  "title": "SSDO sets up “stakeholder’s network” to prevent human trafficking",
  "link": "https://www.app.com.pk/national/ssdo-sets-up-stakeholders-network-to-prevent-human-trafficking/",
  "date_published": "2022-07-30T11:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP): Sustainable Social Development Organization (SSDO) has set up a “stakeholders’ network,” comprising parliamentarians, representatives of law enforcement agencies, media and other departments concerned, for the prevention of human trafficking in the country.\nThis initiative has been taken on the occasion of the “World Day against Trafficking in Persons 2022” aimed at preventing human trafficking with effective enforcement of legal reforms framework and ensuring required technical assistance, a news release said here.\nThe World Day against Trafficking in Persons is commemorated on July 30 every year across the globe including Pakistan.\nSSDO Executive Director Syed Kausar Abbas said the network would play a key role in curbing the heinous crime of human trafficking which was also a violation of human rights.\nHe said SSDO was committed to providing technical support for the implementation of the improvised legal framework to reduce trafficking in persons.\nHe said it would help further increase registration, investigation, and prosecution of cases of human trafficking, besides developing practices of direct referrals of victims for services or rehabilitation.\nKausar said the recently launched helpline “0333-1110566” would serve as the main point of contact for the victims of human trafficking and bonded labour for Trafficking in Persons (TIP) victims who would be further referred for the provision of free legal aid.\nHe said the SSDO also held “awareness walks” in different cities including Islamabad, Karachi, Lahore, Multan, Sukhar and Jhelum on the World Day Against Trafficking in Persons, in which people from all walks of life actively participated.",
  "retrievedAt": "2025-08-11T15:19:05.217Z"
}
