{
  "title": "Modi’s BJP accused of encouraging persecution of Muslims, other minorities",
  "link": "https://www.app.com.pk/national/modis-bjp-accused-of-encouraging-persecution-of-muslims-other-minorities/",
  "date_published": "2022-07-30T10:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP): Modi’s BJP has been accused of encouraging the persecution of Muslims and other minorities by hardline Hindu nationalists since coming to power in 2014. Muslims comprise nearly 15 percent of India’s 1.4 billion people, while Hindus still form nearly 80 percent of the population.\nModi’s BJP and its ideological parent, the far-right Rashtriya Swayamsevak Sangh (RSS), have warned Hindus about religious conversions to Islam and Christianity, and called for action to prevent a “demographic imbalance” in the world’s second most populous nation, analysts and observers said on Saturday.\nThey said since India’s independence, Muslims have faced systematic discrimination, prejudice, and violence, despite constitutional protections. Human rights violations of religious minorities underway in India, cover a broad spectrum, from illegal detention, torture, and fake encounter killings of detainees to open assault against individuals, their sources of livelihood and in many cases their places of worship, they added.All the special laws which have been enacted over the years, have become instruments in the hands of police to falsely implicate Muslim youth and keep them behind bars for years without any hearing.\nAuthorities in India have adopted laws and policies that systematically discriminate against Muslims and stigmatize critics of the government, a report of Human Rights Watch said. Prejudices embedded in the government of the ruling Hindu nationalist Bharatiya Janata Party (BJP) have infiltrated independent institutions, such as the police and the courts, empowering nationalist groups to threaten, harass, and attack religious minorities with impunity.\n“The BJP’s embrace of the Hindu majority at the expense of minorities has seeped into government institutions, undermining equal protection of the law without discrimination,” said Meenakshi Ganguly, South Asia director at Human Rights Watch. “The government has not only failed to protect Muslims and other minorities from attacks but is providing political patronage and cover for bigotry.”\nAlthough the Indian constitution talked about the country’s secular nature, but for all practical purposes it was a Hindu state, said former ambassador Asif Durrani.\nHe said the Muslims constituted almost 15 percent of India’s population, however, their representation in businesses and bureaucracy was less than one percent and they were being further repressed.\nIndian judiciary, with its anti-Muslims verdicts, has become an instrument in the hands of the Narendra Modi government that continues to oppress minorities and deny them justice, the ambassador said.\nHe said that decisions on religious matters have proved that the institution is openly siding with the Hindutva ideology and has failed the Muslim community. This June, he observed, India’s Supreme Court appeared as the “biggest tormentor of the minorities” after it refused to stop the government from razing houses of Muslims.\nThe top court said, “We cannot stop demolitions,” in response to a petition by a Muslim group in Uttar Pradesh that had highlighted said that the state was punishing members of the 200-million-strong Muslim minority for participating in protests.\nExperts further observed that Muslims in India were not facing such a situation for the first time as the history was replete with incidents of state-sponsored persecution, particularly in Madhya Pradesh, Assam, Delhi and Gujarat.\nThe Narendra Modi regime was promoting the Hindutva ideology to further suppress the Muslims and other minorities, said a retired General Tallat Masood.\nHe said Modi’s suppressive policy vis-a-vis Kashmir had further damaged the interests and future of the Kashmiri people, adding in fact his policies were extremely detrimental for the people of Kashmir and also for Pakistan.\nAnalyst Ershad Mahmud said the Muslims were leading their lives on the margins in Modi’s India. “They have almost disempowered under his Bharatiya Janata Party’s (BJP) government as the entire state apparatus is being used to crush them. Some international experts believe that the genocide of Muslims is being carried out in India.” He said Modi had adopted a two-pronged approach to deal with domestic politics and the international community separately.\nAccording to Dr Ejaz Hussain, secular Hindus, as well as non-Hindu communities in India, are being coerced, socio-politically and discursively, to either embrace Hindutva values or face exclusion of all sorts, i.e., de-citizenship.\nHe said as the Modi-led government staunchly believed in making India a singular identity grounded in Hindutva, it had made the disputed territory of IIOJK a part of the Indian Union in August 2019.\nHe said that Pakistan-India relations also further deteriorated owing largely to Hindutva policies pursued by the Modi regime. The RSS, he added, was busy in expanding its organizational and ideological apparatuses in south India also.\nHe said to counter the Hindutva ideology and re-project India as a secular country, the non-RSS-BJP groups and political parties would have to join ranks and put a united stance on all fronts. The international community also needed to question the wrongs committed by the Modi regime in the garb of RSS, he added.",
  "retrievedAt": "2025-08-11T15:19:07.438Z"
}
