{
  "title": "Yasin Malik: A symbol of courage and bravery",
  "link": "https://www.app.com.pk/national/yasin-malik-a-symbol-of-courage-and-bravery/",
  "date_published": "2022-07-30T09:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP): For decades Kashmiri people are struggling for their just right to self-determination and freedom from Indian yoke experiencing unprecedented agony and subjugation at the hand of the Indian brutal occupied forces.\nGeneration after generation led by valiant leadership in Illegally Indian Occupied Kashmir had waged undeterred struggle to free themselves from clutches of slavery rendering uncounted sacrifices in terms of rapes, torture, pellet guns firing and extra judicial killings.\nOther than ordinary citizens, renowned Kashmiri leaders also rendered sacrifices for their cause suffering fake cases, detention, and torture showing unflinching courage and determination.\nFifty-six year old Yasin Malik stands tall among leadership in occupied Kashmir and rose to prominence during 1989 when he had begun a freedom struggle along with his young colleagues. He was apprehended with imprisonment and sent to jail while his other aides were killed in the clashes with the security forces.\nWhile in jail Malik had underwent a transition in his political insight while launching a nonviolent movement. In this connection, he launched a massive public mobilization campaign known as Safar-e-Azadi (Journey to Freedom) involving the people of Jammu and Kashmir.\nIn his efforts to engage the Indian and Pakistani leadership as well as Kashmiri Diaspora and the international community for a political and peaceful resolution of the Kashmir dispute, he emerged as a leader and champion of dialogue.\nHe had strong advocate of Kashmiris right to self-determination and warned on several occasions that if a sincere consideration is not given to Kashmiri people’s demand, Kashmiri youth would resort to choose their own way.\nHis prophetic words turned out to be right when the Kashmir Valley went through a six-months long strike after the killing of Burhan Wani in 2016. Malik, along with Mirwaiz Umar Farooq and Syed Ali Gilani, refused to meet India’s all-party parliamentary delegation in Srinagar and termed it a futile exercise. It virtually sealed Yasin’s fate and New Delhi decided to give him an exemplary punishment.\nThe ruling BJP regime, led by Indian Prime Minister Narendra Modi, adopted a militaristic approach to deal with the Kashmir conflict and people associated with the Kashmir freedom movement.\nThe research works of various Human Rights (HR) bodies across the globe have exposed the paramilitary forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK) were using torture as an Instrument of Control (IoC), to quash the Kashmiri struggle for independence killing thousands of Kashmiris.\nMajor changes were made in article 370 and 35A of the Indian constitution to make basic changes in the status of IIOJK. When Yasim Malik and other Kashmiri leadership resorted to protest these illegal acts of the Modi government, National Investigation Agency (NIA) court in the Indian capital New Delhi sentenced Yasin Malik life imprisonment in a fake terror funding case.\nA US delegation recently called on Peace and Culture Organisation Chairperson Mushaal Hussein Mullick, the wife of Yasin Malik and expressed solidarity with her over illegal detention of Yasin Malik and unabated human rights violations in IIOJK.The interfaith harmony delegation comprising Michael Crowe, Dr. Joe’s Knight, Lucas Bontrager, Anwer Qasmi, Ilyas Masih, and Daud Ilyas also expressed grave concerns on unjust and inhuman treatment meted out to Yasin Malik in detention.\nThe American delegation assured Mullick to raise the issue of the illegal detention of Yasin Malik and ethnic cleansing of Kashmiris at every forum.\n“Unjust detention of Yasin Malik in a fake and fabricated case is an eye opener for the human rights champions across the globe. It is like quelling an effective voice of Kashmiri people and slow down the struggle for right to self-determination,” remarked former Chairperson Human Rights Commission of Pakistan (HRCP) Dr Mehdi Saeed.Dr Mehdi expressed fear that brutal Indian authorities could torture Yasin to death as dozens of Hurriyat leaders and young Kashmiris had already been killed in detention.“Indian Occupation Forces continued to operate with entire impunity under draconian laws such as Armed Forces Special Powers Act (AFSPA), Public Safety Act (PSA) and Unlawful Activities Prevention Act (UAPA),” he said.\n“India must allow an independent investigation by a UN Commission of Inquiry as recommended by the United Nations High Commissioner for Human Rights (OHCHR) in its 2018 and 2019 Kashmir Reports,” Dr Mehdi added.\nPakistan has been reiterating its call on the global community to fix responsibility on India for its gross and systematic violations of human rights in IIOJK and it is time for international community to move forward for resolving this long standing dispute.\n“Indian illegal actions in the valley are condemnable as India has deprived Kashmiri people of their legal right including the right-to-speech and self-determination,” commented Senator Sehar Kamran (TI).\n“Modi led regime in India was not allowing Kashmiris to speak their mind or assemble anywhere or protest, also gagging the media and harassing journalists without any reason,” she said.\nKamran urged world community to come forward to save Kashmiri Muslim souls from Hindutva fascism being thrust on them by the Modi regime. “Bullets and guns had never been able to suppress people’s aspirations and Kashmiris’ spirit for freedom could not be defeated by killings, arrests or torture.”\nAs the saga of brutalities goes on, the Indian government must be aware that detention of one Kashmiri leader would not serve its purpose as many more would rise for the cause and continue struggle till achievement of their goal.\n(APP Feature Service)",
  "retrievedAt": "2025-08-11T15:19:09.701Z"
}
