{
  "title": "Green Line Phase-II to be completed in one year: Ahsan Iqbal",
  "author": null,
  "content": "KARACHI, Nov 03 (APP): Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal on Monday said the second phase of the Green Line Bus Rapid Transit (BRT) project in Karachi will be completed within a year, stressing that the city’s heritage and existing infrastructure must be protected during construction.\n\nDuring a visit to the project site, the Minister was briefed on concerns raised by the Karachi Metropolitan Corporation (KMC) regarding NOCs, service road diversions, relocation of a 12-inch water line and drainage issues. Iqbal assured that any infrastructure removed during development would be rebuilt and called for stronger coordination between KMC, KWSB, PIDCL and other relevant departments.\n\nHe highlighted that former prime minister Nawaz Sharif had launched the first phase of the Green Line at a cost of Rs. 29 billion, while Prime Minister Shehbaz Sharif initiated the second phase, a 1.8-kilometre extension worth Rs5.5 billion, which had been delayed due to legal issues that have now been resolved.\n\nAhsan Iqbal said three new stations are being added under the extension, with emphasis on preserving Karachi’s cultural character. He added that the Sindh chief minister would consult the Karachi mayor to address KMC’s reservations.\n\n“We want to complete this project as soon as possible so Karachiites get maximum transport relief,” he said, adding that Karachi was the only city to receive such major transit infrastructure as a federal initiative.\n\nThe Minister also reviewed progress on other key projects, including the K-IV water scheme, which he noted was now being fully funded by the federal government after initially being a joint venture with Sindh. He said efforts were underway to align major infrastructure works including K-IV, the N-25 and the Karachi-Hyderabad Motorway to improve connectivity.\n\nHe mentioned that feasibility work with Chinese partners was in progress to remodel the Karachi-Hyderabad Motorway, while road infrastructure around Karachi Port Trust would be upgraded to support 24/7 port operations.\n\nReferring to the Sukkur-Hyderabad Motorway, the minister alleged the project was derailed by leadership in 2018, causing costs to triple. However, he said financing from international banks had been secured and construction would resume soon.\n\nAhsan Iqbal reiterated the federal government’s focus on consultation and coordination, saying the Pakistan Infrastructure Development Company Limited (PIDCL), successor to the Public Works Department, would oversee all federal development projects moving forward.\n\nProvincial Minister Jam Khan Shoro, MNA Syed Amin-ul-Haque and project officials accompanied the Minister during the visit.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/1762162707.jpg",
  "retrievedAt": "2025-11-03T12:49:36.109Z",
  "source": "APP",
  "link": "https://www.app.com.pk/domestic/green-line-phase-ii-to-be-completed-in-one-year-ahsan-iqbal/",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T12:46:47.000Z"
}
