{
  "title": "Safe City cameras in Rawalpindi enter final phase: E-challan system now active to curb traffic violations",
  "author": null,
  "content": "RAWALPINDI, November 03 (APP):The Punjab Safe Cities Authority (PSCA) has fast-tracked the installation of Safe City surveillance cameras across Rawalpindi, marking a major step toward enhancing road safety, crime prevention and traffic management in the city.\n\nUnder the province-wide Safe City initiative, high-resolution cameras have already been deployed in multiple cities of Punjab to monitor vehicular and motorcycle movement, detect violations, and issue automated e-challans. The project will ensure smoother traffic flow, promote law compliance, and strengthen public safety through real-time surveillance.\n\nIn Rawalpindi, the installation work has entered its final phase, with cameras now operational at key locations including COD Chowk, Fauji Foundation, Liaquat Bagh, Raja Bazaar, Chandni Chowk, Commercial Market, Ali Chowhan Chowk, Ayub Park, Jinnah Park, Chaklala Railway Station, Gulzar-e-Quaid, Faizabad Metro Station, Pirwadhai Mandi Stop, Saddar Bank Road, Qasim Market, 22 Number Bakra Mandi Chowk, Kachehri Chowk, Rawal Road, Committee Chowk, Tench Bhatta, and Chakri Road.\n\nThe e-challan system has officially become operational in Rawalpindi, following its success in Lahore and other major cities. The PSCA’s Rawalpindi headquarters has been established opposite Jinnah Park, where all digital monitoring and challan processing are being managed.\n\nAuthorities have issued the following mandatory guidelines for bikers; both front and rear indicators must be functional, wearing a helmet is mandatory while riding, non-standard or tampered number plates will invite strict action, both number plates must match the official excise-issued pattern and be clearly visible, riding in fast-track lanes will result in a challan, any tampering with number plates to evade e-challan detection will lead to legal action and riding without a valid license or national ID card will result in an FIR.\n\nAuthorities have issued the following penalties for violations for bikers: riding without a helmet, Rs 1,500; non-standard number plate, Rs 2,000; tampering with the number plate, Rs 2,000 plus FIR and riding without a license or CNIC, FIR to be registered.\n\nCar owners have also been cautioned to adhere to traffic laws as cameras are actively monitoring; over-speeding and rash driving will result in an e-challan, not wearing a seatbelt will be subject to an e-challan, wrong parking and entering from the wrong side will result in fines or possible FIRs, both front and rear number plates must be official excise-issued computerized plates and vehicles with tinted windows or non-standard number plates will face challans and possible legal action.\n\nOfficials said the Safe City system will not only help enforce traffic discipline but also strengthen law enforcement’s ability to respond swiftly to crimes, emergencies, and accidents through integrated digital monitoring.\n\nThe PSCA has urged citizens to comply with traffic rules and road safety laws, emphasizing that the system’s success depends on public cooperation in making Rawalpindi a safer, smarter city.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2023/11/Punjab-Safe-City-Authority-PSCA-CCTV-Camera-Surveillance-SMK.jpg",
  "retrievedAt": "2025-11-03T16:21:08.401Z",
  "source": "APP",
  "link": "https://www.app.com.pk/domestic/safe-city-cameras-in-rawalpindi-enter-final-phase-e-challan-system-now-active-to-curb-traffic-violations-2/",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T15:42:23.000Z"
}
