{
  "title": "Institute of Home Economics holds Annual Prize Distribution and Investiture ceremony",
  "author": null,
  "content": "ISLAMABAD, Nov 03 (APP): The Institute of Home Economics, Art and Design, F-11/1, Islamabad, held its Annual Prize Distribution and Investiture Ceremony with great enthusiasm and pride.\n\nThe event was attended by Mr. Asghar Ali, Deputy Secretary, Ministry of Federal Education and Professional Training, as the Chief Guest, and Ms. Robina Anjum, former Vice Principal, as the Guest of Honour.\n\nThe ceremony was organized under the supervision of Principal Professor Rozina Faheem.\n\nThe ceremony began with the oath-taking of the newly elected Student Council, symbolizing a renewed spirit of leadership and responsibility among the students.\n\nThe newly appointed office bearers — President Ms. Seemab Iqbal, Vice President Izzah Malik, General Secretary Fatima Khalil, Treasurer Lalina Khan, Performing Arts Secretary Bushra Aziz, Literary Secretary Areej, Sports Secretary Noor-ul-Ain Kamal, and Media Secretary Hiba Farasat — were adorned with sashes by the Chief Guest and the Principal. Class Representatives, Bus Proctors, and Society Secretaries from various departments also took their oaths to serve with dedication.\n\nAcademic excellence was recognized through the distribution of merit scholarships among top-performing students of Intermediate, BS Home Economics, and ADP programs.\n\nThe chief guest and guest of honour distributed prizes and encouraged the students to continue striving for excellence in their academic and co-curricular pursuits.\n\nThe ceremony also celebrated the college’s outstanding achievements in sports, where students brought laurels in intercollegiate and national-level competitions.\n\nThe institute proudly retained its title as the “Overall Best College” in the Federal Board Intercollegiate Sports Competitions 2024–2025.\n\nSpecial appreciation was extended to students and Ma’am Shazia Kamal for their remarkable contributions to this success.\n\nThe outgoing Student Council was presented with Letters of Appreciation in recognition of their committed service during the 2024–2025 session.\n\nThe newly elected President, Ms. Seemab Iqbal, expressed gratitude in a heartfelt vote of thanks, acknowledging the support of the Principal, faculty, and fellow students.\n\nAdding a touch of inspiration, Hina Ali and Shifa-e-Aima presented a soulful Kalam-e-Iqbal, filling the atmosphere with patriotic fervor and reflection.\n\nIn their concluding remarks, the guests and Principal lauded the students’ accomplishments and leadership qualities.\n\nThe ceremony ended on a joyous note with the presentation of souvenirs, group photographs, and a cake-cutting ceremony, marking the beginning of a new chapter of student leadership and excellence at the institute.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/images-27.jpg",
  "retrievedAt": "2025-11-03T12:34:54.260Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/institute-of-home-economics-holds-annual-prize-distribution-and-investiture-ceremony/",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T12:32:09.000Z"
}
