{
  "title": "Marriage halls, restaurants fined in Gujrat",
  "author": null,
  "content": "GUJRAT, Nov 03 (APP):Teams from the Punjab Food Authority (PFA) Gujrat conducted a series of inspections across marriage halls, restaurants, and shops, imposing fines on several establishments for violations of food safety regulations.\n\nAccording to a PFA spokesperson, penalties were levied for issues such as poor hygiene, the use of substandard ingredients, and unsanitary conditions. In addition, unfit food items were immediately discarded on the spot to prevent any risk to public health.\n\nDuring the operation, several prominent venues were fined, including Al-Maida Marquee in Jallalpur Jattan, which faced a Rs30,000 fine, and Grand Marquee on GT Road, Gujrat, which was fined Rs25,000. Dewan-e-Faiz Banquet Hall was penalized Rs20,000, Nemat-e-Shanwari Restaurant Rs18,000, and Empire Palace Rs15,000. One Stop Sweets in Jallalpur Jattan was fined Rs15,000, while Karachi Naseeb Biryani in Karyanwala and Al-Rehmat Marriage Hall in Jallalpur Jattan each faced fines of Rs10,000.\n\nOther establishments also received penalties, including Parvez Fruit Chat and Burger Point, which were fined Rs8,000, Ahmad Malik Shop in Santal Rs4,000, and Al-Murad Chicken Shop Rs3,000. A milk carrier vehicle was fined Rs5,000, and 5.1 kilograms of unfit food items were disposed of during the operation.\n\nDistrict administration and PFA officials emphasized that strict action would continue against violators of food safety laws, reaffirming their commitment to ensuring public health and the quality of food served to citizens.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/07/pfa-white.png",
  "retrievedAt": "2025-11-03T12:49:35.669Z",
  "source": "APP",
  "link": "https://www.app.com.pk/domestic/marriage-halls-restaurants-fined-in-gujrat/",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T12:46:47.000Z"
}
