{
  "title": "Ahsan Iqbal inaugurates 2nd edition of PIMEC 2025",
  "author": null,
  "content": "KARACHI, Nov 03 (APP): Federal Minister for Planning, Development and Special Initiatives Prof. Ahsan Iqbal on Monday formally inaugurated a four-day 2nd edition of Pakistan International Maritime Expo and Conference (PIMEC) 2025 here at Expo Centre.\n\nThe inaugural ceremony was attended by Minister of Transport and Logistic Services of Kingdom of Saudi Arabia His Excellency Engineer Saleh bin Nasser Al Jasser, Governors of Sindh Kamran Khan Tessori and Balochistan Governor Jaffar Khan Mandokhel, Sindh Chief Minister Syed Murad Ali Shah, Chief of the Naval Staff Admiral Naveed Ashraf NI (M), and others.\n\nAddressing the ceremony, Ahsan Iqbal said that Pakistan was blessed with a 1,050 kilometer coastline, exclusive economic zone of nearly 290,000 square kilometers and vast offshore potential in renewable energy, fisheries, and mineral resources.\n\nHe said that the maritime sector despite these advantages currently contributes less than 1 percent to GDP, compared to 4–7 percent  in many maritime nations. This gap represented untapped opportunity and a strategic imperative for national development.\n\nWhile terming Pakistan as a natural maritime bridge between the East and the West, he said that Pakistan had a unique geography position, where South Asia, Central Asia, the Middle East, and Africa converge.\n\nThe minister said that according to UNCTAD 2024, over 80 percent of global trade by volume and 70 percent by value is carried out by sea.\n\nHe said, “The global Blue Economy today contributes more than $2.5 trillion annually to world GDP, and sustains over 350 million jobs across shipping, ports, fisheries, energy, coastal tourism, and emerging marine industries.”\n\nHe was of the view that if Blue Economy were a nation, it would be the seventh largest economy in the world.\n\nThe Planning Minister said that oceans had re-emerged as the highways of global commerce, energy, and communication  and nations that harness them wisely were shaping the future of economic power.\n\nAhsan Iqbal said that Pakistan International Maritime Expo and Conference was not just an event it was a movement to reimagine Pakistan’s economic destiny from the land to the sea.\n\nHe said that PIMEC provided a powerful platform for partnerships among government, industry, academia, and the international community.\n\nHe stressed to forge collaborations through this forum in shipbuilding and logistics, marine biotechnology and aquaculture, digital port management and artificial intelligence, renewable offshore energy and coastal tourism and services.\n\nHe said that Pakistan welcomed international partners to join hands in investment, innovation, and capacity building.\n\nTogether, we can transform the Indian Ocean region into a hub of sustainable trade, growth, and peace, he added.\n\nThe Minister said, “This prestigious event is not only a showcase of Pakistan’s maritime potential but also a global platform for partnership, innovation, and shared prosperity.”\n\nHe also commended Pakistan Navy and Ministry of Maritime Affairs for organizing the event that places Pakistan at the crossroads of global maritime dialogue and opportunity.\n\nSpeaking on URAAN Pakistan initiative, Iqbal said we embark on the journey to a $1 trillion economy by 2035 and Blue Economy would be one of anchors of export-led growth under the visionary leadership of the prime minister.\n\nThe Minister said that under URAAN Pakistan 5Es framework included Exports, E-Pakistan, Equity & Empowerment, Environment (including Food & Water Security), and Energy & Infrastructure.\n\nHe further said that eight key drivers of export-led growth had been identified, which would propel Pakistan toward its goal of $100 billion in annual exports by 2035.\n\nIqbal said that Pakistan was undertaking a series of strategic initiatives including modernization of Karachi, Port Qasim, and Gwadar Ports into smart, green, and efficient logistics hubs.\n\nOn the occasion, Minister of Transport and Logistic Services of Kingdom of Saudi Arabia His Excellency Engineer Saleh bin Nasser Aljasser said, ‘I am deeply honoured to be here in Pakistan.’\n\nHe said that PIMEC was an important international event. He said that Saudi Arabia and Pakistan had brotherly and deep relations.\n\nEarlier, Commander Karachi Vice Admiral Muhammad Faisal Abbasi thanked federal and Sindh governments for PIMEC arrangements.\n\nLater, Ahsan Iqbal presented souvenirs and visited stalls along with Minister of Transport and Logistic Services of Kingdom of Saudi Arabia Engineer Saleh bin Nasser Al Jasser.",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2022/09/Fall-Back-Image-2.png",
  "retrievedAt": "2025-11-03T16:19:32.653Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-inaugurates-2nd-edition-of-pimec-2025/",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T15:40:21.000Z"
}
