{
  "title": "Ambassador Masood Khan calls for national narrative, digital literacy & state readiness to combat AI-driven disinformaion",
  "author": null,
  "content": "ISLAMABAD, Nov 03 (APP):Masood Khan, Pakistan’s former Ambassador to the United States, China, and the United Nations and former President of Azad Jammu and Kashmir on Monday urged the nation to prioritize cohesive narrative building, digital literacy, and institutional preparedness to counter the growing threat of disinformation in the age of artificial intelligence.\n\nSpeaking at a seminar hosted by the Centre for Law and Security (CLAS), Ambassador Masood Khan warned that Pakistan must brace for the growing threat of misinformation and disinformation in the age of artificial intelligence.\n\nHe noted that while disinformation is not new, AI has amplified its impact with unmatched speed and sophistication.\n\nReflecting on his long association with internet governance since his role as Chair of the World Summit on the Information Society (WSIS) on Internet Governance in 2005, Ambassador Khan underscored how disinformation, historically considered a “legitimate weapon of war,” has now evolved into a powerful strategic tool in modern conflicts.\n\nHe cited examples from global and regional history, including wars between India and Pakistan and the information operations surrounding the global war on terror, to highlight how narrative-building has always played a central role in national security. “Today, AI-driven content, deep fakes, and algorithmic manipulation have made perception management a battlefield in itself,” he said.\n\nAmbassador Khan elaborated on the distinction between information warfare and disinformation, noting that the former involves building a nation’s narrative and legitimacy during peace and conflict, while the latter involves the deliberate distortion of facts. “Disinformation feeds on speed. Before a false story can be corrected, millions have already seen and believed it,” he observed. He warned that unchecked disinformation campaigns could weaken national unity and distort public understanding of geopolitical realities.\n\nOutlining the strategic response, Ambassador Khan called for “authentic actions on the ground, systematic narrative-building, and national cohesion from north to south, east to west.” He said that effective counter-disinformation strategy must begin with internal nation building unifying the country politically, economically and socially and must be supported by state capacity and citizen awareness. “If a nation is fragmented, its narrative will collapse under external manipulation,” he cautioned.\n\nHighlighting Pakistan’s rapid digitalization and growing academic base in new technologies, Ambassador Khan praised the country’s progress, noting that 275 universities are now teaching emerging technologies including artificial intelligence, cybersecurity, blockchain, and the internet of things.\n\nHe emphasized that Pakistan’s large freelancer community and global digital connectivity position it well to build technological capacity, but warned that “digital advancement must go hand-in-hand with information integrity.”\n\nCiting recent information conflicts with India, Ambassador Khan contrasted Pakistan’s disciplined and credible communication with what he termed “India’s exaggerated and farcical propaganda.” He noted that India’s disinformation attempts during recent crises backfired, as even Indian citizens and global media questioned official claims. “Our people remained confident and composed because our moral, legal, and political position was stronger; we were defending ourselves against aggression,” he said.\n\nAmbassador Khan also urged think tanks and research centres to collaborate in formulating a legal and institutional framework for countering disinformation and developing expertise in “lawfare” the use of legal tools to fight information warfare. “We must master both the benign and malign dimensions of emerging technologies to build narratives in peace and to protect truth in conflict,” he said, stressing that narrative discipline, strategic communication, and digital literacy were as vital as conventional military strength in modern geopolitics.\n\nConcluding his remarks, Ambassador Masood Khan stated that Pakistan, as a nuclear power and an emerging economy, “has no existential choice but to invest in digital resilience.” He urged policymakers, academics, and media professionals to recognize that in the evolving information age, “wars are no longer fought only with weapons, but with words, algorithms, and perceptions.” He closed with a call for unity, awareness, and responsibility: “Let us ensure that truth, not technology, defines our destiny.”\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/Masood-Khan.jpg",
  "retrievedAt": "2025-11-03T12:35:39.229Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ambassador-masood-khan-calls-for-national-narrative-digital-literacy-state-readiness-to-combat-ai-driven-disinformaion/",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T12:32:09.000Z"
}
