{
  "title": "SDPI’s 28th Sustainable Development Conference begins Tuesday, featuring over 45 sessions with global experts",
  "author": null,
  "content": "ISLAMABAD, Nov 03 (APP): Islamabad is set to host one of South Asia’s most significant intellectual and policy gatherings as the Sustainable Development Policy Institute (SDPI) on Tuesday inaugurating its 28th Sustainable Development Conference (SDC) under the theme “Sustainable Development in the Emerging World Dis|Order.”\n\nThe four-day conference, being held at Allama Iqbal Open University (AIOU) from November 4–7, is being organized alongside three major regional events — the 16th South Asia Economic Summit (SAES), the Third Sustainability Investment Expo (SIE), and the Ninth South and South-West Asia Subregional Forum on Sustainable Development (UNESCAP), said a press release on Monday.\n\nBringing together over 45 interactive sessions, the conference will gather parliamentarians, policymakers, development practitioners, business leaders, diplomats, and academics from Pakistan, South Asia, the United States, and beyond.\n\nParticipants will deliberate on a diverse set of issues, including sustainable finance, climate resilience, circular economy, COP30, SDGs, green agriculture and food systems, just energy transition, renewable energy, telecom and AI, disaster risk reduction, sustainable cities, green skills, and social equity.\n\nThe inaugural plenary will be graced by Federal Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal as the chief guest, along with UN Resident Coordinator Mohamed Yahya, Syeda Rizwana Hasan, Advisor to the Ministry of Environment and Climate Change, Bangladesh, and Professor Kazuhiko Takeuchi, President of Japan’s Institute for Global Environmental Strategies (IGES).\n\nLater in the day, Federal Minister for Climate Change, Senator Dr. Musadik Malik, will inaugurate the Sustainability Investment Expo, featuring innovative solutions in green finance, smart mobility, and renewable energy.\n\nA high-level strategic dialogue on accelerating the Sustainable Development Goals (SDGs) will be co-chaired by UNESCAP Executive Secretary Ms. Armida Salsiah Alisjahbana and SDPI Executive Director Dr. Abid Qaiyum Suleri.\n\nThe closing plenary, titled “Unlocking Circular Opportunities in Plastics and Agri-Food Systems,” will feature Minister for National Food Security and Research & Minister of Industries and Production Rana Tanveer Hussain as the chief guest, with Romina Khurshid Alam, Coordinator to the Prime Minister on Climate Change and Environmental Coordination, as the guest of honour.\n\nAccording to the organizers, the conference provides a unique platform for regional cooperation and policy dialogue at a time when the world faces escalating challenges in sustainability, economic growth, and climate change.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/11/WhatsApp-Image-2025-11-03-at-7.44.16-PM.jpeg",
  "retrievedAt": "2025-11-03T16:20:28.546Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sdpis-28th-sustainable-development-conference-begins-tuesday-featuring-over-45-sessions-with-global-experts/",
  "dateList": "2025-11-03",
  "date_published": "2025-11-03T15:40:21.000Z"
}
