{
  "title": "Ulema condemn terrorist attack on Pak Army, security institutions",
  "link": "https://www.app.com.pk/national/ulema-condemn-terrorist-attack-on-pak-army-security-institutions/",
  "date_published": "2022-01-28T17:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP):Ulema of all schools of thought and religious scholars of other religions Friday condemned the terrorist attack on Pakistan Army and other security institutions in Balochistan.\nAssuring their full support to the government and the Chief of Army Staff General Qamar Javed Bajwa, they said they were standing by Pakistan Army and ready to render any kind of sacrifice for the peace, security and stability of the country.\nThe said the nation was proud of Pakistan Army’s martyrs who laid their lives in the line of their duty.\nThey said the enemy wanted to demolish the security and stability of the country but Ulema hand in hand with all segments of the society would foil the nefarious designs of the enemy.\nThey said the enemy was kept on trying to demolish the security and stability of the country while Pakistan Army and rest of the national security institutions were continuously rendering sacrifices for the security and safety of the nation and country.\nThe Ulema and religious scholars prayed for the elimination of all the extremist and terrorist elements in the country and high rank of martyrs in Jannah along with early recovery of injured and patient to the bereaved families.\nPrime Minister’s aide on interfaith harmony and Pakistan Ulema Council Chairman Hafiz Tahir Mehmood Ashrafi, Allama Abdul Haq Mujahid, Maulana Asad Zakriya Qasmi, Maulana Mufti Abdul Rahim, Pir Naqeeb-ur-Rehman, Sahibzada Hassan Haseeb-ur-Rehman, Maulana Mufti Muhammad Zubair, Maulana Syed Zia Ullah Shah Bukhari, Allama Arif Wahidi, Allama Muhammad Hussain Akbar,\nDr Raghib Hussain Naeemi, Allama Afzal Haidri, Maulana Hamid-ul-Haq Haqqani, Maulana Syed Yousuf Shah, Maulana Muhammad Khan Laghari, Maulana Nauman Hashir, Maulana Abu Bakr Hameed Sabri, Maulana Muhammad Aslam Siddiqui, Maulana Professor Abu Bakr Siddique, Allama Tahir-ul-Hassan, Maulana Abaidullah Gormani, Maulana Muhammad Shafi Qasmi,\nMaulana Aziz Akbar Qasmi, Maulana Peer Asad Habib Shah Jamali, Church of Pakistan BishopAzad Marshal, Bishop Arshad Joseph, Sardar Bushan Singh, Dr Mehndar, Dr Paul Bhatti and others expressed these views in a joint communique.",
  "retrievedAt": "2025-08-11T14:12:16.798Z"
}
