{
  "title": "SBP (Amendment) Bill-2022 sails through Senate",
  "link": "https://www.app.com.pk/national/sbp-amendment-bill-2022-sails-through-senate/",
  "date_published": "2022-01-28T08:12:00.000Z",
  "source": "APP",
  "content": "The Senate on Friday passed the SBP Act, 1956 [The State Bank of Pakistan (Amendment) Bill 2022 after clause-by-clause reading with majority vote amid opposition’s noisy protest.\nThe bill, tabled by Minister for Finance and Revenue Shaukat Fayaz Ahmed Train, was passed through the vote-count.\nThe bill sailed through a majority vote of 43 against 42.\nEarlier, the motion on the bill was passed with a tie-breaking vote of Chairman Muhammad Sadiq Sanjrani as the both treasury and opposition benches’ votes were 43 each.\nThe bill, already passed by the National Assembly on January 13, 2022, was aimed at providing for the constitution of the SBP to achieve domestic price stability by regulating the monetary and credit system of Pakistan and, without prejudice to this primary objective.\nThe bill proposes to contribute to the stability of the financial system of Pakistan and supporting the general economic policies of the Federal Government to foster development and fuller utilization of the country’s productive resources. It authorizes the bank to have the power to acquire, hold and dispose of movable and immovable property of any kind, to enter into contracts and to undertake all activities necessary for the achievement of its objectives.\nIt suggests that the Governor and the non-executive Directors shall be appointed by the President, upon the recommendation of the federal government. The Deputy Governors shall be appointed by the Federal Government after consultation between the Minister for Finance and the Governor, from a panel of three candidates recommended by the Governor of each vacant position, in order of merit.\nThe amendments propose to exclude provisions related to the government borrowing as well the quasi-fiscal operations of the State Bank. The State Bank will, however, continue to extend refinance facilities to financial institutions with appropriate checks and balances. It also allows the SBP to be sufficiently capitalized and prescribes the necessary mechanism to achieve the desired level of capital overtime, through both statutory reserves as well as retained earnings.\nEarlier, the House also passed the National Metrology Institute of Pakistan Bill-2022 unanimously, which was presented by Minister for Science and Technology Shibli Faraz",
  "retrievedAt": "2025-08-11T14:12:14.519Z"
}
