{
  "title": "Six militants killed in Karak security operation - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: Six militants were killed in an intelligence-based operation (IBO) by security forces in Karak district on Friday.\n\nAccording to a statement issued by the Inter-Services Public Relations (ISPR), the operation was launched on the reported presence of “khawarij”, an official term used for militants of the banned Tehreek-i-Taliban Pakistan (TTP) and the so-called Lashkar-i-Islam and Jamaatul Ahrar.\n\n“During the conduct of the operation, own troops effectively engaged the khawarij location; resultantly, six khawarij were sent to hell,” the ISPR statement said.\n\nThe statement added that a sanitisation operation was underway to clear the area of any remaining militants.\n\nTwo civilians die in attack on Bannu police post\n\nIt reiterated the security forces’ commitment to eliminating terrorism from the country.\n\nMeanwhile, two civilians were killed in an attack on a police post in Bannu district on Thursday night.\n\nQuoting residents, a police official said that Sadiq, a vegetable vendor, and Maqsood, a medical technician, were hit by bullets while passing by the Kinger Bridge police post on motorcycles.\n\nThe attack was carried out by unidentified assailants.\n\n“Both of them were passing along the police post on their motorcycles at the time of firing from an unknown direction,” the official said.\n\nThe official said that the relatives of the deceased also claimed that both the civilians lost their lives in a militant attack on the police post. An investigation was underway to identify the attackers.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/151700335ce73a3.png?r=173619",
  "retrievedAt": "2025-08-25T19:56:38.589Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893502/six-militants-killed-in-karak-security-operation",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:13:34.000Z"
}
