{
  "title": "Housing minister directs FGEHA for steps to complete stalled projects - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Minister for Housing and Works Mian Riaz Hussain Pirzada on Friday directed the Federal Government Employees Housing Authority (FGEHA) to take steps for the completion of stalled projects.\n\nA numbers of projects of FGEHA, a subsidiary of the housing ministry, have been facing delays for years. These included Green Enclave Bhara Kahu and stalled sectors F-14, F-15, Kashmir Apartment project, Lifestyle Afro Apartment, Park Road Housing Scheme and Skyline Apartments in Chaklala. Development work is yet to start on F-12 and G-12 as FGEHA could not get possession of the land in these two sectors.\n\nAn official of FGEHA said that F-14 and F-15 faced delays because of long litigation; however, he said their PC-I was being finalised.\n\n“We are finalising PC-I of these sectors, including F-12,” he said and added that Kashmir Apartment project would also be revived soon as technical bids were going to be opened to re-award the contract of the project.\n\nSays maximum transparency should be ensured in organisation through merit-based systems\n\n“We are also working to restart development work on the Afro project as soon as possible,” he said, claiming that during the last one year or so several steps had been taken to make progress in all the stalled projects.\n\nOn the other hands, it seems Minister Pirzada at least acknowledged the hardships of the allottees and directed the FGEHA to take steps for completion of the projects.\n\n“While referring to the stalled projects of FGEHA, the minister empathetically said he was aware of the agony of members who have invested their hard-earned money and been waiting for years to get their own houses,” said a press release issued by the housing ministry. It said the minister also stated that thousands of employees, both serving and retired, had been waiting since long for the development of their plots.\n\nThe minister said this while chairing a special meeting held at the FGEHA to discuss the perspectives and significant features of a digital portal that the authority will be launching for its members next month.\n\n“The objective of automation is to enhance transparency, improve service delivery and financial sustainability by digitisation of processes. This portal featuring versatile options for registered members with speedy operations, convenience and easy access to information,” read the press release.\n\nIt said the portal will have comprehensive database with the option of online payment through 1Link. It will provide SMS alert service, user dashboard for every ongoing project, finances and transaction history, cost escalation information, complaint cell and information of ownership and liability.\n\nThe minister applauded the efforts of the whole team involved in actualising the digital portal and termed it a step towards e-governance that was among the top priorities of the government.\n\nThe minister said FGEHA was a staff welfare and not-for-profit organisation that must be service oriented. Maximum transparency should be ensured in the organisation through merit-based systems and upright administration. The minister also stressed the need to ensure a 24/7 complaint redressal system with special focus on fast and user-friendly digital mobile application.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:56:14.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893547/housing-minister-directs-fgeha-for-steps-to-complete-stalled-projects",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:25:06.000Z"
}
