{
  "title": "Trump fires top US general in unprecedented Pentagon shakeup - World - DAWN.COM",
  "author": null,
  "content": "President Donald Trump on Friday fired the chairman of the Joint Chiefs of Staff, Air Force General CQ Brown, and pushed out five other admirals and generals in an unprecedented shake-up of US military leadership.\n\nTrump said in a post on Truth Social that he would nominate former Lieutenant General Dan “Razin” Caine to succeed Brown, breaking with tradition by pulling someone out of retirement for the first time to become the top military officer.\n\nThe president will also replace the head of the US Navy, a position held by Admiral Lisa Franchetti, the first woman to lead a military service, as well as the air force vice chief of staff, the Pentagon said. He is also removing the judge advocates general for the Army, Navy and Air Force, critical positions that ensure enforcement of military justice.\n\nTrump’s decision sets off a period of upheaval at the Pentagon, which was already bracing for mass firings of civilian staff, a dramatic overhaul of its budget and a shift in military deployments under Trump’s new America First foreign policy.\n\nWhile the Pentagon’s civilian leadership changes from one administration to the next, the uniformed members of the US armed forces are meant to be apolitical, carrying out the policies of Democratic and Republican administrations.\n\nBrown, the second Black officer to become the president’s top uniformed military adviser, had been expected to complete his four-year term in September 2027.\n\nA US official said Brown was relieved with immediate effect, before the Senate confirms his successor.\n\nReuters in November was the first to report that the incoming Trump administration planned a sweeping shakeup of the top brass, with firings including Brown.\n\nDemocratic lawmakers condemned the decision by Trump, a Republican.\n\n“Firing uniformed leaders as a type of political loyalty test, or for reasons relating to diversity and gender that have nothing to do with performance, erodes the trust and professionalism that our servicemembers require to achieve their missions,” said Senator Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee.\n\nRepresentative Seth Moulton, a Massachusetts Democrat, said the firings were “un-American, unpatriotic, and dangerous for our troops and our national security”. “This is the definition of politicising our military,” he said.\n\nDuring last year’s presidential campaign, Trump spoke of firing “woke” generals and those responsible for the troubled 2021 pullout from Afghanistan. On Friday, the president did not explain his decision to replace Brown.\n\n“I want to thank General Charles ‘CQ’ Brown for his over 40 years of service to our country, including as our current Chairman of the Joint Chiefs of Staff. He is a fine gentleman and an outstanding leader, and I wish a great future for him and his family,” Trump wrote.\n\nDefence Secretary Pete Hegseth had been sceptical of Brown before taking the helm of the Pentagon with a broad agenda that includes eliminating diversity, equity and inclusion initiatives in the military.\n\nIn his most recent book, Hegseth asked whether Brown would have gotten the job if he were not Black.\n\n“Was it because of his skin colour? Or his skill? We’ll never know, but always doubt — which on its face seems unfair to CQ. But since he has made the race card one of his biggest calling cards, it doesn’t really much matter,” he wrote in his 2024 book The War on Warriors: Behind the Betrayal of the Men Who Keep Us Free.\n\nBrown, a former fighter pilot who has held commands in the Middle East and Asia, recounted experiencing discrimination in the military in an emotional video posted online after the 2020 killing of George Floyd, which sparked nationwide protests for racial justice.\n\nBrown was on official travel when Trump made the announcement. Hours before Trump’s post, Brown’s official X account had posted images of him meeting troops on the US border with Mexico, deployed in support of Trump’s crackdown on illegal immigration.\n\n“Border Security has always been critical to the defence of our homeland. As we navigate unprecedented security challenges … we will ensure our troops at the border have everything they need,” Brown posted.\n\nA spokesperson for Brown did not immediately respond to a request for comment.\n\nFranchetti was the first woman to command the US Navy. Her 2023 nomination by then-President Joe Biden had been a surprise.\n\nPentagon officials had widely expected the nomination to go to Admiral Samuel Paparo, who at the time led the navy in the Pacific. Paparo was instead promoted to lead the US military’s Indo-Pacific Command.\n\nOn his first day in office, Trump fired Admiral Linda Fagan as head of the US Coast Guard. She had been its first female commanding officer.\n\nLast month, Trump’s Pentagon lashed out Mark Milley, a retired Army general and former chairman of the Joint Chiefs of Staff, by revoking his personal security detail and security clearance. It also removed his portrait from the walls of the Pentagon.\n\nMilley, who served as the top US military officer during some of Trump’s first presidential term, became a leading critic of him after retiring as a four-star general in 2023 during Biden’s administration and has faced death threats.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/220910427a86342.jpg",
  "retrievedAt": "2025-08-25T19:56:12.557Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893584/trump-fires-top-us-general-in-unprecedented-pentagon-shakeup",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T04:38:53.000Z"
}
