{
  "title": "Stocks close below 113,000 on profit-taking - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The stock market snapped its three-day winning streak on Friday as jittery investors indulged in profit-taking towards the end of the session mainly due to growing concerns about the economy amid the contraction of large-scale manufacturing, dragging the benchmark KSE 100 index below 113,000.\n\nListing the key factors that halted the market bul­­lish drive, Ahsan Meh­anti of Arif Habib Corpo­ration told Dawn that the investor fear over the government tax reforms ahead of the IMF review next month amid revenue shortfalls and a rise in bond yields depressed market sentiment.\n\nHe added that the market turned bearish amid dismal data on LSM shrinking 3.73pc year-on-year in December and 1.87pc in the first half and concerns about a surge in repatriation of profits on foreign investments.\n\nHe also noted that weak global crude oil prices, uncertainty over the outcome of the IMF review for the release of the next tranche, and the weak rupee remained key worries for equity investors.\n\nTopline Securities Ltd noted that the KSE 100 index declined to close at 112,801, down 938.22 or 0.82pc day-on-day.\n\nThe top positive contribution to the index came from Lucky Cement, Kohinoor Textile Mills, Standard Chartered Bank (Pak) Ltd, TRG and Tariq Glass Industries Limited, as they cumulatively contributed 162 points.\n\nConversely, Cherat Ce­­ment Company Limited, MCB Bank, Abbott Labo­ratories (Pakistan) Limi­t­­ed, Habib Bank, and Pak­istan Petroleum, lost value to weigh down on the index by 300 points.\n\nAli Najib, Head of Sales at Insight Securities, said the index initially carried forward overnight posit­ive momentum as investors chose to further stre­ngthen their positions in cyclical sectors, especially in cement stocks, which supported the market to make an intraday gain of 705 points at 114,444 in the first session. However, selling headwinds in the second session wiped out early gains on profit-taking, pushing the index in the red zone.\n\nThe trading volume plu­nged 42.16pc to 545 million shares while the tra­ded value decreased 34.96pc to Rs21.52bn day-on-day.\n\nStocks contributing significantly to the traded vo­­lume included Pak Inter­­national Bulk Terminal (l35.41m shares), K-Elec­tric (24.73m shares), Gha­ni Global Glass (19.83m shares), Pak Elektron (19.00m shares) and Fauji Cement (18.57m shares).\n\nThe shares registering the most significant incr­e­ases in their share prices in absolute terms were Ne­­stle Pakistan (Rs48.71), Su­­­pernet (Rs43.75), Hoe­chst Pakistan (Rs31.02), Lucky Cement (Rs26.60) and Ghandhara Auto­mobiles Ltd (Rs17.20).\n\nThe companies registering significant decreases in their share prices in ab­­solute terms were Unile­v­­er Foods (Rs215.00), Raf­han Maize (Rs147.67), Ab­­bott Laboratories (Rs80.86), Pakistan Engineering Co­­m­­pany Ltd (Rs40.02) and Bata Pakistan (Rs27.80).\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b9215d67d15.gif",
  "retrievedAt": "2025-10-12T01:35:04.178Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893535/stocks-close-below-113000-on-profit-taking",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:13:48.000Z"
}
