{
  "title": "US pushes Zelensky to sign deal on mineral resources - World - DAWN.COM",
  "author": null,
  "content": "KYIV: Ukrainian President Volodymyr Zelensky faced pressure on Friday to sign a deal to hand the United States preferential access to Ukraine’s mineral deposits following harsh criticism from US President Donald Trump.\n\nTrump wants Ukraine to give US companies access as compensation for the tens of billions of dollars of aid delivered under his predecessor Joe Biden. But Ukraine is seeking security guarantees from the United States in exchange for signing away precious rights to vast amounts of its natural resources and critical minerals.\n\nMike Waltz, Trump’s national security adviser on Friday predicted that Zelensky would sign the deal soon.\n\n“Look, here’s the bottom line, President Zelensky is going to sign that deal, and you will see that in the very short term, and that is good for Ukraine,” Waltz told a conference on the outskirts of Washington on Friday.\n\nTrump’s top advisers have doubled down on their attacks on Zelensky in recent days, after Trump branded him a “dictator” and falsely claimed Ukraine had “started” the war with Russia.\n\nThe war of words has stunned Kyiv and European capitals, a sign of just how rapidly Trump is overhauling Washington’s long-standing support for Ukraine as he opens talks with Moscow on a settlement to the conflict. The United States had been Ukraine’s most important financial, military and political backer since Russia invaded in Feb 2022, in what the West’s top powers had condemned as an unprovoked and illegal war of aggression.\n\nA senior Ukrainian official said that despite the tensions between Zelensky and Trump, talks on a possible agreement were “ongoing”. “There is a constant exchange of drafts, we sent another one yesterday,” the Kyiv source said, adding that Ukraine was now waiting for a US response.\n\nKyiv had rejected a first attempt by Trump’s team to strike a deal for Ukraine’s natural resources, saying the proposal did not include security guarantees for Kyiv — a move that infuriated Trump.\n\nThree-year war\n\nUkraine is pressing for Nato membership or for the deployment of Western troops and masses of advanced equipment as part of any wider ceasefire agreement with Russia. Zelensky said earlier this week he would not “sell” Ukraine in any deal with the US.\n\nThe spat risks undermining Western support for Kyiv at a critical juncture in the conflict, ahead of the three-year anniversary of Russia’s invasion on Sunday.\n\nRussia’s army on Friday said it had captured two more villages in eastern Ukraine. Europe has also been left scrambling to respond, though Zelensky has held a flurry of calls in recent days with European leaders reiterating their support for Ukraine, including French President Emmanuel Macron and the leaders of Finland and Denmark.\n\nMacron will travel to Washington next week where he will tell Trump: “You can’t be weak with President Putin,” he said in an address on Thursday. British Prime Minister Keir Starmer will also visit Trump, as Paris and London seek to marshal Europe’s response to the Republican’s first month in office.\n\n‘Despised’\n\nZelensky met this week in Kyiv with Trump’s envoy Keith Kellogg whose description of meetings with Ukrainian officials came in stark contrast with rhetoric from his counterparts in Washington. In a social media post Kellogg called Zelensky “the embattled and courageous leader of a nation at war”.\n\nZelensky said earlier he had briefed Kellogg on the frontline situation and said “strong Ukraine-US relations benefit the entire world”. But in Washington there was little sign Trump’s team was looking to dial down tensions.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:56:24.598Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893526/us-pushes-zelensky-to-sign-deal-on-mineral-resources",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:14:08.000Z"
}
