{
  "title": "Sindh govt, OPP introduce two scholarships at Oxford University - Pakistan - DAWN.COM",
  "author": null,
  "content": "LONDON: The Sindh gov­e­r­nment, in partnership with the Oxford Pak­istan Programme (OPP), has introduced two graduate scholarships named after Benazir Bhutto and Zulfikar Ali Bhutto.\n\nThe scholarships aim to support talented students from Sindh in pursuing higher education at the University of Oxford.\n\nThe announcement was made by Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto-Zardari and Sindh Chief Minister Syed Murad Ali Shah during their official visit to Oxford University.\n\nDuring the visit, Mr Bil­awal attended a luncheon hosted by Lady Mar­garet Hall (LMH) Principal, Pro­fessor Stephen Blyth, whe­re he was briefed on OPP’s initiatives to create educational opportunities for Pak­istani students from underprivileged backgrounds.\n\nEach year, six outstanding students will receive financial support to pursue graduate degrees\n\nThe event was also atte­nded by Sanam Bhutto, sister of Benazir Bhutto, and author Victoria Schofield.\n\nEach year, six outstanding students from Sindh will receive financial support to pursue graduate degrees at LMH.\n\nThree scholarships will be awa­rded to women under the Shaheed Benazir Bhutto Scholarship and three under the Shaheed Zulfikar Ali Bhutto Scholarship.\n\nLast year, OPP awarded scholarships to three students, two from Sindh and one from Balochistan.\n\nBilawal praised the initiative, stating, “OPP is creating opportunities for Pakistanis, especially talented students from underprivileged backgrounds.\n\n“I thank the govt of Sindh and Balochistan for collaborating with OPP to support students from their provinces.”\n\nSindh Chief Minister Murad Ali Shah added that the scholarships would equip students with knowledge and skills to contribute to their communities.\n\nBalochistan was the first province to partner with OPP, and Secretary of Fin­ance Imran Zarkoon Khan expressed pride in this milestone, hoping it would inspire students from the province to excel at Oxford and drive development in Balochistan.\n\nSince its inception, OPP has provided over £600,000 in financial assistance, supporting 48 Pakistani graduate scholars at Oxford.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/220903399d5f904.jpg",
  "retrievedAt": "2025-08-25T19:56:39.093Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893503/sindh-govt-opp-introduce-two-scholarships-at-oxford-university",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:13:34.000Z"
}
