{
  "title": "US urges backing of ‘simple’ resolution as Trump calls for Putin-Zelensky talks - World - DAWN.COM",
  "author": null,
  "content": "The United States urged UN members to back its “simple, historic” resolution on the Ukraine war, which diplomatic sources said omits mention of Kyiv’s territory occupied by Russia.\n\nWashington’s proposal, seen by AFP, appears to rival a separate draft resolution produced by Kyiv and its European allies — countries that US President Donald Trump has sought to sideline from talks on the future of the three-year-old war between Russia and Ukraine.\n\nContrary to the Ukrainian-European proposal which blames Russia for the invasion and commits to Kyiv’s “territorial integrity”, the US’s 65-word draft proposal does not criticise Moscow. Instead, it calls for a “swift end to the conflict” without mentioning Kyiv’s territorial integrity.\n\nIt also begins by “mourning the tragic loss of life throughout the Russia-Ukraine conflict”, before “reiterating” that the United Nations’ purpose is the maintenance of “international peace and security”, without singling out Moscow as the source of the conflict.\n\nCalling it a “simple, historic resolution”, US Secretary of State Marco Rubio urged UN member states on Friday “to support [the US draft] in order to chart a path to peace”.\n\nThe US draft was welcomed by Moscow’s ambassador to the UN Vassily Nebenzia as “a good move” but stressed that it did not address the “roots” of the conflict.\n\nEarlier this week, Ukrainian President Volodymyr Zelensky had complained that his country had been left out of talks between US and Russian officials prompting an attack from Trump who called Zelensky a “dictator without elections”. He also falsely blamed Ukraine for starting the war.\n\nBut Trump on Friday appeared to shift away from his criticisms and said that Zelensky and Russian President Vladimir Putin will have to “get together” to bring an end to the conflict.\n\n“President Putin and President Zelensky are going to have to get together … We want to stop killing millions of people,” Trump told reporters in the Oval Office.\n\nHe added Kyiv would “hopefully in the next fairly short period of time” sign a deal handing Washington preferential access to Ukraine’s mineral deposits.\n\nThe minerals deal has become a major sticking point in the increasingly fraught relations between Washington and Kyiv.\n\nTrump wants Ukraine to give US companies access to its vast natural resources as compensation for the tens of billions of dollars of aid delivered under his predecessor Joe Biden.\n\n“They’re very brave, in every way you can imagine. But we are spending our treasure on some country that’s very, very far away,” Trump said of Ukraine.\n\nIn return, Ukraine is seeking security guarantees from the United States for signing away the precious rights. Zelensky — who had rejected the agreement — said on Friday he hoped for a “fair result”.\n\nEarlier that day, Trump described Ukraine as at a disadvantage in the negotiations, further alarming allies who think he will offer concessions to Putin.\n\n“I’ve had very good talks with Putin, and I’ve had not such good talks with Ukraine. They don’t have any cards,” Trump said at the White House.\n\nHe also said during a Fox News interview on the same day that it was not “very important” for Zelensky to be involved in US-Russia talks.\n\nThe US president — who has repeatedly expressed admiration for Putin — again declined to blame Moscow for the February 2022 invasion, saying that the Russian leader “attacked but they shouldn’t have let him attack”. Trump also said that Putin faced no pressure to make a deal.\n\n“He doesn’t have to make a deal, because if he wanted, he’d get the whole country,” Trump said.\n\nFrench President Emmanuel Macron and British Prime Minister Keir Starmer, who are both due at the White House next week for potentially tricky discussions, have been accused by Trump of doing nothing to end the war.\n\nMacron said on Friday he will tell Trump that “you can’t be weak with President Putin”.\n\nOn the ground, both sides in the war are trying to improve their position on the battlefield amid Trump’s push for a ceasefire. Russia’s army on Friday said it had captured two more villages in eastern Ukraine.\n\nWith Europe shaken by the new US stance on the conflict, Ukraine got renewed support from German Chancellor Olaf Scholz. “We won’t leave Ukraine alone and decide things over their heads,” he said on Friday at his last major campaign event before weekend elections.\n\nAfter speaking to Scholz and other regional leaders, Zelensky said in his televised evening address that “Europe must and can do much more to ensure that peace is actually achieved” in Ukraine.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/22180533b5bacc9.jpg",
  "retrievedAt": "2025-08-25T19:56:08.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893617/us-urges-backing-of-simple-resolution-as-trump-calls-for-putin-zelensky-talks",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T13:12:38.000Z"
}
