{
  "title": "Slew of small tremors prevent major quakes, experts say - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Around 20 low-intensity earthquakes jolted Pakistan in the first half of February — an average of more than one tremor each day.\n\nWhile recurring reports of quakes tend to make people anxious, experts say these minor seismic activities are actually a silver lining.\n\nSuch jolts “preempt” high-intensity earthquakes by constantly releasing accumulated energy within the plates.\n\nIn the Himalayan region, major seismic activity takes place on a roughly 100-year cycle, experts told Dawn.\n\nThe last major seismic events in the region were the earthquakes of 2005 and 2015.\n\nPakistan shifting towards satellite tracking to monitor seismic activity, improve early warning capabilities\n\nThe former claimed around 80,000 lives in northern Pakistan, while the latter caused widespread damage in neighbouring Afghanistan.\n\nEighty years earlier, the city of Quetta was levelled by a seven-magnitude quake, killing nearly 35,000 people.\n\nThe interluding minor tremors between major events break the momentum, preventing a sudden and bigger release of energy, according to experts monitoring the movements of tectonic plates.\n\nTectonic positioning\n\nPakistan falls on three major tectonic plates — the Arabian, Euro-Asian and Indian — which lift, subduct and provide energy and movement to each other, explains Muhammad Rehan, a geological engineer.\n\nSindh and Punjab lie on the Indian plate, while the western parts of Balochistan and some areas of Khyber-Pakhtunkhwa sit on the Eurasian plate, which mainly comprises the Iranian plateau and touches the Indian plate.\n\nThis creates five seismic zones under Pakistan. The intersection of multiple fault lines means tectonic movements remain a frequent occurrence in the region.\n\nThe quantum of this activity can be gauged by the fact that around 978 aftershocks were recorded after the 2005 earthquake. By the year’s end, the number of aftershocks reached a staggering 1,778.\n\nSince then, satellite data has shown the mountains above the epicentre have risen by a few meters.\n\nThe movement and formation of mountains are linked with earthquakes as the seismic activity pushes the rocks up, creating giant, steep structures.\n\n“This movement of the Himalayas shows they are still in a formative stage. In other words, the very region where Pakistan exists is still being formed and is fluid,” Mr Rehan explains.\n\n‘Routine matter’\n\nAccording to Volcano Discovery, a website monitoring earthquakes, the intensity of 11 of the 20 jolts reported in February was over four on the Richter scale. Seven of them fell between three and four intensity scale and two between two and three.\n\nSince January, major urban centres, including Islamabad, Rawal­pindi, Quetta, Swat, Zhob, Sherani, Sibi and Kalat, have been hit by tremors of varying intensities.\n\nExperts told Dawn that the increased reporting of seismic activities is because a lot more tremors, even the minor ones, are now being detected due to the development of geological reporting technology.\n\nNajeeb Ahmed, a director at the National Seismic Monitoring Centre, said the general perception of increased seismic activity in the recent past was due to two reasons.\n\n“Firstly, it is the expanding monitoring network and reports. Secondly, social media is spreading these reports far and wide.”\n\nAccording to Mr Ahmed, since the 2005 earthquake, Pakistan has set up 35 well-equipped monitoring centres capable of measuring tremors between 1.5 and 8.5 intensity.\n\nEven movement which is not felt on the ground because of its depth can now be registered and reported, he added.\n\nMany of these instances, even if “insignificant”, are reported by the media.\n\n“Otherwise, along the Hindu Kush plates alone, we had been observing six to seven movements every week,” said Mr Ahmed. “It is a routine matter.”\n\nNaveed Munawer, deputy director of the Geological Survey of Pakistan, which studies the country’s geology, also said nothing unusual has happened under the earth’s surface since the start of this year.\n\n“With observatories expanding, both in terms of numbers and equipment, the results are reaching the public fast,” he said.\n\nEarly warning\n\nPakistan is now moving to the Global Navigation Satellite System (GNSS), which acts as an early warning method for earthquakes.\n\nThe GNSS, which refers to any satellite constellation that provides GPS and navigation services, tracks energy gathering along and among tectonic plates and points out hot spots beforehand.\n\nOut of 20 planned observatories, 12 are already in place, while the remaining would be set up in the next two to three months, Mr Munawer added.\n\n“The system may not be able to predict the exact time of the quake but would issue early warning about building pressure.”\n\nHe said the geological monitoring in Pakistan was still not as advanced as in developed countries, but the country “is trying to catch up”.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b91be34ca69.gif",
  "retrievedAt": "2025-10-12T01:35:22.539Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893511/slew-of-small-tremors-prevent-major-quakes-experts-say",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:13:27.000Z"
}
