{
  "title": "Helmet rule cuts road crash deaths by 26pc, chief traffic officer tells LHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The traffic police chief on Friday informed the Lahore High Court that strict enforcement of the mandatory helmet rule for motorcyclists has resulted in a 26 per cent reduction in fatalities in road accidents.\n\nChief Traffic Officer (CTO) Dr Athar Waheed said helmets had been made mandatory for both motorcycle riders and pillion passengers, in addition to loader-rickshaw drivers.\n\nHe stated that the government employees found riding motorbikes without helmets would not only be fined but also reported to their respective departments.\n\nThe CTO appeared before Justice Shahid Karim during the weekly hearing on petitions related to environmental issues.\n\nHe said vacant plots should be converted into parking spaces under the public-private partnership model. He emphasised the need to discourage excessive ownership of luxury vehicles, saying that increasing public transport would help reduce traffic congestion on roads.\n\nThe CTO regretted that the owners of large and luxury vehicles consider themselves above the law.\n\nJustice Karim remarked that people lack traffic sense and do not follow their designated lanes.\n\nDr Waheed stated that work was underway to designate specific points for rickshaws, similar to the government’s initiative for handcarts. He said providing designated points for rickshaws would help manage traffic better.\n\nHe suggested that the driving licence fees should be reduced for women and transgender individuals. He also advocated for greater participation of women in public transport driving.\n\nAccording to the CTO, at least 18,000 women have been trained in driving so far.\n\nHe pointed out that teams had been deployed to inspect markets for licencing issues, which are expected to be resolved within a month.\n\nThe judge remarked that introducing electric buses on main routes would help reduce pollution, as many vehicles emit excessive smoke and relevant agencies often fails to act.\n\nDr Waheed also proposed that schools without transport facilities should not be allowed registration. The judge also endorsed the proposal, however, noted that the government had not been taking adequate measures on this issue.\n\nHighlighting the challenges faced by traffic police, the CTO said traffic wardens had a tough job, citing a recent incident where a warden was hit by a vehicle. He suggested that wardens should receive a health risk allowance.\n\nThe CTO also emphasised the need for special parking arrangements at locations such as Aiwan-i-Adl, the high court, Model Town courts and Neela Gumbad.\n\nHe pointed out that traffic police submitted recommendations to the government to introduce legislation regarding professional beggars. He said measures are needed to be taken to curb begging on footpaths and in parks in particular.\n\nRegarding ongoing events, Dr Waheed informed the court that as many as 25,000 people attended the Horse and Cattle Show, and yet the traffic remained uninterrupted. He said diversions were implemented in a limited area on The Mall due to cricket teams’ movement in the city.\n\nJustice Karim observed that those who follow traffic laws should be encouraged by the authorities.\n\nWasa legal advisor Mian Irfan Akram submitted a report to the court, saying there were 612 service stations in nine towns of Lahore. Out of them, he said, 556 stations were working with water recycling plants and 18 stations were found with dysfunctional plants.\n\nHe said five service stations had been sealed, while cases had been registered against others for violating the law.\n\nThe hearing was adjourned for the next week.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:35:23.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893443/helmet-rule-cuts-road-crash-deaths-by-26pc-chief-traffic-officer-tells-lhc",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:14:22.000Z"
}
