{
  "title": "PTCL to link new internet cable today - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakis­tan Telecommunication Company Limited (PTCL) has announced a new undersea fibre-optic cable, set to come online by 2026.\n\nThe Africa-1 Submarine Cable will be connected to PTCL’s landing station at Karachi Seaview today (Saturday), the company said in a notice to the Pakistan Stock Exchange (PSX).\n\nThe $59.5 million project, approved in Nov­ember 2020, will take another year before it becomes operational for end users.\n\n“The initiative is designed to enhance connectivity between the UAE, Europe, and Africa, featuring multiple landing stations along the route.”\n\nAccording to sources, after the landing, it will take approximately one more year to develop the necessary internet infrastructure within the country to make the cable operational.\n\nThis includes the installation of various equipment and the construction of supporting facilities, they said.\n\nThe project will be “ready for service” in the first quarter of 2026, said the PTCL notice.\n\nThis is the second cable to have landed in Pakistan in as many months.\n\nEarlier in December, Transworld Associates linked the Africa-2 cable to its landing station in Karachi. It is also expected to come online by next year.\n\nCurrently, six cables, with a capacity of 13tpbs, bring internet to Pakistan: AAE-1, SMW-4 and IMEWE, managed by PTCL; and SMW-5 and TWA-1, operated by Trans World Associates.\n\nCyber Internet Services operates the sixth cable named Pakistan and East Africa Connecting Europe (PEACE).\n\nAccording to IT experts, the linking of a new cable is a “significant step towards enhancing Pakistan’s digital infrastructure”.\n\nWahajus Siraj, the CEO and co-founder of Nayatel, an internet service provider, said with the additional capacity, Pakistan needs a significant reduction in the wholesale internet bandwidth prices.\n\n“In India, 1,000 Mbps retail broadband is sold at around Rs13,000 per month, whereas in Pakistan, this costs at least 10 times more,” he claimed and sought PTA’s intervention to regulate the wholesale internet prices and delink it with US dollar.\n\nAnother expert who didn’t want to be named said the government should also ensure that legitimate internet traffic is not subjected to any disruption.\n\nHe referred to the recently installed national firewall, which resulted in outages and the slowdown of the internet.\n\nMuhammad Umair Nizam of Pakistan Software Houses Association (P@SHA) said that as of January 2025, Pakistan ranks 98th globally in mobile internet speeds, with a median download speed of 34.78 Mbps, and 144th in fixed broadband speed, with a median download speed of 26.33 Mbps.\n\n“These figures are below the global averages, underscoring the need for improved connectivity.”\n\nAccording to Mr Nizam, enhanced bandwidth, reduced latency, and greater redundancy from these new cables will significantly improve Pakistan’s digital ecosystem and support the economy.\n\n“To fully realise this potential, policy measures such as tax rationalisation, ease of doing business, and targeted incentives for IT exports are essential,” said Mr Nizam.\n\nHe added that IT exports have already surpassed the $3.2bn mark, and these measures would help achieve the target of $15bn.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:35:21.396Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893510/ptcl-to-link-new-internet-cable-today",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:13:27.000Z"
}
