{
  "title": "Senators take issue with deputy chairman’s attitude - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Lawmakers raise alarm over ‘closure’ of Utility Stores\n• Rs20bn Ramazan package ready\n\nISLAMABAD: The opposition announced a boycott of Senate proceedings on Friday, after putting forth three key demands and protesting Deputy Chairman Syedal Khan Nasar’s “antagonist attitude towards the opposition”.\n\nBefore Question Hour was dispensed with due to the absence of ministers, on a motion moved by PPP Senator Shahadat Awan, Leader of the Opposition Senator Shibli Faraz demanded the declaration of a vote count on the State Bank of Pakistan (amendment) bill, which he claimed was “unlawfully withheld by the deputy chairman of Senate”.\n\nThe two other demands were an apology from the deputy chairman over his conduct and the restoration of the membership of three PTI senators, who had been suspended by the deputy chairman “for exercising their right to protest” after Mr Nasar allegedly blocked the passage of the SBP amendment bill.\n\nPointing out that Senate Chairman Yousaf Raza Gillani was not chairing sessions after the production order he issued for PTI senator Ijaz Chaudhry was flouted by the Punjab government, Senator Shibli Faraz said the non-implementation of the orders passed by the chairman was ‘contempt’ of the entire house.\n\nHe also said there was no room in the rules to withhold results of the vote count, demanding that the unfinished agenda be completed and SBP amendment bill already passed by the senate’s standing committee concerned be taken to its logical conclusion.\n\nHe said the deputy chairman knew he did something wrong, yet he suspended the membership of the three senators for protesting over a genuine issue.\n\nIn response, Irfan Siddiqui, who was chairing the house at the time, said that the Senate Secretariat and the chairman would certainly respond to the opposition’s demands.\n\nHe also suggested that PTI parliamentary leaders could meet Senate chairman Gillani and request him to return to the House and chair its sittings. “If any institution or a government has not complied with the production order, he may be unhappy with them, but being custodian of the House, he may take his position again to help improve environment in the Senate,” he explained.\n\nShortly after the presiding officer’s remarks, the opposition leader announced a boycott of the proceedings, in solidarity with the suspended senators, unless the issues were resolved.\n\nProtesting employees\n\nMeanwhile, PPP Senator Shahadat Awan called attention to the government employees’ protest in the capital’s Red Zone, over pension and retirement benefits. He urged the government to meet them and restore their confidence and law and order in the area.\n\nAs the month of Ramazan was fast approaching, some media reports suggested that the government was going to shutter the Utility Stores Corporation (USC) that provides subsidised goods to the less privileged, he said.\n\nLaw Minister Azam Nazeer Tarar said that peaceful protest was the right of everyone but within the bounds of the law. He said that Prime Minister Shehbaz Sharif had instructed the finance minister to engage with the government employees to resolve their issues but “there should not be any blackmailing”.\n\n“I would take up the issue of use of force against protesters with the interior secretary and chief commissioner and police chief of Islamabad,” the minister said.\n\nThe House was also informed that the Ramazan Package worth Rs20 billion had been prepared by the federal government this year, which will be provided in cash directly to about four million deserving people.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/220902499e8c62d.png",
  "retrievedAt": "2025-10-12T01:34:48.669Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893507/senators-take-issue-with-deputy-chairmans-attitude",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:13:27.000Z"
}
