{
  "title": "Afaq Ahmed gets bail in two rioting, terrorism cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: An anti-terrorism court (ATC) on Friday granted bail to Mohajir Qaumi Movement-Haqiqi (MQM-H) chairman Afaq Ahmed in two cases pertaining to rioting and terrorism.\n\nHowever, he will remain in jail as his counsel stated that he has also been booked in another case for allegedly setting fire to a tanker near Abdullah Mor in Surjani Town.\n\nMr Ahmed was arrested from his residence in Defence Housing Authority and was earlier booked in two cases registered at the Landhi and Awami Colony police stations.\n\nOn Friday, the ATC-Judge VI, who heard the bail applications inside the judicial complex in the central prison, pronounced its reserved order in which he granted bail to the MQM-H leader in two cases against surety bond of Rs100,000 each.\n\nMQM-H chairman will remain in jail in connection with yet another case\n\nHowever, defence counsel Javaid Ahmed Chhatari stated that Mr Ahmed will remain in jail as he has now been implicated in a third case, registered at the Surjani Town police station, for allegedly setting fire to a tanker near Abdullah Mor.\n\nThe FIR was registered at the Surjani Town police station on Feb 11 on the complaint of the tanker owner.\n\nThe tanker owner stated that on the day of the incident, he received a phone call from his driver while he was at home. The driver informed him that when he was going from Khuda Ki Basti towards Manghopir, three unidentified individuals appe­a­red in front of the tanker near Bhutto Chowk, Abdullah Mor, and started pelting it with stones.\n\nDuring that time, the three individuals forcibly pulled the driver out of the vehicle, poured petrol on the tanker, and set it on fire, he added.\n\nDuring the arguments, defence counsel Chhatari submitted that Mr Ahmed is a peaceful and respectable law-abiding senior citizen of the country with respect and dignity in the political community.\n\nReferring to the contents of the FIR registered at Awami Colony police station, it alleged that a loading truck was set on fire at the behest of Mr Ahmed. It further claimed that Mr Ahmed in an alleged video that went viral on social media had allegedly prohibited heavy traffic to enter in the metropolis and warned that otherwise they would be responsible of damage or loss of their vehicles.\n\nHowever, the counsel argued that the complainant’s statement in the FIR was based solely on the alleged disclosure of the co-accused, and no direct evidence was available to implicate Mr Ahmed in the offence, as the claim relied on an inadmissible piece of evidence.\n\nHe submitted that if any video of the “hateful speech” was available on social media, it required forensic examination to verify its authenticity.\n\nPublished in Dawn, February 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:35:05.648Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893482/afaq-ahmed-gets-bail-in-two-rioting-terrorism-cases",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T01:14:16.000Z"
}
