{
  "title": "Full force of state will be used to foil PTI agenda of chaos: Khawaja Asif",
  "link": "https://www.app.com.pk/national/full-force-of-state-will-be-used-to-foil-pti-agenda-of-chaos-khawaja-asif/",
  "date_published": "2024-10-12T18:33:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Oct 12 (APP):Federal Minister for Defence Khawaja Muhammad Asif said that the PTI founder had always prioritized his interests over national interests and the party wanted to block the path of Pakistan’s development.\nAddressing a press conference at his residence in Sialkot Cantt, he said when the heads of 16, 17 countries of the Shanghai Cooperation Organization (SCO) are coming to Pakistan, the PTI founder has given a call for protest, however, he warned that the country’s interests will be protected at any cost.\nKhawaja Muhammad Asif said the behaviour of the PTI had been the same since 2014 when their protests  delayed the visit of the Chinese President. “A similar behaviour is being shown by PTI leaders when the Shanghai Cooperation Organisation (SCO) summit is round the corner and the party is making an all-out effort to undermine Pakistan’s international standing. The PTI is now attempting to sabotage the SCO summit,” he added.\n“The PTI has given a call for sit-in again on October 15, which is a bad move to influence the Shanghai Cooperation Organization (SCO) conference. PTI protests have always aimed to obstruct Pakistan’s progress. The loyalty of the PTI and its leader, Imran Khan, lies solely in maintaining authority rather than serving Pakistan’s interests. Their desire for power has eclipsed their commitment to the nation,” he added.\nHe said, “We will not be blackmailed by the PTI under any circumstances and would never allow anyone to spread chaos and anarchy in the country under the guise of protests. Soldiers are being martyred in the country daily but the PTI only wants to spread chaos. If the establishment works to bring them to power, then they are happy, otherwise they speak against it. Even today the PTI founder tweeted against it.”\nHe recalled that Nawaz Sharif was not even allowed to speak in jail but alleged that the judiciary had provided all  facilities to the PTI founder and asked the judiciary to take notice of his attacks on the integrity of Pakistan. “These people want to repeat May 9. These people want to spread chaos and anarchy in the country again. They do not want Pakistan to be respected at the global level and that is the reason they are spreading chaos and anarchy. However, we will not allow its nefarious objectives to succeed in any way and would use the full force of the state against those who attack the integrity of the country,” he maintained.\nKhawaja Muhammad Asif said that PTI people had never condemned terrorists, instead they always supported  them. “They do not even attend the funeral of our martyrs,” he added.\nIn response to a question, he said that daily losses of billions of rupees are caused by PTI protests and sit-ins. “If they let the country run, this money can be spent on public relief and welfare.”\nMPAs Muhammad Manshaullah Butt, Chaudhry Faisal Ikram, Shakeela Arthur, PML-N President Sialkot City Muhammad Rafique Mughal, General Secretary Women’s Wing Nasrat Jamshed were also present on this occasion.\nEarlier, Khawaja Muhammad Asif visited the Sialkot Chamber of Commerce and Industry (SCCI) and had a meeting with its president, Ikram-ul-Haq. The discussion were held on matters of mutual interest, including economic development, regional business challenges, and potential areas of cooperation between the business community and the government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:02:03.635Z"
}
