{
  "title": "Irfan Siddiqui urges unity on ‘Constitutional Amendments’ for national interest",
  "link": "https://www.app.com.pk/national/irfan-siddiqui-urges-unity-on-constitutional-amendments-for-national-interest/",
  "date_published": "2024-10-12T07:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):Senator Irfan Siddiqui from the Pakistan Muslim League-Nawaz (PML-N) Saturday announced that two key parties have submitted draft proposals for the constitutional amendments, paving the way for a potential consensus with Maulana Fazlur Rehman’ s Jamiat Ulema-e-Islam (JUI-F) and other parties.\nTalking to a private news channel, he emphasized the importance of unity in passing constitutional amendments for the national interest.\nSenator Irfan Siddiqui has reaffirmed that the proposed constitutional amendments are not tailored to benefit any specific individual,  Instead, they aim to bring about meaningful reforms to Pakistan’s constitution.\nTo achieve this,  the Pakistan Muslim League-Nawaz (PML-N), is actively engaging in discussions with other political parties to support for the amendments, he added.\nThe PML-N is seeking broad consensus on the constitutional reforms, recognizing that unity among parties is crucial for the nation’s interest, he highlighted.\nBy building alliances and fostering cooperation, Siddiqui hopes to create an environment conducive to passing the amendments.\nThis collaborative approach demonstrates the PML-N’s commitment to prioritizing the country’s well-being over individual interests, he mentioned.\nReplying to a query, he said two key parties had submitted their proposal drafts for constitutional amendments\nto the committee overseeing the process, adding, Mulana and PTI will jointly present other.\nSenator Irfan Siddiqui has clarified that there is no rush to amend the constitution and the date for the amendment can be adjusted as needed.\nHowever, he expressed optimism that the amendment proposals will mature following the Shanghai Cooperation Organization (SCO) conference.\nThis development suggests that the government is prioritizing careful consideration and international cooperation over hasty decision-making, he added.\nHe also highlights the importance of regional cooperation and diplomacy in shaping Pakistan’s constitutional reforms.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:02:27.237Z"
}
