{
  "title": "PTI’s protest at D-Chowk during SCO conference conspiracy: Governor Kundi",
  "link": "https://www.app.com.pk/national/ptis-protest-at-d-chowk-during-sco-conference-conspiracy-governor-kundi/",
  "date_published": "2024-10-12T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):Governor Khyber Pakhtunkhwa Faisal Karim Kundi on Saturday said that the announcement of a Pakistan Tehreek-e-Insaf (PTI) protest at D-Chowk during the conduct of Shanghai Cooperation Organization (SCO) conference is part of a conspiracy.\nHe criticized PTI for consistently pursuing an agenda against the country and collaborating with enemies of the state.\nKundi emphasized that they will not allow any plots to destabilize Pakistan to succeed and urged PTI to retract their call for protest on October 15.\nTalking to media here, Kundi pointed out the significance of the upcoming international conference, saying that Pakistan aims to present a positive image to the world.\nHe expressed concern that PTI’s protest coinciding with the conference is detrimental.\nKundi reiterated that if PTI’s demands will align with the constitution, they will be addressed, recalling that the establishment of a constitutional court was announced by Quaid-e-Azam Muhammad Ali Jinnah.\nKundi said that all political parties are united in support of the SCO conference and emphasized that the Pakistan Peoples Party has always advocated for peace.\nHe lamented the deteriorating security situation in Khyber Pakhtunkhwa, accusing PTI of attempting to incite unrest by inviting the Indian minister to address their rally.\nStressing that national interests come first, Kundi highlighted the sacrifices made by the PPP for the country, asserting that they have never rallied against Pakistan but instead promoted the slogan “Pakistan Khappay” (Long Live Pakistan).\nHe underscored that the best forum for politicians is parliament, criticizing PTI members for promoting violence and suggesting they join in peaceful protests instead.\nKundi praised JUI Chief Maulana Fazlur Rehman as a political figure who has fought for democracy and suggested that Maulana’s support would ultimately benefit their cause.\nHe concluded by addressing the impact of terrorism on tourism in Khyber Pakhtunkhwa, calling for collective efforts to restore peace and indicating that he had participated in a peace jirga to promote stability in the province.\nKundi reiterated his call for PTI to withdraw their planned protest.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:02:05.672Z"
}
