{
  "title": "18 graduates from Balochistan selected for Reko Diq ‘International Graduate Development Programme’",
  "link": "https://www.app.com.pk/national/18-graduates-from-balochistan-selected-for-reko-diq-international-graduate-development-programme/",
  "date_published": "2024-10-12T12:01:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 12 (APP): Eighteen (18) talented young graduates from Balochistan have been selected for the International Graduate Development Program (IGP) of Reko Diq Mining Company.\nAt a welcome ceremony held here on Saturday, the second cohort of the RDMC was announced by Barrick, the operator of RDMC under the programme launched for the Reko Diq project in July 2023.\nCEO of Barrick, Mark Bristow said IGP since its inception had aimed to engage young graduates from Balochistan to equip them with the skills necessary for successful careers at Reko Diq and in the mining industry, said a press release issued by Barrick.\nThe CEO Barrick urged the selected youth to embrace this opportunity to learn, collaborate and shape the future of the Reko Diq project, province and the country.\nFor the 2024 programme, a rigorous merit-based selection process led to the identification of 18 exceptional graduates from a competitive pool of over 3,000 applicants. Among those selected are four women, underscoring Barrick’s commitment to gender diversity within the mining sector.\nThe graduates hold degrees in various fields, including Electrical Engineering, Mechanical Engineering, Geological Engineering, Civil Engineering, Environmental Sciences, Mining Engineering, and Geology. Like the selected graduates of 2023, the second batch of talented youth from Balochistan will embark on an intensive two-year on-the-job training programme at Barrick’s mine sites at of Veladero in Argentina and Lumwana in Zambia.\nThis hands-on experience is designed to equip them with practical skills and insights into world-class mining operations. Upon completion of the program, graduates return to Barrick operations in their home country, contributing to driving positive change in their communities. The selected cohort represents a diverse range of districts in Balochistan, including Panjgur, Gwadar, Quetta, Loralai, Khuzdar, Noshki, Musa Khel, Killa Saifullah, Zhob, and the Chagai district where Reko Diq is located.\nAccording to Barrick, the programme would not only help address the regional skills gap, but also promotes local empowerment and economic development.\n“Barrick’s philosophy emphasizes the importance of creating shared value for local communities. By investing in local talent and fostering economic opportunities, Barrick is committed to making a lasting impact in the regions where it operates,” it said.\nWith operations and projects in 18 countries, Barrick emphasizes the importance of cross-border learning, allowing team members to acquire and share valuable knowledge and expertise to strengthen the capacity of the local workforce.\nReko Diq will be a major contributor to Pakistan’s economy which is expected to have a transformative impact on the Balochistan province where, in addition to the economic benefits including jobs in mining sector, growth of regional economy and investment in social development programmes.",
  "retrievedAt": "2025-08-10T20:01:53.261Z"
}
