{
  "title": "Van Dijk grabs Liverpool win, PSG start Champions League defence in style - Sport - DAWN.COM",
  "author": null,
  "content": "PARIS: Virgil van Dijk scored a dramatic late winner to grab Liverpool a 3-2 Champions Lea­g­ue victory over Atletico Madrid, while Paris St-Germain kicked off their title defence by thrashing Atalanta on Wednesday.\n\nElsewhere, Harry Kane scored twice as Bayern Munich downed Club World Cup winners Chelsea 3-1 as Pafos and Bodo/Glimt marked their Champions League debuts with hard-earned draws.\n\nLiverpool, with club-record signing Alexander Isak on debut, raced into a two-goal lead inside the first six minutes as Atletico struggled to get out of their own half on Merseyside.\n\nA Mohamed Salah free-kick flew in off Andy Robertson for a fortuitous fourth-minute ope­ner, before the Egyptian forward collected Ryan Grave­nberch’s pass and slotted into the bottom corner.\n\nBut Atletico eased themselves into the game and halved the deficit in first-half injury time.\n\nMarcos Llorente, who scored twice in Atletico’s famous last-16 win at Anfield five years ago, stabbed the ball beyond a diving Alisson Becker from the edge of the box.\n\nLiverpool missed several chances to restore their advantage, including a glaring miss from Salah when he struck the post, and Llorente made them pay with a deflected late volley to draw Diego Simeone’s men level.\n\nBut Arne Slot’s English champions have won all four of their opening Premier League games of the season with winners inside the last 10 minutes.\n\nThis time it was skipper Van Dijk who produced the big moment with an excellent header from Dominik Szoboszlai’s corner in the 92nd minute.\n\n“We found a way again… Glad we got the win,” Van Dijk told TNT Sports. “Today I was the lucky one with the winner and we move on.”\n\nAtletico coach Simeone was shown a red card after a confrontation with Liverpool fans following Van Dijk’s goal.\n\nMeanwhile, PSG got their first Champions League campaign as reigning European champions off to a flying start with a 4-0 win over Atalanta in Paris.\n\nCaptain Marquinhos tapped into an empty net in the third minute, before Khvicha Kvarat­skhelia, who was an injury doubt in the build-up, crashed home a fine second for Luis Enrique’s men six minutes before half-time.\n\nIt could have been even better for the hosts at the Parc des Princes if not for Bradley Barcola’s tame 44th-minute penalty which was comfortably held by Atalanta goalkeeper Marco Carnesecchi.\n\nAtalanta never looked likely to stage a comeback, though, and Nuno Mendes added a third not long after the restart.\n\nSubstitute Goncalo Ramos rounded off an excellent night for PSG with a dinked finish in stoppage time.\n\n“It was perfect, but obviously the most important thing was the team winning. We played a great game,” Kvaratskhelia told UEFA.com.\n\nKane downs Chelsea\n\nBayern gave themselves an early two-goal lead in a repeat of the 2012 Champions League final against Chelsea at the Allianz Arena.\n\nTrevoh Chalobah’s own goal and a Harry Kane spot-kick put the six-time champions in control, although Cole Palmer lashed a shot into the top corner to pull one back for Chelsea just before the half-hour mark.\n\nBut Bayern ensured Chelsea’s first match in the competition since 2023 would end in defeat.\n\nChelsea wing-back Malo Gusto inadvertently played the ball to Kane who gleefully accepted the gift with a cool finish to effectively kill off Chelsea in the 63rd minute.\n\n“I always feel like in the Cham­pions League you create maybe more chances than the Bunde­sliga, the games are maybe a bit more open, and that suits me,” Kane told broadcaster DAZN.\n\n“Hopefully I can get more than 11 this year,” he added, referring to his tally in the Champions League last season.\n\nPalmer lamented his side’s loss of focus in defeat.\n\n“It was frustrating. I feel like we deserved more,” Palmer told TNT Sports.\n\n“We started well. We had early chances to score. But when you make mistakes at the highest level it’s hard to come back…\n\n“We’ve shown we can compete with one of the best teams in the competition.\n\n“It’s a good learning curve. To be back in the competition is nice. We need to kick on from here.”\n\nAt Amsterdam, Inter Milan — who were humbled 5-0 in last season’s final by PSG — started their league-phase campaign with a 2-0 win against Ajax.\n\nMarcus Thuram put the visitors ahead by heading Hakan Calhanoglu’s corner past Vitezslav Jaros.\n\nThe second goal was almost a carbon copy, Thuram meeting another Calhanoglu corner less than two minutes into the second half.\n\n“We wanted a result after two bad defeats, even though we had performed well. We did well to take the lead and manage the game without suffering too much,” said Inter’s Dutch defender Stefan de Vrij.\n\nAjax, returning to the Champions League for the first time in three seasons, were playing their 500th game in European club competition.\n\nEarlier on Wednesday, Bodo/Glimt marked their debut in the Champions League proper by coming back from two goals down late on to draw 2-2 at Slavia Prague.\n\nYoussoupha Mbodji’s first goals for Slavia had the Czechs set for victory with less than 15 minutes remaining.\n\nBut Daniel Bassi got Norwegians Bodo/Glimt back into the game before Sondre Brunstad Fet crashed in a magnificent 90th-minute volley.\n\nElsewhere, Cypriot club Pafos, playing in the tournament for the first time just 11 years since being founded, claimed a goalless draw at Olympiakos despite seeing wing-back Bruno sent off and veteran centre-half David Luiz hobble off injured in the first half.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cc9384636b7.gif",
  "retrievedAt": "2025-09-19T14:53:47.466Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943023/van-dijk-grabs-liverpool-win-psg-start-champions-league-defence-in-style",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:46:13.000Z"
}
