{
  "title": "A year on from making Olympic history, Arshad set for tilt at world title - Newspaper - DAWN.COM",
  "author": null,
  "content": "TOKYO: Arshad Nadeem’s formula for winning Olympic gold in Paris was simple. He set himself a goal, and God gave it.\n\nThe response was typical for the 28-year-old Pakistani, who made himself comfortable on a lobby couch at the athletes’ hotel for the World Athletics Championships, kicking off a slipper and tucking one foot under his thigh as he spoke about his win a year on.\n\nFaith in God and a supernatural sense of being seemed to be the only explanation for Arshad’s monstrous throws, forged from ancient, decrepit facilities back home in Lahore, where he trained in intense heat.\n\nArshad’s maiden Olympic title, complemented by a record of 92.97m, was more than a rewriting of the script. It undid the superiority of biomechanical technology and world-class facilities that usually produce Olympic champions like himself. For him, hard work, perseverance, and a God-given talent were enough to conquer the upper-most echelons of javelin that he had been marching towards in years prior.\n\nHis milestone achievements, that he dedicated to the cricket-crazy people of Pakistan, have all fallen in August the past few years. The Mian Channu born athlete made history for Pakistan every time he competed; first Pakistani to make an Olympic track and field final in Tokyo 2021; first to win gold at the Commonwealth Games in Birmingham 2022; first to medal at the World Athletics Championships in Budapest 2023 with a silver; first to win an individual gold for Pakistan at the Olympics; first Pakistani to hold an Olympic record.\n\nIt is now September in Tokyo. It’s where Arshad’s fifth-place finish spurred the desire for an Olympic medal, but it also catalysed the Athletics Federation of Pakistan to pair him with a new coach, Salman Butt. The stocky, occasionally temperamental 60-something-year-old was a former discus champion in the 1980s, who trained with facilities better than what Arshad has today.\n\nParis made Arshad’s fame and earnings balloon overnight, but the decrepit facilities at his disposal in Pakistan remained largely unchanged, save for Prime Minister Shehbaz Sharif’s plans for an elite training centre being built in Islamabad.\n\n“When athletes grow, so should their team,” Salman said, the exhaustion of a one-man show apparent in the long sighs and unmasked irritation in his voice. He doubles as Arshad’s manager, liaison, translator and ‘roohani baap’ — spiritual father — as Arshad calls him.\n\nHe was lamenting the absence of a physio for Arshad during competitions when Terseus Liebenberg, Nadeem’s short-term coach in South Africa, appeared in the lobby like the protagonist of a movie. He offered for the South African physiotherapist to work on Arshad’s injury-prone calf. In an instant, Salman looked visibly more relaxed as he slumped back down on the couch after Liebenberg’s reassurance.\n\nMoments like these and people like him were the village that supported Arshad before stardom in Paris. His Olympic kit was sponsored by Nayza — meaning javelin in Urdu; a brand name inspired by Arshad’s milestone achievements for Pakistan, whose dri-fit shirt he proudly sported after a training session.\n\nOne year on from Paris, everything and nothing has changed for Arshad.\n\n“I mean, I’m still the same,” he laughed in response. “But life has changed. There is more love, more respect. People are excited to see me at the airport, ask for selfies. This is everything for an athlete, for people to recognise you as an Olympian.”\n\nIt was evident from the change in Instagram posts and sense of dressing — Nadeem sporting a business casual suit with sneakers and a cap to one event — that he’s grown into the global stardom that comes with an Olympic gold.\n\nThe burden of expectation doesn’t weigh down on him. “His job is to train and throw a javelin and achieve records never achieved before,” Salman said. The one thing that remains unchanged in Arshad is the desire to keep helping people in struggle.\n\nPerhaps the biggest change that he and Salman revealed were plans to train outside Pakistan next year, in a climate better suited for his injury-prone body battling record heat and humidity in Lahore.\n\nThe simple winning formula for Paris is questionable ahead of Tokyo, not in the sense that his Olympic win was a fluke, but more grounded in statistics. Arshad has only competed once this season, with a modest 86.40 throw in May. A persistent calf injury beckoned surgery in June, followed by rehabilitation in the UK, where he had plans to train ahead of two Diamond Leagues in Europe that he withdrew from in August.\n\n“Injuries happen, you drop out of competitions; this is a given in sports,” Arshad said. It was lesser-known that he won gold in Paris with a calf injury he managed to substitute with the throw of a lifetime.\n\n“My body feels good, I’m pretty fit. The qualifiers [on Wednesday] will show where I stand, and I’ll have expectations for the final based on that.”\n\nScenes akin to Wagah?\n\nThere couldn’t have been a more heightened time for a Pakistan-India javelin clash, save for the four-day war in May. The absence of a handshake during the men’s Asia Cup clash between the two sides just days earlier has thrown the cricketing world into a whirlwind of statements and clarifications and analyses and jingoism.\n\nThe world is watching — albeit eclipsed by the cricket drama — whether Japan National Stadium will see scenes akin to Wagah Border: Arshad and Neeraj Chopra meeting in the middle but not quite; staring each other down at a distance close enough to be a hug that the brotherly duo may have once shared and may never do so again. Dare we compare the javelins to spears?\n\nWhen asked about his current relationship with Neeraj, Arshad said they’ve had “chalte phirte salam dua [greetings here and there]” in the athletes’ hotel in Tokyo. He declined to give any analysis on the Pakistan-India tensions brewing back home. Neeraj has declined any interviews till after the javelin final on Thursday.\n\nSalman offered a more generous response on whether India and Pakistan will always be the antithesis of each other, especially in sports.\n\n“Pakistan and India have a natural rivalry. There’s always this excitement of people looking for that competition,” Salman said. “I just wish it was a healthy competition, just athletes and fellow athletes like other teams.\n\n“Sportsmanship should prevail, we should all proceed on with what we do as sports people.”\n\nThe sports people in question know how to focus on their own goals and deliver when it matters the most. Handshakes or not, the show will go on.\n\nOriginally appeared in print under the title “Qualifiers will show where I stand, says Arshad Nadeem”\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68ca1067c5acd.jpg",
  "retrievedAt": "2025-10-12T04:14:57.173Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942464/a-year-on-from-making-olympic-history-arshad-set-for-tilt-at-world-title",
  "dateList": "2025-09-19",
  "date_published": "2025-09-16T23:58:43.000Z"
}
