{
  "title": "Kidnapped minor girl found raped, murdered in Sialkot - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: A four-year-old girl, who was abducted on Sept 15 at Jalalwali village of Pasrur tehsil, was found murdered after sexual assault in the fields on Thursday, as police allegedly failed to take timely measures to recover her alive.\n\nAs per police sources, Qari Abdul Hafeez, a resident of Jalawali village, a Quran teacher at a local madressah, had filed a complaint, saying that on Sept 15, his four-year-old daughter, Afifa Kainat, left home after Maghrib prayers to buy sweets, but did not return home.\n\nHe said that he and other locals looked for the girl on their own and also made announcements in local mosques about her disappearance, but to no avail. He said he later lodged a complaint with Qila Kalerwala police, which registered a kidnap FIR against unknown person(s) on his complaint under section 363 of PPC.\n\nSialkot district police spokesperson says DPO Faisal Shahzad formed teams headed by Pasrur DSP to recover the girl and arrest her abductor. He said three days later, the police were informed about a girl’s body lying in the fields.\n\nHe said that a police team reached the spot and identified the body as that of missing Afifa.\n\nAccording to police, the body was swollen because it had been left in water in the fields.\n\nThe police teams recorded the evidence and eyewitness statements, while the forensic team collected samples from the spot and sent them to the laboratory.\n\nThe body’s postmortem examination in Pasrur THQ Hospital revealed that the girl was sexually assaulted before murder.\n\nThe DPO says the investigators are using human intelligence sources and modern technology to arrest the culprit.\n\nMeanwhile, the victim’s family and other area residents protested against the police for failing to recover the girl alive. They said if the police had made timely efforts to recover the girl, she would have been alive.\n\nThey appealed to the chief minister to take action against the police officials concerned for showing negligence and laziness in recovering the girl alive.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:45.905Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943110/kidnapped-minor-girl-found-raped-murdered-in-sialkot",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T04:36:50.000Z"
}
