{
  "title": "Current account gap narrows to $245m - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Pakistan’s current account deficit (CAD) for August stood at $245 million, a slight improvement compared to the previous month’s deficit of $379m, according to the State Bank of Pakistan (SBP) on Thursday.\n\nHowever, the deficit was considerably higher than the $82m recorded in the same month last year, signalling a challenging trend for the government already grappling with food-related economic pressures.\n\nWhile the August deficit was lower than July’s, it still highlights concerns about the country’s balance of payments, particularly in a year when the government is facing mounting pressure from food insecurity and inflation.\n\nThe previous fiscal year ended with a surprising surplus of $2.113bn, a result largely driven by a record influx of remittances, which had helped stabilise both the exchange rate and foreign exchange reserves.\n\nHowever, despite this achievement, the government’s economic policies have faced criticism for prioritising sustainable growth over aggressive expansion. With around 97m people living below the poverty line, the persistent current account deficit could further complicate efforts to maintain even modest economic growth.\n\nThe cumulative CAD for July and August FY26 was recorded at $624m, a significant increase from $430m during the same period of FY25. Despite the positive trend in remittances during the previous fiscal year, experts caution that the flow of remittances is unlikely to grow as strongly in FY26. The first two months of this year saw remittance growth of just 7 per cent, compared to a 44pc increase in the same months of FY25.\n\nThis slowdown in remittances could result in a larger-than-expected current account deficit. Analysts warn that the country will require additional foreign currency to manage food imports, such as wheat and sugar, which could drive up inflation and further widen the import-export gap.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:47.503Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943044/current-account-gap-narrows-to-245m",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:46:02.000Z"
}
