{
  "title": "Palestine, Qatar crises to upend 80th UNGA schedule - World - DAWN.COM",
  "author": null,
  "content": "• US vetoes resolution calling for immediate Gaza ceasefire, Democrats table resolution for recognition of Palestine\n• Focus on Middle East may affect scheduled Trump-Shehbaz meeting\n• PM heads to London, will attend UN moot on two-state solution\n\nWASHINGTON: With world leaders expected to converge on New York for the 80th session of the United Nations General Assembly, the escalating crises in Gaza and Qatar are reshaping global diplomatic priorities, with significant implications for Pakistan’s engagement with the United States.\n\nIn addition to his address at the General Assembly, Prime Minister Shehbaz Sharif is also expected to take part in the high-level international conference for the ‘Peaceful Sett­lement of the Question of Pales­tine and the Imple­men­tation of the Two-State Solution’.\n\nThe conference, which will take place on Monday, would require the Pakistani delegation to hold close consultations with Arab and Muslim leaders during the UNGA.\n\nAt a news briefing this week, UN Secretary General Antonio Guterres noted that the 80th UNGA was meeting “in turbulent — even uncharted — waters”.\n\nThe UN chief pointed out that nearly 150 heads of state and government, alongside thousands of officials and diplomats, will participate in this “World Cup of diplomacy” that begins in New York on Monday.\n\n“Palestine is going to be the huge elephant [in the room] in this session of the General Assembly,” said Palestinian UN envoy Riyad Mansour, while explaining how this issue will keep the world leaders busy.\n\nUS veto and resolution\n\nOn Thursday, Washington reverted to its usual ways as it vetoed a draft Security Council resolution, which would have demanded an immediate, unconditional and permanent ceasefire in Gaza, as well as calling on Israel to lift all restrictions on aid deliveries into the besieged Palestinian enclave.\n\nThe text, drafted by the elected 10 members of the 15-member council, would also have demanded the immediate, dignified and unconditional release of all prisoners held in Gaza.\n\nIt received 14 votes in favour, but the US used its veto power for a sixth time to come to Israel’s aid.\n\nIn a rare move last week, the US had backed a Security Council statement condemning recent strikes on Qatar, though the text did not mention Israel was responsible.\n\nIn another surprising development, Senate Democrats introduced a resolution calling for the US to extend recognition to the Palestinian state.\n\nAlthough the measure is unlikely to pass the chamber where President Donald Trump’s Repu­blicans have a 53-47 majority, the resolution urges US recognition of a demilitarised Palestinian state alongside a secure Israel.\n\nDemocrat Jeff Merkley of Oregon, who is leading the effort, said in a statement: “America has a responsibility to lead, and the time to act is now.”\n\nRescheduled\n\nIslamabad’s proactive stance in condemning the Israeli airstrike on Qatar and its subsequent diplomatic engagements have elevated its profile within the Muslim world, with the recent signing of a mutual defence accord with Saudi Arabia further enhancing its significance in regional security discussions.\n\nIn addition, the shifting focus of the UNGA in the wake of Israel’s belligerent actions is also expected to impact meetings scheduled to be held on the sidelines of the summit, as those are now expected to be dominated by hectic diplomacy by Middle Eastern actors. Amidst all this, diplomatic sources in Washington suggested that a proposed meeting between US President Donald Trump and PM Shehbaz Sharif may have to be rescheduled.\n\nWhile the White House is still interested in the meeting, the intensifying crises in Gaza and Qatar may necessitate a shift in focus, sources said.\n\nPresident Trump is expected to engage with Israeli and Arab leaders during the UNGA. Israeli Prime Minister Benjamin Netanyahu has already announced that he is meeting President Trump at the White House on Sept. 29, soon after Trump’s consultations with world leaders at the UNGA.\n\nThis may mean that the Shehbaz-Trump interaction is confined to the sidelines of the assembly session in New York. Embassy sources, however, say that Islamabad would prefer a full-fledged meeting at the White House, to address bilateral and regional issues.\n\nChief of Army Staff Field Marshal Asim Munir, who has previously met President Trump at the White House, is also expected to accompany PM Shehbaz.\n\nPM in London\n\nMeanwhile, PM Shehbaz Sharif arrived in London on Thursday for meetings with senior British officials, ahead of his US trip.\n\nAccording to sources, the prime minister will remain in London until Sept 21. During his stay, he is scheduled to hold meetings with senior officials and address a gathering of Pakistanis organised by the Overseas Pakistanis Foundation.\n\nBefore landing in London, the premier made a stopover in Geneva to meet his elder brother, Nawaz Sharif.\n\nThe elder Sharif had arrived in Geneva four days ago for medical treatment, accompanied by his son, Hassan Nawaz, and his physician, Dr Adnan.\n\nMr Sharif is expected to travel to London on Monday to join the prime minister and his delegation, which includes Defence Minister Khawaja Asif, Information Minister Attaullah Tarar and the prime minister’s special assistant, Tariq Fatemi.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cc9f04c7dab.gif",
  "retrievedAt": "2025-09-19T14:53:50.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943077/palestine-qatar-crises-to-upend-80th-unga-schedule",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:45:44.000Z"
}
