{
  "title": "Indian opposition attacks election body over voter roll investigation - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: India’s opposition leader on Thursday accused the election commission of blocking an investigation into alleged large-scale voter roll tampering, in a fresh attack on the body’s credibility and independence.\n\nOpposition leaders and critics have alleged multiple times that voting in the world’s largest democracy has been undermined by targeted manipulation of electoral rolls. The Election Commission of India (ECI) has denied all charges.\n\nBut in his latest broadside, 55-year-old Congress party leader Rahul Gandhi accused the ECI of withholding key data that could help identify those accused of tampering with electoral rolls.\n\nHe accused ECI chief Gyanesh Kumar of “protecting the people who are destroying and attacking the constitution”.\n\nThe ECI called the accusations “incorrect” and “baseless”, saying that it had itself filed a police complaint against “certain unsuccessful attempts” to delete voters from rolls.\n\nGandhi on Thursday unveiled what he called “100 per cent proof” of an attempt to delete thousands of voters in Karnataka state using automated software. He said the ECI had refused to share technical data sought by investigators examining an alleged operation targeting Congress-leaning areas.\n\nThe Karnataka criminal investigation department has asked the ECI “18 times in 18 months,” he alleged. “And they are not giving it.”\n\nThe allegations come ahead of elections expected in October or November in Bihar, India’s third-most populous state with at least 130 million people.\n\nThe opposition alleged the ECI had embarked on a “mass disenfranchisement” exercise, after it gave voters in the state just weeks to prove their citizenship, requiring documents that few possess in a registration revamp.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:49.027Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943073/indian-opposition-attacks-election-body-over-voter-roll-investigation",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:45:50.000Z"
}
