{
  "title": "Taliban release detained elderly British couple from Afghanistan jail - World - DAWN.COM",
  "author": null,
  "content": "An elderly British couple detained in Afghanistan for almost eight months were released on Friday, the Taliban authorities said, after pressure built to free the pair due to fears over their health.\n\nTaliban officials have refused to detail why Peter Reynolds, 80, and his wife Barbara, 76, were arrested in February as they were returning to their home.\n\n“We’ve been treated very well. We’re looking forward to seeing our children,” said Barbara, in a red headscarf, standing next to her bearded husband, near a plane on the tarmac of Kabul airport.\n\n“We are looking forward to returning to Afghanistan if we can. We are Afghan citizens,” she added, after Qatar-facilitated negotiations for their release.\n\nThe couple were married in Kabul in 1970, and have spent almost two decades living in Afghanistan, running educational programmes for women and children. They also became official Afghan citizens.\n\nWhen the Taliban returned to power in 2021, the couple remained in Afghanistan against the advice of the British embassy.\n\nForeign Ministry spokesman Abdul Qahar Balkhi, in a statement posted on social media, said the couple were handed over to the UK’s special representative to the countr,y Richard Lindsay.\n\n“Two British nationals named Peter and Barbara Reynolds, who had violated the laws of Afghanistan, were released from custody today following the judicial process,” Balkhi added.\n\nImages of the couple standing together with Lindsay at Kabul airport before their departure to the Qatari capital Doha were broadcast on Sky News.\n\n“They are very relieved to be going home,” Lindsay told the broadcaster.\n\nThe couple were first held in a maximum security facility, “then in underground cells, without daylight, before being transferred” to the intelligence services in Kabul, according to UN experts.\n\nThe release of the British couple is a “moment of immense joy”, their family said today.\n\n“We are overwhelmed with gratitude and relief to share that our parents, Peter and Barbie Reynolds, have been released after seven months and 21 days in detention by the Taliban,” the family said.\n\nThanking Qatari officials for facilitating the negotiations, the family said their “dedication and humanity have made an unforgettable impact on our lives”, and also thanked the UK government for ensuring the couple had access to medication.\n\n“This experience has reminded us of the power of diplomacy, empathy, and international cooperation. While the road to recovery will be long as our parents regain their health and spend time with their family, today is a day of tremendous joy and relief,” the family said in a statement.\n\nIn a latest update, an AFP journalist reported that the couple has arrived in Qatar.\n\nIn late July, the independent UN human rights experts called for the Taliban government to free the pair, warning of the “rapid deterioration” of their physical and mental health, stating that they “risk irreparable harm or even death”.\n\nTheir family had made repeated pleas about their ailing health after their arrest.\n\nHamish Falconer, the UK’s minister for the Middle East, Afghanistan and Pakistan, said in a statement that he was “relieved… their ordeal has come to an end”.\n\nHe added that it was against travel advice for British citizens to visit Afghanistan, warning that the government’s ability to offer consular assistance “is extremely limited”.\n\nRussia is the only country to have officially recognised the Taliban government, which has imposed a strict version of Islamic law and been accused of sweeping human rights violations.\n\nOnly a handful of embassies have reopened in the capital after most were evacuated at the end of the NATO-led war against Taliban militants.\n\nForeign ministry spokesman Balkhi in his statement said that the government “does not view the matters of citizens from a political or transactional angle”, adding that “Afghans, wherever they may be, should also receive consular services”.\n\nIt comes after Washington’s special envoy on hostages, Adam Boehler, made a rare visit on Saturday to Kabul to discuss the possibility of a prisoner exchange.\n\nAt least one US citizen, Mahmood Habibi, is held in Afghanistan.\n\nDozens of foreign nationals have been arrested since the Taliban returned to power in August 2021 following the withdrawal of the US military.\n\nA Qatari official, on condition of anonymity due to the sensitivity of the matter, told AFP that the couple were “safely released from detention in Afghanistan following mediation led by Qatar”.\n\n“The Qataris had been engaged with the Afghan authorities for many months, working in close coordination with the British government,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1917551238f78ce.webp",
  "retrievedAt": "2025-09-19T14:53:41.590Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943214/taliban-release-detained-elderly-british-couple-from-afghanistan-jail",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T13:01:07.000Z"
}
