{
  "title": "SHC questions delay in rehabilitation of schools damaged during 2022 flood - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: The Sindh High Court, Sukkur bench, has expressed its dismay over delay in the rehabilitation of flood-affected schools in Sangi area.\n\nDuring the hearing on Thursday, officials from the education department and the education works department appeared before the constitutional bench comprising Justice Zulfiqar Ali Sangi and Justice Riazat Ali Sahar.\n\nThe petitioner, Abdul Malik Zabiullah Jatoi, told the court that school buildings were destroyed in the 2022 floods, and despite the passage of three years, the repair and construction work by the education works department had not been completed. As a result, students were forced to study at inappropriate locations without basic facilities, he added.\n\nThe honorable court reprimanded the officials, including the director of Elementary, Secondary and Higher Secondary Region Sukkur, Hafiz Shahabuddin, DEO Syed Ghulam Murtaza Shah, Education Works SDO Dost Ali Qazi and other officials concerned for their unsatisfactory answers.\n\nThe court has ordered them to provide a detailed report within one week on the restoration of schools and provision of basic facilities to the students.\n\nThe chief engineer of the education works Sukkur, and other responsible officials will have to appear before the court with the report at the next hearing, it said.\n\nNotices to highway police\n\nThe same bench also admitted a petition against the alleged injustices by the National Highway police and issued notices to the nominated respondents.\n\nPetitioners’ lawyers Shiraz Fazal Awaisi and Ahmed Mehran Goraya argued that trucks plying on the National Highway were stopped by the police for hours without any reason.\n\nThe lawyers claimed that the DIG of the National Highway police office issued an ambiguous list with registration numbers of hundreds of heavy vehicles, which are then forced to pull up at different weighbrides without any explanation. This causes traffic jams and an increase in accidents in night hours.\n\nWhen the drivers questioned police officials, they were harassed and threatened with FIRs, they added. They also stated that the long delays prevented goods from reaching their destination on time, directly affecting the drivers’ livelihoods.\n\nAfter hearing the arguments, the court issued notices to the DIG and SP of the National Highway police and others, directing them to appear before the court on Oct 15.\n\nEncroachments at City Point\n\nThe bench also gave a deadline to the authorities concerned for the removal of encroachments from City Point in Sukkur, and for the construction of a service road and a U-turn.\n\nIt was seized with a petition filed by Faqir Athar Hussain Abro regarding encroachments at City Point.\n\nSukkur SSP Azhar Mughal, the Traffic SP, an NHA official, a representative of the deputy commissioner and officials from other departments concerned appeared before the bench.\n\nThe court asked the SP about the safety measures taken to prevent potential accidents.\n\nHe responded that he lacked the authority, office or staff, and that all authority was with the SSP operations.\n\nThen the honorable court sought clarification from the SSP who stated that the problem was caused by the narrow road and passenger vehicles stopping there. However, traffic personnel had been deployed there, he said.\n\nThe NHA official informed the court that a road-widening scheme had been approved and work would be done according to the court’s orders once the district administration allotted the land.\n\nHe also assured the bench that a standard U-turn and service road would be constructed.\n\nThe court ordered the DC’s representative to hand over government land to the NHA if available, or to procure the same from private owners.\n\nJustice Zulfiqar Ali Sangi remarked that illegal bus stops and encroachments at City Point must be removed.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:45.333Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943006/shc-questions-delay-in-rehabilitation-of-schools-damaged-during-2022-flood",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:46:28.000Z"
}
