{
  "title": "Pakistan, IAEA sign country framework - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan and the International Atomic Energy Agency (IAEA) signed the fifth Country Programme Framework (CPF) for 2026-2031 on the sidelines of the ongoing IAEA General Conference in Vienna on Wednesday.\n\nThe framework was signed by PAEC Chairman, Dr Raja Ali Raza Anwar, and IAEA Deputy Director-General and Head, Department of Technical Cooperation, Hua Liu on behalf of their respective sides.\n\nThe CPF 2026-2031 stands as a testament to the enduring partnership between Pakistan and the IAEA. Its implementation will strengthen Pakistan’s socio-economic development and reinforce its role as a responsible member state committed to the global mission of the IAEA, a press release of PAEC says.\n\nThe country programme outlines national priorities where nuclear science and technology will directly support socio-economic development. It builds on decades of collaboration and aligns with Pakistan’s development agenda and international commitments, including the Sustainable Development Goals.\n\nCPF 2026-31 reinforces Pakistan’s role as responsible member state committed to agency’s global mission\n\nCovering three technical cooperation cycles, it identifies five key areas: food and agriculture, human health and nutrition, climate change and water resource management, nuclear power, and radiation and nuclear safety.\n\nIn agriculture, which contributes nearly a quarter of GDP and employs more than a third of the workforce, nuclear techniques will be used to boost crop yields, strengthen pest control, improve livestock health, and enhance food safety. Pakistan’s participation in the IAEA’s Atoms4Food initiative demonstrates its commitment to food security and climate-resilient farming.\n\nIn health, rising cancer cases and non-communicable diseases make healthcare a central focus. Through the CPF, Pakistan will expand cooperation with the IAEA in nuclear medicine, radiation oncology, medical physics, and radiopharmaceuticals.\n\nThe network of 20 Atomic En­­ergy Cancer Hospitals (AECHs), already serving over a million patients annually, will be further equipped with advanced therapies, precision diagnostics, and locally produced radiopharmace­uticals for affordable treatment.\n\nIn the environmental domain, Pakistan is among the most climate-vulnerable countries and faces severe water scarcity and extremely unpredictable weather conditions. Nuclear techniques, especially isotope hydrology, will be applied to monitor water resources, improve irrigation efficiency, and support resilience against climate change. Pakistan Institute of Nuclear Science and Technology, as an IAEA collaborating centre, will play a central role in applying these techniques.\n\nIn energy, nuclear power currently contributes over 18pc of annual electricity generation, with six operational plants and another under construction at Chashma. The CPF focuses on plant life management, waste management, non-destructive testing, and safe decommissioning, while meeting Pakistan’s targets for greenhouse gas reduction by 2030.\n\nIn safety, the Pakistan Nuclear Regulatory Authority will continue strengthening oversight of nuclear activities. The IAEA support will enhance capabilities in emergency preparedness, radioactive waste disposal, safe transport, and the use of artificial intelligence in regulation. These steps safeguard workers, the public, and the environment, while ensuring compliance with international safety standards.\n\nThe CPF underlines Pakistan’s advocacy for gender equality, emphasising women’s participation in science.\n\nAt the signing ceremony, PAEC chairman said that the signing of Country Programme Framework reaffirms Pakistan’s unwavering commitment to the peaceful applications of nuclear science and technology.\n\nMr Hua Liu welcomed Pakistan’s strong engagement, describing the CPF as a shared vision for sustainable development through peaceful nuclear cooperation.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:14:58.828Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943033/pakistan-iaea-sign-country-framework",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:45:55.000Z"
}
