{
  "title": "No ‘either-or’ in Pakistan’s relationship with other countries: DG ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Inter-Services Public Relations (ISPR) Director General Ahmed Sharif Chaudhry has reaffirmed Pakistan’s commitment to a “longstanding” relationship with the United States, stating that “there is no either-or in our relations with other countries”.\n\nThe DG ISPR expressed these views during an interview, which was aired by Pakistani television channels on Friday. According to television channels, the interview was purportedly given to a German media house.\n\nDuring the interview, the military spokesperson was asked about Army Chief Asim Munir’s visits to the US and whether they had helped with “warming up” relations between Islamabad and Washington.\n\nIn his response, Lt-Gen Chaudhry appreciated the US and President Trump’s role in mediating a ceasefire between India and Pakistan in May after a four-day escalation. He said, “Over a period of time, we have been able to enhance and amplify on our convergences (with the US) and deftly managed the divergences.”\n\n“There are areas where a lot can be done, there are areas where a lot of engagement can be done,” he said, adding that “Pakistan views its relationship with the US as very important.”\n\n“We don’t think that these relationships have anything to do — or there is either-or with other countries.” At this point, the interviewer interjected him to mention China, with the DG ISPR continuing — following a cut in the video — that “we, at the same time, have very constructive and strategic relationships with China and other countries.”\n\nHe said that there is a lot of “scope” for collaboration between the US and Pakistan on the matter of counterterrorism.\n\nOn that note, he expressed satisfaction over the United States’ recent declaration of the Majeed brigade as a terrorist outfit.\n\nPakistan has proscribed the Majeed Brigade — the terrorist outfit Balochistan Liberation Army’s suicide squad — as a terrorist entity since July 18, 2024.\n\nOn the question of Pakistan’s concerns over weapons systems left behind by the US in the wake of its withdrawal from Afghanistan, DG ISPR cited the retrieval of US-made weapons from terrorists involved in the Mianwali airbase attack on 4 November 2023 as evidence.\n\nHe said that “we share all this data with the Americans,” adding that “the amount of weapons left behind by the US is huge.”\n\nQuoting a report prepared by the Special Inspector General for Afghanistan Reconstruction (SIGAR), Lt-Gen Chaudhry said that, “after withdrawal of the United States and NATO forces, more than $7.2 billion worth of US equipment has been left.”\n\nOn the issue of strained relations with India, DG ISPR referred to the May escalation, noting that “On May 10, actually the fire ceased — it’s the cease of fire that happened, [but] the conflict endures.”\n\n“Whether it is the Kashmir issue, whether it is state-sponsored terrorism of India, whether it is the rising extremism of Hindutva mentality, rationality that has gripped India —” Lt-Gen Chaudhry said.\n\nStating Pakistan’s position on the matter, he said, “Pakistan believes that the issues need [a] resolution,” calling for international actors to intervene.\n\n“Especially players like the USA, they must intervene,” he said.\n\nHe went on to say: “We have no doubt in our minds in Pakistan that each and every incident of terrorism that happens in Pakistan — behind that is Indian support and its abetment.”\n\nNoting Pakistan’s efforts in curbing terrorism and the frequency of terrorist attacks in the country, DG ISPR highlighted that, “just by the threat that is coming to Pakistan, any sane mind can understand this can not go on without external support.”\n\nDG ISPR alleged that, “the base of operation that the Indians use is Afghanistan, the whole of terrorism that is being done is executed by the Indians over there.”\n\n“Indians have a playbook of using terror as a tool of state,” he said, claiming that their “main tools” at the moment are terrorist outfits Tehreek-e-Taliban Pakistan (TTP) and BLA.\n\nOn the question of insurgency in the country, DG ISPR denied that such a thing existed, stating, “There is no insurgency in Pakistan; the correct term is terrorist,” he said.\n\nAsked if the grievances of the people in Balochistan are properly addressed, he claimed that out of Balochistan’s total population, only a fraction actually lived in Balochistan, saying that “before talking about the issue, it is important to see how many Baloch are we talking about.”\n\nOver the issue of missing persons in Balochistan, he claimed that “half of these missing persons are part of BLA.”\n\nHe said that several terrorists killed in Balochistan were included in the list of missing persons as well, claiming that there were more missing persons in Sindh and Punjab than in Balochistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/19124926edc69a5.webp",
  "retrievedAt": "2025-09-19T14:53:44.041Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943163/no-either-or-in-pakistans-relationship-with-other-countries-dg-ispr",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T07:34:23.000Z"
}
