{
  "title": "CJP Afridi lends ear to Imran’s plight in jail - Newspaper - DAWN.COM",
  "author": null,
  "content": "• PTI lawyer delivers incarcerated chief’s letter to top judge; says Justice Afridi asked them to move proper application for redressal\n• Aleema says she’ll visit Supreme Court today to inquire about ‘outcome’\n• Ex-PM urges CJP to intervene to fix his pending petitions, requests ‘justice in real time’\n\nISLAMABAD: As PTI leader Imran Khan has been in jail for more than two years, his lawyer Latif Khosa on Thursday approached Chief Justice Yahya Afridi with a letter from the former prime minister detailing his hardships in jail and requesting the swift scheduling of his pending cases.\n\nMr Khosa handed over the letter to the top judge in a meeting that lasted for more than an hour and later told media persons that the CJP had assured a “positive response” to their plight within 24 hours and also asked them to move a proper application in this regard.\n\nTo deliver the letter ‘Denial of Justice and Fundamental Rights — A Call to the Supreme Court’, Mr Khosa had arrived with Aleema Khan, Javed Hashmi and other PTI leaders, but the rest were briefly stopped by the police at the entrance of the Supreme Court. However, they were subsequently allowed to enter the premises and they waited there till the conclusion of the meeting between the CJP and Mr Khosa.\n\nAfter the meeting, Mr Khosa told reporters that the CJP attentively listened to them and assured them that a policy of presenting any arrested person within 24 hours would be ensured.\n\nMr Khosa said the CJP had sought the ex-premier’s complaints regarding the conditions in jail in writing and assured that his grievances would be addressed and responded to within 24 hours, Dawn.com reported. He said, “We will inform you about whatever happens in [the next] 24 hours.”\n\nMr Khosa said he had also expressed “our reservations” about the judiciary to the chief justice and raised the matter of jail reforms. “The CJP has sought suggestions over jail reforms,” he said.\n\nAleema Khan, the sister of Imran Khan who flanked the lawyer during the media interaction, announced they would return to the apex court on Friday to learn about the outcome of the letter penned by Imran Khan.\n\n‘Door of justice’\n\nIn his message to the CJP, the former prime minister claimed the “doors of justice remain closed to him and his wife” and he had to endure “continuous solitary confinement”. The PTI lea­der said he had been facing 300 “politically motivated cases” and requested the CJP for an immediate hearing of his pending petitions before all courts. He also demanded medical treatment facilities for his spouse Bushra Bibi and phone calls to his sons as mandated by the jail manual. “Her health continues to deteriorate, yet her doctor is barred from examining her, let alone provide any treatment,” he said in the letter.\n\nAccording to the PTI chief, thousands of the party’s supporters were in jail and many, including his nephew, were subjected to military trials in violation of the constitutional protections.\n\nHis letter also mentioned the ‘leaked’ Commonwealth report on the Feb 8 elections and said the PTI’s mandate was “stolen overnight”. The letter claimed that the 26th Amendment had been used as a tool to sanctify this mandate theft, while petitions challenging it rem­ained unheard in the apex court.\n\nThe letter alleged that the Islamabad High Court chief justice deliberately refused to fix his Al-Qadir Trust – the £190m corruption case – and Toshakhana appeals.\n\nThe IHC top judge has allegedly fully abandoned impartiality and reduced the high court to a facilitator of an “unjust and tyrannical campaign” against him and those associated with him. He urged the CJP to direct Justice Sarfraz Dogar to fix critical petitions, including in the Al-Qadir Trust case.\n\nThe letter also alluded to the hanging of Zulfikar Ali Bhutto. Bhutto was hanged in a prison in Rawalpindi on April 4, 1979, whereas the Supreme Court held in 2024 that fair trial and due process requirements were not met. “Just­ice in its truest sense must happen in real time, pyrrhic justice occurs 44 years later,” the letter said.\n\n“I, as Patron-In-Chief of Pakist­an’s largest political party; seek only what the Constitution guarantees: justice, dignity, and equality before law,” the letter said.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:46.047Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943080",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:45:44.000Z"
}
