{
  "title": "Two judges of defunct IHC anti-harassment body express conflicting views - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Justice Arbab Muhammad Tahir argues the case fell outside workplace harassment law, should be dealt by SJC\n• Justice Saman Imtiaz defends assuming jurisdiction, says courtroom is a workplace\n\nISLAMABAD: Two judges of the Isla­m­abad High Court (IHC) have written letters expressing conflicting views over the proceeding on the harassment complaint filed against the chief justice by Advocate Imaan Zainab Mazari-Hazir.\n\nJustice Arbab Muhammad Tahir, who was part of the now-defunct committee constituted to examine harassment allegations against IHC CJ Justice Sarfraz Dogar, aligned himself with the top judge, asserting that such allegations did not fall within the ambit of the workplace harassment law.\n\nIn a letter, Justice Tahir clarified that the appropriate forum to address such grievances was the Supreme Judicial Council (SJC). He maintained that the competent authority had erroneously assumed jurisdiction over the matter, according to sources familiar with the development.\n\nThe letter was circulated among judges as well as the chief justice shortly after the IHC administration de-notified Justice Sa­­­­man Rafat Imtiaz as the competent authority.\n\nIn a separate letter, Justice Saman Rafat Imtiaz defended assuming jurisdiction and termed the courtroom a workplace.\n\nShe stated that, as the competent auth­o­r­ity under the Protection Against Haras­sment of Women at Workplace Act, she was duty-bound to entertain the complaint.\n\nAlthough there was no provision for including herself in the inquiry committee constituted to probe the allegations against the chief justice—since Subsection 4 of Section 4 of the Act states: “The inquiry committee shall submit its findings and recommendations to the competent authority within thirty days of the initiation of inquiry”.\n\nJustice Imtiaz pointed out that Subsection 2 of Section 3 states: “The committee shall consist of three members, of whom at least one member shall be a woman. One member shall be from senior management and one shall be a senior representative of the employees or a senior employee where there is no CBA.” She said that in order to meet this requirement she included herself under compelling circumstances.\n\nThe episode took a dramatic turn when the IHC administration de-notified Just­ice Imtiaz and replaced her with Justice Raja Inaam Ameen Minhas as the competent authority.\n\nJustice Imtiaz suggested that her successor would complete the unfinished task, reiterating her view that judges could be tried under the Act and that Article 209 did not grant them immunity from such proceedings.\n\nBesides seeking proceedings against the top judge under the Protection Against Harassment of Women at Workplace Act, Ms Mazari-Hazir had earlier also moved the Supreme Judicial Council for misconduct proceedings against Justice Dogar. She again approached the judicial council after the IHC administration removed Justice Imtiaz as the competent authority.\n\nThe complaints against CJ Dogar stem­med from a heated exchange between the lawyer and the top judge last week.\n\nDur­ing the hearing, Justice Dogar had warned Ms Mazari-Hazir of a contempt of court case and was reported to have made remarks along the lines of “getting a hold of her”.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/19095101b0a5081.webp",
  "retrievedAt": "2025-09-19T14:53:48.644Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943034/two-judges-of-defunct-ihc-anti-harassment-body-express-conflicting-views",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:45:55.000Z"
}
