{
  "title": "Arshad ends 10th in post-surgery return as Walcott claims javelin gold - Sport - DAWN.COM",
  "author": null,
  "content": "TOKYO: The night was Keshorn Walcott’s from the start. Right from the second throw, he had the lead in the men’s javelin final. The highly-anticipated clash of the South Asian titans — Arshad Nadeem and Neeraj Chopra — failed to gain momentum in the sold-out Japan National Stadium that turned its attention to Walcott on his way to winning his maiden world title.\n\nWalcott’s win, thanks to a season’s best 88.16m throw, was pleasantly surprising but not entirely unexpected given he was ranked fourth in the world coming into the World Athletics Championships. Anderson Peters of Grenada was the favorite for gold after an “unexpected’ 89.53m throw in the qualifiers. Curtis Thompson was another surprise of the night as he took bronze in an event the US hasn’t medalled in since 2007.\n\nBut the burden of expectations was largely on Arshad and Chopra; one an Olympic champion, one the reigning champion, both poster boys for sporting excellence and Pakistan-India rivalry outside of cricket. A brotherly relationship kindled over years of competitions together — Chopra outshining Arshad on every front until Arshad climbed to supremacy with an Olympic gold last year — was snuffed out with the full force of a fire extinguisher that is geopolitical tensions between the neighbouring countries.\n\nThe burden, or at least the need to give back to the country, was evident in the way Arshad, who finished a disappointing 10th with a best throw of 82.75m — two sports behind Chopra, took to social media a few hours after the event.\n\n“Although I couldn’t achieve the result I had hoped for in the final, I am proud to have represented our nation on the biggest stage,” his statement read. “Your prayers, messages, and encouragement mean the world to me. I know I let you all down, but I promise to come back stronger and work even harder to make you proud.”\n\nWhether scripted by his PR manager or written sincerely from the bottom of his heart, Arshad’s relationship with the nation has been one of putting Pakistan on the sporting map and only asking for “sab ki duaein [prayers from everyone]” in return.\n\nThat he made it to the final was itself a big deal considering he underwent surgery barely two months ago. Plans to train in the UK this summer were replaced by surgery owing to a persistent calf injury, followed by rehabilitation in London. Having to pull out of two Diamond League meets in August meant he was competing in Tokyo with just one competition this season, the Asian Athletics Championships in May where he took gold.\n\nSpeaking to World Athletics after Wednesday’s heats, Arshad explained that surgery had impacted him practicing his run-up, which is paramount in an event like javelin that can be anyone’s win if you’re not at your A-game. Mentally, Arshad has the tenacity and mindset to “fight till the last throw, that’s what I do best”. But when peak mental and physical performance don’t align, winning gold and shattering records is near impossible.\n\n“To be honest, I’ve been dealing with an injury since July 4, which affected my preparation and fitness level. Despite this challenge, I gave it my all, and I appreciate the experience,” he continued in his social media post.\n\n“Thank you for believing in me and supporting me on this journey. I will keep pushing myself to achieve greatness, not just for myself, but for our nation,” he said as he signed off with “love and gratitude”.\n\nDefending champion Chopra, who was returning to the site of his Olympic triumph, has been suffering from similar injury struggles.\n\n“I don’t know what happened,” Chopra said. “I had a back issue two weeks ago and I didn’t tell anybody. I was thinking I could still throw far — but no.”\n\nThe men’s javelin final was one of several upsets and triumphs of the night. Four new world champions were crowned in events that have belonged so resolutely to a fiercely elite group of athletes. Reigning champions were dethroned and new ones crowned in an evening made dramatic by rain competing with sweat to drench the athletes.\n\nWill this be the changing of the guards? A final farewell to veteran athletes like Jakub Vadlejch and Julius Yego, who admitted they’re on the older side of sport now?\n\nThat’s a question that the rest of the field can answer at the next major competition, but Walcott answered it tonight.\n\nHe became Olympic champion at 19, an unexpected intruder at the top of the podium at the London 2012 Olympics. It was the first major disruption of the European-dominated event that Yego — who retired from the final with an injury — continued with his world championship win in 2015\n\nWalcott’s gold and Peters’ silver, secured with an 87.38m effort, on Thursday night snatched javelin supremacy from the South Asians. What happens next season will finally be a global affair spanning four continents.\n\nArshad’s season, however, still isn’t over, as he’s set to compete at the Islamic Solidarity Games in November. And the nation will watch and wait with bated breath again to see if Arshad is back to his best by then.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cc925babad3.gif",
  "retrievedAt": "2025-09-19T14:53:47.384Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943018/arshad-ends-10th-in-post-surgery-return-as-walcott-claims-javelin-gold",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:46:13.000Z"
}
