{
  "title": "Pakistan Post resolves international mail backlog via Doha - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Following a two-week suspension of international mail, Pakistan Post has resumed transporting parcels to final destinations via Qatar Post.\n\nPakistan Airlines will deliver the mail to Doha, and then Qatar Post will dispatch it to its final destination through its network.\n\nA senior official of the Directorate of Pakistan Post told Dawn that Etihad Airways suspended the uplift of all categories of international mail from September 1 because Pakistan Post had failed to pay its outstanding dues exceeding Rs200 million for transporting the mail.\n\nHe mentioned that only Pakistan International Airlines was currently handling the international mail in countries where its flights operate. However, he added that over 6,000 letters and parcels had been pending for the past two weeks as the private airline refused to transport them.\n\nOver 6,000 pending letters and parcels are now dispatched through Qatar Post\n\nHe explained that the matter had been reported to the federal government, which decided to seek assistance from Qatar Post to deliver the mail through its system in countries where PIA does not operate.\n\nTo resolve this issue, he further noted that discussions were held with Qatar Post to forward Pakistan Post’s mail via Doha. The additional director of operations at Pakistan Post, who was in the UAE for the Council of Administration (CA) and Postal Operational Council (POC) sessions, also held a meeting with his Qatar counterpart to reinforce this request.\n\nHe expressed that Qatar Post has now agreed to offer its Closed Transit Service to Pakistan Post.\n\nWhen contacted, Pakistan Post Director Abid Mehmood stated that the mail service between Pakistan and Qatar has resumed, and Pakistan Post will now deliver letters, parcels, and other mail through Qatar Post.\n\nHe explained that due to financial constraints, Pakistan Post was unable to pay the outstanding dues to private airlines, and the finance ministry had been asked for a bailout package to prevent future issues.\n\nHe further mentioned that following the agreement between Pakistan Post and Qatar Post, all categories of mail, letters, parcels, and EMS will be sent to Doha in closed transit via PIA flights, after which Qatar Post will forward consignments to their final destinations through its partner airlines.\n\nOn the topic of mail delivery to the United States of America, Mr Mehmood said that under the new tax regime, letters and parcels had been suspended, but new regulations have been issued.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:45.217Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943131/pakistan-post-resolves-international-mail-backlog-via-doha",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T05:04:42.000Z"
}
