{
  "title": "US judge orders Khalil’s deportation; his lawyers to appeal ruling - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: A US immigration judge orde­red pro-Palestinian activist Mahmoud Khalil be deported to Algeria or Syria over claims that he omitted information from his green card application, court documents showed on Wednesday.\n\n“It is hereby further ordered that Respondent be Removed from the Uni­ted States to Algeria, or in the alternative to Syria,” Judge Jamee Comans wrote in a court filing.\n\nThe order dated Sept 12 by the immigration judge asserted the lack of full disclosure on Khalil’s green card application “was not an oversight by an uninformed, uneduca­ted applicant … rather, this Court finds that Resp­ondent willfully misrepresented material fact(s).”\n\nImmigration judge Jamee Comans said Khalil “willfully misrepresented material fact(s) for the sole purpose of circumventing the immigration process and reducing the likelihood his application would be denied.” Khalil, in a statement to the American Civil Liberties Union, said in response to the order: “It is no surprise that the Trump administration continues to retaliate aga­inst me for my exercise of free speech.”\n\n“Their latest attempt, through a kangaroo immigration court, exposes their true colors once again.” Khalil, a legal permanent resident in the United States who is married to a US citizen and has a US-born son, was detained by immigration for three months beginning in March and faced potential deportation.\n\nA former Columbia Uni­v­­ersity student who was one of the most visible leaders of nationwide pro-Palestinian campus protests, he was released from custody in June, but faced continued threats of deportation from federal authorities.\n\nLawyers to appeal deportation\n\nKhalil’s lawyers said they intend to appeal the deportation order while saying a federal district court’s separate orders remain in effect that prohibit the government from immediately deporting or detaining him as his federal court case proceeds.\n\nThe lawyers submitted a letter to a federal court in New Jersey overseeing his civil rights case and said he will challenge Comans’ decision. Khalil, a 30-year-old permanent US resident of Palestinian descent and a Columbia University student, was detained by US immigration authorities for more than 100 days earlier this year as the Trump administration sought to deport him.\n\nHis wife, who is a US citizen, was pregnant at the time and Khalil missed the birth of their child while in jail.\n\nHe was released on June 20. US District Judge Michael Farbiarz of New Jersey said at the time, while referring to Khalil, that punishing someone over a civil immigration matter was unconstitutional.\n\nPresident Donald Trump’s administration has cracked down on pro-Palestinian protesters such as Khalil, calling them antisemitic and supporters of extremism. Protesters, including some Jewish groups, say the government wrongly equates their criticism of Israel’s assault on Gaza and its occupation of Palestinian territories with antisemitism and their advocacy for Palestinian rights with support for extremism.\n\n“It is no surprise that the Trump adm­in­istration continues to retaliate against me for my exercise of free speech,” Khalil said.\n\n“When their first effort to deport me was set to fail, they resorted to fabricating baseless and ridiculous allegations in a bid to silence me for speaking out and standing firmly with Palestine, demanding an end to the ongoing genocide.”\n\nRights groups raise free speech and due process concerns over the deportation attempts and federal funding threats to universities where protests occurred. Columbia was at the heart of last year’s protests that demanded an end to Israel’s war.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cc988000ea3.gif",
  "retrievedAt": "2025-09-19T14:53:46.349Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943049/us-judge-orders-khalils-deportation-his-lawyers-to-appeal-ruling",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:46:21.000Z"
}
