{
  "title": "Asia Cup: Key takeaways from Pakistan’s thumping victory over UAE after day of drama - Sport - DAWN.COM",
  "author": null,
  "content": "After a day which saw cricket take the backseat and politics deliver the drama, Pakistan advanced in a tournament they had been looking to boycott hours earlier. The United Arab Emirates became the casualty as Salman Ali Agha’s men knocked the hosts out of the men’s Asia Cup in the final Group ‘A’ match on Wednesday to book a spot in the Super Four stage.\n\nAnd surprise, surprise: they have been drawn against archrivals India for Sunday’s Super Four opener, which is expected to be a heated affair after the handshake controversy and Indian captain Suryakumar Yadav’s post-match comments left a bad taste after their seven-wicket win in the first-round fixture between the two teams last Sunday.\n\nBut — despite the off-field noise — can we expect it to be a competitive affair? The simple answer is a big, big NO.\n\nIn the group match between the neighbours, it was established that Pakistan have tumbled a league below India in terms of quality and skill. But when they go up against weaker opposition, the boys in green tend to be clinical — especially with the ball.\n\nAnd they did so against the UAE, bundling Mohammad Waseem’s men out for 105 as they missed out by 41 runs. The margin, however, could have been bigger, and that brings us to our first takeaway.\n\nSaim Ayub was meant to be Pakistan’s next big star. A winning century in a One-Day International against South Africa last year had consolidated his stakes. But when the time has truly arrived, the southpaw from Karachi has become a face of disappointment.\n\nThe 23-year-old registered his third duck in a row on Wednesday — flashing outside the off-stump to lose his wicket against the UAE as well after getting out in a similar fashion against India.\n\nSaim’s shotmaking looks criminally casual as the batter continues to deprive Pakistan of important top-order runs, and with his partner Sahibzada Farhan also failing against the UAE, posting an above-par total became an uphill task for the side, which managed a mere 146.\n\nUnlike the first two matches, Pakistan went with Fakhar Zaman at the one-down position instead of Mohammad Haris, who had shown decent form with a half-century against Oman in the team’s Asia Cup opener.\n\nEven after the second wicket fell, skipper Salman Ali Agha showed up at the crease to confirm that Haris was pushed down to his less preferred number six position. The decision, however, did not backfire, as Fakhar hit a 36-ball 50 at number three.\n\nAfter having settled down on a sluggish surface with three sixes and two fours to his name, the veteran batter played a nothing shot to give away his wicket to Simranjeet Singh. Fakhar remains Pakistan’s man to watch out for in the India match, and given the team’s batting struggles, he has to bat for longer periods in the coming matches.\n\nSalman, meanwhile, struggled against UAE spinners Simranjeet and Haider Ali —the duo put up a decent show as well on a day when Junaid Siddiqui took four wickets with his right-arm pace.\n\nThe Pakistan captain, known to be a good player of spin, and having somewhat proven it in the recent tri-series, looked like he was completely trapped by the UAE bowlers. The right-hander was finding it hard to score singles, let alone score a boundary.\n\nHe added only two of them in his agonising 20 off 27, yet again raising questions over his utility as a T20 player. His misery as captain has been doubled by Hasan Nawaz’s failure to make a mark in this tournament after making a promising start to his career earlier this year.\n\nHasan was trapped in front for a duck despite expectations to be Pakistan’s lower middle-order basher with this hard-hitting prowess that he showed in the PSL and the following Bangladesh series.\n\nWhile opener Saim was decent with the ball after his third consecutive duck, tailender Shaheen Shah Afridi outshone most Pakistan batters with the bat down the order.\n\nThe left-hander hit clean as a whistle for his unbeaten 29 off 14, which featured two brutal hits for six and three fours, as he continued his batting form from the India match. Shaheen replicated that impact with the ball as well, registering 2-16 to receive the player of the match award. If he repeats such a performance against India on Sunday, he may well go on to win the blockbuster fixure for Pakistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/09/17233624bdce945.webp",
  "retrievedAt": "2025-09-19T14:54:07.104Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942724/asia-cup-key-takeaways-from-pakistans-thumping-victory-over-uae-after-day-of-drama",
  "dateList": "2025-09-19",
  "date_published": "2025-09-17T20:36:22.000Z"
}
