{
  "title": "Outlawed TTP on the radar for targeted killings of policemen in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "• FIR of Constable Saddam’s murder registered against ‘unknown terrorists’\n• Authorities believe ‘sleeper cells’ have become active in metropolis\n\nKARACHI: The ongoing inquiry into the targeted killings of policemen happened this year in the metropolis points to the outlawed Tehreek-i-Taliban Pakistan (TTP), as investigators believe that “sleeper cells” of the militant group have become active in the city.\n\nThe police have launched the investigation after registering a terrorism and murder case of the killing of a uniformed officer in Gulshan-i-Maymar on Wednesday evening.\n\nPoliceman Saddam Husain, 32, was gunned down by four assailants traveling in a car bearing no number plate in Tharo Mengal Goth, where the policeman had stopped for repair of his motorcycle from a mechanic shop.\n\nThe killers also took away his official sub-machine gun and the bulletproof jacket.\n\nA senior police officer, who is investigating the recent targeted killings of policemen in the metropolis, told Dawn that so far no group had claimed responsibility for Saddam Husain’s killing. He added that his killing was different from the killings of other policemen occurred this year.\n\n“The killers were traveling in a car, which was not the pattern of the militants belonging to the outlawed Tehreek-i-Taliban Pakistan,” he told Dawn.\n\nHowever, the officer added that two groups of the banned TTP had claimed responsibility for the earlier attacks.\n\nHe said that militants had claimed responsibility for the killing of a traffic policeman deployed at a traffic post on Mai Kolachi Road. They also claimed responsibility for the attack on a police post in Qayyumabad in which a civilian lost his life and a policeman was wounded. Another policeman was wounded in DHA in a gun attack, whose responsibility was claimed by the TTP, he added.\n\nThe outlawed groups had also claimed responsibility for the killings of two policemen, one at Pipri in Bin Qasim and the other at Shah Latif Town. They also claimed the armed attack on a police mobile in DHA within the remit of the Gizri police station occurred just a couple of days ago.\n\nHowever, the officer added that the claims of responsibility for the killing of ASI Abro in Bin Qasim and another policeman in Landhi by these groups had turned out to be doubtful. As, the officer believed, they could be linked to other factors as well.\n\nThe officer said the spate of killings seemed to suggest that TTP’s “sleeper cells” had become ‘active’ in the metropolis.\n\nFIR in Maymar killing\n\nMeanwhile, the Gulshan-i-Maymar police have incorporated Section 7 of the Anti-Terrorism Act in the FIR registered for the killing of policeman Saddam Husain on Wednesday.\n\nAs per contents of the FIR, the policeman had brought his bike for repair at a mechanic shop in Tharo Mengal Goth on a road leading to Gulshan-i-Maymar at around 7pm when four attackers traveling in a white Alto car (without number plate) targeted him.\n\nThe investigation of the case has been handed over to the Special Investigation Unit of police.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:45.861Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943014/outlawed-ttp-on-the-radar-for-targeted-killings-of-policemen-in-karachi",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:46:28.000Z"
}
