{
  "title": "World water cycle has become erratic, says WMO - World - DAWN.COM",
  "author": null,
  "content": "• Report finds one-third of global river basins had ‘normal’ conditions in 2024, but the rest were either above or below normal\n• 2024 was the third straight year with widespread glacier loss across all regions\n\nISLAMABAD: The water cycle has become increasingly erratic and extreme, swinging between deluge and drought, according to a new report from the World Meteorological Organisation (WMO), which highlights the cascading impacts of too much or too little water on economies and society.\n\nThe State of Global Water Resources report, released by WMO on Thursday, says only about one-third of the global river basins had “normal” conditions in 2024. The rest were either above or below normal — the sixth consecutive year of clear imbalance.\n\nThe year 2024 was the third straight year with widespread glacier loss across all regions. Many small-glacier regions have already reached or are about to pass the so-called peak water point — when a glacier’s melting reaches its maximum annual runoff, after which this decreases due to glacier shrinkage.\n\nSince the 1990s, ice loss has been increasing in almost all regions, and it has considerably accelerated since 2000. This is mostly due to regions consistently presenting larger summer melt than winter accumulation after the 1990s. In 2024, glaciers lost 450 Gt of water, which is equivalent to 1.2mm of contribution to global mean sea-level rise.\n\n“Water sustains our societies, powers our economies and anchors our ecosystems. And yet the world’s water resources are under growing pressure and – at the same time — more extreme water-related hazards are having an increasing impact on lives and livelihoods,” said WMO Secretary-General Celeste Saulo.\n\nAn estimated 3.6 billion people face inadequate access to water at least a month per year and this is expected to increase to more than 5 billion by 2050, according to UN Water, and the world falling far short of Sustainable Development Goal 6 on water and sanitation.\n\nAccording to the report, in the past six years only about one-third of the global river catchment area had normal discharge conditions compared to the 1991-2020 average. This means that two-thirds have too much or too little water, reflecting the increasingly erratic hydrological cycle.\n\nIn 2024, deviations of river discharge from normal conditions occurred in approximately 60 per cent of the global catchment area. In the past six years only about one-third of the global catchment area was under normal discharge conditions when compared to the 1991–2020 average.\n\nIn 2024, above- to much-above-normal discharge conditions prevailed across Central and Northern Europe and parts of Asia, including Kazakhstan and the Russian Federation.\n\nMajor basins such as the Danube, Ganges, Godavari and Indus experienced above- to much-above-normal conditions. The analysis of groundwater levels includes data from a total of 37, 406 groundwater monitoring stations across 47 countries.\n\nGroundwater levels vary locally due to aquifer heterogeneity and human influences like pumping; still, larger-scale regional trends were observed. In 2024, 38 per cent of studied stations had normal groundwater levels; 25 per cent were below- or much-below-normal and 37 per cent were above- or much-above-normal.\n\nIn 2024 river discharge exhibited deviations from normal conditions in approximately 60pc of the global catchment area. With respect to the historical period, the year 2024 was characterised by drier-than-normal conditions in approximately 30pc of the area globally, while conditions in approximately 30pc were normal and in another 30pc they were above normal. In 2024, at the global scale, a smaller basin area was under dry conditions than in 2023, while the basin area under wetter-than-normal conditions almost doubled.\n\nPublished in Dawn, September 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cc9dd93bcdc.gif",
  "retrievedAt": "2025-09-19T14:53:49.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943075/world-water-cycle-has-become-erratic-says-wmo",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T00:45:49.000Z"
}
