{
  "title": "GHQ attack case: Rawalpindi ATC dismisses plea against Imran’s appearance via video link - Pakistan - DAWN.COM",
  "author": null,
  "content": "An anti-terrorism court (ATC) in Rawalpindi dismissed on Friday the PTI’s plea that contested the decision to make incarcerated party founder Imran Khan appear in trial proceedings of the General Headquarters (GHQ) attack case via video link.\n\nImran’s arrest on May 9, 2023 sparked violent protests across the country, during which state buildings and military installations, including the GHQ, were torched and vandalised.\n\nHe was expected to attend today’s hearing at the ATC via video link, but his counsel argued before Judge Amjad Ali Shah against this arrangement on the PTI’s application.\n\nFor his part, prosecutor Zaheer Shah contended that trial proceedings were transferred to the ATC from Adiala Jail — where Imran is imprisoned — on the Punjab government’s executive order. “The authority to review the executive order lies with the constitutional court,” he added.\n\nHe further argued that in 2016, the Code of Criminal Procedure was amended to allow suspects to appear in courts via video link.\n\nShah also cited Sections 15 and 21 of the Anti-Terrorism Act, saying that they authorised the courts to make “decisions regarding trials”. He added that the government was “not obliged” to give a reason for transferring the trial.\n\nThe prosecutor said submitting an application against Imran’s appearance via video link “is tantamount to creating hurdles in the trial and wasting time”. He said it was the defence lawyer’s right to approach the superior court against the notification for transferring trial proceedings from jail to the ATC, but the trial could not be stopped.\n\nDuring his arguments, Imran’s lawyer, Faisal Malik, said, “We demand fair trial from the court.” He added that a fair trial was conditional upon the accused being physically present in the court.\n\nHe informed the ATC that they had received a copy of the provincial government’s notification yesterday, and they would approach the higher court against it.\n\nThe judge then asked Malik whether he wanted to present any more arguments on the matter.\n\nAt that, the defence counsel sought some time for consultation with his legal team.\n\nThe court then adjourned the hearing for half an hour.\n\nWhen the hearing resumed, the testimony of two prosecution witnesses — Sub-Inspector Saleem Qureshi and Sub-Inspector Manzoor Shahzad — was recorded.\n\nThe witnesses presented 13 USB drives containing video clips to the court.\n\nForty videos of the PTI founder related to May 9 were downloaded, the witnesses said in their statements.\n\nThey also presented video clips of others, namely Khadim Khokhar, Shehryar Afridi, Umar Tanveer, Sadaqat Abbasi and Sikandar Mirza, along with clippings from various national newspapers, all of which were saved on the USB drives.\n\nThe witnesses said the “digital evidence” was obtained from CCTV cameras installed on Benazir Bhutto Road, Mall Road, Liaquat Bagh and ajoining areas.\n\nConcluding the hearing, the court dismissed the PTI’s plea seeking Imran’s appearance during the proceedings in person and maintained that he would appear via video link, in line with the Punjab government’s notification.\n\nThe court summoned 10 more witnesses from the Pakistan Electronic Media Regulatory Authority, the Federal Investigation Agency, the PTI, the Press Information Department, Internal Security and the interior ministry to record their statements at the next hearing, slated for September 23.\n\nYesterday, a police spokesperson told Dawn that security will be beefed up around the Rawalpindi ATC on Friday during the hearing of the GHQ attack case.\n\nImran was indicted in the case on December 5 last year. The PTI founder, who has been incarcerated in Adiala Jail since August 2023, was arrested by the Rawalpindi police in the May 9 protest case in January 2024.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:41.892Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943160/ghq-attack-case-rawalpindi-atc-dismisses-plea-against-imrans-appearance-via-video-link",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T07:47:26.000Z"
}
