{
  "title": "FO clarifies that Pak-Saudi defence agreement ‘will not be used to threaten any third country’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Foreign Office (FO) said on Friday that the Strategic Mutual Defence Agreement signed between Pakistan and Saudi Arabia earlier this week would not be used to threaten any other country.\n\nPakis­tan and Saudi Arabia entered into a landmark mutual defence agreement, under which any aggression against one state will be considered an attack on both. The pact was signed by Prime Minister Shehbaz Sharif and Saudi Crown Prince Mohammad Bin Salman at the Al-Yamamah Palace in Riyadh on Wednesday. On Thursday, Defence Minister Khawaja Asif stated in an interview that the pact was defensive in nature.\n\nDuring a weekly press briefing today, FO spokesperson Shafqat Ali Khan called the agreement “an important milestone for promoting peace and security in the region and the world” and noted that since the 1960s, a key pillar of the ties between Islamabad and Riyadh has been defence cooperation.\n\n“The Strategic Mutual Defence Agreement formalises this decades-old and robust defence partnership,” the spokesperson said. “It is defensive in nature and not directed against any third country. It will contribute to regional peace, security and stability.”\n\nKhan added that Foreign Minister Ishaq Dar received a telephone call from the Egyptian Foreign Minister Badr Abdelatty on Thursday night, congratulating him on the landmark agreement.\n\n“The strategic defence agreement is a milestone in promoting partnership and trust,” the spokesperson said, quoting the Egyptian FM. “Both foreign ministers discussed regional and global issues and emphasised the importance of peace, stability and economic development.”\n\nAccording to the spokesperson, Pakistan and Saudi Arabia enjoy a “long and distinguished history of brotherhood and cooperation”.\n\n“[The] Pakistan-Saudi Arabia bilateral relationship is unique, enduring and multifaceted,” Khan outlined. “The leadership of the two countries share the common vision to take it to new heights.\n\n“The relationship lives in the hearts of the people of [the] two countries. [The] people of Pakistan have special sentiments for Saudi Arabia, the land of Mecca and Madinah, and they hold the Royal family in high esteem for being the custodian of the holy sites.\n\nCalling the agreement a “historic pact”, Foreign Minister Ishaq Dar told reporters in London that Pakistan has always maintained an informal defence arrangement with Saudi Arabia, which is the same as the agreement signed on Wednesday.\n\n“It’s premature to say anything, but some other countries want to enter into an agreement of this nature”, Dar said, replying to a question about whether other states will join the pact or ink similar deals. “This was not signed overnight; it has taken several months.\n\n“I believe that both sides are very happy. Let’s be frank: Saudi Arabia has stood with us during difficult times, such as the sanctions. Their support was very relevant and important,” the FM added. “Similarly, during the current crisis since 2022-2023, when we needed IMF (International Monetary Fund) support, Saudi Arabia stood with us.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/19171845f69e8bc.webp",
  "retrievedAt": "2025-09-19T14:53:44.101Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943199/fo-clarifies-that-pak-saudi-defence-agreement-will-not-be-used-to-threaten-any-third-country",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T12:25:17.000Z"
}
