{
  "title": "Iran says made ‘fair’ proposal to avert sanctions snapback - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Foreign Minister Abbas Araghchi said on Friday that he put forward a “fair and balanced” nuclear proposal to European powers to prevent the return of United Nations sanctions on the Islamic republic.\n\nIran is “introducing a creative, fair, and balanced proposal which addresses genuine concerns and is mutually beneficial,” Araghchi said on X.\n\nHe added that the proposal was made on Thursday to Britain, France and Germany — known collectively as the E3 — as well as the European Union.\n\n“Turning this idea into action can be prompt and resolve the respective bottom lines to avert a crisis,” Araghchi said, arguing that “Iran cannot be the sole responsible actor”.\n\nThe comments were made as the United Nations Security Council was set to vote on Friday on reimposing biting economic sanctions on Tehran over its contested nuclear programme.\n\nDiplomatic sources expect that Iran does not have the nine votes needed to maintain the status quo and prevent the punitive measures from being reimposed by the end of the month.\n\nThe E3, signatories to a landmark 2015 nuclear agreement that lifted international sanctions on Iran in exchange for curbs on its nuclear programme, claim Tehran has reneged on its commitments under the deal.\n\nThe accord was intended to stop Iran from obtaining nuclear weapons, a goal that Western powers and Iran’s arch-enemy Israel have long accused it of harbouring, but which it has consistently denied.\n\nFormally known as the Joint Comprehensive Plan of Action (JCPOA), the deal has been hanging by a thread ever since the United States withdrew from it in 2018 during President Donald Trump’s first term and reimposed sanctions on Tehran.\n\nThe withdrawal prompted Iran in 2019 to begin rolling back on its own commitments, including limiting access to its facilities by inspectors from the UN’s nuclear watchdog.\n\nIn June, Israel launched an unprecedented attack on Iran targeting nuclear and military sites, as well as residential areas, and killing more than 1,000 people, including senior commanders and nuclear scientists. Iran retaliated with missile and drone attacks that killed dozens in Israel.\n\nThe US briefly joined Israel’s campaign for a series of strikes on key nuclear facilities before a ceasefire was reached after 12 days of war.\n\nLast week, Iran agreed on a new framework for working with the UN’s International Atomic Energy Agency (IAEA) after it suspended cooperation following the Israeli and US strikes.\n\nThe IAEA has warned that Iran is the only non-nuclear-armed country that enriches uranium to 60 per cent — far beyond the 3.67pc cap set by the 2015 deal, and a short step from the 90pc required for a weapon.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:53:41.677Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943171/iran-says-made-fair-proposal-to-avert-sanctions-snapback",
  "dateList": "2025-09-19",
  "date_published": "2025-09-19T08:39:23.000Z"
}
