{
  "title": "Judicial Conference aims to raise funds for flood affectees",
  "link": "https://www.app.com.pk/national/judicial-conference-aims-to-raise-funds-for-flood-affectees/",
  "date_published": "2022-09-24T17:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):The Judicial Conference on Saturday aimed to raise funds for the lives affected by the calamitous floods of 2022 and the impact of climate change was greatly emphasized, along with environmental reforms required to address these issues.\nThe 9th International Judicial Conference, organized by the Law and Justice Commission Pakistan under the leadership of the National Judicial (Policy Making) Committee, was held on September 23 and 24, 2022 in the Supreme Court\nof Pakistan at Islamabad.\nIn honour of the 75th year of Pakistan’s independence, the theme of the Conference centered on past issues, and how the various organs of the state, and other stakeholders, must proceed to ensure a better future.\nBoth days of the conference were widely attended by members of the superior judiciary and district judges, foreign ambassadors and dignitaries, renowned academics, and members of the legal community from across the nation.\nThe Inaugural Session began with address by the Secretary of the Law and Justice Commission of Pakistan, Ms. Riffat Inam Butt, who shared the LJCP’s vision for the Conference, to not only devise innovative solutions for our nation’s existing problems, but to ensure our continued progress in times to come. Supreme Court Justice,\nAmin ud Din Khan, Chairman of the Organizing Committee, then elaborated on the main themes of the conference and spoke of how optimum coordination and cooperation among various stakeholders of the judiciary are crucial in bringing efficiency and fairness to our judicial system.\nThe first session of the Conference was chaired by the Chief Justice of Pakistan, Umar Ata Bandial, and highlighted the role of the judiciary in maintaining the rule of law and upholding the supremacy of the Constitution. The other speakers included members of the superior judiciary from across the country that used their platform to elaborate on the manner in which the rule of law has been upheld in the past and highlighted issues specific to their provinces, along with mechanisms to counter these issues.\nThe second day of the event hosted four thematic sessions which delved further into the issues touched upon in the first session, including the role of various stakeholders in the administration of justice, current global challenges, global economic challenges and alternative dispute resolution mechanisms, and the digitalization of legal processes to improve access to justice. Each session was chaired by a Justice of the Supreme Court and was followed by a Q&A session, allowing participants to interact with the speakers.\nThe day commenced with a dynamic session chaired by Supreme Court Justice, Yahya Afridi. It centered on the role of the police, the prosecution, and lawyers in improving the administration of justice, and the importance of enhanced legal education, especially with regard to IT learning, in achieving this. The speakers emphasized on the need for oversight in Federal Agencies to prevent and curb malpractice, and cited the Federal Ombudsman’s office as an example for a direct means to redress grievances of the citizens and promote alternative dispute resolution mechanisms.\nThe need for promoting coordination between the police and prosecution was stressed, as well as the need for Bar Councils to take proactive steps to introduce mandatory vocational programs and coordinate efforts with provincial academies to carry out the same. Another point that was highlighted was the potential conflict of interest arising from members of the Bar serving as elected representatives on other posts, and the need to address such issues to ensure transparency and stringent regulation.\nThe Third Session was chaired by Supreme Court Justice Qazi Faez Isa and addressed current global challenges and the response of the judiciary; this included issues relating to water scarcity, population growth, gender inequality, climate change and terrorism.\nThe Speakers emphasized that these issues affect the vulnerable segments of our society to a greater extent and stressed the need to develop a more sophisticated understanding of the causes of these natural disasters to enable us to develop cohesive and coherent policies regarding disaster management.\nJustice Qazi Faez Isa noted that the injunctions of Islam, too, place an obligation on us to protect the environment, preserve resources such as water and food, and mitigate the impact our activities have on the environment. The need to raise awareness regarding population control and contraceptives was also emphasized, along with the role that gender inequality plays in exacerbating this issue. The significance of ensuring FATF compliance was also elaborated on.\nThe Fourth Session was chaired by Supreme Court Justice Ijaz ul Ahsan, the theme of which was economic global challenges and dispute settlement mechanisms. The speakers of the session highlighted the role of Arbitration in commercial disputes, the use of technology in resolving disputes, the importance of ADR Centers and training of lawyers and judges in this respect. Justice Jawad Hassan while speaking on the importance of the rule of law in building the confidence of foreign investors, commended the Lahore High Court for the establishment of the first ever Commercial Courts of Pakistan which provide expeditious justice in investment/commercial matters.\nJustice Jawad Hassan then mentioned that the efficacy of ADR cannot be underestimated, rather, it ought to be utilized.\nThe Fifth Session, chaired by Supreme Court Justice Jamal Khan Mandokhail, centered on digital advancement in the legal system to facilitate access to justice and increase the efficiency of judicial processes. With regard to clearing the backlog, the Speakers on the panel greatly emphasized the need to digitalize existing records, referring to the pandemic when, despite the fact that judges were willing to work, courts had to be shut down due to the non-availability of court records. Justice Mandokhail gave the example of Balochistan where 90% of the land records are undocumented and have led to a slew of litigation which often results in criminal cases due to instances of violence between parties with competing interests.\nHe remarked that while most Judges focused on resolving pending cases to clear the backlog, he felt that it was more prudent to curb the institution of fresh cases which could be avoided by digitizing records. The standardization of laws was also suggested to make it easier to adopt AI based case resolution mechanisms in the future, which relied on clear outcomes to deliver speedy decisions.\nWhile discussing the prevalence of cybercrimes it was stated that the transnational nature of these crimes, and the required international cooperation, made it difficult to resolve them, especially in the absence of any cohesive policy for mutual legal assistance in this regard. High Court Justice Babar Sattar, while speaking on the right to free speech, stressed the importance of maintaining a balance between the competing interests of privacy and security, especially in Pakistan where authorities had a tendency to overregulate.  The act of viewpoint censorship was also criticized, as leaving a wide berth for political speech and dissent in society was one of the characteristics of a democratic society. In relation to contempt Justice Babar Sattar referred to the substantial detriment test, stating that if the requirements of this test were not met, there should be no instance of contempt.\nThe preceding activities were followed by a Concluding Session, wherein the Chief Justice of Pakistan, Umar Ata Bandial gave his concluding remarks followed by a vote of thanks by the Secretary, LJCP, Ms. Riffat Inam Butt.\nThe Conference came to a close after the distribution of plaques to the speakers and certificates to the organizing members of the Conference.",
  "retrievedAt": "2025-08-11T15:37:37.013Z"
}
