{
  "title": "PM calls for acceptance of viable, independent, contiguous Palestinian state",
  "link": "https://www.app.com.pk/national/pm-calls-for-acceptance-of-viable-independent-contiguous-palestinian-state/",
  "date_published": "2022-09-23T21:23:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 24 (APP):Prime Minister Shehbaz Sharif Friday said the only just, comprehensive and lasting solution of the Palestinian question was the acceptance of a viable, independent and contiguous Palestinian State, with the pre-1967 borders, and Al-Quds Al-Sharif as its capital.\nSpeaking at the 77th session of the United Nations General Assembly here, he reiterated Pakistan’s deep concerns over the numerous conflicts across the Middle East, including in Syria and Yemen.Pakistan supported all possible efforts to promote their peaceful resolution, he added.“We call on Israel to put an immediate end to the blatant use of force and flagrant violations of human rights of the Palestinian people and the repeated desecration of the Holy Al Aqsa Mosque,” he stated.The prime minister said the UN Security Council and the General Assembly must be empowered to play their respective roles under the UN Charter.\n“The Security Council must be expanded by adding 11 new non-permanent members to make it more representative, democratic, transparent, effective and accountable. Adding new permanent members will paralyze the Council’s decision-making, enlarge its representational deficit, and create new centres of privilege in violation of the principle of sovereign equality of member states,” he commented.\nCalling for the nations to step back from the precipice, he urged the world to restore peace in Europe, avoid a war in Asia and resolve festering conflicts across the world.“We will work with all those committed to the UN Charter’s principles – to restore the vision which created the United Nations and to equip this Organization with the capacity to preserve global peace and promote universal prosperity,” he added.",
  "retrievedAt": "2025-08-11T15:37:42.370Z"
}
