{
  "title": "Bilawal meets FMs of Kuwait, Belarus, Azerbaijan",
  "link": "https://www.app.com.pk/national/bilawal-meets-fms-of-kuwait-belarus-azerbaijan/",
  "date_published": "2022-09-23T22:00:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 24 (APP):Foreign Minister Bilawal Bhutto Zardari Friday held meetings with Foreign Minister of Kuwait Ahmed Nasser Al-Mohammed Al-Sabah and Foreign Minister of Belarus Vladimir Makei and discussed matters of mutual interest.\nAccording to Foreign Office, the meetings took place on the sidelines of 77th session of the United Nations General Assembly here.\nDuring meeting with the foreign minister of Belarus, they discussed the situation in Ukraine. Foreign Minister Bilawal Bhutto Zardari reiterated his invite to Belarusian Foreign Minister to visit Pakistan and looked forward to welcoming him in Islamabad at an early date.He said that Pakistan desired to take the relationship forward by broadening interaction in all spheres of cooperation.The Foreign Minister expressed concern at the situation in Ukraine emphasizing that conflict was not in anyone’s interest and it particularly impacted the developing countries.Pakistan emphasized de-escalation, dialogue and diplomacy to find a diplomatic solution. He expressed the hope that talks between the Russian and Ukrainian representatives would lead to normalization of situation.The two leaders agreed to further enhance Pakistan-Belarus bilateral cooperation.\nForeign Minister Bilawal also met Foreign Minister of Azerbaijan Jeyhun Bayramov and Ms. Deemah Al Yahya, Secretary General Digital Cooperation Organization (DCO).\nDuring meeting with the minister of Azerbaijan, the Foreign Minister expressed his gratitude to Azerbaijan for its generous financial assistance for the flood affected people of Pakistan. This was manifestation of deep brotherly ties between the two nations that always stood the test of time and in hour of need.\nThe two Foreign Ministers expressed satisfaction on the positive trajectory of high-level interactions and growing cooperation in multiple areas between the two countries. They discussed ways to further deepen bilateral ties and underscored the need to further boost trade and economic linkages.\nThe Foreign Minister appreciated support of Azerbaijan as a valuable member of the OIC Contact Group on Kashmir. He thanked Foreign Minister Bayramov for Azerbaijan’s steadfast support to the just and legitimate cause of the Kashmiris.\nBoth sides exchanged views on regional and international issues of mutual interest and agreed to continue close collaboration.\nForeign Minister Bilawal also met Sheikh Abdullah bin Zayed Al Nahyan, Minister for Foreign Affairs and International Cooperation of the United Arab Emirates.\nThe two leaders discussed the fraternal relations between the two countries; and explored ways and means to further strengthen mutually beneficial cooperation.\nThe Foreign Ministers agreed to deepen investment cooperation and stimulate economic partnership through active participation of the private sector from both sides.\nThe two leaders also exchanged views on regional and international issues of mutual interest.\nForeign Minister Bilawal Bhutto Zardari underscored that Pakistan attached high importance to its political and economic relationship with the UAE. He thanked the leadership and people of the UAE for their generous support during the recent floods in Pakistan. Sheikh Abdullah expressed sincere condolences and solidarity with Pakistan over the loss of precious lives and damage to infrastructure.\nThe Foreign Minister also held bilateral meeting with Faisal Bin Farhan, Foreign Minister of Saudi Arabia.",
  "retrievedAt": "2025-08-11T15:37:43.117Z"
}
