{
  "title": "Stanford report unearths Indian social media coordinated, maligning propaganda",
  "link": "https://www.app.com.pk/national/stanford-report-unearths-indian-social-media-coordinated-maligning-propaganda/",
  "date_published": "2022-09-24T10:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP): An analytical report of Stanford, a global internet observatory center, has exposed Indian government’s backed social media accounts spreading plethora of fake news and propaganda against Pakistan on popular social media platform.\nThe report published under title, ‘My heart belongs to Kashmir: an analysis of a pro-Indian army covert influence operation on Twitter’.\nThe report said that on August 24, Twitter shared 15 datasets of information operations, it identified and removed from the platform with researchers in the Twitter Moderation Research Consortium for independent analysis.\nOne of these datasets included 1,198 accounts that tweeted about Pakistan. Twitter suspended the network for violating their platform manipulation and spam policy, and said that the presumptive country of origin was India.\nStanford built its analysis on a report on this same network by the Australian Strategic Policy Institute.\n“The network tweeted primarily in English, but also in Hindi and Urdu. Accounts claimed to be proud Kashmiris and relatives of Indian soldiers. Tweets praised the Indian Army’s military successes and provision of services in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and spew venom against Pakistan and China.\nTwo accounts existed to target specific individuals who were perceived as enemies of the Indian government, the report said.\nThe Stanford Internet Observatory, founded in 2019, is a cross-disciplinary programme of research, teaching and policy engagement for the study of abuse in current information technologies, with a focus on social media.\nThe center also cited certain articles in the Indian press carrying Twitter, Facebook, and Instagram posts and the accounts which had been previously suspended including the official accounts for Chinar Corps, a branch of the Indian occupation army operating in IIOJK.\n“Twitter accounts, we note that official Chinar Corps Twitter, Facebook and Instagram accounts were temporarily suspended in the past, and Indian Army officials told reporters that the stated reason for the Facebook and Instagram suspensions was Meta’s policy on coordinated inauthentic behavior. The content of the Twitter network discussed in this report was consistent with the objectives of the Chinar Corps,” the report said.\nThe Asian News International, the Print, the India Express, English Jagram, and the New Indian Express had reported suspension of these accounts for “coordinated inauthentic behaviour”.\nThe report further said that the Chinar Corps Facebook, Instagram, and Twitter accounts were all currently live, establishing that the content of the Twitter network was consistent with the Chinar Corps’ objectives of praising the Indian army in IIOJK.\nMany of the accounts in the network claimed to be Indians, often Kashmiris, and\nfrequently said they were located in Kashmir. One bio said “Proud Indian and Proud Kashmiri. My Heart belongs to Kashmir, Soul to India and Life to Humanity.” It was common for account bios to say that they were relatives of Indian army soldiers.\nCertain accounts claimed to be freelance reporters or volunteers in Kashmir; one said they were an aspiring YouTuber while many claimed to be students.\nAccount bios frequently linked to Facebook, Instagram, and YouTube accounts, some of which were live and some suspended, Stanford further digs into the trends.\nThe suspended network’s tweets tagged both authentic and suspended accounts,\nincluding regional journalists and politicians. Tweets tagging journalists aimed either to bring events to the attention of reporters, or to bring the reporter to the attention of followers—often in an apparent attempt to target the reporter.\nThe accounts had similar usernames and tweets liked ‘KashmirTraitors’.\nThe Twitter accounts and YouTube channel targeted specific individuals, focusing on what the account deemed “anti-India” journalists, calling reporters “#whitecollarterrorist,” for example; saying that they were working to corrupt the minds of Kashmiris; and accusing them of taking money from Pakistan.\nThe accounts also targeted activists. One @KashmirTraitor1 thread, for example, targeted the activist and author Pieter Friedrich.\nThese two Kashmir traitor accounts also targeted the Pakistani government.\nIn calling out particular individuals, @KashmirTraitors would sometimes tag the official Chinar Corps account, @ChinarcorpsIA, to draw their attention to a thread.\nResearch suggests inauthentic accounts have amplified articles from these domains, and that the domains shared anti-Pakistan and anti-China content, along with false news stories.\nThey highlighted university student protests in Balochistan negatively.  One tweet said, “Students protesting in Islamabad against the inaccessibility of internet in #Balochistan.”\nAccounts accused Pakistan of spreading unfounded claims of Indian army atrocities, and accused Pakistan of committing human rights abuses and protecting terrorists.\nTweets propagated that Pakistan was not safe for Hindus nor Muslims, and that Pakistan abandoned Pakistani citizens in China when the COVID-19 pandemic began. Tweets also criticized women’s rights in Pakistan and supported terrorists in Balochistan.\nA common narrative in the network was that India’s military dominated China’s military. The hashtag #IndiaChinaFaceOff was used.",
  "retrievedAt": "2025-08-11T15:37:39.655Z"
}
