{
  "title": "Pakistan seeks peace, good relations with its neighbours: Kaira",
  "link": "https://www.app.com.pk/national/pakistan-seeks-peace-good-relations-with-its-neighbours-kaira/",
  "date_published": "2022-09-24T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):Advisor to Prime Minister on Kashmir Affairs and Gilgit Baltistan Qamar Zaman Kaira on Saturday said that Pakistan was ready to dialogue on all issues with India, including Kashmir, and looking for good relations with all its neighbours.\nTalking to PTV News, Pakistan Peoples Party senior leader said the illegal process of changing Kashmir’s territorial status against the UN resolutions, and the wishes of Kashmiris were strongly protested by Pakistan, and all political parties and state institutions have the same stand on this issue.\nTalking to PTV News, the PPP’s senior leader said Pakistan had strongly protested the India’s illegal move of changing Kashmir’s territorial status against the UN resolutions and the wishes of Kashmiris. “All the political parties in Pakistan and state institutions have the same stand on the issue,” he added.\nHe said Pakistan never sought war, rather it was a peace-seeker, which never shied away from negotiating with India on any issue.\nKaira praised the speech of Prime Minister Shehbaz Sharif at the United Nations General Assembly (UNGA) by saying that the PM skilfully drew the world’s attention to the Kashmir issue. Likewise, he added, Foreign Minister Bilawal Bhutto Zardari also stressed on the peaceful resolution of the protracted Kashmir issue in his meetings and speeches at various international forums.\nAnswering to a question regarding climate change and its effects on Pakistan, he said the PM and the foreign minister had presented the position of Pakistan in a very comprehensive manner and made the whole world realize the devastating effects of climate change on Pakistan.\n“Pakistan’s survival is seriously threatened and the world has pledged to support Pakistan.”\nUnfortunately, Kaira said, some political opportunist were criticizing the PM’s recent international visit, but in view of the prevailing situation, his visit was very necessary to make the international community aware of the flood disasters, and to help boost financial aid for flood relief.”",
  "retrievedAt": "2025-08-11T15:37:39.980Z"
}
