{
  "title": "PM Shehbaz arrives in New York to lead Pakistan’s delegation at UNGA",
  "link": "https://www.app.com.pk/national/pm-shehbaz-arrives-in-new-york-to-lead-pakistans-delegation-at-unga/",
  "date_published": "2024-09-23T23:00:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Sep 24 (APP): Prime Minister Shehbaz Sharif arrived in New York Monday evening to lead Pakistan’s delegation at the 79th session of the United Nations General Assembly (UNGA), which opens on Tuesday.\nThe prime minister will go through a hectic schedule during his five-day visit.\nMore than 130 world leaders are set to attend the annual event.\nPM Shehbaz Sharif will address the 193-member General Assembly on Sept 27.\nMassive security measures are in place in and around the UN complex for the Assembly’s high-level debate from Sept 24 to 28.\nBefore he departed from Islamabad to London last week, PM Shehbaz Sharif said in a post on X that he would “present Pakistan’s perspective to the world, advocate our interests, and strengthen international partnerships.”\nThe prime minister is also set to address several summit meetings, including the ‘high-level meeting on existential threat posed by sea-level rise’, ‘SDG Moment 2024’, and the UN Security Council’s open debate on ‘Leadership for Peace’.\nDuring his visit, PM Shehbaz will highlight the impacts of climate change on countries; Pakistan’s sacrifices in its fight against terrorism; challenges faced by the debt-burdened countries; India’s occupation of Kashmir; and the ongoing genocide of Palestinians by Israeli occupation forces.\nThe prime minister will interact with members of the US-Pakistan Business Council and Pakistani bankers to apprise them of his government’s pro-business and investment policies.\nAdditionally, he is set to meet with UN Secretary-General Antonio Guterres; presidents of the UN General Assembly, European Commission, and the World Bank; Bill Gates; and International Monetary Fund Managing Director Kristalina Georgieva.\nIn a scheduled meeting with Palestinian President Mehmood Abbas, PM Shehbaz will consult on ways to persuade the international community to accelerate its efforts to end Israel’s oppression of Palestine.\nThe prime minister will also attend a luncheon reception by Sultan of Brunei Darussalam Hassanal Bolkiah on the completion of 40 years of his country’s UN membership, as well as a dinner reception by Chief Advisor of Bangladesh Dr Muhammad Yunus to mark 50 years of his country’s UN membership.\nHe will also have a one-on-one meeting with Dr Yunus as the relations between Bangladesh and Pakistan have dramatically improved following the ouster of Sheikh Hasina, the former prime minister.\nDefence Minister Khawaja Muhammad Asif, Information and Broadcasting Minister Attaullah Tarar, Federal Education and Professional Training Minister Khalid Maqbool Siddiqui, and Special Assistant to PM Tariq Fatemi are members of the prime minister to delegation.",
  "retrievedAt": "2025-08-10T21:20:02.449Z"
}
