{
  "title": "Bill moved in Senate to improve living standard of transgender persons",
  "link": "https://www.app.com.pk/national/bill-moved-in-senate-to-improve-living-standard-of-transgender-persons/",
  "date_published": "2022-09-26T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): A private members’ bill was moved in Senate on Monday seeking amendments in the Transgender Persons (Protection of Rights) Amendment Act, 2018 aimed to reduce suffering, improve standard of living and bring reform in the lives of the deprived segment of society.\nThe Bill moved by Senator Fawzai Arshad, was seeking amendments in definitions of “gender expression” and “gender identity”. The Bill aimed to redefine the transgender person and also seeking amendments in various sub-sections of Section 3 and focus to omit the expressions related to self-perceived gender identity of transgender persons. It sought to omit the expression “as per his or her self-perceived gender identity, as such,” from sub-section 1 of Section 3 and expressions“ as per his or her self-perceived gender identity” from sub-sections 2 and 3 of Section 3.\nIt also proposed to delete sub-section 4 from Section 3 which says “a transgender person already issued CNIC by NADRA shall be allowed to change the name and gender according to his or her self perceived identity on the CNIC, CRC, Driving License and passport in accordance with the provisions of the NADRA Ordinance, 2000”.\nThe Bill also sought amendments in Sections 7 and 8 related to the share of inheritance and right to education.\nThe statement of objects and reasons of the proposed Bill says that this legislative proposal has been brought to fill the gaps and make this Act more effective and worthwhile for reducing suffering, improving standard of living and reforming the most deprived segment of the society.\nIt states that the Transgender Persons (Protection of Right) Act, 2018 has been enacted to protect and safeguard the rights of transgender community in Pakistan. Its objective is to ensure provision of rights to own, inherit property, acquire education and employment, vote for candidates of their own choice, hold public office, assemble peacefully for any lawful purpose, access to public places and ensure fulfillment of fundamental rights for the transgender people, residing in Pakistan.\nHowever, various lacunas and loopholes have been observed in this Act, that needs to be addressed and transferred its benefits to the said group of people on priority basis.\nMoreover, the said Act does not conform to the principles and rules, developed under Sharia for dealing with the issues, related to transgender persons in a Muslim society.\nHence, these amendments are brought to fill the gaps and make this Act more effective and worthwhile for reducing suffering, improving standard of living and reforming the most deprived segment of the society.",
  "retrievedAt": "2025-08-11T15:38:10.871Z"
}
