{
  "title": "CPAFFC donates RMB 125 million in relief assistance to flood victims",
  "link": "https://www.app.com.pk/national/cpaffc-donates-rmb-125-million-in-relief-assistance-to-flood-victims/",
  "date_published": "2022-09-26T08:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP):The Chinese People’s Association for Friendship with Foreign Countries (CPAFFC) has donated relief and rehabilitation assistance worth RMB 125 million for the flood victims of Pakistan.\nThe donation announcement was made by Lin Songtian, President of CPAFFC during a special ceremony attended by Pakistan’s Ambassador to China Moin-ul-Haque and other officials.\nDuring the ceremony, the President of CPAFFC, Lin Songtian, sharing his grief and condolences with the bereaved families, said that in the wake of the devastating floods, the government and people of China had made a substantive contribution to Pakistan’s relief and rehabilitation efforts.\nHe said that Chinese assistance to Pakistan demonstrated its unique friendship with Pakistan and strong people-to-people ties between them.\nPresident Lin highlighted that besides ongoing assistance, China would also play its role in post-flood rehabilitation and infrastructure development in the affected areas.\nSpeaking at the occasion, the Ambassador of Pakistan to China, Moin-ul-Haque lauded timely assistance by the CPAFFC and China’s local governments and enterprises for reinforcing Pakistan’s ongoing relief efforts for the flood victims.\nRecalling that the two countries have always stood together in difficult times, he said that today’s ceremony is yet another demonstration of China’s solidarity and sympathy with the people of Pakistan.\nAmbassador Moin also requested the Chinese government to play a proactive role in Pakistan’s economic recovery in the post-flood phase and reiterated Pakistan’s strong desire to deepen cooperation with China in green development, climate resilience, and disaster management.\nThe event was also attended by Ambassador Sha Zukang, President of the China-Pakistan Friendship Association, and Li Xikui, Chairman of China Friendship Foundation for Peace and Development (CFFPD).",
  "retrievedAt": "2025-08-11T15:38:15.485Z"
}
