{
  "title": "Transgenders part of society, should be given full rights: Ashrafi",
  "link": "https://www.app.com.pk/national/transgenders-part-of-society-should-be-given-full-rights-ashrafi/",
  "date_published": "2022-09-26T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): Special Representative to the Prime Minister on Interfaith Harmony and Middle East Hafiz Muhammad Tahir Ashrafi on Monday said transgenders were a part of the society, just like other people, and they should be given full rights.\nTalking to a delegation of Ulema and Mashaykh, Ashrafi, who is also the chairman of Pakistan Ulema Council, clarified that religious and political parties were not against the transgenders’ rights but they had valid objection on a sub-section of the act which allowed anyone to formally register his/her gender based on self-perceived identity without any approval.\n“We welcome the bill and amendments prepared by Jamiat Ulema-e-Islam-Fazl (JUI-F) with reference to the Transgender Act,” he said, adding the responsibility was on the JUI-F Chief Maulana Fazl-ur-Rehman’s shoulder as his party was the largest religious and political party in the parliament.\nHe said the bill was passed four years ago and the government’s proposal to form a joint committee for amendments in the bill was a step in the right direction.\nHe said the Constitution did not allow any law contrary to Islamic Shari’ah as the Transgender Act had shortcomings on the part of all. “We should all admit that everyone remained ignorant about approval of the bill four years back,” he maintained.\nAshrafi said the law minister had proposed to form a joint committee to redress the Transgender Act’s sections opposing the Constitution and Islamic Shari’ah.\nExpressing condolence on the death of prominent religious scholar Al-Sheikh Yusuf Qaradawi, he said his services to Islam and Muslim Ummah could not be forgotten.\nOn the occasion, he was flanked by Maulana Tahir Aqeel Awan, Allama Tahir Al Hasan, Maulana Muhammad Ashfaq Patafi, Maulana Asadullah Farooq, Allama Zubair Abid, Maulana Aslam Siddiqui, Maulana Saadullah Ludhianwi, Maulana Aziz Akbar Qasim and others religious scholars.",
  "retrievedAt": "2025-08-11T15:38:04.124Z"
}
