{
  "title": "Minister Ahsan Iqbal urges key stakeholders to chalk out strategy bespoke for rehabilitation of flood victims",
  "link": "https://www.app.com.pk/national/minister-ahsan-iqbal-urges-key-stakeholders-to-chalk-out-strategy-bespoke-for-rehabilitation-of-flood-victims/",
  "date_published": "2022-09-26T18:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): Minister for Planning Development and Special Initiatives Professor Ahsan Iqbal has engaged key economists, various stakeholders in a roundtable conference, held here, to map out the effective strategy specific to the rehabilitation plan of flood-affected people.\nIn order to implement the rehabilitation plan for the flood-affected people, Federal Minister for Planning Development and Special Initiatives Professor Ahsan Iqbal on Monday engaged the country’s top economists, key development stakeholders and donors before sending a comprehensive rehabilitation plan to the Prime Minister for the approval, said a press release issued here.\n“The basic objective is to get your input for the implementation of a short and long-term rehabilitation plan for the flood-affected people,” said the minister, while addressing the participants.\nThe government, he said, was committed to protect the affected people despite the fact that the scale of the disaster was huge, while urging the experts to share their respective ideas so rehabilitation plan could be implemented immediately.\nThe roundtable conference  was attended by the Additional Secretary PD&SI, Chief Economist, all members of the planning commission, economists and donors.\nThe Chief Economist in his briefing informed the participants that around $ 3billion worth of money losses incurred due to the heavy floods which had  badly affected the country’s agriculture and infrastructure sector.\nHe said that various ministries were sharing damage assessment reports which would help in the rehabilitation plan.\nSpeaking at the occasion, the minister said that the recent flood had not only claimed lives, but also affected  infrastructure and livelihood at a mega scale.\nHe said that the government had taken a number of initiatives as federal and provincial governments were busy in rescue operations since the floods wreaked havoc in the country.\nThe immediate challenge is the early recovery of the flood-affected people as the agriculture sector had been affected badly which would have a negative impact on our economy and which needed to be addressed immediately, said the minister, while appreciating the ideas shared by the various development stakeholders.\nDr. Adnan Rafiq, Member Governance, Planning Commission suggested that the owner driven reconstruction approach should be adopted with effective mechanisms to ensure compliance with the building codes developed by the government.\nHe also argued that vulnerable groups should be prioritised in the rehabilitation process which includes women and youth.\nDr. Abid Qaiyum Suleri, heading Pakistan’s premier policy research think-tank, Sustainable Development Policy Institute (SDPI) suggested the government to start the rehabilitation process at the district level which he believed was a more effective way to start the rehabilitation process.\nThe participant also suggested focusing on Sindh’s land which remained an agriculture basket mainly inundated.\nAqdas Afzal, Program Director at Habib University emphasised the importance of Benazir Income Support Programme BISP which was effective for the flood-affected people and suggested the government to link it with the index.\nThe minister appreciated the ideas and assured the participants to incorporate their ideas with the rehabilitation plan before sending it to the Prime Minister.",
  "retrievedAt": "2025-08-11T15:38:04.146Z"
}
