{
  "title": "ANF arrests 27, recovers drugs worth US$ 66.194 mln in countrywide operations",
  "link": "https://www.app.com.pk/national/anf-arrests-27-recovers-drugs-worth-us-66-194-mln-in-countrywide-operations/",
  "date_published": "2023-02-07T10:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 7 (APP): Anti Narcotics Force (ANF) in various operations across the country, arrested 27 accused smugglers including two women, and recovered 1758.295 kg drugs worth US$ 66.194 million internationally from their possession.\nAccording to the ANF spokesperson, the team conducted 31 operations across the country and seized drugs comprising 6.708 kg heroin, 1446.098 kg hashish, 31.900 kg opium, 19.558 kg Methamphetamine (Ice), 0.031 kg marijuana and 254 kg ketamine.\nIn Balochistan, the force recovered 1147.3 kg hashish in five operations while arrested two persons involved in drugs smuggling.\nThe ANF in Punjab recovered 23.861 kg drugs in six operations while arrested five persons involved in drugs smuggling including a woman and impounded a vehicle. The seized drugs comprised 1.124 kg heroin, 16.800 kg hashish, 0.031 kg marijuana and 5.906 kg methamphetamine (Ice).\nThe force in Khyber Pakhtunkhwa (KP) recovered 8.836 kg drugs in five operations while arrested five persons involved in drugs smuggling and impounded a vehicle. The seized drugs comprised 0.192 kg heroin and 7.644 kg hashish.\nThe ANF in Sindh recovered 290.2 kg drugs in six operations while arrested five persons involved in drugs smuggling and impounded two vehicles. The seized drugs comprised 1.200 kg heroin, 35 kg hashish and 254 kg Ketamine.\nThe ANF North recovered 288.098 kg drugs in nine operations, arrested ten persons including a woman in drugs smuggling and impounded three vehicles. The seized drugs comprised 30.900 kg Opium, 4.192 kg Heroin, 239.354 kg Hashish and 13.652 kg Methamphetamine (Ice).\nCases have been registered at respective ANF police stations under CNS Act 1997 (Amended 2022) and further investigations were underway.",
  "retrievedAt": "2025-08-11T05:57:51.735Z"
}
