{
  "title": "9 million families to be provided financial assistance under BISP by June: Shazia Marri",
  "link": "https://www.app.com.pk/national/9-million-families-to-be-provided-financial-assistance-under-bisp-by-june-shazia-marri/",
  "date_published": "2023-02-07T16:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 07 (APP): Federal Minister for Poverty Alleviation and Social Safety Shazia Marri on Tuesday said that around 8.9 million families being provided financial assistance under the BISP would be increased up to 9 million by June 2023 and up to 10 million by 2024.\nShe said financial assistance was provided directly to the women as family heads, which clearly reflected the priorities of the BISP program towards women empowerment.\nThe minister was speaking with a delegation of USAID, headed by Michael Schiffer, Assistant Administrator of the Bureau for Asia who called on the former at the Embassy of Pakistan Washington D.C, said a message received here.\nThe meeting discussed in detail various interventions being made under the umbrella of the Benazir Income Support Program, to provide relief to the vulnerable sections of the society.\nThe minister said that BISP over the last 14 years has evolved into a successful model and it was serving the poorest of the poor without any discrimination.\nShe highlighted that the National Social Economic Registry had enabled the government of Pakistan with a scientific database to reach out to the most deserving and marginalized strata of society in Pakistan.\nThe conditional cash transfers in the education and health sector were aimed at the socio-economic uplift of poor families with education, better health, and skill development. She informed the delegation that 364 Benazir Nashonuma Facilitation Centers were operating across Pakistan to address the nutritional issues of the women and children.\nThe federal minister briefed the USAID delegation about the devastations caused by catastrophic floods of 2022, which inundated one-third of the country, and affected 33 million people including 04 million children, and hundreds of thousands of pregnant women. She also updated on the latest status of recovery, rehabilitation and reconstruction efforts and how BISP was helping in this effort.\nOn provision of relief in the aftermath of floods, the delegation was informed that an amount of Rs. 70 billion was disbursed to 2.5 million affected families through BISP.\nThe federal minister appreciated the continued support of World Bank, ADB, and GIZ towards social safety and poverty alleviation. She mentioned the Pakistan Crisis-Resilient Social Protection (CRISP) Program of the World Bank to help establish adaptive social protection. The minister informed that through the National Poverty Graduation Program (NPGP), BISP beneficiaries were being provided assets and training in order to graduate them out of poverty.\nThe federal minister acknowledged the contributions of USAID and said that Pakistan looked forward to scaling up its partnership with the agency in expanding the outreach of the program.\nMr. Michael Schiffer lauded the role of BISP in the social protection sector especially in providing swift relief to the calamity-affected population.\nHe underscored that USAID and the US Administration looked forward to strengthening their friendship and partnership with Pakistan.\nMr. Michael Schiffer stated that USAID would like to balance its portfolio via allocation of sectoral assistance in social protection, poverty alleviation, nutrition, and education.",
  "retrievedAt": "2025-08-11T05:57:18.037Z"
}
