{
  "title": "Senate Panel directs to remove Deputy Manager NTDC for country-wide power breakdown",
  "link": "https://www.app.com.pk/national/senate-panel-directs-to-remove-deputy-manager-ntdc-for-country-wide-power-breakdown/",
  "date_published": "2023-02-07T16:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 07 (APP): The Senate Standing Committee on Power on Tuesday expressed dismay over the absence of the Secretary Power Division and Managing Director National Transmission and Despatch Company (NTDC) in the meeting and directed to remove Deputy Manager NTDC from his post for prolonged country-wide power outage on January 23.\nThe Committee which met with Saifullah Abro in the Chair also expressed dissatisfaction over the committee set up to find causes of the prolonged power breakdown in the country and directed the Ministry of Power Division to submit the inquiry report at the earliest.\nThe Additional Secretary Power Division apprised the committee that the report was not yet finalized and still investigation was under progress.\nThe Chairman National Electric Power Regulatory Authority (NEPRA) informed that after a country-wide power outage in 2021, the NTDC was directed to carry out a study from foreign experts to stop the reoccurrence of power breakdown. However, no action was taken in this regard, he added.\nThe NTDC officials told that the black start facility was available in different power plants of the country adding that Tarbela, Mangla, Warsak and Uch Power plants were used to restore the power system while this facility was also available at Kotri, Faisalabad and Shahdara.\nThe committee also sought details of MDs appointed in NTDC during the period of 2013 to date. The Senate Panel also discussed the issue of recruitment in Peshawar Electric Supply Company (PESCO).\nThe Committee directed to relieve 128 persons appointed in the company and inform the committee about the development through a letter. Merit was not only violated during the appointment process in the PESCO but also committee’s recommendations were also ignored.\nThe NTDC officials also briefed the Senate Panel Double Circuit Transmission Line from Daus to Islamabad.\nThe meeting was attended by Senators Fida Muhammad, Sarwar Khan, Zeeshan Khanzada, Sana Jamali, Haji\nHidayatullah, Muhammad Asad Junejo and officials of concerned departments and the ministry.",
  "retrievedAt": "2025-08-11T05:57:02.516Z"
}
