{
  "title": "Fall of Kabul: Time for Afghan leadership to unite for broad-based political settlement",
  "link": "https://www.app.com.pk/national/fall-of-kabul-time-for-afghan-leadership-to-unite-for-broad-based-political-settlement/",
  "date_published": "2021-08-17T08:30:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 17 (APP): History repeated itself on August 15, 2021 when Taliban fighters entered the Presidential Palace in Kabul after 20 years amid overwhelming support by Afghans hoping to bring lasting peace and stability in the war-ravaged country after US and NATO withdrawal from Afghanistan.\nFacing no major resistance from Afghan National Army (ANA), the Taliban fighters poured into Afghanistan capital, Kabul from all four sides on Sunday and entered the Presidential Palace with slogans of ‘Allah-o- Akbar’ after a two-decade armed struggle against occupational forces for toppling their government in 2001.\nTaliban took control of important Afghans Government buildings including Presidential Palace and Radio Kabul after fleeing former President Ashraf Ghani abroad.\n“History repeated itself in Afghanistan. 20 years ago, Taliban Government had been ousted by US and NATO in retaliation of 9/11 World Trade Centre’s terrorists aerial attack and now Taliban are back in Kabul with full power and might after US and NATO troops withdrawal,” said Syed Akhtar Ali Shah, former Additional Inspector General (AIG) and Home Secretary KP while talking to APP.\n“The entire Afghanistan is now in complete control of the Taliban after capturing all key Government buildings and institutions including Afghan Presidential Palace and Radio Kabul. Administrative and political vacuum created in Afghanistan has been fulfilled by the Afghan Taliban who were enjoying overwhelming support of Afghans in almost all provinces there.”\n“Afghanistan is just like a black hole where every kind of political theory is bound to fail, military strategy could not succeed, predication and analysis are short lived and things take their own turns besides events unfolded in strange manner.“Quick fall of Kabul has stunned everybody including me,” he said.\nMehmood Shah, senior defense analyst and former Security Law and Order of erstwhile Fata (now called merged areas) said the fall of Kabul to Afghan\nTaliban without ANA’s resistance, has proved that Ashraf Ghani Govt had lacked popularity and support of Afghan people.\n“Afghans were not happy with pro-US policies of the Ashraf Ghani Government and wanted lasting peace, justice, supremacy of merit, employment and socioeconomic development in their war-torn country.”\nThe withdrawal of foreign troops after 20 years long occupation has confirmed that the attack on Afghanistan was a big blunder of the US as it achieved nothing from its military adventurism despite spending billions of dollars in Afghanistan,” he added.\nHe said Afghanistan has a long history and culture of giving tough resistance to occupational forces including Russia and US and never accepted foreign subjugation.\nLack of fighting skills, professional training and motivation has led to the downfall of Afghan National Army (ANA), National Directorate of Security (NDS) and Ashraf Ghani Government, he said.\n“Afghanistan has a long history of no regular professional army and its tribal militia often fought against occupational forces,” he said.\nBrigadier Shah claimed that the US and India had made huge investments in Afghanistan for safeguarding their personal interests. These countries had no interest in peace, stability and development in the war-ravaged country, which caused their downfall in Afghanistan.\nAkhtar Ali Shah said Afghan Taliban were much more experienced this time as they have succeeded in cutting key communication and transportation routes between Kabul and Northern Areas including Mazar Sharif. As a result, ANA and NDS could not get necessary redeployment, weapons and ammunition in time to fight the Taliban.\n“Wars cannot be fought on material resources, weapons and manpower rather on faith and belief in abilities and strengths,” he said, adding ANA had failed because its troops lacked professional training and motivation.\nThe major challenge before Taliban Govt would be wiping out terrorism from Afghan soil. Around 6,000 to 7,000 TTP terrorists backed by India were operating in Afghanistan and were carrying out terrorist activities inside Pakistan,” Akhtar Ali Shah said, adding bringing these terrorists to justice would be the responsibility of the new Afghan Government.\nBrigadier Mehmood Shah said Pakistan has completed barbed fencing on about 2,400 kilometers long porous border with Afghanistan and constructed a number of forts to ensure that there was no illegal cross border movement and infiltration of unwanted elements taking place and ensure security of Pakistan.\n“Pakistan has no favorite group in Afghanistan. We have a principled stance to support efforts for political settlement of the Afghan conflict,” said Mehmood Shah.\n“It is the people of Afghanistan to decide about their Government. Any Govt installed from outside in Afghanistan is bound to fail,” he said.\nAkhtar Ali Shah said in the Doha Peace Agreement, it was decided that Afghan soil should not be used against foreign countries and a durable solution of the Afghan conflict would be searched out through intra-Afghan peaceful dialogue.\nMazoorul Haq, former Ambassador of Pakistan said a viable solution of the Afghan issue was a broad-based and comprehensive political settlement, which can be achieved through inclusive political and constructive dialogue among the entire Afghans leadership.\nHe urged upon international community to come forward and extend its economic assistance for reconstruction and rehabilitation of Afghanistan as development of the war-torn country was now a shared responsibility following US and NATO withdrawal.\nThe experts said it would be mandatory for the new Afghan Government to establish its own police, judicial and taxation system for dispensation of speedy justice and generation of revenue imperative for smooth running of the country.\nThe new Afghan Government would also be required to take extra care of human rights, religio-social values and establishment of cordial relations with regional and international countries for shared mutual benefits.",
  "retrievedAt": "2025-08-11T21:05:44.306Z"
}
