{
  "title": "ECP expresses satisfaction over EVM; made suggestion on role of presiding officer: Shibli Faraz",
  "link": "https://www.app.com.pk/national/ecp-expresses-satisfaction-over-evm-made-suggestion-on-role-of-presiding-officer-shibli-faraz/",
  "date_published": "2021-08-17T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Federal Minister for Science and Technology, Syed Shibli Faraz Tuesday said that the Election Commission of Pakistan (ECP) has expressed its satisfaction over the Electronic Voting Machine (EVM) developed by his ministry.\n“The ECP has expressed its satisfaction over the EVM during the today’s meeting however the commission gave some valuable suggestions regarding the role of Presiding Officer”, Shibli Faraz said while talking to media outside the ECP after giving presentation on EVM.\nSpeaking to the media, the federal minister said that ECP authorities asked 75 questions about the EVM all of which were responded to their satisfaction.\n“The consensus has been developed on the use of technology in the election”, he added.\n“Since it has been decided that Election 2023 will be conducted through the use of EVM, we have to decide such strategies and timelines now so that all the process including tender for the EVMs may be initiated after the satisfaction of all the stakeholders”, he said.\nThe minister pointed out that it was discussed in the meeting that if some voter or presiding officer try to cast vote on EVM repeatedly then there will be need of incorporating strong voter identification system in the machine.\nShibli Faraz said although we were fulfilling all the requirements of the ECP regarding manufacturing of EVM but we have already done preparations to incorporate voter identification system in the EVM.\n“If ECP will ask us to incorporate voter identification system in the EVM the ministry can do it within a week”, the minister stated.\nThe federal minister stated that we are in efforts that the election process should involve more technology and reduced human interference.\nTo a question, he said the government has planned to educate the masses through different ways about the utility of technology in the elections. “Use of EVM in election is meant to address all the issues which affect the credibility of the results and make the election controversial”.\nThe minister said that all the stakeholders including parliament, opposition parties, ECP and masses were being taken onboard on the use of EVM in the elections.\nTo another question, the federal minister stated that the EVM can be tested at any local government election before the general election.\nSpeaking to the media before the meeting at ECP, the federal minister invited opposition parties and the general public to examine the EVM and said that the government would make efforts to address their reservations in this regard.\n“I am asking the opposition not to oppose it without examining for the sake of criticism and should send their technical experts to review its working,” the minister said.\nHe said that they had prepared a model machine and would accept the decision from the ECP after the examination today. “ECP is a constitutional institution and the government cannot dictate it”, he said.\nShibli Faraz said that Prime Minister Imran Khan has taken a revolutionary step for electoral reforms and the introduction of EVMs would change the country’s electoral history.\nHe said there was nothing secret in the machine and their only purpose was to bring transparency to the electoral process. “Even the ECP is opting for technological change for improving electoral process,” the minister said.",
  "retrievedAt": "2025-08-11T21:05:43.989Z"
}
