{
  "title": "Labour Day an opportunity to acknowledge sacrifices, contribution of working class: NA Speaker",
  "link": "https://www.app.com.pk/national/labour-day-an-opportunity-to-acknowledge-sacrifices-contribution-of-working-class-na-speaker/",
  "date_published": "2020-04-30T00:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP):National Assembly Speaker Asad Qaiser has said that the government is framing labour friendly policies for the good of the community.\nAsad Qaiser, in his message on the eve Labour Day which falls on Friday (May 1), the Day enabled people to pay tribute to the hard working labour force.\nThe working class, he said, had played a pivotal role in the sustained economic growth of Pakistan. “We have not forgotten the lives lost in Chicago and acknowledge all those who work and sacrifice for the development of the country. This day celebrates the labour community and their continued commitment and devotion for Pakistan’s prosperity,” he added.\nThe speaker said the working class was central to the development, hence, it was “our responsibility to ensure their well-being including timely payment of their wages”. The world’s greatest economies had legislated to protect the rights of labour, he added.\nAsad Qaiser stressed upon the labour community to play its role with dedication for the progress and prosperity of Pakistan. The recent spread of COVID-19 had affected the daily-wagers whereas the government was fully conscious of their hardships. The implementation of the smart lockdown was the only way to avoid a halt of the modes of earning for the working class. “We all stand by our dedicated work force at this hour of difficulty,” the Speaker said.\nNA Deputy Speaker Qasim Khan Suri, in his message, said 1st May reminded of the Chicago incident and the people who lost their lives to brutality and injustice.\nThe progress of the country correlated with the tireless efforts of working class and the present government was ensuring the protection of rights of labour, he added.\nHe was deeply concerned about the impact of COVID19 on the working community and assured that the present government was taking necessary steps for its working community.\nHe said the coronavirus challenge affected the modes of earning of people, thus volunteers and philanthropists must step forward to help them in need. “We must extend generous support to those who have been affected by COVID19 during this holy month,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:59.626Z"
}
