{
  "title": "Govt to ameliorate lot of workers, protect their rights: President",
  "link": "https://www.app.com.pk/national/govt-to-ameliorate-lot-of-workers-protect-their-rights-president/",
  "date_published": "2020-04-30T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 01 (APP):President Dr Arif Alvi has expressed his confidence that the present government will do its utmost to ameliorate the lot of workers, besides effectively protecting their rights.\n“This year we are celebrating the Labour Day with the resolve to reaffirm our commitment to the dignity of labour and to pay tribute to the valiant and heroic struggle of the workers for their fundamental rights,” he said in his message on the occasion of World Labour Day on May 1.\nThe president said, “This day is not only a reminder of the struggle of workers but also an acknowledgment of their contribution towards national growth and progress.”\n“We believe that workers and employers are partners in the production process and their cooperation is essential for industrial efficiency and ultimately for socioeconomic development of the country,” he added.\nThe president said the world economy was witnessing a staggering downturn due to the spread of COVID-19, which was consequently having a catastrophic effect on the working and labour class. Millions of people had been rendered jobless due to it all around the world, including Pakistan.\nHe said the Government of Pakistan was fully cognizant of the hardships being faced by the labourers and daily wagers due to the lockdown. In that regard, Ehsaas Emergency Cash Relief Program had been launched to provide immediate relief to them, he added.\nThe president urged the provincial governments to accelerate their efforts for the welfare of workers as well as to protect their rights.\n“On this occasion I urge the workers and employers to play a role in the social and economic development of Pakistan by making it a symbol of progress and prosperity,” he maintained.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:50.692Z"
}
