{
  "title": "First batch of relief assistance to flood hit areas reaches Afghanistan",
  "link": "https://www.app.com.pk/national/first-batch-of-relief-to-flood-hit-areas-reaches-afghanistan/",
  "date_published": "2022-05-07T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP):  Upon the direction of Prime Minister Muhammad Shehbaz Sharif the first batch of relief assistance to the flood-affected people has reached Afghanistan on Saturday.\nThe assistance load was delivered through a special aircraft of Pakistan Air Force.\nThese items included 100 tents, 2 ton wheat, 1 ton rice and 450 kgs sugar.\nFirst consignment of relief goods for the flood affectees has reached Afghanistan to be followed by more relief measures. Pakistan will continue to stand by Afghan brothers & sisters through thick & thin. International community shouldn't forget Afghan people in this hour of need\nThe prime minister said that Pakistan would extend all possible support to the flood-hit people of Afghanistan.\nThe second tranche of relief support would be sent on May 9.\nد سېلاب متاثرینو لپاره د پاکستان لومړۍ مرستہ افغانستان ته رسېدلې ده چې له دې وروسته به د نورھم واستول شي. پاکستان به د افغان وروڼو او خویندو تر څنګ ولاړ وي. نور ھیوادونہ دی ھم په دې وخت کې افغانان هیر نکړي\nThe Foreign Office Spokesperson in a separate press release said that on the instructions of Prime Minister Muhammad Shehbaz Sharif, Pakistan dispatched one C-130 plane to Mazar-e-Sharif, carrying emergency relief items for the people of Afghanistan hit by flash floods. The items included tents, flour, rice and sugar.\n“Pakistan as a neighbouring country has been at the forefront of efforts for provision of humanitarian assistance for the Afghan people and hopes that the international community would also play its active part in providing timely relief and economic assistance to the affected people in Afghanistan,” it was added.\nThe spokesperson further said that a second plane load of food and shelter items would be sent in a few days as a gesture of goodwill for the flood victims in Afghanistan.\nAccording to Afghan media reports, recent heavy rains and flash floods have killed at least 29 people, injuring scores of others and damaged properties across 12 provinces of Afghanistan.\nAt the directive of Prime Minister Shehbaz Sharif, Pakistan today dispatched first C-130 to Afghanistan containing relief assistance in tents, food items & medicines for the people affected by recent flash floods. @PakPMO @ForeignOfficePk @PkPublicDiplo @PakinAfg pic.twitter.com/NV59QyO0LN",
  "retrievedAt": "2025-08-11T14:49:59.272Z"
}
