{
  "title": "Glacial lake formed over Shisper Glacier bursts prior to normal duration",
  "link": "https://www.app.com.pk/national/glacial-lake-formed-over-shisper-glacier-bursts-prior-to-normal-duration/",
  "date_published": "2022-05-07T12:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP): A massive glacial lake outburst flood on Saturday occurred in Hunza District’s Hassanabad Village after the glacial lake formed over Shisper Glacier started receding 5,000 Cusecs water while initiating the glacial melting prior to the normal duration.\nRemote Sensing Specialist at the International Centre for Integrated Mountain Development (ICIMOD) Dr Sher Mohammad told APP that the glacial lake size was 15 percent more than the recorded lake size for the past three years at the pre-outburst level of the glacial lake.\nMohammad said the massive Glacial Lake Outburst Flood (GLOF) in Hunza from Shishpar glacier was mainly triggered due to abrupt temperature rise in the Northern Areas due to the prevailing heatwave phenomenon.\nHe said the glaciers were melting at a faster pace mainly due to heatwave, adding, “in the past 20 days, there has been 40 percent increase in the Shisper glacier lake area due to expedited glacier melting after heatwave impacts gripped the Northern Areas as mostly glacial lakes are formed in May but it got developed one month ahead in April”.\n“Not only are glacial lakes rapidly forming in them, but they are also appearing ahead of their normal time and bursting into floods”, he added.\nDr. Sher Mohammad in his research has revealed that lakes on at least five glaciers appeared prematurely in the month of April and some of them have erupted where the water was running faster than usual.\n“We have been able to record only five glacial lakes due to continuous clouds, which are increasing but the number could be much higher.”\nHe underscored that there were supraglacial lakes formed over vulnerable glaciers after rapid increase in temperatures and could become a lurking threat in the coming days as more increase in temperature would drive glacial flooding further.\nHe said satellite reports and images of the five glacier lakes could indicate that other glaciers in the area could also pose a threat to the lakes.\n“This is not usually the case in April and glaciers and lakes are recorded in the month of June or later, but temperatures above five degrees Celsius can cause a number of natural disasters”, he warned.\nGilgit Baltistan and Khyber Pakhtunhwa Disaster Management Authorities were informed in time to take preventive measures to cope with imminent threat of GLOF in the region.\nHowever, the Hunza district administration officials while talking in time disaster preparedness measures relocated the local masses from the vulnerable sites to safer and were not facing any threat due to GLOF.\nThe Gilgit Baltistan district administration officials informed that the glacial lake achieved flooding status at 7:00am on Saturday morning.\nEarlier, the Gilgit-Baltistan Disaster Management Authority (GBDMA) officials informed that keeping in view the prevailing situation and expected GLOF risk the GBDMA teams were well prepared and trained to carry out community sensitization, local population’s relocation and food stockpiling 10 days ahead of the Met Office’s threat alert of GLOF.\nDr Sher Mohammad of International Center for Integrated Mountain Development (ICIMOD) said that the Shisper Glacier started surging in 2018 and has breached thrice from 2019 to 2020. He said continuous monitoring was key to develop well informed preparedness plans and contingency measures to avoid massive life and property loss during the insurmountable natural hazard.",
  "retrievedAt": "2025-08-11T14:49:54.015Z"
}
