{
  "title": "Massacre in Pir Dastgeer reminder of horrific human rights violations in IIOJK",
  "link": "https://www.app.com.pk/national/massacre-in-pir-dastgeer-reminder-of-horrific-human-rights-violations-in-iiojk/",
  "date_published": "2022-05-07T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP): India was perpetually violating human rights in Indian Illegally Occupied Jammu and Kashmir and Pir Dastgeer massacre of May 8, 1991, was a reminder of the barbarity of Indian security forces.\nDastgeer Sahib is a 200-year-old shrine situated in Khanyar. The shrine is famous for a copy of old Quran written by Ali Ibn Abi Talib A.S, and the relic which is locally called Mouia Pak, a hair strand of Abdul Qadir Gilani. It was constructed in 1806 and expanded in 1877 by Khwaja Sanaullah Shawl.\nIt is the centre of the activity hub of the Khanyar and is surrounded by a large market. On the Urs or birth date of the Abdul Qadir Gilani (R.A), thousands of people from all over Kashmir go there and offer prayers. Owing to its historic and sacred relevance the shrine is regarded as a holy ziarat for Muslims of Kashmir.\nOn 8th May 1991 in Pir Dastgeer, Khanyar locality of downtown Srinagar, troops of CRPF, BSF’s 2nd and 60th Bn opened fire on thousands of people who had assembled to bury some martyred Kashmiris. 18 civilians were incidentally killed. In this case, one infant aged two years, and his father were also killed.\nIt is well-known fact that Indian Security Forces operate with impunity in IIOJ&K. The draconian security laws, like Jammu and Kashmir Public Safety Act 1978, the Armed Forces Special Powers Act 1990, Prevention of Terrorism Act 2002, give extraordinary powers to Indian security personnel to shoot and kill unarmed civilians.\nInternational HRs organisations and groups have repeatedly criticized the Indian government on providing an umbrella of illegal provisions to commit gross HRAs in IIOJK\nIndia is the largest violator of Human Rights. From Kashmir to mainland India, minorities’ rights are violated under the patronage of Indian state, thus disrespecting International law, norms and has emerged as a threat to regional peace.\nIndia has become an apartheid state where human rights and “equality” have become a distant idea.\nThe western powers, often claim to be the champions of human rights, have failed to hold India accountable for its bad human right record because of their vested interests.",
  "retrievedAt": "2025-08-11T14:49:47.652Z"
}
