{
  "title": "Pak-Türkiye agree to establish strong, sustainable partnership in energy sector",
  "author": null,
  "content": "ISLAMABAD, Apr 08 (APP):Pakistan and Türkiye on Tuesday agreed to establish a strong and sustainable partnership in the energy\nThe agreement was reached at a meeting between Minister for Power Division Sardar Awais Ahmed Khan and Turkish Minister of Energy and Natural Resources Alparslan Bayraktar here, said a statement issued by Power Division.\nThe Turkish Minister apprised the Minister for Power Division about the privatization process of the power distribution system in his country, it further said.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/04/WhatsApp-Video-2025-04-08-at-18.15.30.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nHe also shed light on key aspects of the Turkish power sector.\nHe informed the minister about the interest of Türkiye companies in the privatization process of power distribution companies (DISCOs).\nBoth sides also discussed holding a roadshow in Türkiye this year.\nSardar Awais informed the Turkish delegation about the ongoing privatization process in Pakistan. A financial advisor has been appointed to ensure transparency in the privatization process, he said.\nHe said comprehensive proposals are expected to come by July. Several roadshows would also be planned in this regard, including one in Türkiye, he added.\nAwais emphasized the importance of cooperation in new energy sector projects with Türkiye.\nThe Turkish Minister offered technical expertise and investment to meet Pakistan’s energy requirements.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:16:47.963Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-turkiye-agree-to-establish-strong-sustainable-partnership-in-energy-sector/",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T17:12:00.000Z"
}
