{
  "title": "Pakistan, Turkiye agree to enhance cooperation in energy sector",
  "author": null,
  "content": "ISLAMABAD, Apr 08 (APP): Pakistan and Turkiye on Tuesday agreed to enhance cooperation in the energy sector, especially in the area of renewable energy.\nPrime Minister Muhammad Shehbaz Sharif was talking to a 9-member delegation led by Turkiye’s Minister of Energy and Natural Resources, Alparslan Bayraktar here at the PM House.\n“We are proud of the centuries-old brotherly relations between Pakistan and Turkiye,” the prime minister added.\nHe noted that the recent visit of President Recep Tayyip Erdogan to Pakistan will further enhance economic relations between the two countries.\nThe prime minister thanked Turkiye’s Minister of Energy and the high-level delegation for participating in the Pakistan Minerals Investment Summit.\n“There are vast opportunities available to expand economic relations between the two countries,” the prime minister added.\nHe stated that the agreement on offshore oil and gas exploration between Pakistan and Turkiye will further strengthen their economic ties.\nThe Turkish delegation appreciated the ongoing reforms in Pakistan’s energy sector.\nTurkiye’s Minister of Energy said that his country will share its successful experience in energy reforms and privatization, particularly in the power sector, with Pakistan.\nHe added that the ongoing reforms in Pakistan’s energy sector will make it more attractive for investment.\nThe Turkish Minister also expressed strong interest in Pakistan’s mineral sector, especially in the exploration of rare earth minerals.\nHe noted that participation in the Pakistan Minerals Investment Summit provided a clear understanding of the vast potential of this sector in the country.\nThe meeting was also attended by Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, Minister for Power Awais Leghari, Minister for Petroleum Ali Pervaiz Malik, Special Assistant to the Prime Minister Tariq Fatemi, and senior government officials.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:16:49.955Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-agree-to-enhance-cooperation-in-energy-sector/",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T16:01:00.000Z"
}
