{
  "title": "Ethiopian PM’s book ‘Medemer Generation’ added to National Library’s collection",
  "author": null,
  "content": "ISLAMABAD, Apr 08 (APP):The book ‘Medemer Generation’, authored by Dr. Abiy Ahmed, Prime Minister of the Federal Democratic Republic of Ethiopia (FDRE), has been formally added to the diverse collection of the National Library of Pakistan (NLP) under the ‘African Corner Initiative’ of the government of Pakistan.\nSpecial Envoy and Ambassador Extraordinary of the FDR Ethiopia to Pakistan, Dr. Jemal Beker formally presented multiple copies of the book to Raja Javed Iqbal, Director General of the National Library, during a formal handing over ceremony held here on Tuesday.\nThe book is the third edition of the ‘Medemer’ series authored by Prime Minister Abiy Ahmed, elucidating his ‘Medemer’ philosophy, which signifies togetherness, inter-generational collaboration, and synergy.\nSpeaking on the occasion, the ambassador expressed his gratitude to the government of Pakistan for taking such a significant initiative, which will eventually forge a strong bond and connection between the nations through cultural exchanges.\nThe ambassador also highlighted the core message of the book and the Medemer philosophy, which embodies a practical approach of inter-generational connectivity, unity and togetherness.\nHe said ‘Medemer Generation’ stresses our collective duty to nurture a responsible and capable generation that can carry forward a positive legacy from the previous generations. “We believe sharing these ideas contributes to the bridge of understanding between Ethiopia and Pakistan.”\nHe said this philosophy serves as a guiding principle for Ethiopia’s contemporary reforms and development strategy, emphasizing collaboration, inter-generational responsibility, and building a prosperous future.\nThe ambassador cited landmark Ethiopian initiatives guided by the ‘Medemer’ philosophy, including the Green Legacy Initiative, the Grand Ethiopian Renaissance Dam, and agricultural self-sufficiency programs (like ‘Ye Lemat Tirufat,’ often translated as ‘Bounty of the Basket’), as examples reflecting Ethiopia’s commitment to development, regional integration, and pan-Africanism.\nThe NLP Director General, Raja Javed Iqbal, said it was an honor for the National Library to add the book of Dr. Abiy Ahmed to our collection, making it available to scholars, students, and the public. “This initiative will not only offer valuable insights to the youth of Pakistan into modern Ethiopia’s political and social philosophy but also facilitate the cultural exchanges between the two nations,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:17:16.376Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ethiopian-pms-book-medemer-generation-added-to-national-librarys-collection-2/",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T13:38:00.000Z"
}
