{
  "title": "COAS believes Pakistan ready to emerge as leading mineral economy in world",
  "author": null,
  "content": "ISLAMABAD, Apr 8 (APP): Chief of Army Staff (COAS) General Syed Asim Munir NI (M) on Tuesday said Pakistan was poised to emerge as a leader in the global mineral economy.\n“I firmly believe that Pakistan is ready to take a leading role in the international mineral economy,” the COAS stated while addressing the Pakistan Mineral Investment Forum 2025 here.\nWelcoming international institutions, he invited global stakeholders to bring their expertise to Pakistan, explore investment opportunities, and partner with us in developing the vast potential of our mineral resources.\nHe said there is dire need of engineers, geologists, operators, and skilled miners to explore Pakistan’s mineral wealth.\n“That is why we are also sending students abroad for training to support the development of this sector,” he said.\nGen Asim said that currently, as many as 27 Pakistani students belonging to Balochistan were receiving training in mineral exploration in Zambia and Argentina. “Our aim is to develop skilled manpower and human resources specifically for the mineral sector,” he added.\nThe COAS said economic security has now emerged as a vital component of national security.\nHe assured that the Pak Army would ensure a robust security framework and proactive measures to protect the interests and confidence of partners and investors. “The development of both upstream and downstream mineral industries in Pakistan will be ensured,” he said.\nGen Asim stressed the importance of investing in refining and value addition in order to reduce costs and diversify markets in Pakistan. “With vast mineral reserves beneath our soil, skills in our hands, and a transparent mineral policy in place, there is no room for despair or inaction,” he observed.\nThe COAS urged, “Move forward and strive — for your country and yourselves. We, the Pakistani unanimously assure our partners and investors that it is our collective national aspiration to benefit from your expertise in developing our mineral wealth,” he said.\nHe also assured they could trust Pakistan as a reliable and confident partner.\nAcknowledging the contribution of tribal elders of Balochistan, Gen Asim praised their role in promoting mining activities and fostering development and progress in the province. “Through collective efforts, Pakistan’s mineral sector can become a driver of regional development, prosperity, and sustainability for the common good,” he said.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:16:57.951Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/coas-believes-pakistan-ready-to-emerge-as-leading-mineral-economy-in-world/",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T12:40:00.000Z"
}
