{
  "title": "Rwanda’s High Commission hosts 31st commemoration of  1994, genocide",
  "author": null,
  "content": "ISLAMABAD, Apr 8 (APP):The High Commission of Republic of Rwanda in Pakistan has hosted solemn event to mark ‘Kwibuka 31, the commemoration of the 1994, genocide against the Tutsi in Rwanda.\nDuring the commemoration of Kwibuka 31, the High Commissioners of the Rwanda to Pakistan, Ms Fatou Harerimana expressed her gratitude to all the guest, including the United Nation Residence Coordination, High Commissioners and the government official of Pakistan.\nShe highlighted the tragic history of the 1994 genocide against the Tutsi, which took over 1 million lives. Today is an unforgettable day in Rwandan history, where over a million people were killed by their fellow Rwandans because of the way they were born – a choice they did not make, she said.\nThe envoy said that in 1994, Rwanda faced a tragedy of unimaginable proportions. The High Commissioner said the genocide against Tutsi was planned and carried out horrifyingly to leave nobody to tell the story. The perpetrators of the Genocide had decided to make it the end of the Tutsi.\nFor this reason,”we should never forget to respect the President of Rwanda, Paul KAGAME and the Rwanda Patriotic Army (RPA) for their courageous decision to put an end to the Genocide against the Tutsi, a decision which was carried out and accomplished” she said.\nShe said that by now, the orphaned children have grown up, taken up leadership roles in a variety of institutions, joined the military, and has become the nation’s strength.\n“Allow me to take this opportunity to express my gratitude to the UN Residence coordinator here in Pakistan to join us and accept to deliver the remarks. We Rwandans do appreciate the decision of UN General Assembly adopting 7th April as an international day of commemoration of Genocide against the TUTSI in Rwanda.”\nThe theme of this year is “Remember- Unite-Renew’’is a global framework to honor the victims and comforts the survivors and pay tribute to Rwandans who stopped Genocide and liberate the country, she said.\n“We continue to serve the country with the same motto: NEVER AGAIN TOGENOCIDE IN RWANDA AND IN THE WORLD.”\nRwanda now is one of the safest places in the world, and it extends its security to other countries as well. For example, the Rwandan Army has been effective in restoring peace in Mozambique, South Sudan, Central African Republic, and Haiti.\n“We repeat this often, but it’s crucial. The Genocide against the Tutsi was planned for a long time and was motivated by a terrible policy of discrimination and division by colonialism rather than occurring by accident or natural disaster.”\nMs Fatou Harerimana said Rwanda has indeed advanced significantly as a result of its right direction, today, Rwandans live together, the Genocide perpetrators have expressed regret to the victims and they live in harmony, unity, and reconciliation.\nShe said that today these are the same people who continue to spread hatred worsening the situation in Rwanda’s neighbouring countries.\nShe despite knowing their role in the divisionism they caused in our countries and they continue to support the genocide ideology in the region and in the world, supporting and encouraging the FDLR to accomplish their desired mission of extermination of Tutsi.\n“We are appreciative of the leaders who noticed it early and spoke up, but the International Community disregarded them. We are grateful to everyone who spoke up to save the Tutsi, even though their voices were not heard.”\nRwanda reaffirms its commitment to play its role among the International Community in fighting genocide ideology and preventing genocide, ensuring that “never Again”translates into actions for generations to come.\nAs “we commemorate the 31stGenocide Against the Tutsi in 1994, we shall continue to keep close to our hearts the over One Million Tutsi who perished in that darkest period of our country’s history” she said.\nShe said that “we acknowledge the invaluable support from the Government of the Islamic Republic of Pakistan over a long time.”\nThe High Commissioner said that to my fellow Rwandan Community living in Pakistan, Ambassadors and High Commissioners, Heads of Missions, and Diplomatic Corps, Senators, friends of Rwanda, brothers and sisters; your presence today stands out as a powerful sign of solidarity with us.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:16:49.528Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rwandas-high-commission-hosts-31st-commemoration-of-1994-genocide/",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T17:02:00.000Z"
}
