{
  "title": "Pakistan, Turkiye sign joint bidding agreement for offshore oil, gas exploration",
  "author": null,
  "content": "ISLAMABAD, Apr 08 (APP): Pakistan and Turkiye have signed a Joint Bidding Agreement to jointly participate in Pakistan’s upcoming offshore bid round, aimed at exploring energy reserves in the country’s offshore basins.\nThe agreement was signed on the sidelines of the Pakistan Minerals Investment Forum 2025. It marks a significant step toward strengthening energy cooperation between the two brotherly nations.\nIn February 2025, the government of Pakistan launched an offshore block bid round, offering 40 exploration blocks in the Makran and Indus basins. This initiative is seen as a major opportunity to attract foreign direct investment (FDI) in Pakistan’s upstream energy sector.\nFederal Minister for Petroleum Ali Pervaiz Malik announced the signing, stating: “We are pleased to share that Pakistan’s leading exploration and production companies—Mari Energies Limited, Oil & Gas Development Company Limited (OGDCL), and Pakistan Petroleum Limited (PPL) have entered into a Joint Bidding Agreement with Turkiye state-owned oil and gas company, to jointly participate in the offshore bidding round.”\nHe expressed optimism that the partnership would bring in much-needed investment and help introduce advanced international technology and expertise into Pakistan’s energy sector.\n“This strategic collaboration will help us unlock the untapped potential of our offshore resources,” he said.\nIn a meeting with Turkish Minister for Energy and Natural Resources Alparslan Bayraktar, Minister Malik reiterated\nPakistan’s commitment to facilitating foreign investment and enhancing bilateral energy ties.\nHe noted that recent seismic studies have revealed promising offshore reserves and affirmed the government’s full support for joint exploration efforts.\nMinister Bayraktar appreciated Pakistan’s efforts in organizing the Minerals Investment Forum and welcomed the growing energy cooperation between the two nations.\nThe agreement was signed by Ahmed Turkoglu, CEO of Turkish Petroleum Corporation (TPAO), along with Faheem Haider (Managing Director, Mari Energies), Ahmad Hayat Lak (Managing Director, OGDCL), and Imran Abbasi (Managing Director, PPL).",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:16:53.748Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-sign-joint-bidding-agreement-for-offshore-oil-gas-exploration/",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T15:09:00.000Z"
}
