{
  "title": "IG FC urged to expedite release of vehicles at Torkhem border",
  "link": "https://www.app.com.pk/national/ig-fc-urged-to-expedite-release-of-vehicles-at-torkhem-border/",
  "date_published": "2023-08-28T15:49:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 28 (APP): Chairman Pak-Afghan Joint Chamber of Commerce and Industry (PAJCCI), Muhammad Zubair Motiwala has requested IG FC KP to intervene in the resolution of the slow processing of vehicles loaded with empty containers at the Torkherm border.\nIn a letter sent to IG FC and Secretary Commerce Ministry of Commerce, Muhammad Sulaeh Ahmad Faruqui, Chairman PAJCCI apprised that complaints were being received from our members pertinent to the stoppage and slow release of vehicles loaded with empty containers at the Torkham border.\nThis situation is further aggravated on a daily basis and due to the delays the number of stuck containers is also increasing, Motiwala added.\n“This slowdown has been in process and if it further continues, then it would further badly affect the Afghan Transit Trade (ATT) and bilateral business ties significantly,” Chairman PAJCCI went on to say.\nAs per reports, currently, 2000+ Pakistani Trucks are held in Afghanistan. On the other hand, transportation rates are increasing, due to the shortage of vehicles in Pakistan.\nThe detention charges (120$ -140$) are another expense, which is also accumulated on a daily basis on every container, raising the costs enormously.\nThis has not only affected Pakistani businesses but also Afghan entities engaged in both transit and bilateral trade, he added.\nMeanwhile, Director PAJCCI KP, Zia-ul-Haq Sarhadi while supporting the viewpoint of Zubair Motiwala, has said that the business community is facing a lot of problems due to the slow process in the clearance of vehicles at the Torkhem border.\nHe said the relevant departments including Pakistan Customs, NLC, FC and others should take up this issue and chalk out a viable solution to this problem creating hurdles in the smooth running of business affairs.\nProlong clearance processing is not only causing delays in the transportation of vehicles but also inflicting a financial burden on the business community to pay extra rent to truck owners and detention charges to companies.\nZia said in a recent border meeting of stakeholders of transit trade from both Pakistan and Afghanistan, he also took up this issue with relevant quarters.\nHe also requested IG FC to intervene in the resolution of this matter at the earliest as it has been pending for a long and arrange a meeting with the business community on the platform of the Chamber of Commerce and Industry.",
  "retrievedAt": "2025-08-11T09:20:45.125Z"
}
