{
  "title": "Mashal Malik urges world to hold India accountable for rights violations in Kashmir",
  "link": "https://www.app.com.pk/national/mashal-malik-urges-world-to-hold-india-accountable-for-rights-violations-in-kashmir/",
  "date_published": "2023-08-28T06:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP):Caretaker Human Rights Minister Mashal Malik Monday urged that the international community should hold India accountable for human rights violations in Jammu and Kashmir.\n“Kashmiris must be given the right to decide for their fate like all other nations” ” she said while talking to a Private news channel.\n“India has to respect democracy, the United Nations (UN) resolution, and the will of the people, she said, adding, that the time is not far when India will become the victim of its own agenda and aggressive policies.”\nShe further said, “The permanent members of the UNSC and the civilized world must play a role to ensure the smooth implementation of the UN resolutions on the Kashmir dispute.”\nMinister said, “Kashmiris have been struggling to get their right to self-determination for the last many decades as per UN charter, adding, that this struggle will continue until and unless the Kashmiris are given the right of plebiscite.”\n“The International community is well aware of the importance of the Kashmir issue in the region and also aware of Indian atrocities on innocent Kashmiris,” she said.\n“Unfortunately, the world is hesitant to force India to stop its aggression in the occupied valley,” she added.\n“The entire Hurriyet leadership is under house arrest, she said.\n“The Kashmir valley has turned into the largest prison in the world,” she added.\n“The world needs to take concrete measures and force India to stop its human rights violations in the valley,” she said.\n“Sooner or later, the Kashmiris will get their fundamental right to self-determination.”\nReplying to a question, she said, “Pakistan will remain firm on its stand on Kashmir and will continue to support the Kashmir cause at all international forums.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:21:38.915Z"
}
