{
  "title": "President Alvi for strengthening financial inclusion, gender equality",
  "link": "https://www.app.com.pk/national/president-alvi-for-strengthening-financial-inclusion-gender-equality/",
  "date_published": "2023-08-28T14:02:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 28 (APP):President Dr Arif Alvi Monday asked the banking institutions to take measures to further strengthening financial inclusion and gender equality in the sector.\nBesides ensuring easy and accessible financial services to women and differently-abled persons, he emphasized the banking sector to focus on providing more employment opportunities and financing facilities as well as extending  job training and financial literacy to them.\nThe president was chairing a meeting of representatives of banking industry here at the Sindh Governor House to review progress on initiatives aimed at financial inclusion of women and differently-abled persons, progress on measures taken to ensure employment and financial opportunities for them, and other issues of the banking industry.\nThe meeting was attended by senior officials of State Bank of Pakistan and chief executive officers of different commercial banks.\nTerming meaningful participation of women in economic activities vital for progress and prosperity of the country, the president said it was encouraging to see the ratio of female in bank account holders and banking sector jobs had recorded a significant growth in previous years but still more efforts were required by the sector to promote gender equality and inclusion of all segments of the society for achieving the objectives of inclusive banking.\nHe said the jobs for the people with disabilities could be tailored in the banking industry and the process of bank account opening could be made easy further.\nPresident Alvi also proposed the bank officials to explore part-time job avenues in their institutions for the household women.\nReferring to the fast-paced growth of digital technologies across the world, he said the banking industry in Pakistan had to keep pace with the evolving trends with the maximum use of  information technology as “the IT driven financial inclusion at the grassroots level not only encourages taxable economy, but also contributes to the country’s economic development”.\nIncreased use of the IT in the banking industry had also exposed the sector to frauds, and that was why a regulatory mechanism of safety and ease was equally important, he added.\nThe president emphasized the need for fast-track decision-making process, besides addressing banking services issues through a regulatory framework, and fair and just redressal mechanism.\nDr Alvi said creating awareness at the community level about banking issues was a global practice and urged the bankers to sensitize the people about their products and services through modern means of communication.\nPublic sensitization played a critical role in saving lives during the COVID-19 pandemic and lethal diseases like breast cancer, he added.\nUrging for reviewing and updating Corporate Social Responsibility (CSR) regulations, the president asked the banks to do the maximum in fields of financial literacy and environment.\nThe SBP officials and heads of commercial banks informed the president that measures like branch-less banking, easing the process of accounts opening particularly for women and persons with disabilities and banking on equality resulted into increased ratio of women both as account holders and jobs in the banks while 2% disability quota was also being ensured in the sector.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:21:09.407Z"
}
