{
  "title": "APHC urges people to assemble at Gilani’s graveyard on Friday",
  "link": "https://www.app.com.pk/national/aphc-urges-people-to-assemble-at-gilanis-graveyard-on-friday-2/",
  "date_published": "2023-08-28T04:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP):The All Parties Hurriyat Conference has again appealed to the people of Kashmir to march towards Hyderpora in Srinagar on September 01 (Friday) to pay their tributes to the icon of the Kashmir resistance movement, Syed Ali Gilani, on his 2nd martyrdom anniversary in Indian illegally occupied Jammu and Kashmir.\nAccording to Kashmir Media Service, Syed Ali Gilani embraced martyrdom in the custody of Indian police on September 01, 2021, at his Hyderpora residence in Srinagar where he was kept under continued house arrest for over a decade.\nThe All Parties Hurriyat Conference Spokesman in a statement in Srinagar has urged the people to visit the graveyard of Kashmir’s iconic liberation leader Syed Ali Gilani at Hyderpora in Srinagar on Friday for his pious sacrifice and stand for the resolution of the Jammu and Kashmir dispute.\nThe statement urged the people of Kashmir that it was high time to remember the heroes who lived and died for the freedom of Kashmir.\nThe posters also appeared in various parts of the occupied Jammu and Kashmir, urging the people to pay tributes to the icon leader, Syed Ali Gilani, on his second martyrdom anniversary on Friday.\nThe posters, pasted by the All Parties Hurriyat Conference (APHC) , Jammu and Kashmir Political Resistance Movement ,JK Justice and Peace Initiative, Nawjawanan-e-Hurriyet Jammu Kashmir, Jammu Kashmir Justice League Forum, Jammu and Kashmir Democratic Movement , Resistance Youth Forum Jammu Kashmir and other organizations on walls, pillars and electric poles in different areas of Srinagar, have also urged imams, khateebs, ulema and people of mosques to hold special prayers for Syed Ali Gilani and other Kashmiri martyrs .\nIt is worth mentioning here that Indian forces’ personnel had shamelessly snatched away the body of Syed Ali Gilani and buried it at Hyderpora graveyard in the dark of night against his will. Syed Ali Gilani, according to his family, wanted to be buried at Martyrs Graveyard at Eidgah in Srinagar.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:21:40.302Z"
}
