{
  "title": "Relief to masses in electricity bill, caretaker govt’s priority: Solangi",
  "link": "https://www.app.com.pk/national/relief-to-masses-in-electricity-bill-caretaker-govts-priority-solangi/",
  "date_published": "2023-08-28T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi on Monday said the complete focus of the government was on providing relief to the masses in electricity bills.\n“We are focusing on how to provide relief to the masses instead of delving into discussion that who is responsible for expensive electricity,” the minister said while talking to a private TV channel.\nHe said the caretaker government took the oath on August 17, and the consumers received inflated bills of the month of July.\nCaretaker Prime Minister Anwaar-ul-Haq Kakar had taken notice of inflated electricity bills, Solangi said, adding, “We are responsible caretaker government and cannot ignore the issue.”\nHe said tomorrow the issue would be taken up by the Federal Cabinet which would explore the ways to pass on relief to the public without violating the International Monetary Fund (IMF) programme.\nThe minister resolved that the cabinet would decide in favour of passing on the relief to the masses.\nHe said the prime minister held a meeting with the relevant stakeholders today too. The media should inform the masses about the reasons behind increase in electricity bills , he said while responding to a query.\n“Political temperature is already high in the country,” he said, stressing that there was no need to resort to debate that who was responsible for the bills.\nTo another query, he said the caretaker government wanted to hold peaceful and fair elections in collaboration with all political parties as per the schedule of the Election Commission of Pakistan (ECP). The assistance to the electoral watchdog would be provided by the government, he added.\nThe ECP would decide about the tenure of the caretaker government, he said, adding the entire schedule of the delimitation exercise was uploaded on the watchdog’s website.\nIn light of the decisions of the Council of Common Interests, he said, the ECP issued its schedule under Article 51 of the Constitution.\nHe said there was need to understand difference between peaceful and violent protests.",
  "retrievedAt": "2025-08-11T09:20:43.626Z"
}
