{
  "title": "JI urges ECP to meet 90-day election deadline",
  "link": "https://www.app.com.pk/national/ji-urges-ecp-to-meet-90-day-election-deadline/",
  "date_published": "2023-08-28T17:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): A delegation from Jamaat-e-Islami (JI) on Monday visited the Election Commission of Pakistan (ECP) and urged the commission to ensure the completion of the election process within the constitutionally mandated 90-day period.\nIn discussions with Chief Election Commissioner (CEC) Sikandar Sultan Raja and other senior officials of the commission, the JI delegation reminded the ECP that the election schedule should have been announced alongside the delimitation schedule that the commission had declared the previous week.\nThe delegation expressed the view that the ECP should have initiated this consultation process at an earlier time, pointing out that the premature dissolution of the national and provincial assemblies could have been avoided.\nThey also highlighted that previous governments should have taken steps to ensure timely census and Council of Common Interest (CCI) meetings, enabling the Election Commission to finalize constituency processes before the assemblies’ term expired or they were dissolved.\nThey expressed regret that following the dissolution of the provincial assemblies of Punjab and Khyber Pakhtunkhwa, conducting elections became unfeasible.\nJI delegation underscored the importance of upholding public representation for the people of Pakistan. Furthermore, they recommended that decisive action be taken against individuals accountable for violating the code of conduct.\nThis approach, they asserted, would effectively thwart any attempts by various groups to manipulate the elections.\nEmphasizing the importance of updating electoral rolls, they urged the commission to register eligible voters and remove deceased voters from the voter list.\nThey also recommended that all election-related forms, whether for general elections or local body elections, be available in Urdu. Additionally, they proposed the implementation of fixed election expenses for political parties.\nMQM delegation led by Dr Farooq Sattar emphasized the timely completion of delimitation of constituencies in line with constitutional requirements. The MQM delegation, including leaders Javed Hanif, Zahid Malik, and Yasir, visited the Election Commission office in Islamabad.\nThe MQM delegation discussed pre-election rigging prevention with the Chief Election Commissioner. They expressed interest in the efficient RTS system, praising the Commission’s improved approach.\nDr Sattar stressed that the absence of a National Assembly obstructs significant changes like Constitutional amendments\nand seat adjustments.\nThe Election Commission assured the delegations that it would swiftly complete constituency delimitation and promptly organize elections. They also stated that constituency delimitation and electoral roll updates would be done simultaneously.\nThe Chief Election Commissioner also commended the additional suggestions put forth by the political parties, affirming that the Commission would not only review these suggestions but also take steps to forward the valuable proposals to Parliament for potential legislation.\nThe Election Commission pledged swift adoption of valuable suggestions indicating further consultations with political parties on the code of conduct to ensure strict compliance. Moreover, consistent oversight will be guaranteed during the upcoming general elections, facilitated by the establishment of a state-of-the-art monitoring control room.",
  "retrievedAt": "2025-08-11T09:20:42.329Z"
}
