{
  "title": "President for measures to ensure financial inclusion, gender equality",
  "link": "https://www.app.com.pk/national/president-alvi-for-measures-to-further-strengthen-financial-inclusion-gender-equality/",
  "date_published": "2023-08-28T10:02:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 28 (APP): President Dr Arif Alvi, on Monday, stressed the banking institutions of the country to take measures to further increase the financial inclusion of women as well as ensure gender equality in the banking sector.\nBesides the provision of easy and accessible financial services to women and differently-abled persons, he emphasized that the banking sector should also focus on providing more employment opportunities and financing facilities as well as providing on-the-job training to them.\nThe President expressed these views while chairing a meeting with representatives of various banks held here at Sindh Governor House to review progress on initiatives aimed at financial inclusion of women and differently-abled persons as well as progress on the measures to ensure employment and financial opportunities for them. The review meeting was attended by senior officials of the State Bank of Pakistan and Chief Executive Officers of different commercial banks.\nTerming meaningful participation of women in economic activities as vital for the progress and prosperity of the country, the President said that it was encouraging to see that the share of female account holders and their share in banking sector jobs has witnessed a surge in previous years. He added that more steps were needed to be taken to promote gender equality and inclusion of women and persons with disabilities in the banking sector and other economic activities.\nThe President said that the jobs for people with disabilities could be tailored in the banking sector and the process of opening bank accounts should be further simplified.\nThe President, while referring to the fast-paced growth of digital technologies across the world, said that the banking industry in Pakistan has to keep pace with the changing circumstances by using the latest IT tools.\nHe expressed concern over the rising incidents of banking fraud and emphasised the need to improve the safety mechanisms of banks to effectively protect the interests of banking customers.\nThe President asked the banks to raise awareness about various facilities and financial products being offered to their customers as well as address their banking issues on a fast-track basis.\nThe officials of SBP and heads of commercial banks informed the President that measures like branch-less banking, easing the process of account opening, particularly for women and persons with disabilities, and banking on equality had resulted in an increased ratio of women having bank accounts as well as jobs in the banks. It was further informed that the 2% disability quota was also being ensured in the banking sector.",
  "retrievedAt": "2025-08-11T09:21:13.729Z"
}
