{
  "article_id": "2025-06-15_8cffb024d6aeb4419bff349c0efa3323",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dig-raza-reviews-security-measures-at-diplomatic-enclave/",
    "retrieved_at": "2025-08-27T11:09:46.603Z"
  },
  "metadata": {
    "title": "DIG Raza reviews security measures at diplomatic enclave",
    "author": null,
    "date_published": "2025-06-15T13:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 245,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 15 (APP):Deputy Inspector General (DIG) Police Headquarters/Security, Syed Ali Raza, on Sunday visited the entry and exit points of the Diplomatic Enclave to review security arrangements. During the visit, DIG Raza met with Islamabad Police officers and personnel on duty and emphasized the importance of tightening the inspection process. He directed that every vehicle be thoroughly checked before being allowed entry. DIG Raza said that the protection of all important buildings within the Diplomatic Enclave was a top priority. \"We must remain vigilant and keep a close watch on any suspicious movements,\" he said and added, \"Given the current national situation, we must be prepared to handle any untoward incidents and ensure all arrangements are in place to maintain peace and tranquility.\" The DIG said that Islamabad Police would not allow any disruption to peace and order in the federal capital and would take all necessary actions to protect lives, property and public and private assets. \"All resources will be employed to prevent malicious elements from achieving their nefarious goals,\" he said. DIG Raza further directed the officers to strengthen security measures, enhance patrolling in the Diplomatic Enclave, and ensure more effective checks. Senior officers were instructed to personally brief personnel regarding potential emergencies and check all duty posts. DIG Raza also emphasized that all personnel on duty must wear clean uniforms and ensure the proper use of equipment. Any negligence or laxity in duties, he warned, would lead to strict departmental action.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}