{
  "article_id": "2025-06-15_a1c1a7fe330dcdae5d2ceccfca5be12a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/over-11000-pakistani-pilgrims-return-home-as-post-hajj-flights-continue-smoothly-religious-affairs-ministry/",
    "retrieved_at": "2025-08-27T11:09:21.397Z"
  },
  "metadata": {
    "title": "Over 11,000 Pakistani pilgrims return home as post-Hajj flights continue smoothly: Religious Affairs Ministry",
    "author": null,
    "date_published": "2025-06-15T13:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 194,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, June 15 (APP): The Ministry of Religious Affairs and Interfaith Harmony has confirmed that the post-Hajj flight operation is continuing successfully despite global air traffic disruptions. Ministry Spokesperson Muhammad Umar Butt on Sunday said as of Saturday, June 14, a total of 11,418 Pakistani pilgrims had returned home from the Kingdom of Saudi Arabia. He said on Sunday alone, 4,995 more pilgrims are expected to arrive via 20 flights scheduled to land across five major cities. \"Today, six flights each will land in Islamabad and Lahore, four in Karachi, three in Multan, and one in Quetta,\" the spokesperson stated. Providing further details, he said Pakistan International Airlines (PIA) will operate eight of these flights, followed by Saudi Airlines with five, AirBlue with four, AirSial with two, and Serene Air with one. Despite the international challenges in air traffic, the return operation is proceeding efficiently, he noted, urging pilgrims to maintain discipline to ensure a smooth repatriation process. Pilgrims were also advised to strictly adhere to baggage weight limits as mentioned on their airline tickets and to reach Saudi airports at least 6 to 8 hours before their flight due to high passenger volumes.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}