{
  "article_id": "2025-06-15_f1a476e8d86ab74582e00f1da3f1f736",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pak-epa-islamabad-police-resume-joint-crackdown-on-smoky-vehicles-to-curb-harmful-emissions/",
    "retrieved_at": "2025-08-27T11:09:46.326Z"
  },
  "metadata": {
    "title": "Pak-EPA, Islamabad Police resume joint crackdown on smoky vehicles to curb harmful emissions",
    "author": null,
    "date_published": "2025-06-15T13:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 366,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 15 (APP):Pakistan Environmental Protection Agency (Pak-EPA)in a determined effort to tackle the capitalas worsening air quality, has resumed its post-Eid vehicle emission testing campaign across the city, in collaboration with the Islamabad Police. Director General of Pakistan-Environmental Protection Agency (Pak-EPA) Nazia Zaib Ali told APP on Sunday that , aWe have launched a vehicle emission testing campaign in Islamabad to protect the environment and public health from adverse impacts of growing air pollution levels caused due to vehicular carbon emissions.a She said the drive, which restarted on June 12 following the Eid-ul-Azha holidays, is part of a broader initiative to curb harmful vehicular emissions and ensure cleaner air for Islamabadas residents. The vehicle testing activity resumed in different parts of the capital city after eid holidays from June 12 with inspection teams composed of Pak-EPA and Islamabad Police deployed at two high-traffic locations a Mundi Police Check Post near Metro Mall and Faizabad Interchange on the IslamabadaLahore route, DG Pak-EPA explained. These checkpoints were strategically chosen for their heavy vehicular flow, making them effective points for monitoring and enforcement,a the head of the capitalas environmental watchdog added. Sharing statistical data from the two-day joint vehicle emission testing operations conducted by Pak-EPA and the Islamabad Police, DG Pak-EPA stated that the smoke emission levels of most vehicles inspected fell within the 10%a40% range. However, challan tickets were issued to owners of vehicles whose emissions exceeded the 60% threshold. DG Pak-EPA says this ongoing campaign highlights the unwavering commitment of her organization and the Islamabad Police to uphold environmental regulations and encourage responsible vehicle maintenance for achieving environmental sustainability and protect public health from adverse impacts of air pollution. She also urged all vehicle owners in Islamabad to regularly maintain their vehicles to meet legal emission limits and contribute to a cleaner urban environment as an environmentally-responsible citizen. DG Pak-EPA also pledged to continue the vehicle emission testing drive in other parts of the city in the coming weeks with the goal of enhancing compliance and achieving lasting improvements in air quality. aIn fact, this initiative underscores the joint commitment of Pak-EPA and Islamabad Police to enforce environmental regulations and promote sustainable urban living,a she remarked.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}