{
  "article_id": "2025-06-15_7a9ca4450d95bca2f3b79dd936be0b6f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/muqam-slams-cm-gandapur-over-irresponsible-statement/",
    "retrieved_at": "2025-08-27T11:09:44.870Z"
  },
  "metadata": {
    "title": "Muqam slams CM Gandapur over “irresponsible” statement",
    "author": null,
    "date_published": "2025-06-15T12:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 262,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 15 (APP): Federal Minister for Kashmir Affairs, Gilgit-Baltistan and SAFRON and President of PML-N Khyber Pakhtunkhwa, Engineer Amir Muqam has strongly condemned the recent remarks made by Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur, terming them \"irresponsible and provocative.\" In a statement issued on Saturday, Engr Amir Muqam said that the CM's statements were not only a blatant misuse of his official position but were also inciting unrest among innocent workers. \"Instead of guiding the province towards stability and development, the CM is once again encouraging chaos and violence - and as always, he will disappear when the consequences unfold,\" he remarked. The federal minister questioned how an elected Chief Minister could openly ask workers to take up arms against the state. \"This is a clear attempt to create panic and deteriorate law and order in the country,\" he said, adding that the remarks are an insult to the office of the Chief Minister. He further stated that such statements reveal the true intentions of those who want to destabilize the country at a time when the federal government, under the leadership of Prime Minister Muhammad Shehbaz Sharif, is working tirelessly to revive the economy and restore public confidence. \"These people are frustrated because the PML-N government has successfully put the nation back on the path of economic recovery,\" he said and added, \"Their nefarious designs to derail the country's progress will never succeed.\" Engr Amir Muqam urged the public and political leadership to reject the politics of hate and division and stand united for peace, progress and national stability.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}