{
  "title": "US cuts off intelligence-sharing with Ukraine - World - DAWN.COM",
  "author": null,
  "content": "The US has cut off intelligence sharing with Kyiv, said CIA Director John Ratcliffe on Wednesday, in a move that could seriously hamper the Ukrainian military’s ability to target Russian forces.\n\nThe decision to cut off intelligence sharing and military aid to Ukraine starkly illustrates the Trump administration’s willingness to play hardball with an ally to force it to the negotiating table.\n\nUS President Donald Trump said on Tuesday that he received a letter from Ukrainian President Volodymyr Zelensky in which the Ukrainian leader expressed his willingness to come to the negotiating table over the Russia-Ukraine war.\n\n“I think on the military front and the intelligence front, the pause [that prompted Ukraine’s president to respond] I think will go away,” Ratcliffe told Fox Business Network.\n\n“I think we’ll work shoulder to shoulder with Ukraine as we have to push back on the aggression that’s there, but to put the world in a better place for these peace negotiations to move forward,” he said.\n\nThree sources familiar with the situation also confirmed that US intelligence sharing had stopped. It was not immediately clear how much the US had cut back on the sharing.\n\nOne of the sources said that intelligence-sharing had only “partially” been cut but was unable to provide more detail.\n\nSince the start of the war in 2022, the US has provided Ukraine with significant intelligence, including critical information its military needs for targeting purposes.\n\nUS National Security Adviser Mike Waltz told reporters earlier this morning that the US “had taken a step back” and that the administration was “reviewing all aspects” of its intelligence relationship with Ukraine.\n\nWaltz also said that the US was actively engaged in talks with Ukraine about moving negotiations forward on a minerals deal and a potential peace deal with Russia. “I think we’re going to see movement in very short order,” he said.\n\nZelensky will join EU leaders for a Brussels summit on Thursday aimed at cementing the bloc’s support for Kyiv’s three-year fight against Russia’s invasion.\n\n“President Zelensky will attend the summit in person,” an EU official said on the eve of the summit gathering all 27 leaders for the first time since Zelensky’s White House clash with Trump.\n\nAdditionally, Ukraine and the United States have agreed to hold further talks, Ukrainian President Volodymyr Zelensky’s chief of staff said today after a call with Waltz.\n\n“Had a phone conversation with the US President’s National Security Adviser [Mike Waltz]. We have scheduled a meeting for our teams in the near future to continue this important work,” Andriy Yermak said on X.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/052021157094a6d.jpg",
  "retrievedAt": "2025-08-25T14:57:57.980Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895982/us-cuts-off-intelligence-sharing-with-ukraine",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T15:37:46.000Z"
}
