{
  "title": "Trump hails Pakistan’s help in arresting IS terrorist behind 2021 Kabul airport bombing - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Wednesday said the person responsible for killing 13 US service members during the withdrawal from Afghanistan in 2021 had been arrested with the help of Pakistan and was now on his way to the United States to face justice.\n\nThe 2021 Abbey Gate bombing killed 13 US service members and approximately 170 Afghan civilians during the chaotic US withdrawal from Afghanistan. The militant Islamic State (IS) group had claimed responsibility for the killings.\n\nTrump shared the news in his first address to Congress since returning to the White House for a second term. While he gave no further details, Prime Minister Shehbaz Sharif, in a post on X, identified the held terrorist as Sharifullah, a “top tier operational commander” of the militant IS-KP chapter.\n\n“Tonight, I am pleased to announce that we have just apprehended the top terrorist responsible for that atrocity, and he is on his way here to face the swift sword of American justice,” the US president told the Congress.\n\nIn a rare public gesture of appreciation, Trump thanked Islamabad for its role in the capture, saying: “I want to thank especially the government of Pakistan for helping arrest this monster.”\n\nTrump emphasised his personal connection with the US victims’ families, stating: “I spoke to many of the parents and loved ones, and they’re all in our hearts tonight. Just spoke to them on phone. We had a big call. Everyone called, and everybody was on the line, and they did nothing but cry with happiness.”\n\nMeanwhile, PM Shehbaz said on his X account that the terrorist was an Afghan national. “The wanted terrorist was apprehended in a successful operation conducted in [the] Pakistan-Afghan border region,” he added.\n\nThe premier thanked Trump for “acknowledging and appreciating Pakistan’s role and support in counter terrorism efforts across the region”.\n\n“As is well-known, Pakistan has always played a critical role in counterterrorism efforts aimed at denying safe havens to terrorists and militant groups the space to operate against any other country,” PM Shehbaz highlighted.\n\nThe prime minister vowed that Pakistan “will continue to partner closely with the United States in securing regional peace and stability”.\n\nReiterating Pakistan’s resolve to combat terrorism “in all its forms and manifestations”, he stressed the country had “rendered great sacrifices, including the lives of over 80,000 of our brave soldiers and citizens” in those efforts.\n\n“However, the resolve of our leadership and our people remains unflinching, to eradicate the menace of terrorism from our country,” the premier added.\n\nUS acknowledgment of Pakistan’s cooperation, particularly with its intelligence services, is expected to reinforce the longstanding military-to-military relationship between the two nations, discouraging opposition politicians in Pakistan’s deeply polarised domestic landscape.\n\nOn Aug 26, 2021, two suicide bombers and gunmen had attacked crowds of Afghans flocking to Kabul’s airport, killing some 170 Afghans and 13 US troops who were securing the airport for the traumatic exit.\n\nIn April 2023, the White House said Afghan Taliban government forces killed the attack’s mastermind, identifying him as a “key” leader of IS-Khorasan (IS-K).\n\nMeanwhile, the Foreign Office (FO) said that Deputy Prime Minister and Foreign Minister Ishaq Dar received a call today from US National Security Adviser (NSA) Michael Waltz who “conveyed President Trump’s appreciation and gratitude for Pakistan’s efforts in countering terrorism”.\n\nThe foreign minister congratulated the NSA on his assumption of office and reiterated that Pakistan looked forward to building on its “longstanding and broad-based relationship” with the US under President Trump and his administration, the FO said in a statement issued today.\n\nAccording to the statement, Dar reaffirmed Pakistan’s commitment to continue cooperating with the US in counterterrorism and appreciated President Trump’s announcement to withdraw the US military equipment left behind in Afghanistan.\n\n“The two sides reaffirmed their commitment to enhance cooperation in IT, energy and mineral sectors,” the FO added. “They also agreed on the need to have continued dialogues on trade, investment, climate change and health as part of a broad-based agenda in the days to come.”\n\nAccording to US media reports, the arrest was the result of close cooperation between the Central Intelligence Agency (CIA) and Pakistan’s intelligence services, particularly the Inter-Services Intelligence (ISI).\n\nMohammad Sharifullah, also known as “Jafar”, was captured near the Pakistan-Afghanistan border after the CIA provided precise intelligence on his location. Sharifullah, a senior commander of IS-K, is accused of planning and overseeing the Abbey Gate bombing, making him a longstanding high-value target for US counterterrorism agencies.\n\nWithin days of his appointment, CIA Director John Ratcliffe raised the matter with his Pakistani counterpart, ISI chief Lt. Gen. Asim Malik, in a phone call. The issue was revisited during a meeting at the Munich Security Conference in mid-February, where both officials emphasised the importance of cooperation.\n\nThe CIA had been tracking Sharifullah for some time, and with new intelligence pinpointing his location, the agency shared this with Pakistan’s intelligence service, which then deployed an elite unit to capture him near the Pakistan-Afghanistan border.\n\nTen days after Sharifullah’s capture, Ratcliffe and FBI Director Kash Patel held a call with Gen Malik from CIA headquarters in Langley to discuss the next steps for his extradition.\n\nCoordinated efforts from the CIA, the Department of Justice, and the FBI followed, with all parties actively involved in the process.\n\nThis cooperation between Washington and Islamabad could be the beginning of a significant shift, following years of strained relations between their intelligence communities.\n\nSharifullah was being extradited to the US, CNN reported, citing a White House official. Axios said he was expected to arrive in the US on Wednesday.\n\nThe Justice Department, the FBI and the CIA “have extradited one of the terrorists responsible for the murder of the 13 American soldiers at Abbey Gate during the disastrous Afghanistan withdrawal”, FBI Director Kash Patel said posted on X shortly after Trump announced the arrest.\n\n“One step closer to justice for these American heroes and their families,” Patel added.\n\n“We hope this brings some closure to the families of the 13 American Heroes lost at Abbey Gate. We will continue to bring those who harm Americans to swift and decisive justice,” US Attorney General Pam Bondi wrote on X.\n\nThe episode also highlights a long-standing reality in US-Pakistan relations: Washington’s primary partner in Pakistan remains its military and intelligence apparatus, not the civilian government.\n\nBy publicly thanking Pakistan’s military’s cooperation, Trump signalled that under his leadership, the US will prioritise security cooperation over political concerns — continuing past policies rather than making a significant shift.\n\nFor the Pakistani establishment, this is a diplomatic victory.\n\nAfter years of friction, particularly following the US withdrawal from Afghanistan and Washington’s growing alignment with India, this successful operation allows the establishment to reassert itself as Washington’s indispensable partner in the country.\n\nMichael Kugelman, an expert on Washington’s relations with South Asian nations, noted on X: “Pakistan wants to leverage US concerns about terror in [Afghanistan] and pitch a renewed security partnership [with the] US.\n\n“Will be a hard sell to the administration and will require giving something to the US. Pakistan’s help catching the Abbey Gate attack plotter should be seen in this context,” Kugelman added.\n\nThe episode also fits into a broader historical pattern in US-Pakistan relations.\n\nWhenever a major counterterrorism opportunity arises, Pakistan’s military leverages its operational control to rebuild ties with Washington. This was the case after 9/11, when President Musharraf’s cooperation made Pakistan a key US ally in the war on terror.\n\nNow, with Sharifullah’s capture, the military is once again positioning itself as Washington’s indispensable partner.\n\nFor the US, the logic is simple: the military can deliver results in areas that matter most — counterterrorism, border security, and intelligence cooperation. In contrast, Pakistan’s civilian politicians, entangled in endless domestic disputes, offer little in terms of reliable partnership.\n\nOn the other hand, this renewed military-led cooperation is a significant blow to former prime minister Imran Khan’s supporters, especially those based in the US.\n\nFor PTI supporters in the US, who had pinned their hopes on Trump as a potential savior, this reality check may force a reassessment of their strategy. The message from Washington is unmistakable: in the eyes of the United States, the road to Islamabad still runs through Rawalpindi.\n\nSince Imran’s ouster two years ago, PTI-affiliated groups in the US had lobbied the Biden administration, urging it to intervene on the ex-premier’s behalf — demanding his release from prison and calling for new elections.\n\nTheir efforts were largely ignored by the Biden White House, which maintained a hands-off approach to Pakistan’s domestic political turmoil.\n\nWhen Imran’s US supporters failed to sway Biden, they placed their hopes on Trump’s return, believing his unconventional approach to foreign policy might make him more sympathetic to the PTI founder’s narrative of victimhood at the hands of Pakistan’s military establishment.\n\nDuring the 2024 presidential race, PTI activists openly campaigned for Trump within Pakistani-American communities, portraying him as a potential ally who could pressure Islamabad into softening its crackdown on Imran and his party.\n\nHowever, Trump’s address to Congress — with no mention of Imran, PTI, or Pakistan’s democratic process — was disappointing for them.\n\nThe message is clear: for Washington, the establishment remains the main partner in Pakistan. Civilian politicians, including Imran, are not central to America’s strategic considerations.\n\nAdditional reporting by Abdullah Momand.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/051023021734fa2.jpg",
  "retrievedAt": "2025-08-25T14:58:03.220Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895923/trump-hails-pakistans-help-in-arresting-is-terrorist-behind-2021-kabul-airport-bombing",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T04:55:21.000Z"
}
