{
  "title": "Capital administration razes parts of Lal Masjid seminary - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad administration and the Capital Development Authority (CDA) on Tuesday demolished parts of “illegally constructed” Jamia Hafsa days after Lal Masjid cleric Maulana Abdul Aziz threatened to launch a movement against the government.\n\nA few days ago, the administration deployed more than 150 police officials around Lal Masjid in Sector G-6 to restrict the movement of individuals to and from the mosque in light of the threats by the cleric who called on his followers to attend prayers at Lal Masjid from where the anti-government movement would be launched. The call for ‘jihad’ against the state and display of automatic weapons landed him in hot water and prompted a state clampdown.\n\nThe CDA team reached Lal Masjid on Tuesday and demolished some additional structures of the newly constructed seminary.\n\nThe CDA officials did not speak on the record regarding the demolition of the seminary, saying a statement by the authority would soon be issued.\n\nAccording to a CDA official, a team was deputed to support the district administration and the substructures of the illegally constructed seminary had been brought down. The official said that further action was also expected in the coming days.\n\nNone of the Islamabad administration officials spoke on the record either. A senior official said that the order was issued by the interior ministry to demolish some sections of illegally constructed Jamia Hafsa, hoping that the move would force Maulana Abdul Aziz and his group to come to the negotiation table.\n\nThe government also managed to temporarily suspend the Facebook account of Jamia Hafsa.\n\nDuring the operation, Maulana Aziz and his followers remained cooperative and did not share footage of the demolition on social media. Maulana Aziz, while speaking about the operation, said the government was violating its terms.\n\nIn a statement, he refrained from direct threats to the state institutions “They called and requested a ‘face-saving’ and said that Ume Hassan would be released if some structures of Jamia Hafsa were taken down,” the cleric claimed.\n\nHe added that some of his colleagues suggested that cooperation with the authorities was the need of the time, but the administration wanted to expand the scope of their operation. The cleric claimed that he refused to cooperate with the administration any further, and they had left their machinery here giving a message that they would come back.\n\nThere was no additional police support for the operation; however, as two reserves of women police and four reserves of men police had already been stationed around Lal Masjid following the threats by the cleric.\n\nThe combined force of around 150 police personnel has contained the movement of individuals to and from Lal Masjid since Friday.\n\nIn reaction to the deployment, Maulana Abdul Aziz brandished a submachine gun at the police on Saturday morning, threatening them with dire consequences.\n\nThe Lal Masjid cleric had taken a tough stance against the state following the arrest of his spouse Ume Hassan and eight of her students on Feb. 19 in Margalla Town, Islamabad. They were detained while trying to occupy a mosque in the residential area.\n\nSubsequently, the administration of Lal Masjid launched a social media campaign against the government and the interior minister and also announced to make a formal call for ‘jihad’ against the “system of the state” at his Friday congregation. However, after the government increased pressure on the cleric, his rhetoric toned down, requesting the authorities for leniency.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:45:47.987Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895810/capital-administration-razes-parts-of-lal-masjid-seminary",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:09:51.000Z"
}
