{
  "title": "Terrorism challenge - Newspaper - DAWN.COM",
  "author": null,
  "content": "AS the country continues to face a multifaceted terrorism threat, the state has yet to come up with a matching response, even as we continue to lose a high number of security men and civilians to terrorist attacks.\n\nFigures released for February by the PICSS think tank point to the grim reality we face: over 100 lives were lost to terrorism last month, with civilian fatalities (55) overtaking those of security personnel (47). In keeping with earlier trends, the violence has been concentrated in KP and Balochistan, with religiously inspired militants such as the banned TTP, as well as Baloch separatists, spearheading the violent campaigns.\n\nEven in the current month, the past few days have seen numerous incidents of bloodletting. The latest incident occurred on Tuesday, when suicide bombers reportedly struck Bannu Cantonment. Earlier, an FC man was martyred on Monday when a woman suicide bomber, apparently belonging to the banned BLA, carried out an attack near Kalat. Four security men were similarly martyred in firefights with terrorists in North Waziristan. Meanwhile, the deadly bombing of the Haqqania madressah last week — believed to be the handiwork of IS — shows that other militant actors, too, feel confident enough to stage fresh attacks.\n\nMany of these acts of terrorism have been carried out in regions bordering Afghanistan, where the Taliban rulers are hostile to some terrorist groups, such as IS, yet maintain cordial ties with others, such as the TTP. Therefore, Pakistan has few options but to cooperate on the counterterrorism issue with Kabul. But bilateral ties are going through a particularly low phase, with the Torkham border closed since Feb 21, after the Afghan side reportedly started construction in a disputed area. Things have worsened since then as both sides exchanged fire, involving the use of heavy weapons, on Sunday. The fact is that while Pakistan is right in blaming the Afghan Taliban for doing little to curb cross-border terrorism, if ties deteriorate further, it will negatively affect CT cooperation.\n\nThe presence of IS in both countries should serve as a point of unity for Islamabad and Kabul. Both sides confront a bloodthirsty foe, and the only way to defeat it is to work together. Having said that, Kabul cannot rage against the ‘bad’ IS terrorists, and feign ignorance about the malign activities of the ‘good’ TTP terrorists. Action must be taken across the board, and all terrorist groups that threaten Pakistan should be dealt with by Kabul.\n\nOn the other hand, the state here must go beyond rhetoric and implement a CT strategy that can deliver lasting results. Over 1,600 security men and civilians lost their lives in terrorist attacks in 2024. This blood-soaked trend must be arrested through an effective CT campaign.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:45:58.015Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895866",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:10:14.000Z"
}
