{
  "title": "Calling Indian Muslims ‘Pakistani’ not a slur, top court rules - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: There’s no legal basis for beating up people for praising Pakistani cricketers, but it happens. A young man was thrashed mercilessly last week in Maharashtra by supporters of the Hindu right government there apparently for sheering Pakistan’s team.\n\nThere’s also no legal basis also for opposing the release of Pakistani movies in Indian cinema halls, but that also happens. For instance, Maula Jatt was stopped from being released recently following opposition from the Hindu right.\n\nNow, India’s Supreme Court says that calling someone a ‘Pakistani’ – usually used as a slur to question the patriotism of Indian Muslims – is not a criminal offence. The court said on Tuesday, however, that it was also not a nice thing to say.\n\nIn a narrow sense, the court is right. For the Hindu right, calling someone a ‘Pakistani’ implies they are not true patriots. And Rahul Gandhi has been called a Pakistani. Strictly speaking, therefore, it’s not a religious slur, but still it remains akin to hate speech. The court didn’t see it that way.\n\nIndian SC judges describe terms, often used by Indian right-wingers, as ‘not in good taste’\n\nThe Supreme Court generously stated, however, that the remarks were in poor taste. And so the bench closed a case against a person accused of using the terms ‘Pakistani’ and ‘Miyan-Tiyan’ against a government servant. The ruling threatens to open a floodgate of slurs that are “not in good taste”.\n\nLegal experts say the Supreme Court had drawn a needless fine line between “poor taste” and hate speech.\n\nThe bench of Justices BV Nagarathna and Satish Chandra Sharma made the observation while closing a case against a person accused of using the two terms against a government servant.\n\nThe complainant used to be an Urdu translator and acting clerk for Right to Information in the sub-divisional office in Jharkhand’s Chas.\n\nThe person accused in the matter, Hari Nandan Singh, had sought information under the Right to Information Act from the additional collector.\n\nAn appellate authority had directed the complainant to personally provide the information sought under RTI to Singh.\n\nAccording to the complainant, when he visited Singh’s home to hand over the information, Singh allegedly abused him by making a reference to his religion. Singh also allegedly “used criminal force against him while he was discharging his official duties, with the intention of intimidating and deterring him from performing his duties as a public servant”, according to the court order.\n\nA first information report was filed against Singh under sections of the Indian Penal Code for hurting religious sentiments (section 298), insult with intent to provoke breach of peace (504), criminal intimidation (506), assault or criminal force to deter public servant from discharging duty (353) and voluntarily causing hurt (323).\n\nAfter the charge sheet was filed, Singh filed an application for discharge under Section 239 of the Code of Criminal Procedure. This provision allows magistrates to discharge accused persons on charges deemed to be groundless.\n\nIn March 2022, the magistrate ruled that there was material available on record for framing charges against Singh. However, Singh was discharged by the magistrate for criminal intimidation and voluntarily causing hurt, citing lack of evidence.\n\nThe sessions court and the Rajasthan High Court dismissed Singh’s challenge to the magistrate’s order.\n\nThe Supreme Court ruled that because there had been no assault, the High Court should have discharged the appellant under section 353. The appellant also could not be charged under section 504 because he had committed no act that may have provoked breach of peace, the court said.\n\nAs a result, the person accused in the matter was discharged of all charges.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:58:35.429Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895815/calling-indian-muslims-pakistani-not-a-slur-top-court-rules",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:08:25.000Z"
}
