{
  "title": "Motorcycle blast kills 4, injures 5 in Balochistan’s Khuzdar: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four people were killed and five others were injured when an improvised explosive device (IED) attached to a motorbike went off in a market in Balochistan’s Khuzdar district, according to the police.\n\nNaal police Station House Officer (SHO) Bahawal Khan Pindrani confirmed the casualties to Dawn.com, saying that the condition of one of the injured was serious. District Health Officer Rafiq Sasoli also confirmed the same.\n\nThe SHO said the explosive was attached to a motorcycle and detonated remotely after the bike was parked beside a car.\n\nHe said the bomb disposal squad was present on the spot and inspecting the site.\n\nHowever, a statement from rescue service Edhi Foundation put the death toll higher at five with several injured in the blast in Khuzdar’s Naal Bazaar. It added that the casualties were moved to the hospital for treatment.\n\nKhuzdar Senior Superintendent of Police Javed Zehri told Dawn.com the blast occurred near a college in the market’s vicinity and burnt vehicles too. He said the injured were taken to Khuzdar Teaching Hospital for treatment.\n\nBalochistan Chief Minister Mir Sarfraz Bugti strongly condemned the blast in a statement, adding that orders were issued to provide the injured with the best medical care available.\n\n“Terrorism will be eradicated in all its forms,” CM Bugti was quoted as saying. “Elements hostile to peace will fail in their nefarious objectives and those involved in this incident will be brought to justice.”\n\nBalochistan government spokesperson Shahid Rind also condemned the blast and “regretted the loss of human life”.\n\n“Terrorist elements cannot demoralise the people,” Rind said. “Cowardly acts are a conspiracy to sabotage law and order.”\n\nThe incident comes on the heels of an attack on the Bannu Cantonment in Khyber Pakhtunkhwa’s namesake district when te­r­rorists had rammed two exp­losives-laden vehicles into the perimeter in an attempt to enter the high-security zone on Tuesday evening.\n\nAll 16 terrorists were eliminated while five soldiers were martyred as security forces responded to the attack. Meanwhile, 13 civilians lost their lives while another 32 were injured as a result of a mosque and a residential building suffering “severe destruction” due to the suicide blasts causing the perimeter wall to partially collapse.\n\nOn January 26, two people were killed and seven others injured in a car bomb explosion close to a passenger bus travelling from Khuzdar to Rawalpindi, in the Khori area on the Khuzdar-Shahdadkot highway.\n\nPakistan has witnessed an uptick in terror activities recently, especially in KP and Balochistan after the banned Tehreek-i-Taliban Pakistan ended its ceasefire with the government in November 2022.\n\nFebruary saw a marginal increase in terrorist attacks but a sharp surge in civilian casualties, according to a report published by an Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (Piccs).\n\nAccording to Piccs, the country witnessed 79 terrorist attacks last month, resulting in the deaths of 55 civilians and 47 security personnel, while 45 civilians and 81 security personnel were injured. Security forces, meanwhile, intensified counter-terrorism operations, eliminating 156 terrorists, injuring 20, and arresting 66, the report said.\n\nAccording to Piccs, Balochistan remained the most volatile province, recording 32 attacks that claimed 56 lives, including 35 civilians, 10 security personnel, and 11 militants.\n\nThe attacks also left 44 people injured, including 32 security forces personnel and 12 civilians. Terrorists also abducted two individuals during the month, the report said.\n\nThe Bashir Zeb and Azad factions of the BLA, the Balochistan Liberation Front and the United Baloch Army claimed responsibility for most of these attacks. Security forces, in response, killed 11 terrorists in Balochistan, per the report.\n\nAdditional reporting by Imtiaz Ali and Abdullah Zehri.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/0519092971dc3fa.jpg",
  "retrievedAt": "2025-08-25T14:57:58.322Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895980/motorcycle-blast-kills-4-injures-5-in-balochistans-khuzdar-police",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T14:12:30.000Z"
}
