{
  "title": "World’s biggest iceberg runs aground off Antarctic island - World - DAWN.COM",
  "author": null,
  "content": "PARIS: The world’s biggest iceberg appears to have run aground roughly 70 kilometres from a remote Antarctic island, potentially sparing the crucial wildlife haven from being hit, a research organisation said on Tuesday.\n\nThe colossal iceberg A23a — which is more than twice the size of Greater London and weighs nearly one trillion tonnes — has been drifting north from Antarctica towards South Georgia island since 2020.\n\nThis had raised fears it could collide with the island or run aground in shallower water near it, potentially disrupting the ability of penguins and seals to feed their young. However, the gigantic wall of ice has been stuck 73 kilometres from the island since March 1, according to a statement from the British Antarctic Survey (BAS).\n\n“If the iceberg stays grounded, we don’t expect it to significantly affect the local wildlife,” BAS oceanographer Andrew Meijers said. “In the last few decades, the many icebergs that end up taking this route through the Southern Ocean soon break up, disperse and melt,” added Meijers, who encountered A23a in late 2023 and has tracked its fate via satellite ever since.\n\nFears grow A23a may collide with a haven for wildlife, particularly penguins.\n\nSatellite images showed that the closest edge of the roughly 3,300-square-kilometre iceberg had stopped more than 70 kilometres from the island in late February. It remains unclear whether the iceberg is stuck for good. “It will be interesting to see what will happen now,” Meijers added.\n\nUpside for wildlife?\n\nThe world’s biggest and oldest iceberg calved from the Antarctic shelf in 1986. It remained stuck for over 30 years before finally breaking free in 2020, its lumbering journey north sometimes delayed by ocean forces that kept it spinning in place.\n\nSatellite imagery had previously suggested it was not crumbling into smaller chunks along the familiar path that such icebergs take. However a 19-kilometre chunk broke off in January. There had been concerns for wildlife on the crucial breeding ground of South Georgia if the iceberg parked too close.\n\nThis would have forced animals like penguins and seals to travel much farther to get around the colossal block of ice. “This could reduce the amount of food coming back to pups and chicks on the island, and so increase mortality,” Meijers explained. However in its current location, the iceberg could offer benefits to wildlife.\n\n“Nutrients stirred up by the grounding (of the berg) and from its melt may boost food availability for the whole regional ecosystem, including for charismatic penguins and seals, Meijers said. Along with the nearby South Sandwich islands, South Georgia is home to around five million seals and 65 million breeding birds from 30 different species.\n\nThe island’s seals and penguins have already had a “bad season” due to a bird flu outbreak, Meijers said in January. The iceberg poses no threat to shipping. It is so huge that vessels can easily avoid it. However, as it breaks up into smaller pieces, certain areas could become off limits to commercial fishing ships “due to the number of smaller — yet often more dangerous — bergy bits”, Meijers said.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/05100022b0aae8c.jpg",
  "retrievedAt": "2025-10-12T01:46:12.827Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895883/worlds-biggest-iceberg-runs-aground-off-antarctic-island",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:08:55.000Z"
}
