{
  "title": "China ‘ready to fight till the end’ in US trade war - World - DAWN.COM",
  "author": null,
  "content": "The Chinese Embassy in the United States said on Wednesday that it was “ready to fight till the end” with the US in its trade war.\n\nMajor Asian markets traded up on Wednesday, reversing their losses a day after US President Donald Trump imposed more blanket tariffs on Chinese imports following a similar move last month.\n\nUS tariffs are expected to hit hundreds of billions of dollars in total trade between the world’s two largest economies. Chinese exports have also reached record levels last year.\n\n“If war is what the US wants, be it a tariff war, a trade war or any other type of war, we’re ready to fight till the end,” the Chinese Embassy in the United States said in a post on X.\n\nThe embassy quoted a post by the Chinese foreign ministry spokesperson which said that, “The fentanyl issue is a flimsy excuse to raise US tariffs on Chinese imports. Our countermeasures to defend our rights and interests are fully legitimate and necessary.”\n\nEarlier in the month, the US decided to impose a 10-per cent tariff on goods imported from China. The White House said the 10pc tariff is on all imports from China and on top of existing tariffs. The tariff hike will come into effect on Tuesday. The US side cited the fentanyl issue in the US as the justification for the move.\n\nFentanyl is a highly addictive synthetic opioid, 50 times more potent than heroin. It is often used to make counterfeit narcotics because of its relatively cheap price, and it has played an increasingly central role in an opioid crisis in the United States.\n\nBeijing had announced its own measures on Tuesday in retaliation for Washington’s latest tariff hike and vowed it would fight a trade war to the “bitter end”.\n\nThe moves will see China impose levies of up to 15pc on a range of US agricultural products including soybeans, pork and wheat starting from early next week.\n\nBeijing’s countermeasures represent a “relatively muted response” in comparison to Trump’s all-encompassing tariffs, wrote Lynn Song, chief economist for Greater China at ING.\n\n“The retaliation could have been a lot stronger, and with every further escalation the risks are also rising for a stronger response,” he said.\n\nAnalysts say authorities could announce further plans to boost the economy this week, adding to a string of aggressive support measures announced late last year.\n\nChina set an ambitious annual growth target of around five per cent, vowing to make domestic demand its main economic driver as an escalating trade war with the United States hit Beijing’s exports.\n\nBeijing also announced a rare hike in fiscal funding, allowing its budget deficit to reach four pc this year as it battles stuttering employment for young people, stubbornly low consumer demand and a persistent property sector debt crisis.\n\nThe headline growth figure announced by Premier Li Qiang at an annual Communist Party conclave was broadly in line with an AFP survey of analysts, although experts say it is ambitious considering the scale of China’s economic challenges.\n\nSentiments were clouded by a broadening trade war under Trump as thousands of delegates congregated in Beijing’s opulent Great Hall of the People for the opening session of the National People’s Congress, the second of China’s “Two Sessions” political meetings this week.\n\nSome 12 million new jobs will be created in Chinese cities under the plans as Beijing pushes for two pc inflation this year.\n\nA government work report vowed to make domestic demand the “main engine and anchor” of growth, adding that Beijing should “move faster to address inadequate domestic demand, particularly insufficient consumption”.\n\nAnd in a rare move, Li said China would hike its fiscal deficit by one percentage point, which analysts have said will give Beijing more latitude to tackle its economic slowdown.\n\nBeijing’s growth target would be “tough but possible”, said Dylan Loh, an assistant professor at Singapore’s Nanyang Technological University.\n\nHe said low consumption was a “confidence issue”, adding that “if people are, in their own calculations, worried about spending — especially on big-ticket items — it is far harder to address”.\n\nAnother analyst said Beijing’s policies were not yet “big enough to really like significantly drive up the consumer sentiment”.\n\n“We need to see a very broad-based recovery of employment, income as well as the property market before we can really see a change in consumption patterns and retail sales trend,” Yue Su, Principal Economist at The Economist Intelligence Unit, told AFP.\n\n“Internationally, changes unseen in a century are unfolding across the world at a faster pace,” the government work report said.\n\n“Unilateralism and protectionism are on the rise,” it warned.\n\n“… domestically, the foundation for China’s sustained economic recovery and growth is not strong enough,” the report said.\n\nChina also disclosed on Wednesday a 7.2pc rise in defence spending in 2025, as Beijing rapidly modernises its armed forces in the face of regional tensions and strategic competition with the United States.\n\nHowever, online comments bemoaned the spending rise as “too little”. Another wrote: “We must strengthen ourselves to achieve world peace.” Geopolitical tensions between Beijing and Washington are set to intensify this year, analysts say.\n\nThe status of self-governed Taiwan — claimed by China as part of its sovereign territory — is chief among the sources of friction.\n\nThe defence spending will finance Beijing’s frequent dispatches of military aircraft around Taiwan, intended to put pressure on authorities in the island.\n\nIt also came after Trump proposed a coordinated halving of the military budgets of the United States, Russia and China.\n\nChina has not agreed to such a move, with a foreign ministry spokesperson suggesting last month that any reductions in military expenditure should be conducted by Washington first.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/051358007759275.jpg",
  "retrievedAt": "2025-08-25T14:58:00.410Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895952/china-ready-to-fight-till-the-end-in-us-trade-war",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T09:05:10.000Z"
}
