{
  "title": "‘Billion-dollar’ PIA property in New York captivates Big Apple realtors - World - DAWN.COM",
  "author": null,
  "content": "• City will continue to pay rent on Roosevelt Hotel until 2026, finance repairs & renovations before handover to PIA\n• Developers eyeing downtown location as potential site for new skyscraper\n\nA LUCRATIVE lease that saw the Roosevelt Hotel in downtown New York turned into a shelter for migrants may be drawing to a close, but with several options on the table and interested parties waiting in the wings, Pakistan’s interests seem to be secure.\n\nHowever, the property’s long-term fate is far from being settled.\n\nProperty experts in New York say the three-year lease Pakistan International Airlines (PIA) — which owns the hotel that takes up the full city block bounded by Madison and Vanderbilt avenues — signed with New York City in 2023 ensures the property will continue generating income until June 2026.\n\nUnder the terms of the lease, the city is responsible for making critical repairs and renovations, which will no doubt improve the property’s value.\n\nBut once the lease expires, Islamabad will face the crucial decision of whether to sell the property, redevelop it into apartments, or lease it out.\n\nImran Igra, a New York-based property developer, told Dawn that under the current arrangement, New York City will continue to pay rent until mid-2026, even though it plans to shut down the refugee shelter at the hotel by June.\n\nUnder New York’s property regulations, the city must also cover all renovation costs, estimated to be between $100 million and $200 million.\n\n“These upgrades are expected to significantly increase the hotel’s value — potentially raising it to between $1 billion and $1.2 billion — while also extending the building’s lifespan by 30 to 40 years,” Igra explained.\n\nHowever, he cautioned that PIA lacks the expertise to operate the hotel directly.\n\n“To remain competitive, the property will need regular upgrades and professional management,” he said.\n\n“Once renovations are complete, Pakistan would be better off leasing the hotel to an established hospitality company rather than trying to manage it itself. Selling immediately after renovation would also be unwise.”\n\nCritical revenue stream\n\nAfter New York Mayor Eric Adams announced plans to shut down the migrant arrival centre currently housed at the Roosevelt, the “precious East Midtown site” remains “topic No.1 among commercial developers”, according to a recent New York Post article on the subject.\n\nBut the closure will end the $220 million lease that provided cash-strapped PIA with a vital source of revenue.\n\nThis leaves Pakistan facing a major policy choice: diplomatic sources told Dawn that Islamabad has previously explored several options for the Roosevelt — including sale and redevelopment — but those efforts were often stalled by political sensitivities and the property’s complex ownership structure.\n\nIn early 2023, Pakistan’s caretaker government hired Jones Lang LaSalle Americas (JLL), a respected US consultancy, under a $7.8 million contract to evaluate buyers and redevelopment options. However, JLL struggled to attract suitable buyers due to the hotel’s deteriorating condition.\n\nAccording to the NY Post, JLL is likely to issue a formal solicitation in the spring, but quoted market sources as saying that “informal conversations of interest” had taken place with a number of developers.\n\nOptions on the table\n\nOne option would be to convert the hotel into a residential apartment complex — a move that would allow Pakistan to retain ownership while generating long-term rental income.\n\nHowever, such a redevelopment would require substantial upfront investment, along with approvals from New York’s zoning and construction authorities.\n\n“The decision to invest hundreds of millions of dollars is not an easy one, especially given Pakistan’s current economic crisis,” a diplomatic source told Dawn. “But selling such a historic and iconic property is equally difficult.”\n\nAdding to the pressure is the International Monetary Fund (IMF), which continues to urge Pakistan to privatise non-profitable assets, including the Roosevelt Hotel.\n\nAccording to the NY Post, another option before developers is tearing down the antiquated hotel to build a skyscraper of up to 1.8 million square feet on the roughly 42,000 square-foot parcel.\n\n“Any development plan would have a lot of moving parts,” it quoted a New York investment-sale specialist as saying. “A buyer has to make a deal with the union. Their proposal has to go through ULURP. They need to find an anchor tenant. You’re looking at a three-to-five-year process.”\n\nPublished in Dawn, March 5th, 2025\n\nHeader image: According to US media, developers are eyeing the Roosevelt Hotel’s location as the potential site for a new skycraper in downtown New York.—AFP/file",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c7720d64b51.jpg",
  "retrievedAt": "2025-10-12T01:46:09.700Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895820/billion-dollar-pia-property-in-new-york-captivates-big-apple-realtors",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:08:25.000Z"
}
