{
  "title": "Delay in audit of state institutions worries IMF, PAC told - Business - DAWN.COM",
  "author": null,
  "content": "A delay in the audit process of state institutions has worried the International Monetary Fund (IMF), Auditor General of Pakistan (AGP) Ajmal Gondal told a meeting of the Publics Account Committee (PAC) on Wednesday.\n\nThe development comes as discussions began this week between the IMF and Pakistan for the first biannual review of the $7 billion Extended Fund Facility to address governance and corruption vulnerabilities.\n\nWhile addressing today’s meeting, AGP Gondal disclosed that the IMF had expressed its concerns over nearly 600,000 pending audit paras.\n\n“The IMF has demanded early settlement of audit cases of institutions,” Gondal said, adding that there were about 500,000 to 600,000 pending audit paras pertaining to ministries and institutions.\n\nHe continued that despite the orders of parliament, no chief internal accountant had been appointed. “The financial audit system is flawed due to non-implementation of the rules.\n\n“Secretaries and chief financial officers of institutions are not clearing their audits,” he said. “There are only chief financial officers in 15 institutions, and none of them have a chief internal accountant.”\n\nHe reiterated that there were no internal audit systems in institutions.\n\n“The number of pending audit cases with the PAC has increased to more than 30,000,” the AGP said.\n\nThe PAC sought details from ministries and institutions within a month.\n\nIn August last year, the AGP had expressed serious concerns over the country’s deteriorating financial affairs, which have resulted in less than 4 per cent of the over Rs38.67 trillion budget being available for socio-economic services.\n\nAdditionally, around 93pc of supplementary grants worth over Rs8tr had not been approved by the parliament and remained unspent, representing a loss of public resources.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/231040578ef869f.jpg?r=104309",
  "retrievedAt": "2025-08-25T14:57:57.889Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895957/delay-in-audit-of-state-institutions-worries-imf-pac-told",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T11:04:30.000Z"
}
