{
  "title": "What next? - Newspaper - DAWN.COM",
  "author": null,
  "content": "SAY what you like about Imran Khan but his sense of timing is impeccable. As prime minister in February 2022, he managed to turn up in Moscow on the day that Vladimir Putin launched his invasion of Ukraine. Last Friday, a comment bearing his byline appeared in Time magazine. After the usual breast-beating and self-aggrandisement, it hailed Donald Trump’s resurrection as a remarkable “testament to resilience and the will of the people”.\n\nOn the day that Trump and his deputy went out of their way to humiliate Ukraine’s elected leader Volodymyr Zelensky in the Oval Office, IK looked “forward to his administration reaffirming its commitment to democratic principles, human rights, and the rule of law — particularly in regions where authoritarianism threatens to undermine these values”. Imran and his acolytes still seem to be counting on the elusive phone call that will mutate into a ‘get out of jail free’ card for him, and shameless flattery is the only way to grab Trump’s attention — as Emmanuel Macron and Keir Starmer recently demonstrated.\n\nIt should be common knowledge, though, that Trump is also a fan of authoritarianism, and keen to emulate the likes of Javier Milei and Viktor Orbán. He and the bunch of reprobates he has recruited have sowed chaos at both the domestic and international levels during the first 50 days of the second Trump regime.\n\nPeace in Ukraine is desirable, but on what terms? It’s understandable at this stage for Zelensky to bristle at the absence of Western security guarantees in Trump’s ceasefire scenario — which relies on the hope that the involvement of American companies in excavating Ukraine’s minerals (with the US banking half the profits) would suffice in Vladimir Putin’s eyes as a deterrent to further military assaults. Demanding that Ukraine pay back all that it received in US military assistance since 2022 is extortion rather than a peace plan. Yet Zelensky has been advised by the likes of Peter Mandelson, British ambassador to the US, to accept whatever Trump is proposing.\n\nWestern illiberalism trumps liberalism.\n\nThat was before the US suspended military aid to Ukraine on Monday, possibly as a means of coercing Zelensky to accept the same advice that Mandelson had proffered. The latter’s boss, Starmer, might take a marginally different tack, but is equally desperate not to annoy Trump. Which is tricky, given that no one can be sure what might trigger the US president. Starmer’s proposal for a European “coalition of the willing” to bolster Ukraine’s defences with boots on the ground and warplanes in the air echoes the appellation attached to the military misadventure the UK walked into under Tony Blair by co-sponsoring the 2003 disaster in Iraq.\n\nStarmer’s attitude aligns with that of his counterparts in Nato and the European Union, which is to pursue the war until Putin cries uncle, or is overthrown and replaced by a more user-friendly Russian leader along the lines of Boris Yeltsin. Never say never, but that is unlikely. Some of the EU’s American frenemies, meanwhile, have been suggesting that Zelensky should resign — for the crime of not bending the knee to Emperor Donald and J.D. Vance, the president’s pet Chihuahua who likes to pretend he’s a Rottweiler. In subsequent social media comments, Trump again slammed Zelensky for saying that a ceasefire was “very, very far away”, and mocked European powers for acknowledging “that they cannot do the job without the US”.\n\nWhat exactly, though, is “the job”? Viewed in a broader historical context, it’s understandable why western Europe might have latched on to America as its saviour and securi­­ty guarantor in the immediate afterm­ath of World War II, although even that arguably was an error, but what prevented it from seeking full independence in the decades that followed? And what on earth persuaded European nations that ought to have known better from embracing the American hegemon with even greater gusto once the Warsaw Pact perished and the Soviet Union imploded in 1989-91?\n\nThe sovereignty of the independent Ukraine that emerged in 1991 should not have been violated in 2014, let alone bludgeoned in 2022. But, while Putin’s government alone bears responsibility for its aggression three years ago, for which there was no immediate provocation, Moscow could hardly have been expected to ignore the years-long wooing of Kyiv by Washin_gton and Brussels, accompanied by consequential political interventions. It’s not that Moscow wasn’t culpable in the context of influence operations, or the naked ag­­gression that followed their failure. How_ever, as in the 1970s, some kind of entente with Russia is the obvious alternative to rearmament on steroids and hostility based on variants of age-old Russophobia.\n\nTrump, Putin, the EU and Nato are ultimately the wretched consequences of a world gone wrong. What comes next is anyone’s guess.\n\nmahir.dawn@gmail.com\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c79cafdb7a5.png",
  "retrievedAt": "2025-08-25T14:57:57.847Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895861/what-next",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:10:02.000Z"
}
