{
  "title": "Arab states adopt Egyptian alternative to Trump’s Gaza plan - World - DAWN.COM",
  "author": null,
  "content": "• UN chief ‘strongly endorses’ initiative to rebuild Gaza without displacing Palestinians\n• Hamas praises Cairo’s efforts for reconstruction of the devastated territory\n\nCAIRO: Arab leaders adopted an Egyptian reconstruction plan for Gaza on Tuesday that would cost $53 billion and avoid resettling Palestinians, in contrast to US President Donald Trump’s “Middle East Riviera” vision, according to a copy of the plan.\n\nEgyptian President Abdel Fattah Al Sisi said that the proposal had been accepted at the closing of a summit in Cairo.\n\nSisi said at the summit he was certain that Trump would be able to achieve peace in the conflict that has devastated the Gaza Strip.\n\nThe major questions that need to be answered about Gaza’s future are who will run the enclave and which countries will provide the billions of dollars needed for reconstruction.\n\nSisi said Egypt had worked in cooperation with Pales­tinians on creating an administrative committee of independent, professional Palest­inian technocrats entrusted with the governance of Gaza.\n\nThe committee would be responsible for the oversight of humanitarian aid and managing the Strip’s affairs for a temporary period, in preparation for the return of the Palestinian Authority (PA), he said.\n\nThe other critical issue is the fate of Hamas, the PA’s rival.\n\nPalestinian President Mahmud Abbas, who heads the PA, said he welcomed the Egyptian idea and urged Trump to support such a plan that would not involve displacing Palestinian residents.\n\nAbbas, in power since 2005, also said he was ready to hold presidential and parliamentary elections if circumstances allowed, adding his PA was the only legitimate governing and military force in the Israeli-occupied territories.\n\nUN chief Antonio Guterres said he strongly endorsed the Egyptian plan as it envisages Gaza’s reconstruction without displacement of its Palestinian inhabitants.\n\n“I welcome and strongly endorse the Arab-led initiative to mobilise support for Gaza’s reconstruction, clearly expressed in this summit,” Guterres said. “The UN stands ready to fully cooperate in this endeavour.”\n\nA spokesman for Hamas said the group welcomes the Egyptian initiative.\n\nRebuilding needs Gulf states\n\nAny reconstruction funding would require heavy buy-in from oil-rich Gulf Arab states such as the United Arab Emirates and Saudi Arabia, which have the billions of dollars needed.\n\nThe UAE, which sees Hamas as an existential threat, wants an immediate and complete disarmament of the group, while other Arab countries advocate a gradual approach, a source close to the matter said.\n\nSaudi Arabia says the continued presence of Hamas in Gaza was a stumbling block because of strong objections from the United States and Israel, a source close to the royal court said.\n\nIn a speech at the summit, Saudi Foreign Minister Prince Faisal bin Farhan said international guarantees were needed that the current temporary ceasefire would remain in place, and supported the PA’s role in governing the Gaza Strip.\n\nLeaders of the UAE and Qatar did not speak during open sessions of the summit.\n\nHamas was founded in 1987 by Egypt’s Muslim Broth­erhood during the first Pales­tinian Intifada, or uprising.\n\nSenior Hamas official Sami Abu Zuhri on Tuesday rejected Israeli and US calls for the group to disarm, saying its right to resist was not negotiable.\n\nAbu Zuhri said the group would not accept any attempt to impose projects, or any form of non-Palestinian administration or the presence of foreign forces.\n\nSince Hamas drove the Palestinian Authority out of Gaza after a brief civil war in 2007, it has crushed all opposition there.\n\nAlternative to Trump plan\n\nEgypt, Jordan and Gulf Arab states have for almost a month been consulting over an alternative to Donald Trump’s ambition for an exodus of Palestinians and a US rebuild of Gaza, which they fear would destabilise the entire region.\n\nEgypt’s Reconstruction Plan for Gaza is a 112-page document that includes maps of how its land would be redeveloped and dozens of colourful AI-generated images of housing developments, gardens and community centres.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/05085951ac9589d.jpg",
  "retrievedAt": "2025-10-12T01:45:50.503Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895819/arab-states-adopt-egyptian-alternative-to-trumps-gaza-plan",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:08:25.000Z"
}
