{
  "title": "Vance denies disrespecting UK and France over Ukraine peacekeeping force - World - DAWN.COM",
  "author": null,
  "content": "LONDON: US Vice President JD Vance denied on Tuesday disrespecting Britain and France by describing a planned peacekeeping force in Ukraine as 20,000 troops from some “random country that has not fought a war in 30 or 40 years”.\n\nEuropean nations are looking at ways to support an eventual peace deal between Ukraine and Russia, with Britain and France saying they would be willing to deploy ground troops.\n\nVance’s comments about the planned British- and French-led European peacekeeping force caused politicians and veterans in both countries to say he was dishonouring hundreds of troops killed fighting alongside US forces in Afghanistan and Iraq.\n\nVance said it was “absurdly dishonest” to suggest he had criticised British or French troops in his comments, made in an interview with Fox News on Monday. “I don’t even mention the UK or France in the clip, both of whom have fought bravely alongside the US over the last 20 years, and beyond,” he said on X.\n\nOnly Britain and France have publicly committed to a European peacekeeping force in Ukraine. Vance said on Tuesday he was referring to other potential countries in what British Prime Minister Keir Starmer called at the weekend “a coalition of the willing” that would contribute to any post-war peacekeeping force in Ukraine.\n\nIn the past 40 years, British and French troops have fought alongside US troops in Iraq and in Afghanistan. James Cartlidge, the British opposition Conservative Party’s spokesman on defence, called Vance’s comments “deeply disrespectful”.\n\nJohnny Mercer, a British veteran and a former junior defence minister, called Vance a “clown”. French Defence Minister Sebastien Lecornu said in parliament: “We respect the veterans of all the allied countries. We will make sure that our own veterans are respected.”\n\nFrench President Emmanuel Macron’s Renaissance party on X said: “The French and British soldiers who died fighting terrorism, who fought and sometimes died alongside American soldiers, deserve better than the disdain of the American vice president.” Nigel Farage, the leader of the British right-wing populist Reform party and a friend of US President Donald Trump, said: “wrong, wrong, wrong” when asked about Vance’s comments. Vance told Fox News on Monday that the best way to ensure peace in Ukraine was to open up Ukraine’s minerals to the US.\n\n“If you want to actually ensure that (Russian President) Vladimir Putin does not invade Ukraine again, the very best security guarantee is to give Americans economic upside in the future of Ukraine,” he said. “That is a way better security guarantee than 20,000 troops from some random country that hasn’t fought a war in 30 or 40 years.”\n\nUS Vice President JD Vance insisted Tuesday he was not targeting France and Britain with remarks he made dismissing the military abilities of countries supporting a possible European peacekeeping force in Ukraine. Vance has positioned himself as President Donald Trump’s foreign policy attack dog in recent days, particularly when it comes to Europe.\n\nHe stunned European leaders at the Munich Security Conference last month when he made a speech seen as a combative broadside against the continent and Germany in particular, accusing them of limiting free speech and excluding parties voicing strong concerns on immigration.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/051003324d6dcb5.jpg",
  "retrievedAt": "2025-10-12T01:46:33.434Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895884/vance-denies-disrespecting-uk-and-france-over-ukraine-peacekeeping-force",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:08:55.000Z"
}
