{
  "title": "PM Shehbaz pats his team on the back - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Premier touts economic turnaround with ‘help from friends’, stresses need to address loss-making SOEs\n• Dar says diplomatic isolation is over, alludes to SCO moot, UNSC membership\n• Aurangzeb says current account surplus highest in 20 years\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Tuesday took pride in his government’s performance for “steering the country out of multiple crises” and evading bankruptcy with the help of friendly nations during its first year in power.\n\n“To meet the IMF’s (International Monetary Fund) conditions, we have to arrange $5 billion, which was impossible except we go to our friends, for which I and Gen Asim Munir went to them to get their financial assistance,” said the prime minister while addressing a cabinet meeting in which he reviewed the one-year performance of the government.\n\nLauding the performance of his cabinet members, the premier said that they took the challenge of saving the country from default. “…the government succeeded in achieving the economic turnaround and steering the country out of the financial straits,” he said, while expressing resolve to make Pakistan a $1 trillion economy by 2035.\n\nThe prime minister, highlighting the government’s efforts towards economic stability, expressed the confidence that the Rs400 billion tax cases pending for adjudication in various courts would be decided expeditiously.\n\nHe underlined the need to plug Rs850 billion losses incurred by the state-owned enterprises, terming them as ‘bottomless pits’ that needed to be plugged. He also stressed the need to end circular debt in the power sector.\n\nHe said the government had rolled out a Rs20 billion Ramazan package to benefit four million families through the digital wallet system, adding that each family would get Rs5,000 through a new system that discouraged financial mismanagement.\n\nThe prime minister condemned the closure of the Gaza corridor for humanitarian assistance and said that more than 50,000 Palestinians had been martyred by Israel. He also highlighted the plight of Kashmiri people, urging the international community to raise their voice for Kashmir and Palestine.\n\nDiplomatic isolation\n\nOn the occasion, Foreign Minister Ishaq Dar said the country’s diplomatic isolation was over. Pakistan has become a member of the UNSC for 2025-26, he said, adding that after a gap of 27 years, multilateral international conferences like SCO were held in Pakistan. He also highlighted the risks posed by climate change to Pakistan.\n\nMinister for Finance Muhammad Aurangzeb, presenting an overview of the economy, said that the Pakistan Stock Exchange had witnessed a 71 per cent return while the current account surplus was the highest in the last 20 years. He apprised that the plans for rightsizing of 43 ministries and their 400 attached departments were afoot, whereas pension reforms and agriculture tax were introduced for the first time. The FBR revenue surged by 26pc, he said, adding other steps included the introduction of a faceless assessment system, which saw revenues up by 60pc.\n\nPower Minister Awais Leghari briefed the meeting about comprehensive reforms, saying that these efforts had resulted in a reduction of Rs151 billion in industrial cross-subsidy.\n\nHe also highlighted the solarisation of tube wells in Balochistan province, adding that out of 27,000, around 4,000 tube wells had been converted to solar. The project would save about Rs100 million in losses to the power sector in the province, he said.\n\nMinister of State for IT Shaza Fatima Khawaja also presented a report about the performance of her ministry, saying that 15 million new broadband subscribers were added while the telecom sector was contributing Rs341 billion to the national economy.\n\nPlanning Minister Ahsan Iqbal also expressed the confidence that with the continuation of ‘Uraan Pakistan’, they would achieve the roadmap with five corridors of growth under the guidance of the prime minister.\n\nReports were also presented about the performance of the interior ministry, curbing of smuggling, Green Pakistan Initiative, and the SIFC contributions to the agriculture and livestock sectors.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c774de8c38a.jpg",
  "retrievedAt": "2025-10-12T01:45:53.837Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895821/pm-shehbaz-pats-his-team-on-the-back",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:08:19.000Z"
}
