{
  "title": "Shehbaz’s defamation suit against Imran adjourned - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A sessions court on Tuesday adjourned the hearing of a Rs10bn defamation suit filed by Prime Minister Shehbaz Sharif against incarcerated former prime minister Imran Khan due to absence of the plaintiff.\n\nAdditional District & Sessions Judge (AD&SJ) Farhan Nabi conducted the hearing of the suit.\n\nAdvocate Mian Muhammad Hussain Chotia appeared on behalf of the defendant, Imran Khan, however, the plaintiff, PM Shehbaz was not available for cross-examination.\n\nThe plaintiff’s lawyer informed the court that the prime minister was occupied due to engagements with a foreign delegation and was unable to attend the hearing.\n\nThe defendant’s lawyer told the court that he was fully prepared for cross-examining the prime minister, adding, “It seems that PM Shehbaz Sharif did not appear due to fear of cross-examination.”\n\nHowever, the plaintiff’s lawyer said the prime minister was busy with a foreign delegation.\n\nThe judge adjourned further hearing on the request of the plaintiff’s counsel till March 22.\n\nThe suit pending since 2017 says Mr Khan wrongly accused PM Shehbaz of offering Rs10bn to him through a common friend in exchange for withdrawing the Panama Papers case from the Supreme Court.\n\nShehbaz said Mr Khan leveled baseless allegations against him, seeking a decree for recovery of Rs10bn as compensation from the defendant for publication of defamatory content. The PTI leader had filed his reply to the suit with a delay of four years in 2021, saying one of his friends told him that someone known to him and also the Sharif family approached him with an offer to pay billions of rupees if he could convince Mr Khan to stop pursuing the Panama case.\n\nMr Khan said he had disclosed the incident for the consumption of the public at large, and an act in the interest of the public good does not constitute any defamation.\n\nHe said maintained that he did not specifically attribute any statement to the plaintiff (PM Shehbaz) while narrating the incident.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:58:03.816Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895914/shehbazs-defamation-suit-against-imran-adjourned",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:35:52.000Z"
}
