{
  "title": "Punjab notifies ban on early paddy sowing - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Punjab has banned early sowing of paddy crop on the recommendation of an inquiry committee formed in the wake of farmers’ complaints of poor yield leading to financial losses during the last crop year.\n\nAn official notification issued on Tuesday says the ban has been imposed under the Punjab Agriculture Pests Ordinance 1959 and warns of a strict action against the occupiers of land cultivating paddy nurseries before May 20, 2025.\n\nThe law prescribes Rs50,000 fine and/or six-month jail term for violation of any provision or rules made under the ordinance.\n\nA communique sent to all divisional directors and deputy directors of agriculture (extension) says early paddy sowing is caused by some farmers’ attempts to get two rice crops in a season and the practice is severally causing stress on the canal and subsoil water as well as damaging the climate and farmers equally.\n\nMove aims to stop farmers from getting two rice crops to avert water stress\n\nThe ban comes on the recommendation of an inquiry committee formed on the direction of the National Food Security & Research Ministry on complaints of paddy growers of low yield due to poor quality seed provided by the seed companies last season.\n\nThe probe committee, led by Joint Secretary of the ministry Amjad Ahmad, with RRI, Kala Shah Kaku Principal Scientist Dr Muhammad Ijaz, Guard Agri Research & Services (Pvt) Ltd’s Shehzad Ali Malik, Pakistan Kissan Ittehad President Khalid Khokhar, and Federal Seed Certification and Registration Department (FSC&RD) DG Muhammad Azam Khan as its members was formed in September last year.\n\nIts terms of reference included investigating the efficacy of hybrid rice seeds used during the sowing season, looking into the rice planting procedures and practices (especially sowing time), loss in yield due to seed, climate conditions, availability of inputs etc., current market price of paddy and quality and quantity of early harvest.\n\nThe committee visited Gujranwala, Sahiwal and Khanewal, prime regions for paddy production, the same month to get direct information from the complainant growers and others.\n\nHearing all the parties and observing the climate, water availability and other conditions, the committee recommended that there should be a complete ban on the early sowing of paddy nursery, which may be started from the recommended date of May 20 or as per recommendation of the provincial agriculture departments.\n\nProvincial agriculture departments should implement the ban of the early sowing of the paddy nursery before the recommended dates.\n\nIt said that all the seed distributing companies may be bound to deliver production technology details in the form of a pamphlet along with their seed bag to provide guidance to the farmers. Seed companies should provide the seed only to their registered dealers.\n\nIt recommended strict action against the seed dealers and companies involved in selling misbranded, and counterfeit seed.\n\nThe committee called for a focus both of the public and private sector on the development of heat-resistant varieties, while the variety evaluation committee should make a mandatory requirement and arrangements for testing varieties against heat stress during trials.\n\nPublished in Dawn, March 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:58:02.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895912/punjab-notifies-ban-on-early-paddy-sowing",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T01:35:52.000Z"
}
