{
  "title": "DC launches crackdown, tackling price hikes, encroachments, professional beggars",
  "link": "https://www.app.com.pk/national/dc-launches-crackdown-tackling-price-hikes-encroachments-professional-beggars/",
  "date_published": "2023-08-29T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): On the instructions of Deputy Commissioner Islamabad Irfan Nawaz Memon, Assistant Commissioners on Tuesday took action against price hikes, encroachment and professional beggars in their respective areas.\nAs the ICT Spokesperson said, a comprehensive effort was made, involving inspections at 134 different locations to curb price hikes, while fines totalling Rs.17,100 were levied in response to pricing violations.\nHe further said, the crackdown resulted in the sealing of three shops, arresting of four individuals, and the initiation of legal proceedings against them.\nMoreover, 29 professional beggars were apprehended and subsequently handed over to law enforcement, while simultaneous measures were enacted against unlicensed medical facilities and outlets offering Shisha services.\nSignificantly, the campaign included an extensive anti-encroachment operation, leading to the apprehension of seven persons due to encroachment violations. A legal case was registered against two outlaws implicated in the encroachment incidents.\nThe efforts to counteract rising prices also encompassed the confiscation of over 12 kilograms of polythene bags, which are a major contributor to environmental degradation.\nIn a parallel endeavour, unauthorized petrol filling stations and illegal LPG facilities were targeted. A total of fourteen non-compliant petrol filling agencies were shut down, alongside the closure of three unlawful LPG filling stations. Three individuals linked to these operations were arrested and relocated to police facilities.\nHe further said this sustained multi-faceted campaign merits attention for its consistent daily undertakings against encroachments, surging prices, and the presence of professional beggars.",
  "retrievedAt": "2025-08-11T09:22:11.674Z"
}
