{
  "title": "Afghan bound China cargo termed good omen for enhancing regional trade",
  "link": "https://www.app.com.pk/national/afghan-bound-china-cargo-termed-good-omen-for-enhancing-regional-trade/",
  "date_published": "2023-08-29T10:21:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 29 (APP): President Frontier Custom Agents Association (FCAA), Zia-ul-Haq Sarhadi while welcoming crossing of first ever China cargo for Afghanistan via Khunjerab border, has termed it a good omen for enhancing trade in the region.\nIn a press statement issued here on Tuesday, the President FCAA said that it was really heartening to know that Afghanistan bound China goods had started crossing through Pakistan.\nThis development, Zia added, will not only increase volume of trade at regional level, but will also create a large number of livelihood opportunities for people associated with customs clearance, goods transportation, fuel business, daily wagers etc.\nIt merits an insertion here that Pakistan Customs has recently facilitated the first ever cargo from China to Afghanistan via Khunjerab border under the Transports Internationaux Routiers (TIR) Convention, which provides an easy and economical route for trade between countries across the world.\nThe first consignment started its journey from Kasghar, China and after crossing over to Pakistan via the Khunjerab pass, it will reach Kabul in Afghanistan. This transit route will reduce the travel time to almost 70% and is also economical as it is expected to reduce the logistics costs by more than 30 percent, Zia opined.\nHe said that presently, the flow of bilateral and transit trade between Pakistan and Afghanistan was not up to mark and inclusion of China cargo in the business would improve commercial activities in the region.\nA large number of custom clearing agents who have lost their earnings due to shrinking of business will get new opportunities to revive its lost glory, he added.\nZia Sarhadi who also holds the office of Director Pak-Afghan Joint Chamber of Commerce and Industry (PAJCCI), said that the utilization of silk route by China for transportation of its cargo goods to Afghanistan would also be beneficial for early operationalization of gigantic CEPC project.\nHe appreciated the efforts made by Pakistan Customs for facilitating clearance of Afghanistan bound China good through Sost border under Transports Internationaux Routiers (TIR) Convention.\nThe operationalization of TIR along with QTTA and other regional transit and trade arrangements like OBOR and CAREC corridors can help Pakistan become a major hub of trade and transit, he hoped.",
  "retrievedAt": "2025-08-11T09:22:10.222Z"
}
