{
  "title": "NCOC through TTQ identified Top 20 cities across Pakistan with potential COVID-19 hotspots",
  "link": "https://www.app.com.pk/national/ncoc-through-ttq-identified-top-20-cities-across-pakistan-with-potential-covid-19-hotspots/",
  "date_published": "2020-06-15T03:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):The National Command and Operation Center (NCOC) on Monday, in line with the Prime Minister’s announcement of containment of COVID -19 through smart lockdown strategy, undertook a comprehensive review of potential COVID-19 clusters and hotspots across Pakistan.\n“A total of 20 cities across Pakistan have been identified as having likely increase in ratio or speed of infection which needs restrictive measures for containment of COVID-19. The same is being shared with provinces by NCOC,” the Forum was apprised during the NCOC meeting chaired by Minister for Planning Development Reforms and Special Initiatives, Asad Umar here.\nIn Islamabad, G-9/2 and G-9/3 had more than 300 cases and were sealed along with Karachi Company whereas the new hotspots in Islamabad which were being monitored and might be sealed included I-8, I-10, Ghauri Town, Bharakhau, G-6 and G-7 sectors.\nVarious cities which have registered increase in infection cases and have been identified by NCOC for necessary restrictive measures included Karachi, Lahore, Quetta, Peshawar, Rawalpindi, Islamabad, Faisalabad, Multan, Gujranawala, Swat, Hyderabad, Sukkar, Sialkot, Gujarat, Ghotki, Larakana, Khairpur, Dera Ghazi Khan, Malakand and Mardan.\nIt may be mentioned here that Test, Track and Quarantine (TTQ) was aimed at identifying disease spread, focused clusters and hotspots to enable targeted lockdowns and need-driven resource optimisation at all levels. The TTQ strategy has been formulated to keep spread of the disease in check while different sectors open up.\nThe TTQ strategy involved ramping up of testing, rapidly tracing the contacts of confirmed positive cases, and effective quarantining of positive and suspected cases.\nNCOC was briefed in detail about operationalisation of additional oxygenated beds and vents including procurement of these critical healthcare equipment by National Disaster Management Authority (NDMA) as announced by the Prime Minister.\nA total of 2150 additional oxygenated beds would be functional by end of July to meet additional requirement.\n1000 oxygenated beds would be functional by end June and another 1150 by end of July.",
  "retrievedAt": "2025-08-11T19:20:41.842Z"
}
