{
  "title": "AJK tightens lockdown for safety of human lives : AJK President",
  "link": "https://www.app.com.pk/national/ajk-tightens-lockdown-for-safety-of-human-lives-ajk-president/",
  "date_published": "2020-06-15T00:45:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jun 15 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Monday urged the social organizations to come forward and address the financial problems erupted out of the outbreak of coronavirus pandemic and ensuing lockown in the liberated territory.\n“The social organizations besides helping the needy people, should also play their role to create awareness among them about the preventive measures so that the pandemic is responded jointly and effectively,” he asserted.\nThe AJK President expressed these views while talking to a five-member delegation of a social welfare organization ‘Be The Merciful’ (BTM) which called on him under the leadership of the BTM Chairperson, Sumaira Farrukh in federal capital, AJK Presidential secretariat told media here Monday evening.\nThe delegation was comprising President BTM Azad Kashmir chapter Areeba Ilyas, Secretary General Amna Munir, Vice Persident Basit Naqvi and member of Board of Directors Faizan Riasat Masih.\nThe state president said that the test put by the coronavirus pandemic has necessitated all segments of the society to jointly respond to it with coordinated efforts. The masses, he added, also need to be sensitized about the preventive measures.\n“The social organizations should distribute relief goods wherever needed, and at the same time advise the local people beneficiaries to maintain discipline, observe social distancing and adopt all other preventive measures in order to contain the spread of virus,” he emphasized.\nAppreciating the spirit of the BTM chief, he said that serving the poor people by a welfare organization is an appreciable initiative, and also a good luck of the people of Azad Kashmir.\nAssuring full cooperation of the state government to the organization, the AJK president said that keeping in view the fast deteriorating situation, the Azad Kashmir Government has decided to once again tighten the lockdown and this decision has been taken to ensure safety of human’s lives.\nEarlier, apprising the state president of the social activities of her organization, Sumaira Farrukh said that the BTM wanted to help the people of Azad Kashmir affected by coronavirus and lockdown particularly those living along the Line of Control through food and non-food items and cash relief.\nShe told that BTM had distributed relief items in Rawalakot, Nowshera in Pakistan and among the victims of Neelum valley residing in Chakri Road in Rawalpindi. In the next phase one month ration, women garments and other relief goods will be distribution among the deserving families in Chinari, Chakothi and Kutan area of Neelum Valley.\nShe asserted that the coronavirus crisis had caused frustration among the people, and we are trying our best to remove it by extending whatever help we can provide.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:20:46.881Z"
}
