{
  "title": "President calls victim families of PIA plane crash, shares their grief, agonies",
  "link": "https://www.app.com.pk/national/president-calls-victim-families-of-pia-plane-crash-shares-their-grief-agonies/",
  "date_published": "2020-06-15T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):President Dr Arif Alvi Monday informed the victim families, who lost their near and dear ones in the tragic PIA plane crash in Karachi last month, that the government had promised to make the inquiry report public and hopefully by June 22.\nThe president posted a number of tweets after holding conversation with members of every victim family.\n“The report will not provide closure, but at least such accidents may be prevented in the future,” he said\nNinety-eight passengers and crew members of the PIA flight, PK-8303, were killed when the unfortunate plane crashed in a Model Colony area of Karachi on May 22. The government had formed a high powered committee to probe the plane crash.\nThe president expressing his deep grief and pain over the tragic accident, said he called every family of PIA plane crash victims to offer his condolence and shared their heartbreaking realities.\nMany pleaded that ‘we have lost our near and dear ones and we believe that it was Allah’s will, but a fair inquiry should be completed very soon and that responsibility should be fixed” the president further posted while quoting a part of their conversation.\n“I heard of newlyweds who died, of children still to be born in some families who have been orphaned before birth, of parents, brothers and sisters who were martyred, and in a few cases where entire families were wiped out. Such were the stories of deep anguish and sadness that I heard,” he added.\nPresident Alvi further posted that he had been able to attend the Namaz e Janaza of two martyrs of the tragedy but he could not have imagined the sorrow until he communicated with each family.\nThe people, he said, cried on the phone and so did he. “May Allah grant mercy to the Shaheed and give strength to their kith and kin left behind on this earth,” he added.\nHe observed that despite modern ability of DNA sampling, the struggle to identify the dead bodies and the time it took had its own pain.\n“Parents recalled their young sons & daughters, even little children, who embraced shahadat. Surviving offspring shedding tears for their elders who died. Sole bread earners lost in this tragedy and the families were worried about life tomorrow,” the president said while sharing their ongoing agonies.\n“I wish I could write about everyone. I cannot even claim that their sorrow can be shared as it is too deep, but a few words of empathy can sometimes lessen the pain. I tried to help some family members with their issues, and will continue to do so,” the president added.\nSharing further details of his conversation with the bereaved families, he said many complained about the system, the government, as well as the media, but most appreciated the help provided by the PIA, by the government, and the concern shown by the elected representatives and officials who visited them and tried to help and sort out their issues.\n“There were stories of pain because of confusion, and that a better response system should be ensured,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:20:41.371Z"
}
