{
  "title": "PM directs formulation of strategy ensuring public relief under govt’s decisions",
  "link": "https://www.app.com.pk/national/pm-directs-formulation-of-strategy-ensuring-public-relief-under-govts-decisions/",
  "date_published": "2020-06-15T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):Prime Minister Imran Khan on Monday said government’s objective to bring down petroleum prices was to provide maximum possible relief to the public and directed all the provincial chief secretaries to devise a joint strategy\nensuring trickling down effects of these measures.\nThe prime minister was chairing a meeting to review steps for reducing prices of essential commodities. The meeting was attended by Minister for National Food Security, Syed Fakhar Imam, Adviser on Finance Dr Abdul Hafeez Shaikh, Adviser on Commerce Abdul Razak Dawood, PM’s Special Assistant Dr Shahbaz Gill, and senior officials. The chief secretaries of provinces attended the meeting through video link, PM office media wing in a press release said.\nAddressing the meeting, the prime minister said specter of adulteration of food stuff had been affecting health of children, aged and the young alike.\nIn past, the grave issue was neglected, he said adding, availability of pure items of daily use reflected good\ngovernance so, special focus should be made in this regard.\nThe prime minister also directed the National Price Control Committee to take all necessary measures to\nensure provision of flour (Ata) at suitable price.\nThe chief secretaries briefed the prime minister about the steps to reduce prices of daily use items and ensuring\nrelief to public after the reduction of petroleum prices.\nThey also apprised about the administrative action taken against hoarding and adulteration in food in their respective provinces.\nThe meeting was informed that positive results were being achieved after the federal government approved\ninter-provincial transportation of wheat, however, further steps were afoot to bring down flour price.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:20:40.549Z"
}
