{
  "title": "PM directs NDMA to ensure availability of COVID-19 medicines, injections",
  "link": "https://www.app.com.pk/national/pm-directs-ndma-to-ensure-availability-of-covid-19-medicines-injections/",
  "date_published": "2020-06-15T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):Prime Minister Imran Khan on Monday taking notice of the shortage of medicine and injections for COVID-19 patients directed the Chairman National Disaster Management Authority to ensure their availability and easy access.\nChairing a review meeting on situation of coronavirus, the prime minister said proper treatment and following of standard operating procedures (SOPs) could help control the spread of the disease.\nThe meeting was attended by Interior Minister Ijaz Shah, Planning Minister Asad Umer, Information Minister Senator Shibli Faraz, Minister for Industries and Production Hammad Azhar, Adviser on Finance Dr Abdul Hafeez Sheikh, Special Assistant on Information Lt Gen (retd) Asim Saleem Bajwa, Focal Person on COVID-19 Dr Faisal Sultan, Chairman NDMA Gen Muhammad Afzal and senior officials.\nThe prime minister expressed satisfaction over the availability of protective gear and Personal Protective Kits as per requirement in fighting coronavirus.\nAs the government took necessary measures to control the pandemic, he said the supportive role of public was equally important.\nHe urged upon the public representatives and leadership to remain vigilant with the help of local administration about the facilities at hospitals for COVID-19 patients.\nImran Khan said directions had been issued to provinces on ensuring a ‘smart lockdown’ and maintaining a balance in protective measures and economic activities during next few difficult weeks.\nThe meeting discussed measures to meet challenges of upcoming situation in view of availability of beds, oxygen cylinders, ventilators and facilities for the coronavirus patients.\nIt was informed that at present, 107 corona testing laboratories were operational across the country with 25,000 tests carried out on daily basis.\nCurrently, 4,800 ventilators are available, while 1,600 will be added soon. N-95 masks and ventilators are being locally manufactured. By July, the hospitals of all provinces will be supplied with 2,000 additional beds for COVID-19 wards.\nThe meeting was informed that 20 big cities were pin-pointed as hotspots of coronavirus, needing special arrangements by the provincial and district administration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:20:41.514Z"
}
