{
  "title": "FM says not a rejoice moment as ‘violator of UNSC resolutions’ India becomes its member",
  "link": "https://www.app.com.pk/national/fm-says-not-a-rejoice-moment-as-violator-of-unsc-resolutions-india-becomes-its-member/",
  "date_published": "2020-06-15T03:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):Foreign Minister Shah Mehmood Qureshi on Monday said India becoming the non-permanent member of United Nations Security Council (UNSC) was ‘not a moment of rejoice, but concern’ as the country blatantly rejected resolutions of the prestigious forum, particularly on Kashmir.\nTalking to reporters here, the Foreign Minister said India had been ignoring the resolutions of UNSC on Kashmir for a long, giving way to an unending oppression on Kashmiris by denying their right to self-determination.\n“Heavens will not fall if India becomes a UNSC member,” he said, adding that Pakistan had also served at the same position previously for seven times.\nQureshi said Pakistan was making efforts for its membership at UNSC and had already initiated the process.\nHe said Pakistan always remained ready to comply with the UNSC resolutions and recalled writing letters to the UNSC Secretary General updating him of the brutalities going on in Indian Occupied Jammu and Kashmir.\nHe also mentioned sending letters to Organization of Islamic Cooperation (OIC) highlighting atrocities of Indian occupational forces against innocent Kashmiris.\nHe pointed out that the people of Kashmir did not accept India’s August 5th illegal annexation of the Valley as the government continued its illegal search operations even during the COVID-19 pandemic situation.\nAlso the controversial Citizenship Amendment Act has targetted the minorities, particularly the Muslims, he added.\nThe Foreign Minister asked India to have guts to allow him an open debate in Occupied Kashmir and see itself the clear picture of Kashmiris’ support to Pakistan.\nQureshi said majority of India’s neighbouring countries including Pakistan, China, Nepal, Bangladesh and Sri Lanka were not safe from its nefarious and hegemonic designs.\nHe mentioned that India locked horns with China on Laddakh, named Begalis as termites and meted a negative treatment to Sri Lanka and Nepal.\n“India has made dysfunctional the platform of SAARC (South Asian Association for Regional Cooperation) and also upset the entire neigbourhood with its inept attitude,” he said.\nThe Foreign Minister said India’s belligerence had put the regional stability and peace at stake.",
  "retrievedAt": "2025-08-11T19:20:39.308Z"
}
