{
  "title": "Considerable allocation made in PSDP 2020-2021 for CPEC road projects",
  "link": "https://www.app.com.pk/national/considerable-allocation-made-in-psdp-2020-2021-for-cpec-road-projects/",
  "date_published": "2020-06-15T01:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):The government has been attaching topmost priority to early completion of National Highway Authority’s road infrastructure projects related of China Pakistan Economic Corridor (CPEC).\nIn the Public Sector Development Programme (PSDP) 2020-2021,\nRs 10,000 million have been allocated for the new scheme for dualization of\nZhob-Kuchlak (Quetta) Road which would form an important part of\nWestern Corridor of the CPEC.\nThe project has been completed in five packages including 65 km Zhob-Tangi package, 65 km Tangi-Qila Saifullah package, 50 km Qila Saifullah-Nasai package, 65 km Nasai-Khanozai package and 53 km Khanozai-Kuchlak ( Quetta) package.\nAn amount of Rs 20,000 million have been earmarked for construction of Motorway from Burhan- Hakla on M-I to Dera Ismail Khan which would form part of CPEC.\nThe project has been divided into five packages and expected to be accomplished by year end.\nA total of Rs 2500 million have been earmarked for Construction of KKH\nPhase-II, 118 km Havelian-Thakot section of China Pakistan Economic\nCorridor (CPEC) which included Rs 2000 million foreign aid whereas\nRs 500 million would be local component.\nFor land acquisition and resettlement for KKH (Phase-I),\nHavelian-Thakot section, Rs 250 million have been earmarked. For land\nacquisition of CPEC projects, Lahore-Abdul Hakeem Motorway, Multan-Sukkur\nMotorway and Sukkur-Hyderabad Motorway, Rs 1500 million have been\nallocated for the upcoming fiscal year 2020-21.\nRs 350 million have been specified for improvement and widening of\nChitral-Booni-Mastuj-Shandur Road, also part of CPEC and for\nNokundi-Mashkhel road deposit work, Rs 1000 million have been allotted.\nFor construction of 392 km Sukkur-Multan Section a total of Rs 2500million have been allocated out of which Rs 2000 million is foreign aid.",
  "retrievedAt": "2025-08-11T19:20:44.946Z"
}
