{
  "title": "Passing out parade of PCG recruits held",
  "link": "https://www.app.com.pk/national/passing-out-parade-of-pcg-recruits-held/",
  "date_published": "2024-08-09T09:10:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 09 (APP): A passing out parade of Batch 44 recruits of Pakistan Coast Guards (PCG) was held here at the Coast Guards Training Center Korangi on Friday. Director General Pakistan Coast Guards Brigadier Ghulam Abbas was the chief guest at the ceremony.\nThe officers of civil and armed forces, local dignitaries and people from different walks of life and families of passed out recruits attended the ceremony in large numbers.\nAccording to press release issued by the PCG’s media wing, recruit Babar Ali stood first position and was awarded with honorary trophy by the Director General PCG, while Recruit Ishaq and Muhammad Nadeem received medals on securing second and third position respectively.\nAddressing the ceremony, Director General PCG Brigadier Ghulam Abbas extended felicitations to the passed out recruits and said PCG is considered as an important and prestigious force of the country which is simultaneously deployed on sea and land and is performing duties in the two provinces of Sindh and Balochistan which makes it different from other Civil Armed Forces (CAFs).\nPakistan Coast Guards always performed very well against anti-national elements, especially drug and human traffickers, Brigadier Ghulam Abbas said and added that during the last one year, a large quantity of narcotics worth $ 236 million in the international market was seized besides confiscating illegal goods of over Rs 1475 million.\nHe said that the Coast Guards also deposited an amount of approximately Rs. 1156 million in the government treasury through various ways and also proved accused involved in the crimes as convicted criminals. He informed that PCG also arrested 1663 illegal immigrants from Jewani coastal belt.\nLater, Brigadier Ghulam Abbas received guard of honour from newly passed out recruits.",
  "retrievedAt": "2025-08-11T04:31:22.746Z"
}
