{
  "title": "Opposition Leader, members welcome Imam Masjid-e-Nabawi with great homage, warm regards",
  "link": "https://www.app.com.pk/national/opposition-leader-members-welcome-imam-masjid-e-nabawi-with-great-homage-warm-regards/",
  "date_published": "2024-08-09T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 09 (APP): Leader of the Opposition, Omar Ayub Khan on Friday along with members of the National Assembly accorded a warm welcome to Imam Masjid-e-Nabawi (PBUH) Sheikh Dr Salah Bin Muhammad Al-Budair by paying great tributes and homage to the dignitary.\nTaking floor at opening of fifth meeting of eighth session of the National Assembly at the Parliament House, the Opposition Leader said the chief guest, Imam Masjid-e-Nabawi (PBUH) had the unique honour of being the Imam as he led the prayers at the most revered mosque of the Muslim Ummah.\nOmar Ayub Khan said that the honour and position that Imam enjoyed, was the ultimate desire of every Muslim and it had been bestowed upon those who had been blessed with special blessings of Almighty Allah.\nHe paid tribute to the Saudi government and the Imam for the great tradition of up-to-mark hospitality at the Masjid-e-Nabawi. He also appreciated the services of the Saudi Ambassador for promoting bilateral relations between brotherly countries of Kingdom of Saudi Arabia and Pakistan.\nThe Opposition Leader thanked the Speaker for issuing the production orders of PTI MNA Haji Chaudhary Imtiaz.\nHe also lauded Athlete Arshad Nadeem for his superb achievement and demanded the government to ensure a grand welcome of the national hero. “He is a icon for the youth and his life highlights the sheer struggle for achieving ones goals in life.”\nMember National Assembly (MNA), President Jamiaat Ulema Islam-Fazl (JUI-F), Maulana Fazl ur Rehman welcomed the chief guest and Saudi dignitaries in Arabic language.\nHe said that this House had certain traditions on the arrival of foreign dignitaries like it hosted Palestinian Leader, Yasir Arafat during Late prime minister Benazir Bhutto, Turkish President, Recep Tayyeb Erdogan who had addressed the House. He recalled that the Imam Haram e Makki had also visited the National Assembly during the renure of of Prime Minister Yousaf Raza Gillani.\nMaulana Fazl also appreciated athlete Arshad Nadeem on winning the gold medal in the Paris Olympics Javelin throw competition final.\nMNA, Syed Mustafa Kamal of Muttahida Qaumi Movement-Pakistan (MQM-P) welcomed the chief guest Imam Masjid-e-Nabawi (PBUH) and the Saudi Ambassador alongwith the delegation.\n“The Imam has a great dignity and honour which is an envious status for a Muslim. The prayer mat of the Holy Prophet (PBUH) is only bestowed upon those who were the luckiest and chosen one. We thank him for visiting Pakistan and request him to pray for this nation,” he said.\nKamal also lauded the services of Saudi Ambassador Nawaf Bin Saeed Al Malaki for supporting Pakistan at crucial junctures and for being the ambassador of Pakistan in KSA.\n“The Hajj arrangements and enhanced facilities deserve great admiration as every Pakistani Haji appreciated it,” he added.\nHe also congratulated Athlete Arshad Nadeem and said the nation must strive for improving sports federation to produce more talented athletes and sportspersons.\nChairman, Pashtunkhwa Mili Awami Party, MNA, Mehmood Khan Achakzai welcomed the chief guest and Saudi delegation on their second home.\nHe congratulated Saudi Crown Prince Muhammad Bin Salman for achieving Iran-KSA rapprochement as it was latter’s great favour for the Muslim ummah.\n“Islam means to surrender before the Will of Allah” and questioned if we were following the right path. “We lack the unity that has been ordained in the verses of Holy Quran”.\nHe questioned why Muslim nations had not unanimously condemned Israeli Israeli PM Netanyahu. He also asked Muslim nations to approach the International Court of Justice for the trial of Netanyahu.\nThe Speaker National Assembly also welcomed the 200 interns and 70 young citizens witnessing the Assembly proceedings in the House.",
  "retrievedAt": "2025-08-11T04:31:01.083Z"
}
