{
  "title": "Dar emphasizes importance of economic diplomacy for Pakistan’s growth",
  "link": "https://www.app.com.pk/national/dar-emphasizes-importance-of-economic-diplomacy-for-pakistans-growth/",
  "date_published": "2024-08-09T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP):Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Friday stressed the need to reorient the country’s diplomatic initiatives from conventional diplomacy to economic diplomacy to ensure that Pakistan’s development agenda was also advanced.\n“The conventional diplomatic times are over. Along with the conventional diplomacy, we will have to focus more on economic diplomacy,” the Deputy PM said while addressing the passing ceremony of the 43rd passing out specialized diplomatic course here at the Foreign Services Academy.\nHe said the basic purpose of foreign diplomacy was not only to safeguard national interests but also to help in stimulating economic growth by transforming the potential of the country’s geo-strategic position into a geo-economic one.\nDeputy PM Dar said Pakistan was at the cross road and at a very important location in the world. However, he said unfortunately “we failed to streamline and benefit from our location which the Almighty has blessed us”. He emphasized the need for young diplomats to be equipped with the necessary skill set to promote trade and investment, tourism and opportunities to explore the workforce.\n“Today’s diplomats should not only be experts in international law and politics alone but also economic diplomacy”, he remarked.\nHe also asked the young diplomats to work hard in their careers for the development of the country saying that to compete with the world, they should no longer engage in luxuries. “I am confident you will take this country forward on the road of prosperity, peace and stability,” he said.\nHe also assured his full support to upgrade the infrastructure and improve the academy’s working.\nThe deputy prime minister pointed out that Pakistan had great potential in terms of workforce, resources and economy.\nHe recalled that Pakistan in 2013, was declared a globally macroeconomic unstable country, a country that was on the verge of default. “It was projected that Pakistan will take at least a decade plus to come out of the quagmire it was facing by 2013”, he said.\nHowever, he said what happened in the next 3-4 years reflected the resilience of the country, its economy and its people. In three and half years, he said Pakistan reached a level where it was recognized as the 24th biggest global economy.\n“Pakistan’s economic indicators were the best, and probably still not matched in any era,” he said adding that the country witnessed the lowest CPI inflation at 3.6% food inflation at 2%, over 6% economic growth, the best stock market in South Asia and 6th best in the world.\nBut unfortunately, he said, “our leg pulling and political instability took Pakistan in next four years to 47th global economy”.\nThe Deputy PM hoped that Pakistan, with nuclear power, a great strategic location and huge natural resources worth over $10,000 billion would one day lead the Muslim Ummah.\n“Pakistan has been blessed with tested, proven and certified mineral, granite and stones’ reserves worth $10,000 billion,” he added.\nThe Deputy PM also commended the efforts of the Foreign Service Academy for maintaining excellence in its training modules and the training of a large number of foreign diplomats over the years.\nDirector General of the Foreign Service Academy, Ambassador Ahmed Hussain Dayo underlined the commitment of the Academy to continue to maintain excellence in the training of diplomats and its pride in training 1,554 foreign participants representing 120 countries.\nLater, Ishaq Dar distributed certificates among the participants of the 43rd Specialized Diplomatic Course (SDC) and awarded medals to the top three performers of the 42nd SDC.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:31:26.699Z"
}
