{
  "title": "NA unanimously adopts resolution to pay tribute to Olympic gold medalist Arshad Nadeem",
  "link": "https://www.app.com.pk/national/na-unanimously-adopts-resolution-to-pay-tribute-to-olympic-gold-medalist-arshad-nadeem/",
  "date_published": "2024-08-09T14:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP): The National Assembly on Friday unanimously adopted the resolution to pay tribute to world record holder javelin throw athlete Arshad Nadeem for winning a gold medal at the Paris Olympics 2024 with highest ever 92.97 meters long throw.\nMinister for Law and Justice and Parliamentary Affairs, Senator Azam Nazeer Tarar tabled the resolution with his welcoming remarks for Imam Masjid e Nabawi (PBUH), Sheikh Dr Salah Bin Muhammad Al-Budair and said that it was a blessed day for the nation with the eminent presence of the Imam.\nTarar while paying tribute to the gold medalist Athlete said that Arshad Nadeem had set an Olympic world record by throwing the highest ever javelin throw. “All parliamentary leaders have demanded that the House should pass a resolution to pay tribute to Arshad Nadeem,” he added.\nThe Resolution said: “This House felicitates the son of the soil Arshad Nadeem for hoisting Pakistan’s flag in Paris Olympics 2024 and securing a gold medal for the nation after four decades.\nThis House reminds that Arshad Nadeem, the 27-year old youngster, from a humble background, with his continuous struggle, insurmountable resolve and dedication affirmed that hardships cannot stop hinder the path of the daughters and sons of the nation from glory.\nThe House also acclaims the achievements of Arshad Nadeem in Commonwealth Games, Islamic Solidarity Games and SAARC Games, where he also secured gold medals.\nThis House urges the government to confer Civil Award upon Arshad Nadeem and also extend all out facilities for the youth in sports.”\nLater, the National Assembly session was prorogued.",
  "retrievedAt": "2025-08-11T04:30:55.400Z"
}
