{
  "title": "Fall in love-Pakistan’ campaign launched in London to boost inbound tourism",
  "link": "https://www.app.com.pk/national/fall-in-love-pakistan-campaign-launched-in-london-to-boost-inbound-tourism/",
  "date_published": "2020-09-11T03:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): A private tourism company Friday launched ‘Fall in love-Pakistan’ campaign at the Central London to boost inbound tourism in the country by luring foreign tourists through projection of stunning sceneries, cultural heritage and historic sites on billboards.\nUnder the digital campaign, the Fascinating Pakistan (a tourism company) had put the pictures of country’s tourism gems on 40 billboards across the Central London to sensitize the Londoners about the beauty of Pakistan, its Director Operations Pakistan Syed Samar Abbas said on Friday.\nTalking to APP, he said a comprehensive plan was in place to carry forward the drive and make it a success story.\nMultiple initiatives, including road-shows, tourism portals and a quarterly magazine were on the cards to attract the British folks by giving them virtual experience of Pakistan’s tourist attractions.\n“The campaign is first of its kind, by promoting Pakistan tourism as a holistic … encompassing multiple features – religious, leisure, adventure and others,” Samar Abbas explained.\nHe said the private sector had ought to play a lead role in promoting tourism locally and internationally. “It’s a stark reality that there is no progress until the private sector played a proactive role,” he added.\n“Pakistan is a peaceful and friendly nation, and a country offering something for everyone. From the wonders and beauty of the Himalayas regions in the North to the historic Sindh in the South and the lovely beaches of Balochistan, Pakistan is truly the heaven on earth,” he remarked.\nSamar Abbas said the many fascinating cultures, scenic beauty, the art and craft as well delicious Pakistani cuisines and bazaars had something for everyone.\nFascinating Pakistan is a first tourism related media company, which was set up with the objective to promote Pakistan’s tourism sector along with arts and crafts, cuisines and lifestyle of its people across the globe.",
  "retrievedAt": "2025-08-11T19:47:45.383Z"
}
