{
  "article_id": "2025-01-20_0a6784d158d50945b446540532a81067",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pims-successfully-running-evening-opds-service/",
    "retrieved_at": "2025-08-27T11:50:33.346Z"
  },
  "metadata": {
    "title": "PIMS successfully running evening OPDs’ service",
    "author": null,
    "date_published": "2025-01-20T15:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 292,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 20 (APP):Pakistan Institute of Medical Sciences (PIMS) has continued providing best medical services to incoming patients at its Out-Patient Departments' (OPDs) evening shift. According to Dr. Mubashir Mushtaq Daha, Spokesperson to Executive Director PIMS, the OPD evening hour was started on the special instructions of Prime Minister Muhammad Shehbaz Sharif to ensure medical facility to maximum patients. He said that more than 50,000 patients have been treated in the last few months. Thousands of patients are being provided medical facilities every day in the evening hours. Last year, Prime Minister Muhammad Shehbaz Sharif had directed the Prime Minister's Coordinator for Health, Dr. Malik Mukhtar Ahmed Barth to start the OPD at PIMS in the evening hours to provide the best medical facilities to the citizens of Islamabad. He added with the efforts of Executive Director PIMS, Professor Dr. Imran Sikandar, the OPD in the evening hours was started in April last year, during which a total of 55,377 patients have been treated till now. He said that a total of 859,000 patients got benefit from OPD in the morning hours since April last year while 500,000 patients visited the hospital's emergency since April last year for emergency treatment. Since the start of evening OPD services, medical facilities were provided to 3,309 patients in April last year and 7,234 in May. Similarly, 6,394 patients were treated in June, 7,074 in July, 9,943 in August, 8,594 in September, 7,740 in October, 5,193 in November, and 5,700 patients in December. He said that Executive Director of PIMS, Dr. Imran Sikandar has issued special instructions to every department of the hospital to fully satisfy every patient. He added the hospital administration and doctors are always ready to provide quality medical facilities to the patients.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}