{
  "article_id": "2025-01-20_f60637ce31ffede4433c2e94888fa24b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/operationalisation-of-gwadar-airport-a-milestone-to-strengthen-regional-connectivity-pm/",
    "retrieved_at": "2025-08-27T11:50:43.667Z"
  },
  "metadata": {
    "title": "Operationalisation of Gwadar Airport a milestone to strengthen regional connectivity: PM",
    "author": null,
    "date_published": "2025-01-20T09:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 20 (APP): Prime Minister Shehbaz Sharif on Monday calling it an example of Pakistan-China friendship, said that the operationalization of Gwadar International Airport was a great step forward to strengthen connectivity within Pakistan as well as the entire region. The prime minister, in a statement, expressed satisfaction as a Pakistan International Airlines (PIA) flight landed at the Gwadar Airport, making it the first commercial aircraft to arrive at the facility. He said that with the inauguration of Gwadar Airport, another milestone has been achieved to link Gwadar with Central Asia and East Asia besides providing linkage between the Middle East and Gulf states. The prime minister said that the opening of Gwadar International Airport would realise the dream of development of Pakistan and the region through the China-Pakistan Economic Corridor (CPEC). \"Today, we have come closer to fulfilling the joint commitment of the Chinese President Xi Jinping and Mian Muhammad Nawaz Sharif for the development of Pakistan and the region through the CPEC. By the grace of Allah, CPEC started during the tenure of Nawaz Sharif and is now achieving important milestones under his leadership,\" he remarked. Prime Minister Shehbaz said that the entire nation was grateful to the Chinese leadership and the government as the country always played a key role in the development of Pakistan. He also lauded Defence Minister Khawaja Muhammad Asif, Balochistan Chief Minister Sarfaraz Bugti and his government, security personnel and military leadership for their tireless efforts to ensure the completion of the airport.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}