{
  "article_id": "2025-01-20_d270a1ec8216f950cd0524adb739f39e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/61-of-ssgpl-gas-stolen-in-balochistan-dr-musadik-malik/",
    "retrieved_at": "2025-08-27T11:49:47.848Z"
  },
  "metadata": {
    "title": "61% of SSGPL gas stolen in Balochistan: Dr Musadik Malik",
    "author": null,
    "date_published": "2025-01-20T17:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 217,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 20 (APP):Minister for Petroleum Dr Musadik Malik on Monday revealed that 61% of the Sui gas supplied by Sui Southern Gas Pipelines Limited (SSGPL) in Balochistan is stolen, while only 39% of the bills are being paid in the province. Responding to Senators' motions regarding low gas pressure in Balochistan, during Senate proceedings, he said approximately 8% of gas is lost due to leakages, while a staggering 70% of gas meters are tampered with in Balochistan. Furthermore, 66-70% of consumers receive subsidies, whereas only 30% of the population pays the full price for gas across the country. Pakistan's gas reserves are depleting at a rate of 8-9% annually. To bridge the gap, the government is forced to import expensive Liquified Natural Gas (LNG), which is unaffordable for domestic consumers due to high costs. The government has increased gas supply to Balochistan by10 million cubic feet daily. The province's gas demand varies greatly between seasons, from 90 million cubic feet in summer to over 200 million cubic feet in winter. To meet this winter demand, the government prioritizes domestic consumers by reducing supply to industrial consumers.Notably, the Balochistan High Court has capped consumer bills at Rs5,400 per month, regardless of usage. Furthermore, no new gas connections have been issued to users in the last four years.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}