{
  "article_id": "2025-01-20_2a77dc629097b927290079900d93f1dd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/5-day-training-workshop-on-translation-as-a-science-begins-at-aiou/",
    "retrieved_at": "2025-08-27T11:51:02.422Z"
  },
  "metadata": {
    "title": "5-Day training workshop on “Translation as a Science” begins at AIOU",
    "author": null,
    "date_published": "2025-01-20T12:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 354,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 20 (APP):The inaugural ceremony of a five-day training workshop on the theme \"Translation as a Science\" was held on Monday at Allama Iqbal Open University (AIOU). Participants from 12 different languages are receiving training in translation during this workshop. The event has been organized by the university's Center for English Language and Translation Studies in collaboration with the Forum for Language Initiatives. The Executive Director of the Forum for Language Initiatives, Fakhruddin Akhunzada, was the guest of honor, while the event was presided over by the Dean of the Faculty of Arabic and Islamic Studies, Prof. Dr. Shah Mohyuddin Hashmi. In his message, Vice Chancellor Prof. Dr. Nasir Mahmood stated that languages are the most effective tool for preserving and promoting the cultural heritage of any nation. He emphasized that the desire to keep languages alive cannot be fulfilled without understanding their importance. He further noted that Allama Iqbal Open University has established the Center for English Language and Translation Studies to promote languages, and its services are commendable. Other speakers highlighted the need to learn translation skills to nurture Pakistani traditions and culture. They praised the efforts of Allama Iqbal Open University and the Forum for Language Initiatives in this regard. The speakers pointed out that translation plays a central role in the rise and fall of civilizations, as it allows one nation to gain insight into the literary and intellectual wealth of another. They added that translation not only enriches human knowledge at the linguistic level but also contributes to broadening intellectual horizons. Therefore, acquiring translation skills is essential for the advancement of knowledge. The Director of the Center for English Language and Translation Studies, Dr. Ghulam Ali, hosted the event, while Lubna Umar performed the duties of stage secretary. The ceremony was attended by the university's deans, registrar Raja Umar Yunus, principal officers, and faculty members. Dr. Ghulam Ali outlined the objectives of the workshop and elaborated on the department's contributions to the promotion of languages. He assured that, under the guidance of Vice Chancellor Prof. Dr. Nasir Mahmood, efforts for the preservation and promotion of languages would continue.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}