{
  "article_id": "2025-01-20_755480e517f11292d50d5fd00a94c8fd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-for-construction-of-modern-hotels-other-facilities-to-promote-tourism/",
    "retrieved_at": "2025-08-27T11:50:41.579Z"
  },
  "metadata": {
    "title": "PM directs for construction of modern hotels, other facilities to promote tourism",
    "author": null,
    "date_published": "2025-01-20T10:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 230,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 20 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed the relevant authorities to prepare a comprehensive report for the construction of new modern hotels and other facilities through joint ventures and public-private partnerships to promote tourism in the country. \"With the availability of modern facilities, tourism will be promoted across the country\", the prime minister said while chairing a meeting regarding Capital Development Authority (CDA) affairs here. The prime minister appreciated the performance of CDA for successfully organizing the recent international conferences and other events in the federal capital. \"The initiation of international conferences in Pakistan is the certificate of our success on the diplomatic front,\" he said adding that the confidence of the friendly countries had been restored due to the continued efforts of the incumbent government. The prime minister emphasized the need to further improve hotels, hospitals, and other facilities to host international-level conferences and events in the country. He directed to ensure provision of the international standard facilities for guests coming from friendly countries. He also instructed the CDA to further improve facilities for the residents of the federal capital. The meeting was informed that the pre-feasibility reports regarding the construction of new hotels and the revival of non-operational government buildings in Islamabad had been prepared. The meeting was attended by Minister for Economic Affairs Ahad Khan Cheema, Chairman CDA and other top officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}