{
  "article_id": "2025-01-20_ebe201cc763fe2d64e4f167e8093c6cd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-swift-repair-work-of-damaged-protective-fences-on-motorways-in-one-month/",
    "retrieved_at": "2025-08-27T11:50:17.570Z"
  },
  "metadata": {
    "title": "PM directs swift repair work of damaged protective fences on motorways in one month",
    "author": null,
    "date_published": "2025-01-20T14:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 423,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 20 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed the National Highway Authority (NHA) to ensure swift repair work of all damaged protective fences on motorways in one month and initiate stringent action against those stealing or damaging the fence. The prime minister chaired separate review meetings on issues pertaining to the NHA and safety measures on the national highways and motorways, a Prime Minister's Office news release said. Prime Minister Shehbaz Sharif on the occasion emphasized that the national highways and motorways were the backbone of national development and the country's economy. He said that providing the best travel facilities across the country was one of the top priorities of the government. The prime minister directed to form a steering committee to review the work related to construction of Sukkur-Hyderabad Motorway, construction of remaining parts of Ratodero-Gwadar Motorway and Hyderabad-Karachi Motorway, Karachi-Quetta-Chaman National Highway, and reconstruction of some parts of Karakoram Highway. He also directed that the development work should be done on these important national projects on a speedy and priority basis. The meeting was briefed regarding the ongoing development works on national highways and motorways. The meeting was told that in the first phase of Lahore-Sahiwal-Bahawalnagar Motorway was in progress and the land was being acquired from Lahore Ring Road to Raiwind-Kasur Road. However, many districts of South East Punjab would be able to benefit from this motorway, the forum was briefed. In a another meeting related to safety arrangements on national highways and highways, the prime minister directed to complete the repair work of all safety fences on the highways within a month. The prime minister also directed to improve policing and patrolling on national highways and motorways. The meeting was briefed on measures to prevent theft of protective fence installed on motorways. The meeting was informed that there were 4,027 kilometers of protective fence installed on the motorways across the country, out of which 859 kilometers of protective fence were either stolen or damaged, due to which 36 accidents were reported and 178 first information reports (FIRs) were registered in the last four years in this regard. The meeting was further informed that legislation was being made regarding the declaration of motorways as a strategic asset, after which strict action would be taken against those who damage the motorways as per the law. Deputy Prime Minister and Foreign Minister Ishaq Dar, Federal Minister for Economic Affairs Ahad Khan Cheema, Federal Minister for Communications Abdul Aleem Khan and relevant senior government officials participated in the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}