{
  "title": "HEC announces national top talent foreign scholarships programme for Pak students",
  "link": "https://www.app.com.pk/national/hec-announces-national-top-talent-foreign-scholarships-programme-for-pak-students/",
  "date_published": "2022-12-23T08:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):The Higher Education Commission (HEC) has announced 75 National Top Talent Scholarships Programme for Pakistani students to take admission to MS and PhD studies abroad.\nAccording to official sources, on the auspicious occasion of National Celebrations of 75th Independence Anniversary of Pakistan, the Government of Pakistan announced 40 PhD and 35 MS scholarships for Pakistani and Azad Kashmir nationals to study in the world’s 25 top-ranked universities (QS or Times Higher Education (THE) Rankings only).\nThe sources informed that the scholarships will be awarded on the provision of proof of confirmed admission in desired universities and selected subjects only.\nMeanwhile, as per eligibility criteria, the applicant must be a Pakistani/Azad Kashmir national.\nThe candidates must have a confirmed/unconditional admission/enrolment in any of the world’s 25 top-ranked universities (QS/THE) in selected subjects. They must have a minimum qualification for MS Scholarships: BS/BE/Master’s or equivalent to 16 years of education in relevant fields of study, while for PhD Scholarships: MS/MPhil/ME or equivalent to 18 years of education in relevant fields of study.\nMaximum one 2nd Division throughout the academic career prior to the final degree, it added.\nThe candidates must have a minimum CGPA of 3.0 out of 4.0 & 3.75 out of 5.0 in the semester system or 1 Division (in the annual system) in the terminal degree.\nThe maximum age on the closing date should be 40 years for full-time regular faculty members of public sector universities/degree awarding institutions/colleges and employees of public sector organisations while 35 years for all others.\nThe candidates must not be availing any other scholarship.\nThe applicants are required to submit an online application via HEC e-portal, i.e ., https://eportal.hec.gov.pk.\nIt is worth mentioning here the scholarships will be awarded on a first-come-first-served basis.\nThe candidates are required to fulfil the requirement of the host university to secure admission which may include international GRE, TOEFL, etc. They are advised to appear in these tests.\nConditional admission/enrolment will not be considered.\nIn case any information is found misrepresented/ incorrect at any stage, the application process will be terminated.\nThe awardee will have to execute a bond with HEC to serve for a period of three years (for MS scholarship) and five years (for PhD scholarship) immediately after completion of his/her studies.\nThe candidates are advised to check all details of this scholarship programme before filling/submitting the online application form. Request for amendment will not be entertained after submission of online application.\nFor further details, please visit www.hec.gov.pk/site/idps75.\nHowever, the last date for receipt of applications is March 21, 2023.",
  "retrievedAt": "2025-08-11T16:03:29.490Z"
}
