{
  "title": "Pakistan Army to consolidate hard earned peace ensured by nation, LEAs’ sacrifices: COAS",
  "link": "https://www.app.com.pk/national/pakistan-army-to-consolidate-hard-earned-peace-ensured-by-nation-leas-sacrifices-coas/",
  "date_published": "2022-12-23T18:10:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 23 (APP): Chief of Army Staff (COAS) General Syed Asim Munir on Friday said that Pakistan Army would consolidate the hard-earned peace, made possible by the supreme sacrifices of the resilient Pakistani nation and the law enforcement agencies (LEAs).\nThe army chief visited Miranshah – North Waziristan and Tarbela, and interacted with troops, an Inter-Services Public Relations’ (ISPR) news release said.\nAt Miranshah, the COAS laid a floral wreath at Martyrs’ Monument to pay homage to brave soldiers who laid lives while defending the motherland .\nThe army chief was briefed by field commanders on the latest security situation in the area and response mechanisms to thwart the terrorist threat.\nHe also visited the frontline troops deployed along Pakistan – Afghanistan Border. While interacting with officers and men, the COAS commended their professionalism, high morale and operational readiness.\nThe COAS said that Pakistan Army remained focused on evolving security situations and determined to take the battle to the terrorists and break nexus with their facilitators to ensure lasting peace through socioeconomic development.\nLater, COAS also visited HQ Special Services Group (SSG) Tarbela and met officers and men of SSG, including the elite Zarrar Company whose soldiers gallantly acted in recent Bannu CTD complex operation.\nThe COAS praised their indomitable spirit, sacrifices, and commitment to duty in various operations. He said, “SSG is the pride of Nation and it has proved it’s metal over the years.”\nEarlier on arrival, the COAS was received by Commander Peshawar Corps Lieutenant General Hassan Azhar Hayat.",
  "retrievedAt": "2025-08-11T16:03:20.277Z"
}
