{
  "title": "Somalia to learn from Pakistan’s experience of constitutional development",
  "link": "https://www.app.com.pk/national/somalia-to-learn-from-pakistans-experience-of-constitutional-development/",
  "date_published": "2022-12-23T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP): A delegation of ministers from Somalia is in the town to attend seminars, sessions, and visit various institutions to learn from Pakistan’s experience of constitutional development.\nUnited Nations Development Program UNDP-Pakistan and UNDP-Somalia have organized the first-ever Ministerial Study Tour on Federalism, Devolution and State-Building from December 20 to 27, 2022.\nThe Ministry of Interior, Federal Affairs and Reconciliation (MOIFAR) of Somalia is leading the tour of honorable ministers representing both Federal Government and Federal Member States including representatives of Banadir Regional Administration (BRA).\nHis Excellency, Mr. Ahmed Moallim Fiqi Federal Minister, Ministry of Interior, Federal Affairs and Reconciliation, Federal Republic of Somalia is the lead focal person of the study tour.\nThe technical sessions of the third day were about Understanding Somalia’s Constitutional Review Process: Issues and Options, Federalizing functional assignments: Case Study of Implementation Commission of 18th Amendment from Governance Perspective; and Constitution-Making in Post-Independence Pakistan (1947-73): A Recount of Power Struggles over Federal Design.\nAhmed Moallim Fiqi Federal Minister, Ministry of Interior, Federal Affairs and Reconciliation, Federal Republic of Somalia and Ms. Hoden Osman, advisor to the President of Somalia, spoke about the committees which are involved in the constitution review process.\nHoden shed light on pathways addressing the contentious issues such a justice system, natural resources, fiscal federalism, elections, and principles of the constitution such as subsidiarity and one nation desiring equalization.\nSomali delegates talked at length about problems associated with inclusive politics, and reasons why a review process of the constitution is taking place so that federal member states come together and ensure a peaceful state-building process.\nMohammad Ali Farah, who works with UNDP Somalia, alluded to the fact that political culture in Somalia is presidential while political institutions are parliamentary, and these realities have to be addressed, too.\nPakistani delegates talked at length about making the constitution review which tries to help solve the problems the nation is facing and does in a way that an inclusionary political outcome is possible.\nFormer Chairman Senate, Mian Raza advised the study tour delegates to work on creating one committee instead of three or four committees simultaneously dedicated to constitutional reforms process.\nHe further advised that Somalia should form two lists of powers spread across the constitution; one the federal and the other concurrent, and then iron out them in a way that solves the core contentious issues.\nMaryam S. Khan, Research Fellow at the Institute of Development and Economic Alternatives (IDEAS) in Pakistan, narrated the journey of Pakistan’s constitutional development during the last 75 years, and how dismemberment of Pakistan took place.\nAfter 1971, she said, the question of provincial autonomy emerged and political institutions were designed to address that question.\nIt tried to address the question of distribution of natural resources and established the Council of Common Interests along with Senate as equal representation body.",
  "retrievedAt": "2025-08-11T16:03:28.139Z"
}
