{
  "title": "IHC directs ECP to decide ICT UCs matter after hearing Federation",
  "link": "https://www.app.com.pk/national/ihc-directs-ecp-to-decide-ict-ucs-matter-after-hearing-federation/",
  "date_published": "2022-12-23T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP): The Islamabad High Court (IHC) on Friday set aside the decision of the Election Commission of Pakistan (ECP) regarding the rejection of Federal Government’s notification for an increase in the number of union councils.\nThe court also instructed the electoral body to decide the matter again after hearing the respondents by December 27.\nChief Justice Aamer Farooq heard identical petitions regarding the increase in the number of union councils and changes in the voter lists. Attorney General for Pakistan Ashtar Ausaf, Additional Attorney General Munawar Dogal, Advocate General Jahangir Jadoon, Director General Legal ECP, Ali Nawaz Awan and others appeared before the court.\nAt the outset of hearing, Jahangir Jadoon argued that the Interior Ministry had issued a notification on December 19, regarding the increase in the number of union councils but the ECP had rejected using its suo-moto powers. The ECP neither heard the Federation nor the Islamabad Metropolitan Corporation, he added.\nHe said the Federal Capital had been divided in 125 union councils, and it was the ECP’s responsibility to conduct delimitation.\nThe chief justice remarked that an increase in the number would reduce the size of union councils, and asked whether it would not affect the local area. Advocate General Islamabad said the delimitation of UCs would be done by the ECP on the basis of population and it would not affect local area.\nAGP Ashtar Ausaf adopted the stance that the ECP was bound to conduct delimitation after the increase in the number of UCs and voters lists would also be changed accordingly.\nThe additional attorney general informed the court that the local government bill had been approved by the National Assembly and it would now be presented in the Senate. Under the new law, mayor and deputy mayors would be elected directly, he added.\nHe asked whether the ECP had the authority to disobey the notification of the Federal Government.\nThe chief justice remarked that the ECP was of the view that the number of UCs was increased after the local government elections schedule was announced and that the next elections could be conducted as per the new UCs.\nTo a query related to the changes in voter lists, the DG Legal ECP said the process in that regard had been done. He also produced the record related to the amendments in voter lists.\nThe petitioners lawyer adopted the stance that the voters of Golra UC had been shifted to Rawat UC, and same complaints were found in other UCs as well. The ECP had stated that corrections in the voters’ lists could not be made after the announcement of election schedule, he added.\nHe said the voters could not be deprived of their right to vote. The election would not be free and fair if it were conducted with a lot of mistakes in the voters’ lists, he added.\nThe ECP DG said the complainants were lodged too late, which should have been made at the time of preparation of voters’ lists. The LG polls should be held on time, he added.\nThe chief justice remarked that all political parties during their stint in power did not show interest in holding LG elections. The polls should have been conducted when the tenure of the last LG bodies was completed in 2020.\nThe problems of the Federal Capital could be addressed when a New Dehli model parliament would be introduced here, he added.\nThe court reserved the verdict after listening to arguments from the lawyers and later instructed the ECP to decide the notification matter after hearing the Federation.",
  "retrievedAt": "2025-08-11T16:03:20.292Z"
}
