{
  "title": "Pakistan reaffirms commitment, support to UN peacekeeping programme: Hina",
  "link": "https://www.app.com.pk/national/pakistan-reaffirms-commitment-support-to-un-peacekeeping-programme-hina/",
  "date_published": "2023-05-30T17:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Minister of State for Foreign Affairs Hina Rabbani Khar on Tuesday reaffirmed Pakistan’s strong commitment and support to the United Nations peacekeeping and peace-building programme.\n“Pakistan firmly believes in peace, stability, development, and human rights which are interlinked with each other, ” she said while addressing an event in connection with the the UN Peacekeepers Day here.\nThe event was held at the Ministry of Foreign Affairs here in collaboration with the United Nations, to celebrate 75 years of United Nations peacekeeping, paying homage to the more than 200,000 Pakistani service women and men who have served in 46 UN Missions since 1960 – including 171 who lost their lives.\nPakistan is among the largest troop contributing countries to UN peacekeeping with nearly 4,334 military and police personnel currently serving in nine locations around the world.\nHina said Pakistan valued the sacrifices rendered by the United Nations’ peacekeepers from across the world, especially from Pakistan.\nPaying tributes to the peacekeepers, especially those who sacrificed their lives, she said around 170 Pakistani peacekeepers and eight alone in 2022 had sacrificed their lives for global peace and to uphold the Blue Flag.\nThe minister maintained that Pakistan’s security forces were playing a vital role in the peacekeeping missions under the United Nations to maintain peace in the world’s conflict areas.\nShe also appreciated the Pakistani women who were playing their key role in every field of life They had also served the UN peacekeeping programme as psychologists, operational officers, and nurses, she added.\nHina Rabbani Khar said Pakistan had firm faith in the United Nations’ capability of maintaining peace and it also believed that the role being played by the UN in building peace, ensuring security and development across the world could not be done by any other institution.\nShe said over 4,300 Pakistani peacekeepers, including female officers, were currently serving with distinction under the UN flag.\n“Today we are celebrating the more than 80,000 brave peacekeepers — women and men — who are carrying out the extremely important task of creating peace around the world. We also thank Pakistan, the fifth largest contributor to peacekeeping globally,” said Knut Ostby, UNDP Representative in Pakistan, who spoke on behalf of the United Nations. “The UN was created to work on three pillars that are interlinked: peace, development and human rights. We see peace as an understanding between people, a desire to work together to bring the world forward,” he added.\nAdditional Secretary United Nations Pakistan Syed Haider Shah said not only military personnel were serving in the UN missions but the civilian experts, psychologists, doctors, nurses and others were also deployed to ensure long term and sustainable peace and development.\nMilitary Observer at the UN peacekeeping missions, Lt. Col. Jehangir Server and military logistic officer Major Saman Naeem, on the occasion shared their personal experiences during their stay at the missions and said the Pakistani personnel were actively engaged in building peace, improving living standards of the local and providing humanitarian assistance to the locals.\nThe Minister of State for Foreign Affairs opened an exhibition of photographs featuring Pakistani peacekeepers and Pakistan’s work at the United Nations in presence of representatives from the Government, Foreign Embassies, UN agencies and development partners.",
  "retrievedAt": "2025-08-11T08:35:07.736Z"
}
