{
  "title": "Islam teachings real solution for societal issues: Rana Tanveer",
  "link": "https://www.app.com.pk/national/islam-teachings-real-solution-for-societal-issues-rana-tanveer/",
  "date_published": "2023-05-30T16:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Federal Minister for Education and Professional Training, Rana Tanveer Hussain on Tuesday said that following the true teachings of Islam was the only way to solve the societal issues.\nHe was addressing the concluding ceremony of the 38th Human Resource Development Program for the Officers of Armed Forces of Pakistan organized by Da’wah Academy of International Islamic University (IIU).\nRana Tanveer Hussain, appreciated the International Islamic University Islamabad’s Da’wah Academy for conducting such courses for understanding the true spirit of our religion specially designed for professionals in various institutions.Such programs must be conducted in the entire country so that we can spread the message of Islam in the true spirit, he added.\nThe minister highlighted that such training and programs were in dire need of time to disseminate peace in society as few elements are trying to disseminate hate and violence in the society.\nRana Tanveer Hussain said that Muslim Ummah was working on Islamophobia with unity and in Pakistan it was our prime responsibility to remain united.\nAddressing the concluding ceremony Dr. Hathal Hamoud Alotaibi, President, International Islamic University Islamabad (IIUI) said that the role of educational institutions and universities is character building of youth while seeking solutions to problems was significant during training.\nDr. Hathal emphasized the importance of knowledge in personal development and lauded Da’wah Academy’s role in consistently organizing essential courses for human resource development and Islamic orientation.\nOn this occasion, President IIU said that the Forces of Pakistan are one of the best across the globe and their roles were exemplary.\nDr. Hathal stressed launching of online training programs for spreading the message of Islam through such training courses.\nHe encouraged the participants to utilize this opportunity to expand their knowledge, considering it as a key to unlocking new doors of enlightenment.\nDirector General of Da’wah Academy, Prof. Dr. Muhammad Ilyas briefed about the historic background of Da’wah Academy and its training programs.\nDr Ilyas vowed that Da’wah Academy in collaboration with other institutions would conduct such training programs throughout the country.\nDr. Abdul Fareed Brohi, In-Charge (Training Department), presented a comprehensive report of Da’wah Academy’s Training programs and highlighted significant features of the Human Resource Development Program for professionals of Armed Forces of Pakistan.\nHe highlighted the month-long activities of the training participants at campus and shared details of visiting institutions.\nHe said that almost 30 officers from the Pakistan Army, Pakistan Air Force, and Pakistan Navy participated in this prestigious training initiative.\nAt the end of the ceremony certificates and shields were presented to course participants by the minister.",
  "retrievedAt": "2025-08-11T08:35:09.130Z"
}
