{
  "title": "Pak-Italy JEC agrees establishment of joint framework encompassing multisectoral areas",
  "link": "https://www.app.com.pk/national/pak-italy-jec-agrees-establishment-of-joint-framework-encompassing-multisectoral-areas/",
  "date_published": "2023-05-30T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP): Federal Minister for Climate Change Senator Sherry Rehman and Italy’s Deputy Minister for Foreign Affairs and International Cooperation Maria Tripodi on Tuesday co-chaired the 5th meeting of the ‘Pakistan-Italy Joint Economic Commission’ (JEC) at the Italian Ministry of Foreign Affairs.\nThe two sides agreed to set up a joint framework to tackle climate change and cooperation in water management, hailing the establishment of an Italian Trade Agency office in Islamabad the next week, a news release said.\nSpeaking on the occasion, Senator Sherry Rehman said it was a pleasure to co-chair the 5th meeting of the Pakistan-Italy JEC in Rome with the Deputy Minister.She added that the establishment of the Italian Trade Agency office in Islamabad would boost bilateral trade. “We are building a common framework with Italy to tackle climate change and improve water management. The trade partnership between Pakistan and Italy is stronger than ever. Our bilateral trade is to reach $2 billion in 2022, and Pakistan’s exports will cross $1 billion,” Sherry Rehman said.\nThe next JEC meeting would be hosted in Islamabad at a mutually convenient time, which we look forward to, she added.\nWhile welcoming the finalisation of the ‘Visa Waiver Agreement for Diplomatic Passports’, both sides reiterated their commitment to speedy negotiations to finalize the framework for Migration and Labour Mobility. Businessmen from Pakistan and Italy participated in the meeting.\nThe event concluded with the signing of an important ‘Roadmap for Cooperation’ covering climate change, trade and investment, heritage, culture, agriculture, higher education, technical cooperation and technology transfer in reference areas.",
  "retrievedAt": "2025-08-11T08:35:16.504Z"
}
