{
  "title": "Sports activities lead to healthy living, character building: President",
  "link": "https://www.app.com.pk/national/sports-activities-lead-to-healthy-living-character-building-president/",
  "date_published": "2023-05-30T11:34:00.000Z",
  "source": "APP",
  "content": "QUETTA, May 30 (APP): President Dr Arif Alvi on Tuesday said that sports activities always led to healthy competition by promoting discipline and character building, especially among the young people.Addressing the concluding ceremony of 34th National Games, the president said that by holding national sports event, a message was given to the entire world that Balochistan was a peaceful province.\nThe president observed that different genres of games always helped in promotion of mental health, character building, team work, and healthy competition at different levels.He said Quaid e Azam and Fatima Jinnah always encouraged young people of the country to take part in healthy activities and stressed upon imbibing the spirit of unity, faith and discipline in all walks of life.Mohtarma Fatima Jinnah paid special focus on girls guide to strengthen the organizational discipline, he added.\nGovernor Balochistan Malik Abdul Wali Khan Karkar, provincial minister for sports, chief secretary, officials, athletes and a large number of spectators were present during the ceremony.About Balochistan, the president said the province was rich with natural and mineral resources and commended all the governments for their efforts to utilize them for the progress and prosperity of the province.The president further stressed that for physical health, regular exercise and other sports activities must be made a part of life as they were vital for healthy living.\nHe also appreciated all the stakeholders for the excellent arrangements and sportsmen for competing in the games.He termed holding of national games in Quetta as ‘another feather in province’s cap’.The president urged the youth to follow Quaid’s three guiding words ‘unity, faith and discipline’ as beacon for achieving success in future.The president said the country’s youth should have faith in their talents as no power in the world could hamper their quest for success in life.The president expressed his hope that young people world utilize their capabilities for the progress and development of the province.He also recollected his childhood and youth’s days when sports activities were regularly held at the educational institutions.The president said at the global level, Tv channels promoted games across the world.",
  "retrievedAt": "2025-08-11T08:35:17.380Z"
}
