{
  "title": "Senators Dilawar Khan, Hilal ur Rehman denounce PTI violence of May 9",
  "link": "https://www.app.com.pk/national/senators-dilawar-khan-hilal-ur-rehman-denounce-pti-violence-of-may-9/",
  "date_published": "2023-05-30T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Independent Senators Dilawar Khan and Hilal-ur-Rehman on Tuesday denounced the Pakistan Tehreek-e-Insaf (PTI) protestors’ vandalisation of state and public installations of 9th May and termed it as an unprecedented act of predicament.\nAddressing a joint press conference outside Parliament here, the Senators expressed solidarity and support with the Armed Forces of the country and categorically rejected the violence of May 9 by the PTI under the garb of a political party.\nSenator Dilawar Khan said the PTI leaders who did violence were presenting themselves as innocent and aggrieved.\nHe said, “I salute the Armed Forces for their restraint on that day (May 9) and we are standing besides our Armed Forces and will render every sacrifice for their prestige and honour. I strongly condemn the incident of May 9.”\nHe added that he and other senators went to Jinnah House under the leadership of Chairman Senate and the situation they saw there were two portraits of Father of the Nation Quaid-e-Azam Muhammad Ali Jinnah and his sister Mohtarma Fatima Jinnah and rest were lying there.\n“Even the enemy forces did not go inside the GHQ or the Corps Commander’s House. These people should be severely punished,” Dilawar Khan said.\nShaheed Colonel Sher Khan’s statue was desecrated, and his pictures were trampled, he regretted.\n“What will our protector (the martyr) think in his heart?” he queried. Khan said those responsible should be severely punished.\nSenator Hilal-ur-Rehman said the May 9 incidents would always be marked as a dark day in the national history.\n“There is no precedent to it in the national history. These state installations were attacked by terrorists in 2009 and then by PTI protestors in 2023. These installations have been attacked by inimical forces under the garb of a political party,” he added.",
  "retrievedAt": "2025-08-11T08:35:17.221Z"
}
