{
  "title": "Balanced media crucial to bring peace in Afghanistan: Bette Dam",
  "link": "https://www.app.com.pk/national/balanced-media-crucial-to-bring-peace-in-afghanistan-bette-dam/",
  "date_published": "2023-05-30T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Bette Dam, renowned investigative journalist and author of the famous book ‘Looking for the Enemy: Mullah Omar and the Unknown Taliban’, on Tuesday emphasized the need for balanced media reporting and a nuanced approach to foster peace in Afghanistan, rather than presenting one side of the story.\nShe made the remarks during a discussion session organized by The Centre for Afghanistan, Middle East & Africa (CAMEA) here at the Institute of Strategic Studies Islamabad (ISSI).\nShe said the realities surrounding Afghanistan had been distorted by the Western media’s narrative as the complete picture about the country was rarely presented, suggesting that a more comprehensive understanding was necessary to grasp the complexities of the situation.\nDuring her discourse, Bette Dam shed light on the dominance of the Western narrative in media coverage, noting that the perspective influenced approximately 80 percent of the portrayal.\n“In 2001, the Taliban had written surrender letters to the then-Afghan leader Hamid Karzai, which were unfortunately dismissed and thus an important opportunity for peace was conceivably lost,” Dam said.\nFurthermore, she highlighted that the refusal by Rumsfeld, the United States Secretary of Defence at the time, played a significant role in the subsequent unfolding of events.\nBette Dam also talked about Mullah Omar’s perspective on the Taliban, revealing that he viewed the group as a neutral peacekeeping force with the intention to halt the ongoing conflict and chaos in Afghanistan.\nContrary to prevailing beliefs, as highlighted in her book, Bette Dam challenged the narrative by emphasizing that Mullah Omar, the former Taliban leader, remained in Afghanistan until his death, refuting the misconception that he died in Pakistan.\nSpeaking on the occasion, ISSI Director General Sohail Mahmood said that Dam’s work helped demystify many aspects of Mullah Omer’s life and mission which had remained shrouded in mystery.\nHe stated that Dam’s work was a comprehensive and independent analysis that allowed readers to gain profound insights into the complexities of the issues at hand.",
  "retrievedAt": "2025-08-11T08:35:09.081Z"
}
