{
  "title": "Author highlights intricacies of Mullah Omar’s life, western media’s distortion on Afghanistan",
  "link": "https://www.app.com.pk/national/author-highlights-intricacies-of-mullah-omars-life-western-medias-distortion-on-afghanistan-2/",
  "date_published": "2023-05-30T14:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):The Western author of a book on Mullah Omar’s life on Tuesday highlighted at a roundtable discussion here the intricacies of his life encompassing the political career and the Taliban movement, besides criticising the Western media for distorting facts surrounding Afghanistan.\nThe Centre for Afghanistan, Middle East and Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI) organized ‘A Conversation with Bette Dam, author of Looking for the Enemy: Mullah Omar and the Unknown Taliban.\nDuring the discussion, Bette Dam highlighted the extensive research that had been undertaken to delve into the intricacies of Mullah Omar’s life, encompassing his upbringing, formative years, development as a leader, the inception of the Taliban movement, and the final moments of his life.\nBesides giving a brief presentation on her journey as an investigative journalist in particular, Bette Dam also talked about Mullah Omar’s perspective on the Taliban, revealing that he viewed the group as a neutral peacekeeping force with the intention to halt the ongoing conflict and chaos in Afghanistan.\nContrary to prevailing beliefs, as highlighted in her book, Bette Dam challenged the narrative by emphasizing that Mullah Omar, the former Taliban leader, remained in Afghanistan until his death, refuting the misconception that he died in Pakistan.\nDam went on to assert that the realities surrounding Afghanistan have been distorted by Western media’s narrative. She stressed that the complete picture was rarely presented, suggesting that a more comprehensive understanding is necessary to grasp the complexities of the situation.\nDuring her discourse, Bette Dam shed light on the dominance of the Western narrative in media coverage, noting that this perspective had influenced approximately 80 percent of the portrayal.\nShe emphasized the need for a more balanced and nuanced approach, as the media had tended to focus on violence and portrayed only one side of the story.\nDam also revealed that in 2001, the Taliban had written surrender letters to the then-Afghan leader Hamid Karzai, which were unfortunately dismissed and thus an important opportunity for peace was conceivably lost.\nFurthermore, she highlighted that the refusal by Rumsfeld, the United States Secretary of Defense at the time, played a significant role in the subsequent unfolding of events.\nDuring her introductory remarks Director of CAMEA Amina Khan highlighted the distinctiveness of Dam’s work as a Western author, offering a fresh perspective on the subject matter.\nShe emphasized that Dam’s nuanced approach of exploring all sides of the story contributed to a comprehensive and unbiased analysis, enabling readers to gain deeper insights into complex issues.\nAmina Khan noted that this ability to embrace different viewpoints enhances the resonance and relevance of Dam’s writing in the region.\nIn his welcome remarks, DG ISSI Ambassador Sohail Mahmood appreciated Dam’s work which had helped demystify many aspects of Mullah Omer’s life and mission which had remained shrouded in mystery.\nIn particular, her research had provided a fresh perspective on the indigenous origins of the Taliban movement, factors for its rise in the peculiar circumstances of civil war-ridden Afghanistan of the mid-1990s, the handling of 9/11 and its aftermaths by Taliban leadership, the troubled relationship between Mullah Omar and Al-Qaeda leader Osama bin Laden, and the last days of Mullah Omar and his demise in Afghanistan.\nHe stated that Dam’s work was a comprehensive and independent analysis that allowed readers to gain profound insights into the complexities of the issues at hand.\nHe expressed the hope that the book would inspire more scholars to further pursue the themes Ms. Bette Dam had highlighted.\nIn the interactive discussion, the participants’ comments focused on her key findings as well as problems related to the dominance of the Western narrative and the difficulties it posed for objective journalistic reporting.",
  "retrievedAt": "2025-08-11T08:35:09.001Z"
}
