{
  "title": "Ashrafi issues ‘code of conduct’ as a guiding framework for pilgrims, religious tourists",
  "link": "https://www.app.com.pk/national/ashrafi-issues-code-of-conduct-as-a-guiding-framework-for-pilgrims-religious-tourists/",
  "date_published": "2023-05-30T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):The International Tazim-e-Haramain Sharifain Council, in collaboration with Darul Ifta Pakistan and Pakistan Ulema Council has successfully organized training sessions aimed at presenting a comprehensive code of conduct that serves as a guiding framework for pilgrims and religious tourists, specifically tailored to the current situation.\nIn a significant development, Secretary General of the International Tazim-e-Haramain Sharifain Council, and Chairman of Pakistan Ulema Council Hafiz Muhammad Tahir Mahmood Ashrafi issued the code of conduct on Tuesday emphasizing the importance of maintaining the sanctity and respect of the holy land.\nHe highlighted that adhering to the prescribed guidelines was crucial to avoid any untoward incidents during the spiritualjourney.\nThe code of conduct emphasizes the divine commands outlined in the Holy Quran and Sunnah of the Holy Prophet (Peace Be Upon Him). It unequivocally states that pilgrims must abstain from engaging in quarrels, mischief, debauchery, and obscenity during the Hajj pilgrimage.\nTo ensure a focused spiritual experience, the code of conduct explicitly prohibits the use of videos and images while performing Hajj or Umrah. Prior to embarking on the pilgrimage, the code advises pilgrims to seek comprehensive information about the sacred rites. In this regard, individuals can obtain guidance by reaching out to the providedWhatsApp number: 0300-7888871.\nIt emphasizes the importance of arranging the Hajj or Umrah journey in accordance with the rules and regulations set forth by the Ministry of Religious Affairs and Interfaith Harmony, as well as the leaders of Hajj or Umrah groups. It underlines the significance of complying with these guidelines, even if they may go against personal preferences.\nHighlighting the core purpose of Hajj and Umrah, it emphasizes the need to relinquish one’s ego and arrogance, presenting oneself humbly before Allah Almighty. By donning two white sheets and proclaiming the words of Labaik, pilgrims symbolize their apostasy and servitude.\nAddressing concerns related to travel logistics, the code of conduct assures pilgrims and religious tourists arriving at any airport in Saudi Arabia that delays in departure are normal. Saudi officials are required to complete immigration and customs procedures, which may contribute to temporary delays.\nDuring their stay in Makkah and Madinah, the code of conduct emphasizes the obligation to adhere to the rules stipulated by the Saudi Ministry of Hajj and Umrah, as well as the Ministry of Interior. Women, the blind, and the sick are advised by religious scholars and Mufti-e-Azam to offer their prayers within the confines of their rooms during peak times at the Haramain Sharifain.\nThe code of conduct unequivocally discourages any attempts to establish a political field in Saudi Arabia, particularly in the sacred cities of Makkah, Madinah, Mina, Arafat, and Muzdalifah. It urges pilgrims to refrain from participating in any such endeavors.\nAdditionally, the code of conduct emphasizes the importance of following the instructions provided by the leader of each pilgrim group when traveling to and from Mina, Arafat, Muzdalifah and Rami Jamrat. It highlights the need to exercise patience and avoid hasty actions, as they could lead to mishaps.",
  "retrievedAt": "2025-08-11T08:35:08.956Z"
}
