{
  "title": "USAID increases funding to aid flood-affected communities in Pakistan",
  "link": "https://www.app.com.pk/national/usaid-increases-funding-to-aid-flood-affected-communities-in-pakistan/",
  "date_published": "2023-06-07T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP):USAID Deputy Administrator Isobel Coleman has pledged an additional $16.4 million in funding to bolster the recovery and resilience of communities in Pakistan devastated by the unprecedented floods of 2022.\nThese catastrophic floods affected an estimated 33 million people, wreaking havoc on vital infrastructure, crops, livelihoods, and livestock across the nation, said a news release issued here on Wednesday.\nThe newly allocated funds will provide support to over 20 million individuals affected by the floods, facilitating their recovery, enhancing risk reduction measures, and fostering resilience.\nThe assistance will tackle the growing challenges of food insecurity, malnutrition, and disease outbreak prevention.\nMoreover, the funding will empower humanitarian partners to deliver nutritious meals to mothers and children, aid in the reconstruction of local infrastructure to mitigate future disasters and expand protection services to prevent gender-based violence and support survivors.\nIn response to the severe monsoon rains and ensuing floods, USAID promptly deployed a Disaster Assistance Response Team to spearhead the U.S. humanitarian response and provide swift aid to affected communities.\nCollaborating with partners, USAID efficiently escalated critical humanitarian assistance, including a successful air bridge operation in collaboration with the U.S. Department of Defense.\nThis operation delivered nearly 630 metric tons of life-saving relief supplies to Pakistan.\nAs one of the leading contributors to Pakistan, the United States has provided over $200 million in humanitarian and development assistance since the catastrophic floods of 2022.\nThe United States remains steadfast in its solidarity with the people of Pakistan as they continue their recovery journey from the profound impacts of these historic floods.",
  "retrievedAt": "2025-08-11T08:38:41.517Z"
}
