{
  "title": "People anticipate start of new era as Henan, Balochistan provinces entered into bond of sister provinces: Minister",
  "link": "https://www.app.com.pk/national/people-anticipate-start-of-new-era-as-henan-balochistan-provinces-entered-into-bond-of-sister-provinces-minister-2/",
  "date_published": "2023-06-07T16:50:00.000Z",
  "source": "APP",
  "content": "The minister expressed these views while addressing as chief guest at a seminar held under the aegis of Friends of China Forum to highlight the fruits and contribution of the China-Pakistan Economic Corridor (CPEC) for the well-being and economic uplift of the people of the province.\nMs. Pang, Charge d’affaires, Embassy of the People’s Republic of China; Liang Jieyi, Director General of the Foreign Affairs Office of Henan Province; Jahanzeb Khan, Director General of Provincial Disaster Management Authority (PDMA), Senator Danesh Kumar, Yang Yundong, Chinese Consul General in Karachi; Bayazeed Kasi, Chairman of FOCF also addressed on the occasion.\nLangove said that the new bond between Henan and Balochistan provinces would help Balochistan develop and economically thrive on the model of Henan Province, adding that Balochistan’s people could learn from their brethren in China to attain economic and industrial revolution.\n“Chinese companies can also benefit from collaboration with the people of Balochistan and a win-win collaboration can be developed further to help build this friendship between the two sister provinces,” he added.\nHe also conveyed his deepest gratitude to the people and government of China for its continued support to the people of Balochistan for their generous assistance during last year’s floods, adding that both the countries had helped each other despite all odds and the people of both the countries had sacrificed for each other in peace and critical times and challenges.\n“We are deeply touched by the generous support from Henan Province during the recent floods as 9000 food packs were despatched and distributed among deserving families in 25 flood-affected districts of Balochistan,” he added.\n“On this occasion, we also should remember the sacrifices of our valiant armed forces and its martyrs in safeguarding the Chinese nationals working on CPEC projects and the infrastructure of the CPEC,” he added.\nAddressing the seminar, Pang Chunxue said that last year, Pakistan was hit by unprecedented floods, causing heavy casualties and property losses. More than 30 million people were displaced, fields were flooded, houses were collapsed and roads were destroyed, she added.\n“The Chinese people felt the pain of the people of Pakistan and responded for the first time to provide relief assistance. The government, enterprises, and the public worked together to help Pakistan with assistance in funds exceeding 260 million dollars,” she said.\n“Balochistan is an important part of China-Pakistan friendly exchanges and cooperation. During State Councilor and Foreign Minister Qin Gang’s visit to Pakistan last month, he said that the China-Pakistan community with a shared future is not diplomatic rhetoric but has profound historical roots, solid public support, and strong practical needs” she added.\nShe said, “We will never forget that in the wake of the Wenchuan earthquake in 2008, the Pakistani side took out all the tents in reserve to the stricken area in China by military aircraft. Earlier this year, the Chinese navy ship helped to evacuate Pakistani citizens from Sudan to Saudi Arabic. It is through these interactions that the iron-clad friendship between the two countries grows stronger and stronger.”\n“China will, as always, prioritize China-Pakistan relations in its neighborhood diplomacy, further strengthen policy communication and coordination of development strategies with Pakistan, deepen practical cooperation, jointly build the China-Pakistan Economic Corridor in a safe, smooth and high-quality way, to jointly build a closer China-Pakistan community with a shared future in the new era and the progress of human civilization,” she said.\nShe said,“As to Balochistan, we will jointly build the Gwadar port a hub of regional connectivity, promote agriculture, and industrial cooperation, help to improve the livelihood and skills of local people by providing capacity building programs, scholarships, solar panels, building basic health units, create more jobs. The Chinese Embassy in Pakistan will also further promote inter-provincial cooperation between Henan and Balochistan, promote all-round exchanges between the two provinces, continuously expand cooperation areas, and promote the friendship between the two provinces to a higher level,”.\nYang Yundong, Chinese Consul General of China in Karachi said that the development of sister-province relations between Henan and Balochistan would inject more vitality into the promotion of common prosperity and progress of the two provinces.\nHe said that the Consulate General of China in Karachi will maintain close communications with people of all walks of life in Balochistan, fully support the exchanges and practical cooperation between Henan and Balochistan in various fields, and further enrich the connotation of the China-Pakistan relationship.\n“China and Pakistan will further strengthen cooperation in the fields of industries, mining, agriculture, and people’s livelihood, and promote the development of the China-Pakistan Economic Corridor to a higher level and with higher quality. It is expected that Balochistan will play a greater role in China-Pakistan cooperation and gain more benefits,” he said.\nHe said that his priority strategy would be to work with the Balochistan government to build Gwadar Port into a high-quality port, regional trade center, and interconnection hub.\n“We would work with the Balochistan government to comprehensively expand cooperation in mining, industries, and other fields to promote the high-quality development of CPEC. Balochistan has a vast territory, rich resources, and great potential. We are willing to encourage more Chinese companies to participate in the development of Balochistan, and make a positive contribution to the economic development, infrastructure construction, and improvement of people’s livelihood in Balochistan,” he added.",
  "retrievedAt": "2025-08-11T08:38:28.527Z"
}
