{
  "title": "Parents, teachers urged to stay watchful of kids’ online ventures",
  "link": "https://www.app.com.pk/national/parents-teachers-urged-to-stay-watchful-of-kids-online-ventures/",
  "date_published": "2023-06-07T15:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP): The Internet has revolutionized the way children explore and learn, but it has also exposed them to various risks associated with the digital world to address these issues, parents and teachers must be vigilant about their children’s online activities, particularly excessive screen time that can lead to aggression, loneliness, and anxiety.\nEveryone talks about the benefits of the internet but it’s a fact that very few know of its dark side as well. Online risk is a global phenomenon however, from Pakistan’s perspective we face additional challenges said Director Pakistan Telecommunication Authority Muhammad Farooq in his article “Children@ Online Risk”\nThe matter is so sensitive in nature that even a small incident can trigger a law and order situation and can cause real-world harm, he added.\nKeeping in view the gravity of the matter, he said it is imperative to sensitize our social media users including youngsters, parents, teachers, and other key stakeholders not only to be well aware of its associated risks but should timely adopt proper measures to save our youngsters from further harm.\nIn order to have effective results, serious and collective efforts at all levels are indispensable he noted.Youngsters are vulnerable in the online world but parents and guardians supervising them are not fully aware of online risks, community guidelines of Social Media platforms, and punishments mentioned in local laws (i.e. PECA, PPC, etc.).\nKids and students at this stage require proper counseling by their parents, teachers from time to time along with the adoption of proven measures such as: avoiding giving them handheld devices and allowing them to use PCs placed in a common area visible to all, and replacing online gaming facilities with physical activities.\nHe said parents must spare time for their children, be friendly and educate them about online risks and allow them to discuss their issues without judgment otherwise, they may confide in strangers/online predators.\nHe called upon educational institutions to raise awareness by organizing seminars/webinars, workshops, etc.\nIn addition, using parental control software and built-in safety features of SM applications is effective in filtering inappropriate content/apps, limiting screen time, observing online activities, etc.",
  "retrievedAt": "2025-08-11T08:38:33.843Z"
}
