{
  "title": "Ashrafi stands firm in defense of blasphemy law, national honor",
  "link": "https://www.app.com.pk/national/ashrafi-stands-firm-in-defense-of-blasphemy-law-national-honor/",
  "date_published": "2023-06-07T12:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP):Pakistan Ulema Council Chairman and Prime Minister’s Special Representative on Interfaith Harmony and Middle East, Hafiz Muhammad Tahir Mahmood Ashrafi Wednesday addressed concerns regarding the propagation of false information against the blasphemy law and Namoos-e-Risalat.\nIn a conference held at the National Press Club, he emphasized that these laws had been instrumental in maintaining peace and tranquillity within the country.\nDuring the ‘Conference on Stability of Pakistan’ organized by Jamiat Islamiya Pakistan, Ashrafi reaffirmed that the Ulema and Maskaykh (religious scholars) stood united in their defence of these sacred laws.\nHe emphasized that the blasphemy law had never been misused in history and would continue to be protected at all costs in the future.\nRegarding the unfortunate incidents of violence on May 9, Ashrafi denounced the perpetrators as terrorists engaged in anti-state activities.\nHe urged that they must be brought to justice through military courts.\nExpressing disappointment with the current judiciary system, Ashrafi highlighted the large number of pending cases that were not receiving adequate attention, particularly those affecting the underprivileged segments of society.\nAshrafi also drew attention to certain individuals with dual nationalities who were conspiring against Pakistan and calling for international sanctions based on alleged human rights violations.\nHe condemned the attacks on the residence of the core commander in Lahore, the Radio Pakistan building in Peshawar, and the General Headquarters in Rawalpindi.\nHe emphasized that such actions disrespected the sacrifices made by national heroes who laid down their lives for the country’s security and sovereignty.\nFurthermore, Ashrafi expressed his dismay at the torching of a mosque, located in the core commander’s house during the May 9 unrest.\nHe called upon the government and judiciary to expedite the trials of those responsible and ensure that they would face exemplary punishment, aiming to prevent the recurrence of such heinous acts in the future.\nAshrafi shared that the Pakistan Ulema Council would host a grand gathering at Al-Hamra Hall in Lahore on Sunday, June 11.\nThis convention aimed to foster interfaith harmony, address human rights concerns, and develop strategies to prevent the misuse of the blasphemy law in relation to the desecration of religion and Namoos-e-Risalat, he added.\nIn solidarity with the national security institutions, Chief Allama Akbar Saqi and Secretary General Allama Sibtain Sherazi of Jamiat Islamiya Pakistan also spoke at the conference.\nThe upcoming gathering organized by the Pakistan Ulema Council would hold great significance as it would bring together a thousand Ulema, Mashaykh, religious scholars, and representatives from various segments of society to address critical issues and promote harmony.\nThe event would serve as a platform to reaffirm the commitment to protect the nation’s honor, combat human rights violations, and ensure responsible use of the blasphemy law while safeguarding the sanctity of religion and Namoos-e-Risalat.",
  "retrievedAt": "2025-08-11T08:38:43.475Z"
}
