{
  "title": "NDMA alerts departments after tropical cyclone “BIPARJOY” formed over Southeast Arabian Sea",
  "link": "https://www.app.com.pk/national/ndma-alerts-departments-after-tropical-cyclone-biparjoy-formed-over-southeast-arabian-sea/",
  "date_published": "2023-06-07T13:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP): The National Disaster Management Authority (NDMA) on Wednesday issued an advisory directing the provincial departments to ensure adequate measures after the topical cyclone “BIPARJOY” was formed over Southeast Arabian Sea.\nThe Pakistan Meteorological Department (PMD) has informed that the depression (strong low-pressure area) has intensified into a Cyclonic Storm “BIPARJOY” and has moved northward during the past 12 hours, intensified into a Severe Cyclonic Storm (SCS) and now lied approximately 1,340 km south of Karachi, the NDMA advisory said.\nIt added that the maximum sustained surface winds were 90-100 Km/hour with gusts of 120 Km/hour around the system’s center. Due to favorable environmental conditions the system was likely to intensify further into a ‘Very Severe Cyclonic Storm (VSCS)’ in the evening or night and continued to move in north and northwest direction.\nThe provincial and district disaster management authorities (PDMA’s and DDMA’s respectively) and relevant department were suggested to ensure close monitoring of system development and proactive coordination through respective emergency operation centres.\nThey should also ensure that early warning systems were in place and functioning effectively to disseminate timely and accurate information for at-risk communities. The departments concerned should also conduct awareness campaigns for masses on the cyclone’s potential impacts, evacuation procedures, and safety measures.\nThe departments should also utilize various communication channels such as television, radio, social media, and SMS alerts to reach the coastal communities.\nThe respective PDMAs and DDMAs, Rescue agencies and departments concerned may identify high-risk areas prone to storm surges, flooding, and landslides, and develop evacuation plans accordingly. They should also collaborate with relevant authorities, including law enforcement agencies and transportation departments, to facilitate the safe evacuation of people from vulnerable coastal areas.\nThe respective departments should develop contingency plans for identification of safe locations and adequate equipment with essential supplies, including food, water, medical aid, and sanitation facilities.\nIt should continuously update fishermen about the weather conditions and advise them not to venture into the open sea until the situation improves and establish a system for regular communication with fishing communities, providing them with real-time weather updates and guidance.\nHowever, it said presently, no area of Pakistan’s coastal regions was under threat, but regular and continuous monitoring of the developing system should be ensured by all stakeholders.",
  "retrievedAt": "2025-08-11T08:38:43.834Z"
}
