{
  "title": "Naval Chief for re-affirmed commitment, resolve to save oceans from further degradation",
  "link": "https://www.app.com.pk/national/naval-chief-for-re-affirmed-commitment-resolve-to-save-oceans-from-further-degradation/",
  "date_published": "2023-06-07T11:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP): Chief of the Naval Staff, Admiral Muhammad Amjad Khan Niazi on Wednesday demanded the nation to re-affirm its commitment and resolve to save its oceans from further degradation and reverse the damage done so far.\nIn his message on World Oceans Day 2023, the Naval Chief said there was a dire need to review and conform to ways that would help protect and preserve oceans; Earth’s ultimate source of life, a Pakistan Navy news release said.\nWorld Oceans Day (WOD) is observed on the 8th June each year to raise awareness about the impact of human activities on the oceans and motivate people to use the ocean’s resources sustainably.\nOceans, a major source of sustenance for life on earth, act as lungs to our planet as they provide more than 50% of the oxygen produced on this planet.\nOceans are also key absorbers of greenhouse gases and carbon dioxide.\nThe WOD aims to highlight challenges in preserving the health of the world’s oceans and measures to maintain an ecological balance in the environment.\nThe theme selected by UN for WOD-2023 is ‘Planet Oceans: Tides are Changing’. This year’s theme reflects that change is occurring around the world for ocean preservation.\n“On the eve of WOD, we acknowledge the challenges that are eroding the integrity of our waters – pollution, marine invasive species, extreme climatic changes and threats to the survival of marine life. We depend on our oceans for livelihood; fishing alone, from catch to consumer, produces not only food for billions of people but also creates millions of jobs worldwide. Nearly 15% of animal protein consumed by humans comes from marine fish. As the challenges to the oceans continue to grow, so does the need for novel solutions, to fight these challenges,” Admiral Niazi said.\nHe said to commemorate the significance of the WOD, Pakistan Navy played its due role in promoting safe and sustainable use of ocean resources.\nSome major Pakistan Navy initiatives include; beach cleaning, construction of harbour debris collection barges, mangroves plantation, banning the use of destructive fishing nets, tackling oil pollution at sea and coordinating with industrial community to reduce waste dumping into the sea, he added.\nThe Naval Chief said a number of events were held to highlight the spirit of the day and activities planned to demonstrate seriousness about oceans and sustainable use of their resources.\nAn active and forthcoming participation by all under Command could significantly contribute to the objectives set on this occasion, he added.",
  "retrievedAt": "2025-08-11T08:38:49.383Z"
}
