{
  "title": "Incumbent govt adds 3800 MW in national grid system in one year: Khurram",
  "link": "https://www.app.com.pk/national/incumbent-govt-adds-3800-mw-in-national-grid-system-in-one-year-khurram/",
  "date_published": "2023-06-07T12:17:00.000Z",
  "source": "APP",
  "content": "JHELUM, Jun 07 (APP):Minister for Power Division Engineer Khurram Dastgir Khan on Wednesday said that the incumbent government has added cheap 3800 megawatts (MW) indigenous electricity in the national grid system in just one year which would gradually help reduce power tariff.\nAddressing at a gathering after inaugurating 132 KV Grid Station Sohawa (District Jhelum), the minister said over 2000 MW alone electricity was added to the system from local Thar coal during the said period. 1320 MW Shanghai Electric, ThalNova, Karot hydropower project and K-3 Karachi Nuclear Power Plant project have started generation electricity since inception of the incumbent coalition government led by Prime Minister Shehbaz Sharif, he added.\nHe said the grid was approved in 2016 as a part of the country’s development agenda of Pakistan Muslim League (PML-N) government led by Muhammad Nawaz Sharif. However, the past government created hurdles in the development of the country during 2018-2022 and stopped work on entire development projects, he added.\nThe incumbent government since its inception last year, again revived the development agenda and the inauguration of the grid station in a short time was also one of its example, he said.\nHe said the grid station which was completed with an estimated cost of Rs 391 million would not only help improve voltage but also ensure supply of smooth power to the consumers.\nHe was confident that the grid would also help reduce line losses of Islamabad Electric Supply Company (IESCO) and benefit the consumers.\nHe said the grid station would also help setting up flour mills, feeder mills and other industries as it would help address low voltage issue in the areas. The grid station was gift from the PML-N leadership Muhammad Nawaz Sharif and Shehbaz Sharif to the local people, he added.\nRecounting the initiatives of the government for bringing improvement in the entire power system, the minister said that the government has also completed power transmission line from Iran’s boarder to Gwadar, Thar-Mitiari transmission line in a very short time besides starting work on Sukki Kinari transmission line project etc.\nKhurram said Pakistan has also achieved the capability to manufacture big wires/cables used for transmission lines.\nHe went on to say that development of Pakistan was PML-N mission. The path of progress and development would be taken forward under the leadership of Prime Minister Shehbaz Sharif, he added.\nComing hard on the previous government, the minister said the agenda of Pakistan Tehreek-e-Inaf (PTI) has exposed before the nation after May 9 vandalism. The PTI workers set on fire Radio Pakistan Peshawar, Jinnah House Lahore, replica of Chaghi, Swat Motorway toll plaza, Edhi ambulances, 150 cattle heads in Peshawar etc, he said.\nHe said foundation of 500 KV NTDC grid station would also be laid very soon in Chakwal.\nSpeaking on the occasion, Coordinator to PM on Economy and Energy Bilal Azhar Kayani thanked the minister for completing the grid station in time. He said over 36000 consumers would get benefit from the grid station.\nHe said the PML-N past government had added around 14,000 MW electricity to the national grid station during 2013-2018 while the past government failed to add a single megawatt in the system during its four-year rule.\nHe said the present government expedited work on all power projects which faced inordinate delayed due to incompetency of PTI government.\nEarlier, CEO IESCO Dr Muhammad Amjad said that the grid was completed with an cost of Rs 391 million and would recover its cost within next 2 years as losses have been plunged to only 6 percent from over 20 percent.He said applications for new connections have also been doubled. Earlier, the area was connected with Gujjar Khan grid station which was already overloaded, he added.\nHe said that the grid station would not only help address low voltage issue in the areas but also pave way for setting up industries like flour mills and the poultry industry.\nHe said that IESCO would soon start work on Lillah and Gagan Grid Stations with the support of the government.\nOther speakers Raja Owais Khalid and Shahibzada Talib Mehdi also spoke on the occasion.",
  "retrievedAt": "2025-08-11T08:38:48.422Z"
}
