{
  "title": "PM Shehbaz’s presence fails to quell noisy protest in NA - Pakistan - DAWN.COM",
  "author": null,
  "content": "• National Assembly passes bill for health university amid PTI sloganeering\n• Several pieces of legislation deferred due to absence of movers\n• Gender gap in voter lists narrowing, law minister tells assembly\n\nISLAMABAD: Oppo­si­tion members from the Pakistan Tehreek-i-Insaf (PTI) continued their noisy protest in the Nat­ional Assembly on Tues­day during the rare presence of Prime Minister Shehbaz Sharif, as the session saw the lower house passing a bill to establish a health university in the federal capital amid intense sloganeering.\n\nSpeaker Ayaz Sadiq, in a departure from past pr­a­ctices, ignored the opp­osition’s protest and managed to hurriedly conduct more than 60 per cent of the 51-point age­nda on the private members’ day. The session lasted nearly an hour.\n\nThe opposition intensified their protests as soon as the prime minister entered the assembly hall following the playing of the national anthem. PTI members chanted slogans and thumped desks, demanding the release of the party’s founding chairman, Imran Khan, and the formation of judicial commissions to investigate the events of May 9 and Nov 26.\n\nPTI members have been protesting on the floor of the house since the beginning of the current session.\n\nMr Sharif remained in the house throughout the session and remained surrounded by treasury members most of the time. At times, he was seen exchanging pleasantries with the members and receiving applications while totally ignoring the opposition’s protest.\n\nAt one point, when the opposition members targeted the premier by calling him a “thief”, some treasury members responded by calling him a “lion”.\n\nMeanwhile, the Natio­nal Assembly passed a private member’s bill moved by Anjum Aqeel Khan, a Pakistan Muslim League-Nawaz (PML-N) MNA from Islamabad, seeking to establish the Nexus International Uni­versity of Health Emer­ging Sciences and Tech­nologies in Islamabad.\n\nThe house also appro­ved an amendment proposed by Agha Rafiullah of the Pakistan Peoples Party (PPP) to allocate a 10 per cent quota for underprivileged and deserving students at the university.\n\nHowever, another amendment moved by Alia Kamran of the Jamiat Ulema-i-Islam (JUI-F) calling for the establishment of the university’s campuses in other parts of the country was rejected by the house. Law Minister Azam Nazeer Tarar opposed the move, stating that it had already been decided that parliament would allow setting up research centres and universities in the federal capital only and not in the provinces.\n\nThe house also witnessed the introduction of the Qanoon-i-Shaha­dat (Amendment) Bill 2025 by the PPP’s Shazia Marri. The speaker referred the bill to the relevant committee when it was not opposed by the law minister.\n\nHowever, the speaker deferred several other bills because of the non-availability of the members who had introduced them. He also deferred a constitutional amendment bill seeking to increase the seats for minorities in the Senate on the law minister’s request.\n\nThe bill’s mover, Naveed Aamir of PPP, did not press for the introduction of the bill when the minister said the same matter was already under consideration by a standing committee.\n\nEarlier, responding to a calling-attention notice, the law minister informed the house that the government was extending all possible cooperation to the Election Commission of Pakistan and Nadra in their efforts to reduce the gender gap in voter lists.\n\nHe said the gender gap had dropped to 7.4 per cent in the 2024 elections from 11.8pc in 2018. Out of 113 districts in the country, there were only 30 districts left where the gender gap was more than 10pc.\n\nThe minister hoped that the difference would be further reduced before the next elections scheduled for 2029.\n\nThe National Assembly will meet again today (Wednesday) at 2pm.\n\nPublished in Dawn, December 22nd, 2024",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6790579e62e16.jpg",
  "retrievedAt": "2025-08-26T07:52:52.010Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886821/pm-shehbazs-presence-fails-to-quell-noisy-protest-in-na",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T02:28:16.000Z"
}
