{
  "title": "India and US trying to arrange Modi meeting with Trump next month - World - DAWN.COM",
  "author": null,
  "content": "Indian and American diplomats are trying to arrange a meeting in February between Indian Prime Minister Narendra Modi and US President Donald Trump in Washington, two Indian sources familiar with the discussions told Reuters.\n\nIndia, a strategic partner of the United States in its efforts to counter China, is keen to enhance trade relations with the US and make it easier for its citizens to get skilled worker visas, two topics that will be on the agenda if the leaders meet, the sources said.\n\nTrump’s return to the White House has raised worries among officials in New Delhi about the imposition of tariffs on India, which he has listed as one of the countries with high tariffs on US products and has indicated that he favoured reciprocating them.\n\nHowever, the sources said New Delhi was willing to offer some concessions to Washington — although it has not been officially informed of any plans by the US to impose reciprocal tariffs — and was also open to offering incentives to attract more US investment in India.\n\nOfficials hope that an early meeting between the pair will help get ties off to a positive start in Trump’s new term, the sources said, speaking on condition of anonymity.\n\nTrump visited India in February 2020 during his previous term in office. Then, he was cheered by more than 100,000 Indians at a cricket stadium in Modi’s political homeland in Ahmedabad, where he promised India “an incredible trade deal”.\n\nIn 2019, Trump held a “Howdy Modi” rally with Modi in Houston, drawing 50,000 people, mainly Indian Americans.\n\nLaying the groundwork for a new Modi-Trump meeting is also on the agenda of Indian Foreign Minister Subrahmanyam Jaishankar, who attended Trump’s inauguration on Monday and met US Secretary of State Marco Rubio. Rubio discussed concerns related to “irregular migration” with Jaishankar on Tuesday, the US State Department said.\n\nOther topics of discussion between the two leaders would be enhancing partnership in the technology and defence sectors, the sources said.\n\nMigration would be another area of discussion, as Trump has pledged a crackdown on illegal immigration but has said he is open to legal migration of skilled workers.\n\nIndia, known for its massive pool of IT professionals, many of whom work across the world, accounts for the bulk of the skilled worker H-1B visas issued by the United States.\n\nSeparately, a report from Bloomberg said that India is evaluating its choices to counter Trump’s tariff threats to foes and allies alike, which range from presenting a trade deal, cutting tariffs and importing more goods from the US.\n\nCiting people familiar with the matter, the report stated that the Modi-led government had mapped out several scenarios to counter steps the new US administration “may take to narrow India’s trade surplus with the US which was $35.3 billion for the year ended March 31”.\n\nThe US was India’s largest trading partner for the period, according to data from India’s commerce ministry.\n\n“Among the options discussed, the government could buy more whiskey, steel and oil from the US,” Bloomberg said, adding that the officials also discussed decreasing import tariffs, with the list of likely products including “bourbon whiskey and farm goods like pecan nuts”.\n\nOther proposals under consideration included reducing duties on goods imported from the US deemed as politically important to Trump’s Republican party, the report said.\n\n“The plans under discussion are part of India’s larger strategy to avoid any confrontation with Trump, and also benefit from any potential US-China trade war,” the report elaborated, adding that the plans had not been finalised.\n\nEarlier, Bloomberg News had reported that India was “set to take back at least 18,000 illegal Indian immigrants from the US to help placate the Trump administration”.\n\nIndia, according to the sources, is also considering “a limited trade deal” with the US, which the Modi administration tried to implement during Trump’s first term.\n\n“The plan under discussion would include reducing some most-favoured nation’ tariffs, which are imposed on countries with which India doesn’t have a bilateral trade deal,” the report highlighted.\n\nThe report also highlighted that India expected the new US administration to add pressure on issues such as data regulations, intellectual property rules and e-commerce.\n\nAccording to the report, the Indian officials also discussed how “across the board tariffs” of 10 to 20 per cent on all countries would help boost India’s exports of auto components and metals.\n\nAdditionally, higher tariffs and curbs on access to advanced technology on China could benefit Indian sectors such as electronics, hi-tech machinery, textiles, footwear and chemicals.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/22133949c0f5495.jpg",
  "retrievedAt": "2025-08-26T07:52:15.704Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886971/india-and-us-trying-to-arrange-modi-meeting-with-trump-next-month",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T10:01:55.000Z"
}
