{
  "title": "PM orders probe into dredging contract of Karachi Port Trust - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif ordered an inquiry into the alleged procurement violations in a dredging contract awarded by the Karachi Port Trust (KPT).\n\nDocuments reveal that KPT recommended awarding the dredging contract to a Chinese company despite the technical committee’s concerns against this firm.\n\nA four-member committee has been formed, led by the chairman of PM’s Inspection Commission.\n\nThe committee includes the Secretary of the Cabinet Division, the Managing Director of the Public Procurement Regulatory Authority, and a representative from the Intelligence Bureau Division.\n\nThe committee is tasked with investigating any deviations, omissions, or violations in the technical and financial evaluation of the tendering process.\n\nThey will review the rationale for qualifying or disqualifying bidders, identify responsible individuals or departments, and provide recommendations for addressing the issues and safeguarding public interest.\n\nThe technical committee evaluated bids from four international companies and found the Chinese firm’s equipment non-compliant with timelines and quality standards.\n\nBesides, the Public Procurement Regulatory Authority (PPRA) had earlier raised concerns about the transparency of the process, emphasising the need to publish the technical report. KPT responded that the report was withheld pending final discussions with the Chinese firm.\n\nIncidentally, a senior official of the KPT said that the award of contract to a non-compliant bidder could jeopardise the project’s critical deadlines, endangering vessel navigation during the monsoon season.\n\nPublished in Dawn, January 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:13:44.824Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886853/pm-orders-probe-into-dredging-contract-of-karachi-port-trust",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T02:40:00.000Z"
}
