{
  "title": "Police fail to trace attackers of ex-MPA Ghalib Domki - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: The Shikarpur police have failed to trace out the band of armed men who attacked former MPA and a highly influential feudal lord Sardar Mir Ghalib Domki a couple of days back.\n\nDomki, his spouse and a grandson had sustained multiple injuries in the gun attack last Sunday (Jan 19) when the armed men stopped his Vigo and showered it with bullets along Mirza Wah (irrigation channel) near Rustam town. They were hit by glass splinters from the vehicle’s smashed windows but did not suffer bullet wounds. Since then, they had been under treatment at a nearby hospital under stringent security.\n\nThe doctors providing treatment to them said on Tuesday evening that the patients would be discharged within a few hours as their condition was satisfactory.\n\nAccording to widely reported facts about the incident, Sardar Ghalib Domki along with his wife and a grandson had left Sukkur for Bakhshapur town of Kandhkot by his Vigo on Sunday. While passing by Rustam town, the heavily armed men signalled the driver to stop and as soon as he slowed down the vehicle, they started firing on it.\n\nThe Sardar’s bodyguards riding another vehicle behind it swiftly returned the fire killing three of the assailants, one of them later identified as Nadir Mirani, who was leading the band.\n\nCome out with entirely different version of episode to claim credit of killing one of the assailants\n\nTwo of the bodyguards, Salar and Mehar, belonging to the Domki tribe, also lost their lives and a third one, Murad Khan Domki, was wounded in the shootout.\n\nBelated police version\n\nAfter keeping complete silence over the incident for more than 48 hours, Shikarpur SSP Shahzeb Chachar on Tuesday came out with a totally different version of the episode.\n\nIn a press release, he claimed that while former MPA Ghalib Domki was going to Kandhkot with his family from Sukkur, gangsters intercepted his vehicle at Mirza Wah within the jurisdiction of the Rustam police station, but in a timely action by police, one dacoit was shot dead and three others were wounded in an exchange of fire.\n\nThe dacoits managed to take away the dead associate’s body and the wounded fellows with them, he said, adding that the two guards of Ghalib Domki were killed by dacoits.\n\nThe SSP said that the body of Nadir Mirani, who was killed in a joint operation on Tuesday night, was now in police custody and kept in a local hospital.\n\nHe said that the dead dacoit was wanted in 18 cases of heinous crime, including murder, attempted murder and robberies.\n\nPublished in Dawn, January 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/22104129f302e7c.png",
  "retrievedAt": "2025-08-26T07:52:29.387Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886899/police-fail-to-trace-attackers-of-ex-mpa-ghalib-domki",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T03:28:37.000Z"
}
