{
  "title": "Pakistan’s first polio case of 2025 reported in KP’s DI Khan - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Emergency Operation Centre (NEOC) on Wednesday said that the country’s first polio case of the year was reported in Khyber Pakhtunkhwa’s Dera Ismail Khan district.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress.\n\nA press release issued today from the NEOC said the Regional Reference Laboratory for Polio Eradication at Islamabad’s National Institutes of Health (NIH) confirmed the first wild poliovirus type 1 (WPV1) case of 2025.\n\n“The onset of the case was on January 7,” the press release said, adding that DI Khan reported 11 polio cases in 2024.\n\n“Last year, a total of 73 cases were reported. Of these, 27 were from Balochistan, 22 from KP, 22 from Sindh, and one each from Punjab and Islamabad,” it added.\n\nThe NEOC said polio was a paralysing disease that had no cure, adding that multiple doses of the oral polio vaccine and completion of the routine vaccination schedule for all children under the age of five were essential to provide children with high immunity against the terrible disease.\n\nIt added that the year’s first polio vaccination campaign was scheduled from February 3–9 nationwide.\n\n“It is crucial for parents to ensure vaccination for all their children under the age of five to keep them protected,” the NEOC said.\n\nThe government expressed optimism about interrupting the virus in the current year at a session with the Technical Advisory Group (TAG) on Polio Eradication in Islamabad a day ago.\n\nStakeholders, including representatives from federal and provincial governments, partners and donor organisations attended the session.\n\nThe meeting was held at a pivotal time for Pakistan’s polio eradication efforts as the country intensifies its drive to overcome the remaining challenges in its fight against the crippling disease.\n\nPrime Minister’s Coordinator on Health Dr Malik Mukhtar Ahmad Bharath emphasised the government’s commitment to eradicating polio. He reiterated the dedication of Prime Minister Shehbaz Sharif who has declared polio eradication a national priority and consistently supports initiatives to strengthen routine immunisation and tackle immunity gaps in high-risk areas.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:52:12.655Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887007/pakistans-first-polio-case-of-2025-reported-in-kps-di-khan",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T14:53:32.000Z"
}
