{
  "title": "Pakistan, Cambodia discuss trade expansion - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan and Cambodia reached an understanding of taking practical steps to enhance bilateral trade and economic cooperation.\n\nBoth sides agreed at the inaugural session of the Pakistan-Cambodia Joint Trade Committee (JTC) to explore avenues to enhance trade, investment, and cooperation in various sectors. The next JTC session will be held in Pakistan, with dates to be decided by mutual consultation.\n\nCo-chaired by Pakistan’s Additional Secretary Commerce Nasir Hameed and Cambodia Commerce Secretary Pich Rithi, the session discussed mutual interests, including trade, health, banking, agriculture, aviation, and customs.\n\nAn official announcement from the commerce ministry said that the two sides agreed to appoint focal persons to expedite negotiations for memorandums of understanding and enhance cooperation. They resolved to share trade-related information, organise trade delegations, and facilitate direct engagements between the business communities of both countries.\n\nThe Cambodian side showcased its robust market access through free trade agreements and preferential trade treatments, offering opportunities for Pakistani businesses to tap into regional and global markets. The agreed minutes of the JTC highlighted plans for collaboration in ICT, e-commerce, agriculture, and the health sector.\n\nCommerce Minister\n\nJam Kamal highlighted Pak­istan’s strategic location, growing economy, and investment-friendly policies, inviting Cam­bodian businesses to explore agri­cul­ture, textiles, pharmaceuticals, and tou­rism opport­unities.\n\nPublished in Dawn, January 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:58:04.228Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886855/pakistan-cambodia-discuss-trade-expansion",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T02:40:00.000Z"
}
