{
  "title": "Qesco completes first phase of tube well solarisation - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Quetta Electric Supply Company (Qesco) has completed the first phase of its project to convert agricultural tube well connections to solar energy in the Quetta and Pishin districts.\n\nAs part of the initiative, Qesco disconnected the electrical connections of agricultural users who had received government funding for the solarisation programme.\n\nBy Jan 17, the company removed 494 transformers, 884 high-tension (HT) poles and other electrical equipment in Quetta and Pishin, effectively cutting these agricultural connections from its network.\n\nHowever, Qesco faced resistance from some land owners, who failed to cooperate with the programme.\n\nInstead of handing over their electrical equipment, certain landowners disconnected their tube well connections themselves and removed the transformers, poles and other equipment.\n\nIn some cases, landowners reportedly tampered with the equipment by removing components such as coils and oil and replacing them with stones, bricks and gravel to match the weight before returning the items to Qesco.\n\nThe company has urged provincial and district auth­orities to address the issue, as several landowners have yet to return the transformers and other equipment.\n\nThe first phase of the solarisation programme, which began on Dec 20, 2024, was funded with an allocation of Rs5.398 billion to facilitate the transition of 2,699 agricultural users to solar energy.\n\nThe initiative also uncovered 513 illegal agricultural connections, bringing the total disconnections to 3,212 in Quetta and Pishin.\n\nA Qesco spokesperson said that out of the 2,699 connections, only 494 transformers, 884 HT poles and other equipment have been secured by the company, while a significant portion of the equipment was not unreturned by landowners.\n\nThe project aims to ensure that agricultural users transitioning to solar energy are fully disconnected from Qesco’s network. As part of this effort, the company removed transformers, HT poles and other electrical infrastructure to prevent unauthorised reconnection after the solarisation process.\n\nPublished in Dawn, January 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:52:56.059Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886807/qesco-completes-first-phase-of-tube-well-solarisation",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T02:22:31.000Z"
}
