{
  "title": "Lawsuits challenge Trump’s birthright citizenship move - World - DAWN.COM",
  "author": null,
  "content": "BOSTON: Immigrant and civil rights groups have filed the first lawsuits challenging executive orders President Donald Trump signed on Monday after taking office, including one that seeks to roll back birthright citizenship in the US.\n\nThe lawsuits were filed in federal court in Massachusetts and New Hampshire late on Monday ahead of expected legal challenges by several Democratic attorneys general in states including California and Connecticut.\n\nThe White House did not immediately respond to a request for comment.\n\nMore lawsuits by Democratic-led states and advocacy groups challenging other aspects of Trump’s agenda are expected, with cases already on file taking aim at the Elon Musk-led Department of Government Efficiency and an order the Republican signed weakening job protections for civil servants.\n\nThe New England lawsuits took aim at a central piece of Trump’s sweeping immigration crackdown, an order directing federal agencies not to recognise US citizenship for children born in the United States to mothers who are in the country illegally or are present temporarily, such as visa holders, and whose fathers are not citizens or lawful permanent residents.\n\nPlaintiffs argue the constitution provides that anyone born in the United States is considered a citizen\n\nJust hours after Trump was sworn into office, the American Civil Liberties Union and other groups filed the first lawsuit challenging the order in Concord, New Hampshire. Another lawsuit was filed around midnight in Boston by an expectant mother and immigrant organisations.\n\nAny rulings from those district court judges would be reviewed by the Boston-based 1st US Circuit Court of Appeals, whose five active federal judges are all appointees of Democratic presidents, a rarity nationally.\n\nBoth lawsuits argue that the executive order violated the right enshrined in the Citizenship Clause of the US Constitution’s 14th Amendment that provides that anyone born in the United States is considered a citizen.\n\nBoth lawsuits cite the US Supreme Court’s 1898 ruling in United States v. Wong Kim Ark, a decision holding that children born in the United States to non-citizen parents are entitled to US citizenship.\n\nAmong the plaintiffs named in that lawsuit is a woman identified only as “O. Doe,” a Massachusetts resident who is in the country through temporary protected status and is due to give birth in March.\n\nTemporary protected status is available to people whose home countries have experienced natural disasters, armed conflicts or other extraordinary events and currently covers more than 1 million people from 17 nations.\n\nSeveral other lawsuits challenging aspects of Trump’s other early executive actions are also pending.\n\nThe National Treasury Employees Union, which represents federal government employees in 37 agencies and departments, late on Monday filed a lawsuit challenging an order Trump signed that makes it easier to fire thousands of federal agency employees and replace them with political loyalists.\n\nPublished in Dawn, January 22th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2210245477db7ec.jpg",
  "retrievedAt": "2025-08-26T07:52:45.035Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886825/lawsuits-challenge-trumps-birthright-citizenship-move",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T02:34:03.000Z"
}
