{
  "title": "Metropolitan Corporation Islamabad’s stray dogs centre struggles to make ends meet - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A centre set up by the Metropolitan Corporation Islamabad (MCI) to neuter and vaccinate stray dogs is struggling to carry out its daily operations due to a lack of funds and staff, hindering its ability to control the population of stray dogs that has increased significantly.\n\nThe Stray Dog Population Centre (SDPC) was established in Tarlai in November 2022 by the MCI on the direction of the Islamabad High Court to control the population of stray dogs through the ‘trap, neuter, vaccinate and release’ (TNVR) method.\n\nThe centre was supposed to neuter and release at least 800 dogs per month. People used to call the helpline and the trained staff were supposed to trap dogs from the said area and shift them to the centre.\n\nInitially, this centre performed well, as surgeries were conducted followed by the release of the dogs. However, the performance gradually declined before the completion of its contract on December 7, 2024. Since then, the centre has had no staff or other facilities, including food, for the dogs kept in cages.\n\nAlmost 20 dogs caged in facility living off scraps from hotels, volunteers; helpline also out of order\n\nSimilarly, the helpline 1819 set up for citizens to contact the centre for picking up stray dogs is also out of order.\n\nIn order to meet the shortage of food, some visitors and hotel owners occasionally provided scraps to almost two dozen dogs kept at the centre, which is being operated by the MCI’s Directorate of Municipal Administration (DMA) through its own staff. DMA Deputy Director Mohammad Asif claimed that dogs were being taken care of with the required food. “We are arranging food for these dogs through our own resources,” he said.\n\nAt present, the centre has 20 dogs, which are reportedly getting weaker. “There is no justification for keeping the dogs in this centre when you have no facility available. What is the purpose of keeping dogs here when the DMA has no vaccines or a doctor for conducting operations? All dogs should be released immediately,” said an official of DMA, who wished not to be named.\n\nInterestingly, the CDA has a trained veterinary doctor, who used to perform his duty at Marghazar Zoo, but after the closure of the zoo, he is working as the environment director.\n\n“If it is imperative, services of this doctor should be used for neutering the dogs before releasing them,” the official said.\n\nWhen contacted, Sajjad Bhatti, the caretaker of the SDPCC, said that all 20 dogs were being provided with proper food, adding that a vehicle of DMA collected scraps from some hotels on a daily basis to feed these dogs. About the contractor, he said the DMA would sign a new contract soon to streamline operations of the centre.\n\nThe caretaker admitted that the helpline was not working, adding that complaints were made to the DMA and CDA offices and in response “we trap dogs for shifting them to this centre”.\n\nIt is relevant to note that before the centre was established, the CDA and the MCI used to shoot dogs to control their population, but the high court ordered the authorities to stop this cruelty and directed them to set up a dog centre.\n\nPublished in Dawn, January 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:13:57.245Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886913/metropolitan-corporation-islamabads-stray-dogs-centre-struggles-to-make-ends-meet",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T03:41:27.000Z"
}
