{
  "title": "Chinese mine worker killed in ISIS attack in Afghanistan - World - DAWN.COM",
  "author": null,
  "content": "Police said on Wednesday a Chinese mine worker was killed in an attack in Afghanistan which the banned militant Islamic State (ISIS) group later claimed responsibility for, as the Taliban government attempts to project an image of security to encourage investment from Beijing.\n\nThe Chinese citizen was travelling the previous evening in northern Takhar province bordering Tajikistan when he was killed by “unknown armed men”, provincial police spokesman Mohammad Akbar Haqqani told AFP.\n\nHe said the man was travelling “for an unknown reason” and without informing security officials, who typically accompany Chinese nationals on trips in the country. A translator travelling with the man was unharmed, Haqqani added.\n\nISIS’s regional chapter claimed responsibility for the attack later today, according to monitor SITE.\n\n“The IS (Islamic State) issued a communique … reporting that fighters fired at a vehicle carrying a ‘communist Chinese’ in Takhar, a province in which the group was last active in 2022,” the monitor said.\n\nInterior Ministry Spokesperson Abdul Mateen Qani confirmed the details of the killing and said the Chinese citizen was a business owner with a contract to mine in Afghanistan.\n\nChina’s embassy in Kabul did not immediately respond to a request for comment by AFP.\n\nThe Taliban government are touting Afghanistan’s vast natural resources, largely untapped during two decades of war, as a lifeline for the ravaged economy and a lucrative opportunity for foreign speculators.\n\nDespite lingering security concerns, neighbouring China is emerging as a potential investment partner.\n\nChinese and Afghan officials gathered in Kabul a day ago for an event marking 70 years of diplomatic ties.\n\n“I would like to assure my Chinese friends that there is peace and security in Afghanistan,” Deputy Foreign Minister Sher Mohammad Abbas Stanekzai told attendees.\n\n“We invite Chinese businessmen and investors to come and invest in Afghanistan with confidence,” he said.\n\nSecurity has drastically improved in Afghanistan since foreign troops withdrew in 2021 and the Taliban ended their insurgency as they swept back to power.\n\nBut the regional chapter of ISIS regularly stages attacks on civilians, security forces, Taliban government officials and foreigners in Afghanistan.\n\nAt least five Chinese nationals were wounded when gunmen stormed a Kabul hotel popular with Beijing businessmen in a 2022 attack claimed by IS.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:52:12.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887004/chinese-mine-worker-killed-in-isis-attack-in-afghanistan",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T13:41:30.000Z"
}
