{
  "title": "Harsher penalties for kite flyers, makers in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government on Tuesday introduced new amendments to the anti-kite flying law making the now defunct sport a non-bailable offence with an imprisonment from three to seven years.\n\nEarlier, the government had imposed a complete ban on kite flying across the province and added severe penalties for violation of the Punjab Prohibition of Kite Flying (Amendment) Act, 2024.\n\nThe ban applies to “transport kites, metallic wire, nylon cord, any other thread coated with sharp mannjha or any other injurious material for the purpose of kite flying.”\n\nAccording to the amendments, individuals caught flying kites will face three to five years in prison or a fine of Rs2 million, or both. Failure to pay the fine could result in an additional year of imprisonment.\n\nViolators to face three to five years jail, Rs2m fine or both; kite makers to be jailed for five to seven years\n\nKite makers and transporters will face even harsher penalties, with five to seven years in prison or a fine of Rs5 million, or both. Failure to pay this fine could lead to an additional two years of imprisonment.\n\nThe amended law also outlines specific penalties for minors caught kite flying. On the first offence, they will be fined for Rs50,000; on the second, a fine of Rs100,000. A third offence will result in punishment under the Juvenile Justice System Act 2018, which includes imprisonment.\n\nMany fatal incidents occur due to the use of sharp strings during kite flying. The bill stated, “Dangerous kite flying has caused the deaths of many motorcyclists across Punjab.”\n\nIt highlighted a recent incident where a man “fell victim” to kite flying that resulted in his immediate death. “Hence, enhanced punishments commensurating with the gravity of the offence have been provided to create deterrence among the public at large.”\n\nThe resolution was moved by PML-N MPA Hina Parvez Butt. The resolution expressed concerns about the increasing incidents of stray kite strings in the province.\n\nThe PML-N MPA in her resolution urged the Punjab Assembly House to declare kite and string-making non-bailable offences and urged judges to deny bail to people booked under the said charges.\n\nIn March last year, a motorcyclist died after a metal string, believed to be part of a stray kite, cut his throat in Faisalabad. Following the incident, Chief Minister Maryam Nawaz ordered a crackdown on those involved in kite flying.\n\nThe provincial government intensified its crackdown by declaring kite making, flying, and transportation as non-bailable offences in August, 2024.\n\nPublished in Dawn, December 22nd, 2024",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:58:05.804Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886854/harsher-penalties-for-kite-flyers-makers-in-punjab",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T02:41:17.000Z"
}
