{
  "title": "Malik Riaz and son should face courts, present their defence: info minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "Information Minister Attaullah Tarar said on Wednesday that Malik Riaz and his son should “face the courts and present their defence,” a day after the National Accountability Bureau (NAB) said the government was reaching out to the United Arab Emirates to seek the business tycoon’s extradition in the Al-Qadir Trust case.\n\nMeanwhile, Riaz termed the NAB’s action against him a “new demand for blackmail” and asserted that he would not testify, without specifying in what case.\n\nThe development comes on the heels of ex-premier Imran Khan and his spouse’s conviction last week in the Al-Qadir Trust case, in which Riaz and his son are also co-accused and proclaimed offenders. As PTI and legal experts pointed to the need for accountability for all those involved, Tarar had said that consultation was ongoing on how to bring the other absconders back.\n\nA day ago, the NAB, saying it was to seek Riaz’s extradition, stated it was conducting inquiries and investigations against him and his associates for “fraud, deceptive practices and cheating the public at large.”\n\nIn a televised address today, Tarar recalled the NAB’s press release, quoting the accountability watchdog as saying it had concrete evidence in those inquiries.\n\nNoting that Riaz and his son had been declared absconders, Tarar stressed that if they both could have defended themselves before the courts, they would have done so in the Al-Qadir Trust case and other inquiries.\n\n“They (Riaz and his son) should face the courts, and present their defence, which they have failed to do so far.”\n\nHe said: “NAB’s press release and it saying that more cases are underway on this … One of these is Takht-Pari, a locality in Rawalpindi, in which there is a case of illegal takeover and illegal housing society and accumulating billions from the public.”\n\nThe minister added, “Not standing before the court, escaping its proceedings, and not presenting any proof or evidence in your defence there […]. Property has been seized previously as well and more will be done, according to the NAB’s press release.”\n\nThe minister said further legal action should be completed in cases against the property tycoon.\n\n“It should not be considered who has what position or how much power, or who has how much money.”\n\nStressing that the NAB worked according to the law without any bias, the minister asserted the bureau was taking “credible steps” over the matter.\n\n“This is the first time that the NAB has [taken action against] such influential people and proceeded against them based on evidence while fulfilling legal requirements.”\n\nTarar highlighted: “Not only Takht-Pari but Malir Development Authority’s money, which had to be paid from those £190 million, also was to be paid to the Sindh government or the people of Pakistan.”\n\nThe information minister said it was “very odd that despite the press release issued by NAB, projects were being launched in Dubai” by the property tycoon, referring to a recently launched luxury apartments project by Riaz-owned Bahria Town Limited.\n\nRiaz, no stranger to Pakistan’s power corridors before his fall from grace, is currently in the UAE, where he plans to develop ‘Bahria Town Dubai’, a luxury housing project that also came under scrutiny in the NAB statement.\n\nTarar highlighted that as per the anti-graft watchdog, any money invested in the Dubai project would be tantamount to money laundering.\n\nHe also claimed that the United Kingdom had recently cancelled the visas of Riaz and his son, which he said “was not possible without criminal proceedings”.\n\nThe minister reiterated that funds intended for the government were instead used to pay an “already-existing fine” in the Supreme Court. He repeated allegations of various cash and other transactions done between Imran and Riaz as part of a deal, calling them “undeniable evidence”.\n\nOn the other hand, Riaz termed the NAB’s action against him as a “new demand for blackmail”.\n\n“This was my decision yesterday and this is my decision today, no matter how much you oppress me, Malik Riaz will not testify!” the property tycoon said on his X account.\n\n“Malik Riaz will neither be used against anyone nor will be blackmailed by any. God willing, the Dubai project will be successful and will become a symbol of Pakistan throughout the world, including Dubai,” he asserted.\n\nReferring to yesterday’s press release by the NAB, Riaz stated: “Today’s deplorable press release by NAB is actually a new demand for blackmail. I am resisting, but I am sitting with a storm in my heart. If this breaks, then everyone’s illusion will be put into reality.\n\n“Let’s not forget that all the secrets of the last 25/30 years are safe with evidence,” he added.\n\n“I want to mention in clear terms that years of blackmailing, fake cases and greed of officers couldn’t deter me, but due to my principle stance of refusing to be a witness (political pawn), I had to move abroad,” the property tycoon claimed.\n\nRecalling “obstacles at every step” in doing business in Pakistan, Riaz said numerous impediments and official blackmailing sometimes created delays in fulfilling promises made to his members.\n\nWhile the NAB had cautioned the public yesterday against investing in his Dubai project, Riaz asserted that “investors from dozens of countries have come to Dubai and are showing exemplary interest in the BT [Bahria Town] Properties project”.\n\n“The secret of Dubai’s development is the vision of His Highness Sheikh Mohammed bin Rashid Al Maktoum and the absence of an institution like NAB,” he quipped.\n\n“With the determination that our life and death were and will always be for Pakistan, we assure our Pakistani brothers and sisters that we have abided by the laws of every country in the world, including Pakistan, and will always continue to do so,” he stated.\n\nLast week, Imran and his spouse were sentenced in the £190 million case involving Al-Qadir Trust.\n\nIn its reference against Imran, NAB had alleged that the then cabinet approved a confidential deed in 2019 to give £190m — seized by the UK’s National Crime Agency (NCA) and returned to Pakistan — back to real estate tycoon Malik Riaz.\n\nThe bureau had said that Imran and Bushra Bibi got billions of rupees and land measuring hundreds of kanals from Bahria Town for legalising the money.\n\nAs per the reference, Riaz’s son Ali transferred 240 kanal of land to Farhat Shahzadi, while Zulfi Bukhari received land under a trust, which NAB argued did not exist at the time of transfer.\n\nBukhari, a close aide of Imran Khan, recently claimed that authorities offered him lucrative deals to testify against the PTI founder in the case, but he refused.\n\n“Anybody whose name is involved in this case was offered all sorts of deals (to testify) against Imran Khan. Luckily, none of them took that offer — not the busine­ssman, not myself,” he told The Indep­endent.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/221329479128d65.png",
  "retrievedAt": "2025-08-26T07:52:19.908Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886975/malik-riaz-and-son-should-face-courts-present-their-defence-info-minister",
  "dateList": "2025-01-22",
  "date_published": "2025-01-22T09:02:33.000Z"
}
