{
  "title": "Taking to task any culprit jurisdiction of state, not public: Ashrafi",
  "link": "https://www.app.com.pk/national/taking-to-task-any-culprit-jurisdiction-of-state-not-public-ashrafi/",
  "date_published": "2022-02-13T16:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): Pakistan Ulema Council Chairman and Special Representative to the Prime Minister on Interfaith Harmony Hafiz Tahir Mehmood Ashrafi Sunday condemned the Tulamba incident in the strongest term.\nAddressing a press conference, he said people allegedly involved in the sad incident of killing a man ruthlessly would be brought to justice at all costs.\nAshrafi said if the killed person was committed any blunder, it was not the responsibility of any individual or public to punish him as it was jurisdiction of the state to penalize the culprit after completing all the constitutional requirement.\nHe said Ulema and Mashaikh of all schools of thought had already declared such nonsense incidents ultra vires. He said the government machinery was in action and the culprits were being arrested.\nHe said all sections of life would have to play their respective role in eradicating the trend of killing people in the presence of blasphemy laws, Toheen-e-Namoose-e-Risalat and Toheen-e-Mazhab, in the country.\nHe said the practice of becoming self-proclaimed judge, claimant and arbiter in such cases could not be tolerated.Ashrafi also informed that Paigham-e-Pakistan Peace Committees were being constituted from union council to central level adding the purpose of these committees was to resolve such issues immediately at the grassroots level.\nHe said the person who was killed in the Tulamba incident was mentally sick rather insane. The killers had defamed Islam and Muslims with this brutal act, he added.He said Prime Minister Imran Khan was personally monitoring all the developments in this incident.\nHe said the prime minister had directed to take strict action against the elements and accomplice in the Tulamba incident.He informed that about 62 people involved in the incident had been arrested, however, the first information report had been registered against 300 people.\nAshrafi said the incumbent government was amending criminal law after 76 years to ensure speedy trial in such incidents.He said whosoever would commit negligence in this very incident would be punished.To a query, he said there was a dire need to introduce reforms in attitudes of the people.\nHe said understanding and following teachings of the Holy Prophet Peace Be Upon Him was need of the hour and we all had to be on the same page even on the issue of oppressed Mushtaq.Ashrafi said self-interpretation of the religion could not be allowed as per anyone’s own will.\nOn this occasion, members of the Peace Committee, Allama Qari Saifullah Abid, Mufti Omar Farooq, Abdul Khaliq Marali, Mufti Rafiq Ahmed Shah Jamali, Sheikh Zulfiqar Rizvi, Syed Sohail Abidi, Qaiser Abbas Dadu Ana, Maulana Muhammad Shafi Qasmi, Qari Muhammad Akram, Deputy Commissioner Khanewal Salman Khan and DPO Syed Nadeem Abbas were also accompanied with Tahir Ashrafi.\nEarlier, Ashrafi along with Deputy Commissioner and DPO Khanewal also held meeting with members of Peace Committee.He asked the Ulema and Mashaikh to preach the people about brotherhood, forgiveness and tolerance in their respective areas.",
  "retrievedAt": "2025-08-11T14:19:35.138Z"
}
