{
  "title": "Media must project Sehat Card initiative and its benefits: State Minister",
  "link": "https://www.app.com.pk/national/media-must-project-sehat-card-initiative-and-its-benefits-state-minister/",
  "date_published": "2022-02-13T14:59:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Feb 13 (APP): State Minister for Information & Broadcasting Farrukh Habib has said that the media must fulfil its social and moral responsibilities by projecting the Sehat Card initiative, so that people could benefit from it through free treatment in hospitals of their choice.\nHe was talking to the media on Sunday after visiting Mian Muhammad Trust Hospital. He also asked the patients at the hospital who were getting treatment through Sehat Card at the hospital. He interacted with a patient who complained that she had deposited Rs 3000 as admission fee in the hospital. However, the chief executive officer (CEO) of the hospital, Dr. Rizwan, promised that the amount would be returned to the complainant soon as it was received before verification of the Sehat Card facility.\nHe said that around 900 hospitals had been registered so far, which would provide free medical treatment facility on Sehat Card. Out of those, 35 hospitals were in Faisalabad district. In this division, 3.2 million families would get benefit from Sehat Card scheme, he said and added that 40 million families had so far received the card in the country while two million card holders had enjoyed the facilities so far.\nHe said that Sehat Card scheme was first launched in Khyber-Pakhtunkhwa (KPK) where 900,000 families were registered. In Punjab, this scheme was launched in May 2020 and 30 million families comprising 120 million population of the province would be registered for Sehat Cards up to March 31, 2022.\nHe said that the scheme had already been launched in Lahore, Sahiwal and Rawalpindi divisions, while in Faisalabad it was inaugurated on Feb 9. He said that the Punjab government had allocated Rs 400 billion for the project and each family would be entitled to get medical treatment up to Rs 1 million on Sehat Card.\nHe said that the PTI government had introduced major reforms, which would also bring qualitative improvement in the health sector.He clarified that every individual would get the facility irrespective of his political affiliation. He said that federal government distributed Rs.3400 billion among different provinces. Hence, Muraad Ali Shah of Sindh and other chief ministers should also launch this scheme in their provinces for the betterment of their people.He said that we were fully monitoring this scheme and if anything was found wrong, we would correct it on immediate basis.\nHe said that people were not updating their family data with National Database & Registration Authority (NADRA) which was a major cause in the entitlement of their treatment from their own family. He said he would talk to Chairman NADRA to expedite registration of new couples so that they could get treatment through Sehat Card as an independent family.During the question-answer session, the state minister said, “All our allies are standing with us and opposition has failed to get their support. The opposition leaders are now requesting Asif Zardari to give them a helping hand.”\nResponding to a question, he said that the opposition had no guts and Prime Minister Imran Khan would complete his full five-year term. Regarding the protest plans, he said that it was right of every political party and “we would also hold public meetings to expose the loot, plunder and blunders of the opposition”.\nAbout the decision of Saaf Pani Company, he said that Shahbaz Sharif was involved in money laundering through 14 accounts. He must face the FIA and explain his position regarding the money laundered through fake bank accounts.\nAbout inflation, he said that the government was considering enhancing salaries up to 15 per cent. The media houses would also increase the salaries of their workers proportionate to their income, he hoped.Later, the state minister also visited Mujahid Hospital Madina Town.Deputy Commissioner (DC) Ali Shehzad and others were also present.",
  "retrievedAt": "2025-08-11T14:19:28.617Z"
}
