{
  "title": "Social media, public awareness helped rescue poached Leopard Cats from Karachi: Amin Aslam",
  "link": "https://www.app.com.pk/national/social-media-public-awareness-helped-rescue-poached-leopard-cats-from-karachi-amin-aslam/",
  "date_published": "2022-02-13T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam on Sunday said social media and public awareness helped in timely rescue of poached Leopard Cats from Karachi that were illegally captured from Islamabad. .\nBriefing the media after releasing the two Leopard Cats in the Leopard Preserve Zone, at Trail 6, of Margalla Hills National Park by the Islamabad Wildlife Management Board (IWMB), he said the poacher was selling the two Leopard Cats for 200,000 rupees each and placed an advertisement on a social media networking site.\nAmin said due to enhanced and better public sensitisation on wildlife conservation and the threats faced by it due to illegal hunting and poaching; the issue was reported to the authorities concerned through public hue and cry over social media for a swift action.\nHe said the Ministry of Climate Change was well aware of these issues and worked out the country’s first ever National Wildlife Policy and sent it’s draft for the Cabinet’s approval.\nThe SAPM told APP that the policy formulation was part of the Ten Billion Tree Tsunami Plantation flagship project that has a special component of wildlife preservation and conservation.He said public awareness and concern helped in bringing the issue to the limelight and guided the Sindh Wildlife Department to take stern action against the perpetrators and relieve the cats.\nOn the occasion, Chairperson IWMB Rina Saeed Khan told mediamen that the Sindh Wildlife Department confiscated these leopard cats from Empress Market that were poached from Islamabad.She mentioned that unfortunately a Karachi Zoo employee was involved in selling the cats on social media who was arrested by the Wildlife Department team.\nConservator Sindh Wildlife Department Javed Mahar launched the raid to relieve the cats from the culprits that were put in a very unfavorable environment.\nKhan informed that after Monal Restaurant’s closure 50% traffic declined on the route and youngsters started cycling on the route.\nShe added that the cats were quarantined, rehabilitated and were fed with live chickens for making them adapt with natural environment.\nThe Sindh Wildlife Department only trusted IWMB for handing over the cats due to its noble repute as a professional department dealing with wildlife and biodiversity conservation and protection.",
  "retrievedAt": "2025-08-11T14:19:46.938Z"
}
