{
  "title": "Half of population in Afghanistan in very precarious situation, facing hunger, food shortages: PM",
  "link": "https://www.app.com.pk/national/half-of-population-in-afghanistan-in-very-precarious-situation-facing-hunger-food-shortages/",
  "date_published": "2022-02-13T15:58:00.000Z",
  "source": "APP",
  "content": "Prime Minister Imran Khan Sunday said half of the population in Afghanistan was in a very precarious situation because of hunger, malnutrition, and food shortages.\nIn an exclusive interview with CNN’s GPS host Fareed Zakaria, he said the present situation was already developing into one of the worst humanitarian crises in Afghanistan.\nHe said, “people in the United States must understand one thing that it is a question of almost 40 million Afghans and half of them are in a very precarious situation.”\n“There is hunger and the Afghan winter is extremely wicked, ruthless,” he said adding people in Afghanistan were facing winter and there were food shortages and malnutrition.\nTALIBAN AND SANCTIONS ON AFGHANISTAN\nTo a question, the prime minister said there was no alternative to Taliban right now in Afghanistan.\n“Is there a chance that if the Taliban government is squeezed there could be a change for the better? No. So the only alternative we have right now is to work with them and incentivize them for what the world wants – inclusive government, human rights and women rights in particular. That is the only way forward right now.”\n“And the flip side is that if they (Taliban) are abandoned and if these sanctions stay there and the banking system has no liquidity left because of the sanctions, then the worry is that Afghanistan can go into chaos and a humanitarian crisis will occur.”\n“From Pakistan’s point of view, we faced two problems. We already have three million Afghan refugees. There were three terrorist groups operating from Afghanistan into Pakistan,” he noted.\nHe said as the Taliban government was formed, the flood of refugees came and almost 250,000 Afghans crossed into Pakistan and amongst them unfortunately were terrorists.\n“There were these Pakistani Taliban which had conducted attacks inside Pakistan, there were the Baloch insurgents who were conducting attacks especially recently and then there was ISIL.”\n“So our best hope is that a stable Afghanistan will ensure peace and stability of Pakistan,” he said adding so therefore it was in everyone’s interest that the situation in Afghanistan should not descend into chaos.\nHe said sooner or later Taliban would have to be recognized.\n“So now the world wants some guarantees before they recognize the Taliban. So how far the US is going to push the Taliban to actually conform them to what they expect them to do in terms of human rights.”\nTaliban was a very strong ideological movement. They represented culture which was completely alien to the western societies, he commented adding, “So therefore somewhere there has to be give and take. But by not recognizing them and freezing their accounts and the banking system, only people are going to suffer, and not the Taliban government because no one can replace them right now. So what is happening is that half of the Afghan population, about 20 million people are at a severe risk.”\nLOSSES OF PAKISTAN AND U.S WAR ON TERROR\nTo another question, he said the US war on terror actually bred terrorists.\n“I can tell you from the Pakistan’s example because we had 80,000 people dying after joining the US war on terror.”\n“We saw that as the war went on it produced more terrorists and I am convinced it was exactly the same to what happened in Afghanistan due to the night raids in Afghanistan, the drone attacks.”\nHe asked the United States to review the policy of drone attacks.\n“We watched what happened there. They were telling people in the United States that the drones were very accurate and they actually got the terrorists. Bombs exploding in villages, how they would only get the terrorists. So there was a lot of collateral damage and I am afraid the public in the United States does not really know the amount of collateral damage.\nWe bore the brunt because what happened was, we were considered the collaborators of the U.S so all the revenge attacks were against the Pakistani soldiers and against the people of Pakistan. There were suicide attacks occurring all over the country and we lost 80,000 people.”\nHe said after the U.S withdrawal from Afghanistan number of terror incidents came down.“During the height of war on terror, Islamabad was a fortress. You had suicide attacks going everywhere. Compared to what used to happen, terrorism is almost insignificant now.”\nRELATIONS BETWEEN INDIA AND PAKISTAN\nTo a question about prospects of peace with India, Imran Khan went on to say that he was probably one of those Pakistanis who knew and understood India much more than rest of his own countrymen “because of my friendships in India and because of my relationships with media and politicians in India”.\nImran Khan said the moment his government came into power the first thing he did was to reach out to India.\n“I said you come one step towards us we will go two steps towards you and our only issue is Kashmir and we should solve it like good neigbhours on the dialogue table.”\nBut unfortunately there was a tragedy unfolding in India, he said adding the RSS ideology inspired by Nazis had taken over India.\n“So it is a racist ideology that has taken over India. Three times the RSS was considered a terrorist organization, an ideology that assassinated the great Gandhi. So therefore it is very difficult to come to terms with this ideology.”\n“I tried everything and made overtures but unfortunately how you can deal with an ideology which is based on hate, racial superiority, hate for Muslims, hate for minorities, Christians and of course for Pakistan. So we haven’t made any headways.\nBut my worry is what is going on in India right now is much more damaging for India than for Pakistan right now. Our relationship has frozen but what is happening in India right now is of great concern.”\nINDIAN HUMAN RIGHTS VIOLATIONS IN OCCUPIED KASHMIR\nHe said in his first speech in the United Nations he raised the concern that situation related to Pakistan and India could spiral out of control.\n“There was an attack in Occupied Kashmir where a youth blew himself up on an Indian military convoy and Pakistan was blamed. I immediately asked India if it has any evidence that Pakistan is involved, we will take action. But rather than giving us any evidence their plane bombed us and Pakistan also retaliated and their plane was shot down. We immediately returned the pilot just to tell them we had no plans of escalation. So it could easily have escalated.”\n“When I met President Trump I asked him that it was very important for the most powerful country to solve the Kashmir issue,” he continued.\n“The world community has pledged to the Kashmiris that they would be able to decide their own destiny. So if this issue keeps continuing there always is a chance that the two nuclear powers could be confronting each other.”\nTo a question about China, he said, “We had our ambassador Aminul Haq and he went to Sinkiang and according to his observation the picture was not what was being portrayed on the western media.”\nHe said Kashmir was a disputed territory between Pakistan and India.\nOver the last 35 years, approximately about 100,000 Kashmiris had died and on August 5, 2019 India had revoked the status of Kashmir unilaterally, while according to the United Nations Security Council Kashmir was a disputed territory between Pakistan and India, he added.\n“There are extra judicial killings going on, there are no rights there, there is a clamp down and there are 800,000 Indian troops in the Kashmir valley. I find it very difficult that there is hardly any indignation about what is happening in Kashmir compared to what they are saying is happening in Sinkiang, that’s where I disagree with this. We as Pakistanis feel very strongly that this should be even handed.”\n“Kashmir is different because it is disputed between Pakistan and India, confirmed by the United Nations Security Council resolutions. So for us this is the immediate issue right now and I am afraid it just does not get the attention it deserves. In Kashmir, what is happening is criminal.” To a question, he remarked that the world should not head towards a cold war between the United States and China.",
  "retrievedAt": "2025-08-11T14:19:38.332Z"
}
