{
  "title": "PM says his recent China’s visit gave impetus to bilateral ties, CPEC projects",
  "link": "https://www.app.com.pk/national/pm-says-his-recent-chinas-visit-gave-impetus-to-bilateral-ties-cpec-projects/",
  "date_published": "2022-02-13T07:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): Prime Minister Imran Khan Sunday said that his recent visit to China and bilateral meetings with the Chinese leadership had added further strength to the time-tested ties and would accelerate the pace of work on the ongoing projects of China Pakistan Economic Corridor (CPEC).\nDuring an interaction with a number of former ambassadors and representatives of thinktanks, the prime minister said that his recent visit to China was very relevant with regard to the fast-changing global political map.\nThe Chinese leadership had appreciated his government’s steps to overcome the Covid 19 pandemic, and the economic indicators which were positive, he said, adding they reaffirmed economic support to Pakistan through specific projects.\nThe prime minister opined that his visit further added strength to the ties between the two countries.\nFederal ministers and PM’s special assistants were also present during the interaction.\nThe prime minister said he held the meeting with President Xi Jinping after a period of two years since the outbreak of Covid 19 pandemic. These bilateral meetings added further impetus to the China Pakistan Economic Corridor projects, he said while completely trashing an impression over the slow-paced work on these projects.\nAbout Afghanistan, the prime minister said the international community had a consensus over this issue.\nEurope and all the neighbouring states of Afghanistan agreed to avoid humanitarian crises there and stressed upon de-freezing of Afghan’s assets. The US also understood and realized the situation. All had consensus that steps should be taken so that Afghanistan should not be descended into chaos.\nTo a query, the prime minister said that after 18th amendment, issues had surfaced with regard to decision making and cited the difference in prices of wheat in Sindh and other provinces.\nReferring to the functioning of the Chinese government, the prime minister said when a decision was taken, it was implemented, but in Pakistan, they lacked such synergy among the federal and provincial governments.\nIn China, he said, the whole country worked for the wealth creation, he said, adding that all the hurdles in Special Economic Zones (SMEs) would be removed.\nDuring the Beijing Winter Olympics, the Chinese crowd warmly cheered the Pakistani contingent, reflecting how deeply rooted these ties had been between the two countries, he observed.\nResponding to another question, the prime minister said the strategic direction of his government was very clear. They wanted to maintain relations with all and would not become a part of any camp.\nDuring the last three and half years, the government had navigated from ‘the minefield’ of economic challenges, he said, adding that due to the government’s prudent policies, the country was witnessing growth rate, record tax collections, revenue generation, and remittances which indicated that the country’s economy had been moving in the right direction.\nTo another question, the prime minister opined that unless you had two-third majority in the parliament, you could not enact legislation to bring in various reforms in the society, stressing that there was requirement for huge reforms.\nThese pieces of legislation, sometimes, stuck up in the parliament or in the Senate, he maintained.\nHe said in China, they had meritocracy and rule of law, about 400 ministerial-level people had been held accountable over corruption charges which had increased the popularity of President Xi.\nThe prime minister said the global pandemic had devastated the world. Different countries of the world including Italy, Spain and the UK opted for complete lockdowns, but he went against such precedent for which he was bitterly criticized by his political opponents.\nHe said that had questioned the logic of imposing the complete lockdown as it would have created problems for the lower segments of society.\nDefending his decision of smart lockdown, the prime minister said in the US, Germany, and France, people had been on the roads against lockdowns.\n“We are ahead of everyone as we have not only saved our economy but also the lives,” he said, adding in India, the growth rate had been in the minus.\nTo a query, he replied that he had met Russian President Putin in Bishkek.  After his tweet about the negative use of freedom of speech to hurt Muslims’ feelings, they held a telephonic conversation and in which the Russian president conveyed that there was no Islamophobia in Russia and a central mosque in Moscow was fully functional.\nForeign Minister Makhdoom Shah Mahmood Qureshi speaking during the sitting, said that the prime minister’s meeting with President XI was marked with great outstanding. The clarity he witnessed over such meetings had not happened in the past which was another encouraging sign, he added.\nThe foreign minister further said the leadership of the two countries conveyed clear messages over the core issues. They removed certain concerns over the CPEC projects which were not based upon facts. The spoilers against CPEC had been playing their negative parts, he added.\nOn Afghanistan issue, Pakistan and China shared unanimous views, Qureshi said, adding as there had been close coordination and collaboration between the two countries.\nFurthermore, they had agreed over a future roadmap. A meeting of Afghanistan’s immediate neighbours, besides a trilateral meeting of Pakistan, China and Afghanistan would be soon convened to expedite efforts to avert humanitarian crises in Afghanistan.\nMinister for Finance Shaukat Tarin said that China had helped in building infrastructure and connectivity projects under CPEC and now they would support the establishment of SEZs, so that trickle-down effects could be fully reaped.\nMinister for Information and Broadcasting Chaudhry Fawad Hussain comparing the number of CPEC projects under the incumbent governments with the previous one, said now the number of working groups had been increased to 11, they had completed 7 projects in the last three years besides, a completion of 453kms roads projects was achieved. A further investment of $3.45 billion had been made.\nHe further said that 3 new projects had been added, the power generation stood around 3340 MW in 2018 which had now increased to 5864 MW during the last three and half years. Not a single transmission line was added by the previous government, but they had installed 880 kms new transmission lines, he added.",
  "retrievedAt": "2025-08-11T14:19:43.557Z"
}
