{
  "article_id": "2025-04-07_010d3e5be2eeccac81e70fd26364c6a7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dpm-us-secretary-of-state-discuss-bilateral-ties-regional-security/",
    "retrieved_at": "2025-08-27T14:15:21.770Z"
  },
  "metadata": {
    "title": "DPM, US Secretary of State discuss bilateral ties, regional security",
    "author": null,
    "date_published": "2025-04-07T15:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 196,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 07 (APP): Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar held a telephone call with United States Secretary of State Marco Rubio on Monday and discussed bilateral relations, regional security, and economic cooperation. During the call, Deputy Prime Minister Dar reiterated Pakistan's commitment to strengthening its partnership with the United States. He emphasized the importance of strengthening cooperation in areas such as trade, investment and counter-terrorism. Secretary Rubio reciprocated the desire to collaborate with Pakistan in trade and investment in various sectors, especially critical minerals. He said that cooperation in economy and trade would be the hall-mark of future relations between the two countries. Ishaq Dar highlighted Pakistan's efforts in successfully fighting terrorism during 2013-18, which caused Pakistan huge economic and human losses. Secretary of State Rubio also appreciated Pakistan's efforts in the fight against terrorism and expressed the US desire to further enhance counter-terrorism cooperation. The two leaders also discussed the situation in Afghanistan. Secretary Rubio agreed on the need to resolve the issue of US military equipment left behind in Afghanistan. They agreed to remain in close contact and to work together to advance the shared interests of both countries.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}