{
  "article_id": "2025-04-07_e6bafa88e60568092a220b2238cac53c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-pm-laud-security-forces-for-eliminating-nine-khwarijities-in-dikhan/",
    "retrieved_at": "2025-08-27T14:15:49.115Z"
  },
  "metadata": {
    "title": "President, PM laud security forces for eliminating nine Khwarijities in DIKhan",
    "author": null,
    "date_published": "2025-04-07T06:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 233,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, April 07 (APP): President Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif on Monday lauded the security forces for sending nine Khwarij to hell in a successful operation in Takwara area of District Dera Ismail Khan, Khyber Pakhtunkhwa. The president and the prime minister appreciated the valour of security forces for eliminating nine terrorists of Fitna-al-Khwarij, including a high-value target during the intelligence-based operations. The president praised the security forces for killing the leader of the terrorists during the operation and said that killing the leader of terrorists was a major success of the security forces. He further reiterated that operations carried out by the security forces would continue till complete elimination of terrorists, President Secretariat Press Wing, said in a press release. The president observed that Pakistan's security forces were conducting successful operations to eradicate terrorism which was commendable. The president said that their resolve for complete elimination of terrorist elements and the defence of country would remain unwavering and reaffirmed the national resolve for the complete eradication of Fitna-al-Khawarij. The prime minister also appreciated the successful operation conducted by the security forces against the terrorists of Fitna-al-Khwarij in DIKhan. \"The entire nation stands firmly with the security forces in the fight against terrorism,\" PM Office Media Wing, quoted the prime minister as saying. The prime minister also expressed determination to completely eliminate all forms of terrorism from the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}