{
  "article_id": "2025-04-07_7c45b7acf07eaac3046ab33a71cbe7ec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/court-seeks-full-attendance-in-rs1-24-bln-app-fraud-case-fia-officer-absent-again/",
    "retrieved_at": "2025-08-27T14:15:48.181Z"
  },
  "metadata": {
    "title": "Court seeks full attendance in Rs1.24 bln APP fraud case, FIA officer absent again",
    "author": null,
    "date_published": "2025-04-07T06:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 696,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 07 (APP): The district & sessions court of Islamabad on Monday adjourned the hearing of a high-profile Rs 1.24 billion financial fraud case in the state-run news agency, Associated Press of Pakistan (APP), after the investigation officer from the Federal Investigation Agency (FIA) failed to appear despite repeated summons. Additional District and Sessions Judge Sheikh Sohail Ahmed has ordered the presence of all accused in the APP financial fraud case and directed them to submit their responses by April 15. The hearing was adjourned due to the FIA officeras continued absence. During the hearing, APPas legal advisor, Nazir Sultan Mekan, appeared in court and argued that Rs 1.24 billion had been embezzled from the APP. He informed the court that a request to register a criminal case had been pending with the FIA for four months, but no action had been taken. He requested the court to issue an order for registration of the case against the accused. Meanwhile, several accused were present in court. Rao Furqan was represented by Sardar Aamir Advocate, Qasim Gujjar by Atiya Safdar, while Arshad Majeed Chaudhry appeared in person. Shafiq ur Rehman Advocate submitted his power of attorney for Chaudhry. Taimoor Aslam Khan appeared on behalf of accused Moazzam Javed. During the proceedings, the judge asked who was representing the FIA. In response, FIAas court assistant Chaudhry Shafiq said that Assistant Sub-Inspector Irshad Bhatti was handling the case, but could not attend as he was occupied in another hearing at the Anti-Corruption Court. The FIA representative also mentioned that the APP-related complaint had been mistakenly assigned to the Anti-Corruption Circle, while it actually fell under the jurisdiction of the Corporate Crime Circle. He requested the court to allow a weekas delay so that the investigating officer could be present at the next hearing. The court granted the request and adjourned the hearing until April 15, also ordering that all accused must attend the next session. According to the petition filed in court, the APP administration had formed a fact-finding committee on June 24, 2024, to investigate allegations of irregularities. The committeeas report revealed major financial mismanagement. It included misuse of funds from employee-related expenses (ERE) and provident fund (PF) accounts. The committee submitted its report to the Ministry of Information and Broadcasting, recommending that the matter be handed over to either the National Accountability Bureau (NAB) or the FIA for further legal action. The report stated that Rs1.24 billion had been misappropriated through unauthorized transactions, misuse of authority, and violations of financial rules. It was also alleged that key financial records were deliberately hidden from APPas management and that bank officials were involved in causing losses to the national exchequer. The petition claimed that important financial documents such as cash books, salary and pension credit sheets, and master ledgers for 2021 to 2023 were missing. These records were allegedly destroyed by former officials. According to the report, millions of rupees were illegally transferred to personal bank accounts of certain APP officials. Bank statements were cited as evidence of these transfers. One employee allegedly transferred Rs 4.7 million into their personal account, while another shifted Rs15.4 million from the ERE account into their own. The committee also discovered irregular transfers of provident fund money into personal accounts. A total of Rs 910.4 million was allegedly diverted from the PF account without authorization. The committee identified 16 individuals involved in the scam. It recommended sending the case to NAB or FIA for a full investigation and legal proceedings. It also advised a detailed examination of the accusedas bank accounts and assets to recover the embezzled funds. To prevent future incidents, the committee suggested stronger financial controls and improved referral procedures for key positions. Despite these findings and supporting evidence, the petition claimed that the FIA had not taken any legal steps against the accused. This delay in action compelled the APP administration to approach the court to seek the registration of a First Information Report (FIR). The petition has named the FIA Director General, the investigating officer, and other relevant individuals as respondents in the case. The court is expected to review the responses from all parties on April 15.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}