{
  "title": "Cops barred from media interviews sans permission in Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore police operations wing has issued explanatory guidelines for field officers, stressing strict adherence to court directives and departmental rules regarding media interactions.\n\nThe guidelines have been framed under sub-clauses of Sections 6 and 9 of the Punjab police media policy.\n\nThese guidelines make it mandatory for field officers to seek prior permission before giving interviews related to any case.\n\n“Any case-related interview will be conditional upon formal approval,” said the spokesperson here on Monday.\n\nHe said the measure aims to strengthen accountability and responsibility in sensitive matters. The spokesperson highlighted that recent judicial directions emphasised the need for greater responsibility in police-media interactions.\n\n“Irresponsible statements or casual remarks about an ongoing case can directly affect the proceedings,” the spokesperson explained. “By introducing the requirement of prior approval, the responsibility of officers in handling sensitive investigations will be further enhanced.”\n\nOfficials confirmed that violations of the media policy will result in departmental action.\n\n“The media policy is centered around ensuring that quality, accurate, and constructive information reaches both the public and the media,” the operations wing stated.\n\nThe Punjab police media and social media policy has been introduced to ensure that police communication remains professional, transparent, and constructive. It aims to curb the misuse of social media platforms by officers and to avoid speculative or premature statements that could compromise investigations.\n\nUnder the policy, all communication with the press must be routed through designated officers or approved by higher command, thereby preventing contradictory narratives or politicisation of police work.\n\nThe police officials underline that the policy does not seek to limit the role of media but instead ensures that engagement is responsible and fact-based. “Through media, public awareness efforts will continue effectively,” the spokesperson reiterated, adding that the policy will also support the media’s constructive role in society.\n\nThe statement concluded that responsible conduct by police officers would assist the media in maintaining a constructive and credible role, ultimately strengthening public trust in law enforcement.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:10:13.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943963/cops-barred-from-media-interviews-sans-permission-in-lahore",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T01:00:16.000Z"
}
