{
  "title": "Damascus urges US to formally drop sanctions - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: Syrian President Ahmed al-Sharaa renewed his call on Monday for Washington to formally lift US sanctions imposed under the 2019 Caesar Act while visiting New York to attend the first UN General Assembly of a Syrian leader in nearly six decades.\n\nSharaa, a former Al Qaeda leader, led rebel forces that overthrew Bashar al-Assad’s government last year. US President Donald Trump met him in Riyadh in May and ordered most sanctions lifted but the Caesar Syria Civil Protection Act of 2019 authorising them remains US law.\n\nSpeaking at a summit on the sidelines of the annual General Assembly, Sharaa said the sanctions imposed on the previous Syrian leadership were no longer justified and were increasingly seen by Syrians as measures targeting them directly. “We have a big mission to build the economy,” Sharaa said.\n\n“Syria has a diverse workforce. They love to work, it’s in its genes. So don’t be worried, just lift the sanctions and you will see the results.” Sharaa, the first Syrian president to participate in the General Assembly since 1967, is expected to deliver his first address at the General Assembly, which opens its 80th session on Tuesday.\n\nMembers of Congress have been debating whether to repeal the Caesar Act, which imposed wide-ranging sanctions on Syria under Assad. Some lawmakers, including Trumps fellow Republicans as well as Democrats, want its repeal to be included as an amendment in the National Defence Authorisation Act, a sweeping defence bill expected to pass by the end of December.\n\nWashington has separately been pressuring Syria to reach a security deal with Israel during the New York meetings this week.\n\nIsrael and Syria remain formally in a state of war rooted in territorial disputes, military confrontations and deep-seated political mistrust. Damascus hopes to secure a halt to Israeli airstrikes and the withdrawal of Israeli troops who have pushed into southern Syria.\n\nSharaa said those talks had reached an advanced stage and he hoped the outcome would preserve Syria’s sovereignty and address Israeli security concerns.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d1ccc458f64.gif",
  "retrievedAt": "2025-10-12T04:17:43.456Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944015/damascus-urges-us-to-formally-drop-sanctions",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T01:03:16.000Z"
}
