{
  "title": "TOMCL secures $8.1m export deal - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Organic Meat Company Ltd (TOMCL) has signed a new export contract worth $8.1 million with UAE-based Gold Crest Trading FZE for the supply of frozen boneless beef, expanding its footprint in the Gulf market amid growing demand for Pakistani meat products.\n\nIn a filing with the Pakistan Stock Exchange on Monday, TOMCL said the beef will be exported for industrial and household processing in the United Arab Emirates. The company expects to fully realise the contract’s revenues during the current fiscal year (FY26).\n\n“This contract reaffirms our position as a leading meat processor and exporter from Pakistan to the UAE,” TOMCL said, adding that the deal reflects the quality of its meat production and is expected to strengthen the company’s topline and create additional value for shareholders.\n\nBestway Cement to enter auto sector\n\nIn a separate development, Bestway Cement Ltd (BCL) has announced its intention to enter the automobile sector by incorporating a wholly owned subsidiary as a private limited company.\n\nAccording to a stock filing on Monday, BCL’s board of directors approved the formation of the new entity during its meeting held on Sept 19. The cement manufacturer plans to invest up to Rs4bn in equity and extend shareholder loans of up to Rs6bn to the new subsidiary, subject to approval by shareholders under Section 199 of the Companies Act 2017. The company did not disclose specific details about the planned venture, but the move signals a diversification strategy beyond its core cement business.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:18:16.922Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944043/tomcl-secures-81m-export-deal",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T00:59:00.000Z"
}
