{
  "title": "Saudi Arabia’s Grand Mufti Sheikh Abdul Aziz bin Abdullah al-Sheikh passes away: Royal Court - Pakistan - DAWN.COM",
  "author": null,
  "content": "Saudi Arabia on Tuesday announced the death of Grand Mufti Sheikh Abdulaziz Al al-Sheikh, the Saudi Press Agency (SPA) reported.\n\n“The Royal Court announced today the passing of Grand Mufti of Saudi Arabia Sheikh Abdulaziz bin Abdullah bin Mohammed Al Al-Sheikh, who also served as the head of the Council of Senior Scholars, the General Presidency of Scholarly Research and Ifta, and the Supreme Council of the Muslim World League,” SPA reported, adding that the funeral prayers would be him at Riyadh’s Imam Turki bin Abdullah Mosque today.\n\nThe report said King Salman bin Abdulaziz Al Saud also ordered that funeral prayers in absentia also be performed at Makkah’s Grand Mosque, Madina’s Masjid-i-Nabvi and in all mosques across the kingdom.\n\nThe Saudi Gazette said in a post on X that he was 82.\n\n“The Royal Court stated that with his passing, the kingdom and the Islamic world have lost a distinguished scholar who made significant contributions to the service of Islam and Muslims,” SPA said.\n\nIt added that King Salman and Saudi Crown Prince Mohammed bin Salman also extended their condolences to the grand mufti’s family, the Saudi nation and the Muslim world.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif expressed grief over the death, calling it a great loss for the Muslim world.\n\nThe president said that Sheikh Abdulaziz’s religious services and scholarly guidance would always be remembered.\n\nPM Shehbaz said the deceased was a great religious scholar who spent his entire life in religious activities and forwarding the cause of Islam.\n\n“His efforts and scholarly insight for the unity of the Muslim ummah will always be remembered. The Pakistani people and government share equally in the grief of the people of the brotherly country of Saudi Arabia and the Saudi leadership,” PM Shehbaz said.\n\nHe added that the grand mufti’s services were a “bright chapter in the religious and scholarly tradition”, adding that future generations would continue to receive guidance from his scholarly legacy.\n\nNational Assembly Speaker Sardar Ayaz Sadiq also extended his condolences to the Saudi leadership and people over the grand mufti’s death, paying tribute to his lifelong services and contributions.\n\nHe noted that Sheikh Abdulaziz’s scholarly, jurisprudential and religious legacy would remain a “guiding light” for the Muslim world.\n\n“Sheikh Abdul Aziz bin Abdullah Al-Sheikh held the distinguished honour of delivering the Haj sermon more times than any other scholar, a testament to his profound influence and revered standing in the Islamic world.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:09:35.430Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944122/saudi-arabias-grand-mufti-sheikh-abdul-aziz-bin-abdullah-al-sheikh-passes-away-royal-court",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T12:39:14.000Z"
}
