{
  "title": "Copenhagen, Oslo airports reopen after drone sightings - World - DAWN.COM",
  "author": null,
  "content": "Airports in Copenhagen and Oslo reopened on Tuesday, police said, hours after unidentified drones in their airspace caused flight diversions and other travel disruption.\n\nIn the Danish capital Copenhagen, police said several large drones seen over the airport for several hours late on Monday eventually flew away on their own.\n\n“The drones have disappeared and the airport is open again,” Deputy Police Inspector Jakob Hansen told reporters.\n\n“We didn’t take the drones down,” he added.\n\nHansen said police were cooperating with the Danish military and intelligence service to find out where the drones had come from.\n\nHe said police were also working with colleagues in Oslo after drone sightings in the Norwegian capital also caused the airport to close for several hours.\n\n“We had two different drone sightings,” Oslo airport spokeswoman Monica Fasting told AFP.\n\n“We reopened the airport around 3:15 am (6:15 am PKT),” she said.\n\nFlights were diverted to nearby destinations during the closures, and officials at both airports said they expected some delays and disruptions to continue on Tuesday.\n\nThe incidents came after the governments of Poland, Estonia and Romania accused Russia of violating their airspace this month, allegations that Moscow has brushed off.\n\nAsked whether the drones above Copenhagen airport could have come from Russia, Hansen, the deputy police inspector, said: “We don’t know at this point.”\n\nDanish police also said that drones that shut the country’s main airport appeared to have been flown by “a capable operator” seeking to demonstrate certain abilities, adding that no suspects had been identified.\n\n“We have concluded that this was what we would call a capable operator,” Danish police Chief Superintendent Jens Jespersen told reporters on Tuesday, referring to the drones observed in Copenhagen.\n\n“It’s an actor who has the capabilities, the will and the tools to show off in this way,” Jespersen said, adding that it was too early to say if the incidents in Denmark and Norway were linked.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2312030805fe2ad.webp",
  "retrievedAt": "2025-10-12T04:18:28.235Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944095/copenhagen-oslo-airports-reopen-after-drone-sightings",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T07:06:39.000Z"
}
