{
  "title": "Elite pact - Newspaper - DAWN.COM",
  "author": null,
  "content": "THERE is a new defence pact in town — or, shall one say, the region.\n\nPakistan and Saudi Arabia have signed a defence agreement with pomp and celebration and the announcement has caused much noise and buzz at home and abroad (in some places). Commentary, analyses, songs and discussions, applause — it is all there.\n\nAnd while the discussion is far from over and one can find much praise and a little bit of criticism from the cheerleaders and doubting Thomases, there is a consensus that very little information is available at the moment. Serious and insightful comment, it seems, will have to wait.\n\nIndeed, more details will need to be filled in and a fuller picture made available before a comprehensive analysis can be undertaken. No wonder then that at the moment, there are more questions than answers and more conjecture than information — questions about what this pact will mean operationally; what the two countries will commit to each other; whether or not this pact has been signed with a specific state in mind or not; and whether it will be expanded to include more countries or followed by more bilateral accords.\n\nBut even in the absence of answers, the euphoria in Pakistan is instructive. There is hope, conjecture and even belief that this pact will bring ‘good’ times for the country. And these hopes do not necessarily emanate from officialdom but are also being discussed privately.\n\nPartly, this is understandable because Saudi Arabia has always come to Pakistan’s rescue in the past — with oil on deferred payments as well as loans that help with our forever crisis, ie, low foreign reserves. Even now, the country is one of the biggest contributors to our reserves, with a loan that will be rolled over (and over) whenever the moment arrives.\n\nDomestically, the Pak-Saudi pact is being viewed exactly the same way as some past moments.\n\nSo now that there is a formal agreement in place for a bilateral defence pact, in which each promises to come to the aid of the one that is under attack, the conclusions everyone is jumping to are quick. Obviously, Pakistan will provide the muscle power in this relationship, with its well-known military prowess, and obviously, Riyadh will provide some financial concessions or assistance to Islamabad. The good times, they are a comin’.\n\nBut these assumptions reveal the elite consensus, shaped over decades, which continues to be in place. A consensus in which the elite want to use external funds to run the economy, wittingly or unwittingly accepting the primary role of the military in not just ensuring these funds but also being the main player domestically. And the politicians are willing to accept the role of the junior partner, in politics and in terms of the share of the money. Funds they too squirrel away while spending a wee bit on the populace.\n\nEven though the past few years seemed to offer little to no chance of geostrategic rents, the ruling elite was and is reluctant to change its mad, bad ways. The previous PML-N government counted on CPEC; the PTI had hopes of investment from overseas Pakistanis; the 2022 floods led to talk of climate-related aid; then came the talk about investment from the Gulf. The common thread running through all this is the notion that some external flows would help end the crisis without the country having to go through the pain of reform and real adjustment.\n\nIt is noteworthy that this ‘hope’ was real even though it was accompanied by a public debate on critical economic challenges and problems, in terms of diagnosis and prescriptions — whether it was to increase the tax base or to reduce government spending at the centre or even amend the NFC. The detail with which these discussions took place was unprecedented. But for those in power, even as they took part in these discussions, the political will was missing. Bad habits formed over years are simply part of the explanation.\n\nAnother reason for this is also the challenge of legitimacy. Those in power, be it the PTI government in power or the present set-up, are so insecure they would rather offer immediate relief, however unsustainable, than go through the painful reform process.\n\nIt is this hope of immediate relief that led to the ‘chatter’ around the domestic implications of this pact. While much of this conversation was positive, there were also comments about the fear of Pakistan selling itself cheap. This stems no doubt from the view that post-9/11, Pervez Musharraf had been overly eager to join the US-led effort and had not bargained well enough. Whether or not one agrees with this view, there is no doubt that the decision allowed the general to successfully create the mirage of economic prosperity and buffer his regime.\n\nHence, it is no wonder that, however much the world and Pakistan’s place in it are changing, domestically, this pact is being viewed exactly the same way as some past moments — an opportunity to stabilise and sustain this set-up, along with the balance of power it has put in place.\n\nHowever, it would be worth asking if the inflow that is being expected is going to be comparable to what came our way in the past — a question which requires the expertise of those more familiar with economic matters. But even if the sums are generous, what will this mean for the populace at large? For this elite consensus, for the most part, has also meant a complete disregard, if not wilful negligence, of the development of the people. And this neglect of the people will continue to pose the biggest challenge to the ruling elite, even if they are able to sustain the current set-up as well as successfully evade the criticism about the quality of democracy. It would be worth paying attention to this in the middle of celebrations.\n\nThe writer is a journalist.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d210a6d6518.png",
  "retrievedAt": "2025-10-12T00:09:45.696Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944070/elite-pact",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T03:15:38.000Z"
}
