{
  "title": "Country’s floods batter fields, factories and fiscal plans - Pakistan - DAWN.COM",
  "author": null,
  "content": "Massive floods in Pakistan have struck both the rural heartland and industrial centres for the first time in decades, causing billions of dollars in damage while straining food supplies, exports and a fragile economic recovery.\n\nThe government had been optimistic about 2026, pencilling in 4.2% growth on the back of a rebound in farming and manufacturing after the economy was stabilised under a $7 billion International Monetary Fund (IMF) bailout.\n\nInstead, record monsoon rains since late June, amplified by dam releases from India, have submerged large swathes of Punjab and Sindh.\n\nWhile waters have yet to recede in many districts, officials and analysts warn the hit could be deeper than in 2022, when a third of the country lay under water, due to dual shocks to agriculture and manufacturing.\n\nOut on the plains, satellite images have traced the scale. A report from agricultural monitoring initiative GEOGLAM estimates at least 220,000 hectares of rice fields flooded between August 1 and September 16.\n\nIn Punjab, 1.8 million acres of farmland have been inundated, according to the Provincial Disaster Management Authority.\n\n“About 50% of rice, and 60% of cotton and maize crops have been damaged,” said Khalid Bath, chairman of the Pakistan Farmers Association.\n\nHe said losses could exceed 2.5 million acres, worth up to Rs1 trillion.\n\n“This is unlike anything we have seen in recent decades,” said Iqrar Ahmad Khan, former vice chancellor of the University of Agriculture Faisalabad.\n\nHe estimates at least a tenth of the country’s crops are destroyed, with vegetable losses topping 90% in some districts.\n\nThe timing is perilous: Pakistan is about to sow wheat, the crop that provides nearly half of the country’s caloric intake. National reserves remain comfortable after a strong 2024 harvest, according to Crop Monitor, but the sowing window is at risk in fields still slick with silt and mud.\n\n“Food insecurity is coming, not just higher prices,” Khan warned.\n\nPlanning Minister Ahsan Iqbal acknowledged the floods would “set back” GDP growth and said a clearer damage tally would be ready in about two weeks.\n\nThe country’s central bank said the deluge would cause a “temporary yet significant supply shock,” and it put growth near the lower end of its 3.25–4.25% range.\n\nIt argued the shock would be less severe than the $30 billion disaster in 2022, with stronger forex reserves and lower interest rates offering some resilience.\n\nBut prices for wheat, sugar, onions and tomatoes have jumped, pushing a sensitive price index to a 26‑month high.\n\nIMF resident representative Mahir Binici said an upcoming review of the Extended Fund Facility this week will assess whether the 2026 fiscal year budget and emergency provisions can meet the nation’s needs. Iqbal called on the fund to “help us mitigate the damages”.\n\nSome economists say policymakers are underplaying the risks.\n\n“The floods will increase the current account deficit by $7 billion. They are worse than the previous floods,” former finance minister Hafeez Pasha said.\n\nIn industrial cities such as Sialkot — a hub for the textiles, sporting goods and surgical equipment that underpin Pakistan’s exports - several workshops were marooned.\n\nThe hit to agriculture is also a blow for manufacturers. Industrialists say cotton shortfalls will ripple into the textile sector, the country’s top foreign exchange earner, while rice exporters warn Pakistan risks losing competitiveness to India as prices rise.\n\n“We had 400 acres of cotton, but only 90 are left,” farmer Rab Nawaz said, near the city of Multan.\n\nAt least 1,006 people have been killed since June 26, the National Disaster Management Authority said, while over 2.5 million people have been evacuated in Punjab and Sindh.\n\nIn Lahore, homes and small businesses were gutted.\n\nMohammad Arif, a 50 year old rickshaw driver and father of five, said he moved his vehicle to higher ground as his home was inundated. “We have been on the roads for three days,” he said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:09:33.693Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944130/countrys-floods-batter-fields-factories-and-fiscal-plans",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T14:40:28.000Z"
}
