{
  "title": "PTI leaders asked not to approach ‘powers that be’: Aleema - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Former prime minister Imran Khan’s sister, Aleema Khan, claimed on Monday that her brother had barred the party leadership from contacting “the establishment”, stressing that they should reach out to her brother directly if they are genuinely interested in talks.\n\nShe made these remarks while talking to media persons outside Adiala Jail after the hearing of the Toshakhana-2 case.\n\n“Imran has directed party leaders and workers not to contact the establishment, and if the establishment wants to talk, it should directly talk to him,” she said.\n\nCommenting on the Toshakhana-2 case, Ms Khan said that last week, the main witness had been discredited, yet the judge did not close the matter.\n\n“Moreover, Brig Ahmed and Col Rehan [Imran Khan’s former military secretaries] also confirmed that the documentation on gifts was complete. So logically, the case is concluded, but the judge is still recording statements of investigation officers. We strongly believe it will be closed in the next two to three hearings,” she said.\n\nOn the Al-Qadir case, Ms Khan noted that Justice Dogar had not taken it up for the past ten months. “However, finally, the case will be heard on the 25th of this month, and we hope that bail will be granted,” she added.\n\nSaudi pact, cricket team\n\nRegarding the Pakistan-Saudi Arabia agreement, Aleema said her brother was already aware of the deal and appreciated it, saying it was the duty of Pakistanis to protect the Haramain Sharifain.\n\nShe said Mr Khan had also expressed disappointment over press reports regarding the cricket team’s performance. She quoted him as saying that in October 2021, Pakistan defeated India by 10 wickets with the same team.\n\nDrawing an analogy, Ms Khan said her brother compared Mohsin Naqvi’s management of the Pakistan Cricket Board with the way the country was being governed, saying that both faced the same challenges.\n\nShe said her brother had urged the nation to participate in the upcoming Sept 27 public meeting in Peshawar to make it a success. Ms Khan added that Imran had directed Junaid Akbar and Ali Amin Gandapur to make joint efforts to ensure the rally’s success.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:09:46.726Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944056/pti-leaders-asked-not-to-approach-powers-that-be-aleema",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T02:15:13.000Z"
}
