{
  "title": "PPP marks Bilawal’s birthday by helping flood-hit people - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan People’s Party (PPP) distributed aid packages among the flood victims here on Monday at a ceremony coinciding with Chairman Bilawal Bhutto Zardari’s birthday.\n\nThe ceremony, held on PECO Road, was attended by key party figures, including Punjab Governor Sardar Saleem Haider and ex-premier Raja Pervaiz Ashraf.\n\nThe event organised by senior party leader Faisal Mir was attended by a large number of party workers and office-bearers, including Secretary General Syed Hassan Murtaza, Information Secretary Shehzad Saeed Cheema and Bushra Manzoor.\n\nAs per party officials, during the event as many as 30 families from the flood-affected areas of Kasur, Chiniot, Multan and Muzaffargarh received relief packages valued at Rs125,000 each.\n\nThe packages included essential items, such as bedding, clothes, cots, bicycles, solar lamps, kitchenware, health kits and a month’s supply of ration.\n\nThe affected families were also served breakfast before the ceremony.\n\nAddressing the gathering, former prime minister Raja Pervaiz Ashraf expressed his satisfaction at the initiative and emphasised the importance of collective action in the face of adversity.\n\n“This aid is a message that we must face this calamity together,” he said.\n\nHe praised the resilience of the Pakistani nation and acknowledged the ongoing flood relief efforts by both federal and Punjab governments. Governor Haider highlighted Bilawal Bhutto’s directive to celebrate his birthday by helping the flood victims, instead of holding lavish celebrations.\n\nHe announced that another flood relief package worth Rs1 billion would be launched in collaboration with the Lahore Chamber of Commerce and Industry, Geo Pak, and Sweet Home. Shehzad Cheema called on the Punjab government to prioritise service over politics. He acknowledged the flood relief work by the civil society in areas like Chichawatni and Kamalia, where government aid had been “slow to arrive”.\n\nFaisal Mir stated that the event was a fulfillment of Chairman Bilawal’s wish to dedicate his birthday to humanitarian service.\n\nAID FOR GAZA: The Punjab governor on Monday visited Lahore airport to oversee the departure of a plane carrying relief goods for the people of Gaza on behalf of the National Disaster Management Authority (NDMA).\n\nHe described the people of Palestine as brothers and sisters and stated that Israel had become a threat to global peace, urging the United Nations to take strict notice of Israeli “terrorism” and calling on all Islamic countries to unite in support of Palestine.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:10:13.057Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943959/ppp-marks-bilawals-birthday-by-helping-flood-hit-people",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T01:00:16.000Z"
}
