{
  "title": "Water reality - Newspaper - DAWN.COM",
  "author": null,
  "content": "IN Pakistan, only between 5-10 per cent of the annual water inflow is directed towards urban areas and industry. The rest is directed towards agriculture — of which more than half does not reach the fields or is not properly utilised for farming. In countries with better water management, less than half of that volume of water is needed for the number of crops we grow.\n\nWater specialists say the annual water inflow in Pakistan is not expected to change until at least 2050, unless some extreme, unlikely scenarios are modelled. The surface of the upper Indus basin is about 220,000 square kilometres. Of this, over 60,000 sq km is above 5,000 metres, the estimated mean altitude of the summer freezing season; it is assumed this area does not have significant ice melt. Some 7,000-8,000 sq km below the summer freezing level is the source of the bulk of the annual glacier melt. “[…] it is anticipated that for the upper Indus basin the primary impact of all but the most extreme climate change scenarios could be a shift in the timing of peak runoff, and not a major change in annual volume” (Yu et al, World Bank).\n\nThe annual water inflow in the Indus river does not vary greatly from year to year. It does vary from season to season, which calls for storage capacity for the low flow season. All countries do not require the same volume of storage as that depends upon the expected variability. It is misleading to talk of ‘storage volume per person’ and storage in terms of ‘average days of water demand’ compared to other countries as that is not necessarily relevant. Water expert Hassan Abbas says: “Rather than planning for more water — at the rate of perhaps 70pc wastage — we need to invest in increasing irrigation efficiency.”\n\nIt’s generally agreed that there was a slight temperature increase in the last century. That has resulted in much more rainfall. Roughly 50-80pc of the annual water inflow in the Indus basin is from mountain snowmelt (determined primarily by variations in winter precipitation) and (of that, about 18pc) from glacial ice melt (determined by changes in temperature, primarily during summer). The rest is from rainfall in the plains.\n\nBad policies, inefficiencies and poor management are glossed over.\n\nPakistan is estimated to be among the top 10 countries for the highest water use relative to GDP achieved. According to a study, water productivity for cereal crops in Pakistan is almost one sixth of the productivity realised in China. There is a substantial water loss in canal conveyance, then more is lost in distribution to farms and then in how it is applied (flood irrigation, etc). Inefficiencies and unfairness in canal irrigation lead to massive groundwater extraction, through tubewells, at a much higher cost.\n\nSo the pertinent factors are: amount of water inflows; percentage distribution between agriculture and urban areas/ industry; storage capacity required; efficiency and fairness in conveying water and its application in agriculture; unchecked groundwater extraction and its higher cost; the amount of water consumed relative to GDP or to crop production; choice of crops (some use much more water); efficiency of urban/ industrial water supply and usage; and finally, arrangements to safeguard against annual floods and to utilise that water productively.\n\nHowever, somehow many studies and articles instead put the onus of a perceived water shortage on population growth, rapid urbanisation and climate change. The bad policies, inefficiencies, mismanagement and the pressures that stop reform are glossed over after a brief mention. Obviously, when water is used so inefficiently, there will be even less per person in a growing population — but the glaring fact is that so far only around 5-10pc of water inflows are being direc­ted to urban areas/industry.\n\nNotwith­sta­n­d­ing all the above, some 10 years ago, the PCRWR (under the science & technology ministry) forecast that Pakistan would approach absolute water scarcity by 2025. This forecast, endlessly quoted by others, caused a huge scare about an impending disaster. We are now well into 2025. The country is inundated with water.\n\nThere are floods every year, sometimes more than at other times. Yet, each year it is a shock to our planners. Settlements are allowed in known flood-prone areas. Water drains are blocked by construction in urban areas or are simply not accommodated.\n\nIn conclusion, there is sufficient annual water inflow in Pakistan. The problem is bad governance and the pressures that don’t allow reforms. The pertinent issues here are not climate change, population growth or urbanisation. The focus should be on water security — not on scarcity — and efficient water management, producing more from the water consumed.\n\nThe writer is the author of Pakistan: Principles of Public Policy Redefined.\n\nzua2@yahoo.com\n\nPublished in Dawn, October 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e5c65269621.jpg",
  "retrievedAt": "2025-10-12T04:19:23.245Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947370/water-reality",
  "dateList": "2025-09-23",
  "date_published": "2025-10-08T02:04:31.000Z"
}
