{
  "title": "NA panel urges value addition to narrow China trade gap - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A parliamentary committee has raised alarm over the widening trade deficit with China, urging the government to prioritise value addition, institutional reforms, and accountability to enhance Pakistan’s export competitiveness.\n\nThe National Assembly Standing Committee on Commerce, chaired by MNA Jawed Hanif Khan, met on Monday to review key trade matters, including free trade agreements (FTAs), export facilitation, and the licensing framework for trade bodies. The committee expressed serious concern over Pakistan’s persistent trade imbalance with China and called for structural changes to improve export performance.\n\nOfficials from the Ministry of Commerce informed the committee that while imports from China reached a peak of $20.8bn in FY21, they declined to $17bn in FY25. However, Pakistan’s exports also fell to $2.7bn in the same period, down from $3.1bn in FY21 — highlighting the enduring trade gap.\n\nCommittee members noted that Pakistan continues to rely heavily on exporting raw materials such as copper and cotton, which are later re-imported in processed form. They stressed the need to shift toward value-added production in sectors like textiles, minerals, and halal meat, where export potential is estimated at $5bn.\n\nUnder Phase III of the China-Pakistan FTA, commerce ministry officials reported progress in signing 15 Sanitary and Phytosanitary (SPS) and Technical Barriers to Trade (TBT) protocols. A list of 700 items has been identified for tariff concessions, and a proposal for a “Green Channel” at the Khunjerab border is under review to facilitate smoother trade flows.\n\nThe committee also called for stricter accountability of trade officials posted abroad and urged enhanced diplomatic engagement to promote exports in global markets.\n\nReviewing other regional FTAs, the committee noted gains under the Malaysia–Pakistan Closer Economic Partnership Agreement (MPCEPA), particularly in seafood, maize, and textile exports. However, concerns were raised about the impact of recent floods on agricultural output, which could affect future trade.\n\nRegarding the Pakistan-Sri Lanka Free Trade Agreement, the committee appreciated the concessions extended across more than 80pc of tariff lines. However, in the case of the South Asian Free Trade Area members pointed to continued reliance on sensitive lists, which limits trade liberalisation.\n\nThe committee observed that most of Pakistan’s FTAs and Preferential Trade Agreements have delivered limited results due to structural issues, outdated agreements, low productivity, high energy costs, and the prevalence of technical and non-tariff barriers.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:19:22.322Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944041/na-panel-urges-value-addition-to-narrow-china-trade-gap",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T00:59:00.000Z"
}
