{
  "title": "Dengue patients continue to surface in Pindi, Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As many as 32 dengue patients were reported in the twin cities in a single day.\n\nAccording to the District Health Office (DHO) Islamabad, 12 cases were found in the federal capital out of which 11 were reported from the rural areas and one from urban area. As many as five cases were reported from Rawat, two from Tarlai and one each from Bhara Kahu, Koral, Sohan, Tarnol and I-14.\n\n“A total of 12 patients are admitted to hospitals and response to all cases has been carried out in accordance with World Health Organisation (WHO) protocols,” a DHO official said.\n\nThe District Health Office Islamabad has urged the public to follow preventive measures, particularly regular cleaning of water containers, tanks and coolers to help stop the spread of dengue. Citizens have been encouraged to play an active role in protecting their own health and the health of others.\n\nOn the other hand, 20 more patients went down with the mosquito-borne disease on Monday, takng the tally to 477 in the current season.\n\nAs many as 438 suspected people came to three government-run hospitals on Monday with fever and backache and other similar ailments while 37 of them were confirmed by dengue serology.\n\nOut of the 37 cases, 20 belonged to Rawalpindi while the remaining arrived from Islamabad and adjoining districts including Murree, Attock, Jhelum and Chakwal.\n\nA senior doctor at the Holy Family Hospital told Dawn that the number of dengue patients were increasing in the hospital but we managed to accommodate them. He said in Outdoor-Patient Department and Emergency, the patients with similar symptoms were recommended for dengue test.\n\nHowever, he said there was no death reported in the district so far. He said dengue patients were being kept in the special ward and all standard operating procedures were being followed to look after them.\n\nIn Rawalpindi, patients surfaced from Naseerabad, Kotha Kalan, Peshawar Road, Takht Pari, Sukho, Chak Jalal Din, Mohanpura, Dhoke Ali Akbar, Dhoke Syedan and other cantonment areas.\n\nTaxila\n\nDengue larvae were discovered at several sites in Hassanabdal during an inspection led by Assistant Commissioner Aqsa Imtiaz along with Deputy District Health Officer Dr Babar Hayat.\n\nImmediate legal action was taken against those responsible. The inspection covered residential areas, graveyards, marriage halls, junkyards and block factories where anti-dengue surveillance teams were also monitored.\n\nAssistant Commissioner Aqsa Imtiaz stressed that all potential breeding grounds for mosquitoes, especially sites with stagnant water, must be eliminated without delay.\n\nMs Imtiaz warned that dengue posed a serious threat to public health, urging citizens to maintain strict cleanliness at homes, rooftops and courtyards, keep water tanks covered, and avoid storing water in open utensils.\n\nShe further advised parents and teachers to ensure children wear full-sleeved clothing to reduce the risk of mosquito bites. She said the government was utilising all available resources to combat the spread of dengue, but the success of the campaign largely depended on the cooperation of the public.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:18:23.487Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943980/dengue-patients-continue-to-surface-in-pindi-islamabad",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T01:01:37.000Z"
}
