{
  "title": "Drones and cyber outages exposing aviation weak spots since 2017 - World - DAWN.COM",
  "author": null,
  "content": "Sightings of two or three large drones near Copenhagen airport late on Monday halted all take-offs and landings for nearly four hours, as Denmark linked them to a series of suspected Russian drone incursions and other disruptions across Europe.\n\nA string of drone sightings and digital outages has repeatedly disrupted airports since 2017. These episodes bypass core flight-safety systems and instead hit choke points such as check-in and boarding systems, power infrastructure and airfield perimeters, causing ripple effects across networks.\n\nMay 27, 2017: An IT failure at British Airways’ London hubs British Airways cancelled all flights from Heathrow, Europe’s busiest airport, and Gatwick on the first day of a holiday weekend after a data-centre power issue, affecting 75,000 passengers. A power surge on the morning of Saturday, May 27, hit BA’s flight, baggage and communication systems. It was so strong that it also rendered the backup systems ineffective, with knock-on delays lasting into the following Monday as systems were restored.\n\nDec 19, 2018: Repeated drone sightings at London Gatwick Persistent drone reports crippled London’s Gatwick Airport for three days during peak travel in the run-up to Christmas. Roughly 140,000 passengers and about 1,000 flights were affected in the biggest disruption since an Icelandic volcanic ash cloud in 2010. The British army was drafted in to Gatwick to deploy “specialist equipment” as the anti-drone capability needed was not yet commercially available. The length of the disruption at an airport the size of Gatwick was unprecedented. Dubai airport was shut a number of times in 2016 due to unauthorised drone activity, but the longest period was for under two hours.\n\nJan 11, 2023: Safety system failure causes nationwide halt in US The Federal Aviation Administration (FAA) ordered a nationwide ground stop lasting about 90 minutes, which disrupted more than 11,000 U.S. flights, following a “Notice to Air Mission” (NOTAM) system failure. This FAA system is meant to alert pilots to hazards, everything from snow, volcanic ash or birds near an airport. It also provides information on closed runways and temporary air restrictions.\n\nAug 28, 2023: NATS flight-data glitch in United Kingdom UK air traffic control limited flows after a flight-plan processing fault, forcing manual input. Around 1,500 flights were cancelled, and disruption spilled into the following day.\n\nJuly 19, 2024: Faulty CrowdStrike update caused a global Windows outage. A faulty security software update by global cybersecurity firm CrowdStrike triggered widespread Windows crashes, which affected numerous industries and grounded over 5,000 flights worldwide. Across the United States, Asia and Europe, carriers such as Delta Air Lines, Ryanair, United, and Air India said they had faced delays or disruptions. US cancellations topped 2,200 on day one, with nearly 7,000 delayed, and some airlines took days to fully recover operations.\n\nMar 21, 2025: A substation fire shuts down London Heathrow Britain’s Heathrow Airport, the world’s fifth-busiest, was shut for 18 hours after a huge fire at a nearby electrical substation knocked out its power, stranding over 200,000 people and costing airlines millions of pounds The airport had been due to handle 1,351 flights on Friday, flying up to 291,000 passengers, but planes were diverted to other airports in Britain and across Europe.\n\nSept 10, 2025: Drone incursion into Poland causes several airports to shut down Several Polish airports were temporarily closed on September 10th when around 21 suspected Russian drones entered Polish airspace. Warsaw Chopin and Modlin airports, as well as Rzeszow and Lublin airports in the country’s east, temporarily closed before resuming operations.\n\nSept 20, 2025: Cyberattack affecting multiple EU hubs. A cyberattack targeting check-in and boarding systems provider Collins Aerospace, owned by RTX, disrupted operations at several major European airports, including London’s Heathrow, Berlin Airport and in Brussels. Brussels Airport cancelled 25 flights on Saturday, 50 on Sunday and half of Monday’s flight departures due to persistent problems.\n\nSept 22, 2025: Drone incursion into Danish and Norwegian airspace. Two to three large drones repeatedly overflew Copenhagen’s airspace, prompting a nearly four-hour shutdown, diversions and delays, leaving tens of thousands of passengers stranded. Authorities in Norway also shut the airspace at Oslo airport for three hours after a drone was seen.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/23200306df052aa.webp",
  "retrievedAt": "2025-10-12T00:09:33.446Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944133/drones-and-cyber-outages-exposing-aviation-weak-spots-since-2017",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T15:04:37.000Z"
}
