{
  "title": "Permission for markhor hunting at Chitral Gol National Park resented - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHITRAL: The president of the Gahiret-Golen conservancy has demanded of the wildlife department to revoke its decision of shifting the Kashmir Markhor hunting permit of his conservancy to the buffer zone of Chitral Gol National Park (CGNP) for the forthcoming hunting season.\n\nTalking to reporters at the Chitral Press Club here on Monday, Faizur Rehman said that residents of villages from Gahiret to Golen had been engaged in conservation of markhor since early 1990s, which had led to a significant increase in the population of the wild goat from the brink of extinction.\n\nHe said that the driving force behind the successful community-based conservation was the trophy hunting introduced by the wildlife department in 1998, whose 80 per cent proceeds went to the local village conservation committees to be spent on collective development of the community.\n\nMr Rehman regretted that this year, the wildlife department had decided to select the CGNP buffer zone for trophy hunting, sending shockwaves across the area supporting hundreds of trophy-sized markhors.\n\nGahiret-Golen conservancy head threatens protest against wildlife dept’s decision\n\nHe insisted the buffer zone at Singur Dok had never been the habitat of Kashmir Markhor due to its proximity to the human settlements and scarcity of fodder and forage there.\n\nHe said the people of Gahiret-Golen would launch a protest movement to get the ‘controversial’ decision annulled.\n\nHe stressed that trophy hunting in the national park area was absolutely prohibited as per the Wildlife Act.\n\nRizanullah, divisional forest officer of CGNP wildlife division, told Dawn that the buffer zone of the national park at Singur Dok had a considerable population of markhor with many of them being the trophy-size.\n\nHe said he was not aware of the decision of the higher authorities of his department.\n\nTWO DIE BY SUICIDE: Two persons, including a married woman, died by suicide in Lower Chitral on Monday.\n\nThe police said Khurshid Ali Khan of Prayeet village ended his life by hanging himself with the beam of the roof of his room.\n\nSub-divisional police officer Sajjad Hussain told Dawn that the deceased was physics teacher in Army Public School, who was residing in Jughoor village and was found hanging on Monday morning. In the second incident, Kulsoom Bibi, a married woman in Garam Chashma, ended her life by jumping into the Chitral River. Her body was later recovered.\n\nSub-divisional police officer, Lot Koh, Hassanullah told Dawn that the deceased was the mother of a son and four daughters, and was said to be suffering from mental illness.\n\nAn inquiry had been initiated after postmortem of the bodies.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:10:11.717Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943942/permission-for-markhor-hunting-at-chitral-gol-national-park-resented",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T01:01:10.000Z"
}
