{
  "title": "Trump administration proposes new H-1B visa process favouring higher-skilled, better-paid workers - World - DAWN.COM",
  "author": null,
  "content": "The Trump administration released a proposal on Tuesday that would rework the H-1B visa selection process to favour higher-skilled and better-paid workers, according to a related Federal Register notice, a move that follows a White House proclamation on Friday introducing a $100,000 fee for the visas.\n\nThe new process, if finalised, would give heavier weight to applications by employers who pay high wages if annual requests for the visas exceed the statutory limit of 85,000, the notice said.\n\nThe move aims to better protect Americans from unfair wage competition from foreign workers, it said.\n\nPresident Donald Trump launched a wide-ranging immigration crackdown after taking office in January, including a push for mass deportations and trying to block citizenship for children of immigrants in the United States illegally.\n\nIn recent days, his administration intensified its focus on the H-1B programme, popular with tech and outsourcing companies for hiring skilled foreign workers. The Trump administration said on Friday it would ask companies to pay $100,000 per year for H-1B visas.\n\nSome big tech companies warned visa holders to stay in the US or quickly return, sparking a chaotic scramble to get back to the US. The White House later clarified that the fee would apply only to new visas.\n\nThe planned regulation, posted on Tuesday, would change an existing lottery process to obtain the visas if demand surpasses supply in a given year, creating wage tiers where higher-paying jobs would have a better chance of being selected.\n\nThe process to finalise a regulation can take months or even years. The notice suggested that the new rules could be in place for the 2026 lottery, meaning before a March registration period.\n\nTrump, a Republican, sought to reshape the H-1B process during his 2017-2021 presidency, but was stymied by federal courts and limited time at the end of his presidency.\n\nA similar regulation that aimed to shift the lottery process toward higher-paid applicants was delayed by Trump’s Democratic predecessor, Joe Biden, before it could go into effect in March 2021. It was then blocked by a federal judge in September 2021 and withdrawn by the Biden administration three months later.\n\nThe total wages paid to H-1B workers would increase to $502 million in fiscal year 2026, which begins on October 1, the notice said, citing US Department of Homeland Security (DHS) estimates.\n\nWages would increase by $1 billion in fiscal 2027, $1.5bn in fiscal 2028 and $2bn in fiscal 2029-2035, it said.\n\nAn estimated 5,200 small businesses that currently receive H-1B visas would suffer a significant economic impact due to the loss of labour, DHS said.\n\nUS Citizenship and Immigration Services, which issued the proposal, will give the public 30 days to comment beginning on Wednesday, the notice said.\n\nThe visa allows American firms to hire skilled workers essential to filling talent gaps and keeping them competitive. The programme’s supporters include Elon Musk, a naturalised US citizen born in South Africa, who has himself held an H-1B visa.\n\nCritics argue that the programme allows firms to suppress wages and sideline Americans who could do the jobs.\n\nIndia was the largest beneficiary of H-1B visas last year, accounting for 71 per cent of the approved beneficiaries, while China was a distant second at 11.7pc, according to government data.\n\nThe H-1B programme offers 65,000 visas annually to employers bringing in temporary foreign workers in specialised fields, with another 20,000 visas for workers with advanced degrees.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2320262782a7cc6.webp",
  "retrievedAt": "2025-10-12T00:09:33.176Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944143/trump-administration-proposes-new-h-1b-visa-process-favouring-higher-skilled-better-paid-workers",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T15:27:27.000Z"
}
