{
  "title": "Three killed, one injured in separate Karachi accidents: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three people died and one was injured on Tuesday in two separate road accidents in Karachi, according to police.\n\nAccording to a handout by Malir traffic police, a dumper truck crashed into a motorcycle coming from the opposite direction in Dur Muhammad Goth around 7.30am. “As a result, one of the men on the motorcycle died on the spot, while the other was injured,” the handout said.\n\nThe injured was shifted to Jinnah Postgraduate Medical Centre, it said, adding that the accident was caused by the dumper truck driver’s negligence and reckless driving.\n\n“The driver was arrested on the spot and taken to Memon Goth police station,” the handout said.\n\nIt added that both vehicles involved in the accident were also taken to the police station for legal procedure.\n\nPolice said further investigation of the incident was underway.\n\nMeanwhile, a young man was injured in a traffic accident in Karachi’s Nazimabad area.\n\nKarachi’s Edhi Information Centre reported that the man was injured while one-wheeling. He died during treatment at the Abbasi Shaheed Hospital.\n\nIn another fatal speeding accident near the fire brigade office in Nazimabad, two boys riding a motorcycle lost their lives in a collision with a parked vehicle.\n\nAccording to a report by the accident branch of Karachi traffic police said the two victims were injured and sent to the hospital via ambulance.\n\n“Both the motorcycle riders died during treatment,” it added.\n\nSeparately, a handout by the central traffic police said a motorcycle rammed into a stationary car in Nazimabad around 6.35am. As a result, both people on the motorcycle were injured and taken to the hospital.\n\nBoth of them died during treatment at the hospital.\n\nAccording to the police, the cause of the accident was speeding.\n\nThe city has lately witnessed a rise in traffic accidents, especially involving heavy vehicles, including dumpers and water tankers, which killed nearly 500 people and injured 4,879 in 2024, according to hospital data.\n\nAt least seven members of a family lost their lives earlier this month when a truck crashed into their car on a national highway near Moro.\n\nLast month, three people were killed and one was injured after a car hit a motorcycle at Karachi’s Drigh Road Underpass.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/231733207cc40eb.webp",
  "retrievedAt": "2025-10-12T00:09:33.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944113/three-killed-one-injured-in-separate-karachi-accidents-police",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T14:05:24.000Z"
}
