{
  "title": "GHQ attack case: Imran appears via WhatsApp, lawyers boycott proceedings as connectivity issues plague hearing - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI founder Imran Khan’s lawyers boycotted the proceedings of a Rawalpindi anti-terrorism court (ATC) on Tuesday after connectivity issues appeared to affect communication with the incarcerated former prime minister, who briefly joined the hearing via a WhatsApp call.\n\nAn ATC in Rawalpindi was hearing a case against Imran pertaining to an attack on the army’s General Headquarters GHQ) on May 9, 2023, when the PTI founder’s arrest had sparked violent protests across the country, during which state buildings and military installations were torched and vandalised.\n\nDuring today’s hearing, Imran was included via a WhatsApp call, following the court’s dismissal of a plea for his in-person appearance last week.\n\nHis lawyers, Salman Akram Raja and Faisal Malik, sought Judge Amjad Ali Shah’s permission to talk to the ex-premier. But during the call, Imran’s voice was disrupted and his face appeared blurred on screen, leading his lawyers to boycott the court proceedings.\n\nThey stated that such a trial was “unfair”.\n\nThe court, however, recorded the statements of eight witnesses, including the Pakistan Electronic Media Regulatory Authority additional director, the Federal Investigation Agency’s technical assistant and the Pakistan Information Department deputy director.\n\nFor their part, the PTI lawyers said they “rejected” the recording of witnesses’ statements in this manner.\n\nThe court then adjourned the hearing, summoning more witnesses on September 27.\n\nImran was indicted in the case on December 5 last year. The PTI founder, who has been incarcerated in Adiala Jail since August 2023, was arrested by the Rawalpindi police in the May 9 protest case in January 2024.\n\nAfter boycotting the court proceedings, Raja also expressed his grievances during his interaction with the media.\n\n“A mobile phone was placed before Khan sahib in jail, on which a video call was made. On this side, the judge received the call on a phone he had,” he said. He added that during the call Imran could not hear what was being said in the court and those present in the courtroom could not hear him.\n\n“Then obviously, Khan sahib is unaware of the testimonies being recorded,” he said.\n\nHe also shared that they had requested the judge to let them talk to Imran, but they were unable to do so. “The judge said that [we] were unable to talk [to Imran] because the link was very weak.”\n\nHe also highlighted that they had the right to talk to Imran alone. “But this right, too, was denied,” he added.\n\nRaja said they had prepared an application, which Malik would be submitting to the court.\n\n“And we have conveyed to the court that it is not possible for us to remain a part of this process … There should be an open trial and the accused should be given the chance to talk to his lawyers,” he continued.\n\nRaja said that they had also filed a plea “against this process” with the Lahore High Court’s Rawalpindi bench.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2316055776e78a6.webp",
  "retrievedAt": "2025-10-12T04:18:44.409Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944116/ghq-attack-case-imran-appears-via-whatsapp-lawyers-boycott-proceedings-as-connectivity-issues-plague-hearing",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T11:27:47.000Z"
}
