{
  "title": "Asia Cup: Big-hitting Nawaz, sedate Hussain steer Pakistan to crucial victory against Sri Lanka - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan won by 5 wickets after restricting Sri Lanka to 133-8 to register their first win in the Super Four stage of the men’s Asia Cup in Abu Dhabi on Tuesday.\n\nPakistan were playing their first match of the tournament in Abu Dhabi, where the scores are generally higher than in Dubai.\n\nHussain Talat was adjudicated player-of-the-match for 32 runs of 30 deliveries as he held the Pakistani innings together with Mohammad Nawaz in an unbeaten 58-run partnership.\n\nThe Men in Green were struggling at 82-5 at one stage after spinners Maheesh Theekshana and Wanindu Hasaranga struck in the middle overs, and the runs dried up after a brisk start.\n\nHowever, Nawaz and Hussain made sure that Pakistan cruised to victory in style with 12 balls to spare — with Nawaz hitting three sixes in the 18th over to complete the chase.\n\nIn the first innings, Shaheen Afridi was the pick of the bowlers for the Green Shirts as he got yet another first-over wicket and ended with figures of 3-28.\n\nSpeaking after the match, Pakistan skipper Salman Ali Agha said, “I cannot say it was a perfect game. We lost four wickets in three overs, but apart from that, it could be a perfect game, but we need to stop doing that.”\n\n17.1: Nawaz smacks the length ball by Chameera over deep point for a six!\n\nHe seems to be in a hurry!\n\n17.4: Nawaz smashes it over deep mid wicket!\n\n17.6: Initially looked like it was mistimed, but sails over the long-on boundary as Nawaz finishes off things in style.\n\nThree sixes to finish off the innings by Nawaz!\n\n16.4: Hasaranga is smoked to the boundary over extra cover by Hussain! An exquisite boundary as the ball bounces once and goes over the fence.\n\nHussain is suffering from cramps as the Abu Dhabi heat gets to the left-handed batter.\n\nAn lbw appeal and a run-out chance, a nervy over for Pakistan as Sri Lankan skipper Charith Asalanka comes back into the attack.\n\n100 up for Pakistan as Nawaz smacks Thushara for four!\n\nNawaz leads Pakistan’s counterattack with an exquisite cover drive for four as Thushara returns to bowl.\n\nMohammad Nawaz breaks the shackles, taking on Hasaranga for two consecutive boundaries as Pakistan try to construct a partnership again.\n\nHussain survives a review for lbw by Theekshana, only for the replays to show the ball would have missed the stumps by miles, but nothing more for Pakistan than five runs in the over.\n\n11.1: Chameera strikes Haris’ stumps as Sri Lanka claw back advantage.\n\nThe change works wonders for Sri Lanka as Dushmantha Chameera rips through Haris to dislodge his middle stump to break his fledgling partnership with Hussain.\n\nMohammad Nawaz is the next man in — who had a horrid outing against India in the previous match.\n\n10.3: Theekshana goes searching and dishes out a half-volley outside off, which is smacked over extra by Haris!\n\nHaris and Hussain keep things steady with good running between the wickets after the former lofts Theekshana for a one-bounce four over the covers.\n\nMid-innings analysis by Umaid Wasim: Pakistan have blown hot and cold in their low chase. Sahibzada and Fakhar got off to a quick Pakistan off to a good start but since then, Sri Lanka have hit back. It’s an even game now and Pakistan need to do well to get over the line.\n\nChamika Karunaratne into the attack, let’s see if the medium pacer can emulate Hussain’s heroics from the first innings.\n\nWith Karunaratne introduced into the attack, Mohammad Haris and Hussain Talat look for quick singles and hold back with the power-hitting as Pakistan eye recovery from the top-order collapse.\n\nHasaranga strikes again!\n\nHasaranga continues to haunt Pakistan, sending back Salman as well with another googly that traps him in front, as Pakistan now required to build again.\n\n7.5: Asalanka to Talat, he smacks him for four!\n\nHussain Talat, after springing a surprise with the ball, scores Pakistan’s first boundary after they lost their top three, cutting Charith Asalalanka’s off-break through the off-side.\n\nHasaranga, himself is into the attack.\n\nHasaranga piles up the misery on Pakistan and sprinkles salt on their wounds by imitating Abrar Ahmed’s famous celebration. Saim Ayub fails to impress yet again, undone by a perfect googly.\n\n5.3: Theekshana returns and strikes to get rid of Sahibzada!\n\nHe imitates Abrar’s celebration in response to Abrar copying Hasaranga’s style of celebrating in the first innings\n\nTheekshana returns to remove both Pakistan openers with Hasaranga taking a stunning catch to dismiss Fakhar. Pakistan are all of a sudden under pressure.\n\nChameera is back into the attack.\n\nPakistan add seven to the total in Chameera’s second over as Fakhar and Sahibzada keep up their attacking rhythm.\n\nFakhar survives a stumping chance in Maheesh Theekshana’s first over, cuts one for four to take Pakistan closer to the target.\n\n2.2: Sahibzada smacks Thusara for a six over long-on!\n\n2.4: Sahibzada is caught by Hassan Nawaz! But it’s outside the long-off boundary as the right-handed opener launches Thusara over the rope!\n\n2.5: The Peshawar-born batter is in a hurry today! he launches the Sri Lankan pacer for a sublime boundary through the covers.\n\nSahibzada Farhan shows pure class to clear the long-on and long-off boundaries for sixes before creaming Thushara for a four through the off-side as Pakistan cruise.\n\n1.3: Dushmantha Chameera pings Fakhar Zaman on the helmet with an absolute express delivery!\n\nThere is a stoppage in play as the concussion protocol is being followed.\n\nThere is still enough spice in the pitch as Pakistan start their chase, and Chameera with his pace will extract any possible assistance on offer.\n\n1.6: Fakhar breaks the shackles as he hops down the wicket and smacks Chameera for a boundary through mid-wicket!\n\nDushmantha Chameera rattles Fakhar Zaman with a rising bouncer but Sri Lanka lose a review in turn as Fakhar passes a concussion test to continue his stay on the crease. But the Pakistan batter responds with aggression to open Pakistan’s boundary account.\n\n0.1: Pakistan are off the mark as Sahibzada takes a single off Nuwan Thushara.\n\nA tidy first over by Sri Lanka’s slingy pacer Nuwan Thushara as Pakistan openers Sahibzada Farhan and Fakhar Zaman demonstrate restraint.\n\nMid-innings analysis by Abyan Amir: The Pakistani pacers ruled the roost on a pitch that offered assistance to the fast men up front.\n\nKamindu Mendis was the lone warrior for the Islanders as he anchored the Sri Lankan innings with a 50 of 43 deliveries.\n\nShaheen Afridi continued with his knack of getting wickets in the very first over when he got Kusal Mendis out on just the second ball of the innings.\n\nThe Pakistani bowlers have set up this match for the batters to romp home with ease, and the batting is finally clicking after scoring 171 against India on a much slower Dubai wicket.\n\nWill the Green Shirts be able to chase this down with ease and stamp their authority in the Super 4 stage?\n\nOr will this be yet another stop-start and nervy chase of a below par score, lets see!\n\nHaris bowls the last over of the innings. Sri Lanka need this over to be a big one!\n\n18.4: The Pakistani skipper takes an excellent catch running back at mid-on, Haris strikes as Chameera departs for one!\n\nHaris Rauf concedes an unlucky boundary but deceives Dushmantha Chameera with a slower one to send him back before Salman takes a brilliant catch at mid-on, running backwards to deal with the skier as Pakistan cap an impressive bowling show.\n\nShaheen returns.\n\n18.3: 50 up for Kamindu! The batter scrapes his way to the milestone and holds the innings together.\n\n18.4: Shaheen strikes with an absolute beast of a yorker that hits the batter’s toe! Kamindu departs after a valiant knock.\n\nFaheem is bowling again. Can the Faisalabad-born all-rounder end his spell well?\n\n16.1: Haris returns and gets hit for four by Kamindu!\n\nThe express pacer has been expensive today.\n\nHaris misses out only once and concedes a boundary but then comes back with superb bowling to keep Sri Lanka quiet as Kamindu Mendis struggles for runs.\n\nThe camera pans to the Sri Lankan coach Sanath Jayasuriya — he does not look happy with his team’s effort so far.\n\n15.3: Hussain gets hit for a boundary by Kamindu — the first boundary for the Islanders after 28 deliveries!\n\nKamindu Mendis moves around in the crease, desperate for runs and edges one past short third-man to get a welcome boundary off Hussain Talat, but that’s all he could do as the medium-pacer mixes up pace with expertise.\n\nChamika Karunaratne faces Abrar.\n\nAbrar finishes his quota of four overs, conceding only eight runs and taking the prize wicket of Hasaranga. His last over saw Sri Lanka scoring only a couple of runs.\n\nFaheem back into the attack. Three runs off the over.\n\nOverheard in the newsroom: Shaheen needs to open today and finish the match in 10 overs!\n\nSri Lanka’s worries continue as Faheem comes back into the attack and concedes only five runs.\n\n12.1: Abrar does the Hasaranga celebration after bowling the Sri Lankan spinner!\n\nThe pressure was piling on and Sri Lanka needed an out. They picked Abrar Ahmed to go after but the decision backfired as the spinner cleans up a big-heaving Hasaranga before delivering five more good balls for only two runs.\n\nHaris came back into the attack after a wicket and an expensive first over.\n\n11.4: Sri Lanka get their first boundary after 21 balls as Haris is dispatched to the fence.\n\nHe helps Sri Lanka break the shackles with a short and wide delivery in what was otherwise a good over.\n\nAbrar returns, and Hasaranga is down for the count after being hit by a Kamindu drive down the ground.\n\nAbrar keeps it tight again as Wanindu Hasaranga and Kamindu Mendis —otherwise hard-hitters — continue to hold back from their natural game.\n\nMid-innings analysis by Dawn’s Umaid Wasim: Pakistan have the game under control for now, with Hussain Talat springing a surprise with the ball by picking up two wickets in two balls. The key now is to keep the momentum in this must-win clash.\n\nEspncricinfo says Kusal Mendis bagged his third golden duck against Pakistan today, and he is yet to score a run against the Green Shirts in T20Is.\n\nThe dangerous Hussain returns to bowl his second over; he is bowling well on this Abu Dhabi wicket.\n\nHussain Talat returns and delivers another decent over, giving away just five runs as Sri Lanka find some sort of stability.\n\nAbrar Ahmed is into the attack. The mystery spinner did not have a good outing in the last match against India.\n\nThe mystery spinner bowled with rhythm and accuracy, giving away only three runs.\n\n7.2: Hussain Talat into the attack, and he strikes!\n\n7.3: Hussain strikes again, the medium pacer sends Dasun Shanaka back into the hutch.\n\nOverheard in the newsroom: This is the value Hussain adds to the side. Two wickets in two balls\n\nCaptain Salman Ali Agha into the attack.\n\nPakistan captain Salman introduces himself in the attack and delivers a decent over, creating half a chance as Saim Ayub misses a difficult opportunity at midwicket. Just five coming off it.\n\n6.1: Haris Rauf starts with a freebie, and Perera deposits it through the covers.\n\n6.2: Haris strikes! Perera is deceived by the lack of pace, and the Islanders are three down in the power play.\n\n6.6: Kamindu deposits Haris for six!\n\nPakistan’s man in form Haris arrives and causes another Sri Lankan casualty — and that too a big one in Perera. Haris, however, followed it with waywardness and was punished by the incoming Kamindu Mendis.\n\nThe power play ends with both sides exchanging blows — Pakistan got wickets but the Sri Lankan batters kept on scoring boundaries.\n\nShaheen returns after his double-strike in the first 2 overs.\n\n5.6: Shaheen ends with an absolute jaffa that beats the Sri Lankan captain all ends up!\n\nShaheen adjusts his lengths masterfully as he delivers a boundary-less over against the run of play. Only three runs coming off it as Pakistan slightly curtail Sri Lanka’s run-rate.\n\n3.3: Asalanka cuts Faheem for a boundary through the backward point.\n\n3.4: The Sri Lankan skipper follows it up with a hack over mid-on that evades the waiting fielder — the ball trickles to the boundary for back-to-back boundaries.\n\nThe bounce on the wicket is as true as the seam, and Sri Lanka are fully capitalising each time it comes onto the bat. An upper square-cut by Asalanka and a heave over mid-on by the skipper keep Sri Lanka’s scoring rate high despite the early wickets.\n\n2.2: Pathum Nissanka greets Shaheen with a six down the ground but the left-arm pacer has his man the very next ball!\n\n2.4: Slower delivery by Shaheen on a free hit, and the Sri Lankan captain Charith Asalanka dispatches it for six!\n\nNissanka doubled the sixes column with another beautiful shot, but Shaheen bounced back with yet another wicket as the opener nicked it to the keeper. The left-armer followed that up with a dangerous beamer before Perera pulled for six again off the free-hit.\n\nFaheem Ashraf into the attack.\n\nPakistan’s old tormentor with the bat, Kusal Perera, greets Faheem with a six over mid-wicket!\n\nPerera’s extraordinary flick of wrists for six off Faheem Ashraf gives Sri Lanka confidence after the early wicket. But there were encouraging signs for the bowler as well as the ball seamed big off the surface.\n\nShaheen Afridi has the new ball.\n\nShaheen brings the first ball into Pathum Nissanka.\n\nPakistan draw first blood! Kusal Mendis gets a leading edge and Hussain Talat grabs an easy chance at mid-wicket.\n\nAn early breakthrough for Pakistan in the very first over has given them a flying start and Shaheen Shah Afridi must be licking his lips with the seam on offer. While Kusal Mendis’ dismissal came off a shot from the middle of his bat, Shaheen followed it with sharp outswing against Pathum Nissanka.\n\nAnthems:\n\nThe Sri Lankan anthem is being played first.\n\nThe Pakistani anthem follows.\n\nPitch report:\n\n“It looks beautiful,” former New Zealand cricketer Simon Doull said in the pitch report.\n\n“There is a nice grass covering, and that should help the ball come onto the bat,” he said, adding that there might be a bit of early help for the pacers, and Doull reckons there may not be a lot of spin.\n\nDawn’s Mir Shabbar Ali reckons that the pitch is a batting-friendly one and will reward good cricketing shots as it did for Oman in their fighting loss against India in the Group A fixture —the last match played on this venue.\n\nSri Lanka also chased down a decent target set by Afghanistan in their group match on this surface. But in that game only, Nuwan Thushara’s slingy pace bowling flourished early on, which shall be a good sign for not only Thushara but Pakistan’s in-form bowler Haris Rauf as well.\n\nTeams:\n\nThe Green Shirts are unchanged from their last encounter against India on Sunday.\n\nPakistan: Sahibzada Farhan, Fakhar Zaman, Saim Ayub, Salman Ali Agha (captain), Hussain Talat, Mohammad Nawaz, Mohammad Haris, Faheem Ashraf, Shaheen Shah Afridi, Abrar Ahmed, and Haris Rauf.\n\nSri Lanka: Pathum Nissanka, Kusal Mendis (wicket-keeper), Kusal Perera, Charith Asalanka (captain), Dasun Shanaka, Kamindu Mendis, Wanindu Hasaranga, Chamika Karunaratne, Maheesh Theekshana, Dushmantha Chameera, and Nuwan Thushara.\n\nReeling from early setbacks in the Super Four stage, both Pakistan and Sri Lanka will be desperate to register their first win in this critical stage of the Asia Cup.\n\nDefending champions Sri Lanka, who breezed through the group stage unbeaten, were jolted by a four-wicket loss to Bangladesh in their Super Four opener. The defeat not only disrupted their rhythm but also snapped an impressive eight-match winning streak in the Asia Cup.\n\nOn the other hand, off-field issues have dominated headlines around the Pakistan team, overshadowing their middling performances on the field. They are in a spot of trouble after suffering yet another humbling defeat at the hands of arch-rivals India on Sunday, their second loss to their archrivals in this tournament.\n\nIndia and Bangladesh have two points each, with Suryakumar Yadav’s men leading the standings owing to a superior net run-rate. Sri Lanka and Pakistan occupy the third and fourth spots, respectively.\n\nWith little time for recovery, Pakistan skipper Salman Ali Agha and his side now face a must-win situation under mounting pressure.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/240055397cfa042.webp",
  "retrievedAt": "2025-10-12T00:09:32.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944128/asia-cup-big-hitting-nawaz-sedate-hussain-steer-pakistan-to-crucial-victory-against-sri-lanka",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T14:04:45.000Z"
}
