{
  "title": "‘Time for action is now,’ Dar tells UNSC, welcomes increasing recognition of Palestinian state - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Tuesday told the United Nations Security Council that now was the time for action to resolve the ongoing crisis in the Gaza Strip and also welcomed the increasing recognition of a Palestinian state by more countries.\n\nFM Dar is part of a delegation being led by Prime Minister Shehbaz Sharif at a high-level segment of the 80th session of the United Nations General Assembly (UNGA) from today, drawing the attention of the international community towards the “grave crisis” in Gaza and calling for “decisive action” to end the suffering of Palestinians, according to a statement by the government.\n\nWorld leaders gather in New York every September for several days of speeches at the annual UNGA session.\n\nAddressing a UNSC session on the Middle East, FM Dar said: “Gaza has become a graveyard for humanity and the global conscience. We call upon the Security Council and the broader international community to act decisively, to uphold human dignity, to ensure accountability and deliver justice.\n\n“The time for words has passed, the time for action is now.”\n\nReiterating the damage and devastation in Gaza, along with the numerous people killed and the plight of those still surviving, he said the humanitarian situation had reached “catastrophic proportions” with the people starving and famine gripping the territory.\n\nHe said Pakistan welcomed France’s summit on the two-state solution, co-sponsored with Saudi Arabia, and commended the recent recognition of the Palestinian state by more UN members, saying it “reflects adherence to justice and the principle of international law”.\n\nFM Dar also addressed the Organisation of Islamic Cooperation (OIC) Committee of Six on Palestine, reaffirming Pakistan’s unwavering support for the Palestinian cause.\n\nStressing that this was a “defining moment” for the Muslim world, he called on the OIC to press urgently for a permanent ceasefire, unrestricted humanitarian access, an end to illegal settlements, accountability for war crimes, reconstruction of Gaza under the Arab-OIC plan, and the protection of Palestinian lives.\n\nThe prime minister earlier attended the opening of the general debate of the UNGA’s 80th session with FM Dar.\n\nDefence Minister Khawaja Asif and Information Minister Attaullah Tarar are also accompanying the premier.\n\nIn his address to the General Assembly this year, PM Shehbaz will urge the international community to resolve the situations of prolonged occupation and denial of the right to self-determination in India-occupied Kashmir and Palestine, the government statement posted on X said. It added that the PM will also highlight Pakistan’s perspective on the regional security situation, as well as other issues of international concern, including climate change, terrorism, Islamophobia, and sustainable development.\n\nPM Shehbaz’s “participation in this biggest annual gathering of global leaders will showcase Pakistan’s strong commitment to multilateralism and the United Nations and to highlight Pakistan’s longstanding contribution towards the shared objectives of peace and development,” the statement read.\n\nOn the sidelines of the meeting, the premier met with Austria’s Federal Chancellor Christian Stocker.\n\nHe also met Kuwait’s Crown Prince and Prime Minister Sheikh Sabah Al-Khalid.\n\nThe prime minister had reached New York late Monday night after departing from London.\n\nOn the sidelines of the UNGA session, he will also hold meetings with World Bank President Ajay Banga and International Monetary Fund Managing Director Kristalina Georgieva.\n\nAccording to the government statement, the PM will exchange views on issues of mutual interest during his bilateral meetings with world leaders and senior UN officials.\n\n“He will also underline Pakistan’s resolve to work with all UN Member States to uphold the UN Charter, prevent conflict, foster peace and promote global prosperity in Pakistan’s current role as a member of the Security Council.”\n\nMoreover, he will attend several high-level events, including important meetings of the UN Security Council, a high-level meeting of the Global Development Initiative on the theme “Recommit to our Original Aspirations, United to Build a Brighter Future of Global Development” and a special high-level event on climate action, the government statement said.\n\nIn New York, PM Shehbaz will also attend a special summit of Arab and Muslim countries, co-hosted by the United States and Qatar, in which US President Donald Trump will also participate.\n\nThe prime minister has been specially invited to participate in the summit.\n\nWhite House Press Secretary Karoline Leavitt told reporters on Monday that Trump will hold a multilateral meeting with Saudi Arabia, the UAE, Qatar, Egypt, Jordan, Turkey, Indonesia and Pakistan.\n\nA person familiar with the matter said Gaza will be discussed, according to Reuters.\n\nAxios reported that Trump will present the group with a proposal for peace and post-war governance in Gaza.\n\nIn addition to freeing hostages and ending the war, Trump is expected to discuss US plans around an Israeli withdrawal and post-war governance in Gaza, without Hamas involvement, according to Axios.\n\nWashington wants Arab and Muslim countries to agree to send military forces to Gaza to enable Israel’s withdrawal and to secure funding for transition and rebuilding programs, Axios reported.\n\nAhead of the start of the UNGA session today, France and Monaco extended formal recognition to the State of Palestine at a high-level conference in New York on Monday.\n\nFM Dar, who represented Pakistan at the conference, was not among the speakers — which inc­luded heads of state and government from countries such as Turkiye, Australia, Brazil and Canada, among others.\n\nHowever, he welcomed ann­ouncements regarding the recognition of Palestine by several countries on X.\n\nAccording to state-run PTV News, Dar met Canadian Foreign Minister Anita Anand today on the sidelines of the UNGA session. “They acknowledged the positive trajectory of Pakistan–Canada relations, agreed to further strengthen economic and trade ties and recognised the vital role of the Pakistani diaspora in Canada,” PTV News reported.\n\nDar also posted a picture of himself with Syrian President Ahmed al-Sharaa on X. In his post, he said he had “reaffirmed Pakistan’s solidarity with the Syrian people”, in his meeting with the Syrian president. “And we shared the resolve to further deepen historic Pakistan–Syria friendship through cooperation across diverse domains, including trade, human capital and development.”\n\nState broadcaster Radio Pakistan reported that the foreign minister also met Gulf Cooperation Council (GCC) Secretary General Jasem Mohamed Al-Budaiwi.\n\nDar underscored during the meeting the importance Pakistan attaches to its ties with the GCC and reaffirmed Pakistan’s commitment to further strengthening multifaceted cooperation with the Council member states, the report said, adding that both sides discussed ways to enhance collaboration across various sectors and to expand institutional linkages between Pakistan and the GCC.\n\nAccording to the FO, the foreign minister also met his Hungarian counterpart today.\n\n“The two sides expressed their resolve for the early finalisation of the agreement for the protection of mutual investments, agreement on cooperation in the area of civil aviation and commencement of direct flight operations between the two countries, as well as finalisation of visa abolition agreement for diplomatic and official passport holders,” the FO statement said.\n\nYesterday, he took part in the Commonwealth Foreign Affairs Ministers Meeting at UN Head­quarters. He also participated in consultations hosted by Prime Minister and Foreign Minister of Qatar Sheikh Mohammed bin Abdulrahman Al Thani. Other participants included the deputy prime ministers of Jordan and UAE, and the foreign ministers of Egypt, Indonesia, Saudi Arabia and Turkiye. He also met with his Canadian counterpart Anita Anand.\n\nAdditional input from APP and Reuters.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/232257593240ae9.webp",
  "retrievedAt": "2025-10-12T04:19:09.099Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944089/time-for-action-is-now-dar-tells-unsc-welcomes-increasing-recognition-of-palestinian-state",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T06:19:43.000Z"
}
