{
  "title": "China penalises ByteDance and Alibaba platforms in content crackdown - World - DAWN.COM",
  "author": null,
  "content": "China’s top internet regulator said Tuesday it would take action against ByteDance-owned news app Jinri Toutiao and Alibaba’s internet browser company UCWeb for allegedly displaying harmful content, a day after announcing a two-month social media crackdown.\n\nThe Cyberspace Administration of China (CAC) vowed on Monday to combat content containing “malicious incitement of conflict” and “negative outlooks on life such as world-weariness”.\n\nBeijing requires social media companies to moderate content on their platforms, with posts strictly controlled to avoid anything deemed to be too subversive, vulgar, pornographic or generally harmful.\n\nThe CAC had already announced penalties this month against three popular digital platforms — micro-blogging platform Weibo, short video app Kuaishou and Instagram-like Xiaohongshu — for allegedly neglecting content management duties.\n\nAuthorities have not specified what punitive actions are being taken against those platforms.\n\nThe CAC said Tuesday that measures taken against news aggregator app Toutiao included “summoning the company for a meeting, ordering rectification within a specified time limit, issuing a warning, and strictly dealing with those responsible”.\n\nThe platform had failed to fulfil its primary responsibility of managing information content and allowed “harmful content” to appear on the main section of its trending search list, “thereby damaging the online ecosystem”, the statement said.\n\nIt gave no further details about the content type or punishments. “Internet regulators will continue to focus on prominent illegal and non-compliant activities that undermine the online ecosystem,” the CAC added.\n\nIn a separate statement on Tuesday, the CAC said it would take similar measures against UCWeb after the Alibaba-owned platform displayed entries relating to “extremely sensitive and malicious” events and topics such as “online violence and the privacy of minors”.\n\nThe two-month campaign announced Monday by the CAC aims “to regulate the malicious incitement of conflict and the promotion of violence and vicious currents”, the CAC said.\n\nThe statement then listed specific online issues authorities hope to tackle in the crackdown, including “exploiting social hot spots to forcibly associate identity, region or gender with other information, stigmatising and hyping them”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/23160640eb93f52.webp",
  "retrievedAt": "2025-10-12T00:09:34.410Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944115/china-penalises-bytedance-and-alibaba-platforms-in-content-crackdown",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T11:08:37.000Z"
}
