{
  "title": "KP lawmakers condemn civilian killings in Tirah ‘aerial bombing’, demand probe - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Members of the Khyber Pakhtunkhwa Assembly on Monday condemned civilian killings in what they called “aerial strikes” in Tirah valley of Khyber tribal district and demanded an inquiry into them.\n\n“At least 25 people, including women and children, were martyred in the Tirah aerial bombing at around 2am on Monday,” special assistant to the chief minister Mohammad Sohail Afridi told an assembly sitting chaired by Speaker Babar Saleem Swati.\n\nThe number wasn’t confirmed by independent sources. However, residents claimed that the aerial bombing claimed 21 lives.\n\nMr Afridi also claimed that innocent people were previously killed in Alam Gudar, while firing in the Qamarabad area left 10 more dead.\n\nHouse also discusses post-flood situation, compensation payment\n\nThe aide to the CM said that protesters in Tirah were shot at by security personnel during a demonstration for their rights.\n\nHe questioned the state’s policy towards Pakhtuns and insisted that the power-that-be were “testing our love for the nation” despite countless sacrifices.\n\n“This is our country,” he said.\n\nMr Afridi said anyone involved in the killing of innocent tribesmen should be immediately charged.\n\nHe claimed that whosoever tried to lodge cases against such killings were threatened.\n\nThe CM’s aide said the “tyranny” had continued for almost 20 years, with the silence of tribesmen had encouraged authorities.\n\n“If you [tribesmen] continue to stay silent and do not resist, remember you’ll face tougher times ahead as such killings will continue,” he said.\n\nMr Afridi requested people of tribal districts to participate in Friday’s demonstration against civilian killings in Tirah, Bara, Jamrud, Bab-i-Khyber and Landi Kotal.\n\nMinority MPA Gurpal Singh of the opposition JUI-F insisted that tribesmen were mistreated as if they lived in India and not their own country.\n\nHe said the issue was discussed multiple times, but to no avail.\n\n“Innocent children, women and adults are martyred in tribal districts,” he said, demanding an immediate end to such killings.\n\nThe lawmaker said the lawmakers won’t make any compromise on the repeated law violations and would continue advocating for punishment of culprits.\n\nHe said the situation in Tirah valley was volatile and everyone should feel sorry for the tribesmen.\n\nMr Singh requested the chair to order an investigation into killings.\n\nThe speaker observed that a special committee on the law and order situation had already been formed and its terms of reference finalised.\n\nHe said the provincial police chief and Peshawar’s corps commander would be called for a briefing\n\n“A discussion will be held and anything decided by the house will be acted upon,” he said,\n\nAs the assembly also discussed the post-flood situation in the province, especially compensation payment to families, member of the opposition PPP Ahmad Karim Kundi criticised the government for “being confused.”\n\nHe said that security operations were being carried out against terrorists in the province with the consent of the provincial government but the treasury opposed any military offensives.\n\nMinister for agriculture Mohammad Sajjad insisted that Mr Kundi had strayed from the session’s agenda.\n\nHe wondered why there was a law and order situation in the province except the areas bordering Punjab.\n\nThe minister said barricaded houses with barbed wires in KP were vulnerable but the houses even without walls in Punjab were safe.\n\n“You don’t find terrorism after crossing Dera Ismail Khan into Punjab,” he said.\n\nAbout the damage to public life and property due to the recent floods, special assistant to the chief minister for housing Dr Amjad Ali said around 450 people lost lives to the calamity and compensation in around 99 per cent cases had been paid.\n\nHe also said the people with damaged houses had also been compensated.\n\nEarlier, member of the opposition PML-N Sobia Shahid, a calling attention notice, had claimed compensation payment to a few flood-hit families.\n\nShe requested the chair to send the calling attention notice to the relevant house committee for discussion and recommendations. The chair accepted her request.\n\nLivestock minister Fazal Hakeem claimed that several legal hotels were demolished during the recent drive against encroachment in the province.\n\nHe demanded aninquiry to dispense justice to owners of such hotels.\n\nThe chair observed that chairmen of the house committees were empowered to take suo moto notices of matters of public interest.\n\nHe said those who issued NOCs and approved illegal hotel constructions should also be quizzed.\n\nSpecial assistant to the chief minister for housing Dr Alisaid the government was criticised for demolishing buildings without taking the relevant public representative into confidence butofficials insisted that the action was carried out on the court’s orders.\n\nThe chair observed that the matter should be discussed in the relevant house committee and the cabinet as well.\n\nAs law minister Aftab Alam Afridi was set to table the first bi-annual report on the monitoring of implementation of NFC Award (July-December) 2022, PPP member Ahmad Karim Kundi said the government was bound by Article 163 (b) of the Constitution to present reports.\n\n“The Constitution talks about reports but the government has come up with a single report.\n\nSpeaker Swati said the word ‘reports’ meant that the federal and provincial governments would table their own reports.\n\nMr Afridi complained that Mr Kundi was silent when the Constitution was distorted.\n\nHe said the PPP lawmaker should have protested when the 26th Constitutional Amendment was tabled and passed.\n\nThe minister requested the chair to allow the tabling of the report.\n\nHowever, the speaker deferred action on the request until the next sitting and adjourned it until 2pm today (Tuesday) citing a lack of quorum as the reason.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:10:12.354Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943947/kp-lawmakers-condemn-civilian-killings-in-tirah-aerial-bombing-demand-probe",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T01:01:09.000Z"
}
