{
  "title": "Polio mountain - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE world’s battle against polio is stuck on a glass mountain. After 37 years and $22bn, the Independent Monitoring Board has declared that conventional strategies are running out of road.\n\nIts latest assessment, The Glass Mountain, places Pakistan centre stage. The country has reported 27 new cases this year — small in absolute terms, but large enough to confirm what the IMB calls “resurgence” in one of the last reservoirs of wild poliovirus.\n\nThe board’s findings are uncomfortable. It argues that Pakistan’s claims that transmission had been interrupted between 2021 and 2023 were an illusion created by Covid-19 restrictions. Lockdowns, not stronger campaigns, suppressed spread. That temporary reprieve has ended. With new infections surfacing, confidence in the programme’s direction is ebbing.\n\nEradication in Pakistan has long suffered from predictable failings: financing that rewards effort rather than outcomes, superficial ties to routine immunisation, accountability systems that churn out reports instead of penalties, and an unhealthy reliance on donor-driven firefighting rather than sustained domestic leadership. The result is a system skilled at producing plans and press releases but unable to guarantee that every child is immunised. District managers often recycle excuses, while politicians offer rhetorical commitment without following through on resources or enforcement.\n\nThe IMB now proposes shifting responsibility for eradication from Geneva to the WHO’s Eastern Mediterranean Regional Office. That change is intended to blunt the corrosive perception that polio eradication is a Western agenda imposed from outside. It may also force local politicians to accept ownership. For years, community hostility — stoked by conspiracy theories, mistrust of outsiders and repeated security lapses — has translated into refusals, boycotts and, tragically, killings of vaccinators.\n\nRecasting the campaign as a regional priority could help repair that legitimacy gap. But the harder work lies at home. Pakistan’s federal and provincial authorities must treat polio not as an externally funded programme but as a national test of competence.\n\nChronic under-performance in high-risk districts cannot be indulged indefinitely. Integration with wider health services is overdue: routine immunisation and primary care should be the foundation, not an afterthought. Surveillance, meanwhile, needs sharper focus; environmental samples show far more virus in circulation than case counts suggest, signalling invisible chains of transmission that remain unbroken.\n\nEradication is not impossible. The coming low-transmission season offers an opening, but only if old habits are abandoned. More money and foreign technical help will not suffice. What is needed is innovation, political will and the readiness to hold failures accountable. A virus that once terrified the globe survives here still. Whether it is eliminated or allowed to endure will depend less on donors’ dollars and more on Pakistan’s resolve to climb its own glass mountain.\n\nPublished in Dawn, September 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:09:45.904Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944063/polio-mountain",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T02:43:32.000Z"
}
