{
  "title": "PMIC team inspects under-construction model prison of Islamabad; directs timely completion",
  "link": "https://www.app.com.pk/national/pmic-team-inspects-under-construction-model-prison-of-islamabad-directs-timely-completion/",
  "date_published": "2023-12-19T13:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): A team of the Prime Minister’s Inspection Commission on Tuesday inspected the under-construction Model Prison of Islamabad and directed the authorities concerned to ensure timely completion of the project.\nThe visit took place after PMIC Chairman Brigadier (Retd) Muzaffar Ali Ranjha, took cognizance of the concerns of the prime minister over the unwarranted delays in the completion of PSDP projects, said a press release.\nThe PMIC had shown dissatisfaction over the implementation status and also the latest progress on the decisions made in the meeting held on October 10, 2023.\nThe PMIC chairman assigned the task to inspection team headed by PMIC Member Engineer Aamir Hassan for vigorously persuading the project and its completion at the earliest.\nThe inspection team comprising Engr. Aamir Hasan, Member and Muhammad Saleh Narejo, Director, PMIC visited the Model Prison project at sector H-16, Islamabad and inspected the ongoing construction work of the project.\nThe officers of Ministry of Interior, Ministry of Planning, Development and Special Initiatives, Pak PWD, National Highway Authority, Capital Development Authority and also other stakeholders of the project were present during the inspection.\nThe team observed the progress made by the contractors and Pak PWD in the light of directions given in the meeting held on October 10.\nThe inspection team gave the directions for speedy and effective completion of the project with deadlines which had been significantly delayed.\nThe PMIC team stressed for completion of the project in true letter and spirit.\nThe PMIC also convened a meeting on the project on December 20 at PMIC Office to be attended by the officers of all stakeholders of the project who would brief the PMIC chairman on the implementation status and also latest progress.\nThe implementation report regarding progress in the project will be submitted to the prime minister.",
  "retrievedAt": "2025-08-11T11:05:17.035Z"
}
