{
  "title": "Wildlife rescuer finds rarest albino porcupine in Pakistan, urges Wildlife officials to protect",
  "link": "https://www.app.com.pk/national/wildlife-rescuer-finds-rarest-albino-porcupine-in-pakistan-urges-wildlife-officials-to-protect/",
  "date_published": "2023-12-19T10:52:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 19 (APP): An amazing nature survivalist and wildlife rescuer who also runs an educational YouTube channel in the name of `Wild Rush’, has found rarest albino porcupine, a large rodent best known for its sharp quills that covers its body.\n“The rare albino Indian crested porcupine scientifically known as `Hystrix Indica’ has been found by Abdul Rehman who owns a tea stall at a rural settlement in his native hometown of Bhawalpure, but his passionate love for nature and wildlife has made him as an amazing nature survivalist and wildlife rescuer.\nThe remarkable rescuer along with his team members claimed to have saved and shifted around 10,000 venomous species including snakes and scorpions from human settlements to natural habitat in Cholistan desert during the last one decade.\nIn his recent documentary released on You Tube, Abdul Rehman shared video of the rare albino porcupine he saw in captivity of a person at Mandi Yazman area of Bhawalpure district in Southern Punjab.\nPorcupine are mostly brown or black in color, but this albino porcupine is totally white from head to tail with red eyes, making it most rare, Rehman told APP.\nIn Pakistan, only this specie of crested porcupine is found in black and brown color and discovery of the totally white colored rodent is very unique and distinctive, observed Rehman.\nHe said the porcupine is in the captivity of a person who belongs to a gypsy community (Baggrian) who eat rodents, wild boar and use fat of sand lizard for extracting oil.\nPeople of this community kills large quantity of spiny tailed lizards for extraction of fat which is used for preparation of oil soaked bread in local language called as `Paratha’.\nRehman said he made very fervent requests to the owner to hand the albino porcupine to him, but he refused.\nThe owner was much reluctant in allowing me to record video over the suspicion of my links with Wildlife Department, he shared.\nRehman expressed the fear that the highly rare porcupine which was in very good health with weight of around 16 to 18 kg, will be consumed by the owner. There was also another normal black color porcupine, small in size, at the home of the owner, he added.\nHe asked Wildlife Department to take possession of the rare rodent even if the owner demands payment for it.\n“Sighting of albino porcupine in Pakistan is a news for wildlife lovers and conservationists because the animal is only found in brown or black color in the country,” comments, Dr. Sundas Zahid, a PhD scholar in Zoology who teaches in Mashera district of Khyber Pakhtunkhwa.\nThis is the first time that a while color porcupine is witnessed in our country and this animal needs protection, Sundas opined.\nAbout this albino porcupine, Dr. Sundas, who has contributed numerous research papers on several wild species for different international journals, said albinism is an inherited condition that leads to someone having very light skin, hair, and eyes.\nIt can happen in any creature but is rare because it is reported among only one in thousands. It happens because they have less melanin than usual in their body. Melanin gives skin, hair, and eyes their color, she explained.\nDr. Sundas demanded action by concerned wildlife department for protection of the rare rodent for research.\n“In Pakistan, Porcupine is distributed in Punjab, Sindh, mountainous areas of Khyber Pakhtunkhwa and in steppe mountain regions of Baluchistan up to 2,750 m elevation,” says Safwan Shahab, Vice Chairman Pakistan Wildlife Foundation, a nonprofit conservation organization.\nTalking to APP, Safwan agrees that sighting of albino porcupine is first ever in Pakistan because such kind of rodent comes one in millions.\nHe concurred with viewpoint of Dr. Sundas Zahid that the white porcupine should be taken into protective custody by Wildlife Department.\nSuch a unique wild specie needs protection and display at an educational institution for observation and study of students of Zoology, Safwan recommended.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:05:22.820Z"
}
