{
  "title": "Sohrab advocates for increased employment opportunities in Greece for Pakistani Workforce",
  "link": "https://www.app.com.pk/national/sohrab-advocates-for-increased-employment-opportunities-in-greece-for-pakistani-workforce/",
  "date_published": "2023-12-19T09:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development, Jawad Sohrab Malik, held a productive meeting with Minister of Labor and Social Security of Greece, Adonis Georgiadis aimed at fostering cooperation in skilled migration and knowledge sharing, and advocated for the need to enhance employment opportunities for Pakistani workforce\nDuring the meeting at the Global Labor Market Conference (GLMC) in Riyadh, both parties explored potential collaborations to facilitate the migration of skilled manpower from Pakistan to Greece, a news release said.\nThe meeting focused on a keen interest in enhancing cooperation through a Memorandum of Understanding (MoU) employing a Government-to-Government (G2G) framework.\nOne of the key points of discussion centered around addressing Greece’s current demand for skilled labor in the construction industry. According to the Greece Minister for Labour, the country is in need of approximately 500,000 skilled workers in the construction sector.\nSAPM, Jawad Sohrab Malik, took this opportunity to brief the Greek delegation about the availability and priority of the Pakistani Government to export skilled manpower to Greece and other countries experiencing a workforce shortage.\nThe proposed collaboration aims to create a win-win situation, benefiting both nations by facilitating the export of skilled Pakistani workers to meet the growing demand in Greece. This initiative aligns with the vision of the Pakistan Government to actively contribute to the global workforce and strengthen diplomatic and economic ties with friendly nations.\nThe Ministry of Overseas Pakistanis and Human Resource Development remains committed to fostering partnerships that promote international cooperation and facilitate the exchange of expertise and skills between nations.",
  "retrievedAt": "2025-08-11T11:05:22.975Z"
}
