{
  "title": "Properly educated people can transform society: PM",
  "link": "https://www.app.com.pk/national/properly-educated-people-can-transform-society-no-society-can-exist-without-education-caretaker-pm/",
  "date_published": "2023-12-19T13:57:00.000Z",
  "source": "APP",
  "content": "QUETTA, Dec 19 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday pointed out the seriousness of out-of-school children issue which warranted collective efforts for its redressal as properly educated people could transform a human society.\nHe said in the future, no society would be able to exist without education and knowledge, and stressed that students should have realization for the changes shaping the human societies.\nDuring an interaction with the students of different universities of the Balochistan province, PM Kakar said that the out-of-school children issue was a social issue which had two aspects and according to his view, they required to ponder as to what steps should be taken to make the education accessible to such kids.\nHe stressed upon utilization of existing infrastructure and enhancement of teachers’ capacity building, besides increasing the outreach of education.\nThe prime minister suggested that about 10 million Pakistani diaspora, living in different parts of the globe, could play their part in overcoming the out-of-school children issue. If they gave commitment to educate at least five children with their minimum donation, that amount could prove huge for catering to the needs the uneducated children.\nWith such initiative, the other countries and stakeholders would look towards the move as positive and would be supplementing in those efforts, he opined.\nThe caretaker prime minister, to another query, replied that career counseling should be introduced at universities, keeping in view the contemporary needs of the local industry and particularly in the region, and cited the massive construction work being undertaken in the Kingdom of Saudi Arabia which required skilled manpower.\nHe also expressed the hope that the upcoming government would focus and improve the skill development capacity of the people by taking different steps.\nThe caretaker prime minister, referring to the trade and economic potential of the region, said trillions of dollars trade was expected in the region. For example, the member states of Economic Cooperation Organization (ECO) had the population of about 500 million, which meant about half of the quarter of world’s population resided there which gave it a central position in the world.\nTo a question, he opined that political stability would be achieved after the upcoming parliaments completed their respective stints. The democratic system would settle down and amplify the economic strength in future, he said, adding the functional democracy was linked with the economic strength.\nHe also underscored the significance of the efficient system for collecting and spending taxes.\nThe prime minister expressed the optimism that he was very much hopeful that different challenges faced by the country would be addressed in a gradual and rational manner, and the students would be the main ingredients in the achievement of those goals.\nPrime Minister Kakar encouraged the students of the province, saying that they possessed huge potential and could compete and excel when compared with other developed areas of the country and even with the best educational institutions of the world.\nHe stressed that they should evaluate their efforts as to what they had contributed towards the betterment of the society.\nResponding to a question, he said in the Constitution of Pakistan, no person or group could set up any militia and on the basis of religion, sectarian or lingual base could spread violence in the society.\nHe said the Constitution had given the liberty of carrying out political activities in a peaceful manner and there was no restriction on any citizen to participate in the political activities.\nHe said the banned terrorists outfits like Tehreek Taliban Pakistan (TTP) and Balochistan Liberation Army (BLA) were masquerading and carrying out their violent activities.\nMedia had the freedom of expression but within parameters of laws because everything was regulated by rules and limitations, he said, adding that the government worked under a settled system and regretted that often that aspect was projected in a negative manner.\nThe caretaker prime minister reiterated that the government would not surrender before the narratives of terrorists and violent groups.\nHe further expressed the hope that soon a transformation in the Balochistan province would be made and through the involvement of youth who had been utilizing social media tools. They would lead the society as lead models, he said and urged the students to take on different challenges as a mission.\nBy taking up the ownership, he said, they could be able to hold every responsible person in the government and society accountable.\nAbout repatriation of illegal aliens, the prime minister reiterated that not a single individual person among the registered Afghan nationals, residing in Pakistan, was being sent back. “The Afghans are as respected for us like neighbours or brothers; in the past, in different decades, they had seen wars and had been affected along with their families, displaced and migrated,” he observed.\nThe prime minister said Pakistan had been a generous host country and for almost five decades hosted about 4 to 5 million Afghans on its soil though they were not signatory to the 1951 Refugee Convention.\nHe said there were Afghans whom the European Union and Western countries wanted to settle them on their respective lands and the government was temporary facilitating them in that regard.\nThe prime minister highlighted that the policy of repatriation related to non-documented Afghans who had no valid reason to reside here and were abusing the system.\nPakistan had its own issues like crimes, terrorism, and resources limitation, he added.\nHe emphasized that they had introduced the policy to repatriate illegal Afghans but it was not a not a perpetual ban as they could return after obtaining valid travel documents from their home country, for getting jobs, doing business and seeking education in Pakistan. It was a regulated regime being in practice throughout the world, he stressed.\nThe prime minister further said that terrorism was a matter of deep concern for them. Terrorists of TTP were launching attacks on police, security forces and the people of Pakistan.\nHe said that they considered Afghanistan as a sovereign and independent country, but the rules and regulations for the movement of Afghan people as employed throughout the world should be enforced.\n“Rest assure, we will not touch those valid migrants who are productive people in our society,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:05:35.765Z"
}
