{
  "title": "President urges enhanced cooperation as envoys of multiple nations present diplomatic credentials",
  "link": "https://www.app.com.pk/national/president-urges-enhanced-cooperation-as-envoys-of-multiple-nations-present-diplomatic-credentials/",
  "date_published": "2023-12-19T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): President Dr Arif Alvi on Tuesday underscored the need for increasing cooperation with Egypt, Oman, Bosnia, Sri Lanka and Cyprus in the fields of trade, economy, and culture as their envoys-designate presented diplomatic credentials to him.\nThe president expressed these views while talking to the envoys of the Arab Republic of Egypt, Sultanate of Oman, Bosnia & Herzegovina, Republic of Cyprus and the Democratic Socialist Republic of Sri Lanka.\nThe envoys presented their diplomatic credentials to the president and separately called on him, at Aiwan-e-Sadr, a President House press release said.\nWelcoming the Ambassador of Egypt to Pakistan, Dr. Ihab Mohamed Abdelhamid Hassan, the president highlighted the importance Pakistan attached to its bilateral relations with Egypt reflected by shared bonds of common faith, cultural affinities and values between the people of the two brotherly countries.\nHe emphasized the need for increasing the trade, economic and cultural cooperation between the two countries.\nThe president expressed Pakistan’s deep concern over the killing of innocent people and the tremendous damage done to the public property in Gaza by the Israeli security forces.\nDr. Ihab Mohamed Abdelhamid Hassan informed that Egypt was supporting the humanitarian aid to Gaza.\nTalking to the Ambassador of Sultanate of Oman Fahad Sulaiman Khalaf al Kharusi, President Alvi said that Pakistan and Oman enjoyed excellent relations in various fields.\nHe informed the ambassador that Pakistan offered investment-friendly-environment to the foreign investors and had constituted, in this regard, Special Investment Facilitation Council (SIFC) that provided one window operation for investment in IT, cooperate farming, minerals and energy sector of Pakistan.\nThe president also highlighted the atrocities being committed by India in Indian Illegally Occupied Jammu & Kashmir (IIOJ&K).\nThe ambassador conveyed Sultan Haitham Bin Tarik’s best wishes for the people and government of Pakistan.\nHe said that he would work for further improving bilateral cooperation between the two brotherly countries.\nWelcoming the Ambassador of Bosnia & Herzegovina, Emin Cohodarevic, the president stated that Pakistan deeply valued its friendship with Bosnia & Herzegovina based on brotherhood and mutual trust.\nHe highlighted that there was tremendous scope to further increase cooperation in the areas of trade, economy and people-to-people contacts.\nThe ambassador said that he would work to further promote political, economic and cultural relations.\nWhile speaking to the High Commission of Sri Lanka, Admiral (R) Ravindra Chandrasiri Wijegunaratne, President Alvi said that relations between Sri Lanka and Pakistan had grown stronger over the last seven decades.\nHe underlined the need for enhancing and strengthening cultural linkages between the two countries, besides exchanging visits at the political and cultural levels.\nPresident Alvi acknowledged that Sri Lanka was the first country that entered into Free Trade Agreement with Pakistan and highlighted the need for increasing the volume of bilateral trade for the mutual benefits of two countries.\nDuring his discussion with the Ambassador of Republic of Cyprus, Andreas P. Kouzoupis , the president said that Pakistan considered Cyprus as an important friend and wanted to further improve bilateral relations with Cyprus.\nHe appreciated the Republic of Cyprus’ consistent support to Pakistan in the context of European Union.\nThe president voiced strong concern over happenings in Gaza, stating that Israeli security forces had crossed all limits by killing innocent people, including children and women.\nPresident Alvi congratulated the envoys on their appointment and expressed the hope that they would play their role to further boost bilateral cooperation with Pakistan.",
  "retrievedAt": "2025-08-11T11:05:41.466Z"
}
