{
  "title": "NUML celebrates UNESCO Turkic Languages Day and Shab-e-Arooz of Maulana Rumi",
  "link": "https://www.app.com.pk/national/numl-celebrates-unesco-turkic-languages-day-and-shab-e-arooz-of-maulana-rumi/",
  "date_published": "2024-12-18T17:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): National University of Modern Languages (NUML) on Wednesday organized an event to commemorate UNESCO Turkic Languages Day and the Shab-e-Arooz of Maulana Rumi.\nThis unique celebration highlighted the rich cultural and linguistic heritage of Turkic civilizations alongside the spiritual wisdom of Maulana Rumi, fostering a deeper appreciation of shared traditions and values.\nThe program was honoured by the presence of the Education Attache, Dr Mehmet Toyron, who praised the event as more than just a celebration, describing it as a workshop that transported participants through the history of the ancient Turks and back to the present.\nHe commended the event’s meticulous organization, its focus on Türkiye’s linguistic and cultural diversity and its meaningful acknowledgement of UNESCO’s Turkish Language Day. The program was lauded as a shining example of cultural engagement and thoughtful execution.\nThe celebration featured inspiring video messages from Turkic countries, documentaries on ancient Turkic leaders and heroes, reflections on Maulana Rumi’s timeless teachings and an exploration of the Turkish language family and its dialects.\nA unique highlight of the event was a beautifully decorated wish tree, symbolizing an ancient Turkic tradition predating modern customs, with participants tying their wishes on white paper with colourful ribbons.\nGuests also experienced the flavours of Turkic cuisine, enjoying homemade Özbek Pilav, Revani dessert, Turkish tea and Ayran, a traditional Turkish drink lovingly prepared by faculty members.\nThe event also underscored the deep-rooted brotherhood between Pakistan and Türkiye, a bond strengthened by mutual respect, shared history, and cultural affinity.\nThis enduring relationship serves as an example of international solidarity, with both nations cherishing and promoting their common heritage.\nThe event left participants inspired by the richness of Turkic heritage and the universal teachings of Maulana Rumi, reinforcing the university’s role as a hub of academic and cultural excellence.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:52:11.295Z"
}
