{
  "title": "PM arrives in Cairo to attend D-8 Summit",
  "link": "https://www.app.com.pk/global/pm-arrives-in-cairo-to-attend-d-8-summit/",
  "date_published": "2024-12-18T15:31:00.000Z",
  "source": "APP",
  "content": "CAIRO, Dec 18 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday arrived here on an official visit to Egypt to lead the Pakistan delegation at the 11th Summit of the Developing Eight (D-8) countries being held from 18-19 December.\nMinister for Public Business Sector of the Arab Republic of Egypt Mohamed Shimi along with senior Egyptian and officials of the Pakistan embassy in Cairo received the prime minister upon arrival at the airport, PM Office Media Wing said in a press release.\nPakistan delegation includes Deputy Prime Minister and Foreign Minister Muhammad Ishaq Dar and Federal Minister for Information & Broadcasting Ataullah Tarar.\nThe theme of the 11th D-8 Summit is “Investing in Youth and Supporting SMEs: Shaping Tomorrow’s Economy.”\nAt the summit, the prime minister will underline the importance of investing in youth and SMEs for building a strong and inclusive economy; creating jobs; advancing innovation; and promoting local entrepreneurship.\n“The Prime Minister will also attend the Special Session of D-8 on the Humanitarian Crisis and Reconstruction Challenges in Gaza and Lebanon to deliberate on the situation resulting from Israeli aggression in the Middle East. On the sidelines of the Summit, the Prime Minister is expected to hold bilateral meetings with the participating leaders,” it was further added.\nFounded in 1997 in Istanbul, the D-8 Organization for Economic Cooperation, also known as Developing-8, is an organisation for development co-operation among Bangladesh, Egypt, Indonesia, Iran, Malaysia, Nigeria, Pakistan, and Turkiye.\nIts objective is to increase economic cooperation among Member States to boost economic growth, sustain development and promote and improve standards of living by focusing on bringing improvement and enhancing cooperation in agriculture, trade, transportation, industry, energy and tourism.",
  "retrievedAt": "2025-08-10T13:51:53.314Z"
}
