{
  "title": "Requirements of due process, fair trial, not complied with in trial of Zulfiqar Bhutto: CJP",
  "link": "https://www.app.com.pk/national/requirements-of-due-process-fair-trial-not-complied-with-in-trial-of-zulfiqar-bhutto-cjp/",
  "date_published": "2024-12-18T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): Chief Justice of Pakistan Justice Yahya Afridi on Wednesday issued his additional note in Presidential Reference with regard to the death sentence of former prime minister Zulfiqar Ali Bhutto.\nIn a five-page note, the CJP said: “I am of the considered opinion that the requirements of due process and fair trial were not complied with in the murder trial of Mr. Zulfiqar Ali Bhutto by the trial court and the appellate court.”\n“I find myself in agreement with the observation of Justice Syed Mansoor Ali Shah that certain portions of the detailed opinion of the Chief Justice verge on reappraisal of evidence in a case that has already been finally decided by this Court in its adjudicatory jurisdiction, and thus, the same exceed the scope of the inquiry delineated in the Short Opinion that ‘[i]n its advisory jurisdiction under Article 186 of the Constitution, this Court cannot reappraise the evidence and undo the decision of the case’.”\nThe note said: “As to the question of law, whether the requirements of due process and fair trial were complied with in the murder trial of Mr. Zulfiqar Ali Bhutto, the former Prime Minister of Pakistan, by the trial court (the Lahore High Court) and the appellate court (the Supreme Court), I fully concur with the observations given in paragraphs no. 23 to 25, 31, 58 to 64 and 67 to 76 of the detailed opinion rendered by the Chief Justice, as well as paragraph no. 8 of the note authored by Justice Syed Mansoor Ali Shah, which highlight the violations of procedural due process and fair trial requirements.”\nJustice Afridi stated: “I also record my concurrence, for the reasons given therein, with the view of Justice Syed Hasan Azhar Rizvi that the observation of the Chief Justice – that Article 185(2)(b) of the Constitution and sections 411-A and 526 of the Code of Criminal Procedure, 1898 do not permit the High Court to conduct a murder trial – is untenable, as it is founded on a misconception of these provisions. I further agree with the opinion of Justice Syed Hasan Azhar Rizvi that Chapter XXVII of the Code of Criminal Procedure, 1898 does not extend to death sentences passed by the High Court in the exercise of its original criminal jurisdiction. Consequently, I respectfully differ from the view of the Chief Justice that these provisions necessitate confirmation of such sentences or lead to the forfeiture of the right of appeal, as such an interpretation is contrary to the established legal framework.”\nHe said: “In an interview, Justice Nasim Hasan Shah described Justice Maulvi Mushtaq Hussain as an overt enemy of Mr. Zulfiqar Ali Bhutto, expressing that he should not have been part of the Lahore High Court Bench. In fact, the presence of Justice Maulvi Mushtaq Hussain on the Lahore High Court Bench was referred to as “Ziadati”, a term that, within the context of the trial, could only be interpreted as bias.\nJustice Nasim Hasan Shah revealed certain facts in his autobiography Memoirs and Reflections, which suggest that his inclusion in the Bench for the purpose of hearing the appeal of Mr. Bhutto was orchestrated by the Attorney General Sharifuddin Pirzada and Justice Maulvi Mushtaq Hussain. Such manipulation of the Bench composition undermines judicial impartiality and raises serious concerns about the fairness of the proceedings.\nIt also shows that Justice Maulvi Mushtaq Hussain pursued the matter zealously even after the High Court had decided the case and the appeal was pending before the Supreme Court, despite his role having concluded with the decision of the High Court. This unwarranted involvement after conviction blurred the boundaries of judicial propriety and further eroded confidence in the impartiality of the appellate process.”\nJustice Afridi said: “I am of the view that this reference might never have come before us but for the events recounted and the facts disclosed in the interview and autobiography of Justice Nasim Hasan Shah. Accordingly, it is both relevant and necessary to address certain aspects of that interview and autobiography, which raise significant concerns regarding the due process and fairness of the trial of Mr. Zulfiqar Ali Bhutto, as discussed in the following paragraphs.”",
  "retrievedAt": "2025-08-10T13:51:54.382Z"
}
