{
  "title": "IHC orders SZABMU to re-conduct MDCAT within two-week",
  "link": "https://www.app.com.pk/national/ihc-orders-szabmu-to-re-conduct-mdcat-within-two-week/",
  "date_published": "2024-12-18T13:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): A division bench of Islamabad High Court (IHC) on Wednesday instructed the Shaheed Zulifkar Ali Bhutto Medical University (SZABMU) to conduct medical and dental colleges admission test (MDCAT) again within two weeks.\nA two-judge bench comprising Chief Justice Aamer Farooq and Justice Saman Raffat Imtiaz heard the intra court appeal (ICA) against the verdict of the single member bench.\nThe petitioners’ lawyer said that the single-member bench had declared that 31 questions out of 200 were out of syllabus and course. He said that the Pakistan Medical and Dental Council (PMDC) declared firstly 25 but later 18 questions out of the syllabus.\nHe said that there were a total of 150 seats allocated for Islamabad of which 50 were for admissions in medical colleges while 100 for dental colleges.\nAddressing the lawyer, the court said that if you are admitting the opinion of PMDC then you have to accept it in letter and spirit.\nOn the query of the bench, the registrar of the university said that passing marks in the test are 50 percent to which the court said that if the 18 questions are excluded then the passing marks would be 90.\nJustice Saman Raffat Imtiaz said that the university has to satisfy the students on their reservations instead of court.\nChief Justice remarked that the court has to ensure that there would be no injustice with anybody.\nThe PMDC lawyer said that the single-member bench didn’t terminate the test result. However, he said that it had given another opportunity to the students.\nHe said that the single bench had asked to re-take the test on the previous fee.\nThe university’s lawyer said that they were conducting the exam again on December 22.\nPetitioners’ lawyer prayed the court to further delay the test for one more week as a number of students have to come from abroad.\nAfter hearing arguments, the court ordered the university to conduct the exam within two weeks.\nThe court said that it would pass a written order later on.",
  "retrievedAt": "2025-08-10T13:51:56.339Z"
}
