{
  "title": "97 % work on state of art border terminals at Torkham, Chaman completed",
  "link": "https://www.app.com.pk/national/97-work-on-state-of-art-border-terminals-at-torkham-chaman-completed/",
  "date_published": "2024-12-18T06:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): To facilitate seamless cross-border trade and unlock Pakistan’s transit trade potential, the National Logistics Corporation (NLC) has achieved 97 per cent completion of the state-of-the-art Integrated Transit Trade Management System (ITTMS) at Torkham and Chaman.\nSources said that funded by the Asian Development Bank (ADB) through the Federal Board of Revenue (FBR), these projects at two of Pakistan’s most strategic border crossings are poised to set new benchmarks in trade facilitation.\nThe projects are likely to be inaugurated in February 2025, they added.\nDesigned to meet international standards, the ITTMS facilities are expected to significantly enhance trade with Afghanistan, the Central Asian Republics, and beyond.\nThe sources said that the integration of cutting-edge IT systems will streamline clearance processes, drastically reduce cargo dwell time, and ensure transparency in operations. These secure and automated systems are set to catalyze a paradigm shift in regional trade, while developing a socio-economic ecosystem that benefits industries, exporters, importers and particularly the local tribal populations, they said.\nDespite encountering numerous challenges during the infrastructure development phase, NLC has steadfastly delivered on these projects of national importance.\nThe ITTMS projects embodies a sophisticated blend of physical and IT-enabled facilities, meticulously designed to expedite cargo handling processes from entry to exit at the terminals.\nOnce operational, the facilities will handle up to 2,400 import and export trucks daily, a fivefold increase from the current capacity of 500. Additionally, the terminals can accommodate 400 trucks in the import and export yards, with parking provisions for approximately 100 light vehicles.\nThe infrastructure includes a modern Administration Centre housing government agency such as Customs, ANF, FIA, Border Rangers, Terminal Operators, and Animal Quarantine authorities.\nThe sources said a dedicated Business Centre has also been established to facilitate banks, internet services, and clearing agents, enhancing the efficiency of trade-related operations. For passenger processing, dedicated offices have been constructed for FIA, Customs, Immigration, and other security agencies, while similar facilities for Customs, Immigration, and terminal operators are available at toll booths for streamlined operations.\nThe terminals are equipped with cutting-edge technology, including X-Ray Gantry Scanners, Pass-Through Scanners, and Under-Vehicle Scanners at each border point, they said.\nThe sources said other modern tools include weighbridges, hand-held explosive and narcotics vapor tracers, bio-data collection systems, pedestrian luggage scanners, and pedestrian pallet scanners, ensuring comprehensive security and efficiency.\nBy transforming these critical border crossings into hubs of trade excellence, the ITTMS projects will not only bolster regional connectivity but also make Pakistan as an important player in regional trade dynamics.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:52:42.630Z"
}
