{
  "title": "LESCO detects 64,732 power pilferers in 185 days",
  "link": "https://www.app.com.pk/national/lesco-detects-64732-power-pilferers-in-185-days/",
  "date_published": "2024-03-17T14:52:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 17 (APP):Lahore Electric Supply Company (LESCO) has detected a total of 64,732 connections from where the customers were pilfering electricity in all its circles of five districts (Lahore, Sheikhupura, Nankana Sahib, Kasur and Okara) in 185 day of grand anti-power theft campaign.\nThe LESCO spokesman told media here Sunday that the company has also submitted FIR applications against electricity thieves, out of which 63,185 FIRs have been registered in respective police stations, while 20,052 accused have been arrested. The LESCO has so far charged a total of 82,340,553 detection units worth Rs 3,131,550,101 to all the power pilferers.\nGrand anti-power theft operations against electricity thieves are being conducted on the directives of the Federal Power Division and the LESCO Chief Executive Officer (CEO) Engineer Shahid Haider is supervising these operations. The LESCO chief vowed that the operations would continue without discrimination until the complete end of electricity theft. The electricity pilferers as well as the LESCO officers and employees who facilitate them are also being brought to justice.\nThe spokesman added, the LESCO found 403 customers stealing electricity through various means and 205 cases have been registered against the accused during the last 24 hours.\nOn the 185th consecutive day of the anti-power theft campaign, he mentioned that large commercial consumers were found involved in electricity theft and all of them were also disconnected and charged with detection units. Among the seized connections, he explained, 07 were commercial, 01 agricultural and 395 domestic, and all these connections were disconnected and charged with a total of 280,204 units as detection bill amounting to Rs 10.758 million.\nApprising the media about some major power pilferers, he mentioned that LESCO charged Rs 200,000 detection  bill to an electricity pilferer in Johar Town; Rs 175,000 detection bill to a power pilferer in Aalabad area; Rs 170,000 fine in the form of detection bill to a customer stealing electricity in Shahdara Town area, and Rs 130,000 to another power pilferer also in Shahdara Town.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:22:02.484Z"
}
