{
  "title": "Pakistan, Tajikistan accords to further strengthen bilateral ties: President",
  "link": "https://www.app.com.pk/national/pakistan-tajikistan-accords-to-further-strengthen-bilateral-ties-president/",
  "date_published": "2021-06-02T17:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 2 (APP): President Dr. Arif Alvi on Wednesday expressed his confidence that the visit of President Emomali Rahmon of Tajikistan to Pakistan and the signing of various accords would further strengthen relations between the two brotherly nations.\nThe President expressed these views while speaking at a state banquet he hosted in the honor of President Rahmon here at the Aiwan-e-Sadr.\nHe said that Pakistan and Tajikistan, which have common culture, traditions, faith and history enjoy close and fraternal relations and the people of two countries have love for each other.\nThe President congratulated his counterpart from Tajikistan over assuming the chairmanship of the Shanghai Cooperation Organization (SCO).\nHe described Tajikistan as a close neighbor and an important partner of Pakistan in the landlocked Central Asian Republics (CARs). “We are so close that it takes more time to travelling from Islamabad to Karachi than Dushanbe,” he remarked.\nThe President was confident that the relations between Pakistan and Tajikistan in the areas of trade and industry would further strengthen through enhanced exchange of leaderships’ visits as well as people to people contacts.\nHe further said that Pakistan and Tajikistan can also work together to confront the challenges faced by the Muslim world including Islamophobia.\nPresident Emomali Rahmon in his remarks on the occasion thanked the government and people of Pakistan for the warm welcome and hospitality extended to him and his delegation during the visit.\nHe also mentioned the close and historic relations between the countries rooted in common culture, faith and traditions and said Tajikistan considered Pakistan as its “trustworthy friend”.\nPresident Rahmon said as it was his 9th visit to Pakistan since 1994, the two countries had a lot potential and opportunities to further cement its relations in the areas of trade and culture through enhanced connectivity, especially particularly, through the Wahan corridor.\nHe also mentioned the CASA-1000 (Central Asia South Asia) energy project and said the materialization of this project will further strengthen the relations.\nPresident Rahmon said that Tajikistan was willing to stand with Pakistan on the issue of common and mutual interest at multilateral fora.\nHe said that the Memorandums of Understanding (MOUs) sighed today will take the relations between Pakistan and Tajikistan at high levels.\nThe President of Tajikistan said he was happy to witness the progress and development achieved by Pakistan in various fields since his first visit in 1994 and wished the country more success and progress.",
  "retrievedAt": "2025-08-11T20:48:00.761Z"
}
