{
  "title": "Tajikistan proposes ‘trade corridor’ to access Pakistan’s Gwadar, Karachi ports",
  "link": "https://www.app.com.pk/national/tajikistan-proposes-trade-corridor-to-access-pakistans-gwadar-karachi-ports/",
  "date_published": "2021-06-02T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 2 (APP): Tajikistan’s President Emomali Rahmon on Wednesday expressed his country’s interest to access Pakistan’s Gwadar and Karachi seaports as the ‘shortest trade route’ for the landlocked Central Asian state to connect with the region.\nThe Tajik president, in this regard, supported establishment of a ‘trade corridor’ passing through Pakistan, as he addressed at a joint press stakeout along with Prime Minister Imran Khan here at the PM House.\nThe two leaders, who earlier held wide-ranging discussions on diverse areas of cooperation, expressed willingness to further strengthen the bilateral multifaceted ties.\nPresident Emomali Rahmon stressed “full-fledged cooperation” between Tajikistan and Pakistan to manage energy and water resources and also tapping the potential of Central Asia-South Asia (CASA-1000) power project.\nPresident Rahmon termed Pakistan a “reliable and trustworthy partner” of Tajikistan at international stage, where the two countries had similarity of agenda to pursue a mutually beneficial cooperation.\nHe mentioned that his talks with PM Imran Khan focused on inter-governmental cooperation in fields of economy, parliaments, energy, agriculture, healthcare and COVID-19 situation.\nPrime Minister Imran Khan welcomed President Emomali Rahmon and mentioned the positive discussions held with him in areas of trade, defence production, climate change and common challenges including post-troops withdrawal scenario in Afghanistan.\nThe prime minister expressed confidence that the Agreements and MoUs signed during the visit of Tajik president would lead to stronger relationship between the two countries.\nImran Khan said Pakistan’s strategic location offered the neighbouring countries a great opportunity for trade, however he added that such arrangement with India was not possible till the latter reversed the unilateral act of August 5 of revoking the special status of Jammu and Kashmir.\n“It would be a betrayal with Kashmiris [on behalf of Pakistan],” he said, adding that unless India took the first step to resolve the situation, the “matter of trade would remain a stalemate”.\nPrime Minister Imran Khan said in the realm of “common challenge” faced by Pakistan and Tajikistan, both sides agreed that peace in Afghanistan was a priority.\n“If the U.S. troops withdrawal from Afghanistan similar to what Russia did in 1989, we both are concerned about the security to our trade and connectivity,” he said.\nHe said Pakistan and Tajikistan in their delegation-level talks held unanimity of views that a consensus political government in Afghanistan was vital for peace of the region.\nPresident Emomali said in the rapidly changing global situation, “Tajikistan and Pakistan needed strong cooperation in anti-terrorism, drug trafficking and organized crimes”.\nPeace in Afghanistan, he said, was of “dire importance” for the immediate neighbours such as Tajikistan and Pakistan.\nBoth the leaders expressed concern over the rising trend of Islamophobia in the world and called for a joint action by Muslim countries and organizations including Organization of Islamic Cooperation (OIC).\nPM Imran Khan welcomed Tajikistan for declaring 2025 as ‘Year of Preservation of Glaciers’, saying “Pakistan will fully back the initiative’ as the country faced fast melting of its glaciers – the main resource of clean water.",
  "retrievedAt": "2025-08-11T20:47:56.901Z"
}
