{
  "title": "President highlights areas of cooperation between Pakistan, Tajikistan",
  "link": "https://www.app.com.pk/national/president-highlights-areas-of-cooperation-between-pakistan-tajikistan/",
  "date_published": "2021-06-02T16:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 2 (APP): President Dr Arif Alvi Wednesday said that Pakistan attached great importance to its relations with Tajikistan based on strong historic, religious and cultural links and stressed upon further cooperation in diverse fields.\nHe said Pakistan and Tajikistan had considerable scope of cooperation in the areas of trade, economy, culture, education and defence which needed to be further strengthened.\nThe president was talking to President of Tajikistan Emomali Rahmon, who called on him, at Aiwan-e-Sadr.\nTalking to the visiting dignitary, the president highlighted Pakistan’s “Vision Central Asia”, which laid strong emphasis on forging deeper links with Central Asian states in trade, investment, energy, security and defence, and people-to-people exchanges.\nThe president underlined that Pakistan’s main emphasis had shifted from geo-politics to geo-economics and was focusing on optimally utilizing its location in this context.\nHe underscored that the trade authorities and business communities of the two countries needed to collaborate effectively to enhance the volume of existing bilateral trade.\nHe also emphasised the importance of the early completion of flagship CASA-1000 Transmission Line Project.\nThe president stressed that Central Asia was an area of special focus for Pakistan, especially for regional connectivity and integration.\nIn this context, je stressed the importance of peace and stability in Afghanistan achieved through a negotiated political solution.\nThe president also briefed the Tajik president about the COVID-19 situation in Pakistan, saying that the successful policy of the government led to containing the disease.\nThe president expressed the hope that this visit would further strengthen the excellent bilateral relations between the two brotherly countries.\nHe said that it was heartening that both sides adopted a Joint Declaration and had signed a number of Agreements/MoUs today, after the delegation-level talks.\nBoth sides reaffirmed the resolve to make coordinated efforts to promote peace and stability in Afghanistan as a stable and peaceful Afghanistan was essential for the materialization of energy and economic projects between the two countries.\nPresident Arif Alvi congratulated the Tajik president on successfully organizing the 9th Ministerial Conference of Heart of Asia-Istanbul Process in Dushanbe in March 2021.\nHe also appreciated that a high level parliamentary delegation from Tajikistan was participating in the 2nd General Conference of the Parliamentary Assembly of Economic Cooperation Organization in Islamabad from 31 May to 03 June 2021.\nThe president of Tajikistan said that both countries had huge potential for increasing cooperation in the areas of trade, economy and culture.\nHe emphasised the need for improving connectivity between the two countries which would greatly help to improve economic relations between the two countries.\nThe president of Tajikistan thanked the government of Pakistan for extending a warm welcome and hospitality to him and the members of his delegation.\nHe also invited his Pakistani counterpart to visit Tajikistan.",
  "retrievedAt": "2025-08-11T20:48:02.673Z"
}
