{
  "title": "Pak, Tajik FMs review bilateral cooperation, collaboration",
  "link": "https://www.app.com.pk/national/pak-tajik-fms-review-bilateral-cooperation-collaboration/",
  "date_published": "2021-06-02T18:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 2 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi and Foreign Minister of Tajikistan Sirodjiddin Muhriddin Wednesday reviewed the status of bilateral cooperation in all areas including political, trade and economic, defence, education, regional connectivity fields and mutual collaboration at regional and global fora.\nThe Tajik foreign minister called on foreign minister Qureshi at the Foreign office. Foreign minister Muhriddin is accompanying the President of Tajikistan.\nForeign minister Qureshi reiterated Pakistan’s commitment to timely completion of CASA-1000 Power project and stressed to step-up cooperation in the energy sector.\nHe also highlighted prospects for regional connectivity and integration to Tajikistan and Central Asian countries through Pakistan’s seaports and CPEC.\nHe said that both countries should capitalize on the tremendous opportunities of trade and transit through these ports.\nThe foreign ministers reviewed cooperation at regional and international fora, including the UN, OIC, SCO and ECO and agreed to enhance further coordination.\nThe foreign minister felicitated his Tajik counterpart on assumption of chairmanship of Shanghai Cooperation Organization (SCO) for 2021 and assured full cooperation of Pakistan on this count.\nExpressing satisfaction on the signing of the Joint Declaration on “Next steps in building strategic partnership for regional solidarity and integration” and several other agreements and MoUs in wide range of areas, earlier in the day, the two foreign ministers agreed on the speedy implementation and follow-up.\nReiterated  commitment to CASA-1000 power project & the need to boost cooperation in the field of energy. Discussed regional connectivity & integration to / C Asian countries through our seaports and CPEC Reviewed cooperation & coordination at all regional/global fora https://t.co/77STZaGGLh\n— Shah Mahmood Qureshi (@SMQureshiPTI) June 2, 2021\nThe two foreign ministers also exchanged views on global issues including climate change and countering Islamophobia.\nThe foreign minister apprised the Tajik foreign minister about the situation of human rights in Indian Illegally Occupied Jammu & Kashmir (IIOJK) and attempts to change the demographic structure of occupied territory.\nHe said that India needed to revisit its illegal actions of 5 August 2019 to create an enabling environment for dialogue and peaceful solution of the Jammu & Kashmir dispute in accordance with UNSC resolutions and the wishes of the Kashmiri people.\nIn the regional context, Qureshi highlighted Pakistan’s positive contribution to the Afghan peace process and stressed that a negotiated political settlement was indispensable for durable peace and stability in Afghanistan and the region.\nHe said this was also essential for advancing the shared objectives of peace, prosperity and regional connectivity.\nThe foreign minister extended felicitations on the 30th anniversary of Tajikistan’s independence and 30 years of Pakistan-Tajikistan diplomatic relations.",
  "retrievedAt": "2025-08-11T20:47:59.729Z"
}
