{
  "title": "Power hungry’ Bilawal has no pain for public: Farrukh",
  "link": "https://www.app.com.pk/national/power-hungry-bilawal-has-no-pain-for-public-farrukh/",
  "date_published": "2021-06-02T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 2 (APP):Minister of State for Information and Broadcasting Farrukh Habib Wednesday said Pakistan Peoples Party (PPP) Co-chairman Bilawal Bhutto Zardari had nothing to do with the problems faced by the common folks as his key priority was to come into power.\nCommenting on Bilawal’s anti-government remarks, the minister, in a statement, lashed out at the PPP for worsening socio-economic conditions of the people living across Sindh.\nThe PPP co-chairman should justify his party’s rule in the province amid deteriorating law and order there, he added.\nFarrukh said there was ‘political dishonesty’ involved in non-implementation of urban and rural quota system for distribution of 40 and 60 per cent resources respectively despite lapse of decades.\nThe densely populated areas in the province, he added, were presenting a sorry picture with piles of garbage and overflowing sewers, while the provincial government seemed to be least interested in resolving issues.\nThe people of Karachi, particularly, were at loss to know why the sewerage lines across the city were not being rehabilitated and the water meant to supply through pipelines, was instead provided to the tankers ‘mafia’ for making bucks, he said.\nThe PPP co-chairman, he said, should also elucidate as to why the government schools in the city were in dilapidated condition, while roads were broken despite utilization of additional funds worth millions of rupees on their rehabilitation.\nBilawal should explain as to why his government had allowed land and china cutting ‘mafias’ to encroach on roads, sports grounds and parks of Karachi.\n“Who will provide recreational facilities and healthy environment to the mega city’s youth” as all the civic bodies, including municipal, fire brigade, health, education, land and rescue departments, were dysfunctional, he added.\nThe minister said the Pakistan Tehreek-e-Insaf government would present a people- friendly budget for next fiscal year.\nThe Federal Board of Revenue had collected record Rs 4,170 billion tax during the ongoing financial year despite limited economic activities due to the COVID-19 pandemic, he added.",
  "retrievedAt": "2025-08-11T20:48:07.518Z"
}
