{
  "title": "Tajik president arrives in capital on 2-day visit",
  "link": "https://www.app.com.pk/national/tajik-president-arrives-in-capital-on-2-day-visit/",
  "date_published": "2021-06-02T00:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 2 (APP): President of Tajikistan Emomali Rahmon Wednesday arrived here on a two-day visit.\nFederal Minister Makhdoom Khusro Bakhtiar received the Tajik president as he alighted from his special aircraft, here at the Nur Khan air base.\nCannons boomed for the 21-gun salute in honour of the visiting dignitary, besides a salute presented by the static guard.\nThe visit is taking place at the invitation of Prime Minister Imran Khan.\nPresident Emomali Rahmon is being accompanied by a high-level delegation.\nDuring the visit, Prime Minister Imran Khan and President Rahmon will lead their respective sides in the delegation-level talks.\nThe two sides will exchange views on deepening bilateral cooperation in diverse areas — including political, economic, trade, investment, energy, security and defence, culture, education and regional connectivity.\nA number of Agreements/MoUs will also be signed during the visit.\nThe visiting dignitary will separately meet with President Dr. Arif Alvi.\nPakistan and Tajikistan enjoy close brotherly relations underpinned by commonalty of faith, shared history and cultural affinities.\nThese ties are characterized by mutual respect, shared perceptions and a common desire to promote peace, stability and development in the region.\nTajikistan is important within the context of Pakistan’s vision for closer ties and enhanced cooperation with Central Asia. The vision emphasizes forging deeper trade, investment, energy, security, and people-to-people links.\nThe two countries share common views on major regional and international issues and cooperate closely at various multilateral fora.\nTajikistan is the current chair of SCO. Foreign Minister Makhdoom Shah Mahmood Qureshi visited Dushanbe in March 2021 to attend the Ministerial meeting of the Heart of Asia-Istanbul Process (HoA-IP), followed by his bilateral visit to Tajikistan.\nOn 25 May 2021, the two sides held the 5th round of Pakistan-Tajikistan Bilateral Political Consultations (BPC) at the level of Foreign Secretary/First Deputy Foreign Minister and reviewed the whole gamut of bilateral relations.\nBoth Pakistan and Tajikistan are part of the CASA-1000 Transmission line Project along with Kyrgyz Republic and Afghanistan. The power project envisages the transportation of surplus electric power from Kyrgyz Republic and Tajikistan to Pakistan (1000 MW) and Afghanistan (300 MW).\nPresident Rahmon has visited Pakistan seven times since 1994. His last bilateral visit was in November 2015. In the multilateral context, President Rahmon visited Pakistan for the 13th ECO Summit held in Islamabad in March 2017.",
  "retrievedAt": "2025-08-11T20:47:59.058Z"
}
