{
  "title": "Shibli for market based applied research for sustainable economic growth",
  "link": "https://www.app.com.pk/national/shibli-for-market-based-applied-research-for-sustainable-economic-growth/",
  "date_published": "2021-06-02T12:35:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jun 02 (APP):Federal Minister for Science and Technology, Syed Shibli Faraz here Tuesday said the government accorded highest priorities to promote science and technology and directed Pakistan Council of Scientific and Industrial Research (PCSIR) to focus on the markets based applied research for sustainable economic growth, industrial development and socio-economic benefits of people.\nAddressing a press conference here after attending a high-level meeting at PCSIR Peshawar, Minister said Pakistan is blessed with abundance of natural resources and can achieve new heights of economic growth and industrial development by promoting applied research as per demands of local markets and people.\nHe said the markets based research would immensely help encourage SMEs and small industries in Khyber Pakthunkhwa besides benefiting a large number of youth from the PTI Govt flagship “Kamyab Jawan Program”.\nShibli Faraz said the exports-oriented approach and innovation in technologies would help save about 60pc to 70pc mines, minerals and marbles being wasted during excavation in KP including merged tribal districts.\n“We need market oriented research to compete with international companies besides directly benefiting people and bring positive socio-economic improvement in their lives.\nOur scientific approach should be exports, commercial and markets’ uplift oriented,” he said, adding inclusive plan has been prepared to enhance linkages between PCSIRs and services providing industries for optimum utilization of PCSIR’s research benefits to people and give upward push to economy.\nMaster trainers would be provided extensive professional trainings at national and international reputable educational and vocational institutions who would later train students, mine workers and others workforce to save mines, marbles and raw materials from being wasted during excavation and improve value- addition of local products and increasing the country’s exports immensely.\nShibli Faraz said a comprehensive mechanism has put in place for monitoring, application of research and performance of PCSIR staff on ground for which an inclusive database of PCSIRs was being up- graded to further enhance efficiency of staff, provide quick service delivery and preparation of inclusive strategies and plans for future decisions.\nHe said Government wants such research that was accepted internationally besides providing hygienic and quality food services to people on basis of quick analysis of different products being sent by the public enforcement departments to PCSIR.\nWith assistance of Pakistan Council of Research in Water Resources (PCRWR), he said work on a pilot project has been started to analyze quality of water reservoirs including wells, water pumps and groundwater table.\nPakistan Council of Scientific and Industrial Research and Halal Food Authority are being reactivated and products of local and international mineral waters and multinational pharmaceutical companies were also being analyzed by PSCIRs experts.\nHe said Prime Minister Imran Khan strongly desired for free, fair, transparent and credible elections in the country and that was why Electronic Voting Machines was introduced so that overseas Pakistan could be given right of votes enabling them to participate in the country’s decision making and ensuring rigging free polls.\nMinister said a law has been promulgated authorizing and binding Election Commission of Pakistan (ECP) to procure electronic voting machines (EVMs) as well as enabling the overseas Pakistanis to exercise their right to vote while staying in their country of residence in next general elections.\nTo discourage horse-trading and massive use of money during elections, he said, Government has offered opposition to conduct last Senate Elections through show of hands instead of secret balloting that was opposed with ill intension by the opposition.\nHe said PTI has exposed corrupt elements before masses and the nation knew that who purchased luxury apartments from tax payers’ money in foreign countries and escaped abroad to avoid accountability and hide corruption.\n“Now PDM is a dead horse and there is no technology to raise its dropping image in people’s eyes,” he said, adding across the board accountability would continue irrespective of political affiliation.\nDespite Covid-19 pandemic, he said PTI Govt had achieved about four percent economic growth that unnerved the opposition, adding this economic turnaround was even acknowledged by Internationally reputable economic and monetary organizations including Moodys.\nComparing the losses due to covid-19 pandemic in the neigbouring country, he said due to PTI Govt effective policies the mortality and economic losses in our country recorded very low while billions of rupees were distributed among the deserving people under Ehsas program.\nHe said preparation of first indigenous and international standard ICU ventilators has been started in Pakistan and Drug Regulatory Authority of Pakistan (Drap) approved it.\nReferring to fiscal budget 2021-22, he said the budget would be pro-poor and maximum relief would be provided to the people, adding that his ministry’s development budget has been enhanced to 2.5 billion against Rs 300 million before PTI government.\nEarlier, the Minister was given detailed briefing about PCSIR functions and projects by its Director General, Faridullah Khan Khattak and Director Planning and Development, Jehangir Shah. The Minister later visited different sections and laboratories of PCSIR.",
  "retrievedAt": "2025-08-11T20:48:06.821Z"
}
