{
  "title": "Grand ceremony marks first Hajj flight departure from Islamabad International Airport",
  "link": "https://www.app.com.pk/national/grand-ceremony-marks-first-hajj-flight-departure-from-islamabad-international-airport-2/",
  "date_published": "2023-05-21T18:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): The Islamabad International Airport on Sunday witnessed a grand ceremony on the occasion of the first flight of Hajj, the annual Islamic pilgrimage to Makkah.\nThe event was attended by distinguished guests, including Minister for Religious Affairs and Interfaith Harmony Senator Muhammad Talha Mehmood, Minister for Narcotics Shahzain Bugti, and Saudi Ambassador Nawaf bin Said Al-Malki.\nThe departure of Pakistan International Airlines (PIA) flight PK-743, carrying 388 pilgrims, took place on time amidst an atmosphere of excitement and anticipation.\nThe Road to Makkah programme proved highly beneficial for all pilgrims departing from Islamabad Airport. This programme streamlined immigration procedures and ensured that all legal requirements for Hajj were completed at the airport itself, eliminating the need for additional processes upon arrival in Saudi Arabia.\nMinister Talha, accompanied by Saudi ambassador, personally saw off the pilgrims and distributed gifts and garlands of flowers to each of the travelers on the inaugural flight.\nSpeaking at the ceremony, he addressed the pilgrims, highlighting their important role as ambassadors of Pakistan abroad.\nHe urged them to transcend religious and political boundaries, emphasizing the significance of facilitating others during their journey and embracing their national identity as they represent their country.In a testament to his commitment to the welfare of the pilgrims, Minister Talha announced the establishment of a dedicated cell to address any difficulties faced by the Hajj participants.\nHe also shared a WhatsApp number through which he would maintain direct communication with the pilgrims.\nHe expressed his gratitude to the Saudi government and Ambassador Nawaf bin Said Al-Malki for their unwavering support during any challenges encountered.\nAmbassador Al-Malki, in his address, extended congratulations to the pilgrims and conveyed his best wishes for a successful and fulfilling Hajj journey.\nHe assured every one of the Saudi government’s commitment to providing the necessary support and assistance throughout their stay in the Kingdom.\nSeveral senior officials from the Ministry of Religious Affairs and Interfaith Harmony, Ministry of Interior, and Ministry of Narcotics were present at the ceremony to offer guidance and support to the pilgrims.\nMinister Talha Mehmood, while speaking to the media, revealed that concerns had been raised regarding the fingerprinting process for pilgrims.\nHe stated that efforts were being made to request the Saudi Ministry of Interior to relax the requirement for individuals over the age of 60, ensuring a smoother experience for elderly pilgrims.\nDisplaying his dedication, Minister Talha remained at the airport until the departure of the flight, personally meeting and interacting with each pilgrim, assuring them of the government’s commitment to their well-being.\nThe inaugural Hajj flight from Islamabad International Airport marks the beginning of a sacred journey for hundreds of pilgrims, symbolizing the unity and devotion of the Pakistani people to their faith. As they embark on this spiritual adventure, the pilgrims carry the hopes and prayers of their nation, fostering a strong bond between Pakistan and Saudi Arabia.",
  "retrievedAt": "2025-08-11T08:31:54.766Z"
}
