{
  "title": "National Film Production Institute to help promote filmmaking in Pakistan: Marriyum",
  "link": "https://www.app.com.pk/national/national-film-production-institute-to-help-promote-filmmaking-in-pakistan-marriyum/",
  "date_published": "2023-05-21T08:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Sunday that establishment of the National Film Production Institute will prove helpful in the promotion of filmmaking in the country.\nAddressing the inaugural ceremony of PTV’s National Film Production Institute here, she said she was glad to see that Prime Minister Shehbaz Sharif’s vision of a training institute for film production was going to become a reality.\nShe said that due to their historic contribution, Pakistan Television and Radio Pakistan had heritage value in the history of the electronic media industry of the country.\nThe minister said that unfortunately in the recent past film making had been reduced to only one class. However, she said it was a good sign that filmmaking trend in private TV channels was increasing.\nThe objective of National Film, Culture Policy 2018, revived by the present government last year, was not only to revive films but also to promote Pakistan’s narrative all over the world through screen tourism.\nMarriyum Aurangzeb said that film policy 2018, entertainment was given the status of the industry and given tax amnesty.\nShe said that in the film policy, attention has also been paid to restore the cinema houses in the country which were demolished when the industry deteriorated in the 1990s.\nThe establishment of the Film Institute, she continued was part of the vision of the development of this sector.\n“Due to our initiatives, recent films have done good business both at local at the global level,” the minister remarked.\n“As far as electronic media is concerned, the PTV and Radio Pakistan have the biggest infrastructure,” she said adding that steps were being taken to utilise that infrastructure for the betterment of the entertainment industry.\nThe minister said that PTV Academy should also create awareness among the children about the Constitution, democracy, and politics as well.\nEarlier Marriyum Aurangzeb inaugurated the National Film Production Institute.\nSecretary Information and Managing Director PTV Sohail Ali Khan and senior officers for the MoIB and PTV attended the ceremony.",
  "retrievedAt": "2025-08-11T08:32:01.580Z"
}
