{
  "title": "Chinese Embassy celebrates 72nd anniversary of diplomatic relations with Pakistani Diplomats",
  "link": "https://www.app.com.pk/national/chinese-embassy-celebrates-72nd-anniversary-of-diplomatic-relations-with-pakistani-diplomats-2/",
  "date_published": "2023-05-21T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): On the 72nd anniversary of establishing diplomatic relations between China and Pakistan, the Chinese Embassy held a reception titled “China-Pakistan Unbreakable Friendship and the Bright Future” with Pakistani Diplomats in Islamabad.\nMs. Pang Chunxue, Charge d’Affaires of the Chinese Embassy, the chief guest, Dr. Asad Majeed Khan, Foreign Secretary of Pakistan, Mazhar Javed, Director General of Foreign Service Academy, spoke at the reception, which was attended by former Pakistani Ambassadors to China, officials from Ministry of Foreign Affairs (MFA) and young Pakistani diplomats along with Chinese diplomats.\nMs. Pang welcomed friends to the Chinese Embassy and emphasized that the China-Pakistan relationship has profound historical roots, solid public support, and vital practical needs.\nMs. Pang stated that this year marks the 10th anniversary of the ‘Belt and Road Initiative’ proposed by President Xi Jinping and the 10th anniversary of the launch of the China-Pakistan Economic Corridor.\nShe said that with the joint efforts of both sides, CPEC has achieved fruitful outcomes covering areas of industry, agriculture, IT, disaster prevention and mitigation, etc., which made significant contributions to promoting Pakistan’s economic and social development, upgrading Pakistan’s infrastructure, improving Pakistani people’s well-being, enhancing people to people contact and deepening regional connectivity. CPEC has become the well-known hallmark of China-Pakistan cooperation.\nShe added that under the strong leadership of President Xi Jinping, China is steadfastly advancing the process of Chinese modernization. China will provide new opportunities for developing countries, including Pakistan, with new accomplishments in Chinese modernization. As developing countries, both China and Pakistan are constantly exploring development paths that suit their national conditions and are actively committed to maintaining world peace and stability, she maintained.\nMs. Pang Chunxue, chargé d’affaires of the Chinese Embassy, further informed that from May 5 to May 6, the Chinese State Councilor and Foreign Minister Qin Gang paid a successful visit to Pakistan, which is of tremendous significance in solidifying and deepening the China-Pakistan all-weather strategic partnership of cooperation.\nShe conveyed great appreciation to successive generations of diplomats from the two countries for their painstaking efforts and contributions.\nShe asserted that China will join hands with Pakistan to implement the consensus reached by the two countries leaders in real earnestness and continuously promote the great cause of China-Pakistan friendship with great strides.\nPakistan Foreign Secretary Dr Asad Majeed Khan applauded the contribution of generations of the two countries’ diplomats to the achievements of China and Pakistan’s unbreakable friendship and cooperation. The change of the compound of the Chinese Embassy in Pakistan itself is the witness of the development of friendship with its previous compound being handed over to the Pakistan government and became the Foreign Service Academy, and the new compound became the biggest one in all Chinese Embassies abroad.\nHe appreciated that Chinese friends always unswervingly provide generous help and support Pakistan’s sovereignty and independence, financial stability, and infrastructure construction.\nChina-Pakistan Economic Corridor has brought prosperity and progress to Pakistan’s economy and society, for which Pakistan is deeply grateful. In the year marking the 10th anniversary of the “Belt and Road Initiative” and the launch of the CPEC, China and Pakistan should jointly celebrate this memorable moment. Now that the baton of China-Pakistan friendship has been handed over to a new generation of diplomats, it is hoped that diplomats of the two countries will work together to build a closer China-Pakistan community with a shared future, he added.\nPakistani young diplomats said the reception was very warm and impressive, enhancing their knowledge and understanding of China and the CPC and strengthening the young diplomats’ friendship.",
  "retrievedAt": "2025-08-11T08:31:58.447Z"
}
