{
  "title": "Bilawal arrives on three-day visit to AJK to condemn G- 20 moot in IIOJK",
  "link": "https://www.app.com.pk/national/bilawal-arrives-on-three-day-visit-to-ajk-to-condemn-g-20-moot-in-iiojk/",
  "date_published": "2023-05-21T14:37:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, May 21 (APP): Foreign Minister and Chairman Pakistan Peoples’ Party (PPP) Bilawal Bhutto Zardari on Sunday arrived in Azad Jammu and Kashmir (AJK) capital Muzaffarabad on a three-day visit of the valley to express solidarity with the people of illegally occupied Jammu and Kashmir (IIOJK) against nefarious motives of the Indian government to pretend normalcy by holding a G-20 moot in the disputed region.\nBilawal Bhutto Zardari arrived at a local hotel where his party leaders and AJK government officials welcomed him while hundreds of his party workers were waiting at Kohala Bridge linking Pakistan and AJK to welcome their party chairman from the morning.\nThe local PPP leaders said that Bilawal Bhutto preferred to fly to the capital city due to some security reasons and directed the Party workers to back homes.\nBilawal Bhutto will meet local political leadership including that of PPP on a dinner hosted by the son of former AJK Prime Minister Ch. Abdul Majeed and will address AJK legislative Assembly on Monday evening besides holding media talks and other events. He will also address a public rally in Bagh District on Tuesday before flying back to Islamabad.The government of Azad Jammu and Kashmir has announced protests and rallies throughout the region on Monday against the G-20 summit in Srinagar and HR abuses in the held valley while traders have called a shutterdown strike in the capital against the Indian act to mislead the world community by holding the said moot.\nThe Prime Minister AJK Ch. Anwar Ul Haq accompanied by his cabinet members and government officials will himself lead a public rally at famous Burhan Wani Chouk in front of Press Club in the noon before the Legislative Assembly’s session which is expected to be participated by Foreign Minister Bilawal Bhutto Zardari and Federal Minister for Kashmir and GB Affairs Qamar Zaman Kaira.",
  "retrievedAt": "2025-08-11T08:31:53.754Z"
}
