{
  "title": "Balochistan govt to get NADRA’s services in execution of Health Card facility",
  "link": "https://www.app.com.pk/national/balochistan-govt-to-get-nadras-services-in-execution-of-health-card-facility/",
  "date_published": "2023-05-21T14:06:00.000Z",
  "source": "APP",
  "content": "QUETTA, May 21 (APP): The Balochistan government has inked an agreement with National Database and Registration Authority (NADRA) to get services in the establishment of command center and a central management information system under the flagship programme of Health Card.\nThe agreement was signed here Sunday between Chief Executive Officers (CEO) Balochistan Health Card Program, Asadullah Kakar and NADRA’s Chief Projects Gohar Khan in the presence of Director General Health Balochistan and CEO Federal Health Insurance.\nOn the occasion, Chief Projects Gohar Khan said that under the agreement, NADRA would provide data verification and allied services to the program.\nHe said that NADRA would help in providing a comprehensive Management Information System (MIS) in which all hospitals included in the panel would be linked to the NADRA database.\nThe much trumpeted Balochistan Health Card programme has expected to be executed soon as the people of Balochistan would avail free medical treatment facility.\nThe provincial government had decided to launch Balochistan Health Card facility at the cost of Rs 5.914 billion, to provide health insurance facilities amounting to Rs 1 million to 1.875 million families.\nAccording to programme, the Computerized National Identity Card (CNIC) will be considered the health card for the permanent residents of the province.\nThe objective of the program is to improve the health status of the targeted population through increasing access to quality health services and to reduce poverty through reduction of out-of-pocket payments for health expenditures.\nCurrently, over 1.8 million families are settled in Balochistan and there will be 100 percent coverage under the initiative and the scheme would be funded by regular budget in the future.",
  "retrievedAt": "2025-08-11T08:31:57.965Z"
}
