{
  "title": "Women right to control property-a key factor in achieving economic development, Shazia Marri",
  "link": "https://www.app.com.pk/national/women-right-to-control-property-a-key-factor-in-achieving-economic-development-shazia-marri/",
  "date_published": "2022-05-13T18:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP):”A woman’s right and ability to own, inherit and control property is a key factor in achieving economic opportunity and development, empowerment, security, shelter, and livelihood”.\nThis was stated by the Federal Minister for Poverty Alleviation and Social Safety, Shazia Marri while delivering her keynote address during a conference organized by the Legal Aid Society.\n“It also increases women’s power to make decisions in the household, exercise the option to leave toxic domestic environments, and build wealth and autonomy,” Shazia Marri said.\nEmphasizing upon the closing gap between law, policy and practice on women’s right to property, she said that fewer economic opportunities and multiple socio-economic constraints limit women’s intra-household negotiating power, hence their ability to mitigate or defend themselves from domestic violence.\nShe said that in fact, a woman’s economic dependence on a man has been recognised as a key ingredient in increased domestic violence and inter-partner violence against women, with many women being unable to leave or returning to abusers due to their inability to financially support themselves, particularly with additional barriers of at least one dependent child, not being employed outside of the home, possessing no property that is solely theirs, and lacking access to cash or bank and credit accounts.\nPakistan’s Constitution allows women the absolute right to own, acquire, inherit and control property through several articles.\nA complex set of overlapping legislation also oversees land acquisition, including outright sale-purchase, exchange, State grants (including evacuee rights acquired till 1975), inheritance, will, gift, pre-emption, mortgage, leases, licenses etc, she said.\nShe said that however, despite this, Pakistan Ranks 153 out of 156 on the World Economic Forum’s Global Gender Gap Index 2021. Only 18 percent of Pakistan’s labour income goes to women and economic opportunities for women in Pakistan were limited with the country only managing to bridge 32.7 percent of the gap between men and women in the workplace.\nShe pointed towards the most recent figures from Punjab about women’s ownership of property that the total number of women who own land are also significantly lower than the number of men who own land in Punjab and this figure might be indicative of the rest of the country.She said that to cope with these challenges the federal and provincial governments have sought to respond to these issues.They (Federal Government) have also initiated several programs to support women’s ownership of land and property.\nThis includes the Federal Ministry of Human Rights’ 2018 helpline and awareness campaign on the rights of women to inheritance under Islamic jurisprudence and the Constitution, and the Sindh Government’s 2008 initiative to distribute available government land mainly among landless women peasants.\nAnother ongoing welfare initiative, the Benazir Income Support Programme, provides income support to women of households that fall below the poverty line and has impacted more than 10 million households.\nShe said that in addition to these governmental initiatives, organisations such as the Legal Aid Society have played a massive role in improving women’s access to property. Their project, Women’s Right to Legal Property, has undertaken multiple activities, including increasing access to legal education to communities across Sindh, providing legal aid and assistance to the same vulnerable communities to better the quality of life of women – and thus, societies – across the province.",
  "retrievedAt": "2025-08-11T14:53:42.000Z"
}
