{
  "article_id": "2025-02-25_611d2056a3e245a0655adc93d1a3aa90",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-seeks-records-of-contempt-petitions-regarding-pti-founders-meeting-with-friends/",
    "retrieved_at": "2025-08-27T13:06:18.543Z"
  },
  "metadata": {
    "title": "IHC seeks records of contempt petitions regarding PTI founder’s meeting with friends",
    "author": null,
    "date_published": "2025-02-25T17:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 305,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 25 (APP):The Islamabad High Court (IHC) on Tuesday sought record of two contempt petitions regarding meeting of PTI founder Imran Khan with his family members and friends in jail. The court also instructed the petitioner to attach its order dated January 28, with the petition. The IHC's Justice Inaam Ameen Minhas heard the contempt petition of PTI founder along with the objections of registrar office. The petitioner has named secretary interior and jail superintendent as respondent in the case. Petitioner's lawyer Faisal Chaudhry Advocate said that the registrar office was not authorize to decide the maintainability of any case. Only the court could take such decision, he said. The lawyer said that the contempt petitions is moved on violation of court orders. This petition is moved on not granting permission to PTI founder to meet his friends in jail, he said. The lawyer said that this petition has no connection with another case pending before the court of acting chief justice. Faisal Chaudhry Advocate said that Superintendent Adiala Jail had given statement before the court of Justice Sardar Ijaz Ishaq Khan that meetings of PTI founder would be arranged as per the rules. On this statement, the court had disposed of the case, but Imran Khan was still not being allowed to meet his friends despite the assurance, he said. The court sought record of two contempt petitions and adjourned further hearing of the case. Meanwhile, the court served notices to respondents in petitions filed by Chairman PAC Junaid Akbar, Rauf Hassan, Sher Ali Arbab and Dr. Amjad seeking meetings with Imran Khan in Jail. Justice Khadim Hussain Soomro heard the case which was filed through lawyer Ayesha Khalid. The lawyer contended that the lists of names used to be sent to jail administration but it was not arranging meetings with PTI founder.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}