{
  "article_id": "2025-02-25_c735dc9b57360df277d0d12b3edebe80",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-pledges-equal-opportunities-for-children-vows-to-curb-child-labour-dr-syed-ata-ur-rehman/",
    "retrieved_at": "2025-08-27T13:06:22.997Z"
  },
  "metadata": {
    "title": "Govt pledges equal opportunities for children, vows to curb child labour: Dr. Syed Ata-ur-Rehman",
    "author": null,
    "date_published": "2025-02-25T14:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 430,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 25 (APP): The government is committed to providing equal opportunities for children's development without economic, social, or religious discrimination, and discouraging child labour in households. Additional Secretary of the Ministry of Religious Affairs and Interfaith Harmony, Dr. Syed Ata-ur-Rehman on Tuesday said this while presiding over the inauguration ceremony of the National Interfaith Child Protection Forum, jointly organized by Islamic Relief and UNICEF. The event, held at a local hotel in the federal capital, was attended by senior officials of the Ministry of Religious Affairs, representatives of social organizations, prominent religious scholars, and key figures from various faiths. The primary objective of the forum was to develop a collective roadmap for child protection, ensuring that all stakeholders play their role in addressing issues such as violence, exploitation, and poverty affecting children. It also intended to promote education, healthcare, and psychological well-being for children. During his address, Additional Secretary Dr. Ata-ur-Rehman emphasized the need for religious communities to collaborate in safeguarding children's rights. He assured that the ministry would extend full support to such initiatives and continue its efforts in this regard. He further stressed that despite differences in beliefs, the challenges faced by children remain common and require collective action. Earlier, Country Director of Islamic Relief, Asif Shirazi, highlighted that child protection is a shared responsibility. He expressed confidence that through this forum, all stakeholders could work together to secure a safer and healthier future for children. UNICEF Child Protection Specialist, Farzana Yasmeen, underscored the crucial role of religious leaders in raising awareness about children's issues. Meanwhile, Afshan Jamal, Child Protection and Youth Development Specialist, provided an overview of Islamic Relief Pakistan's nationwide efforts and presented the Terms of Reference (TORs) for the National Child Protection Forum. She emphasized that fostering dialogue among religious leaders could significantly improve children's lives. Prominent religious scholars also shared their insights on child protection. Mufti Zameer Ahmed Sajid pointed out that while child labour laws exist in Pakistan, the forum must explore ways to ensure their effective implementation. Allama Arif Wahidi suggested dispatching delegations to remote areas to assess and improve children's education and living conditions, urging parents and teachers to fulfill their responsibilities. Allama Tanveer Alvi called for comprehensive efforts to combat child-related issues, while Dr. Qari Abdul Rasheed stressed the importance of addressing child marriage, compensation marriages, and polio-related challenges. The participants collectively reaffirmed their commitment to advancing children's rights through religious teachings and collaborative efforts. The Ministry of Religious Affairs reiterated its pride in supporting initiatives for ensuring a safer, healthier, and more educated future for children in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}