{
  "title": "Switching to renewable energy way forward for Pakistan: Energy Minister",
  "link": "https://www.app.com.pk/national/switching-to-renewable-energy-way-forward-for-pakistan-energy-minister/",
  "date_published": "2023-11-23T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): Caretaker Minister for Energy Muhammad Ali on Thursday said the future of renewable energy in Pakistan holds great promise as the country seeks to address its growing energy demands while mitigating the environmental impact of traditional energy sources.\nWhile addressing a seminar titled Renewable Energy the Way Forward, jointly organized by Information Service Academy and Alliance for Good Governance Foundation, the minister said with abundant sunlight and wind resources, Pakistan has significant potential for solar and wind energy generation, said a press release.\nMuhammad Ali said that the government’s commitment to increasing the share of renewable in the energy mix, coupled with international support and investment was paving the way for a sustainable energy future.\nInitiatives such as the Alternative Energy Development Board (AEDB) and the implementation of supportive policies and incentives for renewable energy projects are driving the transition, he said and added, a diversified renewable energy not only enhances energy security but also contributes to reducing carbon emissions, aligning with global efforts to combat climate change.\nThe future of renewable energy in Pakistan represents a crucial step towards a cleaner, more sustainable and resilient energy landscape, he added.\nThe minister said that the government had recently approved the National Electricity Plan 2023 which provided guidelines, implementation mechanisms and tools for the realization of the National Electricity Policy goals for the power sector.\nMuhammad Ali laid emphasis on decarbonization and electrification, saying that they were critical components of Pakistan’s energy strategy for the future.\nThe minister also discussed the possible plan to expand sustainable energy, particularly focusing on wind and solar energy.\nPower sector plays an important role in climate change mitigation and accordingly the government is giving top priority to just energy transition in Pakistan.\nHe said that the true success of the transition was to have the real impact in the area of sustainable energy. The aim is to gradually decrease the tariff and move towards utilization of indigenous resource\nHe outlined three key priorities for the energy sector which included addressing exploration challenges by improving data availability, removing payment barriers, and revising policies; expanding the natural gas supply and focusing on the power sector, including transmission investments, promoting renewables, and resolving circular debt to ensure a stable power supply and payment resolution,” he said.\nSpeaking on the occasion, Managing Director Private Power and Infrastructure Board (PPIB) Shah Jahan Mirza, said that clean energy was the top priority of Pakistan.\nHe said that the one scenario will be the green scenario where the progress of wind and solar energy will be discussed and the other scenario will be the economic aspect.\nHe said, “In the past, Pakistan has not focused as much on decarbonisation but now there is a huge focus on this.”\nHe said Pakistan was working to develop renewable energy projects, improve energy efficiency, and reduce its reliance on fossil fuels. Pakistan was also looking to partners in the Middle East to help it achieve its decarbonisation goals, he said.\nThe seminar was attended by energy experts Engr. Asad Mahamood, Mr. Irfan Mirza from renewable energy resource, Mr. Ashraf Rana, Energy expert Dr. Irfan Yousaf, Economist Dr. Noor Fatima from REAP.\nDirector General ISA Saeed Ahmed Sheikh, representatives of civil society, academia, electronic and print media and University students.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:39:04.715Z"
}
