{
  "title": "PM for national-level disaster management strategy with teamwork of NDMA & PDMAs",
  "link": "https://www.app.com.pk/national/pm-for-national-level-disaster-management-strategy-with-teamwork-of-ndma-pdmas/",
  "date_published": "2023-11-23T10:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday asked the National Disaster Management Authority (NDMA) to collaborate with provincial disaster management bodies in order to formulate a national-level strategy.\nDuring his visit to the National Emergency Operation Centre (NEOC), the prime minister PM Kakar lauded the measures taken by NDMA and NEOC in coping with natural disasters. However, he also stressed steps to enhance the capacity of Provincial Disaster Management Authorities (PDMAs).\nThe prime minister emphasized benefiting from the research of foreign and Pakistani experts on climate change and the ways to reduce its disastrous effects.\nThe prime minister, who is due to participate in the 28th meeting of the Conference of Parties (COP-28) in the United Arab Emirates on December 1-2, said Pakistan would update the world about its experiences in the wake of climate change.\nChairman (NDMA) Lt Gen Inam Haider Malik briefed the prime minister about the national strategy for disaster management. Federal Ministers Jalil Abbas Jilani and Shahmshad Akhtar attended the meeting.\nThe meeting was told that NDMA had formulated a strategy for coping with disaster management, making a two-month advance forecast, and minimizing the losses.\nIt was highlighted that Pakistan was among the countries that were facing the consequences of climate change in the shape of glacier melting, floods, glacial lake outburst floods (GLOF), avalanches, landslides, and forest fires.\nThe meeting was apprised about the tools used by NDMA including mobile disaster vehicles and satellite monitoring to assess the high-risk areas. With a coordinated approach, the data collected is shared with the provincial and local administration.",
  "retrievedAt": "2025-08-11T10:39:11.049Z"
}
