{
  "title": "80% Pakistanis view climate change as the world’s one challenge",
  "link": "https://www.app.com.pk/national/80-pakistanis-view-climate-change-as-the-worlds-one-challenge/",
  "date_published": "2023-11-23T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): A recent research conducted by GSMA Intelligence with support from Huawei revealed that about 80% of Pakistanis across 16 countries now view climate change as the world’s number one challenge.\nAccording to a survey, 60% in Pakistan would accept a lower salary to work for an organization that had set a target to reduce its carbon emissions. That compares with about half of respondents, on average, in other countries surveyed, said a news release.\nPakistan is working to decrease CO2 equivalent emissions. The government is pursuing strategies for combating climate change, including the promotion of renewables and electric vehicles, a ban on plastic bags, and the billion-tree plantation drive.\nIt found that 60% of respondents consider climate or sustainability when buying a product, while 45% say they are willing to pay a premium for products and services that have been certified carbon neutral.\nThe inclination toward such “green purchasing” appeared to be greatest in countries that are most exposed to extreme weather conditions induced by climate change.\nThe highest correlations are seen in the Philippines, Pakistan, Brazil, Türkiye, and Indonesia–fast-growing emerging economies with direct exposure to warming and extreme weather events. Consumers in such countries indicated an above-average willingness to change their behaviour in response to climate change.\n“There is a latent ‘green premium’ available for telecom operators if sustainability criteria can be embedded into product design and marketing,” said Tim Hatt, head of research and consulting at GSMA Intelligence.\n“Consumers want to align with green brands and will pay for assured credentials on the products they buy, and there is a first-mover advantage still out there for companies to meet this demand.”\nFrom an industry perspective, Tim Hatt of GSMA Intelligence said “For operators, selling 5G and other technologies to enterprise verticals offers both productivity gains and higher power efficiency,” Tim said.\n“When it comes to investing, sustainability is no longer considered a niche,” said David Trevitt, a digital transformation advisor at Huawei, which funded the GSMA Intelligence research.\nTrevitt recently addressed the topic of sustainability and corporate reputation in Huawei’s thought leadership magazine, Transform.\n“Climate response is an ethical issue that is becoming an increasingly important part of reputation management for many enterprises. To avoid reputational damage, organizations must embed their climate response in their business strategy.”",
  "retrievedAt": "2025-08-11T10:39:24.779Z"
}
