{
  "title": "Amnesty Int’l urged to advocate for release of Yasin Malik from Indian jail",
  "link": "https://www.app.com.pk/national/amnesty-intl-urged-to-advocate-for-release-of-yasin-malik-from-indian-jail/",
  "date_published": "2023-11-23T10:25:00.000Z",
  "source": "APP",
  "content": "MIRPUR  ( AJK) November 23 (APP): Amnesty International, a global human rights organization, has confirmed receiving an appeal for the early release of illustrious Kashmiri politician and Chairman of Jammu Kashmir Liberation Front (JKLF) Yaseen Malik from continual detention, currently languishing in an Indian infamous jail.\nIn response to his appeal, Amnesty International has been urged to intervene immediately and advocate for his release to facilitate constructive dialogue and establish lasting peace in the internationally acknowledged disputed region of Jammu and Kashmir.\nUS-based Raja Muzaffar, Acting Chairman of JKLF and Director Board of South Asia Democracy Watch USA, while lodging an appeal to AI, expressed deep concern over the prolonged detention of Yasin Malik in a message reaching and released to the media here Thursday.\nRecognizing Amnesty International’s steadfast commitment to promoting justice, protecting human rights, and advocating for prisoners of conscience, Muzaffar believed that the organization was well-positioned to address Malik’s case.\nYasin Malik, a prominent figure in Kashmiri politics, has been detained for an extended period, casting a shadow over the region’s prospects for peace and stability. His release is seen as a crucial step towards initiating a constructive dialogue and fostering a peaceful environment in Jammu and Kashmir.\n“As a leading global human rights organization, Amnesty International has consistently demonstrated its dedication to championing justice and advocating for prisoners of conscience worldwide. By taking up Yasin Malik’s case, Amnesty International has an opportunity to significantly contribute to the promotion of human rights and the establishment of lasting peace in the region”, Muzaffar said.\nRaja Muzaffar emphasized the need for Amnesty International to use its influence and resources to bring attention to Yasin Malik’s plight and actively advocate for his immediate release. By doing so, Amnesty International can play a vital role in facilitating dialogue, fostering peace, and upholding the principles of justice in Jammu and Kashmir, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:39:34.459Z"
}
