{
  "title": "ANF recovers 44 kg drugs in 11 operations",
  "link": "https://www.app.com.pk/national/anf-recovers-44-kg-drugs-in-11-operations/",
  "date_published": "2023-11-23T07:33:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Nov 23 (APP): Anti-Narcotics Force (ANF) while conducting 11 operations across the country managed to recover 44 kg of drugs and arrested eight accused, said an ANF Headquarters spokesman here on Thursday.\nHe informed that 2.4 kg of heroin was recovered from a parcel at a courier office located in Shahrah-e-Faisal, Karachi. The heroin was soaked in six pants, booked for the UK.\n230 grams of weed was recovered from a parcel sent from Canada at a courier office in Multan.\nThe spokesman informed that 1174 grams hidden in a passenger’s trolley bag was recovered at Sialkot airport. The accused was leaving for Bahrain by flight number GF-769.\n7.2 kg hashish was recovered from two suspects riding a motorcycle on Shangla Hill Road, Faisalabad.\n2.4 kg hashish and 150 grams of Ice drug were recovered from a motorcycle rider intercepted on Lahore Road, Faisalabad.\n18 kg hashish was recovered from a vehicle stopped on Kahuta Road Islamabad while an accused was also arrested during the operation.\nThe spokesman further informed that 3.5 kg hashish was recovered from a parcel sent from Quetta at Jinnah International Airport.\n3 kg of heroin and 700 grams of Ice drug were recovered from a vehicle intercepted on Ring Road Peshawar. A drug smuggler was also arrested.\n1 kg Ice drug and a 9 mm pistol were recovered from a vehicle on Jamrud road while the accused was arrested during the operation.\n2 kg hashish was recovered from an accused rounded up near Sajjad Restaurant in Sukkur.\n2.4 kg hashish was recovered from an abandoned motorcycle near Alien Housing Society in Hub.\nSeparate cases have been registered against all the accused under the Anti-Narcotics Act and further investigations are under process.",
  "retrievedAt": "2025-08-11T10:39:16.030Z"
}
