{
  "title": "Govt to provide maximum facilities to ECP for holding free, fair elections: Solangi",
  "link": "https://www.app.com.pk/national/govt-to-provide-maximum-facilities-to-ecp-for-holding-free-fair-elections-solangi/",
  "date_published": "2023-11-23T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Thursday said the caretaker government was committed to conduct free, fair and transparent elections and it would provide all possible facilities to the Election Commission of Pakistan for conducting elections.\nHe said this during a meeting with the delegation of Islamabad Policy Research Institute (IPRI), which wad led by its President Major General (retd) Raza Muhammad.\nThe current political and economic situation of the country, elimination of fake news and disinformation, upcoming general elections, social media issues, and elections in other countries of South Asia were discussed in the meeting, a press release said.\nThe delegation informed the minister about the IPRI’s latest research on the political scenario of the country, and appreciated the caretaker government’s commitment for conducting free, fair and transparent elections.\n“Equal opportunities are being provided to all political parties, there will be no discrimination against anyone,” Murtaza Solangi said.\nHe said for improvement of the political environment in the country, development of consensus among all political parties was indispensable.\nThe minister said the world was facing the problems of misinformation, disinformation and fake news, while the latter was the biggest challenge on social media.\nAll stakeholders would have to play their role in ending fake news, he maintained.\nThe role of media in the upcoming general elections was also discussed in the meeting.\nSolangi said the media would be provided a conducive environment during the elections. Equal coverage was being given to all political parties on state media, he added.\nThe delegation expressed its determination to continue working with the government in efforts to build a consensus in Pakistan.\nThe delegation included IPRI Director (Advocacy and Communication) Siddique Humayun, Hisham, Miss Jawaria, Institute of Strategic Studies Director Khurram Abbas and Naufal, also from Institute of Policy Studies.",
  "retrievedAt": "2025-08-11T10:39:07.144Z"
}
