{
  "title": "Pakistan exploring debt for nature swaps with global agencies: Shamshad",
  "link": "https://www.app.com.pk/national/pakistan-exploring-debt-for-nature-swaps-with-global-agencies-shamshad/",
  "date_published": "2023-11-23T18:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP):Caretaker Minister for Finance, Revenue and Economic Affairs, Dr Shamshad Akhtar, said that amid growing international fiscal constraints, the country is exploring debt-for-nature-swap with global agencies to enhance its market competitiveness as foreign direct investment is harder to fetch in these testing times.\nShe was speaking at a high-level plenary titled: “Reforms for a Brighter Future” on the last day of the 26th Sustainable Development Conference organized by the Sustainable Development Policy Institute here on Thursday.\nDr Shamshad Akhtar said after months of hard work, the interim leadership has successfully reached a staff-level agreement with IMF for a standby $3 billion loan grant. She added that the interim regime was committed to the IMF program which should be a homegrown agenda of Pakistan.\n“Marco’s economic stability has become more difficult in the last decade due to delay in structural reforms, surge in global commodity prices, and tightening of financial restrictions,” she said. She also highlighted the country’s rising vulnerability to climate shocks that had increased manifolds. She expressed her optimism for the forthcoming COP-28 international climate moot and hoped to have a positive discourse at the forum.\nDr Abid Qaiyum Suleri, SDPI Executive Director, said Pakistan’s economic problems were diagnosed some 70 years ago and we all are aware of the problems and their solutions. He stressed the need to work out a mechanism to address all the challenges. He said the country is also showing huge resilience after facing a plethora of crises with the hope of a better future.\nKeynote Speaker, Dr Luis Felipe López-Calva, Global Director, Poverty and Equity Global Practice, The World Bank said to understand the prevailing crisis, the first thing is that the world has entered a structurally lower growth. In Pakistan, he said, the economic growth was insufficient to reduce poverty whereas the external elements or partners could not bring change in an economy.\nNajy Benhassine, the World Bank Country Director, said the human capital crisis is a silent disaster that did make news headlines as 40% of children under 5 years of age in Pakistan are stunted which is the most pressing challenge for the long-term growth of Pakistan.\n“Economic difficulties are not new for Pakistan but rather recurring as the global shocks, COVID-19 crisis and floods further aggravated the situation in Pakistan,” he added.  He suggested prioritizing the issue by focusing on child stunting reduction, quality of water and availability nexus, human capital crisis, developing the private sector, the energy sector which is vital for RE transition and important for macroeconomic stability, water and agriculture nexus, low agriculture productivity and creating fiscal space because it will require huge finances.\nSpeaking at a panel discussion titled: “The Governance Approach” the former Advisor to the Prime Minister on Institutional Reforms and Austerity, Dr Ishrat Husain, has said the continuity of reforms and policies needs to be ensured amid community and youth ownership to achieve the objective of improved governance in the country.\nHe said under the Civil Service Reforms, a six-pronged strategy focusing on aptitude, leadership, career planning and promotion, performance, incentives and direct retirement helped in bringing a change in the conventional civil service to make it more proactive and in line with the developing world trends.\nTariq Banuri, Prof. at the University of Utah, said the system which helps in decision-making is weak and is deliberately weakened whereas the lacunas in bureaucracy, and lack of training and expertise for technical subjects were adding more to the governance issue.  Dr Banuri concluded that the youth would take the reform agenda forward by initiating evidence-based critique of the existing reform policy.\nVice-Chancellor of Beaconhouse University, Dr Moeed Yusuf, said the binding constraint to achieve improved governance was the psychological barrier that either the nation wants to improve the country or keep the elite happy which was not possible to exist at the same time.  He pointed out the lack of resources, persistent disbalance of payments, and the country’s failure to provide a genuine positive proposition to the world.\nDr Ayesha Razzaque, the educationist, also highlighted the disconnect between major stakeholders, unawareness of the widely varying contexts in which public schools exist, and no patience for delayed gratification among the core issues marring the education sector that is also driving the governance through cascading effect.\nDr Naazir Mahmood, a Development Expert, expressed his views on the political side of the governance issues and underscored that the elephant in the room alluding to the powerful elites capturing the maximum resources and influence over core decision-making processes was not part of the main policy discourse which should be included for a holistic and equity-based approach.\nSpeaking at a podium discussion titled: “Ten Years of BRI: Lessons Learnt & Charting a Way Forward for Green Development”, Senator Mushahid Hussain Sayed said the China-Pakistan Economic Corridor (CPEC) has got a fresh impetus after the recent visit of Pakistan’s political and military leadership to China and new initiatives have also been taken under this mega project.\nHe said despite the lack of governance, bureaucratic incompetencies, and inconsistencies in certain areas, our all-weather friend China is still willing to support Pakistan.\nDr Abdul Qayyum Suleri, SDPI Executive Director, said the government has not yet fully realized the true potential of CPEC. The government has introduced the transhipment policy after nine years of construction of Gwadar Port, which shows how serious we are,” he added.\n“We need to get our house in order to get the benefit of any cooperation or cooperation from our friendly country,” he said, adding that the government never negotiated and finalized the tariff of the power generation plant under CPEC. Dr Suleri informed the audience that SDPI is working on climate climate-smart agriculture project to enable the country’s agriculture sector to be more climate resilient. He said China import $100 billion worth of Soybean annually and Pakistan could capture this huge market by producing the crop. He informed that in order to explore and tap the green opportunities under CPEC, SDPI has formed a 10-member steering committee (five members each from Pakistan and China).\nMr Wang Sita from the Chinese Embassy said that CPEC is the landmark project of BRI under which 35$ billion of direct investment has so far been made in Pakistan producing 36,000 jobs, generating more than 8000 megawatts of electricity and 886 kilometers of power transmission lines.\nDr Zhang Jiangyu, Executive Director of BRI Development Institute, said Pakistan-China bilateral economic cooperation is going to turn into green cooperation.\nShakeel Ahmed Ramey, the CEO of the Institute of Eco-civilization Research and Development, pointed out the idea of building green cities on new concepts and models to avoid emerging environmental challenges such as smog. He said 78% of energy is consumed in cities and 60% of greenhouse gas emissions come from cities, which needs to be lowered.\nMustafa Haider Syed, Executive Director of Pakistan China Institute, said the BRI offers a huge opportunity for Pakistan to find new green energy projects under CPEC as China has announced $100 billion in financing for the green energy projects in the next 10 years.\nSpeaking at a Roundtable titled: “Addressing Pakistan’s Inflation Woes,” Dr Waqar Masood Khan, Advisor to the Prime Minister on Finance, said that the inflationary situation started with the Ukraine war as the price of oil and other commodities skyrocketed, and Pakistan cannot be singled out in this respect.\nHe said normally our inflation stood at around 6% to 7% but during the past few years, it touched unprecedented levels, which should be debated.  He said middleman’s control has an exponential impact on inflation because there is a big difference between the wholesale market and the retail market.\nAli Rehman from Prime Institute said inflation has remained the primary concern of successive governments, so policy and administrative measures to control inflation have proved counter-productive.\nMiss Hiba Zaidi from International Finance Corporation said with regard to food prices there are structural issues along with dysfunctional markets as there are about 50 per cent losses of perishables from farm to market. Moreover, she said, there are also poor seed quality as well as productivity issues.\nDr Aliya Hashmi Khan from Quaid-i-Azam University said that decision-making is very important to control inflationary trends. She said there are some forward-looking and backward-looking agents in the market in consumer businesses but both are economic agents.\nSaud Bangash, a representative of the Pakistan Business Council, said we have to ascertain whether the inflation is cost-driven or demand-driven. Our issue is primarily economic management while the issue of our economy is structural in nature.\nSpeaking at a session titled: ‘Pakistan’s SDGs and poly crisis: How are we Faring? Dr Amjad Saqib, the Chairman of the Benazir Income Support Programme, has said despite the country’s growing vulnerability due to climate change and weak social safety net, no city or province has replicated the Sustainable Development Goals. “Whether we really want to achieve the SDGs is a matter of political will,” he said.\nDr Saqib said: “I want to build a model city which will be an embodiment of SDGs. When I shared the idea with a friend, his response was that such a city would not be possible in Pakistan. To his comment, I said that it will be the real Pakistan we all dream of.”\nSenator Seemi Ezdi, the Chairperson of the Senate Standing Committee on Climate Change, stressed the need for transformation in some sectors, including agriculture, urban development, etc. There was a dire need for sustainable green energy and climate resilience, she added. He called for reviving the National SDG Implementation Plan.\nDr Jai Das from Aga Khan University said there is a clear disparity among the provinces and the districts of Pakistan, regarding coverage of essential interventions. Moreover, the use of any contraceptive method had been declining annually, he observed.\nMs Aisha Khan, the CEO of Mountain and Glacier Protection Organization, said that health was often forgotten in the climate discourse. “The adverse effects of climate change on health are many and have been recognized on international forums. The first response to loss and damage is felt by the health sector. Although health is seen as a non-economic loss, it has financial implications.\nDr Sameen Siddiqi from Aga Khan University gave a presentation on ‘Sehat Sahulat Program Evaluation.’ He said his study revealed that 90% of the people were aware of the program, although there were some gaps in the knowledge about the facility.\nSpeaking at a high-level policy dialogue titled: Impact of climate change nutrient and food security in Pakistan, the caretaker Minister for Planning Development and Special Initiatives, Muhammad Sami Saeed, on Wednesday said that climate-smart agriculture sector development was the top priority of the government to ensure food safety and security in the country.\nHighlighting the challenges being faced by the local agriculture sector, the minister said that low crop productivity was the bigger issue and the government had paid full attention to enhancing the output of all major crops to ensure food safety and security in the country.\nHe said that the government was also making interventions for the efficient use of water, soil and fertilizers for the conservation of natural resources as well as protecting the environment. He said that the corporate culture in farming would bring innovation and mechanization, adding that the provincial governments have also allocated the land for this.\nDr Irfan Ullah from Nutrition International said that about half of the local population was facing different deficiencies related to nutrition.\nHe said that a multi-sectoral approach was required to overcome the issues of malnutrition and hunger.\nMs Coco Ushiyama, Country Director of the World Food Programme, said that global hunger is rising due to conflicts, climate and COVID.\nShe said that currently, the humanitarian needs seem small, but if it does not respond properly, it will not tackle the climate change challenges, particularly in conflict and climate-hit areas. Countries like Pakistan suffer a lot, which shares less in global emissions, she said adding that these fragile countries received fewer funds as compared to the other countries, she added.\nLynnda Kiess from the Nutrition Division of the World Food Program (WFP) said that global food prices came down after touching their historic peak. She added that the prices went high due to different conflicts including the Russia-Ukraine war and post post-pandemic situation. She said that state-based armed conflict triggered the forced displacement of over 100 million people, who were prone to hunger and malnutrition.\nDr Friederike Greb from WFP said that commodity prices were still high in 44 countries out of 163 countries. Out of the total 44 countries with inflation rates of 10 per cent, 9 countries 50 per cent and  4 counties with 100 per cent inflation, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:39:00.279Z"
}
