{
  "title": "ICRC, PRCS help reconnect families",
  "link": "https://www.app.com.pk/national/icrc-prcs-help-reconnect-families/",
  "date_published": "2023-11-23T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): The International Committee of the Red Cross (ICRC) in collaboration with the Pakistan Red Crescent Society (PRCS) facilitated families from across Pakistan to attend the International Families Conference from 22-23 November.\nThe local conference hub at the PRCS national headquarters hosted 13 families with a relative separated or being sought as a result of international migration, mainly towards Europe, a news release said.\nOrganized by the ICRC Central Tracing Agency and National Red Cross and Red Crescent Societies around the world, the conference is a unique global forum that brings together families who have lost contact with their loved ones because of natural disasters, international migration, or other humanitarian emergencies.\nThis year, 44 conference hubs will be hosted by the Red Cross Red Crescent Movement around the globe, with 700 families from 44 contexts around the world expected to join.\nIn Pakistan, the ICRC and PRCS work closely with Red Cross and Red Crescent Societies throughout the world under the Restoring Family Links (RFL) program to help people separated from their families or without news of them following natural disasters, international migration, emergencies as well as in other situations of humanitarian need.\nThe conference provided families and practitioners the space to connect with a global support network, share their experiences, and inspire each other to take effective action for themselves, their families and the wider community. It also called to attention the coping strategies for the psychological distress these families experience.\nSpeaking to the families at the conference, Nicolas Lambert, head of the ICRC’s delegation in Pakistan, said, “I cannot imagine the magnitude of your grief. This is a unique opportunity for the families not to feel alone in their struggle, but part of a global solidarity network where together they can be stronger.”\nThe conference took place in a hybrid format and featured online and face-to-face sessions and panel discussions. Families from Pakistan shared their experiences and saw how others around the world are coping with the uncertainty and learned about the support services available to them.\nSardar Shahid Ahmed Laghari, Chairman of PRCS, said, “Families are often a main actor in the search, and they deserve to be supported and heard. Authorities, communities and society at large should acknowledge the families’ plight and support them by responding to their multifaceted needs.”\nThe Family Links Network is truly global in scope, with dedicated volunteers, members and staff who work directly with family members, communities and local authorities to find and reconnect separated loved ones. In Pakistan, families looking for relatives in Europe can visit www.tracetheface.org – an online tool to assist people looking for their lost relatives.",
  "retrievedAt": "2025-08-11T10:38:38.976Z"
}
