{
  "article_id": "2025-07-15_a0700a8b60fdc96027290bf88cb256bf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/health-minister-urges-polio-vaccination-to-protect-children-from-deadly-diseases/",
    "retrieved_at": "2025-08-27T09:36:41.483Z"
  },
  "metadata": {
    "title": "Health minister urges polio vaccination to protect children from deadly diseases",
    "author": null,
    "date_published": "2025-07-15T17:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 258,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 15 (APP):Federal Minister for National Health Services Syed Mustafa Kamal has emphasized the importance of childhood immunization, urging parents to ensure their children are vaccinated against poliovirus and other life-threatening illnesses. While responding to a Calling Attention Notice in Senate, he underscored that childhood immunization remains the most effective defense against poliovirus. He assured that the anti-polio vaccine is entirely safe for children's health. The minister noted that the government is proactively involving religious scholars and community leaders to raise public awareness and promote childhood vaccination. He pointed out that 73 cases of poliovirus were reported last year, while only 14 have been recorded so far this year-reflecting a notable decline. He also praised the extensive efforts of the Taliban-led Afghan interim government in launching a comprehensive campaign to eliminate poliovirus throughout Afghanistan. Responding to a Calling Attention Notice, Minister of State for Law and Justice Barrister Aqeel Malik affirmed that the government is taking every possible step to boost industrial growth and generate employment opportunities. He outlined key measures including lowering policy rates and taxes, streamlining the industrial sector, and implementing strategic policy interventions to support domestic industries. The minister stated that the Engineering Development Board is being revitalized to enhance its role in industrial development. He highlighted that exports are on the rise, supported by long-term policy initiatives aimed at promoting local industry. Licenses have been issued to 37 mobile phone manufacturing companies, and 25 new electric vehicle investments have been secured. Additionally, solar panel production projects are progressing towards advanced stages of implementation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}