{
  "article_id": "2025-07-15_25928f23ebe3bba033e9bdd884737373",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dar-highlights-pakistans-call-for-peace-dialogue-at-sco-summit-condemns-aggression-in-gaza-iran/",
    "retrieved_at": "2025-08-27T09:38:29.539Z"
  },
  "metadata": {
    "title": "Dar highlights Pakistan’s call for peace, dialogue at SCO Summit; condemns aggression in Gaza, Iran",
    "author": null,
    "date_published": "2025-07-15T13:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 360,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Tianjin-China, Jul 15 (APP):Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar reaffirmed Pakistan's commitment to regional stability, multilateral cooperation, and peaceful dispute resolution during his address at the Shanghai Cooperation Organization (SCO) Council of Foreign Ministers meeting in Tianjin on Tuesday. Speaking at the high-level gathering, Dar emphasized the SCO's role as a stabilizing force in a world facing profound geopolitical challenges. He praised China's leadership in advancing the organization's agenda and welcomed Belarus as the newest full member. Dar strongly criticized Israel's military actions in Gaza, labeling them a \"reckless disregard for international norms\" that has led to a dire humanitarian crisis. He urged an immediate ceasefire and reiterated Pakistan's support for a two-state solution based on pre-1967 borders with East Jerusalem as Palestine's capital. The foreign minister also denounced recent attacks on Iran, including U.S. strikes on nuclear facilities, calling such actions against SCO member states \"unacceptable.\" Dar expressed concern over recent escalations in South Asia, referencing the Pahalgam attack allegations that brought Pakistan and a neighboring nuclear-armed state to the brink of conflict. He stressed that disputes must be resolved through dialogue, not coercion, and called for structured talks to address long-standing issues. \"Pakistan remains committed to ceasefire agreements and regional stability, but we cannot accept the normalization of arbitrary force,\" he stated. Dar advocated for institutional reforms within the SCO, including the adoption of English as a third official language and enhanced Secretariat capabilities. He also highlighted the need for economic collaboration, proposing greater use of national currencies to mitigate global financial shocks and backing the creation of an alternative development funding mechanism. He also underscored the China-Pakistan Economic Corridor (CPEC), a flagship Belt and Road Initiative project, as vital for regional connectivity and shared prosperity. The deputy prime minister called for renewed engagement with Afghanistan through the SCO-Afghanistan Contact Group and emphasized a unified approach to counterterrorism, rejecting its use for political gains. He also flagged climate change as a critical challenge requiring collective action. In closing, Dar reaffirmed Pakistan's dedication to the \"Shanghai Spirit\" of mutual trust and cooperation, urging member states to pursue a future \"defined not by confrontation, but by collaboration.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}