{
  "article_id": "2025-07-15_8e50c1229c481573739f840804b0b818",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-stands-with-turkiye-yesterday-today-and-always-says-aleem-khan/",
    "retrieved_at": "2025-08-27T09:39:22.264Z"
  },
  "metadata": {
    "title": "Pakistan stands with Turkiye – yesterday, today and always; says Aleem Khan",
    "author": null,
    "date_published": "2025-07-15T10:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 348,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, July 15 (APP):Federal Minister for Communications Abdul Aleem Khan on Tuesday reaffirmed Pakistan's unwavering solidarity with Turkiye, praising the Turkish people's courage and resilience during the failed coup attempt of July 15, 2016 - a defining moment he described as a \"beacon of democratic will and national unity.\" Speaking at a ceremony hosted by the Turkish Embassy here to mark Turkiye's Democracy and National Unity Day, the minister paid tribute to the martyrs who laid down their lives to defend their country's democratic foundations. \"This day is not only about remembering a dark chapter,\" Aleem Khan said, \"but about celebrating the spirit of a nation that rose above adversity to protect its democracy, its sovereignty, and its constitution.\" The event, attended by Turkish Ambassador Dr. Irfan Neziroglu, diplomats, senior Pakistani officials, and civil society representatives, was marked by a profound expression of brotherhood between Pakistan and Turkiye. Aleem Khan lauded the Turkish nation's collective defiance during the coup attempt, which he said reflected the deep commitment of the people, inspired by the leadership of President Recep Tayyip Erdogan. \"They did not succumb to fear. Instead, they rose 'united' to safeguard their country's future,\" he remarked. \"Pakistan observed with deep admiration the solidarity and sacrifice of the Turkish people. Their courage echoes across borders, and their determination serves as a reminder of what nations can achieve when they stand together,\" he added. Emphasizing the enduring nature of Pakistan-Turkiye ties, the minister said the two countries are \"more than allies - we are brothers, connected by history, culture, and common dreams.\" He recalled feeling emotionally moved each time he visited Turkiye and saw the flags of both nations flying side by side. Aleem Khan also reiterated Pakistan's continued support for Turkiye's regional and global stances on peace, counterterrorism, and national security, adding, \"Turkiye holds a place in my heart no less than my own homeland.\" In closing, he emphasized that both nations must build on this shared history and deepen their partnership for a peaceful and prosperous future. \"Long live Pak-Turk friendship,\" the minister concluded, to a resounding applause.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}