{
  "article_id": "2025-07-15_96712d95c04b7bef1359573573c6abb7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/zero-tolerance-against-human-smuggling-illegal-immigration-talal-chaudhry/",
    "retrieved_at": "2025-08-27T09:36:29.978Z"
  },
  "metadata": {
    "title": "Zero tolerance against human smuggling & illegal immigration: Talal Chaudhry",
    "author": null,
    "date_published": "2025-07-15T17:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 537,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 15 (APP):Minister of State for Interior Talal Chaudhry on Tuesday informed the Senate that the government has adopted a zero-tolerance policy against human smuggling and has launched a series of legal, administrative, and enforcement actions to curb the menace, which has tarnished Pakistan's global reputation and national security. During the question-and-answer session in the upper house, the minister acknowledged that while most overseas Pakistanis travel through legal means, a small fraction engaged in illegal migration has tarnished Pakistan's reputation internationally. He highlighted incidents in countries such as Saudi Arabia, where forged passports and identity documents were discovered. \"These individuals are not only breaking laws but also bringing disrepute to the country,\" he stated. Chaudhry said that major cleansing campaigns have been conducted within the ministry and its attached departments, including the Federal Investigation Agency (FIA), leading to criminal proceedings and departmental actions against officials complicit in human smuggling or willful negligence. To further deter illegal migration, the government has introduced three new laws, empowering authorities to impose travel bans on individuals found involved in or attempting human smuggling. Additionally, Risk Analysis Units have been established at all international airports with defined risk parameters, such as first-time travelers between 18-32 years of age from high-risk districts, to flag and investigate suspicious travel attempts. \"The number of offloaded passengers has increased by more than five times compared to last year, and a robust pre-boarding scrutiny system is now in place,\" he added. The minister highlighted that Pakistan has also extradited human smugglers from abroad, seized their assets, and blocked their bank accounts. \"Red Book-listed offenders have been apprehended, and international cooperation with partner countries has intensified,\" he said. Referring to a recent international conference in London attended by over 50 delegations and 20 interior ministers, Chaudhry said Pakistan's efforts in immigration reforms, e-passport implementation, and legal improvements were acknowledged globally. Chaudhry also informed the Senate about Voluntary Repatriation Campaign for undocumented foreign nationals-particularly Afghan nationals-stating that the effort was part of a responsible state policy, not a political move. \"It is essential to know who is living in our country, on what terms, and for how long,\" he emphasized. He reported that under the campaign's first phase, over 850,000 undocumented individuals were repatriated, till to date over 1 million undocumented individuals were repatriated. Transit centers were set up in cooperation with provincial governments, where returnees were provided secure and humane conditions before transportation to \"Afghan nationals who have returned voluntarily are being treated with respect and dignity. We have established 24/7 helplines and facilitation centers in all provinces and Islamabad. Complaints are investigated thoroughly,\" he stated, noting that not a single verified case of harassment or property seizure has been reported. He further confirmed that 19 types of visas are currently being offered to Afghan citizens, including for education, business, and health, and those wishing to return legally are welcome to do so under proper documentation. The minister emphasized that the issue is not just economic but also social, as aspirations to migrate illegally are often driven by peer influence or misleading social media content. \"We need collective cooperation from all provinces. While Punjab and Sindh have extended full support, efforts in other regions must be strengthened.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}