{
  "title": "Governor seeks Nobel Peace Prize for Imran Khan",
  "link": "https://www.app.com.pk/national/governor-seeks-nobel-peace-prize-for-imran-khan/",
  "date_published": "2020-03-01T00:42:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 01 (APP)::Punjab Governor Chaudhry Mohammad Sarwar has called for awarding the Nobel Peace Prize to Prime Minister Imran Khan in recognition of his role in Afghan peace process.\nIn a media statement issued by the Governor’s House on Sunday, he said that Imran Khan was the only political leader who had been opposing war in the region. By all standards, he deserved the Nobel Prize, he added.\nThe governor said that Prime Minister Imran Khan gave a message of peace by setting free a captured Indian pilot, though India had been promoting war hysteria.\nThe governor said that a period of 19 years of war was now going to end in Afghanistan because of sincere efforts of Pakistan. He said Imran Khan had been calling for resolving the Afghan dispute through dialogue since the day the USA and its allies launched as war in Afghanistan. And today, America and Taliban had admitted the utility of Imran Khan’s standpoint, he added.\nCh Mohammad Sarwar said: “Alhamdulillah, today war is dying down and peace is taking roots in Afghanistan.” Under the leadership of Prime Minister Imran Khan, Pakistan played a historic and decisive role in Afghan peace process, and Taliban-America peace accord was the victory of principled stand of the prime minister, he added.\nThe governor said that entire world community was also praising the Pakistan Army for rendering sacrifices for establishment of peace in the region. The 220 million Pakistanis were proud of Pakistan armed forces which fought out terrorism effectively.\nHe said that Pakistan was all supportive of peace in the region as it would ensure progress and prosperity of the people living here.\nPakistan was advocating peace in the neighbouring country also, and India must resolve the Kashmir issue in accordance with the UN resolutions, instead of using guns and bullets against helpless Kashmiris and even its own people in different regions.\nAtrocities against Indian Muslims must come to an end, otherwise threats to regional peace would continue looming large due to India’s negative approach, he added.",
  "retrievedAt": "2025-08-11T18:52:57.263Z"
}
