{
  "title": "Govt committed to ecosystem restoration, environment conservation for future generations: Romina",
  "link": "https://www.app.com.pk/national/govt-committed-to-ecosystem-restoration-environment-conservation-for-future-generations-romina/",
  "date_published": "2024-06-04T13:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): Prime Minister’s Coordinator for Climate Change, Romina Khurshid Alam on Tuesday emphasised that the government was committed to ecosystem restoration and protect the environment for future generations.\nShe was addressing the seminar as chief guest by National Institute of Maritime Affairs (NIMA), in collaboration with the World Wide Fund for Nature (WWF) and Bahria University (BU), to commemorate World Environment Day, a news release said.\nRomina Khurshid Alam insisted on the significance of environment day and steps taken by government of Pakistan for ecosystem restoration.\nThe event brought together eminent government officials, environmental experts, activists, and students to address pressing environmental issues facing Pakistan’s coastal communities.\nThe guests included Norwegian Ambassador Per Albert Ilsaas, Sri Lankan Minister A.Christy\nRuban, Farzana Altaf Shah, DG Pakistan Environmental Protection Agency, Amb.\nNafees Zakarya, Executive Director COMSATS, Gauhar Zahid Malik, President &\nExecutive Editor at Pakistan Observer and Muhammad Ibrahim Khan, WWF-Pakistan’s\nrepresentative.\nThe theme of the seminar was “Coastal Erosion Management, Mangroves\nPreservation & Ecosystem Rehabilitation” under the overall United Nation’s theme of\n“Land Restoration, Desertification and Drought Resilience”. Eminent speakers and\nscholars highlighted the importance of environment day and need to protect the nature from the adverse effects of climate change. Students from renowned universities participated in the Policy & Scientific Solution Competition.\nAt the end winning students received their trophies.",
  "retrievedAt": "2025-08-11T02:57:19.725Z"
}
