{
  "title": "Jimmy Mauldin highlights steel sector’s importance for economic development",
  "link": "https://www.app.com.pk/national/jimmy-mauldin-highlights-steel-sectors-importance-for-economic-development/",
  "date_published": "2024-06-04T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP):A delegation headed by Jimmy Mauldin (Acting Consul General, United States Consulate Karachi) visited the National Steel Complex Limited (NSCL) at Bin Qasim Karachi.\nHe was accompanied by Stephen Berlinguette (Director CSG, USAID), Sarah Parvez (Economic Growth Advisor, USAID), and Farrukh Mehboob Khan (Chief of Party, USAID Investment Promotion Activity) said a news release received here on Tuesday.\nNSCL is Pakistan’s first and largest completely integrated, environmentally friendly steel complex, located at Port Qasim on an area of 220 acres.  It utilizes the world’s most advanced Direct Reduced Iron (DRI) technology, based on the most environment-friendly MIDREX Process in the USA.\nDuring his visit, Mauldin emphasized the US government and business community’s interest in exploring Pakistan as a potential economic hub.\nHe highlighted the significant growth opportunities in the industrial sector, spurred by the desire of the US Embassy to enhance trade relations between the U.S. and Pakistan. “Steel is vital for the economic development of any country,” Mauldin stated, “and NSCL will catalyze industrial growth in Pakistan.”\nMauldin took a brief round of the facility and appreciated the state-of-the-art technology installed at the DRI Plant. He concluded his visit by reiterating the U.S. Government’s unwavering support for the revival of the industrial sector of Pakistan especially in the steel sector.\nEarlier, Zaigham Adil Rizvi, CEO of NSCL, gave a detailed presentation about the project and shared statistics about the global steel industry. He was of the view that currently Pakistan is among the countries that rely mostly on imports when it comes to a range of semi-finished and finished steel products and engineering goods. “By producing high-quality steel within Pakistan, we can manufacture such equipment locally by value addition with the help of downstream industries,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:57:17.022Z"
}
