{
  "title": "UNICEF country representative calls on Chairperson BISP",
  "link": "https://www.app.com.pk/national/unicef-country-representative-calls-on-chairperson-bisp/",
  "date_published": "2024-06-04T11:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): A delegation from United Nations’ Children Fund (UNICEF), led by Country Representative Abdullah Fadil, called on Chairperson Benazir Income Support Programme, Mrs. Rubina Khalid, at the BISP headquarters. The meeting centered on strengthening collaboration between the BISP and UNICEF, with a particular focus on enhancing the health and nutrition of women and children in Pakistan\nRubina Khalid emphasized her commitment to increasing awareness of the Nashonuma Programme, which aims to address malnutrition among women and children. She highlighted the critical role that awareness plays in resolving various issues related to health and nutrition, particularly for vulnerable populations.\n“My focus will be on raising awareness of the Nashonuma Programme,” stated Mrs. Khalid. “By doing so, we can address many issues, especially those affecting women and children. BISP and UNICEF need to collaborate closely on this front to ensure the well-being of our communities.”\nMr. Abdullah Fadil praised Benazir Income Support Programme’s initiatives and commended the program’s effectiveness in shock responsiveness, targeted assistance, and financial literacy among its beneficiaries. He underscored the importance of Benazir Income Support Programme’s role in uplifting the socio-economic status of the most vulnerable segments of society.\n“We need to work together to find practical solutions for the malnourished community, especially women and children,” Mr. Fadil remarked. “BISP’s efforts in better targeting and financial literacy are commendable, and I look forward to our continued collaboration to further these goals.”\nThe UNICEF delegation included key representatives: Anteneh Girma Minas, Chief of Nutrition; Sadaf Zulfiqar, Social Policy Specialist; Dr. Noreen Arshad, Nutrition Officer; Dr. Wisal Khan, Nutrition Specialist; Larissa Bruun, Chief of Resource Mobilization; and Xinyi Ge, Program Specialist. The delegation met with BISP Secretary Amer Ali Ahmad and DG NSER/CCT Mr. Naveed Akbar, discussing the strategic direction and operational aspects of their collaborative efforts.",
  "retrievedAt": "2025-08-11T02:57:41.750Z"
}
