{
  "title": "IESCO installs over 30,000 AMI meters so far in Rawalpindi",
  "link": "https://www.app.com.pk/national/iesco-installs-over-30000-ami-meters-so-far-in-rawalpindi/",
  "date_published": "2024-06-04T11:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 4 (APP):Under digitization and up-gradation plan, the Islamabad Electric Supply Company (IESCO) has expedited a process for switching to advance metering infrastructure (AMI) meters and installed over 30,000 meters in various areas of Rawalpindi  so far.\nAt domestic consumer level, these meters were installed in areas of Gulzar Quaid, Dr Abdul Qadir Road, Gangal and Khana, the Chief Engineer Operation Director IESCO Muhammad Aslam Khan said this while talking to APP here Tuesday.\nHe said that AMI meters have also been installed at various transformers in areas of Korang Town, Westridge etc.\nUnder the plan, the company would install over 900,000 AMI meters, initially in Rawalpindi City Circle, Rawalpindi Cantonment Circle and Taxila (Division), he said.\nAslam Khan said the task would be completed by June 2026 for which initially two contractors have been hired to install around 2000 AMI daily in the said circles.\nHe said the Asian Development Bank has provided financial assistance to complete the project under second power distribution enhancement investment programme .\nThe contract for the project was signed on September, 3, 2022 while its effectiveness date was January 2023, he added.\nKhan said that main data and back data centres which were part of the project had already been set up at the IESCO’s head office and Gujjar Khan respectively.\nThe Operation Director said AMI system would bring about a permanent elimination of power pilferage with systematic control of transmission through round-the-clock monitoring of the electricity meters.\nThis technology would help reduce power sector losses, enhance the quality of billing and recoveries, control power load-shedding and also address the consumers’ complaints of wrong or over-billing, he said.\nAslam Khan said the AMI system would end human interventions in meter reading, enhance customer support, better measurements, more accurate billing, a degree of control of consumption and help improve IESCO’s ability to reduce non-technical losses.\nHe said automated 100 per cent accurate and timely meter readings would reduce costs incurred on meter readings significantly. In case of any power theft, tripping, power failure, or defective meters, automated intimation would be received in the data centre with instructions to the concerned SDO for rectification in a short time.\nThe consumers will also be able to control their electricity bills by monitoring their electricity consumption daily through a mobile application, he remarked.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:57:46.903Z"
}
