{
  "title": "UNHCR announces major energy project to solarize 125 public facilities in Pakistan",
  "link": "https://www.app.com.pk/national/unhcr-announces-major-energy-project-to-solarize-125-public-facilities-in-pakistan/",
  "date_published": "2024-06-04T10:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 4 (APP):On World Environment Day, UNHCR, the UN Refugee Agency has announced that it would solarize 125 educational and health facilities across Pakistan this year.\nThese state-of-the-art solar systems will provide clean and sustainable energy, benefiting refugees and their hosting communities.\nThe facilities being solarized include 103 girls and boys public educational institutions, 16 public health facilities, four vocational training centres along with other critical community infrastructure – delivering uninterrupted and affordable energy and improving access to essential services for Pakistani and refugee families.\nThe impact of the investment is already being felt: teachers report an increase in school attendance, including of girls, as well as improving the overall learning environment.\n“Having a fan and lights at the school means I can concentrate on my learning,” said Amina, a refugee child in Khyber Pakhtunkhwa’s province.\n“I’ve encouraged other girls in my community to join me, to spend evenings in the classroom environment to finish our homework after the school day ends, now that it is cool,” she added.\nAs part of this major endeavour, UNHCR will also distribute and install more than 34,000 Solar Home Systems, in refugee villages in Khyber Pakhtunkhwa and Balochistan, said a press release issued here.\nThese solar home systems, which are portable solar kits, power three lights and a fan, can charge a mobile phone and will have a transformative impact on families who currently have no access to electricity.\nMore than 300 solar streetlights have also already been installed in a number of remote refugee villages, transforming security and social interactions among refugees of all age groups, especially women and girls.\nAn expansion of the solar streetlight activities will also take place in other remote and isolated refugee villages and their hosting areas.\nThis will provide much-needed safety during nighttime hours, allowing studying and communal activities such as sports and social gatherings to take place long after the sun has set.\nThese activities are complemented by dedicated vocational trainings on solar repair and maintenance for men and women, community awareness on efficient use of energy resources and environmental protection, as well as the planting of some 74,000 new trees in Khyber Pakhtunkhwa and Balochistan.\nUNHCR’s energy programme – funded generously by the Federal Ministry of Economic Cooperation and Development (Germany), Global Affairs Canada (GAC), the Netherlands and the United States of America, will have substantial environmental benefits and will result in savings of over 5,000 tons of CO2e emissions annually which is equivalent to saving 500,000 gallons of diesel or 2,500 tons of unburnt coal.\n“Given climate change, it is important to find clean energy solutions to address the growing energy needs in the country while mitigating the environmental impact,” said Philippa Candler, UNHCR’s Representative in Pakistan. “Through such initiatives, UNHCR is not only improving access to essential services but also contributing to efforts to fight climate change.”\nFirmly on the frontlines of the climate emergency, with waves of concurrent drought and flooding threatening the social, environmental and economic development of the country, Pakistan requires bolstered international support and solidarity. UNHCR, the UN Refugee Agency, with the support of the international community, remains committed to addressing the challenges posed by the climate change in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:58:04.699Z"
}
