{
  "title": "PM embarks on five-day China visit to meet leadership, business community",
  "link": "https://www.app.com.pk/national/pm-embarks-on-five-day-china-visit-to-meet-leadership-business-community/",
  "date_published": "2024-06-04T07:01:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 4 (APP): Prime Minister Shehbaz Sharif on Tuesday departed for a five-day visit to China from June 4 to 8, at the invitation of Chinese President Xi Jinping and Premier Li Qiang.\nDeputy Prime Minister and Foreign Minister Ishaq Dar, Defence Minister Khawaja Muhammad Asif, Planning Minister Ahsan Iqbal, Finance Minister Muhammad Aurangzeb, Petroleum Minister Dr Musaddik Malik and Information and Broadcasting Minister Attaullah Tarar are accompanying the prime minister.\nThis is the first official visit of Prime Minister Shehbaz to China since assuming office, which is significant vis-a-vis the second phase of the China-Pakistan Economic Corridor and strengthening the Pakistan-China Strategic Economic Partnership.\nOn the first leg of his visit, the prime minister will land in Shenzhen city, where he will attend a business forum to promote partnership between the businessmen and investors of the two countries. Besides the Huawei Headquarters, he will also visit the Nanshan One Window facility to examine the Chinese one-window operation.\nDuring his visit to Beijing, Prime Minister Shehbaz will meet with President Xi Jinping and Premier Li Qiang and attend a signing ceremony of MoUs on bilateral cooperation. Interaction with government authorities, heads of Chinese companies and investors, and a visit to the Peoples’ Monument are part of the second leg of the prime minister’s visit.\nLater, he will travel to Xi’an city to meet senior Chinese leadership besides visiting model farms and green technology companies to observe the models of Chinese agricultural development.\nDuring the visit, the two sides will discuss the second phase of CPEC, bilateral strategic partnership and cooperation in trade, investment, defence, national and regional security, energy, space research, science and technology, education, skills development, and culture. The visit is expected to become a milestone to further strengthen the partnership between Pakistan and China.",
  "retrievedAt": "2025-08-11T02:58:05.118Z"
}
