{
  "title": "Interior Minister meets Pope Francis in Vatican City",
  "link": "https://www.app.com.pk/national/interior-minister-meets-pope-francis-in-vatican-city-2/",
  "date_published": "2024-06-04T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 4 (APP): Minister for Interior, Mohsin Naqvi on Tuesday met Pope Francis at the Vatican City during his visit to Europe. The Minister was accorded a warm welcome upon his arrival in the Vatican City.\nDuring the meeting, both sides discussed ways to promote peace, brotherhood, interfaith harmony and dialogue. Pope Francis commended Pakistan’s efforts towards immediate repair and reconstruction of Churches in the aftermath of Jaranwala tragedy.\nThe Pope said that his message to the people of Pakistan was peace, adding “We all should work together for establishing peace in the world.” He also stated that the Prime Minister of Pakistan had invited him for a visit and he would try his best to visit Pakistan soon.\nThe Pope expressed concern over the situation in Palestine, stating that it was a cause of huge concern. He added that he stayed updated on the humanitarian situation in Palestine through daily briefings with workers engaged in relief efforts.\nHe emphasized that the interfaith dialogue and harmony was the key to resolve issues.\nMinister, Mohsin Naqvi thanked him for his effective stance on the Palestine issue, which had been widely appreciated.\nThe minister apprised Pope Francis regarding Pakistan’s sacrifices and efforts in the war against terrorism. He lauded the services of the Pope towards promoting peace and harmony in the world.\nThe minister said that the protection of minorities was top priority of the government of Pakistan adding that teachings of our Holy Prophet (PBUH), Father of the Nation and constitution emphasized the protection and well-being of minorities.\nHe highlighted that the Constitution of Pakistan ensured equal rights to all minorities.\nThe meeting concluded with the Pope praying for Pakistan’s progress and prosperity and expressing good wishes for the people of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:58:05.896Z"
}
