{
  "title": "Parents’ refusal, misconceptions of polio drops major hurdle in anti-polio efforts: Irshad Sodhar",
  "link": "https://www.app.com.pk/national/parents-refusal-misconceptions-of-polio-drops-major-hurdle-in-anti-polio-efforts-irshad-sodhar/",
  "date_published": "2024-06-04T09:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 4 (APP):Coordinator Emergency Operations Center Sindh, Irshad Ali Sodhar Tuesday urged the media to help remove misconceptions about polio vaccine and dispel negative propaganda to support the government in giving final push to make the country polio-free as parents refusal are major hurdle in anti-polio efforts.\nTalking to PTV news channel, he said polio drops were meant to stop children from getting disabled for life.\nThe majority of nations have eradicated this illness, but regrettably, misinformation about the anti-polio campaign still persisted here.\nThese rising refusal rates in various cities including Karachi underscore the urgent need for increased public awareness and education about the critical role of polio vaccination in eradicating the disease from the country, he stressed.\nHe said that vaccination cannot be done forcibly rather it has to be done in agreement with parents, adding, we want to convince parents that the vaccination is in the best interest of their children.\nDespite significant achievements of the programme, the cunning poliovirus is still surviving and finds a way for its\nsurvival due to parents refusals, he added.\n“Parents are requested to avoid fake propaganda against polio vaccine and vaccinate their children to protect them from the poliovirus,” he appealed.\nThe government of Pakistan is striving to hit the virus hard through this special campaigns, he said, adding, there is no cure for polio, vaccination is the most effective way to protect children from this crippling disease.\nRepeated immunizations will only protect millions of children from polio, allowing almost all countries in the world to become free of polio, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:58:06.252Z"
}
