{
  "title": "My China visit to take bilateral ties to a new height: PM",
  "link": "https://www.app.com.pk/national/my-china-visit-to-take-bilateral-ties-to-a-new-height-pm/",
  "date_published": "2024-06-04T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 4 (APP): Prime Minister Shehbaz Sharif expressed the hope that his five-day visit to China starting Tuesday would take the bilateral relationship to a new height as it would mark discussions on the CPEC second phase, business-to-business cooperation and government-to-government projects.\nThe prime minister, in a televised statement before departing for his first official visit to China after assuming office, said that with the support from the ministers, government officers and experts, they would hold talks with the Chinese leadership on multiple subjects with tireless efforts and sincerity of purpose.\nHe said both sides would discuss cooperation in multiple sectors like agriculture, information technology, infrastructure, youth skill training, vocational training, industrialisation, Special Economic Zones, expansion and commercialisation of Gwadar Port, mining, and minerals, and sign accords. The discussion on the expansion of the Silk Route through road and sea linkages is also on the agenda.\nHe said that undoubtedly, China-Pakistan ties were time-tested as both countries trusted each other and held consultations on all matters of mutual interest.\nHe also appreciated the Chinese unconditional support of Pakistan through all testing times like disasters, wars, quakes and others.\nPrime Minister Shehbaz recalled that during the previous tenure of Nawaz Sharif, bilateral relations entered a new phase as a $45 billion investment was arranged under the CPEC which brought in prosperity and rid the country of load-shedding that had led to the closure of industries and adversely impacted the agriculture sector.\nPakistan’s adversaries could not digest this cooperation but one should not worry about this, he commented.\nThe prime minister spoke high of the dynamic and visionary leadership of Chinese President Xi Jinping which developed China into the second biggest economic and military power besides leading the efforts to end wars and pave the way for peace.\n“This is the vision and leadership which I am inspired by and which took China-Pakistan ties to the height of the Himalayas, made it deeper than the oceans, sweeter than the honey, and stronger than steel.\nThe prime minister also thanked China for continuously raising the voice for Kashmir freedom and supporting Kashmiris without any confusion. Similarly, Pakistan also supported Chinese sovereignty and territorial integrity like the principle of one-country two systems, Hong Kong, Taiwan which Pakistan calls an integral part of China, the South China Sea, Global Development Initiative (GDI), and the Global Security Initiative (GSI).\nHe also requested the countrymen to pray for the success of his visit to make it helpful for Pakistan’s progress and prosperity.",
  "retrievedAt": "2025-08-11T02:58:04.413Z"
}
