{
  "title": "President, PM laud Security Forces after successful Tank operation; vow to defeat India-backed terror networks",
  "author": null,
  "content": "ISLAMABAD, Oct 24 (APP):President Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif on Friday jointly praised Pakistan’s security forces for a successful counter-terrorism operation in Tank, hailing the action as a major blow to militants they say were operating with Indian support and pledging to continue efforts to eradicate the menace of terrorism from the country.\n\nPresident Zardari, in a separate statement issued by the Presidency, commended the professionalism and bravery of security personnel involved in the Tank operation and reaffirmed his full support for the government’s counter-terrorism campaign, naming it “Operation ‘Azm-e-Istihkam’.”\n\nThe president described terrorism as a scourge whose elimination requires the Nation’s full backing of the security forces and vowed that the sacrifices made for Pakistan’s peace and stability “will not go in vain.” He paid tribute to the martyrs and extended condolences to their families, saying Pakistan-hostile elements would not be allowed to succeed.\n\nPrime Minister Shehbaz Sharif, in a separate statement from the Prime Minister’s Office, congratulated the security forces for their “professional skill” in the operation in Tank, which resulted in the killing of eight foreign militants described as being supported by India.\n\nThe Prime Minister said the government was determined to uproot the menace of terrorism from the country, and vowed to smash the sinister designs of those who seek to damage Pakistan’s territorial integrity.\n\nBoth the dignitaries emphasized the state’s resolve to continue sustained operations against terrorist networks and reaffirmed that the nation stands shoulder-to-shoulder with its security institutions until the threat is eliminated.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/855249_59646834.jpg",
  "retrievedAt": "2025-10-25T02:04:32.241Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-pm-laud-security-forces-after-successful-tank-operation-vow-to-defeat-india-backed-terror-networks/",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T18:56:19.000Z"
}
