{
  "title": "DPM Dar, Polish counterpart pledge to deepen bilateral ties, boost trade, strengthen multilateral cooperation",
  "author": null,
  "content": "ISLAMABAD, Oct 24 (APP):Deputy Prime Minister and Minister of Foreign Affairs (DPM/FM), Senator Mohammad Ishaq Dar on Friday reaffirmed Pakistan’s commitment to strengthening relations with Poland and broadening cooperation in trade, investment, defense, and multilateral diplomacy during the official visit of Polish Deputy Prime Minister and Foreign Minister Radoslaw Sikorski here from October 23–24.\n\nThe visit, held at the invitation of Deputy Prime Minister Dar, marked a significant step in enhancing diplomatic, economic, and people-to-people ties between Pakistan and Poland. Both leaders underscored their shared resolve to promote peace, stability, and prosperity in their respective regions through sustained dialogue and partnership.\n\nDuring their talks, the two Deputy Prime Ministers agreed to hold annual bilateral political consultations to sustain high-level engagement and develop mutually beneficial initiatives. They also welcomed the signing of a Memorandum of Understanding (MoU) between their respective Ministries of Foreign Affairs to promote closer diplomatic collaboration and institutional exchanges.\n\nDeputy Prime Minister Dar briefed his Polish counterpart on the Jammu and Kashmir dispute, while DPM Sikorski shared insights on the situation in Ukraine. Both sides emphasized the importance of finding peaceful solutions to conflicts in line with international law and the UN Charter, and they highlighted the role of multilateral forums in advancing global peace and conflict prevention.\n\nHighlighting Pakistan’s commitment to economic cooperation, the two Deputy Prime Ministers Dar and Sikorski agreed to intensify bilateral trade and investment, diversify their trade portfolios, and enhance business-to-business (B2B) collaboration through trade missions and fairs.\n\nDar welcomed the longstanding presence of Poland’s ORLEN/POGC in Pakistan’s energy sector, noting that its technological expertise and investment could pave the way for broader industrial cooperation. Both sides also identified new areas of collaboration, including green technologies, agri-food processing, IT and digital services, and climate action initiatives.\n\nThe Deputy Prime Minister underlined Pakistan’s ongoing economic reforms in public finance management, debt management, and tax automation, inviting Polish expertise and cooperation in these areas. He also reaffirmed Pakistan’s commitment to implementing international conventions under the EU’s GSP+ framework, supporting sustainable development and good governance.\n\nThe two Deputy Prime Ministers expressed their resolve to strengthen defense cooperation through training programs, exchanges, and collaboration between their armed forces and defense industries. They unequivocally condemned terrorism in all its forms, calling for the firm implementation of relevant UN Security Council resolutions and greater intelligence sharing to counter transnational threats.\n\nThey also agreed to work jointly against disinformation campaigns and transnational organized crime, including human trafficking and irregular migration, while promoting safe and regular migration under international commitments.\n\nRecognizing the deep historical ties between the two nations, rooted in the legacy of Polish refugees and officers who contributed to Pakistan’s early aviation history, both leaders reaffirmed their commitment to preserving this shared heritage.\n\nThey agreed to enhance educational and research cooperation, including through university partnerships, cultural exchanges, and collaboration between think tanks. In this regard, both sides welcomed the signing of an MoU between the Polish Institute of International Affairs (PISM) and Pakistan’s Institute of Strategic Studies Islamabad (ISSI).\n\nAt the conclusion of the visit, Sikorski thanked Deputy Prime Minister Ishaq Dar and the people of Pakistan for their warm hospitality and extended an invitation for Dar to undertake an official visit to Poland. Both sides expressed optimism that their renewed partnership would translate into tangible cooperation across multiple sectors and contribute to global peace and prosperity.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/APP73-221025Islamabad.jpg",
  "retrievedAt": "2025-10-25T02:04:10.325Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dpm-dar-polish-counterpart-pledge-to-deepen-bilateral-ties-boost-trade-strengthen-multilateral-cooperation/",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T18:56:19.000Z"
}
