{
  "title": "Pakistan to continue unwavering support till resolution of Kashmir issue: NA Speaker",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-unwavering-support-till-resolution-of-kashmir-issue-na-speaker/",
  "date_published": "2021-01-22T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): National Assembly Speaker Asad Qaiser on Friday said people and government of Pakistan condemned the atrocities committed on the innocent Kashmiris in strongest possible terms and reiterated unwavering support till its just resolution.\nTalking to President Asaz Jammu and Kashmir Sardar Masood Khan said silence of international community towards Indian atrocities in Kashmir was incomprehensible.\nHe called upon the international community to take notice of the matter and take steps for ending the worst state sponsored human rights violations in Indian illegally occupied Kashmir.\nCurrent situation of illegally Indian occupied Jammu and Kashmir and further ways and means to highlight the issue at international level came under discussion. Chairman Parliamentary for Kashmir Shehryar Afridi was also present in the meeting.\nThe speaker said Kashmir issue was the unsettled agenda of the partition plan of subcontinent and leaving it unresolved would put the peace of the region at stake.\nThe Speaker said parliament stood by their Kashmiri brethren in their just struggle for self determination. He said the recent unconstitutional and inhumane steps taken by the present Indian regime in occupied valley had been raised at all Parliamentary Forums including Commonwealth Parliamentary Association (CPA), Inter-Parliamentary Union (IPU) and  Parliamentary Assembly of the Economic Cooperation Organization (PAECO) for mustering support for ending decades old tyranny.\nHe said peace in the region would only be possible with resolution of Kashmir issue in light of United Nations resolutions.\nHe informed that standing committees on human rights and foreign affairs as well as parliamentary committee on Kashmir have been directed to raise Kashmir issue globally.\nHe said recent discourse in United Kingdom and European Union Parliament was evident that the world was concerned about the situation in occupied Kashmir. The speaker said an International conference on Kashmir was being seriously considered.\nThe President Azad Jammu and Kashmir Sardar Masood Khan said issue of Kashmir stood unresolved at the list of United Nations since last 72 years. International community should look towards its resolution in accordance with the aspirations of people besides ending to state sponsored terrorism, he said.\nHe said that parliament and government of Pakistan had aptly raised the issue at international parliamentary and other multilateral forums, respectively. He added that parliamentary diplomacy could play an excellent role in highlighting the Kashmir issue globally.\nPresident Azad Jammu and Kashmir said recent discussions in United Kingdom House of Commons and European Union were clear depiction of awareness caused by the effective diplomatic and parliamentary efforts of speaker national assembly.",
  "retrievedAt": "2025-08-11T20:16:00.291Z"
}
