{
  "title": "NHA attracts Rs 144 bln private sector investment for road",
  "link": "https://www.app.com.pk/national/nha-attracts-rs-144-bln-private-sector-investment-for-road/",
  "date_published": "2021-01-22T10:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): National Highway Authority (NHA), during past one year, has successfully attracted private sector investment with projects worth over Rs. 144 billion surpassing the average annual Foreign Direct Investment (FDI) in Pakistan.\nBesides other benefits, the expected revenue earnings from these projects would be over Rs. 391 billion, an official of NHA told APP here on Friday.\nHe said the modern concept of infrastructure development, Public Private Partnership (PPP) has become a popular mode of road construction also known as Build-Operate-Transfer (BOT) model in which the private sector builds a project and operate a facility for an agreed period of time ranging from 20 to 30 years.\nThe private party bears the responsibility of design, construction, operation and maintenance of the project and in return the party is authorized to receive toll/other revenue for a certain period.\nIslamabad-Lahore Motorway was one of major PPP projects which was handed over to a concessionaire for a 20 years period in 2014 and scope of the project overlay and modernization of 357 km M-2).\nHabibabad Bridge on Grand Trunk Road (N-5) in Okara was the other\nproject completed on BOT basis.\nAbout 136 km Super Highway was another major NHA project converted to Karachi-Hyderabad Motorway on BOT basis. Recently opened for traffic 91 Sialkot-Lahore Motorway was also built on the BOT model.\nAmong the upcoming PPP projects of the NHA included Hyderabad-Sukkur\nMotorway. Recently the ECNEC has given go-ahead to the construction of 306km-long Motorway at a cost of Rs165.679 billion.\nThe Motorways envisages construction of 6-lane wide, access-controlled motorway which will start from Hyderabad and terminate at Naro Canal Sukkur.\nHe said that NHA also planned to build Sialkot-Kharian and Kharian Rawalpindi Motorways on BOT basis. Similarly Balkasar-Mianwali road and Mianwali-Muzafargarh Road would be dualised under the PPP model, he said.\nHe said Multan- Muzaffargarh-D.G. Khan road was also being planned to be built on the PPP-BOT model.",
  "retrievedAt": "2025-08-11T20:16:01.885Z"
}
