{
  "title": "Govt to abide by court verdict on Senate poll: PM",
  "link": "https://www.app.com.pk/national/govt-to-abide-by-court-verdict-on-senate-poll-pm/",
  "date_published": "2021-01-22T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP):Prime Minister Imran Khan Friday while emphasizing transparency in Senate election, said the government would abide by the court verdict on the matter.\nThe prime minister, in a meeting with Senator Sajjad Khan Turi, said the history was evident of horse trading in Senate election and the government desired to hold fair election of the Upper House of parliament.\nSpecial Assistant to PM on Political Affairs Amir Dogar also attended the meeting which discussed the strategy for upcoming Senate election.\nSenator Sajjad Turi apprised the prime minister of positive and effective contribution by outgoing senators in legislation.\nMeanwhile, the prime minister also met the Members of National Assembly from Faisalabad including Muhammad Asim Nazir, Khurram Shahzad and Shahid Nazir.\nAdvisor Abdul Razzak Dawood and SAPM Malik Amir Dogar also attended the meeting.\nThe parliamentarians appreciated the government’s business friendly policies which also helped to uplift the industrial sector.\nImran Khan was also apprised of the boost in exports following Pakistan’s access to international markets owing to government’s prudent foreign policy.\nThe parliamentarians put forward their proposals for industrial development in Faisalabad and also highlighted the measures taken by them to resolve the problems in their respective constituencies.\nPrime Minister Imran Khan also met the legislators from Swabi including Senator Liaqat Tarakai, MNA Usman Khan Tarakai, KP Minister Shahram Tarakai and MPA Muhammad Ali Tarakai.\nThe meeting focused on ongoing mega development projects in Swabi. The parliamentarians apprised the prime minister of the problems in their respective constituencies and the steps being taken for their resolution.\nThe prime minister said the provision of relief to the masses was government’s priority and urged the public representatives to play their positive role by highlighting the public issues in legislature.",
  "retrievedAt": "2025-08-11T20:15:59.038Z"
}
