{
  "title": "German ambassador meets CM, discuss expansion of cooperation",
  "link": "https://www.app.com.pk/national/german-ambassador-meets-cm-discuss-expansion-of-cooperation/",
  "date_published": "2021-01-22T15:17:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 22 (APP): Ambassador of Germany Bernhard Stephan Schlagheck called on Punjab Chief Minister Sardar Usman Buzdar at his office on Friday and discussed various matters including the expansion of bilateral cooperation.\nTalking on the occasion, CM Usman Buzdar stated that solid steps will be taken to further promote relations as Germany was the best partner of Pakistan.\nThe government will take advantage of German expertise to develop the automobile industry, IT, health and social sector on modern lines, he said adding, Punjab will take a lead for promotion of cooperation in different sectors as different facilities were provided to the investors under one roof.\nThe CM asked the German investors to take benefit of tremendous investment opportunities as special incentives were being provided to foreign investment.All the necessary facilities were provided under one roof in special economic zones being established in different districts, he added.\nHe said the construction sector has a lot of potential and five cement factories were issued No Objection Certificates (NOCs), while 12 more NOCs will be issued soon.\nThe chief minister emphasized that development of less developed areas was focused and a special package was given for backward areas of south Punjab.\nThe establishment of the south Punjab secretariat was an important initiative as the development process was brought to the doorstep of the common man.\nOn the other side, the CM pointed out that the government was fully focused on the development of the agriculture sector and the latest technology will be utilized for enhancing cotton production. The government was working on developing new cotton seed and agricultural credit card scheme was in the offing for farmers. Every citizen will be given health coverage and this program will be completed in the current year, he added.\nThe PTI government was given priority to improving good governance, service delivery and development of backward areas and the development journey was continuous despite impediments, he added.\nGerman Ambassador said he was happy to visit Punjab and appreciated the CM’s vision for the development of backward areas. German investment companies were interested to invest in different sectors in Punjab and cooperation will be further expanded, he added.\nChairman P&D, CEO PBIT and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:15:59.043Z"
}
