{
  "title": "National Assembly adjourned to pay respect for PPPP lawmaker",
  "link": "https://www.app.com.pk/national/national-assembly-adjourned-to-pay-respect-for-pppp-lawmaker/",
  "date_published": "2021-01-22T07:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): The National Assembly session was adjourned on Friday as a mark of respect for PPPP MNA Pir Noor Muhammad Jeelani who passed away last month due to coronavirus.\nThe session was started with the recitation of verses from Holy Quran and Naat and National Assembly Speaker Asad Qaisar presided over the proceedings.\nHe announced the panel of chairpersons for the 28th session of the National Assembly and the members included MNAs Amjad Ali Khan, Riaz Fityana, Munaza Hassan, Bashir Virk, Ghulam Mustafa Shah and Shahida Akhtar Ali.\nThe House offered Fateha for those former and incumbent lawmakers as well as their relatives who passed away in near past.\nThe deceased personalities including Senator Kalsoom Perveen, mother of JI Chief Siraj-ul-Haq, former Prime Minister Mir Zafar Ullah Khan Jamali, former Deputy Speaker National Assembly Nawaz Khokhar, mother of Opposition Leader Shehbaz Sharif, journalist Arshad Waheed Chaudhry and security personnel who lost their lives in the line of duty.\nPPPP MNA Naveed Qamar and PTI MNA Abul Shaooor Shad paid tributes to the deceased MNA from NA-221 (Tharparkar) Pir Noor Muhammad Jeelani and spoke regarding his political career.\nThey said that Pir Noor Muhammad was a humble person with soft heart and he would be remembered forever due to this politeness and struggle for the people of his constituency.\nLater, MNA Ahsan Iqbal complained about summoning the session of the National Assembly on a short notice. He said there must be a schedule of National Assembly sessions and proper time should be given to lawmakers to join the session.\nPPPP MNA Naveed Qamar also endorsed Ahsan Iqbal and demanded for timely information to lawmakers about the schedule of the sessions.\nMinister of State for Parliamentary Affairs Ali Muhammad Khan admitted that session was called on short notice.\nHowever, he appreciated the PTI Chief Whip Aamir Dogar for ensuring timely information to the MNAs about the session.\nHe assured that MNAs would be informed well before time about the session but asked MNA Ahsan Iqabl to seriously participate in the proceedings of the session after its onset.\nLater, the House was adjourned as a mark of respect for PPPP MNA Pir Noor Muhammad Jeelani. The next sitting will be held on January 25, 2021 (Monday) at 4 p.m.",
  "retrievedAt": "2025-08-11T20:16:05.353Z"
}
