{
  "title": "PM inaugurates landmark Rs. 35.5 billion Karachi Green Line Bus Rapid Transport System",
  "link": "https://www.app.com.pk/national/pm-inaugurates-landmark-rs-35-5-billion-green-line-bus-rapid-transport-system/",
  "date_published": "2021-12-10T12:35:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 10 (APP): Prime Minister Imran Khan on Friday inaugurated the landmark Rs. 35.5 billion Green Line Bus Rapid Transport System (BRTS) project, providing a modern travelling facility to 135,000 commuters of Karachi’s Western and Central Districts.\nThe Green Line BRTS system, which included 21 stations along with ticketing rooms, escalators and stairs, also had the facility of backup generators to ensure uninterrupted supply of electricity.\nMinistry of Planning, Development and Special Initiatives got this federal government project through Sindh Infrastructure Development Company (SIDCL).\nPrime Minister Imran Khan while addressing the inaugural ceremony said that as any modern city cannot be successfully run without a modern transport system, the Green Line project will help fulfill modern day transportation requirements of the residents of Karachi.\nDescribing Karachi as an “engine of growth” for the country, he said, the prosperity of Karachi was considered as the prosperity of Pakistan.\nThe Prime Minister said that with every country having a city including London in UK, Paris in France and New York in the United States contributed in country’s development and prosperity, the success Karachi will also help Pakistan achieve progress and prosperity.\nHe described the federal government’s Green Line project as first step towards the modernization of Karachi in terms of transport, adding, governments in the past did not focus on modern transportation system for the mega city.\nPrime Minister Imran Khan said that since he was seeing Karachi for the last 50 years, he had also seen this mega city transforming from “a city of lights” to “ruins” due to lack of management support system.\nHe said that despite sanctions on Iran, its capital Tehran had become a modern and prosperous city with all civic facilities due to modern management system like any capital of the developed countries including London, Paris and New York.\nThe Prime Minister said that Tehran, which did receive any funds from the public sector development program like in Pakistan, its collects and generates around US $ 500 million [per annum] in local revenue as against Karachi which might be collecting something around US $ 30 million.\nStressing for an improvement in Karachi’s management system through the directly-elected Mayor under a local government system like being introduced in Lahore, Peshawar and other big cities of Punjab and Khyber Pakhtunkhwa.\nThe Prime Minister expressed his pleasure over the pace of work on other federal government projects in Karachi including the lining of Nullahs, Trade Corridor and K-4 water supply project.\nImran Khan said that he himself was supervising the K-4 project and will Insha Allah perform the ground-breaking of the K-4 project next month. The project, after completion in 14 to 15 months, will start the supply of water from Keenjhar Lake to Karachi by September 2023, he added.\nPrime Minister Imran Khan urged the provincial government to also introduce the Universal Health Insurance System like introduced by the provincial governments of Khyber Pakhtunkhwa and Punjab to help address the medical needs of people, especially the poor.\nHe said that with the provision of health insurance facility worth Rs. one million per family to 100% people in Khyber Pakhtunkhwa, Punjab will also start providing health cards to people in the whole province from January 1 next year and will complete the process by March 2022.\nThe governments of Baluchistan, Azad Kashmir and Gilgit Baltistan also intend to start this health insurance facility, which was not even available in the developed countries, the Prime Minister said and urged the government of Sindh to also introduce the facility.\nThe Prime Minister highlighted the importance of the federal government’s Bundle Island city project for the people of Sindh and Karachi in terms of jobs and other benefits, and urged the government of Sindh to allow initiation of the project, for which the provincial government had earlier issued an NOC and then withdrew it.\nHe said that besides protecting agricultural lands, which were necessary to ensure food security, the construction of high-rise and vertical buildings as well as modern cities, also help the civic agencies in the provision of water, sewerage and other related facilities in an easy way.\nThe Prime Minister also mentioned the Ravi City project in Lahore – which was facing massive urbanization and where agricultural lands were being used for housing projects – and said now trees were also planted there to protect the environment.\n“Karachi also needs a project like Bundle Island, and I again urge the government of Sindh to allow execution of the project,” he added.\nThe Prime Minister said it was his desire that all [the federal and governments] join hands to serve the country and its people.\nHe referred to the price of 20 kg bag of wheat flour in Sindh and Karachi, which is Rs. 250 higher than in Punjab and KP and said “If we work together, it will benefit the country.”\nEarlier, Minister for Planning and Development Asad Umar and Governor Sindh Imran Ismail in their remarks on the occasion highlighted various aspects of the Green Line BRTS as well as the progress and with timelines of the completion of other federal government projects in Karachi including the lining of Mehmoodabad Nullah, Gojjar Nullah, Orangi Nullah, K-4 water supply scheme and Karachi Circular Railway (KCR) to facilitate the people of Karachi.",
  "retrievedAt": "2025-08-11T21:42:24.161Z"
}
