{
  "title": "World looks for a morality-based international order: President",
  "link": "https://www.app.com.pk/national/world-looks-for-a-morality-based-international-order-president/",
  "date_published": "2021-12-10T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): President Dr Arif Alvi Friday said as the vested interests had dominated global affairs, the world was currently looking for a morality-based international order for sake of humanity.\nThe president, addressing the concluding session of a two-day Islamabad Conclave 2021 organized by the Institute of Strategic Studies Islamabad, said in the era of artificial intelligence and the vested interests overriding morality, the world was faced with huge threats even more than the nuclear threat.\nAlso mentioning the accumulation of money from poor to rich countries making them a haven of the laundered money, he said the new morality-based world order was the need of time.\n“New war is cyber defence and cyber offence. Don’t think in the era of 20st century. The challenge is huge,” he told the participants of the Conclave titled “A Peaceful and Prosperous South Asia.”\nLauding the role of the think tanks, the president however stressed them to focus on their market as well as their acceptability at the user end.\nHe said there was a gap between the government and the think tanks as the parliamentarians and the government functionaries rarely study research material.\nHe said after the decades-old war, Europe had agreed to end the conflict but contrarily it continued in the other regions, exemplifying the Iraq and Afghanistan wars.\nReferring to the continuous arms race among the nations, the president said instead the world needed to show its commitment to reduce poverty which unfortunately was not being focused upon. Instead, the NGOs and great people like Bill Gates were striving to fill the gap, he added.\nThe president urged the world for a major rethink and feared that the new kind of war would be very dehumanizing.\nHe said the nations trying to teach humanity to the world always showed their concerns about the plight of women only after they left those countries after a prolonged stay and spending trillions of dollars.\nApprising the people of his fascination with the thinks tanks, the president said the institutions like the ISSI could help the world take out of the prevailing situation by suggesting ways through their research works.\nEarlier Director-General of ISSI Ambassador Aizaz Ahmed Chaudhry told the gathering that the Institute had been striving to contribute to policymaking through dialogues held at its five centers of excellence besides improving the research work.\nHe said the ISSI had been focusing the subjects related to the government and hoped the annual Conclave would also take the shape of international events held by different countries like Switzerland and Qatar.\nThe ISSI head said 17 international experts from 12 countries and six from Pakistan spoke at five working sessions of the event encompassing the subjects like unilateralism, xenophobia, militarization, climate change and emerging technologies.\nThe Kashmir dispute, Afghanistan, China-Pakistan Cooperation, and US-India Strategic Partnership were also among the topics discussed by the experts.\nThe ambassador said the Conclave’s objective was to work with the government for narrative building, highlight positivity and counter negativity, and bridge the gap between the executive, academia and think tanks.",
  "retrievedAt": "2025-08-11T21:42:25.075Z"
}
