{
  "title": "UNHCR pays tribute to men who support women rights",
  "link": "https://www.app.com.pk/national/unhcr-pays-tribute-to-men-who-support-women-rights/",
  "date_published": "2021-12-10T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):UNHCR, the UN Refugee Agency has paid tribute to men who actively support women and girls and play a positive role in fighting against gender-based violence and in advancing gender equality. UNHCR called for combined efforts to advocate and increase awareness to prevent, mitigate and respond to gender-based violence, said a press release.\nTo mark the 16 Days of Activism against Gender-Based Violence, UNHCR together with Inspire Pakistan organized an event that was attended by UNHCR Representative Noriko Yoshida, CEO Inspire Pakistan Qaiser M. Siddique, UNHCR and Inspire staff, representatives from civil society and refugee women and men.\nThe event recognized the role of refugee men who raise their voices for girls and women’s rights and support them in various fields of life, notably gaining an education.\nThis year marks the 30th anniversary of the 16 Days campaign running under the global theme “Orange the world: End violence against women now!” The colour orange symbolizes a brighter future, free of violence against women and girls.\nThe international campaign “16 Days of Activism against Gender-Based Violence” runs from 25 November through 10 December.\nUNHCR arranged several activities across the country with the support of partners and other UN agencies. Speaking on the occasion, Yoshida said that it is imperative that we all stand together against gender-based violence that affects everyone of us, not only in Pakistan, but across the globe, not only women, but also men.\nShe said that those refugee men who went the extra mile by supporting women deserved to be appreciated and acknowledged.  Yoshida added that the stories narrated by some of the refugee men reflect the daily actions they take in fostering gender equality and thus fighting against gender-based violence.\n“You and the successes of women in your families set an example for other men in your communities,” she said.\nEarlier, speaking on the occasion, Abdul Rehman, whose daughter Dr. Saleema Rehman won this year’s regional UNCHR Nansen Award for Asia for her dedication to promote girls’ education in her community, said that education is a fundamental right of all girls and boys.\n“My daughter’s success is not only mine but of all Afghan community. I urge all parents and brothers to support the education of their daughters and sisters for a better future,” he said.\nOther Afghan refugees including Fazal Nabi and Inayat Shams shed light on the importance of girls’ education. “The world is colorless without women and their participation,” Inayat Shams narrated one line from his poetry.",
  "retrievedAt": "2025-08-11T21:42:20.107Z"
}
