{
  "title": "Pakistan realizes its role in region as a responsible country, says FM",
  "link": "https://www.app.com.pk/national/pakistan-realizes-its-role-in-region-as-a-responsible-country-says-fm/",
  "date_published": "2021-12-10T12:39:00.000Z",
  "source": "APP",
  "content": "MULTAN, Dec 10 (APP):Foreign Minister Shah Mahmood Qureshi said on Friday that Pakistan was well aware of its responsibilities as an important regional stakeholder. Addressing&nbsp; Zakariya Conference after opening 708th Urs celebrations of saint, Hazrat Shah Rukn-i- Alam,&nbsp;Noori Hazrat Suhrawardy Multani&nbsp; here, he urged upon religious scholars and ulemas of all schools of thought to not only condemn Sialkot incident, but also disassociate themselves from it.\n“Some elements&nbsp;keep&nbsp;on trying to defame Pakistan, but they will not succeed in their nefarious designs. Shrines of the saints are always a source of love, forbearance and brotherhood,” he noted. Foreign Minister said that those who were guilty in the gruesome incident would be sentenced accordingly and our judicial system would take them to cleaners.\n“Whenever an incident happens in our country, some elements try to bring a bad name to Pakistan by distorting the facts in front of the world. We will have to be vigilant in this regard,” Qureshi observed.&nbsp; He informed that he had represented the country in Brussels recently, adding that neither Islam nor law of the land permitted such acts and all religious scholars had condemned Sailkot incident.\nHe stated that he conveyed Prime Minister Imran Khan’s message to Sri Lankan counterpart assuring the culprits would be penalized.&nbsp;&nbsp; FM Qureshi prayed for the progress and prosperity of the country at the end of the first session of the conference, adding that owing to COVID-19 intensity last year, the Urs celebrations were limited but this year by grace Almighty they had managed&nbsp;to open it for devotees.\nEarlier, Shah Mahmood Qureshi, who is custodian of the shrine, bathed the mausoleum with rose water and laid a sheet and opened three days celebrations.     Ahle Sunnat Jammat Pakistan Chief,&nbsp; Allama Syed Mazhar Saeed Kazmi was accompanying him.  Former federal&nbsp;minister, Hamid Saeed Kazmi, Khawaja,&nbsp;&nbsp;Ghulam Qutb uddin Faridi and others also spoke on the occasion. Additional IG South Punjab, Zafar Iqbal, Parliamentary Secretary, Makdoomzada Zahoor Hussain, MPAs, Nadeem&nbsp; Qurshi, Javid Akhtar Ansari and others were also present.",
  "retrievedAt": "2025-08-11T21:42:22.873Z"
}
