{
  "title": "US Summit on Democracy; PM takes best position of not becoming anyone’s party: President",
  "link": "https://www.app.com.pk/national/us-summit-on-democracy-pm-takes-best-position-of-not-becoming-anyones-party-president/",
  "date_published": "2021-12-10T17:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): President Dr. Arif Alvi describing the current global order as “exploitative” and “based on vested interests” has stated that Prime Minister Imran Khan had taken a best position of not becoming anyone’s party.\nHe expressed these views while responding to a question about Pakistan’s non-participation in the virtual Summit on Democracy despite the US invitation, in an interview with a private television channel (Samaa TV) aired on Friday night.\nThe President referred to the destruction in Afghanistan, Iraq, Syria and some other countries and regretted that they [the United States and West] do not want any war in their countries but use other regions, especially the Islamic countries for wars and conflicts.\nAppreciating the fact that Pakistan had developed a nuclear deterrence, he said that the current exploitative world order, where the big economies like India were accommodated [by the world powers], needed to be changed.\nThe President, however, added that as the friendship between Pakistan and the United States was continuing since the government of Liaquat Ali Khan, the country’s first prime minister, this friendship can continue and move forward.\nTo a question about the double standards, he said that the United States, which was not worried about the human rights of women and children during its presence in Afghanistan, started worrying about the human rights immediately after leaving the country.\nTo a question, he said that Pakistan can achieve progress and prosperity and emerge as a front-line state in the list of developed nations through enhanced development in Information Technology (IT).\nIn response to a question about corruption cases, the President said that with delays seen in court decisions in many cases, there was a need to promote speedy justice system as well as effective prosecution in the country.\nPresident Alvi said since he deals with the appeals after the decisions given by the country’s five ombudsmen offices, he usually decides such appeals in a day or two, to ensure speedy justice.\nTo a question as if masses would buy PTI’s narrative of accountability of the corrupt, the President replied in positive and said that Prime Minister Imran Khan was a champion of such campaigns and narratives.\nHe further said that Prime Minister Imran Khan’s vision of making Pakistan a welfare state like Riasat-e-Madina was not a new thinking, but this vision was developed and agreed upon by Pakistan Tehrik-e-Insaf (PTI) stalwarts including the PTI Chairman Imran Khan during their discussions and debates within the party during 1990s.\nTo a question, the President said that changing views on different issues cannot be termed as U-Turn, because changing direction to achieve a goal due to changed situation or environment was logical. “One can change the direction but not the principles to achieve a goal,” he remarked.\nAbout religious extremism in the country, he was of the view that the issue could be tackled by political mainstreaming of such religious parties.\nTo a question about the issuance of Ordinances in large number by the present government, the President remarked that when the Parliament will not do its work, the government will have to bring Ordinances.\nHe further that the President was bound by Law and Constitution to promulgate Ordinances on the desire of the government.\nThe President, however, contended that the present government had issued less Ordinances than the previous governments.",
  "retrievedAt": "2025-08-11T21:42:19.572Z"
}
