{
  "title": "Gilani, Qatari Shura Speaker discuss deepening ties",
  "author": null,
  "content": "ISLAMABAD, Jul 30 (APP):Chairman Senate Syed Yousaf Raza Gilani met with Hassan Al-Ghanim, Speaker of the Shura Council of Qatar, on Wednesday on the sidelines of the 6th World Conference of Speakers of Parliament, organized by the Inter-Parliamentary Union (IPU).\nAccording to a press release, both leaders reaffirmed the longstanding and fraternal ties between Pakistan and Qatar, rooted in shared values, mutual respect, and a joint vision for peace and development.\nThe meeting covered a range of topics of mutual interest, including political and economic cooperation, parliamentary engagement, and people-to-people exchanges.\nThe Chairman underscored the importance of close collaboration in addressing global challenges and appreciated Qatar’s constructive role in this regard.\nHe also emphasized the need for continued cooperation on international parliamentary forums such as the IPU, particularly in promoting peaceful conflict resolution, upholding international law, and supporting inclusive global development.\nBoth sides agreed to strengthen parliamentary cooperation through regular exchanges and visits by Parliamentary Friendship Groups.\nGilani extended a formal invitation to Speaker Hassan Al-Ghanim to attend the upcoming Speakers Conference, scheduled to be held in Pakistan from November 11–12.\nHassan Al-Ghanim accepted the invitation and pledged his support for the success of the event.\nThe meeting concluded on a positive note, with both sides expressing commitment to advancing bilateral relations through deeper parliamentary dialogue and cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:21:46.339Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gilani-qatari-shura-speaker-discuss-deepening-ties/",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T14:09:00.000Z"
}
