{
  "title": "PBM launches major reforms for cancer, rare diseases treatment",
  "author": null,
  "content": "ISLAMABAD, Jul 30 (APP):Pakistan Bait-ul-Maal has announced the toll out of key initiatives including NAI-ZINDGI drug rehabilitation center, Pakistan Cancer Awareness Program (P-CAP), and national registries for cancer and cochlear implant patients. A full digitization of operations is also underway, aimed at improving service delivery and advancing PBM’s vision of a better Pakistan with “Zero Hunger, Zero Poverty.”\nDirector General Professor Dr. Zeeshan Danish shared these developments while addressing the landmark seminar “Compassion in Action: Supporting Vulnerable Populations with Cancer & Rare Diseases” at a local hotel, reaffirming PBM’s institutional commitment to uplift marginalized communities under the strategic leadership of Senator Shaheen Khalid Butt.\nProfessor Dr. Zeeshan Danish, highlighted PBM’s unwavering commitment to supporting marginalized populations, particularly those battling cancer and rare diseases, through life-saving interventions and sustainable programs.\nHe explained the various service areas of PBM to the audience and narrated the vision of Future PBM. He assured the commitments of higher management for efficient service delivery, restructuring of existing services and policies, capacity building, launch of new projects.\nThe seminar under the chairmanship of Senator Shaheen Khalid Butt and co-chaired by Dr. Tariq Fazal Chaudhry, brought together parliamentarians, health experts, and donors including Roche Pakistan. All programs were funded through public-private partnerships without tapping into government aid.\nIn his keynote address, MD PBM Captain Shaheen Khalid Butt reaffirmed the organization’s commitment to funding treatment for underprivileged patients, urging hospitals to maintain uninterrupted care despite occasional funding delays due to administrative challenges. He highlighted ongoing structural reforms within PBM’s medical projects, crediting Major General Parvez and Raja Kashif for their instrumental support in expanding PBM’s outreach. MD PBM also paid thanks to all organizations to be the Friends of Pakistan Bait ul maal and appreciated Roche Pakistan to sponsor the event. He also appreciated the Team PBM for organizing such a historic event and paid vote of thanks to all participants especially cancer patients who are being treated under financial assistance of PBM. He reaffirmed to fulfill vision explained by DG PBM and showed his commitment to work side by side with stakeholders and other organizations to support the poor people of Pakistan in each domain of life where needed.\nMinister for Parliamentary Affairs, Dr. Tariq Fazal Chaudhary praised PBM’s extensive portfolio of sustainable projects, crediting Senator Butt and Professor Danish for their relentless pursuit of inclusive development. He described the event as a turning point for future collaborations to redefine healthcare access in Pakistan.\nThe seminar marked a historic milestone in Pakistan’s pursuit of equitable healthcare particularly to the people in need.\nThe event brought together parliamentarians, including Senators Rukhsana Zubairi, Husna Bano, Sitara Ayaz and Bahramand Tangi, Mrs Farah Naz (MNA), Afzaal Bhatti (MD OPF), Sumaira Samad, Additional Secretary Ministry of PASS, leading medical professionals, Pharmacists, Top PBM officials, philanthropists, volunteers, students, and media personals, all united to address the challenges associated with vulnerable populations of Pakistan specifically Cancer and rare Diseases.\nA distinguished panel of medical experts, including Dr. Qasim Bhutta, Dr. Uzma, Dr. Ayesha, Dr. Humaira from NORI Hospital, and Dr. Iqbal Khan, Vice Chancellor of SHIFA International University, led an insightful discussion on innovative strategies to combat cancer and rare diseases. The panel emphasized the need for public-private partnerships to ensure accessible, high-quality treatment to the needy patients.  Dr. Iqbal Khan, VC SHIFA University proposed a collaboration with PBM for cochlear implants and other surgeries on a cost-sharing basis, commending PBM’s role in supporting needy patients.\nDr. Obaidullah, CEO of DRAP, also pledged support to provide affordable medicines through a coordinated mechanism with PBM.\nDedicated stalls showcased PBM’s transformative initiatives, notably its Women Empowerment Centers, which provide vocational training and skill development to widows, orphans, and economically disadvantaged women. Currently PBM is running various pro poor programs to provide relief to the underprivileged segments of society with medical assistance being core project of the organization. These initiatives, blending healthcare support with economic empowerment, earned widespread praise, reinforcing PBM’s holistic approach to poverty alleviation.\nMs. Hafsa Shamsie, Managing Director of Roche Pakistan, outlined the partnership’s vision to bridge healthcare disparities through innovative solutions and collaborative frameworks. She emphasized Roche’s dedication to improving access to life-saving medicines, marking this partnership as a significant step forward. Managing Director Overseas Pakistanis Foundation Afzaal Bhatti and others were recognized for their vital contributions to PBM’s mission by Senator Shaheen Butt.\nThe event, fully sponsored by PBM’s partners without utilizing government funds allocated for the needy, underscored the importance of affordable generic medicines and strengthened ties with institutions like NORI Hospital, Roche Pakistan, and Shifa International University. These partnerships will enhance funding, introduce advanced medical technologies, and expand outreach to remote areas, positioning PBM as a global model for public-private collaboration.\nLooking ahead, PBM plans to replicate this model across sectors like education and economic empowerment, leveraging partnerships with global and local stakeholders to create a sustainable ecosystem for Pakistan’s underserved communities.\nThe event concluded with heartfelt gratitude from Senator Butt and Professor Danish to all attendees, including Roche Pakistan, the PBM team, journalists, volunteers, and philanthropists, for their unwavering support. “Compassion in Action” has set a powerful precedent for transforming lives and building a healthier, more equitable Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:21:33.320Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pbm-launches-major-reforms-for-cancer-rare-diseases-treatment/",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T15:01:00.000Z"
}
