{
  "title": "NPC, CDA launch one million tree plantation drive under ‘Green Islamabad’ campaign",
  "author": null,
  "content": "ISLAMABAD, Jul 30 (APP):The National Press Club (NPC) and the Capital Development Authority (CDA) have jointly launched an ambitious plantation drive under the “Green Islamabad” campaign, aimed at planting one million trees over the next three years to combat climate change and protect the capital’s natural environment.\nCDA Chairman Muhammad Ali Randhawa inaugurated the campaign by planting a sapling on the NPC lawn during a ceremony attended by senior journalists, CDA officials and NPC leadership, said a press release on Wednesday.\nA memorandum of understanding (MoU) was signed between NPC President Azhar Jatoi and CDA Director General Environment Awais Manzoor Tarar in this regard.\nSpeaking at the event, CDA Chairman Randhawa said the campaign aligns with Prime Minister Muhammad Shehbaz Sharif’s vision to make the capital, a clean and green city.\n“This plantation drive, along with the electric bus service, is part of our broader environmental agenda to reduce pollution and enhance Islamabad’s green cover,” he said.\nHe emphasized collective responsibility in maintaining the beauty of Islamabad, urging all institutes to put their efforts in this drive.\nHe also proposed that every guest visiting the NPC should plant a sapling.\nRandhawa highlighted ongoing public transport initiatives as part of this campaign, including the deployment of 160 electric buses to curb air pollution.\nHe also underscored the modern key features in these buses.\nThe President of Pakistan Federal Union of Journalists (PFUJ) Afzal Butt, who also addressed the gathering, appreciated the CDA chairman for taking key steps to eliminate environment related issues of the city.\nJournalists present at the event also shared their recommendations and suggestions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:21:13.973Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/npc-cda-launch-one-million-tree-plantation-drive-under-green-islamabad-campaign/",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T18:12:00.000Z"
}
