{
  "title": "Solid waste management outsourcing gets green light in Islamabad",
  "author": null,
  "content": "ISLAMABAD, Jul 30 (APP): Capital Development Authority (CDA) Board has approved the outsourcing of solid waste management across urban and rural areas of Islamabad to improve sanitation services in the federal capital.\nThe decision was taken during the Board’s 14th meeting, chaired by CDA Chairman and Chief Commissioner Islamabad, Muhammad Ali Randhawa, at CDA Headquarters on Wednesday.\nThe Board resolved to initiate a new tendering process, inviting national and international firms with strong reputations to bid for the project.\nTo ensure efficiency and better oversight, the waste collection system will be divided into separate service packages.\nThe move is part of CDA’s broader strategy to modernize essential municipal services and respond to the growing needs of the capital’s population.\nChairman Randhawa emphasized the need for quality improvements and directed that waste transfer stations and dumping sites be upgraded for more effective waste handling.\nAdditionally, the Board approved a three-month extension of CDA’s existing contract with the Rawalpindi Waste Management Company (RWMC) to ensure a seamless transition during the new procurement phase. “This is not just an administrative shift; it’s about providing Islamabad’s citizens with a cleaner, healthier environment through professional and accountable services,” Randhawa stated.\nThe meeting also approved CDA’s recent record-breaking commercial auction, during which eight plots and four shops were sold for Rs19.56 billion.\nThe auction outperformed expectations, with some properties fetching up to 33 percent above their reserve price.\nThe Board noted that stricter payment terms were introduced—reducing installment periods and limiting upfront discounts—yet strong participation from credible investors reflected growing confidence in CDA’s policies.\nIn another key move, the Board approved the appointment of KPMG as the audit firm responsible for reviewing CDA’s financial statements for the past five years.\nThe firm, selected through a competitive bidding process, will conduct a detailed evaluation of CDA’s assets and recommend improvements in financial governance.\nThe Chairman instructed that the audit be completed within six months to support transparency and accountability.\nOn the administrative front, a committee was formed to evaluate the seniority criteria for directors (BPS-19) in the environment cadre. A proposal for revising promotion procedures for sub-engineers was also referred to the Service Rules Committee for further analysis to ensure a fair and robust system.\nThe Board approved the budget estimates for the fiscal year 2025–26, which were formulated based on departmental input and strategic priorities.\nIt also decided to implement a cashless billing system for collecting water charges, in line with CDA’s push toward digital transformation.\nChairman Randhawa reaffirmed the Authority’s commitment to development, prosperity, and sustainability. “Our goal is to transform Islamabad into a model capital—clean, efficient, and inclusive. Solid waste management is central to that vision,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:21:13.959Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/solid-waste-management-outsourcing-gets-green-light-in-islamabad/",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T16:13:00.000Z"
}
