{
  "article_id": "2025-09-19_e16cef1ffde0debcb8077d1ee7a6fc3b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-urges-improved-arrangements-for-religious-delegations-zaireen-policy-reforms/",
    "retrieved_at": "2025-09-20T12:10:22.507Z"
  },
  "metadata": {
    "title": "NA body urges improved arrangements for religious delegations, Zaireen policy reforms",
    "author": null,
    "date_published": "2025-09-19T21:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 418,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, September 19 (APP):The National Assembly Standing Committee on Religious Affairs and Interfaith Harmony on Friday called for stronger institutional arrangements and improved facilitation for official religious delegations and pilgrims, while recommending a series of reforms in the Zaireen policy. The 7th meeting of the committee, chaired by MNA Shagufta Jumani at the Parliament House, began with a briefing from Additional Secretary Dr. Sajid Mahmood Chauhan on follow-up actions taken on previous recommendations. Discussing preparations for the annual visit of the high-level official delegation to Roza-e-Rasool (Peace Be Upon Him), members voiced dissatisfaction over current arrangements. The committee stressed that the delegation must arrive on time on 12th Rabi-ul-Awal and recommended that its members be granted 'state guest' status to reflect Pakistan's dignity. The ministry was urged to coordinate with Saudi authorities to secure an official invitation for the visit. A sub-committee was also formed to review and update the existing standard operating procedures (SOPs) governing the delegation. On the National Commission for Minorities Rights Bill, 2025, moved by MNA Naveed Amir Jeeva, Minister of State for Religious Affairs and Interfaith Kesoo Mal Khael Das informed that the bill had been passed by both Houses but returned unsigned by the president. He assured that it would be presented before a Joint Session of Parliament. Satisfied with the assurance, the committee disposed of the bill. The body also held a detailed discussion on the Zaireen Policy, urging the ministry to ensure comprehensive facilities for religious tourists both within Pakistan and abroad. Chairperson Jumani emphasized retaining the traditional Salaar system to guide pilgrims and recommended awareness campaigns across electronic, print, and social media to educate Zaireen on travel, protocols, and safety. The committee further directed the ministry to propose a subsidy package for Zaireen, including a USD 50 reduction in costs, similar to Hajj facilitation. It also pressed for consultations with PIA to initiate direct flights from Karachi to Najaf, benefiting thousands of pilgrims visiting Iraq annually. Additional recommendations included establishing permanent facilitation desks at all major airports, restoring Pakistan Houses in Makkah and Madinah for dignified pilgrim accommodation, and engaging multiple companies through transparent processes for service provision, instead of awarding contracts to a single entity. The meeting was attended by MNAs Pir Syed Fazal Ali Shah Jilani, Seema Mohi ud Din Jameeli, Asiya Naz Tanoli, Dr. Nelson Azeem, Samina Khalid Ghurki, Ahmed Saleem Siddiqui, Mussarat Rafique Mahesar, Muneeba Iqbal, and Neelam, along with Minister of State Kesoo Mal Khael Das, the secretary, and senior officials of the ministry.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}