{
  "article_id": "2025-09-19_4fac54f493e4054c65bc41455b330990",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/domestic/committees-assessing-crop-damages/",
    "retrieved_at": "2025-09-19T16:27:40.812Z"
  },
  "metadata": {
    "title": "Committees assessing crop damages",
    "author": null,
    "date_published": "2025-09-19T20:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 267,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Sep 19 (APP): Punjab Agriculture Minister Syed Ashiq Hussain Kirmani said on Friday that recent floods had put negative impact on agricultural economy. He presided over the meeting of the Agriculture Commission at Agriculture House here on Friday. The meeting reviewed the crop situation during and after the floods. The minister said that in view of the flood situation, actionable recommendations of the members, would be implemented immediately. He said that Punjab CM was monitoring flood relief and rescue operations on daily basis. He said, \"Foods have caused irreparable losses to human lives, livestock and crops.\" He further said that Punjab CM had assigned special duties to provincial ministers for flood relief and rescue operations. All possible resources were being utilized to resolve the difficulties of flood victims. According to the directions of the Punjab chief minister, the victims were being provided with food, shelter and the best healthcare facilities. Syed Ashiq Hussain Kirmani said that livestock belonging to flood victims were being shifted to safe places, vaccinated and provided medical treatment. Committees had been formed to assess and survey crop damages and the chief minister would soon announce a special package, he added. Punjab Agriculture Secretary Iftikhar Ali Sahoo said that the Agriculture department was playing an active role in supplying green fodder and feed for the animals of the flood victims. The activities of the Agriculture department's field formations in relief operations were being monitored daily. Punjab Livestock & Dairy Development Secretary Ahmad Aziz Tarar said that the provision of animal feed (Vanda) and silage for the livestock of flood victims was being ensured.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}