{
  "title": "Hajj operators urged to refrain from collecting money from intending pilgrims in advance",
  "link": "https://www.app.com.pk/national/hajj-operators-urged-to-refrain-from-collecting-money-from-intending-pilgrims-in-advance/",
  "date_published": "2022-05-05T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 5 (APP):Ministry of Religious Affairs and Interfaith Harmony on Thursday urged the private tour operators and individuals to refrain from collecting money from the intending pilgrims in advance.\nIn an exclusive talk with APP, the ministry’s spokesperson Muhammad Umar Butt informed that the ministry had not permitted any tour operator to receive money or applications for Hajj-2022 so far.\nHe said there were certain private tour operators and individuals allegedly involved in collecting money in the wake of Hajj applications or registration which was totally an illegal act and a punishable offence.\nThe ministry had urged the people not to hand over his/ her passport and money to any individual or operator, unless a list of private tour operators with Hajj quota was posted on the ministry’s website www.hajjinfo.org and authorization of them to receive Hajj applications, he added.\nUmar Butt said if they found involved any individual or operator in this illegitimate practice, they should immediately intimate the ministry on its given phone numbers, 051-9205696, 051-9216980-82, so that a necessary disciplinary action may be taken against them in accordance with the law.\nHe made it clear that those who did not follow the ministry’s instructions, they would be responsible for their own loss. He also clarified that the ministry had allowed designated branches of the schedule banks to collect the Hajj applications with token money of Rs 50, 000.\nHe said the applications could be submitted via online and banks from May 1, to May 13 while the token money could be deposited from May 9, to May 13. It is pertinent to mention here that Pakistan has allotted a quota of 81,132 pilgrims this year.\nIt would be divided between the government and private schemes with the ratio of 60:40.",
  "retrievedAt": "2025-08-11T14:49:15.923Z"
}
