{
  "title": "PM to launch Ehsaas Education Stipends programme tomorrow",
  "link": "https://www.app.com.pk/national/pm-to-launch-ehsaas-education-stipends-programme-tomorrow/",
  "date_published": "2021-08-31T15:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Prime Minister Imran Khan will launch the Ehsaas Education Stipends programme on Wednesday, aimed at providing financial assistance to the deserving households for the education of their children at primary, secondary and higher secondary levels.\nThe programme, to be rolled out nationwide in all districts, has been structured along the lines of Ehsaas’ Stipend policy that incentivizes higher stipend amount for girls as compared to boys.\nUnder the Ehsaas Education Stipends, the primary school boys will get quarterly stipends of Rs. 1,500 and girls Rs. 2,000; secondary school boys will get Rs. 2,500 and girls Rs. 3,000; and at higher secondary level, boys will get Rs. 3,500 and girls Rs. 4,000 a quarter.\nAll education stipends will be paid biometrically to mothers on attainment of 70 percent attendance of their children.\nAs part of ‘Post-COVID-Ehsaas Strategy’, Ehsaas Education Stipends will empower the deserving families to overcome financial barriers in accessing higher education.\nPoverty is one of the most persistent barriers to acquiring education. Presently, there are 18.7 million children in the age group 6 to 16 who remain out of school in the country and the fall out of COVID-19 has also accentuated it.\nThe ‘Demographic and Health Survey 2017’ (Kaplan and Meier estimates) indicates that dropout rate is highest for the poorest two quintiles in secondary education.\nThe Household Income and Expenditure Survey (1990-2018) featuring enrolment trends for both boys and girls in primary and secondary education reveals that girls are severely disadvantaged in initial enrolment levels for poorest quantile, and they drop out faster from grades 5-8.",
  "retrievedAt": "2025-08-11T21:09:20.892Z"
}
