{
  "title": "Advancement in AI to bring improvements in students’ learning: Shafqat",
  "link": "https://www.app.com.pk/national/advancement-in-ai-to-bring-improvements-in-students-learning-shafqat/",
  "date_published": "2021-08-31T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Federal Minister for Education and Professional Training, Shafqat Mahmood Tuesday said the advancement of technologies in the fields such as artificial intelligence, would bring about improvements in personalized learning experiences of students.\nHe was addressing the flagship initiative Artificial Intelligence (AI) TechVerse 2021 being organized by National Centre of Artificial Intelligence (NCAI) at the National University of Sciences and Technology (NUST) main campus from August 30 to 31, 2021.\nThe initiative is part of NCAI pioneering efforts to foster research, innovation and technology development in the field of AI in Pakistan.\nThe event brought together top AI-focused start-ups and innovative minds from across the country and provided them with a platform to showcase their innovative ideas and prototypes.\nSpeaking on the occasion, Shafqat remarked that digital learning has been around for years but engaging students in learning proved to be a challenge.\nHe opined that instead of teachers catering to learning needs of each student individually, a system where algorithms identify the gaps in a student’s understanding, and provide active feedback would be quite effective.\nHEC Executive Director Dr Shaista Sohail said the initiative of NCAI is aligned with the HEC’s vision of modernizing varsities. Not only has the Centre been developing solutions to our indigenous problems using the powerful tool of AI, but also positively impacting the lives of society at large.\nEarlier in his welcome address, NUST Rector Engr Javed Mahmood Bukari emphasized the importance of AI and highlighted that in a short span of its inception, NCAI has developed as many as 280 indigenous solutions,\nincluding Fast Grant Proposal for Covid-19, Forest Monitoring and Change Detection, Audio Data Analysis, Smart Media Monitoring and Analytics, Sentiment Analysis and Urdu Speech Recognition System, Smart Cleaning and Waste Management System, Autonomous Vehicle Localisation System, Pulmonary Tuberculosis System, etcetera.\nHe further said in March 2021, NCAI, in collaboration with the Ministry of Science and Technology has inaugurated the smart cities programme, which is geared towards modernizing Pakistani cities by introducing various smart products and services.\nNCAI Chairman Dr Yasar Ayaz also apprised the audience of some of NCAI’s initiatives.\nThe two-day event was attended by a large number of students, academics, industrial representatives, entrepreneurs and AI enthusiasts.\nIslamabad Chamber of Commerce and Industry President Sardar Yasir Ilyas Khan, was the chief guest for the opening session.\nAI Techverse 2021 was divided into three main segments. “AI Expo” entailed exhibition of industrial AI-related projects and presentations by some very capable individuals from research labs and NCAI partners.\nWhile, the “AI Ideas Challenge” was designed for young entrepreneurial minds to pitch their brilliant ideas within the vast scope of AI, and “Bol AI,” aimed at enhancing public awareness about prospects in the field.\nFounded in 2018, NCAI is an HEC initiative that is based on a consortium model, including six renowned public sector universities of Pakistan and nine specialised research institutes and labs spread across Islamabad, Lahore, Karachi, and Peshawar.",
  "retrievedAt": "2025-08-11T21:09:22.524Z"
}
