{
  "title": "Opposition rallies will only increase coronavirus cases; says governor",
  "link": "https://www.app.com.pk/national/opposition-rallies-will-only-increase-coronavirus-cases-says-governor/",
  "date_published": "2021-08-31T10:41:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 31 (APP): Punjab Governor Chaudhry Mohammad Sarwar said on Tuesday that protest rallies by the Pakistan Democratic Movement (PDM) would only add to coronavirus surge in the country instead of destabilizing the government.\nResponding to the media men during a press conference regarding Punjab Aab-e-Pak Authority (PAPA) at the Governor’s House, he said the opposition would not achieve anything from its anti-government mantra, adding that it should sit with the government to promote national cause.\nTo a question, the Governor Punjab Sarwar said, “Let Pakistan Tehreek-e-Insaaf (PTI) government complete constitutional tenure of five years and do away with the tradition of devising ways to send the incumbent government packing the very next day it comes into power”.\nTo a query, he said political parties already exist in the country, adding that there was need to end dictatorship and introduce democracy within the framework of these political parties in the country.\n“There is also the need of fixing terms for a Prime Minister in the country, referring that a President could only rule for two terms in the United States (US)”, he responded.\nOn Afghanistan war, he said Pakistan had paid the largest price in the form of 70000 human lives in the Afghan war, adding that it was the worst cost of the war by any country.\nHe said the US public and the government had admitted the mistake of Afghanistan adventure, adding that nothing had been achieved from the Afghanistan war.\n‘Afghan land should not be used for terrorism in Pakistan,’ Sarwar demanded from the Afghan government in response to a query.\nOn free and fair elections, the Governor Punjab said the opposition should hold parleys with the government on the ways to ensure transparent elections in the country, adding that party leaders should sit for a dialogue after a framework was devised on free and fair elections.\n“PTI has the culture of debate within the party while the other political parties of the country lack this culture”, he responded, adding that there are scores of Imran Khan in PTI but they need little grooming.\nEarlier, talking about the meeting with NGOs collaborating with the PAPA, he said that provision of clean drinking water to the masses was his vision and passion, adding that Punjab Aab-e-Pak Authority had been working to ensure that people had access to the clean drinking water.\nGovernor Punjab Chaudhry Mohammad Sarwar said 80 percent patients were victim of water-related diseases in Punjab, adding that clean drinking water would help overcome the water borne diseases.\nHe said that engineers, NGOs, bureaucracy were on the same page regarding the working of the PAPA, adding that 1500 water filtration plants were under process while people were calling to donate to PAPA for installation of water filtration plants in the far-flung areas of the province.\nHe said multiple NGOs including the Al-Khidmat Islamic Aid, Water Aid, Akhuwat, Agahi, Abdul Alweem Khan Foundation, Sahara, Sarwar Foundation and others were working in close collaboration with the PAPA. He said UNICEF was also our partner and had donated 50,000 dollars to PAPA for provision of clean drinking water.\nSarwar said transparency and accountability were hallmark of the organization, adding that the previous government of Shehbaz Sharif installed a water filtration plant in Rs 15 to 20 million while the PTI government was installing a filtration plant in mere Rs 3 million.\nHe asked the media to play its positive role and help PAPA ensure hundred percent transparency in the organization.\nThe Governor Punjab further said that PAPA was capable of setting the sewage system of the province right if given the mandate by the Punjab government, adding that it also plans to repair and make operational the out of order water filtration plants and water systems which were installed by the previous government.",
  "retrievedAt": "2025-08-11T21:09:16.464Z"
}
