{
  "title": "COVID-19 national tally of active cases recorded consistently high",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-recorded-consistently-high/",
  "date_published": "2021-08-31T09:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): The national tally of total active COVID-19 cases was recorded 94,573 consistently high during fourth wave of pandemic on Tuesday with 3,838 more people tested positive of the fatal virus while 2,837 people recovered from the disease during last 24 hours.\n118 corona patients have died during past 24 hours, 104 of whom were under treatment in the hospitals and 14 of them perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in Punjab followed by Sindh.\nOut of the total 118 deaths occurred, 38 of them were on ventilators.\nThere were 5,542 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded as 7.36 percent.\nThe Covid positivity ratio was the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Peshawar\n42 percent, Bahawalpur 47 percent, Lahore 52 percent and Multan 72 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Abbottabad 65 percent, Swabi 85 percent, Gujrat 66 percent, and Multan 58 percent.\nAround 538 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, Gilgit Baltistan (GB) and Azad Jamu and Kashmir (AJK).\nSome 52,112 tests were conducted across the country on Monday, including 13,644 in Sindh, 22,917 in Punjab, 8,547 in Khyber Pakhtunkhwa (KP), 4,701 in Islamabad Capital Territory (ICT), 922 in Balochistan, 719 Gilgit Baltistan and 662 in Azad Jammu and Kashmir.\nAround 1,039,758 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,160,119 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 32,095, Balochistan 32,230, GB 9,906, ICT 99,263, KP 161,853, Punjab 393,136 and Sindh 431,636 patients.\nAbout 25,788 deaths were recorded in country since the eruption of the contagion.\nAround 6,875 people perished in Sindh, 40 of them died in the hospitals and one out of the hospital on Monday.\n11,876 people died in Punjab with 53 deaths occurred in past 24 hours. Some 40 individuals died in the hospitals and 13 out of the hospitals.\nAs many as 4,963 people expired in KP, 19 of them died in hospitals on Monday, 866 individuals died in ICT, three of them perished in the hospitals on Monday, 338 people died in Balochistan, 173 infected people perished in GB and 697 people died in AJK, two of them succumbed to the deadly virus in the hospitals on Monday.\nA total of 17,756,332 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 6,069 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:09:16.299Z"
}
