{
  "title": "Qureshi, Maas exchange views on Afghanistan situation",
  "link": "https://www.app.com.pk/national/qureshi-maas-exchange-views-on-afghanistan-situation/",
  "date_published": "2021-08-31T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Foreign Minister Shah Mahmood Qureshi and his German counterpart Heiko Maas on Tuesday exchanged views on the latest developments in Afghanistan as well as bilateral relations.\nThe foreign minister shared Pakistan’s perspective on the evolving situation in Afghanistan and stressed that the safety of Afghans and an inclusive political settlement was important.\nHe said being the immediate neighbour which suffered for 40 years from conflict and instability next door, Pakistan considered peaceful and stable Afghanistan of vital importance.\nForeign Minister Qureshi stressed the need for international community to engage through positive messaging and constructive actions.\nHe stressed immediate steps to address the humanitarian needs and ensure sustained economic stability.\nThe foreign minister said measures must be taken to stabilize the security situation, preserve peace, and preclude any mass exodus.\nHe added that positive engagement with Afghanistan would help advance these shared objectives.\nNoting the strong momentum in Pakistan-Germany relations, Foreign Minister Qureshi recalled the two visits by the Foreign Ministers in April 2021, their telephonic conversation of 21 August, and other high-level exchanges.\nQureshi also apprised the German foreign minister of his recent visit to neighboring countries of Afghanistan and his interaction with various foreign ministers.\nThe foreign minister added that Pakistan has been extending all possible support to foreign governments and international organizations in evacuation of their diplomatic personnel, nationals and others from Afghanistan.\nIn the context of bilateral relations, the Foreign Minister expressed satisfaction over growing cooperation in diverse fields.\nStressing the high value Pakistan attached to its relations with Germany, the foreign minister underscored the resolve to comprehensively upgrade the overall relationship.\nThe year 2021 marks the 70th anniversary of establishment of diplomatic relations between Pakistan and Germany. A range of events are envisaged by the two countries to celebrate this milestone in a befitting manner.",
  "retrievedAt": "2025-08-11T21:09:15.373Z"
}
