{
  "title": "PM set to unveil Rs 446 billion uplift package for Sindh today",
  "link": "https://www.app.com.pk/national/pm-set-to-unveil-rs-466-billion-uplift-package-for-sindh-today/",
  "date_published": "2021-04-16T06:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 16 (APP): Prime Minister Imran Khan will unveil a historic development package worth Rs 446 billion today for Sindh province encompassing projects related to agriculture, education, electricity, gas supply and road infrastructure.\nUnder the package, around 200,000 acres of land would be restored to make it cultivable thus creating 2,522 employment opportunities to support 500 households.\nThe package consists of a target to elevate the ratio of access to higher education to 52 percent and teacher-student proportion to 1:20.\nAs part of the uplift package, the prime minister would also announce upgradation of 14 passports offices to facilitate around 200,000 people to get their passports.\nThe package envisages the upgradation of power transmission network to reduce line losses by around 5% and load shedding by 15 % in the area.\nUnder the package, Nai Gaj Dam would be constructed to irrigate around 28,800 acres and resolve the longstanding issue faced by the farmers there.\nThe construction of 306-kilometer Sukkur-Hyderabad Motorway is also part of the development package which would revolutionize the communication network in the province.\nUnder the Rs 446 billion package, 160 villages would be supplied gas on emergency basis for the benefit of 5,074 households.\nAround 30,000 new power connections would be given to the districts yet deprived of electricity.\nThe development package of Rs 446 billion would be apart from another Rs 1100 billion of Karachi package.\nThe prime minister will also attend an event of Kamyab Jawan Program to distribute cheques among the youngsters entitled for business loan. He will also hand over certificates to the youths who had completed their skill training to achieve financial independence.\nThe prime minister has directed the authorities concerned to expedite work to provide employment opportunities to the youth in Sindh.\nThe government has so far spent around Rs 3 billion in Sindh under Kamyab Jawan Program.\nThe first phase of skill scholarship program has already been concluded which enabled around 21,000 youths to get employment after the training.\nAn amount of Rs 1.5 billion was distributed among 21,000 youths.\nMoreover, the distribution of Rs 2.5 billion allocated for youth business loan would also start today.",
  "retrievedAt": "2025-08-11T20:37:59.671Z"
}
