{
  "title": "Elite class , corrupt rulers inflicted great loss to country: Gill",
  "link": "https://www.app.com.pk/national/elite-class-corrupt-rulers-inflicted-great-loss-to-country-gill/",
  "date_published": "2021-04-16T15:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 16 (APP): Special Assistant to Prime Minister (SAPM) on Political Communication Dr Shahbaz Gill has said the elite class and corrupt rulers had inflicted loss to the country greater than anything else and for the last fourteen years, a single family was involved in embezzlement in Sindh where people were deprived of basic necessities of drinking water, health and education.\nHe said that the people of Sindh would get relief after the visit of the Prime Minister to the province.\nTalking to media persons after inaugurating the ‘Ehsas Model Cart Program here Friday, Dr Shahbaz Gill said that the work on pilot project of the Programme was commenced from the federal capital today which would be extended to Khyber Pukhtunkhwa, Punjab and other regions of the country.\nHe said that providing relief to the poor and under privileged class was the vision of the prime minister and all his commitments with the people including the project of 5 million houses were being fulfilled one after the other.\nThe SAPM said that the Prime Minister was giving to priority to the downtrodden class. The corrupt rulers and elite class collectively collapsed and looted the country by using force, he added.\nShahbaz Gill said the prime minister had announced for taking steps to provide relief to the people during his visit to the Sindh as the children and women were faced with weakness due to food deficiency and added that even rabies vaccines were unavailable for the people in Thatta and other parts of the province.\nHe said the prime minister was feeling pain of the people of Sindh and he would visit the province to address and resolve their issues. He said that Rs 446 billion package of the federal government was a gift for the people of Sindh and the prime minister was directly supervising its utilization.\nThe federal government’s grant would not be given to the Sindh government as time of making London properties through kickback money was over now, he expressed.\nDr Shahbaz Gill said that it was the sole discretion of the prime minister to appoint somebody wherever he deemed it suitable on the basis of excellent performance.\nIt is evident that the Prime Minister periodically reviews and evaluate the performance of his team members, he added.\nEarlier during the ceremony, 25 existing vendors in G-11 Markaz were handed over model carts to regulate the street economy and to support vendors in earning a respectable livelihood.",
  "retrievedAt": "2025-08-11T20:37:52.954Z"
}
