{
  "title": "Mohsin Naqvi praises KP police for foiling terrorist attacks on police stations",
  "author": null,
  "content": "ISLAMABAD, Mar 17 (APP):Federal Interior Minister Mohsin Naqvi lauded the Khyber Pakhtunkhwa (KP) Police for their swift and courageous response in thwarting coordinated terrorist attacks on three police stations.\nThe incidents, carried out by Khawarji terrorists, were successfully repelled due to the valor and quick action of the police officers.\nIn a statement issued on Monday, Minister Naqvi commended the bravery of the KP Police, acknowledging their critical role in safeguarding the region against the persistent threat of terrorism.\n“The Khyber Pakhtunkhwa Police have once again demonstrated their unwavering commitment to protecting the lives of citizens and upholding the rule of law. Their swift action and courage in confronting the terrorists have foiled malicious plans and saved countless lives,” Naqvi stated.\nAccording to officials, the attacks took place late Sunday night when heavily armed terrorists attempted to storm three separate police stations in different parts of the province. However, the alert police forces engaged the assailants in intense gun battles, successfully repelling the attacks and preventing significant damage.\nMinister Naqvi highlighted the sacrifices and resilience of the KP Police, describing them as the vanguard in Pakistan’s fight against terrorism.\n“The KP Police have always stood on the frontlines, facing the enemy with valor and determination. Their actions are a testament to their unwavering resolve in the battle against terrorism,” he remarked.\nHe further expressed solidarity with the police force and reiterated the federal government’s support in strengthening their capabilities.\n“The entire nation stands behind our brave police officers. We will continue to work together to defeat the nefarious plans of Khawarji terrorists and ensure peace and stability in the region.”\nThe minister concluded his statement by saluting the police personnel and extending prayers for their safety and success in future operations. Security has since been heightened across the province, with law enforcement agencies remaining on high alert to counter any further threats.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:47:26.974Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-praises-kp-police-for-foiling-terrorist-attacks-on-police-stations/",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T08:56:00.000Z"
}
