{
  "title": "Crackdown on hawala & hundi leads to significant increase in remittances: Finance Minister",
  "author": null,
  "content": "ISLAMABAD, Mar 17 (APP):Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb, has stated that government measures against illegal money transfers through Hawala and Hundi have led to a substantial increase in remittances.\nDuring a question-and-answer session in the National Assembly on Monday, Senator Aurangzeb responded to a query from Syed Rafiullah, explaining that several actions were taken in the last quarter of the 2023 financial year to curb illegal financial practices. The government launched a crackdown on unauthorized money transfer operators and implemented administrative measures to regulate the sector.\nTo ensure a secure and legal remittance process, the State Bank of Pakistan increased the capital requirements for exchange companies, allowing only credible businesses to operate. Additionally, ten banks were directed to establish exchange counters to facilitate legal transactions. As a result, remittances previously routed through illegal channels are now being transferred through formal banking systems, significantly boosting overall inflows.\nThe Finance Minister revealed that remittances stood at $30.2 billion in the 2024 fiscal year, and with the ongoing reforms, this figure is expected to rise to between $35 billion to $36 billion by the end of the current financial year. He attributed this substantial increase to measures taken by both the caretaker and current governments to eliminate illegal money transfers and provide enhanced facilities for overseas Pakistanis.\nSenator Aurangzeb affirmed that all necessary steps have been implemented and expressed confidence that remittances would see a further 35% to 36% increase.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:46:17.268Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/crackdown-on-hawala-hundi-leads-to-significant-increase-in-remittances-finance-minister/",
  "dateList": "2025-03-17",
  "date_published": "2025-03-17T15:02:00.000Z"
}
