{
  "title": "UN demands more access as aid starts rolling into Gaza - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: Aid trucks rolled into Gaza on Wednesday and Israel resumed preparations to open the main Rafah crossing after a dispute over the return of the bodies of deceased prisoners that had threatened to derail the fragile ceasefire deal with Hamas.\n\nIsrael had threatened to keep Rafah shut and reduce aid supplies because it said Hamas was returning bodies too slowly, showing the risks to a truce that has stopped two years of devastating warfare in Gaza and seen all living Israeli prisoners freed.\n\nHowever, Hamas returned more Israeli bodies overnight, and an Israeli security official said preparations were under way to open Rafah to Gazan citizens, while a second official said that 600 aid trucks would go in.\n\nTrump threatens to allow resumption of Israeli operations if Hamas doesn’t hold up its end of deal\n\nMeanwhile, US President\n\nDonald Trump said he would consider allowing Israeli forces to resume fighting in Gaza if Hamas fails to uphold its end of the ceasefire deal that he brokered.\n\n“Israel will return to those streets as soon as I say the word. If Israel could go in and knock the crap of them, they’d do that,” Trump was quoted as saying to CNN in a brief telephone call when asked what would happen if the group refused to disarm.\n\nIsrael has said that the next phase of the truce calls for Hamas to disarm and cede power, which it has so far refused to do. It has launched a security crackdown, parading its power in Gaza through public executions and clashes with local clans.\n\nLonger-term elements of the ceasefire plan, including how Gaza will be governed, the make-up of an international “stabilisation force” and moves towards the creation of a Palestinian state have yet to emerge.\n\nTwenty-one bodies of Israeli prisoners remain in Gaza, though some may be hard to find or recover because of destruction during the conflict. An international task force is meant to find them.\n\n“The resistance has abided by what was agreed upon and has handed over all the living captives it had, as well as the bodies it was able to retrieve,” Hamas’ armed wing said in a statement.\n\n“As for the remaining bodies, locating and recovering them requires major efforts and special equipment, and we are exerting great effort to close this file.”\n\nMeanwhile, UN humanitarian chief Tom Fletcher called on Israel to immediately open crossings into Gaza for humanitarian aid, stressing the urgency of the situation after two years of war.\n\n“We’ve got 190,000 metric tons on those borders ready to go in,” said Fletcher, who is due to head to the lifeline Rafah crossing between Gaza and Egypt to see preparations there today (Thursday).\n\n“We rely on all the crossings to get our aid in… we want all of those crossings open and we want completely unimpeded access,” he said.\n\n“That’s part of the discussions that we’ve had in Sharm El Sheikh,” Fletcher said, adding that the US president and other world leaders “were unequivocal that we must be allowed to deliver aid at massive scale”.\n\n“The test of this agreement is not the photos and the press conferences and the interviews. The test is that we have children fed, that we have anaesthetics in the hospitals for people getting treatment, that we have tents over people’s heads,” Fletcher said.\n\nPublished in Dawn, October 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/16080555ab7104f.webp",
  "retrievedAt": "2025-10-16T23:46:49.175Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949209/un-demands-more-access-as-aid-starts-rolling-into-gaza",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T01:55:50.000Z"
}
