{
  "title": "US agency blames faulty engineering, inadequate testing for Titanic sub disaster - World - DAWN.COM",
  "author": null,
  "content": "Flawed engineering and inadequate testing contributed to the catastrophic implosion of a private submersible during a 2023 expedition to the Titanic wreckage, the US National Transportation Safety Board said on Wednesday.\n\nIts report comes after a US Coast Guard investigation in August outlined a litany of issues with operator OceanGate’s conduct, as well as design flaws in its Titan submersible, that led to a “preventable tragedy” in which all five passengers were killed.\n\n“We found that OceanGate’s engineering process for the Titan was inadequate and resulted in the construction of a carbon fibre composite pressure vessel that contained multiple anomalies and failed to meet necessary strength and durability requirements,” NTSB’s report said.\n\n“Because OceanGate did not adequately test the Titan, the company was unaware of the pressure vessel’s actual strength and durability, which was likely much lower than their target.\n\n“Additionally, OceanGate’s analysis of Titan pressure vessel real-time monitoring data was flawed, so the company was unaware that the Titan was damaged and needed to be immediately removed from service”, after a previous dive, it added.\n\nOceanGate chief executive Stockton Rush was joined on the doomed expedition by British explorer Hamish Harding, French deep-sea explorer Paul-Henri Nargeolet, Pakistani-British tycoon Shahzada Dawood and his son Suleman.\n\nSeats on the submersible cost $250,000 per person.\n\nCommunications were lost with the SUV-sized submersible about an hour and 45 minutes into its dive on June 18, 2023, kicking off a dramatic search that briefly captivated the world.\n\nDebris was found a few days later on the ocean floor, about 500 meters from the bow of the Titanic, and human remains were recovered when the sub was brought to the surface.\n\nShortly after the tragedy, OceanGate halted all operations.\n\nLast year, the family of Nargeolet sued OceanGate for $50 million, accusing the US-based company of gross negligence.\n\nThe wreckage of the Titanic sits 644 km off the coast of Newfoundland and has become a lure for nautical experts and underwater tourists since its discovery in 1985.\n\nThe ship hit an iceberg and sank in 1912 during its maiden voyage from England to New York, with 2,224 passengers and crew on board. More than 1,500 people died.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/161357435116912.webp",
  "retrievedAt": "2025-10-16T23:38:57.974Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949312/us-agency-blames-faulty-engineering-inadequate-testing-for-titanic-sub-disaster",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T09:10:19.000Z"
}
