{
  "title": "Army responds to ‘unprovoked fire’ by Afghan Taliban, TTP at Kurram border: state media - Pakistan - DAWN.COM",
  "author": null,
  "content": "Fighting flared up again on Tuesday night between Pakistani forces and the Afghan Taliban in the Kurram district of Khyber Pakhtunkhwa, reported state media.\n\n“Afghan Taliban and Fitna al-Khawarij opened unprovoked fire in Kurram. Pakistani Army responded with full force and intensity,” reported state broadcaster PTV News, quoting security sources on X.\n\nFitna-al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan.\n\nIt added that Taliban regime posts suffered heavy damage and a tank caught fire after being hit, with Taliban fighters fleeing from their posts.\n\nIn a subsequent post, PTV said: “Another post and tank position of the Afghan Taliban destroyed in Kurram sector.’’\n\nPTV added that a fourth tank position at Shamsadar post was destroyed. “There are reports of the killing of an important commander of Fitna al-Khawarij in this important operation of the Pakistan Army.’’\n\nEarlier today, the Foreign Office (FO) said that Foreign Secretary Ambassador Amna Baloch gave a ‘‘comprehensive briefing’’ to resident ambassadors in Islamabad on recent developments along the Pak-Afghan border.\n\n‘‘She underscored Pakistan’s legitimate security concerns and its unwavering resolve to protect its territorial integrity and national security.’’\n\nAfghan Taliban forces launched an unprovoked attack on posts situated on the Pak-Afghan border over the weekend. The Inter-Services Public Relations said 23 Pakistani troops were martyred and more than 200 Taliban and affiliated terrorists were killed when Islamabad responded to aggression by Kabul.\n\nAfghanistan claimed it carried out the attack as a “retaliatory” measure, accusing Islamabad of conducting air strikes in its territory last week. For its part, Islamabad has not confirmed whether it was behind the air strikes but maintains that Kabul should “stop harbouring the Tehreek-i-Taliban Pakistan on its soil”.\n\nIslamabad has repeatedly called on Kabul to bar terrorist groups from using its territory to attack Pakistan, however, Afghanistan denies the allegations and claims Afghan soil is not used for attacks on neighbouring countries.\n\nUS President Donald Trump and China offered to help de-escalate tensions between Islamabad and Kabul, even as Defence Minister Khawaja Asif termed the environment between both countries ‘hostile’, amid lingering tensions over cross-border terrorism.\n\nSpeaking on Geo News, Asif had said a day ago that there were ‘no ties’ between Islamabad and Kabul. “It’s a stalemate right now. You can say there are no active hostilities, but the environment is hostile,” he said, adding: “There are no ties, direct or indirect, as of today”.\n\nThe minister also said that hostilities between the two sides can resume “at any time”. “We can not rule that out, but there is certainly a lull in hostilities.”\n\nAsked if Islamabad would negotiate with Kabul, Asif replied that if Afgha­nistan wants negotiations while threatening Pakistan at the same time, “then they should act on their threats and we’ll negotiate after[wards]”. “This is a natural thing. If you are attacked, you instantly have the right to react and target wherever the attack is originating from,” the defence minister explained.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:39:38.633Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948909/army-responds-to-unprovoked-fire-by-afghan-taliban-ttp-at-kurram-border-state-media",
  "dateList": "2025-10-16",
  "date_published": "2025-10-14T18:11:13.000Z"
}
