{
  "title": "PM Shehbaz meets Bilawal, says govt values and respects relationship with PPP - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif met PPP Chairman Bilawal Bhutto-Zardari on Thursday and said that the PML-N valued and respected its relationship with its coalition partner.\n\nThe parties are partners in the federation, though the PPP does not have a presence in the cabinet. Ties between the allies came under immense strain recently as they were engaged in a war of words over flood relief, as Bilawal asserted that the Benazir Income Support Programme was the “sole method” of providing relief to those affected by floods in the country, while Punjab Chief Minister Maryam Nawaz accused his party of “politicising” the issue.\n\nConcerted efforts were made by leading figures, such as the premier and President Asif Ali Zardari, who stepped in to defuse tensions, with the latter also calling on Interior Minister Mohsin Naqvi to play his role for a possible rapprochement. PM Shehbaz and Bilawal had a phone call last week in which they discussed the “country’s prevailing political situation”.\n\nA statement issued by the PPP today said a senior delegation led by Bilawal met PM Shehbaz with federal ministers and PML-N bigwigs in attendance as well.\n\nIt said the meeting involved discussions on the overall situation and political landscape of the country.\n\n“The PPP is our allied party, and we view our relationship with it with respect and value,” the statement quoted PM Shehbaz as telling the delegation.\n\nIt added that PPP delegation also paid tribute to the prime minister for Pakistan’s role in the Gaza peace agreement.\n\nAfter last week’s high-level engagement between the PML-N and PPP, an eme­r­ging thaw temporarily paused the political firestorm between the two parties, along with the Afghan conflict seemingly overshadowing the issue over the weekend.\n\nThe phone call between PM Shehbaz and Bilawal sparked hopes of reconciliation, although sources suggested the truce appeared to be temporary — more like a ‘pact of silence’ rather than a complete ceasefire.\n\nAccording to insiders, the tensions that ignited the dispute are still simmering beneath the surface.\n\nAlthough the intensity of the growing divide between the two sides appeared to have significantly diminished following these high-level engagements, sources said the underlying disagreements remained.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/162218028f7721a.webp",
  "retrievedAt": "2025-10-16T23:38:54.788Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949349/pm-shehbaz-meets-bilawal-says-govt-values-and-respects-relationship-with-ppp",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T18:06:51.000Z"
}
