{
  "title": "15 of a family dead, 8 injured as truck overturns in Swat: rescue service - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least 15 people were killed — all from the same family — when a Punjab-bound truck overturned in Khyber Pakhtunkhwa’s Swat district early morning on Thursday, according to a Rescue 1122 official.\n\nMalakand Rescue 1122 Spokesperson Shafiqa Gul said in a statement, “At least 15 members of the same family were killed and eight others sustained injuries when a truck overturned near tunnel No. 3 of the Swat Motorway on Thursday morning.”\n\nThe dead and injured include men, women and children, she said.\n\n“The family was from the Gabral area of the Bahrain tehsil and were travelling to Punjab when the tragic incident occurred,” the statement said.\n\nRescue teams rushed to the site of the incident and carried out relief operations alongside the Motorway police, according to the spokesperson. She further said that the injured had been taken to the District Headquarters Hospital, Batkhela.\n\n“Doctors at the hospital confirmed that 15 people had lost their lives,” she said, adding that four of the injured were in critical condition and had been referred to Swat.\n\nKP Chief Minister Sohail Afridi expressed his grief over the incident and expressed solidarity with the victims and their families.\n\nKP Governor Faisal Karim Kundi, taking note of the incident, expressed “deep sorrow” at the loss of lives, the state-run Associated Press of Pakistan (APP) reported.\n\nHe vowed to stand in solidarity with the victims’ families, saying that “loss of life is an irreparable tragedy.”\n\nThe governor also “wished a swift recovery for those injured in the accident,” APP reported.\n\nAccidents are common on highways and motorways across Pakistan, caused by reckless driving, speeding, driver fatigue, and poor vehicle maintenance. Poor road conditions contribute to mishaps, while weak enforcement of traffic laws allows violations to go unchecked, worsening the situation.\n\nLast month, at least 11 people were killed, and another three were injured after a truck crashed in KP’s Dera Ismail Khan due to brake failure.\n\nOn September 11, two women were killed, while four people were injured after a jeep they were travelling in plunged into a ravine in Mansehra. Two days before that, five members of a family were killed in a road accident on the Hazara Motorway in Haripur.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/161343231fce7e7.webp",
  "retrievedAt": "2025-10-16T23:46:31.680Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949291/15-of-a-family-dead-8-injured-as-truck-overturns-in-swat-rescue-service",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T05:53:26.000Z"
}
