{
  "title": "Torkham, Chaman border crossings remain closed for trade due to ‘escalating security situation’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Torkham and Chaman border crossings with Afghanistan remained closed for all trade activities last Sunday, in light of the “escalating security situation” along the Pak-Afghan border, it emerged on Thursday.\n\nThis development comes in the wake of military hostilities between Pakistan and Afghan­istan. On Wednesday, the two neighbours agreed to a temporary ceasefire after a fresh round of deadly cross-border clashes that threatened to escalate into a wider conflict.\n\nPakistan’s Foreign Office (FO) said the ceasefire, implemented at the Taliban’s request and with mutual consent, took effect at 6pm local time on October 15 and would last for 48 hours.\n\nAccording to a notification from the Directorate General of Transit Trade — dated October 15 and available with Dawn.com — transit vehicles headed to Afghanistan have arrived at the crossings but are unable to leave Pakistani territory.\n\n“These vehicles are mounted with tracking devices and RFID (Radio Frequency Identification) seals under the new tracking and monitoring system that was launched on October 1,” the notification read.\n\n“These border terminals have limited parking spaces, leading to severe congestion,” it added. “Moreover, prolonged parking/stoppage of vehicles can encourage device theft as well as seal tampering that can lead to pilferage of bonded cargo. In addition, in the absence of return journeys, there is [a] possibility of a shortage of tracking devices at the Port terminals.”\n\nThe directorate stated that as of Wednesday, 107 vehicles arrived at Torkham, while 357 arrived at Chaman. An additional 37 vehicles are en route to Torkham and another 85 to Chaman.\n\n“In order to avoid congestion at border stations and to ensure the security of the bonded goods, this directorate, in consultation with port terminal operators, bonded carriers, Afghan clearing agents and tracking companies, has temporarily stopped the processing of transit consignments till normalisation of border operations,” the notification concluded.\n\nTorkham and Chama are key trade corridors between Pakistan and Afghanistan, with goods such as fresh produce moving across the border. Official data showed that Pakistan’s exports to Afghanistan surged 38.68pc to $773.89m in FY25, up from $558.03m in the previous fiscal year.\n\nTrade across the border has been halted several times. Earlier this month, the disruption in internet service in Afghanistan impacted bilateral trade between Islamabad and Kabul via the Torkham border, with Pakistani customs authorities struggling to clear goods due to the non-availability of internet on the Afghan side.\n\nIn March, the cross-border movement of people via the Torkham border crossing was abruptly suspended after Pakistani and Afghan security forces were at loggerheads over construction activities on both sides of the border.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/16183507bbb6889.webp",
  "retrievedAt": "2025-10-16T23:38:56.412Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949335/torkham-chaman-border-crossings-remain-closed-for-trade-due-to-escalating-security-situation",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T13:17:36.000Z"
}
