{
  "title": "‘Emerging tech set to reshape labour markets’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Four emerging technologies — artificial intelligence (AI), robotics, advanced energy systems, and sensor networks — are set to reshape global labour markets, offering new opportunities to boost productivity and transform jobs across agriculture, manufacturing, healthcare, and other sectors, according to a new World Economic Forum (WEF) report.\n\nHowever, unlocking the full potential of these technologies and managing associated risks will require significant efforts, including mobilising investment capital, accelerating global technology diffusion, and ensuring inclusive access, the report titled ‘Jobs of Tomorrow: Technology and the Future of the World’s Largest Workforces’ says. The report was published on Tuesday.\n\nDeveloped by the WEF’s Global Future Council on Jobs and Frontier Technology, the report examines seven job sectors expected to experience the greatest technological transformation. These sectors, which together make up nearly 80pc of the global workforce, include agriculture, manufacturing, construction, wholesale and retail trade, transport and logistics, business and management, and healthcare.\n\n“The path of technology development will be determined by decisions made now and in the coming years,” said Till Leopold, Head of Work, Wages, and Job Creation at the WEF. “Understanding which technologies will be most transformative and how they will impact these key sectors is crucial to anticipating their effects and steering towards positive outcomes,” he added.\n\nWhile much of the global debate has focused on desk-based office jobs, the report highlights the real-world impact of emerging technologies across various industries. Drone technology, for example, is enabling efficient urban deliveries in the UAE and facilitating the transport of critical supplies, such as medical equipment, to rural Ghana. In Africa, rooftop renewable energy systems are stabilising working hours for frontline workers by preventing power cuts, while creating demand for energy system professionals.\n\nThe report also notes that semi-automated construction equipment is helping reduce physical strain on workers and improving safety. Additionally, the combination of robotics and AI could reshape the patient journey and workforce in the healthcare sector.\n\nWhile these technologies offer considerable opportunities, they also present risks. To maximise their benefits, the report calls for industry-specific, context-driven actions.\n\nIn agriculture and healthcare, the focus should be on improving the diffusion and access to technology, particularly in developing markets. For manufacturing, strategies must be adapted to local industrial ecosystems. The wholesale, retail, transport, and logistics sectors would benefit from well-functioning technology platforms that improve efficiency while avoiding the concentration of market power.\n\nThe research emphasises the importance of collaborative action among employers, governments, and technology developers to ensure that the transformations result in a more productive and inclusive global workforce.\n\nKey steps to achieve this include enabling greater investment in technology, facilitating supportive market structures, aligning workforce strategies with employers’ goals, and understanding the potential of a technology-enabled workforce.\n\nPublished in Dawn, October 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/16073218ae8a452.webp",
  "retrievedAt": "2025-10-16T23:39:12.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949248",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T01:58:15.000Z"
}
