{
  "title": "Ceasefire declared after Pakistan hits targets in Kabul, Kandahar - Pakistan - DAWN.COM",
  "author": null,
  "content": "• 48-hour ‘Qatar-brokered’ truce initiated at Afghan Taliban’s request\n• Both sides pledge to seek resolution through dialogue\n• Khawaja Asif says ceasefire may not hold as Taliban have become ‘proxy for Delhi’\n• Latest round of clashes erupted after Afghan fighters target Chaman border posts overnight\n• Pakistan confirms retaliatory strikes on militant camps in Kandahar city, Spin Boldak\n• Two explosions rock Afghan capital; TTP leadership targeted in ‘precision strikes’, state-run PTV reports\n\nISLAMABAD: Pakistan and Afghan­istan on Wednesday agreed to a temporary ceasefire after a fresh round of deadly cross-border clashes that threatened to escalate into a wider conflict.\n\nPakistan’s Foreign Office said the ceasefire, implemented at the Taliban’s request and with mutual consent, took effect at 6pm local time and would last for 48 hours.\n\n“During this period, both sides will make sincere efforts to find a positive resolution to this complex but solvable issue through constructive dialogue,” the Foreign Office said in a statement.\n\nThe announcement from Islamabad came before the Taliban’s version appeared on social media. Taliban spokesman Zabihullah Mujahid said in a post on X that “at the request and insistence of the Pakistani side”, the ceasefire would begin after 5:30pm Kabul time and remain in force “unless there is a violation”.\n\nThe statements differed on key points, with each side claiming the ceasefire was requested by the other. Pakistan specified a 48-hour duration, while the Taliban described an open-ended truce. Only Pakistan mentioned a follow-up dialogue process.\n\nA senior Pakistani military official, speaking on background, said the Taliban requested the ceasefire after facing what he described as a “powerful response” from Pakistani forces.\n\nAlthough neither side disclosed whe­ther external mediation played a role, diplomatic sources suggested Qatar helped facilitate the understanding.\n\nSoon after the announcement, the Foreign Office said Deputy Prime Minister and Foreign Minister Ishaq Dar received a message from Qatar’s Minister of State for Foreign Affairs Dr Abdulaziz Al-Khulaifi, who commended Pakistan’s “constructive engagement” in promoting regional peace. Mr Dar thanked Qatar for its “consistent support and positive role”, the statement added.\n\nThis was the second ceasefire between the two neighbours since hostilities erupted on Oct 11, though the first truce was not publicly announced. Diplomatic insiders said that both Saudi Arabia and Qatar had intervened on that occasion to defuse tensions.\n\n‘Ceasefire may not hold’\n\nThe ceasefire, while a pause in hostilities, highlights the diminishing leverage Pakistan wields over Kabul despite its historical role as the Taliban’s principal external supporter.\n\nObservers warn that the ceasefire may prove temporary without a framework for structured dialogue or a third-party monitoring mechanism in place.\n\nDefence Minister Khawaja Asif also expressed a lack of confidence in the ceasefire, stressing that the Afghan Taliban had become a “proxy of Delhi”, Dawn.com reported.\n\nSpeaking to Geo News on Wednesday night, the defence minister said that the Afghan Taliban are “fighting a proxy war” on behalf of India and stated that they have become a “stooge” for New Delhi.\n\n“I have my doubts that the ceasefire will hold, because the [Afghan] Taliban are being sponsored by Delhi,” he added. “Right now, Kabul is fighting a proxy war for Delhi.”\n\nMr Asif reaffirmed Pakistan’s readiness and capability to defend itself in the face of further aggression from Kabul.\n\n“We have the capability and we will attack them, God willing, if they escalate or widen the radius of this war,” he said. “There have been deep strikes in Afghanistan and a ceasefire was agreed on after the intervention of friendly countries, but it is fragile. I don’t believe this will last long.”\n\nHowever, Mr Asif added that in this situation, Pakistan will respond positively to any constructive dialogue but will not tolerate ceasefire violations or attacks on its territory.\n\n“If they bombard our border areas or attack our posts, then we have to respond in kind,” he said. “We do not want to fight, but if we are attacked, we have the right to respond.”\n\nTo a question about whether the mutual defence pact with Saudi Arabia could come into play here, the minister said friendly countries will “effectively intervene” but noted that it is speculation at present.\n\nLatest escalation\n\nThe latest escalation began late on Tuesday and continued into early Wednesday, when Taliban fighters launched a series of coordinated attacks on Pakistani border positions in the Chaman sector of Balochistan.\n\nAccording to officials, the fighting erupted around 2am after Taliban forces opened heavy fire on a Pakistani post in the Sui Karez area of the Kozak Pass using mortars and other heavy weapons.\n\nPakistani troops stationed in the area retaliated immediately, and intense exc­hanges continued for several hours. The clashes expanded when Taliban forces opened fire across multiple points along the border, including the border town of Chaman, damaging the Pakistan-Afgha­nistan Friendship Gate on their side.\n\nOfficials said Taliban fighters also targeted nearby villages, injuring many civilians, including women and children.\n\n“At least five civilians were brought to the district hospital with bullet and splinter injuries,” said Dr Muhammad Awais, medical superintendent of the Chaman government hospital.\n\nAuthorities declared an emergency in all Chaman hospitals and closed schools, while the anti-polio campaign in the area was suspended as residents began fleeing to safer areas.\n\n“The attack started in the early hours and heavy fighting continued until around 8am,” said Habib Ullah Bangulzai, deputy commissioner of Chaman. He confirmed that additional troops had been deployed to the sector to reinforce the defences.\n\nPakistan’s military said its troops repulsed the Taliban attacks and launched retaliatory strikes targeting militant camps and installations in Kandahar and Spin Boldak, from where the attacks had been mounted.\n\n“Pakistani jets targeted these important camps being used by Fitna al-Khawarij,” an official said, using a term referring to Tehreek-i-Taliban Pakistan, the Afghanistan-based terrorist group Islam­a­b­ad blames for recent cross-border attacks.\n\nThe Inter-Services Public Relations (ISPR) later said that at least 20 Taliban fighters were killed and several of their installations destroyed.\n\nSources in Kandahar said the Taliban confirmed eight deaths in Spin Boldak, including a couple in Vesh Mandi, the first Afghan town across the border. A large number of Taliban fighters were reported wounded in Pakistani strikes.\n\nBy morning, heavy exchanges of fire were also reported from multiple points along the Kurram border region, with ISPR saying 25 to 30 Taliban and Fitna al-Khawarij militants were killed in the Pakistani response that destroyed several posts and tanks.\n\nKabul explosions\n\nShortly before the ceasefire announcement, two explosions rocked Kabul’s Taimani neighbourhood around 4pm local time. The Taliban said the blasts were caused by an oil tanker fire, but residents reported two separate explosions roughly 20 minutes apart. Videos circulating on social media showed a multi-story building engulfed in flames.\n\nKabul Surgical Centre said it had received 40 casualties, including five fatalities.\n\nWhile Pakistan’s military did not officially claim responsibility, state-run PTV reported that “precision strikes” had targeted the leadership of Fitna al-Khawarij.\n\nTensions between Pakistan and the Taliban regime have soared since Oct 9, when Kabul accused Islamabad of conducting airstrikes inside Afghanistan — an allegation Pakistan has neither confirmed nor denied.\n\nThe Taliban launched coordinated attacks on Pakistani border posts on Oct 11, in which 23 soldiers were martyred. Pakistan claimed its retaliatory operations killed about 200 Taliban fighters.\n\nAs both sides enter the temporary tru­ce, questions remain over the next steps. A Pakistani diplomat, speaking anonymously, said the focus will now be on “disengagement details and getting assurances about dismantling cross-border terrorist sanctuaries — the central issue behind this unprecedented escalation”.\n\nThe crisis underscores a sharp deterioration in Pakistan-Taliban relations that once appeared anchored in mutual dependence. Since the Taliban’s takeover of Kabul in 2021, Islamabad had hoped for cooperation on counterterrorism, particularly against TTP. Instead, the Taliban’s refusal to rein in the TTP has become the core irritant.\n\nFor Pakistan’s military, the recent border clashes are not merely a border management issue but a reflection of Afgh­anistan’s unwillingness to curb cross-border militancy. For the Taliban, Pakistani airstrikes are seen as violations of sovereignty, reinforcing its domestic narrative of resistance to external interference.\n\nSaleem Shahid in Quetta also contributed to this report\n\nPublished in Dawn, October 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/160727262465cb4.webp",
  "retrievedAt": "2025-10-16T23:39:26.887Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949227/ceasefire-declared-after-pakistan-hits-targets-in-kabul-kandahar",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T01:55:42.000Z"
}
