{
  "title": "Former boxing world champion Ricky Hatton found hanged at home, inquest told - Sport - DAWN.COM",
  "author": null,
  "content": "Former boxing world champion Ricky Hatton was found hanged at his home, a coroner’s court heard on Thursday as an inquest into his death was opened and adjourned.\n\nThe 46-year-old, nicknamed the “Hitman”, was discovered “unresponsive” on September 14 by his manager Paul Speak at his house in Greater Manchester, Manchester South Coroner’s Court was told.\n\nThe court heard details of the discovery of Hatton’s body given by police coroner’s officer Alison Catlow.\n\nIt was told that the former British fighter, who won world titles at light-welterweight and welterweight, was last seen by his family on September 12 when he appeared “well”.\n\nBut the day after he did not attend an event as expected and on the morning of the 14th his manager arrived at his home to take him to Manchester Airport to catch a flight to Dubai. Hatton was found unresponsive.\n\n“The provisional cause of death is given as hanging,” said coroner Alison Mutch.\n\nThe inquest was adjourned until March 20 next year.\n\nLast week, thousands of people lined the streets of Manchester for the funeral procession of Hatton, who was a popular, larger-than-life character.\n\nOasis frontman Liam Gallagher, former England and Manchester United striker Wayne Rooney and former world heavyweight champion Tyson Fury were among stars from the worlds of sport and entertainment at the service.\n\nHatton was candid about the mental health issues he faced after he retired from the ring for a second time following an ill-advised comeback attempt in 2012.\n\nIn a BBC interview in 2016, he described his struggles with drinking and drugs and revealed he had tried to take his own life several times.\n\nHaving participated in a no-scoring exhibition against Mexico’s Marco Antonio Barrera in 2022, Hatton announced in July he would return to the ring in a professional bout in Dubai in December.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1621115137a0df3.webp",
  "retrievedAt": "2025-10-16T23:38:55.176Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949345/former-boxing-world-champion-ricky-hatton-found-hanged-at-home-inquest-told",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T16:17:15.000Z"
}
