{
  "title": "IHC judge surrenders green card amid tough vacation policy - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A judge of the Islamabad High Court (IHC) has surrendered his US permanent residency, commonly known as a green card, after the introduction of a stringent vacation and travel policy that requires judges to seek prior approval from the Chief Justice before travelling abroad.\n\nAccording to well-placed sources in the IHC, the judge has obtained a five-year visa on his official passport following the cancellation of his Green Card.\n\nThe decision came in the wake of recently introduced amendments to the Presidential Order and a General Standing Order which make it mandatory for judges to obtain a no-objection certificate (NOC) from chief justices of their respective courts before leaving the country, even during holidays or vacations.\n\nThe new standard operating procedures (SOPs) issued under the policy state that the entire time of a judge, including leave, vacations and holidays, is at the disposal of the state. The chief justice has been empowered to regulate such leave and may cancel it even after a judge has departed abroad. Judges are also required to provide their contact details and addresses during any period of leave.\n\nNew rules require judges to get NOC from CJs before leaving country even during holidays\n\nSources said that these regulations have created complications for judges holding foreign permanent residencies, particularly US green cards.\n\nUnder American immigration laws, green-card holders must demonstrate intent to permanently reside in the United States, and prolonged absences — especially those exceeding six months — can lead to inquiries and potential revocation of residency rights.\n\nIn cases where a green card holder remains abroad for more than a year, they may lose their status unless a special Returning Resident Visa is obtained.\n\nJudicial insiders told Dawn that the new policy effectively made it difficult for judges to retain foreign residencies while fulfilling their constitutional and administrative obligations in Pakistan. They said that the judge’s decision to rescind his green card was made to avoid any conflict with the newly imposed travel restrictions and to ensure full compliance with the court’s administrative framework.\n\nThe development has also dispelled speculation that some judges were considering resigning amid reports of internal differences and administrative grouping within the Islamabad High Court.\n\nInstead, the move is being interpreted as an effort to align with the institutional policy and maintain transparency regarding foreign travel.\n\nEarlier, Justice Sardar Ejaz Ishaq Khan had raised objections to the NOC requirement in a letter addressed to the Chief Justice of the Islamabad High Court, terming it “a blatant impingement of the Fundamental Right of movement of a judge” and “tantamount to a de facto placement of judges on the Exit Control List”.\n\nHis letter argued that such adm­inistrative controls undermined the independence of the judiciary.\n\nThe IHC administration, however, maintains that the policy aims to bring uniformity, discipline and transparency in judicial conduct, in line with constitutional principles and public service standards.\n\nPublished in Dawn, October 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/16082540dc9d702.webp",
  "retrievedAt": "2025-10-16T23:39:26.174Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949217/ihc-judge-surrenders-green-card-amid-tough-vacation-policy",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T01:55:56.000Z"
}
