{
  "title": "Modi faces tough Bihar state election with voters angry over unemployment, distrust in electoral rolls - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi’s national alliance faces a tough regional election in the state of Bihar next month, due to youth unemployment and distrust over voter rolls, which could pose risks to his coalition that relies on regional partners.\n\nBihar, in eastern India, is one of the country’s poorest states and its third most populous, with over 130 million people. Its chief minister, Nitish Kumar, has previously sided with both Modi and the opposition, but is currently a key partner in Modi’s National Democratic Alliance (NDA).\n\nThe state is part of a politically crucial heartland region and any cracks within the NDA in November’s assembly vote in Bihar could threaten Modi’s coalition, with elections to follow within months in the states of Assam, West Bengal, and Tamil Nadu. Modi’s national alliance, which has 293 out of 543 seats in the Parliament, has a strong voter base only in Assam.\n\nThe Vote Vibe agency said its opinion poll in Bihar showed the NDA had a marginal 1.6 percentage point lead over the opposition alliance, led by the Rashtriya Janata Dal and the Congress party as of October 8.\n\n“This election could swing either way,” the agency said in its outlook, noting that the NDA’s slight edge was due to its recent programmes, such as money transfers to 12.1 million women under a self-employment subsidy that totalled more than 121 billion rupees ($1.37 billion).\n\nNivedita Jha, an activist based in Bihar’s state capital Patna, said women will form a strong voting bloc in the poll because men usually leave Bihar in search of jobs in economic hubs such as Mumbai and New Delhi and not all return to vote.\n\n“Women take the decisions because the men are not here,” she said. “They talk about the opposition which has promised more money if they come to power, and my understanding is that they trust the opposition more”.\n\nSome Bihar voters are also angry about the revision of the state voter list. In one case, 85-year-old Jitni Devi said she was removed from the list and can no longer vote or access her pension.\n\n“They have declared me dead,” she told Reuters. “People in my village tease me as a dead woman, and bank officials shoo me away when I go there to withdraw my money.”\n\nThe state election commission did not respond to queries about Devi’s case. The federal election body has previously said that all complaints are investigated thoroughly.\n\nAnxiety among young voters in Bihar over employment is another election issue, despite a falling unemployment rate. Government data showed that 9.9 per cent of people aged 15–29 were unemployed in Bihar in the fiscal year 2023–24, a significant drop from 30.9pc in 2018–19, but concerns persist.\n\n“For me, I have seen my father going out of Bihar for work, so the issue of jobs matters the most,” said Babloo Kumar, 25, who plans to vote for the first time in November.\n\nA new political party, Jan Suraaj — founded by Prashant Kishor, Modi’s former poll manager — said it aims to reset the political agenda in Bihar.\n\n“Joblessness, migration, increasing debts, loss in agriculture revenue are the issues in Bihar,” said the party’s national president Uday Singh. “There is a big dip in Modi’s popularity here”.\n\nThe opposition has promised a law guaranteeing at least one government job per family, if desired.\n\nModi’s Bharatiya Janata Party (BJP), however, said it remains confident of victory.\n\n“The NDA alliance is in a very solid position,” said Guru Prakash Paswan, a BJP spokesperson. “People have strong faith in Prime Minister Narendra Modi’s vision”.\n\nVoting will be held on Nov 6 and 11 for 243 state assembly seats, and results will be declared on Nov 14.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/16185635716a7f5.webp",
  "retrievedAt": "2025-10-16T23:38:56.370Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949339/modi-faces-tough-bihar-state-election-with-voters-angry-over-unemployment-distrust-in-electoral-rolls",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T13:56:58.000Z"
}
