{
  "title": "Alyssa Healy hits second century in a row to take Australia into Women’s World Cup semi-finals - Sport - DAWN.COM",
  "author": null,
  "content": "Skipper Alyssa Healy hit an unbeaten 113, her second century in a row, as holders Australia booked their spot in the semi-finals of the Women’s World Cup with a crushing 10-wicket win over Bangladesh on Thursday.\n\nHealy and fellow opener Phoebe Litchfield, unbeaten on 84, hardly put a foot wrong as Australia romped home to their victory target of 199 with 25.1 overs to spare in Visakhapatnam.\n\nWith a fourth win in five matches — the other was washed out — seven-time champions Australia become the first team to secure a final-four berth in the 50-over marquee tournament.\n\nThe left-handed Litchfield hit Fariha Trisna for two successive fours to bring up the win as they reached 202-0 in 24.5 overs.\n\nAustralia have two matches left to play in the league stage including a key clash with rivals England next week and a surprised Healy came to know about the semi-final qualification in the post-match presentation.\n\n“We pride ourselves in professionalism, we played well today to get the two points, we’ll come back and be prepared for the next match as well,” said Healy. “I didn’t know we have made the semi-finals.”\n\nWicket-keeper-batter Healy raised her second successive ton after her heroics in the previous win over co-hosts India when the captain’s 142 made Australia chase down 331.\n\nShe hammered 20 boundaries from her 77-ball knock while Litchfield struck 12 boundaries and a six as she raised her eighth ODI fifty.\n\nAustralia’s spinners set up the victory after they kept Bangladesh down to 198-9 in their 50 overs after electing to bat first, Ashleigh Gardner, Alana King and Georgia Wareham all taking two wickets each.\n\nSobhana Mostary hit a defiant unbeaten 66 to make Bangladesh play out their full quota of overs after they slipped to 165-9 in the 46th over but it wasn’t enough to test the Australians.\n\nOpener Rubya Haider handed Bangladesh a strong start with her solid 44 as Bangladesh lost their first wicket in the ninth over to pace spearhead Megan Schutt.\n\nRubya hit eight fours before she slogged Gardner to mid-on. Sharmin Akhter followed suit at which point leg-spinners King and Wareham made further inroads.\n\nSkipper Nigar Sultana was stumped off King, who was named player of the match, and the rest of the batting faltered with only Mostary showing grit.\n\n“In these conditions we should get more runs,” said Nigar. “Not being consistent as a batting unit cost us.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/16230414c022022.webp",
  "retrievedAt": "2025-10-16T23:38:54.700Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949351/alyssa-healy-hits-second-century-in-a-row-to-take-australia-into-womens-world-cup-semi-finals",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T18:04:46.000Z"
}
