{
  "title": "Punjab looks to ‘neutralise’ TLP - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Outfit involved in ‘25 attacks’ on worship places besides targeting law enforcers, govt told\n• More than 2,700 in custody as case tally reaches 72; several first- and second-tier leaders also detained\n• Saad Rizvi’s whereabouts ‘unknown’; DIG says he fled during Muridke police action\n\nLAHORE: Even as police intensify their crackdown on the group following the events that transpired in Muridke, the authorities have decided to take a series of measures to ‘neutralise’ the threat the Tehreek-i-Labbaik Pakistan (TLP) has posed to the law enforcers and non-Muslim communities since its inception.\n\nThe decision to put the radical outfit on a leash is being linked to some crucial meetings, where the TLP’s tainted record of violent agitations, fatal attacks on the law enforcers, as well as ransacking of Christian and Ahmadiyya places of worship came under discussion. Meanwhile, the number of cases registered against the outfit has reached 72, with at least 39 registered in Lahore, amid arrests of second- and third-tier leaders of the TLP.\n\nThis is said to be the biggest number of criminal cases against the TLP across Punjab during the last few years. Reports suggest that some senior leaders from the first and second tiers of the religious outfit have been arrested by the Lahore and Sheikhpura police. A senior police official, privy to the details of the high-level meeting, told Dawn that the authorities believed it was high time to penalise the TLP leadership provoking youth in the name of religion.\n\nHe said the meeting was told that the TLP should be restricted to political activities only, rendering it paralysed to blackmail the state as it has been doing in the past through violent and unlawful assemblies.\n\nTo convince the participants of the meeting, the officer said, they were updated that the churches and other religious places had been attacked 25 times by the TLP activists during the last three years across Punjab.\n\nThe meeting was apprised that the TLP was allegedly behind most of these incidents, as its workers turned violent, vandalised and set on fire the properties, leaving some people dead and dozens injured, the official said.\n\nHe said the meeting was unanimous that it was the last chance for the state and its institutions to deal with the TLP with an iron hand.\n\nOver 2,700 arrested\n\nAs per the official figures, which were later confirmed by the Punjab police chief to Dawn, the provincial police have arrested as many as 2,716 people after the operation launched in Muridke to disperse the encamped TLP protesters.\n\nSome 251 were taken into custody by the Lahore police, 178 by the Sheikhpura police, 190 by the Mandi Bahauddin police, 155 by the Rawalpindi police, 143 by the Faisalabad police, and 135 by the Gujranwala police.\n\nSimilarly, 128 activists were arrested by the Sialkot police, as per the police record. A majority of the arrests were made during the last 48 hours from across Punjab after the TLP protesters took to the streets in reaction to the Muridke crackdown.\n\nLikewise, the Vehari police claimed to have arrested 25 TLP men in a crackdown and booked over 300 in two separate FIRs under terrorism charges in Vehari and Burewala police stations during the last 24 hours.\n\nSeparately, in Dera Ghazi Khan, a group of TLP men allegedly stormed the riverine police post ‘Bait Cheen Wala’ before managing their escape. The incident took place in the vicinity of Jhoke Utra. Police spokesperson Zeeshan said a case would be registered against the suspects.\n\nAs the whereabouts of TLP chief Saad Rizvi remain unknown, Lahore DIG Faisal Kamran said the TLP chief had escaped during the police operation. Mr Faisal said that the police have managed to trace his location and he would be arrested soon.\n\nIt may be noted that a money laundering probe has also been initiated against Mr Rizvi after law enforcers recovered huge sums of money during a raid at his residence in Lahore.\n\nMajeed Gill in Bahawalpur and Tariq Birmani in DG Khan also contributed to this report\n\nPublished in Dawn, October 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/16074448d3db299.webp",
  "retrievedAt": "2025-10-16T23:39:11.438Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949221/punjab-looks-to-neutralise-tlp",
  "dateList": "2025-10-16",
  "date_published": "2025-10-16T01:55:42.000Z"
}
