{
  "title": "Rana Tanveer emphasizes on making JWG operational to coordinate Pak-Saudi collaboration",
  "link": "https://www.app.com.pk/national/rana-tanveer-emphasizes-on-making-jwg-operational-to-coordinate-pak-saudi-collaboration/",
  "date_published": "2023-03-02T11:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 02 (APP): Federal Minister for Federal Education and Professional Training, Rana Tanveer Hussain here on Thursday emphasized on operationalization of the Joint Working Group (JWG) on Education and Professional Training to oversee, pursue and coordinate the entire collaboration between Pakistan and Saudi Arabia.\nThe operationalization of JWG will help enhance cooperation between the two countries, he said during a meeting with the Saudi Ambassador to Pakistan, Mr. Nawaf bin Said Al-Malki.\nSpeaking on the occasion, the minister stated that the Kingdom of Saudi Arabia was extremely close to the hearts of the people of Pakistan. He emphasized the importance of the relationship between Pakistan and Saudi Arabia.\nThe minister highlighted the brotherly relations between the two countries and praised the hospitality shown to Pakistanis by the people of Saudi Arabia.\nRana Tanveer said that his ministry had submitted a comprehensive proposal for the uplift of National Skills University and establishment of another multifaceted skill entity in Pakistan with Saudi assistance as agreed between the two countries on his last visit to KSA.\nRana Tanveer highlighted the issue of non-recognition of degrees of Virtual University and Allama Iqbal Open University by the Saudi Higher Education System.\nThe minister was briefed that the Saudi authorities do not recognize distance learning but was assured that they will formulate a strategy to address this issue.\nHence, Saudi Arabia would consider revisiting the rules of non-recognition of degrees from Virtual University and Allama Iqbal Open University.\nRana Tanveer was briefed about the updated status of implementation of an agreement signed between Takamol (KSA) and National Vocational and Technical Training Commission (NAVTTC).\nHe was conveyed about the launch of training in 23 skill trades, operationalization of a web portal, development of qualifications and identification of test assessment centers.\nThe Saudi Ambassador assured the minister of utmost support in all domains. He highlighted that KSA provides fully funded 683 scholarships to Pakistani students to enhance cultural exchange.\nHe reiterated the resolve of the government of KSA to further develop broad based cooperation with the government of Pakistan.\nThe federal minister thanked the Ambassador and highlighted the cordial and friendly relations between the two countries.\nHe said that the two countries had shared history and literature. The two countries should enhance and fine tune their mutual relation, he expressed.",
  "retrievedAt": "2025-08-11T06:15:11.526Z"
}
