{
  "title": "President urges bureaucracy to make fast decisions",
  "link": "https://www.app.com.pk/national/president-urges-bureaucracy-to-make-fast-decisions/",
  "date_published": "2023-03-02T11:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 02 (APP): President Dr Arif Alvi on Thursday underlined the need for inculcating the spirit of fast decision-making in bureaucracy to improve service delivery and achieve the desired goals well in time.\nHe said that the slow decision-making process by the bureaucracy resulted in poor governance as well as hampering the progress of the country.\nThe President made these remarks while chairing a meeting of the Board of Governors of the National School of Public Policy (NSPP), at Aiwan-e-Sadr.\nThe meeting was attended by the Special Secretary Finance Division Awais Manzur Sumra, Special Secretary Establishment Division, Asmat Tahira, Rector NSPP Dr Ijaz Munir, and Secretary of Executive Committee of BoG of NSPP Nadeem Mahbub.\nMembers of BoG Javed Sadiq Malik, Muneer Kamal, Zaid bin Maqsood, Muhammad Hanif Channa, and Dr Hafeez Ahmad Jamali attended the meeting via video link.\nSpeaking on the occasion, the President underlined the need for imparting modern knowledge and techniques to civil servants to ensure good governance and efficient service delivery.\nHe asked the Rector of NSPP to inculcate the spirit of fast decision-making among the civil servants getting training at NSPP, besides adopting best international training practices to improve the decision-making process as well as enhance the efficiency of the civil servants.\nThe Board of Governors approved the proposal to allow NSPP to hire young professionals as internees. The President advised that suitable and efficient internees may be hired in order to enhance the capacity of young professionals.\nThe meeting also approved the upgradation of Computer Operators from BPS-11 to BPS-16 with the change of nomenclatures as IT Officers in all National Institutes of Management in the country.\nThe Board also accorded approval to the proposal for adopting special dispensation for the employees in BPS-1 to BPS-16 as per the Finance Division’s Office Memorandum of 14 February 2023.",
  "retrievedAt": "2025-08-11T06:15:06.509Z"
}
