{
  "title": "COMSTECH, Embassy of Indonesia organize seminar on herbal medicine",
  "link": "https://www.app.com.pk/national/comstech-embassy-of-indonesia-organize-seminar-on-herbal-medicine/",
  "date_published": "2022-11-28T09:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP): COMSTECH and the Embassy of Indonesia in Pakistan jointly organized an International seminar on the use of herbal and traditional medicine here on Monday.\nOn the occasion, Coordinator General COMSTECH, Prof. Dr. M. Iqbal Choudhary, said that various countries in the OIC member states have been historical custodians of such traditional knowledge for centuries.\nParticularly, he said, countries like Pakistan and Indonesia are rich sources of herbal medicines and have the potential to meet global demand, said a news release from the embassy.\nInterest in Herbal medicine and traditional knowledge is increasing day by day, however, to utilize this opportunity, there is an urgent need for research-based scientific development, and standards-based quality control of herbal drugs, efficacy, safety as well as relevant regulatory enforcement.\nSpeaking at the inaugural ceremony Indonesian Ambassador to Pakistan Adam M. Tugio said that there has been a significant increase in the use and trust of traditional methods of treatment and alternative medicine after and during the coronavirus.\nHe added that after the last epidemic virus, Major pharmaceutical companies have not only shown interest but also attracted investment in the traditional medicine and herbal medicine industry.\nThe ambassador said that Pakistan and Indonesia are rich in the blessing of herbs, which can be utilized by building large platforms.\nHe said, ” Herbs are also perceived as important sources of healing and precautionary properties; therefore, the consumers are also demanding green label products. Using traditional Greco-Arab and Islamic medicine was quite common among the Muslim countries during the Golden Age of Arab-Islamic civilization from the seventh to the fifteenth century.”\nThe envoy further said, “Its influence continued to expand from Spain to Central Asia and India and now we are observing a kind of revival of those practices again with the growth of the herbal medicine sector. In Indonesia, traditional herbal medicine known as Jammu is believed to be an authentic natural way to cure ailments and maintain beauty.”\nIn Pakistan, he said, Unani and traditional medicines are considered reliable sources of healing.\nHe said, in India, Ayurvedic herbal medicines are very popular and the same is the case with other OIC countries where ancient knowledge and old age prescriptions have an important share in remedies and cure serving humanity. Economic opportunities and challenges.\nProfessors and experts from Iran, Indonesia, the United Kingdom, and Karachi University’s International Center for Chemical and Biological Sciences enlightened the audience on the sustainable use of herbal and traditional medicines.\nThe seminar was attended by 400 students, researchers, and experts from the pharmaceutical industry from Indonesia, Bangladesh, Djibouti, Egypt, Azerbaijan, Gabon, Sudan, Nigeria, Morocco, Iran, Uganda, Pakistan, and Malaysia.",
  "retrievedAt": "2025-08-11T15:56:02.011Z"
}
