{
  "title": "Ending poverty from Pakistan Imran’s mission: Murad Saeed",
  "link": "https://www.app.com.pk/national/ending-poverty-from-pakistan-imrans-mission-murad-saeed/",
  "date_published": "2020-06-20T03:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP):Minister for Communications and Postal Services Murad Saeed Saturday said that Prime Minister Imran Khan did not believe in doing politics over petty issues but serving the masses as he was working on\na mission to end poverty from the country.\nIn a media talk in response to the press conference of Pakistan Peoples Party (PPP) chairman Bilawal Bhutto Zardari, Murad Saeed called for rising above political point scoring and making collective efforts to root out poverty and hunger from the country.\nHe said the Pakistan Tehrik-e-Insaf government had increased Sindh share in Ehsaas programme by 10 per cent due to prevalent poverty there.\nHe said that the PPP leadership should be happy that more amount would be given to the poor from Sindh.\nHe said the prime minister’s visit to Larkana, the home constituency of Bilawal was meant to distribute cheques of financial assistance to the vulnerable segments of the society under Ehsaas programme.\nHe said that last year, Rs 192 billion were allocated for Ehsaas programme\nwhereas this year the amount had been raised to Rs 208 billion.\nMoreover, Rs 144 billion more were added in wake of the financial crisis due to the outbreak of coronavirus in the country, Murad Saeed added.\nHe stated that when corona related lock down started, labourers at\nThar coal mines were facing starvation and Sindh Governor Imran Ismail\narranged financial support for them.\nHowever the provincial government, instead of thanking him acted negatively. Similarly when PTI MNAs from Karachi were given grants by the Federal Government for resolution of water crisis in their respective constituencies, the provincial government took stay from courts.\nMurad Saeed reminded that no new tax was imposed in the upcoming\nfederal budget and Prime Minister Imran Khan gave Pakistan’s history’s\nbiggest relief package to 16 million vulnerable families. He said that\nSindh government had promised to provide ration to the people, but\nevery day they had to listen to the “Bhashan”(lecture) of the PPP\nleadership. He said Pakistan People’s Party failed to resolve the\ngrievances being faced by the people of Karachi and Sindh.\nHe said the politics of Bilawal Bhutto Zardari was confined to mere statements.\nHe said that Rs 5.5 trillion were given to Sindh for improvement of health sector, but the condition of the health infrastructure was so bad that the provincial government could not arrange a ventilator for Dr. Furqan, who caught the virus while fighting the pandemic.\nHe said there were no medicines and ambulances in hospitals, which was\nthe proof that Rs 5.5 billion had been misappropriated, adding on\nthe contrary the PTI government in KPK had built health infrastructure\nand in the coming budget 100 per cent population of the province would\nbe provided Insaf Sehat Card, providing insurance to all families who\ncould avail up to Rs 720,000 medical cover.\nHe said that he accepted the challenge of Bilawal for comparison of\nheath facilities of Sindh and KPK. He invited Bilawal to come to KPK\nand see himself the health infrastructure and he would visit Sindh. He\nsaid such comparison would be beneficial for the people as this would\nhelp improve infrastructure.\nHe said that perhaps Bilawal had not read the budget document, as the\nfederal government had allocated Rs 70 billion for corona-related\nschemes.\nAfter the 18th amendment, he said that health was provincial subject,\nbut still the federal government had been providing face masks,\nventilators and other material to the provinces.\nReferring to locust attack, Murad Saeed said that Zardari’s plan to\nseize more big vehicles instead of spraying the locust-hit areas of\nthe province. He said that 106 vehicles of Sindh government were\nalready missing, and now they had made a plan to misuse farmers’\nfunds for purchase of vehicles for personal use.\nHe said that there were over 8 million corona cases in the world, 2\nmillion in the United States alone. He said that health\ninfrastructures of developed nations collapsed against coronavirus\nattack. In India before lockdown only 636 confirmed cases existed but\nafter the lock down easing, confirmed cases had reached 190,000 mark\nand 120 million people had lost their jobs which was the proof that\npolicy of strict lock down was a failure.\nHe said Prime Minister Imran Khan with his sagacity, saved the\ncrisis by providing immediate relief to the unemployed in the\nlockdown. Moreover, Pakistan relax the restrictions to save the poor\ndaily-wage workers from starvation.\nHe said that on the directives of the PM, National Command and\nOperation Centre (NCOC) was established which holds daily meetings and\nprepares strategy in light of latest data and figures.\nHe said the Sindh Chief Minister Murad Ali Shah who regularly attended the meetings approves the decisions of the NCOC but later issues irresponsible\nstatements to please PPP top leadership which was unfortunate.\nAbout National Finance Commission award, he said that 100 per cent\nshare of Sindh had been released and Ministry of Finance issued a\nclarification in this regard.\nHe said that all provinces had promised to give 3 per cent of their share in NFC award for development of erstwhile FATA distircts, but Sindh had not fulfilled its promise.",
  "retrievedAt": "2025-08-11T19:22:01.211Z"
}
