{
  "title": "PM Imran Khan believes in humanity, serving people as a national leader",
  "link": "https://www.app.com.pk/national/pm-imran-khan-believes-in-humanity-serving-people-as-a-national-leader/",
  "date_published": "2020-06-20T03:17:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 20 (APP):Prime Minister Imran Khan is the leader of the nation in its truest sense and holds a vision to serve the people of the country without any distinction, said Halim Adil Shaikh, the parliamentary leader of PTI here on Saturday.\nResponding to the press conference addressed by the Chairman of PPP, Bilawal Bhutto Zardari earlier during the day, he said the comments on the occasion were contrary to the fact as PTI government had adopted a humanitarian approach in all its policies.\nWith special reference to Sindh, Shaikh said assistance worth Rs 60 billion were being disbursed among the poorest of the poor families in the province.\n“Thirty percent of the deserving people from Sindh, against the share of 22% under Ehsaas Program, are being extended cash assistance of Rs.12,000 per family by the federal government,” he said.\nGrowing popularity of PM Imran Khan and PTI government among the people of the Sindh was claimed to be the cause of concern for PPP stalwarts as they could realize their political future in the days ahead.\nDismissing Bilawal’s criticism with regard to PM’s visit to Larkana, he said people of the city were themselves looking forward to his presence amidst them as he was the leader who managed to restore their confidence and made them believe that their plight was to be addressed and not being simply ignored.\n” The fact that Rs.2.2 billion are being disbursed among 1,85000 deserving families can not be denied nor its impact be ignored,” said Halim Adil Shaikh.\nAbout the statements made by PPP leaders with regard to three major tertiary care hospitals in Karachi, he said there was need for an extensive audit of allocations, made by provincial government during past few years, and the consequent expenditure.\nShaikh questioned BBB as why series of taluka and town levels were being handed over to different NGOs that too at the expense of down trodden sections of the society.\n“While you claim to have spent billions for these three major tertiary care hospitals but could not protect many, even the children, against HIV/AIDS nor ensure timely interventions to counter preventable infections,” said the PTI leader .",
  "retrievedAt": "2025-08-11T19:22:04.394Z"
}
