{
  "title": "CM expresses dissatisfaction over KPITB’s performance in job creation for youth, directs for necessary steps",
  "link": "https://www.app.com.pk/national/cm-expresses-dissatisfaction-over-kpitbs-performance-in-job-creation-for-youth-directs-for-necessary-steps/",
  "date_published": "2020-06-20T03:16:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jun 20 (APP):Chief Minister Khyber Pakhtunkhwa, Mahmood Khan stressing the need of the effective use of Information Technology to bringing efficiency, and transparency in government business and to create maximum employment opportunities for the youths, has directed the relevant authorities for necessary steps to further strengthen the Khyber Pakhtunkhwa Information Technology Board (KPITB).\nHe has further directed the authorities to propose necessary amendments in the existing laws governing the KPITB to this end.\nHe was chairing the 10th board meeting of the KPITB here at Chief Minister Secretariat the other day.\nHe termed the promotion of Information Technology in both the public and private sector of the province as one of the key priority areas of his government and remarked that maximum employment opportunities can be created in the province by attracting international IT companies for investment adding that with this aim in mind, the government has established an autonomous IT Board.\nHe expressed dissatisfaction on the overall progress of the KPITB in this regard and directed the authorities concerned to fulfill all the required formalities in order to change the existing composition of the Board for giving maximum possible representation to the private sector so that the KPITB could be run in purely corporate governance style, and resultantly its goals and targets are surely achieved.\nBesides Chief Secretary, Dr. Kazim Niaz, Additional Chief Secretary, Shakeel Qadir, Principal Secretary to CM, Shahab Ali Shah and Secretary Science and Information Technology, Mukhtiar Ahmad the meeting was also attended by private sector members of the board.\nThe meeting approved constitution of Search and Scrutiny Committee for the appointment of new Managing Director (MD) of KPITB.\nThe committee will search for qualified individuals of private sector and after proper scrutiny it will suggest a panel of names to the board for final approval of one them to be appointed as MD of KPITB.\nIt merits a mention here that the tenure of the incumbent MD was ending in this month.\nThe meeting decided to constitute a committee headed by the Additional Chief Secretary to propose necessary amendments in the existing law of the board, formulate Key Performance Indicators to evaluate the performance of the MD and to work out modalities to reduce the tenure of the MD from the existing 5 years to minimum possible period extendable subject to the satisfaction performance.\nIt was also decided in the meeting to reconstitute and further strengthen the Human Resource Committee, Finance Committee, Accounts and Audit Committee of the the KPITB.\nIn his concluding remarks the Chief Minister said that the KPITB should be run in an effective manner to achieve the set targets and goals for which it has been established and no compromise would be made to this end adding that there must be a proper mechanism to look into both the input and output of the KPITB.",
  "retrievedAt": "2025-08-11T19:22:04.771Z"
}
