{
  "title": "Govt makings all-out efforts to address power outages issue: Khurram",
  "link": "https://www.app.com.pk/national/govt-makings-all-out-efforts-to-address-power-outages-issue-khurram/",
  "date_published": "2022-05-19T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP): Minister for Power Khurram Dastagir Khan on Thursday said the government was making all-out efforts to address the power outages issue in the country.\nAddressing a press conference along with Minister of State for Petroleum Dr Musadik Malik, he said the current energy crisis was due to the mismanagement and bad governance of Pakistan Tehreek-e-Insaf government, which had neither made payment to the Independent Power Producers (IPPs) nor arranged fuel, including coal, LNG and furnace oil for power plants timely.\nHe said as many as four additional cargo ships of Liquefied Natural Gas (LNG), besides five of furnace oil had been arranged by the present government to address the fuel shortage for power plants.\nThe government would procure more loads of furnace oil and RLNG to provide electricity to the people at affordable rates, he added.\nHe said RLNG-based Havelo Bahadur Shah Power Plant had to be shut down for necessary maintenance, which also caused increase in the electricity load-shedding. It would be made operationalized in a few days, he added.\nMoreover, the minister said, a coal-based plant was also being revived after removing a technical fault, which would not only add more electricity to the system but also help improve power situation in the country.\nKhurram said the current power outages were for a few days and would be curtailed shortly.\nHe said zero load management was carried out from May 1-12 on the directives of Prime Minister Shehbaz Sharif. The prices of imported fuels, including Refined Liquefied Natural Gas (RLNG), coal and furnace oil had witnessed sharp increase in the international market, which would not likely to plunge in next 6 months.\nThe minister said the circular debt has also risen to Rs 2,460 billion, which was almost half of it during the last PML-N government.\nHe said in the past neither attention was given to power pilferage nor steps were taken for enhancing revenue collection by the power distribution companies (DISCOs). The present government was going to enhance the efficiency of DISCOs, he added.",
  "retrievedAt": "2025-08-11T14:56:01.274Z"
}
