{
  "title": "Pakistan strongly condemns fabricated charges against Hurriyat leader Yasin Malik",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-fabricated-charges-against-hurriyat-leader-yasin-malik/",
  "date_published": "2022-05-18T19:18:00.000Z",
  "source": "APP",
  "content": "According to the Foreign Office Spokesperson, the Indian diplomat was conveyed Pakistan’s grave concern that in a bid to suppress the voice of the indigenous Kashmiri leadership, the Indian government had resorted to implicating them in fictitious and motivated cases. Neither the malevolent Indian tactics of conjuring up false charges against Kashmiri leadership nor the environment of persecution, repression and intimidation could quash the resolute struggle of the Kashmiris.\nThe Indian side was also conveyed Pakistan’s deep concern over Malik’s incarceration in Tihar Jail since 2019 under inhuman conditions. The brutal treatment meted out to him despite his chronic ailments and denial of decent health care facilities had resulted in steep decline of his health.\nThe Cd’A was advised to prevail upon his government that rather than unlawfully keeping the Kashmiri leadership hostage and denying them their fundamental human rights, it must immediately halt its state-sponsored terrorism in the IIOJK, release all political prisoners incarcerated on trumped-up charges, stop human rights violations, lift the inhuman military siege and let the people of IIOJK exercise their right to self-determination as enshrined in the relevant UN Security Council resolutions.\nPakistan called upon the Government of India for acquittal of Yasin Malik from all baseless charges and immediate release from prison so that he could be reunited with his family, recuperate his health and return to normal life.\nPakistan also urged the international community, including the United Nations and relevant human rights and humanitarian organizations to take immediate cognizance of the inhuman treatment meted out by India to one of the most prominent Kashmiri leaders, who had been leading a peaceful freedom struggle for the last many decades.",
  "retrievedAt": "2025-08-11T14:56:18.577Z"
}
