{
  "title": "Dust-thunderstorm-rain likely from Thursday night; to subside heat wave conditions",
  "link": "https://www.app.com.pk/national/dust-thunderstorm-rain-likely-from-thursday-night-to-subside-heat-wave-conditions/",
  "date_published": "2022-05-19T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP): The westerly wave entered into the upper parts of the country from Thursday night will produce rain-dust-thunderstorm in various parts of the country during the next few days, providing the much needed relief to the heat stricken people.\nAccording to the Pakistan Meteorological Department (PMD), the country witnessed an unusual intense heat wave little early during this summer season due to the climatic changes affecting the whole world however the present rain spell will reduce the intensity of the heat wave conditions.\nThe westerly wave will persist till May 24 (Tuesday) due to which rain-dust-thunderstorm is expected in Islamabad, Rawalpindi, Chitral, Dir, Swat, Mansehra, Kohistan, Abbottabad, Haripur, Peshawar, Swabi, Nowshera, Kurram, Kohat, Waziristan, Bannu, Mianwali, Sargodha, Khushab, Attock, Chakwal, Jhelum , Hafizabad, M. B Din, Sialkot, Narowal,\nLahore, Sheikhupura, Faisalabad, Jhang, Toba Tek Singh, Kashmir and Gilgit Baltistan including Astore, Ghizer, Gilgit, Diamir, Hunza and Skardu particularly during afternoon and evening or nights.\nThe high temperatures are likely to subside during the forecast period in most parts of the country.The rain will provide relief during the present heat wave conditions in most parts of the country.\nWater stress on water (reservoirs), crops, vegetable and orchards may likely to continue.Wind/dust-thunderstorm may cause damages to vulnerable structures in upper Khyber Pakhtunkhwa, Islamabad or upper Punjab, Gilgit Baltistan and Kashmir during the forecast period.\nThe met office has advised the citizens to use the water in all aspects of life judiciously.",
  "retrievedAt": "2025-08-11T14:56:14.613Z"
}
