{
  "title": "Govt committed to deepen Pakistan-China all-weather cooperative partnership: PM",
  "link": "https://www.app.com.pk/national/govt-committed-to-deepen-pakistan-china-all-weather-cooperative-partnership-pm/",
  "date_published": "2022-05-19T16:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday underlining the significance of China in Pakistan’s foreign policy reaffirmed the government’s resolve to further deepen the Pakistan-China All-Weather Strategic Cooperative Partnership.\nHe also affirmed government’s firm resolve to fast-track both the ongoing as well as new projects under the transformational China Pakistan Economic Corridor (CPEC), which had immensely contributed to the socio-economic development of Pakistan, and also realize its high quality development.\nThe Prime Minister was talking to a Chinese delegation led by Cheng Guoping, China’s External Security Commissioner, which called on him here.\nHe expressed his commitment to working with renewed zeal and enthusiasm, in concert with China, especially on projects of strategic significance for both the countries, such as ML-1 project, a press release issued here by the PM Media Wing said.\nThe Prime Minister said that China-Pakistan relations were based on mutual trust, mutual respect and cooperation.\nHe appreciated that Pakistan and China had always stood by each other to overcome every challenge with solidarity and mutual support.\nThe Prime Minister reiterated his strong condemnation of Karachi terrorist attack and stated that the entire Pakistani nation grieved with the families of the victims and the people of China at the loss of precious lives, and offered his heartfelt condolences.\nHe reaffirmed Pakistan’s resolve to thoroughly investigate the Karachi attack, apprehend the perpetrators at the earliest, and bring them to justice.\nReferring to his telephonic conversation with Premier Li Kequiang on 16 April 2022, the Prime Minister affirmed that Pakistan was committed to providing highest level of safety and security to all Chinese nationals and institutions working on projects in Pakistan.\nCheng Guoping appreciated the measures taken by the Government of Pakistan, under the guidance and direct supervision of the Prime Minister, to carry out thorough investigations of the terrorist attacks and enhance measures for safety and security.\nHe underscored that terrorism was common enemy of both Pakistan and China, and the two sides shared firm resolve to eradicate this menace.\nCheng Guoping said that Pakistan-China All-Weather Strategic Cooperative Partnership was a model of inter-state relations and a pillar of stability at a time when the international situation was in flux.",
  "retrievedAt": "2025-08-11T14:56:00.682Z"
}
