{
  "title": "No forest fire perpetrator to be spared; public to report on 24/7 helpline: Sherry",
  "link": "https://www.app.com.pk/national/no-forest-fire-perpetrator-to-be-spared-public-to-report-on-24-7-helpline-sherry/",
  "date_published": "2022-05-19T16:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Thursday inaugurated the fire control room along with a dedicated 24/7 helpline at the Islamabad Wildlife Management Board office in old Marghazar Zoo to report fire incidents.\nAfter inaugurating the helpline and fire control room, the Minister held a media briefing flanked by Joint Secretary MoCC Syed Mujtaba Hussain and Commissioner Islamabad Chairman Capital Development Authority (CDA) Amir Ali Ahmed. She said no relaxation would be given to any perpetrator of forest fire rather first information report to be registered against the violator under criminal offense.\nSenator Sherry urged the public to report any fire incident on helpline or on witnessing any individual involved in this heinous act to take the offenders to task. She said media has to partner with government in environmental conservation as without citizens and media’s role the government was unable to get information of such serious violations and issues.\nThe Minister said someone lit fire in the forest and Ms Dolly (TikToker) used it as a modeling background, adding, “They would be treated as an absconder and legally liable to be arrested.”\nShe added that the forest fires were occurring all over the world during summer seasons as there were some 900 forest fires going on in various developed countries. “Forests are the pride of the beautiful Islamabad and it is our role to protect it”.\nShe said these forests were the nation’s precious natural preserves where the media and public should report forest fires on the helpline. “Extensive warning system is installed in the national park where the staff would mostly comprise of the Capital Development Authority (CDA) and ICT administration and will report fire incidents to Secretary MoCC office”.\nShe added there was decline in bush fires in the capital this year due to active response of quarters concerned. The state level vigilance was on and social media would be monitored to tighten the noose against forest fire perpetrators, she informed.\nEnvironmental issues have attained critical status in Pakistan and have emerged as an existential threat to the country, she said.\n“There is a whole of government response and no passing of bucks of the authorities on each other while coping with forest fires”, she said while explaining the new strategy to deal with forest fires in Margallas.\nEarlier, the Minister on her Twitter account shared that some individuals in an adjacent empty plot near Ministry of Climate Change (MoCC) lit fire in the bushes and shrubs to clear debris which could have become lethal. She told the media that the Secretary Ministry has registered a first information report (FIR) against them and all three of them were detained.\nShe warned that FIR would be registered against the violators without any discrimination.\nJoint Secretary MoCC and Senior Board Member IWMB Syed Mujtaba Hussain said the fire season started from April to June and it was a critical time period. “We have SOPs formed in collaboration with CDA to have\n636 CDA employees out of which 400 daily waged and 236 full time fire fighting staff”.\nAnd the IWMB has hired some 60 people for fire fighting despite resource constraints, he added.\n“Fire Control room will be 24/7 operational with a helpline to be active to report fire incidents”. There were 36 fire pickets in the Margalla Hills National Park (MHNP) that will be informed about any fire to take action. They will reach the spot and assess the fire level and will inform CDA consequently, he said.\nChief Commissioner Islamabad and Chairman CDA Aamir Ali Ahmed said coordination was most important for any activity where the MoCC, CDA, MCI, Police and ICT administration were unitedly working on managing forest fires.\nThe response to the recent fire was well managed whereas two major forest fires were managed by the officials earlier, he added.\n“Forest fire is a crime and glamorizing it is a punishable offense socially. The public should inform police at least about such incidents,” he said.\nThis time, he said the CDA transcended its jurisdiction to control fire.",
  "retrievedAt": "2025-08-11T14:56:03.246Z"
}
