{
  "title": "Indian short film highlights enforced disappearances, fake encounters in IIOJK",
  "link": "https://www.app.com.pk/national/indian-short-film-highlights-enforced-disappearances-fake-encounters-in-iiojk/",
  "date_published": "2022-05-19T13:32:00.000Z",
  "source": "APP",
  "content": "A nine plus-minute short film ‘Anthem for Kashmir’ accompanied by a Tamil song highlights the issues of enforced disappearances and fake encounters in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nA product of award-winning documentary filmmaker Anand Patwardhan and Sandeep Ravindranath, and Carnatic singer T.M. Krishna, the short film was released on May 12.\nIt coincided with the 1,000 days of the abrogation of Article 370 on May 1, which revoked the special status of the occupied\nterritory.\nThe documentary filmmaker Sandeep Ravindranath told Indian news agency The Wire that the idea for this project had been in the works for a while now – ever since Article 370 was read down in August 2019.\nRavindranath has made several shorts in the past, including Tharattu Pattu, The Bookshelf, Santhana Gopala, Diary of an Outsider and Sub Brothers.\nThrough the short film, the filmmaker tried to contradict the popularity of the movies like The Kashmir Files, which had been widely criticised for trying to villainise Muslims in the IIOJK.\nHe said the aim, and the motivation, was to also try and portray the truth of today’s Kashmir.\n“Dreams that women here see\ndie without seeing the dawn.\nEven wombs here have been\nturned into cemeteries.”\nThis is one of the best pieces made on half widows, disappearances and encounters in Kashmir.\nThey had shown the unbiased reality of Kasheer.https://t.co/JRjDXgEwAL\n— Mehraj Niaz (@Bazdar1923) May 13, 2022\n“When you’re there [in Kashmir], you really get the sense that this is occupied territory. There are army personnel with machine guns every 100 metres, armoured vehicles with gun ports, check posts. The visuals cater towards establishing a psychology of fear and anxiety,” Ravindranath continued.\nHe video maker wanted to bring out the everyday violence and troubles often glossed over in both mainstream media and popular culture -“civilian deaths, enforcement disappearances, fake encounters, half-widows”.\nThe short, fictionalised narrative highlights the issues of enforced disappearances and fake encounters in IIOJK, and the impact they have on families left behind or witnessing the everyday violence.\nThe music video has been shot entirely in Kashmir, in areas where Armed Forces Special Powers Act (AFSPA) is in place. It was inspired by the ‘deafening’ silence around the “struggle of a people” among other things, Ravindranath\nsays.\n“I have Kashmiri friends, it was a hard time. I was not able to get in touch with them as communication was affected at the time. More than that, even if I did not have Kashmiri friends… It is about a people struggling,” he adds.\nHe said the filming was not easy, given the situation (restrictions) in the Valley and the pandemic.\nThe video was shot amid COVID-19 restrictions, but local support in the town they were in, near the Line of Control, made it possible, Ravindranath said.",
  "retrievedAt": "2025-08-11T14:56:09.222Z"
}
