{
  "title": "OGDCL settles gas supply issue within 5-KM radius of Dhoke Hussain field",
  "link": "https://www.app.com.pk/national/ogdcl-settles-gas-supply-issue-within-5-km-radius-of-dhoke-hussain-field/",
  "date_published": "2020-02-10T00:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP):The Oil and Gas Development Company Limited (OGDCL) has resolved the commodity provision issue within five kilometers radius of Dhoke Hussain field, situated in Kohat district of Khyber Pakhtnunkhwa, in consultation with local representatives and administration.\n“Now, the issue stands resolved and the company will soon start commercial production from the Togh Well-1 after completing the process of laying a transmission pipeline at the earliest,” a senior official told APP.\nIn 2018, he said, the OGDCL had made a significant discovery of 12 MMCFD (Million Cubic Feet per Day) of gas and 300 BBL (Barrel) of condensate from the field in the year 2018, but the pipeline could not be laid due to the issue that was causing a huge financial loss to the OGDCL and national exchequer as well.\nThe case of gasification within the five-kilometer radius had already been approved by the quarters concerned, for which codal formalities were being fulfilled accordingly, he said.\n“An initial survey of the gasification within 05 KM radius of Togh Well-1 has also been completed.”\nAnswering a question, the official said the company had acquired 556 Line Kilometers (LKMs) seismic data during first quarter of the current fiscal year.\n“Besides, around 689 Line km of 2D seismic data was also processed/reprocessed using in-house resources. The company’s seismic data acquisition is 85 percent of total 2D seismic data acquired in the country,” he said while quoting the OGDCL’s quarterly financial report.\nThe company, being the market leader in Exploration and Production (E&P) sector of Pakistan holds the largest exploration acreage, which as of 30 September 2019 stood at 82,499 Square Kilometers, representing 38 percent of the country’s total area under exploration.\nDuring the period under review, the company had spud two exploratory and development wells. Moreover, it completed drilling and testing of seven wells pertaining to previous fiscal years. “Whereas total drilling recorded during the reporting period was 12,813 meters.”\nThe company’s exploratory efforts yielded three oil and gas discoveries namely Pandhi-1 in district Sanghar, Sindh province, Togh-1 and Chanda-5 in district Kohat, KPK province, having cumulative daily production potential of 22 Million Cubic Feet (MMCF) gas and 826 barrels of oil. “Preliminary reserve estimates are 41.86 billion cubic feet of gas and 1.56 million barrels of oil, combined 9.30 million barrels of oil equivalent.\nDuring the three-month period, the OGDCL’s crude oil production stood at 37,560 barrels per day, gas 960 million cubic feet per day, Liquefied Petroleum Gas 702 tons per day and Sulphur 54 tons per day.",
  "retrievedAt": "2025-08-11T18:46:25.622Z"
}
