{
  "title": "PTI, PML-Q leaders meet, says all issues resolved",
  "link": "https://www.app.com.pk/national/pti-pml-q-leaders-meet-says-all-issues-resolved/",
  "date_published": "2020-02-10T05:40:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 10 (APP):The Pakistan Tehreek-e-Insaf (PTI) government and its political ally, Pakistan Muslim League-Quaid (PML-Q), have resolved their differences after successful talks and announced that they will continue working in close collaboration and consultation in future.\nThe decision was reached after Prime Minister Imran Khan’s constituted committee, comprising Punjab Governor Chaudhry Muhammad Sarwar (convener), Chief Minister Punjab Sardar Usman Khan Buzdar and Federal Education Minister Shafqat Mehmood held a meeting with senior PML-Q leadership, led by Speaker Punjab Assembly Chaudhry Pervaiz Elahi at the latter’s residence, here on Monday.\nDefence Minister Pervez Khattak and Planning Minister Asad Umer also attended the meeting.\nTalking to the media after the talks with the government committee, PML-Q leader Chaudhry Pervaiz Elahi said: “We openly discussed all matters, reached consensus and settled them.”\nAssuring PML-Q’s support to Prime Minister Imran Khan and the government, he said all challenges facing the government would be dealt with in consultation, adding that the PML-Q would stand shoulder to shoulder with the PTI government in all trials.\n“Allied political parties will help the government find a solution to all challenges, all coalition partners are working with sincerity of purpose,” he added.\nPervaiz Elahi said that a change had taken place under the leadership of Prime Minister Imran Khan, and its benefits should reach masses at the grassroots level. He said the meeting also discussed what had been hampering the transfer of the benefits of change to the common man.\nThe Punjab Assembly speaker expressed the hope that the PML-Q would contest the next general election in coalition with the the PTI.\nSpeaking on the occasion, Defence Minister Pervez Khattak said there were no significant differences with the PML-Q leadership at all, and if there were any reservations, all had been settled in today’s meeting, to utter disappointment of those who wanted to see a breach between the PTI and the PML-Q.\nHe said, “We will take decisions in consultation with the ally political parties for the good of people.”\nPervez Khattak said the alliance with the PML-Q would continue for the next three years, adding that the government and the PML-Q were partners before and they would remain so in the years to come.",
  "retrievedAt": "2025-08-11T18:46:35.514Z"
}
