{
  "title": "Political stability prevailing in country: Sarwar Khan",
  "link": "https://www.app.com.pk/national/political-stability-prevailing-in-country-sarwar-khan/",
  "date_published": "2020-02-10T05:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP):Minister for Civil Aviation Ghulam Sarwar Khan on Monday said there was now political stability in the country and economic stability would also prevail soon.\nTalking to a private news channel, he hoped that the current year would be much better economically as compared to the last one.\nThe minister said Prime Minister Imran Khan was a democratic person who allow every member of the cabinet to express his feelings openly during the meetings.\nHe said the government was well aware of the inflation and was making efforts to provide relief to poor masses, adding people would get relief soon.\nGulam Sarwar Khan said the prime minister was not in favour of any new tax or increasing prices of petrol, electricity and gas and that no extra burden would be put on common man.\nReplying to a question, he said it was the prerogative of the federal cabinet to put or remove anyone’s name from the Exit Control List (ECL) and if Maryam Nawaz could get any relief in that regard from the High Court, the government would file petition in the Supreme Court (SC) against the verdict.\nHe said the previous governments of Pakistan Muslim League Nawaz (PML-N) and Pakistan Peoples Party (PPP) had destroyed the national economy but the incumbent government had improved it by taking solid steps.\nTo another question, he said all the political allied parties were fully intact with the government.\nHe said he was in favour of introducing of mega development schemes in the constituencies of the Members of National Assembly (MNA’s) and Members of Provincial Assemblies (MPA’s) as it was their right.\nHe strongly rejected that Jahangir Khan Tareen was involved in wheat or sugar crisis and said opposition and media were spreading fake news against him (Tareen).",
  "retrievedAt": "2025-08-11T18:46:36.821Z"
}
