{
  "title": "Business community should become partner in economic diplomacy: Qureshi",
  "link": "https://www.app.com.pk/national/business-community-should-become-partner-in-economic-diplomacy-qureshi/",
  "date_published": "2020-02-10T06:37:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 10 (APP):Foreign Minister Makhdoom Shah Mehmood Qureshi on Monday invited the business community to become partners in the country’s economic diplomacy as the world states were focused more on markets keeping in view their economic interests.\n“Throughout the world, the success of foreign diplomatic policy increasingly depends on vibrant economic diplomacy, and this is not possible without your support and partnership.\nThere is need to create strong economic linkages with the world,” he said during an interactive session with the members of Federation of Pakistan Chambers of Commerce and Industry (FPCCI) here at the Federation House.\nHe said the FPCCI, being the apex trade body and having links with trade bodies around the world and international economic forums, could play a very important role in establishing Pakistan’s economic links with other countries.\nTo the proposal by FPCCI President Mian Anjum Nisar, the foreign minister announced to form a working group comprising three or four senior PFCCI members and equal number of senior officers from the Foreign Ministry to help resolve the issues and streamline the things linked to economic diplomacy.\nHe assured them that Prime Minister Imran Khan and his team was fully alive of the grievances/issues being faced by the trade and industry in the country. The government was making all-out efforts for industrial growth and to boost exports.\nThe economic stability and high economic growth was its top priority, which would create jobs and address unemployment and poverty. It could only be possible with the business community’s support and cooperation.\nQureshi urged the business community to make more investment in the country as it would be win-win position not only for the government but also for them.\n“You are the engine of economic growth and we are ready to extend all possible support to you,” he reaffirmed.\nAs a part of its initiatives for strong economic diplomacy, he said, the government had revamped and strengthened Pakistan’s missions abroad, which included replacement of commercial counselors with well-trained and competent trade and investment officers.\nThe commercial counselors had also been relocated to other countries where they could better work for bringing more trade and investment in the country.\nContrary to the past, he said, the diplomatic missions now had been given clear targets of increasing trade and investment. Only those diplomats would continue on their foreign postings who would give better economic results.\nHe agreed to to FPCCI leadership that the country needed aggressive diplomacy, especially economic one to properly market its products and the investment potential in the world.\nThe foreign minister said he had advised Pakistan’s missions to extend all support, care and respect to the visiting business community, and share maximum information on trade and investment for better promotion of trade and bring foreign investment in the country.\nThat, they should also respect and take care of Pakistani workers earning money for the country.\n“Overseas Pakistanis are the Mohsin-e-Pakistan. We must respect them,” he remarked.\nQureshi supported the FPCCI leaders’ demand that research and innovative/scientific steps were needed to strengthen the country’s agriculture sector to get high yield and have agri surplus for the export as it had big potential.\nFor the purpose, he said, the government was going to enter an agreement with the Chinese government on agriculture research.\nThe minister said Pakistan would benefit a lot from the recently signed second free trade agreement (FTA-II) with China.\n“China wants to relocate major industry and Pakistan could attract the Chinese investment,” he added.\nHe emphasized the need for diversification, value-addition and exploring new markets in the world, especially in Africa which one billion population and 500 billion dollars market.\nAt present, he regretted, Pakistan had only dollars 1.5 billon trade with 54 states of Africa. There was also a big market for Pakistan’s light engineering goods.\n“We are opening new missions in African states,” he said, adding recently a big trade expo was successfully held in Nairobi, Kenya which had huge participation from many African countries.\nThe foreign minister said after its dismemberment from the European Union, the United Kingdom was keen to promote economic cooperation and partnership with Pakistan as it needed new linkages.\nHe said in pursuance of its agenda to control un-employment and earn more forex, the government had negotiated with the Qatar government to export 100,000 skilled Pakistani labour.\nPakistan had also offered supply of labour and services to Qatar, which needed to construct facilities/ infrastructure to hold the upcoming World Cup games.Condemning Indian aggression and brutalities on Kashmiris in the occupied Kashmir, the minister said the economic activities in the valley had almost come to a standstill and India had suffered loss of at least two billion dollars over last six months for that reason. Around 0.4 million people had become jobless, including the educated Kashmiri youth who had started their new businesses.\nHe said India was a big market of one billion population. However, its economic growth had come down to zero after Narendra Modi’s election for second time.\nHis Bharatiya Janata Party had lost its popularity as evident from its defeat in the recent by-elections mainly because of its continued reign of terror on Kashmiris and introduction of disputed citizenship law.\n“I have written 60 letters to the United Nations Security Council cautioning the world body that the Modi government can stage another drama like Pulwama to start a war against Pakistan,” he added FPCCI President Mian Anjum Nisar highlighted the role of the apex trade body for the promotion of trade and investment, along with welfare of the business community of the country.\nIt was established in 1950 and all chambers, and trade and industry associations were its members.\nHe suggested that skill development/vocational programmes including foreign language learning courses should be launched in the country on war footing to create a pool of skilled workers for the export.\nFPCCI Vice President Khuram Ijaz, former president Zakria Usman, Convener of FPCCI Diplomatic Committee and former senior vice president Shaukat Ahmed, Haji Ghani Seth, Asim Gani, Mian Zahid, Shafiq Shaikh and Muhammad Owais were present on the occasion.",
  "retrievedAt": "2025-08-11T18:46:30.614Z"
}
