{
  "title": "PM unveils 5-year economic transformation plan; stresses unity, harmony for success",
  "link": "https://www.app.com.pk/national/pm-unveils-5-year-economic-transformation-plan-stresses-unity-harmony-for-success/",
  "date_published": "2024-12-31T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP):Prime Minister Muhammad Shehbaz Sharif on Tuesday launched the five-year National Economic Transformation Plan “Uraan Pakistan,” which aims to achieve sustainable export-led economic growth based on 5Es – exports, e-Pakistan, environment, energy, equity, and empowerment.\nThe prime minister, addressing the launching ceremony of the homegrown national economic plan (2024-29), highlighted that having achieved macroeconomic stability, the all-out focus would be on boosting growth through targeted investment and reforms.\nHowever, the prime minister said the success of the five-year plan which specifically focuses the development in IT, agriculture, exports and mining and mineral sectors was linked with national unity and political harmony and collective efforts by all stakeholders, including political parties, institutions, and the people.\nThe event was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, federal ministers, Balochistan and KP governors, Punjab Chief Minister Maryam Nawaz Sharif, provincial ministers, diplomats, businessmen, and experts.\nHe vowed to make the focused efforts on increasing the annual investment in various sectors to US$10 billion. Over the next five years, he said the government’s key priority will be to stimulate economic growth especially through exports, he added.\n“The government has achieved the macro-economic stability due to teamwork of the federal cabinet, the deputy prime minister, provincial chief ministers, and the institutions,” he said adding he never experienced this kind of cooperation that he received from the Chief of the Army Staff.\nHe told the gathering that the government would create a conducive environment and incentivise the private sector to promote the export-oriented industry as the “export-led growth will be the pivot of “Uraan Pakistan” for being the ultimate savior for the Pakistan economy.”\nHe regretted that a huge chunk of the country’s resources went to waste annually due to corruption, leakages in electricity and gas, and lack of reforms in various sectors.\nHe said the Federal Board of Revenue had the potential to multiply its revenue collection for which the institution was being reformed.\nSimilarly, he said the state-owned entities incurred losses of Rs 6 trillion during the last one decade, while the electricity and gas sectors had circular debts of around two to three trillion rupees.\nPrime Minister Shehbaz, who earlier launched the logo, website, and a book on Uraan Pakistan, said that during the last nine months, the government had to face huge challenges but achieved macroeconomic stability, due to untiring efforts of the federal and provincial governments and cooperation from the international partners.\n“But this is just the beginning of a long journey and it requires unity.”\nHighlighting the positive macroeconomic indicators he mentioned inflation eased to 5%, average exports increase by 10%, a surge in remittances by 24%, and IT export boosted by 34% during last five months, besides the policy rate decline to 13%.\nCalling “solar name of the game” he emphasized the importance of clean and affordable energy sources and a special focus on solar energy.\nThe prime minister noted that the journey from instability to development and from stability to a strong economy had witnessed several challenges.\nHe said that in 2023, the government struggled hard to conclude the IMF program as Pakistan was on the verge of default owing to continuously depleting foreign exchange reserves. He also expressed the hope that that it would be the last IMF facility.\n“To avoid this default, our party (PML-N), and the coalition partners jointly decided that we will sacrifice our politics for the national interest.” He also mentioned the attempts made by a political party to sabotage the negotiations with the IMF.\nHe said Allah Almighty had blessed Pakistan with huge natural resources and talented manpower that could be utilized to achieve the ambitious development targets.\nHe said Pakistan could regain its lost glory through self-introspection, learning lessons from past mistakes, and marching forward as Team Pakistan with unity of thoughts and actions.\nHe also defended his government’s re-negotiation with IPPs saying that it was time the elite class also sacrificed for the country.\nPrime Minister Shehbaz also reiterated his openness about the Charter of Economy among the political parties, as both the political and economic stability with interlinked.\nHe congratulated Planning Minister Ahsan Iqbal, Finance Minister Muhammad Aurangzeb, entire federal cabinet, government officials, and provincial chief ministers for their great efforts to carve out this homegrown five-year plan.\nOn the occasion, Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar stressed the need for unity, hard work, and continuity of policies to achieve the economic goals of the government.\nHe said Pakistan was blessed with huge resources worth of over $10 trillion in mines & minerals, stones and hydrocarbons that could be utilized for ensuring socio-economic development of the country.\nMinister for Planning, Development and Special Initiatives Professor Ahsan Iqbal described the Special Investment Facilitation Council (SIFC) and the CPEC-5Cs (Corridors) framework as two ‘golden opportunities’ for Pakistan to transform its 5Es framework into a reality.\n“The SIFC and CPEC corridors are very well aligned with our 5Es (Exports, Equity and Empowerment, E-Pakistan, Environment & Climate Change, and Energy and Infrastructure) framework, and are helpful in its implementation,” he said while giving a presentation on Uraan Pakistan – 5Es National Economic Transformation Plan (2024-29).\nElaborating the opportunities, he said that more and more foreign investment could be attracted through the SIFC, with anticipated investment flows of $29 billion by friendly countries such as the UAE, Saudi Arabia, Qatar, Azerbaijan, and Kuwait.\nFederal Minister for Finance and Revenue, Senator Muhammad Aurangzeb said that the five-year homegrown national economic Plan, “Uraan Pakistan” (2024-29) would help achieve sustainable economic growth through competitiveness and productivity.\nThis comprehensive five-year economic plan (2024-29) has three main pillars including stimulating the Private sector; stimulating exports; and optimizing the public debt, the minister said while addressing the groundbreaking ceremony of the plan.\nHe said the main focus of the plan was to achieve 6 percent annual Gross Domestic Product (GDP) growth by 2028.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:10:49.116Z"
}
