{
  "title": "DPM Dar calls for continuity of policies, unity, hard work to achieve economic goals",
  "link": "https://www.app.com.pk/national/dpm-dar-calls-for-continuity-of-policies-unity-hard-work-to-achieve-economic-goals/",
  "date_published": "2024-12-31T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Tuesday stressed the need for unity, hard work, and continuity of policies to achieve the economic goals of the government.\nHe said Pakistan was blessed with huge resources worth of over $10 trillion in mines & minerals, stones and hydrocarbons that could be utilized for ensuring socio-economic development of the country.\nAddressing the launching ceremony of the government’s five year homegrown plan titled “Uraan Pakistan”, the deputy prime minister recalled that back in 2013, when Pakistan was on the verge of default and all macro economic indicators were seriously negative, the PML-N government under the leadership of former prime minister Nawaz Sharif took the challenge and worked really hard to bring the country out of crisis.\nHe said the people at that time had to face 18-hours electricity load shedding, economy was in shatter and extremism was on the rise.\nThe government, that won elections on the basis of three Es (electricity, economy, extremism), delivered successfully and achieved all the three Es.\nHe said in 2017, the country’s economy posted 6% growth, and inflation was as low as 4%.\nIshaq Dar pointed out that the PDM government led by PM Shehbaz Sharif also took the charge in the most serious crisis, and it successfully brought the country out of default like situation.\n“All we need to do is unity, and hard work, and Prime Minister Shehbaz Sharif is leading from the front,” DPM Ishaq Dar said adding that “The way the government is performing, I am sure that we will be able to achieve the goals provided we remain on track”.",
  "retrievedAt": "2025-08-10T14:10:30.479Z"
}
