{
  "title": "Deputy Chairman Senate calls for awareness campaign to promote education, creativity in Balochistan",
  "link": "https://www.app.com.pk/national/deputy-chairman-senate-calls-for-awareness-campaign-to-promote-education-creativity-in-balochistan/",
  "date_published": "2024-12-31T10:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP):Deputy Chairman Senate Syedaal Khan on Tuesday emphasized the need for creating an awareness campaign to promote educational programs and creative activities for the youth of Balochistan.\nHe expressed these views during a meeting with Federal Secretary for Information and Broadcasting, Ms. Ambreen Jan, according to a news release issued by the Senate Secretariat.\nDuring the meeting, the Federal Secretary briefed the Deputy Chairman on the Ministry of Information and Broadcasting’s overall performance, operational procedures, and strategic policies.\nShe also briefed the Deputy Chairman about new initiatives and detailed road map for enhancing public information and media outreach.\nLauding PTV’s efforts in covering Senate activities, Syedaal Khan said, “PTV is a national asset, and it is our responsibility to address its challenges.”\nAcknowledging PTV’s efforts, the Deputy Chairman praised the broadcaster for its responsible coverage of the upper house proceedings and its longstanding role in delivering reliable news to the public.\n“Pakistan Television is a national asset, and resolving its issues is our collective responsibility,” he said.\nHe urged PTV to collaborate with experts in developing programs that address the challenges faced by remote communities, thereby raising awareness and facilitating actionable solutions.\nThe Deputy Chairman noted that PTV’s extensive network ensures seamless connectivity across the country, including its most distant regions.\nHe commended the channel’s consistent efforts in promoting the nation’s culture and regional values, stating, “PTV has played a pivotal role in preserving and promoting our heritage. We must connect our younger generation to these values and traditions.”\nHe assured the Federal Secretary of full cooperation in resolving any issues and extended his best wishes for her future endeavours.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:11:18.162Z"
}
