{
  "title": "Speakers at AIOU seminar call for institutionalization of Islamic social finance",
  "link": "https://www.app.com.pk/national/speakers-at-aiou-seminar-call-for-institutionalization-of-islamic-social-finance/",
  "date_published": "2024-12-31T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP): Speakers at a day-long pre-conference seminar titled ‘Elimination of Interest from the Economy: Sustainable Islamic Banking and Investment Practices’ have called for institutionalizing the Islamic social finance.\nThey emphasized the need for taking practical steps to eliminate riba (interest) in light of the 26th Constitutional Amendment and the recent decision of the Federal Shariat Court.\nThe speakers stated, “Eliminating riba from the country requires a movement and results will only be achieved if everyone actively participate in this struggle.”\nThey cited the Prophet Muhammad’s (peace be upon him) statement condemning those who take, give, document, or witness interest-based transactions, declaring them equally sinful.\nAddressing the seminar, Justice Dr. Muhammad Anwar of the Federal Shariat Court said, “Eliminating riba is an integral part of our faith.”\nHe urged that we must not consider the consequences of ending interest but instead align the financial system with Allah’s commands.\nHe praised the Faculty of Arabic and Islamic Studies at Allama Iqbal Open University for initiating this vital dialogue and called on other universities to raise awareness about this critical issue.\nJustice Dr. Anwar congratulated the Dean of the Faculty of Arabic and Islamic Studies, Prof. Dr. Mohiuddin Hashmi, on organizing the seminar and suggested hosting another dialogue on this topic before the International Conference on Islamic Finance scheduled for April.\nDr. Ahmed Khalid, Dean of the Faculty of Business Administration at Brunei Darussalam University, presented his paper on Islamic finance.\nProf. Dr. Mohiuddin Hashmi elaborated on the objectives of the seminar, stated, “This dialogue on eliminating riba will continue and serves as a precursor to the upcoming International Conference in April.”\nHe highlighted that the Open University had established a department of Islamic Finance offering a four-year BS program, diploma programs, publishing a research journal, and organizing international conferences on Islamic finance.\nOther speakers included Sahibzada Muhammad Qamarul Haq, Principal of Jamia Muhammadi Sharif; Hafiz Atif Waheed from Al-Quran Academy, DHA Phase II, Lahore; and Advocate Qaiser Imam from Islamabad High Court.",
  "retrievedAt": "2025-08-10T14:10:51.327Z"
}
