{
  "title": "Every dollar spent on water restoration yields $30 in recovery: Romina",
  "link": "https://www.app.com.pk/national/every-dollar-spent-on-water-restoration-yields-30-in-recovery-romina/",
  "date_published": "2024-06-05T17:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP): Prime Minister’s Coordinator for Climate Change and Environmental Coordination, Romina Khurshid Alam on Wednesday said Pakistan needs flagship initiatives like Living Indus Initiative to restore dwindling water resources as each dollar spent in this realm can yield upto $30 each in recovery.\nShe was delivering her keynote address at the United Nations, the Aga Khan Foundation and the Ministry of Climate Change & Environmental Coordination jointly held World Environment Day celebration here with an event raising awareness on how climate change, biodiversity loss and pollution are affecting Pakistan, and how people are taking action.\nSpeaking on the occasion, Romina Khurshid said, “Pakistan is among the countries most adversely impacted by climate change, but it is leading the way with its climate diplomacy. We are educating our youth on this crucial subject. We will leave no stone unturned to slow environmental degradation down and increase our ability to deal with the fallout of global warming and its impacts on clean water, health, agriculture, food systems, and energy.”\nDuring the ceremony, Pakistan’s ‘Living Indus’ initiative officially received the World Restoration Flagship award which the UN Environment Programme (UNEP) announced in March; UNEP supports Pakistan’s National Adaptation Plan for building resilience to climate change. Living Indus is a Government-led initiative, which the UN supports, to restore the ecological health of the Indus River Basin. Moreover, the event paid tribute to 30 ‘Climate Heroes’ — women and men who take action against the climate crisis across the country.\n“Just last week, temperatures in Pakistan crossed 52 degree Celsius. We cannot turn back time, but we can take collective action to adapt to this new age of global warming,” said Mohamed Yahya, the UN Resident Coordinator in Pakistan.\nHe said, “Across the country, communities are already trying to cope with the impact of climate change; they combat pollution, deforestation, rapid glacial melt, floods, droughts and heatwaves. By supporting ‘Living Indus’ and a range of innovative programmes, UN agencies aim to help them protect and restore nature, biodiversity, water sources, as well as their lives and livelihoods.”\nThe event marked the premiere of ‘When the floods come’, a new documentary by Nyal Mueenuddin. This young Pakistani filmmaker went on a 3000km odyssey down the Indus River to capture the most intimate stories of how people’s lives are inextricably bound to climate change. The film will be screened again during a public event at PNCA this Friday.\n“Communities have been experiencing firsthand the impacts of climate change and environmental degradation. It is already transforming landscapes, habitats, livelihoods, and local aspirations, said Akhtar Iqbal, CEO, Aga Khan Foundation.\nHe said, “We have witnessed how our collective actions can make a difference. We, at the Aga Khan Foundation and agencies of the Aga Khan Development Network, have been fully committed to doing our part for over 55 years and we will continue to support Pakistan to cope with the challenges ahead.\nWe want to ensure that communities are empowered to be more resilient, have access to clean energy, adopt more sustainable natural resources management practices and contribute to large reforestation efforts. We also want to place women and young people at the centre of climate leadership and invest in their future through boosting green businesses and jobs.”\nIn Pakistan and all over the world, ecosystems are threatened. From forests and drylands to farmlands and lakes, natural spaces on which humanity’s existence depends are reaching a tipping point. This year, World Environment Day focuses on land restoration, halting desertification and building drought resilience under the slogan “Our land. Our future. We are #GenerationRestoration.”\nLed by the UNEP, and held annually since 1973, World Environment Day has grown to be the largest global platform for environmental outreach. It is celebrated by millions of people across the world.",
  "retrievedAt": "2025-08-11T02:58:33.228Z"
}
