{
  "title": "Pakistan’s tobacco taxation drive gains momentum",
  "link": "https://www.app.com.pk/national/pakistans-tobacco-taxation-drive-gains-momentum/",
  "date_published": "2024-06-05T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP):As the death toll from tobacco-related illnesses continues to mount, a clarion call resonates through the halls of power, urging Pakistan’s government to take bold action and implement robust tobacco taxation policies.\nThe stark reality is that tobacco-related illnesses cause a health burden of Rs 615 billion annually, nearly 1.4% of the country’s GDP, and claims over 160,000 lives each year – a staggering cost in both human life and economic resources, said a press release issued here.\nAmidst the clamor, Mehboob ul Haq, CEO of the Human Development Foundation (HDF), emerges as a staunch advocate for change, emphasizing the critical role of increased tobacco taxes in safeguarding public health and fortifying revenue streams.\n“Increasing tobacco taxes is a win-win strategy,” says Mehboob ul Haq. “It not only discourages tobacco consumption, thus alleviating the burden of tobacco-related diseases on our healthcare system, but also generates substantial revenue for the government.”\nHis words resonate with a chorus of health experts who champion taxation as a potent tool in the fight against tobacco use. This approach is demonstrably successful.\nBetween July 2023 and January 2024, cigarette tax collections skyrocketed to PKR 122 billion, with full-year projections exceeding PKR 200 billion.\nThese findings highlight the success of the excise tax reforms as an effective strategy for improving public health and economic growth.\nMehboob ul Haq underscores the need for foresight in economic planning.\nHe implores the Special Investment Facilitation Council (SIFC) to seize the opportunity presented by enhanced tobacco taxation, integrating it into their strategies for economic growth. “This revenue stream holds immense potential,” he asserts, “and aligns with Pakistan’s broader aspirations for prosperity while championing public health and well-being.”\nHowever, the battle against tobacco’s grip on society faces another front. Malik Imran Ahmed, a leading voice in tobacco control, draws attention to the insidious tactics of the tobacco industry.\n“The need for proactive measures cannot be overstated,” he warns.\n“Efforts to introduce cheaper cigarette options persist, undermining our progress in curbing tobacco use.”\nLoose cigarette sales and non-compliance with pricing regulations continue unabated, posing formidable challenges that demand comprehensive regulatory interventions.\nIn the face of these challenges, Imran advocates for swift and decisive action. Only through proactive measures and steadfast commitment can Pakistan hope to overcome the scourge of tobacco use, securing a healthier and more prosperous future for all its citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:59:21.625Z"
}
