{
  "title": "Rubina reaffirms commitment to Shaheed Benazir Bhutto’s vision of women empowerment",
  "link": "https://www.app.com.pk/national/rubina-reaffirms-commitment-to-shaheed-benazir-bhuttos-vision-of-women-empowerment/",
  "date_published": "2024-06-05T13:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):Chairperson Benazir Income Support Programme (BISP), Rubina Khalid Wednesday reaffirmed the organization’s commitment to the vision of Shaheed Mohtarma Benazir Bhutto, focusing on women empowerment and financial independence.\nA delegation from the National Institute of Management (NIM), Peshawar, visited the BISP headquarters today.\nThe delegation comprised 18 participants from the 40th Mid-Career Management Course (MCMC), who engaged with BISP leadership to gain insights into the program’s operation and impact.\nRubina Khalid emphasized that the program has operated under the guiding principles set forth by President Asif Ali Zardari since BISP’s inception in 2008, ensuring that stipends are released in the names of women beneficiaries to promote their financial independence.\nHighlighting the collaborative efforts of Benazir Income Support Programme,  Rubina Khalid stated, “In partnership with various organizations, we have signed Memorandums of Understanding (MoUs) to provide skill and technical training to the members of beneficiary families, enabling them to rise out of poverty.”\nEarlier in the meeting, Secretary BISP, Amer Ali Ahmad, delivered an extensive overview of the programme’s core initiatives, which include Kafaalat, Taleemi Wazaif, Nashonuma, Undergraduate Scholarship, and the National Socio-Economic Registry (NSER). He discussed the introduction of a new payment model involving six banks for cash disbursement, enhancing the efficiency and reach of the financial aid.\nAhmad also underscored the authenticity of the NSER database, which is utilized by various public and private organizations for different social safety projects.\nAddressing the critical issues of stunting and malnutrition among mothers and children, he highlighted the significant role of the Nashonuma Programme in mitigating the challenges.\nThe visit concluded with a detailed Question and Answer session where participants engaged with BISP leadership, gaining valuable knowledge on the program’s strategic initiatives aimed at empowering women and reducing poverty.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:59:44.997Z"
}
