{
  "title": "On World Environment Day, PM urges countrymen to join global movement for land restoration",
  "link": "https://www.app.com.pk/national/on-world-environment-day-pm-urges-countrymen-to-join-global-movement-for-land-restoration/",
  "date_published": "2024-06-05T05:46:00.000Z",
  "source": "APP",
  "content": "SHENZHEN, Jun 5 (APP): As the international community observes World Environment Day on Wednesday, Prime Minister Shehbaz Sharif urged the countrymen to join the global movement to restore their land, build drought resilience and combat desertification.\nThe World Environment Day is celebrated annually on June 5 to highlight the environmental challenges of our time. World Environment Day 2024 focuses on land restoration, stopping desertification and building drought resilience. The Kingdom of Saudi Arabia is the global host of this year’s edition.\nUrging the people to be part of the Generation Restoration program to ensure a better future for all, the prime minister, who is on a five-day visit to China, in his message to the nation, said that the people and Government of Pakistan joined the global community in recognizing their shared responsibility to protect their planet and fight climate change, biodiversity loss, and pollution.\nHe said the theme of this year’s World Environment Day – ‘land restoration, desertification, and drought resilience,’ – reminded the world of the humongous challenge that confronting it in terms of the billions of hectares of land that was being degraded, affecting almost half of the world’s population and threatening half of global GDP. Rural communities, smallholding farmers and the extremely poor are hit the hardest, he added.\n“Pakistan stands firm in its resolve to combat environmental challenges and stands committed to contributing to global efforts towards sustainability. Initiatives such as the Green Pakistan Programme, Living Indus Initiative, and National Adaptation Plan, underscore our commitment to reforestation and ecosystem restoration, tackling issues of deforestation and biodiversity loss head-on,” the prime minister remarked.\nHe recalled that Pakistan’s climate diplomacy efforts during COP27, particularly in establishing a Loss and Damage Fund were recognized widely and viewed positively by international experts.\nHe said on the domestic front, Pakistan is actively working on developing sustainable long-term low-carbon development strategies with assistance from GIZ, Pathways 2050 platform, UNDP, and the World Bank. Additionally, robust afforestation programs are being implemented. Initiatives like the Recharge Pakistan, GLOF, and Sustainable Land Management Program (SLMP) demonstrate Pakistan’s dedication to promoting sustainable agriculture practices and combating land degradation, he added.\nPrime Minister Shehbaz said that despite facing challenges such as land degradation, desertification, and water scarcity, Pakistan remained steadfast in its resolve and efforts to address these issues through innovative solutions and collaborative partnerships.\nThe prime minister also took to his X timeline urging the people to join hands to safeguard and preserve our environment, not only for the well-being of people but also for the survival of our planet.\n“Though we cannot turn back time, we can certainly make a significant impact on the health and sustainability of our environment by taking proactive steps towards endeavors to nurture and cultivate forests, revive and replenish dwindling water sources, and rehabilitate and revitalize exhausted soils,” he wrote\nHe called for embracing the responsibility and work towards a better and sustainable future for our planet.\n“The time for action is now,” he remarked.",
  "retrievedAt": "2025-08-11T02:58:33.230Z"
}
