{
  "title": "Khalid Maqbool emphasizes revamping country’s education system",
  "link": "https://www.app.com.pk/national/khalid-maqbool-emphasizes-revamping-countrys-education-system/",
  "date_published": "2024-06-05T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):Federal Minister for Science and Technology, Dr Khalid Maqbool Siddiqui on Wednesday emphasized the need to revamp the entire education system in the country in line with the modern day requirements.\nHe was addressing at the Award Distribution Ceremony of Pakistan Engineering Council (PEC) Seed Funding Phase-1 for engineering start-ups, held at a local hotel.\nSpeaking on the occasion, the federal minister said that the world is rapidly changing and embracing emerging and new technologies in every section of life.\n“Pakistan is fortunate to have a major chunk of youth population which if equipped with knowledge and education can reshape the destiny of the country”, he said.\nThe minister lamented that our country could not achieve the desired progress in Information Technology sector. “We must conduct research that from which level we can impart IT education to our children so that they can compete with this digital world”, he observed.\nHe said that the present government has imposed education emergency considering the low literacy rate in the country.\nKhalid Maqbool said that the country is producing 20,000 IT graduates every year but only 5000 or 6000 graduates get jobs which is very unfortunate.\nHe said if we can only focus on international certification of IT Engineers, they can earn abroad and send good remittances which can help stabilize country’s economy. “Overseas diaspora has played pivotal role in strengthening the economy of their countries”, he observed.\nThe ceremony was attended by Chairman PEC, Muhammad Najib Haroon, engineers and officials of Ministry of Science and Technology.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:59:18.829Z"
}
