{
  "title": "NIMA stresses for construction of dams on World Environment day",
  "link": "https://www.app.com.pk/national/nima-stresses-for-construction-of-dams-on-world-environment-day/",
  "date_published": "2024-06-05T07:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP):Director at National Center for Maritime Policy Research Commodore (Retd) Ali Abbas on World Environment Day stressed the need for the construction of more dams and public awareness drives on a national level to reduce marine plastic waste by using biodegradable material and other technological innovations.\nTalking to a private news channel, he said that World Environment Day (WED) is observed on the 5th of June each year and calls for protecting our natural surroundings, adding, that we collectively need to raise awareness on the challenges facing our environment such as; pollution, illegal wildlife trade, unsustainable consumption, rising sea levels and food insecurity.\nWED aims to highlight the significance of the environment in Pakistan to promote awareness amongst personnel and encourage them to adopt practices conducive to the marine environment.\nA clean and environment-friendly Pakistan is a prosperous Pakistan, he said, adding, Let all join hands and build a sustainable future for our coming generations, he mentioned.\n‘It is time we think of climate change as a development issue that has the potential to increase social differences and injustice, especially for those who are already living on the edge at the face of climate change’, he added.\nReplying to a question, he emphasized that it is every individual responsibility to opt for cloth bags over plastic ones and to choose steel or other environmentally friendly alternatives for food consumption.\nHe also called for the youth’s active role in the conservation of natural resources and asked them to come up with innovative solutions to resolve these challenges. ‘We should stand united and put our efforts together to revive the lost glory of our mother earth’, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:00:36.928Z"
}
