{
  "title": "Land degradation serious risk to Pakistan’s food, water security amid Indian violations of IWT: Romina",
  "link": "https://www.app.com.pk/national/land-degradation-serious-risk-to-pakistans-food-water-security-amid-indian-violations-of-iwt-romina/",
  "date_published": "2024-06-05T10:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):Prime Minister’s Coordinator on Climate Change Romina Khurshid Alam on Wednesday said land degradation due to rising impacts of climate change was a serious risk to Pakistan’s food and water security amid Indian violations of Indus Water Treaty (IWT).\nShe was addressing the Commission on Science and Technology for Sustainable Development in the South (COMSATS)’s High-Level Panel Discussion on UN World Environment Day under the theme Land Restoration, Desertification and Drought Resilience.\nRomina said the country was facing the worst impacts of climate change that emanated interconnected challenges of food security, water scarcity, and land degradation.\n“Land degradation is damaging millions of hectares land annually and forcing millions of masses to displace around the world. Agriculture is the life one of Pakistan and land degradation would cast serious impacts coupled with forest degradation that would further aggravate the problem,” she said. The PM’s Coordinator mentioned that Indian construction of dams on rivers providing water to Pakistan was also a concern for the latter as a low riparian country.\nShe added that declining soil quantity and salinization directly caused reduced crop yields that was driving poverty, and rural to urban migration.\nRomina noted that sustainable development was only possible through a holistic policy initiative to address land degradation whereas resource pooling for technology and capacity building of farmers on use of modern technology solutions was pertinent for improving crop resilience.\nShe urged partners to provide platform in tandem with Ministry of Climate Change to scientists for knowledge sharing. She highlighted the Ministry’s various projects intended to enhance climate resilience, mitigate land degradation and forest degradation addressing community and biodiversity resilience collectively.\nShe said the local communities and indigenous people have tremendous knowledge that could be used to devise strategies to address land degradation. She demanded all to pledge to empower local communities, foster greener collaborations for supporting each other to counter land degradation, deforestation and drought mitigation.\nIn his welcome remarks, Executive Director COMSATS, Ambassador Mohammad Nafees Zakaria said World Environment Day was an important event and the dialogue was a manifestation of sincere commitment of the government to the cause of environmental preservation.\nHe said the growth and supply demand surges were occurring in the countries around the globe leading to land degradation whereas it’s serious consequences were neglected that resulted into inadequate responses.\n“Awareness is crucial to guide high level policy making that will set the pace for sustainable development and eco-friendly economic growth. Climate change, poverty and hunger are intrinsically linked issues and the way forward is technology based solutions with improved knowledge,” Ambassador Zakaria said.\nHe added that big land data sets could be used for better land use as in the existing highly competitive environment, it was important for the nation to develop capacities and improve technology.\nHe informed that COMSATS is an intergovernmental organisation of 28 countries formed by Prof Dr Abdus Salam to bridge technology gaps among developing and developed nations of Asia, Europe, Latin America, Middle East.\nThe COMSATS, he said had worked on green hydrogen, remote sensing modelling and simulation, fuel cell technology and others, whereas the Commission had active working relationship with leading international platforms like Commonwealth and renowned scientific and environmental forums of global scope.\n“The impact of military exercises and wars have been devastating for the environment and was degrading the land that needed to be studied to hold the accused accountable,” he said.\nPresident Eco Science Foundation Prof Seyed Komail Tayebi said protecting environment was not a matter of choice but of existence.\n“Climate change is the most pressing challenge faced by the region threatening it’s food security and overall well-being through erratic rainfall and climate catastrophes. Healthy environment is the foundation of a strong society. The current year theme is pertinent as the region is facing challenges and demanded multipronged solutions including building technologies, efficiencies in businesses and environmental best practices in other sectors can help resolve the crisis,” Tayebi said.\nHe added that the region needs to develop partnerships for resource efficiency, regional cooperation, land desertification mitigation and associated crises to address the issue.\n“No individual and government alone can address climate change whereas spirit of shared responsibility needs to be highlighted for harmony between humans and nature,” he added.\nChairman NDMA, Lieutenant General Inam Haider Malik said Pakistan was informed and equipped with AI information on disaster risk management.\nHe added that Pakistan and the world in particular was unable to do much on SDGs whereas the threshold of temperature for 2030 was crossed last year and business as usual could not work further.\nThe catastrophes, he said have become new abnormal and without synergies no nation could achieve climate action. The financial constraints and economic hurdles in disaster risk management and reduction preparedness were a challenge to the nation, he added.\n“The knowledge developed by centers of excellences in Pakistan needs to be promoted and  would have to hammer climate change knowledge to our children, places of worship, tourism and other sectors,” he said.\nThe NDMA Chairman said Pakistan was at the verge of acute water shortage that demanded serious attention to cope with lingering risk.\n“Climate change is a collective issue and cost of disaster and punishment will also be collective in nature whereas Pakistan’s rankings have dropped further from 7th to 5th most vulnerable country due to climate change after recurrent natural disasters,” he said.\nIn his closing remarks, Secretary Ministry of Foreign Affairs, Syed Haider Shah said climate change was the defining reality of our lives and no nation could reverse it.\nHe underlined that Pakistan was among the top ten countries most impacted from climate change and the IPCC recent report highlighted that the world temperature was 1.1 degree Celsius warmer than the projected and would cross the 1.5 degrees threshold prior to the end of the decade.\nHe mentioned that there were around 3.2-3 .6 million people who got impacted due to floods in Pakistan that demanded us to shift our focus and investment towards disaster resilience and flood management.\n“Developing countries need $330 billion for mitigation and $6 trillion to meet their NDCs by 2030, whereas a wide range of action is required to address climate change  along with capacity building and technology transfer to the developing countries in fight against climate change,” he added.\nAt the end, mementoes were given to dignitaries by Executive Director COMSATS Ambassador Nafees Zakaria.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:00:30.126Z"
}
