{
  "title": "PM invites Huawei to invest in Pakistan’s safe city, taxation, e-governance sectors",
  "link": "https://www.app.com.pk/national/pm-invites-huawei-to-invest-in-pakistans-safe-city-taxation-e-governance-sectors/",
  "date_published": "2024-06-05T12:28:00.000Z",
  "source": "APP",
  "content": "SHENZHEN, Jun 05 (APP): Prime Minister Shehbaz Sharif on Wednesday visited the Huawei headquarters here and invited the company to invest in Pakistan’s taxation, and e-governance sectors besides enhancing its presence in Pakistan’s Safe City projects.\nOn his arrival at the headquarters, Huawei Chairman Liang Hua welcomed him which followed the playing of national anthems and his visit of the Exhibition Center.\nThe chairman briefed the prime minister about Huawei’s operations worldwide, particularly in Pakistan, and expressed keen interest in investing in country’s different sectors.\nHe was also briefed about different sectors including e-governance, digital banking, telecommunication and artificial intelligence.\nPrime Minister Shehbaz, who is on a five-day visit to China, appreciated the innovative operations of Huawei and urged the company to increase its investment in Pakistan.\nThe prime minister, who later held a bilateral meeting with Chairman Liang Hua along with his delegation, appreciated the Safe City projects executed by Huawei in Pakistan and invited the company to invest in the projects particularly in the cities where CPEC projects were being executed.\nHe apprised the company chairman of the steps taken by the government for promotion of investment and ease of doing business in the country.\nThe prime minister, highlighting the government’s priority measures for digitisation of government offices, said there existed immense investment potential for giants like Huawei in taxation system, e-governance, and artificial intelligence.\nHe also invited the Huawei chairman to invest in introduction of modern technology in the agriculture sector and also invited the Huawei chairman to visit Pakistan.\nLater, the prime minister also attended the signing ceremony of a framework agreement between Huawei and Pakistan’s Ministry of Science and Technology under which the company would impart free of charge training to around 200,000 youngsters in information technology including the artificial intelligence. Besides, the company would also extend its support to Pakistan in establishment of Safe Cities, e-governance and digitisation of economy.\nThe company chairman also hosted a luncheon reception for the prime minister and his delegation.\nAfter visiting the Huawei headquarters, the prime minister took to X saying, “I was impressed by latest innovative technologies that are changing the world and the way we live.\nIn the meeting, they discussed how Huawei and Pakistan could collaborate to build a better and digital future together.\nThe prime minister also reiterated his commitment to advancing an innovative, inclusive and sustainable digital transformation for Pakistan.",
  "retrievedAt": "2025-08-11T02:59:44.579Z"
}
