{
  "title": "Pakistan intends to restore 100,000 hectares land, achieve 6% forest cover: Romina",
  "link": "https://www.app.com.pk/national/pakistan-intends-to-restore-100000-hectares-land-achieve-6-forest-cover-romina/",
  "date_published": "2024-06-05T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP): Prime Minister’s Coordinator on Climate Change, Romina Khurshid Alam on Wednesday said the country had envisioned to restore 100,000 hectares (ha) degraded land and intend to achieve 6 percent forest cover of the total area.\nShe was addressing the World Environment Day seminar titled Land Restoration, Desertification and Drought Resilience: Our Land, Our Future jointly organised by the Ministry of Climate Change and Environmental Coordination, in collaboration with the United Nations Environment Programme (UNEP), and the Sustainable Development Policy Institute (SDPI).\nIn her keynote address, Romina Khurshid Alam said the theme for World Environment Day 2024 was a timely reminder of crucial importance to protect and conserve our environment.\nShe said due to galloping impacts of global warming and environmental degradation 3/4th of the country’s land would be affected by land degradation.\n“Pakistan only utilises 16 million ha of land for irrigation and many of its parts are impacted by land logging and salinity,” Romina said.\nThe incumbent government has shown unwavering resolve in addressing climate change under the leadership of Prime Minister Shehbaz Sharif whose vision was instrumental in shaping and driving the government’s policies, she added.\n“We need to build resilience across our systems and communities. The National Adaptation Plan further sheds light on addressing land degradation and rehabilitation of degraded lands which is important for sustainable livelihoods and production of our agriculture sector. Local communities, civil society organisations, academia and governments would have to fight collectively to heal the land,” the Prime Minister’s Coordinator said.\nIn his opening remarks, Executive Director SDPI, Dr Abid Qaiyum Suleri said the current World Environment Day was more relevant than ever in the context of climate change. He noted that spring season has almost vanished from our seasonal calendar as from winters there was a direct transition into sizzling summers.\n“It’s impacting our entire ecosystem, world and our region. Climate change manifestation is visible in the form of erratic and intensive rainfall, whereas 2022 floods rains in Balochistan were of biblical proportions that was not manageable by any nation on earth due to its massive magnitude,” Dr Suleri said.\nHe commented that drought had a slow onset and it’s impacts were observed when it was too late, as with changing weather, there were two phenomenons mainly floods that are visible and the other was slow like a silent killer invisible mainly drought, lack of rains, desertification and dropping crop yields.\nThe Coordinator in her article wrote that it was the governments and citizens that have to join hands and act in a manner to control impacts of climate change which was very pertinent and way forward.\nPakistan, he said was rapidly coming up as a water scarce country that demands the country to change its economic practices and water usage habits to cope with depleting water security.\nNational Technical Advisor, UNEP, Arshad Samad Khan said climate change has aggravated land degradation. ” World Environment Day is a call for all government, private sector, students, common citizens and others to restore degraded land and ensure bright future for coming generations,” he said.\nHe added that land is the foundation of food security water resources and livelihoods and demands a national pledge to make Pakistan a land of thriving biodiversity and ecosystems.\nDuring the panel discussion, Dr Mazhar Hayat, Deputy Secretary, Ministry of Climate Change said the country can learn from the Kingdom of Saudi Arabia aggressively working on degraded land restoration under Green Saudi Initiative and Middle East Green Initiative.\nHe said Pakistan has a comprehensive policy framework under National Adaptation Plan that collectively addresses land degradation, water and others.\n“Pakistan’s major focus has always been on adaptation, afforestation, drought resilience, and deforestation,” he said.\nClimate change is a water challenge for Pakistan that demands efficient water use at urban level, and less water usage at farm level, he added.\nMaryam Shabbir, Climate Expert, University of Vermont said land degradation was mainly due to over grazing of animals and chemical usage during agriculture.\nShe said livelihood and food security issue emerges after the drought onset, whereas right plantation, capacity building and relevant experts to ensure effective strategies.\nShe added that over population was mother of all crises, whereas local communities were part of the problem and solution as well as their inclusion could help address the challenge.\nChairman Federal Flood Commission, Ahmed Kamal said there was lack of urban planning and poorly planned infrastructure development was aggravating climate crises amid recurring natural disasters.\nThe legislation implementation was at the third tier of the governance that needs to be addressed, he said.",
  "retrievedAt": "2025-08-11T02:59:46.695Z"
}
