{
  "title": "“I share your pain. Will come very soon”: PM; Requests Hazara protestors to bury the dead",
  "link": "https://www.app.com.pk/national/will-come-very-soon-for-condolence-pm-requests-hazara-protestors-to-bury-bodies/",
  "date_published": "2021-01-06T11:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP): Prime Minister Imran Khan Wednesday while assuring the protesting Hazara community members of his condolatory visit “soon”, requested them to bury the bodies of their loved ones.\n“I will never betray my people’s trust. Please bury your loved ones so their souls find peace,” the prime minister said on Twitter as the grieved families were in protest over the killing of 11 coal miners in Mach area of Balochistan, refusing to bury their loved ones.\n“I share your pain,” the prime minister said telling the community that he had visited them in the past as well to stand with them in their time of suffering.\nI want to reassure the Hazara families who lost their loved ones in a brutal terrorist attack in Machh that I am cogniscant of their suffering & their demands. We are taking steps to prevent such attacks in the future & know our neighbour is instigating this sectarian terrorism.\n— Imran Khan (@ImranKhanPTI) January 6, 2021\nThe prime minister was referring to his visit of Balochistan in 2012 when Hazara community members were protesting the killing of their members in multiple incidents in the year, when he was not even in the parliamentary opposition.\n“I will come again very soon to offer prayers and condole with all the families personally,” he remarked.\nHe assured the Hazara families that he was cognizant of their sufferings and their demands. The government was taking steps to prevent such attacks in the future knowing that “our neighbour is instigating this sectarian terrorism,” the prime minister said referring to Indian intervention and sponsoring of terror activities in Pakistan, particularly Balochistan province – an emerging hub of trade and investment owing to Gwadar Port and China Pakistan Economic Corridor.\nInterior Minister Sheikh Rashid Ahmed, who visited the victim families on Prime Minister Imran Khan’s directive, on Monday had announced Rs 2.5 million each for slain coal mine workers’ families.\nThe compensation would comprise Rs 1 million from the prime minister and Rs 1.5 million by the provincial government.\nMinister for Interior Sheikh Rashid Ahmed offering Fateha for the persons of Hazara Community while negotiating at the sit in in Quetta. pic.twitter.com/nXHLNlYVIP\n— Sheikh Rashid Ahmed (@ShkhRasheed) January 4, 2021\nLater, another high level delegation including federal minister Ali Haider Zaidi, Deputy Speaker of National Assembly Qasim Suri, SAPM Zulfiqar Bukhari and Chief Minister of Balochistan Jam Kamal Khan also met the protestors and assured them of government’s all out support for their protection and arrest of the killers.\nوزیر اعلیٰ بلوچستان جام کمال خان، ڈپٹی اسپیکر قومی اسمبلی قاسم خان سوری، وفاقی وزیر علی حیدر زیدی، معاون خصوصی وزیراعظم زلفی بخاری, عبد الخالق ہزارہ و دیگر نے امام بارگاہ ولی عصر میں ہزارہ برادری کےمشران سےملاقات، سانحہء مچھ پر اظہارِ رنج و الم اور میڈیا کےنمائندوں سے گفتگو کی۔ pic.twitter.com/bmrVzxhzIV\n— QKS_Updates (@TeamQasimSuri) January 6, 2021\nHowever, they could not convince them to call off the protest which the Hazara community has linked with the visit of the prime minister to seek assurance on arrest of the culprits.",
  "retrievedAt": "2025-08-11T20:13:11.555Z"
}
