{
  "title": "NA speaker pays tribute to late Qazi Hussain",
  "link": "https://www.app.com.pk/national/na-speaker-pays-tribute-to-late-qazi-hussain/",
  "date_published": "2021-01-06T16:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP): National Assembly, Speaker Asad Qaiser on Wednesday paid tribute to the services of late Qazi Hussain, the Ameer of Jamat-e-Islami Pakistan for social justice and national integration of the country.\nThe Speaker expressed these views while chairing a ceremony commemorating the 8th death anniversary of the late Ameer held here.\nWhile sharing his experience with late Qazi Hussain Ahmed the Speaker said that he was committed to his cause and believed in devoting his life for the betterment of downtrodden.\nHe said that Prime Minister Imran Khan had always been respectful to the immaculate personality of Qazi Hussain Ahmed.\nThe Speaker said that Pakistan was facing diverse socio-economic issues which need unity across the political parties.\nHe said that struggle and commitment of late Qazi Hussain Ahmed should be followed in letter and spirit for the development of the country.\nHe said that his selfless political attitude was remarkable, adding that being speaker of KPK and Speaker National Assembly he always strive hard to implement Islamic welfare concepts.\nAsif Luqman Qazi Son of Qazi Hussain Ahmed thanked the Speaker for participation in the ceremony.\nHe said that his father lead purposeful life and he always remained sincere and devoted to his goal of bringing Islamic revolution in the country.\nHe said that dialogue was imperative for progress and development of the country.\nMember Azad Jammu and Kashmir Assembly Abdul Rasheed remembered the great services of Qazi Hussain Ahmed and remarked about his efforts to highlight Kashmir issue at every international forum.\nNaib Ameer Jamat e Islami Mian Muhammad Aslam noted that Qazi Hussain Ahmed was a revolution in himself.\nHe expressed that his contribution to bring national unity has always been remarkable as Pakistan could never forget his services.\nZafar Bakhtawari member Jamat e Islami also mentioned about Qazi Hussain Ahmed struggle to unite Muslim countries.",
  "retrievedAt": "2025-08-11T20:13:07.196Z"
}
