{
  "title": "Environmental regulator’s role imperative for sustainable industrial growth: Zartaj",
  "link": "https://www.app.com.pk/national/environmental-regulators-role-imperative-for-sustainable-industrial-growth-zartaj/",
  "date_published": "2021-01-06T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 06 (APP):Minister of State for Climate Change Zartaj Gul on Wednesday said role of Pakistan Environmental Protection Agency (Pak-EPA) was imperative for sustainable industrial growth to prevent least damage to the ecology.\nAddressing a two-day training workshop on Environmental Impact Assessment (EIA) organised by Pak-EPA for public and private corporate sector representatives, she said the environmental regulators had the core responsibility to make the industrial and corporate sector comply with its duties pledged under EIA for preventing pollution at all levels.\nShe said, “Pakistan’s 33 percent forest cover has been reduced to 4 percent since partition due to unbridled tree cutting by timber mafia. The forest department and other authorities could have prevented this huge damage to the environment that increased the country’s vulnerability to climate change at drastic level.”\nShe added that the industrial and corporate sectors should realise its role under corporate social responsibility (CSR) for preserving environment around their business premises.\n“DG Khan Cement one of the largest industrial unit in Dera Ghazi Khan (DG Khan) has merely contributed 350 plants for plantation which is regrettable as philanthropists of federal capital donated over 10,000 plants for plantation programme,” she said.\nZartaj announced that by the end of July, 2021 Ministry of Climate Change (MoCC) would achieve one billion plantation target under Ten Billion Tree Tsunami (TBTT) project.\nThe Pak-EPA was actively working to preserve the environment of the federal capital and had convinced steel manufacturing units to adopt air bag filter technology which helped in collecting dark carbon released into the atmosphere, she added.\nShe said the training was a propitious initiative which should be extended further and the industries which are not complying with environmental laws should be trained under this initiative.\nThe MoCC, she said implemented maximum environment saving projects in the past two years under the leadership of Prime Minister Imran Khan.\nKeeping in view the increasing risk of climate change and environmental degradation, she said forest and wildlife areas were developed, climate advance agriculture, latest hydrometric systems were installed and imposed ban on plastic bags with anti smog initiatives.\nResponding to a query, she said the Pak-EPA had rigorously implemented ban on plastic bags which was facing a little complacency due to COVID-19 pandemic. However, the drive would be revived soon after decline in the disease spread.\nShe said the provincial environmental protection departments should also proactively approach the industrial sector to ensure environmental laws’ compliance. “It will help them generate bi products giving economic benefits and ensure least damage to the environment,” she added.\nAround 20 representatives from public and private departments including environmental engineers participated in the two-day training workshop.\nThe training aimed at educating corporate representatives in implementing EIA reports recommendations made for sustainable development of a project.\nEIA report was the first step prior to initiating development work of any project for public facility that would give core priority to environment and biodiversity mostly at risk during mega projects.\nIts sole approval was given Pak-EPA at federal level where provincial EPAs were responsibile in their respective domains. EIA report holistically reviews a project, its scope, prospect, public utility and impact on the environment and also suggests measures to compensate and manage damage to the ecology.",
  "retrievedAt": "2025-08-11T20:13:08.254Z"
}
