{
  "title": "Nationwide drive for school enrolment soon under Ehsaas",
  "link": "https://www.app.com.pk/national/nationwide-drive-for-school-enrolment-soon-under-ehsaas/",
  "date_published": "2021-01-06T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 06 (APP):The Ehsaas programme has planned to roll out nationwide drive for school enrolment soon in collaboration with provinces and key development stakeholders to enhance primary school enrolments and minimize dropouts.\nThis was discussed during a maiden meeting of the Ehsaas steering committee for Waseela-e-Taleem Digital which is an education conditional cash transfer programme.\nToday, I convened the maiden meeting of @Ehsaas_Pk steering committee for Waseela-e-Taleem Digital.The meeting reviewed performance of education #CCT program, discussed way forward & explored options to enhance outcomes capitalizing on deep-rooted reforms deployed under #Ehsaas. pic.twitter.com/GVRsH0THV2\n— Sania Nishtar (@SaniaNishtar) January 6, 2021\nThe meeting was convened under the chair of Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar.\n“The programme targeting will also be aligned in keeping with results of Ehsaas National Socio-economic Registry survey that is currently 61% complete in the field and is expected to be concluded before June 2021 nationwide”, stated SAPM Dr. Sania.\nIt was agreed during the meeting that a sub-committee will be constituted with experts from the steering committee stakeholders and provinces for a deep dive into the deep-rooted reforms and integrations in the education conditional cash transfer programme.\nThe steering committee will meet biannually to review the progress and strategic direction of programme.\nEarlier, the steering committee members were briefed on the Waseela-e-Taleem Digital, that has massively been reformed and scaled up through end-to-end digitization, cost effective changes in institutional infrastructure, new stipend policy, and nationwide expansion across all districts.\nThe Rs. 80 billion programme will bring five million deserving primary school children into its fold from across all 154 districts of Pakistan over a 4-year duration.\nThe steering committee reviewed the programme performance, discussed the way forward and explored options to enhance the outcomes of the programme capitalizing on conditionalities introduced in the programme. Terms of reference of the steering committee were also principally crystallized in consultation with committee members.\n“The purpose of the deep-rooted digital reform in Waseela-e-Taleem under Ehsaas was to promote integrity, transparency, accountability and to improve targeting. And, the programme has been scaled up nationwide to address the problem of out of school children”, Dr. Sania Nishtar said.\nShe said, “As per Ehsaas payment policy, all payments are bio-metrically verified in real time; girls get Rs. 2000 and boys get Rs. 1500 per quarter, when 70% school attendance is ensured.”\nThe meeting brought together members of the steering committee from Ministry of Economic Affairs, Ministry of Education and Professional Training, Foreign Commonwealth and Development Office, the World Bank, Asian Development Bank and Education Departments from provinces including AJK and GB who were joined by Waseela-e-Taleem Digital operations team.\nThe committee richly lauded quantum changes in the Waseela-e-Taleem Digital programme specifically comprehensive and deep-rooted reforms that have been designed and deployed over the last year and a half under Ehsaas, a as a result of which far reaching results would be achieved in the outcomes of programme.\nIn her concluding remarks, SAPM Dr. Sania thanked the steering committee experts and members for their time and valuable inputs and reiterated that this steering committee forum will open doors to collaborate and bring rich expertise from provincial education departments, key stakeholders, and development partners.",
  "retrievedAt": "2025-08-11T20:13:07.588Z"
}
