{
  "title": "Islamabad police to be equipped on modern lines to control street crimes: Sh Rasheed",
  "link": "https://www.app.com.pk/national/islamabad-police-to-be-equipped-on-modern-lines-to-control-street-crimes-sh-rasheed/",
  "date_published": "2021-01-06T06:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP):Interior Minister Sheikh Rasheed Ahmed Wednesday said that the Islamabad police would be equipped on modern lines and would be made an exemplary force for other law enforcement agencies.\nTalking to a private news channel, he said that the overall security plan would be further improved to make Islamabad a safe city and checking system through smart cars, equipped with the latest technology will also be introduced soon.\nMore cars will be provided to Islamabad police for effective checking,” he said, adding that unnecessary 30 check posts have been removed from the city while latest technology would be used to conduct checking at various points of the city, he said.\nSheik Rasheed believes that the footage of the Safe City cameras is technologically advanced too, which could help law enforcement agencies to identify suspects and criminals through the online system.\nHe said that it was not possible to meet policing challenges of the modern era without employing the latest technology effectively and some people with negative thinking politicizing the issue of check posts which were unnecessary.\nSheikh Rasheed said that Eagle Squad would be equipped with latest technology to collect data of vehicles instead of unnecessary check posts.\nHe said that CCTV cameras under an integrated system would be made functional in crime hit areas, which will keep officers and officials in field updated about emergency situations.\nHe said the security check-posts in twin cities would also be improved and situation would be under control within one month.\nHe also stressed that professional policing could promote the rule of law, adding that better training courses for police would be upgraded in order to face challenges of modern policing and special modules about morality, ethics and public dealing.\nMinister also urged the citizens to avoid lane violations and maintain traffic discipline to reduce road accidents.",
  "retrievedAt": "2025-08-11T20:13:11.454Z"
}
