{
  "title": "Liaqat Hussain appointed AJK High Court chief justice - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Justice Sardar Liaqat Hussain, the senior puisne judge of the Azad Jammu and Kashmir (AJK) High Court, has been appointed as the next chief justice, following the advice of the prime minister of Pakistan to the AJK president.\n\nJustice Hussain is scheduled to take the oath of office at Kashmir House in Islamabad at 5pm on Monday, a day after the retirement of the incumbent Chief Justice Sadaqat Hussain Raja.\n\nUnder clause 2-A of Article 43 of the AJK Constitution, the region’s president appoints the high court chief justice on the advice of the AJK Council, after consultation with the incumbent top judge of AJK Supreme Court. The AJK Council is chaired by the prime minister of Pakistan.\n\nSources in the AJK Law, Justice and Parliamentary Affairs Department told Dawn that after the receipt of the summary from the AJK council secretariat, a formal notification would be issued regarding the elevation of Justice Hussain.\n\nNotably, this is one of the rare instances in recent years where the AJK Council chairman has issued the advice for the appointment of a new chief justice well before the retirement of the incumbent.\n\nIn the past, delays in such recommendations had led to several senior judges serving as acting chief justices. To avoid any administrative vacuum, the AJK president had already notified Justice Hussain to act as chief justice upon the retirement of his predecessor.\n\nBorn in November 1965 in Mang tehsil of district Sudhnoti, Justice Hussain — popularly known as Liaqat Shaheen — earned his law degree from the University of Karachi in 1988.\n\nHe was enrolled as a lawyer in 1994 and joined the judiciary in 1998 as a civil judge after qualifying through the AJK Public Service Commission.\n\nRising through the ranks, he went on to serve as a district judge and also held the post of registrar of the High Court from February 2016 to March 2019. Thereafter, he was appointed chairman of AJK’s Inland Land Revenue.\n\nJustice Hussain was elevated to the High Court bench in Jan­uary 2022.\n\nWithin a month of his elevation, he was nominated by the outgoing chief justice as cha­irman of the AJK Press Found­a­tion — a position he is now exp­ected to relinquish in favour of a nominee of his own upon assuming the office of chief justice.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:27:29.281Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915720/liaqat-hussain-appointed-ajk-high-court-chief-justice",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T03:24:13.000Z"
}
