{
  "title": "China seeks improved ties with Canada amid rising trade tensions - World - DAWN.COM",
  "author": null,
  "content": "China called on Friday for steps to improve bilateral ties with Canada, saying there were no deepseated conflicts of interest, following a spike in trade tensions with many of Beijing’s Western trade partners this year.\n\nChina is willing to work with Canada to put ties on a healthy and stable path and find solutions to address each other’s concerns through enhanced dialogue, Premier Li Qiang told Canadian Prime Minister Mark Carney in a phone call on Friday, according to the state-run Xinhua news agency.\n\n“There is no fundamental conflict of interests between the two countries,” Li said.\n\nLi’s talks with Carney followed a highly-anticipated phone call between US President Donald Trump and Chinese President Xi Jinping on Thursday, which Trump said led to “a very positive conclusion” and offered hope the trade war between the world’s two largest economies might start to de-escalate.\n\nAs the effects of trade frictions start to make their way into the already soft Chinese economy, Beijing has stepped up engagement with other countries to alleviate friction despite earlier retaliation.\n\nIn March, Beijing announced tariffs on over $2.6 billion worth of Canadian agricultural and food products in retaliation for Ottawa’s levies on Chinese electric vehicles and steel and aluminium products introduced in October.\n\nBeijing has also launched an anti-dumping investigation into Canadian canola that is set to conclude in September.\n\nCanola, also known as rapeseed, was one of Canada’s top exports to China, the world’s No. 1 agricultural importer, prior to Beijing’s investigation.\n\n“The two governments should listen to and respond to the people’s calls and do more to deepen the friendly cooperation and enhance mutual understanding and trust,” Li told Carney.\n\nChina is Canada’s second-largest trading partner, trailing far behind the United States. Canada exported $47 billion worth of goods to the world’s second-largest economy in 2024, according to Chinese customs data.\n\nBeijing is also willing to work with Canada to safeguard multilateralism and free trade, Li added.\n\nBeijing’s olive branch to Ottawa also comes ahead of a Group of Seven summit of leaders in Canada in mid-June.\n\nAt the G7 summit in Italy last year, G7 leaders were critical of China, saying they would take steps to shield their economies from China’s “ unfair “ practices.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:47:32.870Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915816/china-seeks-improved-ties-with-canada-amid-rising-trade-tensions",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T11:30:05.000Z"
}
