{
  "title": "Pilgrims ‘stone the devil’ as Haj nears end in Saudi Arabia - World - DAWN.COM",
  "author": null,
  "content": "Pilgrims on Friday were performing the last major ritual of the Haj — the stoning of the Jamarat, also known as the “stoning of the devil”, which symbolises the rejection of evil, as Muslims around the globe celebrated the beginning of Eidul Azha.\n\nPakistan will celebrate Eidul Azha tomorrow (Saturday).\n\nStarting before daybreak, the more than 1.6 million pilgrims taking part in the Haj threw seven stones at each of three concrete walls symbolising the devil in the Mina valley, on the outskirts of the holy city of Makkah.\n\nDroves of pilgrims had already set out from their camps and accommodations in the sprawling tent city in Mina before dawn, taking advantage of the shade and cool temperature.\n\nThe ritual commemorates Prophet Ibrahim’s stoning of the Jamarat at the three spots where Satan tried to dissuade him from obeying God’s order to sacrifice his son.\n\n“Our experience in Mina was easy and simple. We entered and within five minutes we had completed the stoning of the devil at the ‘Jamarat’,” said 34-year-old Wael Ahmed Abdel Kader, from Egypt, after carrying out the ritual at dawn.\n\nHowakita, a pilgrim from Guinea, said the prospect of celebrating Eid in Makkah filled her with joy.\n\nA day earlier, pilgrims converged on Mount Arafat, praying and reciting Quranic verses at the 70-metre rocky rise near Makkah, where Prophet Muhammad (PBUH) gave his last sermon.\n\nMany climbed the mount despite the searing heat, though numbers had thinned by midday following official warnings for pilgrims to stay inside between 10am and 4pm (12pm and 6pm PKT)\n\nThis year’s Haj saw authorities implementing a range of heat mitigation efforts alongside a wide-ranging crackdown on illicit pilgrims — resulting in noticeably thinner crowds and a heavy security presence at holy sites in Makkah and surrounding areas.\n\nThe measures were aimed at preventing a fatal repeat of last year’s Haj that saw 1,301 people die in temperatures that hit 51.8 degrees Celsius.\n\nSaudi authorities said a majority of those deaths were among pilgrims who illegally snuck into Makkah and lacked access to accommodation and other services aimed to keep pilgrims safe and protected from the searing desert heat.\n\nThis Haj season has recorded the lowest number of pilgrims in over three decades, barring the years of Covid restrictions from 2020-2022.\n\nLast year, 1.8m pilgrims took part in the Haj, according to official figures.\n\nHaj permits are allocated to countries on a quota basis and distributed to individuals by a lottery system. Pakistan receives one of the highest Haj quotas from Saudi Arabia.\n\nThe Saudi King, Salman bin Abdulaziz Al Saud, in a message in Arabic, expressed gratitude at having the privilege to host Haj every year. He prayed to God for the acceptance of the holy ritual.\n\nIran’s Supreme Leader Ayatollah Ali Khamenei urged the Pilgrims to keep the people of Gaza in their prayers. In a message posted on X, he wrote, “You blessed pilgrims, do not neglect the opportunity to pray and seek Almighty God’s help during the Hajj.”\n\nKhaemeni called on the pilgrims to ask the Almighty “for victory over the Zionist oppressors and their supporters.”\n\nHaj, one of the fundamental pillars of Islam, is performed each year by millions of Muslims worldwide.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/0611483558818a2.jpg",
  "retrievedAt": "2025-08-20T03:47:34.008Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915803/pilgrims-stone-the-devil-as-haj-nears-end-in-saudi-arabia",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T07:44:06.000Z"
}
