{
  "title": "Merz braves Trump’s Oval Office test - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: German Chancellor Friedrich Merz met Donald Trump on Thursday, hoping to avoid one of the US president’s Oval Office infamous ambushes amid discord over Ukraine, tariffs and the Trump administration’s support for Germany’s far-right.\n\nIt was all smiles and handshakes as Republican Trump, 78 greeted the conservative Merz, 69, outside the West Wing at the start of their first face-to-face meeting.\n\nA month into his job, Merz will try to build a rapport with the mercurial Trump as he seeks to maintain good ties with the country he considers post-war Germany’s “indispensable” ally.\n\nHe will offer pledges to sharply increase Germany’s Nato spending and look for common ground on confronting Vladimir Putin on Ukraine. On Trump’s threat to hammer the European Union with sharply higher tariffs, Merz, leader of the bloc’s biggest economy, has argued that it must be self-confident in its negotiations with Washington.\n\nBut first Merz must brave the televised rite of passage of an Oval Office meeting with Trump — whose administration has taken an aggressive stance towards Germany and even backed the far-right there. Trump, 78, has delivered a series of public dressing downs to foreign leaders in the heart of the White House, from Ukrainian President Volodymyr Zelensky to South Africa’s Cyril Ramaphosa.\n\nThe New York Times reported that Trump was set to confront Merz over free speech issues in Germany — a bugbear the administration has repeatedly brought up with European leaders despite its own record.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68426ce462acb.jpg",
  "retrievedAt": "2025-08-20T03:47:38.280Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915750/merz-braves-trumps-oval-office-test",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T04:21:14.000Z"
}
