{
  "title": "Reforms launched to ease funding barriers for SMEs - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: In a bid to unlock the potential of the country’s small and medium enterprises (SMEs), the State Bank of Pakistan (SBP) on Thursday announced a comprehensive review of the prudential regulations for SME financing. The move aims to promote sustainable, responsible and inclusive access to finance for the sector.\n\nAccording to the central bank, the revised regulations are intended to make the framework more principles-based, remove structural barriers to lending and encourage banks to extend credit to SMEs. New rules have also been introduced alongside amendments to existing ones.\n\nSMEs have long been neglected in the country despite their significant contribution, accounting for nearly 80 per cent of employment in the non-agricultural sector and 40pc of the country’s GDP.\n\nOnly around 6pc of total bank credit currently goes to the sector, highlighting the disconnect between its economic importance and financial access.\n\nSBP overhauling prudential regulations to boost lending to small, medium firms\n\nThe SBP’s latest reforms come at a time when Pakistan faces a severe employment crisis, with a three-year average GDP growth rate of just 1.7pc — insufficient to generate new jobs for the growing population.\n\nWith nearly five million SMEs operating nationwide, the sector is seen as a vital engine for economic growth, job creation and export expansion.\n\n“The review is also to encourage banks to leverage technology, and foster partnerships with fintechs and other non-financial service providers to better serve the financing needs of the SMEs,” the SBP said in its statement.\n\nThe SBP had earlier directed all banks in February 2025 to develop greater financing avenues for SMEs. The decline in interest rates from 22pc to 11pc in FY25 is expected to ease lending conditions, potentially improving banks’ willingness to finance SMEs.\n\nSMEs also play a crucial role in Pakistan’s external sector, contributing around 25pc of total exports. The government has set a target to boost exports to $60 billion over the next five years, a goal that heavily depends on the capacity and growth of SMEs.\n\nThe State Bank has uploaded the review for public consultation and stated that the feedback will help it further align the prudential regulations for SME finance with market dynamics.\n\nEarlier, the banking association had decided to gather data from the market to develop the SME Index within a year. The association believes the index would enable banks to make decisions on ramping up lending to enterprises.\n\nThe SBP said it aims to significantly boost SME financing as part of its Vision 2028. The central bank is targeting to double SME financing to Rs 1.1 trillion over the next five years.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:47:36.738Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915758/reforms-launched-to-ease-funding-barriers-for-smes",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T04:29:26.000Z"
}
