{
  "title": "Misogyny pandemic - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAST week, local and international media reported that the passing of a parliamentary bill to ban underage child marriages in Islamabad was a rare public relations victory for Pakistan. Yes, progressive legislation rarely gets implemented by a state apparatus that protects the patriarchal status quo. But symbolic victories matter, nonetheless.\n\nEven before being signed into law, the bill was attacked by the religious right. In the aftermath of its passing, prominent clerics, including Maulana Fazlur Rahman, announced that they would launch street protests against it. Patriarchs rule the land. This much was already known. But what little silver lining was provided by the Child Marriage Restraint Act was wiped out by the news that a young Chitrali girl, Sana Yousaf, 17, had been shot in broad daylight in the capital by a man whose advances she had rejected.\n\nWhat followed confirms the misogyny pandemic in Pakistani society. Sana Yousaf was something of an internet celebrity, with substantial followings on TikTok and Instagram. In death, she was slandered relentlessly online by men, and even women, for the ostensibly ‘lurid’ social media posts that led to her own demise. A vocal minority pushed back, but there can be no denying that Pakistani patriarchy is both extremely repressed and repeatedly produces lethal outcomes for women, girls, trans persons, as well as boys and some young men.\n\nAmong other things, sexual abuse is rampant amongst those who pose as moral guardians. Reports about clerics being caught beating and abusing boys are incredibly common. There is a parallel here with the decades of abuse within the Catholic Church. But the Catholic clergy — or at least segments of it — have acknowledged the need for internal reform. Pakistan’s clergy largely defends the patriarchal status quo.\n\nThe crisis of patriarchal violence is not limited to Pakistan\n\nThen there is domestic violence, which, by some counts, is prevalent in as many as two-thirds of Pakistani homes. Rich men do it because it reinforces the power they exercise in all realms of public life. Poor men do it because it is in their homes that they can vent their rage against the brutalisation to which capitalism and colonial statecraft subjects them. This is what we must all confront, especially men — that capitalism, colonial statecraft and patriarchy constitute the interdependent nodes of a structure of power that has deep societal roots. This structure cannot be dismantled unless there is conscious collective action that combines both an analysis of the hydra-headed monster and a strategic vision that unites all those who seek to upend it.\n\nSana Yousaf was amongst the exceptional young women/ girls that use social media platforms to articulate a digital self that challenges patriarchal norms. But it is telling that it is on the same platforms that she was slandered after her death. There is, as many have pointed out, no moral problem with being a ‘TikToker’ per se. The problem is that platform capitalism militates against anti-systemic change and promotes hateful herd behaviour.\n\nTo take another contemporaneous example: the establishment and its ideologues are now telling us that the young Baloch women who are spearheading an historic and peaceful movement against state repression are proxies for ‘enemy’ countries. The fact that women in a heavily male-dominated social context have become popular leaders should be celebrated. But such developments will never be tolerated, let alone encouraged, so long as colonial statecraft remains the modus operandi. More generally, militarism and other forms of political violence and the dispossession that it entails disproportionately affects women and girls.\n\nWhich reminds us that the crisis of patriarchal violence is not limited to Pakistan. Wars are proliferating around the globe, as is the targeting of women and girls. This is happening while so-called ‘pink’ feminism is being propagated in places like the occupied Palestinian territories, where individual agency of Zionists is celebrated alongside genocidal violence.\n\nThen there is the fact that outright sexist right-wing leaders are in power in many parts of the world. Donald Trump has allegedly molested and harassed women over the course of many decades — and is celebrated by his social base for doing so. Here in Pakistan, then prime minister Imran Khan suggested that women become targets for sexual violence because of their suggestive clothing.\n\nIn the final analysis, the misogyny pandemic will only be transcended when men become active agents of transformation, rather than react egotistically on the basis of fragile, constructed masculinities. It is only then that women, men and people of all genders can ensure life and liberty for girls like Sana Yousaf, and indeed for our entire society and world.\n\nThe writer teaches at Quaid-i-Azam University, Islamabad.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6842655146e50.jpg",
  "retrievedAt": "2025-08-20T03:47:49.253Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915733/misogyny-pandemic",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T03:50:26.000Z"
}
