{
  "title": "Special prayer for Palestinians in Haj sermon - World - DAWN.COM",
  "author": null,
  "content": "MOUNT ARAFAT: The Imam and Khateeb of the Grand Mosque, Sheikh Saleh bin Abdullah bin Humaid, in his Haj sermon delivered from Masjid-i-Nimrah on Thursday covered a host of issues facing the Ummah, particularly seeking Allah’s blessings and mercy for the oppressed people of Palestine.\n\nAddressing pilgrims gathered for the pinnacle of Haj, Dr Humaid emphasised the profound spiritual and unifying significance of the Day of Arafah and urged Muslims around the world to uphold the true essence of Islam through faith, humility, and sincere devotion to Allah.\n\n“Oh Allah, take care of our brothers and sisters in Palestine. Feed the hungry among them, shelter the displaced. Grant security to the fearful and protect them from their enemies,” he prayed.\n\nDuring the high point of the pilgrimage, Muslims prayed on Mount Arafat as authorities urged them to avoid the hottest hours of the day.\n\nOver 1.6m brave extreme heat to perform pilgrimage\n\nThousands of white-robed pilgrims recited verses from the Holy Quran from dawn on the 70-metre rocky rise near Makkah.\n\nBut numbers thinned by midday following official warnings for pilgrims to stay inside between 10am and 4pm.\n\n“I came here early to (avoid) the sun and later I will pray inside my tent,” said 54-year-old Adel Ismail, from Syria.\n\nSaudi authorities have taken several steps to reduce the risk from heat at the Haj, which has drawn more than 1.6 million pilgrims to one of the world’s hottest regions, according to fresh figures published on Thursday.\n\nBarring a few years of Covid restrictions from 2020-2022, this Haj season has recorded the lowest number of pilgrims in over three decades.\n\nOn Thursday, icepacks were handed to people walking towards Mount Arafat, with some placing the small bags on their heads.\n\nWith temperatures reaching 42C, officials ushered people away if they spent too long in one place near the bouldered hill, which had fans spraying mist and cool air at its foot.\n\nTowards Muzdalifah\n\nLater in the afternoon, pilgrims began making their way to Muzdalifah, halfway between Arafat and the sprawling tent city of Mina, where they will gather pebbles for Friday’s symbolic “stoning of the devil”.\n\nDespite the heat, they were generally delighted to be performing the Haj. “I don’t think about the sun or the temperature or anything like that,” said Ahmed, a 44-year-old from Egypt.\n\n“Because standing in Arafat is a great thing and a beautiful day, and as you can see, all the pilgrims” are doing it.\n\nAli, 33, from Pakistan, said he felt blessed to take part.\n\n“This is something that I used to see every year on the TV screen during Haj and I always thought: ‘I wish I could be here’,” he said.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/0608062790c41fe.png",
  "retrievedAt": "2025-08-20T03:47:52.897Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915705/special-prayer-for-palestinians-in-haj-sermon",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T02:57:23.000Z"
}
