{
  "title": "Missing toddler found murdered in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: A toddler who went missing while playing in the street was found dead in a sewerage line in Ratta Amral on Thursday, allegedly murdered by a boy, a close relative of the little girl.\n\nMaryam, one-year-old girl, while playing outside her house in Mohalla Qazian Ratta Amral with other children, went missing.\n\nAfter the disappearance, Maryam’s parents started a search for her, but failing to find clues, her grandmother, Ms Musarat Bibi, sought police help and registered a case under the relevant section of the law.\n\nDuring the search, the missing girl’s body was found in the main sewerage line of Dhoke Ratta on Thursday. The local police reached the spot and shifted the body to the District Headquarters Hospital for post-mortem. An investigation launched to ascertain the facts behind the tragic death of the little girl.\n\nLater on, police arrested the accused, who was identified as Azan Sultan, 10 and a half years old, and lived in the same house. The accused boy was shifted to the protection bureau by the local court.\n\nDuring the initial investigation, the accused revealed that he had picked up the girl and put her head in the sewerage line water, which claimed her life. The police investigating officer said while quoting the accused as: “I didn’t like her.”\n\nPolice said that the CCTV footage helped the police to trace the accused as he could be seen picking up the girl from the street and taking her away. The girl’s body was handed over to her parents after the postmortem.\n\nThe girl’s father was an employee in the cantonment board. The father of the accused is an addict, as his mother had left his house and resided with her parents.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:48:05.132Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915699/missing-toddler-found-murdered-in-rawalpindi",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T02:47:15.000Z"
}
