{
  "title": "PMD forecasts hot, humid weather during Eid - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Citizens should brace for sweltering heat during Eidul Azha as the Pakistan Meteorological Department (PMD) has issued a countrywide heatwave alert.\n\nAccording to the advisory, a high-pressure weather system is likely to develop over the country on June 7 and is expected to grip most parts from June 8.\n\nUnder the influence of these meteorological conditions, daytime temperatures are likely to remain 5 to 7 degrees Celsius above normal in central and upper Punjab, Islamabad, Khyber Pakhtun­khwa, Azad Kashmir and Gilgit-Baltistan from June 7 to 12.\n\nIn upper and central Sindh, southern Punjab and parts of Balochistan, daytime temperatures are likely to remain 04 to 06°C above normal from June 7 to 12.\n\nAdvisory urges citizens to avoid exposure to direct sunlight\n\nDust storms and gusty winds are also expected over the plains due to excessive heat.\n\n“Rising temperatures in northern areas may enhance snow-melting rate during the forecast period,” the advisory stated.\n\nThe PMD has advised citizens, especially children, women and older people, to take precautionary measures — avoid exposure to direct sunlight during the daytime and stay hydrated.\n\nFarmers have been advised to manage their crop activities as per the forecast.\n\nThe PMD has warned the authorities to remain alert and take necessary measures to avoid any mishap due to severe heatwave conditions.\n\nThe heatwave advisory was issued a day after PMD officials informed a high-level meeting that temperatures were already above normal in Gilgit-Baltis­tan and were forecast to remain so in the days ahead, resulting in above-normal snowmelt.\n\nThe annual flood preparation meeting of the federal and provincial governments on Wednesday was told that there could be higher and repeated chances of glacial lake outburst flood during the monsoon season.\n\nRainfall was also projected to be higher than normal across the country, particularly in the northern parts of Azad Jammu and Kashmir, GB, Potohar and parts of KP.\n\nThere could be an increased frequency of all-weather events, including severe thunderstorms and hailstorms.\n\nAn official statement issued after the meeting said the PMD has “forecasted normal to slightly above-normal rainfall across central and southern Pakistan from July to September”.\n\nMeanwhile, excess rainfall was also expected in northeastern Punjab and Kashmir, while northern KP and GB may experience “normal to below-normal rainfall”.\n\nIll-prepared healthcare system\n\nLast month, the National Institute of Health (NIH) issued a heatstroke advisory and urged public and private sector hospitals to make arrangements.\n\nThe country is experiencing severe climate changes due to global warming, resulting in increased morbidity and mortality due to heat stroke, the NIH added.\n\nIt called for immediate measures to prevent and treat heat-related illnesses.\n\nThe World Health Organisation has highlighted the impact of climate change on human health, including increased frequency and severity of heatwaves.\n\nPakistan has experienced severe heat waves in recent years, resulting in significant morbidity and mortality.\n\nThe country’s healthcare system faces challenges in responding to these events, particularly in rural and underserved areas, said the NIH.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:27:50.120Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915711/pmd-forecasts-hot-humid-weather-during-eid",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T03:07:28.000Z"
}
