{
  "title": "India’s Modi arrives in held Kashmir to open strategic railway - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi arrived in Indian-held Kashmir on Friday, his first visit to the contested Himalayan region since a conflict with arch-rival Pakistan last month, and opened a strategic railway line.\n\nModi is launching a string of projects worth billions of dollars for the occupied Muslim-majority territory.\n\nIndia and Pakistan fought an intense four-day conflict last month over an attack in Occupied Kashmir’s Pehalgam, with New Delhi blaming Islamabad without evidence. This was the two countries’ worst standoff since 1999, before a ceasefire was agreed on May 10.\n\nHis office broadcast images of Modi at a viewing point for the Chenab Bridge, a 1,315-metre-long (4,314-foot-long) steel and concrete span that connects two mountains with an arch 359 metres above the river below.\n\n“In addition to being an extraordinary feat of architecture, the Chenab Rail Bridge will improve connectivity,” the Hindu nationalist leader said in a social media post ahead of his visit.\n\nModi strode across the bridge waving a giant Indian flag to formally declare it open for rail traffic soon after his arrival.\n\nNew Delhi calls the Chenab span the “world’s highest railway arch bridge”. While several road and pipeline bridges are higher, Guinness World Records confirmed that Chenab trumps the previous highest railway bridge, the Najiehe in China.\n\nThe new 272-kilometre (169-mile) Udhampur-Srinagar-Baramulla railway, with 36 tunnels and 943 bridges, has been constructed “aiming to transform regional mobility and driving socio-economic integration”, Modi’s office says.\n\nThe bridge will facilitate the movement of people and goods, as well as troops, that was previously possible only via treacherous mountain roads and by air.\n\nThe railway “ensures all weather connectivity” and will “boost spiritual tourism and create livelihood opportunities”, Modi said.\n\nThe railway line is expected to halve the travel time between the town of Katra in the Hindu-majority Jammu region and Srinagar, the main city in Muslim-majority held Kashmir, to around three hours.\n\nMore than 70 people were killed in missile, drone and artillery fire during last month’s conflict.\n\nFighters in Indian-held Kashmir have waged a 35-year-long insurgency demanding independence for the territory or its merger with Pakistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/0612570416b83a8.png",
  "retrievedAt": "2025-08-20T03:47:34.025Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915806/indias-modi-arrives-in-held-kashmir-to-open-strategic-railway",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T08:07:19.000Z"
}
