{
  "title": "Sabalenka downs Swiatek as Gauff ends Boisson’s dream run at French Open - Sport - DAWN.COM",
  "author": null,
  "content": "PARIS: Aryna Sabalenka ended Iga Swiatek’s French Open reign with a devastating third-set performance on Thursday to tee up a Roland Garros final against Coco Gauff after the American knocked out French hero Lois Boisson.\n\nThe Belarusian snapped Swi­atek’s French Open winning streak at 26 matches with a 7-6 (7/1), 4-6, 6-0 success to reach her first final in the clay-court Grand Slam.\n\n“Iga is the toughest opponent, especially on the clay and at Roland Garros,” said Sabalenka after becoming the first player to defeat Swiatek in a deciding set at the French Open. “I’m proud that I was able to get this win.”\n\nWorld number two Gauff ended the dream run of 361st-ranked wildcard Boisson with a 6-1, 6-2 victory in the second semi-final on Court Philippe Chatrier.\n\nGauff and Sabalenka are level at 5-5 in their head-to-head record and have won one each of their two meetings at major tournaments.\n\nSabalenka edged a topsy-turvy first set that featured eight breaks of serve in a tie-break, before Swiatek hit back to level the match.\n\nThe finale turned out to be a complete anti-climax, as Swiatek made 12 unforced errors in the third set and won only six points.\n\n“I’m glad that I found my serve. It was a bit easier with the serve,” added the 27-year-old Sabalenka. “What can I say, 6-0 — it couldn’t be much more perfect than that!”\n\nSabalenka is targeting a fourth Grand Slam title and first not on hard courts, after winning last yea­r’s US Open and the Australian Open back-to-back in 2023 and 2024.\n\nSwiatek has still not reached a WTA final since lifting the Coupe Suzanne Lenglen 12 months ago.\n\nShe showed signs of a revival on the Paris clay where she has dominated since winning as a teenager in 2020, but her game deserted her in the deciding set as she slipped to only the third French Open defeat of her career.\n\n“I love playing here, so for sure I’m happy that I was fortunate enough to play so many great tournaments here,” Swiatek said.\n\nSabalenka has now won their last two meetings, and five of 13 in total.\n\nThis was the first time the pair, the dominant players in women’s tennis of the past few years, have gone head-to-head at a Grand Slam tournament since Swiatek’s win in the 2022 US Open semi-finals en route to the title.\n\nSabalenka will be the favourite to lift the trophy when she takes on Gauff, to whom she lost in the 2023 US Open final.\n\nSwiatek, who was bidding to become the first woman to win four successive French Opens in over a century, will drop to seventh in the world rankings next week.\n\nBoisson had got the better of third seed Jessica Pegula and world number six Mirra Andreeva in the previous two rounds but the test provided by Gauff proved to be a step too far.\n\nThe home crowd were silenced by a ruthless opening set from the second seed.\n\nBoisson briefly raised the French fans from their slumber by breaking back in the second set, only to immediately surrender it straight back.\n\nGauff clinically finished the job after just 69 minutes on court to book her spot in a second French Open final.\n\n“When you guys were chanting her name, I was thinking my name,” Gauff told the crowd in her on-court interview. “Obviously there’s still a lot of work to do, but for now I’ll enjoy this one and then prepare for the final tomorrow.”\n\nBoisson had been hoping to become only the second Frenc­hwoman to win the title in the Open era after Mary Pierce, but went out in a blaze of 33 unforced errors.\n\nERRANI, VAVASSORI WIN MIXED DOUBLES TITLE\n\nEarlier at the Philippe Chatrier, Sara Errani and Andrea Vavassori of Italy swept to a 6-4, 6-2 victory over Americans Taylor Townsend and Evan King to claim the mixed doubles crown.\n\nErrani and Vavassori claimed their second mixed doubles Grand Slam crown, with the first coming at the US Open last year where they also defeated Townsend and her longtime former partner Donald Young.\n\nThe title was a seventh overall in Grand Slam doubles for Errani, who also has five women’s doubles Grand Slam victories.\n\nErrani will also play in the women’s doubles semi-finals alongside Jasmine Paolini on Friday.\n\nThe Italian duo were tested early in the first set but saved two breakpoints to secure a tight hold at 1-1, before grabbing the decisive break and taking a 4-3 lead when Townsend sent a forehand wide.\n\nErrani and Vavassori dialled up the intensity to overwhelm their opponents, twice breaking serve in the second set before Townsend netted a volley to give the third seeds a dominant win.\n\nDJOKOVIC BOOKS SINNER SEMI-FINAL SHOWDOWN\n\nIn Wednesday’s night session, Novak Djokovic fought back to beat Alexander Zverev on Wednesday and set up a blockbuster semi-final meeting with world number one Jannik Sinner.\n\nThe 38-year-old Djokovic defied his advancing years despite losing a tight first set to German third seed Zverev, continuing his bid for a record-breaking 25th Grand Slam singles title with a 4-6, 6-3, 6-2, 6-4 victory under the lights on Court Philippe Chatrier.\n\nVictory after three hours and 17 minutes was the Serbian’s 101st win at Roland Garros but he had to draw from his seemingly endless reserves of energy and experience to prevail.\n\n“There was a lot of tension, pressure but it’s normal when you play Zverev, one of the best in the world, in the last five-six years,” said the sixth seed. “My game is based on a lot of running. I’m 38, it’s not easy to keep running like that but, OK, it works. Matches like this is one of the reasons I carry on playing and I love the competition.”\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68427fafda06b.jpg",
  "retrievedAt": "2025-08-20T03:47:35.921Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915793/sabalenka-downs-swiatek-as-gauff-ends-boissons-dream-run-at-french-open",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T05:38:39.000Z"
}
