{
  "title": "HRCP calls for living wage amid soaring costs - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A monthly income of over Rs75,000 is now required to support a family of six with basic necessities such as food, housing, utilities, healthcare and education, according to the Human Rights Commission of Pakistan (HRCP).\n\nAs the government prepares to announce the federal budget, the HRCP has urged that wages must reflect the principle that “full-time workers should be able to live with security, health and hope.”\n\nIn its latest report titled ‘From Survival to Dignity: The Case for a Living Wage’, the HRCP argues for the implementation of a living wage rather than a minimum wage. It noted that millions of workers across the country earn far below the living wage threshold, which forces them to make impossible choices between feeding their families and paying for essentials like electricity and medicine.\n\n“The implementation of a living wage can be justified on many grou­n­­ds,” the report said. “From a human rights perspective, a living wage becomes a fundamental right to ensure that workers not only meet their basic needs but are also able to live a life of dignity. The Universal Declaration of Human Rights provides the basis for a living wage for every worker.”\n\nSays workers deserve dignity, not just survival\n\nIt added, “Similarly, and most importantly, it allows us to address several Sustainable Development Goals (SDGs) set by the UN. For instance, implementing a living wage will directly contribute to the first two goals — no poverty and zero hunger and the advancement of decent work.”\n\nFurther, the UN Global Compact, a corporate sustainability initiative in which more than 100 companies from Pakistan participate, “encourages companies to promote and provide a living wage as an essential aspect of decent work.”\n\nA living wage is also about the dignity of individuals and their families while outlining employers’ responsibilities to their employees.\n\nAccording to the UNDP’s Human Development Index (HDI), Pakistan’s HDI value is 0.540, which classifies it as a country with low human development.\n\nWith an HDI rank of 164 out of 193 countries, Pakistan is only better than Afghanistan and Nepal in the region. Both Afghanistan and Nepal saw years of violence, which is not the case for Pakistan. Almost 40 per cent of Pakistanis live below the poverty line.\n\n“Years of neoliberal policies and reforms have made it difficult for governments to pursue policies that favour job creation. Free market reforms in trade and finance have adversely affected domestic industry and agriculture in developing countries,” the report said.\n\n“Moreover, people’s purchasing power in Pakistan has decreased significantly because of high inflation and slow economic growth. This, coupled with a high population growth rate and vulnerability to climate change, has left the successive governments in Pakistan ill-prepared to provide jobs to a growing number of young people,” it added.\n\nThe HRCP stressed that government action to bridge the gap between the current minimum wage and an actual living wage would be a significant step towards poverty alleviation and long-term social equity.\n\nPublished in Dawn, June 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:47:50.366Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915726/hrcp-calls-for-living-wage-amid-soaring-costs",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T03:37:41.000Z"
}
