{
  "title": "Presence of militant groups on Afghan soil poses significant challenge to regional security, says veteran journalist - Pakistan - DAWN.COM",
  "author": null,
  "content": "Veteran journalist and news director of the Associated Press for Afghanistan and Pakistan, Kathy Gannon on Friday said that the presence of various militant groups on Afghan soil posed a significant challenge to regional security.\n\nSpeaking at an event titled “Geopolitical Shifts and Security Challenges: Pakistan, Afghanistan, and the Regional Power Play” organised by the Institute of Regional Studies (IRS) in Islamabad, Gannon — who in 2014 was attacked and wounded while reporting from Afghanistan — said, “While Afghanistan might not want all the militant groups on its territory nor did Kabul invite them all, but they were still there.”\n\nAccording to a press release, Gannon emphasised the importance of restoring trust between Pakistan and Afghanistan, appreciating the recent positive developments in relations between the two neighbours. She said that “Pakistan could better influence the Afghan government by treating it as an equal and a partner in pursuing its regional objectives.”\n\n“She also urged Islamabad to take steps against all terrorist groups through a concerted long-term strategy to address its internal security challenges,” the press release said.\n\nGannon maintained that Afghanistan was still relevant to the US policymakers “because of the increasing Chinese influence in the country as well as its mineral wealth”.\n\nPakistan’s former Special Representative for Afghanistan Ambassador Asif Durrani referred to Pakistan and Afghanistan as twin brothers who had come to each other’s help whenever needed notwithstanding the state of their relationship at the time.\n\n“He hailed the upgradation of diplomatic relations between Pakistan and Afghanistan and the inclusion of Afghanistan in the China-Pakistan Economic Corridor (CPEC) as positive developments,” the press release said.\n\nDurrani said that in the recent high-level trilateral meeting between Pakistan, Afghanistan, and China, the three countries had agreed to oppose terrorism, carry out law enforcement and security cooperation, remain vigilant against external interference in the internal affairs of regional countries, and safeguard regional peace and security.\n\nHe was of the view that there had been a decline in terrorist attacks in Pakistan since the positive development in diplomatic relations between Pakistan and Afghanistan, the press release said.\n\n“President IRS Ambassador Jauhar Saleem said that despite challenges, regional geopolitics and mutual interests had continually pushed both countries to engage and re-engage across various levels,” the press release said.\n\nSaleem added that recent developments pointed toward a more constructive phase in bilateral engagement and expressed his hope that the trilateral dialogue among Pakistan, Afghanistan, and China most recently held in Beijing would strengthen regional cooperation on counterterrorism, stability, and economic integration.\n\n“Aarish Khan, the Head of the Afghanistan Program at IRS, maintained that while the Taliban had not acceded to the demands of the international community on political inclusion, women’s education, and individual freedoms, they were still making good progress in improving diplomatic relations not only with important capitals like Beijing, Moscow, and Islamabad but also with the UN as was demonstrated by the Doha III talks last year,” the statement said.\n\nKhan said that the Afghan interim government had taken concrete steps against the TTP in the recent past.\n\nAmbassador Abrar Hussain, Pakistan’s former Ambassador to Afghanistan, also argued that Islamabad’s top priority in Afghanistan was to promote peace and stability notwithstanding whichever government was in power in the country.\n\nLast month, Pakistan announced its elevation of diplomatic representation in Afghanistan from Charge d’Affaires to Ambassador level as bilateral ties “move on a positive trajectory.”\n\nPakistan and Afghanistan agreed to upgrade their diplomatic relations by exchanging envoys — a key step towards normalising ties after years of strained relations between Islamabad and the Taliban administration in Kabul.\n\nTies between the two neighbouring countries had turned sour due to frequent border skirmishes and Islamabad repeatedly demanding that Kabul take action against the banned Tehreek-i-Taliban Pakistan (TTP) for using Afghan soil to launch attacks in Pakistan. Kabul has denied the allegations.\n\nThe recent understanding was reached during an informal trilateral meeting of foreign ministers from Pakistan, China, and Afghanistan in Beijing earlier this month. Deputy Prime Minister and Foreign Minister Ishaq Dar met Afghanistan’s interim Foreign Minister Amir Khan Muttaqi in the Chinese capital.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/06170534add9894.jpg",
  "retrievedAt": "2025-08-20T03:47:32.894Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915820/presence-of-militant-groups-on-afghan-soil-poses-significant-challenge-to-regional-security-says-veteran-journalist",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T13:11:46.000Z"
}
