{
  "title": "Fact check: Nacta threat alert of Karachi terror attack on Eidul Azha is fake - Pakistan - DAWN.COM",
  "author": null,
  "content": "Posts on social media platforms X and Facebook since Wednesday were sharing an alleged threat alert from the National Counter Terrorism Authority (Nacta) of a possible terror attack in Karachi during Eidul Azha. However, the threat alert is fake.\n\nOn Wednesday, a post on X by a user claimed that Nacta had issued a threat alert on the same date regarding a possible terrorist attack in Karachi during Eidul Azha.\n\nThe caption of the post said: “Intelligence warns of a potential terrorist attack in Karachi during Eidul Azha. Law enforcement on high alert. Citizens urged to stay vigilant and report anything suspicious.”\n\nThe same notification was circulated by other users as well as can be seen here, here, here and here.\n\nIt was also widely shared on Facebook, as seen here and here, and circulated in various WhatsApp groups.\n\nA fact-check was initiated to determine the veracity of the claim given its close proximity to the upcoming holiday and its potential to cause undue worry and panic in the public.\n\nAnalysing the document using multiple image analysis tools showed that Hive Moderation indicated a 98.6 per cent likelihood that the image was AI-generated, Decopy.ai reported a 61pc likelihood and Fake Image Detector concluded that the document was likely computer-generated or digitally altered.\n\nEvaluating the text of the notification using Decopy.ai, a detection tool for AI-generated text, indicated a 31pc probability that the text was AI-generated.\n\nA close examination of the alleged alert identified several discrepancies.\n\nNotably, the word “Pakistan” at the top of the document is written with unnecessary spacing between “Pak” and “istan”. The phrase “In an emerged” is grammatically incorrect; it should be “It has emerged”. The word “unidetified” is a misspelling of “unidentified”. Additionally, the phrase “during Eidul Azha” is repeated.\n\nIn the first bullet point, “vitali” is written instead of “vital” and “vigllance” instead of “vigilance”.\n\nIn the second point, the word “ani” is written instead of “and”.\n\nTowards the end of the document, the phrase “Alwan-e-Sadr” appears instead of the correct term “Aiwan-e-Sadr”. Furthermore, the names of several cities are misspelled in the alleged notification: “Islamnabad” instead of “Islamabad”, “Rawapidi” instead of “Rawalpindi” and “Paahawar” instead of “Peshawar”.\n\nA keyword search for “National Counter Terrorism Authority”, “threat alert”, “Karachi” and “Eidul Azha” yielded no news reports from any credible news outlet covering the alleged alert.\n\nContacted for comment, Qadir Yar Tiwana, director general of media at the interior ministry, confirmed the alleged alert was fake.\n\nThe same was confirmed by a Nacta representative when contacted on the authority’s official landline number (051-9216574).\n\nTherefore, the fact-check determined that the claim that Nacta issued a terror alert for Karachi during Eidul Azha is false. The alleged alert is fake.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/051225414d093ab.jpg",
  "retrievedAt": "2025-08-20T03:47:32.642Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915600/fact-check-nacta-threat-alert-of-karachi-terror-attack-on-eidul-azha-is-fake",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T14:05:29.000Z"
}
