{
  "title": "Senate body visits PIMS to inspect facilities being provided to patients",
  "link": "https://www.app.com.pk/national/senate-body-visits-pims-to-inspect-facilities-being-provided-to-patients/",
  "date_published": "2022-09-12T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP):The members of Senate Standing Committee on National Health Services, Regulations and Coordination led by Chairman of the Committee Senator Dr. Muhammad Humayun Mohmand on Monday visited Pakistan Institute of Medical Sciences (PIMS) and inspected the health facilities being provided to general public in different departments including Cardiac, Child Care, Mother and Child Care ward, OPD and Dermatology.\nThe members remarked that the facilities provided in hospital were not up to standard and advised the heads of various departments to submit list of problems, hurdles faced by them so that the Committee could help the administration of hospital in resolving it.\nThey also visited the construction site of the project ‘200 Bed Emergency’ which currently consists of 160 bed to be completed in 2024.\nDean of PIMS Dr. Rizwan Taj, apprised the Committee that the population of Islamabad was on the rise and there was dire need to build emergency blocks in different hospitals on the model of the project to cater the health needs of the city.\nThe Committee was apprised that the Endoscopic equipment had also been procured and due to lack of trained staff and insufficient funds, it could not be made functional.\nWhile deliberating on the dentistry facility of the hospital, the Senate body was told that outdoor facility was functional which provided treatment to public at minimal cost.\nSenator Bahramand Khan Tangi stated that the dentistry facility should be made free for general masses. Officials of PIMS informed that Dentistry is paid even in Military hospitals and fee charged at PIMS is nothing compared to what private hospitals charge. The Chair directed the officials to submit details of charges to the Committee.\nMatter of vacant posts in PIMS hospital were also discussed. Senator Bahramand Khan Tangi informed that 780 posts were vacant and in order to enhance the performance of hospital, these posts must be filled. Senator Dr. Muhammad Humayun Mohmand directed the officials to expedite the recruitment process on the vacant posts.\nSenators Fawzia Arshad, Sana Jamali, Rubina Khalid, Bahramand Tangi, Sardar Muhammad Shafiq Tareen, Secretary Ministry of National Health Services, Regulations and Coordination (NHSRC) Mirza Nasir ud din Mashhood Ahmad, Dean PIMS Hospital Dr. Rizwan Taj and other seniors doctors of different departments were present on the occasion.",
  "retrievedAt": "2025-08-11T15:33:46.984Z"
}
