{
  "title": "Young Pakistani win award at European Symposium",
  "link": "https://www.app.com.pk/national/young-pakistani-win-award-at-european-symposium/",
  "date_published": "2022-09-12T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP): A young Pakistani won the Young Scientist Award for Best Oral Presentation at the 1st European Symposium on Phytochemicals in Medicine and food (1-EuSPMF) held in Belgrade, Serbia recently.\nEuSPMF, held on September 07, aims to review the recent progress in the area of phytochemicals; and their implementation in medicine and food.\nIt is organized by the International Association of Dietetic Nutrition and Safety (IADNS)\nand the Institute of Food Technology and Biochemistry of the Faculty of Agriculture, University of Belgrade, and supported by the Serbian Chemical Society, and the Phytochemical Society of Europe (PSE).\nThe demand for high-quality food products, that have beneficial effects on human health, encourages researchers to intensively study natural products.\nIn light of this, scientists belonging to various fields (from 18 countries) were welcomed to present their latest research and provide an excellent platform for exchanging ideas, discussing challenges, and setting up new research collaborations.\nThe young Pakistani, Dr. Hammad Ullah, belonging to Manki which is a small village in KP, presented his work in national and international conferences and is the 1st recipient of Young Scientist Award for Best Oral Presentation on 1st European Symposium on Phytochemicals in Medicine and food (1-EuSPMF).\nHe got his doctorate from Kohat University of Science and Technology in PharmD and then went on to achieve his M.Phil degree in Pharmaceutical sciences in 2019, whereafter he was offered an admission for Ph.D studies in Department of Pharmacy, University of Naples Federico II Italy, with a fully funded scholarship.\nCurrently he is working as a visiting researcher at the Department of Analytical and Food Chemistry University of Vigo Spain.\nDr. Hammad is a regular member of the Royal Society of Chemistry (MRSC), International Natural Product Sciences Taskforce (INPST), Phytochemical Society of Europe (PSE), and IUPHAR Mediterranean Group of Natural Products Pharmacology. He aims to return to Pakistan with his vast research in the subject and serve the country through boosting our agrarian economy and creating resilience against climate change.",
  "retrievedAt": "2025-08-11T15:33:51.303Z"
}
