{
  "title": "Country’s development depends on quality of education: Sajid Turi",
  "link": "https://www.app.com.pk/national/countrys-development-depends-on-quality-of-education-sajid-turi/",
  "date_published": "2022-09-12T15:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP): Federal Minister for Overseas Pakistanis and Human Resource Development Sajid Hussain Turi on Monday said that development of any country was directly linked with education, and that all the schools managed by Workers Welfare Fund would be upgraded to improve the quality of education.\nHe made these remarks during his visit to the Working Folk Grammar School No. 1 and No. 2, Kohat where he inaugurated and announced many development and welfare projects, including a NADRA center, said a press release.\nThe minister said all schools would be upgraded while residential colonies would be built for private industry workers as per the wishes of Bilawal Bhutto Zardari, who wanted a house for every worker. The workers colonies would also include craft centers to empower women by making them learn technical skills.\nTuri was also accompanied by Information Secretary and Member Provincial Assembly Amjad Afridi.\nDuring the visit, school principals and teachers briefed the minister, who personally visited the classrooms and mingled with the students and heard their problems.\nTuri said the government would extend the best health and education opportunities to families and children of workers, while talented ones would be admitted to the best colleges and universities of the country, and would also be given a regular stipend.\nHe also assured that withheld stipends of the children during the previous government would be paid without any further delay.\nThe minister said owing to the ongoing energy crisis and power outage, schools were being solarized to ensure continuous power supply.\nHe also announced the construction of a 25-bed hospital for industrial laborers and workers in Kohat’s constituency PK 80, saying that health and education related problems of the residents would be resolved on priority basis.\nTuri, along with Senator Shamim Afridi also inaugurated a NADRA center in Ghambat area of Kohat district.\nThe minister also visited the Overseas Pakistanis Public School in Hangu, and said that overseas Pakistanis were the backbone of the country’s economy owing to their inward foreign remittances. He said special attention would be paid to the education of children of overseas Pakistanis.",
  "retrievedAt": "2025-08-11T15:33:44.732Z"
}
