{
  "title": "Over 45 mln children receive anti-polio drops",
  "author": null,
  "content": "ISLAMABAD, Feb 09 (APP):The Ministry of Health on Sunday said that more than 45 million children have been vaccinated during the National Polio Immunization Campaign.\nAccording to officials of the Ministry of Health, this was the first national polio vaccination drive of year 2025 during which polio drops were given to children under five years of age.\nThey said that during this national Polio vaccination campaign, more than 400,000 trained polio workers visited door to door to perform their services.\nPrime Minister’s Coordinator for Health Dr Mukhtar Bharath requested the parents to fully support the polio workers and give their children polio drops during every immunization drive.\nHe said that it is the national and moral responsibility of parents to give polio vaccine to all children under five years of age.\nDr Mukhtar Bharath said that complete eradication of polio from Pakistan is the first national priority of the government.\nHe said that the personal interest of the Prime Minister of Pakistan to make the country free from Polio is a reflection of the government’s commitment to eradicate polio.\nHe said that under the leadership of the Prime Minister, this war against polio is going on with full force and consistency.\nHe said that coordination between the Polio Program and the Expanded Program on Immunization is being further strengthened\nHe said that effective and coordinated measures are being taken to improve routine immunization coverage across the country.\nDr Mukhtar Bharath said, “Our main objective is to protect children from polio and other deadly diseases.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:31:12.548Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/over-45-mln-children-receive-anti-polio-drops/",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T18:14:00.000Z"
}
