{
  "title": "PML-N govt ruined gas sector by establishing LNG terminals sans storage facilities: Nadeem",
  "link": "https://www.app.com.pk/national/pml-n-govt-ruined-gas-sector-by-establishing-lng-terminals-sans-storage-facilities-nadeem/",
  "date_published": "2020-11-30T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): Special Assistant to the Prime Minister (SAPM) on Petroleum Nadeem Babar Monday said that the previous government of Pakistan Muslim League-Nawaz (PML-N) ruined gas sector by setting up two LNG terminals in haste under expensive agreements and that too without constructing storage facilities.\nAddressing a news conference along with Minister for Energy Omar Ayub Khan, he said contrary to the world-wide practice, the past government set up Liquefied Natural Gas (LNG) terminals sans storage facilities for a huge market like Pakistan.\n“Whenever LNG terminals are installed in any part of the world where Pakistan like gas infrastructure exists, storage facilitates are must be constructed there,” he said.\nThe SAPM said the LNG terminals were set up at fixed payment (take or pay method) at around $ 0.5 million per day, but remained reluctant to construct any storage, which eventually caused huge loss to national exchequer.\nHe said, since the PTI government came into power, there were nine such months during which only 800 Million Cubic Feet per Day (MMCFD) or less LNG was sold due to less demand from consumers.\n“It means that we have wasted a huge amount under half-a-million dollar per day contract, signed by the previous government.”\nSetting aside misleading figures given by a former prime minister [without taking name] in media, Nadeem Babar said for a 12-month period (January-December 2020), the government had purchased 19 spot cargoes on the average cost of around 22-25 million dollar per cargo, which stood around Rs 75-76 billion.\n“Our spot purchases are so beneficial that if all cargoes are obtained free of cost, even then the cargoes cost remains around Rs 75-76 billion.”\nHe rejected the misleading notion that the spot buying caused Rs 122 billion loss to the national kitty.\nThe SAPM explained that the spot market was always down during summer and high in winter as per the ‘market trend’ and .financial disciplines.’\nHe said if a cargo was available at 10 percent of the Brent in summer, but it would not be not be available in December at the same price. “Seller will quote projected cost of the Brent for six-month forward delivery. December price will not be available in summer.”\nNadeem Babar said during 1 September-2018 to 30 November-2020, the government had bought around 35 spot cargoes at average cost of 10.4 percent of the Brent, if it was compared with 13.37(as per the previous government’s expensive agreements) there was around $200 million savings.\nHe said the former prime minister had misled the public by giving distorted facts and figures about gas-sector circular debt, adding the PML-N government had left around Rs 300 billion circular debt.\nHe said the previous government did not increase the gas price for political gains during its five-year term, ignoring the tariff determined by the Oil and Gas Regulatory Authority (OGRA) from time to time which caused a huge loss to the national exchequer.\nHe said it was the Pakistan Tehreek-i-Insaf (PTI) government which had taken bold initiative in supreme national interest and increased the gas price twice, expressing the confidence that the old circular debt would be cleared gradually in the coming years.\nAnswering a question, the SAPM said he would never suggest setting up the LNG terminals as per the practice of previous government as it hurt national interest.\nThat’s why, he said, the PTI government, under its ease-of-doing strategy, was encouraging private sector to set up their own terminals and import LNG to compete the public sector companies and meet the consumers’ ever-growing demand.",
  "retrievedAt": "2025-08-11T20:04:47.574Z"
}
