{
  "title": "National COVID-19 positivity ratio surges to 8.53 percent, 2,046 COVID patients critical: NCOC",
  "link": "https://www.app.com.pk/national/national-covid-19-positivity-ratio-surges-to-8-53-percent-2046-covid-patients-critical-ncoc/",
  "date_published": "2020-11-30T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): The National Command and Operation Center (NCOC) on Monday was apprised that around 2,046 Coronavirus patients were in critical condition across Pakistan where the National COVID positivity ratio has surged to 8.53 percent with the disease trends showing rising trend.\nThe NCOC daily situational morning session was in progress with Federal Minister for Planning, Development and Special Initiatives Asad Umar in chair where Federal Minister for Industries and Production Hammad Azhar and Federal Minister for Energy and Petroleum Omar Ayub Khan were also present and provincial chief secretaries had joined the meeting through video link.\nThe health experts briefed the Forum on disease pattern, Covid spread in various areas and enforcement measures being taken to contain the pandemic risk.\nThe Forum was apprised on Smart Lockdown implementation where the entire Azad Jammu and Kashmir (AJK) was under lockdown till Dec 6th.\nAround 5,082 smart lockdowns were in place across Pakistan with 2,058,746 people were restricted under these lockdowns.\nIt was also informed that 1,459 smart lockdowns were in place in Punjab, 206 in Sindh, 182 in Khyber Pakhtunkhwa (KP), Islamabad Capital Territory (ICT) 3,205 and 30 smart lockdowns in Gilgit Baltistan (GB).\nThe National Positivity Ratio was 8.53 percent with the highest positivity ratio observed in Mirpur 27.75 percent followed by Muzafrabad 23.44 percent and Hyderabad 18.21 percent.\nAs many as 2,046 Covid patients were in critical condition across Pakistan where the number of critical patients was rapidly rising, the Forum was briefed.\nIt added that Punjabhad 467 patients in critical condition, the highest in Sindh 675, KPhad 356,Balochistan 16, ICT 323, AJK 23 and five in GB.\nThe positivity ratio in various federating units was as in AJK 21.3 percent, Balochistan 11.95 percent, GB 3.43 percent, ICT 6.62.30 percent, KP is 5.57 percent, Punjab 4.84 percent and Sindh 14.04 percent.\nThe recent province wise COVID Positivity Ratio was as of Punjab in Lahore it was 6.19 percent, Rawalpindi 4.83 percent, Faisalabad 3.14 percent, in Sindh, Karachi had17.95 percent, Hyderabad 18.21 percent, in KP, Peshawar had 18.09 percent, Swat 5.81 percent, Abbotabad 6.22 percent, in Balochistan, Quetta had 9.09 percent, in ICT positivity ratio was 6.62 percent, in AJK, Mirpur 27.75 percent and Muzaffarabad 23.44 percent and in GB, Gilgit had 5.68 percent.\nA total of 278 COVID patients were on ventilators across Pakistan as in Punjab, Faisalaabad four patients were on ventilator, Lahore had 61, Multan had 41 and in Rawalpindi 26 patients were on ventilator.\nIn Sindh, there was no patient on ventilator in Hyderabad where Karachi had 61 patients on ventilator.\nIn KP, two patients were on ventilator in Abbotabad, Peshawar had 35 patients on ventilator, in Balochistan there was no patient on ventilator, in ICT 46 ventilators were occupied and in AJK there was no patient on ventilator in Mirpur whereas two patients were on ventilator in Muzaffarabad and no patient was on ventilator in GB.",
  "retrievedAt": "2025-08-11T20:04:53.584Z"
}
