{
  "title": "BRT Peshawar joins call for ending violence against women drive",
  "link": "https://www.app.com.pk/national/brt-peshawar-joins-call-for-ending-violence-against-women-drive/",
  "date_published": "2020-11-30T10:47:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 30 (APP): Peshawar Bus Rapid Transit (BRT) service Monday joined office of the Ombudsperson to promote a public service message against Sexual Harassment at Workplace in Peshawar.\nBRT service would promote awareness messages and sensitize passengers on the issue of harassment at public places and violence against women through buses and terminals.\nTo create awareness on the law for protection of women against harassment at public place, hundreds of posters on the Section 509 of Pakistan Penal Code were displayed in all the buses of the modern mass transit system.\nThe Section 509 says, “Whoever, intending to insult the modesty of any woman, utters any word, makes any sound or gesture, or exhibits any object, intending that such word or sound shall be heard, or that such gesture or object shall be seen, by such woman, or intrudes upon the privacy of such woman, shall be punished.”\nThis year’s 16 Days of Activism campaign is focusing on the emergence as the shadow pandemic of violence against women amid Covid-19.\nThe global theme “Fund, Respond, Prevent, Collect!”\nShah Muhammad Khan, Provincial Minister for Transport and Technical Education, was the Chief Guest of the event.\n“BRT Peshawar is a convenient and successful travel facility for citizens.\nMen and boys should avoid sitting on seats designated for women. Respecting women is a collective responsibility,” said Shah.\nRukhshanda Naz, ombudsperson KP, said “The objective of this activity is to increase awareness of general public on the Section 509 of Pakistan Penal Code and enhance their access to the services offered by ombudsperson Office.”\nAudio visuals messages, both in Urdu and Pashtu languages, will also be played on BRT terminals and in buses.\nThis initiative will help in warning the harassers about repercussion and give confidence to women passengers so that they feel safe and secure while using public transport.\n“Survivors, activists, decision-makers, the UN system, and people from all walks of life must collectively voice for funding for women organizations, essential services, and prevention from violence,” said Zainab Qaiser Khan, Head of Provincial Office UN Women in KP.\nShe said that ending violence against women is everyone’s responsibility, so including stakeholders like Transport Department shows the commitment of the government to fulfill the shared responsibility.\n“Safe transportation means freedom of mobility for women with comfort which contributes towards women empowerment. Empowered women not only raise voice for themselves but also for other vulnerable women,” she remarked.",
  "retrievedAt": "2025-08-11T20:04:53.554Z"
}
