{
  "title": "Pakistan trashes Indian MEA’s statement about OIC resolution on J&K dispute",
  "link": "https://www.app.com.pk/national/pakistan-trashes-indian-meas-statement-about-oic-resolution-on-jk-dispute/",
  "date_published": "2020-11-30T18:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): Pakistan on Monday rejected the untenable statement by the Indian Ministry of External Affairs (MEA) on the Organization of Islamic Cooperation’s (OIC) resolution on Jammu and Kashmir dispute.\n“The resolution was unanimously adopted at the 47th Session of OIC Council of Foreign Ministers (CFM), held in Niamey, Niger, on 28 November 2020.The OIC is collective voice of the Muslim Ummah and the second largest international organization after the United Nations with 57 members and five observer states,” the Foreign Office spokesperson said in a press release.\nHe said the Jammu & Kashmir was one of the oldest internationally recognized disputes on the agenda of the United Nations Security Council (UNSC), which remained unresolved because of India’s intransigence and unwillingness to implement the relevant UNSC resolutions and its own solemn commitments made to Pakistan, the Kashmiris, and the international community.\n“The latest OIC resolution is another forceful repudiation of India’s completely flimsy and legally untenable contention that Jammu and Kashmir is its ‘internal’ matter.\nThe OIC resolution is further proof that India can neither hide its gross and systemic violations of human rights of the Kashmiri people and the denial of their inalienable right to self-determination nor can it escape international censure of its egregious behaviour,” the spokesperson added.\nRather than dismissing the international community’s concerns as reflected in the OIC resolution, the spokesperson said India would be well-advised to pay heed and stop its state-terrorism in the Indian Illegally Occupied Jammu and Kashmir (IIOJK); end its illegal and forcible occupation of the IIOJK; and take concrete steps towards solution of the Jammu & Kashmir dispute in accordance with the UN Security Council resolutions and the wishes of the Kashmiri people.",
  "retrievedAt": "2025-08-11T20:04:47.905Z"
}
