{
  "title": "Eastbay Expressway to be completed next year",
  "link": "https://www.app.com.pk/business/eastbay-expressway-to-be-completed-next-year/",
  "date_published": "2020-11-30T17:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): The Joint Working Group (JWG) on Gwadar under China Pakistan Economic Corridor (CPEC) was informed here on Monday that the Eastbay Expressway would be completed in 2021 and all pending issues had already been resolved on priority.\nThe Expressway will connect the port with the 2nd Phase of the Free Trade Zone (FTZ) which will facilitate the business climate of the zone and the port alike.\nThe 5th meeting of the committee was held through a video that was co-chaired by Secretary, Ministry of Planning, Development, and Special Initiatives (MoPD&SI), Mathar Niaz Rana from the Pakistan side and Director General, National Development and Reform Commission (NDRC), Ying Xiong, from the Chinese side.\nIn his opening remarks, Director General, NDRC said that the development of the Gwadar is a priority and will be pushed forward with vigor and zeal.\nThe Secretary, PD&SI acknowledged the continuous support extended by Chinese government for the development of Gwadar and assured the Chinese side of Pakistan’s unwavering commitment to accelerate the development projects in Gwadar.\nThe meeting reviewed the progress of projects in Gwadar. Both sides expressed satisfaction over the progress made in port development and Chinese side appreciated the support provided by Pakistan in the port operationalization particularly enabling the Afghan transit trade through Gwadar.\nIt was agreed that this step would greatly reduce the logistic cost and facilitate the transshipment trade.\nThe Chairman, CoPHCL explained the development of the port in detail and highlighted renewed interest of the entrepreneurs in investing in Gwadar port and Free Zone area.\nOther projects discussed included New Gwadar International Airport (NGIA) and M-8 Motorway for seamless connectivity of Gwadar with the rest of the country and beyond. The progress on the NGIA was noted with satisfaction.\nThe Chinese side appreciated progress on the Energy Project in Gwadar. The Power Purchase Agreement of 300 MW Coal Power Project was made as a deliverable for the forthcoming 10th Joint Coordination Committee (JCC).\nThe project upon completion will energize industry in Gwadar and will improve the social and economic well-being of the local community.\nOther projects in the social sector discussed during the meeting include Pak-China Friendship Hospital in Gwadar and Vocational & Technical Institute in Gwadar.\nThe Secretary, MoPD&SI highlighted that the hospital project is of vital importance for the people of Gwadar and needs to be expedited.\nThe Secretary suggested to expedite work for timely completion of the project. For the Vocational & Technical Institute, both sides agreed to push ahead create job opportunities for the youth.\nFor the development of Gwadar as a smart port city, it was reiterated that the provision of fresh water is of utmost importance. In this regard, the 1.2 MGD Desalination plant project was termed critical. Both sides agreed to take necessary measure to complete the project in time.\nThe dredging of Berthing Areas is important for large vessels to access the Gwadar port which will improve the operationally of the port.\nFor the construction of Breakwater, the timely completion of the project was stressed as a crucial intervention required for the fishermen community in Gwadar.\nThe Secretary, PD&SI proposed to divide the project in to two phases for better implementation of the project. DG, NDRC replied in affirmative and appreciated the idea.\nThe Secretary PD&SI also appreciated the projects under Corporate Social Responsibility including Fraternity Emergency Care Centre of the Red Crescent Society of China, Pak-China Faqeer Colony School and other initiatives of the China Overseas Port Holding Company.\nIn the end, the Secretary, PD&SI apprised about other social sector development projects, being undertaken by GoP under the Prime Minister’s development package for South Balochistan. The Director General, NDRC applauded the development package and reiterated China’s full support for the socio-economic well-being of the region.\nThe meeting was concluded with signing of the minutes along with finalization of the agreed deliverables of the JWG on Gwadar for the forthcoming 10th JCC.\nThe meeting was also attended by other senior officials of the M/o PD&SI, representatives of the Government of Balochistan, Civil Aviation Authority, Board of Investment, and Ministry of Maritime Affairs amongst others.",
  "retrievedAt": "2025-08-11T20:04:47.682Z"
}
