{
  "title": "CM directs authorities to complete Rwp Ring Road project by December",
  "link": "https://www.app.com.pk/national/cm-directs-authorities-to-complete-rwp-ring-road-project-by-december/",
  "date_published": "2024-02-29T10:02:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Feb 29 (APP): Chief Minister (CM) Punjab, Maryam Nawaz Sharif here on Thursday visited Rawalpindi Ring Road and directed the authorities to complete the project by December.\nNESPAK and FWO officials briefed the chief minister on the progress of Rawalpindi Ring Road Project at Tehraiya site.\nThe CM was briefed that the project started in September 2023 and all the construction work would be completed by February 2025.\nAll the structures on the way of 38.3 kms long Ring Road Project had been removed for speedy construction work while removal of the utility services in the right of the way was underway. 24 percent work on Rawalpindi Ring Road project has been completed.\nFive interchanges, 11 overpasses, bridges on 2 rivers, 6 canals and a railway bridge would be constructed under the project while 15 subways and 53 small bridges would be constructed on the Rawalpindi Ring Road.\nA rest area would be constructed on the Ring Road.\nThe project was indispensable for ease of transportation of the citizens, Maryam Nawaz said adding, industrial zones would also be built on the project.\nThe CM said that the project would be a game changer for Rawalpindi, adding creation of the industrial zones would provide employment opportunities to the local people.\nTwo years were fixed for the completion of the project and all-out efforts would be made to complete it before the deadline, the CM said.\nThe completion of the most important public welfare project should not be delayed, she directed.\nThe work on the ring road project was going on day and night and it would be completed before the stipulated time frame, Maryam Nawaz informed.\nSwift construction work would be ensured on Ring Road Project and there would be no compromise on the quality, she added. She instructed that Rawalpindi Ring Road interchanges should be named after the respective villages.\nFormer Senator Pervaiz Rasheed, Members of Assembly Marriyum Aurangzeb, Uzmi Bukhari, Sania Ashiq, Chief Secretary, concerned secretaries, Commissioner Rawalpindi Division and other officials were also present on the occasion.",
  "retrievedAt": "2025-08-11T01:00:34.126Z"
}
