{
  "title": "LHC reserves verdict on appeal against ECP power to withdraw electoral symbol",
  "link": "https://www.app.com.pk/national/lhc-reserves-verdict-on-appeal-against-ecp-power-to-withdraw-electoral-symbol/",
  "date_published": "2024-02-29T16:01:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 29 (APP):The Lahore High Court (LHC) on Thursday reserved its verdict on an intra-court appeal (ICA) against the Election Commission of Pakistan’s (ECP) power to withdraw the electoral symbol of a political party.\nThe division bench comprising Justice Ali Baqar Najafi and Justice Sultan Tanvir Ahmad heard the appeal filed by a citizen, Mian Shabbir Ismail, and connected petition and reserved the verdict on completion of arguments by the parties.\nThe appellant, through the appeal, submitted that the ECP did not have the authority to withdraw an electoral symbol from a political party. He submitted that the ECP being a constitutional body was not a court or a tribunal, therefore, any power wrongly assumed by it for denying fundamental rights was illegal in terms of Article 8 of the Constitution.\nWhile referring to the ECP decision of withdrawing the electoral symbol of Pakistan Tehreek-e-Insaf (PTI), he  submitted that the actions of the ECP, interpreting section 215 of the Elections Act that it had the right to set aside the intra-party election and deny a party its symbol, was a sheer violation of the Constitution. He pleaded with the court to declare that the election symbol of PTI was unlawfully withdrawn, besides setting aside the single bench verdict on the petition.\nOn February 2, Justice Shahid Bilal Hassan had dismissed the petition challenging ECP power of withdrawing the electoral symbol of a political party. The court held that the ECP was authorised to exercise penal powers, when any political party fails to comply with the provisions of constitution of such party and law, regulating a party, with regards to intra-party elections, especially Sections 209 and 210 of the Act, 2017.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:01:41.311Z"
}
