{
  "title": "Ufone 4G provides free calls in Gwadar to help connect flood-affected families, facilitate rescue & relief operations",
  "link": "https://www.app.com.pk/national/ufone-4g-provides-free-calls-in-gwadar-to-help-connect-flood-affected-families-facilitate-rescue-relief-operations/",
  "date_published": "2024-02-29T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 29 (APP):As Gwadar faces a large-scale natural disaster caused by catastrophic rains and flash floods, Pakistani telecom company, Ufone 4G has announced free calls to help connect local families, and assist in swift execution of rescue and relief operation in the affected port city.\nThe heavy downpour has inundated large parts of Gwadar, destroying homes and livelihoods, and rendering hundreds of families homeless, said a news release.\nA considerably large section of the local population is associated with the fishing industry, whose boats were wrecked, and businesses decimated by the deluge.\nAs a responsible Pakistani corporate citizen, Ufone 4G has always stepped up to help fellow Pakistanis affected by natural disasters. The free minutes will help the locals to connect with their loved ones, alert authorities to their plight and request urgent rescue and relief assistance.\nThe initiative is particularly crucial as the extensive flooding has disrupted communications channels and made it harder for people to finds ways to recharge their mobile balance.\nUfone 4G users across the affected areas will receive 70 Ufone to Ufone and PTCL free minutes with a validity of 7 days. No call set up charges will be levied on these free minutes. The modest support will inspire resilience and fortitude amongst the people of Gwadar to confront and emerge stronger from this adversity.\nThe initiative mirrors the Ufone 4G sustained commitment to fostering social good and ensuring wellbeing of the communities it serves. The Ufone 4G family has expressed complete solidarity with the fellow citizens who are affected by this natural calamity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:02:05.453Z"
}
