{
  "title": "ICP’s Safe City technical monitoring team carried out effective operations in 2024",
  "link": "https://www.app.com.pk/national/icps-safe-city-technical-monitoring-team-carried-out-effective-operations-in-2024/",
  "date_published": "2024-02-29T06:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 29 (APP):In response to the special directives of Islamabad Capital Police Officer (ICCPO) Dr. Akbar Nasir Khan, the Islamabad Capital Police (ICP) was actively engaged in ensuring the protection of life and property of the citizens in Islamabad.\nA public relations officer on Thursday said that, the Safe City technical monitoring team carried out effective monitoring and identified 18 wanted accused including 13 police offenders, 03 court absconders, and 02 highly wanted accused involved in police cases.\nMoreover, the accused were found residing in private hotels within Islamabad’s premises, using bus terminals, residing as tenants, or entering Islamabad through any other means. Upon observing their movements, their profiles were included, and relevant police stations were informed, leading to their immediate arrests.\nThe ICCPO said that the establishment of the Safe City Command and Control Center aims not only to reduce the crime rate in the city but also to provide better facilities to the citizens.\nThe Safe City Command and Control Center, where suspicious activities are monitored, employs useful software such as E-Challan, effective traffic management, data analytics, facial recognition of criminals, automatic number plate readers (ANPR), and Hotel Eye to reduce the crime rate.\nHe further stated that Hotel Eye software keeps an eye on every individual residing in hotels, hostels, and shelter homes in the city. Islamabad Capital Police is continuously engaged in ensuring the protection of life and property of the citizens, he added.\n“The citizens can report any suspicious individuals or activities to Islamabad Capital Police’s helpline “Pucar-15″ or through the “ICT-15” app.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:01:20.964Z"
}
