{
  "title": "PR CEO announces plans for train restoration, improvements",
  "link": "https://www.app.com.pk/national/pr-ceo-announces-plans-for-train-restoration-improvements/",
  "date_published": "2024-02-29T12:30:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 29 (APP):Pakistan Railways Chief Executive Officer Aamir Baloch said on Thursday that train service would be restored gradually based on resource availability.\nDuring an online live e-Kutchery session, Baloch revealed that a new train\ntimetable was set to be implemented from March 15 while the restoration of\nSandal and Khushhal Khan Khattak Express trains was possible upon available\nresources. He highlighted ongoing efforts to enhance track conditions in the Main Line Sukkur Division and mentioned plans to increase the number of trains overtime, with improvements expected to reduce engineering restrictions.\nRegarding specific routes, Baloch indicated that the decision on restoring\nAkbar Bugti Express was pending. He assured the public of special Eid trains\nand improved facilities during the festive season. Furthermore, he noted a\ndecrease in salary delays, attributing it to enhanced revenue generation,\nwith further reductions anticipated in the future.\nIn terms of infrastructure, Baloch mentioned the timely completion of a manufacturing project for 230 new coaches, with Chinese collaboration. He underscored the significance of passenger service over personal interests, emphasizing that train seats were meant for passengers, not employees.\nAddressing concerns about staff behavior and misuse of railway quarters,\nBaloch instructed the authorities to investigate complaints thoroughly. He warned of strict action against those found renting out railway quarters to unauthorized individuals, reaffirming that such accommodations were reserved solely for government employees.\nThe CEO also instructed authorities to address complaints regarding staff behavior on Ghouri Express. The press conference, which lasted two hours, received over five thousand comments, reflecting the public’s keen interest and engagement in Pakistan Railways’ operations and improvements.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:02:27.136Z"
}
