{
  "title": "Election of PM on March 3",
  "link": "https://www.app.com.pk/national/election-of-pm-on-march-3/",
  "date_published": "2024-02-29T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 29 (APP): The National Assembly Secretariat on Thursday announced that election of the Leader of House (Prime Minister) in the National Assembly would he held on March 3 (Sunday).\nAccording to the schedule issued by the NA Secretariat, the nomination papers for the slot of Prime Minister could be obtained from the Legislation Branch of the National Assembly and would be submitted till 2 p.m. on Saturday (March 2).\nThe scrutiny of nomination papers would be completed by 3 p.m. on the same day (Saturday).\nThe election for the Prime Minister would be conducted through division of members in the House.\nAs per the Constitution, before the voting process begins for the slot of Prime Minister, “bells” will ring for five minutes inside the Parliament House to inform every member — in case they are not present in the chamber at the moment — to gather inside. Once the process begins, the doors will be locked, and no one will be allowed to enter or leave the hall till the PM’s election is concluded.\nUnder the supervision of the Speaker, voting will be held through division. For example, if there are two candidates, the Speaker will say that ‘whoever wants to vote for candidate A can go to lobby A’ and ‘whoever wants to vote for candidate B, can go to lobby B’. If there are three candidates then there can be a lobby C as well.\nAt the entrance of the said lobbies, there will be a member of the Assembly Secretariat staff who will record name of every Member of the National Assembly in the register. The whole process will be open and people sitting in the galleries will be able to see who votes for whom.\nThe political parties have to vote collectively and every member has to vote for the candidate that their party is voting for.\nSection 91(4) of the Constitution states, “The Prime Minister shall be elected by the votes of the majority of the total membership of the National Assembly: Provided that, if no member secures such a majority in the first poll, a second poll shall be held between the members who secure the two highest numbers of votes in the first poll and the member who secures a majority of votes of the members present and voting shall be declared to have been elected as Prime Minister: Provided further that, if the number of votes secured by two or more members securing the highest number of votes is equal, further poll shall be held between them until one of them secures a majority of votes of the members present and voting.”",
  "retrievedAt": "2025-08-11T01:01:45.274Z"
}
