{
  "title": "Govt to utilize all available resources for polio-free country: Shahzad Baig",
  "link": "https://www.app.com.pk/national/govt-to-utilize-all-available-resources-for-polio-free-country-shahzad-baig/",
  "date_published": "2024-02-29T07:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 29 (APP): The National Coordinator for Pakistan’s Polio Programme, Dr Shahzad Baig said the government is determined to make the country polio-free very soon through effective vaccination to every child throughout the country.\nTalking to a private news channel, he said that the polio eradication campaign is a part of the efforts of the government towards complete eradication of the polio.\nHe requested all parents to allow polio teams to administer polio drops to their children, adding that we are confident that we together with our people and international partners will achieve our target goals of making a safer, healthier and polio-free Pakistan for our children.\nHe said that polio has no cure, only the vaccine can provide lifelong protection.\n“I urge parents and caregivers to realize how important this vaccine is for their children’s health and make sure that they open their doors to vaccinators and get children immunized”, he added.\nPakistan has made incredible progress against polio, and we are working hard every day to make the country polio-free, he mentioned.\n“Polio eradication is and will remain a top priority for the Government of Pakistan,” he said.\nThe Health Ministry has conducted the second nationwide polio vaccination of the year to vaccinate more than 45.8 million children under five across the nation to protect them from paralytic polio, adding, which will successfully\ncontinue until March 9.\nPolio workers are visiting door to door to administer anti-polio drops to children below the age of five, he added.\nReplying to a question, he said that 99% we overcome the burden of Polio disease in the country with continuous polio drives.\nHe said more than four lakh polio teams working in the field, adding that Dera Ismail and Banu, Quetta, Chaman and Peshawar are the main risky areas where environmental samples were being identified.\nHe said that at the same time, Afghanistan and Pakistan had initiated this present polio drive to eliminate the virus, adding that citizens asked to cooperate with polio teams.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:00:43.936Z"
}
