{
  "title": "Pakistan committed to boost trade ties with Afghanistan for regional peace, development: Asad Qaiser",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-boost-trade-ties-with-afghanistan-for-regional-peace-development-asad-qaiser/",
  "date_published": "2020-11-09T14:35:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 09 (APP): National Assembly Speaker Asad Qaiser Monday said the government had focused on enhancing trade relations with Afghanistan for economic stability and prosperity of the entire region.\nHe said Prime Minister Imran Khan would inaugurate Rashakai Economic Zone on November 21, that would boost trade and development of the area.\nTalking to media persons at the residence of China-Pakistan Economic Corridor (CPEC) Committee Chairman and Member of National Assembly Arbab Sher Ali after reviewing opening of Rashakai Economic Zone,\nhe said the government was committed for the welfare of people through economic revival and enhancing trade especially with neighboring and brotherly county Afghanistan.\nDefense Minister Pervez Khattak was also present on the occasion.\nHe said boosting trade with Afghanistan would not only generate employment opportunities in both the countries but would be also helpful in restoring peace and stability in Afghanistan.\nAsad Qaiser said Pakistan was committed to peace process in Afghanistan adding regional development and peace in Pakistan was linked with restoration of law and order situation in Afghanistan.\nHe said Pakistan had invited Afghanistan to join CPEC so that it could also achieve development and prosperity.\nHe said Pakistan could reach the markets of central Asian countries through trade with Afghanistan.\n“Government is fulfilling all its pledges and for the first time economic reforms are introduced in Khyber Pakhtunkhwa for the benefits of downtrodden people and underprivileged areas.”\nAsad Qaiser said CPEC conference would be held in Peshawar on November 13,\nadding for the first time mega economic and social welfare projects had been started in the province for the benefits of people and providing them employment opportunities.\nHe said the motto of our politics was revival of economy and development of the country.",
  "retrievedAt": "2025-08-11T19:59:37.410Z"
}
