{
  "title": "No differences with political allies: Governor Sarwar",
  "link": "https://www.app.com.pk/national/no-differences-with-political-allies-governor-sarwar/",
  "date_published": "2020-11-09T16:21:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 09 (APP): Governor Punjab Chaudhry Mohammad Sarwar on Monday said there were no differences between the government and its ally Pakistan Muslim League–Quaid-e-Azam (PML-Q) and it would stand by the government during the five years term.\nTalking to the media men at Allama Iqbal’s mausoleum here, he said the PML-Q was a time-tested ally of the government and both the parties were on the same page.\n“The government has nothing to do with the arrest of an opposition leader,” he responded, adding that the government did not believe in political victimization.\nTo another question, he said all the other political parties including PML-N and PPP were facing cases in the courts today.\nAll these people had been making cases against each other. The PTI government had not filed any lawsuit against anybody, he added.\n“People have rejected the opposition’s rhetoric. There will be no elections before 2023. If the opposition wants talks to end accountability, then there is no such question.\nAll institutions, including the NAB, are working with complete independence”, he replied.\nReplying to a question, Sarwar said the opposition wanted an end to the rule of PTI government and to the process of accountability in the country, adding that both of these things would not happen.\nHe said the government was ready to sit with the opposition parties on the issues of national interest, but there would be no compromise on the elimination of corruption.\nIn response to another question, Punjab Governor Chaudhry Mohammad Sarwar said the decision on who should be brought to power could be taken only by the power of the people’s vote, so the opposition parties should wait for the general elections instead of holding rallies.\nThe Governor Punjab said if any member of the PML-N had been arrested by the police, it was the responsibility of the police to ensure law and order and it was free to take action.\nHe said the government would not interfere with the police in any way, adding that, under the leadership of Prime Minister Imran Khan, rule of law was the first priority of the government.\nChaudhry Mohammad Sarwar said with the election of US President elect Joe Biden, peace would flourish in the world while the US President would take the world along to solve issues like Kashmir and Palestine and they would do the needful to bring peace into the world.\nChaudhry Mohammad Sarwar said, “Under the leadership of Prime Minister Imran Khan, we want to create a Pakistan where the law is equal for all and the poor man can be ensured the provision of health and other facilities including education.”\nHe said towering personalities like Allama Dr. Muhammad Iqbal are born after centuries, adding that Allama Iqbal united the Muslims of India with his thought-provoking poetry and philosophy.\nHe said, “We need to follow the thought of the poet of the East in order to regain our lost glory in the world.”",
  "retrievedAt": "2025-08-11T19:59:35.040Z"
}
