{
  "title": "PTI after coming to power would bring GB at par with developed areas of country: Murad Saeed",
  "link": "https://www.app.com.pk/national/pti-after-coming-to-power-would-bring-gb-at-par-with-developed-areas-of-country-murad-saeed/",
  "date_published": "2020-11-09T11:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 9 (APP): Minister for Communications and Postal Services Murad Saeed on Monday said Pakistan Tehreek-e-Insaf after coming to power in Gilgit-Baltistan would bring the area at par with the developed areas of the country.\nAddressing a public rally at Khaplu, Gilgit-Baltistan, the minister said that in future the people of GB would enjoy all constitutional rights like the other parts of the country with representation in the Parliament.\nHe said that Imran Khan had given constitutional rights to the people of erstwhile Federally Administered Tribal Areas (FATA) and he has the credit to give similar rights to the people of Gilgit-Baltistan.\nMurad lamented that the PPP and PML-N ruled over the GB for decades but instead for working for its development, they plundered its resources for building personal properties.\nHe said that the popular demand of giving GB status of province could not be fulfilled by the rulers, and this credit went to Prime Minister Imran Khan.\nHe said that the GB was neglected in China Pakistan Economic Corridor by the previous government, it was the PTI regime that announced CPEC projects in GB and allocated economic zone in the region.\nMurad said that the past rulers did not provide health and education facilities and the roads of the areas were in very bad condition.\nHe said that the people of GB have now decided to vote PTI in coming elections.\nHe said that Bilawal Bhutto Zardari by saying that people of GB have no healthcare and education facilities and roads were in dilapidated , had in fact admitted that the PPP government did nothing for the people of GB.\nThe minister said that Babusar top remained closed for over eight months in the year but no government took any initiative to resolve this problem, now the PTI has approved an all-weather road link and its feasibility process was being completed and its work would start soon.\nKarakoram Highway, he said, was in a dilapidated condition and the PTI government has given approval for its up-gradation project which would facilitate safe and comfortable journey.\nHe said that Gilgit-Shandoor-Chitral road has been made part of CPEC and it would be linked with Swat Motorway to provide modern road facilities to the people of GB.\nHe said that the people of Azad Jammu and Kashmir and Gilgit-Baltistan are being given Insaf Health Insurance card and every family would be provided Rs 720,000 medical cover.\nCriticizing Bilawal Bhutto, he said that the PPP remained in power at centre and GB, but it did nothing for the betterment of its people.\nEven in Sindh where PPP was ruling, the most stunted children were born in Thar district which was proof of the government inefficiency.\nAbout the PML-N leadership he said that Nawaz Sharif has escaped to England, while his daughter was known for telling lies. He said those who looted national resources had no right to talk about the people’s problems.\nHe expressed the hope that on November 15, the PTI would win a landslide majority in the GB Legislative Assembly elections.\nHe said that Amina Ansari, the PTI candidate from Khaplu would win with a heavy margin by defeating her opponents.\nHe said that Imran Khan was advocating the case of not only Pakistan but entire Ummah at the international forums like United Nations and it was responsibility of the people to strengthen his hands at this critical time.\nMinister for Kashmir Affairs and Gilgit Baltistan Ali Amin Gandapur also addressed the rally.",
  "retrievedAt": "2025-08-11T19:59:40.530Z"
}
