{
  "title": "NA speaker calls parliamentary leaders meeting on Nov 11",
  "link": "https://www.app.com.pk/national/na-speaker-calls-parliamentary-leaders-meeting-on-nov-11/",
  "date_published": "2020-11-09T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 9 (APP): National Assembly Speaker Asad Qaiser Monday called a meeting of the parliamentary leaders in the lower and upper houses of the parliament on November 11.\nNational Assembly has issued official communication to the parliamentary leaders inviting them to attend the meeting.\nThe military officials would brief the parliamentary leaders on the current issues of national security.\nThe parliamentary leaders invited to attend the meeting include Makhdoom Shah Mahmood Qureshi, Minister for Foreign Affairs, Senator Azam Khan Swati, Minister for Narcotics Control, Khawaja Asif, Bilawal Bhutto Zardari, Asad Mahmood, Tariq Bashir Cheema, Federal Minister for Housing and Works, Akhtar Mengal, Dr Khalid Maqbool Siddiqui, Khalid Hussain Magsi, Ghous Bux Khan Mahar, Sheikh Rashid Ahmed, Federal Minister for Railways and Amir Haider Azam Khan.\nSenators Mushahid Ullah Khan, Sherry Rehman, Muhammad Ali Khan Saif, Mir Kabeer Ahmad Muhammad Shahi, Moulana Abdul Ghafoor Haideri, Muhammad Usman Khan Kakar, Siraj ul Haq, Sitara Ayaz, Dr Jehanzeb Jamaldini, Syed Muzaffar Hussain Shah, Anwar ul Haq Kakar and Aurangzeb Khan were invited to attend the meeting.\nFederal Ministers Pervaiz Khattak, Ijaz Ahmad Shah, Ali Amin Khan Gandapur, Shafqat Mehmood, Asad Umar and Senator Shibli Faraz, Attorney General for Pakistan Khalid Javed Khan, Advisor to Prime Minister Dr Zaheer Uddin Babar Awan, and Dr Moeed Yousaf, Special Assistant to Prime Minister had been invited to attend the meeting as special invitees.\nAzad Jammu and Kashmir President Sardar Masood Khan, Prime Minister Raja Farooq Haider Khan and Gilgit Baltistan Governor Raja Jalal Hussain Maqpoon and Caretaker Chief Minister Mir Afzal had been specially invited to attend the meeting.",
  "retrievedAt": "2025-08-11T19:59:37.247Z"
}
