{
  "title": "COVID-19 positivity ratio rapidly increasing in 15 major cities, NCOC told",
  "link": "https://www.app.com.pk/national/covid-19-positivity-ratio-rapidly-increasing-in-15-major-cities-ncoc-told/",
  "date_published": "2020-11-09T06:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 09 (APP):The National Command and Operation Center (NCOC) on Monday was apprised that COVID-19 positivity ratio was rapidly increasing nationwide which was 4.5 percent prevailing in the country amid 15 major cities having higher positivity ratio.\nThe NCOC meeting discussed in length recent surge in Covid-19 positivity ratio and recent enforcement measures post National Coordination Committee (NCC) meeting.\nThe Chief secretaries of provinces updated the forum on administrative measures implemented as per the fresh guidelines issued by the NCOC in higher positivity ratio cities in their respective provinces.\nThe Chief Secretaries briefed the Forum on their initiatives particularly administrative measures and enforcement efforts regarding face mask wearing and arrangements for outdoor weddings’ modalities to ensure compliance of fresh health guidelines.\nThe Forum noticed that positivity ratio in major cities was increasing rapidly as Hyderabad was having highest positivity ratio in Pakistan with 16.59 percent positivity ratio, Gilgit 15.38 percent, Multan 15.97 percent, Muzafarabad 14.12 percent, Mirpur 11.11 percent , Peshawar 9.69 percent, Quetta 8.03 percent, Islamabad 7.48 percent, Karachi 7.12 percent, Lahore 5.37 percent and Rawalpindi 4.63 percent.\nThe Forum was informed that 4,136 Micro smart lockdowns were in place across Pakistan.\nThe test, trace and quarantine (TTQ) strategy was being used for disease control and prevention of COVID-19 spread, the Forum was told.\nThe Forum was also informed that recent health guidelines would remain enforce in 16 Major cities\ntill 31 Jan 2021.\nAround 2,811 oxygenated beds were included to the existing number of the beds to ramp up hospitals’ capacity, along with this, over 13,000 oxygen cylinders were issued to various provinces and federating units.\nThe NCOC appreciated efforts of provinces for taking prompt and necessary measures in line of health guidelines for public safety and well being.",
  "retrievedAt": "2025-08-11T19:59:43.167Z"
}
