{
  "title": "Industry-academia linkages crucial to provide jobs to young graduates: Swati",
  "link": "https://www.app.com.pk/national/industry-academia-linkages-crucial-to-provide-jobs-to-young-graduates-swati/",
  "date_published": "2021-04-12T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):Federal Minister for Railways, Azam Khan Swati on Monday said strong industry-academia linkages are crucial for providing jobs to graduates and internship opportunities to students to get hands-on experience in their respective fields.\nHe was speaking at the signing ceremony of a memorandum of understanding (MoU) held here with a view to facilitate the Ministry of Railways in hiring human resources from the National University of Science and Technology (NUST) through Tech Valley Private Limited.\nThe federal minister also emphasized the need to engage more young graduates in public sector organizations, which, he hoped, would bode well for the performance of government organizations.\nThe minister said this MoU will prove as highly beneficial in terms of addressing the key issues being faced by the ministry through utilizing the expertise of researchers of NUST.\nThe agreement was signed by NUST Pro-Rector Research Innovation and Commercialisation, Dr Rizwan Riaz; Advisor to Minister for Railways, Abdul Rasheed Khan; and Chief Executive Officer Tech Valley, Umar Farooq.\nAs part of the agreement, Pakistan Railways and Tech Valley will offer jobs for NUST graduates, as and when vacancies are announced or created in the relevant departments, besides playing their role in the conduct of NUST’s recruitment drives, job fairs, seminars, workshops, trainings, etcetera.\nThe tripartite agreement also underlines close liaison amongst the organisations to undertake joint research projects and consultancies in future to help address key issues facing the ministry.\nSpeaking on the occasion, NUST pro-rector highlighted that this is just a beginning of a long-term mutually beneficial cooperation between the organisations as NUST has a lot to offer to the partnering organisations through its technical expertise, state-of-the-art infrastructure and, most of all, its highly capable faculty and students.",
  "retrievedAt": "2025-08-11T20:37:09.797Z"
}
