{
  "title": "CCI approves 2017 census results, decides to hold fresh census immediately",
  "link": "https://www.app.com.pk/national/cci-approves-2017-census-results-decides-to-hold-new-census-immediately/",
  "date_published": "2021-04-12T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):The Council of Common Interest (CCI) on Monday approved the results of 2017 national population and housing census with majority votes and decided to hold the new census by end of 2021.\nThe meeting of the CCI was held here presided over by Prime Minister Imran Khan and was attended by the Chief Ministers of all the provinces.\nLater giving details of the meeting in a press conference here, Minster for Planning, Development and Special Initiatives Asad Umar said the Chief Ministers of Punjab, Khyber Pakhtunkhwa and Balochistan voted in favor of the approval while the Sindh Chief Minister voted against the approval.\nHowever, he said that keeping in view the reservations showed by some stakeholders including Sindh government over the results of the census, the CCI had decided to start the process of 7th national population census by October this year.\n“What we had to do was that either to approve or to reject the results, and as the decision of rejection would mean a great loss to the provinces, the CCI has approved with majority vote and decided not to wait for 10 years to hold the next census,” Asad Umar added.\nHe said the framework for new census would be prepared within six to eight weeks and then the approval for new census would be sought from the CCI. “About four months after the approval, the process of new census would start by end September or start of October this year.”\nThe minister informed that the census was a process that spans over a period of 18 months so it would be completed by start of 2023.\n“The general election are expected to be held in October 2023 so the next general elections would be held on the basis of new census’ results,” he added.\nAsad Umar said the cost of the new census was estimated at around Rs 23 billion that would be divided in two fiscal years-FY2022 and FY2023.\nReferring to the reservations by Sindh government over the the result of 2017 census, the minister pointed out that the PTI was neither in Sindh nor in federal governments at that time but the PTI government respects the reservations of the Sindh government that is its constitutional right.\n“Although the technical experts of Pakistan Bureau of Statistics (PBS) are ready to respond to the queries raised over the census claiming that they can prove that there is nothing wrong with the results but despite that the CCI has decided to conduct fresh consensus which is a big and costly process,” Asad Umar added.\nHe said in the 6th population census, the whole process in the provinces were held under the supervision of the respective provincial governments, therefore the provinces should now own the results with open heart.\nHe also asked all the stakeholders to refrain from political point scoring on the next census as it was a national process under which all provinces would national resources and representations in the assemblies.\nResponding to a question, Asad Umar said that the next national census would be conducted under a project mode as services of different experts would be hired to ensure the process as transparent and flawless.\nEarlier keeping in view the sensitivity of the Census results, the Cabinet had decided to constitute a Ministers’ Committee on February 11, 2020 for detailed deliberations on the matter with stakeholders and for recommendations regarding finalization of results of Census-2017.\nThe Committee conducted six meetings and after extensive considerations submitted its report with recommendations for approval of results of Census-2017 in a larger national interest and to the conduct next census earlier possible by adopting modern technologies.\nThe Cabinet in its meeting held on December 22, 2020 approved the committee recommendations to forward it to CCI for final consideration being the competent forum. The CCI in its meeting held on Monday deliberated on the subject and approved the final results of Census-2017.\nMeanwhile an official press release said that under the final results of Census-2017, the population of Pakistan is 207.68 million (with -0.043% difference with provisional results) with population growth rate of 2.40 percent from 1998 to 2017 with 106.3 million males and 101.3 million females.\nPunjab has the highest share of population 52.96 percent in 2017 followed by Sindh with 23.04 percent, Khyber Pakhtunkhwa 14.69 percent, Balochistan 5.94 percent and FATA & Islamabad with 2.40 percent and 0.96 percent respectively.\nThe highest population density per square kilometer is in Islamabad with 2211 person per square KM and the lowest in Balochistan at 35.53 persons. The highest gender ratio is 110.68 in Islamabad and lowest in KP with 102.4.\nMajority of the Pakistani population is between the age 15 and 64 years with 53.40 percent while 40.31 percent population is in age group less than 15 years. Around 63.56 percent population is living in rural areas and 36.44 percent in urban areas according to Census-2017.",
  "retrievedAt": "2025-08-11T20:37:09.137Z"
}
