{
  "title": "Hammad for curtailing profiteering, hoarding through smooth supply",
  "link": "https://www.app.com.pk/national/hammad-for-curtailing-profiteering-hoarding-through-smooth-supply/",
  "date_published": "2021-04-12T14:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):Federal Minister for Finance, Revenue, Industries and Production, Muhammad Hammad Azhar Monday emphasized the need for mobilizing district administrations and departments concerned to curtail profiteering and hoarding through smooth supply of basic commodities at affordable prices throughout the country.\nChairing the meeting of National Price Monitoring Committee (NPMC) here, the minister urged the provincial governments to also take strict administrative measures to ensure smooth supply of sugar at fair prices during Ramazan.\nHe also directed the respective provincial governments to establish sufficient number of Ramazan Bazaars to ensure provision of basic need items at affordable prices across the board.\nEarlier, the committee reviewed the price trend of essential commodities especially wheat flour, sugar, vegetable ghee, chicken, eggs and vegetables during the last week.\nThe Secretary Finance briefed the Committee about the weekly SPI, where prices of 13 basic commodities registered a decline and 20 items remained stable during the week under review.\nDue to improved availability, the essential commodities that witnessed decrease in prices included Flour (0.7%), sugar (3%), eggs (1.4%) and pulses (0.5%). The non-food items that witnessed decline in prices included LPG (2.3%) and electricity charges (1.3%).\nThe Ministry of National Food Security and Research (NFS&R) briefed the committee about the sufficient stock of wheat across the country. While reviewing the overall prices of wheat flour, the Finance Minister sought details from all the four Provinces regarding procurement targets and prevailing market prices.\nThe Committee observed prices of 20kg wheat flour bags were significantly higher in Sindh (Karachi 1,200 & Hyderabad Rs 1,230) compared to prices in other provinces (Peshawar Rs 964, Quetta Rs 960, Islamabad Rs 864 and Lahore Rs 860).\nThe Finance Minister specifically asked the representative of the Sindh government to explain why prices were higher in Sindh and what measures had been taken to control rising prices of wheat flour.\nThe representative of the Sindh government highlighted that higher procurement price set by the province ( Rs 2,000 / 40kg) was the reason for higher flour prices in Sindh as compared to other provinces and no effective price control strategy had yet been formulated in the province.\nWith the arrival of the holy month of Ramazan, the Punjab government updated the committee that 313 “Ramazan / Sahulat Bazaars” were being established to provide maximum relief to the consumers by offering basic commodities at discounted prices.\nThe MD, Utility Stores Corporation (USC) apprised the NPMC about the arrangements being made to ensure uninterrupted supply of basic commodities namely wheat flour, rice, pulses, sugar, vegetable ghee and others at subsidized prices under the “Ramazan Relief Package” across its chain of outlets throughout the country.\nThe Finance Minister directed MD, USC to firm up a plan to ensure all the basic items are well-stocked and available to the masses at discounted prices.\nThe Finance Secretary informed the Committee that the Finance Division has released requisite funds and would facilitate further to enable USC replenish its stock (as needed) during the holy month.\nMeanwhile, the Additional Secretary, Ministry of Industries and Production briefed the committee about continuous downward trend in international prices of sugar which would reduce the upward pressure on sugar prices in domestic markets.\nAmong others, the meeting was attended by Federal Minister for National Food Security and Research Syed, Fakhar Imam; Special Assistant to the Prime Minister on Revenue, Dr. Waqar Masood; Secretary Finance Division, Secretary Ministry of National Food Security and Research; Secretary Ministry of Industries and Production; MD Utility Stores Corporation, senior representatives of the provincial governments, member PBS and other senior officers.",
  "retrievedAt": "2025-08-11T20:37:07.676Z"
}
