{
  "title": "Hatred for Muslims spirals after Pakistan’s victory against India in T20",
  "link": "https://www.app.com.pk/national/hatred-for-muslims-spirals-after-pakistans-victory-against-india-in-t20/",
  "date_published": "2021-11-02T17:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP): The success of Pakistan against India, with a 10-wicket victory in the cricket match in the United Arab Emirates, has provided an opportunity to the extremist Hindutva followers in making the lives of Muslims more miserable.\nThe Police in Indian-administered Kashmir filed criminal cases under a stringent anti-terror law against the students of two medical colleges in the region for celebrating Pakistan’s victory against India in the T20 World Cup.\nPakistan condemned in the strongest terms the highly reprehensible attacks against Kashmiri students in India after Pakistan’s win in the ongoing ICC T20 World Cup.\n“This hateful behaviour is reflective of the BJP-RSS combine’s extremist “Hindutva” mindset against the minorities, particularly Muslims,” a Foreign Office statement said issued here.\nThe Foreign Office condemned the reports that Indian authorities were charging Kashmiri students and youth under the draconian and arbitrary Unlawful Activities Prevention Act (UAPA).\n“Clearly, such hate-mongering and Islamophobia reflects growing intolerance in India and illustrates that even the gentleman’s game of cricket is not free from its pernicious effects,” it said.\nThere has also been a strong reaction over the detentions and harassment of Muslim students and the hashtag #SaveKashmiriStudents was being used by activists from all over the world to raise voices against the persecution of students by the “India’s Islamophobic, BJP/RSS government & supporters.”\nAccording to a report by Aljazeera India’s loss triggered attacks against Kashmiri students in western Punjab state and a Muslim member of the Indian team was abused online. The students were celebrating in the disputed region over Pakistan’s first-ever win against India in a cricket World Cup.\nAmong those cheering were students from the region’s top medical colleges: the Government Medical College and the Sher-i-Kashmir Institute of Medical Sciences, both situated in the main city of Srinagar. Videos of their celebration outside their residential hostels went viral on social media.\nThe AlJazeera quoting a senior police official said two cases under the Unlawful Activities Prevention Act (UAPA) have been filed against an unknown number of students for causing “insult to the national sentiment during the cricket match”.\nAngad Singh Khalsa regretted the Controversy over the cricket match and termed it an act of frustration and enmity against Kashmiri students. He said detention should have been avoided as using force could boost radicalisation amongst the youth against India. He said the issue should have been addressed in a better way but since the state was using harassment of Kashmiris and Muslims as a selling point, there seemed to be no end to it.\nAll India Students Association (AISA) in a strong statement said that stands in solidarity with the “victims of Hate” and demanded the withdrawal of the Police complaint against Kashmiri Students.  It also strongly condemned the hate attacks and harassment on Muslims and Kashmiri students.\nIt also regretted framing charges of sedition and UAPA on the students, just because the Indian cricket team lost to Pakistan.\nAll Parties Hurriyet Conference (APHC) also strongly condemned the brutal assault on Kashmiri students by fanatic goonsat Central University Mahindragarh, Haryana. In a statement, the APHC spokesman said the students were seriously wounded in the attack.\nThe majority of Kashmiri students, businessmen are reeling under an insecure environment in various states of India.\nIn the past, many incidents of attacks on Kashmiri students took place which forced many students to return back to Kashmir. The APHC spokesman said it was the primary responsibility of governments of various states of India to ensure the safety and security of all the students.\nOn Tuesday People’s Conference (PC)Youth wing Handwara held a peaceful Protest under the banner of Youth district president Mansoor Banday against the harassment of Kashmiri students enrolled in different institutions.\nThe viral videos on the internet showed how the Kashmiri students were thrashed when they were produced before the court.",
  "retrievedAt": "2025-08-11T21:32:41.058Z"
}
