{
  "title": "War can lead to unspeakable destruction on both sides, warns PTI - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: While condemning the unprovoked Indian attack on various sites inside Pakistani territory resulting in the martyrdom of innocent civilians, Pakistan Tehreek-i-Insaf (PTI) has warned that war between two nuclear-armed states can culminate in unspeakable destruction and bloodshed on both sides.\n\nInstead of coming out with credible information proving their contention or agreeing to a neutral and transparent investigation into the attack in Pahalgam, as proposed by Pakistan, India has instead opted to decide by itself what path to take to satiate its incorrigible hostility towards Pakistan, the party said.\n\n“Obviously, this act of unprovoked aggression will be befittingly responded by the armed forces of Pakistan. The heavy losses already inflicted on the Indian armed forces by the valiant Pakistan Air Force should bring the Modi government to its senses. It is hoped that there is no further escalation by India of the conflict to satisfy its bloated and hegemonic ego,” it stated.\n\n“At this grave moment, we also express our deep concern for the safety and security of our Founding Chairman Imran Khan and call upon authorities to release him forthwith. The nation cannot be denied its true leadership at this moment of national crisis. Imran Khan’s presence would be a powerful rallying force for the people in support of the multifaceted action envisaged against Indian warmongering,” the PTI stated.\n\nPTI Central Information Secretary Sheikh Waqqas Akram said PTI lauded the Pakistan Army for its responsible, swift, and precise response, which successfully downed five Indian fighter jets.\n\nHe said that the brazen act of aggression represented a blatant violation of international law, Pakistan’s sovereignty, fundamental human rights, and the established principles of warfare.\n\nHe stated that the conduct of the Indian leadership clearly reflected the desperation triggered by the Pahalgam false flag operation and mounting internal political pressures, driving the war-mongering Modi government away from responsible policymaking and toward dangerous propaganda and provocation.\n\nHe firmly said that such reckless actions amounted to a deliberate attempt to sabotage ongoing efforts for peace and stability in South Asia.\n\nHe urged the international community, the UN, OIC, and human rights organisations to take serious notice of India’s provocative actions and fulfill their responsibilities in ensuring lasting peace in S. Asia.\n\n“However, if our sovereignty, safety of our citizens, or our national dignity is challenged, it will be met with a swift, effective, and decisive response,” he warned.\n\nMeanwhile, Mr Akram condemned the Supreme Court’s Constitutional Bench (CB) for its decision to authorise military trial of civilians in the May 9 cases.\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:19:52.738Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909290/war-can-lead-to-unspeakable-destruction-on-both-sides-warns-pti",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:05:25.000Z"
}
