{
  "title": "FO lodges strong protest with India - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Dar briefs Islamabad-based ambassadors on unprovoked Indian attacks\n• Discusses security situation with Chinese, Turkish and Italian reps\n\nISLAMABAD: Amid escalating tensions, the Indian chargé d’affaires was summoned to the foreign ministry on Wednesday to receive a strong protest over the unprovoked Indian strikes at multiple locations across Pakistan and Azad Jammu and Kashmir. These strikes resulted in the deaths and injuries of several civilians, including women and children.\n\nAccording to a statement issued by the Foreign Office, Pakistan conveyed to the envoy that India’s blatant act of aggression constitutes a clear violation of Pakistan’s sovereignty. The statement emphasised that such actions contravene the UN Charter, international law, and established norms governing inter-state relations.\n\nPakistan firmly rejected India’s baseless justifications for its hostile actions. The Indian side was warned that such reckless behaviour poses a serious threat to regional peace and stability, the statement added.\n\nMeanwhile, Deputy PM and Foreign Minister Ishaq Dar briefed the Isla­­­mabad-based ambassadors on the Indian strikes in Pakistan and Azad Kashmir.\n\nAccording to the FO, Mr Dar st­­ro­­ngly condemned the Indian ag­­gression that not only violated Pakistan’s sovereignty but also jeo­­pardised regional peace and stability. He also discussed the regional security situation following the Indian strikes with the ambassadors and ministers of China, Turkiye and Italy.\n\nAmbassador of China to Pakistan Jiang Zaidong called on FM Ishaq Dar and discussed the current situation following India’s aggression against Pakistan.\n\nWith input from APP\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/08085421e9cbddd.jpg?r=085521",
  "retrievedAt": "2025-08-23T08:19:53.117Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909294/fo-lodges-strong-protest-with-india",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:05:24.000Z"
}
