{
  "title": "HBL PSL 2025: Hasan, Rossouw slam tons as Gladiators rout United - Sport - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Def­ending champions Islam­abad United’s downward spiral in their ongoing HBL Pakistan Super League campaign continued on Wednesday as Quetta Gladiators subjected them to a 109-run rout.\n\nGladiators, riding on blistering centuries by Rilee Rossouw and Hasan Nawaz, posted a mammoth 263-3 — the highest score ever in a PSL match — before United were bundled out for 154.\n\nIt was United’s fourth defeat in a row after they had gone on to win the first five matches this season. Gladiators, who had already qualified for the playoffs, strengthened their claim as the favourites to take the title.\n\nThey had run riot with that bat, thanks to Rossouw’s 104 off 46 (14 fours and six sixes) and Hasan Nawaz’s 100 off 45 (four fours and nine sixes).\n\nGladiators cruised to 63-2 in the powerplay with skipper Saud Shakeel and first-drop Rilee Rossouw fighting back after Finn Allen’s early run-out. Rossouw, who had hit three outrageous sixes amid the field restrictions, to add 26 off 12 in the period, went on to continue his fireworks.\n\nThe South African hit two more boundaries before getting down on one knee and pulverising Imad Wasim’s left-arm spin deep midwicket for a six to bring up his first half century of the season in 26 balls as Gladiators posted 103-2 by halfway stage.\n\nRossouw plundered 21 runs off Mohammad Nawaz in the 12th over, clearing deep square twice for sixes. He hit three boundaries in the next over as Gladiators crossed the 150-run mark.\n\nThe left-hander showed his leg-side prowess again in the 15th, bringing up his century — his third PSL ton — in only 44 balls, before holing Imad out to Jason Holder at long-on.\n\nOn the other end, meanwhile, Hasan Nawaz had powered three sixes and as many fours by that point. And the young right-hander ensured he continued from where Rossouw left.\n\nHasan went under the ball and clubbed pacer Mohammad Shahzad for sixes over cow-corner and long-off in the 18th over before smashing Naseem Shah for three sixes in the 19th.\n\nHasan thumped Ben Dwarshuis high and long over long-on and got a flying edge for a boundary to reach his century on the very last ball of the innings.\n\nChasing 264, Islamabad United’s innings crumbled early against Mohammad Amir’s fiery opening spell. Amir struck twice in the first over, dismissing Kyle Mayers lbw and Sahibzada Farhan caught at short midwicket, and later removed Salman Ali Agha, finishing with 3-6 in two overs. Islamabad slumped to 19-3 after three overs.\n\nMohammad Shahzad (24 off 13) and Mohammad Nawaz offered brief resistance, but Quetta’s bowlers maintained pressure. Abrar Ahmed’s spin rem­oved Haider Ali and Jason Holder, ending with 2-17.\n\nFaheem Ashraf dismissed Azam Khan, while Saud accounted for Ben Dwarshuis (31).\n\nImad Wasim’s fighting 56 off 41, with five fours and two sixes, brought respectability. His fifty in the 18th over, including a six and four off Faheem, mitigated some damage.\n\nHowever, Mohammad Wasim (2-28) sealed the game by bowling Imad in the 19th over.\n\nA minute of silence was also observed in the remembrance of those who lost their lives as a result of India’s devious military action against Pakistan late on Tuesday night.\n\nScoreboard\n\nQUETTA GLADIATORS:\n\nSaud Shakeel c Haider b Naseem 23\n\nFinn Allen run out (Haider) 5\n\nRilee Rossouw c Holder b Imad 104\n\nHasan Nawaz not out 100\n\nMark Chapman not out 13\n\nEXTRAS (B-3, LB-5, NB-1, W-9) 18\n\nTOTAL (for three wickets, 20 overs) 263\n\nDID NOT BAT: Kusal Mendis, Faheem Ashraf, Mohammad Amir, Mohammad Wasim, Abrar Ahmed, Khurram Shahzad\n\nFALL OF WICKETS: 1-24 (Allen), 2-60 (Saud), 3-194 (Rossouw)\n\nBOWLING: Imad 4-0-42-1 (1w), Naseem 4-0-55-1 (1nb), Dwarshuis 4-0-50-0 (1w), Holder 4-0-52-0 (2w), Salman 2-0-21-0, Nawaz 1-0-21-0, Shahzad 1-0-14-0\n\nISLAMABAD UNITED:\n\nSahibzada Farhan c Khurram b Amir 1\n\nKyle Mayers lbw b Amir 0\n\nMohammad Shahzad c Chapman b Wasim 24\n\nSalman Ali Agha c Wasim b Amir 6\n\nMohammad Nawaz c Wasim b Khurram 10\n\nAzam Khan c Wasim b Faheem 6\n\nHaider Ali c Mendis b Abrar 6\n\nJason Holder c Faheem b Abrar 3\n\nImad Wasim not out 10\n\nBen Dwarshuis c sub (Khawaja) b Saud 31\n\nNaseem Shah not out 5\n\nEXTRAS (LB-2, W-4) 6\n\nTOTAL (all out, 19.3 overs) 154\n\nFALL OF WICKETS: 1-1 (Mayers), 2-2 (Farhan), 3-19 (Salman), 4-33 (Shahzad), 5-43 (Nawaz), 6-53 (Haider), 7-58 (Azam), 8-68 (Holder), 9-123 (Dwarshuis)\n\nBOWLING: Amir 2-0-6-3 (1w), Khurram 4-0-41-1 (1w), Wasim 3.3-0-28-2 (1w), Abrar 4-0-17-2 (1w), Faheem 4-0-40-1, Hasan 1-0-11-0, Saud 1-0-9-1\n\nRESULT: Quetta Gladiators won by 109 runs.\n\nPLAYER-OF-THE-MATCH: Rilee Rossouw\n\nCurrent standings\n\nTabulated under (Teams, matches, wins, losses, NR, points, net run-rate)\n\nGladiators 9 6 2 1 13 1.530\n\nKings 8 5 3 - 10 0.433\n\nUnited 9 5 4 - 10 -0.044\n\nQalandars 9 4 4 1 9 0.958\n\nZalmi 8 4 4 - 8 -0.082\n\nSultans 9 1 8 - 2 -2.708\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681be351bcbdb.jpg",
  "retrievedAt": "2025-08-23T08:19:52.125Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909275/hbl-psl-2025-hasan-rossouw-slam-tons-as-gladiators-rout-united",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:06:06.000Z"
}
