{
  "title": "Protests erupt against razing of mosque in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Various religious groups joined hands on Monday to protest against the demolition of a mosque in the capital.\n\nThe Jamiat Ulema-i-Islam-Fazl (JUI-F) along with other groups held a protest at the site of the demolished Madni mosque near Rawal Dam Chowk. The protesters also uprooted the saplings planted by the CDA on the place. The mosque had been demolished late Saturday night.\n\nThe JUI-F Member of National Assembly, Naeema Kishwar, also submitted a resolution condemning the demolition of Madni mosque.\n\nAddressing the protesters, JUI-F Islamabad chapter Emir Mufti Owais Aziz announced that legal proceedings would be initiated against the demolition of the mosque. He said the government was planning to raze 50 mosques in Islamabad and vowed to resist the move.\n\nHe said the religious groups have unanimously agreed to get an FIR registered against Interior Minister Mohsin Naqvi and other officials under blasphemy laws.\n\n“If the police refuse to register the case, we will consider them enemies of Islam,” Mufti Owais Aziz said, adding that razing mosques overnight was an act of hostility towards Islam.\n\nProtesters to take final decision after meeting with Interior Minister Mohsin Naqvi\n\nHe further said the Frontier Corps was illegally occupying greenbelts along Embassy Road and Margalla Road.\n\n“While the mosques are being demolished in the name of beautification, no action was taken against the illegal occupation by FC on these prime roads,” he questioned.\n\nAs tension flared, Minister of State for Interior Talal Chaudhry, along with commissioner Islamabad, inspector general of Islamabad police and deputy commissioner held negotiations on Sunday night with a delegation of clerics led by Maulana Abdul Ghafoor Haidari. The delegation also included the leader of the Islamabad chapter of the proscribed Sipah-i-Sahaba Pakistan.\n\nThe statement issued by the JUI-F said it had been agreed that further progress would require 48 hours, and a final decision would be made after meeting with Interior Minister Mohsin Naqvi.\n\nAmid threats of violent protests by the clerics, Minister of State for Interior Talal Chaudhry said spreading baseless rumours about madressahs and mosques was incorrect.\n\nIn a statement, he said the madressah located on Murree Road was relocated with the consent of its administration.\n\n“A modern-style facility has been constructed on the new site at a cost of Rs40 million, which provided high-quality accommodation, meals and religious education to around 200 students,” the minister said in a statement.\n\nHe emphasised that any relocation of madressahs or mosques situated on greenbelts or unauthorised land would only be carried out in consultation with religious scholars and the administration.\n\nMeanwhile, fire band cleric Maulana Abdul Aziz has issued a call for jihad and announced the launch of a civil disobedience movement against the government in response to the demolition of the mosque.\n\nA video statement released by the Maulana showed him sitting inside Lal Masjid with a gun on his lap, hurling threats at the government.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1210455481a52ab.png",
  "retrievedAt": "2025-10-12T02:56:54.727Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930260/protests-erupt-against-razing-of-mosque-in-islamabad",
  "dateList": "2025-05-08",
  "date_published": "2025-08-12T01:15:51.000Z"
}
