{
  "title": "AJK leadership calls for global response to Indian misadventure - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD / GILGIT: Azad Jammu and Kashmir (AJK) President Barrister Sultan Mahmood on Wednesday condemned the unprovoked Indian aggression under the cover of darkness, saying it had once again exposed New Delhi’s “nefarious designs” and the true face of the Modi government before the international community.\n\nSpeaking to a group of journalists at the Aiwan-i-Sadr here, he said India’s recent attacks on unarmed civilians in AJK were aimed at diverting attention from the core regional issue — the unresolved Kashmir dispute.\n\n“India is trying to distract the world with diversionary tactics, but the world must remain focused on the Kashmir dispute, which is the key to regional stability,” he said.\n\nHe urged countries interested in mediation to press for the immediate resolution of the conflict, noting that both Pakistan and India were nuclear-armed states and any further escalation could endanger global peace.\n\nGB CM condemns attack on civilians\n\nHighlighting the human rights situation in India- occupied Kashmir, Mr Mahmood said that over 4,000 Kashmiris had been arrested and detained in torture cells after Pahalgam incident, while more than 2,500 homes had been demolished.\n\n“The international community must take immediate notice of these atrocities and stop the Modi government from endangering the regional peace,” he said.\n\nHe said India, which projected itself as a secular democracy, had revealed its true face as a Hindu authoritarian state persecuting Muslims and other minorities.\n\n“The world has now seen that India is not a secular state but a fanatic Hindutva-driven regime suppressing dissent and committing cross-border aggression.”\n\n‘Criminal act’\n\nFormer President of Azad Jammu and Kashmir Sardar Masood Khan on Wednesday strongly condemned the unprovoked and unjustified Indian shelling on civilians in AJK, branding it a flagrant violation of the UN Charter and international law.\n\n“This is a criminal and unprovoked act of war. Pakistan has responded with just and proportionate force,” he said while speaking to reporters during a visit to Bilal Mosque and the adjoining residential area in Shawai Nullah, which was hit by Indian shelling late Tuesday night.\n\nGB CM slams attack\n\nGilgit-Baltistan Chief Minister Gulbar Khan on Wednesday condemned India’s cowardly attack on civilians in the night.\n\nIn a statement, he said that Pakistan’s brave armed forces responded effectively to the cowardly aggression of India with full vigilance and force.\n\nHe said the Indian leadership has once again failed in their nefarious designs.\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681bec64897e7.jpg",
  "retrievedAt": "2025-10-12T02:56:35.211Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909289/ajk-leadership-calls-for-global-response-to-indian-misadventure",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:05:24.000Z"
}
