{
  "title": "Social media users decry warmongering from India - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: In the aftermath of India’s overnight air strikes on Pak­is­tan, which claimed the lives of 31 civilians and injured at least 46 others, Pakistani social media erupted in a wave of anger, grief and disbelief.\n\nBarrister and writer Asad Rahim Khan captured the outrage succinctly in a tweet addressed to Indian politician Shashi Tharoor, who expressed pride in his country’s military escapades without showing any regard for the loss of innocent lives, Dawn.com reported.\n\n“Indian liberalism: murdering a three-year-old girl is worth celebrating the next day. That too to launder a bloody occupation. No Pakistani thinker, on any part of the political spectrum, was calling for war. Useful idiots like these are bigger threats to peacetime,” Mr Khan tweeted.\n\nMany users questioned the moral equ­ivalence India sought to draw between the victims of the Pahalgam attack and those in Pakistan now killed in the strikes.\n\n“Why is India bombing innocent civilians!?” a user asked. “They are innocent just like the people who died in the Pahalgam terror attack. What is the difference between those terrorists and Narendra Modi then?”\n\nOne user posted: “Not a single Pa­­kistani I saw took joy in the Pahalgam attack. Yet countless Indians are op­­enly celebrating the death of an innocent child. Nothing vindicates the Two-Nation Theory more than this.”\n\nBritish MP Zarah Sultana condemned the Indian strikes, calling them “a violation of international law” and “a grave threat to regional peace”.\n\nHistorian Ammar Ali Jan tweeted, “The world should know that India is the aggressor here. India has started this war based on pure fiction and outright lies.”\n\nDrawing parallels with Israel\n\nMany users compared India’s ac­­tions to Israel’s ongoing military as­­sault on Gaza, noting that the latter set a dangerous global precedent.\n\n“This is what happens when genocidal actors like Israel are not held accountable. India thinks it can act with the same impunity,” one post read.\n\nA netizen reflected, “Cannot help but wonder to what extent Israel has hollowed out international law for India to feel confident enough to target civilian areas acr­oss an internationally recognised border.”\n\nAnother user said this is how Israelis celebrate attacks on mosques and the deaths of innocent children. “There’s no difference between Zionists and these Hindutva extremists,” the post said.\n\nThe emotional toll\n\nHuzaifa Nizam, known online for posting historical content on his account Huztory, wrote in his sombre reflection: “A child went to sleep tonight. He was killed by men sitting a hundred miles away who decided to shoot missiles… A child has paid the price for your warmongering.”\n\nWriter Fatima Bhutto noted, “Anyone looking can see that Pakistanis — constantly demonised — are calling for calm and peace while Indians, politicians to movie stars, are beating loud war drums.”\n\nContent creator Kazi Akbar wrote, “Dear neighbour, don’t start this. We were built in defiance. We exist in retaliation. You don’t want this fight. Let peace be our legacy. Please.”\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:56:26.174Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909292/social-media-users-decry-warmongering-from-india",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:05:24.000Z"
}
