{
  "title": "Twin cities’ residents rally behind armed forces as daily life continues uninterrupted - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Amid tensions between Pakistan and India, there was no fear or panic among the residents of Rawalpindi. A routine spell of activities was seen while rallies were held in favour of the Pakistan Army.\n\nGovernment and private offices, banks, markets and shops remained open in the garrison city as per routine while people thronged markets and other places. Shops in Moti Bazaar, College Road, Jamia Masjid and adjoining bazaars continued with their normal business.\n\nLocal transport was operating on different routes, but there was less traffic as compared with other days.\n\nThe basic reason for less traffic in the morning and afternoon was the holiday declared in educational institutions. However, normal activities were observed in government and private offices.\n\nGovt, private offices, banks and markets remained open in garrison city\n\nApart from this, the PSL match was conducted as per schedule, and special arrangements were made in and around Rawalpindi Cricket Stadium.\n\nBefore the start of the match, the market in and around Shamsabad was closed, while tents were erected in front of the petrol filling stations and Faizabad market.\n\nThe Punjab government on Wednesday directed the deputy commissioners of all 36 districts of the province to cancel the leaves of government officials, and no leave would be granted in the wake of the emergency situation.\n\nUpon this, Deputy Commissioner Rawalpindi Dr Hassan Waqar Cheema directed government departments in the district to ensure cent per cent attendance in government offices and adopt safety measures.\n\nCivil Defence Officer Talib Hussain said that the Civil Defence Department had set up 38 warning posts and activated sirens at 16 locations.\n\nFor the first time, combat and rescue training has started for female volunteers, while combat and rescue practical training has started for 3,500 volunteers in Rawalpindi district.\n\nHe said training exercises were being conducted on the premises of the Cantonment police station, Government Mission School Raja Bazaar, and the Civil Defence Head Office, while combat and rescue training will also begin at Denis Higher Secondary School.\n\nMeanwhile, rallies and solidarity marches were organised by various political and religious parties as well as social organisations.\n\nThe participants of the rallies held national flags in their hands while raising slogans of Pakistan Zindabad and Pak Army Zindabad.\n\nSimilarly, an emergency meeting of the governing body headed by District Bar Association Rawalpindi President Sardar Manzar Bashir and General Secretary Asad Mahmood Malik strongly condemned the attack on the civilian population of Pakistan by India.\n\nOn this occasion, the atmosphere of the bar echoed throughout the day with national songs, national anthems, slogans of Takbeer and Pak Army Zindabad.\n\nSimilarly, a large solidarity rally was organised by the Rawalpindi Waste Management Company (RWMC) to condemn Indian aggression and express unwavering support for the defenders of the country – the Pakistan Armed Forces.\n\nThe rally was led by Chief Executive Officer RWMC Rana Sajid Safdar and witnessed enthusiastic participation from officials of the Municipal Labour Union and hundreds of company employees.\n\nStarting from the company headquarters on Iran Road and concluding at Sixth Road, the participants carried national flags and banners inscribed with slogans in support of the armed forces.\n\nMeanwhile, residents of Islamabad condemned Indian aggression and expressed unwavering support for the Armed Forces of Pakistan, as various rallies were brought out in the federal capital.\n\nPakistan Muslim League-Nawaz (PML-N) leaders, including Federal Minister for Parliamentary Affairs Tariq Fazal Chaudhry, members of the National Assembly Khurram Nawaz and Anjum Aqeel Khan and former deputy mayor Syed Zeeshan Naqvi also brought out rallies from their constituencies and they all gathered at Aabpara Chowk.\n\nSpeaking on the occasion, they condemned the Indian attack on civilians and appreciated the armed forces for counterattacks and knocking down India’s five jets.\n\nThey said that the entire nation stood behind the armed forces. Meanwhile, Milli Muslim League also brought out a rally, which started from Zero Point and culminated outside the National Press Club.\n\nThe Christian community, led by former minister J. Salik, also gathered outside the press club and expressed their support for the armed forces. They said that Indian aggressors launched attacks on civilians and forces retaliated in time.\n\nThe participants of the rallies raised slogans against India and in support of the armed forces, saying that the sacrifices of civilians will not go to waste, as the armed forces had given a befitting reply to Indian forces.\n\nMeanwhile, the National University of Modern Languages (Numl) organised a solidarity walk to condemn the recent Indian aggression and express support for the valiant armed forces.\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681bdebf8c659.jpg",
  "retrievedAt": "2025-08-23T08:19:39.207Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909266/twin-cities-residents-rally-behind-armed-forces-as-daily-life-continues-uninterrupted",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:06:53.000Z"
}
