{
  "title": "Emergency declared in Punjab hospitals; 50pc beds reserved - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government on Wednesday declared emergency in all hospitals of the province, allocating 50 percent of the total beds to meet any emergency situation, given the Indian missile attacks in various parts of the province.\n\nIn an official letter, the government has directed the vice chancellors, principals, executive directors and heads of all the medical and dental teaching hospitals to ensure efficient and uninterrupted medical services, including standby arrangements for emergency medical and surgical care, in their institutions to handle any unforeseen emergency.\n\n“I am directed to inform you that in the light of the ongoing escalation between Pakistan and India, the competent authority is pleased to declare health emergency in all public sector tertiary/teaching hospitals in Punjab and [you are] directed to remain on emergency high alert with immediate effect,” reads the letter issued by the Punjab heath deputy secretary.\n\nThese institutions’ heads have been directed to ensure round-the-clock availability of medical, nursing, paramedical and support staff.\n\nLeaves of doctors, other staff cancelled; YDA ends strike\n\nThey have also been directed to ensure that the operation theaters remain fully equipped and functional.\n\nThe list of elective surgeries may be postponed with immediate effect, says the letter.\n\nThey were directed to ensure availability of sufficient quantity of blood bags of all blood groups, along with an updated list of donors, adequate supplies of medicines, IV fluids, vaccines, surgical/disposables/medical devices and gases.\n\nThe heads were also directed to ensure functionality of all bio-medical equipment and machines, including ventilators, cardiac monitors, suction machines, besides X-rays, ultrasound, CT scan and MRI machines.\n\nThe government wants better coordination of the health department, with the Rescue 1122 emergency services, district health authorities and district administration for swift shifting of patients.\n\nThe health department also cancelled leaves of all its employees and directed them to ensure their presence in hospitals across the province to meet any emergency situation.\n\nMeanwhile, the Young Doctors Association (YDA) Punjab postponed its protest and strike at the hospitals across the province given the rising tension between Pakistan and India.\n\nYDA president Dr Shoaib Niazi and other leaders announced this while talking to media persons here on Wednesday.\n\nThe said that all young medics and other employees will be present on their duties to meet any emergency situation.\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:57:10.104Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909248/emergency-declared-in-punjab-hospitals-50pc-beds-reserved",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:06:42.000Z"
}
