{
  "title": "Deaths and destruction in Bahawalpur, Muridke after Indian strikes - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Four missiles struck Jamia Masjid Ummul Qura in Muridke, killing three civilians\n• 13 people, including two girls, martyred in Subhan mosque strike\n• Funeral of Bahawalpur victims held at Dring Stadium\n\nLAHORE: Tensions between India and Pakistan have intensified after a series of Indian air and drone strikes resulted in the deaths of at least 31 Pakistani civilians, with many others injured, including 16 martyred only in Muridke and Bahawalpur.\n\nAs many as three civilians were kil­led when four Indian missiles struck Jamia Masjid Ummul Qura and an ad­­joining house in Muridke, some 40 kilometres from Lahore. The decea­sed were identified as Abdul Malik (from Jhang), Mohammad Alam (Samundri), and Midasar (Chunian).\n\nTwo others were injured and shif­ted to local hospitals. Sources said that the area had reportedly been evacuated earlier due to warnings of a possible strike, which helped reduce further casualties. The mosque was des­troyed and local authorities later arr­a­­­nged visits for both international and domestic media to inspect the site.\n\nBahawalpur\n\nIn Bahawalpur, officials confirmed that 13 civilians, including four men, seven women and two three-year-old girls, were killed in the missile strike on Subhan Mosque, located in the Chowk Azam area on the outskirts of Bahawalpur between the night of May 6 and 7.\n\nThe military’s media wing ISPR has yet to release an official list of the deceased. Most of the victims belonged to the same family, but they have yet to be officially identified.\n\nWhen Dawn contacted the related government officials for the lists of the martyrs and injured, it was informed that the ISPR was finalising it before releasing it to the media.\n\nHigh-level visits were conducted by Corps Commander Bahawalpur Lt Gen Aqeel, Divisional Commissioner Musarrat Jabeen and Punjab Health Minister Khawaja Salman Rafique, who met with the injured at Bahawal Victoria Hospital on directives from the Punjab chief minister.\n\nThe targeted mosque and madressah complex are located in Azam Chowk, not in Ahmedpur East as previously speculated.\n\nThe madressah premises also include residences, where most of the deceased lived and were targeted by the Indian missiles.\n\nDawn learnt that the private seminary during the last week had been evacuated by the local administration, apprehending any Indian assault on it. However, the residents of the seminary’s residential quarters and students were allowed to return just a day before the attack.\n\nWitnesses reported hearing four po­­werful explosions that shook windows as far as Satellite Town and Ba­­ghdadul Jadeed Railway Station. Des­pite the panic, many residents rushed towards the blast site, chanting slogans in support of the armed forces.\n\nMeanwhile, life went on as usual in Bahawalpur, with commercial activities in the grain, vegetable markets and local bazaars continuing on Wednesday along with the normal flow of traffic on roads.\n\nHowever, public and private schools, colleges, and universities remained closed under the government’s orders.\n\nThe funeral prayers for victims were offered at Bahawalpur’s Dring Sta-dium under tight security measures.\n\nNarowal\n\nIn Narowal’s Shakargarh sector, Indian forces launched drone and mortar shell attacks on civilian areas late Tuesday night. A government dispensary sustained partial damage, while mortar shells and drone munitions fell in surrounding fields but failed to detonate. The Pakistan Army also launched a counterattack on Indian forces. The Indian army also fired ammunition in the Harra and Sial villages.\n\nA drone was later recovered from a tree and defused by the bomb disposal squad after being alerted by citi­­zens. Narowal Deputy Com­mis­sioner Syed Hassan Raza declared an emergency at all hospitals across the district, including BHUs, RHCs and DHQ Hospital. Doctors and paramedical staff were placed on 24-hour alert and full stocks of medicines and medical supplies were ensured.\n\nAsif Chaudhry in Lahore, Majeed Gill in Bahawalpur and Abid Mahmood in Narowal contributed to this report\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681bec84252f8.jpg",
  "retrievedAt": "2025-10-12T02:56:31.861Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909295/deaths-and-destruction-in-bahawalpur-muridke-after-indian-strikes",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:05:24.000Z"
}
