{
  "title": "Rohit Sharma announces retirement from Test cricket - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: India captain Rohit Sharma on Wednesday announced his retirement from Test cricket ahead of the team’s tour of England starting next month, but will continue to play the shorter 50-over format.\n\nIn 67 Tests, Rohit scored 4,301 runs including 12 centuries with a best of 212 against South Africa in 2019 and an average of over 40. He captained India in 24 Tests with 12 wins, nine defeats and three draws.\n\n“Hello everyone I would just like to share that I am retiring from Test cricket,” the 38-year-old Rohit wrote on Instagram.\n\n“It’s been an absolute honour to represent my country in whites. Thank you for all the love and support over the years. I will continue to represent India in the ODI format.”\n\nRohit, who quit T20 Internationals along with Virat Kohli after India’s World Cup triumph in Barbados last year, recently led the team to an ODI Champions Trophy title in Dubai.\n\nIndia will begin a five-Test series in England in June-July and the team now needs a new Test skipper.\n\nIndia’s cricket board said, “Rohit Sharma has informed us of his decision to retire from Test cricket. A legend of the red-ball game.\n\n“We will soon announce a new Test captain — it’s time for the next generation to rise.”\n\nRohit’s last Test was in Melbourne last year when India lost to Australia by 184 runs.\n\nHe stood down as captain in the fifth Test in Sydney due to poor batting form but India went on to lose the match and the five-match series 2-1.\n\nJasprit Bumrah was Rohit’s deputy in Australia and led the team in the first Test, which Rohit missed due to the birth of his second child, and the final Test.\n\nRohit managed just 31 runs in five innings of his three outings Down Under and the Indian media speculated that he could retire from Test cricket after the series.\n\nThe captain, nicknamed ‘Hitman’ for getting to big scores quickly — especially in white-ball, also had a poor home series against Bangladesh and New Zealand late last year.\n\nRohit’s India won both the Tests against Bangladesh, but New Zealand handed a rare 3-0 whitewash to the hosts.\n\nRohit began his Test career in 2013, but it was five years later that he came into his own in the five-day format as a swashbuckling opener and later took over as captain from Kohli.\n\n“As player and as captain, you were a joy and India will say a big thank you to you,” veteran commentator Harsha Bhogle posted on social media.\n\n“That century in Chennai, that one at the Oval, both priceless. You walked out against South Africa to open as if you had done it all your life. Will look forward to watching and, hopefully calling, some more great moments in your ODI career.”\n\nAfter India’s defeat in Australia, the Board of Control for Cricket in India (BCCI) mandated national players to participate in the domestic Ranji Trophy, forcing Rohit and Kohli to take field.\n\nRohit’s batting woes continued as he made three and 28 against Jammu and Kashmir, but he was retained as captain of the ODI team.\n\nRohit is currently playing the Indian Premier League T20 tournament with Mumbai Indians and has endured a patchy season so far, scoring 300 runs in 11 matches.\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:19:51.857Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909273/rohit-sharma-announces-retirement-from-test-cricket",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:06:06.000Z"
}
