{
  "title": "Met Office predicts rains, isolated hailstorms in country from today - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Pakistan Meteorological Department (PMD) has predicted rains, thunderstorms and isolated hailstorms in various parts of the country from May 8 to May 12.\n\nThe Met Office informed that a westerly wave is likely to affect the upper and central parts from May 7 (night).\n\nMoist currents are also likely to penetrate central and southern parts of the country from May 7.\n\nUnder the influence of this weather system, rain and thunderstorms, with isolated heavy rainfall, are expected in Neelum Valley, Muzaffarabad, Rawalakot, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber and Mirpur till May 12 with occasional gaps.\n\nRain and thunderstorms is expected in Diamir, Astore, Skardu, Gilgit, Hunza, Ghanche and Shigar from May 8 to May 12 with occasional gaps.\n\nSimilar is expected in Islamabad, Rawalpindi, Murree, Galliyat, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, and Lahore from May 7 (night) to May 11, while in Kasur, Okara, Sheikhupura, Sialkot, Narowal, Hafizabad, Wazirabad, Khushab, Sargodha, Mianwali, Jhang, Toba Tek Singh, Chiniot, Sahiwal, Faisalabad, Layyah, Bhakkar, Multan, Bahawalpur, Dera Ghazi Khan, Bahawalnagar, and Pakpattan from May 8 to May 10 with occasional gaps.\n\nRain and hailstorm are also expected in Chitral, Dir, Swat, Kohistan, Shangla, Battagram, Mansehra, Abbottabad, Haripur, Buner, Malakand, Bajaur, Mohmand, Khyber, Peshawar, Swabi, Mardan, Charsadda and Nowshera from May 7 to May 12 with occasional gaps, while rain-wind/thunderstorm is expected in Kurram, Orakzai, Kohat, Hangu, Bannu, Lakki Marwat, Waziristan and Dera Ismail Khan from May 8 to May 10.\n\nMoreover, rain and wind/thunderstorm are expected in Quetta, Zhob, Barkhan, Sibi, Musakhel, Khuzdar, Kalat, Lasbela, Panjgur, Qilla Saifullah, Qilla Abdullah and Awaran from May 7 to May 10.\n\nRain-wind/thunderstorm is expected in Sukkur, Larkana, Mirpurkhas, Khairpur, Jacobabad, Kashmore, Tando Allah Yar, Tando Muhammad Khan, Tharparkar, Sanghar, Umerkot and Mithi from May 8 (evening) to May 10.\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:57:37.121Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909264/met-office-predicts-rains-isolated-hailstorms-in-country-from-today",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T00:06:53.000Z"
}
