{
  "title": "SBP orders vigil on outflows - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Amid heightened tensions with India, the State Bank of Pakistan has asked banks to closely monitor dollar outflows, as the escalating conflict could rapidly increase demand for the greenback.\n\nHowever, currency dealers in both the inter-bank and open markets said there was no panic buying of dollars, nor had demand escalated.\n\nAccording to a currency dealer, over 90 per cent of remittances to Pakistan come through Indian exchange companies, particularly from the Middle East — a channel that may face disruptions if the conflict between the two countries prolongs. “…In the case of a full-fledged war, these companies could be used by India as a tool to pressure Pakistan.”\n\nCurrency dealers, speaking on condition of anonymity, said Indian exchange companies are the main handlers of remittances to Pakistan.\n\nIndian exchange companies have a vast network across the Middle East, Europe and the United States. They collect local currencies from overseas Pakistanis and remit US dollars to Pakistan through the banking channel. The SBP pays around Rs15 to Rs20 per dollar in incentive payments to these companies, which are made in dollars.\n\n“Pakistan has withstood similar skirmishes in the past, but in the event of a prolonged war, it would present a worst-case scenario for our already fragile economy. At the same time, India’s economic growth would also suffer severely,” said Rashid Masood Alam, a senior banker.\n\n“We’ve received informal indications from the State Bank to monitor dollar outflows closely as a precautionary measure amid the rising tensions between the two countries,” said another banker.\n\nIt was also observed that the currency market remained calm throughout the day, despite the escalation being widely reported in the media.\n\n“We did not observe any panic in the open market, nor was there heightened demand for dollars despite Indian aggression,” said Zaffar Paracha, General Secretary of the Exchange Companies Association of Pakistan.\n\n“If there is any shortage, we can manage it,” he added, but warned that a prolonged conflict would be damaging for both countries.\n\nThere was consensus in the financial sector that a full-scale war is unlikely to continue for long, as the economies of both countries are at stake.\n\nHowever, the immediate effects on the market and other segments of the economy were observed on the first day following the Indian unprovoked strikes in Pakistan.\n\n“Trading started chaotically, but markets stabilised early on. Both the PKR and INR remained mostly unchanged, although swap premiums rose slightly,” said the CEO of Tresmark.\n\n“Pakistan bond yields crept higher intraday but closed mostly unchanged. Markets appear to have shrugged off the uncertainty and remain calm. If there is no further escalation — which now seems to be the best-case scenario — there will be limited long-term impact,” he added.\n\nPublished in Dawn, May 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:56:42.500Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909333/sbp-orders-vigil-on-outflows",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T03:30:04.000Z"
}
