{
  "title": "Kashmiri-American Community seeks Biden admin’s role to resolve Kashmir issue",
  "link": "https://www.app.com.pk/national/kashmiri-american-community-seeks-biden-admins-role-to-resolve-kashmir-issue/",
  "date_published": "2021-06-08T11:04:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Jun 08 (APP): The U.S-based Kashmiri American Community has called upon the Biden Administration to practically move ahead to ensure implementation of its policy of raising the much-needed matter of the settlement of Jammu and Kashmir issue with the government of India.\nIn an open letter addressed to Mr. Anthony Blinken,Secretary of State of the United States of America, illustrious Kashmir-origin Kashmiri American Community elder Muhammad Azeem Advocate, released to the media here on Tuesday said “The Kashmiri American Community of United Sates was encouraged by your policy speech about the issue of State of Jammu Kashmir delivered at Hudson Institute in July 2020 and are expecting that the Biden Administration will be moving forward in this matter to implement its policy of raising the issue with the government of India.”\n“We the Kashmiri American Community, living in United Sates of America, are writing you in reference to the case of State of Jammu Kashmir for not only violation of basic human rights committed by the Indian government but also the Right of Self Determination of Kashmiri People under the UN Resolution # S1100 passed August 13, 1948 which granted them The Right of Self Determination through a Plebiscite conducted under the auspicious of United Nations.”\nCurrently, the State of Jammu Kashmir was controlled by governments of Pakistan and India. The people of Jammu Kashmir have been living in their State controlled by India and Pakistan since 1947 when the British India was partitioned into two States; Pakistan and India.\nIndia and Pakistan took over parts of Kashmir, a Princely State, with no fighting army under their control during their fight for Independence in 1947.\nBoth India and Pakistan have already agreed at the United Nations through various Resolutions on Kashmir to conduct Plebiscite to determine the Right of Self Determination of Kashmiri People in their India and Pakistan controlled State since 1947.\n“Your Honor, we are requesting your intervention in this serious matter to bring India and Pakistan to the table and work to arrange the Plebiscite in all parts of the Kashmir to enable Kashmiris to exercise their Right of Self Determination,” the letter concluded.",
  "retrievedAt": "2025-08-11T20:49:31.692Z"
}
