{
  "title": "Govt to expand scope of research in ‘halal food’: Shibli Faraz",
  "link": "https://www.app.com.pk/national/govt-to-expand-scope-of-research-in-halal-food-shibli-faraz/",
  "date_published": "2021-06-08T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP): Federal Minister for Science and Technology, Shibli Faraz Tuesday said that Pakistan would expand its scope of research in the field of ‘halal food’ with support of the Muslim countries.\nHe was addressing a commencement ceremony of a three-day COMSTECH training course entitled “How to establish Halal food testing laboratory?” being here.\nHe emphasized that research in the relevant field should bring benefit to the people of Pakistan and the entire humanity and said that research should yield to patent and then be commercialized.\nFaraz said his ministry was paying focus on strengthening its institutions and taking steps for developing coordination between market and universities.\nThe minister said that by our conviction, Islam is a way of life and sets food standards for humanity.\nFaraz emphasized on ensuring quality of halal food items and said that the labs should have capacity to determine halal and haram (unlawful) with the focus on complete food value chain.\nThe minister encouraged all Halal industry related institutions to develop mechanism for increasing capacities and advised that universities should be part of this as well.\nFaraz highlighted the way forward for research in halal food by mentioning that there is a huge gap between research done in the past in Pakistan and its application.\nCoordinator General COMTECH, Prof. Dr. Iqbal Choudhary said that Halal accreditation and certification is a niche in which we can achieve excellence.\nHe said that Halal business is growing over 20% and there are no major Halal certification bodies in Muslim countries.\nDr. Choudhary said that we at COMSTECH are focused on science based commercialization and developing capacity in OIC member states focusing on the application of science research output.\nHe said that the theme of today’s event is relevant to industrial development of Pakistan and OIC.\nSecretary General, The Standards and Metrology Institute for Islamic Countries (SMIIC), Turkey, Mr. Ihsan ÖVÜT, said that we need to develop common standards with the commitment to practice them to compete internationally.\nThe inaugural session was addressed by Ms. Ismat Gul Khattak, Director General, Pakistan National Accreditation Council, Mr. Akhtar A. Bughio, Director General, Pakistan Halal Authority, and Prof. Dr. Syed Ghulam Musharraf, Professor, Dr. Panjwani Center for Molecular Medicine and Drug Research, ICCBS, Karachi.\nThe inaugural session was attended by 800 participants online and 80 people participated in-person.\nThis 3-day event will end on Thursday, June 10.",
  "retrievedAt": "2025-08-11T20:49:31.414Z"
}
