{
  "title": "Foreign Secretary for turning COVID-19 related challenges into opportunity",
  "link": "https://www.app.com.pk/national/foreign-secretary-for-turning-covid-19-related-challenges-into-opportunity/",
  "date_published": "2021-06-08T15:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 8 (APP): Foreign Secretary Sohail Mahmood on Tuesday underscored that there was a need to turn the Covid-19 related challenges into opportunity.\nIn this context, he stressed the importance of pursuing self-reliance in vaccines and reinforcing national efforts for strengthening health security through international partnerships and collaboration.\nThe Foreign Secretary expressed these views as he and Executive Director, National Institute of Health (NIH), Prof. Dr. Aamer Ikram co-chaired Coordination Meeting on International Cooperation and Partnerships in Vaccine Production here hosted by the Ministry of Foreign Affairs, under the framework of its Science Diplomacy Initiative.\nThe meeting was attended by high-level representatives of the Ministry of National Health Services, Regulations, and Coordination; Drug Regulatory Authority of Pakistan (DRAP); National Command and Operation Centre (NCOC); Ministry of Science and Technology; Ministry of Commerce; Ministry of Industries and Production; Ministry of Climate Change; Higher Education Commission (HEC), and research organizations from the public sector in Pakistan.\nPakistan’s Permanent Representatives to the World Health Organization (WHO) and World Trade Organization (WTO) joined the meeting virtually.\nThe Foreign Secretary referred to various initiatives at the World Health Organization (WHO) and associated forums as well as the World Trade Organization (WTO) to support and facilitate developing countries’ access to vaccines.\nHe lauded efforts by the national stakeholders in handling the Covid-19 response and underlined the need for creating further synergies in building requisite vaccine infrastructure.\nExecutive Director, NIH presented a comprehensive overview of the existing work in the area of vaccines, including international partnerships, to facilitate local production and the challenges in this regard.\nBased on the existing research infrastructure, he noted, Pakistan can greatly benefit from commercialization-based collaborations with international partners.\nFurthermore, he stressed the need to strengthen regulatory compliance procedures as well to benefit adequately from international initiatives for vaccines.\nPakistan’s Permanent Representatives to the WHO Ambassador Khalil Hashmi, and WTO Dr. Mujtaba Piracha, updated the participants on various work streams at the WHO, including COVAX, and the potential benefits Pakistan can draw from them. Pakistan is also among the leading countries advocating patent waiver at the WTO for COVID-19 vaccines and more equitable access for developing countries.\nThe participants exchanged views on the challenges and opportunities for boosting local innovation efforts and benefiting from international collaboration. To this end, it was agreed to establish a Working Group, to be steered by Executive Director NIH, to develop a roadmap, with the Foreign Office facilitating outreach with international institutions and partners.",
  "retrievedAt": "2025-08-11T20:49:28.088Z"
}
