{
  "title": "Govt is committed to provide all fundamental rights to trans community: Mushaal",
  "link": "https://www.app.com.pk/national/govt-is-committed-to-provide-all-fundamental-rights-to-trans-community-mushaal/",
  "date_published": "2024-01-07T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP): Special Assistant to Prime Minister for Human Rights and Women Empowerment, Mushaal Hussain Mullick here on Sunday said that the government was committed to provide all fundamental rights to the transgender community across the country at gross root level.\nShe was addressing at the concluding ceremony at a workshop on wellness and communication development for non-binary and transgender persons, organized by AQ Khan Foundation.\nShe said that over 0.3 million transgenders were registered with concerned government department and the government was planning to a mass campaign with the name of “Dukhtar” rest of the country for the protection, jobs and skilled programs for trans community.\nTransgender persons are guaranteed all fundamental rights enshrined in the Constitution of Pakistan. In addition, the Act recognises transgender persons’ right to property inheritance, voting, education, employment, healthcare, assembly, access to public places and to hold public office, she said.\nMushaal underlined that trans community was playing its vital role for the development of the country and they were contributing at every level with their sincere efforts and hard working.\nShe said that the government would constitute committees at district level for collecting the proper data of transgenders, to provide the education, health care, jobs, social security, social media trainings, vocational trainings and other opportunities to make them a productive and economically independent citizens.\n“We all are human beings and have the rights to do every positive act for the development and promotion of the society and state”, she added.\nThe SAPM also appreciated the best efforts of Dareecha organiztion for the development of trans community.\nMs Jameela, Sheela, Usman and Aksh were also address and highlighted the problems of trans community.",
  "retrievedAt": "2025-08-10T23:27:27.163Z"
}
