{
  "title": "Hindu nationalists denigrate India’s founder Gandhi for advocating Hindu-Muslim unity: WP article",
  "link": "https://www.app.com.pk/national/hindu-nationalists-denigrate-indias-founder-gandhi-for-advocating-hindu-muslim-unity-wp-article-2/",
  "date_published": "2024-01-07T16:11:00.000Z",
  "source": "APP",
  "content": "WASHINGTON, Jan 07 (APP): Seventy-five years after his assassination, India’s founding father Mahatma Gandhi, who is regarded in the West as the exemplar of nonviolent protest, has become a casualty of India’s lurch toward Hindu nationalism, a prominent Indian journalist wrote in a leading U.S. newspaper, while highlighting that his killer is now being reimagined as a martyr and hero.\n“The Mahatma is now reviled by extremists for failing to establish a Hindu government in India when he had the chance. Instead, Gandhi advocated Hindu-Muslim unity in one secular state,” journalist Rana Ayyub, an outspoken critic of Indian Prime Minister Narendra Modi, said in her op-ed in The Washington Post.\nAt the outset, the article pointed out that on Gandhi’s 154th birthday anniversary, three of the top 10 trends on X (formerly Twitter) in India celebrated Nathuram Godse, the Hindu fundamentalist who assassinated the Indian leader. A month before that, it said, at one of the biggest Hindu festivals in India, posters of Godse were displayed along with those of Hindu deities in the state neighbouring Gandhi’s birthplace of Gujarat.\nGodse blamed Gandhi for the loss of Pakistan during partition (although Gandhi opposed partition), felt Gandhi was pro-Muslim and feared that Hindus would continue to lose ground if Gandhi remained as an influence on the government.\nGodse was a member of the Hindu nationalist paramilitary organization Rashtriya Swayamsevak Sangh (RSS), which is the ideological fountainhead of Prime Minister Modi’s Bharatiya Janata Party (BJP), Ms. Ayyub said. And since Modi was first elected in 2014, the narrative blaming Gandhi has taken hold.\n“On Colaba, a bustling, touristy street in Mumbai, a seller of memorabilia across from the Taj Mahal Palace hotel was not impressed when I picked a bronze souvenir depicting Gandhi on the 1930 Dandi March, protesting Britain’s tax on salt. He said the only people who buy things like that are ‘White foreigners’,”\nMs. Ayyub wrote.\n“The merchant, who hails from Gujarat, did not wish to be named but told me that a new generation of Indians has a different opinion of the man referred to as ‘the father of the nation.’ He tells me that Gandhi partitioned India to appease Muslims and appear as a humanist to the world.”\n“The world loves to put pseudo-secularists like him on a pedestal but we are now aware of his reality,” Ms. Ayyub quoted the merchant as saying.\n“This school of thought is not an aberration. Modi has referenced M.S. Golwalkar, who led the RSS at the time of the assassination, as a major inspiration. It was Golwalkar who had stated at a rally of the Hindu right-wing on Dec. 7, 1947, that ‘Mahatma Gandhi wanted to keep the Muslims in India so that the Congress [party] may profit by their votes at the time of election .\nWe have the means whereby such men can be immediately silenced, but it is our tradition not to be inimical to Hindus. If we are compelled, we will have to resort to that course too.’ A month later, Gandhi was killed.”:\nMs. Ayyub wrote: “At the Sabarmati Ashram in Gujarat, one of the homes of the Mahatma, I encountered teenagers posing for selfies and picnicking on the lawn. When I asked questions about Gandhi, they seemed uninterested; one remembered that his face is on the Indian rupee. A college student mocked Gandhi, writing him off as merely the grandfather of ‘Pappu’ (a derogatory term coined for Indian opposition leader Rahul Gandhi, who is not in fact related to the Mahatma).\n“Gandhi has never been this unpopular. The 1982 Richard Attenborough biopic about him won eight Academy Awards and introduced a new generation to the Indian independence fighter. As recently as 2006, a Bollywood blockbuster “Lage Raho Munnabhai” saw Gandhi become cool again on the streets of India. The film depicts a small-time con man who in an attempt to win back his lost lover goes through a transformation as he accidentally runs into the works and writings of Gandhi. Through Gandhi’s ideas of nonviolence, social justice and secularism, the protagonist is able to fight societal evils and in the process win back his idealistic lover. A catchy blockbuster song reminisces about the life of Gandhi and invokes him to return from the dead to save the country.\n“However, since ultranationalist Hinduism took hold, Gandhi’s image has floundered. In 2019, a prominent member of parliament from Modi’s BJP, Pragya Singh Thakur, called Godse a ‘patriot’ on the floor of the house. Only after a national outcry did Modi condemn her words, calling them ‘very bad and very wrong for society.’\n“Still, the Hindu Mahasabha, another extension of the RSS, now celebrates Gandhi’s murder in public as ‘Shaurya Divas’ (Bravery Day), and on the 71st anniversary of Gandhi’s assassination, in 2019, re-created his murder for the cameras to loud applause from followers. In June of this year, Modi’s Union Minister, Giriraj Singh, called Gandhi’s assassin ‘India’s good son’ while speaking to reporters during a tour. The Congress Party’s general secretary, K.C. Venugopal said, ‘The PM’s silence tells you he approves of their every word.’\n“Over the past several years, history textbooks in India have been revised to excise facts that don’t support the favoured narrative. ‘The background of Gandhi’s assassin Nathuram Godse … and the fact that Gandhi stood for Hindu-Muslim unity and opposed Hindu majoritarianism after Independence have all been removed,’ Outlook magazine revealed this year.\n“Atul Dodiya, one of India’s leading artists, is trying to keep the Mahatma alive through his paintings and retrospectives. An artist deeply influenced by Gandhi, he says his 1997 work on him titled ‘Lamentation’ was a result of the despair he felt after one of the worst communal riots in the history of India, the Mumbai riots that followed the 1992 demolition of the iconic Babri Masjid by leaders of the BJP and the RSS. He says it was the ultimate assault on Gandhian ideas.\nMore than two decades of documenting Gandhi, and more than 200 paintings for various galleries later, he is trying to preserve the hope that India will not turn its back on the man who sacrificed his life for the freedom of the nation.\n“But in today’s India, the prime minister invokes Gandhi only when he needs him, usually in international gatherings.”",
  "retrievedAt": "2025-08-10T23:27:07.301Z"
}
