{
  "title": "GRCP hosts 2nd annual Gandhara Citrus festival to boost agricultural tourism",
  "link": "https://www.app.com.pk/national/grcp-hosts-2nd-annual-gandhara-citrus-festival-to-boost-agricultural-tourism/",
  "date_published": "2024-01-07T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 07 (APP): Gandhara Resource Center Pakistan (GRCP) proudly unveiled the Second Annual Gandhara Citrus Festival on Sunday with a dynamic celebration held in Taxila.\nThis event aimed to stimulate agricultural tourism by showcasing the distinct citrus offerings of the region while highlighting its rich Buddhist heritage, GRCP public relations officer said.\nThe festival, sponsored by PTCL-Ufone and the Center for Culture and Development (C2D), among others, featured primary objectives. Firstly, it sought to promote a diverse range of oranges from Khanpur, fostering enduring connections between orange producers and exporters nationally and internationally.\nSecondly, it aimed to spotlight and exhibit the ancient stonework of the Gandhara civilization, fostering connections between artisans and exporters.\nThe festival offered many activities, including live painting sessions, exhibitions, and promotions of locally harvested citrus fruits and homemade products. Additionally, it served as a platform to showcase the intricate Stone Carving Art of the Gandhara civilization, contributing to the advocacy and promotion of local heritage.\nIn a dedicated effort to promote environmental preservation and food security, the festival engaged the private sector, exporters, researchers, and academia to establish connections that support the preservation of the Gandhara-themed civilization and stonework.\nThe vibrant marketplace at the festival boasted numerous food stalls, handicrafts, and agricultural product displays, attracting a considerable number of vendors, he added.\nThe event was expertly orchestrated by stage secretary Sadia Atta and featured distinguished speakers, including Malik Fateh Khan- Advisor National Rural Support Program-Environment & Natrual Resource Management, Khwaja Mazhar from agri-tourism, Dr. Waseem (Director Undergraduate Studies-University of Haripur) Dr. Riaz Alam-Director Pakistan Agricultural Research Institute-PARC Tarnab Farm Peshawar, Yosuf Shah- Pak Olives, Nighat Un Nisa (Foreign Commonwealth Development Organization), Imran Siddiqui (Additional Secretary Ministry of Foreign Affairs), and Ahmed Khan (President Welfare Adventure Societies-HITECH University Taxila).\nThe speakers emphasized the significance of branding local farm products, underscoring its pivotal role in elevating the agricultural sector. To ensure the seamless execution of the event, a dedicated team of 50 volunteers from HITECH University supported the core committee of GRCP.\nThe Gandhara Citrus Festival witnessed a diverse turnout, with active participation from thousands of women, children, and adults from Taxila, Haripur, Wah, Mansehra, Chakwal, Talagang,Rawalpindi, and Islamabad. Attendees commended the meticulous efforts of the GRCP core committee, consisting of Sara Mehmood, Riaz Ahmad, Iftikhar Ahmad, Malick Ushtar and Iftikhar Siddiqi, for organizing such a unique festival. The event is anticipated to propel Taxila into the spotlight as a hub for heritage and agritourism.\nGRCP official further said that for those unable to attend in person, Asif Farid and Sania Shah ensured widespread coverage by broadcasting the event live on social media platforms, contributing to the festival’s broader reach and impact.\nHe said that with cooperation of district administration particularly Deputy Commissioner Rawalpindi, Assistant Commissioner Taxila and security provided by local police department, the event went very smoothly. GRCP appreciate and extends their deepest gratitude towards cooperation of government officials in execution of 2nd Gandhara Citrus Festival.\nThe Gandhara Citrus Festival stands as a testament to GRCP’s unwavering commitment to promoting the cultural and agricultural treasures of Taxila, offering a promising vision for the region’s future in the realms of heritage and agritourism.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:27:21.875Z"
}
