{
  "title": "Talented Science students can apply for participating in Int’l Science Olympiads",
  "link": "https://www.app.com.pk/national/talented-science-students-can-apply-for-participating-in-intl-science-olympiads/",
  "date_published": "2024-01-07T09:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP):The talented Science students can register through the STEM Career Programme for participating in the upcoming International Science Olympiads (ISOs) scheduled to be held in the month of July, 2025.\nInternational Science Olympiads include 66th International Mathematical Olympiad (IMO) in Australia, 57th International Chemistry Olympiad (IChO) in UAE, 36th International Biology Olympiad (IBO) in Philippines and 55th International Physics Olympiad (IPhO) in France.\nAccording to an official source, the STEM Career Programme is a joint venture of HEC and PIEAS and aims to inspire youth of the nation to opt for careers in Science, Technology, Engineering and Mathematics (STEM) and prepare them for participation in the annual International Olympiad in Physics, Chemistry, Biology and Mathematics, exhibiting the country’s natural talent in these competitions.\nAbout the eligibility criteria, the official source revealed that the students must have aggregate marks of 60 percent or more in core subjects i.e. Physics, Chemistry, Biology and Mathematics in last exam while the age should be less than 20 years at the time of participation in ISOs.\nThe current students of Pre-9th, 9th, 10th and 11th (Matric/O Level, or F.Sc-1/ A-Level-1) can apply for the programme. While students who are currently studying in F.Sc (Part-II)/A-Level (Part-II) and University Students are not eligible to apply.\nThe intended participants can register through www.stem.edu.pk till the last date February 18, 2024 while the nationwide screening test will be conducted in the major cities of the country on March 03, 2024.\nTop 50 students are invited for one week fully residential training camp in each of the NSTC subject on the basis of their performance in the Screening Test. The grooming/selection process gradually narrows down this number to 4-6 best students in each of these subjects.\nOlympiad teams of 4-6 students are selected through a series of subsequent training camps during a year for participation of International Science Olympiads to represent their country.\nPakistan is regularly participating in the International Physics Olympiad since 2001, in the Mathematics Olympiad since 2005 and in the Biology and Chemistry Olympiad since 2006. The performances of Pakistani teams in these Olympiads have been quite encouraging.\nThe prizes for the winning students include Gold medal (Rs. 120,000), Silver medal (Rs. 80,000), Bronze medal (Rs. 60,000), Honorable mention (Rs. 50,000) and International Participation (Rs. 20,000).\nBesides the cash prizes and certificates, PIEAS will also offer admissions to the members of Olympiads Teams in its BS Programmes without any entrance examination.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:27:46.797Z"
}
