{
  "title": "Level playing field enabled independent candidates to emerge as single largest group in general elections: PM",
  "link": "https://www.app.com.pk/national/level-playing-field-enabled-independent-candidates-to-emerge-as-single-largest-group-in-general-elections-pm/",
  "date_published": "2024-02-12T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday reiterated that the caretaker set-up had provided a level playing field to all political parties during the currently concluded polls and being a ‘free and fair’ process, a large number of independent candidates backed by the Pakistan Tehreek-e-Insaf emerged as the largest single group on the national and provincial assemblies seats.\nHe stressed that allegations of rigging were generated through social media which were based upon misconceptions and contrary to the ground realities, and said that throughout the country’s democratic history, people had always questioned the electoral process.\nSuch results indicated the transparency and non-interference by any quarters, he emphasised.\nAddressing a presser at the PM House, the prime minister said that there might be shortcomings or other minor issues, but by and large, the elections were held in a manner in which the entire nation and the law enforcement agencies deserved kudos despite various security challenges.\n“Where the PTI has public support, it got that and they have results never dreamt of during 2018,” he said, adding that the loyalists of jailed PTI leaders were emerged as returned candidates in the general elections but no one was appreciating that aspect of the neutrality of the caretaker government.\nThe prime minister, to a question, said that despite various threats prior to the February 8 election day and two terrorist attacks in the Balochistan province, all the stakeholders deserved appreciation over the ‘big achievement’ for peaceful conduct of the polls.\nHe also brushed aside any threats to integrity of the country due to certain protests and agitations held by certain parties, saying “it is an absurd chronology” to relate the situation with Dhaka during 1971.\n“These are the mere rhetoric. Pakistan is a very stable and responsible country. Holding of a peaceful protest is the democratic right of the people,” he said, however, hastened to add that no government could allow the situation leading to chaos or anarchy.\nResponding to a query, he maintained that over 60 million voters had exercised their constitutional right to elect their favourite candidates under ‘a pressure free environment’.\nThe prime minister said that the delay in the announcement of official results were caused by the specific procedures regarding compiling of results at 92,000 polling stations and credited the Election Commission of Pakistan (ECP) for conducting the massive exercise in a smooth manner.\nHe said that the official results were announced within 36 hours while during the 2018 elections, it took almost 66 hours. There might be irregularities but the relevant forums were available to address those grievances.\nIn Sweden, the similar exercise almost took 10 to 11 days while in Indonesia, almost a month was consumed to furnish results, he added.\nTo another question, the prime minister said that mobile phone services were suspended on the polling day due to security threats as the government could not compromise on the security of people.\nOn the other hand, the broadband internet services were available on that day, enabling the people to get connected, he said and rebuffed the allegations that the move was aimed at managing the social media.\nHe said there were other occasions throughout the year, when the mobile services had been suspended to avert security threats.\nPrime Minister Kakar, responding to a question regarding the statements of certain countries over the recently held elections, said that if there were any allegations, they would look into them according to the laws of the land and not on the demands of any country.\n“We will do it if is required under the country’s laws,” he said, adding that the demands of his countrymen were more important to the government and advised that the statements by certain US Congressmen should not be taken as ‘sacrosanct’ or gospel truth as they were not speaking on part of the government.\nThe elections in Pakistan were held in a free and fair manner and there was no institutional mechanism to favour any group, he stressed.\nResponding to a query about the prospects of forming a commission to investigate the polls allegations, he maintained that it would be up to the upcoming elected government to make assessments over such demands and decide, but he would not speculate about it.\nAbout the security threats, he said that there were credible reports of terrorist attacks in the country prior to the election date which could not be divulged in the public domain. A leader of the banned Daesh was neutralized during an operation in Qilla Saifullah who was involved in terrorist attacks in Balochistan.\nThe caretaker prime minister also agreed with the President’s views over the need of introduction of electronic voting machines (EVMs) and said that according to his personal view, the political parties should hold threadbare discussions in the next parliament over the issue and legislate if required so that the new electoral system could be more acceptable to all.\nHe expressed the optimism that after the current transitional period was over and the new government was formed, there would be a positive wave hitting the markets and businesses, adding that economic challenges would still await the next government.\nThe prime minister also hailed the entry of new voters and said that they would make positive contributions to the democratic process in the future.\nTo a question, he said that the International Monetary Fund (IMF) had no issue with the privatization process of the caretaker government.\nRestructuring of the PIA (Pakistan International Airlines) had almost been done, and it was in the implementation process, however, it was up to the upcoming government to decide either way, he added.\nExpressing his disapproval of the incidents of political confrontation in the recent years, he said that all the political parties and society should move beyond such negative trends leading to animosity and tiffs. “We should get rid of this vicious circle of confrontation by changing attitudes. Political differences should not lead to rifts within the society,” he added.\nHe also wished speedy recovery to Mohsin Dawar, a candidate in North Waziristan and said that violent way of protest and agitation should not be taken to a point of anarchy and chaos.\nAbout formation of the new government, the prime minister said that they were eager to hand over reigns of the government to the elected representatives of the people. The speaker of the National Assembly would initiate the required process and he thought that the exercise could take eight to nine days depending upon the outcome of the negotiations of the political parties.",
  "retrievedAt": "2025-08-11T00:36:25.733Z"
}
