{
  "title": "ECP directs re-polling in 7 polling stations of NA-253, PB-9 Kohlu on Feb 16",
  "link": "https://www.app.com.pk/national/ecp-directs-re-polling-in-7-polling-stations-of-na-253-pb-9-kohlu-on-feb-16/",
  "date_published": "2024-02-12T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP):The Election Commission of Pakistan (ECP) has notified the conduct of re-polling in 7 polling stations in NA-253 and PB-9 Kohlu on Feb 16.\nAccording to a notification, the polling in these constituencies was delayed due to law and order situation. The commission has instructed the chief secretary.\nThe polling in these constituencies was postponed due to a law and order issue. The commission has instructed the chief secretary of Balochistan, the Inspector General of Balochistan, and other law enforcement agencies to undertake essential measures to guarantee fair and impartial elections.\nFollowing the hearing of election petitions, the Election Commission of Pakistan (ECP) has instructed Returning Officers from six National and Provincial assembly constituencies to refrain from announcing final results.\nA two-member commission bench led by Nisar Durrani, along with Member Balochistan Shah Muhammad Jatoi, presided over the hearing of a petition challenging election results. The bench has restrained the announcement of final results for two provincial assembly constituencies: PP-14 Naseerabad, PP-44 Quetta, PP-33 Gujrat, PP-126, and PP-128 Jhang.\nBabar Awan, representing PTI, urged for stringent punishments for the returning officers found to have violated their oath. Furthermore, he pressed for a recount in NA-106 Toba Tek Singh and requested the relevant returning officer to furnish a report.\nMeanwhile, the ECP has instructed the RO Sialkot to halt the issuance of the success notification for Khawaja Asif, a winning candidate of NA-171. This directive was issued during the commission’s review of a petition filed by Rehana Dar, an independent candidate of NA-171, who asserts victory with a lead of 50,000 votes as per Form 45. The commission directed the returning officer to provide a detailed report and postponed the hearing until February 14th.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:35:52.055Z"
}
