{
  "title": "LHC dismisses petitions challenging victories of Maryam Nawaz, others",
  "link": "https://www.app.com.pk/national/lhc-dismisses-petitions-challenging-victories-of-maryam-nawaz-others/",
  "date_published": "2024-02-12T18:48:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 12 (APP):The Lahore High Court (LHC) on Monday dismissed petitions challenging election victories of 18 candidates including Maryam Nawaz, Hamza Shehbaz, Khawaja Asif, Atta Tarar, Saiful Malook Khokhar of the Pakistan Muslim League-Nawaz (PML-N) and Abdul Aleem Khan of Istehkam-e-Pakistan Party (IPP).\nThe court dismissed the petitions for not being maintainable and observed that reasons would be recorded in the detailed verdict. The court also asked the petitioners to approach the Election Commission of Pakistan (ECP) for redressal of their grievances.\nJustice Ali Baqar Najafi announced the reserved verdict on petitions filed by Rihana Dar, Mian Shahzad Farooq and other runner-up independent candidates. The court had reserved its verdict on maintainability of the petitions after hearing arguments of the counsel for petitioners, ECP and PML-N, earlier in the day.\nIn the course of arguments, the counsel for runner-up candidates argued that the returning officers (ROs) manipulated vote counts in Form 45 and 47. The court was requested to set aside the victory of the respondent candidates.\nHowever, counsel for the ECP and PML-N raised objections on maintainability of the petitions and requested to send all these petitions to the commission.\nThe counsel for ECP further submitted that several petitioners had approached the commission and notices had been issued on their applications. He further submitted that the ECP was the first available forum for redressal of the grievances.\nMeanwhile, the court also dismissed a petition filed by independent candidate Salman Akram Raja regarding  success of Istehkam-e-Pakistan Party (IPP) candidate Aun Chaudhry from NA-128 constituency.\nThe court dismissed the petition for not being maintainable and ordered the petitioner to approach the ECP for redressal of his grievance. Justice Ali Baqar Najafi announced the reserved verdict on the petition filed by Salman Akram Raja.The court had reserved its verdict on maintainability of the petition after hearing arguments of the parties, earlier in the day.\nThe petitioner had emphasized that the issue pertained to violation of rule, not vote counting. He stressed the necessity of candidates’ presence during result compilation as per the Election Act. He questioned whether results could be validated in the candidate’s absence and highlighted that results of only 13 polling stations of NA-128 constituency were compiled in their presence.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:35:43.819Z"
}
