{
  "title": "ECP dismisses rigging allegations , assures review of isolated incidents",
  "link": "https://www.app.com.pk/national/ecp-dismisses-rigging-allegations-assures-review-of-isolated-incidents/",
  "date_published": "2024-02-12T18:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP):The Election Commission of Pakistan (ECP) has firmly dismissed accusations of election rigging, but acknowledged some isolated incidents that can be resolved through appropriate channels.\nAn ECP spokesperson stated that the Election Commission ensures swift complaint resolutions even beyond office hours.\nRegarding slow announcements of results, he said it wasn’t right to risk lives or doubt result accuracy just to announce election results quickly. Despite delayed results, no party significantly benefited or suffered.\nHighlighting problems, he said because of the absence of mobile network coverage, connectivity issues, distant and remote locations of polling stations, nighttime travel, adverse weather conditions, including snow in certain areas, and incidents of losing direction on highways, the polling staff encountered transportation challenges. Additionally, due to candidate supporters staging sit-ins, further difficulties arose for the polling staff.\nTerrorism in Balochistan and Khyber Pakhtunkhwa posed major obstacles to holding the elections, particularly due to the casualties among security personnel and civilians near polling stations.\nIn such circumstances, there was a danger of jeopardizing the entire election process by endangering human lives in the pursuit of expediting the process, particularly in relation to the results. Priority measures were implemented to mitigate this risk. In addition to banning mobile phones, ensuring peace and orderliness during the polling process and safeguarding polling staff and materials involved organized group transportation.\nDespite facing challenges and obstacles, the Election Commission effectively ensured a peaceful and orderly election process on February 8, successfully completing the gigantic operation.\nHe remarked that this achievement was acknowledged by civil society organizations, local and international observers, and the media recognized and commended the polling arrangements, training of polling staff, discipline at the polling stations, and the significant turnout in the voting process, all of which contributed to the success of the electoral process.\nHe mentioned that there was widespread speculation that the elections might not be held on the scheduled date.\nHowever, the Election Commission undertook all necessary practical measures to dispel this notion and successfully conducted the elections as planned.\nHe said that the top priorities for the successful February 8 elections were keeping the process peaceful and orderly, ensuring the safety of polling staff, securing the transportation of polling materials, and accurately processing results. Despite security challenges, the main focus remained on ensuring peaceful voting.\nHowever, it is noteworthy that in the areas where the election results were delayed, there was a mixed trend of results and no single party benefited or suffered in any way.\nIn the 2018 general election, the first result came in at 4 am, while in 2024, it was at 2 pm. Also, in 2018, results took about 3 days to announce, but this time, except for some areas, it only took one and a half days. The results were finalized during the day.\nHowever, the election management system (EMS) mobile app installed on the presiding officers’ phones needed cellular connectivity to electronically transmit Form 45. As cellular signals were blocked for security purposes, presiding officers and returning officers were unable to send electronic data. Additionally, the outage of mobile signals disrupted routine coordination and administrative transport, further contributing to delays.\nIn order to ease the security situation and coordination in many parts of the country, the offices of five to six returning officers will be set up in one place, but in those offices where the arrival of polling staff has increased the rush, there will be offices of returning officers in many places. In front of\nA large crowd also gathered, due to which the polling staff faced difficulties in submitting the polling materials, which also affected the processing of the election results.\nIn certain parts of Balochistan, helicopters were deployed to transport polling staff and materials. To improve security and coordination nationwide, multiple returning officers’ offices were consolidated in some areas, leading to congestion and challenges for polling staff in submitting materials, impacting the election result processing.\nAccording to Section 90 of the Elections Act, 2017, the Presiding Officer is required to personally deliver the election materials to the Returning Officer’s office. It’s important to note that the EMS system installed in the Returning Officer’s office operates independently of connectivity and has worked effectively.\nThe Election Commission appreciated the federal and provincial governments, law enforcement agencies, Pakistan Army, other institutions, and polling staff for their role in maintaining peace during the elections.\nIn some areas of Balochistan, helicopters had to be used to transport polling staff and polling materials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:35:43.811Z"
}
