{
  "title": "Speakers of webinar emphasizes active role of women in science to foster economic prosperity",
  "link": "https://www.app.com.pk/national/speakers-of-webinar-emphasizes-active-role-of-women-in-science-to-foster-economic-prosperity/",
  "date_published": "2024-02-12T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP):Speaker at a webinar titled “Women in Science: Shaping Tomorrow’s Innovations” held here Monday emphasized the active role of women in science, technology, and innovation to foster economic prosperity and sustainable development.\nThe webinar was arranged by the Commission on Science and Technology for Sustainable Development in the South (COMSATS) to commemorate the International Day of Women and Girls in Science.\nThe event, held in a hybrid format at the COMSATS Secretariat in Islamabad, brought together a diverse panel of speakers to explore the pivotal role of women in Science, Technology, Innovation, and Engineering. Participants from around the globe joined the webinar.\nExecutive Director of COMSATS, Ambassador Dr. Mohammad Nafees Zakaria delivered the opening remarks and stressed the importance of equal participation of women alongside men in addressing global challenges.\nDr. Zakaria reiterated COMSATS’ commitment to advocating for and promoting gender equality in the realm of science, technology, and innovation worldwide.\nHe highlighted the significance of this day as a call to action, acknowledging women’s invaluable contributions to science and the ongoing journey towards gender equality in the field.\nDr. Zakaria emphasized that women bring a unique perspective to scientific endeavors, enhancing them with diversity in thought and experience, thereby contributing to a more comprehensive understanding of complex issues.\nA distinguished member of the Senate of Pakistan and recently appointed CEO of Gavi, the Vaccine Alliance Senator Dr. Sania Nishtar expressed appreciation to COMSATS for organizing this significant event.\nIn her video message, Dr. Sania underscored that achieving gender equality in science, technology, and innovation is not only a matter of social justice but also essential for fostering economic prosperity and sustainable development.\nShe highlighted the evolving nature of innovation, which now encompasses a broader range of influences beyond traditional science and technology advancements, particularly environmental and societal challenges.\nIn this new paradigm, the socio-economic empowerment of women emerges as a crucial catalyst for driving innovation forward.\nPresident of The World Academy of Sciences (TWAS), Prof. Dr. Quarraisha Abdool Karim shared valuable insights into her three decades of research contributions that have significantly influenced the global HIV prevention efforts. She highlighted that developing countries must maximize the potential of their Research and Innovation systems while promoting gender equality in scientific fields.\nHe said that integrating gender considerations into the Science, Technology, and Innovation landscape can provide developing countries with a significant competitive edge.\nProfessor Dr. Rana Dajani from Hashemite University in Jordan emphasized the importance of nurturing an inclusive environment in academia and research. She shared her experience of introducing a simple yet impactful model and activity ‘We Love Reading’ an inter-generational initiative, promoting healing, connection, and positive self-development through the joy of reading.\nFurther, Dr. Dajani highlighted that a significant imbalance in women’s representation persists across various levels of the professional hierarchy, particularly in leadership roles.\nDespite these hurdles, women and girls are increasingly empowered to contribute to addressing global challenges, from poverty alleviation to climate change.\nThe webinar not only honored the accomplishments of women in science but also spurred transformative action, reigniting the dedication to fostering a supportive atmosphere for women and girls in scientific disciplines.\nThe insightful discussions underscored the necessity for ongoing endeavors and partnerships to ensure that women and girls have integral roles in shaping the future of science and innovation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:36:37.139Z"
}
