{
  "title": "NUML organizes entrepreneurship Gala 2024",
  "link": "https://www.app.com.pk/national/numl-organizes-entrepreneurship-gala-2024/",
  "date_published": "2024-12-10T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):The Faculty of Management Sciences at the National University of Modern Languages (NUML) Tuesday organized the Entrepreneurship Gala 2024, showcasing the creative talent and entrepreneurial spirit of the students.\nThe event, aimed at promoting innovation and exploring alternative employment avenues, featured an array of stalls that highlighted Pakistan’s rich cultural diversity and students’ entrepreneurial potential.\nThe gala featured a wide range of products, including traditional dresses, shawls, stuffed toys, paintings, calligraphy, perfumes, handicrafts, jewellery, shoes, mobile accessories, garments, arts, food items.\nEach stall reflected the creativity and business acumen of NUML students, offering them a platform to blend theoretical knowledge with practical skills in marketing, management, and entrepreneurship.\nRector NUML, Major Gen (r) Shahid Mehmood Kayani HI(M), along with the Chief Guest, Sardar Yasir Ilyas Khan, DG NUML, Brig Shahzad Munir, visited different stalls and interacted with students. Rector NUML commended the students’ efforts, highlighting their role as the future of the nation.\n“Our youth, which constitutes 64% of the population, has immense potential to drive economic prosperity and national development. Events like this not only encourage students but also prepare them for professional challenges,” he remarked.\nThe Rector also thanked Sardar Yasir Ilyas Khan for his support and called for continued collaboration to empower NUML’s students.\nSardar Yasir Ilyas Khan lauded the confidence and ingenuity of the students. “These young individuals are the future of Pakistan,” he said.\nHe also praised NUML’s initiative for providing students with opportunities to showcase their entrepreneurial talent and emphasized the need to overcome marketing challenges in Pakistan.\nYasir Illyas Khan expressed his willingness to collaborate with NUML to create an environment that fosters innovation and supports young entrepreneurs.\nHe said the Gala offered a unique blend of fun, learning, and skill development. By providing students with hands-on experience in entrepreneurship, NUML aims to equip them with the tools necessary to build successful careers in a competitive world.\nThe university plans to organize similar events in the future to further encourage innovation and contribute to Pakistan’s economic growth.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:30:31.479Z"
}
