{
  "title": "Govt. committed to provision of equal rights to all citizens: PM",
  "link": "https://www.app.com.pk/national/govt-committed-to-provision-of-equal-rights-to-all-citizens-pm/",
  "date_published": "2024-12-10T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday said that the government was committed to provision of equal opportunities to all communities living in Pakistan so that they could excel in different fields of life by protecting their basic human rights.\nAddressing a ceremony held here in connection with the observance of International Human Rights Day, the prime minister said that the day highlighted the government’s commitment towards upholding the great cause of human rights and protecting them, besides empowering those communities of the country that needed protection under the challenging circumstances.\nHe said that all the communities living in Pakistan enjoyed equal rights.\n“It is our priority and the government is committed to providing opportunities to all on equal basis,” he added.\nAbout 1400 years back, Islam and the Holy Prophet (Peace Be Upon Him), had enunciated the contours of basic human rights and equality of humans, he said, adding the Founder Quaid-e-Azam Muhammad Ali Jinnah, in his historic speech on 11 August, had emphasized upon the equal rights of all citizens regardless of the creed, cast and religion.\nThe prime minister stressed that today, they committed themselves to do more in this regard to be able to stand with pride in front of nation, posterity and the entire humanity.\n“It is a long journey to traverse’, he said, adding that with  collective efforts, they should move ahead; thrash out issues and carve out their way for their future generation and to meet the expectations of the people of the country.\nThe prime minister further recollected that as chief minister Punjab, though it was not his constitutional responsibility, he also supported residents of other provinces with various educational and financial initiatives.\nHe mentioned the steps taken during his tenures as chief minister which included Punjab Endowment Fund, award of scholarships and laptops on merit, in which all the provinces, Gilgit Baltistan and Azad Jammu and Kashmir were included.\nHe also referred to establishment of center against women violence in Multan, Zaiwer-e-Taleem programme with scholarship in Southern Punjab, and initiatives to end brick kilns child labouer. About 90,000 children were forced to brick kiln labour who were later enrolled in schools, he added.\nRecently, the prime minister said, the federal government was sending 1,000 graduates from all parts of the country, including Gilgit Baltistan, to China to seek highest technical knowledge and education.\nHe also assured the law minister to take up the issue of stranded Pakistanis with his counterpart in Malaysia.\nThe prime minister commended the efforts of law minister and other stakeholders for the promotion and protection of human rights.\nMinister for Law, Justice and Human Rights Azam Nazeer Tarar, in his remarks, said that on 10 December, 1948, the world adopted the human rights declaration ensuring that there would be no discrimination among humans.\nHe said almost all the provisions of the universal declaration were based upon the teachings of Holy Prophet Muhammad (PBUH) and were also incorporated in the Constitution of Pakistan.\nThe minister reiterated commitment to remove the disparity among the society by upholding the basic human rights and stressed that they all had to discharge this onus as a mission.\nHe highlighted that the Ministry of Human Rights, in collaboration with all the provincial governments and Gilgit Baltistan, had been working on the set targets regarding women’s rights.\nHe mentioned achievements of his ministry in the realms of legislation over human rights which included, Zainab Alert, Response and Recovery, Legal Aid and Justice Authority, Awaz app, 24/7 help services over legal issues, and functioning of different commissions including the human rights, and the status of women etc.",
  "retrievedAt": "2025-08-10T13:28:54.198Z"
}
