{
  "title": "Senator Rubina Khalid pays tribute to Shaheed Mohtarma Benazir Bhutto’s vision of women empowerment",
  "link": "https://www.app.com.pk/national/senator-rubina-khalid-pays-tribute-to-shaheed-mohtarma-benazir-bhuttos-vision-of-women-empowerment/",
  "date_published": "2024-12-10T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid, paid tribute to Shaheed Mohtarma Benazir Bhutto’s unparalleled struggle for women’s economic independence.\nShe announced a series of events at BISP’s central and regional offices to honour Bibi Shaheed on her 17th death anniversary, including Quran recitation, Quaid-e-Azam Muhammad Ali Jinnah’s birthday celebrations, and Christmas festivities.\nSpeaking at BISP Headquarters, Senator Rubina Khalid recalled Bibi Shaheed’s famous words: “Skill is your capital that no one can take away from you.”\nShe emphasized the transformative potential of skills in reducing unemployment across Pakistan.\nUnder the Benazir Hunarmand Program, inspired by Bibi Shaheed’s vision, 40 semi-skilled individuals from deserving backgrounds will receive international-standard skill training in the program’s pilot phase, with arrangements being made to facilitate their employment abroad.\nIn her opening remarks, Rubina Khalid reflected on the significance of December as a month of both joy and sorrow.\nShe highlighted the birth anniversary of Quaid-e-Azam Muhammad Ali Jinnah and the Christmas festivities shared with the Christian community as moments of happiness.\nAt the same time, she acknowledged the grief of Bibi Shaheed’s martyrdom, which continues to resonate deeply.\n“This December 27 marks 17 years since Bibi Shaheed left us, but her loss remains fresh in our hearts,” she said.\nShe continued, “To honour her legacy, we are launching a series of commemorative events under the BISP platform”.\nSenator Rubina Khalid praised Bibi Shaheed’s dedication to empower women economically, describing her efforts as unparalleled.\nShe also credited the former President of Pakistan, Asif Ali Zardari, for declaring women households eligible for financial assistance under BISP.\nShe highlighted that 9.6 million families are currently benefiting from the program, with the number expected to reach 10 million soon.\nThe senator underscored the growing international recognition of BISP’s social protection programs.\nShe recalled how, in its early years, BISP teams traveled to countries like Mexico to learn from their social protection initiatives. Today, countries such as Uganda and others from West Africa visit BISP to study its successes and consider implementing similar programs in their own nations.\nRubina Khalid announced that BISP is actively engaging with international organizations, including the Bill & Melinda Gates Foundation, Lives & Livelihood Fund, Islamic Development Bank, and other skill training institutions, to introduce high-quality skill training programs for its beneficiaries.\n“This movement requires collective effort,” Senator Rubina Khalid concluded. “May Allah Almighty grant us the strength to utilize our resources effectively and contribute to Pakistan’s development”, she prayed.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:26:14.553Z"
}
