{
  "title": "National Food Security Ministry to organize two-day olive gala on Dec 13",
  "link": "https://www.app.com.pk/national/national-food-security-ministry-to-organize-two-day-olive-gala-on-dec-13/",
  "date_published": "2024-12-10T10:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):The Ministry of National Food Security and Research, in collaboration with key development partners, is set to host the Grand National Pak-Oilve Gala 2024 on December 13-14, aiming to promote and accelerate large-scale olive cultivation in the country for achieving the goal of self-sufficiency in edible oil production.\nThe two-day event will also highlight the significant progress and potential of edible oil production in Pakistan, showcasing the country’s growing capabilities in this vital sector, said Dr Tariq, National Project Director for Pakistan’s Promotion of Olive Cultivation.\nTalking to APP here on Tuesday, he said that olive output during the current was expected to grow by 22 per cent as compared to the output of the corresponding period of the last year, adding that over 140 tons of olive oil were extracted during the last crop season.\nDuring the current season, love output is expected to cross 160-180 tons as output in terms of olive fruit and oil had witnessed significant growth of 22 per cent, he said adding that estimation was based on the area under crop cove, which he added could be further increased.\nIn an effort to boost local edible oil production and support the government’s initiatives to increase green cover and mitigate potential climate impacts on the ecosystem, over 1 million olive plants will be planted during this year’s tree plantation drive, he added.\nDr Tariq further informed that these olive plants will be planted during two tree plantation drives: the first drive will take place from September to November, and the second from March to April.\nOver 5.6 million plants have already been planted and there is large-scale cultivation of olive trees for olive oil. About 500,000 to 800,000 olive oil nursery plants are planted every year, he added.\nIn addition to the olive plantation efforts across potential areas of the country, a target has been set to install drip irrigation systems over 10,000 acres of water-stressed areas, he said adding that this initiative aims to facilitate olive cultivation on marginal lands and enhance the farm income of local farmers.\nMeanwhile, he noted that matching grants would be provided for the installation of processing plants through public-private partnerships. This support will facilitate the proper processing and value addition of farm produce, ensuring a fair rate of return for local farming communities.\nDr Tariq further informed that matching grants would also be provided to local olive farmers for the purchase of storage containers. This will help ensure quality and adherence to international standards for the production of extra-virgin olive oil, ultimately boosting the country’s exports.\nThere is significant potential for wild olive grafting in areas such as AJK, Gilgit-Baltistan, and FATA. A grafting drive was launched in these regions, which proved successful, resulting in a large number of wild olive trees being grafted to produce olives, he added.\nHe said that the government was also working to enhance the value addition of olive products to promote the cottage industry to enhance the income of rural women to make them economically empowered and independent.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:19:08.896Z"
}
