{
  "title": "Muqam urges on International Community to take action against India about violation of human rights in IIOJK",
  "link": "https://www.app.com.pk/national/muqam-urges-on-international-community-to-take-action-against-india-about-violation-of-human-rights-in-iiojk/",
  "date_published": "2024-12-10T07:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):Federal Minister for Kashmir Affairs and Gilgit Baltistan and SAFRON Engineer Amir Muqam urged on the international community to take action against India about the human rights violations in IIOJK.\nThe minister said in his message on the eve of International Human Rights Day, he said that Today, the whole world is celebrating International Human Rights Day and this day reminded the world to uphold the protection of human rights.\nOn International Human Rights Day, we should not forget our brothers and sisters in the illegally occupied Indian occupied Jammu and Kashmir (IIOJK).\nThe serious human rights violations in the illegal Indian occupied Jammu and Kashmir also require urgent attention from the international community, including the United Nations.\nThe desecration of women in occupied Kashmir is a daily practice for the Indian army and humanity has been humiliated in the occupied valley for the past several years.\nIndia continuously committing atrocities in occupied Kashmir and the Indian army has so far martyred millions of Kashmiris,\nThousands of women have become widows, thousands of Kashmiri children have become orphans.\nThe world must understand that there is no peace in the world without a solution to the Kashmir issue,\nIndia is changing the population ratio in occupied Kashmir-Pakistan also pledges to continue its moral, political and diplomatic support for the Kashmiris to achieve their legitimate right to self-determination.\nThe Government of Pakistan will continue to work for justice, equality, dignity and human rights for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:21:02.151Z"
}
