{
  "title": "NDMA issues advisory on weather during Eid-ul-Azha",
  "link": "https://www.app.com.pk/national/ndma-issues-advisory-on-weather-during-eid-ul-azha-2/",
  "date_published": "2024-06-14T17:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):The National Disaster Management Authority (NDMA) on Friday issued an advisory for public awareness regarding the weather on upcoming Eid-ul-Azha.\n“[This advisory is] in light of the forecast of a warmer than average temperature and chances of rain, wind and thunderstorms from June 15-19, which is likely to extend up to June 22,” according to the advisory.\nThe national disaster management body emphasized proactive preparedness through enhanced vigilance and mass public awareness. The additional guidelines can be received from the already issued Tourist Guidelines & Checklist available on the NDMA Website.\nAlso, NDMA has released the ‘Pak-NDMA Disaster Alert’ application on Google Play Store and iOS Application Store to provide general public with up-to-date alerts, advisories and hazard specific guidelines, public service messages and more.\nThe forecast indicated that due to this weather system, rain, wind and dust storm and thunderstorm are expected in most of country including Khyber Pakhtunkhawa, Gilgit, Azad Jammu and Kashmir, South Punjab and some parts of Sindh in stipulated period of time.\nThe NDMA advised preparedness for potential floods and landslides, especially in Upper KP, Murree, Galliyat, Kashmir, and Gilgit Baltistan. It urged the authorities to ensure readiness to respond to emergencies, with machinery and staff pre-positioned in vulnerable areas.\nThe NDMA urged the citizens to exercise caution, avoid weak structures and waterways, and stay updated on weather conditions while travelling to Northern areas during Eid holidays.\nIt also called upon the farmers, livestock owners, tourists, and travelers to take protective measures for their safety and property besides following local advisories for fresh updates.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:16:55.273Z"
}
