{
  "title": "MoEF, WAPDA sign agreement for Mohmand Dam Hydropower Project",
  "link": "https://www.app.com.pk/national/moef-wapda-sign-agreement-for-mohmand-dam-hydropower-project/",
  "date_published": "2024-06-14T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):The Ministry of Economic Affairs (MoEA) and Water and Power Development Authority (WAPDA) on Friday signed a Subsidiary Loan Agreement (SLA) amounting to US$ 25 million for the Mohmand Dam Hydropower Project.\nThe Secretary, Ministry of Economic Affairs, Dr. Kazim Niaz, signed on behalf of the Ministry, while Chairman WAPDA, Lt. Gen. (Retd.) Sajjad Ghani, represented WAPDA, said a news release.\nAmbassador of Kuwait in Pakistan Nassar Abdulrahman Jasser Al. Mutairi graced the ceremony with his presence.\nThis significant financing comes as a result of the Kuwait Fund’s commitment to extend a total of US$ 100 million to support the Mohmand Dam Hydropower Project. The total financing will be disbursed through four equal loans, each amounting to US$ 25 million. The first loan agreement was signed between the Government of Pakistan and the Kuwait Fund on June 3, 2024, in Kuwait, it added.\nThe Mohmand Dam is a comprehensive infrastructure project designed to address multiple needs. It aims to generate approximately 2,862 GWh of electricity annually with an installed capacity of 800 MW, significantly reducing the existing energy supply gap.\nAdditionally, the dam will create an active storage reservoir with a capacity of about 1,594 million cubic meters, ensuring a reliable and sustained supply of irrigation water.\nThe 213-meter high structure will also play a critical role in flood control, mitigating the risk of flood damage and providing essential flood protection.\nFurthermore, the project will supply 13.32 cubic meters per second of drinking water from the Mohmand Dam reservoir to Peshawar city in Khyber Pakhtunkhwa, addressing the region’s need for a stable drinking water supply.\nThe Secretary, Ministry of Economic Affairs said that the signing of this SLA marks a vital step towards the smooth implementation of the Mohmand Dam Project, facilitating the development of critical infrastructure that will provide lasting benefits in terms of power generation, irrigation, flood control, and water supply.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:17:20.397Z"
}
