{
  "title": "PHMH thanks Saudi counterpart for special arrangements of pilgrimage train this year",
  "link": "https://www.app.com.pk/national/phmh-thanks-saudi-counterpart-for-special-arrangements-of-pilgrimage-train-this-year/",
  "date_published": "2024-06-14T09:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): Head of Pakistan Hajj Medical Mission Brigadier Jamil Ahmed Lakhair Friday thanked Saudi counterpart for arranging up to the mark transport arrangements for hujjaj this year where high-speed train facilities were being provided to all pilgrimage from Mina to Arafat.\nTalking to PTV news channel, he said Pakistan government has better coordination with the Saudi authorities to serve Hujjaj and this year’s Hajj will be more comfortable than the previous one.\n“We are happy with the special attention of the Saudi Hajj minister for the convenience of Pakistani pilgrims, he said, adding, due to these smooth train operations our pilgrims expressed their heartfelt gratitude to the Saudi authorities”.\nHe also praised the Saudi government’s security and safety measures and other services for pilgrims, adding, pilgrim who performed Hajj for the first time are also impressed by huge facilities and services of Hajj mission in Saudi Arabia.\nThe Kingdom’s air ambulance service is also remarkable step to reach patients in various locations quickly, provide specialized emergency medical services, and transport patients to specialized health facilities within a short period of\ntime, he added.\nA specialized supervisory medical team monitors and evaluates the health status of the transferred pilgrims throughout the journey is also being ensured their safety and well-being of hujjaj, he mentioned.\nHe further highlighted that the Saudi Arabian scouts association has upgraded its volunteer services for Hajj pilgrims, utilizing technology to improve guidance and support for those who may become lost in the holy sites which is appreciable.\nPHMH also emphasized the importance of strengthening and safeguarding the immune system to protect pilgrims, adding,\nHe said PHM also providing mobile app services which is providing alerts to pilgrims, a distress call function, weather updates, help to determine the direction to face the Kaaba for prayer, and prayer timings.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:17:23.974Z"
}
