{
  "article_id": "2025-07-25_21491d2be28c0198a6cf90203dff9754",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-sells-scrap-defunct-power-plants-for-rs-46-73-bln/",
    "retrieved_at": "2025-08-27T10:06:55.919Z"
  },
  "metadata": {
    "title": "Govt sells scrap defunct power plants for Rs. 46.73 bln",
    "author": null,
    "date_published": "2025-07-25T12:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 25 (APP):The Power Division announced on Friday that the present government has successfully sold scrap from 16 units for Rs 46.73 billion. According to an official statement, substantial progress has been made in selling scrap from old and defunct government power generation plants. The reserve price for scrap from a total of 61 units was set at Rs 45.817 billion, while the actual sale exceeded expectations, fetching Rs 46.73 billion. The reserve price was determined by experts from the State Bank of Pakistan. In the first phase, scrap from 31 units was sold to private bidders for Rs 8.475 billion, against a reserve price of Rs 7.593 billion. Contracts with the successful bidders in this phase have already been finalized. During the second phase, scrap from 30 government power plants was sold for Rs 38.255 billion, slightly above the reserve price of Rs 38.224 billion. Contracts for this phase have also been completed. The government thermal power plants included in the second phase are Jamshoro Block I & II, Guddu II, Sukkur, Quetta, Muzaffargarh Block I and Block II, and Faisalabad. Employees of these government thermal power plants are being deployed in electricity distribution companies to utilize their services. These defunct government power plants were incurring annual expenses of billions of rupees. This sale has not only resulted in annual savings of billions of rupees at the national level, but the services of employees are also being effectively utilized.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}