{
  "article_id": "2025-07-25_6421443bce910237d6384226a8ec6318",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/civil-society-organization-urges-government-to-restore-pakistans-membership-in-the-open-government-partnership-ogp/",
    "retrieved_at": "2025-08-27T10:05:52.683Z"
  },
  "metadata": {
    "title": "Civil Society Organization Urges Government to Restore Pakistan’s Membership in the Open Government Partnership (OGP)",
    "author": null,
    "date_published": "2025-07-25T15:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 295,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 25 (APP):The Sustainable Social Development Organization (SSDO) has called on the Government of Pakistan to urgently take action to restore the country's membership in the Open Government Partnership (OGP), a global initiative that champions transparency, accountability, and public participation in governance,said on a press release issued here on Friday. Syed Kausar Abbas, Executive Director of SSDO, expressed deep concern over Pakistan's removal from OGP due to its failure to submit a revised National Action Plan (NAP) within the stipulated time frame a lapse that occurred under the previous government 2018-2022. \"As a civil society organization committed to promoting transparency and accountability in public institutions, SSDO sees OGP as a vital platform for governance reforms that encourage citizen engagement,\" Abbas stated. Pakistan joined OGP in 2016 under the Pakistan Muslim League-Nawaz (PML-N) government, paying a $25,000 membership fee from the national exchequer. It also committed to co-creating a National Action Plan with the input of civil society and expert departments. While initial efforts including the development of a tax directory for elected representatives showed promise. Despite repeated reminders over three years, Pakistan failed to submit a revised plan, ultimately leading to the termination of its membership during 2018-2022. \"As Pakistan works toward improving its international standing, rejoining OGP would be a strategic move that signals a strong commitment to good governance and reforms,\" Abbas emphasized. \"Pakistan remains eligible to rejoin and has the institutional capacity to implement open government practices.\" SSDO stressed that restoring OGP membership would enhance Pakistan's global image, encourage institutional transparency, and empower citizens through more inclusive policy making. \"We urge the Government of Pakistan to take immediate steps to restore OGP membership, designate a lead ministry, and develop a comprehensive National Action Plan in consultation with civil society,\" Abbas concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}