{
  "article_id": "2025-07-25_3cbef5027d7a984bd0df7a6b6256eb55",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/stray-dog-population-raises-alarm-in-g-8-1-cda-responds-to-concerns/",
    "retrieved_at": "2025-08-27T10:08:35.581Z"
  },
  "metadata": {
    "title": "Stray dog population raises alarm in G-8/1, CDA responds to concerns",
    "author": null,
    "date_published": "2025-07-25T08:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 315,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 25 (APP):Residents of G-8/1 and G-8 Markaz are urging the authorities concerned of CDA to expand on-ground operations, ensure safer streets, and launch awareness campaigns to prevent pet abandonment. Talking to APP here on Friday, residents of Sector G-8/1 have raised serious concerns over the growing number of stray dogs in their neighbourhood, urging the Capital Development Authority (CDA) to take immediate and humane action. Shumyla Noreen, a local resident, warned that the unchecked presence of stray dogs is becoming a daily threat, especially for children and the elderly. \"It's becoming risky for people to move around freely, particularly during early morning and late evening hours,\" she said. Another resident, Sanum, echoed the concern, highlighting the difficulties faced by pedestrians. \"Many people are afraid to walk on certain streets due to the fear of being chased or bitten,\" she said. In response, when a senior official from CDA was contacted, he negated the impression and said that the civic body was taking all possible measures to effectively tackle the issue. \"The public is welcome to visit the center and observe the care and treatment being provided to these animals,\" the official stated. The CDA had inaugurated Islamabad's first dedicated facility for stray dog management in September 2022, with a capacity to house 500 dogs, he said. The center aims to implement humane, non-lethal methods such as sterilization and vaccination under the World Health Organization's Trap-Neuter-Vaccinate-Release (TNVR) model, he added. Animal rights activists, however, continue to raise concerns about delays in the release of sterilized dogs and alleged neglect at the facility. The Islamabad High Court, in a recent ruling, directed authorities to strictly follow scientific and humane protocols, warning that the center's operations could be halted if standards are not maintained. In recent months, the presence of stray dog packs has grown, particularly in the Capital Territory sector G/8, G/9 and Chattha Bakhtawar.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}