{
  "article_id": "2025-07-25_8c77380359c0d0cb8e85875c242fd696",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/calls-for-national-discussion-on-forensic-justice-gender-based-violence-and-rights-based-medical-practices/",
    "retrieved_at": "2025-08-27T10:06:21.789Z"
  },
  "metadata": {
    "title": "Calls for National Discussion on Forensic Justice, Gender-Based Violence, and Rights-Based Medical Practices",
    "author": null,
    "date_published": "2025-07-25T14:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 504,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 25 (APP):National Commission on the Status of Women (NCSW), under the leadership of Chairperson Ms Ume Laila Azhar, convened the first national consultation to review the draft of the Islamabad Capital Territory Medico-Legal Regulation Act, 2025. This proposed legislation seeks to regulate medico-legal services and strengthen rights-based forensic practices in Islamabad. NCSW under its constitutional mandate to review laws affecting the status and rights of women, has taken the lead in proposing a standardized, rights based, and gender-sensitive framework for ICT. Justice Mohsin Akhtar Kayani in his speech at the National Dialogue regarding \"Medico-Legal law in Pakistan\" also highlighted this issue. A long-overdue reform aimed at reinforcing the pillars of justice, dignity, and accountability in Pakistan's legal-medical ecosystem. The meeting brought together representatives from the Ministry of Human Rights, Ministry of Law & Justice, National Health Services, ICT Administration, PIMS, Polyclinic, Legal Aid Society, LJCP, and leading forensic and gender rights experts. Discussions were candid, complex, and highly significant. Why This Matters - And Why the Conversation Must Begin Now Is Pakistan ready to adopt a victim- and rights-centered forensic system in gender-based violence (GBV) cases? Can forensic evidence be restructured to work in tandem with circumstantial and testimonial evidence - instead of replacing it? Will digitalization, decentralization, and safety of medico-legal officers finally be prioritized in law? How can we ensure dignified treatment of both victims and accused, as per our constitutional and international obligations? These questions are no longer theoretical - they're at the center of this draft Act and demand public and media scrutiny. The Ministry of Human Rights urged a balanced approach that protects both victims and the accused, and raised concerns over rigid timelines for medico-legal reports. Terminology review: PIMS recommended replacing the binary \"fabricated/non-fabricated\" with a third option to avoid premature judgments. The term \"friendly injuries\" was also proposed. Jurisdictional coordination: The Ministry of Law recommended a comparative analysis with Sindh and Draft by Punjab legislation for alignment and clarity. Technology and outreach: Polyclinic and NCSW emphasized digital tools and public awareness as key to enforcement and accessibility. Security of examiners: A recurring concern was the safety and legal protection of medical officers, especially in sensitive GBV cases. All stakeholders called for inclusion of police, judiciary, and grassroots health units in future discussions. The formation of a special drafting committee is under consideration for which, NCSW in its call to action said, \"We are not just drafting another law,\" said Chairperson Ume Laila Azhar. \"We are confronting a broken system where survivors of violence often face further injustice at the hands of procedures meant to protect them. Let this be a national moment to ask: Are we doing enough?\" The NCSW invites civil society, journalists, legal experts, and citizens to join the dialogue, share critiques, and demand accountability - because equitable medico-legal reform is not a technical exercise; it is a societal necessity. Second consultation to follow in early August 2025, featuring judiciary, police, and gender units, and focusing on real case studies and implementation mechanisms.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}