{
  "title": "Lasting peace in S. Asia hinges upon just, peaceful resolution of Kashmir issue: DPM Dar",
  "link": "https://www.app.com.pk/national/lasting-peace-in-s-asia-hinges-upon-just-peaceful-resolution-of-kashmir-issue-dpm-dar/",
  "date_published": "2024-10-27T06:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Sunday said that Pakistan remained committed to promoting peace in South Asia and sought constructive relations with all neighbors, however, lasting peace in the region could not be realized without a just and peaceful settlement of the Jammu and Kashmir dispute, in line with the UNSC resolutions and the aspirations of Kashmiri people.\n“Pakistan stands in unwavering solidarity with the Kashmiri people in their struggle and will continue to provide its full political, moral and diplomatic support to the realization of their inalienable right to self-determination,” the deputy prime minister/foreign minister said on the observance of Kashmir Black Day.\nHe said October 27th marked a somber turning point in the history of Jammu and Kashmir. On this day, seventy-seven years ago, the Indian forces landed in Srinagar, marking the beginning of a prolonged and painful chapter for the region.\nOver the past seven decades, India has employed various strategies to strengthen its control over Indian Illegally Occupied Jammu and Kashmir (IIOJK), he added.\nHowever, since 5 August 2019, they had witnessed an accelerated effort to undermine the internationally recognized disputed status of IIOJK and to marginalize the rights and voices of the Kashmiri people.\n“The actions taken by Indian authorities, including attempts to alter the demographic and political landscape of the territory, stand in direct violation of the relevant UN Security Council resolutions and the Fourth Geneva Convention. Despite these measures, the resolve of the Kashmiri people remains undeterred,” a press release quoted the deputy prime minister as saying.\nToday, Dar said the region was witnessing an intensification of repression. Thousands of political leaders and activists remained behind bars, with 14 political parties effectively banned.\nDraconian emergency and counterterrorism laws granted Indian forces sweeping powers, enabling them to arrest or eliminate any individual and destroy property at will, he added.\nThe deputy prime minister/foreign minister further said that nonetheless, the spirit and determination of the Kashmiri people endured, as they continued their peaceful struggle for justice and self-determination.\n“While elections for the Legislative Assembly of IIOJK have recently been conducted, any such exercise, carried out under the framework of the Indian Constitution and amidst an overwhelming military presence, cannot be considered a substitute for the legitimate right to self-determination of the Kashmiri people,” he stressed.",
  "retrievedAt": "2025-08-10T20:24:41.466Z"
}
