{
  "title": "Rising prices, other violations in ICT stir public outcry",
  "link": "https://www.app.com.pk/national/rising-prices-other-violations-in-ict-stir-public-outcry/",
  "date_published": "2024-10-27T09:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP):The islooites are suffering arbitrary rates and also compromised on quality of daily use adibles by the hoarders mafia in the Federal Capital.\nA citizen namely Sail Hussain resident of the Bari Imam area, while talking to APP complained that in our area every shop keeper have their own rates of daily use edibles like vegetables, fruits, milk and meat.\n“In our area, every shop has its own rates,” he said. “A shopkeeper selling milk at Rs 250 per liter claims it’s pure, while others sell at Rs 200, which they say includes water or other substances.” This confusion around “pure” and “impure” goods leaves consumers at the mercy of vendors.\nIn Aabpara Market, one meat seller defended higher prices by explaining that rents in Aabpara are higher. “We sell fresh meat,” he said, “while others sell older meat or add water to stretch the weight.” Such statements add to public concerns that some sellers exploit customers by marking up prices with claims of superior quality.\nTo address these issues, the ICT administration has been active in enforcing price control. In a recent operation, Assistant Commissioner (AC) Pothohar Aneeq Anwar conducted raids in a local vegetable market, leading to the arrest of 20 shopkeepers for charging prices above the official rate list. The district administration, led by Deputy Commissioner (DC) Irfan Memon, has emphasized the importance of following these rates. “Pay the set prices for urban food items,” he stated, adding that an official rate list is released daily.\nSome citizens, caught in the crossfire of these operations, have faced unintended consequences. A family of a laborer, Muhammad Sharafat, reported that he was detained while sitting near a shop during one of these raids.\nTalking to APP, his family said he has been in custody for two days, causing them both financial and emotional distress. As the family’s sole breadwinner, his absence has left them struggling.\nThis ongoing situation highlights both the public’s demand for fair pricing and the challenges in enforcing it.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:25:55.081Z"
}
