{
  "title": "‘Kashmiris dream of freedom will become a reality soon’; says Tarar",
  "link": "https://www.app.com.pk/national/kashmiris-dream-of-freedom-will-become-a-reality-soon-says-tarar/",
  "date_published": "2024-10-27T06:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): The Federal  Minister for Information, Broadcasting, National Heritage, and Culture, Attaullah Tarar, on Sunday said that October 27, 1947, was the darkest day in the history of the subcontinent, as on that day India illegally occupied the state of Jammu and Kashmir (IIOJ&K).\nIn his message on October 27, Black Day of Kashmiris, he said on that day, India illegally annexed Jammu and Kashmir by landing its troops against the wishes of Kashmiris, the federal minister for information said.\n“Despite the atrocities and brutal policies of the Indian fascist government, the valiant Kashmiri people are fighting bravely for their freedom,” said the minister.\nAttaullah Tarar expressed his belief that Kashmiris would soon reach their destination and their dream of freedom would become a reality.\nHe said, “Kashmiri people will never accept India’s usurpation of occupied Jammu and Kashmir.”\nHe maintained that Pakistan was a strong supporter of Kashmiris’ right to self-determination.\nPrime Minister Shehbaz Sharif’s bold stand on the Kashmir issue was a strong expression of Pakistan’s unwavering commitment to the Kashmir cause and its desire for a just and peaceful solution to the long-standing conflict, he remarked.\nTarar said Pakistan had never backed down from advocating the legitimate cause of Kashmiris at international forums.\n“Pakistan always stands with the Kashmiri people and will continue to support their right to self-determination,” he added.\n“The only acceptable solution to the Kashmir dispute issue is a plebiscite under the supervision of the United Nations,” he said.\nThe minister urged the international community to play its role to find a peaceful solution to the Kashmir issue and pressurize India to stop gross human rights violations in Kashmir.",
  "retrievedAt": "2025-08-10T20:24:41.670Z"
}
