{
  "title": "Kashmir Black day sends clear message against  Indian aggression",
  "link": "https://www.app.com.pk/national/kashmir-black-day-sends-clear-message-against-indian-aggression/",
  "date_published": "2024-10-27T11:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Muhammad Farooq Rehmani, Chairman of J&K People’s Freedom League and former Convener the All Parties Hurriyat Conference (APHC), stated that this year’s Black Day observance send a clear message to India, affirming that the people of Jammu and Kashmir will not tolerate further division or repeated aggression.\nSpeaking to APP, he stated that India must not be permitted to alter the demographics of the state in order to establish a Hindu state for its own political goals and agendas.\nHe emphasized that the people of Jammu and Kashmir are united in their resolve to safeguard the sovereignty and integrity of their state.\nHe urged India not only to revoke the actions taken on August 5, 2019, but also to be prepared to grant the right of self-determination to the people of Jammu and Kashmir as under no circumstances will the people of Jammu and Kashmir allow further dismantling of the state or the repetition of similar assaults.\nCondemning India’s actions in occupied Kashmir, he asserted that the Indian government’s measures are unacceptable. Since its illegal occupation of Kashmir in 1947 and the revocation of its special status in 2019, India has triggered widespread human rights violations and demographic changes.\nHe stated that neither the international community nor the Kashmiri people recognize India’s control over the region. Rehmani emphasized that the Kashmir issue is not merely a territorial dispute but a matter of the Kashmiri people’s right to self-determination.\nHe noted that India’s actions, including demographic changes and settler colonial policies, are designed to erase Kashmiri identity and suppress their legitimate struggle for freedom.\nHe called on Pakistan to take all necessary measures to secure practical support from regional and international voices for the restoration of the fundamental rights of the people in the occupied area.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:25:24.425Z"
}
