{
  "title": "Five new players inducted into PCB men’s central contracts 2024-25",
  "link": "https://www.app.com.pk/national/five-new-players-inducted-into-pcb-mens-central-contracts-2024-25/",
  "date_published": "2024-10-27T08:22:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 27 (APP):Pakistan Cricket Board (PCB) on Sunday announced to award 12-month duration central contracts to 25 men’s cricketers for the 2024-25 international season, effective from July 1, 2024.\nThe contracts have been offered under the structure that was agreed last year between\nthe players and the PCB for a three-year period.\nAs part of the PCB’s strategy to incentivise, encourage and reward talented and emerging\ncricketers, five players, Khurram Shahzad, Mohammad Abbas Afridi, Mohammad Ali, Muhammad\nIrfan Khan and Usman Khan, have been offered central contracts for the first time. These\nfive cricketers have been placed in category D.\nCompared with the PCB men’s three-year central contracts of September 27, 2023, Shaheen\nShah Afridi (A to B), Haris Rauf, Shadab Khan (B to C) have been demoted while Shan Masood\nhas been promoted from Category D to category B but his retention will be subject to as red\nSaud Shakeel, Salman Ali Agha, and Saim Ayub have been promoted to category C from\ncategory D while Abdullah Shafique retained his previous category C.\nThirteen cricketers including Fakhar Zaman, Sarfraz Ahmed, Imama ul Haq, Muhammad Nawaz,\nImad Wasim, Shahnawaz Dahani, Iftikhar Ahmed, Ihsanullah, Faheem Ashraf, Usama Mir,\nZaman Khan, Muhammad Haris and Hasan Ali have been struck down from the PCB’s previous\nOut of the 25 cricketers, only two have been awarded category A, three category B, nine\ncategory C while 11 have been placed in category D.\nCategory A: Babar Azam and Mohammad Rizwan\nCategory B: Naseem Shah, Shaheen Shah Afridi and Shan Masood\nCategory C: Saud Shakeel, Salman Ali Agha, Abdullah Shafique, Abrar Ahmed, Haris Rauf,\nNoman Ali, Saim Ayub, Sajid Khan and Shadab Khan\nCategory D: Aamir Jamal, Haseebullah, Kamran Ghulam, Khurram Shahzad, Mir Hamza,\nMohammad Abbas Afridi, Mohammad Ali, Mohammad Hurraira, Muhammad Irfan Khan,\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:26:19.671Z"
}
