{
  "title": "Cement sales rise in April - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Domestic cement sales and exports improved by 7.64 per cent and 34.56pc year-on-year in April.\n\nHowever, local sales slightly fell by 5.5pc during 10MFY25 while exports grew by 29pc compared to the same period last year.\n\nAs per data from the All Pakistan Cement Manufacturers Assoc­iation (APCMA), local cement despatches were 2.516 million tonnes in April compared to 2.337m tonnes a year ago.\n\nA spokesman of APCMA said that a healthy rise in exports this year is a good omen. However, the industry’s resurgence was limited due to low domestic demand, leaving about one-third of the industry’s capacity idle.\n\nHe urged the government to announce industry-friendly measures in the upcoming budget that can not only boost construction activities in the country but also make our cement competitive in the global market, providing more export opportunities.\n\nExport despatches, on the other hand, rose to 826,457 tonnes from 614,214 tonnes in April 2024. Total cement despatches — local and exports — were up 13.24pc to 3.342m tonnes in April against 2.951m tonnes a year ago.\n\nNorth-based cement mills despatched 2.239m tonnes in April, up by 7.22pc year-on-year. South-based mills despatched 1.10m tonnes against 863,327mn tonnes in April 2024, a rise of 28pc.\n\nNorth-based cement mills sold 2.124m tonnes in the domestic market in April, up by 9.39pc against 1.942m tonnes a year ago. On the contrary, local sales by south-based mills stayed flat at 391,445 tonnes compared to 395,199 tonnes in April 2024.\n\nExports from North-based mills declined 22pc year-on-year to 114,467 tonnes in April. Exports from the south, however, increased by 52pc to 711,990 tonnes from 468,128 tonnes in April 2024.\n\nOverall cement sales slightly fell to 37.336mn tonnes in 10MFY25 from 37.454m tonnes a year ago. Domestic despatches dipped to 29.978m tonnes from 31.740m.\n\nHowever, exports increased to 7.359m tonnes in 10MFY25 from 5.714mn tonnes in 10MFY24.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/01094727e54b11e.jpg?r=094737",
  "retrievedAt": "2025-08-23T08:14:37.225Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908315/cement-sales-rise-in-april",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:06.000Z"
}
