{
  "title": "Dir varsity ordered to place anomaly panel recommendations before syndicate - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court has directed the administration of Shaheed Benazir Bhutto University, Dir Upper, to place before its syndicate the recommendations of an anomaly committee regarding rules related to promotions.\n\nA bench consisting of Justice Mohammad Ijaz Khan and Justice Sabitullah Khan directed that the syndicate meeting should be convened within 60 days and a compliance report in that regard should be submitted to the court.\n\nThe bench disposed of a petition jointly filed by nine officials of the university working in different pay scales including assistant accounts officer, Muzafar Said, and others. They had sought directives of the court for the university administration to initiate the process related to their promotions to next grade.\n\nThe bench observed that as per stance of respondents including the university’s vice-chancellor the prayer of the petitioners could not have been addressed due to some anomalies in the rules governing their promotions.\n\nPHC disposes of petition for promotion of nine employees\n\nThe bench observed that it was part of the record that on Oct 18, 2023, the university had notified an anomaly committee and that panel after hectic work had recommended solutions to all the anomalies in the existing rules through a report of Jan 9, 2024.\n\nHowever, the bench observed that as admitted by the counsel for respondents, Sabir Shah, and law officer of the university, Abdullah, the same report had not been placed before the syndicate for its final approval despite lapse of 15 months.\n\n“When confronted with the aforesaid inactions on the part of the respondents/university, their learned counsel made a commitment that the said recommendations of the anomaly committee shall be placed before the ensuing syndicate meeting and if the syndicate accorded approval to the same, then thereafter, the process of all the employees of the respondents/university with regard to promotions, etc including that of the petitioners shall be initiated in accordance with law,” the bench stated in its order.\n\nThe petitioners’ counsel, Arshad Khan, stated that his clients were employees of Shaheed Benazir Bhutto University, Dir Upper, at Sheringal, and were working in different cadres for last many years.\n\nHe said that they had completed their required length of service in the existing pay scale, however, the respondents were not initiating any process for their promotions to next grade.\n\nHe stated that the university was established in 2009 under Shaheed Benazir Bhutto University, Sheringal, Regulation, 2009, having its own rules and regulations. It had also adopted the statutes of University of Peshawar in case of any vacuum for regulating the affairs of the university including service matter of employees, he added.\n\nThe counsel said that afterward in pursuance to Khyber Pakhtunkhwa University Act, 2012, the university framed and approved its own statutes in the year 2022.\n\nHe argued that petitioners had time and again requested the university vice-chancellor to initiate process for their promotions and a commitment was made with them that the matter would be taken up for consideration in a meeting of the selection board scheduled for Aug 2, 2023.\n\nHowever, he said that in the said meeting only the cases of faculty members had been considered for promotion and cases of administrative cadre were ignored.\n\nThe vice-chancellor, in his comments, stated that the university was fully committed to adhere to the service statutes, however, in some of the cases like promotions of employees including petitioners there were certain problems and complications in rules, which were beyond his control.\n\nHe denied that any special treatment was meted out to faculty members in promotions, stating that they were appointed on higher posts through fresh appointments as per Higher Education Commission criteria.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:52:46.815Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908253/dir-varsity-ordered-to-place-anomaly-panel-recommendations-before-syndicate",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:42.000Z"
}
