{
  "title": "1,979 female police officers complete training in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: As many as 1,979 female police officers completed their training and their passing out parade was held at Police Training College on Saturday.\n\nPunjab Inspector General of Police (IGP) Dr Usman was the chief guest. Among the passing out officers were 1,487 lady executive police, 255 traffic assistants, 134 PHP, and 103 SPU female police officers. The ceremony was also attended by Joint Director General IB Moin Habib Khan.\n\nWhile addressing the female officers, the IGP mentioned that with over 220,000 personnel, Punjab Police as the largest single-command civilian force in the world. He said there was no day in the year when Punjab Police personnel had not written history with their blood for the country and the nation.\n\nHe said whether in times of war or peace, Punjab Police stood shoulder to shoulder with the armed forces and security agencies for the nation’s survival and security. As the challenges had increased, he went on to say, the Punjab Police was confronting terrorists and extremists and the force had taken the lead in facing terrorists.\n\nDr Usman said the largest batch of female officer recruits in the history of Punjab Police had now passed out.\n\nDr Anwar distributed awards among the female police officers who demonstrated excellent performance. DIG Mehboob Aslam Lillah presented souvenirs to IGP Dr Anwar and Joint Director General IB Moin Habib Khan.\n\nDuring their 10-month training, female police officers were taught various subjects, including Constitution, law, IT, and counterterrorism. They received training in physical and field craft, communication skills, weapon handling, and martial arts. The additional IGPs, DIGs, SSPs, along with officers from the Police Training College Chuhng, parents, and families of the passing out recruits were also present at the ceremony.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:14:21.928Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908233/1979-female-police-officers-complete-training-in-punjab",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:17:19.000Z"
}
