{
  "title": "Fellowship announced for journalists on digital rights, gender inclusion - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: On World Press Freedom Day, the National Commission for Human Rights (NCHR) in collaboration with Media Matters for Democracy on Saturday announced a training fellowship for journalists with an aim to strengthen their professional capacity to report on digital rights and internet governance through a gender-sensitive and rights-based lens.\n\nNCHR said supported by Unesco’s International Programme for the Development of Communication (IPDC), this initiative also reinforced NCHR’s role in advancing Pakistan’s digital gender inclusion strategy, where the commission led the safety and security working group.\n\nThe fellowship will empower a group of 12 journalists with the knowledge and tools to report on digital rights and gender inclusion. The fellowship will also facilitate the production and dissemination of high quality, investigative journalism that highlights issues of digital gender inclusion besides increasing public awareness and visibility of digital gender inclusion challenges through sustained media engagement across mainstream and digital platforms.\n\nElaborating the concept behind the initiative, NCHR Chairperson Rabiya Javeri Agha said, “Despite increased digital penetration in Pakistan, a persistent gender digital divide continues to limit women’s full participation in the digital ecosystem. Journalists play a critical role in raising awareness, influencing public discourse and holding institutions accountable.”\n\nShe said the training will combine theoretical knowledge with practical skill building and will be structured around understanding internet universality and Unesco’s ROAM-X framework, Pakistan’s digital gender landscape and policy ecosystem, gender-sensitive and rights-based reporting techniques, investigative journalism methods, legal and policy frameworks including Peca, digital safety mechanisms and editorial development of story ideas.\n\n“Advancing gender inclusion in digital spaces requires informed, nuanced journalism. Today digital technologies continue to shape how information is accessed and controlled, it is critical that journalists are equipped to report on these issues with a rights-based and gender-sensitive lens. This fellowship is an opportunity to build that capacity,” said Sadaf Khan, co-founder MMfD.\n\nThe training model will be based on Unesco’s global guidelines and publications on gender inclusion, internet universality and governance and gender sensitive reporting.\n\nThe programme will be contextualised for the Pakistani environment through tailored contributions from NCHR, ensuring alignment with national priorities and ground realities.\n\nIt will be contextualised for relevance to the Pakistani environment by integrating contributions from NCHR. The commission will support sessions related to institutional response mechanisms, human rights protections and the enforcement of digital safety policies and will ensure alignment with national strategies on gender inclusion and internet governance, and provide insight into Pakistan’s regulatory landscape.\n\nFollowing the training workshop, selected fellows will enter a structured mentorship and content development phase. Each fellow will be paired with an experienced journalist or editor who will provide personalised guidance on refining their story angles, conducting research and navigating editorial and publication processes.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6816a3c6a890d.jpg",
  "retrievedAt": "2025-10-12T02:53:29.849Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908259/fellowship-announced-for-journalists-on-digital-rights-gender-inclusion",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:34.000Z"
}
