{
  "title": "Syria detains head of pro-Assad Palestinian group - World - DAWN.COM",
  "author": null,
  "content": "DAMASCUS: Officials of a small Palestinian group that was close to ousted Syrian president Bashar Al Assad said their leader was arrested on Saturday by the country’s new authorities.\n\nThe arrest of the leader of the Popular Front for the Liberation of Palestine-General Com­mand (PFLP-GC) came after the armed wing of another Palestinian group, Islamic Jihad, said last month that the new authorities had detained two of its officials on unspecified charges.\n\nThe United States, which blacklists both the PFLP-GC and Islamic Jihad as “terrorist” organisations, has said it will not ease Assad-era sanctions on Syria until it has verified progress on priorities, including acting against “terrorism”.\n\nA PFLP official said “secretary general Talal Naji was arrested” in Damascus. A second official confirmed the arrest, while a third\n\nsaid: “Naji was asked... to report to one of the security branches and has not returned. Most likely he was arrested.”\n\nThe first official said the faction had contacted Palestinian President Mahmud Abbas and senior Hamas official Khaled Meshaal “to request their urgent intervention”.\n\nLast month, a statement from Islamic Jihad’s military wing said that the group’s Syria representative Khaled Khaled and organising committee member Yasser Al Zafri had been detained in Syria for days “without explanation”.\n\nIt expressed hope “that our brothers in the Syrian government” would release the pair, noting their detention came as the group is fighting the Zionist enemy in Gaza alongside its ally Hamas.\n\nSyria hosted Palestinian rejectionist factions for decades under the Assad family’s rule when it was part of the Iran-backed axis of resistance against Israel and the United States.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:53:13.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908326/syria-detains-head-of-pro-assad-palestinian-group",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:18.000Z"
}
