{
  "title": "‘We don’t care’: Weddings go on in Azad Kashmir near LoC - Pakistan - DAWN.COM",
  "author": null,
  "content": "Rabia Bibi, a glittering red dupatta pulled over her eyes, wasn’t about to let the threat of war with India stop her wedding in a remote valley in Azad Jammu and Kashmir.\n\n“In our childhood, the situation was also like this, but we are not afraid. Nor will we be,” the 18-year-old told AFP after being carried in a flower-garlanded “doli” carriage.\n\n“We want peace, so our life does not get affected,” said the bride, radiant in gold bangles, bejewelled bridal headpiece and richly embroidered scarlet robe.\n\nAt the ceremony — preceded by the sacrifice of a chicken — groom Chaudhry Junaid, no less resplendent in his elaborate sherwani coat and red-and-gold turban, was also defiant.\n\n“People are anxious and worried, but even so, we haven’t cancelled any traditional ceremonies,” the 23-year-old chef said.\n\nTensions between the nuclear-armed arch-rivals have soared since the April 22 attack in Pahalgam, which killed 26 people, mostly tourists, in one of the deadliest assaults on civilians since 2000. India has implied cross-border links without evidence, while Pakistan has rejected the claim and called for a neutral probe.\n\nIndian Prime Minister Narendra Modi has given his military “full operational freedom” to respond to the attack.\n\nThe two sides have traded gunfire for more than a week on the heavily militarised border, and Pakistan on Saturday conducted a “training launch” of a missile to prove its “operational readiness”.\n\nIslamabad last week warned they had “credible intelligence” that India was planning imminent strikes.\n\nInternational pressure has been piled on both New Delhi and Islamabad to de-escalate.\n\nIn Azad Kashmir, emergency drills have been carried out in playing fields, residents have been told to stock up on food and medicine, and religious schools have shut.\n\nIn India-occupied Kashmir, a vast manhunt seeking the gunmen continues across the territory, while those living along the frontier are moving further away — or cleaning out bunkers fearing conflict.\n\nOrdinary Kashmiris living on both sides of the disputed Muslim-majority region are often the first victims caught in the crossfire.\n\nIn a checkpoint-free corner of the picturesque Neelum Valley, a tourist epicentre that was shut down last week, the Indian-held territory is on the other side of the river that winds through the mountainous region.\n\nResidents told AFP they had been urged by the Pakistani authorities to remain vigilant because of the threat of a possible military confrontation.\n\nIn another village, mechanical engineer Shoaib Akhtar was also getting married.\n\n“This is the happiest occasion of our lives, and we won’t let anything ruin it,” said Akhtar, the 25-year-old groom surrounded by family.\n\n“Right now, I’m getting married and that’s what matters most. If war comes, we’ll deal with it when it happens,” he added.\n\n“We are happy, and if India has some issues, we don’t care,” Bibi said.\n\n“We stand firm and will fight for our interests and our nation.”\n\nHeader image: Groom Chaudhry Junaid (L) sits with his bride, Rabia Bibi, during their wedding ceremony in Ashkot village on the Line of Control (LoC) in Neelum Valley, a district of Azad Jammu and Kashmir, on May 3. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/04173917b3d9d17.jpg",
  "retrievedAt": "2025-08-23T08:14:14.804Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908406/we-dont-care-weddings-go-on-in-azad-kashmir-near-loc",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T13:09:07.000Z"
}
