{
  "title": "Journalists in Balochistan decry job cuts, censorship - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The journalist community in Balochistan has called on the government to take urgent steps to ensure their safety, uphold press freedom, address widespread financial hardships and reinstate sacked media professionals.\n\nSpeaking at a gathering organised at the Quetta Metropolitan Corporation on World Press Freedom Day, leaders of the journalist community, including Balochistan Union of Journalists (BUJ) President Khalil Ahmed and Quetta Press Club President Irfan Saeed, said media in Balochistan has been facing strict censorship and is not allowed to even publish news of the opposition parties.\n\nThey demanded that amendments to the Prevention of Electronic Crimes Act (Peca), 2016 be repealed as it is unacceptable to the journalist community across the country. They lamented that cases were registered against some media persons in the province under the Peca.\n\nThe journalist leaders said Article 19 of the Constitution gives the right to speak and freedom of the press, while the government has deprived the media personnel and the people of their constitutional right.\n\nCM Bugti vows to make effort to protect mediapersons’ rights\n\nThey strongly criticised the newspapers and TV channels for sacking workers and closing their offices in Quetta and other cities, stressing that hundreds of journalists and workers have become jobless in the last few months.\n\nReferring to the prevailing working conditions of media workers in Balochistan, they said newspaper owners were earning millions of rupees monthly from advertisements but are not ready to pay salaries as per the wage award and the minimum salary fixed by the government for non-skilled workers.\n\nTo mark the day, the BUJ held a rally, which was attended by a large number of media workers and journalists. The rally started from the Quetta Press Club and marched through various roads of the provincial capital.\n\nThe participants of the rally were carrying placards and banners inscribed with their demands. They also chanted slogans in favour of their demands and against the controversial Peca Act.\n\nCM promises support\n\nMeanwhile, Balochistan Chief Minister Sarfraz Bugti has said that the provincial government would make every effort to protect the rights of journalists.\n\nOn World Press Freedom Day, the chief minister said the most important aspect of press freedom is responsible journalism, and the government has the responsibility to uphold free media, while the owners have a duty to promote responsible journalism.\n\n“I realise that Balochistan journalists are performing their duties in difficult circumstances”, he said, adding that the national channels should also highlight positive news of the province and should not limit themselves to crime news only.\n\nHe said that attention should also be paid to the social problems of Balochistan, as the provincial government has always considered positive criticism as an opportunity for reform.\n\nHe noted that channels closing bureaus or laying off staff are violating Pemra agreements and said that the federal Ministry of Information has been notified about these violations.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/0411143180ad3db.jpg",
  "retrievedAt": "2025-10-12T02:52:49.943Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908335/journalists-in-balochistan-decry-job-cuts-censorship",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:01.000Z"
}
