{
  "title": "CAN INDIA STILL GO TO WAR WITH PAKISTAN? - Newspaper - DAWN.COM",
  "author": null,
  "content": "PROLOGUE\n\nIndia has become infuriatingly formulaic when it comes to Pakistan. Here’s how the script goes. There’s an attack in Occupied Jammu and Kashmir. India blames Pakistan.\n\nThe Indian media — mainstream and social — start beating war drums. Retired Indian military officers and other analysts are invited by the Studio Corps who declare, wage and win a war against Pakistan. The hysteria has reached fever-pitch since the arrival on the scene of a Hindutva-driven Bharatiya Janata Party (BJP) under Narendra Modi, and of social media platforms.\n\nIn bashing Pakistan, some even calling for its dismemberment, there’s no real difference between the right and the left in India or the many shades in between. Once again, after the April 22 Pahalgam attack, we are at that stage; once again there’s talk in India of punishing Pakistan. Even the negligible few who caution against rashness nonetheless muse about how to punish Pakistan without starting an Armageddon. There are almost no voices challenging India’s occupation of Kashmir.\n\nOthers dish out operational recipes about strikes that range from “limited” to a full-blown war, from keeping the conflict controlled through dominating escalation to fantastic scenarios of a “final solution”, with nary a thought to the genocidal underpinnings of that term. On such occasions, irony goes to die in India.\n\nIt should be obvious, given the obvious, that there should be a serious discussion on these goings-on, because the irresponsibility and false bravado that inheres in this balderdash impacts not just the citizens of Pakistan and India but, by geographic default, other countries that make up the defunct grouping called Saarc.\n\nThis article is therefore structured to (a) discuss what war means, whether full-scale or limited and (b) why do Pakistan and India keep getting into these cycles. The “b” also necessarily brings us to India’s denial to the Kashmiris of their right to self-determination.\n\nTo clarify, this is not an attempt to predict what India would or could do if it chose to launch a limited strike. Or what platforms it might use for that or how it could choose the nodal points for any strikes. The argument is that limited cannot assuredly remain limited. Which doesn’t mean that India cannot miscalculate. Wars have often started because of miscalculations.\n\nAs tensions between India and Pakistan mounted in the wake of the April 22 Pahalgam attack in Occupied Jammu and Kashmir, war drums were once again beaten with great ferocity in India. Why do India and Pakistan keep returning to this state of brinkmanship? Can India actually conduct a military strike against a nuclear Pakistan? And what is the risk of its miscalculation?\n\nCLAUSEWITZ’S ‘ZWECK UND ZIEL’\n\nThe Prussian soldier and war theoretician Carl von Clausewitz understood that war’s political objective was not just its highest level but the most important. The primitive violence of people, managing that violence and harnessing it to an aim must be subordinate to the political objective of war. But all the three levels have to be taken together, since that is what constitutes the triple nature of war as well as its grammar.\n\nHe used the terms Zweck und Ziel, the first referring to “purpose”, the second to “aim”. The Zweck denotes the political objective for which a war is being fought; the Ziel relates to the actual conduct and aim of battles, of which many may be fought to achieve the political end. The Ziel, in the Clausewitzian framework, must add up to the Zweck and be subordinate to it.\n\nClausewitz was, of course, writing before the advent of nuclear weapons and within his own geopolitical context. But what is clear is the connection between fighting and a political objective. Obvious also is the fact that victory will be determined not on the basis of winning a battle or battles but achieving the objective for which the battles are being fought. To put it another way, “there is no necessary correspondence between victory in battle and success in achieving the objective.”\n\nTake the example of India’s chest-beating. Let’s assume that India decides to punish Pakistan and, in fact, does manage to do that. We are not concerned about what such punishment might look like but we can argue, given the nuclear overhang, that it would be limited by the very nature of India’s compulsion to keep the conflict controlled. Let’s also assume that, at that point, Pakistan determines that it cannot retaliate. Would that “battle” constitute victory for India? Yes, if it achieves the political objective; no, if it doesn’t.\n\nIt is logical at this point to ask what would be India’s political objective (it’s not domestic). What is the Zweck for India’s Ziel, assuming that getting into a fight for the heck of it means nothing. Even when it might satiate some base instincts or win elections, it can’t be policy, much less an objective in a Clausewitzian sense. That objective would be to establish deterrence against Pakistan — to ensure that Pakistan does not (or cannot) do anything that India considers to be inimical to its interests and security.\n\nIf India manages to punish Pakistan but fails to deter it from undertaking actions in the future that it considers damaging to its interests and security, then, in our hypothetical scenario, India has failed to achieve its political objective.\n\nAfter all, India is not planning a limited nuclear strike. It only wants a limited conventional strike or maybe a few simultaneous limited strikes and it plans, presumably, to control escalation to avoid Pakistan going to a nuclear level.\n\nIt amuses me that so many former Indian generals (even diplomats) should wittingly or unwittingly ignore this central tenet of any armed violence. Remember what American diplomat Henry Kissinger said about Vietnam? “We would not have recognised victory if it were staring us in the face, because we did not know what our objectives were.”\n\nA good example of the terrible difficulty in achieving the political objective through battles is the headache Israel has faced (and continues to) vis-a-vis Hezbollah in Lebanon. Without going into the details of that trajectory, Israel finally tried to resolve it through the Dahiya doctrine — the strategy to bomb and destroy civilian infrastructure and kill civilians — with limited effect. And this in a scenario where Israel has complete air supremacy, something that just does not exist for India against Pakistan.\n\nIn fact, if statements by the current Indian air chief are anything to go by, as also informed analyses in the Indian media itself, “the IAF is struggling to maintain its operational edge, making it imperative to fast-track acquisitions and plug the equipment shortfall.”\n\nLET’S BRING IN THE NUKES NOW\n\nNuclear weapons further complicate India’s calculus. This is not because Pakistan is likely to use that capability first and early in a conflict, but because the capability exists and the aggressor has to factor it in. A further complication is that Pakistan manages risk through deliberate ambiguity — what and where exactly are the red lines? In other words, the aggressor must push the conflict envelope at every stage at great escalation risk.\n\nTo simplify this, nuclear weapons are capable of immense destruction. Far from their actual use, their very presence (the threat) ensures, as British academic Philip Windsor noted, that “survival, instead of being a condition for the articulation of value, [becomes] itself the ultimate value.”\n\nEven so, just as India has been trying to evolve a doctrine of proactive operations since the Twin Peaks crisis (2001-02), there was much talk during the Cold War of how to avoid the nuclear big bang and still be able to fight wars. This brought in the idea of ‘limited war’, a conflict which could be controlled in ways that would prevent escalation to an all-out nuclear war.\n\nIn other words, how to avoid a strategic nuclear exchange while resorting to what can be described as Louis XIV’s ultima ratio regum [final argument of kings]. Much thinking was invested in (a) creating a distinction between an all-out and a limited war and (b) how such a war could be won while avoiding the risks of escalation.\n\nIn essence, limited war became two different wars. Wars fought on the periphery — not direct confrontations between the two superpowers but mainly in the Global South — through proxies (that actually happened) and wars conjured up in tabletop crisis games that theorised about limited nuclear employment, much short of strategic exchanges that would surely evaporate millions of people on all sides.\n\nThe first destabilised the periphery but held the quiet at the centre (the centre being Central Europe) and gave us the term “stability-instability paradox.” The second was defenestrated after US Defence Secretary Casper Weinberger arranged a top-secret war game codenamed Proud Prophet, to test the hypotheses about limited nuclear exchanges.\n\nThe game, led by Thomas Schelling, put paid to the idea that limited would remain limited. Standard crisis actions led to a major nuclear war that killed half a billion people and left about the same number exposed to radiation. The documents about the game were declassified in 2016.\n\nLIMITED WARS AND ESCALATION DOMINANCE\n\nBut let no one be disheartened by these statistics. After all, India is not planning a limited nuclear strike.\n\nIt only wants a limited conventional strike or maybe a few simultaneous limited strikes and it plans, presumably, to control escalation to avoid Pakistan going to a nuclear level.\n\nEven Western strategists, including some smart American and British Indians, are arguing that this can be done — that India can punish Pakistan, that it can control escalation and that it can dominate escalation. Bingo! Problem solved!\n\nExcept, this is sheer poppycock! There’s no periphery where the US and the USSR played on conventional terms through proxies. The only periphery, metaphorically speaking, is the sub-conventional domain, where the two sides can employ covert means. India is already heavily involved in that domain, perpetrating and perpetuating violence against Pakistan. In fact, its current National Security Adviser (NSA) Ajit Doval is reported to have bragged about it in private.\n\nIn other words, India wants to conduct an overt, limited military operation to punish Pakistan and has convinced itself that it can choreograph the escalation levels. There are certain assumptions behind this. I wrote about this ‘theory’, if it can be called that, in these pages after the 2019 crisis in the article ‘Lessons from the Brink.’ Let me roughly reproduce what I wrote then in italics here.\n\nThere is a band in which India can use and exploit a limited conventional military option given its conventional superiority; if it does so in response to an attack it can pin on Pakistan, it has enough diplomatic weight to have the world opinion on its side for such a strike; Pakistan, having suffered a setback, will be hard-pressed to retaliate because it will have to climb up the escalation ladder, a costly proposition both for reasons of the earlier military setback as well as international diplomatic pressure; given India’s upper hand, both militarily and diplomatically, Pakistan will choose to not escalate; if, however, Pakistan did choose to escalate, India will still enjoy escalation dominance because of its superior capabilities and international diplomatic support; India, given its diplomatic and military heft, will be able to raise the costs for Pakistan in an escalation spiral.\n\nResult: Pakistan will weigh the consequences as a rational-choice actor and prefer to climb down.\n\nThe basic premise in all this cannot be missed: the first-round result. Every subsequent assumption flows from what India could achieve militarily in the opening hand. However, if the presumably weaker side denies the stronger side success in the opening round, draws its own blood successfully while showing restraint, it can raise the costs for the stronger actor by upending the latter’s assumptions based on the success of the opening round.\n\nIn 2019, after an attack on a soldiers’ convoy in Pulwama in India-Occupied Jammu and Kashmir, the starting premise went awry.\n\nAlso, these assumptions rest on yet another assumption: that the force asymmetry is such that India has a heavy advantage in the conventional realm, if not to a level where it could coerce Pakistan outright, then at least to the point where it can confidently launch such an attack and also blunt a Pakistani riposte if Pakistan chooses to retaliate. That assumption, swallowed hook, line and sinker even by many bright Western analysts (they still exist!) might just be flawed.\n\nWithin the concept of limited, we can assume the mechanisms of control to consist of limitation of means, the theatre of operations (nodal point(s) chosen for the strike) and time. Absent any one of these and limited doesn’t remain limited, much less planned and controlled. As noted above, Clausewitz’s argument was that the objective of war should be clearly defined and that objective must determine the means to that end.\n\nIn a more or less symmetric contest under the nuclear overhang, limited cannot remain limited if the two sides continue to draw blood and, in doing so, keep climbing higher up on the escalation ladder, neither prepared to climb down for reasons not just of prestige but also to establish deterrence — unless, of course, external actors can get involved, what former National Security Adviser Dr Moeed Yusuf calls “the brokered bargaining framework.” In such a scenario, the very attempt by both sides to dominate the escalation ladder would mean planned escalation by one party is dead.\n\nAmerican military strategist Bernard Brodie understood this clearly. In a nuclear overhang, limited war inverses the Clausewitzian ends-means relationship. Means become paramount, not because the objective is not defined “but because it is the avoidance of certain means [nuclear weapons] that determines the end.” This would also mean avoiding certain targets, which implies some form of restraint.\n\nBut exercising restraint — a resolve that can continue to loosen as more blood is shed — also indicates that it is better to find a settlement ex ante [before the conflict begins] than go through the cost during and after a conflict.\n\nIn any case, as should be evident, all of this reflects the need to prevent escalation, because it cannot remain planned and matters can get out of hand rapidly. That brings us to the question of why Pakistan and India keep getting into these cycles.\n\nKASHMIR AND THE SUBCONTINENT’S TRAP\n\nGerman theologian and anti-Nazi dissident Dietrich Bonhoeffer once said, “If you board the wrong train, it is no use running along the corridor in the opposite direction.” This sums up aptly India’s Kashmir problem.\n\nKashmiris don’t want to stay in India; Pakistan won’t let go of the dispute since it’s alive on the United Nations agenda and remains unresolved. India’s policy is to suppress the Kashmiris on the one hand and blame Pakistan for its woes in Kashmir on the other.\n\nTraditionally, New Delhi has adopted two strategies. During periods of normalisation, it has talked about talks with Pakistan, rather than any substantive, result-oriented dialogue (the mid-noughties saw an opportunity but that was lost). Simultaneously, within, it has alternated between opening a track with Srinagar while using force to keep the Kashmiris suppressed.\n\nThat has not worked because there is a wide chasm between how the Indian state looks at the definition of what a “political solution” means and through what processes it can be arrived at, and how the Kashmiris perceive it.\n\nOn the Kashmiri side too, the pro-India parties, National Conference (NC) and Peoples Democratic Party (PDP), while not asking for breaking away from India, look at a political solution in terms of greater autonomy and, since 2019, the revival of Article 370 in its original, not hollowed-out form. The Hurriyat factions and the Kashmiri youth have their own definition of a political solution and that doesn’t fit in with the NC and PDP view. A fair referendum today would see Kashmiris opting out of India.\n\nSince the coming into power of Narendra Modi, India’s policy of a “political solution” has changed. Modi has steadily moved toward a two-pronged policy that (a) seeks to isolate Pakistan and (b) attempts to give Pakistan a ‘decisive blow.’ The two prongs are supposed to work in tandem.\n\nAs Indian NSA Ajit Doval said at a talk in 2010 when he was a private citizen, Kashmiris have to be assimilated and he believes that doing so requires that Pakistan’s mindset be changed. Put another way, India has decided that Kashmir is its Pakistan problem, pushing Kashmir and Kashmiris out of the picture altogether.\n\nThis is precisely what the right wing in Zionist Israel has tried to do with the Palestinians. In fact, it is instructive to see how much has India picked up from the Israeli playbook.\n\nPakistan’s own Kashmir policy has been flawed at multiple levels and has harmed the Kashmiri cause immensely. It has helped India to (a) position the issue as an India-Pakistan dispute rather than an issue of Kashmiris’ right to self-determination and (b) present it as a problem of ‘terrorism’ and the struggle as religion-oriented rather than one for freedom from India’s oppressive and illegal occupation of Kashmir.\n\nThe two — resistance, armed or unarmed, and terrorism — are qualitatively different, as United Nations General Assembly resolutions 2625 and 3246 testify through their language, affirming the legitimacy of resistance by oppressed and occupied peoples in pursuit of the right to self-determination.\n\nBy making Kashmir an India-Pakistan problem and by terming Kashmiris’ armed resistance as ‘terrorism’ sponsored by Pakistan, India has sought to and has been successful in (a) removing the real issue from the international agenda (the right to self-determination) and (b) making space for the self-defence argument every time there’s an armed attack in Occupied Jammu and Kashmir.\n\nSince 2016, it has also entrapped itself in its own muscular rhetoric of taking the war into Pakistan. The right-wing Indian government’s belligerent statements create the domestic demand, especially in the Hindutva constituency, for action on the ground to match the rhetoric.\n\nThis is also borne out by the obsequiousness with which Mr Modi dealt with China after Chinese troops killed 20 Indian soldiers, including the commanding officer of the unit, and captured seven officers who were later returned. Modi would not even concede that the Chinese had pushed back Indian troops. He was roundly criticised for not stating the real situation on the ground. On the plus side, his restraint kept the sentiments at a manageable level, a prerequisite for a diplomatic solution.\n\nEPILOGUE\n\nIndia-Pakistan relations are normally discussed with reference to various disputes. But the issue is structural. Disputes are markers and, as in the case of Kashmir, can cause wars. In terms of Pakistan’s threat perception from India, two issues are important.\n\nIn the immediate wake of Partition, the two states went to war over Kashmir after the Poonch and Gilgit-Baltistan uprisings by the locals against Dogra rule. In July-August 1951, there was another scare with mutual allegations of troop deployments close to the border. The issue of sharing rivers’ waters was also hanging fire.\n\nAs Gen Ayub Khan wrote in his book Friends Not Masters, this was a crucial issue and, given that India had earlier threatened to block Pakistan’s share of the rivers waters and released the flow only under strict conditions, he had to move fast and decisively. That was the basis of the Indus Waters Treaty.\n\nAyub Khan understood that Pakistan’s “aim should be to build up a military deterrent force with adequate offensive and defensive power.” He argued that this was important because “India’s aim is to expand, dominate and spread her influence.” He was right.\n\nThe issue is not just India’s military strength but the natural inclination of India as a state to increase its influence within and outside the region. The important point in this is not so much a fear that India could conquer and hold Pakistani territory — though at the tactical level that cannot be dismissed (Siachen being an example) — but that India should not be allowed to get into a position where it can use a mix of non-kinetic and kinetic means to coerce Pakistan into accepting its terms.\n\nThat is a structural problem when a state is in the vicinity of a much bigger neighbour that aims to project power. There is empirical evidence that India has reached a state of peace with only those neighbours that have accepted New Delhi’s terms for peace and its hegemonic presence.\n\nIt is, therefore, important to view and analyse Pakistan’s responses in terms of the peculiarities of the make-up and structure of South Asian state-to-state relations, and how India and Pakistan have positioned themselves within it.\n\nPut another way, the argument here is not just about the real or perceived Indian threat to Pakistan. Threat levels can fluctuate and whether they are/were real or perceived, can be, and is, debated. The point is both broader and — as noted — structural, and relates to Pakistan’s drive to avoid being dictated to by India.\n\nThis is not to say that the two sides cannot find a modus vivendi. They can. But that requires engagement and an understanding on India’s side that Pakistan is not what Egypt or Jordan are to Israel. I didn’t say Canada to the US because the situation there is fast changing and actually proves the structural-realist argument that relative power is the most important determinant of interstate behaviour.\n\nThe 19th century Austrian empire’s diplomat and statesman Klemens von Metternich (1773-1859) understood the nature of power. It was precisely this understanding which led him to infuse the power of reason into the diplomatic arrangement known as the ‘Concert of Europe’, to avoid war among Europe’s powers. The system, while cognisant of the interests of the states, sought to temper power through shared values.\n\nGerman statesman Otto von Bismarck (1815-1898) thought it unwise to subordinate power to a higher principle. Nonetheless, he too understood clearly the limits of power and, after the wars of unification, set down to ensure that Germany did not get involved in a European war, especially in the Balkans. We know how that changed with the last German emperor Wilhelm II’s Icarian overreach for dominance.\n\nThe current government in India is embarked on a policy of unilateralism and non-engagement with Pakistan. The policy is underpinned by a high dose of hubris, which is often openly on display. It is ironic, as its own script shows, that it just cannot wish Pakistan away.\n\nThere’s no substitute to positive engagement. But if the two sides are to engage meaningfully, India will have to change that mindset. Unfortunately, it does not appear that that is likely to happen anytime soon.\n\nThe writer is a journalist interested in security and foreign policies. X: @ejazhaider\n\nPublished in Dawn, EOS, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/04120146f6f7ff2.jpg",
  "retrievedAt": "2025-08-23T08:14:18.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908212",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:17:33.000Z"
}
