{
  "title": "Raja Bazaar beautification work yet to start in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Despite the two-month-long closure of the main road of Raja Bazaar from Fawara Chowk to Hamilton Road to make it a pedestrian street, the Rawalpindi Municipal Corporation (RMC) has failed to start the beautification work yet.\n\nIn January, Raja Bazaar became a vehicle-free zone from Fawara Chowk to Hamilton Road, commonly known as Dingi Khoi, and the RMC announced it would start beautification work before Eidul Fitr.\n\nA senior official of RMC told Dawn that the work is likely to start in the next fiscal year since the Islamabad Electricity Supply Company failed to submit its estimate for shifting underground the electricity lines in the area.\n\nHe said Iesco asked to hire consultant and he will give estimates and we start working to hire consultant.\n\nOfficial claims project delayed as IESCO ask to hire consultant\n\nHe said that the Sui Northern Gas Pipelines Limited (SNGPL), the Water and Sanitation Agency (Wasa) and the PTCL had submitted their estimates for the relocation of their utility lines. He said that Wasa gave an estimate of Rs50 million, and SNGPL gave an estimate of Rs30 million for the relocation of water and Sui gas lines.\n\n“We made a plan worth Rs170 million, and the Punjab government gave approval for the project to start the beautification work in Raja Bazaar and turn it into a model bazaar where people would be able to see the historical bazaar with a new look,” said Deputy Commissioner Dr Hassan Waqar Cheema.\n\nHe said that the pace of work would be accelerated soon, adding that after utility lines, the work on beautification and tuff tiles would be started to restore the city’s beauty.\n\nHe said Iesco had been asked to submit their estimates for the underground shifting of wires as soon as possible. He said the administration wanted to complete the work before start of the monsoon season and in this regard, the power company had been asked to speed up the work.\n\nUnder the scheme, he said that all the lampposts would be replaced, benches would be installed, washrooms for women and men would be constructed, old buildings would be restored, plants would be planted, and signboards would be changed.\n\nHe said that the district administration, the Parks and Horticulture Authority (PHA), the Rawalpindi Municipal Corporation (RMC), and other departments have started working on the execution of the Raja Bazaar beautification project.\n\nHe said that a special plan for traffic would be made while allocating more space for the parking of cars and motorcycles. He said that it has been decided to build a model market in the area, which will be equipped with modern facilities.\n\nHe said that four parking sites were created for the parking of motorcycles and cars, including Fawara Chowk Parking Plaza, vacant plot of RMC old offices, Namak Mandi and the backside of the Ganjmandi police station on the bank of Leh Nullah.\n\nFor the parking, 12 kanal land of the RMC on Jinnah Road, commonly known as City Saddar Road, will have a parking plaza, and a proposal to Punjab government for funds had been sent.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6816a3e28a800.jpg",
  "retrievedAt": "2025-10-12T02:53:28.948Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908266/raja-bazaar-beautification-work-yet-to-start-in-rawalpindi",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:34.000Z"
}
