{
  "title": "On the brink again? - Newspaper - DAWN.COM",
  "author": null,
  "content": "SOUTH Asia is on tenterhooks this weekend, as many informed experts are saying that the window of opportunity for India to embark on some ‘kinetic action’ against Pakistan, which it blames without evidence for the Pahalgam incident, is fast closing because the significant global support New Delhi was hoping for is missing.\n\nWhile the hysteria that the governing Hindu nationalist BJP-dominated media has whipped up makes it impossible to rule out such an eventuality, it is also becoming clear that the international community, most notably the US, is telling India to desist from any action that could ignite a conflict in the region.\n\nLater in the year, India is heading to state elections in key states such as Bihar and, after jumping the gun and blaming Pakistan, as has been its wont, it would be hard-pressed to explain to its Hindu nationalist support base why it failed to take action. In such a scenario, it is not clear what face-saving would suffice for the governing party’s support base.\n\nIndia’s hard-line prime minister has left it to his military leaders to decide on the target and timing of any action to be taken against Pakistan as he, like his Pakistani counterpart, seems not to buy the argument attributed to French prime minister Georges Clemenceau that “war is too serious a matter to be entrusted to military men”.\n\nThe world is not prepared to react as it used to in the past to charges of Pakistani complicity.\n\nIn Narendra Modi’s case, at least, it looks like an attempt by the Indian PM to shield himself from any adverse fallout from any such possible adventurism. Or perhaps he could cite the counsel of his military leaders for not plunging the region into a spiralling conflict, the course of which cannot be predicted or controlled.\n\nWhy is the aggressive Indian leader — who scrapped occupied Kashmir’s special autonomous status, did not seem to care about the consequences and triggered new tensions between his country and Pakistan — now trying to insulate himself from the repercussions?\n\nThere could be a number of factors. Despite the size of the growing Indian market and economy, he must also realise that growth and investment are risk-averse. A rapid climb up the escalation ladder in any conflict in a nuclear-armed region could prove to be the kiss of death for his economy.\n\nSecondly, India’s policy, reportedly developed by National Security Adviser Ajit Doval and endorsed by the Modi government, to assassinate/ seek to eliminate supposed threats to national security abroad from Canada to the US to other Western countries to Pakistan has raised more than one brow, with Canada going public with its evidence where a Sikh citizen was killed and the US filing murder-for-hire and money-laundering charges against an Indian government employee.\n\nWhile neither has affected its economy nor scared away foreign investors and business interests, the incidents have eroded India’s credibility in the West. So the world is not prepared to react as it used to in the past to charges of Pakistani complicity or instigation in terror attacks on Indian soil or in occupied Kashmir.\n\nThis is not to say that India does not remain a strategic ally of the US, especially with respect to containing China. China seems mindful of the Indian hostility towards its presence in Pakistan. Security sources claim Pakistan has shared evidence of some role attributable to India in attacks against Chinese nationals working on CPEC projects in Pakistan.\n\nOne is not sure if China found what was shared with it verifiable and credible, but something must explain the change in language Beijing has started using of late. From the foreign minister to state-sponsored think tanks down to social media handles representing official positions, the Chinese seem to have moved from their unequivocal ‘business first’ stance.\n\nBoth Pakistan and China have often acknowledged their ‘time-tested’ friendship as being manifest in close Pakistan military-PLA relations but even so, in the past, Beijing has not hesitated to tell Pakistan to step back, as it did during the Kargil confrontation. In the wake of the Pahalgam incident, China has gone on record as saying it would stand by Pakistan’s sovereignty and territorial integrity.\n\nI doubt this level of Chinese support is carte blanche for wild adventurism by Pakistan. But it surely does mirror China’s concerns regarding an outbreak of hostilities between the two nuclear-armed South Asian neighbours, as Beijing may not itself remain immune from devastation in the worst-case scenario.\n\nOne strategic blunder committed by India, in blaming Pakistan within hours of the Pahalgam massacre and then being unable to share verifiable evidence with Western powers, also seems to have undermined its case and may explain the lack of endorsement of its stance by the West unlike in the past.\n\nIt is also true that while the Israeli military campaign continues against the mostly unarmed Palestinians in Gaza, the Ukraine-Russian war shows few signs of ending soon and the US-Israel duo tries to defang Iran’s nuclear capability, Washington and its (somewhat estranged) European allies are not interested in another distraction which has the potential to turn into a nuclear war.\n\nThe US secretary of state and vice president have both underlined the need for India not to do something rash and for the two countries to calm things down. The EU and major Gulf leaders have also made similar calls, with Saudi Arabia and Iran even offering to mediate.\n\nAgainst this backdrop, the naming of the ISI chief Lt-Gen Asim Malik as the prime minister’s national security adviser brings hope, however faint, of a backchannel. This hope is based on the excellent rapport established between Ajit Doval and his Pakistan counterpart, retired Lt-Gen Nasser Khan Janjua, from 2015 to 2018, when the two smokers developed bonhomie during cigarette breaks as they engaged in backchannel talks in Southeast Asia.\n\nOne can only hope that having ignored Clemenceau once, South Asian leaders will do so again and prove him wrong, because he said: “It is easier to make war than to make peace.”\n\nThe writer is a former editor of Dawn.\n\nabbas.nasir@hotmail.com\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6816be21bb6c3.jpg",
  "retrievedAt": "2025-08-23T08:14:21.826Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908350",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:48.000Z"
}
