{
  "title": "Unsung icons of peace - Newspaper - DAWN.COM",
  "author": null,
  "content": "SPEAKING of peace in a heated environment requires courage; standing with the vulnerable is an act of moral clarity.\n\nBut to remain composed and committed to justice amid hostility is an extraordinary feat, one that only a few can sustain in Pakistan’s increasingly polarised society.\n\nPakistan has, from time to time, produced individuals who quietly defy the dominant currents of fear and division. They stand as sentinels of sanity, choosing principles over populism. One such figure emerged from Umerkot, a border district in Sindh that rarely escapes headlines due to its fragile interfaith fabric, rising Hindu-Muslim tensions, and growing anxieties over forced conversions.\n\nHere, where Hindus constitute a significant portion of the population, and communal suspicion often simmers just beneath the surface, the potential for conflict is real and recurring.\n\nIn February 2012, the town stood on the edge of such a rupture. A property dispute between Muslim shopkeepers from the Arain community and the custodians of the centuries-old Aakharo Temple spiralled into violence. A viral SMS incited local Muslims to mobilise after Friday prayers, and within hours, fear had gripped the city. Two Hindu men were injured, arrests were made, and the area shut down in anticipation of further unrest.\n\nIn that moment of chaos, a voice of restraint emerged: Maulana Abdul Rehman Jamali, a Deobandi scholar and local imam affiliated with the JUI. His sermon from the mosque’s pulpit cut through the noise.\n\n“This is not a religious issue,” he declared, “it is a property dispute — and exploiting it can have grave consequences.” He urged the Hindu community to keep their shops open and cautioned Muslims against mobilising around false grievances. His intervention, grounded in Islamic ethics and civic responsibility, likely averted a larger crisis.\n\nMaulana Jamali’s life was marked by quiet but firm resistance to extremism. Though rooted in the religious mainstream, he was never a sectarian. During the height of Shia-Sunni tensions in the neighbouring districts, he consistently called for unity and warned against the politics of hate. He was also a vocal proponent of Jinnah’s inclusive vision of Pakistan, often reminding congregants that the state’s promise was one of equality, not religious dominance.\n\nCivil society must rediscover its moral anchors — figures who inspire and connect with people.\n\nHis symbolic gestures were as profound as his sermons. In one gathering, he drank from the leftover water of a low-caste Hindu, publicly rejecting caste discrimination and affirming the dignity of all human beings. When he died at 85, Umerkot mourned him as a rare bridge between communities. His funeral drew both Muslim and Hindu leaders, and temples held special prayers in his memory, a scene that testified to the legacy of a man who chose peace when it was neither easy nor popular.\n\nThe residents of Umerkot also remember another notable figure — Mama Dar Badar, who had no permanent home. He was a poet, artist, and left-leaning activist who earned profound respect across all communities. While he was alive, his influence often prevented confrontations between groups.\n\nEven today, the city recalls such icons of peace, and many believe that if figures like Maulana Jamali or Mama Dar Badar were still around, tragedies like the death of Dr Shahnawaz Kunbhar might have been averted.\n\nDr Kunbhar, accused of blasphemy, was killed last year in a staged encounter allegedly orchestrated by the police. The absence of peace-building figures like Jamali and Badar has created an opening for extremists to stoke tensions. An official inquiry report mentions these elements, along with a number of police officials, in the extrajudicial killing of Dr Kunbhar.\n\nThough these extremists lack significant power, the people of Umerkot fear that unchecked activities could further escalate tensions. The city longs for voices of unity and reason to counter divisive forces, although civil society in Sindh raised its voice against the killing of Dr Kunbhar. To a large extent, society overall is losing its strength to stand up against this strand of extremism.\n\nThe mobilisations by civil society in Sindh, started after the extrajudicial killing of Dr Kunbhar, are encouraging, echoing earlier sparks of resistance — such as the outcry following Mashal Khan’s lynching in Mardan in April 2017. At that time, civil society in KP did raise its voice, but the moral clarity was soon overwhelmed. Powerful religious parties shielded the perpetrators, and the judicial process turned them into heroes rather than criminals. The courts eventually set many of them free.\n\nThis pattern is not accidental. In many regions, some extremist elements are seen to have entrenched themselves within the legal and law enforcement systems. The lower judiciary and segments of the lawyers’ community often appear to offer legal and moral cover to the accused, aligning with hard-line religious outfits and local business interests.\n\nMeanwhile, some in the police are reported to treat blasphemy allegations as tools for personal gain and basking in the rewards granted by religious zealots: cash, land, and public praise.\n\nCivil society must rediscover its moral anchors in this bleak environment: figures who inspire and connect with ordinary people. Offering resistance in moments of crisis is no longer enough. A longer, deeper narrative must be constructed, rooted in local wisdom and humane values.\n\nFigures like Maulana Abdul Rehman Jamali and Mama Dar Badar provide such inspiration. Though not well recognised nationally, local communities honour them as heroes. Indeed, there would be other examples across the country of individuals who stood firm against hate, refused to align with sectarian pressures and built legacies of coexistence through quiet, local acts of defiance.\n\nRemembering them is not nostalgia. It is an act of resistance, a reminder that justice, peace, and empathy are still possible in Pakistan and that true heroes often act without applause but leave behind a blueprint for courage.\n\nThe writer is a security analyst.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6816bdf6d7e92.jpg",
  "retrievedAt": "2025-08-23T08:14:21.037Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908349/unsung-icons-of-peace",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:48.000Z"
}
