{
  "title": "Sistine Chapel being spruced up for pope’s election - World - DAWN.COM",
  "author": null,
  "content": "VATICAN CITY: Besides its masterpieces by Michelangelo, the Sistine Chapel is undergoing a makeover, involving the installation of a stove for burning secret votes and a chimney which will billow smoke to announce to the world that the Catholic Church has a new pope.\n\nWork is in full swing inside the Apostolic Palace to equip the 13th-century chapel for the vote to elect Pope Francis’s successor, according to a video released by the Vatican press office on Saturday.\n\nThe nearly five-minute video shows builders laying beams on scaffolding to build a raised wooden floor, before setting up large tables for the use of the 133 cardinal electors casting their votes in the conclave.\n\nOther builders are seen installing the heavy stove, where the ballots are burnt, in a corner of the chapel.\n\nThe video, dated Friday, also shows firefighters climbing onto the chapel’s tiled roof to secure the chimney flue.\n\nSmoke from the flue — eagerly watched for in St Peter’s Square below — will be black if no candidate has secured a two-thirds majority, or white if the Church has a new pontiff.\n\nSilvio Screpanti, Vatican City’s deputy director of infrastructure, said five electricians and five technicians would remain onsite for the duration of the conclave.\n\nA technician “will remain throughout the voting” in a small room near the Sistine Chapel, “with a remote control for the stove”, which is now electronically activated, he said in an interview for the Vatican City State website.\n\nAhead of the vote, technicians are “blacking out all the windows” in the areas used during the conclave and deactivating “all the technological devices and sensors installed in recent years in the Sistine Chapel”.\n\nThe day before the conclave, they will install “approximately 80 lead seals at all entrances to the perimeter”.\n\nThey are also cleaning and repainting “around 200 rooms” for cardinals and their staff at the Santa Marta guest house and a building next door, including blocking views from some windows, he said.\n\nFurniture is kept to a “necessary minimum”, including a “bed, bedside table, and wardrobe”, Screpanti said.\n\nSome of the technicians have already taken part in conclaves, while for others it is their first time.\n\nAll those staying to help however must take an oath of secrecy and sleep in the Vatican, “without being able to contact their families”.\n\n‘Princes of the church’ meet\n\nThe cardinals of the Catholic Church held their ninth in a series of near-daily meetings at the Vatican on Saturday ahead of the election of a new pope.\n\nThe closed-door “general congregations” allowed them to discuss the challenges the successor to Pope Francis will face before they are locked into the Sistine Chapel on Wednesday for the vote.\n\nWalking through crowds of pilgrims and journalists for the morning meeting, the “Princes of the Church” gave little away — not even speculating how long the conclave would last.\n\n“We do not know, we just wait for God to tell us,” said Cardinal William Seng Chye Goh, archbishop of Singapore, seen as one of the more conservative prelates.\n\nThe cardinals were called to Rome from around the world after the death on April 21 of Francis, an energetic reformer from Argentina who led the Catholic Church for 12 years.\n\nAccording to Vatican press director Matteo Bruni, 177 cardinals, including 127 aged under 80 and thus eligible to vote in the conclave, attended Saturday’s meeting.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:14:35.767Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908330/sistine-chapel-being-spruced-up-for-popes-election",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:18.000Z"
}
