{
  "title": "Rights group sounds alarm over law and order in rural Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Members of Tehrik-i-Niswan, a women’s organisation that uses performing arts as a medium for giving rights messages to working class women and the marginalised communities, raised serious concerns over the deteriorating law and order in rural areas of the province and urged the government to ensure the safety, security and protection of human life and property all over Sindh.\n\nSpeaking at a press conference at the Karachi Press Club on Saturday, classical dancer, activist and Tehrik-i-Niswan founder Sheema Kermani shared the trauma her team went through at the hands of bandits near Ghotki.\n\nShe narrated their ordeal of three days ago while travelling back to Karachi by road, after a 25-day tour of performing plays across rural Pakistan on youth mental health issues.\n\n“We did 36 performances, in small towns and villages — in open grounds, schools, courtyards and other open spaces — where rural people got the chance of watching a play for the very first time in their lives,” Kermani said.\n\nSheema Kermani recounts ordeal of robbers’ attack on Tehrik-i-Niswan team near Ghotki\n\n“Then, on our way back to Karachi, we were ambushed and attacked by armed dacoits near Ghotki. One of our team members is badly wounded, with gunshots in his arm and leg, which requires surgery. Other members are also hurt and traumatised,” she added.\n\n“Our van is badly damaged and non-functional now. It was a miracle that the team managed to escape and get away without loss of life. As Pakistani citizens, we believe in our constitutional right to live without fear and to travel everywhere in safety and security. But unfortunately, the absence of law and order in rural Sindh demonstrates just the opposite,” she added.\n\n“Why is this so? We ask the Sindh government, especially the Sindh police, what specific actions are being taken to address the dire situation of daily reports of dacoities, kidnapping for ransom, and senseless killing? How long will this go on? Why are the police not able to control this out-of-control law and order situation? Why is poverty, unemployment, deprivation and consequent desperation rising exponentially in rural Sindh,” Kermani questioned.\n\nShe continued: “We demand that the Sindh government, especially the Sindh police and the local administration investigate this incident transparently and publish their findings.\n\n“We demand judicial justice and compensation from the Sindh government. We demand safety, security and protection of human life and property all over Sindh, both rural and urban. We demand concrete visible measures to address climate change, agriculture and water issues; along with eradication of poverty, unemployment and under-development in rural Sindh,” she added.\n\nPublished in Dawn, May 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6816b38027130.gif",
  "retrievedAt": "2025-08-23T08:14:35.205Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908299/rights-group-sounds-alarm-over-law-and-order-in-rural-sindh",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T01:16:24.000Z"
}
