{
  "title": "Chinese president to visit Russia May 7-10, Kremlin says - World - DAWN.COM",
  "author": null,
  "content": "Chinese president Xi Jinping will make an official visit to Russia from May 7-10, where he will participate in celebrations of the 80th anniversary of the defeat of Nazi Germany, the Kremlin said on Sunday.\n\nIn a statement on Telegram, the Kremlin said that Xi will discuss with Russian President Vladimir Putin the development of the two countries’ strategic partnership, as well as signing a number of documents.\n\n“During the talks, the main issues of further development of relations of comprehensive partnership and strategic interaction, as well as current issues on the international and regional agenda will be discussed,” the Kremlin said.\n\nThe Soviet Union lost 27 million people in World War II but pushed Nazi forces back to Berlin, where Hitler died by suicide and the red Soviet Victory Banner was raised over the Reichstag in 1945.\n\nSeveral other national leaders are expected at the celebrations, including the presidents of Brazil and Serbia, and the prime minister of Slovakia.\n\nPutin has proposed a three-day ceasefire with Ukraine around the May 9 celebration, one of the most important in the Russian calendar.\n\nResponding to Moscow’s offer of the three-day ceasefire, Ukrainian President Volodymyr Zelenskiy said he was ready as long as the ceasefire would be 30 days in length, something Putin had already ruled out in the near term, saying he wants a long-term settlement, not a brief pause.\n\nZelenskiy said Ukraine, given the continued war with Russia, could not guarantee the safety of any foreign dignitaries who came to Moscow for the traditional May 9 victory parade.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/24174514c2f2847.jpg?r=174958",
  "retrievedAt": "2025-08-23T08:14:16.888Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908395/chinese-president-to-visit-russia-may-7-10-kremlin-says",
  "dateList": "2025-05-04",
  "date_published": "2025-05-04T10:02:33.000Z"
}
