{
  "title": "Pakistan keen to enhance trade, connectivity ties with Kazakhstan: PM",
  "author": null,
  "content": "ISLAMABAD, Sep 9 (APP): Prime Minister Shehbaz Sharif on Tuesday said that Pakistan was keen to enhance bilateral trade, investment, people-to-people exchanges and connectivity through air, rail and road with Kazakhstan.\nThe prime minister, in a meeting with Deputy Prime Minister and Foreign Minister of Kazakhstan Murat Nurtleu, who called on him here, said that Pakistan and Kazakhstan enjoyed strong fraternal relations, and there was a mutual desire on both sides to further strengthen bilateral cooperation across multiple areas of shared interest.\nAccompanied by a ministerial delegation, the Kazakh deputy prime minister is on his first two-day official visit to Pakistan.\nWhile welcoming the Kazakh deputy prime minister, the prime minister conveyed his warm wishes for President Kassym Jomart-Tokayev, whom he had recently met in China.\nHe indicated that Pakistan was attaching great importance to the visit of the Kazakh President and offered to send a delegation to Astana to finalize the various MoUs and agreements under consideration. The two sides have been in regular discussion over the past several months and are expected to ink key MoUs and agreements during the Kazakh President’s visit later this year.\nKazakh Deputy Prime Minister Murat Nurtleu thanked Prime Minister Shehbaz for the warmth and hospitality extended to him and briefed him on his detailed discussions with Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar earlier in the day.\nHe emphasized that the upcoming visit of President Tokayev to Islamabad would be historic and successful, and would open a new and exciting chapter in Pakistan-Kazakhstan ties.\nDPM Ishaq Dar and federal ministers for communications, economic affairs, and railways, SAPM Tariq Fatemi and foreign secretary also attended the meeting.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:44:39.401Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-keen-to-enhance-trade-connectivity-ties-with-kazakhstan-pm/",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T16:49:00.000Z"
}
