{
  "title": "Pakistan, China agree to jointly develop space centre, train astronauts",
  "author": null,
  "content": "ISLAMABAD, Sep 09 (APP): Pakistan and China have agreed to enhance cooperation in space science, astronaut training and the establishment of a Pakistan Space Center under a five-year action plan.\nThe agreement is part of the “Action Plan (2025–2029) to Foster an Even Closer China-Pakistan Community with a Shared Future in the New Era,” adopted between Pakistan and China in Beijing.\nAccording to a brief of the plan available with Wealth Pakistan, the two countries will continue implementing the 2021–2030 Space Cooperation Outline Program signed between the China National Space Administration and Pakistan’s Space and Upper Atmosphere Research Commission.\nBoth sides reaffirmed commitment to joint work on lunar and deep space exploration, including multilevel assessments of the International Lunar Research Station and enhanced collaboration in advanced space technologies.\nThe action plan also provides for the joint selection and training of astronauts, a move that could pave the way for Pakistan’s eventual participation in human spaceflight missions in collaboration with China.\nA key element of the plan is continued discussions on the establishment of the Pakistan Space Center, which will serve as a hub for research, development and application of space technologies for economic and social development.\nThe two countries also agreed to strengthen cooperation on the use of the international version of the China Platform of Earth Observation System, enabling Pakistan to access advanced remote sensing and satellite technologies to support agriculture, disaster prevention, water management, climate monitoring and urban planning.\nThe action plan underscores that deploying space technologies is central to promoting economic modernization and social development in Pakistan, while deepening the bilateral all-weather strategic cooperative partnership.\nChina and Pakistan noted that their long-standing cooperation in space science and technology is not only of mutual benefit but also of strategic significance, reflecting their resolve to expand collaboration in frontier domains alongside traditional areas such as trade, infrastructure and defense.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:26:19.831Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-china-agree-to-jointly-develop-space-centre-train-astronauts/",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T14:53:00.000Z"
}
