{
  "title": "Pakistan, Kazakhstan eye maritime cooperation, regional connectivity",
  "author": null,
  "content": "ISLAMABAD, Sep 09 (APP):A Kazakh delegation led by Transport Minister Nurlan Sauranbayev held talks with Ministry of Maritime Affairs on Tuesday to strengthen cooperation in seaports and regional connectivity.\nThe delegation, received by Federal Secretary Syed Zafar Ali Shah, discussed opportunities for collaboration on Pakistani ports and multimodal transport corridors linking Central Asia with the Arabian Sea through road, rail and sea routes, said a press release.\nShah underlined the strategic position of Pakistan’s ports, offering access to South Asia, Central Asia, Gulf countries, and beyond.\nHe said Kazakhstan could benefit from container handling, logistics, off-dock terminals, free trade zones, and other port facilities under the China-Pakistan Economic Corridor (CPEC), noting that Pakistan’s tariffs were regionally competitive.\nOfficials from Karachi Port Trust (KPT) and Port Qasim Authority (PQA) highlighted spare capacity to handle Central Asian cargo, while stressing that a dedicated multipurpose terminal at Gwadar was crucial for long-term trade growth.\nPresentations on business opportunities and incentives at Karachi, Port Qasim, and Gwadar were given to the visiting delegation.\nKPT Acting Chairman, Rear Admiral Ateeq-ur-Rehman, briefed the Kazakh side on port facilities and a planned maritime business district spanning 140 acres of urban land.\nPQA Chairman Rear Admiral (Retd) Syed Moazzam Ilyas emphasized Pakistan’s role as an energy hub and proposed cooperation in off-dock terminals linked with rail networks for Central Asian trade.\nAdditional Secretary, Umer Zaffar Shaikh, outlined Gwadar’s potential, including full exemptions on duties and sales tax, its off-dock terminals, and its shortest land-sea route for Central Asian countries via the coastal highway.\nKazakh Transport Minister, Sauranbayev expressed a strong interest in expanding maritime cooperation and building long-term collaboration with Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:26:41.320Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-kazakhstan-eye-maritime-cooperation-regional-connectivity/",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T15:09:00.000Z"
}
