{
  "title": "Turkish Defence Minister calls on Prime Minister",
  "author": null,
  "content": "ISLAMABAD, Sep 09 (APP):Minister of National Defence of Turkiye, Yasar Güler, who is currently on a visit to Pakistan as co-chair of the Pakistan-Turkiye Joint Ministerial Commission, Tuesday called on Prime Minister Muhammad Shehbaz Sharif at the Prime Minister House.\nWhile warmly welcoming the Turkish Defence Minister and members of his delegation, the prime minister underscored the historic and fraternal ties between Pakistan and Türkiye, that are deeply rooted in shared history, culture, and mutual respect, a Prime Minister’s Office news release said.\nHe expressed satisfaction over the positive trajectory of bilateral relations and reaffirmed Pakistan’s unwavering commitment to further strengthening cooperation with Turkiye in diverse fields including trade, investment, technology, and defence.\nRecalling his recent interaction with President Recep Tayyip Erdogan on the sidelines of SCO Council of Heads of State meeting in China, the Prime Minister reaffirmed Pakistan’s commitment to build closer Pak-Turkiye relations through frequent engagement at all levels, including at the leadership level.\nPrime Minister Shehbaz Sharif particularly emphasized on the need to work towards achieving the mutually agreed target of USD 5 billion in bilateral trade, through concerted efforts. Highlighting Pakistan’s investor-friendly policies, the Prime Minister also invited Turkish companies to expand their investment footprint in Pakistan.\nBoth sides reaffirmed their strong and abiding support for each other’s core national interests and agreed to continue working closely to further elevate the strategic partnership between Pakistan and Türkiye.\nThe meeting was followed by a dinner hosted by the Prime Minister for the Turk Defence Minister and members of Pak-Turk Joint Ministerial Commission.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:43:46.096Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/turkish-defence-minister-calls-on-prime-minister/",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T22:14:00.000Z"
}
