{
  "title": "In Partnership with NCSW, UN Women Launches Landmark Dialogue on Pakistan’s Care Economy",
  "author": null,
  "content": "ISLAMABAD, Sep 09 (APP):UN Women, in partnership with the National Commission on the Status of Women (NCSW), has launched a two-day forum titled “Transforming Care Systems: A Roadmap for Economic Growth and Social Equity in Pakistan” to advance the country’s first Care Economy Roadmap.\nThe dialogue brings together government representatives, development partners, civil society, academia, and the private sector to define priorities for strengthening Pakistan’s care systems. Partners include UNICEF, the International Labour Organization (ILO), the Government of Norway, and Jazz.\nSpeaking at the opening, NCSW Acting Chair Umme Laila Azhar stressed the urgency of recognizing unpaid work. “This is not just about services—it’s about ensuring that every woman’s work is visibly valued and supported,” she said.\nMohamed Yahya, UN Resident Coordinator in Pakistan, said care must be recognized as a skilled profession and a cornerstone of human development. Kazim Mujtaba of Jazz highlighted the private sector’s role, noting that investing in care boosts women’s workforce participation and strengthens the economy.\nH.E. Ar. Siti Rozaimeriyanty Dato Haji Abdul Rahman, Secretary-General of the ASEAN Inter-Parliamentary Assembly, praised Pakistan’s leadership in advancing the regional care agenda.\nThe forum is examining the economic and social case for investing in care, including paid and unpaid work, social protection, decent work policies, and public–private partnerships. It also explores links between care, climate resilience, and gender equality.\nBy the end of the two days, participants will produce a policy paper consolidating recommendations to guide Pakistan’s first Care Economy Roadmap.\nSpeakers include Dr. Sharmila Faruqi, MNA; Jamshed M. Kazi, UN Women Pakistan; Sharmeela Rassool, UNICEF; Dr. Lubna Shehnaz, PRIDE Consulting; Gulmina Bilal, NAVTTC; Durreshahwar, Pakistan United Workers Federation; Muhammad Jahangir, Handicap International; Dr. Dure Nayab, PIDE; Humaira Zia Mufti, NCSW; Ivo Spauwen, ILO; and Summaiya Bushra, BOPinc.\nClosing remarks will be delivered by Minister of State Wajiha Qamar, Norwegian Ambassador Per Albert Ilsaas, and Jacqui Ketunuti of UN Women Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:43:46.100Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/in-partnership-with-ncsw-un-women-launches-landmark-dialogue-on-pakistans-care-economy/",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T22:56:00.000Z"
}
