{
  "title": "Gilani strongly condemns Israeli airstrike on Doha",
  "author": null,
  "content": "ISLAMABAD, Sep 09 (APP):Chairman Senate of Pakistan, Syed Yousaf Raza Gilani, Tuesday strongly condemned the Israeli airstrike on Qatar’s capital, Doha, terming it a blatant act of aggression aimed at sabotaging peace and stability in the region.\nIn his statement, the Chairman said that this brazen and cowardly attack on Qatar constitute a serious violation of the United Nations Charter, specifically Article 2(4), which prohibits the threat or use of force against the territorial integrity or political independence of any state.\nSyed Yousuf Raza Gilani also said that the attack on Doha is not only a violation of Qatar’s sovereignty but also a reckless attempt to destabilize the Gulf and undermine global peace. He noted that Israel’s hostile actions once again expose its disregard for international law and humanitarian norms.\nGilani stressed that Muslim nations must forge unity and adopt a comprehensive and effective strategy to counter Israel’s aggression and to safeguard the collective interests of the Muslim Ummah.\nHe further highlighted that Israel’s violations are not confined to Palestine alone, where it continues to commit grave human rights abuses against innocent civilians, but are now threatening the wider region as well — posing a serious danger to global stability.\nThe Chairman Senate urged the international community, particularly the United Nations and the UN Security Council, to take immediate notice of Israel’s actions and ensure concrete steps to halt its aggression.\nHe emphasized that the world cannot remain silent while Israel continues to flout international law, threaten regional peace, and endanger innocent lives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:44:10.433Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gilani-strongly-condemns-israeli-airstrike-on-doha/",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T21:30:00.000Z"
}
