{
  "title": "Kashmiris worldwide unite on Solidarity day",
  "link": "https://www.app.com.pk/national/kashmiris-worldwide-unite-on-solidarity-day/",
  "date_published": "2024-02-05T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP): On Kashmir Solidarity Day, analysts condemned the Modi-led Indian government, accusing it of complicity in the genocide of Muslims in illegally occupied Jammu and Kashmir.\nAnalysts, speaking to Pakistan Television News on the occasion of Kashmir Solidarity Day, criticized the discriminatory policies of the Modi-led Indian government.\nThey highlighted the negative impact of repression on the people of the occupied valley and emphasized that such tactics would not break the spirit of the Kashmiri population.\nUrging Indian troops to stop violating the ceasefire, the analysts particularly condemned the use of innocent civilians as human shields in occupied Kashmir.\nThey called for an end to such practices, emphasizing the importance of respecting human rights in the region.\nThe analysts expressed concern over India becoming a dangerous country for minorities under the Modi government.\nThey highlighted the plight of Kashmiris on both sides of the Line of Control (LoC) and around the world, stating that they were victims of the discriminatory policies.\nKashmiris, both in the occupied territory and across the world, were mentioned as observing February 5 as Kashmir Solidarity Day.\nThe day serves as a reminder of the commitment to supporting the Kashmiri cause for self-determination.\nThe analysts reiterated Pakistan’s commitment to providing moral, political, and diplomatic support to the Kashmir issue.\nThey praised the role of the Pakistani media in highlighting the issues of Kashmir and exposing Indian atrocities at various international forums.\nResponding to a question about global awareness, the analysts stated that the world is cognizant of India’s aggressive policies, expressing concerns about the serious situation in occupied Jammu and Kashmir.\nThey believed that the time is approaching when Kashmiris will achieve their fundamental right to self-determination.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:16:19.520Z"
}
