{
  "title": "Participation of youth vital to strengthen democracy, political system: PM",
  "link": "https://www.app.com.pk/national/participation-of-youth-vital-to-strengthen-democracy-political-system-pm/",
  "date_published": "2024-02-05T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday said youth should be engaged in the political system and their energies should be utilized for strengthening democracy in the country.\nSpeaking during a podcast, he said political parties should be democratic minded to fortify democracy in the country.\nPolitical parties in government should improve their performance to gain political space in the country, he added.\nThe prime minister said leadership of the political parties should be elected in a democratic manner in order to take democracy forward.\nHe said the idea of democracy was facing many challenges in Pakistan due to different reasons and weaknesses in the structure of the civil institutions.\nHe said the Afghan refugees lived in Pakistan for decades, and used the health and education services and the infrastructure of Pakistan and their businessmen earned billions of dollars through the Afghan transit trade.\nThe prime minister asserted that Pakistan wanted a friendly government in Afghanistan as was the desire of other countries in the region.\nHe was of the view that the government of Taliban was formed in Afghanistan after the world squandered its opportunities despite spending $ 2 trillion.\nHe said the Taliban forcefully took over the government as the United States and NATO abandoned Afghanistan.\nTo a question, he said during his tenure, he interacted with the students from the educational institutions of Balochistan, Azad Kashmir, Khyber Pakhtunkhwa, Sindh and Balochistan, and shared his views with them and listened to their perspectives.\nHe said in Balochistan, armed insurgents were masquerading as civil society and speaking the language of human rights for achieving a certain goal.\nThose elements never belonged to a mainstream political party but were part of the proscribed organizations in the province, he added.\nPM Kakar said some groups in Balochistan wanted to carve out a new country on the basis of identity and through armed struggle, and they had declared a war on the state of Pakistan.\nThe stance of those elements was against morality, and the Constitution and laws of Pakistan, he remarked.\nThe prime minister said most of the people left the country for better jobs and due to economic reasons, however, millions of youth saw their future in Pakistan.\nThose people who send remittances from abroad were assets of Pakistan and they were contributing to its economic growth, he remarked.\nHe opined that there were many people who wanted to return to Pakistan after living their lives in Europe and North America.\nIn future, more people will return to Pakistan because of their Islamic roots and attachment to eastern values, he observed.\nHe said during his tenure he tried to take decisions in the best interest of Pakistan.\nAfter leaving the office of caretaker prime minister, Kakar said he would like to serve in the Senate of Pakistan.\nHe said the caretaker government assisted the Election Commission for the holding of elections which would take place on February 8 despite all the speculations.",
  "retrievedAt": "2025-08-11T00:15:50.450Z"
}
