{
  "title": "India a terrorist state, committing worst atrocities against Kashmiris: Kakar",
  "link": "https://www.app.com.pk/national/pakistan-closely-observing-indian-state-terrorism-against-kashmiris-pm-kakar/",
  "date_published": "2024-02-05T12:40:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Feb 5 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday said that India was a terrorist state, which had been committing the worst atrocities and brutalities against the innocent people of Indian Illegally Occupied Jammu & Kashmir for decades.\nThe world was, however, silently watching the Indian state terrorism against the Kashmiris, he regretted while  addressing the Azad Jammu and Kashmir Legislative Assembly on the occasion of Kashmir Solidarity Day.\nThe prime minister said for last many years, India was presenting a false narrative and trying to weaken the indigenous movement of the Kashmiris for freedom by wrongly labeling them as terrorists.\nThere was a clear difference between terrorism and the people’s struggle for independence, he added.\nPM Kakar said that the Indian leadership was also claiming that Gilgit-Baltistan and Azad Jammu & Kashmir were part of their country.\n“On this day, I make it clear that that India should not have any such illusions. We believe in peace and are showing maximum patience and tolerance, but any misadventure in this regard will be forcefully responded.”\nHe reaffirmed that Pakistan did not want any conflict in the region, however, it was fully capable of strongly retaliating any attack on its soil.\nIndia, he said, had for many times tested Pakistan’s  capacity, and if still had any desire in that regard then “we are fully ready to show our might”.\nHe said if India was a true democracy then it should give the people of Kashmir their just right to self-determination, besides restoring all the basic human rights in the IIOJK.\nPM Kakar said India must also stop the gross violations of human rights in the region along with releasing all the political prisoners. It should also abrogate all the strict emergency laws, besides removing its heavy military presence from the villages and towns of Kashmir.\nIt should allow the Kashmiris to hold peaceful gatherings, he added.\nThe prime minister said that India must allow unrestricted access to the observers of UN and Organization of Islamic Conference (OIC), international media and human rights organizations to IIOJK to get first-hand information about the situation there; and investigate and report human rights violations.\nHe said that India’s illegal and unilateral actions of August 5, 2019 usurping the special status of of the IIOJK were a blatant violation of international laws, including the UN Charter, 4th Geneva Convention and the relevant UN Security Council resolutions.\nIndia had since been engaged in taking further measures to alter the demographic structure and political landscape of the held Valley, he added.\nPM Kakar said that the ‘Kashmir Solidarity Day’ was annually observed on the 5th February across Pakistan to express its unwavering support for the Kashmiris’ just struggle for realization of their right to self-determination.\nIt was also an occasion to pay rich tribute to the sacrifices rendered by the Kashmiri brothers and sisters during the last 76 years, he added.\nThe prime minister said that Pakistan had consistently maintained that a lasting solution of the Jammu and Kashmir dispute was possible only in accordance with the relevant UN Security Council resolutions and as per the wishes of Kashmiri people.\nPakistan would continue its moral, diplomatic and political support for the just cause, he vowed.\nPM Kakar said that the relevant UN Security Council resolutions provided that the final disposition of the Jammu and Kashmir dispute would be made in accordance with the will of its people through the democratic method of a free and impartial plebiscite conducted under the auspices of the United Nations.\nHowever, he added, India over the last 76 years had carried out a relentless campaign to intimidate and suppress the IIOJK people as evident from extrajudicial killings, arbitrary detentions and custodial torture.\nEarlier on his arrival at arrival at the AJK Legislative Assembly, the prime minister was presented a guard of honour.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:16:29.227Z"
}
