{
  "title": "Pakistan’s diplomatic missions observe Kashmir Solidarity Day",
  "link": "https://www.app.com.pk/national/pakistans-diplomatic-missions-observe-kashmir-solidarity-day/",
  "date_published": "2024-02-05T14:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP): The diplomatic missions of Pakistan across the world on Monday observed the Kashmir Solidarity Day to express support the struggle of the people of Indian Illegally Occupied Kashmir (IIOJK) for their right to self-determination.\nThe Friends of Kashmir in Dallas, United States, organized a seminar to show solidarity with the people of Kashmir that was attended by the Kashmiri diaspora, local dignitaries and Sikh community.\nSpeakers at the seminar highlighted gross human rights violations in the IIOJK and called upon international community to play its role in granting the right of self-determination to Kashmiris.\nThe Pakistan Consulate General in New York also arranged an event to mark the Kashmir Solidarity Day. A large number of people including members of Kashmiri and Pakistani community in New York, opinion leaders, scholars, students and journalists attended the event.\nInspiring speeches were made by Consulate General Aamer Ahmed Atozai, Dr. Asif Rehman, Carin J. Fischer, Dr. Sima Karetnaya, Zameer Ahmad, Taj Khan, Sardar Sawar and Saghir Khan.\nThe Consulate General said that Pakistan stood committed to the acquisition of the right of self-determination for Kashmiri brethren in accordance with the UNSC resolutions.\nLikewise, Pakistan’s Embassy in China also observed the Kashmir Solidarity Day by hosting a ceremony to underscore the country’s  unwavering commitment to the Kashmir cause, including the right to self-determination of the Kashmiri people\nOn the occasion, the embassy also organized a panel discussion on the continued non-implementation of the United Nations Charter and international laws for the maintenance of world peace and security.\nThe panelists stressed the centrality of multilateralism, with the UN at its core, for the resolution of disputes and prevention of conflicts.\nThe event was attended by diplomats,  scholars, academics and media.\nSimilarly, the Embassy of Pakistan in Abu Dhabi organized an event to mark the Kashmir Solidarity Day. A number of Pakistani and Kashmiri community members based in the United Arab Emirates attended the event.\nAmbassador Faisal Niaz Tirmizi, in his remarks, paid tribute to the valiant people of the IIOJK and lauded their more than seven decades long efforts for the realization of the right to self-determination.\nCondemning India’s unilateral and illegal actions in the IIOJK, he said that India’s atrocities could not deter the Kashmiri people from demanding their fundamental rights pursuant to the UN Security Council resolutions.\nThe representatives of Kashmiri community also spoke on the occasion and shared their sentiments on the situation in the IIOJK, expressed concern over the Indian brutalities against innocent civilians and reaffirmed their commitment to pursue their struggle for the realization of the right to self determination.\nA documentary was also screened at the event.\nMeanwhile, an event was also organized at the Embassy of Pakistan in Phnom Penh, Cambodia to mark the Kashmir Solidarity Day and to re-affirm solidarity with the Kashmiri people’s struggle for realization of their right to self-determination.\nThe Embassy of Pakistan in Hanoi, Vietnam also organized a seminar to observe the Kashmir Solidarity Day and to express Pakistan’s unwavering support for the just struggle of the Kashmiri people for their inalienable right to self-determination.\nPakistan’s High Commission in Dhaka, Bangladesh also organized an event to observe “Kashmir Solidarity Day.” Members of Pakistani diaspora, civil society and local media attended the event.\nHigh Commissioner Syed Ahmed Maroof read the statements of Pakistani leadership and reaffirmed Pakistan’s unwavering moral, diplomatic and political support for the people of IIOJK.\nHe said that Pakistan would continue to raise its voice for the people of IIOJK at every forum.\nA seminar and photo exhibition was held at Pakistan’s High Commission in Colombo, Sri Lanka to mark the Kashmir Solidarity Day.\nPictures depicting the human rights violations by Indian occupation forces in the Indian Illegally Occupied Jammu & Kashmir (IIOJK) were displayed at the venue as part of the photo exhibition. Digital videos exhibiting violence in IIOJK were also played during the seminar.\nPakistan’s Consulate General Melbourne, Australia, organized a Kashmir Solidarity Day event, which was addressed by the Consul General, Chairman Kashmir Council Europe Syed Ali Raza and renowned writer Ms Laura Schuurmans.\nThe event also included poems, speeches and tableau by the students. The participants expressed solidarity with the Kashmiri people and stressed upon the international community to resolve the Kashmir dispute as per the UN resolutions.\nPakistan’s High Commission in New Zealand organized an event to observe the Kashmir Solidarity Day with the participation of Pakistani diaspora from all walks of life.\nThe Embassy of Pakistan in Azerbaijan also organized an event to observe the Kashmir Day. People from different walks of life joined the Embassy officials to mark the Day. Azerbaijan has always championed the cause of IIOJ&K at international fora.\nSimilarly, Pakistan’s Embassy in Spain also held an event in Valencia in this regard. Ambassador Shujaat Rathore reiterated Pakistan’s unwavering support to the just struggle of the Kashmiri brethren. A large number of Pakistanis, Kashmiris and Spanish attended the event.\nIn an event held at Pakistan’s Embassy in Tehran, Iran, Ambassador Mudassir highlighted brutal atrocities committed by the Indian occupation forces in Kashmir and reiterated the need for implementation of the UN resolutions.\nPakistan’s Embassy in Kathmandu, Nepal organized a discussion programme on the Kashmir Solidarity Day.\nAmbassador Abrar H Hashm emphasized the role and response of international community in view of numerous UNSC resolutions promising the people of Jammu and Kashmir their right to self determination.\nThe Embassy of Pakistan in Tokyo, Japan also marked the Kashmir Solidarity Day where Pakistani community members, Kashmiris as well as Japanese media persons attended the event. Syed Faiz Naqshbandi, Convener All Parties Hurriyat Conference joined the event virtually.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:16:13.950Z"
}
