{
  "title": "Gas, electricity prices to come down shortly: Asad Umar",
  "link": "https://www.app.com.pk/national/gas-electricity-prices-to-come-down-shortly-asad-umar/",
  "date_published": "2020-03-11T00:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):Minister for Planning, Development, and Special Initiatives (PDSI) Asad Umar on Tuesday said the prices of gas and electricity in the country would come down shortly.\n“The Prime Minister has chaired several meetings to bring down the prices of gas and electricity, and in future the prices are likely to come down as a result of the Prime Minister’s personal efforts,” he said adding this would also help reducing the input cost for our industries.\nAddressing a round-table discussion on “The role of Planning and Development in Pakistan’s Economy” here at the Institute of Strategic Studies Islamabad (ISSI), he said the government was also working on establishing and making Council of Common Interests’ secretariat effective and operational to smoothly resolve differences.\nHe said the ministry of PDSI had a pivotal role in the economic development and uplift of national economy.\n“The government is committed to bringing about institutional and structural reforms. Government is developing a three years growth strategy as well as working on the establishment of the Secretariat of Council of Common Interests (CCI) and making it operational.”\nAsad Umar said that despite structural changes in Pakistan’s economy, the role of government in general and ministry of PDSI in particular remains relevant.\nWhile highlighting the importance of a planned economy, Asad Umar said that during 1960s, despite having immense oil resources gulf countries were wallowing in poverty, it was only after the leading role played by the Gulf Governments, that their economic situation improved.\nChina’s growth and economic success is another case in point for the planned economy.\nDuring the decade of 1950s and 1960s, he said Pakistan’s economy was developing due to its planned nature, although much has changed since then, the need for a planned economy with due input from the private sector stays primate.\nAnswering a question about the effect of 18th amendment on Pakistan’s economy, Asad Umar said that 18th Amendment was absolutely essential for a polity like Pakistan, and has not had any negative impacts for the country’s economy.\nDirector General ISSI Ambassador Aizaz Ahmad Chaudhry and eminent guests from academia and government were also present.",
  "retrievedAt": "2025-08-11T18:56:23.252Z"
}
