{
  "title": "Hajj Ministry keeps money in Interest free accounts: Qadri",
  "link": "https://www.app.com.pk/national/hajj-ministry-keeps-money-in-interest-free-accounts-qadri/",
  "date_published": "2020-03-11T00:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):Federal Minister for Religious affairs and interfaith harmony Pir Noor-ul-Haq Qadri Wednesday dispelled the view that the ministry earned interest on dues collected from pilgrims at the time of application submission.\nHe told the National Assembly that the Ministry deposit the dues collected from Hajj applicants at the time of submission of their application, in the interest free accounts and Islamic Banking.\nHe said full amount of Hajj dues was received from the applicants at the time of submission of Hajj forms through designated banks.\nThe balloting was held within week of the closing date of receipt of Hajj applications, the minister said.\nHe said process of hiring of accommodation, food, transport and allied services started immediately after conclusion of previous hajj operation and advance payments in that regard were made to the owners as contractual obligation.\nHe further informed the house that it was not possible to get payment from successful pilgrims after lucky draw as advance payment was required to be made to different contractors and Saudi departments therefore; Hajj dues from the successful applicants could not be received after ballot.\nHe said after the consultation with the Prime Minister, a policy to hire building for three years made but it was rejected by the committee adding the judgment of the Supreme Court stopped the government for making such policy.\nThe minister further informed the house that the government had filed a review petition in the Supreme Court against the said judgment and now pursuing the matter in the court.\nHe said soon after getting favorable decision, the government would make 3 to 5 years hajj policy and under the same policy building and transport in Saudi Arabia would be hired for 3 to 5 years.",
  "retrievedAt": "2025-08-11T18:56:24.778Z"
}
