{
  "title": "Educated, healthy, financially independent women to transform society: President",
  "link": "https://www.app.com.pk/national/educated-healthy-financially-independent-women-to-transform-society-president/",
  "date_published": "2020-03-11T02:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):President Dr Arif Alvi on Wednesday stressed the need for economic empowerment of women and said that educated, healthy and financially independent women would transform society.\nThe women in society are confronted with a host of problems including poverty, inequality that leads to negative consequences on their health, schooling, job prospects, the president said while speaking at a ceremony of International Women Day, organized by Women’s Parliamentary Caucus in collaboration with the United Nations Women Pakistan.\nThe president said no society could make progress until women disparity was not removed and they were not given equal opportunities in all fields. But added that for this the frame of mind in society would have to be changed to get the women’s rights.\nDilating upon education issue of girls, the president said it was a matter of great concern that dropout rate of girls in schools and colleges, particularly at university level was high than the boys.\nHe said progress of women in society without education was very difficult because if a mother was educated she could up-bring her children in a batter way.\nThe president said malnutrition and stunting were other big issues while frequent pregnancies also affect the women’s health, adding breast feeding was a must to avoid frequent pregnancies. He said 40 percent of children were suffering from stunting in Pakistan.\n“Our religion Islam has given inheritance rights to women 1400 year ago but unfortunately we are violating it, adding awareness in society about this issue will have to be created,” the president said.\nThere are multi-factorial issues including harassment and violence, the women are facing in society and for it the system will have to be changed, the president said and added that in this regard more responsibility lies on the society and women parliamentarian to expedite legislation in that regard.\nThe president said he was looking for such a Pakistan where a woman could go outside in the dark of night without any fear.\nSecretary Women Parliamentary Caucus Munaza Hassan in welcome address said on this day, women raise their voice against gender discrimination and the day reminded the women to commit to renew and review our pledge to work for the rights of women.\nShe said it was unfortunate that still major obstacles were being faced by the women at various fronts and fields.\nShe said women rights were universal and religion Islam and the constitution of Pakistan negated all indiscrimination against women.\nShe said progress in that regard could not be developed in vacuum and there must be struggle at every level to get women’s rights.\nShe said the women Members of Parliament were pro-actively participating in legislation work in the Parliament and the Women Parliamentary Caucus was working successfully for women empowerment.\nMunaza Hassan said the caucus was actively working for addressing various social gap for empowerment of women and for a just and inclusive Pakistan for a bright future.\nShe said this day would mark our resolve to further strengthen our efforts for empowerment of women.\nUnited Nations Resident Coordinator in Pakistan Julian said there was a dire need to change the system which prevented the women to move forward.\nHe said the women in Pakistan had all the qualities to move forward but they in their this journey and struggle needed support of their male partners.\nHe also lauded the legislative business done for empowerment of women in Pakistan. It was encouraging that 20 percent member of the Parliament were women, adding the United Nations would provide all kind of support to increase the representation of women in Parliament to 30 percent.\n“ We encourage you and we will be there to work with you for empowerment of women in Pakistan,” he added.\nEarlier, President Dr Arif Alvi and First Lady Begum Samina Alvi formally launched website of Women Parliamentary Caucus.\nIn concluding remarks, Minister for Inter-Parliamentary Coordination Dr Fehmida Mirza said the Women Parliamentary Caucus was performing its responsibilities since 2009 which showed commitment of the government for women empowerment.\nParliamentarians, diplomats and women from all walks of life attended the event.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:56:20.147Z"
}
