{
  "title": "Electronic Voting Machines – The future of voting in Pakistan",
  "link": "https://www.app.com.pk/articles/evm-another-landmark-endeavour-of-science-and-technology-sector-to-prevent-election-rigging/",
  "date_published": "2021-04-04T08:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 4 (APP): The million-dollar question of whether Pakistan opts for electronic voting, or continues with traditional methods, hangs in balance for the time being, while work on an Electronic Voting Machine (EVM) continues at a rapid pace.\nOver the years the governments in the past have been reluctant to go for transparent voting systems, owing to obvious reasons, however, the government of Pakistan Tehreek-e-Insaaf, proved to be different, as it champions a cause, which traditional political systems despise.\nPrime Minister Imran Khan in November last year announced his government’s intention to introduce electronic voting to ensure free and fair general elections. In his address to the nation, he said all parties including the PTI, Pakistan Muslim League – Nawaz (PML-N) and Pakistan Peoples Party (PPP) had levelled allegations of the 2013 elections being rigged and said the allegation was repeated again in 2018.\nHe vowed that his party would get approval from the parliament for electronic voting. He said the EVM, would not only enable millions of Pakistanis abroad to vote in elections but modern technology will make the election process transparent.\n“The EVM will counter the voter fraud claims made after losing the polls”, Imran Khan said.\nWork on the EVM was initiated over a decade ago in the country but the equipment could not be used due to the reluctance of previous regimes. The National Institute of Electronics (NIE) upgraded the old equipment to make it compatible with modern communication systems. The NIE moved swiftly as the Minister for Science and Technology, Chaudhry Fawad Hussain was keen to see it up and running.\nTrials for the equipment are being done under practical conditions to ensure no repeat of the failure of the Results Transmission System (RTS), which was part of the Election Results Management system for the 2018 general elections.\nThe indigenous technology has been developed by the experts of NIE as per international standards by ensuring accuracy, reliability and security.\nDirector-General NIE, Abdul Majeed Soomro, said the first version of EVM was developed in the year 2015 after the Election Commission of Pakistan (ECP) decided to use this technology for conducting elections and floated a tender for its production.\nThe NIE participated in the tender along with international companies but the decision could not be made at that time. Since then, NIE had been working on this technology on its own by incorporating the latest features in it as per modern requirements.\nThe Minister for Science and Technology, Chaudhry Fawad Hussain recently formed a committee to hold further consultations to improve this technology so as to use it for the next elections.\nThe EVM, which on a first glance looks like a very crude contraption, comprises of three main components (machines) including a Ballot box that can print the ballot paper and keep its record secretly, a Vote Casting Unit that has electronic symbols and a Control Unit which will be used by ECP to operate the equipment and get the results.\nSince the technology had been developed keeping in view the importance of data security and accuracy of election results, the results gathered through EVM can be double-checked and verified through ballot paper printed within the machine to eliminate chances of rigging.\nThe NIE plans to improve on the design, with the full backing of Chaudhry Fawad Hussain, who since becoming the Minister has been actively pursuing various products of the institute and helping out in commercialization, while maintaining coordination with other departments.\nFormer Secretary of ECP, Kanwar Muhammad Dilshad said the project of EVM was under-consideration in ECP for the last 15 years but could not be implemented due to the unwillingness of the previous governments.\nSince he was serving in the ECP, a lot of work on EVM was done but could not be carried forward due to the lack of seriousness of the then government.  “EVM is the best solution to curb the electoral fraud and irregularities,” he believes.\nHe said biometric logging of voters was very essential to verify their thumb impressions, and they can then move to the polling booth to cast vote by pressing a button on the electronic symbol,  which he said would eliminate the chance of rigging and tempering of ballot paper and Form-45.\nKanwar Dilshad was of the view that ECP will agree on using this machine only after the legislation and constitutional amendment which can be initiated by any political party.\nMeanwhile, Pakistan Tehreek-e-Insaf leader, Kanwal Shauzab said India is the largest country in terms of population as compared to Pakistan and if India can adopt EVM technology for elections why not Pakistan?\nThis technology is being used across the world including Europe and the United States where the elections are mostly undisputed. This is why their democracy has been flourishing.\nShe said Pakistan should adopt this technology to ensure the accuracy of election results through reduced human interference and to avoid any dispute.\nVoting machines have been used since 1910 in the United States of America, where mechanical lever-operated machines, were used to select the candidate of choice. However, these have given way to newer touch screen machines, used in some of the States in the 2020 US election.\nWhile the NIE is testing its machine, the Election Commission of Pakistan also experimented with another system for e-voting. Prime Minister Imran Khan was given a demonstration of an upgraded model of the electronic voting machine prepared by the Research and Development department of the Comsats University and the National Institute of Electronics on wednesday.\nPrime Minister Imran Khan said introduction of electronic voting machine was critical for ensuring a transparent, safe and impartial voting process in the country and was imperative for the national and democratic interests of the country.\nWhatever final shape these machines take in the days ahead, the future of electronic voting seems to be imminent and would ensure a free and fair election. The use of such machines in the future will go a long way in not only strengthening democracy but also put an end to the bickering, and allegations of rigging that not only mars the entire process but also undermines national development.\n-Report by Shumaila Noreen",
  "retrievedAt": "2025-08-11T20:35:13.548Z"
}
