{
  "title": "‘Negative criticism must be avoided against Petroleum Ministry’s senior officials’",
  "link": "https://www.app.com.pk/national/negative-criticism-must-be-avoided-against-petroleum-ministrys-senior-officials/",
  "date_published": "2021-04-04T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP):The Petroleum Division (PD) has rejected an article appearing in a section of the media that seemed targeting senior officials of the ministry based on some false assumptions, terming it ‘misleading & full of factual errors’.\n“It [article] shows a lack of understanding of the corporate governance environment in the country,” the PD said in a news release, asking the media to avoid negative criticism against its senior officials.\nThe Petroleum Division said it always encouraged constructive criticism to further improve its performance, but “it also expects that any criticism must be shun falsehood and should not be based on completely wrong and misleading information.”\nCommenting on the article, the PD said, “First, the article appreciates the decision of the government to conduct a forensic audit of the recent petrol shortage. But surprisingly without waiting for the outcome of the audit, the writer latches on to the persona of the Secretary Petroleum by falsely claiming that the losses sustained by the OGDCL (Oil and Gas Development Company Ltd) and the PPL (Pakistan Petroleum Limited) are due to the ‘incompetence’ of the Secretary.”\nIt said the writer should better be informed that both the companies had earned billions of rupees profit in the last financial year, in addition to contributing significantly through general sales tax, levies and CSR [Corporate Social Responsibility] activities.\nSecondly, the PD noted, the writer wrongfully ascribed the imaginary losses of the companies due to the appointment of their boards of directors.\nIt said he [the writer] fallaciously stated that the boards of the companies were “appointed based on favouritism and nepotism.\nThe facts are that the Petroleum Division is the first government body which reconstituted all BoDs well in time but also made sure best available professionals were picked up from the database of Pakistan Institute of Corporate Governance in line with SECP rules and regulations.”\nThe Division nominated women of substance as board members and currently three women of outstanding caliber were the chairpersons of Sui Southern Gas Company (SSGC), Sui Northern Gas Pipelines Limited (SNGPL) and Government Holdings (Private) Limited (GHPL).\nThirdly, the writer alleged the ministry officials for being over represented on the boards and taking huge benefits. “The fact is that the companies’ boards also include senior officers from the ministries of Finance, Power and Commerce & all these members are receiving board fees after attending each meeting. The amount of the fee mentioned in the article is highly exaggerated.”\nFourthly, the writer said that the secretary being Pak-Arab Refinery Company (PARCO) chairman was “fining himself” when oil marketing companies were being alleged for petrol shortage.\n“It must be known that as per corporate governance rules the board of directors or the chairman cannot be held responsible for any ostensible faulty decision of the management.\nAnyone with a rudimentary understanding of corporate governance rules will know the difference between the roles and responsibilities of the BoD and the MD (managing director) of a company,” the PD said.\nFifthly, the Petroleum Division said, the writer went on to falsely claim that the PD had not been able to appoint regular managing directors (MDs) in the past three years.\n“The fact is that except PPL all companies under the PD have full time regular MDs. In case of the PPL, the panel of candidates is under consideration at the PM Office for necessary clearance and the matter will be placed before the Federal Cabinet shortly.”\nLastly, the PD said, the learned writer had shown his complete lack of knowledge by claiming that UFG [Unaccounted for Gas] rate had gone up and no new bidding rounds had been initiated.\n“The fact is that in the last two years the UFG rate of the SNGPL has gone down to 8% from a whopping 13%. In case of the SSGC, the gas theft in Balochistan is a major factor for UFG yet the overall figure for the whole franchise area is showing some reduction.”\nSimilarly, the PD managed to initiate two bidding rounds in December 2018 and January 2021. It is further to be noted that not a single round was offered during the five years of the previous government.",
  "retrievedAt": "2025-08-11T20:35:16.858Z"
}
