{
  "title": "Kinnow export a significant source of revenue",
  "link": "https://www.app.com.pk/national/kinnow-export-a-significant-source-of-revenue/",
  "date_published": "2021-04-04T09:51:00.000Z",
  "source": "APP",
  "content": "By Muhammad Ali Asghar\nLAHORE, Apr 04 (APP): Blessed with diverse climatic zones, Pakistan produces high quality agricultural commodities and a variety of fruits in abundance. Citrus fruit, in terms of area, is the second in the world and Pakistan is among first 15 sour fruit producing countries.\nKinnow, a variety of citrus fruit, has a unique taste as well as nutritional and medicinal properties including vitamin C, sugar, iron, manganese, zinc and copper. Health experts say, kinnow juice produces clean blood; boosts immune system; strengthens stomach and liver; and is very useful in controlling heart diseases.\nAccording to a recent report on Kinnow yield, Brazil produces an average 16.713 million tons annually, the highest share (22.16 per cent) in Kinnow production worldwide.\nSimilarly, China produces 9.103 million tons thus forming 12.07 per cent of global yield, while Pakistan has 2.11 per cent share by producing 2.5 million tons.\nSargodha, a city in Punjab province of Pakistan, has distinction in production of Kinnow having great taste and delicacy.\nAccording to an estimate, Sargodha produces 96 per cent of the total production of Kinnow in the country and its orchards spanning over millions of acres of land. This fruit product not only caters to the nutritional and employment needs of thousands of people in the country but also helps earn foreign exchange through its exports.\nSargodha and Bhalwal areas’ economy heavily depend on Kinnow cultivation and there are around 250 Kinno processing centers in the region that employ over 250,000 people.\nSargodha, Faisalabad, Sahiwal and Layyah are also important districts in terms of Kinnow cultivation. Kinnow is also cultivated in Sukkur, Nawabshah and Khairpur districts of Sindh province; Peshawar, Mardan, Swat, Hazara, Nowshera and Swabi in Khyber Pakhtunkhwa and in Balochistan, it is cultivated in Sibi, Makran and Kech areas.\nAlthough it is an important crop, yet like many other crops, it is also vulnerable to climate change effects. According to agronomists, most of the Kinnow orchards have reached their natural age. The local growers do not have adequate knowledge of cultivating new varieties of Kinnow and this tendency is likely to squeeze Kinnow yield and exports\nin future.\nTherefore special attention needed for research and development to improve quality and production of Kinnow.\nReach out to international markets had been a challenge for Pakistani growers over the decades, but with the start of CPEC (China-Pakistan Economic Corridor) it is hoped that our fruits and vegetables would have an easy access to China and other world markets. Pakistani Kinnow growers are eagerly waiting to take full advantage of this opportunity\nto increase their exports.\nCitrus Research Institute’s Director Muhammad Nawaz Khan Mekan told APP that the Institute was guiding the farmer community across Punjab and making all out efforts to improve citrus yield. “The Citrus Research Institute is providing all necessary guidance to the growers including horticulture, soil preparation, prevention of diseases and better yields.”\nHe said, “since Kinno is a unique and standard fruit in terms of its taste as compared to other citrus varieties, it is being cultivated on more area. So far our agricultural scientists have developed about 10 different varieties of citrus and got them registered.”\nHe said Kinnow was also cultivated in Pothohar and Southern Punjab districts of Bhakkar, Layyah, DG Khan and Mankera etc. At present, its cultivation area is over 500,000 acres in Punjab, out of which 250,000 acre area alone belongs to Sargodha and adjacent areas.\nMekan said that Pakistan produced 2.5 million tons of Kinnow every year and export it to 50 countries including Russia, Ukraine, Indonesia, Sri Lanka, Philippines, Gulf States, United Arab Emirates, Iran, Saudi Arabia, Tajikistan and Uzbekistan. Among these countries Russia is the major buyer of Pakistani Kinnow. He said, Pakistan earned around\nUS $ 400 million by exporting 15 to 20 per cent of its total production of citrus fruit.\nA local grower, Muhammad Asif said that better variety of Kinnow and better soil fertility were inevitable to get a bumper crop. “Growers must have complete knowledge about the crop before going for planting Kinno orchards.”\nHe said the government is providing all possible guidance to Kinnow growers and ‘we are reaping better benefits by following its guidance. “If the government continues with subsidies and facilities for Kinnow farmers, they can earn more foreign exchange through increased Kinnow export.”\nConvener of Lahore Chamber of Commerce’s Standing Committee on Fruits and Vegetables, Ahmad Ramzan urged the government to remove bottlenecks in the export of Kinnow. He called for decreasing shipping charges and certification fee of The Department of Plant Protection, besides formulating an appropriate policy for cargo loading and unloading to minimize product damage.\nBeing and agriculture country Pakistan has vast potential to produce export quality fruits and vegetables that can help enhance exports, earn more foreign exchange and minimize the trade and current account deficits.\nPromotion of this sector would also help the local people in earning more and improving their living standard.",
  "retrievedAt": "2025-08-11T20:35:18.029Z"
}
