{
  "title": "Afghanistan, Bangladesh protest rallies condemn state-sponsored brutalities against Muslims in India",
  "link": "https://www.app.com.pk/national/afghanistan-bangladesh-protest-rallies-condemn-state-sponsored-brutalities-against-muslims-in-india/",
  "date_published": "2020-03-06T03:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 6 (APP):Thousands of people rallied on Friday in Afghanistan and Bangladesh to decry state-sponsored brutalities being committed against Muslims in India and the occupied valley of Kashmir.\nIn Kabul, the civil society organized a protest rally to protest Indian atrocities against Muslims.\nAccording to the information reaching here, hundreds of people participated in the rally which started from Shahr-e Naw Park and was headed towards Indian embassy. However, the participants were not allowed to go towards the embassy.\nThe participants of the rally were carrying banners in support of the oppressed Muslims of India. They condemned the ongoing brutalities against the Indian Muslims by the Modi-led regime.\nThe speakers also demanded that the Afghanistan government to sever diplomatic ties with India over brutalities against Muslims.\nAnother protest rally was held in front of Jamia Masjid Guzargah Sharif in Herat city after the Friday prayer. Around 2,000 people participated in the demonstration held under the leadership of Qari Mujib ur Rehman Ansari, which protested against Indian brutalities on Muslims.\nThe mosque is of huge importance in Herat as it houses the grave of famous Sufi saint Khwaja Abdullah Ansari, also known as Pir-e-Herat.\nThe protestors chanted slogans against India and the speakers condemned Indian brutalities on Muslims in India. Indian flag was also burnt by the protesters at the rally.\nIn Bangladesh, different religious groups, including Hifazat-e-Islam, Islami Andolan, Khilafat Majlis, staged a protest demonstration in front of Bait ul Mukaram against unprovoked attacks and killing of Muslims in India.\nThe rally comprising around 3,500 protestors chanted slogans against Indian government and expressed solidarity with their Muslim brethren who are under constant wrath of communal riots in India.\nEarlier, after culmination of Friday prayers, special dua was offered for the victims of New Delhi attacks in particular and persecuted Muslims of India in general.\nA large number of people including leaders of different religious groups came to join the gathering from surrounding areas of Dhaka.\nThe protestors condemned attacks on mosques, religious seminaries and oppression against Muslims in India.\nThey reiterated their earlier demand of withdrawal of invitation to Indian Prime Minister Narendra Modi for taking part in Sheikh Mujibur Rahman’s birth centenary celebrations.",
  "retrievedAt": "2025-08-11T18:54:26.478Z"
}
