{
  "title": "Chairman Senate praises Irans’s efforts to overcome Coronavirus",
  "link": "https://www.app.com.pk/national/chairman-senate-praises-iranss-efforts-to-overcome-coronavirus/",
  "date_published": "2020-03-05T23:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 6 (APP):Chairman Senate Muhammad Sadiq Sanjrani, during a meeting with Iranian Ambassador Seyed Mohammad Ali Hosseini on Friday expressed solidarity, on his behalf and on behalf of the parliament, people and government of Pakistan, on loss of human lives in Iran due new corona virus.\nHe said that Pakistani nation shared the grief and sorrow of the people of Iran, said a press release issued here.\nHe, however, lauded the efforts of Iranian government for combating the virus with professional zeal.\nThe chairman also wrote separate letters to the president of Iran and speaker of Iran’s parliament expressing his solidarity.\n“ On behalf of Parliament and people of Pakistan, I convey my heartfelt condolences to the families of victims of this epidemic and pray that those suffering from this disease be recovered soon”, Chairman Senate writes to the Iranian President Dr. Hassan Rouhani and Speaker Ali Ardeshir Larijani.\nHe said that the new coronavirus had become a global challenge and was not limited to one geographical area and therefore a collective approach was required to overcome the epidemic.\nHe said that inter-governmental collaboration and fast track coordination on exchange of information, data and technical assistance could help nations to counter the issue.\nHe also praised Iran’s Supreme Leaders Ayatollah Khamenei statement criticising India for violence against Muslims in Delhi and said that the statement came at an important juncture.\nHe appreciated the excellent arrangements made for screening and medical care at Pakistan- Iran borders. He said that the both sides were making all out efforts to provide relief to the people stranded at borders.\nThe chairman also expressed his well wishes to the Deputy Health Minister of Iran for his early recovery and said that people of Pakistan stood by the side of their brothers and sisters of Iran.\nThe Iranian ambassador briefed the chairman senate about the steps taken by Iranian government to overcome coronavirus.\nHe said that excellent cooperation had been seen between Pakistani authorities and their Iranian counterparts at boarders and situation in under control.\nThe ambassador stressed for further boosting cooperation in different sectors through enhanced interaction.",
  "retrievedAt": "2025-08-11T18:54:32.824Z"
}
