{
  "title": "Govt committed to empower women, in line with tenets of Islam: Firdous",
  "link": "https://www.app.com.pk/national/govt-committed-to-empower-women-in-line-with-tenets-of-islam-firdous/",
  "date_published": "2020-03-06T04:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 6 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan on Friday said that the present government under the leadership of Prime Minister Imran was fully committed to empower women following the teachings of Islam which ensured full protection to their rights.\nAddressing a function in connection with International Women Day, she said that no state can progress unless women who constitute half of its population, take part in the nation-building process.\nShe said that Islam fully protected rights of women and the Holy Quran granted the charter of human rights including women’s rights and the concept of Riyasat-e-Madinah could not materialize without empowering half of its population.\nShe said that Pakistan was established in the name of Islam and the government was acting to make women partners on economic front.\nShe said Mohtarma Fatima Jinnah stood by the Qauid-e-Azam in the struggle for creation of Pakistan and now it was responsibility of the women of today to take pro-active role in development of the country.\nAbout Aurat March, she said that peaceful protest was right of every citizen and the government supported that every citizen should be allowed to exercise this right. However she said that some slogans attached with this march were against the teachings of Islam and socio-cultural values of the society.\nShe said that a handful elements were trying to mislead the entire nation through these slogans, repugnant to the religious beliefs.\nShe said that in Islamic society men as fathers, brothers, husbands and sons respect and protect honour and dignity of women. She opined that these slogans were creating hurdle in emancipation an empowerment of women, instead of promoting their cause.\nShe said that there were no two opinions about need of gender balancing in the society, end of discrimination against women and male dominance and there should be change in social attitude towards working women.\nShe said that Islam protects women rights in law of inheritance and legislation has been enacted for this purpose and the government was striving to implement the law at grassroots level.\nShe said that for the PTI government, every day was women day and it was striving to empower them in every field of life.\nReplying to media persons’ questions, Dr Firdous Ashiq Awan said that it was ironic that those facing cases in accountability courts for plundering national resources, were giving lectures for betterment of the society. She said that former Prime Minister Shahid Khaqan Abbasi has confessed that past models of development had failed.\nTo a question, she said that Mutahidda Qaumi Movement (MQM) has already distanced from the statement of Pakistan Muslim League-Nawaz leaders, that was given in Karachi.\nThe SAPM said that during the past over three months Sharif family was in London but it could not choose the hospital for Nawaz Sharif’s surgery.",
  "retrievedAt": "2025-08-11T18:54:26.506Z"
}
