{
  "title": "NCOC seeks presentation on stocks available at Utility Stores",
  "link": "https://www.app.com.pk/national/ncoc-seeks-presentation-on-stocks-available-at-utility-stores/",
  "date_published": "2020-04-28T00:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP):The National Command and Operation Centre (NCOC) Tuesday sought presentation from Managing Director Utility Stores Corporation, MD National Information Technology Board (NITB) and Minister for Industries and Production Hammad Azhar about the food stocks available at Utility stores.\nThe NCOC, which met with Minister for Planning Development Development Reforms and Special Initiatives Asad Umar mulled over the issues, pertaining to Ehsaas programme, stocks available at Utility stores, it’s\noutreach to far-flung areas, status of mobile stores and epidemic-curve projections.\nSpecial Assistant to the Prime Minister on Poverty Alleviation and Social Safety Dr Sania Nishtar apprised\nthe forum that the programme had served around 5.9 million families across the country. However, there were issues being faced in the provision of relief due to poor biometric verification of the registered people under the programme.\nShe said the issue could be resolved if the National Database and Registration Authority (NADRA) offices were opened for only verifying Ehsaas programme registered recipients of financial relief.\nShe also highlighted that the tax waie-off was being provided to Ehsaas PoS retailers at federal level\nand provincial governments’ compliance was awaited.\nProvincial Chief Secretaries informed the forum that the tax waive-off was approved by their cabinets and would be implemented consequently.\nMinister for Interior Brig (R) Ejaz Ahmed Shah after detailed discussion agreed to open around 600 NADRA offices and 200 mobile vans only for Ehsaas programme verification.\nMD Utility Stores Corporation informed that due to reduced operating hours there was increase in crowding\nof masses at the stores. He said the stores were facing increase in the per day demand of flour, sugar, rice and other foods. However, the Corporation was in procurement mode and would procure Rs14 billion worth commodities, he added.\nThe Chief Secretary Sindh highlighted the shortage of rice and pulses at 56 utility stores in various districts of the province.\nChief Secretary Khyber Pakhtunkhwa mentioned that the newly merged districts of the province had very few utility stores.\nMinister for National Food and Security Fakhar Imam highlighted that Sindh has procured around 5,03,000 tonnes of wheat which was 36 percent of the set target and 46 percent of its harvest. He asked the provincial authorities to keep the ministry updated on the matter.\nMinister for Economic Affairs Khusroo Bakhtiar, Minister for Industries and Production Hammad Azhar, SAPM on Health Dr Zafar Mirza, SAPM on National Security Dr Moeed Yusuf, Minister for Interior Brig (R) Ejaz Ahmed Shah, SAPM on Poverty Alleviation and Social Safety Dr Sania Nishtar, the Prime Minister’s Focal person on Anti-Covid-19 Dr Faisal Sultan, National Coordinator NCOC Lieutenant General Hamood Uz Zaman, Chairman NDMA Lieutenant General Muhammad Afzal and others attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:22.345Z"
}
