{
  "title": "Shireen Mazari chairs MoHR’s intra-ministerial meeting",
  "link": "https://www.app.com.pk/national/shireen-mazari-chairs-mohrs-intra-ministerial-meeting/",
  "date_published": "2022-03-09T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 09 (APP):Federal Minister for Human Rights Dr. Shireen Mazari chaired the second meeting of the Inter-ministerial and Inter-Provincial Steering Committee for National Action Plan on Business and Human Rights at the Ministry here Wednesday to discuss and finalize the annual work plan on implementation of National Action Plan on Business and Human Rights that comprises 69 actions, prepared by NAPBHR secretariat. Secretary Ministry of Human Rights, members and representatives from various federal and provincial departments attended the meeting.\nIn her opening remarks, the Minister said that in this National Action Plan, there were eight thematic areas in which 5-Year action plans had been laid out after consultation with all stakeholders.\nWith an efficacious gap analysis, we have to bring about necessary amendments both in legislative and administrative mechanism to make the business and industrial work environment more conducive and compliant towards human rights demands.\nShe urged the federal and provincial members to go through the necessary actions, which are required under this plan, in an expeditious manner with pre-described timelines.\nShe further said that some immediate actions were required by labor departments at all levels to meet the obligations under GSP+ status. She mentioned that the Pakistan Citizenship Act, 1951 had some clear discriminatory clauses that should be urgently amended and later it was decided that ministry would soon table a bill in the parliament on it.\nThe Minister viewed that Labor Department of Baluchistan must review and amend its outdated mining laws. She stressed that these laws should provide guarantee to life and health insurance of miners; provision of safety equipment and adaptation of modern tools and techniques for mining.\nIt was discussed in the meeting that Pakistan is signatory of ILO Convention 177 and 189 on Home Workers and Domestic Workers respectively. The actions taken so far towards ratifying them, both at federal and provincial level, will be reported to Ministry of Human Rights within two months to fulfill the commitments under GSP+ status.\nIn her concluding remarks, the Minister said that many actions enlisted in this action plan have already been taken and we have come a long way. With the formation of sub committees, coordination among members that are working on same subjects, will significantly improve.\nThis approach would give a holistic picture of all work done as well as about the prevailing deficiencies in current laws that need to be addressed on immediate basis.",
  "retrievedAt": "2025-08-11T14:30:09.649Z"
}
