{
  "title": "Australia’s tour to Pakistan an exciting time for cricket fans in both countries: Australian Charge d’ Affairs",
  "link": "https://www.app.com.pk/national/pakistan-australia-share-passion-of-cricket-ahc/",
  "date_published": "2022-03-09T11:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 9 (APP):Chargé d’Affaires of the Australian High Commission in Islamabad, Bryce Hutchesson on Wednesday said the Australian cricket team’s historic tour to Pakistan was an exciting time for cricket fans in both Australia and Pakistan as cricket was one of the many bonds that bring the two countries together.\nHe stated this while speaking at the 6th AHC-PCB Girls’ Cricket Cup at F-9 Cricket Ground here. The Australian High Commission (AHC) and the Pakistan Cricket Board (PCB) with the support of Serena Hotels hosted the event.\nAustralia’s Chargé d’Affaires congratulated the girls and the schools on their participation and welcomed the continued support of the PCB and Serena Hotels for the annual AHC-PCB Girls’ Cricket Cup.\nHe said that the Australian High Commission has been sponsoring girls’ cricket in Pakistan since 2016 to promote gender equality through sport. “We began with a single annual tournament in Islamabad which have since expanded to Lahore and Karachi,” he added.\n“Our countries share a passion for cricket, so we’re very pleased to support this event. Cricket and other sports can help tear down barriers and stereotypes. Every time these girls make some runs, take a wicket or hold a catch, they are taking a step towards greater equality,” he said.\nThe girls attended a five-day coaching clinic in the lead-up to the competition conducted by PCB first class cricket coaches.\nHutchesson said the High Commission was particularly happy to support the initiative during the Australian Cricket Team’s historic tour to Pakistan.\nHe said that it was great time for cricket in Pakistan, obviously after concluding of the first cricket test match in Rawalpindi and the next test will be played in Karachi.\nHe said it was a great moment to give these girls the opportunity to play with their colleagues and peers and to conduct themselves equally in sports and whatever field, learning team work and making friendship.\nThe Head of Women Cricket at Pakistan Cricket Board, Tania Mallick said, “On the auspicious occasion of the International Women’s Day yesterday, with the Australian Cricket men’s team playing in Pakistan after decades – it is a privilege to collaborate with the Australian High Commission to organize this cricket event for underprivileged girls.”\n“The Australian High Commission with the support of PCB have always played a vital role in promoting women cricket and investing in the empowerment of women in Pakistan. Such events can play an important role in the development and promotion of women cricket. We look forward to further strengthening our relationship,” she added.\nAziz Boolani, CEO Serena Hotels, said, “Cricket is a passion in Pakistan. Under Serena Hotels Sports Diplomacy initiatives, we support, facilitate, and sponsor numerous sporting events and our commitments to sports diplomacy and women’s empowerment have found expression in the AHC-PCB Girls’ Cricket Cup.\nThis tournament provides a wonderful vehicle for promoting and highlighting the importance of gender equality in sport.”\nThe AHC-PCB Girls’ Cup Islamabad involved teams from four schools: Mashal Model School Bari Imam, SOS Children’s Village H-11, Islamabad Model School for Girls – F-6/1 and Islamabad Model School for Girls I-9/1 Islamabad.",
  "retrievedAt": "2025-08-11T14:30:13.962Z"
}
