{
  "title": "Private sector role vital to achieve UHC target: Faisal",
  "link": "https://www.app.com.pk/national/private-sector-role-vital-to-achieve-uhc-target-faisal/",
  "date_published": "2022-03-09T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 09 (APP):Special Assistant to Prime Minister on National Health Services, Regulations and Coordination, Dr. Faisal Sultan on Wednesday said that the private sector’s  role is important to achieve the target of Universal Health Coverage (UHC).\n“To achieve the objective of timely and meaningful progress towards Universal Health Coverage (UHC), the role of private sector as a critical partner with the public sector is inevitable and cannot be overemphasized, ” Dr Faisal said this while addressing the MoU signing ceremony.\nThe MoU was signed between the Ministry of National Health Services and Shifa Tameer-e-Millat University (STMU).\nThe MoU stipulates for joint efforts by the signatories to further the agenda of UHC in the country.Pakistan as a UN member state has agreed to achieve the UHC for its population by 2030 as provided for in the Sustainable Development Goals (SDGs).\nThe UHC concept requires peoples’ access to the health services, when and where needed and without facing any financial hardships.\nThe government is making significant advances in the area by allocating and increasing funds year after year and introducing a historical health card for public, Dr Faisal added.\nHe said that the core objective of the three-year and further extendable MoU provides for aligning medical and public health education, training, service and research with UHC.\nSTMU, a federally charted university involved in research and teaching activities in health and allied sciences, is composed of various colleges, constituent institutes and a teaching hospital.\nGlobal Institute of Human Development (GIHD) is a constituent unit of STMU involved in top academic research that has also founded the nation’s very first School of Universal Health Coverage (SUHC).\nFormer Special Assistant to Prime Minister on National Health Services, Regulations and Coordination and Professor of Health Systems and Population Health at GIHD-STMU, Dr. Zafar Mirza apprised the audience about the vision, mission and strategy of the SUHC.\nHe elaborated the proposed role of SUHC in capacity building of the health managers, academia, development practitioners and media through a series of certificate, diploma and graduate creditable courses to a Masters in Public Health and UCH program that is to be offered in SUHC-GIHD soon.\nEarlier, Founding Director of GIHD, Dr. Syed Usman Hamdani shared his thoughts about the the concept of the Institute, its vision, mission, research undertakings and their practical policy impact .\nBesides, WHO’s focal person on mental health for the region, Dr. Khalid Saeed explained the efforts and plans being undertaken by the UN body for promoting mental health in UHC context in Pakistan.\nRichard Hawks, CEO, British Asian Trust said BAT was delighted to know GIHD, Health Ministry and WHO have decided to integrate mental health into primary healthcare.\n“I am looking forward to see this partnership making progress”, he added.BAT is working on mental health in Pakistan since 2012. BAT is supporting GIHD-SUHC in training PHC staff in delivery of mental health services.\nDr Muhammad Aamir, Dean Faculty of Health Sciences endorsed that UHC can not be realized without an active partnership between public and private sectors.\nHe explained how STMU is going to play its part by integrating the UHC concept in curricula and training modules to prepare young physicians capable of imparting UHC to the communities they opt to serve.WHO’s Country Director for Pakistan, Dr Palitha Gunarathna Mahipala, Chancellor STMU, Dr. Manzoor H. Qazi and Vice Chancellor STMU, Prof Dr Muhammad Iqbal Khan also expressed their commitment with the agenda of UHC in Pakistan and shared their excitement about being a part of this game-changing endeavor.\nDr Manzoor H Qazi appreciated the GIHD and SUHC teams for shouldering this important national health agenda and ensured complete support of the STMU and Shifa family to make it a success and an example for other provinces to follow and benefit from.\nThe hybrid MOU signing ceremony and seminar, titled “Reimagining Public Health Practice and Research for Universal Health Coverage (UHC) in Pakistan” was attended by top healthcare leaders across the country in person and online.",
  "retrievedAt": "2025-08-11T14:30:11.997Z"
}
