{
  "title": "Climate change detrimental for country, future generations sans mitigation: Sherry",
  "link": "https://www.app.com.pk/national/climate-change-detrimental-for-country-future-generations-sans-mitigation-sherry/",
  "date_published": "2022-06-05T07:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP): Federal Minister for Climate Change Senator Sherry Rehman in her message on ‘World Environment Day’ (today) on Sunday said the effects of climate change will be detrimental to the future of the country and coming generations without taking necessary mitigation measures.The Federal Minister in her message said the purpose of celebrating the ‘Environment Day’ was to spread awareness among the people regarding climate change.Senator Sherry said not only Pakistan and South Asia but the whole world was being affected by the extraordinary effects of climate change.“Climate change is the biggest challenge of the 21st century. We stand at the forefront of the global meteorological emergency as a Pakistani,” Sherry Rehman said.Pakistan, she said was one of the few countries in the world to face the severe effects and threats of climate change.“We are facing extreme temperatures and severe drought. Our forests are burning, glaciers are melting and rivers are drying up. We have to be careful in using water,” Senator Sherry Rehman said.She said that the humans were doing a lot of injustice to the land and natural environment, adding, “We should not pollute the sea, air and our land”.The Minister suggested that there was need to adopt climate culture to deal with climate crisis.“Every Pakistani citizen has to play his role for the protection of environment and protection of his mother earth. A clean and healthy environment is possible only when every citizen fulfills his national and moral responsibility,” Sherry Rehman said.She urged the masses that there was only one Pakistan on this planet, and only by protecting the country’s environment can we save it.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:02:10.570Z"
}
