{
  "title": "Healthcare establishments in ICT directed to ensure registration by June 30",
  "link": "https://www.app.com.pk/national/healthcare-establishments-in-ict-directed-to-ensure-registration-by-june-30/",
  "date_published": "2022-06-05T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP): Islamabad Healthcare Regulatory Authority (IHRA) has directed all healthcare establishments, functioning in the Islamabad Capital Territory (ICT) to get registered with the authority by June 30, 2022.\n“They all are required to get registered with IHRA within due date as strict action will be initiated as per Islamabad Healthcare Regulations Act, 2018 against all healthcare establishments not registered with IHRA after the deadline,” the spokesperson of the IHRA said on Sunday.\nHe said that this registration is compulsory for general practitioners, specialists, dental clinics, homeopaths, hakeems, hospitals, maternity homes, specialized laboratories and collection points, rehabilitation centers, physiotherapists, nutritionists, and any other healthcare services providers in ICT.\nUnqualified healthcare practitioners have been directed and warned to stop their medical practice immediately, he added.\nHe said that the IHRA is an autonomous health regulatory body enacted under the Islamabad Health Regulation Act, 2018.\nHe added that IHRA aimed at improving the quality, efficiency, and safety of healthcare services delivery by adopting evidence-based regulatory standards for registration and licensing of healthcare establishments, health professionals, and equipment, and developing and enforcing minimum standards of safety for patients, healthcare professionals and other staff in healthcare establishments in the ICT.\nThe spokesperson said that IHRA is responsible for maintaining a register of all healthcare establishments, setting standards for registration and licensing of healthcare establishments, registering all healthcare establishments, health professionals, and equipment, and issuing licenses for defining the scope and extent of healthcare services to be provided by healthcare establishments.\nHe said that the IHRA is also responsible for regulating healthcare establishments in accordance with minimum service delivery standards and notified practices, preparing and issuing notified practices as a guiding document for service provision in healthcare establishments, and inquiring and investigating violations of any of the provisions of the law by any healthcare facility.\nHe said that healthcare establishments under IHR Act 2018 are required to get registered with IHRA and implement minimum services delivery standards to acquire license to render health services in the Islamabad Capital Territory.\n“The IHRA was working with the vision of safe and high-quality healthcare services for everyone in the ICT. Our mission is to regulate the provision of healthcare in ICT to ensure high efficiency, safety, and effectiveness in delivering health services both in the public and private sector.”\nHe said that the guiding principles of the IHRA include equitable access to appropriate and effective health services, good governance, value for money, geographical convergence, and evidence-based interventions.\nHe said that the authority is also responsible for the development of a code of conduct for professionals to meet quality assurance besides grant, renewal, suspension, cancellation, or revocation of registrations of healthcare establishments, its healthcare professional, and equipment.\nHe said that the authority is also responsible to monitor and regulate healthcare services quality levels and standards and constituting committees like inspection committee, complaints committee or review committee, etc.\nThe spokesperson said that investigating complaints relating to healthcare establishments, healthcare professionals, healthcare services or medical negligence is also the prime responsibility of the authority.\nHe said that the IHRA organizes and arranges various educative programs, seminars, conferences, and meetings and takes steps to coordinate with healthcare establishments, for the implementation of various health improvements, disease prevention, curative, rehabilitative, and palliative programs.\nHe said that the authority collaborates with international and national institutions, organizations, and companies to secure their assistance, cooperation, and support for the improvement of healthcare establishments for the provision of quality healthcare services.",
  "retrievedAt": "2025-08-11T15:02:07.026Z"
}
