{
  "title": "Pakistan condemns in strongest possible terms derogatory remarks by BJP Spokespersons: FO",
  "link": "https://www.app.com.pk/national/pakistan-condemns-in-strongest-possible-terms-derogatory-remarks-by-bjp-spokespersons-fo/",
  "date_published": "2022-06-05T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP): Pakistan on Sunday condemned in the strongest possible terms, the highly derogatory remarks recently made by two senior officials of India’s ruling party BJP, that disrespected the Holy Prophet Muhammad (Peace Be Upon Him).\nThe Foreign Office Spokesperson in a statement here said, these totally unacceptable remarks had not only deeply hurt the sentiments of the people of Pakistan but of billions of Muslims around the world.\n“BJP’s attempted clarification and belated and perfunctory disciplinary action against these individuals cannot assuage the pain and anguish they have caused to the Muslim world. Muslims residing in India are equally outraged by the completely repugnant comments by the two BJP officials. The ensuing communal violence in Kanpur and in other parts of India bears testimony to this fact,” he noted.\nHe said Pakistan was also deeply concerned at the alarming rise in communal violence and hatred directed against the Muslims in India. Muslims in India were being systematically stigmatized, marginalized and subjected to a well-orchestrated onslaught from radical Hindu mobs with full connivance and support of the security apparatus across various states in India, he added.\n“Regrettably, the Indian state machinery has remained aloof to the desperate calls for assistance by the local Muslim communities across the country.\nThe continued grave violations of the rights of minorities in several BJP-ruled states; anti-Muslim legislations by the Union government of India and continued incidents of violence against Muslims on flimsy pretexts by various ‘Hindutva’ groups with complete impunity, and often under state patronage, highlights the worsening trend of Islamophobia and extremism in India. The silence of the top leadership of the BJP is yet another proof that these Hindu zealots have tacit support of the state machinery in carrying out their nefarious designs of marginalization and dehumanizing of the minorities, especially Muslims.”\nHe said reprehensibly, it had become a norm in India to deprive the Muslims of their right to live and freely practice their religion.\n“It is deplorable that the BJP-RSS cohort, under extremist ‘Hindutva’ agenda, has maliciously denigrated and perpetrated senseless violence against Indian Muslims and their places of worship.”\nHe said Pakistan urged India to ensure that decisive and demonstrable action will be taken against those responsible for making derogatory remarks and attacking the dignity of the Holy Prophet Muhammad (PBUH). India must also take immediate steps to protect its minorities from human rights violations, ensure their safety, security and well-being and allow them to profess and practice their faiths in peace.\n“Pakistan once again calls on the international community to take immediate cognizance of the grievously aggravating situation of Islamophobia in India. India must be held accountable for stifling the rights of the minorities especially Muslims to practice their faith and religious beliefs. The international community must dissuade India from its reprehensible campaign of “saffronization” and ensure that Muslims are not victimized for having different religious beliefs than the majority population. The world must intervene to protect the Muslims in India from an impending genocide at the hands of Hindutva-inspired Hindu zealots, emboldened by the BJP-RSS dispensation at the helm,” the statement concluded.",
  "retrievedAt": "2025-08-11T15:02:03.293Z"
}
