{
  "title": "PM strongly condemns hurtful comments of BJP leader about Prophet (PBUH)",
  "link": "https://www.app.com.pk/national/pm-strongly-condemns-hurtful-comments-of-bjp-leader-about-prophet-pbuh/",
  "date_published": "2022-06-05T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP):Prime Minister Shehbaz Sharif Sunday condemned hurtful comments of India’s BJP leader about Prophet Muhammad (PBUH).\nIn tweets on social media platform Twitter, he said, “I condemn in strongest possible words hurtful comments of India’s BJP leader about our beloved Prophet (PBUH).  Have said it repeatedly India under Modi is trampling religious freedoms & persecuting Muslims. World should take note & severely reprimand India. Our love for the Holy Prophet (PBUH) is supreme. All Muslims can sacrifice their life for the Love & Respect of their Holy Prophet (PBUH).”\nThe Indian envoy to Doha Qatar has been summoned after a BJP official made offensive comments about the Prophet Mohammad (PBUH).\nThe Indian embassy in Qatar in response to media query said, its ambassador had a meeting in the Qatar’s Foreign Office in which concerns were raised about the offensive statements by Indian persons against Prophet Muhammad (PBUH).\nOn Sunday, the Ministry of Foreign Affairs of Kuwait summoned the Ambassador of India to the State of Kuwait, where he met with the Assistant Minister of Foreign Affairs for Asian Affairs, who handed him an official protest note expressing the State of Kuwait’s categorical rejection and condemnation of the insulting statements against the Holy Prophet (PBUH), Islam and Muslims issued by one of the officials in the ruling party.\nThe ministry explained that while the State of Kuwait welcomes the statement issued by the ruling party in India, during which it announced the suspension of the aforementioned official from carrying out his duties and activities in the party because of these offensive statements, it demands a public apology for those hostile statements, the continuation of which without deterrence or punishment will lead to increasing aspects of extremism and hatred and undermining elements of moderation, noting that issuing such statements reflected a clear ignorance of the message of peace and tolerance of our Islamic religion, and the great role Islam had played in building civilizations in all countries of the world, including India.\nSuperstores in Saudi Arabia, Kuwait, Bahrain removed Indian products after insulting remarks against Prophet Muhammad (PBUH) by Indian Prime Minister Modi’s close aide.\nFurious citizens in Kuwait attached pictures of Indian Prime Minister Narendra Modi on the garbage tankers.\nThe hashtag on Twitter to protest against the blasphemy was trending at the top and people were calling for a boycott of Indian products.",
  "retrievedAt": "2025-08-11T15:02:05.685Z"
}
