{
  "title": "Farrukh vows to fetch Pakistan out of ‘debt quagmire’ under PM leadership",
  "link": "https://www.app.com.pk/national/farrukh-vows-to-fetch-pakistan-out-of-debt-quagmire-under-pm-leadership/",
  "date_published": "2021-06-23T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Minister of State for Information and Broadcasting Farrukh Habib Wednesday vowed that the government, under the wise leadership of the Prime Minister Imran Khan, would fetch the country out of the ‘debt quagmire’ and make it strong by all means.\nParticipating in the budget debate in the National Assembly, the minister said the past governments had adopted credit card growth-model while the Pakistan Tehreek-i-Insaf (PTI) believed in export-based and long-term sustainable national growth.\nHe said the PM had promised with the nation that he (Imran Khan) would steer the country out of all crisis and put it on road to progress and prosperity.\nHe said the International Monetary Fund (IMF) had predicted 1.2 per cent Gross Domestic Product (GDP) growth rate and $12 billion current account deficit for fiscal year 2020-21of Pakistan, but the government not only achieved almost 4 % GDP growth rate and turned current account deficit into surplus, besides enhancing foreign exchange reserves up to $25 billion.\nHe said both the Pakistan Peoples Party (PPP) and Pakistan Muslim League (PML-N) had approached the IMF for several times and took loans at high rates during their tenures.\nPPP and PML-N knocked the IMF doors eight and three times respectively during their tenure, he added.\nHe said the then rulers plundered the national wealth and purchased properties abroad including Avenfield apartments and Surrey Palace.\nThe government inherited huge current account deficit and foreign debt. However, the revenue collection stood at Rs over 4700 billion against the set target of Rs 4670 billion for the year 2020-21. It was all possible owing to the untiring efforts of the PM, he said.\nThe minister said like the GDP growth rate, PTI would also give a surprise on June 30 regarding tax collections.\nHe said Imran Khan has set an example of austerity by significantly reducing the expenditures of the PM House and Office, saving Rs one billion out of total allocation of Rs 2.75 billion during the last three years.\nSharing details of expenditures, he said Nawaz Sharif and Zardari’s visits to Afghanistan cost $ 58,000 and $ 46,000 respectively while the cost of Imran’s visit remained only $ 9600.\nSimilarly, the total cost of Zardari and Nawaz Sharif visits to US was $ 7.5 million and $ 33.5 million respectively while total expense of Imran’s visit to US was $ 66,700.\nRealizing the hardships of the poor segments of the society, he said the PM set up over 100 Panagahs (shelter homes) and Langur Khana (free-food centers) in various cities to facilitate laborers and poor.\nFarrukh Habib said the government enhanced the budget for Ehsaas program from Rs121 billion to Rs260 billion to provide relief to the poor.\nHe said some 850,000 ghost beneficiaries were getting financial support from Benazir Income Support Prorgamme, whom the incumbent government removed from the list.\nRegarding agriculture sector, the minister said the agriculture growth was mere 0.069 per cent during the PML-N tenure while record increase had been witnessed in production of wheat, rice, sugarcane, maize and pulses during the current fiscal year.\nThe minister said sugarcane production witnessed 31per cent increase, rice 27 per cent, wheat 7.5 per cent, pulse 60 per cent.\nHe said a sum of Rs 3500 billion would be transferred to the provinces this year.\nFarrukh Habib said Punjab and Sindh provinces would get additional funds amounting to Rs 329 billion and Rs 128 billion respectively during this year.\nHe went on to say that Punjab government collected Rs 358 billion revenue against set target of Rs 313 billion for the current fiscal year while the Sindh government failed to achieve its revenue collection target. The Sindh government could only collect Rs 243 billion against set target of Rs 313 billion, he added.\nRegarding setting up power generation plants, the minister said the past governments set up expensive power projects mainly based on imported fuel.\nThe incumbent government started physical works on the long delayed projects like Mohmand, Diamer Bhasha and Daus dams which would not only generate inexpensive hydel electricity but also ensure water security in the country.\nHe said the government saved Rs 770 billion of the nation by renegotiating agreements with Independent Power Producers (IPPs).\nHe said the whole world acknowledged the green diplomacy of Prime Minister Imran Khan to minimize the effects of climate change.\nThe minister said Overseas Pakistanis had sent record remittances of over $ 27 billion owing to their confidence in the leadership of Imran Khan.\nHe said the textile sector of the country was also booming which was ruined by the past governments. Textile exports also recorded a sharp increase due to the incentives given by the government, he added.\nHe said Allama Iqbal Special Zone was being set up in Faisalabad where industrial plot would be available for investors at very affordable rate.\nThe minister said in COVID-19 pandemic, economies of India and UK went down and stood at -7 and -9 per cent respectively, while contrary to it, Pakistan’s economy witnessed almost 4 per cent growth.\nThe per capita income had also surged to Rs 246,000 from Rs 186,000.\nFarrukh Habib said the opposition was misleading the masses through false propaganda and reminded that it was the PML-N government whose finance minister Ishaq Dar mortgaged motorway M2 and Jinnah International Airport in 2014 and issued Sukuk Bonds.\nWhereas, he said, the PTI government was going for ‘Riba-free’ investment in the country.",
  "retrievedAt": "2025-08-11T20:52:40.218Z"
}
