{
  "title": "Energy efficient appliances can save valuable energy resources: Shibli Faraz",
  "link": "https://www.app.com.pk/national/energy-efficient-appliances-can-save-valuable-energy-resources-shibli-faraz/",
  "date_published": "2021-06-23T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Federal Minister for Science and Technology, Shibli Faraz Wednesday said that quality and energy efficient appliances can make a huge difference towards saving valuable energy resources and help resolving the major issues related to the energy sector in the country.\n“It is the need of the hour that production of energy efficient products of international standards must be ensured in the country”, he said this while chairing a meeting on energy efficient products in the Ministry of Science and Technology.\nRepresentatives of Pakistan Electronics Manufacturers Association, Pakistan Fans Manufacturers Association, leading Electronics companies, National Energy Efficiency and Conservation Authority and Oil and Gas Regulatory Authority (OGRA) also participated in the meeting.\nThe federal minister stressed the need for creating awareness regarding energy conservation and energy efficient products in the country.\nHe stated that Pakistan has a price sensitive market but through the implementation of star rating regime, people can be made aware of the savings they will make both in terms of money and energy by using these appliances.\nHe highlighted that use of these items would be beneficial for all stakeholders including the consumer, manufacturers and the government.\nDuring the meeting different proposals and measures were discussed to ensure the production of energy efficient appliances in the country.\nThe federal minister emphasized that the public and private sector must join hands in this important task because without cooperation and ownership of the manufacturer it would not be possible to implement this policy. Representatives of the private sector present in the meeting assured the chair of their full cooperation.\nThe federal minister gave certain targets and directions to the different organizations of the Ministry including Pakistan Standards and Quality Control Authority (PSQCA), Pakistan Council for Scientific and Industrial Relations (PCSIR) and National Institute of Electronics (NIE) in this regard.\nIt was informed during the meeting that people don’t realise the difference which the usage of energy efficient electronics can make towards nation-wide energy savings.\nFor example, a conventional fan takes 130-140 watts at home, but energy-efficient fans consume half the energy.\nIt was highlighted that according to a study Pakistan can save upto 3000 MW of energy daily by only replacing conventional fans with energy efficient fans.",
  "retrievedAt": "2025-08-11T20:52:42.998Z"
}
