{
  "title": "Qureshi for unity, multilateral cooperation for post-pandemic economic recovery",
  "link": "https://www.app.com.pk/national/qureshi-for-unity-multilateral-cooperation-for-post-pandemic-economic-recovery/",
  "date_published": "2021-06-23T17:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Foreign Minister Shah Mahmood Qureshi Wednesday called for unity, solidarity and multilateral cooperation among countries for post-pandemic economic recovery, besides finances for developing countries to enable them achieve Sustainable Development Goals (SDGs) by 2030.\n“Our fruitful cooperation in combating COVID-19 for timely economic rebound would require sharing experiences and best practices for diagnosis and treatment of COVID-19; enhancing the availability, accessibility and affordability of vaccines through joint research and production and improving developing countries’ access to vaccines,” the foreign minister said addressing the Asia and Pacific High Level Video Conference on Belt and Road Cooperation.\nHe said the timely economic recovery would also require preferential financing from multilateral development institutions for developing countries which could only be done through robust multilateral policy measures and broad-based cooperation.\nAdditionally, he said there was a need to mobilize the finance needed by developing countries to recover from the COVID-19 induced recession and to restore them on the path to achieve the SDGs by 2030.\nDeveloping countries should also be able to borrow from the markets at the prevailing low interest rates available to developed countries, he added.\nCalling the high level conference “a timely initiative”, the foreign minister appreciated China for hosting the event and said since the outbreak of COVID-19, post pandemic economic recovery and green sustainable development remained the priorities of Belt and Road partner countries.\nHe said the countries of Asia and Pacific were moving ever closer to the center-stage of global affairs, while “we continue to face common and mounting challenges such as climate change, COVID-19 induced inequalities, and non-traditional threats, to name just a few.”\nHe said the apart from the medical catastrophe, the COVID-19 also has a far-reaching political, social, and economic impact on the globe.\n“The pandemic has led to economic slowdown, bankruptcies, financial fissures, job losses and disruption in global supply chains. It has indeed tested the resilience of the existing global economic system and restructured the ways in which the economic and social problems must be conceived and addressed,” Qureshi remarked.\nHe told the participants that in order to fights the pandemic effectively, the government of Pakistan followed a ‘smart lockdowns’ policy and adopted the three–pronged strategy focused on ‘Saving Lives, Securing Livelihoods, and Stimulating the Economy’.\n“To target the vulnerable segments of the population, the government disbursed Rs. 203 billion to 15 million families through its ‘Ehsas Emergency Cash Program’. We have launched a vaccination drive that will cover 70 million people by December 2021. In this regard, 12 million vaccine doses have been administered to over 9.5 million citizens,” Foreign Minister Qureshi said.\nHe said earlier this month, Pakistan began production of Chinese made vaccine, underscoring the resilience of our industrial supply chains and China’s growing role in fostering international cooperation in healthcare.\nHe said Pakistan’s efforts to contain and reverse the worst effects of COVID-19 had been enormously helped by China for which the government and people of Pakistan profoundly grateful.\nQureshi said the challenges posed by the COVID-19 pandemic were a great opportunity not only to rebuild better, but also greener.\n“The developed countries must fulfill their commitments under the Paris Agreement to support developing countries in their climate action and to mobilize 100 billion US Dollars annually in climate finance as they have promised,” he said.\nHe said Pakistan has launched the ‘Green Economic Stimulus Initiative’ as a part of its efforts. This stimulus has already generated 85,000 green jobs-a number we plan to increase by another 100,000 by the end of this year.\nThe foreign minister told the conference that Pakistan had launched one of the most ambitious afforestation and reforestation drives in the world. The country has already planted one billion trees and mangroves out of a target of 10 billion.\n“Our mangrove cover has expanded three-folds in the last ten years. We exceeded our target in the first phase of Bonn Challenge 2020 of restoring more than 865,000 acres of degraded landscapes in our Khyber Pakhtunkhwa province. We have now voluntarily pledged to restore nearly 2.5 million acres by 2023, including in urban areas,” he added.\nHe said Pakistan had also hosted this year’s World Environment Day, when “United Nations Decade on Ecosystem Restoration 2021 – 2030” was also launched.\nThe foreign minister said in wake of emerging global and regional environment, Pakistan has recalibrated its priorities from geo-politics to geo-economics.\nThe China-Pakistan Economic Corridor (CPEC), the flagship project of the Belt and Road Initiative (BRI), complements Pakistan’s renewed efforts of geo-economic shift with emphasis on economic integration and regional connectivity, he added.\n“We have to think in the long-term, keeping in mind the best interest of our future generations. We are ready to join hands for win-win outcomes. Our success lies in cooperative multilateralism and partnership. Let Asia Pacific and BRI partners take the lead. Pakistan is willing to work with all members to advance our shared objectives,” the foreign minister urged.\nThe foreign minister endorsed President Xi Jinping’s declaration of making COVID-19 vaccine a global public good, dispel notions of stigmatization, and reject vaccine nationalism.\nHe also called for making collective endeavors to ensure equitable and affordable supply of vaccine to developing countries. “Therefore, we fully endorse the initiatives for ‘Belt and Road Partnership on COVID-19 Vaccines Cooperation’ and ‘Belt and Road Partnership on Green International Development’ being launched today.”\nQureshi underscored the need for seizing the opportunity that has arisen in the wake of the COVID-19 pandemic to rectify the structural inequalities that cause economic crises in the Global South.",
  "retrievedAt": "2025-08-11T20:52:47.597Z"
}
