{
  "title": "Pakistan condemns state terrorism against people under illegal occupation : Dr Moeed",
  "link": "https://www.app.com.pk/national/pakistan-condemns-state-terrorism-against-people-under-illegal-occupation-dr-moeed/",
  "date_published": "2021-06-23T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 23 (APP): National Security Advisor, Dr. Moeed Yusuf Wednesday said that Pakistan condemned terrorism in all its forms and manifestations, including state terrorism against people under illegal occupation.\nHe said Pakistan had been a victim of terrorism planned, supported and sponsored from across its borders which unfortunately remained a reality even today.\n“It has at its roots, actors, who may present themselves as advocates of global cooperation against terrorism, but in reality perpetuate it to create instability in our country and the region, he said while addressing a 16th meeting of the National Security Advisers of the Shanghai Cooperation Organization (SCO) held in Dushanbe, Tajikistan.\nThe adviser said “Terrorism cannot and should not be associated with any race, religion, nationality, civilization or ethnic group.”\nThe NSA said that Pakistan did not wish to be part of any camp politics or geopolitical confrontation, adding “Pakistan’s vision for itself was that of a melting pot for positive global interests.”\nOn the occasion, the member states including Pakistan and India issued a joint protocol signed by all the NSAs, said a press release.\nIn his formal statement, Dr. Yusuf further said that Pakistan’s main priority of generating greater economic activity, reducing unemployment and poverty alleviation were completely in sync with the SCO’s direction.\nHe said the vision of the transformed Pakistan was centered on economic security, adding that the country’s emphasis had shifted from geo-politics to geo-economics.\nDr. Moeed said failure to attain peace in Afghanistan was the most immediate challenge facing SCO today.\nAs a country historically most affected by developments within Afghanistan, Pakistan was fully committed to supporting a stable, peaceful, sovereign, and united Afghanistan at peace with itself and with the neighbours, he added.\n“It is our firm view that a negotiated political settlement that is Afghan led and Afghan owned is the only way to achieve this desired outcome”, a press release quoted the adviser as saying.\nHe cautioned against spoilers, both within and outside Afghanistan, adding that unfortunately, not everyone in the region who professed to prefer peace in Afghanistan did so in reality.\nThe adviser said that Pakistan could not allow Afghan soil to be used against it.\nHe apprised the meeting about Pakistan’s success in fighting Covid 19 pandemic and stressed the need to counter pandemic’s negative economic impact and highlighted Prime Minister Imran Khan’s efforts to champion the Global Initiative for Debt Relief.\nDr. Yusuf also informed his counterparts about Pakistan’s efforts in the area of climate change.\nHe said that Pakistan was a low carbon emitting country but one of the most vulnerable to climate change.\n“Prime Imran Khan has made climate change his top priority and has emerged as one of the leaders of the Global South on environment”, he added.\nEarlier in the day, the NSA held an important bilateral meeting with his Russian counterpart, Secretary of the Security Council of the Russian Federation, Nikolai Platonovich who extended a special invitation to Dr. Yusuf to hold a full scale bilateral NSAs dialogue.\nDuring the meeting, the two discussed issues of mutual interest and expressed satisfaction on the progress of Pakistan-Russia bilateral relations, while sharing serious concern about the evolving situation in Afghanistan.",
  "retrievedAt": "2025-08-11T20:52:42.994Z"
}
