{
  "title": "Three killed, 21 injured in a blast at Johar Town Lahore",
  "link": "https://www.app.com.pk/national/blast-reported-in-johar-town-lahore/",
  "date_published": "2021-06-23T06:33:00.000Z",
  "source": "APP",
  "content": "LAHORE, June 23 (APP): At least three people were killed and twenty one injured in a blast in Lahore’s Johar Town area, MS Jinnah hospital said on Wednesday.\nAs per Rescue 1122 spokesman, the persons died included Abdul Khaliq (30), Abdul Haq (5) and a person of 40 years of age whose identity was not ascertained yet.\nThe injured included a minor Abdul Maalik (1), Ambreen (27), Maham Azhar (23), Irum Rubab (21), Muqadas Shahid (20), Abdul Kalam (5), Hassan Ali (8), Liaqat Ali (28), Nisar (12), Unknown (27), Muhammad Umar (8), Safia (28), Fariha (20), Zahida (28), Muhammad Atif (26), Abdul Rehman (25), Rimsha Javed (18), Areej Asif (20), Javed (32), Intizar (23) and a police official Tahir (30).\nIt could not be immediately ascertained whether the blast was due to some explosive device or gas leakage. However, the MS of the Jinnah Hospital said the injuries were due to ball bearings and five of the 16 injured were in a serious condition. He confirmed three deaths.\nCCPO Lahore Ghulam Ahmed Dogar said the investigation was underway and the experts were looking into the matter.\nThe police, bomb disposal squad, and rescue teams rushed to the area. Eight injured were shifted to the Jinnah Hospital, while six were provided first aid on the spot.\nDIG Investigation Shariq Jamal told news channels that the investigation was underway and evidence was being collected in this regard.\nFootage made from mobile phones and shared on social media showed dust, smoke and debris spread in a residential area. Boundary walls of nearby houses had collapsed and window panes shattered.\nSSP Investigation Mansoor Rehman said forensic and bomb disposal investigations were being conducted to ascertain the facts.\nEyewitnesses and news camera footage showed that a number of vehicles and motorbikes in the area were damaged. The facade of several houses was badly damaged. Police cordoned off the entire area and forensic teams were investigating.\nHuge bomb blast in Johor Town in Lahore in front of my staff house. Heavy damage to his new car and house too. Family safe. pic.twitter.com/N65teoDEa1\n— Connecting PTIFamily (@ptifamily) June 23, 2021",
  "retrievedAt": "2025-08-11T20:52:47.498Z"
}
