{
  "title": "Pak-China enjoy enviable diplomatic relations: Usman Buzdar",
  "link": "https://www.app.com.pk/national/pak-china-enjoy-enviable-diplomatic-relations-usman-buzdar/",
  "date_published": "2021-06-23T07:47:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 23 (APP): Chief Minister Punjab Sardar Usman Buzdar has said that Pakistan and China enjoy enviable diplomatic relations and these relations stood every test of time over the past seven decades.\nAddressing a special ceremony to mark 70 years of diplomatic relations between China and Pakistan at the Chief Minister Secretariat here on Wednesday, he said Pak-China relations touched new heights under Prime Minister Imran Khan, adding that China stood by Pakistan in every difficult hour.\nThe ceremony was attended by provincial ministers including Abdul Aleem Khan, Mian Mehmood-ur-Rasheed, Raja Basharat, Mian Aslam Iqbal, Akhter Malik, Khayal Ahmad Kastro and others.\nHolding flags of both the countries in their hands during the ceremony, Chief Minister Punjab Sardar Usman Buzdar and the provincial ministers expressed their immense pleasure over this long journey of friendship between the people of the two countries and prayed for the longevity of the diplomatic relations. The participants raised slogans ‘Long Live Pak-China Friendship’.\nBuzdar, speaking on the occasion, said the 10 years of diplomatic bond was a tale of mutual love, respect and sincerity between the two countries, adding that both the countries enjoyed unparalleled relations.\nHe said innovation, research and hard work were the secret of China’s progress, adding that Pakistan is lucky to have a friend in China.\nHe said the Chinese model teaches a lesson of hard work to the Pakistani nation and this lesson must be passed on to the next generations, adding that hard work was the only royal road to progress and prosperity.\nChief Minister Punjab Sardar Usman Buzdar said the this strong bond of diplomatic relations between the two country will be taken forward with renewed zeal and commitment.\nProvincial Minister Culture Khayal Ahmad Kastro, speaking during the ceremony, said ceremonies were being held across the province to commemorate 70 years of diplomatic relations between Pakistan and China, adding that Pakistan enjoys strong cultural, diplomatic and friendly ties with China.\nHe said various cultural ceremonies will be held in the provincial metropolis to mark the historic occasion in the diplomatic history of the country.",
  "retrievedAt": "2025-08-11T20:52:45.048Z"
}
