{
  "title": "Pak-UK cooperation to be enhanced to finalize treaties",
  "link": "https://www.app.com.pk/national/pak-uk-cooperation-to-be-enhanced-to-finalize-treaties/",
  "date_published": "2021-06-23T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):United Kingdom’s (UK) Minister of State for South Asia and the Commonwealth and Development Office Lord Tariq Ahmad called on Minister for Interior Sheikh Rashid Ahmed on Wednesday discuss matters related to strengthen relations between the two countries.\nThey also discussed matters of British Pakistanis, enhancing people to people contact and the cooperation in the field of security, trade and culture.\nEarlier, Minister for Interior Sheikh Rashid Ahmad welcomed UK’s Minister of State Lord Tariq Ahmad in his office.\nLord Ahmad appreciated Prime Minister Imran Khan’s 10 billion Tsunami Tree Project to fight climate change in Pakistan.\nBoth agreed to strengthen coordination between the Ministry of Interior and the UK’s Home Office to improve the ability of the law enforcement and criminal justice systems in both the countries to work together.\nThey stressed to work together and support each other in their joint efforts in tackling transnational crimes.\nHe presented a Letter of Intent from the UK government seeking further cooperation in various areas of mutual interest.\nThe Minister said that UK is looking forward to welcome the Prime Minister Imran Khan upon his upcoming visit.\nMinisters agreed to enhance coordination in realizing agreements of Pakistan-UK Returns Arrangements and the Extradition Treaty between the two countries.\nThey expressed their satisfaction over the progress on the signing of Pakistan-UK Returns Arrangement as the draft was ready to be placed on the agenda of the Federal Cabinet for approval.\nInterior Minister told UK’s Minister of State that Pakistan enjoys Extradition Treaties with a number of countries and was keen to get it signed with the UK too, at the earliest.\nEfforts should be geared up from both sides to get the Extradition Treaty finalized soon, Minister said, as this would improve the processes needed to extradite criminals from the UK to Pakistan.\nMinister for Interior said that Pakistan and UK enjoy historic relations to which Pakistan values a great deal.\nHe said that the presence of 1.6 million British Pakistanis in UK cement this relationship further. He said that Pakistan valued the services of these British Pakistanis living in the UK over their philanthropic work in various regions of Pakistan.\nMinister also raised the issue of placing Pakistan on UK’s list of countries barred from entering UK despite the fact that Pakistan has one of the lowest rates of COVID-19 infections.\nMinister of State Lord Tariq Ahmad further said that Pakistan and UK enjoy deep-rooted relations, which are based on shared history and experiences, reinforced by strong people to people contacts.\nA strong partnership between Pakistan and UK remains important in promoting and sustaining peace, security and stability in the wider region.\nUK’s High Commissioner to Pakistan, Christian Turner and Additional Secretaries of Interior Sher Alam and Iftikhar Shalvani also attended the meeting.",
  "retrievedAt": "2025-08-11T20:52:36.437Z"
}
