{
  "title": "Ambassador hosts Iftar banquet for ‘Freinds of Ethiopia’",
  "link": "https://www.app.com.pk/national/ambassador-hosts-iftar-banquet-for-freinds-of-ethiopia/",
  "date_published": "2024-03-30T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): Ethiopian Ambassador to Pakistan Jemal Beker Abdula has hosted an Iftar banquet for Parliamentarians, government officials, diplomatic corps, ambassadors, Ethiopian Diaspora and many prominent figures from the civil society and media of Pakistan.\nProminent guests including Senator Mushahid Hussain, Senior Parliamentarian Romina Khursheed Alam, Africa-Pakistan Association President Zafar Bakhtawari, High Commissioner of Mauritius in Pakistan, Rashidally Soobadar and COMSATS Executive Director Nafees Zakaria graced the Iftar dinner.\nAmbassador Jemal Beker Abdula accorded a warm welcome to the guests upon their arrival at his residence in Islamabad. Speaking on the occasion, Ambassador Jemal Beker Abdula congratulated the Muslims in Ethiopia, Pakistan and all over the world on the holy month of Ramazan that brought blessings for everyone in this globe.\nHe said Pakistan was a country of generous people who loved to share with others around them in a deep sense of compassion, affability and affection.\nThe ambassador also spoke about Ethiopia and its linguistic, social, religious and cultural diversity. Addis Ababa, the Capital of Ethiopia, witnessed a grand street Iftar on a regular basis giving a festive look during the holy month of Ramazan, he noted.\nThe Ambassador also spoke about social, cultural, political and economic similarities between the Federal Democratic Republic of Ethiopia and the Islamic Republic of Pakistan.\nHe said both countries were heirs of ancient civilizations and shared the values of peace, justice, equality and democracy. The Ambassador expressed gratitude to all the guests for gracing the Iftar dinner with their esteemed presence and stressed that such gatherings were meant to further strengthen the already flourishing bilateral relations between the two countries.",
  "retrievedAt": "2025-08-11T01:38:23.435Z"
}
