{
  "title": "Murad, Aurangzeb agree to attract foreign investment, discuss deduction, gas, agri issues",
  "link": "https://www.app.com.pk/national/murad-aurangzeb-agree-to-attract-foreign-investment-discuss-deduction-gas-agri-issues/",
  "date_published": "2024-03-30T11:30:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 30 (APP): Sindh Chief Minister (CM) Syed Murad Ali Shah and Federal Minister for Finance Muhammad Aurangzeb have agreed to collaborate to attract foreign investment and boost exports, enhancing the financial stability of the province in general and of the country in particular.\nThis emerged in a meeting between the two here at CM House on Saturday. The meeting was attended by Principal Secretary to CM Agha Wasif, Additional Secretary Ministry of Finance Amjad Mahmood, and Provincial Secretary Finance Fayaz Jatoi, according to a CM’s spokesman.\nThe CM pointed out that his government has always paid its electricity bills on time, and if any outstanding bills needed to be reconciled, the federal government should have brought the issue to their attention instead of making at-source deductions.\nThe CM also said that the FBR after reading a news item of the cars registered in Sindh from 1948 to 2015 had deducted Rs6 billion of the province at source. Despite the resolution of the issue still the amount has not been refunded.\nThe Federal Finance Minister told the chief minister that he was working to develop a proper professional working relationship between the federal and provincial organizations. “The federal and provincial organizations and institutions have to work together, learn from each other’s expertise, support each other for growth and cooperate for collective uplift and development,” he said.\nMohammad Aurangzeb assured the chief minister that the at-source deduction issue would be resolved amicably. The CM and the federal finance minister also discussed the price escalation of industrial gas. The chief minister said that the industrialists were quite upset with the increase in industrial gas prices.\nThe Federal finance minister said that during his meeting with the industrialists, they also complained to him. Therefore, they agreed to discuss the matter with the federal minister for petroleum to resolve the issue.\nThe chief minister said that in the federal Public Sector Development Programme (PSDP), the provincial government has not been given any new scheme for the last eight years. Compared to Sindh the other provinces have been given new schemes in the federal PSDP. Aurangzeb and Shah agreed that the issue of PSDP’s new schemes would be discussed with the federal minister for planning & Development.\nIt was also agreed that the federal and provincial governments would work together to develop the agriculture sector on scientific and modern methods. It was pointed out that there was ample potential to cultivate export-quality crops, vegetables, fruits, and dairy products so that they could be exported to earn foreign exchange.\nThe CM told the federal finance minister that he was working to introduce new technologies to improve crop yield and measures being taken to ensure the provision of certified seed in the market.\nDiscussing the reconstruction of flood-devastated infrastructure, the CM told the federal finance minister that houses, school buildings, and roads were being reconstructed.  He said that the donor agencies have extended a helping hand in the reconstruction of flood-affected infrastructure, but the funds have not trickled down as was pledged by the international community.\nThe chief minister and the federal minister also agreed to attract foreign investment in different sectors for which investment procedures would be made simple and automated. The federal finance minister appreciated the Sindh Chief minister’s efforts in establishing one of the best Public Private Partnership units. He said that the provincial government has evolved an effective public-private partnership in Sindh and its fruits are being reaped by the public and the private partners. The CM thanked the federal minister for his visit and support.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:38:44.967Z"
}
