{
  "title": "FDE draws criticism over baffling transfers of Principal",
  "link": "https://www.app.com.pk/national/fde-draws-criticism-over-baffling-transfers-of-principal/",
  "date_published": "2024-03-30T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):Amidst a backdrop of confusion and discontent, recent transfers within the Federal Government Colleges have left the teachers in tension.\nAccording to a notification, the Federal Directorate of Education (FDE) has recently reshuffled many principals and associate professors drawing widespread criticism from the teaching community.\nOne such case involves Ms. Shabana Tabasum, a professor at Islamabad Model College for Girls (IMCG) F-7/2 (Postgraduate), who was inexplicably transferred to IMCG (PG) F-7/4, only to be assigned temporary duty back at her original institution, IMCG (PG) F-7/2.\nThis transfer raises serious questions about the decision-making process within the FDE. Why transfer a professor to a different institution, only to have them perform duties back at their original posting? It’s a textbook example of bureaucratic absurdity that serves no purpose other than to confuse and inconvenience professors.\nAdding to the confusion is the case of Ms. Rozina Fahim, originally stationed at IMCG (PG) G-10/4 but temporarily serving as Principal at the Federal Government College of Home Economics & Management Sciences F-11/1.\nShe has now been transferred to fill the vacant post left by Ms. Tabasum at IMCG (PG) F-7/4, while continuing her temporary duty at the FGCHE&MS, F-11/1. The domino effect continues as Ms. Sadia Ibrar, previously posted at IMCG (PG) F-7/4, finds herself relocated to IMCG (PG) G-10/4 to accommodate a junior associate professor as principal.\nSuch decisions have raised eyebrows and drawn criticism from within the academic community, casting doubts on the competence of those orchestrating these transfers.\nMeanwhile, Ms. Shazia Wazir, serving as Principal at IMCG I-14/3, was transferred to IMCG Bhara Kahu to assume the role of Principal.\nMs. Najm-un-Nisa, the incumbent Principal at IMCG Bhara Kahu, finds herself at the center of yet another confounding transfer. Despite being transferred to IMCG (PG) F-7/2, Ms. Najm-un-Nisa is expected to perform temporary duty as Principal at IMCG I-8/3. Ms. Abida Parveen, an associate professor at IMCG (PG) G-10/4, has been transferred on temporary duty to IMCG I-14/3. She will perform temporary duty as Principal.\nAn associate professor told APP, this convoluted chain of transfers not only highlights the lack of rational decision-making but also exposes the misuse of the concept of “temporary duty.\nShe further said, “This phenomenon of “temporary duty”, not recognized in government rules. This “temporary duty” syndrome is severely detrimental to the functioning of educational institutions. Professors and principals find themselves divided between multiple colleges, receiving salaries from one while performing duties at another. This not only disrupts the educational environment but also compromises the quality of teaching and administration. She added.\nAccording to some teachers, these illogical transfers and the prevalence of temporary duty to the absence of a regular Director General leading the Federal Directorate of Education.\nThe lack of decisive leadership has resulted in haphazard decision-making, ultimately undermining the educational system’s integrity and efficiency.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:38:43.961Z"
}
