{
  "title": "Djibouti govt reiterates resolve to boost Pakistan ties for mutual benefits",
  "link": "https://www.app.com.pk/national/djibouti-govt-reiterates-resolve-to-boost-pakistan-ties-for-mutual-benefits/",
  "date_published": "2024-03-30T00:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): Djiboutian Secretary General of Foreign Affairs Ambassador Mahmoud Ali Hassan appreciating the close bilateral ties between Pakistan and Djibouti reiterated his government’s resolve to further boost bilateral cooperation for benefit of the two peoples as well as the region.\nHassan, in his address at the Pakistan Day ceremony held by the Pakistan Embassy in Djibouti, also lauded constructive role of Pakistani diaspora living in Djibouti comprising professionals, businessmen and skilled workforce.\nHe emphasized the need to establish strategic ties between the two countries, according to a press release received on Saturday. The chief guest of the ceremony was Dileita Mohamed Dileita, President of the National Assembly of Djibouti.\nAmong other local dignitaries who attended the event were Mohamed Ali Houmed, former President of Djiboutian Parliament, the naval chief, parliamentarians including members of Pakistan-Djibouti Friendship Group, Secretary General of Foreign Affairs, members of the diplomatic corps, government officials and Pakistan community members residing in Djibouti.\nThe ceremony started with playing of national anthems of the two countries. In his remarks, Pakistan’s Ambassador Shahid Ali Seehar highlighted the importance of Pakistan Resolution passed on March 23, 1940 that led to the creation of Pakistan.\nPaying homage to the founding fathers of Pakistan, the ambassador congratulated Pakistani community members residing in Djibouti and around the world on the Day. At the end of ceremony, the guests were served with Iftar dinner, and the documentaries showcasing Pakistan’s rich history, culture and touristic attractions were screened.",
  "retrievedAt": "2025-08-11T01:38:47.282Z"
}
