{
  "title": "Targeted mechanisms urged to boost Raast adoption - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: State Bank of Pakistan Deputy Governor Saleem Ullah emphasised the need to address real market demands through targeted mechanisms that support merchants.\n\nHe was speaking at the launch of the report Merchant Payments on Raast: Responsibly Pricing for Impact and Inclusion. The report, released under the United Nations-backed Better Than Cash Alliance, focuses on building an ecosystem that encourages a shift from cash to Raast.\n\nHowever, the question remains: who will bear the cost of incentives and pricing? The business case for moving away from cash to Raast peer-to-merchant (P2M) payments is strong. More than 85pc of all transactions, worth trillions of rupees annually, still occur in cash. This reliance on physical currency imposes an estimated economic burden of Rs3-4 trillion ($10-14bn) each year, or about 4-5pc of GDP.\n\nSaad Niazi, CEO of Keenu, noted that referring to merchants as tier I, II or III is misleading. In reality, there are multiple layers — five or six in urban centres and four in rural areas — adding up to as many as 10 tiers, each with distinct needs.\n\nHe argued that Raast has the potential to serve all segments, from premium merchants to the lowest strata. At this stage, he stressed, the priority must be nationwide expansion and onboarding one million merchants. Only after reaching that milestone can pricing be adjusted and market forces take over. Until then, intervention and “handholding” are essential.\n\nCalling Raast a “national digital public infrastructure,” as Mr Saleem Ullah described it, raises another debate: should it be treated as a public good requiring subsidies, or as a commercial product shifting costs onto users across the value chain? Past experiences with subsidies in Pakistan have yielded limited success.\n\nL. Nshuti Mbabazi, managing director of Better Than Cash Alliance, challenged the perception that merchants resist digital payments to evade taxes. In an earlier interview with Dawn, Visa Country Manager Umar S. Khan made a similar point: merchants are not trying to evade taxes; they seek simpler processes and ways to build credit histories, which digitisation enables. The P2M market, in particular, holds significant untapped potential.\n\nA Visa white paper estimated that digitising, especially B2B payments, could unlock over $121bn in economic activity. However, this narrative resurfaces as tax-filing season approaches. The Federal Board of Revenue received only about 4m returns by the first cutoff, compared to 7.7m total filers, according to media reports.\n\nProgress has been achieved at the peer-to-peer level. Yet P2M transactions represent only a small share of the more than 100m transactions processed by Raast in 2023. Key reasons include the lack of a clear business case for providers, merchants’ resistance to merchant discount rate (MDR) fees, and confusion between P2P and P2M.\n\nThe Raast report proposes a tiered, cost-plus pricing model: a 0.35pc MDR floor across most sectors, exemptions for sensitive verticals such as utilities and fuel, and no interchange fees for issuers. The aim is to balance sustainability and inclusion.\n\nPublished in Dawn, October 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:07:09.252Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946202/targeted-mechanisms-urged-to-boost-raast-adoption",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T01:55:28.000Z"
}
