{
  "title": "Punjab govt working on proposal to regularise illegal, unapproved housing schemes - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government is working on a proposal to regularise illegal and unapproved housing schemes and land subdivisions in Lahore and other cities of the province keeping in view the construction of a large number of houses, infrastructure and for the provision of various civic services for the residents, Dawn has learnt.\n\nThough efforts were made in this regard in the past, the current proposal under review by the Board of Revenue (BoR) with input from the Lahore Development Authority (LDA) and other departments concerned, if approved, would enable the authorities to regularise illegal schemes with very strict regulations, policies and enforcement. Under these new rules, the chances of development of such projects would cease in the future.\n\n“The proposal to regularise illegal schemes / land subdivisions is seriously being worked out these days at the highest forum of the BoR, headed by the Senior Member Board of Revenue (SMBR), as we have attended various meetings in this regard,” LDA Chief Metropolitan Planner (CMP) Faisal Qureshi revealed while talking to Dawn on Thursday.\n\nAccording to him, the proposal suggests imposing heavy fines on developers in view of the committed violations. This will be done through making non-compoundable violations / offences to compoundable ones, empowering the authorities to calculate and impose fines on the developers. Similarly, the schemes, where roads could be widened with development of greenbelts, parks, mosques and other facilities, would be asked to take corrective measures under the rules and regulations, he added.\n\nIt is worth mentioning that as of June this year, more than 5,000 ‘illegal’ housing schemes / land subdivision in Punjab were either illegal or under process of approval as revealed in a meeting reportedly presided over by the Punjab CM around four months ago. The total number of housing schemes in Punjab at that time was 7,905, covering an area of about two million kanals. Of them, 2,687 housing schemes were found legal, while 5,118 were marked as illegal (or under approval process) across Punjab.\n\nIf approved, it will enable authorities to impose strict regulations and enforcement, making development of such projects impossible in future\n\nIn Lahore city district alone, as many as 207 housing schemes are illegal, including the 2,000 kanal Theme Park scheme that was completely submerged due to the flooding in Ravi. A huge number of houses have also been constructed in illegal schemes due to weak regulations, enforcement and corruption allegedly on the part of development authorities and the then town municipal administrations. The situation is also forcing the government to spend huge sums on carrying out operations to dismantle infrastructure (except houses) of these schemes partially or completely.\n\nRecently, in order to intensify the crackdown, powers were delegated to the metropolitan planning directorates in the LDA, after the directorate of estate management (private housing schemes) was abolished. The demolition operations in 36 schemes located near the BRB canal and Raiwind were carried out, in which key infrastructure, including entrance gates, boundary walls, roads and sewerage systems were dismantled. An FIR was also lodged against a developer who attempted to obstruct the operation.\n\nChief Metropolitan Planner (CMP) Qureshi said though the operations were being carried out in illegal schemes, it was not possible to demolish houses, electricity infrastructure etc. “It is very difficult to do so in a scheme where people are already residing in their houses. We can only demolish a couple of roads, greenbelts, boundary walls or the schemes’ offices. Our operations in illegal schemes are just to create a deterrence or give a message to such developers to better avoid developing schemes unlawfully and contact the LDA for approval of the schemes under the law. We also used to write letters to the deputy commissioner to advise the revenue staff to impose a ban on the registries / mutations of the properties existing in such schemes,” he explained. “The total number of illegal schemes in Lahore is 207, developed illegally on the chunks of land measuring 20 kanal and above. We have not included the illegal small land subdivisions measuring 5 to 10-15 kanals developed in muhallas or old settlements,” he added. To a question, he termed regularisation as the only solution, as it may also generate huge revenue through imposing heavy fines / penalties. To another query, he said the new ‘strict’ rules were also under discussion these days under which all assets of the developers involved in developing illegal schemes would be forfeited.\n\nWhen contacted, the LDA director general confirmed the development, stating that proposals were under discussion these days in this regard. “The development of illegal schemes reflects corrupt practices besides defiance of the law, rules and regulations. So, this is a need of the hour to curb such practices by all means, as these are tarnishing the country’s image,” he believed.\n\nPublished in Dawn, October 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:06:55.673Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946177/punjab-govt-working-on-proposal-to-regularise-illegal-unapproved-housing-schemes",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T01:55:58.000Z"
}
