{
  "title": "Stocks settle above new record 168,000 mark - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakis­tan Stock Exchange (PSX) extended its winning streak on Thursday, with the benchmark KSE-100 index closing above the 168,000-point mark for the first time, marking its sixth consecutive record-setting session.\n\nThe index finished the day at 168,489.63, up 2,849.29 points, or 1.72 per cent. It briefly peaked at an intraday high of 168,619. The bullish momen­tum was largely driven by sustained buying from mutual funds, which bolstered investor confidence through­out the session.\n\nThe banking sector was a key driver of the rally, with heavyweights such as Meezan Bank, United Bank, Bank Al-Habib, Habib Bank, and National Bank contributing 1,827 points to the index. However, gains were partially offset by profit-taking in stocks like Lucky Cement, Hub Power, and Systems Ltd, which together pulled back 192.05 points.\n\nTrading activity saw a slight decline from the previous session, with the trading volume falling by 4pc to 1.569 billion shares. However, the traded value increased by 0.76pc, reaching Rs70.1bn. Bank of Punjab led the volume board with 148 million shares traded.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, commented that after a brief pause, the PSX resumed its historic rally, propelled by strong mutual fund inflows, retail activity driven by a fear of missing out, and improved sentiment following improved US-Pakis­tan ties. He noted that mid-cap stocks with growth potential were seeing re-rating, while equities remained an attractive investment amid subdued returns in other asset classes and favourable tax incentives.\n\nOn the macroeconomic front, the Pakistan Bureau of Statistics reported a widening trade deficit of $3.34bn in September, com­pared to $2.87bn in August. Exports fell 11.7pc year-on-year, while impor­ts increa­sed by 14pc. Despite this, cement sales rose by 7pc year-on-year to 4.25m tonnes in September, indicating resi­lience in the sector despite the challenges posed by flooding.\n\nLooking ahead, analysts remain cautiously optimistic. While mutual fund inflows and banking sector strength could sustain market momentum, profit-taking and macroeconomic uncertainties may lead to occasional volatility.\n\nPublished in Dawn, October 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68df0a595b504.gif",
  "retrievedAt": "2025-10-16T20:40:47.813Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946196/stocks-settle-above-new-record-168000-mark",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T01:55:28.000Z"
}
