{
  "title": "SC’s Justice Afghan says transfer of IHC judges carried out in ‘unnecessary haste’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Supreme Court’s (SC) Justice Naeem Akhter Afghan on Friday issued a detailed dissenting note on the transfer of judges to the Islamabad High Court, stating that the transfer was carried out in “unnecessary haste” and not in the public interest.\n\nIn June, a five-member SC bench ruled 3-2 in favour of the February transfers and said that there was nothing unconstitutional about them. Justices Afghan and Shakeel Ahmed dissented and issued a short note stating that the transfer violated articles 2A, 4 and 25 of the Constitution and “undermined the independence of judiciary, due process and principle of equality”.\n\nIn a copy of today’s dissenting note, available with Dawn.com, Justice Afghan observed that the transfer process for Lahore High Court’s (LHC) Justice Muhammad Sarfraz Dogar and Sindh High Court’s Justice Khadim Hussain Soomro was initiated on January 28 and completed on February 1 — just five days.\n\nMoreover, a letter of consent for the transfer of Balochistan High Court Justice Muhammad Asif was written by the law ministry on January 31, with the judge giving his consent on the same day.\n\n“The process for transfer of three particular judges to IHC was initiated and completed by MoLJ (Ministry of Law and Justice) with unnecessary haste not in the public interest but, prima facie, with the motive to deprive the then Senior Puisne Judge of IHC (Mohsin Akhtar Kayani) of his consideration/appointment as CJ IHC,” the note read.\n\nAfghan’s note also claimed that the transfer was meant to “take over control of the affairs of IHC and District Judiciary of ICT [Islamabad Capital Territory] from the sitting judges of IHC and to hand over the same to the Transferee Judges and Additional Judges in supervision of Sardar Muhammad Sarfraz Dogar as Senior Puisne Judge IHC and thereafter as Acting CJ IHC and CJ IHC”.\n\nThe dissenting note also observed that any decision taken with an “ulterior purpose” is malice in facts.\n\n“Where an action taken is so unreasonable, improbable or blatantly illegal that it ceases to be an action countenanced or contemplated by the law under which it is purportedly taken, malice will be implied and the act would be deemed to suffer from malice in law,” the note read.\n\nAccording to the dissenting note, the MoLJ secretary requested the president’s authorisation to transfer Justices Dogar and Soomro, but did not approach him about approving Justice Asif.\n\nAdditionally, it noted that there was no record of the criteria against which the three IHC judges were transferred. It continued that in terms of seniority, Dogar was the 15th most senior judge at the LHC, Soomro was 20th in the SHC, while Asif had only taken his post as an additional judge at the BHC on January 18 — the same month as the transfer process was initiated.\n\n“All the above transpire that the process for [the] transfer of three Judges from LHC, SHC and BHC to IHC vide impugned notification is suffering from malice in facts as well as malice in law,” the dissenting note read.\n\nIt stated that the transfer of the three judges dealt a “serious blow” to judicial independence and affected the working relationship between the IHC’s judges.\n\n“Due to [the] issuance of the impugned notification by the president in wrong exercise of discretion, a ripple has been caused in the comity of judges and the turbulence created in [the] IHC has seriously affected the working relationship amongst the judges of IHC which has consequently affected the smooth working and disposal of IHC making the litigants to suffer at large,” the dissenting note read.\n\n“The issuance of [the] impugned notification in wrong exercise of discretion by the President has frustrated the legitimate expectancy of the sitting Judges of IHC,” it added, referring to judges who were more senior than Justices Dogar, Soomro and Asif.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:06:28.627Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946345/scs-justice-afghan-says-transfer-of-ihc-judges-carried-out-in-unnecessary-haste",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T15:48:48.000Z"
}
