{
  "title": "Pirwadhai shootout leaves man, son dead, two policemen injured - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: A father and his son were gunned down, while two police officials were injured on Thursday when the former was leading the police to arrest the alleged killer of his son, Ali Ehtisham, who was murdered allegedly by his uncle over a monetary dispute on Monday in Pirwadhai.\n\nAs the police party, along with Chaudhry Sarwar and his son Ali Wahid, went to identify the accused who had killed his nephew Ali Ehtisham, the accused and his accomplice allegedly opened fire on the police party.\n\nAs a result of the firing, Inspector Mirza Arif and Constable Naimatullah were seriously injured, while Sarwar and his son Ali Wahid, who had accompanied the police to identify the accused, were also killed, police said.\n\nOn receiving information about the incident, a large contingent of police, including personnel from nearby police stations, reached the spot.\n\nThe crime scene was cordoned off to arrest the accused, who had escaped.\n\nPolice said the party had gone to the area along with the plaintiffs to identify and inspect the crime scene.\n\nThe accused, hiding on the roof of the house, opened indiscriminate fire when they saw the police. The injured were shifted to the hospital.\n\nPolice said the accused would be arrested and brought to justice.\n\nAli Ehtisham, 23, had been “hammered and then axed to death” allegedly by his paternal uncle over a monetary dispute in Pirwadhai on Monday night.\n\nAli Wahid, a resident of Safdarabad, lodged an FIR with the police stating that an argument broke out between his brother Ali Ehtisham and his uncle Sher Afzal over money.\n\nAfter exchanging harsh words, Sher Afzal allegedly struck his brother on the head with a hammer. As Ehtisham fell to the ground, Afzal took an axe, cut his throat and escaped from the scene. City Police Officer (CPO) Syed Khalid Hamdani, along with SSP Operations Kashif Zulfiqar, visited Holy Family Hospital to inquire about the health of the injured police officials.\n\nA police spokesman said the CPO visited the injured officers and expressed his best wishes. He instructed hospital staff to ensure the best possible treatment.\n\nCPO Syed Khalid Hamdani said that those who attack police and citizens cannot escape the law, adding that police sacrifices in the fight against crime are immortal.\n\nPublished in Dawn, October 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:06:55.611Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946166/pirwadhai-shootout-leaves-man-son-dead-two-policemen-injured",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T01:56:06.000Z"
}
