{
  "title": "Deep depression in Arabian Sea intensifies into cyclonic storm ‘Shakhti’: PMD - Pakistan - DAWN.COM",
  "author": null,
  "content": "The depression over northeast Arabian Sea has intensified into a cyclonic storm “Shakhti” and now lay centered at around 360km south of Karachi, according to a notification issued by the Pakistan Meteorological Department (PMD) on Friday.\n\n“It is likely to move west-northwestwards initially and likely to further intensify into severe cyclonic storm during next 24 hours. Thereafter it is likely to move west-southwestwards and reach over central north Arabian Sea,” it added.\n\nUnder its influence, wind-thunderstorm and rain of light to moderate intensity is expected in Tharparker, Umerkot, Badin, Thatta, Sujawal, Tando Muhammad Khan, Hyderabad, Matiari, and Jamshoro districts, as well as at isolated places in Karachi division, as per PMD’s notification.\n\nHot and dry weather is likely to prevail elsewhere in the province.\n\nThe notification stated that sea conditions are likely to remain “rough to very rough” with “squally winds of 40 to 50 gusting 55 km/hour near Sindh coast”.\n\nIt also advised fishermen not to venture into the deep sea till Sunday. The met department further warned that windstorms and lightning may “damage weak structures like roofs and walls of kacha houses (temporary dwellings), electric poles, billboards, vehicles and solar panels”.\n\nAccording to the notification, the weather in Karachi division is expected to remain “mostly cloudy and humid with chances of isolated drizzle” on Saturday, with maximum temperature between 32 and 34 degrees Celsius.\n\nHumidity is expected to be between 75 to 85 per cent in the morning and 60 to 70pc in the evening.\n\nYesterday, the weather advisory said between October 4 and 6, moist currents from both the Bay of Bengal and the north Arabian Sea are expected to strengthen.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0321351277c655b.webp",
  "retrievedAt": "2025-10-12T13:06:30.471Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946335/deep-depression-in-arabian-sea-intensifies-into-cyclonic-storm-shakhti-pmd",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T13:57:05.000Z"
}
