{
  "title": "Church of England names first female Archbishop of Canterbury in 1,400 years - World - DAWN.COM",
  "author": null,
  "content": "The Church of England named Sarah Mullally on Friday as the next Archbishop of Canterbury, the first woman to hold the 1,400-year-old office, prompting immediate criticism from conservative Anglican churches in Africa who oppose women bishops.\n\nThe 63-year-old former nurse will become the ceremonial head of 85 million Anglicans worldwide and, like her predecessors, will face a Communion divided between conservatives and more liberal Christians in the West over the role of women in the Church and the acceptance of same-sex couples.\n\nWhile the appointment was welcomed by many religious leaders in Britain, Laurent Mbanda, archbishop of Rwanda and chairman of a global grouping of conservative Anglican churches, told Reuters that Mullally would not be able to unite the Communion.\n\nA bishop in Nigeria said the choice was “very dangerous” because men should lead and women should follow. The Church of England’s evangelical wing also called for a halt to what it called a drift away from scripture.\n\nBishop of London since 2018, Mullally has previously championed blessings for same-sex couples, a major source of contention in the global Anglican Communion. Homosexuality is outlawed in some African countries.\n\nIn an address in Canterbury Cathedral on Friday, Mullall said she would seek to help every ministry to flourish, “whatever our tradition”.\n\nOn same-sex relationships, she told Reuters in an interview that the Church of England and the broader Anglican Communion had long wrestled with difficult issues. “It may not be resolved quickly,” she added.\n\nMullally said she wanted the Church to tackle the misuse of power after sexual abuse scandals and safeguarding issues, and she condemned rising antisemitism following an attack on a synagogue in Manchester on Thursday which killed two men.\n\nReforms introduced more than a decade ago made it possible for a woman to become the 106th Archbishop of Canterbury. It is one of the last British institutions to have been run until now only by men.\n\nBut those reforms have been rejected by many churches in Africa and Asia. “Christ is the head of the Church, man is the head of the family, and from creation God has never handed over the position of leadership to woman,” Nigeria’s Funkuro Godrules Victor Amgbare told Reuters in Abuja.\n\nMullally will replace Justin Welby, who resigned over a child abuse cover-up scandal and who was criticised by some Anglicans for taking an activist role on social issues.\n\nShe spoke in her cathedral address of the difficulties of an age which “craves certainty and tribalism” and a country which is wrestling with complex moral and political questions around migration and communities feeling overlooked.\n\n“Mindful of the horrific violence of yesterday’s attack on a synagogue in Manchester, we are witnessing hatred that rises up through fractures across our communities,” she said, adding that it was her Christian faith that gave her hope in a world which often feels “on the brink”.\n\nMullally is also an outspoken opponent of legislation currently in parliament that would allow assisted dying, describing it as “unworkable and unsafe” and saying it poses a risk to the most vulnerable in society.\n\nMullally is a former cancer nurse who worked as England’s Chief Nursing Officer in the early 2000s. She was ordained as a priest in 2002 and became one of the first women to be consecrated as a bishop in the Church of England in 2015.\n\nThe married mother of two adult children said there were similarities between nursing and Christian ministry.\n\n“It’s all about people, and sitting with people during the most difficult times in their lives,” she once told a magazine.\n\nLinda Woodhead, professor of theology and religious studies at King’s College London, said the Church needed Mullally’s strong management skills. “Her emphasis on unity, gentleness and strength is exactly what the Church, and nation, needs right now,” she said.\n\nReflecting the Church of England’s status as the country’s established church, the appointment was announced by Prime Minister Keir Starmer’s office.\n\nIt was given formal consent by King Charles, the Supreme Governor of the Church of England, a role established in the 16th century when King Henry VIII broke from the Catholic Church.\n\nDavid Pestell, 74, who heads a tourist guide group in Canterbury, reflected on Mullally’s predecessors.\n\n“Some of them have been very good, some of them have been pretty bad,” he said. “Some of them have been very contentious, and some of them ended up murdered. I hope it doesn’t happen to this one. It’s delightful.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/032253335800c7d.webp",
  "retrievedAt": "2025-10-12T13:06:29.192Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946351/church-of-england-names-first-female-archbishop-of-canterbury-in-1400-years",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T17:55:53.000Z"
}
