{
  "title": "Mercury to dip with arrival of fresh rain spell - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A new spell of rainfall will start from Oct 3 to Oct 7 in different parts of the country, bringing widespread wind and thunderstorms as well as hailstorms, the Pakistan Meteorological Department said on Thursday.\n\nThe Met Office said that temperatures are likely to drop significantly during the wet spell.\n\nThe forecast also prompted the Punjab Provincial Disaster Management Authority to issue an alert regarding an increase in river flow due to rains in the province on October 5-7.\n\nIn Punjab, rainfall and thunderstorms are ex­­p­ected at isolated places in Islamabad, Rawal­pindi, Murree, Galiyat, Attock, Chakwal, Jhel­­um, Mandi Bahauddin, Gujrat, Gujranwala, Mian­w­ali and Khushab from Oct 2 (night) to October 3.\n\nMet Office predicts rainfall till 7th; warns of hailstorms, flash floods\n\n“Widespread rain-windstorm/thunderstorm with scattered heavy falls is expected in Isla­m­abad, Rawalpindi, Murree, Galiyat, Attock, Cha­kwal, Jhelum, Mandi Bahauddin, Gujrat, Gujr­a­nwala, Hafizabad, Wazirabad, Lahore, Kasur, Sheikhupura, Sialkot, Narowal, Mianwali, Khu­­shab, Noorpurthal, Bhakkar, Layyah, Sargodha, Sahiwal, Jhang, Toba Tek Singh, Nankana Sahib, Chiniot, Faisalabad, Pakpattan, Bahawalnagar, Vehari, Khanewal, Multan, Lodhran, Bahawal­pur, Rahim Yar Khan, Rajanpur, Kot Addu and Dera Ghazi Khan from Oct 4 to Oct 6,” the statement said. Hailstorm is also expected during the period.\n\nIn Khyber Pakhtunkhwa, almost all districts will receive widespread rain and thundersto­r­­ms. Dir, Chitral, Swat, Kohistan, Shangla, Bat­tagram, Mansehra, Abbottabad, Haripur, Bu­­ner, Malakand, Bajaur, Mohmand, Kohat, Pesh­awar, Charsadda, Nowshera, Mardan, Swabi, Khyber, Orakzai, Kurram, Hangu, Karak, Ban­nu, Lakki Marwat, Waziristan, Tank and Dera Ismail Khan will receive rain from Oct 2 to 7.\n\nSimilarly, widespread rain and thunderstorms with isolated heavy falls and hailstorms are expected in Kashmir’s Neelum Valley, Muz­a­f­far­abad, Rawalakot, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur and Gilgit-Baltistan’s Diamer, Astore, Ghizer, Skar­­du, Hunza, Gilgit, Ghanche, and Shigar on Oct 4-7.\n\nRain/windstorm/thunderstorm with isolated heavy falls are expected in Tharparker, Umer Kot, Mirpurkhas, Sanghar, Khairpur, Matiari, Tando Allayar, Tando Muhammad Khan, Hyderabad, Jamshoro, Karachi, Thatta, Badin and Sajawal on October 3.\n\nSimilar conditions are expected at isolated places in Zhob, Sherani, Loralai, Kohlu, Bar­kh­­an, Dera Bugti, Musakhel, Qila Saifullah, Quet­­ta, Ziarat, Sibi and Naseerabad from Oct 4 to Oct 6.\n\nThe Met Office also warned about possible la­­n­­dslides in vulnerable hilly areas of KP, GB, and Kashmir, as well as urban flooding in major cities.\n\n“Heavy rains may generate flash floods in local nullahs/streams of Dir, Swat, Shangla, Buner, Kohistan, Mansehra, Abbottabad, Charsadda, Nowshera, Swabi, Mardan, Murree, Galiyat, Islamabad/Rawalpindi and Kashmir from Oct 4 to 6,” the statement added.\n\n“Snowfall is also likely over the high mountains of upper Khyber Pakhtunkhwa, Kashmir and Gilgit-Baltistan,” it added.\n\nPublished in Dawn, October 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:06:44.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946240",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T01:59:19.000Z"
}
