{
  "title": "Trump calls on Israel to ‘stop bombing Gaza’ after Hamas ‘conditionally’ agrees to peace plan - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump said early on Saturday that Israel must stop bombing Gaza immediately and that he believes Hamas is ready for peace after an earlier statement by the Palestinian resistance group.\n\nHamas said it would agree to some of the terms in Trump’s plan to end the Gaza conflict, including releasing hostages, but avoided addressing more vexing issues like disarmament and said it would seek further negotiations.\n\nSoon after, Trump posted Hamas’ response to his Truth Social account. Trump had earlier not specified whether the terms would be subject to negotiation, as Hamas is seeking.\n\nIsraeli Prime Minister Benjamin Netanyahu’s office said Israel was preparing for an “immediate implementation” of the first stage of Trump’s Gaza plan for the release of Israeli hostages following Hamas’ response.\n\nShortly after, Israeli media reported that the country’s political echelon had instructed the military to reduce offensive activity in Gaza.\n\nNotably, the resistance group did not say if it would agree to disarm and demilitarise Gaza — something Israel and the US want but Hamas has rejected before. It also did not agree to an Israeli withdrawal in stages, as opposed to the immediate, full withdrawal the group demands.\n\nA senior Hamas official told Al Jazeera that the group would not disarm before Israel’s occupation of the besieged enclave ends, comments that underscored the gap between the parties as the war approaches its two-year mark.\n\nIn its statement, Hamas said it “appreciates the Arab, Islamic, and international efforts, as well as the efforts of US President Donald Trump, calling for an end to the war on the Gaza Strip, the exchange of prisoners, (and) the immediate entry of aid,” among other terms.\n\nIt said it was announcing its “approval of releasing all occupation captives — both living and remains — according to the exchange formula contained in President Trump’s proposal, with the necessary field conditions for implementing the exchange.”\n\nBut Hamas added: “In this context, the movement affirms its readiness to immediately enter, through the mediators, into negotiations to discuss the details.”\n\nThe resistance group said it was ready “to hand over the administration of the Gaza Strip to a Palestinian body of independents (technocrats) based on Palestinian national consensus and supported by Arab and Islamic backing.”\n\nHamas has previously offered to release all hostages and to hand over administration of the Gaza Strip to a different body.\n\nEarlier, Trump had given Hamas until 2200 GMT on Sunday (3am PKT on Monday) to accept his plan for peace in Gaza, warning the Palestinian resistance group faced “all hell” if it did not agree to the terms.\n\nThe US leader set the deadline — which would fall at 1am on Monday in Gaza — after an official for Palestinian group told AFP earlier on Friday that the group still needed time to study the proposal to end nearly two years of devastating war in the Palestinian territory.\n\n“If this last chance agreement is not reached, all hell, like no one has ever seen before, will break out against Hamas,” Trump had posted on his Truth Social platform.\n\n“Every Country has signed on! If this LAST CHANCE agreement is not reached, all HELL, like no one has ever seen before, will break out against Hamas.”\n\nThe proposal, backed by Israeli Prime Minister Benjamin Netanyahu, calls for a ceasefire, the release of hostages within 72 hours, Hamas’s disarmament and a gradual Israeli withdrawal from Gaza. That would be followed by a post-war transitional authority headed by Trump himself.\n\nHamas was not involved in the negotiations that led to the proposal, which calls on the resistance group to disarm, a demand it has previously rejected.\n\n“Hamas is still continuing consultations regarding Trump’s plan … and has informed mediators that the consultations are ongoing and need some time,” an official had said earlier on condition of anonymity because they were not authorised to speak publicly on the matter.\n\nOn Tuesday, Trump gave Hamas “three or four days” to accept his plan, which has been welcomed by world powers, including Pakistan among Arab and Muslim nations. Mohammad Nazzal, a member of Hamas’s political bureau, had said in a statement on Friday that the “plan has points of concern, and we will announce our position on it soon”.\n\nOn the ground, Gaza’s civil defence agency — a rescue force operating under Hamas authority — reported heavy air bombardment and artillery shelling on Gaza City.\n\nIt said Israeli strikes killed at least 11 people across the territory, including eight in Gaza City.\n\nAFP has contacted the Israeli military for comment.\n\nMedia restrictions in Gaza and difficulties accessing swathes of the territory mean AFP cannot independently verify details or casualty figures provided by the Israeli military or the civil defence.\n\nThe Israeli military is waging an air and ground offensive on the territory’s largest urban centre, from which hundreds of thousands have been forced to flee.\n\nThe UN on Friday reiterated there was no safe place in Gaza and that Israel-designated zones in the south were “places of death”.\n\n“The notion of a safe zone in the south is farcical,” Unicef spokesman James Elder said from the Gaza Strip.\n\nAmnesty International condemned a “catastrophic wave of mass displacement” as Israel intensified its Gaza City offensive.\n\nThe rights group said hundreds of thousands of Palestinians, many of whom had already been displaced multiple times, were being forced into “overcrowded enclaves in the south … that lack access to clean water, food, medical care, shelter and life-sustaining infrastructure”.\n\nAs the war nears the two-year mark and the death toll continues to rise, protesters around the world have railed at Israel’s interception of a flotilla carrying pro-Palestinian activists and aid for Gaza.\n\nOn Friday, the organisers of the Global Sumud Flotilla said its last remaining boat had been intercepted and Israel’s foreign ministry said it had deported four Italian participants.\n\nAs Hamas mulled Trump’s peace plan this week, a Palestinian source close to the group’s leadership told AFP on Wednesday that the Islamist movement wanted to amend some clauses, including the one on disarmament.\n\nHamas leaders also want “international guarantees” for a full Israeli withdrawal and that no assassination attempts would be made inside or outside Gaza, the source added.\n\nAnother source familiar with the negotiations told AFP that the group was split over Trump’s plan.\n\nStructurally, the group’s leadership is divided between officials based in the Gaza Strip and those abroad, particularly in Qatar. Much of Hamas’s leadership has also been wiped out in Israeli attacks throughout the conflict.\n\nThe source told AFP that “the first [opinion] supports unconditional approval, as the priority is a ceasefire under Trump’s guarantees, with mediators ensuring Israel implements the plan”.\n\n“The second has serious reservations regarding key clauses… They favour conditional approval with clarifications reflecting Hamas’s and the resistance factions’ demands,” the source added.\n\nHugh Lovatt, a senior policy fellow at the European Council on Foreign Relations, said “ultimately it’s not just about convincing Hamas leadership in Doha, but also the leadership in Gaza, as well as Hamas members and fighters in Gaza”.\n\n“Additionally, Hamas must then be able to convince other factions in Gaza,” he added.\n\nThe conflict was triggered by Hamas’s October 7, 2023 attack on Israel, which resulted in the deaths of 1,219 people, mostly civilians, according to an AFP tally of Israeli official figures.\n\nIsrael’s retaliatory offensive has killed over 66,288 Palestinians, according to health ministry figures in the Hamas-run territory that the United Nations considers reliable. Their data does not distinguish between civilians and combatants, but indicates that more than half of the dead are women and children.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/040717579b3a0ce.webp",
  "retrievedAt": "2025-10-12T13:06:28.835Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946348/trump-calls-on-israel-to-stop-bombing-gaza-after-hamas-conditionally-agrees-to-peace-plan",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T17:19:20.000Z"
}
