{
  "title": "Exports fall in July-Sept as trade gap widens - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s merchandise exports fell by 3.83 per cent in the first quarter of the current fiscal year, raising concerns among policymakers about weakening international demand and the potential slowdown in external orders.\n\nThe decline in exports has continued for the second consecutive month of FY26, with September marking the fifth month of contraction in the last six. While July saw a brief recovery with a marginal increase in export proceeds, the overall trend points to a challenging trade environment.\n\nExporters are facing pressures from subdued global markets and the high cost of doing business, particularly in the textile sector, where producers have cited escalating expenses as a major concern.\n\nAccording to data from the Pakistan Bureau of Statistics (PBS), exports in September dropped by 11.71pc to $2.51 billion, down from $2.84bn in the same month last year. However, on a month-on-month basis, exports showed a slight recovery with a 3.64pc increase compared to August.\n\nIn the first three months of the current fiscal year (July-September), total export proceeds stood at $7.61bn, a decrease of 3.83pc compared to $7.91bn during the same period last year. Notably, exports in July posted a significant growth of 16.91pc, marking a sharp reversal from the previous months, where the country had experienced consecutive negative growth.\n\nIn FY25, total exports amounted to $32.106bn, reflecting a modest 4.67pc increase from $30.675bn in FY24. However, the pace of growth slowed significantly in the latter half of the year, with export growth turning negative in several months, including February, April, and May. Despite a brief recovery in March with a 3.08pc increase, the overall trend remained downward.\n\nThe continuing decline in exports is a source of concern for policymakers, who are grappling with the adverse effects of both global and domestic challenges.\n\nTrade deficit grows\n\nThe trade deficit has also widened in recent months, exacerbating concerns about Pakistan’s external sector. Data from the PBS shows that imports in September grew by 14pc year-on-year, rising to $5.85bn from $5.13bn in the same month last year. Month-on-month, imports also increased by 14pc.\n\nDuring the first quarter of FY26, Pakistan’s import bill reached $16.97bn, reflecting a 13.49pc increase compared to $14.95bn during the same period in FY25. Imports rose by 6.57pc in FY25, totalling $58.38bn, up from $54.78bn in FY24.\n\nThe widening import bill, coupled with the decline in exports, led to a sharp increase in the trade deficit. In September, the trade deficit expanded by 45.83pc, reaching $3.34bn, compared to $2.29bn in the same month of the previous year. For the July-September period, the trade deficit stood at $9.37bn, up from $7.05bn in the same period last year.\n\nThe cumulative trade deficit for FY25 increased by 9pc to $26.27bn, compared to $24.11bn in FY24. This growing trade imbalance poses significant challenges for the country’s economic stability and raises further questions about the sustainability of its external accounts.\n\nPolicymakers will need to address both the decline in exports and the rising import costs to stabilise the trade balance and protect the country’s economic position on the global stage.\n\nPublished in Dawn, October 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:07:09.000Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946201/exports-fall-in-july-sept-as-trade-gap-widens",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T01:55:28.000Z"
}
