{
  "title": "Probe finds Thull girl’s death not linked to vaccine - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A six-member medical team tasked with investigating the circumstances surrounding the death of a young girl from Thull found that her demise was not linked to her inoculation, contrary to the claims of her family.\n\nIn a report to the head of the Expanded Program on Immunisation in Sindh, the Jacobabad district health officer explained that a nine-year-old girl (mistakenly identified in earlier reports as a teenager) was diagnosed with enteric fever at the Sukkur Institute of Child Health.\n\nAccording to the investigation report, no autopsy was conducted on the body. However, on the basis of interviews with her family and a ‘verbal autopsy’, it deemed the girl’s death following HPV vaccination as ‘coincidental’, as no other child in her home or the locality had experienced any adverse reaction from the vaccine.\n\nThe report indicated that the girl, alternatively identified as Sumaira/Sumaya by her family, was administered the HPV vaccine on Sept 20. She was first taken to different quacks, and then brought to the THQ Hospital Thull on Sept 28.\n\nAccording to the hospital’s medical superintendent, who examined the girl, she had a fever and would not let anyone touch her. Subsequently, she was referred to a tertiary care hospital in Sukkur.\n\nThe team also obtained the girl’s medical record from the Sukkur Institute of Child Health, where she was diagnosed with enteric fever. She passed away the next day, but according to her family, they did not receive a positive response to requests for an autopsy.\n\nOn the other hand, officials claimed they asked the family to approach the district magistrate to order an autopsy, but the family did not comply.\n\nThe investigation team visited the girl’s family and the district pediatrician also checked other vaccinated girls in the locality who, according to the family, had been experiencing symptoms such as fever and shortness of breath.\n\nThey were taken to the Jacobabad Institute of Medical Sciences (JIMS), where doctors ruled their symptoms to be anxiety-related. It was also found that the girls had not eaten for two days, and all four were discharged after being treated for their symptoms.\n\nThe team also checked the vaccine’s batch number, expiry date, and cold chain maintenance system, and found that everything was properly maintained.\n\nPublished in Dawn, October 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:40:47.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946222/probe-finds-thull-girls-death-not-linked-to-vaccine",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T01:55:49.000Z"
}
