{
  "title": "31 policemen injured, one died, 878 miscreants arrested during PTI protest; says IG Islamabad",
  "link": "https://www.app.com.pk/national/31-policemen-injured-one-died-878-miscreants-arrested-during-pti-protest-says-ig-islamabad/",
  "date_published": "2024-10-06T18:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 06 (APP):Islamabad Capital Territory (ICT) Inspector General of Police (IGP)  Syed Ali Nasir Rizvi, along with DIG  Syed Ali Raza and other senior police officers, held an important press conference at Rescue-15. According to police statement IG stated that today is a sad day for Islamabad Police. One of our officers, the father of one daughter and two sons, has been martyred. This officer was violently beaten by protesters at 26 no Chungi and beaten so severely that it became difficult for him to breathe. Despite all efforts, he could not survive and succumbed to his injuries.\nIG further stated that, in addition to this, 31 officers of Islamabad Police were also injured. All these officers were assigned to protect the public and maintain law and order. The State of Pakistan and Islamabad Police promise to bring the murderers of this officer to justice, as his family has asked us to do.\nSyd Ali Nasir Rizvi  also mentioned that, so far, 878 miscreants have been arrested, including 100 foreigners. Cases have been registered against them under various charges, including terrorism, murder, attempted murder, resisting the government, damaging government property, violating Section 144, and other offenses at eight different police stations.\nIG further explained that, under the instigation of their leaders, these miscreants set fire to a crane and a motorcycle in the Red Zone, 26 No. Chungi, broke Safe City cameras, and committed acts of violence at locations such as China Chowk, Kaswal Road, Katti Pahari, and Iran Avenue. FIRs have been registered for these subversive actions.\nIGP  also said that tear gas shells were provided to the Khyber Pakhtunkhwa police, who used them against Islamabad police. Leaders have instigated these actions, and Afghans were also involved, as evidenced by reports. These individuals not only used violence but also showed no hesitation in taking lives. The law will take its course, and the state will take action against them.\nIG also highlighted that the presence of the Malaysian President in Islamabad and the upcoming SCO conference are crucial events for the country. He pointed out that, prior to these important events, an attempt was made by one state’s machinery to hold a city of the state hostage, and there is evidence to support this.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:51:47.535Z"
}
