{
  "title": "ETO commits to expand user-friendly services, ending agents’ role",
  "link": "https://www.app.com.pk/national/eto-commits-to-expand-user-friendly-services-ending-agents-role-2/",
  "date_published": "2024-10-06T08:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 06 (APP):Director Excise & Taxation Department, Islamabad, Bilal Azam has assured his department’s commitment to providing more transparent and user-friendly services for residents, particularly in vehicle registration and token tax payment.\nIn an exclusive interview with APP, he highlighted the importance of leveraging digital solutions to enhance accessibility for residents while actively working to eliminate the role of agents who contribute to corrupt practices.\nAdmitting the agent mafia’s existence despite a number of modern solutions, especially mobile facilities, he underscored citizens’ role to utilize the department’s digital online services, which are designed to simplify processes and reduce the reliance on intermediaries. By fostering awareness and engagement, Azam believes the community can play a vital role in transforming service delivery and promoting transparency.\nResponding to queries and public concerns raised by this agency’s scribe, Azam outlined a two-step process for vehicle registration and transfer.\nApplicants can simply call the department’s helpline at 111-383-383 to provide their details and schedule a visit from a mobile registration van, which may arrive on the same day or the next.\nThis initiative not only caters to individual needs but also represents a move towards personalized public service.\nAdditionally, mobile vans are stationed at five locations throughout the week, expanding access for those who prefer to handle their affairs in person.\nThe introduction of the Islamabad Citizen App marks another milestone, allowing residents to pay their token tax via smartphone, thereby reducing congestion at physical offices.\nThis digital approach addresses the challenges posed by the high volume of vehicle registrations, making it easier for citizens to manage their obligations from the comfort of their homes.\nMoreover, ETO highlighted the department’s ongoing commitment to regulatory enforcement, with teams actively monitoring issues such as tinted windows and fancy number plates.\nFines collected from these operations contribute to the national treasury, reinforcing the department’s role in maintaining public safety and order.\nThe Excise & Taxation Department has witnessed notable growth in vehicle registrations in recent years and annually over 50,000 new vehicles are registered, resulting in a significant increase in total registration, reaching almost 1.5 million up till now.\nWith the implementation of digital initiatives, the average processing time for vehicle registration has been reduced from several weeks to a few days, leading to a significant decline in the number of physical visits to the office.\nLooking ahead, the Excise & Taxation Department is set to further digitize its operations, with plans for continued enhancements to better serve the public.\nAzam urged vehicle owners to comply with regulations by removing any modifications that could lead to fines, thus fostering a cooperative relationship between the department and the community.\nThrough these initiatives, the department is not just transforming vehicle registration and tax payment procedures; it is also setting a standard for public service that prioritizes efficiency, accessibility, and accountability. As they pave the way for a more modernized system, the department invites residents to engage with these services and experience the benefits firsthand.\n“Many citizens from across the country seek to register their vehicles in the federal capital, as it adds significant value to their registration. However, this influx also places an increased workload on our local office. To address this, I emphasize the importance of streamlining our processes and suggest that provincial vehicle registration offices, like those in Punjab, implement similar efficiencies. By doing so, we can better manage the demand and ensure a smoother experience for all vehicle owners, while maintaining the integrity of our services” Azam highlighted.\n“In our ongoing efforts to enhance public services, I urge the media to help raise awareness among citizens about our latest online services. By fully utilizing these digital platforms, residents can significantly reduce the rush at our offices and streamline their own processes. This not only promotes public ease but also helps us discourage unfair practices associated with intermediaries. Together, we can create a more transparent and efficient system that benefits everyone”, concluded the Excise head in his final remarks.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:51:41.146Z"
}
