{
  "title": "Pakistan’ economy shows signs of recovery, says Rana Ihsan Afzal",
  "link": "https://www.app.com.pk/national/pakistan-economy-shows-signs-of-recovery-says-rana-ihsan-afzal/",
  "date_published": "2024-10-06T08:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): Coordinator to the Prime Minister Rana Ihsan Afzal Khan Sunday expressed optimism about Pakistan’s economic recovery, highlighting the government’s initiatives that have boosted investor confidence, exporter confidence, and attracted foreign investment, paving the way for sustainable economic growth.\nPakistan’s economic recovery is gaining momentum, driven by strategic reforms and investments, he said in an exclusive talk with PTV news channel.\nPakistan’s economy is showing promising signs of recovery, thanks to the government’s strategic efforts, he said.\nHe painted a positive picture of Pakistan’s economic outlook and expressed confidence in the government’s reform agenda, citing notable progress in tax stabilization, privatization and exporter’ support.\nPakistan is poised for significant economic growth, with a focus on resolving long-standing issues faced by manufacturers and exporters, he said, adding, the government is actively addressing refund issues and implementing strategies to boost exports.\nIn fact, Pakistan has planned to raise its exports to $50 billion in five years, with an ambitious long-term target of $100 billion, he added.\nRana Ihsan Afzal Khan emphasized that eliminating the non-filer category will have a positive impact on exporters, boosting Pakistan’s economic growth.\nCoordinator to the Prime Minister also highlighted a significant shift in Pakistan’s economy, adding, previously, investments were largely concentrated in the property sector, which did not contribute significantly to the country’s economic growth.\nHe mentioned that maintaining an exchange rate aligned with market rates is our priority to benefit exporters.\nResponding a query, he said the government has committed to maintaining current tax rates in the budget, prioritizing sustainability over increases.\nThis move aims to promote economic stability and growth, while also ensuring that the tax system remains fair and efficient, he added.\nTo another query, he said Pakistan International Airlines (PIA) is undergoing a significant transformation through privatization, with the government seeking investors for a majority stake.\nThis move aims to revitalize the airline, addressing its financial struggles and operational inefficiencies, he added.\nThe privatization process is expected to attract both local and international investors, particularly from the Middle East, Asia, and Europe, he mentioned.\nRana Ihsan have also shed light on Pakistan’s economic prospects that by implementing non-filer restrictions, the government aims to encourage more citizens to file taxes, ultimately boosting the economy.\nKhan expressed confidence that Pakistan’s economic reforms are yielding positive outcomes, demonstrating the government’s commitment to sustainable growth.\nRana Ihsan Afzal Khan also expressed gratitude to the Pakistan Army for their coordination efforts in supporting the government’s economic revival initiatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:51:20.080Z"
}
