{
  "title": "Coronavirus: Governor announces essential items’ provision to jail inmates",
  "link": "https://www.app.com.pk/national/coronavirus-governor-announces-essential-items-provision-to-jail-inmates/",
  "date_published": "2020-03-28T00:40:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 28 (APP)::Punjab Governor Chaudhry Mohammad Sarwar has announced provision of masks, hand-sanitizers and soap to jail inmates and staff in order to protect them from dreaded coronavirus.\nAddressing a press conference along with representatives of some non-governmental organisations (NGOs) at the Governor’s House here on Saturday, he said: “We have decided jointly with the representatives of 12 welfare organisations of Punjab Development Network (PDN) that comprehensive measures will be taken to protect staff and prisoners in all jails of Punjab from coronavirus.”\nCh Sarwar said the first consignment of anti-coronavirus essential items had been handed over to the Inspector General of Police (IGP) Prisons Punjab for Lahore jails, adding that masks, sanitizers, soap, gloves and anti-germ shampoo would be provided for 46,000 prisoners and jail staff in the next phase.\nGohar Ejaz of the Lahore Institute of Health Sciences (LIHS), Akhuwat Foundation Chairman Dr Amjad Saqib, Khwaja Shahzeb Akram from pharmaceutical sector, Qazi Azmat from the Punjab Educational Endowment Fund (PEEF), Vice Chairperson Sarwar Foundation Begum Perveen Sarwar and representatives of 12 welfare organisations were present at the press conference.\nThe governor urged philanthropists to come forward and donate generously to the needy families in the wake of financial hardship due to the lockdown in the province, adding that free ration to 100,000 poor families in Punjab would be provided by philanthropists.\n“As per vision of Prime Minister Imran Khan, we have also decided to provide free ration to all those families who have become jobless due to coronavirus crisis, and in the first phase free ration would be provided to 100,000 poor families,” he added.\nHe said a mobile phone application (App) was being developed to keep record of the people getting support and to avoid duplicity, adding that the data of the families getting support would also be shared with the other welfare organisations.\nThe governor also warned of strict measures against erring public if they did not stay at homes and violate the restrictions by the Punjab government and roam about the streets freely, adding that tough decisions would be taken by the government if people do not restrict their unnecessary mobility.\nCh Mohammad Sarwar said war against corona could not be won in streets but by staying at homes. “For God’s sake, stay at homes to avoid Italy- and France-like situation,” he urged people.\nThe governor also called upon the opposition parties to set aside their reservations and support the government in its fight against coronavirus pandemic.\nPhilanthropists, on the occasion, reaffirmed their commitment that no jobless would sleep without meal during the pandemic in the province, adding that free ration would be delivered at their door-steps by them.",
  "retrievedAt": "2025-08-11T19:00:54.705Z"
}
