{
  "title": "KP Govt approves Rs 11.40 bln package for vulnerable segments, to spend Rs 32 bln on coronavirus mitigation: Ajmal Wazir",
  "link": "https://www.app.com.pk/national/no-shortage-of-food-in-kp-1-9mn-families-to-benefit-from-cm-relief-package-ajmal-wazir/",
  "date_published": "2020-03-28T01:46:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 28 (APP):Adviser to Chief Minister Khyber Pakhtunkhwa for Information, Ajmal Khan Wazir here Saturday said that KP Government has approved Rs 11.40 billion mega relief package for poor, labourers and vulnerable segments of the society in the wake of coronavirus spread in the province.\nHe said that a total of Rs 32 billion would be spent on coronavirus relief and migrations programs in the province.\nIn a briefing on video link here, the CM Adviser for Information said the Chief Minister Khyber Pakhtunkhwa has announced Rs 11.40 billion mega relief package for poor, underprivileged and vulnerable segments that would benefit around 1.9 million household comprising 43pc population of KP.\nUnder this package, a financial relief worth Rs 5000 per month would be provided to each poor household for a period of three months which could be extended depending on the situation.\nWazir said Rs 3000 would be provided by Federal Government under Ehsaas Program and Rs 2000 by KP government to each poor family per month.\nThe KP Government has already released Rs 8 billion to health department for purchase of equipment and others essential services for hospitals besides Rs 6 billion to Relief and Resettlement Department KP for emergency services.\nTo give relief to business community, Ajmal Wazir said KP government has approved a waver off in provincial taxes amounting to Rs 5 billion.\nHe confirmed a death of a lady of Dir Lower district who expired at Hayatabad Medical Complex Peshawar due to coronavirus.\nWazir said coronavirus testing labs were being extended to all districts and these labs service would start function in DI Khan and Bannu shortly.\nA total of 180 coronavirus has been reported in KP so far besides 820 suspected cases and results of 345 were awaited, he said.\nAll necessary life saving kits and equipment have been dispatched to hospitals and others essential goods and equipment once received from NDMA would soon be dispatched to all districts hospitals of KP.\nHe categorically stated that there was no shortage of food and others essential commodities in the province and sufficient stock was available to fulfill food requirements of masses.\nAjmal Wazir said hoarding, price hiking and illegal profiteering would not be accepted and strict action would be taken against all such elements under the law.\nThe Chief Minister Mahmood Khan was personally monitoring all the relief, assistance, rehabilitation and treatment of patients related activities in the wake of coronavirus spread.\nWazir highly praised the services of Pakistan Army, Rescue-1122, District Administration and others national and Provincial departments during the present difficult situations, saying the challenge of coronavirus could be effectively tackled with cooperation of masses.\nHe appealed expatriates Pakistani arrived here to conduct their coronavirus test and also held an appeal to their families to phone on toll free numbers 1700 and 080001700 in case of their non cooperation.\nWazir said media persons would be included in CM KP relief package and urged management of media outlets to send names of such field workers, who performed duties on frontline for finanicial relief besides provision of life saving kits and necessary equipment to them.",
  "retrievedAt": "2025-08-11T19:00:50.481Z"
}
