{
  "title": "FM urges UNSC to play role in resolving Kashmir dispute",
  "link": "https://www.app.com.pk/national/191043-2/",
  "date_published": "2020-03-28T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):Foreign Minister Shah Mehmood Qureshi in his recent letter to the United Nations Security Council (UNSC) has demanded its role in resolving the Jammu and Kashmir dispute and ensure giving right of self-determination to Kashmiris under relevant resolutions.\nIn line with the government’s efforts to continuously highlight the dire human rights and humanitarian situation in the Indian Occupied Jammu and Kashmir (IOJ&K), the foreign minister addressed another letter to the President of the United Nations Security Council (UNSC) and the United Nations Secretary General (UNSG) on March 9, drawing attention to developments in IOJ&K as well as belligerent Indian rhetoric and aggressive actions on the ground.\nQureshi made clear that durable peace and stability in South Asia would remain contingent upon a just and lasting solution of the Jammu and Kashmir dispute.\nThe foreign minister has been regularly updating the UNSC President and the UNSG on the Indian actions in IOJ&K since August 5, 2019 that pose threat to peace and security in South Asia.\nShah Mehmood Qureshi in his letter rejected India’s false narrative of “normalcy” in IOJ&K, drew attention to the reprehensible remarks of the Indian Chief of Defence Staff about “deradicalization” camps for Kashmiri youth and highlighted intensified ceasefire violations by the Indian forces on Line of Control (LoC) since December 12, 2019.\nHe stressed the possibility of India staging a ‘false flag’ operation to divert international attention from the grave human rights and humanitarian situation in IOJ&K.\nThe foreign minister also highlighted irresponsible statements by the Indian leadership, including by the Indian Prime Minister, threatening the use of force against Pakistan.\nHe pointed India’s machinations seeking to change the demographic structure of IOJ&K.\nIn this regard, he drew attention to forcible confiscation of properties of Kashmiris and allocation of over 6,000 acres of land to non-Kashmiris in clear violation of international law, including the 4th Geneva Convention.\nThe foreign minister also underlined that the targeted killings of Muslims in New Delhi in February 2020 were directly attributable to the “majoritarian mindset” and supremacist and divisive “Hindutva” ideology.\nIn further follow-up of the foreign minister’s letter, Pakistan has been calling for immediate lifting of communication restrictions and unfettered access to medical and other essential supplies in IOJ&K in the wake of outbreak of coronavirus in the occupied territory.\nSimilar voices have been raised by human rights organizations and the civil society, particularly after the confirmed cases and a death in IOJ&K due to the Coronavirus.",
  "retrievedAt": "2025-08-11T19:00:46.595Z"
}
