{
  "title": "NCC decides to close Eastern, Western borders for two more weeks: Moeed Yusuf",
  "link": "https://www.app.com.pk/national/ncc-decides-to-close-eastern-western-borders-for-two-more-weeks-moeed-yusuf/",
  "date_published": "2020-03-28T10:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):Special Assistant to the Prime Minister on National Security Division (SAPM) Moeed Yusuf Saturday said the National Coordination Committee (NCC) had decided to close Eastern and Western borders both for trade and passenger traffic for two more weeks.\nAddressing a press conference along with Chairman National Disaster Management Authority (NDMA) Lieutenant General Muhammad Afzal and SAPM on Health Dr Zafar Mirza, he said the National Security Committee on March 14, had earlier decided to halt border traffic on Middle and Eastern borders of the country for two weeks.\n“The closure duration of two weeks of the borders has come to an end today and therefore NCC has decided to further extend the restriction for another two weeks. Both passenger traffic and trade has been stopped at the borders with Afghanistan, Iran and India which includes Kartarpur Corridor as well,” he added.\nThe SAPM informed the media that all the ports were functional where screening was continued with beefed up arrangements.\nHe added that the international flights to the country were banned till 4th of next month and there will also be prohibition for flights leaving the country for abroad from tomorrow.\nMooed Yusuf informed that the Pakistani passengers stranded at different international airports were brought back to Pakistan, while the remaining had received visas from the respective countries to further their stay.\n“Our last station in Thailand is also made clear where Pakistani passengers have been stuck for the last many days. The issue has been resolved and a Thai airline will bring back those passengers tonight,” he added.\nThe SAPM mentioned that the purpose of suspending the air space was to make preparations for avoiding major outbreak of coronavirus in the country once the air space was resumed.\nHe said the suspension would be lifted gradually, whereas in a case if any country wanted to arrange special flights for its citizens stranded in Pakistan, they would be facilitated on case to case basis.\nHe added the domestic flights were also suspended except the ones form Gilgit and Skardu.",
  "retrievedAt": "2025-08-11T19:00:46.579Z"
}
