{
  "article_id": "2025-05-07_aa1ea37c4217410d21aa0b4eec30a309",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/egypt-voices-concern-over-escalating-tensions-between-india-pakistan-urges-de-escalation-dialogue/",
    "retrieved_at": "2025-08-27T15:11:05.926Z"
  },
  "metadata": {
    "title": "Egypt voices concern over escalating tensions between India, Pakistan, urges de-escalation, dialogue",
    "author": null,
    "date_published": "2025-05-07T11:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 189,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 7 (APP): The Arab Republic of Egypt on Wednesday expressed deep concern over the recent escalation of hostilities between India and Pakistan, following reports of cross-border shelling that resulted in several casualties and injuries. In an official statement issued by the Ministry of Foreign Affairs, Cairo underscored the importance of pursuing all possible efforts to de-escalate the situation and avert further deterioration that could destabilize the South Asian region. \"Egypt is following with great concern the recent developments between India and Pakistan, which witnessed an exchange of fire resulting in a number of victims and injuries,\" the statement said. \"It is vital that both sides commit to de-escalation and avoid any steps that may aggravate the crisis.\" Egypt called on both New Delhi and Islamabad to exercise maximum restraint and prioritize diplomatic dialogue as the primary means of resolving tensions. The statement emphasized the need for peaceful solutions that reflect the aspirations of the peoples of both nations for peace, security, and stability. As a longstanding advocate for peace and conflict resolution, Egypt reiterated its commitment to supporting all efforts aimed at maintaining regional and international stability.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}