{
  "article_id": "2025-05-07_d10855e6293c2086c8411624e128db3f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/health-minister-declares-emergency-in-capitals-hospitals/",
    "retrieved_at": "2025-08-27T15:13:56.289Z"
  },
  "metadata": {
    "title": "Health Minister declares emergency in capital’s hospitals",
    "author": null,
    "date_published": "2025-05-07T13:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 229,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 07 (APP):Federal Minister for Health, Mustafa Kamal has declared a state of emergency across all public hospitals in the federal capital. Scheduled leaves for all hospital personnel have been suspended, and staff have been instructed to report to duty without delay. All doctors, nurses, paramedics, and administrative staff affiliated with the Federal Ministry of Health and its subordinate institutions have been ordered to remain on high alert. \"In light of the evolving situation, my top priority is to safeguard the health and well-being of our citizens,\" said Minister Kamal, who also confirmed the cancellation of his official visits to Geneva and Qatar. \"The current crisis requires my full attention at home.\" As part of the emergency response, the Ministry has established a 24/7 Emergency Quick Response Center at the Federal Health Institution. The center is tasked with assessing health-related threats arising from the conflict and coordinating a rapid and unified response across the country. The center will maintain constant communication with provincial and district health authorities to ensure coordinated action. Provincial Health Secretaries have been directed to keep close contact with the federal ministry and to update their emergency response strategies in alignment with federal protocols as the situation develops. Authorities have urged the public to remain calm and cooperate with health officials as emergency services are mobilized to meet the growing demands on the healthcare system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}