{
  "article_id": "2025-05-07_987b29381de690fabed67e1a39e395f1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/26-pakistanis-martyred-in-indian-attack-mohsin-naqvi-vows-response/",
    "retrieved_at": "2025-08-27T15:13:44.383Z"
  },
  "metadata": {
    "title": "26 Pakistanis martyred in Indian Attack: Mohsin Naqvi vows response",
    "author": null,
    "date_published": "2025-05-07T11:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 192,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 07 (APP): In a strongly worded statement shared on social media, Interior Minister Mohsin Naqvi condemned what he described as an \"unprovoked and brutal\" attack by India that reportedly claimed the lives of 26 innocent Pakistani civilians, including women and children. Naqvi's message has quickly sparked widespread public reaction and drawn attention both domestically and internationally. Expressing deep sorrow over the loss of civilian lives, Naqvi emphasized the emotional toll of the incident, stating, \"We mourn this heartbreaking loss-but let it be clear: every drop of their blood will be avenged.\" Calling the attack a test of Pakistan's resilience, he asserted the country's unity and strength in the face of tragedy, stating, \"Pakistan's spirit is unbreakable. Our morale is high, and our response will be resolute.\" He ended the statement with a declaration of national pride: \"Pakistan Zindabad\" (Long Live Pakistan), accompanied by the Pakistani flag emoji. The international community is closely monitoring the situation, with concerns rising over the possibility of further escalation between the two nuclear-armed neighbors. More details are awaited as investigations continue, and calls for restraint and dialogue are beginning to emerge from global diplomatic circles.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}