{
  "article_id": "2025-05-07_d889486a9f40f56bccffe27899d84fc6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/law-makers-slam-india-for-cowardly-attacks-on-pakistan/",
    "retrieved_at": "2025-08-27T15:13:00.644Z"
  },
  "metadata": {
    "title": "Law makers slam India for cowardly attacks on Pakistan",
    "author": null,
    "date_published": "2025-05-07T15:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 511,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 7 (APP): Federal Minister for Education and Professional Training Dr. Khalid Maqbool Siddiqui on Wednesday slammed India for its cowardly attacks, saying India made a \"historic mistake\" by attacking a nation ready to defend itself. Addressing the session of the National Assembly, he said, \"India doesn't realize which nation it has provoked. Our nation is awake and ready to respond.\" He lauded the resolute and effective response of the Pakistan Armed Forces and specially the Pakistan Air Force that thwarted the enemy's intentions. \"I salute our brave forces for protecting the country and giving a strong response,\" he said. \"India has turned into a terrorist and religiously extremist state,\" he said, adding that it had attacked mosques and civilian populations inside Pakistan on Tuesday night. Pakistan Tehreek-e-Insaf (PTI) Chairman Barrister Gohar Ali Khan said the entire nation standing together as one united voice in defense of country's sovereignty. He lauded the Pakistan's Armed Forces for making the defense of the homeland impregnable. Gohar condemned the cowardly attacks carried out by Indian forces last night, which targeted mosques and civilians. \"Our coward enemy will get a response that will be remembered for centuries,\" he added. He especially praised the Pakistan Air Force for downing Indian aircraft during the overnight confrontation. He reaffirmed Pakistan's right to defend itself and respond to aggression. Pakistan Tehreek-e-Insaf (PTI) leader Zartaj Gul condemning the cowardly Indian attack, said that our enemy carried out attacks under the cover of darkness, and targeted the civilians. She said that this was not an attack on any political party rather, this was an attack on Pakistan. She said, \"We must tell the world that India attacked our homeland. Pakistan reserves the right to respond.\" Zartaj Gul said that Pakistan has long been a victim of terrorism. Over 80,000 Pakistanis have lost their lives while fighting against terrorism. The country stands united behind its brave forces and lauded them for their befitting response to Indian cowardly attacks. Zartaj Gul called for calling an All Parties Conference (APC) for the national unity. Jamiat Ulema Islam-Fazl (JUI-F) lawmaker, Abdul Ghafoor Haidari strongly condemned last night's unprovoked attack by India, and called it an \"unpardonable crime\". He lauded country's braved armed forces for their swift and effective response, including the downing of Indian aircraft and drones. Haidari lauded the brave Armed Forces of Pakistan and warned India against further provocations. \"You started this misadventure; we reserve the right to retaliate,\" he said. He said Narendra Modi \"Butcher of Gujarat\" is a murderer and terrorist. Modi is creating problem for the peace of the region, he added. The JUI-F leader stressed the country's readiness to defend itself. \"We are a peace-loving nation, but if war is imposed, Islam teaches us to respond with determination and strength,\" he said. Haidiri said that Pakistan had demanded evidence from India regarding the Pahalgam attack, but none was provided. India continues to level baseless accusations without proof, he added. JUI-F lawmaker said party's workers are ready to render any kind of sacrifice for the defense of the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}