{
  "article_id": "2025-05-07_47b1ed9aed7b79c962169885eea9e0bd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gen-asim-a-man-of-steel-rafael-myth-debunked-says-abdullah-gul/",
    "retrieved_at": "2025-08-27T15:13:37.673Z"
  },
  "metadata": {
    "title": "Gen Asim a man of steel, Rafael myth debunked: says Abdullah Gul",
    "author": null,
    "date_published": "2025-05-07T13:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 426,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "RAWALPINDI, May 07 (APP):The recent escalating tensions between Pakistan and India have proved the mettle of Pakistan's defence forces while establishing the military superiority and debunking the myth of Rafael jets. Defence analyst, Abdullah Gul, has underscored Pakistan's shift from a purely defensive strategy to an offensive-defence posture, sending a clear message to its eastern neighbour. Speaking in an exclusive interview with APP on Wednesday, Gul highlighted Pakistan's robust military response to recent Indian aggression, stressing that the country's armed forces are fully capable of defending its sovereignty. Gul pointed to the events following the Pulwama incident in 2019, citing her mindset warfare. \"India's actions were based on a miscalculation that Pakistan will exhibit weakness\", he said, adding that Pakistan's swift and precise retaliation, including the downing of their jets and targeting military installations, destroyed that perception. \"Five Indian jets were shot down on their own soil, and nearly 50 critical checkposts were neutralized,\" he said, adding that Pakistan's response had not only dismantled India's operational readiness but also exposed her weakness. He rejected India's claims of military superiority, particularly regarding its much-touted Rafael jets. He highlighted that despite heavy investment in advanced weaponry, her forces lacked the necessary training and operational readiness. \"The Rafael jets were termed as game-changers, but they failed to deliver when required, resulting in severe setbacks for her defence industry\", he added. He observed that India would further lose on economic fronts, including in defence trade. He noted that the failure of Rafael jets has unveiled the poor replacement strategy of the Indian air force from Russian to French technology. Gul further highlighted the demoralization and lack of confidence among top Indian commanders. \"Even their generals admit they are not prepared to fight Pakistani forces, battle-hardened over decades,\" he said. Gul appreciated Pakistan's military leadership for being steadfast, with Chief of Army Staff General Asim Munir demonstrating unwavering commitment in the face of aggression. \"General Asim is a proven 'man of steel', he has done what he said to do in response to the enemy's aggression\", he added. Abdullah also lauded Pakistan's media strategy for timely countering Indian fake propaganda. \"Pakistani leaders and military spokespersons confidently presented their case, reinforcing the nation's narrative\", said Abdullah Gul. In contrast, Pakistan's national unity and resilience have only strengthened, with the public now more aware of India's propaganda tactics. Gul asserted that Pakistan's military achievements and strategic clarity have redefined the regional security paradigm. \"We have proven that our defence is impregnable, and any aggression will be met with an overwhelming response,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}