{
  "article_id": "2025-05-07_87fb99028ae15a80770028c78a7906e8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/eight-pakistani-civilians-killed-35-injured-in-indias-missiles-strikes-dg-ispr/",
    "retrieved_at": "2025-08-27T15:12:27.864Z"
  },
  "metadata": {
    "title": "Eight Pakistani civilians killed, 35 injured in India’s missiles strikes: DG ISPR",
    "author": null,
    "date_published": "2025-05-07T04:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 338,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 7 (APP):Eight Pakistani civilians were killed and 35 others were injured after India fired missiles at six locations inside Pakistan, military spokesman confirmed early Wednesday. Director General Inter Services Public Relations (ISPR) Major General Lt General Ahmed Sharif Chaudhry at a press conference said that India's missiles made 24 impacts inside Pakistan targeting civilian population. \"Eight Pakistanis have been martyred, 35 received injuries while two are still missing,\" he said. The Indian missiles hit the locations in Ahmed Pur Sharqia, Muzaffarabad, Kotli, Muridke, Sialkot and Shakargarh cities of Pakistan. The DG ISPR said four strikes at a mosque in Ahmed Pur Sharqia left five persons dead including a three-year-old girl child, two men and two women. Thirty-one persons including 25 men and six women received injuries. The attack destroyed the mosque and damaged the adjoining family quarters. In Muzaffarabad's, he said, the missile made six impacts and damaged the Bilal Mosque, where a girl child was injured. He said in Kolti, five strikes were carried out that left two dead including a 16-year-old girl and another 18-year-old girl, besides injuring their mother. The DG ISPR said in a missile strike at Muridke, a person was killed and another was injured. Two persons are missing. In Sialkot's northern village of Kotli Loharan, two strikes were carried out, of which one was misfired. The other missile hit an open field with no casualty reported. Two impacts were reported in Shakargarh with no loss of human life, while one dispensary was damaged. The DG ISPR said India's blatant aggression would be thwarted with full force. \"In response to the enemy's cowardly act, the Pakistani armed forces have given full response and are ready for further retaliation,\" he said. He mentioned that foreign media correspondents were taken to the Line of Control yesterday where they were given briefing about the ground situation amid India's lame accusations against Pakistan. He announced that national and International media would be taken today to all the places where India had targeted the civilian population.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}