{
  "article_id": "2025-05-07_59927e4dbaaabe53db68f470f0ba2e1b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/india-started-misadventure-pakistan-will-end-decisively-dr-tariq/",
    "retrieved_at": "2025-08-27T15:12:47.143Z"
  },
  "metadata": {
    "title": "India started misadventure, Pakistan will end decisively: Dr Tariq",
    "author": null,
    "date_published": "2025-05-07T18:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 429,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 7 (APP):Federal Minister for Parliamentary Affairs, Dr. Tariq Fazal Chaudhry on Wednesday said that India has started war or misadventure against Pakistan, but the whole Pakistani nation and valiant armed forces will end it decisively as our children were ready to sacrifice themselves for the motherland. Addressing a rally against Indian aggression and expressing solidarity with the Pakistan Army at Aabpara Chowk here, the minister termed seven shot down of Indian warplanes by Pakistan Army a historic moment for entire nation. He saluted the spirit of the whole nation which was visible, adding that Pakistani nation showed same spirit today like during the creation of Pakistan under the two-nation theory. \"Our dynamic leader, former prime minister Muhammad Nawaz Sharif made the country a nuclear power, that is why the enemy cannot look at us with a malicious eye,\" he emphasized and stating that this unity of the nation was the real strength of the Pakistan Army. The country would remain stronger under this national unity and strength. Dr Tariq stressed that Pahalgam incident occurred some 280 kilometers away from the border of Azad Jammu and Kashmir (AJK) and Indian blamed to Pakistan through false narrative which was exposed internationally. He unveiled that this incident was Modi's monstrous plan. Last night, the minister said that the enemy carried out a cowardly attack, and we taught them a lesson that will always remember. \"Our braves mothers and fathers advised their children that the bullet should not be shot in the back but in the chest that is why nobody can defeat us in battle field,\" he added. He said that the entire nation and political parties, civil and military leaders had played their role for the sanctity of this flag and will give a befitting reply to India. Pakistan Muslim League-Nawaz (PML-N) MNA, Raja Khurram Nawaz said that the whole nation united in difficult times and express solidarity with the country and the armed forces. He said that India imposed war by creating the drama of Pahalgam. \"Our media fought Indian propaganda vigorously and told India that their position was based on lies.\" Member of National Assembly Farah Naz said that Pakistan armed forces had defeated India on every front. Other speakers said that this spirit of patriotism is unparalleled, the entire nation was with the Pakistan Army and we will not hesitate to sacrifice our bodies, minds and money. They concluded that the sacrifices of the martyrs in the Indian attack will not go in vain, the armed forces were fully capable of defeating India on every front.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}