{
  "title": "4.4-magnitude earthquake hits KP’s Swat, surrounding areas - Pakistan - DAWN.COM",
  "author": null,
  "content": "A 4.4-magnitude earthquake struck Khyber Pakhtunkhwa’s Swat and its adjoining localities on Sunday afternoon, sending tremors across the area.\n\nPakistan falls on three major tectonic plates — the Arabian, Euro-Asian and Indian — according to geological engineer Muhammad Rehan, creating five seismic zones within the country.\n\nToday, a 4.4-magnitude earthquake jolted Swat and adjoining areas with a depth of 185 kilometres and epicentre in Hindukush, a private news channel reported, citing the National Seismic Monitoring Centre.\n\nPeople came out of their homes in panic and started reciting verses from the Holy Quran.\n\nNo loss of life or property was reported from any part of Swat, according to the report.\n\nOn April 19, tremors were felt in parts of KP and Punjab — including Peshawar, Islamabad, Rawalpindi and Lahore — for the second time in as many weeks as a 5.9-magnitude earthquake struck near the Afghanistan-Tajikistan border region.\n\nPakistan witnessed around 20 low-intensity earthquakes in the first half of February — an average of more than one tremor each day.\n\nHowever, experts have pointed out that such minor seismic activities “preempt” high-intensity earthquakes by constantly releasing accumulated energy within the tectonic plates.\n\nIn the Himalayan region, major seismic activity takes place on a roughly 100-year cycle, experts have said.\n\nThe last major seismic events in the region were the earthquakes of 2005 and 2015.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:37:50.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906927/44-magnitude-earthquake-hits-kps-swat-surrounding-areas",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T10:56:40.000Z"
}
