{
  "title": "Climate change fuels malaria spike in Pakistan: WHO - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The World Health Organization (WHO) and Pakistan’s Ministry of National Health Services have warned that climate change is worsening the impact of malaria across the country, where more than 2 million cases are reported annually.\n\nThe warning was issued on World Malaria Day, as both WHO and Pakistan called on all stakeholders to urgently intensify efforts to contain the growing threat to the country and the region.\n\n“Malaria is a major global threat, and we are seeing firsthand how climate change is increasing both the risk and the cases in our country,” said Federal Health Minister Syed Mustafa Kamal. “Despite challenges, Pakistan is fully committed to end this disease. It is not just a health imperative — it is an investment in a healthier, more equitable, safer, and more prosperous future for every nation.”\n\nUnder the international theme, “Reinvest, reimagine, reignite,” WHO urged all stakeholders to join the big push to end malaria and support Pakistan’s efforts so that the response is not undermined by a lack of resources.\n\nFloods and rising temperatures have been identified as major factors to the surge in cases, with a reported peak of 2.7 million cases in 2023\n\nThe catastrophic 2022 floods triggered 6.6 million additional cases over the 2022–2024 period — including a peak of 2.7 million cases in 2023, compared to 399,097 cases in 2021. As a result, the malaria burden in WHO’s Eastern Mediterranean Region surged to an estimated 10.2 million cases in 2023 — a 137 per cent increase compared to 2015.\n\nDespite the challenges, significant progress has been made over the past decade in prevention and treatment. In partnership with WHO and with support from the Global Fund to Fight AIDS, Tuberculosis and Malaria, Pakistan screened more than 11.4 million suspected cases in 2024 and treated 2 million confirmed malaria patients.\n\nAdditionally, 7.8m insecticide-treated nets were distributed in 22 high-burden districts, contributing to a reduction in cases from 2.7m in 2023 to 2m last year.\n\n“WHO is proud to partner with Pakistan to continue saving lives by preventing and treating malaria,” said Dr. Dapeng Luo, WHO Representative in Pakistan. “We have proven that investing in malaria response saves lives, but we are also seeing how climate change is hampering progress, posing a threat not only for Pakistan, but also for the region and the world. We know how to end malaria, and we can do it if all stakeholders invest and work together to reinforce the response and adapt to the new risks triggered by climate change.”\n\nAccording to data from 5,575 medical facilities across 80 endemic districts, climate change and related impacts such as rising temperatures and frequent flooding have led to an upward trend in malaria cases and heightened risk of outbreaks.\n\nOther contributing factors include increasing poverty, limited access to quality diagnostics and treatment, deteriorating security in Balochistan, tribal areas and Khyber Pakhtunkhwa, and health care access issues in Sindh.\n\nEvidence shows that malaria control efforts are effective, but sustained and coordinated action will be essential to mitigate the effects of climate change, save lives and secure a healthier future for Pakistan.\n\nPublished in Dawn, April 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:45:56.971Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906858/climate-change-fuels-malaria-spike-in-pakistan-who",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T01:24:37.000Z"
}
