{
  "title": "Pakistan looking to address US trade imbalance - Pakistan - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Finance Minister Muhammad Auran­gzeb said on Saturday that Pakistan is eager to strengthen its business relationship with the United States, while also seeking ways to address the existing trade imbalance between the two countries.\n\nSpeaking at a news briefing at the Pakistan Embassy in Washington, at the conclusion of his visit to attend the Spring Meetings of the International Monetary Fund (IMF) and the World Bank Group, Mr Aura­ngzeb disclosed that Pakistan has asked China to augment its existing currency swap line by an additional 10 billion yuan (approximately $1.4bn).\n\nPakistan currently mainta­ins a 30bn yuan swap line with China. “From our perspective, getting to 40bn renminbi would be good,” the minister said.\n\nExplaining Islamabad’s priorities, Mr Aurangzeb emphasised that addressing the trade imbalance with the US was more important for Pakistan than the Trump administration’s proposed tariffs. He noted that President Trump was determined to boost US exports to trading partners as part of his broader trade agenda.\n\nAurangzeb requests China to boost yuan swap line\n\nCurrently, Pakistan exports approximately $5.2bn worth of goods to the US, while imports from the United States stand at around $2bn, creating a surplus of about $3.2bn in Pakistan’s favour. “We are looking at the possibility of addressing this imbalance by importing more goods such as American cotton and soybean,” he said.\n\nThe minister added that following President Trump’s ann­ouncement of new tariffs, Pak­istan’s ambassador in Washing­ton contacted the United States Trade Representative (USTR) the very next day. “Now a delegation will come for formal talks. The date of the visit will be decided after I return to Islamabad,” he said.\n\nIndus Waters Treaty dispute\n\nAsked if Pakistan had sought the World Bank’s intervention after India suspended the Indus Waters Treaty last week, Mr Aurangzeb responded: “If required, we will come to it when it’s appropriate.”\n\nThe 1960 Indus Waters Treaty, brokered by the World Bank, governs the use of rivers shared by India and Pakistan and recognizes the Bank’s arbitral role in resolving disputes. So far, both nations have eng­aged with the World Bank to address differences under the treaty.\n\nMr Aurangzeb said Prime Minister Shehbaz Sharif and the federal cabinet have already deliberated on the issue and were prepared to move forward. “We condemn terrorism wherever it happens. We want good relations with all our neighbors but it takes two to tango,” he remarked.\n\nHe added that tensions between India and Pakistan were “a part of life” and stressed the need to “move with it and move on”.\n\nAsked about the potential economic fallout from the recent tensions following the killing of 26 people at a tourist site earlier this month, the minister acknowledged that it was “not going to be helpful.”\n\nDiplomatic sources told Dawn that due to the busy schedule of World Bank officials during the Spring Meetings, Pakistani diplomats could not immediately raise the issue. “We are also waiting for instructions from Islamabad to proceed,” the sources said.\n\nChina commitments, Panda Bond plans\n\nDuring his meetings in Washington, Mr Aurangzeb also engaged with Chinese officials, including Finance Minister Lan Fo’an, to seek extensions in Pakistan’s debt repayment schedules and additional financial support.\n\nHe confirmed that Pakistan has asked China to extend the repayment period for its guaranteed debt and to increase the existing $4.3bn currency swap arrangement, aiming to bolster Pakistan’s critically low foreign exchange reserves. “He was assured that China would roll over Pakistan’s $4bn cash deposit with the IMF,” officials said.\n\nDiscussions with China also included the rescheduling of debt owed to the Chinese Export-Import (Exim) Bank during the duration of Pakistan’s ongoing IMF programme. Pakistan is seeking to reschedule debt maturities until September 2027. Aurangzeb noted that a similar request had been made to China last year, but formal approval was still pending.\n\nPakistan has also made significant progress in preparations to issue its first “Panda Bond” — a bond issued on China’s domestic market, denominated in yuan. Talks with the Asian Infrastructure Investment Bank (AIIB) and the Asian Develop­ment Bank (ADB) for providing credit enhancements for the bond issue had been “constructive”, Mr Aurangzeb said.\n\n“We want to diversify our lending base and we have made some good progress around that — we are hoping that during this calendar year we can do an initial print,” he added.\n\nChina has been actively promoting currency swap arrangements with emerging economies like Argentina and Sri Lanka in recent years as part of its broader strategy to internationalize the yuan.\n\nProgress with IMF\n\nMr Aurangzeb said he also expects the IMF Executive Board to approve, in early May, the staff-level agreement for a new $1.3bn arrangement under a climate resilience loan programme, along with the first review of Pakistan’s ongoing $7bn bailout programme.\n\nApproval from the board would trigger the disbursement of a $1bn tranche under the programme, which Pakistan secured in 2024. The IMF programme has played a critical role in stabilising Pakistan’s fragile economy, providing much-needed external financing and boosting market confidence.\n\nPublished in Dawn, April 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:45:26.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906864/pakistan-looking-to-address-us-trade-imbalance",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T01:24:30.000Z"
}
