{
  "title": "Iran port blast death toll rises to 40 as fires continue blazing - World - DAWN.COM",
  "author": null,
  "content": "The death toll from a powerful explosion at Iran’s biggest port of Bandar Abbas has risen to at least 40, with more than 1,200 people injured, state media reported on Sunday, as firefighters worked to fully extinguish the fire.\n\nThe blast occurred on Saturday at Shahid Rajaee Port in southern Iran, near the Strait of Hormuz, through which a fifth of the world’s oil output passes.\n\nThe port’s customs office said in a statement carried by state television that the explosion probably resulted from a fire that broke out at the hazardous and chemical materials storage depot. A regional emergency official said several containers had exploded.\n\nThe New York Times quoted a person with ties to Iran’s Islamic Revolutionary Guard Corps, speaking on condition of anonymity to discuss security matters, as saying that what exploded was sodium perchlorate — a major ingredient in solid fuel for missiles.\n\nHowever, Iran’s defence ministry denied media reports that the blast may be linked to the mishandling of solid fuel used for missiles. A spokesperson for the ministry told state TV the reports were “aligned with enemy psyops”, saying that the blast-hit area did not contain any military cargo.\n\nEarlier, Red Crescent chief Pirhossein Koolivand, in a video shared on the government’s official website, gave on Sunday an updated toll of 28 people killed and more than 1,000 injured.\n\nLive footage on Sunday showed thick black smoke still visible at the scene. “The fire is under control but still not out,” a state TV correspondent reported from the site around 20 hours after the blast.\n\nThe explosion was so powerful that it was felt and heard about 50 kilometres away, the Fars news agency reported.\n\nSpeaking on Sunday at the scene, Interior Minister Eskandar Momeni said that “the situation has stabilised in the main areas” of the port.\n\nHe told state TV that workers had resumed loading containers and customs clearance.\n\nImages from Iranian news agency IRNA on Saturday showed rescuers and survivors walking along a wide boulevard carpeted with debris after the blast at Shahid Rajaee, more than 1,000km south of Tehran.\n\nFlames could be seen engulfing a truck trailer and blood stained the side of a crushed car, while a helicopter dropped water on massive black smoke clouds billowing from behind stacked shipping containers.\n\n“The shockwave was so strong that most of the port buildings were severely damaged,” Tasnim news agency reported.\n\nIran’s supreme leader Ayatollah Ali Khamenei ordered a thorough investigation to find the causes of the blast.\n\n“Security and judicial officials are obliged to thoroughly investigate, uncover any negligence or intent, and follow up in accordance with regulations,” Khamenei said in a message carried by state television.\n\nCiting local emergency services, state TV reported that hundreds of casualties “have been transferred to nearby medical centres”, while the provincial blood transfusion centre issued a call for donations.\n\nSaturday is the start of the working week in Iran, meaning the port would have been busy with employees.\n\nThree Chinese nationals were “lightly injured”, China’s state broadcaster CCTV reported, citing its Bandar Abbas consulate.\n\nIranian President Masoud Pezeshkian expressed sympathy for the victims of the deadly blast, adding he had “issued an order to investigate the situation and the causes”.\n\nState TV reported, “The president is heading to the region to review the latest situation regarding the explosion at Shahid Rajaee Port in Bandar Abbas.”\n\nThe United Arab Emirates expressed “solidarity with Iran” over the explosion and Saudi Arabia sent condolences.\n\nWith choking smoke and air pollution spreading throughout the area, all schools and offices in Bandar Abbas, the nearby capital of Hormozgan province, have been ordered closed on Sunday to allow authorities to focus on the emergency effort, state TV said.\n\nThe health ministry urged residents to avoid going outside “until further notice” and to use protective masks.\n\nAuthorities declared three days of public mourning across the province.\n\nThe state-owned National Iranian Oil Products Distribution Company said in a statement carried by local media that the explosion “has no connection” to its facilities, reporting no interruption to its work in Bandar Abbas.\n\nThe explosion came as Iranian and US delegations met in Oman for high-level talks on Tehran’s nuclear programme, with both sides reporting progress.\n\nWhile Iranian authorities so far appear to be treating the blast as an accident, it also comes against the backdrop of years of shadow war with regional foe Israel.\n\nAccording to The Washington Post, Israel in 2020 launched a cyberattack targeting the Shahid Rajaee Port.\n\nRussian President Vladimir Putin has ordered several planes to be sent to Iran to help deal with the aftermath of a blast at Iran’s port of Bandar Abbas, Russia’s emergency ministry said.\n\nPutin has expressed his condolences over the loss of life and offered to provide help to Iran dealing with the aftermath of a blast, the Kremlin said. It said Putin had conveyed “words of sincere sympathy and support to the families of the victims, as well as his wishes for a recovery to all those injured.”\n\nThe emergency ministry said a Beriev Be-200 amphibious aircraft specialising in firefighting, as well as an Ilyushin Il-76 military transport plane, would be sent to Iran to help out.\n\nAdditional info taken from Reuters.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/27211947ef83268.jpg",
  "retrievedAt": "2025-08-25T14:37:55.486Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906915/iran-port-blast-death-toll-rises-to-40-as-fires-continue-blazing",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T06:21:05.000Z"
}
