{
  "title": "Uncertainty over US-China talks add to confusion - Business - DAWN.COM",
  "author": null,
  "content": "ROME: US President Donald Trump asserted in an interview published on Friday that tariff negotiations were under way with China, but Beijing denied any talks were taking place, the latest in a series of conflicting signals over what progress was being made to de-escalate a trade war threatening to sap global growth.\n\nTrump told TIME magazine that talks were taking place and that Chinese President Xi Jinping had called him, an assertion he repeated to reporters as he was leaving the White House on Friday morning for Rome to attend the funeral of Pope Francis.\n\n“China and the US are NOT having any consultation or negotiation on #tariffs,” China shot back in a foreign ministry statement posted by the Chinese embassy in the US.\n\n“The US should stop creating confusion.”\n\nTrump, speaking to reporters aboard Air Force One later on Friday, said it would be a win if China would open up its markets for US products and that tariffs could make that happen.\n\n“Free up China. You know, let us go in and work China,” he said. “That would be great. That would be a big win, but I’m not even sure I’m going to ask for it because they don’t want it open.”\n\nOn Saturday, Chinese Foreign Minister Wang Yi said Beijing abides by international rules on US-imposed tariffs and would seek solidarity with other countries.\n\n“Certain countries adhere to their own priorities, engage in bullying pressure and coercive transactions, and provoke trade wars for no reason, exposing their extreme egoism,” Wang said on the sidelines of a regional meeting in Kazakhstan.\n\nThe back-and-forth adds to the substantial uncertainty surrounding Trump’s erratic tariff policy, not just around China, but also as it pertains to the dozens of countries scrambling to strike their own deals to ease the burden of the hefty import taxes he has unleashed since returning to the White House in January.\n\nHis team of negotiators was conducting what amounted to a lightning round of trade talks with foreign officials who had swarmed Washington this week for the spring meetings of the International Monetary Fund and World Bank Group.\n\nBut while Trump officials, including Treasury Secretary Scott Bessent, touted indications of swift progress, many of their counterparts were more circumspect. Finance chiefs at the IMF were heading home with renewed urgency to diminish the risks presented by the tariffs.\n\n“I’m walking away from these meetings with a clear sense of everything that is at stake and the risks that are there for jobs, for growth, for living standards all over the world,” Irish Finance Minister Paschal Donohoe said.\n\n“The meetings here... reminded me of why we need to leave no stone unturned in the next few weeks and months to see how we can reduce that uncertainty.”\n\nDe-escalation\n\nWhile clarity on whether deals are actually being struck to avoid the imposition of even steeper tariffs in early July, there were signs of some de-escalation.\n\nChina exempted some US imports from its steep tariffs as business groups said Beijing has allowed some US-made pharmaceuticals to enter the country without paying the 125 per cent duties that Beijing imposed earlier this month in response to Trump’s 145pc tariffs on Chinese imports.\n\nPublished in Dawn, April 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:45:29.159Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906835/uncertainty-over-us-china-talks-add-to-confusion",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T01:25:05.000Z"
}
