{
  "title": "Missing price labels on grocery items reveals lax enforcement of regulations in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Taking advantage of lax enforcement of regulatory laws regarding commodity prices, retailers across the city have been selling essential products without mandatory price labelling at far above government-notified prices in violation of existing laws.\n\nGenerally, commodities of everyday use, including wheat flour, pulses, and rice, fall under the purview of the Sindh Essential Commodities Act, 2022 and not labelling their notified prices is a violation of the Sales Tax Act, 1990.\n\nFor instance, Section 3(2)(a) of the Sales Tax Act, 1990, requires retailers, manufacturers, and importers to supply products mentioned in the Third Schedule (taxable supplies) with embossed retail prices, while retailers are also required to display a government issued price list to sell essential commodities as per the Sindh Essential Commodities Act, 2022.\n\nContrary to this, it seems the authorities have turned a blind eye to these violations, leaving consumers at the mercy of retailers.\n\nDawn visited a grocery store in Gizri where disregard for these laws was on display. Not only were the required product details and the official price list missing, but the store also lacked a point of sale.\n\nThe situation at a national-level megastore was no different. Despite the official price list being displayed, it was largely ignored.\n\nFor instance, chili powder, which was not supposed to exceed Rs613/kg, was sold in 400g, 200g, and 100g packs priced at Rs265, Rs135, and Rs69, respectively.\n\nSimilarly, Sela basmati rice, listed at Rs331, Rs310, and Rs294/kg on the price list, was sold at Rs325/kg in 1kg packs.\n\nMasoor pulse, which should have been sold at Rs273 or Rs263 per kg, was priced at Rs299/kg in 1kg packs.\n\nWhen asked about the discrepancies, a store official explained that they “are allowed to charge extra for the packaging”.\n\nA similar situation was observed at a store located in Defence Housing Authority.\n\nAlthough an official price list was present — listing masoor pulse at Rs275/kg for type-I and Rs263 for type-II — the product was sold in 500g packs for Rs175.\n\nA billing system was also in place, but the printed receipt noted “invoice number not available”.\n\nThe cashier at the store also admitted that customers do inquire about the missing embossed prices on products and the Federal Board of Revenue QR code on payment receipts.\n\nDawn spoke to shoppers in which an interesting insight surfaced: customers do not give much importance to the official price list or the missing price labels, not even to the FBR integrated invoicing.\n\n“I typically buy products based on shelf prices rather than an official list. If something seems off or the shelf price is missing, I take the issue to the management. If the response doesn’t satisfy me, I just drop the product,” a shopper said.\n\n“I don’t check whether the sale receipts include FBR QR code or invoice number.”\n\nAlthough, the commissioner of Karachi has been actively informing public through social media platforms about the actions taken against these violations, the issue remains unresolved with no visible improvement.\n\nPublished in Dawn, April 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:45:58.542Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906766/missing-price-labels-on-grocery-items-reveals-lax-enforcement-of-regulations-in-karachi",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T01:25:13.000Z"
}
