{
  "title": "Salient feature of Customs Duty",
  "author": null,
  "content": "ISLAMABAD, Jun 10 (APP):Following are the salient feature of the Customs Duty proposed by the government for FY 2025-26:\n.. Availability of cheaper industrial raw materials.\n.. Innovation, efficiency and productivity.\n.. New tariff slabs of 5%, 10% and 15% introduced.\n.. Existing tariff slabs of 3%, 11% and 16% abolished.\n.. 0% tariff slab, previously applicable on 2201 tariff lines, extended to further 916 PCT codes.\n.. CD reduced on goods falling under 2624 PCT codes.\nREDUCTION IN ADDITIONAL CUSTOMS DUTY (ACD) RATES:\n.. Reduced from 2% to 0% on Tariff slabs of 0%, 5% and 10%, consisting of 4,383 tariff lines, except 95 tariff lines chargeable to ACD @2%.\n..  Reduced from 4% to 2% on 518 tariff lines under tariff slab of 15%.\n..  Reduced from 6% to 4% on 2166 tariff lines under tariff slab of 20%.\n.. Reduced from 7% to 6% on 468 tariff lines under tariff slabs of above 20%.\n.. Regulatory duty on goods falling under 554 PCT codes removed.\n.. Rate of Regulatory duty reduced on goods falling under 595 PCT codes.\n.. Maximum rate of RD reduced from 90% to 50%.\n.. To streamline and reduce the cost of exemptions, 479 entries in Part-I, Part-III and Part-VII of Fifth Schedule deleted.\n.. Provision for establishment of Centralized Assessment Units (CAUs) and Centralized Examination Units (CEUs) for transparent, speedy and uniform assessments\n.. Provision for establishment of Digital Enforcement Units (DEUs) at key locations and to use technology to strengthen anti-smuggling operations.\n.. Cargo Tracking System (CTS) introduced for monitoring the movement of cargo. The system will identify the movement of smuggled/non-duty paid cargo through the use of technology while facilitating Bonafide cargo.\n.. Incentivizing pre-arrival clearance by allowing filing of Goods Declarations without advance payment of duties and taxes.\n.. To reduce litigation, the existing limit of Rs. 20,000/- for initiating contravention proceedings enhanced to Rs. 100,000/- subject to payment of recoverable amount.\n.. To reduce port congestion and dwell time, penalty introduced for unclaimed/uncleared cargo beyond specified time limit.\n.. Time period for adjudication of cases and filing of appeals before Appellate Tribunal rationalized.\n.. Directorate General of Intelligence and Investigation, Customs and Directorate General of Risk Management System merged and re-organized for effective intelligence gathering, targeted operations and advancement of RMS.\n.. A new Directorate General of Customs Auction has been created to streamline the auction of goods.\n.. A new Directorate General of Communications and Public Relations has been created for dissemination of Customs related information for trade facilitation and stakeholder engagement.\n.. Provision to hire services of technology specialists, auditors, accountants and goods evaluators on short-term contracts for specialized functions.\n.. Provision for establishment of Customs Command Fund introduced to incentivize anti-smuggling operations.\n.. De-minimis limit for courier/postal parcels reduced to PKR 500 to check misuse.\n.. Facility of scrapping and mutilation of goods at ports restricted to bonafide requests up to 10% of the cargo.\n.. Provision added to discourage attempts of belated claim of ownership of goods liable for confiscation by filing frivolous appeals before the appellate fora.\n.. Provisions has been added that a tampered chassis vehicle shall be presumed to be a smuggled vehicle, irrespective of its registration status with MRAs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:00:00.281Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/salient-feature-of-customs-duty/",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T15:24:00.000Z"
}
