{
  "title": "MWL distributes sacrificial meat of nearly 600 sheep to underprivileged families in Pakistan",
  "author": null,
  "content": "ISLAMABAD, June 10 (APP):Regional Director of the Muslim World League (MWL) in Pakistan, Saad bin Masud Al Harthi has spearheaded the distribution of meat of nearly 600 sacrificial sheep to underprivileged families across Islamabad, Rawalpindi, Chakri, Havelian, and Muzaffarabad in a significant gesture of Eid-ul-Azha.\nAl Harthi underscored that all MWL initiatives in Pakistan are conducted under the direct oversight of Secretary General Dr. Mohammed bin Abdulkarim Al Issa, reflecting the organization’s philosophy of compassionate outreach.\nHe said the Eid program is “a key element of the organization’s broader mission to ensure vulnerable communities can partake in the religious celebrations with dignity and joy.”\n“These distribution efforts reflect the Secretary General’s personal interest and dedication to uplifting underserved populations during the festive season,” Al Harthi added, highlighting the MWL’s commitment to humanitarian aid and social welfare.\nFounded in Makkah in 1962, the MWL is a major international Islamic NGO advancing moderate Islamic values, religious tolerance, and global welfare projects. Eid meat distributions – known as udhiyah – are central to the League’s ongoing humanitarian operations, especially benefiting impoverished and marginalized communities .\nThis year’s initiative reaffirms the organization’s pledge to ensure that even the most vulnerable can celebrate Eid-ul-Azha with dignity, nourishment, and the spirit of communal solidarity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:01:34.325Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/mwl-distributes-sacrificial-meat-of-nearly-600-sheep-to-underprivileged-families-in-pakistan/",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T13:22:00.000Z"
}
