{
  "title": "United States mobilizes $44m in new US-Pakistani diaspora investment",
  "link": "https://www.app.com.pk/national/united-states-mobilizes-44m-in-new-us-pakistani-diaspora-investment/",
  "date_published": "2023-09-09T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 09 (APP): The United States announced the mobilization of more than $40 million in new US-Pakistani diaspora investment at the United States Agency for International Development (USAID) ‘Invest in Pakistan’ conference here Saturday.\nFour diaspora partners concluded four new Memoranda of Understanding (MoUs) with the USAID valued at $44 million, increasing total diaspora commitments to nearly $200 million. The new investment commitments include SERVINZ Limited, $5 million for restoring livelihoods in flood-affected areas; Pakfoods LLC Group and NUST $9 million for technology; Jaxeri Investment Corporation $25 million for electric vehicle local manufacturing; and Global Semiconductors Group $5 million for training youth in semiconductor and chip design technology.\nAddressing the participants at the closing ceremony, US Ambassador to Pakistan Donald Blome highlighted the valuable contributions of the U.S.-Pakistani diaspora. “I want to congratulate our four diaspora partners, SERVINZ Limited, Pakfoods LLC Group, Jaxeri Investment Corporation, and Global Semiconductors Group, for signing these MOUs. You are helping unlock Pakistan’s investment potential. I look forward to seeing the benefits these partnerships will bring to the Pakistani economy and the Pakistani people,” the Ambassador said. “The three themes discussed at the conference today – Artificial Intelligence, electric vehicles, and semiconductor technology investments – are key to Pakistan’s economic growth and future prosperity,” he added.\nThe ‘Invest in Pakistan’ conference aimed to catalyze investment between U.S. investors and Pakistani companies. More than 300 participants attended, including US Ambassador Donald Blome, USAID Mission Director Kate Somvongsiri, Umar Saif, Minister IT, members of the US-Pakistani diaspora, and prominent Pakistani business leaders.\nToday’s conference is one in a series of diaspora-centered conferences. In the past 10 months, U.S. Mission Pakistan supported the mobilization of nearly $200 million in U.S.-Pakistani diaspora-led investments and contributions.",
  "retrievedAt": "2025-08-11T09:33:13.683Z"
}
