{
  "title": "Digitization of  taxation system to streamline economy: Minister",
  "link": "https://www.app.com.pk/national/digitization-of-taxation-system-to-streamline-economy-minister/",
  "date_published": "2023-09-09T18:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 09 (APP): Caretaker Federal Minister for Information Technology and Telecommunication Dr Umar Saif on Saturday said that the taxation system is being digitalized and that it will help in documenting the economy.\nAddressing a press conference, he said the Information Technology (IT) sector has emerged as a vital contributor to the nation’s economy.\nWith a growing focus on digitization, the taxation system is undergoing a significant digital transformation, which is poised to streamline economic documentation he added.\nHe said that the ongoing digitization efforts are expected to provide a substantial boost to the economy by creating a more transparent and documented financial landscape.\nThis he said initiative aligns with the government’s goal of transitioning towards a cashless economy.\nThe minister said Pakistan’s IT sector has already made substantial strides, with total earnings reaching a remarkable $2.6 billion.\nThese earnings, he said, are expected to increase further with the implementation of measures aimed at enhancing the IT industry’s contribution to the nation’s reserves.\nHe said IT training will be provided to approximately 200,000 young individuals.\nThe minister was of the view that this initiative seeks to empower the youth and make them an integral part of the global economy.\nIn addition to workforce development, measures are being taken to facilitate freelancers, with plans to provide services for up to five million individuals across the country he added.\nThis initiative, he said, aimed to boost economic growth by enabling freelancers to contribute billions of dollars to Pakistan’s economy.\nFurthermore, Pakistan is making strides in mobile phone manufacturing, which is expected to stimulate local industry and create job opportunities.",
  "retrievedAt": "2025-08-11T09:33:10.686Z"
}
