{
  "title": "Pakistan has world’s best army: governor",
  "link": "https://www.app.com.pk/national/pakistan-has-worlds-best-army-governor/",
  "date_published": "2020-01-12T00:58:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 12 (APP):Punjab Governor Chaudhry Mohammad Sarwar said on Sunday that Pakistan had one of the best armies in the world, and every inch of the motherland would be defended at any cost.\nIn his reaction to an anti-Pakistan statement here, he said the Indian army chief was hurling threats on Pakistan in a bid to divert world’s attention from the anarchy in his country.\nAny misadventure by India would be reciprocated in such a manner that the enemy would remember it for generations, he said and asserted that 220 million people of Pakistan were standing besides Pakistan Army and other security agencies and every Pakistani was always ready to render sacrifice in defence of frontiers of the motherland.\nThe Punjab governor said with the grace of God, Pakistan Army had full capability and courage to crush the enemy at any front.\nHe said the Indian controversial Citizenship Act had ignited flames in India, which frightened its rulers and its army, who in a bid to hoodwink their nation were spreading propaganda against Pakistan every day, and Indian Army Chief Manoj Mukund Naravane’s threats were also part of Indian government plan to befool its people.\nCh Sarwar said coward Indian Army, which imposed curfew in the occupied Kashmir for 161 days was scared by Kashmiris freedom movement, and it could never dare even think of any aggression against Pakistan. If it resorted to any such act, it would be reciprocated by Pakistan Army and Pakistani people in such a manner that it would be remembered by the upcoming Indian generations, as “we better know how to safeguard every inch of our country”, he added.\nRegarding expression of grave concerns by US Acting Assistant Secretary Alice G Wells over arrest of Kashmiris’ political leadership, suspension of internet services and other restrictions in occupied Kashmir, Ch Mohammad Sarwar said, “We from the day first are stressing United Nations Organisation (UNO) and other international institutions to play their role to stop Indian atrocities and settle down Kashmir issue so that durable peace in the region can be restored.”\nHe said as long as Indian aggression was continuing, regional peace, prosperity and development are impossible.",
  "retrievedAt": "2025-08-11T18:36:40.017Z"
}
