{
  "title": "Govt’s best policies raises investment by 78pc: Hammad",
  "link": "https://www.app.com.pk/national/govts-best-policies-raises-investment-by-78pc-hammad/",
  "date_published": "2020-01-11T23:39:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 12 (APP):Federal Minister for Economic Affairs, Hammad Azhar said on Sunday that well-conceived and viable economic policies of the government resulted in increase in investment by 78 per cent in Pakistan.\nTalking to media men here at Alhamra Hall, he said that despite all odds, the government took bold and difficult decisions in an effort to ensure economic stability in the country.\nHe mentioned that steps were also being taken to reduce electricity and gas tariffs which would prove to be a greater relief to the common man.\nFederal Minister said that the problem of price-hike would be resolved in coming months, asserting that value of rupee against US dollar was now stabilizing.\nPakistan had already forwarded its report to Financial Action Task Force (FATF) on January 8, 2020, and economic issues would hopefully be settled down this year, he maintained.\nHammad Azhar said that year 2019 was the year of economic stability, while the current year (2020) would be the year of progress and prosperity of the country. He opined that restructuring of country’s state-entities was needed to improve their performance.\nTo a question, he said that investment in Pakistan increased by 78 per cent; cirular debt was reduced and current account deficit was also narrowed down with the restoration and enhancement of investors’ confidence.\nHammad Azhar mentioned that PTI government inherited huge deficits from previous regime, while foreign exchange reserves were almost finished and the country was at verge of bankruptcy.\nTo another question, he said the depreciation in rupee value was the real cause of price-hike the common man facing today, and Pakistan would have been declared bankrupt, if the present government did not take tough but effective decisions, which now resulting in stability of rupee value as well as decreased the circular debt.\nHe said that government was working day and night on improvement in policy-making and provinces were expected to generate increased revenues, and keeping all the economic indicators of the country, it could be said that year 2020 would be the year of development and prosperity.",
  "retrievedAt": "2025-08-11T18:36:44.147Z"
}
