{
  "title": "Speaker NA Asad Qaiser opens Swabi Sports Gala",
  "link": "https://www.app.com.pk/national/speaker-na-asad-qaiser-opens-swabi-sports-gala/",
  "date_published": "2020-01-11T23:02:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 12 (APP):The Speaker National Assembly Asad Qaiser Sunday congratulated Deputy Commissioner, officials of the District Administration, District Sports Officer Swabi and Directorate of Sports Khyber Pakhtunkhwa for organizing the spectacular sports Gala, saying that sports are a guarantee of physical and mental strength for the youth.\nHe said this while addressing the opening ceremony of the Swabi Sports Gala at Bamkhel Sports Complex, Swabi wherein members of the National and Provincial Assembly, officials, players and large number of spectators were also present.\nHe said such sports gala are very important activities for our young generation. He said that such positive activities promote sports among the youth. The cricket stars of Swabi district have celebrated their stunning performances at national and international levels despite having no sports facilities and made the nation proud.\n“Our district is very fertile in sports,” he said, adding, “Involving of youth in healthy sports activities would help Pakistan to become among leading countries of the world as the youth are our future and they are actually the future builders of the nation.”\nHe also announced cash prizes for the leading position holders in the Swabi Sports Gala and appreciated Tariq Khan, District Sports Officer, for his dedication and commitment toward holding of such activities time to time.\nSpeaking National Assembly Asad Qaiser also announced Rs. 1.5 million for the improvement of Swabi Sports Complex. Speaker National Assembly said that no compromise would be made in the developmental work and termed the Year-2020 as the year of development.\nHe said grounds are going to be developed under 1000 govt playing field development project at Tehsil level and each Tehsil of the Khyber Pakhtunkhwa would get its due share as far as development of 1000 grounds facilities at Tehsil and Union Council levels are concerned.\nHe said we want our youth should play so they could be mentally and physical strong. The govt he said are more focus on ensuring facilities to the youth. He said steps have been taken to ensure best healthcare facilities in Swabi District so that no the patients here do not need to go to Peshawar or any other major city for treatment.\nLater, the Speaker of the National Assembly Asad Qaiser formally opened Rescue 1122 Office in Shah Mansur District Swabi at a cost of Rs. 58.848 million. He said that the government is working day and night to fulfill all its electoral promises.\nThe Speaker NA Asad Qaiser also announced Rs. 50,000 for the players of Karate for the excellent demonstration during the opening ceremony. MNA Aqib Ullah Khan was also present during the inauguration ceremony.",
  "retrievedAt": "2025-08-11T18:36:45.404Z"
}
