{
  "title": "Bizenjo approves recruitment on 5,210 vacant posts",
  "link": "https://www.app.com.pk/national/bizenjo-approves-recruitment-on-5210-vacant-posts/",
  "date_published": "2022-01-27T09:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP): Chief Minister Balochistan Abdul Quddus Bizenjo accorded approval for recruitment against 5,210 vacant posts in various departments in a bid to provide job opportunities on merit to unemployed youth was promised by the incumbent government.\nUnder the vision of Chief Minister Abdul Quddus Bizenjo of providing maximum job opportunities to the youth of the province, the government has announced to fulfill multiple vacant posts on merit in a short period of time.\nAccording to an official handout, the work had been completed to fill up 536 vacant seats in the education and health departments of Balochistan through the public service commission to ensure the best healthcare facilities in the remote areas of the province.\nA number of 1706 vacancies have been advertised in police and counter-terrorism department to meet the security challenges as well as secure the lives and public properties of the masses.\nAround hundreds of people would be appointed in Balochistan Levies Force which is responsible for maintaining law and order in the rural areas of 30 districts of the province on modern lines.\nThe filling of 804 vacant posts in the Services and General Administration Department will also increase public trust in the government. The chief minister has also given the approval to appoint DSPs through Balochistan Public Service Commission.\nThe government has also created multiple posts including 407 jobs in primary health, 321 in agriculture, 191 in communication, 171 in local government, 321 in irrigation, 92 in PHE and culture departments to provide jobs to youth.\nThe government has allocated special seats for persons with disabilities and minority communities.",
  "retrievedAt": "2025-08-11T14:11:36.847Z"
}
