{
  "title": "Observance of India’s Republic Day as black day a silent verdict against Indian rule: Speakers",
  "link": "https://www.app.com.pk/national/observance-of-indias-republic-day-as-black-day-a-silent-verdict-against-indian-rule-speakers/",
  "date_published": "2022-01-27T08:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Speakers at a seminar said that by observing India’s republic day as a black day, the people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) have yet again given their verdict which serves as a silent referendum against India’s illegal and forcible occupation of their motherland.\nThe speakers made these remarks while addressing a seminar, titled ““India! Blood Strained and tainted Democracy”, organized by Kashmir Institute of International Relations (KIIR).\nThe seminar was held in connection with Kashmir black day being observed annually by Kashmiris on both sides of the line of control and the world over as a mark of their resentment against India’s unlawful rule over the territory.\nBesides Federal Minister Ali Muhammad Khan, the seminar was attended and addressed by Senator Raja Muhammad Zaffar-ul-haq, Former president AJK Sardar Muhammad Yaqoob Khan, President PPP AJK Ch. Muhammad Yasin, former Ameer JI AJK Abdul Rashid Turabi, PTI AJK information Secretary Ershad Mahmud, Mrs. Gazala Habib President Friends of Kashmir, APHC leaders Syed Yousaf Naseem, Syed Faiz Naqashbandi, Mrs Shamim Shawl, Abdul Majeed Mir, Abdul Hameed Lone and others. Whereas the KIIR chairman Altaf Hussain Wani was present on the occasion and imitated the discussion.\nVoicing their grave concerns over the rising incidents of state sponsored terrorism in occupied territory they said the India’s racist regime whose hands were soaked with blood of innocent Kashmiris have no justification to celebrate republic day.\n“The fascist country, which is responsible for the ruthless killing of hundreds and thousands of innocent civilians, forced disappearances, extra-judicial killings and massive human rights violations in Kashmir, has no moral reason to celebrate the day”, the speakers said adding that India, under the Modi’s authoritarian regime, was fast turning into fascist state where there was no place for the political dissent.\nReminding world community particularly the United Nations of its legal and moral responsibilities towards the settlement of Kashmir dispute, they said that it was unfortunate that the world remained blithely unconcerned over the plight of Kashmiris whose fundamental political and democratic rights were being trampled down by the Indian forces under their jackboots.\nDenouncing the Modi’s government’s repressive policies towards Kashmir and the Kashmiris, they said that it was high time that the international community realizes the deepening crisis in the region and take effective measures to hold the Indian government accountable for the crimes its forces have been committing against Kashmir.\nTerming India’s belligerent occupation as an existential threat to Kashmiris, they said that the racist regime was hell bent upon erasing the political, cultural, and religious identity of Kashmiris through Machiavellian machinations.\nSpeaking on the occasion the federal minister while reiterating his country’s principled stand on the issue of Kashmir said that the government would continue its political, moral and diplomatic support to their brethren in Kashmir to achieve their cherished goal of freedom from Indian occupation.\nSenator Zaffar-ul-Haq while appreciating the sacrifices, resilience and perseverance of the Kashmiri nation expressed the hope that the day was not far when people of Kashmir would be free from the Indian bondage.\nReferring to Pakistan’s commitment to the Kashmir cause, the PML-N leader said that every Pakistani regardless of his/her political affiliation stands shoulder to shoulder with Kashmiris in their just struggle for right to self-determination. “There is absolute unanimity on the issue of Kashmir amongst all the political stakeholders”, Haq said.\nThe PML-N stalwart, secretary General World Muslim Congress (WMC) on the occasion announced that his party in collaboration with the KIIR would soon convene a national level as well as an international conference on Kashmir.",
  "retrievedAt": "2025-08-11T14:11:36.679Z"
}
