{
  "title": "COVID-19 claims 25 more lives, 7500 new cases reported",
  "link": "https://www.app.com.pk/national/covid-19-claims-25-more-lives-7500-new-cases-reported/",
  "date_published": "2022-01-27T10:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP): The national tally of total active COVID-19 cases recorded 91,854 on Thursday with 7,539 more people tested positive for the deadly virus while 25 more people died from the disease during the last 24 hours.\nAll 25 corona patients died in the hospitals during past 24 hours, while 10 patients among them were on ventilator, according to the latest update issued by the National command and Operation Centre (NCOC). During the last 24 hours, most of the deaths occurred in Sindh followed by Punjab.\nThe maximum ventilators were occupied in four major areas including Peshawar 11 percent, Faisalabad 08 percent, Islamabad 21 percent and Lahore 09 percent. The maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) were also occupied in four major areas including Lahore 20 percent, Karachi 20 percent, Peshawar 14 percent and Islamabad 24 percent.\nAround 94 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB), Balochistan and AJK. Some 63,272 tests were conducted across the country on Wednesday including 14,619 in Sindh, 26,242 in Punjab, 11,119 in Khyber Pakhtunkhwa (KP), 7,665 in Islamabad Capital Territory (ICT), 822 in Balochistan, 431 in GB, and 2,374 in AJK.\nAround 1,272,871 people have recovered from the disease so far across Pakistan making it a significant count. Since the pandemic outbreak, a total of 1,393,887 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 36,082, Balochistan 34,131, GB 10,557, ICT 12,2098, KP 187,983, Punjab 469,540 and Sindh 533,496.  About 29,162 deaths were recorded in country since the eruption of the contagion.\nAround 7,765 have perished in Sindh out of which 12 were died in hospital on Wednesday. However, 13,126 had died in Punjab so far, with 07 deaths occured in past 24 hours in the hospital.\nAround 5,986 in KP where 06 of them died in hospital on Wednesday, 979 in ICT, Balochistan 367, GB 187, AJK 752. A total of 24,754,277 corona tests have been conducted so far, while 640 hospitals were equipped with COVID facilities. Some 1395 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T14:11:51.079Z"
}
