{
  "title": "MoL&J rejects SCBAP press release",
  "link": "https://www.app.com.pk/national/molj-rejects-scbap-press-release/",
  "date_published": "2022-01-27T17:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):The Ministry of Law and Justice and the Federal Government of Pakistan on Thursday vehemently rejected the press release issued by the Supreme Court Bar Association of Pakistan (SCBAP).\nThe Law Ministry in its press release stated that it was absolutely incorrect to suggest that lawyers, Bar Associations and Bar Councils were not consulted. Vide two letters bearing References Nos. 4(88)/2018-LR dated 03.12.2021 and F.No.4(88)/2018-LR dated 16.12.2021 the complete Criminal Reforms document was sent out to the Pakistan Bar Council, all the Provincial Bar Councils, the Supreme Court Bar Association and all the High Court Bar Associations of the country and were requested to give their input.\nHowever, none till date has given any input, which as per an elementary principle of law implies that they have nothing to add and they are happy with Criminal Reforms document. Therefore, to say that lawyers, Bar Associations and Bar Councils have not been consulted was totally misleading. No infirmity in the Criminal Reforms had been pointed out in the so-called Press Release of the Supreme Court Bar Association of Pakistan.\nWithout commenting on the Supreme Court Bar Association of Pakistan and its role, the Ministry of Law and Justice and the Federal Government were of the considered view that Lawyers’ community of Pakistan expressed gratitude to the Federal Minister for Law and Justice, Dr. Barrister Farogh Naseem for proposing extensive reforms in the Criminal Justice System for the first time in the last more than seven decades since the inception of Pakistan.\nThis has been a genuine and sincere effort on part the Federal Law Minister.Pakistan Penal Code was as old as 1860, whereas our Code of Criminal Procedure dates back to 1898. Both Codes contain archaic substantive and procedural provisions, which have been adroitly altered through the amendments proposed by the Federal Law Minister, Dr. Farogh Naseem. His proposed Reforms would revamp the Criminal Justice System if they were implemented effectively and honestly.\nThe proposed Reforms were focused on quick and easy access to justice for vulnerable segments of the society including women and children. Those who were opposing these Reforms were not sincere with people of Pakistan, in particular the weaker segments of the society. These so-called critics were either inept or not honest with their own country rather they were favouring the forces of status quo by desiring the existing ineffective system of Criminal Justice to continue in its current shape; where they can easily manipulate the litigants and their cases.\nSuch attempt on their part was no service to common man of Pakistan.The proposed Reforms would address injustices to all the segments of the society and would provide expeditious relief to the common man, The Reforms would ensure equal access to justice, irrespective of the social or class disparities.\nThe Supreme Court Bar Association had also stated that the Parliamentary Committee on Law and Justice had not been consulted on the said Criminal Reforms “which was highly condemnable”. For those of us, who have the slightest knowledge or acumen would know that the Criminal Law Reforms should be introduced first in the Parliament, whereafter there should be debated before the Parliamentary Committees of Law and Justice, both in the National Assembly and the Senate.\nPresently, no occasion arose for consultation with any Parliamentary Committee. With regard to the President of the Supreme Court Bar Association’s letter and statement one may only contend that ‘ignorance is bliss’.",
  "retrievedAt": "2025-08-11T14:11:40.163Z"
}
