{
  "article_id": "2025-09-07_5bb8b696d012dbc52197514505ec860a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-provincial-govts-united-to-promote-education-pm/",
    "retrieved_at": "2025-09-19T16:22:32.412Z"
  },
  "metadata": {
    "title": "Federal, provincial govts united to promote education: PM",
    "author": null,
    "date_published": "2025-09-07T22:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 380,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 07 (APP): Prime Minister Muhammad Shehbaz Sharif said the federal and provincial governments were united to promote education and increase the literacy rate. In a message on International Literacy Day observed on September 8, he said, \"The main objective of the national literacy campaign is that every child should not only receive basic education but also be familiar with higher education, skills and technical knowledge as this is the only way to prepare generations of the nation for the requirements of the modern era.\" He said, \"Today, on International Literacy Day, Pakistan considers it its duty to stand in solidarity with the world and highlight the importance of knowledge and education in the economic and social life of nations and its fundamental role in development and prosperity.\" \"Education is not just the ability to read and write or familiarity with the alphabet, but it is a journey towards a bright future by strengthening the foundations of any nation at the individual and collective levels,\" he continued. He said, \"This journey of education, training, literacy and knowledge is a continuous effort to improve the generations of any nation. Therefore, it should be the main priority of the government for the overall and meaningful development of any country.\" The prime minister said, \"The literacy rate in Pakistan is 60 percent, which is not only lower than the modern requirements of the world but also lower than other countries in South Asia.\" \"This worrying situation reminds us that we as a nation need to take all possible steps to make education a priority. So that we can pave the way for the collective development of our children, youth and society,\" he stressed. He said, \"The importance of education is one of the basic teachings of Islam and its significance was also highlighted by the founder of Pakistan, Muhammad Ali Jinnah.\" He said, \"No government can achieve this national goal without the support of the people, for which teachers, parents, and every citizen at the social level will have to play their duty and key role.\" \"Let us together today reaffirm our resolve that as a nation, we will illuminate the darkness of illiteracy with the light of knowledge and lay the foundation for a strong, talented, and developed Pakistan,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}