{
  "article_id": "2025-09-07_55fd51f4e5de88996652fe387a0b292c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/capital-police-issues-rain-safety-advisory-for-citizens/",
    "retrieved_at": "2025-09-19T16:23:21.726Z"
  },
  "metadata": {
    "title": "Capital Police Issues Rain Safety Advisory for Citizens",
    "author": null,
    "date_published": "2025-09-07T13:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 212,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 07 (APP): Islamabad Capital Territory (ICT) Police on Sunday issued a safety advisory for citizens after the National Disaster Management Authority (NDMA) sounded a red alert warning of possible urban flooding in Islamabad and northern Punjab in the coming hours and days due to heavy rains. An official told APP that the NDMA forecast cautioned that torrential rainfall could hit these areas within the next two to six hours and continue in the coming days, urging residents to remain vigilant and avoid unnecessary travel during peak rainfall. In line with the advisory, ICT Police instructed citizens to: Avoid unnecessary outdoor movement during heavy rains. Stay away from electricity poles, wires, and possible short circuits. Keep a safe distance from waterlogged streets, nullahs, and hilly areas. Ensure children do not play in accumulated rainwater. Immediately call Pukaar-15 in case of any emergency. Chief Traffic Officer (CTO) Captain (retd) Hamzah Humayun said that Islamabad Traffic Police is fully alert and actively monitoring the situation to ensure public convenience and safety. \"We urge citizens to cooperate with police instructions and plan their travel with caution during the rains,\" he added. The official said that ICT Police, in coordination with civic and disaster management authorities, will continue round-the-clock monitoring to protect lives and property.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}