{
  "article_id": "2025-09-07_bf47bcf7f9d8ce4c264d7e79884289e3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-air-force-solemnly-observes-martyrs-day-across-all-bases/",
    "retrieved_at": "2025-09-19T16:23:35.358Z"
  },
  "metadata": {
    "title": "Pakistan Air Force solemnly observes Martyrs’ Day across all bases",
    "author": null,
    "date_published": "2025-09-07T10:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 374,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 07 (APP):Pakistan Air Force solemnly observed Martyrs' Day on 7th September across all PAF Bases nationwide. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/09/paf.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume. The day commenced with special prayers and Quran Khawani, dedicated to the martyrs of the 1965 and 1971 wars, as well as to all those who have rendered the ultimate sacrifice in the line of duty since the creation of Pakistan. At Air Headquarters Islamabad, a central Martyrs' Day Ceremony was held, where Air Chief Marshal Zaheer Ahmed Baber Sidhu, Chief of the Air Staff, Pakistan Air Force, graced the occasion as the Chief Guest, said a press release issued by Inter Services Public Relations (ISPR). In his address, the Air Chief underscored the proud legacy of sacrifice, courage and professionalism that defines the PAF. He emphasized that Martyrs' Day symbolizes the extraordinary bravery, impeccable professionalism and unparalleled spirit of sacrifice demonstrated by the Armed Forces of Pakistan. He further added that well-cognizant of the fast-changing security dynamics, Pakistan Air Force stands committed to its mission with singularity of purpose. The latest link in chain of victories secured by PAF in Marka-e-Haq / Bunyan-um-Marsoos has once more proved our will and capability to guard the aerial frontiers of our motherland. Paying homage to the fallen heroes of PAF, the Air Chief said, \"We owe our heroes an eternal debt of gratitude for their supreme sacrifices, which serve as an enduring example for future generations. On this solemn occasion, we pay heartfelt tribute to those who laid down their lives in defence of our motherland.\" He further expressed unwavering solidarity with the people of Indian Illegally Occupied Jammu and Kashmir in their legitimate and indigenous struggle for the right to self-determination. The Air Chief reiterated his firm resolve to make every possible effort for the progress and prosperity of Pakistan in the evolving global environment. He affirmed that Pakistan Air Force would remain committed to advancing its capabilities in space, electronic warfare, cyber technologies, niche domains and indigenous defence production to safeguard the sovereignty and territorial integrity of the nation. Later, to pay homage to the martyrs, Chief of the Air Staff laid a floral wreath at the Martyrs' Monument and offered Fateha for the departed souls.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}