{
  "article_id": "2025-09-07_4e901ab266e6d57b3c3ed9cbb64e90b8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/jab-valleys-hazara-waterfalls-set-to-shine-as-eco-tourism-hub-with-uk-backed-project/",
    "retrieved_at": "2025-09-19T16:23:26.211Z"
  },
  "metadata": {
    "title": "Jab Valley’s Hazara Waterfalls set to shine as eco-tourism hub with UK-backed project",
    "author": null,
    "date_published": "2025-09-07T11:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 415,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 07 (APP):Work has started at the Hazara Waterfalls in Jab Valley, Haripur, under a UK-funded eco-tourism project. The plan aims to turn this hidden natural site into a major tourist attraction for Khyber Pakhtunkhwa and connect it with the cultural heritage of Bhamala, creating a new tourism route near Islamabad. The project is supported by the UK Foreign, Commonwealth & Development Office (FCDO) through WWF-Pakistan's Water Resource Accountability Project (WRAP). An initial amount of Rs5 million has been given for the first phase, which includes building a safe walking path to the waterfalls and a small tourist hut. At present, visitors use a dangerous track made by locals for carrying firewood. The new path is expected to be finished by mid-October 2025. The Hazara Waterfalls have eight big cascades, with the tallest almost 400 feet high, making it the largest waterfall system in Khyber Pakhtunkhwa. The site is just two hours from Islamabad, which makes it an easy and attractive spot for visitors. The waterfalls flow into the Haro River, which passes through Bhamala before falling into Khanpur Dam. The site is only 45 minutes (27 km) from the dam and can be linked to a wider tourism circuit. Bhamala is famous for the Bhamala Stupa, a 1,700-year-old Buddhist monument found in 2017, which is considered one of the most important Gandhara discoveries in Pakistan. Together, the waterfalls and the heritage make Jab Valley a rare mix of nature and history. The Khyber Pakhtunkhwa Tourism Department welcomed the project, saying it would add new destinations for visitors and also protect the fragile environment of Jab Valley. Hassan Nisar, Founder and CEO of Metrix Pakistan, who discovered the waterfalls in 2021, told APP that the new investment is \"a breakthrough that will turn Jab Valley into the next big tourist destination of Pakistan.\" He said the project would create jobs for local youth, bring income for shopkeepers, guides and drivers, and give local communities an alternative to cutting firewood by protecting their environment instead. Tourism experts say Jab Valley can become a good alternative to crowded places like Naran, Kaghan and Swat. With proper planning, they believe, it could soon be one of Pakistan's top destinations. WWF-Pakistan said protecting the environment is central to the project. If successful, the model could be used for other hidden natural sites in Khyber Pakhtunkhwa. With construction now started and the first facilities due within weeks, Jab Valley is on its way to becoming a recognised eco-tourism hotspot.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}