{
  "title": "PM urged to hold National Plantation Day for nature conservation",
  "link": "https://www.app.com.pk/national/pm-urged-to-hold-national-plantation-day-for-nature-conservation/",
  "date_published": "2023-07-21T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): Chairperson, Subh-e-Nau and environmentalist, Shahida Kausar Farooq have urged the Prime Minister to declare a National Plantation Day for a nationwide campaign dedicated to planting maximum for a green and nature-friendly Pakistan.\nThe organization chair had written a letter to the Prime Minister requesting him to declare a special plantation day with a focus on diverting the attention of the nation towards protecting and enhancing the green cover in the surroundings that would help in combating heatwaves and global warming.\nIn the letter, the Chairperson said, “We appreciate the measures taken by the government with hope towards a better today and tomorrow. Pakistan faces dangers such as climate change impacts, much due to increased deforestation, loss of air and water quality that result into an enhanced disease burden, the social and energy costs on the citizens is immense.”\nShe underscored that the poor and the marginalized were the most vulnerable due to climate change due to the unfair distribution of natural resources. However, it was imperative for the government to ensure its policies cater to the needs of all those who were neglected or left behind for inclusive development, she added.\nFarooq demanded the government introduce special incentives for both public and private institutions and enterprises on planting trees to limit the expanding concrete jungles in the urban centers of the country.\n“We have a government-issued day known as the “National Plantation Day”, which can be declared on August 12th, 2023. This effort can be used to mobilize communities for the cause of plantation as a communal, national, and global cause.\nUrban forestry must also be fostered. We must declare this day and implement in letter and spirit by involving our citizens in planting trees and preserving them,” she said in her letter to the Prime Minister.\nThe Subh-e-Nau Chairperson underscored that along with the “National Plantation Day,” the promotion of indigenous species of plants should be part and parcel of all plantation campaigns across the country.\nMoreover, a proper allocation for scientific expertise involving identification, growth, and preservation of such species should also be ensured, she added.\nExperts in agriculture, local ecology, and botanists should be involved in the plantation of such species, such that funds were not wasted on exotic or geographically misplaced trees, she said.\n“Dealing with issues such as climate change crisis will require a serious investment in the protection of our natural resources, especially when agricultural productivity and industry are taken as key growth sectors”\n“Declaring and implementing the “National Day of Plantation” and involving the public will move our nation in a positive direction towards resolving issues such as environmental degradation, poverty, and climate change,” she added.",
  "retrievedAt": "2025-08-11T08:58:02.402Z"
}
