{
  "title": "Dr. Qibla praises China’s model of religious freedom, inclusivity",
  "link": "https://www.app.com.pk/national/dr-qibla-praises-chinas-model-of-religious-freedom-inclusivity/",
  "date_published": "2023-07-21T15:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): Council of Islamic Ideology (CII) Chairman Dr. Qibla Ayaz on Friday lauded China’s commitment to religious freedom and inclusivity, dispelling any negative impressions of interfaith disharmony in the country.\nHe, in an exclusive interview with APP, highlighted that China ensures the protection of legal rights for minority communities, including Muslims, without any discrimination or bias.\nSharing his recent personal experience, Dr. Qibla Ayaz revealed that he had visited various regions of China alongside a delegation of prominent religious scholars and leaders. They were invited by the Chinese foreign affairs ministry to assess the state of religious pluralism in the nation.\nThe chairman expressed that he was impressed to witness a country where people from all segments of society enjoy equal rights and have the freedom to practice their religious rituals without hindrance.\nDuring this trip, Dr. Qibla observed that minority communities in China joyously celebrated their religious festivals and other social and cultural events, alongside the majority population.\nThe Chinese government played an active role in supporting and promoting these religious and cultural activities, extending all possible assistance, he maintained.\nDr. Qibla also had the opportunity to meet with key religious figures during his visit. He met Muhamad Ismail, Imam of a Masjid in Guilin, Khawaja Abbas, another Imam in Kashghar, and Abdul Raqeeb Al-Sini, head of the Islamic Academy in Aksu, Xinjiang.\nThese religious leaders disclosed that the religious seminaries in China received full official financial sponsorship for various purposes, including salaries, construction, repair, maintenance, and preservation of buildings.\nOne of the highlights of the visit was the observation of the Islamic Academy, which offered a congenial environment to its students. The academy provided a comfortable hostel and hygienic food to the students free of charge.\nThe facility spanned 25 canals and included gardens and playing grounds to keep the students physically fit. Additionally, the academy boasted a state-of-the-art library with a wide array of informative materials for students of all levels.\nDr. Qibla also praised China for its efforts to make religious texts accessible to all, including the translation of the Holy Quran into Chinese and Uyghur languages. These translations are widely available throughout the country, demonstrating China’s commitment to making religious knowledge easily accessible to its diverse population, he added.\nOverall, Dr. Qibla’s visit to China left a positive impression, showcasing the country’s model of religious freedom and inclusivity. The religious leaders’ insights shed light on China’s efforts to promote harmony among different faiths and provide equal opportunities for all religious communities, including Muslims.\nThe delegation was comprised of Dr. Qibla Ayaz, Israr Madani, Tehmeed Jan Azhari, Muhammad Tayyab Tahiri, Maulana Fazl-e-Aali Haqqani, Rashid ul Haq, Maulana Atta ur Rehman, Asif Luqman Qazi, Sahibzada Sultan Ahmed Ali, and Maulana Yousuf Shah.",
  "retrievedAt": "2025-08-11T08:58:01.020Z"
}
