{
  "title": "Monsoon rains likely to continue till July 26: PMD",
  "link": "https://www.app.com.pk/national/monsoon-rains-likely-to-continue-till-july-26-pmd/",
  "date_published": "2023-07-21T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): The Pakistan Meteorological Department (PMD) Friday indicated chances of monsoon rains to continue in the coming days.\nThe monsoon currents were continuously penetrating in the country from Bay of Bengal and a westerly trough was also affecting its upper parts that might persist during next few days, the PMD said.\n“Rain/wind-thundershower with few heavy to very heavy falls are expected in Kashmir, (Neelum valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur), Gilgit Baltistan (Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, Shigar), Murree, Galliyat, Islamabad, Rawalpindi, Attock, Chakwal, Jhelum, Mandi Bahauddin, Sialkot, Narowal, Lahore, Sheikhupura, Hafizabad, Gujranwala, Gujrat, Kasur, Mianwali, Sargodha, Khushab, Faisalabad, Toba Tek Singh, Jhang, Sahiwal, Bahawalnagar, Okara, Chitral, Dir, Swat, Shangla, Buner,Mansehra, Kohistan, Abbottabad, Haripur, Peshawar, Mardan, Swabi, Nowshera, Kurram, Lakki Marwat, Kohat, Dera Ismail Khan, Bannu, Karak and Waziristan from July 22- 26 with occasional gaps,” it added.\nRain/wind-thundershower with isolated heavy falls, the PMD further said, “are also expected in Zhob, Sherani, Barkhan, Musakhel, Kohlu, Naseerabad, Jhal Magsi, Loralai, Ziarat, Mastung, Kalat, Khuzdar, Lasbela, Awaran, Kech, Panjgur, Dera Ghazi khan, Rajanpur, Multan, Khanewal, Bhakkar, Layyah, Kot Addu, Bahawalpur, Rahim Yar Khan, Tharparkar, Umerkot, Mirpurkhas, Sukkur, Larkana, Jacobabad, Dadu, Shaheed Benazirabad, Hyderabad, Sanghar, Badin, Thatta and Karachi from July 22- 24 with occasional gaps”.\nAbout the impacts, the PMD warned that heavy rains might cause urban flooding in low lying areas of Islamabad/ Rawalpindi, Peshawar, Gujranwala and Lahore from July 22-26, and trigger landslides in the vulnerable areas of Murree, Galliyat, Kashmir, Gilgit Baltistan and hilly areas of Khyber Pakhtunkhwa during the period.\n“Heavy rain may generate flash flooding in Kashmir, Dir, Swat, Kohistan, Shangla, Buner, Manshera, Abbottabad, Rawalpindi/Islamabad during July 22-26, and cause hill torrents in Dera Ghazi Khan and adjoining areas of northeast Balochistan on July 22 and 23.”\nHeavy rains might also trigger water logging in low lying areas of Karachi and Hyderabad during July 22-24, the PMD said.\nIt advised the farmers to manage their activities keeping in view the weather forecast, and asked tourists and travelers to remain extra cautious to avoid any untoward situation during the wet spell.\nThe PMD urged the public to stay at safe places during wind-storm/heavy rains as loose structures like electric poles, solar panels etc might be damaged.\nIt also advised all the authorities concerned to remain alert and take necessary precautionary measures during the forecast period.",
  "retrievedAt": "2025-08-11T08:58:01.005Z"
}
