{
  "title": "Dar refutes rumors of imposition new taxes on agriculture, real estate sectors",
  "link": "https://www.app.com.pk/national/dar-refutes-rumors-of-imposition-new-taxes-on-agriculture-real-estate-sectors/",
  "date_published": "2023-07-21T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): Federal Minister for Finance and Revenue, Senator Mohammad Ishaq Dar on Friday firmly denied media reports claiming the imposition of additional taxes on agriculture and real estate sectors to meet the International Monetary Fund’s (IMF) requirements.\n“I am categorically announcing on the floor of the house that there will be no new taxes on agriculture and real estate. We have faced numerous hardships due to the International Monetary Fund (IMF) requirements, and we have diligently met all the prior actions,” the finance minister said while speaking at the National Assembly.\nThe minister further emphasized that the news was entirely baseless and lacked truth, clarifying that all fiscal decisions made by the government were aimed at fulfilling IMF’s requirements and commitments.\nSenator Ishaq Dar also offered his readiness to provide detailed information on these specific issues to anyone seeking clarification.\nDiscussing the economic situation, the finance minister mentioned that if the government continued its present policies, the inflation rate was expected to decrease to 7 per cent, based on the working of the State Bank.\nAttributing the country’s economic hardships to Pakistan Tehreek-e-Insaf’s backtracking from commitments, Senator Dar proudly stated that with the government’s efforts, Pakistan had successfully reached an agreement of $3 billion with the IMF.\nAs a result, the State Bank of Pakistan received the first tranche of $1.2 billion to stabilize the economy.\nSpeaking on the current foreign exchange reserves, he informed that the reserves had reached their highest position since October 2022. The total liquid foreign reserves were reported to be US$ 14,065.3 million, with the central bank holding $8,727.2 million, thanks to inflows from Saudi Arabia, the United Arab Emirates (UAE), and the IMF.\nThe central bank had received $2.0 billion from Saudi Arabia, following $1.2 billion from the IMF, and $1.0 billion from the UAE, contributing to the net foreign reserves held by commercial banks at US$ 5,338.1 million.\nThe finance minister reassured the public that the government had made all due payments in accordance with international agreements, further demonstrating its commitment to meeting obligations on time.\nHighlighting the government’s commitment to financial transparency, Senator Dar shared the IMF agreement and stated that it would be made available on the Ministry of Finance’s website for public information.\nThe minister also handed over a copy of the agreement to the lower House of Parliament.",
  "retrievedAt": "2025-08-11T08:58:05.759Z"
}
