{
  "title": "IHC merges all pleas on Imran’s prison rights - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Islamabad High Court (IHC) has merged all petitions related to the visitation rights and jail conditions of former prime minister Imran Khan, who is currently incarcerated in Adiala jail.\n\nThe acting chief justice of Sardar Mohammad Sarfraz Dogar on Monday ordered the registrar office to club around 20 petitions, which will be heard by a larger bench.\n\nThe order was issued at the request of the Adiala jail superintendent, who had asked the court to merge the petitions regarding prison facilities provided to the ex-PM and his rights in the jail.\n\nThe official pleaded that since the cases were heard by different benches, there had been “inconsistent” and “conflicting”` judgments on the issues according to his understanding.\n\nJustice Dogar issues order on petition of Adiala jail superintendent; cases to be heard by larger bench\n\nHe pleaded that the hearing by same bench would ensure consistency in orders and prevent legal complications.\n\nThe PTI has filed several petitions in the IHC regarding the jail facilities provided to Mr Khan, who has been in custody since his arrest in August 2023.\n\nMost of these cases sought permission to allow lawyers, family members and party leaders to meet Mr Khan, while some petitions challenged the restrictions imposed by the jail authorities.\n\nDuring the hearing of one of these petitions last week, IHC’s Justice Sardar Ejaz Ishaq Khan had ordered the jail authorities to present Mr Khan in court virtually or in person.\n\nHowever, it alleged, the jail administration defied the directives, citing security reasons.\n\nThe judge then sent his court clerk to visit the jail to inquire if Mr Khan was denied access to his counsel.\n\nHowever, the clerk couldn’t meet Mr Khan to verify the questions posed by the judge.\n\nLarger bench\n\nDuring the hearing on Monday, Advocate Naveed Malik — the counsel for jail superintendent SSP Abdul Ghafoor Anjum — argued that SOPs for Mr Khan’s meetings have already been determined in an intra-court appeal.\n\nHowever, various petitions related to these meetings were being heard by different benches, creating logistical challenges, he argued.\n\nMr Malik urged the court to consolidate all such cases and form a larger bench for hearing.\n\nHe said the Adiala superintendent was responsible for overseeing thousands of prisoners and had to appear in the IHC five days a week.\n\nThe superintendent’s administrative burden would be eased if the cases were heard by the same bench, he argued.\n\nFollowing these arguments, the court instructed the consolidation of the cases.\n\nWhile commenting on the order to merge the petitions, Advocate Niazullah Niazi, the spokesman for Mr Khan, said his client had filed a petition against the transfer of Justice Dogar to the IHC.\n\nHe said the transfer not only disturbed the hierarchy within the IHC but was also tantamount to undermining judicial independence.\n\nMr Niazi said the rule of law and supremacy of the Constitution can transform the lives of 25 million Pakistani citizens.\n\n“Our mission is not against any state institution; rather, we seek to establish the rule of law and empower citizens.”\n\nHe warned that Mr Khan and the people of Pakistan will hold those accountable who are involved in corruption and misusing their authority.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:16:23.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898612/ihc-merges-all-pleas-on-imrans-prison-rights",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:06.000Z"
}
