{
  "title": "Balochistan speaker seeks report on CPEC projects in Gwadar - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Assembly Speaker Abdul Khaliq Achakzai on Monday directed that a detailed progress report on development projects under the China-Pakistan Economic Corridor (CPEC) in Gwadar be presented in the next session.\n\nHe also called for arranging a visit for all MPAs to directly assess the situation in the coastal district.\n\nJamaat-i-Islami lawmaker Maulana Hidayatur Rehman, in a call-attention notice, inquired about the number of development projects completed under CPEC phase-1 in Balochistan and the details of projects planned for phase-2.\n\nIn response, Minister for Planning and Development Mir Zahoor Buledi said that two committees had been formed for the approval of CPEC projects, with the chief minister and himself serving as members of the Joint Working Committee.\n\nHe explained that phase-2 of CPEC includes projects such as the Gwadar Airport, expressway, free zone, technical training centers, and energy sector initiatives. Additionally, a five-million-gallon-per-day desalination plant is under consideration.\n\nKhaliq Achakzai proposes visit by lawmakers to assess situation\n\nExpressing dissatisfaction, Maulana Hidayat asserted that the people of Balochistan had been deceived in the name of CPEC, noting that no motorway had been built in the province under the framework.\n\nHe also criticised the exclusion of the Balochistan chief minister from the delegation, led by President Asif Ali Zardari and Prime Minister Shehbaz Sharif, that recently visited China and claimed that even in phase-2, Balochistan was not receiving any benefits.\n\nFormer chief minister Dr Abdul Malik Baloch said he had neither signed any CPEC agreements nor had any passed through his office. He noted that while Chinese officials visit, discussions are held behind closed doors with the federal government.\n\nHe said CPEC included projects related to roads, electricity and fibre optic cables; yet none were implemented in Balochistan. He also revealed that the federal government had purchased 2,200 acres of land in Balochistan, but aside from a few port buildings and a school with some Chinese-funded rooms, no significant development had taken place.\n\nOpposition Leader Mir Younis Aziz Zehri also raised concerns, highlighting the slow progress of the Chaman-Karachi Highway and Gwadar Port and free zone.\n\nSpeaker Achakzai clarified the distinction between CPEC and National Highway Authority projects, warning that the people of Balochistan were being misled regarding CPEC.\n\nMr Buledi clarified that Pakistan had not received $60 billion under CPEC, as many projects were financed through loans acquired by the provincial governments.\n\nJUI-F lawmaker Syed Zafar Agha pointed out that inadequate funding allocations were a major obstacle to the successful implementation of CPEC projects.\n\nMinister of Finance Mir Shoaib Nosherwani proposed that all parliamentary leaders visit Gwadar to evaluate the progress of ongoing projects firsthand.\n\nThe session was adjourned until Thursday.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:16:20.994Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898606/balochistan-speaker-seeks-report-on-cpec-projects-in-gwadar",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:06.000Z"
}
