{
  "title": "Minister defends McKinsey’s hiring for tax digitisation - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Says foreign remittances may rise up to $36bn this year\n• NA extends two ordinances for 120 days\n\nISLAMABAD: Amidst alarm over the hiring of a US-based company for digitalisation of tax system in the country, Finance Minister Muhammad Aurangzeb on Monday told the National Assembly that McKinsey and company was selected after a “transparent competitive” process.\n\nMQM-P lawmaker Syed Hafezuddin while speaking on a calling attention notice had pointed out that the New York-based company had subsidiaries for artificial intelligence (AI) services and solutions operating in Israel and India.\n\nThe finance minister said as many as seven parties, including international players and domestic companies, had applied for it and McKinsey was selected through a rigorous process.\n\nHe said the matter should be seen in the context of government’s desire to transform the tax authority with the focus on people, procedure and technology.\n\nExplaining his point, Mr Aurangzeb said it was aimed at inducting “competent people having integrity” and simplifying the procedures.\n\nHe said another component was end-to-end digitisation of tax regime so as to bring transparency in the system, reduce human intervention and effectively address the issues of corruption and harassment.\n\n“It is all about client service so that we could bring credibility and trust back in tax authority,” he remarked.\n\nFunds\n\nThe minister said McKinsey was an international company having office in Pakistan with resources on ground. “They are helping us in design phase and overseeing implementation”.\n\nHe said the national exchequer was not incurring a single penny for this purpose. He explained that the Gates Foundation was funding this project.\n\nAlso, the lower house of parliament through separate resolutions extended two ordinances for another 120 days.\n\nThese included the Income Tax (Amendment) Ordinance, 2024 and the Federal Board of Intermediate and Secondary Education (Amendment) Ordinance, 2024.\n\nBesides, two bills — The Anti-Dumping Duties (Amendment) Bill, 2025 and The Extradition (Amendment) Bill, 2025 — were introduced in the house.\n\nAlso, “the Societies Registration (Amendment) Ordinance, 2024” was laid before the assembly.\n\nRemittances\n\nEarlier, during the question hour, the finance minister informed the house that foreign remittances this year were projected to increase from around US$30 billion last year to between $35bn and $36bn.\n\nHe said to improve foreign remittances inflow through formal channels, Pakistan Remittances Initiative (PRI) and SBP in collaboration with financial institutions conducted extensive outreach activities. He said a comprehensive pre-departure briefing programme was designed for intending overseas workers to educate them on utilising formal remittance channels and available advantages therein.\n\nAlso, banks, guided by SBP/PRI, collaborate with money transfer operators to highlight the economic importance of remittances, build international partnerships, and inform overseas Pakistanis about ease of using formal channels, he added.\n\nPay raise reports\n\nAlso, in a written reply to a question asked by PTI Chief Whip Malik Amir Dogar about revision in salaries of government officials, the finance ministry clarified Mr Aurangzeb did not mention any revisions to pay scales for government employees during the session and the “news broadcast attributed to him in this regard is not based on reality”.\n\nThe ministry said the proposal to revise pay scales is not under consideration, however, Mr Aurangzeb confirmed the issue of increasing the rent limit for availing the services of privately owned residential houses was under consideration after receiving the revised market survey from the ministry of housing and works.\n\nRecalling the figures of current account deficit in recent years, the minister said current account deficit was brought down substantially from 5.4pc of GDP in FY18 to 0.8pc in the next year. But due to strong recovery of domestic demand after Covid and higher international commodity prices, it widened sharply again to 4.7pc of GDP ($17.5 billion) in FY22.\n\nHowever, he added, following the well-coordinated implementation of demand stabilization policies by the government and State Bank of Pakistan, current account deficit substantially narrowed to 1.0pc of GDP ($3.3bn) in FY23 and further to 0.5pc of GDP ($1.7bn) in FY24.\n\nDuring the first seven months of FY25, current account balance turned into surplus, driven by robust workers’ remittances, contained demand and favorable international commodity prices.\n\nHe said tight monetary policy stance during past years, complemented by ongoing fiscal consolidation, not only reduced inflation but also curbed aggregate demand, subsequently lowering the current account deficit.\n\nHe said SBP’s foreign exchange reserves which fell to $4.4 billion in FY23 also witnessed a significant increase of about $4.9bn in FY24 to $9.4bn by end of June 2024 and continued an upward trajectory in FY25, reaching to $11.4bn by end-Jan 2025.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:02:12.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898590/minister-defends-mckinseys-hiring-for-tax-digitisation",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:48:57.000Z"
}
