{
  "title": "Funding cuts for global health programmes threaten childhood vaccination efforts: WHO - World - DAWN.COM",
  "author": null,
  "content": "Countries, including the United States, cutting down funding for life-saving global health projects could jeopardise vaccination programmes that protect children and adults from deadly diseases, the World Health Organisation (WHO) said on Tuesday.\n\nThe recent abrupt changes in donor budgets and capacity in global health have put a severe strain on immunisation programmes, particularly on measles prevention efforts, at all levels, the UN health agency said.\n\nMeasles is a highly contagious airborne viral illness characterised by fever and a distinctive rash, which remains a significant cause of death among children globally, according to the WHO.\n\nThe best protection against measles is through the measles, mumps, and rubella vaccine as there is no specific treatment once a person is infected. The WHO recommends two doses of the measles vaccine for all children.\n\nThe United States is currently battling one of the largest measles outbreaks it has seen in the past decade, with more than 300 cases since late January.\n\nThe outbreak has been fuelled by declining vaccination rates in parts of the US where parents have been falsely persuaded that such shots do more harm than good.\n\nThe backsliding in immunisation has partly been a result of “concerns that people have related to misinformation around measles vaccine, [which] is creating an environment where measles cases are occurring again in places around the world that have already eliminated measles”, said Kate O’Brien, director at the WHO’s immunisation department.\n\nUS Health Secretary Robert Kennedy Jr had initially downplayed news that a school-aged child had died of measles in Texas, the first such death in a decade, calling such outbreaks ordinary and failing to mention the role of vaccination to prevent measles.\n\nHe had also told parents vaccination was a personal choice and urged them to consult with their physicians in his opinion piece published on Fox News.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:15:56.280Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898749/funding-cuts-for-global-health-programmes-threaten-childhood-vaccination-efforts-who",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T18:52:47.000Z"
}
