{
  "title": "Father obligated to maintain child born out of wedlock: Lahore High Court - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court has ruled that a biological father is under obligation to maintain his child even born outside wedlock or as a consequence of rape.\n\n“The person, having begotten the child, is bound to provide for its maintenance,” Justice Ahmad Nadeem Arshad declared in a detailed judgement passed on a petition by a man challenging a family court’s decree.\n\nA woman, the mother of a four-year-old girl, was allegedly raped by the petitioner and for this occurrence an FIR was registered on March 4, 2020 against him for offences under Sections 376, 109 of the Pakistan Penal Code. As a result of alleged rape, the woman conceived and the minor was born on May 27, 2020, and claimed that she was biological daughter of the petitioner.\n\nThe mother on behalf of the minor instituted a suit for recovery of maintenance allowance and claimed that biological daughter was entitled to recover maintenance allowance from the petitioner.\n\nLHC orders family court to first establish paternity in maintenance case\n\nThe petitioner turned up before the court and contested the suit, challenging the version of the woman and claimed that the minor was not his daughter either legitimate or illegitimate.\n\nHowever, the family court on June 7, 2022, fixed an interim maintenance allowance of the minor at the rate of Rs3,000 per month.\n\nLater, the alleged father moved the LHC against the order by the court below.\n\nIn his judgement, Justice Arshad observes that this is not a simple case of recovery of maintenance allowance simpliciter.\n\nThe judge notes that the terms “legitimate child” and “biological child” are entirely different.\n\nA biological child refers to a child who is genetically related to the parents and this can be born within or outside a marriage. A legitimate child refers to a child born to parents who are legally married to each other at the time of the birth.\n\nThe judge observes that once paternity is established, the defendant would then be legally obligated to provide maintenance for the child.\n\nHe maintains that the family court erred in law by granting maintenance for the child without first ensuring, through the proper process of evidence, that the child is indeed the biological offspring of the petitioner.\n\n“In cases where paternity is disputed, it is essential for the court to first establish, beyond a reasonable doubt, the biological relationship between the child and the defendant,” the judge adds.\n\nHe rules that without recording sufficient evidence, the court’s decision to grant maintenance prematurely bypasses a critical step in determining legal responsibility.\n\n“This failure undermines the principles of fairness and due process in family law proceedings,” he maintains.\n\nJustice Arshad observes that equity, fair play and justice demands that the minor, if proves to be a biological child of the petitioner, then she must be compensated and maintained by him.\n\n“The biological father is also morally under obligation to maintain his illegitimate child,” the judge adds.\n\nAllowing the petition, the judge remanded the matter back to the family court with a direction to record the evidence regarding the specific claim made in the plaint that the petitioner is the biological father of the minor.\n\nThe judge says if the family court concludes that the minor is indeed the biological child of the petitioner, the proceedings may continue for the determination of the maintenance allowance.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:16:03.710Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898570/father-obligated-to-maintain-child-born-out-of-wedlock-lahore-high-court",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:46.000Z"
}
