{
  "title": "In a first, Webb telescope directly observes exoplanet CO2 - World - DAWN.COM",
  "author": null,
  "content": "PARIS: The James Webb Space Telescope has directly observed the key chemical of carbon dioxide in planets outside of our solar system for the first time, scientists announced on Monday.\n\nThe gas giants are not capable of hosting extraterrestrial life, but do offer clues in a lingering mystery about how distant planets form, according to a study in The Astrophysical Journal.\n\nThe HR 8799 system, 130 light years from Earth, is only 30 million years old — just a baby compared to our solar system’s 4.6 billion years.\n\nA US-led team of researchers used Webb to directly detect carbon dioxide in the atmosphere of all four of the system’s known planets, according to the study.\n\nExpert says discovery is ‘key piece of proof’ far-off planets can form in a similar way to those in our celestial backyard\n\nThey used Webb’s coronagraph instruments, which block the light from bright stars to get a better view of the planets revolving around them.\n\n“It’s like putting your thumb up in front of the Sun when you’re looking up at the sky,” lead study author William Balmer, an astrophysicist at Johns Hopkins University, told AFP.\n\nNormally, the Webb telescope only detects exoplanets by glimpsing them when they cross in front of their host star.\n\nThis “transiting method” was how Webb indirectly detected CO2 in the atmosphere of the gas giant WASP-39 in 2022.\n\nBut for latest discovery, “we’re actually seeing the light that is emitted from the planet itself, as opposed to the fingerprint of that light from the host star,” Balmer said.\n\nThis is not easy; Balmer compared the process to using a torch to spot fireflies next to a lighthouse.\n\nWhile these gas giants may not be able to host life, it is possible that they had moons that could, he added.\n\nThere are missions currently under way to find out if there could be life in the vast oceans underneath the icy shells of several of Jupiter’s moons.\n\nKey piece of proof\n\nCarbon dioxide (CO2) is essential for life on Earth, making it a key target in the search for life elsewhere.\n\nBecause CO2 condenses into little ice particles in the deep cold of space, its presence can shed light on planetary formation.\n\nJupiter and Saturn are believed to have first formed from a “bottom up” process in which a bunch of tiny, icy particles came together into a solid core which then sucked in gas to grow into giants, Balmer said.\n\nSo the new discovery is a “key piece of proof” that far-off planets can form in a similar way to those in our celestial backyard, Balmer said.\n\nBut how common this is throughout the universe remains unclear.\n\nAstronomers have now discovered nearly 6,000 exoplanets, many of them massive — and none of them known to be habitable.\n\nThe “huge leap forward we need to make” is to focus on smaller Earth-sized worlds, Balmer said.\n\nNasa’s Nancy Grace Roman space telescope will use a coronagraph to do that just after its planned launch in 2027.\n\nBalmer hopes to use Webb to observe more four-planet systems, but added that future funding was now in question.\n\nLast week the Trump administration announced that Nasa’s chief scientist has been dismissed, indicating that more cuts were to come for the US space agency.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d8931e746ed.jpg",
  "retrievedAt": "2025-08-25T15:16:24.420Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898585/in-a-first-webb-telescope-directly-observes-exoplanet-co2",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:48:57.000Z"
}
