{
  "title": "Heavy snowfall causes food shortage in Broghil - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHITRAL: Residents of Broghil have given an SOS call to the government to rush to their rescue as the valley is still covered in four feet of snow, causing severe food shortages for inhabitants and their livestock.\n\nTalking to Dawn on telephone from the adjoining Yarkhoon here on Monday, former Broghil village nazim Amin Jan Tajik said that the heavy snowfall in the valley had blocked the roads, making replenishment of food items impossible for last four months.\n\nHe regretted that the construction of a warehouse of food department was yet to be completed in Broghil, and a petty stock of wheat maintained in a small rented room had run out long before.\n\nMr Tajik said that the people were now left with no option but to slaughter their livestock to save themselves from starvation, while livestock had already started perishing due to shortage of fodder.\n\nThe former nazim said that the livestock of the valley included yaks and goats, which formed the major source of household income as no agriculture was possible here due to the intense weather, and the loss of yaks rendered a family in abject poverty.\n\nHe said that livestock was already facing food shortage due to the extended spell of torrential rains during the last summer destroying the grasslands, which were harvested and stored for the winter season.\n\nHe regretted that the residents also faced scarcity of lifesaving drugs, while the sole dispensary in the valley had been without dispenser for last eight years.\n\nBoth the MPA from Upper Chitral and deputy speaker of KP Assembly Suraya Bibi and deputy commissioner Haseeb Khalil could not be contacted to know their versions despite repeated telephone calls.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/151524534eafb1d.jpg?r=152537",
  "retrievedAt": "2025-08-25T15:16:01.917Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898553/heavy-snowfall-causes-food-shortage-in-broghil",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:50:03.000Z"
}
