{
  "title": "Putin, Trump to discuss Ukraine today - World - DAWN.COM",
  "author": null,
  "content": "MOSCOW: Russian President Vladimir Putin and US counterpart Donald Trump will speak by phone on Tuesday, as one US official expressed hope the two could agree a Ukraine ceasefire within weeks.\n\nTrump said earlier “a lot of work” had been done between the United States and Russia on settling the three-year Ukraine conflict, and that there was a “very good chance” hostilities would end.\n\nPutin said last week he agreed with the idea of a ceasefire but warned he had “serious questions” about how it would be implemented that he wanted to discuss with Trump.\n\nKyiv has agreed to the ceasefire, while its European allies have criticised Putin for not committing to an unconditional and immediate halt in fighting, with the UK accusing the Russian leader of “dragging his feet”.\n\n“There is such a conversation being prepared for Tuesday,” Kremlin spokesman Dmitry Peskov told reporters on Monday, ahead of the Trump-Putin call, without commenting on what the two leaders would discuss. Trump has said the two would discuss “land” and power plants: an apparent reference to the Moscow-controlled Zaporizhzhia nuclear plant in south Ukraine. Russia occupies swathes of southern and eastern Ukraine.\n\nThe US president last spoke to Putin last month in a call that broke Western efforts to isolate the Russian leader as long as his forces keep up their Ukraine offensive. Trump’s special envoy Steve Witkoff met Putin last Thursday in Moscow to present the details of the joint ceasefire plan, which envisages a 30-day pause in hostilities. Witkoff told CNN he expected some sort of deal in the “coming weeks”. Ukraine’s Volodymyr Zelensky has reacted with anger to Putin’s statements, accusing him of wanting to prolong the fighting.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d896abcbe3f.jpg",
  "retrievedAt": "2025-08-25T15:16:20.964Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898602/putin-trump-to-discuss-ukraine-today",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:16.000Z"
}
