{
  "title": "Sindh Assembly begins debate on upcoming provincial budget - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: As many as 14 members from both sides of the aisle forwarded their proposals and suggestions for the next provincial budget as the Sindh Assembly began its pre-budget debate on Monday.\n\nThe pre-budget discussion is required to be held from January to March every year under Section 143 of the Sindh Assembly Rules and Regulations.\n\nOn Feb 2, Leader of Opposition Ali Khurshidi through a letter to the chief minister pointed out to the holding of the pre-budget session which was not held last year.\n\nOpening the pre-budget discussion, which will continue till Friday, Pakistan Peoples Party member Muhammad Farooq Awan complained of acute water shortage in his constituency PS-95 due to leakages and dilapidated condition of the 32-inch water pipeline that also supplied water to the adjoining areas, including Kashmir Colony, Manzoor Colony and Defence Housing Authority.\n\n14 opposition, treasury members share their proposal during pre-budget discussion; lawmakers raises issue of water shortage\n\nHe said the issue of the dilapidated pipeline had persisted for the past 30 years and people were being supplied water mixed with sewage.\n\nThe PPP MPA demanded of the provincial government to resolve the water issue of the vicinity on top priority.\n\nHe also demanded of the establishment of a primary school, dispensary, 50-bed hospital and a trauma centre in his constituency so that people of the adjoining neighbourhood could also benefit from the facilities.\n\nMr Awan also pointed out severe traffic jams at Korangi Crossing and suggested that a flyover to Indus Hospital might be built to ease out the traffic situation.\n\nHe also demanded for the repair and rehabilitation of roads, storm water drains and removal of encroachments in his area, still emphasising that the water shortage was the biggest issue for people.\n\nSabir Qaimkhani, a Muttahida Qaumi Movement-Pakistan (MQM-P) member from Hyderabad, came down hard on the PPP and said that there was an acute shortage of water in Hyderabad and Latifabad.\n\nHe said the residents of Latifabad had been facing acute water shortage for the past 15 years. “Husainabad Filter Plant was established, but there is no water supply to it,” he deplored.\n\nRejecting the claims of performance by the chief minister, he said there was no hospital or school fully functional in his constituency.\n\nHe said the urban centres of the province were not given uplift schemes in the last budget.\n\nThe MQM-P MPA said that no new hospital, school or college was established in Hyderabad in the past 17 years.\n\nMr Qaimkhani demanded immediate announcement of the provincial finance commission.\n\nHe also demanded operation of the Peoples Bus Service in Hyderabad and Latifabad.\n\nPPP’s Heer Soho said the party had rendered unparalleled services to the people of the province and planned to build two million houses for the flood victims. She said that people were living in over 3,000 houses.\n\nThe MPA from Sajawal demanded to include the establishment of a university in her district in the next budget. She also complained of water shortage in her area.\n\nMQM-P member Quratul Ain expressed her concerns over the security situation in Karachi and suggested that the provincial government must devise a strategy with police to curb street crimes.\n\nAlso spoke on the occasion were PPP’s Shazia Karim, Asif Musa, Hassan Ali shah, Nadir Akmal Leghari and Jam Shabbir, and MQM-P’s Jamal Ahmed, Nasir Qureshi, Moeed Anwar and Shariq Jamal.\n\nLater, Deputy Speaker Anthony Naveed adjourned the House to meet again on Tuesday (today).\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:16:00.560Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898681/sindh-assembly-begins-debate-on-upcoming-provincial-budget",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T05:33:59.000Z"
}
