{
  "title": "Race to name creatures of Pacific Ocean as mining interest grows - World - DAWN.COM",
  "author": null,
  "content": "PARIS: In the cold, lightless Pacific Ocean deep, the seabed is scattered with metal-rich rocks coveted by miners — and huge numbers of strange and rare animals almost entirely unknown to science.\n\nResearchers are scrambling to name thousands of these newly discovered species. The mining industry is pushing regulators to finalise rules that could open the way for extraction in parts of the vast Clarion-Clipperton Zone (CCZ), stretching between Hawaii and Mexico.\n\nOnce thought an underwater wasteland, the CCZ is now known to harbour an abundance of wildlife. They range from tiny worms in the muddy sediment, to floating sponges tethered to the rocks like aquatic balloons and a giant sea cucumber dubbed the “gummy squirrel”.\n\nCampaigners say this biodiversity is the true treasure of Earth’s largest and least understood environment. They warn that mining could drive species into extinction before they have even been discovered.\n\nInterest in mining the potato-sized “nodules”, which contain metals used in technologies such as smartphone touchscreens and rechargeable batteries, has opened the way for researchers to explore the CCZ.\n\n“We have a far greater understanding of that part of the world than we would have had if we weren’t trying to exploit it,” said Tammy Horton at Britain’s National Oceanography Centre (NOC).\n\nScientists have scooped up sediment in box cores dropped from ships and deployed remote vehicles to take pictures and collect samples from the seafloor. A snapshot of any given patch of CCZ seafloor might show just a solitary brittle star, but researchers seldom see the same creature twice.\n\nThere are “huge numbers of rare species”, said Horton, adding that much of the diversity was among the creatures living in the mud. The nodules are also a unique habitat, like coral gardens in miniature.\n\n‘First step’\n\nThe first stocktake of data from scientific explorations in the CCZ, published in 2023, found that some 90 percent of 5,000 animal species recorded were new to science.\n\nThe International Seabed Authority (ISA) has set a target for over a thousand species to be described by 2030 in the regions targeted by miners. The process is painstaking.\n\nWhere possible, each animal needs to be sketched, dissected and assigned a molecular “barcode” — a sort of DNA fingerprint that allows other researchers to identify it. It took Horton and a team of specialists a year to describe 27 of the hundred or more unnamed amphipods — a type of small crustacean. “The fundamental, basic, first step in any understanding of an environment is knowing what the animals are, how many of them there are and how wide their distribution is,” she said. This would map out a baseline for life in the abyssal plain, so that potential harm can be better understood. Conservation group Fauna & Flora has said risks range from damage to the ocean food web, to the potential for exacerbating\n\nclimate change — by churning up sediment that stores planet-heating carbon. The ISA is due to finalise the international seabed mining code this year, but much work needs to be done.\n\nThe oldest mining test site is a strip of CCZ seabed, ploughed in 1979. Daniel Jones, a NOC researcher who trawled the archives to pinpoint the location, said the test followed an CIA plot to recover a Russian nuclear submarine, using deep-sea mining as a cover story.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:01:28.939Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898598/race-to-name-creatures-of-pacific-ocean-as-mining-interest-grows",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:17.000Z"
}
