{
  "title": "Govt seeks to reduce weightage of population size in NFC share - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The federal government is seeking to disincentivise population growth by drastically reducing its heavy weightage in the formula used for resource allocation to the provinces under the National Finance Commission (NFC), as health experts warn serious consequence of broken health infrastructure incapable to handle emerging diseases.\n\n“The use of population as a criterion for the distribution of resources must be examined holistically,” Finance Minister Muhammad Aurangzeb while presiding over a meeting on National Health and Population Policy (NHPP) for the 2025-34 period, on Monday.\n\nThe meeting was apprised that current system of distribution of resources among the federating units under the constitutional scheme of NFC envisaged an incentive for population growth, as 82pc weight was given to population and 18pc to all other factors like area, poverty and revenue generation etc.\n\nA three-member NHPP team, led by Dr Sameen Siddiqi of Aga Khan University, and also comprising Dr Tayyeb Masud and Dr Noorul Huda Shah, sensitised the meeting about the dilapidated profile of the country’s health system.\n\nRecommendations given for 10-year National Health and Population Policy\n\nThey noted that despite the priority receipts on the basis of population, the health conditions of the population were not on the top priority of all provinces when it came to financial allocations for health sector. As such, the financial allocations for the health and population segments remained insufficient, while the centre, too, was left with fewer resources to spend on devolved subjects.\n\nThe team members said financial allocations required to be improved to address a crumbling health infrastructure, while the traditional diseases were being taken over by new waves of global health challenges. However, they noted, Pakistan’s health profile had not adjusted to new challenges.\n\nThe NHPP team advocated improved allocations for health and population and emphasised that this was not possible without the federal government’s leading role notwithstanding isolated responsibilities in the provinces, the centre and regional areas.\n\nPolicy for next decade\n\nDuring the meeting, the NHPP team provided an update on the formulation of the policy, which is set to guide the country’s health and population strategies for the next decade. The team emphasised that the policy was being developed with a focus on evidence-based decision-making and prioritising critical health issues, all within the context of the fiscal constraints.\n\nThe NHPP team outlined the broader goals of the policy, which include reorganising and restructuring the existing health infrastructure, addressing the challenges posed by high population growth, integrating health and population strategies, and leveraging political capital to increase public sector financing for the health sector. This should lead to creating a health system that works efficiently and effectively to meet the needs of a growing population, particularly the most vulnerable sectors of society.\n\nThe minister asked the team to formally submit their recommendations and proposals to the Ministry of Finance for review and action, while acknowledging the significant challenges posed by climate change, rapid population growth, and associated issues such as child stunting and learning poverty.\n\nSuccessive governments have not been able to deliver an NFC award for resource distribution among the centre and its federation units since the expiry of the previous one in December 2014, though the constitution makes it mandatory to have a fresh NFC every five years.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/18090529f4b9667.jpg",
  "retrievedAt": "2025-10-12T02:01:09.169Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898588/govt-seeks-to-reduce-weightage-of-population-size-in-nfc-share",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:48:57.000Z"
}
