{
  "title": "Inzamam concerned by Pakistan’s rapid decline - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Former Paki­stan captain Inzamam-ul-Haq has expressed his concerns over the country’s constant decline cricket and attributed it to the mistakes at the administrative level.\n\nSpeaking to reporters in Lahore, Inzamam said Pakistan had been undergoing a rapid decline since the last two years.\n\n“We are not working in the right direction and making the wrong calls in many areas,” he said.\n\nThe former chief selector warned that the team would continue to spiral downwards if there is no planning and execution.\n\nHe blamed frequent changes in the team’s management, coaches, and players for the chaotic situation.\n\n“I would think that the cricket board now needs to learn from its mistakes and not repeat the same mistakes we have made in the last two years.\n\n“In the past two years, the performance of the Pakistan team has been on a decline. If we don’t work in the right direction, we will continue to fall further,” said Inzamam.\n\nThe former captain himself has been a victim of the chaos in the Pakistan Cricket Board as he was forced to step down as chief selector in 2023 for alleged conflict of interest.\n\nHe made it clear that constant changes in team management was not a solution to the problem.\n\n“We need to sit down and think about where the mistakes are being made,” he said.\n\nInzamam said that being a former captain and player he knew that when constant changes are made, it only undermines the players.\n\n“Instead of making too many changes, we need to think carefully about where things are going wrong. If there are constant changes, players won’t gain the confidence they need, and the situation will remain the same,” he further said.\n\nThe former captain also said he rem­ained a big supporter of Babar Azam whom he described as a top player.\n\n“Babar Azam is a top player. Everyone goes through a rough patch, but the national team hasn’t been playing good cricket for the past few months,” he added. “Trust the management and the players, and work together to identify where the mistakes are,” he said.\n\nTo a question about the role of the stars from the 1990s and the impact they had, Inzamam made it clear that the players from that era will hold special place in Pakistan cricket.\n\n“If we look at the players from the 90s generation, Pakistan cricket would lose its strength without them,” he concluded.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:02:13.857Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898632/inzamam-concerned-by-pakistans-rapid-decline",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:48:30.000Z"
}
