{
  "title": "Yemenis take to the streets amid fresh US strikes - World - DAWN.COM",
  "author": null,
  "content": "SANAA: Huge crowds joined protests in rebel-controlled Yemen on Monday after deadly US strikes killed several and sparked fears of a new cycle of violence in the conflict-torn country.\n\nTens of thousands of demonstrators chanted “Death to America, death to Israel!” in the capital Sanaa. There were also large crowds in Saada, birthplace of the Houthi movement, and demonstrations in Dhamar, Hodeida and Amran, footage from the rebels’ Al-Masirah TV station showed.\n\n“Yemen will never back down — we defy the Americans, we defy the Zionists,” said a man shouting slogans to the Sanaa crowd, who chanted back: “We are the men of the Prophet.”\n\nHouthi media reported fresh US air strikes on Monday targeting rebel-held Hodeida on Yemen’s western coast. “A strike by the American aggression targeted the region of Bajel in the Hodeida governorate”, while others targeted a steel factory in the Al-Salif region in the same governorate, according to the Houthis’ Saba press agency. Al-Masirah also reported the strikes.\n\nTrump vows to hold Iran responsible for Houthi attacks\n\nThe protests came after the first US strikes on Yemen under President Donald Trump, aimed at ending the Houthis’ Red Sea harassment campaign, which killed 53 people and wounded 98 on Saturday. The rebels, at war with a Saudi-led coalition for a decade, launched scores of attacks on ships in the vital route during the Gaza conflict, claiming solidarity with the Palestinians.\n\nHouthis also claimed they had attacked the USS Harry S. Truman aircraft carrier group twice within 24 hours.\n\nWashington has vowed to keep hitting Yemen until the rebels stop attacking Red Sea shipping, with Trump warning he would use “overwhelming lethal force”. In the capital Sanaa, controlled by the Houthis since 2014, giant Yemeni and Palestinian flags punctuated a sea of demonstrators at Al-Sabeen Square, which has hosted large-scale demonstrations on a weekly basis throughout the Gaza conflict.\n\nUS President Donald Trump said on Monday he would hold Iran responsible for any attacks carried out by the Houthi group that it backs in Yemen, as his administration expanded the biggest US military operation in the Middle East since Trump returned to the White House.\n\n“Every shot fired by the Houthis will be looked upon, from this point forward, as being a shot fired from the weapons and leadership of IRAN, and IRAN will be held responsible, and suffer the consequences, and those consequences will be dire!” Trump said on his Truth Social platform. The White House said that Trump’s message to Iran was to take the United States seriously. The Houthis, an armed movement that has taken control of the most populous parts of Yemen despite nearly a decade of Saudi-led bombing, have launched scores of attacks on ships off its coast since November 2023, disrupting global commerce.\n\nOne US official said the strikes might continue for weeks. Washington has also ramped up sanctions pressure on Iran while trying to bring it to the negotiating table over its nuclear programme.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d89c3825312.jpg",
  "retrievedAt": "2025-08-25T15:16:14.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898596/yemenis-take-to-the-streets-amid-fresh-us-strikes",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:17.000Z"
}
