{
  "title": "IS-K man ‘admits to role’ in Kabul, Moscow bombings - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The FBI has formally charged Mohammad Sharifullah with providing material support to the militant Islamic State-Khorasan (IS-K) group, linking him to both the 2021 Kabul Airport bombing and the 2024 Moscow concert hall attack.\n\nWhile some media reports have presented different interpretations of his role, the FBI’s official written statement — based on Sharifullah’s own admissions — provides a different account of his involvement.\n\nAccording to an affidavit signed by FBI Special Agent Seth Parker, Sharifullah admitted to directly facilitating the Abbey Gate bombing at Kabul airport. In an interview with FBI agents after waiving his Miranda rights, Sharifullah stated that he: “conducted surveillance so that he could prepare the suicide bomber and transport him to the target area.”\n\nThe statement also confirms that Sharifullah “transported the bomber to the location of the attack” and later recognised the attacker—identified as Irfan—as an IS-K operative he had known while incarcerated.\n\nFBI statement confirms his logistical, operational role in both attacks; doesn’t call him ‘mastermind’\n\nAdditionally, the FBI document details how Sharifullah was released from an Afghan prison just weeks before the bombing and was immediately contacted by IS-K to assist in an attack. He was provided with: “a motorcycle, funds for a cell phone and a SIM card, and instructions to open an account on a particular social media platform to communicate with them during the attack operation.”\n\n“A task to scout a route near [Hamid Karzai International Airport] for an attacker, specifically checking for law enforcement and American or Taliban checkpoints.”\n\nAfter completing reconnaissance, Sharifullah reported that “he believed the route was clear and that he did not think the attacker would be detected.” He was then instructed to leave the area before the bombing occurred.\n\nHowever, during last Monday’s court hearing, Fox News and the New York Post reported that Parker verbally agreed with Sharifullah’s defence that he was “not one of the top-level planners” of the bombing.\n\nThis contrasts with the written statement, which, while not calling him a mastermind, explicitly confirms his logistical and operational role.\n\nThe confusion was probably caused by President Trump’s recent address to Congress, where he described Sharifullah as “the top terrorist responsible” for the bombing. The FBI’s affidavit however, while confirming his direct involvement, does not make that claim.\n\nThe FBI statement also links Sharifullah to the March 22, 2024, Crocus City Hall attack in Moscow, which killed approximately 130 people. By his own admission, Sharifullah stated that he received “an order from a known IS-K senior leader to provide instructions on how to properly use AK-style rifles and other weapons to would-be attackers in Moscow.”\n\nHe further confessed that he “shared video instructions with several individuals” and later recognised two of the arrested attackers as the same people he had trained.\n\nIt has also emerged that Pakistan did not independently track down and arrest Sharifullah. It was US intelligence that Sharifullah would be entering Pakistan from Afghanistan, and Washington had sought Islamabad’s help in capturing and deporting him to the US.\n\nSharifullah has been charged under a US law that criminalises providing material support to a designated foreign terrorist organisation. If convicted, he faces a maximum penalty of life in prison.\n\nWhile President Trump and US officials have framed his capture as a significant breakthrough, discrepancies between the official FBI statement and courtroom remarks suggest his exact role is still under legal scrutiny. As proceedings continue, further clarity may emerge regarding his position within IS-K and the extent of his operational influence.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:01:48.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898587/is-k-man-admits-to-role-in-kabul-moscow-bombings",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:48:57.000Z"
}
