{
  "title": "Sudan army, paramilitaries battle for Khartoum - World - DAWN.COM",
  "author": null,
  "content": "KHARTOUM/OMDURMAN: Shelling by Sudan’s paramilitary Rapid Support Forces killed six civilians including two children in Khartoum’s twin city of Omdurman, a doctor said on Monday, as the army inched closer to the capital’s presidential palace.\n\nSunday’s attack also wounded 36 civilians, half of them children, the doctor at Al-Nao hospital said. The bombardment struck residential areas in northern Omdurman, hitting civilians inside their homes and children playing on a football field, the Khartoum regional government’s media office said.\n\nThe army says its units are now positioned less than a kilometre from the presidential palace, which the RSF seized at the outset of the war. Despite these advances, RSF commander Mohamed Hamdan Daglo remains defiant, vowing that his forces will not withdraw from the capital. “We will not leave the Republican Palace,” Daglo said in a video address shared on Telegram.\n\nIn a video address shared on Telegram, RSF commander Mohamed Hamdan Daglo vowed his troops “will not leave the Republican Palace”. Agency journalists saw thick plumes of smoke rising over central Khartoum as fighting raged across the capital, with gunfire and explosions heard in several areas.\n\nTwo years of war have left large swathes of the capital unrecognisable\n\nA city destroyed\n\nSince April 2023, the conflict has pitted army chief Abdel Fattah al-Burhan against his former deputy Daglo. The war has left tens of thousands dead and uprooted more than 12 million, according to UN figures, with many living in makeshift camps.\n\nThe RSF initially seized the streets of Khartoum, but in recent months, the army has clawed back territory, regaining control of Bahri — also known as Khartoum North — and East Nile to its east.\n\n“We are coming for Port Sudan,” he added, referring to the de facto capital on the Red Sea, where the government has been based since Khartoum fell.\n\nOne of agency’s team, travelling under military escort, crossed from Khartoum’s twin city of Omdurman — recaptured by the army last year — into Bahri and its war-ravaged outskirts. The convoy passed through eerie, abandoned neighbourhoods including Al-Haj Yousif, where the skeletal remains of shuttered shops and crumbling pavements stretch along the streets.\n\nRubble, debris and discarded tires litter the roads. Every few blocks, small clusters of people sit outside empty buildings and stores pockmarked with bullet holes. Hospitals and schools no longer function. The army says it has uncovered multiple mass graves, including one at the Omdurman courthouse.\n\nThe civilians still in the city appear visibly shaken by the trauma of war. “At night, I used to hear gunshots. Then, I saw them carrying bodies and throwing them in the well,” said Salha Shams El-Din, who lives near the pit where she said RSF troops dumped bodies.\n\nA constant struggle\n\nFor those who survived to see the army recapture the district early this month, life remains a constant struggle. There is no electricity, and clean water and food are scarce. On a quiet street in Bahri, some 40 women sit beneath a makeshift tent, preparing Ramazan meals at a community kitchen, one of many that struggled under RSF control.\n\nIn a war-ravaged neighbourhood of Sudan’s capital Khartoum, the stench from a gaping sewage pit is unbearable as Red Crescent workers pull a bloated body from deep underground.\n\nThe volunteers say 14 more remain below. “They were shot in the head, some have crushed skulls,” Hisham Zein al-Abdeen, head of forensic medicine at Sudan’s health ministry, said at the scene.\n\nThe victims, he said, were either shot or beaten to death before being thrown in. Behind him, a truck idles, its flatbed already filling with bodies retrieved from the sewer well in East Nile, an eastern district of Khartoum now reduced to ruins.\n\nNearly two years of war between the army and the paramilitary Rapid Support Forces (RSF) have left large swathes of the capital unrecognisable. Once a bustling metropolis, Khartoum has seen well over 3.5 million of its people flee since the war began, according to the United Nations.\n\nMillions more, unable or unwilling to leave, live among abandoned buildings, wrecked vehicles and what the army says are hidden mass graves.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d89685ca466.jpg",
  "retrievedAt": "2025-08-25T15:16:14.791Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898595/sudan-army-paramilitaries-battle-for-khartoum",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:17.000Z"
}
