{
  "title": "Big industry production shrinks 1.22pc in January - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Despite a 1,000 basis points cut in the key interest rate to 12pc since the start of the current fiscal year, the Large-Scale Manufacturing (LSM) sector continued to show sluggish performance, with production contracting by 1.22 per cent in January compared to the same month last year, according to data released by the Pakistan Bureau of Statistics on Monday.\n\nThe big industry production has seen a negative trend since August 2024, except in October, due to domestic and global factors. The LSM grew positively from December 2023 to May 2024 before entering negative territory in June 2024.\n\nOn a YoY basis, LSM dipped 2.65pc in August, followed by a decline of 1.92pc in September. However, it recorded a paltry growth of 0.02pc in October before contracting by 3.81pc in November and 3.73pc in December. The LSM expanded 2.38pc in July 2024.\n\nOn a month-on-month basis, the LSM recorded a growth of 2.09pc in January.\n\nThe LSM recorded a negative growth of 1.78pc during the first seven months of the current fiscal year from a year ago.\n\nIn FY24, the LSM sector contracted 0.03pc against a 0.92pc growth in the preceding year.\n\nThe food group dipped by 2.67pc in 7MFY25 on a YoY basis. Wheat and rice milling experienced a rise of 5.88pc, starch and its products 0.12pc, respectively. Wheat and rice milling increased substantially during the period under review, owing primarily to improved crop harvests.\n\nHowever, vegetable ghee production declined 2.65pc, cooking oil 0.04pc and tea blended 4.32pc.\n\nThe textile sector grew 2.08pc in 7MFY24 on a YoY basis. Cotton yarn has increased by 8.73pc, while cotton cloth has increased by 0.79pc, accounting for more than 80pc of the textile sector. The primary cause of the rise in production was a slight increase in export unit value in the face of higher external demand for textiles.\n\nThe exports of garments recorded a growth of 10.39pc on a YoY basis. The surge in garment exports is primarily due to diverting foreign purchasers from Bangladesh to Pakistan.\n\nCoke and petroleum products grew 2.47pc in 7MFY25. The petrol production declined by 0.76pc. However, the production of high-speed diesel rose by 6.21pc, kerosene by 28.14pc, followed by lubricating oil by 6.57pc, jute batching oil by 50.92pc and solvent naphtha by 31.34pc.\n\nThe furnace oil production dipped 0.96pc, LPG 3.80pc and jet fuel oil 12.65pc.\n\nThe automobile sector grew 45.74pc in 7MFY25 on a YoY basis. This growth was mainly contributed by a growth of 41.66pc in jeeps and cars, followed by LCVs 201.45pc, trucks 129.97pc, and buses 46.23pc. However, the production of diesel engines declined by 8.78pc during the months under review.\n\nIn the last few years, the automotive industry has grappled with multiple challenges, including a decline in demand, exacerbated by factors such as rising car prices due to inflation and currency fluctuations. Moreover, non-enticing auto financing options offered by banks further dampen consumer interest.\n\nThe production of pharmaceutical products grew 1.96pc and fertilisers 0.65pc, respectively.\n\nIron and steel production declined 11.96pc in 7MFY25. Billets/ingots, mostly consumed in the construction industry, experienced a 28.68pc decline. Similarly, H/CR sheets/strips/coils/plates grew adversely by 2.49pc.\n\nThe production of rubber products declined by 1.23pc, non-metallic minerals by 12.18pc and electrical equipment 18pc.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d891a0e6758.jpg",
  "retrievedAt": "2025-10-12T02:01:26.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898583/big-industry-production-shrinks-122pc-in-january",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:25.000Z"
}
