{
  "title": "Tech entrepreneur wins libel case against UK paper - World - DAWN.COM",
  "author": null,
  "content": "LONDON: The UK’s Telegraph Media Group has issued an apology and agreed to pay “substantial” damages to tech entrepreneur Zia Chishti in a libel settlement.\n\nBetween 2021 and 2023, The Telegraph published reports on allegations of sexual misconduct made by Tatiana Spottiswoode, a former employee of Afiniti, the artificial intelligence company founded by Mr Chishti. She had presented her claims before the US Congress Judiciary Committee.\n\nMr Chishti, the Pakistani-American businessman, refuted the allegations and initiated libel proceedings against The Telegraph.\n\nIn July 2023, a high court judge ruled that two of The Telegraph’s articles carried a defamatory meaning.\n\nInitially, the newspaper defended its reporting, asserting that it was both in the public interest and substantially true. However, it has since withdrawn its defence and opted for a settlement. The newspaper apologised to Mr Chishti in court, in print, and online.\n\nIn a statement, the publication said: “On 17 March 2025, The Telegraph made a statement in open court that it withdraws its earlier position that the above allegations were true and that they were made in the public interest. The Telegraph apologises to Mr Chishti and his family for the harm they have been caused. Finally, The Telegraph has agreed to pay Mr Chishti a substantial sum by way of damages and a contribution to his legal costs.”\n\nThe scandal had financial repercussions, as TRG Pakistan Limited, a company also led by Mr Chishti, saw its stock price decline significantly.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/18113626151fa8c.png",
  "retrievedAt": "2025-08-25T15:16:20.983Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898605/tech-entrepreneur-wins-libel-case-against-uk-paper",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:06.000Z"
}
