{
  "title": "Karachi police arrest man for allegedly torching wife over infidelity dispute - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Karachi Police on Tuesday arrested a suspect who allegedly set his wife on fire when she objected to his infidelity in Korangi Industrial Area’s Mehran Town.\n\nKorangi Senior Superintendent of Police (Investigation) Mohammed Qais Khan told Dawn.com, “The police conducted a raid in the Azeempura area of Shah Faisal Colony and arrested the suspect.”\n\nHe said the suspect had allegedly torched his wife on Saturday and she was currently admitted at the Burns Centre of Civil Hospital Karachi for treatment.\n\nThe wife had filed a first information report (FIR) on Sunday under Section 324 (attempt to murder) of the Pakistan Penal Code.\n\nShe said that she married her husband around two years ago out of love, adding that the couple had no children. She said that her husband’s attitude changed soon after marrying her, as he started physically abusing her regularly.\n\nThe FIR said he had also “developed an interest in other women”. On March 14, when he did not return home until late at night, the wife said she suspected that he might be in the company of another woman.\n\nThe wife said in the FIR that her husband picked up the cell phone when she attempted to contact the other woman, and began hurling abuses at her for making the phone call.\n\nThe FIR said when the suspect returned home at 11:45pm, he began beating his wife and poured kerosene oil over and torched her in a fit of anger.\n\nIt added that the suspect managed to escape, while the wife said she suffered burn injuries and her father-in-law took her to the Burns Centre for treatment. The complainant said she wanted legal proceedings against her husband for beating and torching her.\n\nAlso on Saturday, a woman seeking khula was allegedly killed by her husband outside the Malir court premises. The police had said that Rehmat Begum, 45, was stabbed to death and her 18-year-old daughter was injured by her husband, Sarwar, outside the Malir Court. Following the incident, the police had arrested the suspect.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:15:56.656Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898741/karachi-police-arrest-man-for-allegedly-torching-wife-over-infidelity-dispute",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T17:31:28.000Z"
}
