{
  "title": "A new direction - Newspaper - DAWN.COM",
  "author": null,
  "content": "WITH the security situation in Balochistan and KP rapidly deteriorating, Pakistan’s civil and military leadership must come up with a new plan to effectively deal with all aspects of the respective insurgencies.\n\nThis will be the main focus of today’s meeting of the parliamentary panel on national security. The in-camera huddle will feature the prime minister and army chief, all four chief ministers as well as cabinet members and representatives of political parties.\n\nThe threat to national integrity is significant, and this is no time for partisan politics; the state and its institutions must listen to all shades of opinion in order to formulate a holistic counterterrorism and peacebuilding policy.\n\nWhile the TTP-led terrorist campaign mostly affecting KP has been steadily gaining momentum since the Afghan Taliban returned to power in Kabul, the separatist insurgency piloted by the banned BLA now appears to have large parts of Balochistan firmly in its grip.\n\nThis shocking reality was brought home by last week’s bloody hijacking of the Jaffar Express, and the subsequent targeting of security men in Noshki. There is a long list of other major and minor terrorist incidents in the province. When the lawmakers, generals and politicians meet in Islamabad behind closed doors today, it is these grave threats to national security that will dominate the agenda.\n\nThe easiest course to pursue would be the kinetic response. But while this may temporarily disable violent actors, it will not address the underlying factors that have provided ideological fuel to these insurgencies: poverty, underdevelopment, lack of justice and the resultant alienation from the state. These factors, as highlighted by the non-kinetic dimensions of the National Action Plan, need equal attention.\n\nOf course, securing territory and eliminating threats to peace are prerequisites for any plan to succeed. But unless the civilian arm of the state complements the kinetic dimension of CT operations with political efforts and meaningful development work, the gains in the field will be unsustainable.\n\nMoreover, it is essential that all political forces are included in national CT and peacebuilding efforts. Accusing some parties of being ‘anti-national’ and supporting the militants’ narrative is counterproductive. Helpful critique should be heard with open minds. The present course of action has failed to bring peace to Balochistan and KP, hence fresh approaches are required. Having said that, opposition parties should also refrain from scoring political points, and, instead, bring constructive criticism to the discussion.\n\nThe blueprint to contain violence and forge a more peaceful path exists in the shape of NAP. Now, all stakeholders must display the vision and the will to implement the document’s points, combining force where required with political reconciliation in order to bring peace to Balochistan, KP and the rest of Pakistan.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:16:00.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898639/a-new-direction",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T03:18:10.000Z"
}
