{
  "title": "Six terrorists killed in KP attacks, gun battles - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT / PESHAWAR / KHUZDAR: The violence-affected provinces of Khyber Pakhtunkhwa and Balochistan witnessed fresh incidents over the past 24 hours in which a cop embraced martyrdom, another suffered injuries while six militants were killed, police and other sources said.\n\nOfficials said armed motorcyclists targeted lower head constable Arman Khan on Miramshah road in Bannu. “The cop lost his life while the assailants escaped the scene,” they added.\n\nThey said the policeman was deployed on security duty at the Judicial Complex.\n\nThe body was taken to Police Lines where police officials, local elders and the martyr’s relatives attended his funeral prayer.\n\nIn Lakki Marwat, police repulsed a militant attack on a police station in Serai Gambila town late Sunday night.\n\nMilitant hideouts destroyed; cop’s family members injured in Khuzdar grenade assault\n\nTerrorists attacked the police station with light and heavy weapons but law enforcers fought bravely and foiled it, the officials said, adding that all policemen remained safe in the gun battle which lasted around 15 minutes.\n\nMeanwhile, police claimed to have destroyed the mountainous hideouts of terrorists in the Kurrum Par area after a two-day operation.\n\nAccording to an official, the operation was launched on Saturday when militants had attacked the Dadiwala police station and Abbasa Khattak police post, leading to a fierce shootout in which a militant was neutralised.\n\nHe said police officials were taken aback when they found long caves and tunnels made by terrorists, adding that militants used these places as sanctuaries after carrying out terrorist attacks.\n\nPolice and CTD commandos killed two terrorists in an intelligence-based operation in Bannu, a police official said, adding that the slain terrorists had martyred LHC Arman Khan.\n\n“When policemen got close to the terrorists’ hideout, they opened fire, leading to a gun battle which lasted for half an hour.”\n\n“The cops seized arms and ammunition and shifted their bodies to a hospital,” he said.\n\nMeanwhile, a police official sustained injuries in an attack in the Chamkani area near Peshawar, police said in a statement.\n\nASI Tariq Khan was shifted to hospital, it said, adding that he was posted at School of Investigation Mera Kachorhi.\n\nThree militants were killed in a shootout with security forces in Khyber district on Monday, the military said.\n\nThe security forces, on the reported presence of militants, conducted an IBO in the Tor Darra area, said an ISPR release, adding that the troops killed three militants during a gun battle.\n\nGrenade attack\n\nFive family members of a police officer were injured in a grenade attack on his residence in Khuzdar on Monday.\n\nArmed motorcyclists lobbed a hand grenade into the house of SHO City Police Station, Hub, Abdul Qadir Sheikh, and escaped, SSP Khuzdar Javed Zehri told Dawn.\n\n“The grenade exploded inside the house injuring the father of the police officer and four children of his brothers,” he said, adding that some portions of the house were damaged in the incident.\n\nPolice shifted the five injured to district hospital Khuzdar. Three of the injured were identified as Abdul Ghaffar, Bushra and Afshan. The father of the police officer was moved to Karachi for treatment as he had received multiple injuries.\n\nGhulam Mursalin Marwat in Lakki Marwat, Umar Farooq in Peshawar and Abdul Wahid Shahwani in Khuzdar contributed to this report\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d8934e3e835.jpg",
  "retrievedAt": "2025-08-25T15:16:28.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898589/six-terrorists-killed-in-kp-attacks-gun-battles",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:48:57.000Z"
}
