{
  "title": "Netanyahu’s move to fire chief of Shin Bet sparks outrage - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: Prime Minister Benjamin Netan­yahu’s bid to dismiss a top security official has threatened to plunge Israel back into deep political crisis, with opponents on Monday organising protests and a former court president warning against the “dangerous” move.\n\nNetanyahu on Sunday cited an “ongoing lack of trust” as the reason for moving to sack Ronen Bar, head of the Shin Bet internal security agency, following a similar bid by the government to oust the attorney general. Bar, who has been engaged in a public spat with Netanyahu in recent weeks over reforms to the agency, suggested there were political motives behind the premier’s decision to ask the government to dismiss him.\n\nAttorney General Gali Baharav Miara — the executive’s top legal adviser who has often taken positions that clashed with those of Netanyahu’s government — said the move was “unprecedented” and its legality needed to be assessed. Bar said it stemmed from his own refusal to meet Netanyahu’s demands for “personal loyalty”.\n\nThe agency led by Bar has been accused of failing to prevent the October 7, 2023 Hamas raid that triggered conflict in the Gaza Strip.\n\nSeveral opposition parties have already announced they will jointly petition the High Court against Bar’s dismissal, and the attorney general said in a letter to Netanyahu that he could not initiate the process “until the factual and legal foundation of your decision is fully clarified”.\n\nBaharav Miara is herself under threat of a no-confidence motion submitted by Justice Minister Yariv Levin, who has spearheaded efforts to reform the judiciary and curb the court’s powers — a plan that sparked major protests before coming to an abrupt halt with Hamas’s 2023 attack.\n\nLevin has accused Baharav Miara, a fierce defendant of the judiciary’s independence, of “inappropriate conduct” and cited “significant and prolonged disagreements between the government and the attorney general”. The proceeding against the two figures promise to be lengthy, risking a repeat of the 2023 protest movement that was one of the most significant in Israel’s history and had deeply fractured the country.\n\n‘Blow to national security’\n\nThe Kaplan Force, a liberal umbrella organisation which led the fight against the judicial reform, on Monday announced rallies in Jerusalem and Tel Aviv this week to protest the dismissal of the Shin Bet head. The move to sack Bar, who has been involved in negotiations over the fragile ceasefire in Gaza, comes at a crucial time for the talks.\n\nThe truce has largely held since Jan 19 despite an impasse in efforts to extend it. Since the Gaza conflict began, Netanyahu has dismissed his defence minister, Yoav Gallant, while several senior military officials have resigned including army chief Herzi Halevi.\n\nBenny Gantz, an opposition figure who once served as defence minister under Netanyahu, said on X that “the dismissal of the head of the Shin Bet is a direct blow to national security and a dismantling of unity within Israeli society, driven by political and personal considerations.”\n\nFormer Supreme Court president Dorit Beinisch told Kan public radio that Netanyahu was leading “processes that are dangerous for society”. “We need to wake up, and to wake up in time,” she said.\n\nFor Netanyahu’s allies, the move against Bar falls within the normal rights of the head of government. “In what normal country is a special reason even needed to remove the head of an intelligence organisation who is personally responsible for a massive intelligence failure that led to the greatest disaster in the history of Israel?” far-right Finance Minister Bezalel Smotrich wrote on Telegram.\n\nPublished in Dawn, March 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:16:13.813Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898594/netanyahus-move-to-fire-chief-of-shin-bet-sparks-outrage",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T02:49:17.000Z"
}
