{
  "title": "Housing Sector – A step forward for economic revival",
  "link": "https://www.app.com.pk/business/housing-sector-a-step-forward-for-economic-revival/",
  "date_published": "2020-07-19T04:12:00.000Z",
  "source": "APP",
  "content": "Incentives for housing sector are hoped to provide the economy a breathing space and help country fight against challenges like slowing growth, balance of payment, current account deficit, price hike and above all the pandemic Covid-19. The government leaped forward with bundle of incentives to fight these odds and Prime Minister Imran Khan himself unveiled the package for builders and other associated sectors during first week of April. “Our decision is aimed at reviving economic activities in the country. People investing in this sector during year 2020 would not be asked about source of income. They would also benefit from fixed tax regime,” the Prime Minister said. His package included tax incentives, waivers and subsidies in sales tax, capital gain tax and withholding tax. “Fixed tax at rate of per sq yard or per sq meter would be charged from investors. Those investing in Naya Pakistan Housing Program would be given 90% rebate in fixed tax.”\nThe Prime Minister has announced subsidy on five and 10 marla houses, allocation of 5 percent banks’ financing for house-building and a one-window operation to facilitate builders.\nHe said for the construction of affordable houses for middle and lower classes under the Naya Pakistan Housing Project, an amount of Rs 30 billion had been allocated as subsidy for its initial phase.\n“The mark-up on bank loans for houses up to five and 10 marlas would be five and seven percent respectively that would help boost the economy, ”the Prime minister said. “We are also simplifying the cumbersome process of loan processing, NoCs and taxation.”\nThe National Coordination Committee would play role in removing hiccups in the process relating to the State Bank of Pakistan and commercial banks on house-building finance.\n“We have also decided to cut down the number of no objection certificates (NOCs), launch web portal for one window operation and actions would be time bound,” the PM informed.\nImran Khan said Covid-19 pandemic had resulted in global economic recession to which Pakistan was also a victim. “We took the decision of incentivizing housing sector as it will generate economic activity, jobs and provide shelters to homeless poor in the country.”\nThe government has also decided not to question the source of money spent in the housing sector till December 31, 2020 as the Prime Minister urged the investors, builders and people to avail the opportunity as it was an unprecedented step taken by any government in Pakistan.\nThe government has passed `the Naya Pakistan Housing and Development Authority (NPH&DA) Bill, 2019 to implement NPHP and the scheme recorded mammoth response with millions of people registration with the program. Construction sector is one of the major contributors in country’s economy employing eight percent of total labor force. As the country requires 400,000 units annually, the NPHP would mitigate this burden. As Prime Minister Imran Khan and his team are on toes to make the NPHP projects a success.\nCommending the pro-poor policy of the government, Minister for Information and Broadcasting Senator Shibli Faraz said, welfare of poor and vulnerable segments of the society was prime focus of Prime Minister Imran Khan. “Announcement of the historic package for the construction industry was a timely step as the sector would benefit more than 40 allied industries resulting in economic revival.”\nHe reiterated the government’s seriousness in promoting housing sector and said, National Coordination Committee on Housing headed by General Hyder has been created to remove bottlenecks.\nThe government is providing facilities to construction sector by removing hurdles and giving incentives in the shape of tax reduction, one window operation and simplifying NoC process, he remarked. “Our target is to construct 100,000 houses in the first phase.”\n“It was the objective of the government to materialize the dreams of lower income people of having houses by easing the cumbersome process of getting no-objection certificates, approval of house designs, power and gas connections and above all bank financing,” he stated.\nThe commercial banks had been issued directives to allocate five per cent of their lending portfolio for the construction industry that would make over Rs 300 billion while the government would also provide Rs 130 billion subsidy to poor.\n“The government desires the builders and developers to take full advantage of this package and start their projects before December 31,” the minister said.\nChairman Naya Pakistan Housing Development Authority (NPHDA) Lt. Gen. (retd) Anwar Ali Hyder also mentioned to the government’s vision of incentivizing the construction industry for the benefit of multiple industries, overall economic activity and jobs creation.\nHe expressed hope that simplified documentation process and other measure to ensure ease of doing business would help attract more and more investors to invest in construction industry.\n“It was difficult for an investor to get approval in the past, but now the government has eased ‘Approval Regime’ to facilitate the investors of the construction sector,” he said.\nThe chairman said NCC established for housing sector would also play its role in removing hiccups in the process relating to the State Bank of Pakistan and commercial banks on house-building finance.”It would also ensure simplification of the process of loans disbursement and remove other hiccups.”\nHe urged the investors, builders and people to avail the opportunity by December 31, 2020 as it was an unprecedented package announced by any government in the country.\nHe said the investors, investing in construction industry till December 31 would not be asked for their source income. They should avail this opportunity as it was an unprecedented step taken by any government in the country.\nMohsin Sheikhani, Chairman Associations of Builders and Developers of Pakistan (ABAD) welcomed the package with remarks that in 70 years for the first time any government declared housing sector an industry. This has been under discussion at every forum. This measure would help achieve the target of constructing five million houses and create 15 million jobs,” Sheikhani said. “If initially the government starts with one million houses, it would create 2.5 million jobs and revive 40 to 72 allied industries. The package would be very useful for construction industry,” he said. He noted that Covid-19 has slowed down economic growth across the world but we believe that brisk advancement on this project would help bring economic turnaround. “Construction industry is backbone of our economy and its flourishing would help overcome housing unites shortage, growth of allied industries and jobs creation,” Sheikhani said\nAbid Qayyum Sulehri, an economist and Executive Director SDPI, saw the construction sector as a future driving force for the economy. As he welcomed the Prime Minister’s package, he also pleaded more incentive to benefit the common man. “People should be given facility to pay bearable monthly installment of their houses to make them ultimately the owner of these houses.” He suggested creating harmony between public and private sector and extend taxation facilities across the board for all housing and allied sectors. Suleri proposed NPHA to encourage private builders and developers giving them target to construct low cost housing units and banks start providing mortgage on easy conditions, the government’s sincere steps would bear more fruits.\nBuilders and real estate agents have also seen this package as a major initiative for revival of the sector as they hoped the government incentives would definitely restore confidence of the local and foreign investors. “Key factor is investors’ confidence and giving construction sector, the status of industry would help restore confidence of investors. We are grateful to the PTI government,” said Chief Executive Officer of Makeen Marketing Pvt. Limited Hassan Talal, a builder associate of Bahria Town and Blue World city project. “Rationalization of taxation would also have positive impact. NPHP would also help boost construction industry,” he noted. Talal suggested construction of high rise buildings to meet demand of residential units and bridge the gap between small and mega construction projects.\nMuhammad Ahsan, a builder and Interior Designer saw the incentive package as a ‘well in time endeavor’ of the government for putting construction sector back on track and revival of economy. “The boom in construction sector would provide business to 40 sectors and generate employment. If the pace continues the target of constructing five million houses would be achievable,” he noted. He sought incentives for contractors and small builders in getting bank loans, guarantees and securing their business. He also pleaded the plight of labor seeking health, insurance and other facilities for this segment for being always at risk of injuries at workplace. “They play key role in flourishing of this sector. But, lack incentives in case of injuries or disabilities.”\nPrivate housing societies also see the package as a step forward for boosting real estate business and describe it a marvelous job of the government. “It is the best, any government could offer for the sector in an era of turmoil due to Covid-19. It would help steer through the crisis times,” said Muhammad Mansha Sahi Secretary Civilian Cooperative Housing Society (Soan Garden). “But, we want implementation of the package in letter and spirit. Our sector is also hit by mafias and we desire the government focus to curb this curse,” he demanded. He commended the decision to giving construction sector a status of industry and hoped it would help flourish the sector. “This sector has much potential if the confidence of investors is restored.”",
  "retrievedAt": "2025-08-11T19:31:02.219Z"
}
