{
  "title": "Housing sector – a ray of hope for economic revival",
  "link": "https://www.app.com.pk/national/housing-sector-a-ray-of-hope-for-economic-revival/",
  "date_published": "2020-07-19T02:48:00.000Z",
  "source": "APP",
  "content": "Muhammad Aftab Zahoor\nISLAMABAD, Jul 19 (APP):Incentives for the housing sector are hoped to provide the economy a breathing space after its years’ long struggle against diminishing growth, balance of payment, current account deficit, price hike issues and above all the pandemic COVID-19.\nThe government leaped forward with a bundle of incentives to fight these odds and Prime Minister Imran Khan himself unveiled the package for builders and other associated sectors during the first week of April.\nSharing his vision of providing shelter to the homeless in the country, the Prime Minister had announced waiver in sales tax, capital gain tax, withholding tax and 90% rebate in fixed tax for investors of the Naya Pakistan Housing Scheme.\nHe announced Rs 30 billion subsidy for salaried and lower middle class under the NPHP, consolidation of provincial taxes, ease of doing business, giving the construction sector status of an industry and constitution of National Coordination Committee for Housing Sector.\n“Our efforts are aimed at providing houses for the poor, reviving housing industry, economy and generate jobs,” the Prime Minister had stated.\nThe banks would allocate Rs 330 billion for the sector. Mortgage of five and ten marla houses would be available at five and seven percent mark-up respectively with Rs 30 billion allocated as subsidy for low cost houses under the NPHP.\nLoan processing, No Objection Certificates (NOCs) and taxation have been simplified and the NCC has been tasked to remove bottlenecks as the Prime Minister and his team are all out to make the project a success.\n“The Prime Minister has announced a historic and unprecedented package. It will revive more than 40 allied industries and create jobs,” Minister for Information and Broadcasting Senator Shibli Faraz had remarked at a news conference.\n“It is a timely step as the sector would help ameliorate the lot of poor and vulnerable people,” he had stated. “It manifests the vision of the Prime Minister. Our target is to construct 100,000 houses in first phase.”\nHe mentioned to easing the cumbersome process of getting NOCs, utilities connections, transfer process and waivers for the industry.\nChairman of the Naya Pakistan Housing Development Authority (NPHDA) Lt. Gen. (retd) Anwar Ali Hyder was also hopeful for brisk progress and smooth sailing of the project in the wake of incentives announced by the Prime Minister.\n“The Authority will ensure ease of doing business by removing hurdles and the Prime Minister will himself monitor the progress,” he had stated.\nHe had urged the investors, builders and people to avail the opportunity by December 31, 2020 as it was an unprecedented package announced by any government in the country.\nBuilders, investors, economists, real estate agents and representatives of the private sector housing societies have welcomed the incentives and hoped the initiative would help fight out economic recession and generate employment.\n“In 70 years for the first time any government has declared the housing sector as an industry. This has been under discussion at every forum,” said Mohsin Sheikhani, Chairman of Associations of Builders and Developers of Pakistan.\n“This measure will help achieve the target of constructing five million houses and create 15 million jobs,” Sheikhani said. “If initially the government starts with one million houses, it will create 2.5 million jobs and revive 40 to 72 allied industries.”\n“The construction industry is the backbone of our economy and its flourishing will help overcome housing unites shortage, growth of allied industries and jobs creation,” Sheikhani said.\nAbid Qayyum Sulehri, an economist and SDPI Executive Director , saw the construction sector as a future driving force for economy if it were made poor centric.\n“The poor people should be given facility to pay bearable monthly installment of their houses to make them ultimately the owner of these houses,” he suggested.\nHe also proposed creating harmony between public and private sector by extending taxation facilities across the board and encouraging private builders and developers giving them target to construct low cost housing units.\n“The government should have to keep a vigil on the mortgage process ensuring the investors to get fully benefitted from this scheme,” he added.\nReal estate agents and marketers have also seen this package as a major initiative for revival of the sector and restore confidence of the local and foreign investors.\n“Key factor is investors’ confidence and giving construction sector, the status of industry would help restore confidence of investors. We are grateful to the PTI government,” said Chief Executive Officer of Makeen Marketing Pvt. Limited Hassan Talal.\n“Rationalizing taxation would have positive impact and help boost the construction industry,” he noted and suggested construction of high rise buildings to meet the houses demand and bridge gap between small and mega construction projects.\nMuhammad Ahsan, a builder and interior designer, saw the incentive package as ‘well in time endeavour’ for putting the construction sector back on track.\n“This initiative would provide business to over 40 industries and generate employment. If the pace continues the target of constructing five million houses would be achievable,” he noted.\nHe sought health insurance and other facilities for labor class, who are always at the risk of injuries.\nPrivate housing societies also see the package as a step forward for boosting the real estate business and describe it a marvelous job of the government.\n“It is the best, any government could offer for the sector in an era of turmoil due to COVID-19. It would help steer through the crisis times,” said Muhammad Mansha Sahi, Secretary of Civilian Cooperative Housing Society (Soan Garden).\n“But, we want implementation of the package in letter and spirit. Our sector is also hit by mafias and we desire the government focus to curb this curse,” he demanded.\nHe commended the decision to giving construction sector a status of industry and hoped it would help flourish the sector. “This sector has much potential if the confidence of investor is restored.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:31:04.099Z"
}
