{
  "title": "Trump considers gutting US diplomatic footprint in Africa: draft plan - World - DAWN.COM",
  "author": null,
  "content": "The United States would drastically reduce its diplomatic footprint in Africa and also scrap State Department offices dealing with climate change, democracy and human rights, according to a White House order under consideration.\n\nSecretary of State Marco Rubio said The New York Times, which first reported the existence of the draft order, had fallen “victim to another hoax.” “This is fake news,” Rubio posted on X on Sunday.\n\nHowever, a copy of the draft executive order viewed by AFP calls for “full structural reorganisation” of the State Department by October 1 of this year.\n\nThe aim, the draft order says, is “to streamline mission delivery, project American strength abroad, cut waste, fraud, abuse, and align the Department with an America First Strategic Doctrine.”\n\nThe biggest change would be organising US diplomatic efforts into four regions: Eurasia, the Middle East, Latin America and Asia-Pacific.\n\nThe current Africa Bureau would be eliminated. In its place would be a “Special Envoy Office for African Affairs” that reports to the White House’s internal National Security Council, rather than the State Department.\n\n“All non-essential embassies and consulates in Sub-Saharan Africa shall be closed,” the draft order says, with all remaining missions consolidated under a special envoy, “using targeted, mission-driven deployments”.\n\nThe draft executive order obtained by AFP has not been discussed publicly by officials. However, it comes amid a flurry of moves by US President Donald Trump to cut decades-old US soft power initiatives and to question long-held alliances, including with Nato.\n\nThe latest proposal under discussion follows the leaking to US media of another proposed plan under which the State Department would see its entire budget slashed by half. In the latest draft plan, current offices dealing with climate change and human rights would be “eliminated.”\n\nThe US footprint in Canada, a key ally of Washington that Trump has repeatedly suggested should be annexed and made a 51st state, would see a “significantly reduced team”. The embassy in Ottawa would “significantly downscale.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/20201425009a033.jpg",
  "retrievedAt": "2025-08-25T14:26:59.966Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905485/trump-considers-gutting-us-diplomatic-footprint-in-africa-draft-plan",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T16:00:08.000Z"
}
