{
  "title": "Russia, Ukraine accuse each other of breaching Easter truce - World - DAWN.COM",
  "author": null,
  "content": "Russia and Ukraine on Sunday accused each other of violating an Easter truce announced by Russian President Vladimir Putin.\n\nUkraine’s President Volodymyr Zelensky said Russian forces were continuing their shelling and assaults along the front line despite Putin announcing the surprise truce.\n\nThe 30-hour truce starting Saturday evening to mark the religious holiday could be the most significant pause in the fighting throughout the three-year conflict.\n\nThe Ukrainian air force did not report any drone launches or missile attacks overnight.\n\nBut Zelensky accused Russia of having kept up its attacks on the front line after the truce started.\n\nRussia’s defence ministry, in turn, said it had “repelled” attempted assaults by Ukraine and accused Kyiv of launching hundreds of drones and shells, causing civilian casualties.\n\n“Despite the announcement of the Easter truce, Ukrainian units at night made attempts to attack” Russia’s positions in the Donetsk region, the ministry added.\n\nA woman and two children were wounded by a drone attack in Russia’s Belgorod border region, the governor, Vyacheslav Gladkov, said.\n\nThe Russian-appointed mayor of Gorlovka in the occupied part of the Donetsk region, Ivan Prikhodko, said two civilians had been wounded without giving details.\n\nZelensky said Ukraine saw hundreds of attacks and drone launches on Sunday.\n\n“The Ukrainian army is acting and will continue to act in an absolutely mirror image” of Russia, Zelensky said.\n\nThe Russian defence ministry insisted its troops had “strictly observed the ceasefire”.\n\nRussia launched its full-scale invasion of neighbouring Ukraine in February 2022 and now occupies around 20 per cent of the country.\n\nPutin’s order to halt all combat over the Easter weekend came after months of efforts by US President Donald Trump to get Moscow and Kyiv to agree to a ceasefire.\n\nOn Friday, Washington even threatened to withdraw from talks if no progress was made.\n\nUkrainian soldiers told AFP that they had noticed a lull in fighting.\n\nA drone unit commander said that Russia’s activity had “significantly decreased both in Zaporizhzhia and Kharkiv regions”, the war-torn areas in the south and northeast where the unit is active.\n\n“Several assaults were recorded, but those were solitary incidents involving small groups,” the commander told AFP, speaking on condition of anonymity.\n\n“Fewer guys (soldiers) will die today.”\n\nRussian “artillery is not working. it is quiet compared to a regular day,” Sergiy, a junior lieutenant fighting in the Sumy border region, wrote to AFP in a message.\n\n“Drones are flying, of course. Those are mostly reconnaissance drones, not strike ones.”\n\nUkrainian troops “are on the defensive”, he said. “If the enemy doesn’t move forward, they don’t shoot.”\n\nAFP journalists standing on a high vantage point in eastern Ukraine heard fewer explosions than usual and saw no smoke on the horizon.\n\nPutin announced the truce from 6pm on Saturday to midnight on Sunday in televised comments, saying it was motivated by “humanitarian reasons”.\n\nWhile he expected Ukraine to comply, Putin said that Russian troops “must be ready to resist possible breaches of the truce and provocations by the enemy”.\n\nZelensky said Ukraine would follow suit, and proposed extending the truce 30 days beyond Sunday to “give peace a chance”.\n\nHe said on Sunday that Russia “has not yet responded to this”.\n\nPutin earlier rejected a proposed 30-day full and unconditional ceasefire.\n\nPrevious attempts at holding ceasefires for Easter in April 2022 and Orthodox Christmas in January 2023 were not implemented after both sides failed to agree on them.\n\nIn Kyiv on Sunday, as Easter bells rang out, people expressed doubts over whether Russia would observe the truce or agree with Zelensky’s proposal to extend it.\n\n“They’ve already broken their promise. Unfortunately, we cannot trust Russia today,” said 38-year-old Olga Grachova, who works in marketing.\n\n“Our president has clearly said that if they announce a 30-hour ceasefire, we will announce a 30-day ceasefire. So let them go for it […] so that this terrible war ends, so that our people, our soldiers, and children stop dying,” said Sergiy Klochko, 30, a railway worker.\n\nBut Natalia, a 41-year-old medic, said of Zelensky’s 30-day proposal: “Everything we offer, unfortunately, remains only our offers. Nobody responds to them.”\n\nOn the streets of Moscow, people said they welcomed an Easter truce but expressed uncertainty over whether it brought the end of the war closer.\n\n“We dreamt, of course, that peace would come by Easter. Let it come soon,” said Svetlana, a 34-year-old housewife.\n\n“I think that this awful thing will end at some point, but not soon,” said Irina Volkova, a 73-year-old pensioner.\n\n“All is not going well for us in Ukraine,” she added: “People are dying, our guys are dying.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/20215702978be14.jpg",
  "retrievedAt": "2025-08-25T14:27:03.105Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905456/russia-ukraine-accuse-each-other-of-breaching-easter-truce",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T07:32:22.000Z"
}
