{
  "title": "Scientists claim to have discovered ‘new colour’ no one has seen before - World - DAWN.COM",
  "author": null,
  "content": "A team of scientists claim to have discovered a new colour that no human has ever seen before, the BBC reported on Saturday. The research follows an experiment in which researchers in the US had laser pulses fired into their eyes.\n\nBy stimulating specific cells in the retina, the participants claim to have witnessed a blue-green colour that scientists have called “olo”, but some experts have said the existence of a new colour is “open to argument”.\n\nThe findings, published in the journal Science Advances on Friday, have been described by the study’s co-author, Prof Ren Ng from the University of California, as “remarkable”. He and his colleagues believe that the results could potentially further research into colour blindness.\n\nProf Ng, who was one of five people to take part in the experiment, told BBC Radio 4’s Today programme on Saturday that olo was “more saturated than any colour that you can see in the real world”.\n\n“Let’s say you go around your whole life and you see only pink, baby pink, a pastel pink,” he said. “And then one day you go to the office and someone’s wearing a shirt, and it’s the most intense baby pink you’ve ever seen, and they say it’s a new colour and we call it red.”\n\nDuring the team’s experiment, researchers shined a laser beam into the pupil of one eye of each participant. There were five participants in the study — four male and one female — who all had normal colour vision. Three of the participants — including Prof Ng — were co-authors of the research paper, according to BBC.\n\nAccording to the research paper, the participants looked into a device called Oz which consists of mirrors, lasers and optical devices. The equipment was designed previously by some of the involved researchers — a team of scientists from UC Berkeley and the University of Washington, and updated for use in this study.\n\nThe retina is a light-sensitive layer of tissue at the back of the eye responsible for receiving and processing visual information. It converts light into electrical signals, which are then transmitted to the brain via the optic nerve, enabling us to see.\n\nThe retina includes cone cells, which are cells responsible for perceiving colour. There are three types of cone cells in the eye — S, L and M — and each one is sensitive to different wavelengths of blue, red and green, respectively.\n\nAccording to the research paper, in normal vision, “any light that stimulates an M cone cell must also stimulate its neighbouring L and/or S cones”, because its function overlaps with them.\n\nHowever, in the study, BBC quoted the paper saying the laser only stimulated M cones, “which in principle would send a colour signal to the brain that never occurs in natural vision”. This means the colour olo could not been seen by a person’s naked eye in the real world without the help of specific stimulation. To verify the colour observed during the experiment, each participant adjusted a controllable colour dial until it matched olo.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680441a554106.jpg",
  "retrievedAt": "2025-08-25T14:27:17.277Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905379/scientists-claim-to-have-discovered-new-colour-no-one-has-seen-before",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:30.000Z"
}
