{
  "title": "Equities resume recovery drive amid easing tariff tensions - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: After experiencing significant losses in the preceding week due to global uncertainty stemming from the tariff impositions by the US against its trade partners, the Pakistan Stock Exchange (PSX) began its recovery thanks to positive economic developments in the outgoing week.\n\nConcerns about global trade eased, helping global equities rally and reduce losses as US President Donald Trump signalled a possible end to the tariff disputes between the US and China on Thursday.\n\nArif Habib Ltd said the KSE-100 index remained green throughout the week, crossing the 117,000 level, driven by improved macroeconomic indicators and positive sectoral developments.\n\nA major boost came after the announcement of the current account for March, which posted a record surplus of $1.2bn. Furthermore, progress on resolving the power sector’s circular debt further lifted the market sentiment, given leading banks finalised a Rs1.275tr rescue package to stabilise the sector and bolster hopes for structural reforms.\n\nOn the economic front, the Large-Scale Manufacturing (LSM) shrank 3.5 per cent year-on-year in February, reflecting ongoing challenges in the industrial sector. Meanwhile, the Foreign Direct Investment recorded a net inflow of $26m in March. However, the State Bank of Pakistan reserves declined by $127m at $10.6bn.\n\nThe benchmark KSE 100 index surged 2,462 points or 2.1pc to 117,316 points week-on-week.\n\nAKD Securities Ltd said the market regained momentum amid easing concerns over tariff tensions and stability in global crude oil prices. Improved corporate earnings further supported this recovery.\n\nCommercial banks were key contributors to the market’s rally (adding 1,736 points), driven by stronger-than-expected earnings from UBL. Moreover, Fitch upgraded Pakistan’s rating to ‘B-’ from ‘CCC+’ amid expectations that the continuation of stable economic policies will persist in supporting the recovery of foreign exchange reserves and contain external funding needs.\n\nWorkers’ remittances for March reached a record high of $4.1bn. Moreover, power generation in March was reported at 8,411GWh, up 5pc. On the currency front, the rupee slightly depreciated against the greenback, closing the week at Rs280.7.\n\nAccording to AHL, the sector-wise positive contributions came from banks (1,736 points), cement (566 points), automobile (184 points), power (152 points), and Technology (53 points). Meanwhile, the sectors that contributed negatively were fertiliser (288 points), E&P’s (172 points), and miscellaneous. (13 points), engineering (13 points), and cable and electrical goods (8 points). Scrip-wise positive contributors were United Bank Ltd (1,537 points), Lucky Cement Ltd (429 points), Hub Power (160 points), National Bank of Pakistan (149 points), and Sazgar Engineering Works Ltd (121 points). Whereas scrip-wise negative contributions came from Fauji Fertiliser Company (316 points), Mari Energies (231 points), Habib Bank Ltd (65 points), Fatima Fertiliser (22 points) and Engro Polymer and Chemicals Ltd (21 points).\n\nForeigner selling clocked in at $4.01m compared to a net buy of $9.92m the previous week. Major selling was witnessed in ‘all-other-sectors’ ($5.7m), followed by banks ($1.4m). On the local front, buying was reported by Banks ($69.0m) and individuals ($21.9m). The average trading volume fell 18pc to 456m shares, while the value traded settled dipped 5pc to $116m week-on-week.\n\nAccording to AHL, the market will likely maintain its positive trajectory in the upcoming week, supported by improved investor sentiment and strong macroeconomic cues.\n\nAKD Securities said the lower oil prices and favourable standing among exporting peers amid reciprocal tariffs would support the economy and strengthen the outlook for a return to single-digit interest rates in CY25.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:27:30.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905372/equities-resume-recovery-drive-amid-easing-tariff-tensions",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:16.000Z"
}
