{
  "title": "Two sisters die as rains trigger landslides across GB - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Two girls were killed when a wall collapsed due to intermittent rains across Gilgit-Baltistan on Saturday, which also triggered landslides blocking the Karakoram Highway (KKH) and Baltistan Road at multiple points, while flights between Islamabad, Skardu and Gilgit remained suspended for a second consecutive day.\n\nAccording to Rescue 1122, intermittent rains continued on Friday and Saturday across GB, causing widespread disruption.\n\nAccording to police, two sisters, aged eight and nine years, residents of Pedandass Juglote in Gilgit, died when the wall of a compound collapsed following heavy rainfall on Saturday. The two girls were injured and shifted to Shaheed Saifur Rehman Hospital in Gilgit, where both succumbed to injuries.\n\nLandslides, mudflows and rockfalls blocked the KKH at several locations in Kohistan and Diamer.\n\nDownpour suspends flights, disrupts power supply and internet connectivity\n\nPolice said the Gilgit-Baltistan-Kohistan section was blocked at six different points after mudflows and landslides began on Friday evening. However, light traffic movement on the KKH in the Kohistan area was restored on Saturday.\n\nThousands of passengers, including tourists travelling between GB and other parts of the country, who had been stranded for hours, were finally able to resume their journeys.\n\nMany passengers faced hardships, spending long hours in remote areas without basic facilities.\n\nMeanwhile, police said the Baltistan Road was blocked at two points — Shahtot and Tariko in Gilgit — due to ongoing landslides. Continued rainfall has hampered restoration work, and the road remains inaccessible.\n\nThe disruption has cut off all four districts of Baltistan from the rest of the region, stranding thousands of passengers, including foreign tourists, on either side of the road.\n\nOwing to the prevailing weather conditions, all flights between Islamabad, Skardu, and Gilgit remained suspended for the second consecutive day. The rain also disrupted electricity supply in several areas, while mobile and internet connectivity has been reported down in many locations.\n\nMeanwhile, upper parts of the region, including Astore district, received snowfall, further worsening conditions. Rockfalls and landslides also blocked various link roads, particularly in Kharmang district.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680443b4700f0.jpg",
  "retrievedAt": "2025-10-12T02:37:33.824Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905394/two-sisters-die-as-rains-trigger-landslides-across-gb",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:10.000Z"
}
