{
  "title": "Nawaz calls for PPP-govt dialogue on water issue - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A day after Bilawal Bhutto-Zardari’s outburst in Hyderabad, ruling PML-N head Nawaz Sharif has directed the federal government to initiate a dialogue with the PPP to sort out the ongoing water dispute between Punjab and Sindh, saying that political point-scoring should be avoided on such a sensitive national issue.\n\n“We firmly believe in the fair distribution of resources, including water, among all federating units. PML-N president Nawaz Sharif and Prime Minister Shehbaz Sharif have directed (the party) to resolve these issues with the Pakistan Peoples Party (PPP) through dialogue,” Adviser to the PM and Punjab PML-N president Rana Sanaullah Khan said in a statement on Saturday.\n\nNawaz Sharif is currently in London for treatment.\n\nHis directive follows PPP Chairman Bilawal Bhutto-Zardari’s strong warning to the PML-N government on Friday that his party would no longer go along with it if it didn’t shelve the controversial project of building new canals on the Indus river.\n\nSana disapproves of politics over the issue of water\n\n“The lion (election symbol of PML-N) always preys on the people’s blood, and the Shehbaz Sharif government’s policies are anti-farmer. Those planning this project owe their power to the PPP,” Bilawal said at a public gathering in Hyderabad on Friday. The PPP chairman said he thought Shehbaz Sharif would stay away from the [canal] project after such a reaction because he should understand that without PPP support, the government can neither run assembly sessions nor can it pass the budget.\n\n“But it seems Sharif junior is not ready to shelve the project. If that is the case, then we are not ready to give up either,” Bhutto-Zardari said.\n\nResponding to the statement, Rana Sanaullah said: “We hold the PPP leadership in great respect. The PPP is part of the federation and statements made from constitutional positions must be delivered with a sense of greater responsibility.”\n\nHe said with the 1991 Water Accord between the provinces and the 1992 IRSA Act in place, there could be no injustice to any party. “No province’s water share can be diverted to another one. Constitutional mechanisms and laws are in place to ensure this.\n\n“Politics should not be played over the issue of water. Matters must be resolved through dialogue and negotiation at the table,” Mr Sanaullah said, adding the PML-N considered the provinces’ strength as the strength of the federation, and the government would continue to act accordingly, just as it did in the past.\n\nAt the same time, Mr Sanaullah said: “As a party firmly committed to the Constitution and democracy, we will never compromise on the rights of federating units and their people. Dialogue and consultation are the solution to all issues.”\n\nThe water issue has pitted the provincial governments of Punjab and Sindh against each other, with the former claiming water from its share was being diverted to the southern province.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:37:33.888Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905403/nawaz-calls-for-ppp-govt-dialogue-on-water-issue",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:04:59.000Z"
}
