{
  "title": "Railway traffic restored in Sindh’s Khairpur after nationalist parties block track over canals issue - Pakistan - DAWN.COM",
  "author": null,
  "content": "Railway traffic on a track near Sindh’s Khairpur city was restored after activists of some nationalist parties blocked a section of it on Sunday in their ongoing agitation against the much-protested plan to build six new canals on the Indus River.\n\nChief of the Army Staff Gen Asim Munir and Punjab Chief Minister Maryam Nawaz inaugurated the ambitious Cholistan project to irrigate south Punjab’s lands on February 15 amid public uproar and strong reservations in Sindh. The Sindh Assembly also passed a unanimous resolution against the project in March.\n\nThe past few months have seen nationwide protests from political parties, including the ruling coalition ally PPP, and residents against the proposed project.\n\n“The track was blocked at around 11:30am today in Khairpur city area but that blockade has been lifted and normal flow of railway traffic has been restored”, Imran, a railway official in Sukkur’s chief controller office, told Dawn.com.\n\nThe blockade of the railway track was reported in the Sukkur division and not in the Karachi division’s limits, which end at Tando Adam in Sanghar district, according to Karachi deputy chief controller Shakeel Memon.\n\nThe protest on the tracks was led by Amjad Mahesar, senior vice chairman of the Jeay Sindh Qaumi Mahaz (Bashir), in response to his party’s call for a shutter-down strike in Sindh.\n\nMahesar told Dawn.com, “The tracks at Luqman railway crossing remained closed for around three hours by party activists under his leadership and the blockade ended after the protest.”\n\nHe termed the strike as “successful”, claiming that the Khairpur city remained “completely closed”.\n\nThe contentious $3.3 billion Green Pakistan Initiative (GPI) launched by the federal government to develop six canals to irrigate 1.2 million acres of “barren land” in south Punjab has been strongly opposed by the PPP, which is in power in Sindh, as well as farmers and other stakeholders.\n\nAdditional Attorney General Mohsin Qadir Shahwani has informed the Sindh High Court that work on the canals project had been stopped in compliance with its earlier restraining order.\n\nOn April 18, PPP Chairman Bilawal Bhutto-Zardari threatened the ruling PML-N against continuing down the path of confrontation with Sindh over the issue of new canals on the Indus River.\n\nWhile addressing a large public gathering at the Hatri Bypass Ground on Friday night, he said his party would not go along with the federal government if it did not shelve the controversial project, even after acknowledging the PPP’s objections.\n\nFinally, the federal and Sindh governments agreed today to resolve the contentious canals project issue through dialogue, after PML-N President Nawaz Sharif and Prime Minister Shehbaz Sharif ordered that talks be held over the matter.\n\nThe canals controversy has deepened with Sindh Chief Minister Murad Shah strongly criticising the Punjab government for increasing water being diverted to the TP Link Canal. The Indus River System Authority (Irsa) claimed to have taken all decisions as per the law.\n\nMeanwhile, lawyers also blocked the national highway at Babarloi bypass in Khairpur district, continuing their indefinite sit-in against the canals project that they began on April 18.\n\nThe demonstration was being staged in response to the Karachi Bar Association’s (KBA) call, which was backed by the Sindh High Court Bar Association (SHCBA) and other lawyers’ bodies.\n\nThe protest was being jointly led by KBA President Aamir Nawaz Warraich, Hyderabad District Bar Association (HDBA) President Ashar Majeed Khokhar, HDBA General Secretary Masood Rasool Memon, SHCBA Hyderabad President Ayaz Tunio and other bar associations’ representatives.\n\nSHCBA’s Tunio said the railway track was blocked by some protesters but then the protest on the track ended, allowing the railway traffic to proceed. “People requested the protesters that train passengers would suffer badly, therefore they ended the blockade”, Tunio told Dawn.com over the phone.\n\nAlso present at the protest site, HDBA’s Khokhar told Dawn.com on a phone call: “Our 10-member standing committee, of which I am also a member, will meet tomorrow to decide whether to block the railway track or resort to a boycott of court proceedings.”\n\nHe claimed that lawyers were facilitating the passage of ambulances and vehicles for women and families during the ongoing sit-in. “They are being allowed [to pass] safely. It is only trucks and other goods-carrying vehicles that are not given passage on the road”, Khokhar said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:26:58.699Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905483/railway-traffic-restored-in-sindhs-khairpur-after-nationalist-parties-block-track-over-canals-issue",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T14:04:06.000Z"
}
