{
  "title": "Heatwave in Karachi to last till April 23: Met Office - Pakistan - DAWN.COM",
  "author": null,
  "content": "Karachi is likely to experience a heatwave from today with daytime temperature expected to soar to 41 degrees Celsius — around 4-6°C above normal — and will last till April 23 (Wednesday), the Met department said on Sunday.\n\n“Due to heatwave conditions in Karachi, the general public especially children, women and senior citizens are advised to take precautionary measures,” according to the Met department’s advisory issued today, a copy of which is available with Dawn.com.\n\n“Avoid exposure to direct sunlight during the day time and remain hydrated.”\n\nThe advisory noted that hot/very hot and dry weather is likely to prevail over most parts of the province.\n\nSunday saw a maximum temperature of 39-41°C and a minimum of 25°C, with north/northwesterly winds becoming west/southwesterly winds.\n\nAs Sindh has been in the grip of a heatwave for around a week, the harsh weather is taking a toll on people’s health with heatstroke and gastroenteritis on the rise in many districts and towns amid prolonged power outages.\n\nWhile the Sindh health department downplayed the surge in cases, a large number of patients from different towns in Shaheed Benazirabad, Sanghar, and Naushahro Feroze districts have been reported to hospitals in their respective areas.\n\nApril has been a hotter month in central and upper Sindh as average temperature reached up to 45 degrees Celsius. However, mercury soared to 49°C on Thursday after a gap of about seven years in Shaheed Benazirabad, making it unbearable for residents, especially children and elderly persons.\n\nOn Saturday, Jacobabad was the hottest city across the country with 45°C followed by Dadu, Padidan, Mithi and Mohenjo Daro (43°C), Sukkur, Hyderabad and Nawabshah (42°C). The maximum temperature in Karachi and Thatta was 37°C and 36°C.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:27:04.466Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905452/heatwave-in-karachi-to-last-till-april-23-met-office",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T07:00:15.000Z"
}
