{
  "title": "Transporters’ strike ends after four days; exporters claim heavy losses - Business - DAWN.COM",
  "author": null,
  "content": "• 20,000-25,000 containers missed port deadlines during the strike\n• Clearance of backlog expected to take up to 25 days\n• $300,000-$400,000 loss feared as 400 fruit, vegetable containers stuck\n\nKARACHI: The four-day strike by goods transporters, which ended early Saturday morning, has caused significant disruption to trade and port operations, with exporters rep­o­r­ting millions in losses due to delayed shipments and piling backlogs of imported containers.\n\nKarachi Chamber of Commerce and Industry (KCCI) President Jawed Bilwani said traders are estimated to have incurred around Rs120 million in terminal demurrage charges on 12,000 containers stuck at various terminals during the strike.\n\nDuring the protest, some 20,000 to 25,000 export containers could not reach the port. Clearing the backlog is expected to take nearly 20 to 25 days.\n\nMr Bilwani advised business owners to only hire goods carriers with valid driving licences and fitness certificates, adding that transporters had also doubled fares during the disruption.\n\nWaheed Ahmed, patron-in-chief of the All Pakistan Fruit and Vegetables Merchants, Exporters and Importers Association, said that around 400 containers carrying perishable produce had remained stuck during the strike, resulting in major losses to exporters.\n\nHe also raised concern over a separate crisis, noting that 200 to 250 containers, mostly carrying potatoes for the Middle East and Far East, were stranded at the Punjab-Sindh border due to ongoing protests in parts of Sindh against canal projects. He warned of potential spoilage due to limited refrigeration capacity, estimating losses between $300,000 and $400,000.\n\nThese disruptions not only delay shipments but damage exporters’ credibility and Pakis­tan’s reputation for reliability, Mr Ahmed said, warning that international buyers may shift orders to countries like India.\n\nRafique Suleman, a former chairman of the Rice Exporters Association of Pakistan said rice exporters alone suffered losses of $16m over four days.\n\nHe said Pakistan exports rice worth about $4m daily — around Rs 1.12 billion — so the cumulative loss over four days could be Rs5-6 billion. He said exporters could face cancelled orders due to delays and urged the government to consider compensation.\n\nMr Suleman also criticised the federal, provincial and city authorities for their delayed response, which he said allowed the strike to continue and brought rice exports to a standstill.\n\nThe strike was called off following a meeting between the transporters and Karachi Commissioner Syed Hassan Naqvi. Transporters agreed to furnish weekly reports to the DIG Traffic and pledged not to operate unfit vehicles.\n\nMr Naqvi announced that all impounded heavy vehicles would be released immediately, except those deemed severely unfit. The release of such vehicles would only be allowed after affidavits were submitted, committing to keep them off the road until cleared by motor vehicle inspection. The transporters’ association was entirely responsible for complying with these instructions, he said.\n\nTariq Gujjar, president of the Transport Goods Association, said authorities had given transporters a six-month window to implement safety measures, including fitness certification, in a bid to curb rising accidents in Karachi.\n\nHe said the crackdown began prematurely on April 12, although the original implementation date was May 1, following an earlier meeting chaired by the Sindh chief secretary on April 11.\n\nThe meeting had decided to introduce safety enhancements such as installing cameras at the front, rear and driver’s cabin, along with mandatory bumpers on both sides of heavy vehicles.\n\nMr Gujjar noted that 300 vehicles were seized during the crackdown, prompting 10,000 to 15,000 transporters to halt operations, leading to an estimated daily loss of millions of rupees to traders and the economy.\n\nUnder the agreement, transporters will now submit monthly progress reports to authorities on the implementation of agreed safety protocols to control accidents.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68043f564aff5.jpg",
  "retrievedAt": "2025-10-12T02:37:38.189Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905378/transporters-strike-ends-after-four-days-exporters-claim-heavy-losses",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:16.000Z"
}
