{
  "title": "Pakistan reaffirms support for UN peacekeeping - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Interior Minister Mohsin Naqvi on Saturday reiterated Pakistan’s longstanding support for UN peace operations and its commitment to playing a proactive role for global peace.\n\nHe was talking to UN Under-Secretary General for Peace Operations Jean-Pierre Lacroix who called on him at the interior ministry.\n\nMinister of State for Interior Tallal Chaudhry, Interior Secretary Muhammad Khurram Agha and UN secretary-general’s adviser Faisal Shahkar were also present on the occasion.\n\nDuring the meeting, both sides discussed enhancing cooperation between Pakistan and UN peacekeeping missions.\n\nSpeaking on the occasion, Mr Naqvi highlighted the professional contributions of Pakistani military and police officers to various peacekeeping missions and welcomed the resumption of service by Pakistani police officers in the UN peace missions after several years.\n\nHe reaffirmed that Pakistan would continue to provide every possible support to future UN peacekeeping operations. He said it is a moment of pride that a Pakistani Police Service officer is currently heading UN Police.\n\nHe stressed the importance of incorporating modern technology to enhance the effectiveness of peace missions. He also offered the UN to conduct regional peacekeeping courses at the National Police Academy.\n\nThe minister stated that the academy is being remodeled as per international standards, ensuring the availability of all modern facilities to boost training and capacity-building.\n\nHe added that under the UN gender policy, equal opportunities are being provided to women in police service.\n\nMr Lacroix lauded the minister’s personal efforts for the return of Pakistani police officers to the UN and said that despite difficult circumstances UN peace missions are taking effective measures to restore peace around the globe.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:37:52.920Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905391/pakistan-reaffirms-support-for-un-peacekeeping",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:11.000Z"
}
