{
  "title": "Raast quarterly payments surge to Rs6.4tr - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Digital payments are rapidly increasing as Raast transactions surged to Rs6.4 trillion in the second quarter of 2025, said State Bank of Pakistan Deputy Governor Saleem Ullah while launching the “Go Cashless” drive on Saturday.\n\nTransactions via Raast have been growing fast in major cities, but a majority in the rural areas did not operate this system. To boost financial inclusion and encourage digital payments, the State Bank has launched Financial Literacy Week. This initiative aims to engage a wider segment of the 250 million people in the banking system.\n\nThe State Bank has already launched several schemes to enhance banking outreach to the people, including the overseas Pakistanis.\n\nThe SBP launched the drive in collaboration with 12 leading financial institutions.\n\nState Bank launches ‘Go Cashless’ drive\n\n“This initiative was aimed to educate both vendors and customers about the use and benefits of digital payment solutions, promoting a shift towards a cashless economy,” said the State Bank.\n\nMr Saleem outlined that this campaign is not just an event but part of a broader vision to accelerate Pakistan’s transition towards a digital economy.\n\nElaborating on the key digital payments statistics, Mr Saleem highlighted that the SBP’s flagship platform, Raast, handled 795.7 million transactions worth Rs6.4tr in the second quarter of 2025.\n\nHe said that a staggering 62 per cent growth in mobile and internet banking transactions has been witnessed.\n\n“Raast has processed over 892 million transactions amounting to Rs20 trillion since its launch, “ he said, adding that the digital transactions grew by 35pc in FY24.\n\nFurthermore, he said to promote the SBP’s broader agenda to enhance financial inclusion and accelerate digital adoption in Pakistan this event was organised.\n\nHe said the campaign reflected the future of digital payments in Pakistan, which is all about inclusivity, innovation, and integration.\n\nThe SBP goal is a cashless economy where digital payments are not just an alternative but the preferred choice for everyone—from a small vendor in a mandi to a large retail store in a mall. He said that with campaigns like this at a local mall, SBP is showing people that going cashless is easy, secure, and empowering.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:27:31.651Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905376/raast-quarterly-payments-surge-to-rs64tr",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:16.000Z"
}
