{
  "title": "Balochistan to unveil social media policy soon: CM - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Chief Minister Sarfraz Bugti on Saturday said the provincial government has prepared the first-ever social media policy, which it will introduce soon.\n\nCM Bugti disclosed this during a meeting with social media influencers. He urged the youth to play their part in portraying a positive image of Balochistan and called on the influencers to promote social harmony and national unity.\n\nHe emphasised the undeniable power of social media in the modern age and highlighted the urgent need to guide the youth in the right direction.\n\nInfluencers urged to promote social harmony, national unity\n\n“In today’s world, the influence of social media cannot be ignored. It can either serve as a tool for progress or a weapon for misinformation,” he said.\n\nThe chief minister acknowledged that while social media provided a platform for accountability and constructive criticism, it also had the potential to mislead young minds.\n\n“We will welcome positive criticism and use it to strengthen our reform process,” he said, adding that governance flaws pointed out on digital platforms would be addressed in a productive manner.\n\nHe assured social media influencers that their concerns as well as suggestions by other users of social media would be examined and incorporated into the upcoming social media policy. The government was committed to offer opportunities in employment, education and awareness for the youth, and aimed to use social media to amplify these efforts, he said.\n\n“Our goal is to block the way of negative propaganda and turn social media into a tool for improvement,” CM Bugti said. He underscored the importance of policy-making that aligned with the demands of the digital era.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:27:31.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905393/balochistan-to-unveil-social-media-policy-soon-cm",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:11.000Z"
}
