{
  "title": "At least 11 killed in New Delhi building collapse - World - DAWN.COM",
  "author": null,
  "content": "At least 11 people, including three children, were killed in New Delhi on Saturday after a residential building collapsed on the outskirts of the Indian capital, local reports and authorities said.\n\nThe incident happened in the early hours in the northeastern district of the city that mostly houses migrant workers, with rescue teams digging through the rubble throughout the day.\n\nEleven people were pronounced dead, NDTV channel reported, though 11 others were rescued and taken to a hospital. Five were still undergoing treatment, the network said.\n\nIndia’s Prime Minister Narendra Modi said he was “saddened by the loss of lives”.\n\n“Condolences to those who have lost their loved ones,” Modi’s office posted on X. “May the injured recover soon.”\n\nPresident Droupadi Murmu, who lives in her official palace just 20 kilometres from the site, said that “the deaths of many people including women and children is very sad”.\n\nModi’s ruling Bharatiya Janata Party recently won the Delhi state election for the first time in almost three decades.\n\nThe cause of the collapse was not immediately known.\n\nDelhi minister Kapil Mishra blamed corruption in the municipal government — run by the rival Aam Aadmi Party to which former CM Arvind Kejriwal belonged — for such building collapses, saying on X: “Construction of such illegal buildings is going on in full swing.”\n\n“Survey of all these illegal buildings is necessary, strict action is required against them,” he added.\n\nLocal media reports said that the four-storey building “came crashing down like a stack of cards”.\n\nBuilding collapses are frequent in India, and illegal structures — often home to migrant workers — are common in big cities.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/201342081c6a2e2.png",
  "retrievedAt": "2025-08-25T14:27:00.674Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905463/at-least-11-killed-in-new-delhi-building-collapse",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T08:47:26.000Z"
}
