{
  "title": "JCP, SC officials submit statements in IHC judges’ case - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Apex court to resume hearing on IHC seniority dispute on 22nd\n• Commission to meet for appointment of high court chief justices\n\nISLAMABAD: As the Supreme Court’s constitutional bench is set to resume proceedings on Tuesday (April 22) to settle a dispute over the seniority of Islamabad High Court (IHC) jud­ges, the Judicial Commi­ssion of Pakistan (JCP) and the Supreme Court registrar submitted their concise statements to the court on Saturday.\n\nThe five-judge bench, led by Justice Muham­mad Ali Mazhar, had earlier directed both the JCP and the Supreme Court registrar to file their statements and engage counsel for representation if needed.\n\nThe case involves petitions from five IHC jud­ges — Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jaha­n­giri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Jus­tice Saman Rafat Imtiaz — urging the court not to consider three recently transferred judges as IHC judges until they retake oath under Article 194, read with the Third Schedule of the Constitution.\n\nIn a two-page statement submitted to the court, JCP Secretary Niaz Muhammad Khan said Article 175A of the Constitution laid out the mandate of the commission, which, as a constitutional body, was primarily responsible for appointing judges to the Supreme Court, high courts and the Federal Shariat Court.\n\nThe statement explai­ned that the facts of the case pertained to the different transfers made in exercise of powers under Article 200. It said the commission had no duty or role to perform other than giving recommendations to elevate judges in the superior judiciary.\n\nThe bench was reque­s­ted to issue an order kee­p­ing in view the statem­ent it had filed on record. It made it clear that it would bow before the constitutional bench, wha­tever it would dec­ide, and would also render any assistance if required.\n\nIn the statement on behalf of the Supreme Court, the registrar refe­rred to Article 200(1) and pointed out that the country’s president may transfer a high court judge to another high court with his consent and after consultation with the Chief Justice of Pakistan as well as the chief justices of both high courts.\n\nConsidering the mec­h­anism laid out in Art­icle 200(1), the Ministry of Law sought the Chief Justice of Pakistan’s (CJP) consultation thro­ugh a letter dated Feb 1, 2025. The consultation or concurrence was duly provided by the CJP on the same date, the statement added.\n\nOn the other side, the JCP called its meeting on May 19 to consider the appointment of the IHC chief justice at 3:30pm in the Supreme Court building.\n\nCurrently, Justice Sar­dar Mohammad Dogar is serving as IHC’s acting chief justice. The JCP has asked its members to furnish their nominations on a pro forma by May 4 if they want to propose anyone to appoint the IHC chief justice. The members are also required to provide the biodata of their nominees in accordance with Rule 9(1) of the JCP (Appointment of Judges) Rules, 2024.\n\nAlso, the JCP will consider the nominees to appoint a permanent Sindh High Court chief justice on May 19.\n\nIn addition, the commission has rescheduled its meeting to consider appointments of chief justices of the Balochistan High Court and Peshawar High Court, from May 2 to May 19. Justice Muhammad Ejaz Swati and Justice Attique Shah serve as the acting chief justices of the BHC and PHC, respectively.\n\nJCP members have been asked to send their nominations, preferably by April 28, along with the pro forma, biodata of the nominees and the seniority position of the three most senior judges of the respective high courts, through emails for appointing permanent chief justices of the two high courts.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:27:42.980Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905406/jcp-sc-officials-submit-statements-in-ihc-judges-case",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:04:59.000Z"
}
