{
  "title": "BNP to challenge mines law in court - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan National Party (BNP) will challenge the Balochistan Mines and Minerals Act 2025, recently passed by the provincial assembly.\n\nThis was announced by BNP President Sardar Akhtar Mengal at a press conference at the Quetta Press Club on Saturday.\n\nMr Mengal also opposed the agreement between the provincial government and Pakistan Petroleum Limited to managed the Sui gas field.\n\nAccording to Mr Mengal, the Balochistan government did not hold discussions over the draft of the mines act before presenting it in the assembly where it was passed in “just five minutes,” Mr Mengal claimed.\n\nMengal slams plan to use revenue from petrol sales for development in Balochistan\n\n“After consulting lawyers and experts on Mines and Mineral Act and the agreement between the government and PPL, BNP will approach the court,” Mr Mengal said.\n\nHe said there was no other option to solve the problems of Balochistan except democratic struggle.\n\nMr Mengal, who also served as the Balochistan chief minister, said that after ending the sit-in, his party started the second phase of protest on Friday the holding rallies across the province.\n\nHe announced public gatherings in different areas of Balochistan, with the first on April 23 in Khuzdar, followed by Gwadar on April 25, Panjgur on April 27, Noshki on April 29 and Quetta on May 2.\n\nTalking about the arrest of Dr Mahrang Baloch, he said her sister filed a petition in the Balochistan High Court for her release.\n\nThe court referred the matter back to the Home Department. “In the same building of the Balochistan High Court, two different verdicts were given for similar cases,” Mr Mengal claimed.\n\n“When courts don’t provide relief, people naturally turn towards resistance.”\n\nHe stated that the BNP had been facing accusations since the death of Nawab Akbar Bugti in 2006.\n\nHe added that the BNP’s central cabinet meeting was held in Quetta on April 18, where various issues were discussed, including obstacles in the long march, rallies across Balochistan, the state of democracy, the Mines and Minerals Act of Balochistan and Khyber Pukh­tunkhwa, and the proposed canals on Indus river.\n\nThe party’s organisational matters were also reviewed in the meeting.\n\nHe claimed that the current developments in Balochistan were aimed at “plundering” its resources and “seizing” control of its coastline.\n\n“If someone wants to fulfil their desire to arrest me, come and do it in Quetta today,” he said while replying to a question.\n\nHe clarified while his party supported the no-confidence motion against former CM Jam Kamal, they did not vote to make Abdul Qudus Bizenjo the succeed him.\n\nHe also criticised the reduced share of development funds to lawmakers of opposition parties.\n\nOn the issue of using tax revenue generated from the sale of petroleum products for the development of Balochistan, Mr Mengal said: “Orphanages and mosques are built with donations. Has the federation turned Balochistan into an orphanage — developing it with the money saved from petroleum price cuts?”\n\nHe warned that if current attitudes against Balochistan persisted, the pro­vince’s problems would worsen.\n\n“Until Balochistan is accepted as an integral part of Pakistan, its issues cannot be resolved. These problems cannot be solved through force.”\n\nA number of BNP leaders, including senior vice president Sajid Tareen Advocate, were present alongside Mr Mengal.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680443a7649a2.jpg",
  "retrievedAt": "2025-10-12T02:37:54.346Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905392/bnp-to-challenge-mines-law-in-court",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:10.000Z"
}
