{
  "title": "4,700 beggars deported from Saudi Arabia, says Defence Minister Asif - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: Federal Minister for Defence Khwaja Muhammad Asif says there are around 22 million beggars in Pakistan who earn at least Rs42 billion annually.\n\n“Their ever-increasing population is tarnishing the country’s image abroad,” he added.\n\nThe minister was speaking to members of the Pakistan Ready-made Garments Manufacturers and Exporters Association (PRGMEA) in his hometown Sialkot on Saturday.\n\nSharing recent figures of beggars deportation from the Middle Eastern countries, Mr Asif said Saudi Arabia alone had deported at least 4,700 Pakistani beggars. However, he did not give the time span.\n\nAccording to the Federal Investigation Agency (FIA) which gave a briefing to a parliamentary body last year, 4,000 beggars were deported by Saudi Arabia during the last three years ending 2024.\n\nThe Anti-Begging Regulation in Saudi Arabia is designed to deter individuals from begging or participating in begging networks, imposing penalties such as financial fines and imprisonment. Foreign individuals involved in begging may face deportation after serving their sentences.\n\nA senior FIA official said professional beggars mainly belonging to South Punjab, Karachi and Interior Sindh regions have been deported from different ME countries in recent times.\n\nHe said once these beggars return, their names are placed on FIA Immigration’s Passport Control List (PCL) to restrict them for traveling outside Pakistan again.\n\nHe asked the Business fraternity of Sialkot to establish its own bank for the promotion of economic activities.\n\nPML-N lawmakers from Sialkot, chairman PRGMA Ijaz Khokhar and others were also present on the occasion.\n\nHe said prime minister Shahbaz Sharif and his cabinet were striving to resolve issues related to the community.\n\nEarlier, PRGMA chief presented a charter of demands of his association.\n\nAHSAN IQBAL: Federal Minister for Planning, Development & Special Initiatives Ahsan Iqbal has urged Sialkot’s exporters to lead URAANPakistan — a national mission to transform Pakistan into a $100 billion export economy by 2035.\n\nSpeaking to an event of PRGMEA on Saturday on the topic of “Exports First – Sialkot’s Role in URAAN Pakistan,” he highlighted exports as the lifeline of modern economies.URAAN Pakistan, he said, offers the roadmap for revival through five pillars such as Exports First, E-Pakistan, Equity & Empowerment, Environment, Energy & Infrastructure.\n\nHe spotlighted the $800bn global apparel market and urged Pakistan to shift from low-value textiles to high-end fashion & branded garments, tapping Africa, Middle East & Central Asia.\n\nAbid Mehmood from Narowal also contributed to this report\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:27:15.304Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905327/4700-beggars-deported-from-saudi-arabia-says-defence-minister-asif",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:05:46.000Z"
}
