{
  "title": "KP Governor Kundi accuses CM Gandapur of being ‘compromised’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Governor Faisal Karim Kundi on Saturday accused the chief minister of being “compromised” and wondered how Ali Amin Gandapur returned from Islamabad in November last year despite heavy blockades meant to prevent PTI activists from reaching the federal capital’s Red Zone.\n\n“The entire country faced lockdowns, blocked roads and jammed phone signals, while schools and colleges were closed during the PTI’s march on Islamabad on November 26 last year, but the chief minister made his way back via Daman-i-Koh, so there is something fishy,” Mr Kundi told reporters after attending the inaugural ceremony for the Zamarud campus of the Roots International Education here.\n\nThe governor said the chief minister was accused of corruption by members of his own party, PTI.\n\nHe said he had raised questions about the law and order situation in the province and irregularities in departmental recruitments and funds’ distribution, and even former PTI cabinet members echoed his concerns.\n\nWonders how Gandapur returned from Islamabad during Nov march despite heavy blockades\n\nMr Kundi said a former finance minister accused the chief minister of spending the taxpayers’ money on political gatherings and elections.\n\nAbout Mr Gandapur’s request to the federal government for permission to hold talks with Afghanistan’s interim government over the law and order situation in the province, the governor said the matter was out of the provincial government’s domain.\n\nHe said engaging with Kabul was the mandate of Islamabad and not Peshawar and that was why deputy prime minister and foreign minister Ishaq Dar was currently visiting Afghanistan.\n\nMr Kundi wondered why the chief minister didn’t go to China and Turkiye for the sake of the province’s development.\n\nHe said Pakistan had always wanted friendly ties with neighbours, so Afghan soil should not be used against Pakistan, China and the China-Pakistan Economic Corridor.\n\nThe governor also said that Mr Dar would take up the issue with the interim Afghan government.\n\nHe said it was regrettable that the prime minister didn’t visit KP despite terrorist attacks.\n\n“I told the prime minister in a meeting that we [KP residents] don’t object to his visits to Karachi, Lahore or Balochistan, but since our province faces a law and order situation and issues pertaining to resources, he must intervene,” he said.\n\nMr Kundi wondered whether the prime minister was waiting for any untoward incident to happen in the province to visit for a photo opportunity.\n\n“I invite the prime minister yet again to visit Peshawar to meet traders, civil society members and people from other walks of life,” he said.\n\nThe governor said he would welcome the prime minister’s announcement of projects for Balochistan but emphasised that KP, too, should receive its due share in national resources.\n\nHe also said the chief minister should sit down with parliamentary leaders in the provincial assembly and announce development projects for them, and plead the province’s case for rights and resources with the Centre.\n\nMr Kundi complained about unrest in the Kurram tribal district and said the provincial government was ready to “attack” Islamabad but couldn’t secure a 25km road in the troubled area.\n\nHe also said a multi-party conference was held regarding a delicate law and order situation in Kurram. He thanked the Russian envoy for sending in aid for Kurram residents.\n\nEarlier, the governor emphasised that private educational institutions were not just centres of learning, but they’re strong partners in the process of national development, according to an official statement issued by his office.\n\nMr Kundi said authorities were striving to reduce the burden on public educational institutions.\n\nHe praised the Roots International Education for its contributions to the country’s education sector over the last 37 years and acknowledged its role in promoting high-quality and modern education across the country, including KP.\n\nThe governor said that the newly-inaugurated campus was a testament to modern educational facilities, international curricula, and a holistic approach to student development.\n\nHe hoped that the campus would be a significant addition to Peshawar’s educational landscape.\n\nMr Kundi urged students to aim high, dream big and work hard.\n\n“The nation’s future depends on educated and talented youth,” he said, encouraging students to pursue education with passion and commitment, doing their parents and the country proud.\n\nPublished in Dawn, April 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:38:20.226Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905317/kp-governor-kundi-accuses-cm-gandapur-of-being-compromised",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T01:06:03.000Z"
}
