{
  "article_id": "2025-01-15_253abed9804993e57c19c99ab125c631",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/css-pms-officers-panel-discussion-held-at-qau-2/",
    "retrieved_at": "2025-08-27T11:40:58.938Z"
  },
  "metadata": {
    "title": "‘CSS & PMS Officers Panel Discussion’ held at QAU",
    "author": null,
    "date_published": "2025-01-15T18:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 652,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 15 (APP): Quaidian Counselling and Opportunity Club (QCOC) held a 'CSS & PMS Officers Panel Discussion' at the Sociology Auditorium of Quaid-i-Azam University (QAU) on Wednesday. The event featured prominent civil service officers as panellists, including Syeda Maria Zaidi, SP Beenish Fatima, Jawad Hussain Malik, and Hussain Nawaz Adil, who shared their insights and strategies to motivate and inspire attendees. The session also included a robust Q&A segment, allowing participants to engage directly with the panelists. Dr. Shuja ul Mulk, Director of the Directorate of Career Counselling welcomed the panelists and praised the students for their enthusiasm. Syedah Maria Zaidi, currently serving as the Deputy Director at the External Publicity Wing of the Ministry of Information & Broadcasting (MOI&B) while sharing her journey told that she did CSS in first attempt along with MPhil. She emphasised the importance of daily newspaper reading and learning paper-attempting techniques through mentors and social media platforms. With her extensive experience in teaching and public service, she advised students to approach the exams with discipline and a thorough understanding of all concepts with special reference to Pakistan. Moreover, students should make a whole hearted attempt but should have a plan B in case they do not qualify the exam, she urged. SP Beenish Fatima, the Chief Traffic Officer of Rawalpindi, revealed, \"Civil service is both challenging and rewarding.\" She said that she cleared the CSS exams in her second attempt by adopting a structured preparation strategy. She advised the participants to work on their language skills, effectively manage courses, and make notes while considering past papers. She highlighted the importance of staying motivated, managing stress, and refraining from comparing oneself to others. SP Beenish urged students to put in their full effort and to remain resilient in the face of challenges. Jawad Hussain Malik, a distinguished officer from PMS Batch-11, provided valuable insights into the realities of civil service. He reminded students not to pursue civil service for fame or financial gains but for the opportunity to administer governance roles. \"If you don't ensure public service delivery, you are not a good officer,\" he remarked. He stressed the significance of being a good manager and maintaining an optimistic approach. The highlight of his discussion was sharing tips on interview preparation, advising students to dress well, stay calm, and manage stress; respond thoughtfully instead of reacting impulsively; and that it's okay to not know the answer to any question. Lastly, Hussain Nawaz Adil, a distinguished officer of the 51st CTP and an alumna of Quaid-i-Azam University, shared his preparation journey, motivating the participants. He emphasised the pivotal role of English proficiency in CSS preparation, highlighting that it not only forms the foundation for excelling in the essay paper but is also crucial for effectively attempting other subject papers. Overall, the panel covered a variety of topics essential for CSS and PMS aspirants, including dispelling myths about competitive exams, preparation tips and strategies, the role of academies versus self-study, techniques for attempting papers effectively, the importance of time management and motivation, civil service as a lifestyle, selecting optional subjects wisely, and enhancing interview skills. The session attracted a diverse audience comprising students and faculty members, including Izza Imran, Manager of Career Counselling; Dr. Shuja ul Mulk; and Dr. Hazirullah, Director of the School of Sociology. Attendees actively participated in the Q&A segment, where panellists addressed queries with practical advice and motivational anecdotes. The event concluded with closing remarks by the president of QCOC, Abdullah Liaquat, who expressed gratitude to the panelists and attendees for their participation. The session left the audience with actionable insights and a renewed sense of motivation to pursue their goals in civil service. The CSS & PMS Officers Panel Discussion was a resounding success, providing students with valuable guidance and a clearer roadmap for preparing for competitive exams. The event reinforced the importance of resilience, strategic planning, and a commitment to public service.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}