{
  "article_id": "2025-01-15_4c74f148740da6e529c9275d77db9549",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/no-disco-handed-over-to-isi-leghari/",
    "retrieved_at": "2025-08-27T11:41:25.800Z"
  },
  "metadata": {
    "title": "No DISCO handed over to ISI; Leghari",
    "author": null,
    "date_published": "2025-01-15T14:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 15 (APP): Federal Minister for Energy Sardar Awais Ahmad Khan Leghari on Wednesday informed the National Assembly (NA) that no Power Distribution Company (DISCO) was handed over to Inter-Services Intelligence (ISI), however special intelligence units comprising provincial officials, Federal Investigation Agency (FIA) and others were helping to reduce the losses and electricity theft in the power sector. Replying to supplementary questions during the Question Hour of the 12th session of the NA, he said contracts have been reviewed with over 28 Independent Power Producers (IPPs), benefiting the national exchequer to the tune of 1457 billion rupees. He said since June last year, the per unit electricity tariff for industries has been reduced by Rs 11 and for the rest of the country by Rs 4. Leghari added that the government will not purchase electricity after March this year as permission had been given for the creation of an Independent Electricity Market. He said that the independent electricity market will enable consumers to purchase electricity from multiple suppliers. The minister stated that the Power Division has cut a 45 per cent tariff for Electric Vehicle (EV) charging stations and now they will get power at Rs39.70 per unit from the existing Rs71 per unit. Awais said special units have been established to improve recoveries and check power pilferage, adding there was no proposal to revisit the slab system. However, the government was working on several initiatives to reduce the burden on the common man. Sardar Awais Ahmad Khan Leghari said advanced metering infrastructure has been introduced in all Discos and was being implemented in phases to ensure accurate billing and increased customer satisfaction. He informed the House that the tariff was determined by NEPRA being the regulator and DISCOs implement the same in letter and spirit.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}