{
  "article_id": "2025-01-15_07afddeba3b25974801e2bb6f5082a8c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/comstech-una-sign-mou-to-advance-education-and-scientific-awareness-in-islamic-world/",
    "retrieved_at": "2025-08-27T11:40:52.566Z"
  },
  "metadata": {
    "title": "COMSTECH, UNA sign MoU to advance education and scientific awareness in Islamic world",
    "author": null,
    "date_published": "2025-01-15T11:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 240,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 15 (APP):Union of News Agencies of the Organization of Islamic Cooperation (UNA) and the Standing Committee for Scientific and Technological Cooperation (COMSTECH) signed a memorandum of cooperation at COMSTECH Secretariat on Wednesday, marking a significant step towards fostering collaboration in education, media, and research across the Islamic world. The agreement was signed by UNA Director General Mr. Mohammed bin Abdul Rabbah Al-Yami and COMSTECH Coordinator General Prof. Dr. Muhammad Iqbal Choudhary. The memorandum aims to enhance cooperation between the two OIC bodies in the fields of education and scientific and technological awareness, strengthen the role of media in disseminating advancements in science and technology, promote scholarships, educational programs, and research opportunities for students and researchers in Islamic countries, provide training and capacity-building initiatives for communication and information professionals in member states. Speaking at the ceremony, Prof. Dr. Muhammad Iqbal Choudhary appreciated the collaboration, describing the agreement as a historic milestone for strengthening partnerships within the Islamic world. He also extended a warm welcome to the UNA Director General and his delegation and emphasized the shared commitment to advancing education and innovation. The signing coincided with the Director General's visit to Pakistan to participate in the international conference titled \"Girls' Education in Muslim Societies: Challenges and Opportunities,\" held in Islamabad. This partnership is expected to significantly contribute to the development of education, scientific awareness, and media capacity in OIC member states, furthering the mission of both UNA and COMSTECH.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}