{
  "title": "Regional cooperation key to find solutions to the socio-economic challenges: Speaker NA",
  "link": "https://www.app.com.pk/national/regional-cooperation-key-to-find-solutions-to-the-socio-economic-challenges-speaker-na/",
  "date_published": "2022-12-06T17:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP): Speaker of the National Assembly Raja Pervaiz Ashraf on Tuesday said that regional cooperation was a key to find solutions to the socio-economic challenges of South and South-West Asia region particularly climate change, hunger, and malnutrition, promoting quality education and decent work for youth and ensuring equitable access to health.\nHe was speaking at a discussion session titled with “Sub-regional perspectives and Review of cluster of SDGs” organized by Sustainable Development Policy Institute (SDPI).\nThe speaker said that it was indeed a timely opportunity for us to reassess the national and regional strategies towards achieving SDGs in the face of unimaginable scale of loss and damage caused by unprecedented climate induced floods.\nHe reiterated that National Assembly of Pakistan would continue to perform a proactive role for SDGs Agenda through joint and diverse legislative and parliamentary mechanisms.\nSpecial Assistant to Prime Minister, Romina Khurshid Alam, said on the occasion that Pakistan was confronted with an unprecedented climate crisis and other South Asian countries have similar vulnerabilities to climate change and other challenges.\nShe informed that the Parliament of Pakistan committed to make the world realize the gravity of climate challenge and the devastation the recent floods have caused across Pakistan.\nThe Executive Director, SDPI Dr Abid Qaiyum Suleri said that Pakistan’s parliament was among a few parliaments across the region which had first adopted SDGs as national goals and set up a dedicated SDGs Task Force.\nHe said that the presence of Speaker National Assembly in this conference demonstrates his strong commitment to SDGs Agenda.\nHe said that we are passing through unprecedented times, inflation, rupee devaluation, recession. However, Pakistan was not alone in confronting the Triple-C crisis.\nFollowing the discussion in another session titled with “Closing the Loop – Policy Solutions for Achieving SDG 12: Ensuring Sustainable Consumption and Production Patterns’, Special Advisor to the Prime Minister for Finance Tariq Bajwa said that the private sector in Pakistan had a huge potential to advance the agenda of sustainable production and production practices.\nHe added that although the government had a very thin fiscal space, it had taken measures to revive agriculture and industry, especially in the post-flood scenario.\nHe said that free seeds, interest free loans, and subsidized energy prices are expected to help farmers to come out of the crisis and revive their livelihoods.\nTo ensure financing for the emerging businesses, a policy is in the pipeline that would be pushing the banks to lend more to the private sector, he added.",
  "retrievedAt": "2025-08-11T15:58:09.118Z"
}
