{
  "title": "PM vows ‘proactive’ implementation of Journalist Safety Law to ensure media freedom",
  "link": "https://www.app.com.pk/national/pm-vows-proactive-implementation-of-journalist-safety-law-to-ensure-media-freedom/",
  "date_published": "2022-12-06T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP): Prime Minister Shehbaz Sharif on Tuesday said media freedom and democracy reinforced each other and  expressed  his government’s resolve to support an environment for journalists free of intimidation and harassment.\n“My government believes that no journalist or human rights activist should be called out in the line of duty,” he said, expressing his firm resolve to proactively facilitate the implementation of the Journalists Safety Law.\nAddressing at an event here to mark 10 years of the United Nations’ Plan of Action organized by Journalist Safety Forum, the prime minister termed a free media and freedom of expression the important pillars of a State.\nShehbaz Sharif said press freedom in Pakistan had been close to the hearts of journalists and civil society.\nHe said journalists of the country over the years greatly contributed to press freedom and mentioned that Hamid Mir, as the chairperson of Journalist Safety Forum, faced difficult challenges including an attempt on his life.\nHe termed the killing of prominent journalist Arshad Sharif an “extremely sad incident” and said that he soon after spoke to the government of Kenya and later wrote a letter to the Chief Justice of Pakistan to form a judicial commission.\nShehbaz Sharif said despite the chequered history with 33 years of military rule, the collective political efforts led to resumption of democracy to put the country on right track.\nHe termed the 1973 constitution ‘a very sacred document’ which acted as a binding force among the units of the federation and ensured democratic values besides ensuring basic rights of citizens.\nIn 2013, he said, Pakistan became the first country in Asia to pass legislation on the safety of journalists and last year, the parliament passed the landmark ‘Protection of Journalists and Media Protection Act’.\nShehbaz Sharif, on requests of the media community, assured to look into the Section 6 of the Act to prevent harassment and intimidation of journalists.\nHe mentioned that there were still challenges facing the journalists in their line of duty and required sustained efforts by media, civil society, UN and international bodies.\nHe appreciated the contribution of international community in supporting economic and social development of Pakistan, particularly UNESCO and countries including Norway, Denmark and France.\nHe expressed confidence that the outcomes and recommendations of the Forum would help leading towards a free media in Pakistan.\nAmbassador of France Nicolas Galey said freedom of expression could not be termed as an obstacle in the working of a government and emphasized the need to promote safety of journalists, media pluralism, and the right to inform and be informed. He lauded Pakistan’s law on the safety of journalists as a significant step in encouraging freedom of expression.\nAmbassador of Denmark Linulf said it was crucial to promote freedom of expression and ensure a safe environment for journalists. He said Denmark backed the ‘community journalism’ in Pakistan. He congratulated Pakistan for its remarkable step to legislate on the safety of journalists, the first in Asia.\nAmbassador of Norway Per Albert Ilsaas said best quality journalism provides proper information and ensure democratic values. Pakistani journalists, he said “self-censored” the content, which could otherwise be said directly, such the use of word “establishment”.\nChairperson Journalist Safety Forum Hamid Mir proposed that federal and Sindh governments must notify the safety commissions under the laws passed by the National Assembly and stressed passage of similar laws for the journalists of Khyber Pukhtunkhwa, Balochistan and Punjab.\nHe demanded immediate removal of the Section 6 from the Federal Journalists Safety Law, which acts as a pre-qualifier for journalist before benefiting from the law, and pointed out that it was “mysteriously” added to the final draft bill without the knowledge of journalists.\nHe called for taking journalists out of the purview of online expression through laws such as PECA (Prevention of Electronic Crimes Act) or other regulations and emphasized support by the federal and provincial governments against attacks, intimidation and harassment of women journalists.\nThe event was attended by journalists, human rights experts and representatives of national and international organizations.",
  "retrievedAt": "2025-08-11T15:58:23.833Z"
}
