{
  "title": "UN, int’l community urged to save Muslim heritage under India’s ‘Hindutva’ rule",
  "link": "https://www.app.com.pk/national/un-intl-community-urged-to-save-muslim-heritage-under-indias-hindutva-rule/",
  "date_published": "2022-12-06T08:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP): On the 30th anniversary of the demolition of the historic Babri Mosque in India, Pakistan on Tuesday urged the international community and the United Nations to play their role in preserving the Islamic heritage sites in India from the extremist ‘Hindutva’ regime.\n“The Indian government must ensure the safety, security, and protection of minorities, particularly Muslims, and their places of worship,” the Foreign Office said in a statement on completion of three decades marking the demolition of the historic Babri Mosque in the Indian city of Ayodhya by Hindu zealots.\nThe FO said, “The occasion is a sad reminder of the growing anti-Muslim frenzy in India ever since,” adding that “We condemn the ongoing construction of a Hindu temple on the site of the demolished mosque, and the acquittal of the criminals responsible for its destruction.”\nIt mentioned that the Hindu supremacist groups in India were demanding the conversion of some other mosques into temples, including the Gyanvapi Mosque in Varanasi. “These demands might lead to more tragedies like that of Babri Mosque,” it said.\nThe FO stressed that there was a persistent assault on the religious freedoms of Indian Muslims and the ruling party in India continued to incite hysteria and hatred against Muslims.\n“As also demanded by the Organization of Islamic Cooperation through its various pronouncements, we call upon the Government of India to ensure that the Babri Mosque is rebuilt on its original site and the criminals responsible for its destruction are awarded befitting punishment.” it said.\n“The international community needs to take coginzance of the growing Islamophobia, hate speech and hate crimes in India,” it said.",
  "retrievedAt": "2025-08-11T15:58:21.670Z"
}
