{
  "title": "JUI-F to hold workers convention on Dec 8 in Quetta",
  "link": "https://www.app.com.pk/national/juif-workers-convention-jui-f-to-hold-workers-convention-on-dec-8-in-quetta/",
  "date_published": "2022-12-06T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP):The Jamiat Ulema-e-Islam-Fazl (JUI-F) will hold workers convention on December 8 at Ayyub Stadium, Quetta in which a number of notable political figures will join the party.\nTalking to APP on Tuesday, JUI-F Spokesman Muhammad Aslam Ghauri informed that former Chief Minister Balochistan Nawab Muhammad Aslam Khan Raisani, former Home Minister Balochistan Nawab Zafarullah Khan Zehri, former Provincial Minister.\nDistrict Nazim Nushki Haji Ghulam Dastagir Badeni, former Minister for Transport Balochistan Sakhi Mir Amanullah Notezai, an independent candidate from PB-20 Pishin Agha Asmatullah, former candidate for National Assembly from Pishin Malik Abdul Qayyum Kakar, and tribal elders Nawab Nauroz Khan Zehri and Sardar Zafarullah Khan Gachki would join the JUI-F.\nHe said the central leadership of JUI-F including Maulana Fazl-ur-Rehman, Minister for Housing and Works Maulana Abdul Wasay, Minister for Communication Maulana Asad Mehmood, Minister for Religious Affairs and Interfaith Harmony Mufti Abdul Shakoor and Senator Abdul Ghafoor Haideri would address the gathering.\nHe expressed the hope that the JUI-F would get a huge mandate in the upcoming general elections from every nook and cranny of the country as the valuable addition would take the party to new heights of political achievements.\nHe further informed that JUI-F Secretary General Senator Abdul Ghafoor Haideri had arrived in Quetta to review the arrangements for the event.\nSpokesman Ghauri said the JUI-F’s sub-organization Ansar-ul-Islam briefed Senator Haideri about the security measures and traffic plan during the convention.\nHe said Senator Haideri also held meetings with Nawab Aslam Raisani, Balochistan Awami Party’s Provincial Minister Muhammad Khan Lehri and Member of Provincial Assembly Asghar Tareen.\nHe said the politicians were posing confidence in the JUI-F and it was becoming the most favorite party of the people of all sections of the society.",
  "retrievedAt": "2025-08-11T15:58:10.701Z"
}
