{
  "title": "Shariah course for judges conclude at IIUI",
  "link": "https://www.app.com.pk/national/shariah-course-for-judges-conclude-at-iiui/",
  "date_published": "2024-03-03T12:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 03 (APP):The four-month 65th regular Shariah course for the judges, Qazis, attorneys, law officers and prosecutors,organized by the Shariah Academy of the International Islamic University Islamabad (IIUI), concluded with a closing ceremony at the Faisal Masjid.\nAs many as 26 participants from various areas and departments across the country attended the course. They covered important topics such as contemporary legal issues, international labor law, and medical issues related to Islamic law. They were also given assignments of book reviews and term papers.\nThe participants visited various courts and relevant ministries across Pakistan. In addition, the participants visited Turkey and Jorden to exchange experiences and further broaden the exposure by visiting the ministries of justice and courts in both the countries. The course participants also visited the Kingdom of Saudi Arabia and perfumed Umrah in the final stage of the course.\nAddressing the closing ceremony, IIUI President Dr. Hathal Homoud Alotaibi said that the Islamic legal system had a legacy of knowledge. The Muslim ancestors guided the world about the equal rights of men and women in the light of teachings of Islam.\nHe discussed historic achievements of the Muslims in the field of law, medical, applied sciences and governance.\nDr Hathal said that the life of the Holy Prophet (Peace Be Upon Him) and the era of Khulfa-e-Rashideen was a great source of guidance to balance “our lives and maintain justice within the society”.\nCalling upon the legal fraternity participants, he said they had been given an important responsibility of justice that demands Taqwa and strict obedience to the teachings of Islam while deciding on various issues.\nHe also shed light on the wisdom of Islamic legal system and the importance of social relations in Islam.\nTalking about the role of Shariah Academy, the IIUI president said that it was a vital institution of the society. The future goals of this institution, he added, included initiation of academic programs such as PhD.\nHe also congratulated the participants on performing Umrah.\nDirector General of Shariah Academy Dr Atta ullah Faizi thanked the IIUI president for guidance and patronage during the course. He said the Academy would remain in contact with the participants of course to meaningfully contribute and ensure practical application of training.\nAt the end, the IIUI president distributed shields and course completion certificates among the participants\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:06:40.646Z"
}
