{
  "title": "Smartwatch data revolutionizes depression treatment: Study",
  "link": "https://www.app.com.pk/national/smartwatch-data-revolutionizes-depression-treatment-study/",
  "date_published": "2024-03-03T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP):A recent study indicates that smartwatches could play a significant role in improving the treatment of depression by providing valuable insights into symptoms beyond their traditional functions of tracking steps and sleep.\nJoshua Curtiss, an assistant professor of applied psychology at Northeastern University in the US, highlights the potential of wearable technology in advancing precision medicine.\nHe explains that by analyzing passive sensor data from smartwatches, clinicians can better understand and tailor treatment for individual patients based on their unique symptoms.\nThe study, published in the New England Journal of Medicine, analyzed anonymized data from patients at Massachusetts General Hospital (MGH) who wore Empatica E3 wristbands.\nThese devices tracked various physiological indicators, such as sleep patterns, physical activity, heart rate variability, and movement.\nCurtiss notes that changes in sleep patterns, physical activity levels, and social interactions can all be indicative of depression.\nSmartwatches and smartphones equipped with sensors can effectively monitor these symptoms, offering clinicians’ valuable insights into their patients’ mental health.\nBy examining data on text messaging app usage, clinicians can assess a patient’s level of socialization, the study explained.\nCurtiss emphasizes that this passive sensor data supplements clinical judgment and patient reports, providing a more comprehensive understanding of the individual’s condition.\nIn clinical practice, this data can prompt important conversations between clinicians and patients. For instance, if the data indicates low physical activity, clinicians can explore potential causes such as fatigue or anhedonia (lack of enjoyment in life) with the patient.\nWhile patient self-reports remain crucial, Curtiss acknowledges the limitations, such as under-reporting or over-reporting of symptoms.\nSmartwatch data offers an additional source of information that complements traditional assessment methods, contributing to more personalized and effective depression treatment strategies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:06:37.656Z"
}
