{
  "article_id": "2025-10-18_a9981415be39d9923f49f9615fa9adb2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nationwide-polio-eradication-campaign-continues/",
    "retrieved_at": "2025-10-20T18:08:07.646Z"
  },
  "metadata": {
    "title": "Nationwide Polio eradication campaign continues",
    "author": null,
    "date_published": "2025-10-18T16:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 218,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 18 (APP):National Emergency Operations Centre (NEOC) on Saturday said that over the first five days of the campaign, more than 43.3 million children have been successfully vaccinated against Polio across Pakistan. According to NEOC, in Punjab, over 22.9 million children have received the oral polio vaccine, while in Sindh, approximately 10.2 million children have been immunized. In Khyber Pakhtunkhwa, more than 6.1 million children have been vaccinated while in Balochistan, over 2.55 million, in Islamabad, around 443,000, in Gilgit-Baltistan, nearly 294,000; and in Azad Jammu and Kashmir, over 733,000 children have received the vaccine. The NEOC said that joint and sustained efforts continue to ensure the complete eradication of poliovirus from the country. The ongoing national campaign aims to vaccinate over 45 million children under the age of five and will continue uninterrupted until October 19. In South Khyber Pakhtunkhwa, the campaign is scheduled to begin on October 20. The NEOC urged parents and communities to welcome polio teams and ensure their children receive the life-saving drops. \"Polio is a dangerous disease that can cause lifelong paralysis in children,\" the NEOC emphasized, adding that the role of parents and communities is critical for the success of the campaign. The NEOC urged parents to ensure that every child under five years of age receives the polio vaccine.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}