{
  "title": "FPCC establishing think tank to advise for country’s economic vision: Atif Ikram",
  "link": "https://www.app.com.pk/national/fpcc-establishing-think-tank-to-advise-for-countrys-economic-vision-atif-ikram/",
  "date_published": "2024-04-02T10:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 2 (APP): President of, the Federation of Pakistan Chamber of Commerce and Industry (FPCCI), Atif Ikram has said that industrialists had a target of increasing the country’s exports up to $100 billion, which would be made possible through Vision 2030. The FPCCI is establishing a think tank for providing advice to the country’s economic growth and restructuring of the economy, which will consist of intellectual businessmen, industrialists and academia of the country,\nHe said while addressing a press conference on the occasion of the launch of the Economic Vision 2030 and think tank on economy along with eminent industrialists here Tuesday.\nThis think tank, he said will consist of renowned industrialists under the leadership of former Federal Commissioner for Commerce, Dr. Ijaz Gohar, who will also advise big forums like SFIC to increase exports and investment in the country.\nAtif said that this working group consisting of highly engaged businessmen and industrialists would give suggestions to the government for economic growth and will play its role in making the agenda of SIFC feasible.\nHe said that in addition to this, the working group in this think tank would pay special attention to foreign investment, especially in the industrial sectors including export, information technology and agriculture, besides, suggestions would be given for the improvement of tax reforms and energy sector.\nHe said that FPCCI was the joint apex body of all chambers in Pakistan which would also give suggestions to the government for the upcoming budget and we were in touch with the government in this regard. Atif Ikram said that currently, the country’s economy had the potential to collect Rs15,000 billion in taxes, but taxes were not collected according to their potential. There is a need for tax reforms in the country and for this, the tax net has to be increased so that the country’s revenue can be increased, he added.\nThe President FPCCI said that discussions had been held with the government and the work had been finalized to bring the price of electricity in line with the regional markets in which market there will be a difference in the cost of doing.\nHe said that according to Vision 2030, industry, Information Technology (IT), tourism, mining and agriculture were very important which will be worked on together with SIFC.\nSpeaking to the media on this occasion, Vice President FPCCI, Zaki Aijaz said that regional trade is very important without increasing the export will not improve and the industry will not be able to develop.\nHe said that the work on the Pakistan-Iran gas pipeline is very important, which will meet the needs of the country’s industry at cheap rates and the wheel of the industry will run. He said that the bank markup should be reduced so that the industrialists can get liquidity in their business and the industry can expand in the country.\nHe said that there should be an end to smuggling in the country and a regular plan should be adopted to prevent it so that the country can progress economically.\nZaki said that to increase the tax collection, the tax net should be increased so that there is no burden on the existing taxpayers.\nHe said that according to Vision 2030, export of $100 billion is our target.\nOn this occasion, Chairman FPCCI Islamabad Office Karim Aziz said that industry and tourism, mining and agriculture are important sectors in the country by working on which the country can move forward and the goal of national exports can also be fulfilled.\nHe said that Pakistan’s current export of rice is $3 billion per year, which will reach $5 billion per year next year. Speaking on this occasion, the President of the Islamabad Industrialist Association Nasir said that we need peace stability and continuity in policy to fix the economy, on which we have to work.\nHe said that Pakistan is a country with a large youth population, which should be made skilled by investing in the youth. He said that educated women in Pakistan should also be brought up so that they can contribute to the economy and the country can move forward. On this occasion, the President of United Business Group FPCCI, Zafar Bakhtawari said that establishing a think tank on economy and trade is a good start, which will facilitate the long-term planning of the economy and former Minister of Commerce Ijaz Gohar is a good choice for this.\nHe said that building an IT park in Islamabad was an important step and according to Vision 2030 to increase the export of IT to 15 billion dollars. During this time, many eminent industrialists and businessmen including Khalid Iqbal Malik, Engineer Azharul Islam, Mian Iqbal Farid, Sohail Malik participated in the consultation on the current economic situation of the country and its improvement.",
  "retrievedAt": "2025-08-11T01:41:29.388Z"
}
