{
  "title": "Pakistan to continue support to Kashmiris till realization of right to self-determination: President Alvi",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-support-to-kashmiris-till-realization-of-right-to-self-determination-president-alvi/",
  "date_published": "2021-01-05T08:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): President Dr Arif Alvi on Tuesday said Pakistan will continue to extend all possible support for the just cause of the people of Jammu and Kashmir till the realization of their right to self-determination in accordance with the UN Security Council resolutions.\n“The right to self-determination is a vital component of human dignity. Negation of this right is the negation of human freedom, Universal Declaration of Human Rights, and UN Human Rights Covenants. India is the biggest violator of this inalienable human right,” the president said in a message on the occasion of Kashmiris’ Right to Self-determination Day being observed on January 5.\nThe President stressed that the United Nations must honour its commitment made 72 years ago and urged upon the global community not to shy away from its responsibility towards the oppressed people in Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nHe said on 5th January 1949, the United Nations Commission on India and Pakistan (UNCIP) adopted the resolution that guaranteed a free and fair plebiscite in Jammu and Kashmir to enable the Kashmiri people realize their right to self-determination.\nHe said since August 5, 2019, through continuous illegal and unilateral steps, the Indian government had created an environment of fear and chaos in the IIOJK.\nMore than 500 days of military siege, and draconian restrictions on fundamental freedoms and rights, including the right to life and health, despite the COVID-19 pandemic, had challenged the conscience of international community and India’s credentials of being a respectable member of the comity of nations, he added.\nThe President said,“Indian actions have been widely rejected by the international community, the United Nations, and international human rights organizations.\nThe current situation in the IIOJK is the worst in recent history where people have been deprived of all basic rights, including rights to freedom of expression and assembly, as well as self-determination.”\nThe people of IIOJK, he said, were being subjected to collective punishment by the Indian occupation forces, which had turned the territory into the largest militarized zone in the world and were seeking to change the demographic structure of the occupied territory in violation of the international law, including the 4th Geneva Convention.",
  "retrievedAt": "2025-08-11T20:13:02.245Z"
}
