{
  "title": "UN must implement its resolution to settle Kashmir issue : Mishal",
  "link": "https://www.app.com.pk/national/un-must-implement-its-resolution-to-settle-kashmir-issue-mishal/",
  "date_published": "2021-01-05T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):The Chairperson of Peace and Culture Organization Mishal Hussain Malik on Tuesday reminded the United Nation that it must implement its relevant resolutions to settle the Kashmir dispute to save the Kashmiris from Indian brutalities.\nMishal vowed that the fascist Modi government could cross all limits of brutalities, but they could not dampen the courage of the Kashmiri people.\nShe made it clear that the brave Kashmiris would continue their liberation struggle till it reaches its ultimate goal of right to self-determination.\nKashmiris on both sides of the Line of Control and the world observed the Right to Self-Determination Day on Tuesday with the pledge to continue their just struggle till breaking the shackles of Indian slavery.\nIt was on January 5, 1949 when the United Nations Security Council passed a resolution supporting the Kashmiris’ right to decide their future by themselves through a UN-sponsored plebiscite.\nThe Chairperson further said that the occupied forces used unbridled force and made life for the dwellers of the scenic valley a hell to silence their voices; however, she added that such brute tactics couldn’t deter them of their birth right of right to self-determination.\n“Indian barbarism has been going on for more than 70 years in Indian illegally occupied Jammu and Kashmir and everyday killings are a testimony of this barbarity in the territory,” she remarked.\nShe said that India inhuman forces have broken all records of committing brutalities and excesses on people in IIOJK .\nMushaal said that Kashmiris want justice and the world must support them in breaking the shackles of Indian slavery.\nShe demanded that UN must implement its resolutions on Kashmir that guaranteed the Kashmiris’ right to self-determination.",
  "retrievedAt": "2025-08-11T20:12:57.270Z"
}
