{
  "title": "NSTP to extend support for capacity building of science park at Sukkur IBA",
  "link": "https://www.app.com.pk/national/nstp-to-extend-support-for-capacity-building-of-science-park-at-sukkur-iba/",
  "date_published": "2021-01-05T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 05 (APP):National Science and Technology Park (NSTP), National University of Science and Technology (NUST) would extend intellectual-informational support for the capacity building of the science park at Sukkur Institute of Business Administration (IBA).\nThis was decided during a visit of Vice Chancellor Sukkur IBA, Dr Syed Mir Muhammad Shah to the NSTP on Tuesday where he interacted with the officials of university as well as the experts, research era and entrepreneurs at science park.\nFounded upon the Quadruple Helix Model, NSTP is Pakistan’s pioneering university-hosted park, which was inaugurated by Prime Minister Imran Khan in December 2019.\nNot only has the park made significant headway as Pakistan’s largest innovation ecosystem, it has also blazed a trail for establishment of more science parks across the country.\nThe VC’s visit was also aimed at garnering intellectual-informational support from NSTP for instituting Sukkur IBA’s own STP – Nisar Ahmed Siddiqui Technology (NASTech) Park – on the similar pattern.\nDuring his visit, the VC interacted with entrepreneurs, researchers and innovators working in various companies housed in the park after having been fully briefed on innovation management at NSTP.\nHe was all-praise for NUST’s visionary leadership for spearheading several initiatives like NSTP, which, he said, have been bringing far-reaching dividends to the economy.\nHe also counted upon NUST’s zealous efforts to win Hi-Tech Special Economic Zone (SEZ) status for NSTP in a brief span since the park’s inception.\nAfter his visit to NSTP, Dr Shah had a one-on-one meeting with Engr Javed Mahmood Bukhari, Rector NUST, to discuss matters of mutual interest.\nThe Rector acknowledged the contributions of Sukkur IBA to the advancement of quality higher education and bringing about discernible social impact.\nThe Rector made special mention that naming the institute’s STP after its founding VC Prof Nisar Ahmed Siddiqui is a glowing tribute to the legendary educationist, adding that the venture is a continuation of his legacy that will fetch incalculable economic gains to the institute and the country at large.\nHe also assured the visiting dignitary of NUST and NSTP’s full cooperation in the capacity building of the science park at Sukkur IBA.",
  "retrievedAt": "2025-08-11T20:12:58.252Z"
}
