{
  "title": "Pakistan vows firm support to Kashmiris, urges UN to honour pledge for plebiscite",
  "link": "https://www.app.com.pk/national/pakistan-vows-firm-support-to-kashmiris-urges-un-to-honour-pledge-for-plebiscite/",
  "date_published": "2021-01-05T08:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): Pakistan on Tuesday vowed to continue supporting Kashmiris in their just struggle for the right to self-determination, urging the United Nations to honour its pledge to hold a free and impartial plebiscite in Kashmir.\nPresident Dr Arif Alvi, Prime Minister Imran, Foreign Minister Shah Mahmood Qureshi and Information Minister Senator Shibli Faraz in their separate messages extended strong support to Kashmiris all over the world, observing the Kashmiris’ Right to Self-determination Day.\nOn January 5, 1949, the United Nations Commission for India and Pakistan (UNCIP) had adopted a resolution that embodied the principle of right to self-determination for the people of Kashmir.\nThe resolution mentions that the question of accession of Kashmir will be decided through democratic method of a free and impartial plebiscite, as Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK) are still living under brutal Indian occupation.\nKashmiris remain steadfast in their struggle for Right to Self-Determination guaranteed by UN resolutions and the UN charter. The world must act to fulfil its responsibility. Pakistan on its part, will always remain committed to the just cause of the people of Jammu & Kashmir.\n— The President of Pakistan (@PresOfPakistan) January 5, 2021\nPresident Dr Arif Alvi in his message said Pakistan would continue to extend all possible support for the just cause of the people of Jammu and Kashmir till the realization of their right to self-determination in accordance with the UN Security Council resolutions.\n“The right to self-determination is a vital component of human dignity. Negation of this right is the negation of human freedom, Universal Declaration of Human Rights, and UN Human Rights Covenants. India is the biggest violator of this inalienable human right,” he said.\nThe President stressed that the United Nations must honour its commitment made 72 years ago and urged upon the global community not to shy away from its responsibility towards the oppressed people in Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nHe said on 5th January 1949, the United Nations Commission on India and Pakistan (UNCIP) adopted the resolution that guaranteed a free and fair plebiscite in Jammu and Kashmir to enable the Kashmiri people realize their right to self-determination.\n‘Self-Determination is kashmiris’ basic right ‘\nHe said since August 5, 2019, through continuous illegal and unilateral steps, the Indian government had created an environment of fear and chaos in the IIOJK.\nMore than 500 days of military siege, and draconian restrictions on fundamental freedoms and rights, including the right to life and health, despite the COVID-19 pandemic, had challenged the conscience of international community and India’s credentials of being a respectable member of the comity of nations, he added.\nThe President said, “Indian actions have been widely rejected by the international community, the United Nations, and international human rights organizations. The current situation in the IIOJK is the worst in recent history where people have been deprived of all basic rights, including rights to freedom of expression and assembly, as well as self-determination.”\nThe people of IIOJK, he said, were being subjected to collective punishment by the Indian occupation forces, which had turned the territory into the largest militarized zone in the world and were seeking to change the demographic structure of the occupied territory in violation of the international law, including the 4th Geneva Convention.\nPrime Minister Imran Khan called upon the international community to take action on the “well-documented human rights violations” being committed with impunity by Indian Occupation forces against innocent Kashmiri men, women and children .\nOn 5th January 1949, the United Nations guaranteed the right to self-determination for the people of Jammu and Kashmir through an impartial plebiscite. We observe this day as a reminder to the UN & its member states of their unfulfilled commitment to the Kashmiri people.\n— Imran Khan (@ImranKhanPTI) January 4, 2021\nHe said it was time for the world to ensure that Kashmiris get their right to self- determination, denied to them since 73 years.\n“On 5th January 1949, the United Nations guaranteed the right to self-determination for the people of Jammu and Kashmir through an impartial plebiscite. We observe this day as a reminder to the UN and its member states of their unfulfilled commitment to the Kashmiri people,” he said in a series of tweets.\nImran Khan said despite suffering 73 years of brutal Indian occupation, Kashmiri people remained steadfast generation after generation in the demand for their inalienable right to self-determination as guaranteed to them under the United Nations Charter and by the UN Security Council.\naug 5 a reminder to UNited nations to fulfill commitment made to kashmiris 73 years ago\n“Pakistan stands unequivocally with the Kashmiri people in their struggle for freedom from the tyranny of one of the most ruthless, inhumane and illegal occupation in modern history,” he said.\nForeign Minister Shah Mahmood Qureshi said Pakistan would continue its strong and steadfast support to the valiant Kashmiri people in their just struggle for human dignity and their inalienable right to self-determination.\n“Regrettably, this right of Kashmiris is being brazenly denied by India in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) for more than past seven decades,” he said.\nQureshi said through its resolution, the United Nations had affirmed support for realization of the inalienable right to self-determination of Kashmiris – a right from which all other fundamental freedoms and basic human rights emanate.\n‘The United Nations, especially the UN Security Council, bear the responsibility to ensure fulfillment of the promise of granting the right to self-determination to the Kashmiris,” he said.\nThe Foreign Minister stressed that India was the sole cause of non-fulfillment of this promise.\nOn the 72nd anniversary of UNCIP’s commitment to resolve the Jammu & Kashmir dispute through free & impartial plebiscite under the UN auspices, Pakistan reaffirms its full support to Kashmiris in their just demand for realisation of their inalienable right to self determination.\n— Shah Mahmood Qureshi (@SMQureshiPTI) January 5, 2021\n“Post August 5, 2019, India’s unabated oppression has reached unprecedented levels with the inhuman military siege now in place for over 500 days,” he said.\nIn the midst of COVID-19 pandemic, he said, India had deprived Kashmiris of their basic rights to life, health and food.\nQureshi urged upon the international community to continue its support for the fundamental freedom and basic human rights of Kashmiris.\nHe also called upon India to allow United Nations Military Observer Group in India and Pakistan (UNMOGIP) for an  unhindered access to carry out its duties in IIOJK.\n“If India has nothing to hide, why does it not allow international media and civil society to visit and report on the human rights situation in IIOJK?,” he said.\nMinister for Information and Broadcasting Senator Shibli Faraz said January 5 was a remined for the United Nations that the resolution adopted by Security Council had not yet been implemented.\nآج کا دن اقوام متحدہ کو یاد دلاتا ہے کہ سیکورٹی کونسل کی5جنوری 1949ءکومقبوضہ جموں و کشمیر کے عوام کے مستقبل کے لیئے حق خودارادیت دینے کی قرارداد پر تاحال عمل نہیں ہوا۔ دنیا مقبوضہ کشمیر میں انسانیت کے خلاف بھارتی جرائم پرخاموشی توڑے۔2/3\n— Senator Shibli Faraz (@shiblifaraz) January 5, 2021\nIn a tweet, he said denial of self-determination right was also negation denial of human freedom, values and principles.\nHe mentioned that Prime Minister Imran Khan effectively advocated the cause the Kashmiris at all international forums.\n– Report by Shumaila Andleeb",
  "retrievedAt": "2025-08-11T20:13:03.434Z"
}
