{
  "title": "India should be tried for misleading world opinion about Kashmir : Shehryar Afridi",
  "link": "https://www.app.com.pk/national/india-should-be-tried-for-misleading-world-opinion-about-kashmir-shehryar-afridi/",
  "date_published": "2021-01-05T10:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): Kashmir Committee Chairman Shehryar Khan Afridi Tuesday said that India should be tried for criminally misleading the World opinion on Kashmir by spreading disinformation.\nIndia was using hundreds of fake Non-governmental organizations, media organisations and websites to mislead the world opinion on Kashmir and EU Disinfo Lab had fully exposed the Indian vicious designs, said Afridi.\nAddressing at a seminar here in connection with the Kashmiris right to self determination day, he said India could no more keep its illegal occupation of Jammu and Kashmir.\nHe said people of Indian illegally occupied Jammu and Kashmir (IIOJK) had asked the United Nations Security Council to materialise its commitment to hold an impartial and free plebiscite to decide their fate , but UN had failed to fulfill its promise.\nHe reiterated that Pakistan would continue to expose Indian expansionist designs in Jammu and Kashmir.\nHe said he being Minister for SAFRON, had invited United Nations Secretary General to Pakistan and pledged to stand by the UN resolutions on Kashmir dispute.\nAfridi said that Kashmir Committee had been reaching out to all stakeholders of Kashmir to develop its policy on Kashmir dispute.\nThe Kashmir Committee he said had representation of all political parties and it was working to help raise the Kashmir issue with a single voice.\nShehryar said tribal Pashtuns had joined hands with the Kashmiri freedom fighters to help liberate Jammu and Kashmir in 1948 and even today, the people of Pakistan stand by Kashmiris through thick and thin.\n“Today, even the Indian minorities are saying that Jinnah had taken a right decision by getting an independent state for the Muslims of India. Modi regime has been fully exposed due to its expansionist agenda,” he said.\nAfridi said that no one can think of making a compromise on two major security issues of Pakistan – our nuclear programme and our Kashmir policy.\nHe urged Pakistani youth to become bloggers, vlogers and social media activists to help counter fake propaganda by fake Indian social media sites.\nHe said the government was using all modern tools of information technology to expose Indian expansionist agenda.\nAzad Jammu and Kashmir Prime Minister Raja Farooq Haider said that Indian forces were present in Jammu and Kashmir even before freedom fighters launched movement.\nHe quoted some incidents from history to point out the fact how Kashmiri freedom struggle continued despite Indian imperialist designs.\nHe said that Pakistan’s new political map had been drafted on his advice and Junagadh was added to the map on his proposal.\nHaider said that Kashmir issue was debated at the European Union due to efforts by the Kashmiri diaspora and the sacrifices made by the Kashmiris.\nHe urged the Pakistan government to adopt an effective and robust policy on Kashmir adding that Kashmiris should themselves fight the case of Kashmir.\nHe criticised his own party, PML-N, for being silent during their five year tenure and urged Prime Minister Imran Khan to adopt a strong narrative on Kashmir.\nHe also criticised Shimla Agreement with India in the past, saying that this had damaged our case on Kashmir dispute.\nHe urged media to raise Kashmir issue, saying that Pakistani media needs to highlight the sacrifices made by the people of Jammu and Kashmir. He said media coverage could better raise the awareness on Kashmir dispute.\nHe said that Hindutva regime of India was trying to establish an imperialistic rule with an expansionist agenda and Pakistan was the only hurdle in Indian designs.\nAJK PM said Modi regime was working to create a Hindu Rashtra by annexing its neighbouring countries using its military might and Pakistan and other regional countries must take action in this regard.\nHe lauded Prime Minister Imran Khan and Human Rights Minister Dr Shireen Mazari for raising the illegal detention of Dukhtran-e-Millat leader Asiya Andrabi in Tehar jail and asked United Nations for her immediate release.\nHe said that stereotype policy on Kashmir is no more relevant and State of Pakistan should adopt innovative diplomacy to raise awareness on Jammu and Kashmir dispute.\nAmbassador (R) Nafees Zakaria said that the Kashmiris had led their narrative to counter fake Indian mantra on Kashmir and there have been volumes of reports by internal organisations how India had used money and resources to mislead the world on Kashmir.\nHe said that India had stood exposed by the fact that around 9000 mass graves had been found in Indian Illegally Occupied Jammu and KASHMIR (IIOJ&K).\nHe said that the bodies found in these mass graves were all indigenous Kashmiris who had been killed by the Indian fascist regime following its occupation policy of Kashmir.\nHe said that Amnesty International had issued a report on mass blinding of Kashmiris with pallet guns used by Indian occupational forces.\nHe said that mass rapes were also being used by Indian occupational forces as a tool of genocide in IIOJ&K.\nShandana Gulzar Khan MNA called for using media as a tool to fight the Kashmir case on global arena.\nShe called for raising Kashmir on all issues with one voice, asking the politicians to forge unity on the issue of Kashmir rising above petty political differences.\nPresident of Jammu and Kashmir Self Determination Movement International Raja Najabat Ali, Syed Mujahid Gilani and others also spoke at the occasion.",
  "retrievedAt": "2025-08-11T20:13:00.511Z"
}
