{
  "title": "History will forever remember October 27 as Black Day: Ayaz Sadiq",
  "link": "https://www.app.com.pk/national/history-will-forever-remember-october-27-as-black-day-ayaz-sadiq/",
  "date_published": "2024-10-26T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): Speaker of the National Assembly, Sardar Ayaz Sadiq, said on Saturday that October 27th serves as a day to highlight India’s forcible occupation of Kashmir and the atrocities committed against the Kashmiri people.\nOn this day in 1947, Indian forces entered Srinagar in an attempt to illegally occupy Kashmir—a day history will forever remember as “Black Day.”\nIn his message regarding Black Day, Ayaz Sadiq reaffirmed that the right to self-determination is a fundamental right of the Kashmiri people, who have made immense sacrifices in pursuit of this cause. He added that India has employed every possible means of oppression and brutality to suppress this right, but has failed and will continue to fail.\nAyaz Sadiq condemned India’s actions on August 5, 2019, describing them as blatant violations of international law. He urged India to reverse its illegal actions and end human rights abuses in occupied Kashmir.\nReferring to India’s constitutional amendments and the sham elections held in Illegally Occupied Jammu and Kashmir (IIOJK), the Speaker emphasized that the Kashmiri people have categorically rejected these moves.\nHe reiterated that Pakistan fully supports the Kashmiri people’s right to self-determination and stands in solidarity with them. Paying tribute to the heroes of Kashmir’s freedom movement, he said that their sacrifices will always be remembered with honor.\nAyaz Sadiq declared that the Kashmir issue remains an unfinished agenda of the partition of India and Pakistan.\nHe stressed that sustainable peace in the region requires resolving this issue in accordance with United Nations resolutions and the aspirations of the Kashmiri people.\nHe also affirmed that Pakistan will continue to provide political, diplomatic, and moral support to the Kashmiri people at all levels and will raise its voice on international and regional platforms.\nThe Speaker further urged the international community to play its role in resolving both the Kashmir and Palestine issues.",
  "retrievedAt": "2025-08-10T20:23:22.655Z"
}
