{
  "title": "JazzCash partners with Dgpays to enhance e-commerce in Pakistan",
  "link": "https://www.app.com.pk/national/jazzcash-partners-with-dgpays-to-enhance-e-commerce-in-pakistan/",
  "date_published": "2024-10-26T10:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):The partnership between Dgpays will enable JazzCash to upgrade its payment gateway for e-commerce transactions, enhancing transaction speed, security, and overall experience for both merchants and consumers across Pakistan.\nIn this regard JazzCash, Pakistan’s largest fintech organisation,, has signed an agreement with Dgpays, a leading financial infrastructure technology provider in the Europe, the Middle East and Africa (EMEA) region said a news release.\nAdoption of digital wallets is driving the growth in cashless payments in Pakistan. The number of digital wallet transactions surged 134% year-on-year to 269 million for the 12 months ended 30 June 2024, accounting for 87% of all online e-commerce payments .\nJazzCash, which currently serves over 1,700 e-commerce merchants across a wide array of sectors, has delivered accelerated growth as well, processing over 110 million transactions in the first three quarters of 2024, an increase of 150% year-on-year.\n“At JazzCash, we are dedicated to empowering businesses, from microentrepreneurs to startups and SMEs, with the financial tools they need to thrive in an increasingly digital economy. As Pakistan’s e-commerce sector undergoes unprecedented growth, JazzCash is committed to providing secure, seamless, and swift payment solutions. Our new payment gateway will enable thousands of e-commerce merchants to accelerate their growth by streamlining transactions, simplifying checkout, and enhancing security,” said Murtaza Ali, President of JazzCash.\n“We are pleased to partner with JazzCash to bring our advanced payment gateway solutions to Pakistan’s dynamic fintech market. At Dgpays, we focus on building innovative, scalable payment infrastructures that empower businesses to grow and customers to transact securely and seamlessly. By collaborating with JazzCash, we are enhancing digital payment capabilities and driving financial inclusion in a region poised for immense growth,” said Serkan Omerbeyoglu, CEO and Founder of Dgpays.\nThe upgraded payment gateway will offer faster transactions, a comprehensive merchant management system, customizable checkout pages, and advanced fraud prevention tools. This partnership and technology upgrade aligns with JazzCash’s broader mission to advance Pakistan’s digital payment landscape. By empowering businesses with the latest payment technologies, JazzCash is driving financial inclusion, simplifying online payments, and continuing to lead the country toward a cashless society.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:23:50.406Z"
}
