{
  "title": "ACT Alliance lauds FBR for highlighting ongoing battle with tax evasion",
  "link": "https://www.app.com.pk/national/act-alliance-lauds-fbr-for-highlighting-ongoing-battle-with-tax-evasion/",
  "date_published": "2024-10-26T10:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):The Action to Counter Illicit Trade (ACT) Alliance on Saturday appreciated the Federal Board of Revenue (FBR) for highlighting Pakistan’s ongoing battle with tax evasion, particularly in the tobacco sector.\nDuring a recent Senate Standing Committee on Finance meeting, FBR reported that an alarming 70 per cent of cigarettes sold in the country evade taxation, amounting to a massive revenue shortfall for the national exchequer, said a press release.\nWith only 30 per cent of cigarettes on the market being tax-paid, Chairman of the FBR, Rashid Mahmood Langrial, announced a significant crackdown on smuggling and illegal cigarette sales to begin in January, with the recruitment of additional enforcement personnel.\nAccording to FBR’s projections, tackling these illicit sales could generate Rs 200-250 billion in additional revenue annually, from Rs 300 billion to over Rs 500 billion, or nearly $2 billion.\nIn a discussion with civil society and media representatives, the ACT Alliance lauded Chairman Langrial’s dedication in addressing this pervasive issue, recognizing that his leadership was critical in securing Pakistan’s economic future. This projected increase in revenue is crucial for funding essential public services and driving economic growth.\nACT Alliance said collaboration across government agencies, provincial authorities, and law enforcement was essential in achieving Pakistan’s economic goals. The annual loss of revenue from the illegal cigarette trade alone was a burden Pakistan could no longer afford.\n“We call on all stakeholders to support FBR’s efforts, reinforcing measures that strengthen tax compliance and encourage economic integrity,” ACT Alliance National Convenor Mubahsir Akram said. He added these critical steps will position Pakistan for a more prosperous future, ensuring fair contributions to the national economy from all sectors.\nACT Alliance reiterated its support for FBR’s efforts. It encouraged all relevant authorities to take a unified approach against illicit trade, contributing to Pakistan’s healthier and more resilient economic landscape.\nThe ACT Alliance was dedicated to combating the extensive economic and social damages caused by illicit trade and tax evasion in Pakistan. This civil society alliance supports fair and lawful business practices by advocating for more vigorous regulatory enforcement and comprehensive policy reforms.\nACT Alliance engaged with civil society and media organizations, government entities, industry stakeholders, and the public to create a more transparent and accountable economic landscape.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:23:45.456Z"
}
