{
  "title": "President urges international community to take action on human rights abuses in IIOJK",
  "link": "https://www.app.com.pk/national/president-urges-international-community-to-take-action-on-human-rights-abuses-in-iiojk/",
  "date_published": "2024-10-26T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):President Asif Ali Zardari has called upon the international community to exert pressure on India to halt its ongoing human rights abuses in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), alleviate the suffering of Kashmiris, and implement UN Security Council resolutions.\n“Pakistan will stand shoulder-to-shoulder with its Kashmiri brothers and sisters until they achieve their inalienable right to self-determination,” the president said in a message on the occasion of “Kashmir Black Day”, 27 October 2024.\nThe president said October 27, 1947, marked a dark chapter in South Asian history when India sent troops to occupy Jammu and Kashmir. For decades, the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) have endured brutal repression by Indian forces.\nOver the years, he said India had transformed IIOJK into one of the most militarised regions in the world. Thousands of innocent Kashmiris have been killed, while their legitimate leaders remain imprisoned, and local media is heavily censored.\nFurthermore, the president emphasized that the United Nations Security Council had repeatedly affirmed the right of the Kashmiri people to self-determination through a fair and impartial plebiscite.\nYet, he said India continued to defy these resolutions and deny Kashmiris their fundamental rights. “Since August 5, 2019, India has further escalated its occupation by stripping IIOJK of its special status and implementing measures to alter its demographic and political landscape. These actions are part of a broader strategy to consolidate control and suppress the Kashmiri Freedom Movement.”\nHe said despite these oppressive tactics, the resilient people of Kashmir remained steadfast in their struggle for freedom. “We strongly condemn India’s ongoing atrocities and reaffirm our unwavering moral, diplomatic, and political support for the Kashmiri people’s just cause”, he added.\nPresident Zardari pointed out that the recent developments in the Middle East were a stark reminder that long-standing disputes should not be allowed to fester. Violating international law and pushing disputes under the rug does not guarantee lasting peace, he said.\n“Three generations of Kashmiris have waited for the world, especially the United Nations, to deliver them their right to self-determination. The world can no longer ignore its responsibility,” the president added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:23:29.753Z"
}
