{
  "title": "Ahsan vows for early completion of incomplete projects in Gwadar",
  "link": "https://www.app.com.pk/national/ahsan-vows-for-early-completion-of-incomplete-projects-in-gwadar/",
  "date_published": "2022-05-17T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Minister for  Planning and Development, Ahsan Iqbal vowed on Tuesday that the development projects that were facing delays during last four years would be completed on priority.\n“We will resume work on the projects in Gwadar city with same speed that were being executed during our previous tenure,” Ahsan Iqbal said while addressing students at the Gwadar university in Gwadar.\nHe said the projects of transmission lines and up-gradation of hospitals in Gwadar would be completed soon.\nThe minister added that the university campus would also be completed soon while the local students would be provided with scholarships to enable them continue their education.\nAhsan Iqbal said China Pakistan Economic Corridor (CPEC) was the project of Pakistan’s development.\nHe said the present government was not only spending funds on the development projects but on public as well.\nHe said completing CPEC projects was the top priority of the present government.During our previous government, we were working hard to speed up the development process of Gwadar city, he said adding that we gave importance to higher education in Gwadar as if there is no education, there would not be development.\nHe said the present government would put its best efforts to complete the university campus in two to three years.\nThe minister added that Balochistan province could play vital role in the development of the country.\n“We worked hard for the development of Gwadar citizens and completed numerous development projects in the city”, he said adding “we also started projects of basic needs such as electricity and water in the city”.\nIn 2017, he said the PML-N government started dam projects in Gwadar but these projects faced delays.\n“We were hoping that these projects would be completed in two years but unfortunately they could not yet be completed”.\nHe said the project of Islamabad Metro Bus also faced unnecessary delays of four years, but we made it operational within ten days after taking over the charge of the government.",
  "retrievedAt": "2025-08-11T14:55:05.866Z"
}
