{
  "title": "GA Gulzar all praise to Molvi Farooq, Ghani Lone and martyrs of Hawal on martyrdom anniversaries",
  "link": "https://www.app.com.pk/national/ga-gulzar-all-praise-to-molvi-farooq-ghani-lone-and-martyrs-of-hawal-on-martyrdom-anniversaries/",
  "date_published": "2022-05-17T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Vice Chairman of All Parties Hurriyat Conference (APHC), Ghulam Ahmad Gulzar has paid glowing tributes to prominent Kashmiri leaders, Mirwaiz Molvi Muhammad Farooq and Khawaja Abdul Ghani Lone, who were ruthlessly killed by Indian agents on May 21 in 1990 and 2002 respectively in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAccording to Kashmir Media Service (KMS), Ghulam Ahmad Gulzar in a statement from Srinagar Central Jail also paid tributes to all martyrs of Hawal. He said that Kashmiris will not forget the sacrifices of their martyrs like Mirwaiz Molvi Muhammad Farooq, Khawaja Abdul Ghani Lone and martyrs of Hawal who all fell victim to Indian state terrorism in the month of May.\nGulzar also paid salutes and glowing tributes to all the martyrs of the freedom movement. He said that Shaheed Mirwaiz Muhammad Farooq was a great preacher and religious scholar and that the whole Mirwaiz family had rendered unforgettable services for the dissemination of the message of Islam.\nHe said that Shaheed Khawaja Abdul Ghani Lone was a fearless leader who throughout his life tirelessly worked for the peaceful resolution of the Kashmir issue. He said that the contribution of these great leaders to the freedom struggle is unforgettable.\nHe appealed to the Kashmiri people to hold Dua and Quran Khawani in Masjids and Dargahs for the martyred leaders, the victims of the Hawal massacre and all those who fell to Indian bullets during the ongoing freedom struggle.\nGhulam Ahmad Gulzar said that the best way to pay homage to the Kashmiri martyrs is to carry forward the ongoing freedom struggle till it reaches its logical conclusion. Stating that the blood of martyrs infuses new vigour in the Kashmiris’ freedom movement, he said that lacs of people have so far offered their lives to attain freedom from Indian bondage and the Kashmiris are determined to take every step to safeguard these sacrifices and uphold the Muslim character of occupied Jammu and Kashmir.\nHe strongly condemned the ongoing ruthless genocide, raids, cordon and search operations, human rights abuses, illegal arrests, harassment, frequent use of brute force and barbarism by the Indian occupation forces and its notorious probe agencies against the freedom loving people of Kashmir.\nHe said that Modi led Indian regime cannot suppress the Kashmiri people’s urge for freedom through such brutal measures, adding the dream of peace and prosperity in the region would remain elusive without resolving the Kashmir dispute.\nThe only way to do this, he said, is to give the Kashmiris their inalienable right to self-determination promised to them by the comity of nations as well as the Indian leadership.\nMeanwhile, APHC leader Khawaja Firdous in a statement issued in Srinagar said that ever since BJP-led government came to power in India, innocent Kashmiri youth are killed on daily basis in the occupied territory.\nHe said that on one hand Modi regime is terminating Kashmiri Muslim employees from government services, and on the other hand it has increased assembly seats for Hindu majority Jammu region to torpedo the Muslim majority character of Jammu and Kashmir.",
  "retrievedAt": "2025-08-11T14:55:04.303Z"
}
