{
  "title": "Developed world has to do more to combat climate change effects: Sherry",
  "link": "https://www.app.com.pk/national/developed-world-has-to-do-more-to-combat-climate-change-effects-sherry/",
  "date_published": "2022-05-17T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Tuesday said that developed countries should take collective measures and have to do more to combat the effects of climate change in Pakistan and all over the world.\nAddressing a youth dialogue event on the right to a clean and healthy environment here in Islamabad, the minister for climate change said climate issue is the only platform of equity where the world has almost consensus to save their generations from the worst effects of climate change.\nExplaining the effects of climate change in Pakistan, she said Pakistan is under-resourced both in terms of expertise and climate funds to create a nationwide, coherent, coordinated, and ongoing sustained response to a crisis that has been brewing for years.\nMinister further stated that water scarcity is a real danger, particularly to lower riparian areas like Sindh; the river is almost dry by the time it reaches the upper Sindh.\nWomen still have to walk the miles to bring the water to their homes, particularly in rural areas. Commenting about the reduction in emissions, she said Pakistan produces less than 1% of the global emissions.\nShe said the people of Pakistan are struggling with extreme temperatures in the South, touching 50 Degrees Celsius for the last three years. Minister further stated that Pakistan could gradually overcome the effects of climate change by engaging youth and climate experts.\nThe minister said 60% of Pakistan’s fast-growing population is under 30, and another cohort is even under that. So, “I think we need to enable and mobilize young leaders to play their role to combat climate change in Pakistan.”\nAmbassador of Sweden to Pakistan, Henrik Persson addressing the audience, said, “Sweden is on track to become the world’s first fossil-free welfare state, reaching net zero emissions by 2045. Stockholm+50 is an opportunity to consider what is going well, what can be improved, and what we can do to meet the Sustainable Development Goals.\nYouth voices need to be communicated to the leaders to drive action to achieve sustainable development. It is possible to create a better future if we act together. Sweden is open for collaboration”.\nHe said Sweden is hosting Stockholm+50, a crucial international environmental meeting on 2nd and 3rd June 2022.\nSpeaking on occasion, Knut Ostby, Resident Representative, UNDP Pakistan, said, ‘Pakistan is the fifth most populous and one of the youngest countries in the world.\nCurrently, 68% of Pakistanis are below 30, and 27% are aged between 15 and 29.\nHe said the current moment presents an opportunity for young Pakistanis to drive transformative changes on the ground and be ambassadors of climate action.\nThrough increased cooperation and dialogue, the youth can help strengthen the ability of businesses and governments to deal with the impacts of climate change. The youth now have the chance to advocate for a resilient and greener economy that will lead to prosperity, new jobs, and a healthier planet.’\nHammad Naqi Khan, Director General WWF-Pakistan, stated, “As the largest conservation organization in Pakistan, WWF-Pakistan has been working to foster young people’s connection with nature.\nLast year alone, we engaged with over 14,000 youth through various initiatives. At WWF, we believe that youth are both advocates and catalysts of change and, thus, an essential part of decision making.\nTherefore, we are working with partners to develop young people’s knowledge about sustainable development, connect them to experts, businesses, and government, and elevate their voices to appropriate platforms.”\nOver 60 young people aged between 11-25 participated in the dialogues and shared their policy proposals toward the right to a healthy environment. The dialogue was moderated by Ms Saher Rashid Baig, a Pakistani member of the Stockholm+50 Youth Task and a Global youth advocate for climate, ocean, gender, and human rights.\nThe desired and concrete policy demands of the Youth Dialogue will be communicated to the Stockholm+50 Secretariat and incorporated into the policy positions of the Stockholm+50.\nThe purpose of youth dialogue was to create more awareness amongst Pakistani youth regarding their role at a multilateral level, at the policy making tables such as the Stockholm+50 International Meeting, and at the Climate Negotiations under the United Nations Framework Convention on Climate Change’s Conference of Parties (COPs).",
  "retrievedAt": "2025-08-11T14:55:01.580Z"
}
