{
  "title": "Telecom industry attracts $6.1b FDI: Amin ul Haque",
  "link": "https://www.app.com.pk/national/telecom-industry-attracts-6-1b-fdi-amin-ul-haque/",
  "date_published": "2022-05-17T13:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Federal Minister for IT and Telecommunication Syed Amin ul Haque on Tuesday said the telecommunication industry had attracted about 6.1 billion dollars Foreign Direct Investment (FDI) from first July 2018 to 30 March, 2022.\nIn his message on the occasion of ‘World Telecommunication and Information Society Day’, The minister said that revolutionary steps were taken in IT and Telecommunication sector in last three years which had made it most attractive sector for the local and foreign investors.\nThe number of active mobile SIMs have reached 193 million by March 2022 due to reforms in Telecom sector and the number of mobile and fixed Broadband witnessed 39.4 percent increase, he said.\nThe federal minister said that projects were started through Universal Service Fund (USF), the attached department of Ministry of IT and Telecom, for the provision of broadband services across the country. Over 37 projects of worth Rs 31 billion were launched by June 2021 and up to 50 to 75 percent work has been completed on most of these projects, he added.\nThe minister said that Rs 6.47 billion were being spent on nine different projects of optical fiber and broadband services in Punjab and nine projects of worth over Rs 8.48 billion were also underway in Sindh for provision of high speed internet and laying of fiber optical in the province. The number of projects for the 14 districts of Balochistan is 11 costing Rs 8.43 billion. Over 7.08 billion rupees are being spent on 8 different projects of broadband services and optical fiber in fourteen districts of KPK, he noted.\nSyed Amin ul Haque said that Rs 29 billion were also being spent on 28 projects for provision of broadband services in far-flung areas during current financial year.\nWork is also going on on nine different projects for laying of fiber optic cable in all four provinces. Total 4,746 kilometres long cable is being laid which will cost Rs 13.14 billion, he said. He said that USF completed projects for provision of mobile network on 1,929 kilometres main highways.",
  "retrievedAt": "2025-08-11T14:55:06.518Z"
}
