{
  "title": "SC reserves decision on presidential reference seeking interpretation of Article 63-A",
  "link": "https://www.app.com.pk/national/sc-reserves-decision-on-presidential-reference-seeking-interpretation-of-article-63-a/",
  "date_published": "2022-05-17T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): The Supreme Court on Tuesday reserved its verdict on the presidential reference seeking interpretation of the Article 63-A of the Constitution.\nThe court would likely announce its decision today evening.\nA five-member larger bench of the apex court headed by Chief Justice Umar Ata Bandial comprising Justice Ijaz-ul-Ahsan, Justice Mazhar Alam Miankhel, Justice Muneeb Akhtar and Justice Jamal Khan Mandokhel, concluded hearing of the case.\nDuring the course of proceedings, Pakistan Muslim League Nawaz (PML-N) counsel Makhdoom Ali Khan’s assistant lawyer submitted written submissions and pleaded the court to grant more time for submission of arguments.\nThe Chief Justice denied the further adjournment.\nThe counsel said that the circumstances had changed now and therefore, he should be allowed more time to take new instructions from the client.\nAttorney General for Pakistan (AGP) Ashtar Ausaf appeared before the court and said that Article 63-A was a complete code. He asked whether there was a need to include more things in Article 63-A or not. He said that it had to be reviewed whether the votes of dissident members be counted.\nHe said that the court was reviewing the presidential reference in the advisory authority. He said that he would assist the court in line with the reference and legal questions.\nJustice Ijaz said that there was a severe punishment for dishonesty. Upon this, the AGP said that no doubt dishonesty was a big crime.\nJustice Jamal Khan said that there was also a betrayal of one’s conscience.He asked could the vote be casted against the conscience.\nThe AGP said that the court could not rely on Raza Rabbani or anyone else’s arguments.\nHe said that people voted for a member for five years and the prime minister was elected by the votes of members. He asked what would happen if a Prime Minister did not keep his promises to the people.\nUpon this, Justice Ijaz responded that the members should resign in this case.\nThe AGP said that the members could change the prime minister over failure to fulfil the commitments made with the public. A person could not be sentenced to death if seven years sentence was mentioned in the law, he added.\nJustice Munib Akhtar asked whether a law could not be framed to punish the dissident member? The AGP replied that laws could be framed but the Parliament had not framed laws in this regard.\nJustice Munib asked the AGP on what grounds he was saying that Article 63-A did not apply in this situation.\nThe AGP replied that Articles 62 and 63 could applied without amendments in the Constitution. He said that the court could not amend the Constitution. Only Parliament could amend the Articles 62, 63 and 63-A, he added.\nHe said that the Constitution provided a penalty which could not be increased without amendment. Justice Jamal Khan asked could the penalty provided by the constitution be increased by law.\nThe AGP said that that the president had never approached the court on matters of similar nature. The reference should also be looked at in light of past, he added.\nHe said that the office of the Attorney General or legal experts were not consulted before submission of the reference.\nJustice Ijaz said the President was not bound to take advice from experts before proceeding with references. He said as per Article 186, the President could send the reference.\nHe asked the AGP whether he was distancing himself from the reference sent by the President.\nUpon this, the AGP responded that he had not received instructions from the government regarding the reference.\nHe said that the parties that were in opposition at the time of the filing of the reference have come to power now but the stance of these parties on the reference had not changed.\nJustice Ijaz asked the AGP whether he was saying the reference was not maintainable and it should be sent back without our response. He recalled that the former attorney general Khalid Javed had termed this reference maintainable.\nJustice Munib asked Ashtar as a new attorney general, he could argue his own stance.\nThe AGP said that the reference was filed on the advice of ex-Prime Minister Imran Khan. Justice Jamal Khan asked whether this was the view of the government.\nThe AGP said that this was his view as the attorney general. He said that the Pakistan Tehreek-e-Insaf had its own lawyers to present their arguments.\nChief Justice Bandial said the court had conducted a lot of hearings on the case. He said that the AGP should not focus on technical details as things had advanced beyond the issue of maintainability.\nThe AGP said that this was not a technical matter but a constitutional one. He said that he was still agree with the court’s observations.\nThe Chief Justice said that Article 17 talked about the rights of a political party while Article 63-A gave rights to political parties and protected these rights. In case of violation of Article 63-A, there were two parties one was the political party itself and another was dissident members, he added.\nThe AGP said that Article 63-A outlined the process of proceedings against lawmakers over violation of party policies.\nHe said that there were multiple pleas on Article 63-A pending in this court and the decision on the reference would affect their proceedings.\nHe said a lawmaker was not de-seated automatically as a result of the violation of the said article. “The party member was asked to explain themself through a show-cause notice and if the explanation was not satisfactory then a reference could be sent to the Election Commission of Pakistan through speaker,” he added.",
  "retrievedAt": "2025-08-11T14:55:08.186Z"
}
