{
  "title": "PM vows to resist anti-vaxxers to achieve dream of polio-free Pakistan",
  "link": "https://www.app.com.pk/national/pm-vows-to-resist-anti-vaxxers-to-achieve-dream-of-polio-free-pakistan/",
  "date_published": "2023-10-24T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday, vowing to resist the individuals propagating against the polio vaccination, resolved to achieve the dream of a polio-free Pakistan by carrying forward the journey with unshakeable commitment.\n“I can assure that we gonna have it. We will realise this dream. We will never step back, may be an inch, may be a foot or may be a mile. This will always be a forth-going journey,” the prime minister said addressing a ceremony to mark the World Polio Day.\nThe event was organized by the Pakistan Polio Programme to pay homage to the resilience and dedication of frontline workers on the World Polio Day, which is commemorated on October 24 every year.\nFederal Health Minister Dr Nadeem Jan, Federal Health Secretary Iftikhar Ali Shallwani, representatives of polio partners Rotary, World Health Organisation and United Nations Children’s Fund (UNICEF), and frontline workers and their families were in attendance.\nThe prime minister said by opposing the polio vaccine, the anti-vaxxers, intentionally or unintentionally, were partnering with the forces of darkness. He emphasised the role of faith leaders and the society to make such people realise that they were actually partnering with the destroyer of the humans.\n“This is unacceptable. We will resist this,” he resolved.\nHe expressed his gratitude to the global partners who continued to supporting Pakistan in its endeavour of polio eradication.\nRecognising the sacrifices of the polio workers and the security personnel guarding them, the prime minister said they had paid the highest price for the cause.\nHe said the frontline health workers were the heroes of Pakistan, who were working in challenging environments, facing social barriers and even threats to their safety without ever losing their dedication.\nThe prime minister recognised the services of three police constables who were martyred while on polio duty and to two vaccinators who were injured.\nHe also presented appreciation shields to the former coordinator of the Sindh Emergency Operation Cell (EOC) Fayyaz Abbasi and the family of Huma Ashraf, who was severely injured in a train accident while on polio duty in September.\nThe prime minister also announced to personally visit Huma as a gesture to recognise her services in the mission of a polio-free Pakistan.\n“Today is the day to remember how far we have come and how crucial polio eradication efforts remain. Pakistan cannot be the reason to hold the world back. We must move forward to 2024 with the realisation that the weight of global eradication lies on our shoulders. We must leave no room for the virus to spread and reach every child with the vaccine before the virus has a chance to permanently change their lives,” he remarked.\nCaretaker Health Minister Nadeem Jan, in his address, paid homage to the polio workers who were striving to accomplish the mission of a polio-free Pakistan while facing many odds and hardships.\nHe emphasised that the community health workers should be acknowledged and honoured as motivation would enhance their performance.\nHe called for changing the narrative from “Pak Fights Polio” to “Pakistan Winning Over Polio”.\nHe expressed the hope that the World Polio Day next year would mark the complete eradication of polio from Pakistan.\nFederal Health Secretary Iftikhar Shallwani said the campaign was started in 1994 and continued across Pakistan with dedication to date with support from the aid agencies.\nBesides the polio drive, other related subjects including maternal and neonatal healthcare were also worked on, he added.\nWHO Representative in Pakistan Palitha Mahipala said the Day was observed to commemorate the global journey. He said the polio eradication was one of the major commitments made by WHO which provided technical support to Pakistan.\nHe said the day was not far when Pakistan would get rid of the crippling disease within next few years as the number of paralysis had sharply declined.\nUNICEF Chief Polio Officer Melissa Corkum said the credit for the successes went to the health workers who despite challenges went door to door in every campaign.\nShe said the Day was not only to commemorate the successes but also to remember those who sacrificed their lives during the struggle.\nRotary’s District Governor Mr Masrur J. Scheik highlighted his organisation’s support for polio eradication through funds, volunteering during campaigns, social mobilisation of workers and, installing solar water filtration plants.",
  "retrievedAt": "2025-08-11T10:13:02.836Z"
}
