{
  "title": "PM launches portal to address scholarships complaints, ensure meritocracy",
  "link": "https://www.app.com.pk/national/pm-launches-portal-to-address-scholarships-complaints-ensure-meritocracy/",
  "date_published": "2022-02-17T07:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): Prime Minister Imran Khan Thursday launched a portal exclusively to register the complaints related to the educational scholarships,  which he believed, would ensure meritocracy, transparency and uplift the students with more hunger and drive.\nLinked with the Prime Minister Citizen Portal, the facility would help the scholarship holders to register their complaints regarding the problems faced by them, besides ensuring the judicious use of the allocated resources.\nCurrently, the government is spending Rs 28 billion to support the education of the deserving and competent students. The beneficiaries include around 2.6 million students with 72% females.\nThe prime minister said that a team of academics would constantly oversee the portal and guide the government to grant scholarships in particular subjects keeping in view the needs of the market as well as the country.\nHe said the government had long been receiving complaints from the students for being neglected or delay in the payment of scholarships which prompted him to introduce a technology-based centralized system for verification and criteria setting of scholarships.\n“Through scholarships, we can decided the future course of the country’s development. The purpose of the education system should be the nation building. The subjects (being taught) should have a connection with the nation building…Considering the technology revolution, we should direct our youth to the technology,” he remarked.\nThe prime minister said the government also launched a Rahmatullil Alamin Scholarship with a view to acquaint the youth with the leadership qualities of Holy Prophet Muhammad (PBUH) and principles of the Madina State Model which produced great leaders who brought about a great revolution.\nHe said any state like the Scandinavian, following those principles would excel and emerge as a welfare state.\nHe said it was government as well as the society’s responsibility to guide the youth towards technology and humanity besides uplifting the people with more hunger and drive.\nPrime Minister Imran said the portal would also help save the precious time of the students and make them focus on their education who otherwise had to go from pillar to post to register their scholarship-related complaints.\nThe prime minister also congratulated the team of Prime Minister Delivery Unit for putting in their efforts to launch the system and National University of Science and Technology for setting the education standard in Pakistan.\nMinister for Federal Education Shafqat Mahmood said the incumbent government enhanced the number of scholarship under the prime minister’s vision of not depriving any student for non-affordability of fees.\nHe said during last three years, the government gave away record scholarships to support the future generations.\nHe said giving priority to the higher education, the government allocated Rs 123 billion for the sector including Rs 42 billion for new schemes. Moreover, 28 new universities had been established during last three years, he added.\nThe minister also lauded the PMDU for keeping a check on the performance of the ministries.",
  "retrievedAt": "2025-08-11T14:21:52.683Z"
}
