{
  "title": "President stresses value addition of citrus produce to boost exports",
  "link": "https://www.app.com.pk/national/president-stresses-value-addition-of-citrus-produce-to-boost-exports/",
  "date_published": "2022-02-17T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): President Dr. Arif Alvi on Thursday called upon the citrus growers to improve the quality of their produce through value addition and use of modern technology in a bid to capture the international market.\nAddressing here at the Citrus Show 2020, the president said quality packaging and preservation of citrus through cold chain logistics was important to boost citrus exports.\nThe citrus exhibition, jointly organized by the Ministry of Commerce, Sargodha Chamber of Commerce & Industry, and Trade Development Authority of Pakistan here at Aiwan-e-Sadr, was attended by traders, exporters, and horticulture experts of citrus.\nPresident Alvi said several steps such as organic production and growing seedless citrus variety could not only find a niche in the international market but also help the country earn high-end revenues.\nHe said Pakistan was rich in the production of citrus, however stressed an effective policy to broaden the scope of exports.\nHe said the country’s citrus produce had the potential to reach out to the Central Asian market through Afghanistan and also to Europe by means of the Pakistan-Iran-Turkey cargo train.\nDr Alvi said Pakistan’s successful mango diplomacy had already made its mark in the world and expressed confidence that the focus on citrus would also secure attention at the international level.\nHe also emphasized using technology to increase per acre yield of citrus and mentioned that collaboration between universities and the market could be beneficial in chalking out of productive policies as per demands.\nThe president said that the footprint of Pakistan in citrus production needed to match the proportion of its population and exports.\nParliamentary Secretary for Commerce Alia Hamza Malik said the ministry had constituted a working group for a doable policy to enhance Kinnow produce.\nShe said the focus was being laid on the production of an improved and seedless variety of Kinnow to boost exports.\nPresident Sargodha Chamber of Commerce & Industries Shoaib Ahmed Basra said Sargodha was known as ‘California of Pakistan’ for its citrus orchards, 200 processing units, and four juice extraction factories.\nHe mentioned that last year, 45,000 tonnes of Kinnow were exported and also proposed inking a Preferential Trade Agreement (PTA) with Thailand on citrus exports.\nGroup Leader Sargodha Chamber of Commerce & Industries Chaudhry Amir Atta Bajwa pointed out the unavailability of a modern citrus laboratory in Sargodha and stressed the need for subsidies, from citrus grower to industry levels.\nLater, the president visited the stalls of citrus with a variety of Kinnows, Mussami, Succri, Red-blood and other varieties put on display and lauded the efforts of the Sargodha Chamber of Commerce & Industry.",
  "retrievedAt": "2025-08-11T14:21:48.431Z"
}
