{
  "title": "Opposition miserably fails in Parliament: Faisal Javed",
  "link": "https://www.app.com.pk/national/opposition-miserably-fails-in-parliament-faisal-javed/",
  "date_published": "2022-02-17T10:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): Pakistan Tehreek-e-Insaf (PTI) leader Senator Faisal Javed Khan on Thursday said that opposition had failed miserably in Parliament to play a constructive role and resorted to cheap tricks to disrupt the proceeding of House.\nTalking to media persons at Parliament House, flanked by Senator Waleed Iqbal, he said the opposition deliberately tried to create chaos in the house but government successfully passed the legislation.\nFaisal Javed who is also Chairman Senate Standing Committee on Information and Broadcasting said opposition’s threat to bring no confidence motion was for blackmailing government for National Reconciliation Ordinance (NRO) but they would not succeed in their mission.\nHe said that opposition had made claims during legislation on Finance Bill, but faced defeat.\nHe thanked government allies’ parties, adding that they had always proved that they were with the government. He said that opposition had hold public meetings, marches and announced resignations which were flopped.\nHe said that ‘Maqsood ‘Chaprasi’ was the actual problem of opposition, adding that how billions of rupees came into the accounts of Rs15000 salary employees.\nHe said that Shahbaz Sharif had to answer it.\nHe said that now again they were talking about no confidence to blackmail the government for NRO.He said that opposition would also face defeat in next General Elections 2023.\nHe said that World Bank Report had praised Pakistan GDP growth.\nHe said that Bloomberg report in front of us and world economic forum report was also acknowledged ‘Ehsaas’ programme.\nFaisal Javed said that the government had made it clear that NRO would not be given to the opposition at any cost.\nHe said that opposition parties had same issues and corruptions so they were together. He said that opposition would face defeat in general elections 2023.\nFaisal Javed said that a lengthy Senate session was adjourned today which was very fruitful session.He said that opposition claims were always proved wrong.\nSenator Waleed Iqbal said that Prime Minister Imran Khan had no concern about the opposition meetings, as they held same meetings before but get nothing.\nHe said that government would complete its tenure and opposition have to wait till general elections 2023. He said that opposition despite majority in Senate was unable to do anything than what else they can.",
  "retrievedAt": "2025-08-11T14:21:44.536Z"
}
