{
  "title": "Peshawar BRT becomes 3rd in Asia to receive Gold standard status",
  "link": "https://www.app.com.pk/national/peshawar-brt-becomes-3rd-in-asia-to-receive-gold-standard-status/",
  "date_published": "2022-02-17T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP):The Asian Development Bank (ADB) Thursday hailed ZuPeshawar-the operator of Bus Rapid Transit (BRT) system, on receiving International Gold Standard Satus (IGSS) saying that Pakistan’s Peshawar now has become officially first in the sub-continent, third in Asia, and 11th city globally to receive Gold Standard.\nDr. Walter Hook, member of the Tech Committee, which evaluates world-class Bus Rapid Transport (BRT) presented the standard to Khyber Pakhtunkhwa’s minister Kamran Bangash, ADB said on its official twitter handle.\nThe award was presented to the ADB funded BRT project in a ceremony held in Peshawar on Thursday.\nWhile addressing on the occasion, provincial minister for Higher Education, Kamran Bangash said Pakistan was the seventh country to achieve the IGSS award as earlier only six countries have so far received this honor in the public transport sector.\nHe informed that the BRT has also made a world record by obtaining 97 points out of 100 for the International Gold Standard Award adding no other country has so far scored that many points for this award. By achieving this award, the Minister said BRT has earned its place in the world’s best commuting facility services.\nThe credit for this achievement, he said goes to the best efforts of the Khyber Pakhtunkhwa government, the staff of BRT, its officers, services providers and all other relevant institutions. The International Gold Standard Award was also a great achievement for Pakistan and the government of Khyber Pakhtunkhwa.\nEarlier, the BRT had also received the certificate of International Sustainable Award by the International Transport Organization while the UN Women has also honored the BRT for providing the best and safe travelling facility to the women folk. The BRT, he added, was providing the best possible commuting facilities to its passengers.",
  "retrievedAt": "2025-08-11T14:21:43.306Z"
}
