{
  "title": "Bill Gates appreciates Pakistan’s success against Covid-19",
  "link": "https://www.app.com.pk/national/bill-gates-appreciates-pakistans-success-against-covid-19-2/",
  "date_published": "2022-02-17T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): Bill Gates on Thursday appreciated Pakistan’s success against Covid-19 despite resources constraints and introducing excellent initiatives besides taking measures for public health safety.\nBill Gates, Co-Chair of the Bill and Melinda Gates Foundation (BMGF) made these remarks during his visit to National Command and Operation Center (NCOC) here on Thursday.   Bill Gates met Chairman NCOC Asad Umar and Special Assistant to Prime Minister on Health, Dr Faisal Sultan.\nLater, Bill Gates along with his delegation attended NCOC session. Bill Gates and his delegation was apprised about NCOC role  and methodology, achievements since start of pandemic, recent Covid-19 situation across Pakistan and various\nnon-pharmaceutical interventions placed by NCOC to control disease spread and ensure public safety beside well being.\nA comprehensive review of Pakistan’s efforts against Covid-19 was presented to the visiting delegation.The visiting delegation was also briefed on genome sequencing (prevalence of various variants in the country).\nBill Gates took keen interest on various initiatives by NCOC particularly smart lock down and micro smart lock down strategy enforcement measures. He also liked Pakistan’s vaccine administration regime which enabled NCOC to formulate and to implement a comprehensive Covid response. Bill Gates also shared his views on Covid-19 particularly vaccination drive.\nAsad Umar acknowledged efforts of Mr Bill Gates and his foundation to support Covid-19 initiatives in Pakistan.\nAsad Umar attributed the success of true national response, executed through an effective communication campaign mechanism of the NCOC, which helped build trust of masses on National COVID response and positive behavioural change to follow Covid protocols as outlined by NCOC.",
  "retrievedAt": "2025-08-11T14:21:49.135Z"
}
