{
  "title": "Hurriyat leader demands early release of DeM General Secretary Nahida Nasreen",
  "link": "https://www.app.com.pk/national/hurriyat-leader-demands-early-release-of-dem-general-secretary-nahida-nasreen/",
  "date_published": "2022-02-17T08:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, APP FEB(17)::Chairman Jammu and Kashmir Hurriyat Front Chaudhry Shaheen Iqbal has on Thursday demanded immediate release of incarcerated Dukhtaran-e-Milat (DeM) General Secretary Nahida Nasreen so that she could be able to comfort and grieve the loss of her mother-in-law with her family.\nThe Hurriyat Front Chairman said this while paying a visit to the jailed leader’s family at Pampore on Thursday. Extending his sympathies and solidarity with the bereaved family, Iqbal during a brief chat with the family on the occasion said that as per the law, prison authorities were bound to inform a detainee about the death or serious illness of any relative.\n“Prisoners, regardless of their gender, have the right to be present with their family when his/her close family member dies or at least take part in funerals”, he said adding that under such circumstances political prisoners were entitled to be released on parole but for Kashmiris there exists no such law in India’s judicial system.\nHe lamented that under Modi’s apartheid regime the situation in Kashmir has worsened so much that the Kashmiris were not even allowed to bury their dear ones who were being killed day in day out by the trigger-happy Indian forces.\nExpressing heartfelt sympathies with the bereaved family, the Hurriyat leader prayed to Allah Almighty for the departed soul in eternal peace and grant Nahida Nasreen and other family members the fortitude and courage to endure this irreparable loss.\nCh. Shaheen Iqbal also denounced the use of brute force by the Indian occupation forces on peaceful protesters at Magam area of Budgam.\nTerming it as high-handedness on part of the occupation forces, he said that harassment and humiliation of people and looting and destruction of private properties has become a new norm in the valley.",
  "retrievedAt": "2025-08-11T14:21:52.762Z"
}
