{
  "title": "NAB accords top priority for training, capacity building of officials: NAB Chairman",
  "link": "https://www.app.com.pk/national/nab-accords-top-priority-for-training-capacity-building-of-officials-nab-chairman/",
  "date_published": "2022-02-17T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): National Accountability Bureau (NAB) Chairman Justice Javed Iqbal on Thursday said that the bureau accorded high priority for training and capacity building of its investigation officers and prosecutors on modern lines.\nChairing a meeting to review performance of Training and Research Division of NAB at its Headquarters, he said Pakistan Anti-Corruption Academy (PACA) had been established for imparting training/capacity building of its Investigation Officers on regular basis on modern lines as training was continuous process which was an effective tool for improvement and maintaining the quality of Investigation Officers.\nThe chairman said NAB was an apex anti corruption organization of the country which had assigned a gigantic task of eradication of corruption from the country.\nHe said that this required an extremely dedicated and highly trained manpower to undertake this responsibility.\nNAB attached great importance to Human Resource Development of its officers especially investigation officers, he added.\nAccordingly, he said that Pakistan Anti Corruption Academy (PACA) would act as a hub of disseminating and practicing the knowledge in the field of anti-corruption.\nThe academy would offer standardized and tailor-made training, seminars, conferences, opportunities for dialogue and networking, and would act as an anti-corruption think-tank to empower professionals for the future white collar crimes challenges. It would provide a new,\nholistic approach to anti-corruption education and research, delivers and facilitates anti-corruption training for practitioners from all sectors of governance, and would provide technical support and assistance to a wide variety of stakeholders.\nHe said that Pakistan Anti Corruption Academy (PACA) started on an unwavering drive towards excellence, innovation, and a commitment to rendering itself accessible to sister institutions across the globe by using multi-faceted training methods, tools and techniques. Corruption was a major hurdle in the process of development and progress, he added. PACA will strive to develop a hallmark and culture and practice of integrity and accountability.\nThe PACA has been mandated with 5 core functions including Training & Capacity Building of officers of NAB and others in the field of Financial Crimes Investigation, Forensic Examination, and Prosecution; Carrying out research and reformation projects to highlight system weakness and propose improvement based on need assessment, system analysis research and latest good practices in fields of financial crimes and prevention of corruption, Training & Research in Collaboration with International and National Institutes; Forensic Examination Development and Curriculum Development & Accreditation of Investigators in the field of financial crimes and anti-corruption.\nJustice Javed Iqbal appreciated the excellent performance of Training and Research Division and said that establishment of state of the art “Pakistan Anti-Corruption Academy (PACA)” of NAB was a milestone in the history of NAB which will be helpful a standardized syllabus for all investigation officers and capacity building of prosecutors on modern lines to ensure quality and uniformity.\nThe performance objectives of training programs would also be continuously evaluated so as to form a basis for subsequent review and improvements in future training needs. The NAB Chairman said that a state of the art Forensic Science LAB had also been established in NAB Rawalpindi which had capacity to undertake examination of forensic material; render expert opinion about the examination of forensic material conducted by it; operate and maintain scientific instruments for examination of forensic material; propose advancement in forensic techniques and suggest procurement of suitable scientific instruments for examination of forensic material;\nrecommend the procedure for the collection, preservation, and handling of forensic material; seek clarification from the person involved in the collection or handling of forensic material in the prescribed manner;\nsubject to the nature of the case. He said that forensic examination facility was vital to every organization fighting white-collar crime, therefore, the PACA would offer intensive forensic training programs to investigation officers of NAB and others along with practical assistance in collaboration with other domestic and foreign Forensic Practitioners to enhance their expertise in analysis of latent fingerprints, computer forensic and audio-visual evidence, Questioned Documents, digital evidence analysis according to internationally established competency standards. He said that as an integral part of its functional mandate, the PACA would also focus on forensic examination as per best practices and Quality Assurance Measures.\nTo achieve its objective, the PACA would coordinate with all stakeholders to deliver advanced courses of forensic science and to facilitate investigators; the PACA shall arrange lectures relating to digital document examination, engineering projects, materials and forensic examination.",
  "retrievedAt": "2025-08-11T14:21:36.141Z"
}
