{
  "title": "President confers Hilal-e-Pakistan award on Bill Gates to recognize his pro-Pakistan services",
  "link": "https://www.app.com.pk/national/president-confers-hilal-e-pakistan-award-on-bill-gates-to-recognize-his-pro-pakistan-services/",
  "date_published": "2022-02-17T10:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): President Dr Arif Alvi Thursday conferred Hilal-e-Pakistan on American technologist and philanthropist Bill Gates in recognition of his meritorious services to the people of Pakistan, particularly for the eradication of polio.\nThe award was given at a special investiture ceremony held at the Aiwan-e-Sadr, attended by Begum Samina Alvi, federal ministers and senior officials.\nBorn in 1955 in Seattle Washington, Bill Gates is a co-founder of Microsoft Corporation, the world’s largest personal-computer software company.\nCurrently, he co-chairs the Bill & Melinda Gates Foundation with Melinda French Gates, supporting a wide range of public health projects, granting aid to fight transmissible diseases such AIDS, tuberculosis and malaria, as well as widespread vaccine programs to eradicate polio.\nThe Foundation is playing a critical role for the elimination of polio in Pakistan as well as supporting the financial system through various interventions.\nIt focuses on eliminating global inequities and increasing opportunities for those in need through programs addressing global agricultural and economic development, medical research and public health initiatives in developing countries.\nIn 1975, Bill Gates started Microsoft with a vision of “a computer on every desktop and in every home” which has now been realized in many parts of the world.\nIn 2010, Bill and Melinda challenged the global health community to declare this the Decade of Vaccines. They pledged $10 billion over the next 10 years to help research, develop, and deliver vaccines for the world’s poorest countries.\nIn 2017, the Foundation committed $300 million to helping farmers in Africa and Asia cope with climate change.\nIn 2020, the Foundation committed about $1.75 billion to support the global response to COVID-19.",
  "retrievedAt": "2025-08-11T14:21:44.456Z"
}
