{
  "title": "NUST to install 55 modern air quality sensors in twin cities",
  "link": "https://www.app.com.pk/national/nust-to-install-55-modern-air-quality-sensors-in-twin-cities/",
  "date_published": "2022-02-17T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): The National University of Sciences and Technology (NUST) is going to establish a network of modern air quality monitoring low cost sensors in the twin cities of Rawalpindi and Islamabad to enhance capacity of the environmental watchdogs for gathering realtime air pollution data.\nUnder the Duke University project, a total of 55 low cost sensors will be given to NUST for developing a network of air quality monitors in the twin cities to augment ambient air quality monitoring capacity of the two mega cities.\nThe university has developed a state-of-the-art air quality monitoring station and become the only varsity in the country to possess such a sophisticated piece of latest equipment.\nThe NUST through its indigenous and US embassy assisted initiatives managed to develop a locally made conventional air quality measuring gadget in collaboration with local technicians/engineers, also received latest low-cost sensors given by the US State Department under its project of the Duke University and imported Japan made air quality monitors worth around Rs50 million.\nHead of Department, Environmental Sciences NUST Institute of Environmental Sciences and Engineering (IESE) Dr Muhammad Fahim Khokhar told APP that the endeavour was a decade long effort that started in 2012 and got accomplished in the ongoing year.\n“The effort has been started from a scratch that succeeded in establishing an international standard air quality monitoring lab at the varsity,” Dr Khokhar said.\nHe said that the lab had recently received certification of the Pakistan Environmental Protection Agency (Pak-EPA).\nThe university has received four low cost sensors to assess particulate matter of 2.5 microns (PM2.5) from the Duke University through US embassy. However, two of them were installed at the NUST station and two were placed at the Pak-EPA to get realtime data of PM2.5 and analyse the performance of latest technology in air quality monitoring, he added.\nHe said that at the time of initiating the air quality monitoring lab project there was no technology or infrastructure existing in the country to provide realtime air quality data to ascertain smog or air pollution afflicting the irrigated plains of Punjab on each side of international border.\nDr Fahim Khokhar has done his PhD from Germany and on his return after serving 12 years in European countries, he managed to get a MAX-DOAS (remote sensing instrument to retrieve several air pollutants like SO2, NO2, VOCs or volatile organic compounds and ground level ozone) with him which he placed at the NUST air quality monitoring lab.\nThe air quality monitoring station of NUST was measuring nitrogen dioxide (NO2), sulphur dioxide (SO2), PM2.5, PM10, ground ozone (O3), carbon monoxide (O2) and other pollutants in the air.Dr Khokhar mentioned that more than 60 MS and PhD students at the IESE have graduated and several are still benefiting from the lab and carrying out their research studies while practicing on latest technology.\nSohaib Malik, a IESE student told that he had done a study on air pollution in Gilgit and found that air quality was bad in the city due to increased vehicular emissions and anthropogenic activities. However, there was no infrastructure available locally to check air quality.\nDr Khokhar underlined that air quality monitoring and relevant infrastructure is mandatory to guide policy makers and regulators like Pak-EPA for better and concerted efforts to reduce health and economic burden incurred by air pollution.",
  "retrievedAt": "2025-08-11T14:21:47.903Z"
}
