{
  "title": "Karachi judicial magistrate orders exhumation of Mustafa Amir’s body - Pakistan - DAWN.COM",
  "author": null,
  "content": "A judicial magistrate in Karachi on Monday ordered the exhumation of Mustafa Amir — the 23-year-old victim who was kidnapped and allegedly murdered by his friends — directing the formation of a medical board to complete the procedure within seven days.\n\nAmir was abducted from DHA on Jan 6, and his family received a ransom call two weeks later. During the investigation, police arrested a man named Armaghan after a shoot-out and later claimed that the youth was murdered by his friends.\n\nOn Jan 12, police found an unidentified body in a torched car in Hub, which Balochistan police later handed over to the Edhi Foundation for burial. The unclaimed body was buried at the Edhi graveyard in Karachi on Jan 16. On Saturday, another suspect, Shavez Bukhari, was sent on remand by an antiterrorism court (ATC).\n\nToday, while hearing the case, Judicial Magistrate Syeda Urooj Fatimah Naqvi approved the exhumation of the victim’s body and directed the formation of a medical board to complete the procedure within seven days.\n\nThe application was filed by Investigation Officer Muhammad Ali, seeking permission for the procedure.\n\nPreviously, the mother of the victim had moved an application in court, seeking a directive for the authorities concerned to exhume the body of her son.\n\nHowever, the ATC asked the applicant to approach the judicial magistrate concerned for such purpose as a magistrate is empowered to pass an order about exhumation and other related issues.\n\nIn a separate development in the case yesterday, three police officers were suspended and demoted for mishandling the case.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:40:59.148Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892567/karachi-judicial-magistrate-orders-exhumation-of-mustafa-amirs-body",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T12:50:51.000Z"
}
