{
  "title": "In pictures: Celebration of Lal Shahbaz Qalandar’s 773rd urs kicks off in Sehwan - Pakistan - DAWN.COM",
  "author": null,
  "content": "The 773rd urs celebrations of Lal Shahbaz Qalandar began in Sehwan on Monday, as acting Sindh Governor and Sindh Assembly Speaker Syed Awais Qadir Shah inaugurated the festivities.\n\nAccording to an announcement from the information department, Awais laid a floral wreath on the shrine while Sindh Auqaf Minister Riaz Shah Shirazi, Auqaf Provincial Secretary Sibghatullah Mehar and other officials were present.\n\nAwais told journalists that he sought the blessings of the saint by offering prayers for the country, nation and Sindh. He added that Sindh’s progress was crucial for the development of the country and praised arrangements made by the auqaf minister and administration.\n\nThe acting governor also expressed hope that the celebrations would be peaceful and noted that the number of devotees attending had increased.\n\nAwais also urged the prime minister to convene the Council of Common Interests within 90 days as per the Constitution and announced plans to write to the National Highway Authority chairman regarding the delayed construction of the Indus Highway.\n\n“The Sindh government is actively raising its voice for public issues at every level,” he asserted.\n\nAuqaf Minister Riaz also inspected security arrangements for devotees. He told reporters, “Qalandar’s shrine is a central place visited by millions from across Pakistan. The department has made all efforts to provide better facilities to devotees and visitors.”\n\nAs part of the urs celebrations, the culture department organised folk music, a sughar katchery — a traditional and cultural gathering of rural people who shared their wisdom through poetry and anecdotes — and a handicrafts exhibition at the Sehwan library.\n\nSeasoned sughars of Sindh, including Ajab Gul Bhatti, Abdul Ghani Jalbani, Abdul Rasheed Marri, Rajab Solangi, Manzoor Seelro, Mir Channa, Idris Jamali, Ghulam Mohammad Sanjrani, Munir Qambrani and others, took part in the event.\n\nSindhi handicrafts were displayed in stalls to reflect the province’s cultural heritage, reflecting both its history and Moenjo Daro’s civilisation. Various earthen and wooden products were displayed at the stalls besides embroidery.\n\nStalls were also set up to promote Sindhi literature and contests of malakhro — a traditional Sindhi wrestling — were also held.\n\nHeader image: Devotees perform a dhamaal during the 773rd urs celebrations of Sufi saint Lal Shahbaz Qalandar in Sehwan on February 17. — Umair Rajput",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/17201725d52906a.jpg",
  "retrievedAt": "2025-08-25T19:40:58.130Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892581/in-pictures-celebration-of-lal-shahbaz-qalandars-773rd-urs-kicks-off-in-sehwan",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T15:43:42.000Z"
}
