{
  "title": "Four security men martyred in Balochistan attacks - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Four security personnel were martyred and eight others injured in armed attacks on the Frontier Corps and Levies’ check posts in Kalat and Kech districts over the past 24 hours.\n\nIn a third incident, a police station in Noshki also came under attack.\n\nOfficials said the Levies check post was targeted in the Togho Chpeer area in the early hours of Sunday.\n\nBalochistan government spokesman Shahid Rind said unidentified men opened fire at the post, adding that the Levies personnel retaliated and returned fire. The exchange continued for some time after which the assailants fled.\n\n“As a result of gunfight, one Levies man lost his life while two others were seriously injured,” Mr Rind said, adding that after receiving information about the assault Levies forces rushed to the site and shifted the body and the injured to the Kalat district hospital.\n\nThe martyr was identified as Ali Nawaz Langove while the injured were Ghulam Ali and Moham­mad Ayub Langove.\n\n“An operation is underway in the area to trace the attackers,” officials said.\n\nIn Kech district, unkn­own armed men attacked a check post of the paramilitary Frontier Corps late on Saturday night.\n\nOfficials said that FC personnel deployed at the post engaged the assailants. During a heavy gun battle, three soldiers were martyred and six others injured, they added.\n\nThe injured and bodies were shifted to a hospital where the martyred FC personnel were identified as Naik Gul Sanat, Lance Naik Rana Zakir and Sepoy Lakhmir, officials said, adding that the condition of the two injured was critical.\n\nLater, all the injured were transferred to Quetta for treatment.\n\nSepoy Lakhmir belonged to the Nasirabad area of Balochistan.\n\nMore FC troops moved to the area after the attack and a search operation was launched.\n\nReports suggested that miscreants also attempted to storm a police station and a Levies forces’ station in the Mashkey area on Saturday night. However, personnel at both the places offered resistance and foiled their attempts to enter the two buildings.\n\nHand grenade lobbed\n\nOn Sunday evening, unidentified motorcyclists threw a hand grenade into a police station in Noshki, officials said, adding that the device exploded near the building.\n\nSources said that armed men also opened fire, which the police personnel returned forcing the assailants to flee.\n\nNo casualty was reported in the incident. However, a wall of the police station was slightly damaged by the impact of the blast.\n\nCondemnation\n\nPrime Minister Shehbaz Sharif has condemned the terrorist attack on the Levies check post in Kalat.\n\nIn a statement, he said terrorists were enemies of the development and progress of Balochistan. The premier prayed for the martyr’s high rank, saying he had sacrificed his life to defend the motherland.\n\nThe prime minister wished the injured a speedy recovery and reaffirmed the government’s resolve to not “allow the nefarious designs of terrorists to succeed”.\n\nBalochistan Chief Minister Sarfraz Bugti also denounced the attack on the Levies’ check post.\n\nHe hailed Ali Nawaz, the martyr, for fulfilling his duties and setting an “example of bravery by sacrificing his life”.\n\nHe said the elements involved in the attack would be brought to justice soon.\n\nBehram Baloch in Gwadar and Abdul Wahid Shahwani in Khuzdar also contributed to this report\n\nPublished in Dawn, February 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/16161652ef1fdd7.png",
  "retrievedAt": "2025-08-25T19:41:44.498Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892393/four-security-men-martyred-in-balochistan-attacks",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T00:40:42.000Z"
}
