{
  "title": "Corporate window: A case for palliative care - Business - DAWN.COM",
  "author": null,
  "content": "The more things change in Pakistan, the more they stay the same. This can sometimes be quite frustrating for Tauseef Ahmed Khan, Chairman of Highnoon Laboratories, who approaches his pharmaceutical business as a means to improve the quality of life of patients and their families, especially the ones facing serious or life-threatening illnesses like cancer.\n\nAfter lobbying with the policymakers for years to improve the access of such patients to morphine and opioid analgesia — an essential part of palliative care through the prevention and relief of suffering by means of controlling pain — he has to give up because the policymakers just aren’t ready yet.\n\nPalliative care is recognised under the human right to health. In fact, Human Rights Watch advocates for universal access to palliative care because no one should suffer from treatable pain, the chairman told Dawn in an interview. Patients may receive palliative care along with treatment intended to cure their illnesses, which is not limited to end-of-life care.\n\n“The biggest hurdle to palliative care in Pakistan is the unavailability of morphine. Only the Shaukat Khanum Cancer & Research Hospital has permission to deliver morphine [to its patients]. I lobbied with the previous government and made documentaries featuring patients suffering from huge amounts of pain to increase awareness among the public, policymakers, and health professionals about palliative care.\n\n‘New government regulations and policies are pushing the pharmaceutical sector in the right direction’\n\n“But I couldn’t find enough political will required for changing the narcotic, banking, excise and taxation, and other laws prohibiting the use of morphine and other opioid analgesia for pain treatment,” Mr Khan said.\n\nRestrictive laws and regulations for morphine and other controlled essential palliative medicines, stemming from the fear that increased access to opioid analgesia will lead to increased substance abuse, are among several reasons for limited access to palliative care in Pakistan. This is in spite of the fact that early delivery of palliative care may reduce unnecessary hospital admissions.\n\nMorphine is an effective and relatively low-cost medicine for relieving severe pain, and it has been listed as an essential medicine since the first edition of the World Health Organisation (WHO) Model List of Essential Medicines in 1977. “Safe and timely access to morphine is important for public health, but [its] access is inadequate in many countries,” according to WHO.\n\nIn Pakistan, the lack of access to morphine and other opioid analgesics has led many to hook on to heroin for pain relief instead, encouraging grey trade. “Patients need what they need. Their relatives do whatever they have to in order to provide relief from their unbearable pain. This [the lack of access to palliative care for those who require it] reflects our insensitivity towards patients. Our policymakers must understand that it is a need. The world is moving along one tangent, and we are on another,” he said.\n\nHighnoon Laboratories has made it to Forbes Asia’s ‘Best Under a Billion’ list multiple times in recent years due to its consistent financial performance.\n\nEven in 2023, which is considered a terrible year for the country’s pharmaceutical industry because of challenging macroeconomic conditions including a shrinking economy, steep rupee depreciation on dollar liquidity crunch, record high costs of imported raw materials and energy, surging inflation and interest rates, and curbs placed on imports, the company posted a return of 25 per cent on equity, making it the best-performing pharma company stock with the highest payout.\n\n“No company had a positive bottom line in 2023 except Haleon and Highnoon. Our measures focused on increasing our sales volumes by launching new products and slashing the prices of some of our drugs — such as the one used for treating diabetes — used at a mass level to make them accessible to a larger population.\n\n“We also convinced Chinese API [active pharmaceutical ingredient] exporters to give us a price advantage on our bulk purchase of raw materials to build our inventories for a longer period. Building was a risky business, but it did pay off at the end of the day,” Mr Khan elaborated.\n\nLast year, he said, the government also took a big step to “rescue” the industry after seeing several foreign drug manufacturers exit the country due to financial losses from regulated prices and drug shortages. The new pricing policy is in accordance with the WHO standards and liberates the prices of medicines outside the National Essential Medicines List.\n\n“There are 120 essentials while the others are not essential. That is a pretty exhaustive list. So now the government controls and determines the prices of essentials and allows us to raise the prices of non-essential drugs gradually. This gave an economic incentive to the industry and is helping the industry revive,” he noted.\n\n“The idea behind price deregulation is that these companies should remain in business and keep on employing people, bringing better drugs to the market, and investing in technology to improve the quality of their products. By controlling prices, you can only provide cheaper drugs of inferior quality to patients. It was politically correct but not in the interest of patients. The new pricing policy gives us liberty to invest in quality infrastructure and expansion.”\n\nMr Khan says the drug pricing liberation means the Drug Regulatory Authority of Pakistan (Drap), “can now focus on quality improvement for boosting exports and growing globally”.\n\n“The government is pushing us in the right direction. Companies like ours are already doing that. With the regulator adopting WHO approvals and PIC/S guidelines, it is now streamlining its approval process and focusing on the quality of drugs,” he explains.\n\nMr Khan’s future ambitions include diversification of his products (the company introduced 15 new drugs in 2024) to access all Pakistanis, doubling his sales revenues every three years by launching a new business as well as growing existing sales, increasing his exports to 15pc of his turnover from the current 10pc, and adopting global quality compliance standards.\n\nPublished in Dawn, The Business and Finance Weekly, February 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b28f1a06a7b.gif",
  "retrievedAt": "2025-08-25T19:41:06.052Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892514/corporate-window-a-case-for-palliative-care",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T01:23:49.000Z"
}
