{
  "title": "Political parties in Balochistan urged to put women in top roles - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Political parties should foster an environment among their ranks that allows women to thrive and ensure their presence on key posts.\n\nThese remarks were made by speakers at a seminar titled ‘Democracy and Women’s Political Participation on the Basis of Equality’ held by Health And Rural Development — Hard Balochistan.\n\nThe experts highlighted the importance of empowering women in politics, education, and social roles and suggested that women politicians should demand their rights within their parties.\n\nThe speakers included Rozina Khan, Zia Baloch, Gul Khan Naseer Baloch, Advocate Abdul Hai Baloch and senior journalist Zafar Baloch.\n\nThey called for awareness among stakeholders about democracy and the political participation of women.\n\nExperts highlight challenges faced by women politicians, call for their increased engagement\n\nThe event highlighted challenges faced by women politicians and emphasised the need for increased female political engagement and leadership.\n\nRozina Khan said it was crucial to “see women as human beings” before talking about their empowerment.\n\nShe added that women were capable of working in every field, and our history is filled with women who have led with courage on battlefields.\n\nMr Gul said women in Balochistan were educated and aware as colleges and private schools have been established in remote areas of the province.\n\nHe added that under the 33 per cent reserved quota, women have stepped into the political arena and are now playing a significant role in parties.\n\nHowever, he added that many women lawmakers, once they make it to assemblies, “remain silent” there on serious issues.\n\nHe cited the example of Baloch Yakjehti Committee leader Dr Mahrang Baloch, who emerged as a female leader “after a long struggle”.\n\nShe is now leading women and raising their voices for their rights, he added.\n\nPakistan Federal Union of Journalists senior vice president calls for accountability when discussing women’s education, health, and basic rights.\n\n“Until we correct ourselves, we will continue to point fingers at others.”\n\nOn the issue of misinformation, he highlighted that social media has been a positive change, and different countries have made laws to regulate it. “Unfortunately, in our country, social media has damaged its own reputation.”\n\nHe said discussions on public issues should be done responsibly and every information published by media should be thoroughly reviewed. “There are proper ways of speaking, and we must stay within our limits while discussing real issues faced by the public.”\n\nPublished in Dawn, February 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:41:05.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892494/political-parties-in-balochistan-urged-to-put-women-in-top-roles",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T01:13:17.000Z"
}
