{
  "title": "PTI plans political activities across Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Tehreek-i-Insaf (PTI) has planned mass political activities, including workers conventions at district level, from Tuesday (tomorrow) across the province.\n\nPTI Punjab chief organiser Aliya Hamza has directed all regional heads to implement the political activity plan and proposed several initiatives across the province.\n\nIn a directive sent to the party’s regional heads, she suggested holding of district workers’ conventions, opening of district offices, as well as region-wise political activities, that may include door-to-door campaigns, membership drives, protests against inflation, demonstrations against police brutality and press conferences at respective press clubs.\n\nMs Hamza suggested that the first cycle of regional activities should begin from central Punjab on Feb 18 (Tuesday), south Punjab on Feb 19, north Punjab on Feb 20 and west Punjab on Feb 21.\n\nShe directed that this rotation would continue, with each region conducting activities in a different district during the next cycle. “From Feb 18 on wards, no day should pass without political activity in any region,” she asserted.\n\nBHACHAR: Opposition Leader in Punjab Assembly Malik Ahmad Khan Bhachar of the PTI has hinted at launching a country-wide protest movement after Eidul Fitr.\n\nIn a video message on Sunday, Mr Bhachar said the new protest movement would be launched after consultations with other political parties in line with the party founder’s directions.\n\n“We are beginning our preparations for the protest movement immediately,” he said and added that the rulers imposed on the nation lacked public mandate.\n\nHe said the PTI protest movement would continue until the government’s ouster.\n\nPublished in Dawn, February 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:41:29.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892412/pti-plans-political-activities-across-punjab",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T00:41:21.000Z"
}
