{
  "title": "One accused, 299 victims: French surgeon on trial for sex assaults - World - DAWN.COM",
  "author": null,
  "content": "A former surgeon goes on trial later this month charged with raping or sexually assaulting almost 300 former patients, most of them children and many of them unconscious at the time, over a quarter of a century across western France.\n\nThe sheer scale and horror of the allegations against Joel Le Scouarnec, 74, means his four-month trial, due to start on February 24, is likely to have an immense impact at home and abroad.\n\nAnd it will have added resonance coming two months after Frenchman Dominique Pelicot was convicted of enlisting dozens of strangers to rape his heavily sedated then-wife Gisele Pelicot, a case that made her a feminist hero worldwide.\n\nIn this case, Le Scouarnec is the sole defendant accused of crimes against hundreds of victims.\n\nThe trial in the city of Vannes in Brittany will be held in public but seven days of testimony from victims who were targeted while minors will be behind closed doors.\n\n“Le Scouarnec has generally acknowledged his involvement in many of the events in question” as well as his “concealment strategies”, said regional prosecutor Stephane Kellenberger.\n\nThe average age of the victims is 11 but the former surgeon is also accused of raping a one-year-old and sexually assaulting a 70-year-old.\n\nHe allegedly committed sexual violence between 1989 and 2014 when he worked at a dozen medical institutions in western France.\n\nLe Scouarnec is being tried for 111 rapes and 189 sexual assaults, aggravated by the fact that he abused his position as a doctor and mostly targeted children.\n\nIn total, 256 victims out of the 299 were younger than 15.\n\nIf convicted, Le Scouarnec faces a maximum sentence of 20 years in prison — French law does not allow sentences to be added together even when there are multiple victims.\n\nThe former doctor is already in prison after being sentenced in December 2020 to 15 years for raping and sexually assaulting four children, including two of his nieces.\n\nMany victims were traumatised when they learnt of the events, sometimes decades later. Not all of them will take part in the trial but many say they expect the proceedings to provide explanations.\n\nThe authorities began investigating Le Scouarnec in 2017 after a six-year-old girl who lived in the same neighbourhood in the southwestern town of Jonzac alleged he had raped her.\n\nThe initial inquiry uncovered the assaults on his nieces and a four-year-old patient all committed in the 1990s and he was handed 15 years in prison for these crimes in December 2020.\n\nWhen investigators searched Le Scouarnec’s house in Jonzac, where he lived as a recluse, they found dozens of dolls that he used as sex toys along with 300,000 pornographic images.\n\nIn another parallel with the trial of Dominique Pelicot — who filmed the male visitors to the family home — Le Scouarnec carefully wrote down the names of his victims, some of whom he abused on the operating table.\n\nWhile Le Scouarnec is the sole defendant, the actions of officials will come under scrutiny at the trial.\n\nIt was only after the 2017 complaint and his being remanded in custody that Le Scouarnec was struck off the medical register.\n\nHe had been convicted at the end of 2005 for downloading child sexual abuse images.\n\nBut the four-month suspended sentence he received was not accompanied by any obligation to receive treatment or a ban on practising.\n\nLe Scouarnec then found work at a hospital in the Brittany town of Quimperle and even got promoted despite the management being made aware of his conviction.\n\nHe then moved to southwestern France, where he worked until his retirement in 2017.\n\nA separate investigation has been opened by regional prosecutors for “failure to prevent a crime or offence against the integrity of persons”, though it is not yet targeting any individual or institution.\n\nChildren’s rights association La Voix de l’Enfant (The Child’s Voice), a civil party in the trial, filed a complaint in April 2023 against the judicial authorities and the Ministry of Health for “endangering the lives of others”.\n\nLe Scouarnec’s lawyer, Thibaut Kurzawa, told AFP that “his state of mind has not changed”.\n\n“He wants to defend himself and he wants to explain himself,” he said.\n\nHe was married and had three sons born between 1980 and 1987.\n\nThe couple separated in the early 2000s, but their divorce was not made official until 2023.\n\nHis wife interviewed in 2019 in the regional Le Telegramme newspaper, insisted she “never” had any suspicions, even if she had caught him “looking strangely” at young neighbours.\n\n“Joel is possessed by the devil […] and I didn’t suspect anything,” she said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/172202599806f93.jpg",
  "retrievedAt": "2025-08-25T19:41:00.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892584/one-accused-299-victims-french-surgeon-on-trial-for-sex-assaults",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T17:03:44.000Z"
}
