{
  "title": "Terrorism case registered against banned outfit for killing Karachi policeman - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Investigators on Sunday concluded that a policeman shot dead in the Manghopir area a day before was targeted by militants belonging to the outlawed Tehreek-i-Taliban Pakistan (TTP).\n\nOn Saturday, three gunmen had killed Constable Imran Khan on a main road in the Khairabad area within the remit of the Manghipir police station. He was shot six times.\n\nWhile the investigators had said that it was a case of targeted killing, they were not sure about the involvement of the TTP in the attack despite the fact that the outlawed group had claimed responsibility in a social media post.\n\nOn Sunday, the police claimed to have found some clues and said that the attack was carried out at the behest of the local chief of what they called “Fitna al Khawarij”.\n\nA case was registered on behalf of the state under Sections 302 (premeditated murder) and 34 (common intention) of the Pakistan Penal Code read with Section 7 of the Anti-Terrorism Act.\n\nManghopir SHO Imran Ahmed Khan told Dawn that the FIR was registered against Hafiz Haleem and three unknown militants.\n\nThe killing was carried out to “demoralise the police and spread terror”, the FIR said.\n\nThe SHO said the case was transferred to the Counter-Terrorism Department for further investigation.\n\nMeanwhile, the funeral prayer for the martyred policeman was held at Police Headquarters Garden.\n\nSindh police chief Ghulam Nabi Memon and other senior officials attended his last rites.\n\nPublished in Dawn, February 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/150756276e19eb8.jpg?r=080249",
  "retrievedAt": "2025-08-25T19:41:30.401Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892447/terrorism-case-registered-against-banned-outfit-for-killing-karachi-policeman",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T00:41:14.000Z"
}
