{
  "title": "Two weeks on, Drap yet to have new chief executive officer - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: With the post of the chief executive officer (CEO) of the Drug Regulatory Authority of Pakistan (Drap) vacant for a fortnight, the health ministry has said it has yet to find an appropriate candidate.\n\nFormer CEO Dr Asim Rauf retired after the completion of his three-year tenure on February 5, 2025.\n\nThe policy board of Drap had recommended appointing Dr Rauf as an acting CEO for 90 days or till the appointment of the regular CEO, however, the suggestion could not be implemented.\n\nIt is worth mentioning that after the retirement of former Drap chief Sheikh Akhtar Husain, Dr Rauf was appointed as an acting CEO on March 7, 2019. His contract was extended every 90 days for almost three years. Only then was he appointed as a regular CEO for three years.\n\nPractically, Mr Rauf remained CEO of the authority for five years and 11 months. After completion of the tenure, on February 5, the policy board recommended appointing the retired chief executive as an acting CEO for another 90 days. An official of Drap, wishing not to be named, said Mr Rauf did not join the office as he could not get the notification in writing.\n\n“Some of the officers in the ministry are of the view that only the government is authorised to appoint a new head and government means prime minister and the federal cabinet,” he said.\n\nThe officers believe that even the acting CEO has to be appointed by the government. “However the fact is that the secretary health, who is also chairman of the policy board, gave the current charge of nine posts to different additional directors on February 13,” he added.\n\nAccording to a document issued by the ministry, Dr Mohammad Fakhruddin Aamir, Dr Obaidullah, Chaudhry Zeshan Nazar Bajar, Babar Khan, Abdullah Diyo, Attaur Rehman, Sayyad Hussain Khan, Manzoor Ali Buzdar and Mohammad Usman Babar have assumed charges of different divisions.\n\n“Similarly, the secretary health should give the current charge of the post of CEO to the senior most officer as Dr Rauf has retired after completion of his tenure,” he suggested.\n\nHowever, another senior officer of the ministry said according to Section V of the Drap Act, the age of the CEO should be between 45 and 56 years. “Considering the age bracket, the most senior officers are Obaidullah, Saifur Rehman Khattak and Obail Ali. One of them can be appointed as an acting CEO and then a summary can be moved for the appointment of the permanent CEO to the federal cabinet,” he noted.\n\n“According to the Drap Act, a candidate for the post of CEO must have a graduate degree in pharmacy or medicine, 20 years of experience, and preferably should be from the public sector. But the CEO can also be appointed from the private sector. So both doctors and pharmacists can be appointed as Drap CEO,” he said.\n\nMember of the Pakistan Pharmaceutical Manufacturers Association (PPMA) Usman Shaukat has suggested appointing a CEO without any delay to avoid ambiguity and continuity in policies. Usman Shaukat told Dawn that the current status of the post of Drap head needed to be clarified as soon as possible in order to provide clarity to the pharmaceutical industry.\n\n“The extension of the current CEO should be announced immediately to avoid ambiguity. Continuity of policy is essential for the pharma industry in these times as it has begun to show positive growth results and an uncertain environment could hurt its future growth prospects,” he said.\n\nSecretary Health Nadeem Mehbub could not be contacted. A message was sent to him but no response was received till the filing of the story. However, health ministry spokesperson Sajid Shah said the appointment will be made as per rules and regulations.\n\nHe hoped that the appointment would be made soon.\n\nPublished in Dawn, February 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:29:43.568Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892405/two-weeks-on-drap-yet-to-have-new-chief-executive-officer",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T00:41:27.000Z"
}
