{
  "title": "OIC News Agencies Union holds 6th general assembly session",
  "author": null,
  "content": "ISLAMABAD, Jan 29 (APP): The Union of OIC News Agencies (UNA) on Monday held its sixth General Assembly session via video conference.\nRepresentatives from member states’ news agencies participated in discussions on media cooperation, strategic planning, and support for key issues, including the Palestinian cause.\nThe session opened with a speech by Ali Bin Abdullah Al-Zaid, Acting Chairman of UNA’s Executive Council and head of the Saudi Press Agency.\nHe reaffirmed Saudi Arabia’s commitment to strengthening the Union and highlighted recent structural and operational improvements.\nHe urged member states to contribute to expanding UNA’s role through international events, professional awards, and stronger media advocacy.\nFollowing the opening remarks, the Republic of Djibouti assumed the presidency of the General Assembly.\nAbdourazak Ali Diraneh, Director General of Djibouti News Agency, pledged to continue UNA’s development and implement projects that address shared media priorities. He emphasized the importance of coordinated efforts in promoting key issues.\nAhmed Assaf, General Supervisor of Official Media in Palestine, acknowledged UNA’s support and ongoing initiatives for the Palestinian cause. Meanwhile, UNA Director General Mohammed Bin Abd Rabbo Al-Yami thanked member agencies for their participation and reaffirmed the organization’s role in uniting Islamic media efforts.\nHe also expressed gratitude to Saudi Arabia for its continued support.\nThe General Assembly approved UNA’s financial reports, future plans, and cooperation agreements. It also adopted resolutions aimed at enhancing media collaboration among member states.\nAdditionally, elections were held for UNA’s Executive Council and Financial and Administrative Committee. Saudi Arabia retained the presidency, with Palestine as vice president. Other council members include Qatar, Bahrain, Oman, the UAE, Djibouti, Cameroon, Pakistan, and Kazakhstan.\nThe Financial and Administrative Committee will be led by Oman, with Saudi Arabia, Libya, Côte d’Ivoire, and Egypt as members.\nThe session concluded with a call for stronger cooperation in advancing media initiatives across the Islamic world.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:11:21.189Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/oic-news-agencies-union-holds-6th-general-assembly-session/",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T07:19:00.000Z"
}
