{
  "title": "Senate body directs authorities to finalize prisoner transfer agreements with other countries",
  "author": null,
  "content": "ISLAMABAD, Jan 29 (APP): The Senate Standing Committee on Overseas Pakistanis and Human Resource Development on Wednesday instructed the authorities to expedite negotiations and finalize prisoner transfer agreements with other countries.\nChaired by Senator Zeeshan Khanzada, the meeting of the Committee met here at the Old PIP Hall, Parliament Lodges. The Committee discussed issues related to consular services provided to Pakistanis imprisoned in various countries, particularly in Saudi Arabia, Malaysia, and Oman, with a specific focus on policies and joint initiatives undertaken by the Ministry of Foreign Affairs (MoFA) and Community Welfare Attachés.\nThe Committee was briefed by the Director General of MoFA on the finalization of agreements with 11 countries; the UAE, Turkiye, Azerbaijan, China, Saudi Arabia, Sri Lanka, Yemen, Iran, and South Korea and was informed that the transfer of active prisoners was currently underway.\nEmphasizing the need for adequate legal representation and impartial translators for detainees, Senator Zeeshan Khanzada directed the Community Welfare Attachés to ensure these provisions. He further instructed the concerned authorities to expedite negotiations and finalize prisoner transfer agreements to facilitate the repatriation of Pakistani nationals, allowing them to serve their sentences in their home country.\nAdditionally, the Committee asked for a detailed report on individuals incarcerated in foreign countries due to unpaid fines.\nRegarding prisoners in Saudi Arabia, the Committee was informed that 900 individuals had been interviewed, and the national status of 400 had been verified through the Ministry of Interior for transfer.\nFurthermore, Senator Faisal Vawda pledged to assist orphans, widows and elderly prisoners, proposing to advocate for pardons where applicable.\nChairman Zeeshan Khanzada endorsed this initiative and extended his full support.\nThe Committee was also apprised that approximately 5,000 Pakistanis were currently detained across the West Bank, with the majority convicted of drug-related offenses.\nWhile acknowledging the efforts of Community Welfare Attachés, the Committee recommended that the Secretary of the Ministry of Overseas Pakistanis and Human Resource Development (M/o OP&HRD) take up the issue of procuring biometric machines for CWAs stationed at various missions. These machines would facilitate detainees in renewing their passports and CNICs, enabling them to file appeals where applicable.\nIn response to a query from Senator Zeeshan Khanzada, the Committee was informed about the clemency process, noting that in Oman, pardons for long-serving prisoners are granted only on national holidays. The Committee further requested a detailed report on the funds allocated and utilized over the past two years for the payment of fines on behalf of detained Pakistanis across various missions.\nThe meeting concluded with a discussion on the confiscation of passports upon arrival of Pakistani Zaireen traveling to Iraq, which has caused significant difficulties and humiliation at the hands of Iraqi immigration authorities. The Secretary of M/o OP&HRD briefed the Committee on the steps taken thus far to address the matter. At this juncture, Senator Zeeshan Khanzada stated that he would approach the Chairman of the Senate to nominate Senator Raja Nasir Abbas as the focal person for this issue.\nThe meeting was attended by Senators Shahadat Awan, Gurdeep Singh, M. Faisal Vawda, Raja Nasir Abbas, as well as senior officials from the Overseas Pakistanis and HRD and Community Welfare Attachés.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:10:32.418Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-body-directs-authorities-to-finalize-prisoner-transfer-agreements-with-other-countries/",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T13:49:00.000Z"
}
