{
  "title": "Parliamentarians laud Bank Road’s pedestrian street",
  "author": null,
  "content": "RAWALPINDI, Jan 29 (APP):Rawalpindi Cantonement Board (RCB) organized a community walk in connection with ‘clean environment’ to highlight citizens’ responsibilities of maintaining cleanliness and environment protection.\nThe participants highly appreciated the landmark achievement of RCB to convert Saddar’s famous Bank Road in a traffic free pedestrian street.\nThe walk, organized in collaboration with the Military Lands and Cantonments (ML&C), was attended by senior PML-N leader Hanif Abbasi MNA, Federal Parliamentary Secretary for Information and Broadcasting, Barrister Danyal Chaudhary, Malik Ibrar MNA, Station Commander Brig Ahmad, IG Islamabad Police Syed Ali Nasir Rizvi, CEO RCB Ali Irfan Rizvi, Add’l CEO Haider Shuja, traders, students and citizens.\nIn his talk with media representatives, Hanif Abbasi lauded the efforts of RCB in providing a peaceful shopping environment for the residents. He said that the splendor of the pedestrian street increased at night.\n“Earlier, electricity poles and wires were hanging here, but now it reflects an attractive market environment which has created convenience for the women and families”, he said and added that the allocation of four parking areas would further address the parking issues.\nAppreciating the performance shown by CEO RCB and his team, Hanif Abbasi congratulated the entire team for the successful completion of the project.\n“Encroachment was removed from here after two years of hard work. This environment relates to those of the developed countries”, he said.\nHe went on saying that the pedestrian street would further enhance business activities in Saddar.\nHighlighting the contribution of traders and businessmen, Hanif Abbasi said all stakeholders were taken onboard by RCB during planning and execution of Bank Road project, in which the traders community played their important role to complete the project in two years.\nHe said that in maintaining cleanliness, ‘we are ahead of London and Paris’.\nTalking about improving the national economy, Abbasi highlighted that all economic indicators are showing positive tendencies, foreign investors are inclining towards Pakistan and inflation also dropped to a single digit.\n“PML N government always brought prosperity in Rawalpindi in the shapes of motorways, Rawalpindi Institute Cardiology, Rawalpindi Institute of Urology and also in education sectors”, he said.\nAbassi said that politics should be based on performance, such that one province should compete with another province based on performance.\nBarrister Danyal Chaudhary while appreciating the pedestrian street project said that it was the first project of the country in which the electricity cables were shifted underground.\nHe said that the pedestrian street has been made beneficial for both the public and the traders.\nBarrister Danyal highlighted that the vibrant and beautiful Bank Road is now matching with famous international walking streets like Oxford Street.\nHe informed that a food street will also be set up on Bank Road to further facilitate the citizens.\nHe urged the Cantt Board to establish a weekend ‘footpath book bazaar’ in Saddar to facilitate book lovers.\nAli Irfan Rizvi, CEO RCB informed the media that in phase 2, other areas will be transformed into the same pattern.\nHe said that the transformation project was executed in a way that historic places and monumental icons of Saddar were kept preserved.\nThe walk started from Metro Bus Station and ended at the same venue after a round trip of the Bank Road.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:11:07.409Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/parliamentarians-laud-bank-roads-pedestrian-street/",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T11:59:00.000Z"
}
