{
  "title": "Move disappoints trade, industry - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: Barring foreign investors, local business leaders have expressed concern over the State Bank of Pakistan’s (SBP) decision to keep the policy interest rate unchanged at 11 per cent, arguing that the move could stifle investment, raise production costs, and delay economic recovery.\n\nWhile foreign investors largely supported the decision, domestic business groups criticised it as overly cautious, particularly in light of August’s 3pc inflation rate.\n\nThe business community had been widely expecting a reduction to a single-digit interest rate. They argue that easing inflation and sluggish growth warrant a more accommodative monetary policy.\n\nFederation of Pakistan Chambers of Commerce and Industry (FPCCI) President Atif Ikram Sheikh said a rate cut could have significantly reduced the government’s debt servicing costs by around Rs3.5 trillion, freeing up fiscal space. He also noted that Pakistan’s interest rate remains high compared to other regional economies, making domestic industries less competitive.\n\nBusiness leaders say high rate hampers investment, raises production costs, and undermines recovery\n\nFPCCI Senior Vice Chairman Saquib Fayyaz Magoon said high interest rates increase the cost of production, which fuels inflation rather than containing it. “Lower rates would ease input costs and support business expansion,” he added.\n\nKarachi Chamber of Commerce and Industry (KCCI) President Muhammad Jawed Bilwani stated that the SBP’s policy does not align with prevailing economic indicators. He noted that rising energy costs and input prices already burden businesses, and that a lower interest rate would ease pressure, stimulate investment, and support job creation.\n\nPresident of the SITE Association of Industry, Ahmad Azeem Alvi, termed the policy counterproductive and warned that it may derail efforts to boost industrial output. He urged the central bank to consider gradual reductions if an immediate cut is not feasible, aligning its stance with regional peers that offer more affordable credit.\n\nKorangi Association of Trade and Industry President Junaid Naqi said high interest rates were raising production costs and reducing the competitiveness of Pakistani exports. He stressed that without cheaper credit, exporters would struggle to grow and economic recovery would remain limited.\n\nSyed Aman Shah, Provincial Convener of Awaam Pakistan Party Balochistan, highlighted the adverse impact on small and medium enterprises.\n\nHe said the high cost of borrowing has stalled new investments, affected employment, and led banks to prefer investing in government securities over private lending.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:41:32.977Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942307",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:14.000Z"
}
