{
  "title": "Trump blasts New York governor for backing Mamdani in Big Apple’s mayor race - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump criticised New York’s Democratic governor on Monday for endorsing New York City mayoral candidate Zohran Mamdani, whom he branded a “Liddle’ communist” in a social media post.\n\nMamdani, a 33-year-old New York state assemblyman and self-declared socialist, rocked American politics and the Democratic Party establishment in June by winning the party’s mayoral primary.\n\nHe remains the front-runner in polls ahead of the November 4 election to decide who will be the next mayor of America’s most populous city.\n\n“Governor Kathy Hochul of New York has endorsed the ‘Liddle’ Communist,” the US president wrote.\n\n“This is a rather shocking development, and a very bad one for New York City. How can such a thing happen? Washington will be watching this situation very closely.”\n\nMamdani has campaigned on a platform of narrowing the wealth gap between rich and poor New Yorkers and providing affordable housing to low-income residents.\n\nOn Sunday, Hochul gave her backing to Mamdani over Andrew Cuomo, the longtime former governor and member of one of New York’s most politically influential families. Mayor Eric Adams, the incumbent, is running as an independent.\n\n“Affordability has long been my top priority as governor, and it is the No. 1 concern I share with Mr. Mamdani,” Hochul said in issuing her endorsement.\n\n“As governor, I’ve taken actions to realise this goal, including lowering middle-class income taxes and making school meals free for all students. But there is more work ahead of us.”\n\nShe also took a shot at the president.\n\n“And in light of the abhorrent and destructive policies coming out of Washington every day, I needed to know the next mayor will not be someone who would surrender one inch to President Trump,” she said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/16002244734c482.webp",
  "retrievedAt": "2025-10-12T04:12:22.983Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942222/trump-blasts-new-york-governor-for-backing-mamdani-in-big-apples-mayor-race",
  "dateList": "2025-09-16",
  "date_published": "2025-09-15T19:19:57.000Z"
}
