{
  "title": "Indian court strikes down key Muslim property law clauses - World - DAWN.COM",
  "author": null,
  "content": "India’s Supreme Court has suspended key provisions of a controversial new law that changes how properties donated by Muslims are owned and managed in the country.\n\nThe Waqf (Amendment) Act 2025 was criticised by opposition parties and challenged for violating the rights of the Muslim community to manage their own religious endowments, which are typically used as schools or mosques, while the Modi government asserts that it will make managing the properties more transparent, according to a BBC News report.\n\nIn Islamic tradition, a waqf is a charitable or religious donation made by Muslims for the benefit of the community.\n\nSuch properties — sometimes worth billions of dollars — are important to India’s 200 million Muslims as they are used for mosques, madrassas, graveyards and orphanages — and cannot be sold for any other purpose.\n\nAllows nomination of non-Muslims to waqf board\n\nHistorically, these properties have been governed by the Waqf Act, 1995, which mandated the formation of state-level waqf boards to manage them. But in April this year, the ruling Bharatiya Janata Party-led government amended the act, including changes to how a waqf property is determined and managed, sparking criticism from the community.\n\nOn Monday, the SC bench comprising Chief Justice of India B.R. Gavai and Justice A.G. Masih refused to strike down the entire law, saying that “the grant of stay is only in the rarest of rare category”.\n\nControversial clauses\n\nIt did, however, halt a controversial provision that allowed the government to decide whether a disputed property is waqf or not.\n\nOver the years, many properties that were donated through oral declarations or community customs have been legitimised as waqf properties because of their continuous use by the Muslim community. But under the new law, waqf boards were required to provide valid documents to claim a property as waqf. In case of disputes, the final decision rested with the government.\n\nThe court struck down the rule, saying that allowing the government to determine the rights of a citizen would go against the separation of powers between the executive and judiciary, mandated under the constitution.\n\nAnother contentious provision that was scrapped was a clause that required a waqf donor to be a practising Muslim for at least five years.\n\nThe waqf properties are currently managed by state-level boards and a central council, with nominees from the state government, Muslim lawmakers, members of state bar council, Islamic scholars and the managers of these properties.\n\nWhile the judges refused to stay a provision that allows the nomination of non-Muslims to the waqf board, they limited the number of non-Muslim members to four in the 22-member federal board and to three in the 11-member state boards.\n\nThe court also said, “Efforts should be made to appoint the chief executive officer of the board from amongst the Muslim community.”\n\nThe case reached the top court in early April, soon after the law was passed by parliament amid widespread criticism.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:12:18.799Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942313/indian-court-strikes-down-key-muslim-property-law-clauses",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:02.000Z"
}
