{
  "title": "Sindh, Centre agree to formulate climate plan before next monsoon - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Working group set up to prepare 300-day action plan within two weeks\n• Minister Musadik Malik assures CM Murad of federal government’s support in improving Sukkur Barrage’s capacity\n\nKARACHI: Sindh Chief Minister Syed Murad Ali Shah and Federal Minister for Climate Change and Environmental Coordination Dr Musadik Malik on Monday agreed to develop a 300-day Climate Action Plan to prepare for the next year’s monsoon.\n\nAccording to a press release issued by the CM House, the meeting also decided to modernise the weather forecasting system, ensuring timely alerts and preparedness.\n\nBoth Mr Shah and Dr Malik agreed to constitute a ‘working group’ under Sindh Chief Secretary Asif Hyder Shah to prepare the action plan within two weeks.\n\nThe meeting, held at CM House on Monday, was attended by Sindh Chief Secretary Asif Hyder Shah and Principal Secretary Agha Wasif.\n\nThe meeting noted that the next monsoon season is expected to begin 15 days earlier than usual.\n\nAgainst this backdrop, all four provincial governments will present their proposals, including necessary projects, under this plan. It was noted that proactive measures could significantly reduce damages caused by heavy rains and riverine floods.\n\nBoth sides acknowledged that Pakistan is facing severe losses due to climate change and emphasised the need for global support to minimise the damage.\n\nThe meeting also agreed on strengthening the carbon credit market. “The federal government will fully support provinces in opening the carbon credit market,” said Dr Malik.\n\nThe CM said that the provincial government had already initiated carbon credit marketing and stressed the need to expand it further.\n\nPlan to improve capacity of Sukkur Barrage\n\nThe meeting also discussed improving Sukkur Barrage capacity, reinforcing fragile embankments of the Indus, and restoring old waterways to prevent loss of lives and property during riverine and flash floods.\n\nThe CM pointed out that this year’s challenges were compounded by riverine floods.\n\nHighlighting the situation at Sukkur Barrage, the CM said its originally designed capacity was 1.5 million cusecs, but due to hydraulic issues and closure of 10 gates, the capacity has reduced to 960,000 cusecs.\n\n“We must enhance Sukkur Barrage’s capacity,” he emphasised.\n\nThe CM also expressed concern over the fragile condition of some embankments along the Indus River.\n\nHe noted that Japan is assisting Sindh in strengthening these embankments, particularly the KK Bund and Qadirpur-Shank Bund, and expressed hope that the projects would materialise soon.\n\nHe underlined the importance of restoring natural waterways to manage monsoon floods.\n\n“After the construction of barrages in the 1930s, the Katcha region came into existence, altering the natural flow,” he said, adding that Sindh has 14 canals and both the Right Bank and Left Bank of the Indus must have their natural drainage paths restored.\n\nHe urged the federal government to support Sindh in increasing the Sukkur Barrage’s capacity.\n\nDr Musadik Malik assured him of full cooperation and reiterated that international assistance is essential to tackle the adverse impacts of climate change.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/16092815169f6f3.webp",
  "retrievedAt": "2025-09-19T14:41:46.206Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942288/sindh-centre-agree-to-formulate-climate-plan-before-next-monsoon",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:35.000Z"
}
