{
  "title": "Auto sector warns draft law may ‘criminalise’ business - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The country’s auto sector has raised strong objections to the draft Motor Vehicles Industry Development Act 2025, warning that instead of promoting growth, the proposed law risks stifling investment, inflating costs, and even criminalising legitimate business practices.\n\nIndustry leaders argue the legislation was drafted without consulting stakeholders and hands sweeping powers to bureaucratic bodies, particularly the Engineering Development Board (EDB). They warn that vague and punitive provisions could discourage investors at a time when the government is seeking stability and foreign capital.\n\nOne of the most contentious elements is the classification of routine matters — including recalls and warranty disputes — as cognisable offences enforceable by the Federal Investigation Agency (FIA). Automakers say this equates manufacturers with criminals and will undermine confidence.\n\nPakistan Automotive Manufacturers Association (PAMA) Director-General Abdul Waheed Khan, in a letter to the Ministry of Industries on Sept 8, said the draft “criminalises manufacturing and trading activities without clear justification,” adding that FIA involvement is deeply troubling.\n\nIndustry rejects excessive FIA role, unchecked powers for EDB\n\nHe noted the law does little to strengthen consumer protection beyond the existing Auto Policy 2021–26 and instead threatens to push documented businesses into difficulties while leaving the unorganised sector unchecked.\n\nThe industry further pointed out that Pakistan already has multiple regulatory frameworks covering safety, quality and consumer rights — including the Auto Policy 2021–26, SRO 656, competition law, consumer protection laws, and the Import and Export Control Act. Local assemblers also comply with 17 international United Nations Economic Commission for Europe safety standards and are working to adopt more. Warranties, after-sales service and recalls are already standard practice, they stressed.\n\nParticular unease surrounds the discretionary authority granted to the EDB. Unlike statutory regulators such as the SECP or CCP, the EDB lacks legislative backing, accountability and technical capacity. Yet under the draft, it is tasked with overseeing recalls, type approvals, repairs, and even surveillance powers to enter premises without warrants.\n\nMr Khan argued that the EDB does not have the facilities to issue type approvals or monitor thousands of workshops nationwide. Such provisions, he said, are “impractical at best and open to misuse at worst.”\n\nFor consumers, the law could also backfire. Automakers warn that additional compliance costs and red tape will drive up vehicle prices, while vague language such as “significant risk” or “unfair contract terms” leaves room for arbitrary enforcement.\n\nThe industry emphasises it is not opposing regulation but is calling for targeted guidelines and stricter enforcement of existing laws. Stakeholders argue genuine consultation with manufacturers, provincial governments and consumer groups is necessary to close regulatory gaps without stifling growth.\n\nCiting Section 5, Mr Khan noted manufacturers cannot be held responsible for accidents caused by reckless or untrained drivers who ignore basic precautions such as wearing seat belts. “This section must be rephrased in consultation with the industry,” he urged.\n\nSimilarly, Section 9 — which requires a conformity certificate — duplicates existing practice since assemblers already issue COCs. Any post-purchase modifications, such as tyre changes or body alterations, should absolve assemblers of liability, he added.\n\nPAMA also rejected provisions placing repair services under EDB oversight, saying the board lacks the capacity to regulate thousands of workshops. The roles of EDB staff under Section 15, which allow undefined employees to exercise powers of the Act, were also termed legally questionable.Mr Khan urged the government to hold back the draft for “appropriate scrutiny of its administrative aspects,” and to remove provisions that criminalise industry operations.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:11:42.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942305/auto-sector-warns-draft-law-may-criminalise-business",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:14.000Z"
}
