{
  "title": "Mike Hesson urges Pakistan to show greater discipline after India defeat - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: Pakistan head coach Mike Hesson has urged his side to show greater discipline with bat and ball after their defeat to India in the Asia Cup on Sunday, warning that imp­rovement is essential ahead of their must-win fixture against the United Arab Emirates on Wednesday.\n\nHesson conceded that Pakistan had been “soundly beaten” on a spin-friendly track where Axar Patel and Kuldeep Yadav dictated terms.\n\n“We were a little frenzied at the start,” he said, noting his side’s inability to adapt to conditions. “We got to the end of the powerplay and were in the game, but we were squeezed in the middle overs, which created a lot of pressure.”\n\nThat pressure translated into a collapse, leaving Pakistan 20 to 30 runs short of a competitive total. The coach identified strike rotation against spin as a major shortcoming.\n\n“It’s not about picking the spinners; it’s about what you do when you pick them,” he remarked. “Dot-ball pressure forced big shots and dismissals.”\n\nSaim Ayub and Sahibzada Farhan have also come under scrutiny after a string of low scores.\n\nHesson, however, defended the pair: “Four games ago, they were averaging 40 as an opening partnership. They’re key players, and I’m confident they’ll turn it around.”\n\nExplaining the decision to bat first despite the venue’s chasing record, Hesson said that with little dew and used surfaces slowing down, runs on the board remained a viable option.\n\n“We didn’t bat well enough, whether first or second. That’s the reality,” he admitted. Hesson, however, lauded the fielding display, calling it a reflection of “character and fight.”\n\nLooking ahead, he underlined the need for sharper execution. “We need to play better than we did today. We’re not far off, and I’ve got confidence in this group to come back stronger.”\n\nWith qualification prospects hinging on their next outing, Hesson stressed the stakes. “It’s a must-win game for us to progress. We’ll need a lot more fight to have another crack in the Super Fours.”\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/16135303966e082.webp",
  "retrievedAt": "2025-09-19T14:41:46.787Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942301/mike-hesson-urges-pakistan-to-show-greater-discipline-after-india-defeat",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:21.000Z"
}
