{
  "title": "Bus owners in Quetta seek removal of restrictions - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: United Local Bus Association President Akhtar Jan Kakar along with Sher Ahmed Baloch has criticised the administration for frequent suspension of local bus services in Quetta, and alleging that constant police checks and harassment have left bus owners, drivers, and staff struggling for survival.\n\nSpeaking at a joint press conference along with other stakeholders on Monday, bus owners said the absence of sustainable sources of employment had already left people vulnerable, and now the unnecessary restrictions on local buses have worsened their plight.\n\nThey said that in compliance with court directives, 52-seater buses were withdrawn from service and replaced with 26-seater buses. Despite this, the Regional Transport Authority (RTA), traffic police, and law enforcement agencies continue to impose bans and harass bus operators without justification.\n\nThey criticised the authorities for obstructing affordable transport facilities for citizens and students. They said bus operators provide travel services for as little as Rs50, ensuring affordable commuting across long distances, yet face unjust treatment.\n\nThe association leaders demanded that Balochistan Chief Minister Sarfraz Bugti, Parliamentary Secretary for Transport Liaquat Lehri, and other officials take notice of the issue, withdraw the unlawful restrictions, and ensure the implementation of court orders. They warned that if their grievances were not addressed, they would continue to raise their voice at every platform.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:41:58.364Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942318/bus-owners-in-quetta-seek-removal-of-restrictions",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:09.000Z"
}
