{
  "title": "Armand Duplantis reaches new heights; Geordie Beamish makes history for New Zealand - Sport - DAWN.COM",
  "author": null,
  "content": "TOKYO: The world athletics championships were, not for the first time, the Armand Duplantis show on Monday although New Zealand’s Geordie Beamish did his best to share the spotlight after a shock win in the 3,000 metres steeplechase.\n\nDuplantis kept the drama going to the end in Tokyo — after the Swede retained his crown he went on to break the world record for the 14th time, on his third and final attempt at 6.30 metres.\n\nThe 53,000-strong crowd had stayed rooted to their seats even though the action on the track had ended long before.\n\nThey witnessed Duplantis jumping into the stand and embraced his parents.\n\nBeamish had been a great warm-up act.\n\nHe almost didn’t make it to the final after he fell in the heats, but he got up and produced a sensational burst of speed to qualify.\n\nIn the final, the long-haired Kiwi beat two-time defending champion Soufiane El Bakkali of Morocco by a hair’s breadth on the line to deliver New Zealand their first ever world track gold.\n\nSwiss 100m hurdler Ditaji Kambundji sprang an even bigger surprise in her final, the 23-year-old giving her country their first medal in the hurdles.\n\nThere was to be no such rocking of the establishment in the women’s hammer, Canada’s Olympic champion Camryn Rogers retaining her title and she too charged into the stands to embrace her team.\n\nDuplantis, though, deservedly took centre stage.\n\nThe showman never fails to deliver, and, with his winning smile, wrapped up the gold with a vault of 6.15m before his piece de resistance.\n\nHis rivals never laid a finger on him — Greece’s Emmanouil Karalis took silver with a best of 6.00m, then helped to keep Duplantis cool with an electric fan, and Australian Kurtis Marschall claimed bronze with a personal best of 5.95m.\n\n“I felt the only way to leave Japan was to set the world record,” said Duplantis. “That was my mentality. I don’t know what is next for me at this moment, I don’t care. I will just enjoy this right now. I was feeling really good the whole day. I knew I had the record in me.”\n\nPRETTY STOKED\n\nThe distance races, especially the men’s events, have been full of surprises at these championships and the 3,000m steeplechase proved to be no exception.\n\nBeamish, 28, came down the outside as El Bakkali charged for the line, believing a third title was in the bag.\n\nBeamish, though, gained on him and they breached the line together but the Kiwi had done just enough, timing 8min 33.88sec to the Moroccan two-time Olympic champion’s 8:33.95.\n\n“This was a turn-up, wasn’t it? That was pretty unreal,” said Beamish with masterly understatement.\n\n“It’s unreal. I’m pretty stoked. I did a lot in the last 200 metres. I knew I had it in me tonight. It’s a first track gold for New Zealand at a world championships, which is pretty cool.”\n\nEl Bakkali was utterly distraught and collapsed to the ground sobbing before being consoled by team-mate Salaheddine Ben Yazide.\n\n“It’s very difficult for me to accept this result but I have to because this is high performance sport,” said the 29-year-old.\n\nKambundji was not the first from her family to appear in a final at the track because her sister Mujinga ran in three finals at the Covid-delayed Tokyo Olympics in 2021.\n\nMonday’s heroine looked stunned at winning as Olympic champion Masai Russell, who had predicted she might break the world record, instead trailed in fourth. Earlier, Alphonce Felix Simbu delivered Tanzania’s maiden world title as she produced a savage dip at the line to snatch world marathon gold from Germany’s Amanal Petros.\n\nSimbu and Eritrea-born Petros were both clocked at 2hr 09min 48sec in the most dramatic of endings for the longest event of the world championships in the Japanese capital, the Tanzanian adjudged to have finished three-hundredths ahead.\n\nItaly’s Iliass Aouani claimed bronze in 2:09:53.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1612073733d7fe3.webp",
  "retrievedAt": "2025-09-19T14:41:47.751Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942300/armand-duplantis-reaches-new-heights-geordie-beamish-makes-history-for-new-zealand",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:21.000Z"
}
