{
  "title": "Protesting Kashmiri refugees press for implementation of demands - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Hundreds of men, women and children from families of post-1989 refugees from Indian-occupied Jammu and Kashmir staged a protest demonstration here on Monday, pressing the authorities to implement their charter of demands, including an increase in monthly subsistence allowance and a comprehensive resettlement package.\n\nThe protesters demanded that the AJK government present a clear roadmap by Oct 15 to resolve all their issues, including resettlement.\n\nThey called on the authorities to immediately increase the subsistence allowance of refugees by Rs1,500 per person in line with promises.\n\nThey also sought a comprehensive financial package based on land, housing and employment, restoration of the six percent quota in government jobs, and full implementation of all commitments.\n\n“The time has come to heal the wounds of the Kashmir refugees,” the speakers stressed, vowing that the Refugee Working Committee (RWC) would not abandon its oppressed brethren to fate.\n\nThe protest, organized by the RWC—a body formed in March 2024 to champion the cause of post-1989 refugees—began with a sit-in at the bustling Burhan Wani Chowk outside Press Club and culminated in a rally through the main thoroughfare to Ghari Pan Chowk.\n\nSpeakers at the gathering accused the AJK government of apathy and failure in addressing the decades-old issues of the community.\n\nRWC chairman Uzair Ahmed Ghazali lamented that even after 36 years, post-1989 migrants remained deprived of their fundamental human, social and political rights.\n\n“In their own country and state, the refugees remain landless and homeless, which is proof of the government’s failure,” he said.\n\nOther RWC leaders, including Gohar Ahmed Kashmiri (general secretary), Raja Mohammad Arif (spokesperson), Irshad Ahmed Butt (chief coordinator), Riaz Ahmed Jaral, Mahmood Akhtar Qureshi, Mohammad Latif Lone (vice chairmen from Mirpur, Kotli and Bagh, respectively), Muhammad Iqbal Mir (secretary information), and Manzoor Iqbal Butt (treasurer), echoed similar views.\n\nThey demanded issuance of domiciles to grant full civic rights and allocation of separate seats in the Legislative Assembly for the post-1989 migrants from Jammu and Valley.\n\nThe RWC has held several meetings with the country’s top leadership over the past year, including President Asif Ali Zardari, Prime Minister Shehbaz Sharif, Parliamentary Kashmir Committee chairman Mohammad Qasim Noon, and Parliamentary Committee on post-1989 Kashmiri refugees convenor Riaz Fatyana, to press its demands.\n\nOn September 9, an RWC delegation also met AJK Prime Minister Chaudhry Anwarul Haq at Kashmir House Islamabad, who had sought two days’ grace to renew his request to the federal government for funds to raise the allowance.\n\nAccording to AJK Rehabilitation Department officials, each refugee is entitled to a monthly subsistence allowance of Rs3,500, which is drawn even by those running businesses or in jobs, though it ceases for individuals entering government service. Family members of such individuals, however, continue to receive the stipend.\n\nCurrently, around 46,000 people—up from an initial 10,000–12,000—constitute the post-1989 refugee community, spread across 8,601 families. Of them, 5,500 families reside in 25 camps (18 in Muzaffarabad, five in Bagh and two in Kotli), while the rest live in rented houses in different parts of AJK and Pakistan.\n\nSpeakers at Monday’s rally warned that despair was deepening among educated refugee youth due to lack of opportunities.\n\nThey stressed that the “base camp” government must shoulder its constitutional and historical responsibilities and evolve a clear strategy regarding the Kashmir freedom movement.\n\nExpressing regret that those who had sacrificed for the liberation struggle had been awaiting their rights for nearly four decades, they urged the governments of AJK and Pakistan to take immediate and concrete measures to resolve their longstanding issues and enable them to live dignified and peaceful lives.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/16104322550007f.webp",
  "retrievedAt": "2025-10-12T04:12:41.890Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942252/protesting-kashmiri-refugees-press-for-implementation-of-demands",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:53.000Z"
}
