{
  "title": "Mostly small items, mementos among gifts received by public office-holders - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Apart from the affluent sheikhs of Qatar and Saudi Arabia, who lavished Pakistan’s dignitaries — including visiting bureaucrats — with expensive gifts, mainly wristwatches, Prime Minister Sheh­baz Sharif received a traditional golden dagger during the first six months of 2025.\n\nThe Toshakhana record, made public by the cabinet division for the period between January and June 2025, lists high-value items such as watches, luxury vehicles, carpets, handicrafts, and traditional artefacts presented to top state functionaries, including the president, prime minister, ministers, and senior officials during foreign visits and local engagements.\n\nThe data, comprising 137 entries, records gifts received from heads of state, royal families, diplomats, and business delegations. However, the value of these gifts is still being assessed by the cabinet division.\n\nPrime Minister Shehbaz Sharif received a total of 61 gifts, mostly decorative and traditional items. These included several high-end wristwatches. Notably, on the first day of 2025, he was presented with two luxury wristwatches — an IWC Schaffhausen and a Panerai, both with warranty cards — by Sheikh Abdul Hadi Mana Al-Hajri of Qatar.\n\nRecord shows PM received 61 out of total 137 gifts presented to state officials\n\nThe Shah of the State of Selangor, Malaysia, gifted PM Shehbaz a ‘Golden Kris’ — a traditional Malaysian dagger. Additionally, the president of Turkiye presented him with an electric car.\n\nDuring his visit to Azerbaijan, the prime minister received a handmade silk carpet and other items. The President of Tajikistan gifted him a box containing a golden teacup with a spoon.\n\nWhile in Saudi Arabia, PM Shehbaz received a model of Mimbar-e-Rasool from Prince Mansour Bin Muhammad Bin Saad bin Abdulrahman Al Saud, and a wooden box containing two documents — the Charter of Makkah in English and Arabic — from Dr Mohammad Abdulkareem Al-Issa, Secretary General of the Muslim World League.\n\nFrom Iran, the PM was presented with a wall hanging and a shield by the Chief of General Staff. Other gifts included handmade carpets, onyx decorations, paintings, tea sets, books, and shields.\n\nInterestingly, while the Saudi hosts did not overwhelm the prime minister with lavish gifts, several Pakistani officials visiting the Kingdom — led by Interior Minister Mohsin Naqvi — received high-end wristwatches.\n\nOn Jan 28, Interior Minister of Saudi Arabia gifted six Rolex watches, five Tudor watches, three Black Armin watches, and nine Frank Rosha watches to Pakistani officials, primarily government officers.\n\nThe record shows that President Asif Ali Zardari received 11 gifts, including a ladies’ suit and a bedsheet from the High Commissioner of Bangladesh. The most valuable among his gifts was an electric vehicle from the president of Turkiye. He also received a carpet from the Iranian foreign minister, as well as vases, candle stands, shields, a coffee set, and onyx items.\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar received several Afghan carpets and traditional bowls, while Punjab Chief Minister Maryam Nawaz was presented with prayer mats and Turkish handicrafts.\n\nOther ministers, advisers, and security officials were gifted watches, rugs, wall hangings, and porcelain items.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:41:58.880Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942319/mostly-small-items-mementos-among-gifts-received-by-public-office-holders",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:09.000Z"
}
