{
  "title": "Balochistan Public Accou­nts Committee probe uncovers billions in financial irregularities - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Public Accou­nts Committee of the Baloch­istan Assembly on Monday uncovered billions of rupees in financial irregularities, including unsurrendered savings and funds improperly held in private bank accounts by government officials, according to a review of recent audit reports.\n\nThe commitee’s meeting, presided over by Chairman Asghar Ali Tareen, identified what it called serious lapses in financial discipline and gross violations in the handling of budgetary allocations and revenue collection across several government departments.\n\nAn audit report for 2016-17 revealed that of the Rs3.34 billion allocated for non-development funds, Rs740.6 million in savings were never surrendered, reflecting weak fiscal control.\n\nIn a more significant breach, between 2020 and 2022, deputy commissioners kept more than Rs19.14bn in bank accounts instead of depositing the money into the provincial treasury as required by financial rules.\n\nAudit reveals uncollected taxes, mismanaged funds plaguing the province\n\nFurther findings showed a lack of transparency and collection failures. Auditors were denied access to expenditure records worth Rs33.74m from 2019-21, the report stated.\n\nDuring the same period, the government failed to collect over Rs1.1bn in Usher, irrigation tax and agricultural income tax, depriving the exchequer of critical revenue.\n\nThe committee also cited the improper issuance of cheques worth Rs228.96m from commissioners’ offices, which were made out to DDOs instead of directly to vendors.\n\nPAC Chairman Zafar Tareen expressed “serious concern” over the findings, demanding that all budget savings be surrendered without delay.\n\nHe warned of disciplinary measures against any officials found obstructing financial transparency.\n\nThe PAC directed the immediate submission of all pending records to audit auth-orities and the mandatory deposit of all withheld funds into the treasury.\n\nIt called for strict action against negligent officers, with the chairman stating that financial discipline cannot be ensured without strict adherence to rules. The committee also criticised several deputy commissioners for failing to comply with PAC directives issued as far back as 2020.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:41:59.167Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942321/balochistan-public-accounts-committee-probe-uncovers-billions-in-financial-irregularities",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:16:09.000Z"
}
