{
  "title": "Four more Bajaur villages cleared of terrorists - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR: The district administration has allowed residents of four more villages of Lowi Mamund and War Mamund tehsils to return to their homes after security forces declared the localities terrorist-free, bringing the total number of areas cleared during the ongoing operation to 14.\n\nAccording to a notification issued from the office of additional deputy commissioner (relief and human rights) on Sunday night, also seen by Dawn, the areas declared clear are Bara Laghari, Lara Laghari, Darmiyaani Laghari of Lowi Mamund and Dabrai of War Mamund.\n\nSources in the district administration told Dawn on Monday that the return of people to their homes in Lowi Mamund and War Mamund tehsils was under way and over 4,000 displaced families had so for returned to their villages.\n\nCRACKDOWN: The police on Monday launched a crackdown on the non-custom paid (NCP) vehicles, which have not been profiled/registered with the excise department in Bajaur.\n\nA statement issued from the district police office said the action was launched after profiling of NCP vehicles was deemed necessary due to the prevailing law and order situation in the district.\n\n“Following the directives from senior officials, the district police have initiated a major crackdown on non-profiled NCP vehicles, requiring owners to register them immediately in view of the prevailing law and order situation,” the statement said.\n\nIt said though residents have frequently been urged to get their vehicles profiled amid the current law and order situation, most have failed to comply, prompting the police to launch the crackdown. During the crackdown, several NCP vehicles were impounded. The statement asked the residents to get their NCP vehicles profiled with the excise department office without delay to avoid action.\n\n“Profiling of such vehicles is not only a legal requirement but also crucial for the safety and security of the local community,” the statement added. A source in the local police told Dawn on Monday that around half of the total NCP vehicles in the district were reportedly not profiled.\n\nThe source, however, mentioned that a large number of residents had got their vehicles registered/profiled.\n\nThe profiling process was launched by the district administration on October 24, 2023.\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:41:34.105Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942274/four-more-bajaur-villages-cleared-of-terrorists",
  "dateList": "2025-09-16",
  "date_published": "2025-09-16T02:17:00.000Z"
}
