{
  "title": "Pakistan committed to protection of minorities’ rights: President",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-protection-of-minorities-rights-president/",
  "date_published": "2024-08-10T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP):President Asif Ali Zardari said Pakistan was committed to ensuring the protection of religious, social, political and economic rights of its minorities.\nIn a message on the occasion of Minorities’ Day on August 11, 2024, he said , “Pakistan celebrates Minorities’ Day on 11 August every year to acknowledge the contributions of our minorities towards Pakistan’s socio-economic development.”\n“On this day, we reaffirm our commitment to the promise made by Quaid-e-Azam Muhammad Ali Jinnah, on 11 August 1947, to the country’s minorities to protect their rights and religious freedoms.”\nThe President said, “Minorities in Pakistan enjoy all political, economic and social rights which have been guaranteed by the Constitution of Pakistan.”\n“Our religion Islam also fully recognizes and advocates the protection of the rights of minorities. I am glad to say that Pakistan has taken a number of steps for the political, social and economic empowerment of minorities.”\nHe said, “In this regard, we have allocated a 5% quota for minorities in government jobs and separate seats in both houses of the parliament to encourage them to play an effective role in the political and national development of the country.”\n“Additionally, steps are being taken to provide financial assistance to poor and deserving individuals, marriage grants, scholarships to students from minority communities for their education, besides the provision of funds for the repair/maintenance of their worship places.”\nHe said every Pakistani has the right to live according to their faith, irrespective of their religion, caste, colour or creed.\nHe urged all segments of society, including the religious scholars, representatives of minorities and the media to educate the people about their rights and work for promoting interfaith harmony, the spirit of love, tolerance, brotherhood and unity to make Pakistan a strong country.\nHe assured all minorities that Pakistan would make every effort to safeguard their rights and provide them equal opportunities to excel in life.\n“I am confident that the minorities of Pakistan will continue to play their positive role towards the country’s development. I congratulate them on the special day and I wish them all the best in their future endeavours,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:31:55.140Z"
}
