{
  "title": "Mohsin Naqvi chairs meeting on upgradation of Islamabad Police Stations",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-chairs-meeting-on-upgradation-of-islamabad-police-stations/",
  "date_published": "2024-08-10T09:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP):Federal Minister for Interior Mohsin Naqvi chaired a review meeting on the upgradation of Islamabad police stations at the Ministry of Interior, here Saturday.\nHe ordered the upgradation of police stations in the federal capital on the pattern of smart police stations.\n“Traditional police stations have become a symbol of fear, and citizens think multiple times before visiting these stations,” he highlighted.\nHe said, “He has personally visited the police stations and witnessed the deplorable conditions.”\nInterior Minister emphasized, “Islamabad is the face of Pakistan, and we need to make it a world-class city by immediately adopting smart policing.”\n“All possible resources will be provided for smart police stations.He said that well-mannered and educated police officers will be deployed at smart police stations, and police stations will be upgraded and transformed into smart police stations in a phased manner,” he assured.\nHe directed the swift implementation of the plan.\n“A high-quality design at a low cost should be prepared for the upgradation,” he added.\nInterior Minister also directed tha land should be identified for police stations established in make shift and rented buildings.\nHe underscored that there would be no compromise on merit in police recruitment, and only young people who were fit, educated, and meet the merit criteria would be selected.\nHe stressed the need for a positive change in the behavior towards complainants.\nThe meeting was attended by Federal Secretary Interior Khurram Ali Agha, Chairman CDA Muhammad Ali Randhawa, DIG Operations, and other high officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:32:19.342Z"
}
