{
  "title": "Star Javelin thrower Arshad Nadeem wears Olympic crown, brings laurel to Pakistan",
  "link": "https://www.app.com.pk/national/star-javelin-thrower-arshad-nadeem-wears-olympic-crown-brings-laurel-to-pakistan/",
  "date_published": "2024-08-10T11:04:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 10 (APP):The 21st century stands witness to achievements of some of the most influential heroes in the world. Arshad Nadeem stands among the men who took the history into their bare hands and bent it according to their will.\nPakistan’s son Arshad Nadeem rewrote history by wining gold medal in the men’s javelin on Thursday, beating defending champion Neeraj Chopra of India to clinch Pakistan’s first Olympic Athletic medal in Paris Olympics 2024, besides breaking the previous Olympic record with a 92.97-metre massive throw.\nArshad launched a throw of 92.97-meter in his second attempt which was enough for him to secure gold medal.\nNadeem threw his arms up in celebration after breaking the Olympic record on his second throw with a stunning 92.97 metres – the best in the world this year.\nChopra, comfortably ahead in qualifiers and seemed to be the favourite to win, looked off his best form. His best of 89.45 was also his only valid attempt as he fouled on his five other attempts.\nArshad Nadeem won the gold medal ending the 32-year wait for the country with Olympics 118-year history-best 92.97 meters throw. Grenada’s Anderson Peters won bronze with 88.54, a redemptive moment for the two-time world champion after he failed to make it to the final at the Tokyo Games three years ago.\nFormer celebrated hockey players, Qamar Ibrahim and Tahir Zaman, both of whom participated and won bronze in their mega sporting event in the 1992 Barcelona Olympics, extended their utmost love and happiness  for the national hero, bagging first-ever gold medal in Athletics in the event of Javelin throw, by breaking a 118 years old world record.\nDespite lacking top facilities and equipment available to athletes in other countries, Nadeem managed to shift some focus from cricket to athletics in Pakistan. Hailing from Mian Channu, a small town in Punjab, Arshad’s journey to Olympic glory has been marked by sheer determination, and relentless hard work. Despite limited resources and training facilities, he has risen to become one of the world’s elite javelin throwers.\n“Winning gold medal is a dream come true, not just for me, but for every Pakistani,” said emotional Arshad in a post-event interview on Thursday. “I hope this victory inspires the youth of our country to aim high and believe in their potential,” Arshad said.\nMeanwhile, Pakistani celebrities have started congratulating the ace javelin thrower for his historic win in the Paris Olympics 2024. Celebrity couple Hira and Mani, showing excitement over Arshad’s win, said they believed that the athlete would cross the 90-metre mark.\nPakistanis should start respecting sports and sportsmen, said Mani while giving salute to Arshad for his amazing victory in the Olympic tournament. Noted host and actor Fahad Mustafa in a statement, congratulated Pakistan for winning the first-ever individual gold medal. “Arshad Nadeem, God bless you. Pakistan Zindabad!” he exclaimed.\nSinger Fakhir Mehmood said Arshad has made his heart happy. “We are so proud of you. Pakistan Zindabad,” he said. Actor Mahira Khan, taking to Instagram, wrote: “What a throw! Breaking records, yes sir.”\nFollowing Arshad’s win, Ushna Shah took to Instagram, saying: “Teary eyed, big smile and now [got to] replace this MJ [Michael Jordan] with an AN [Arshad Nadeem] one.”\n“Gold medal in Olympics after 32 years in Pakistan. History made,” write Sajal Aly on her Instagram story.\nComedian Ahmad Ali Butt demanded that Arshad should be given a “brand new house, brand deals, sports academy and more because he’s proved he’s best”.\nHe also gave a hint of a movie, saying “biopic on the way” and tagged movie actor Humayun Saeed.\nMeanwhile, in a goodwill gesture, India’s javelin thrower Neeraj Chopra’s performance struck an emotional chord with his mother Saroj Devi, who didn’t shy away from heaping on praises for Arshad Nadeem, said various live media televised reports from Paris Olympics. Soon after Nadeem’s record-breaking achievement at the Paris Olympics 2024 Thursday night, the silver medallist’s mother praised the gold medal winner by saying: “Arshad bhi mera beta hai (Arshad is like a son to me).”\n“We are very happy. For us, silver is also equal to gold. The one who got the gold is also like our son. He was injured, so we are happy with his performance. I will cook his favourite food,” she said.\nThe 27-year-old Pakistani ace javelin thrower, in an exclusive conversation with a local channel said that “It was my day. I could have thrown it at a greater distance.” The incredible athlete, revealing the reason behind his win, said he was “in the rhythm” and “hopeful” to win the gold medal with how far he had launched it.\nEarlier, in a thrilling final, Nadeem set a new Olympic record with a throw of 92.97 metres and earned a gold medal after 40 years. The last time Pakistan won a medal that was in 1992 when the national hockey team clinched bronze by defeating the Netherlands 4-3 at the Barcelona Olympics.\nPunjab Chief Minister Maryam Nawaz Sharif has announced a reward of Rs 10 crores for the javelin thrower Arshad Nadeem while congratulating him on winning a gold medal for Pakistan in the Paris Olympics.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:32:02.110Z"
}
