{
  "title": "Global intervention on Kashmiris right to self determination urged",
  "author": null,
  "content": "MUZAFFARABAD, Jan 05 (APP):A prominent Kashmiri activist on Sunday urged world leaders and global organisations to fulfil their longstanding commitments to the people of Jammu and Kashmir, whose right to self-determination remained unfulfilled for over seven decades.\n“Seventy-six years after the UN pledged to uphold the Kashmiri people’s right to decide their future, that promise has been left to gather dust,” said Tanveerul Islam, a former chairman of United Jihad Council, an umbrella of groups fighting Indian occupation in Jammu and Kashmir.\nMr Islam now heads not-for-profit Sawera Foundation, which which endeavours peacefully to promote the rights and welfare of the Kashmiri people.\n“The Kashmiris remain ensnared in a cycle of oppression and political apathy, their voices silenced, and their aspirations ignored,” he said.\nHighlighting the aftermath of India’s revocation of Jammu and Kashmir’s special status in August 2019, Mr Islam described the move as a catastrophic blow to the region’s political and cultural identity.\n“The abrogation of Article 370 marked a turning point,” he said, adding, “It stripped the occupied region of its autonomy and unleashed an era of intensified repression, which has been witnessing arbitrary arrests, custodial deaths, enforced disappearances, and the brutal blinding of innocent civilians with globally banned pellet guns.”\nThe Sawera Foundation president also highlighted the plight of the Kashmiris who were forced to abandon their homes and hearths in the occupied territory and take refuge in Azad Jammu and Kashmir and Pakistan after 1989.\n“The Kashmiris face systemic disenfranchisement. Not only those who are actively engaged in the freedom movement but their families as well, who are a permanent victim of threats, travel restrictions, and social ostracism.”\n“The repression knows no borders,” he said.\nMr Islam also drew attention to the grave socio-economic challenges facing Kashmiri youth, who he said were bearing the brunt of discriminatory policies that severely curtailed educational and employment opportunities.\n“India’s quota policies have reduced opportunities for Kashmiri Muslims by over 50%, leaving a generation in despair,” he said.\nPointing out the fact that Kashmir remained the most heavily militarized zone in the world, with over 700,000 troops enforcing draconian laws like AFSPA and UAPA, he said this unchecked militarization had created a culture of impunity for human rights violations.\nReiterating the gravity of the crisis, Mr Islam called upon the United Nations and international organizations to honour their promises and take decisive action.\n“This is not just a regional conflict—it is a humanitarian catastrophe and a global human rights crisis. The world’s silence has only emboldened repression,” he stressed.\nReaffirming his organisation’s unwavering commitment to the Kashmiri cause, he said the sacrifices of over 500,000 Kashmiris demanded justice in the shape of fulfilment of the promise made to them in 1949.\n“The time for meaningful global intervention is now. Let us not fail the people of Kashmir again”, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:23:45.234Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/global-intervention-on-kashmiris-right-to-self-determination-urged/",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T07:04:00.000Z"
}
