{
  "title": "PM youth empowerment program to open gates of employment in Pakistan: Rana Mashood",
  "author": null,
  "content": "SWAT, Jan 05 (APP):Rana Mashhood Ahmad Khan, Chairman, Prime Minister’s Youth Program here Sunday said that socio economic empowerment and provision of dignified jobs to youth was the top priority of the government, and the PM youth skills development program would open gates of employment for them not only in the country but also abroad.\nAddressing a function of youth at Malam Jabba here, Rana Mashhood said that about Rs36 billion projects were approved under the Prime Minister’s youth program with special focus on their vocational, IT and technical education.\nHe said the students of all provinces of Pakistan would be largely facilitated from this landmark program. After necessary education and IT training, he said these youth would be sent abroad for dignified jobs.\nIn this regard, Youth Facilitation Centers would be established in all districts in next three months of the country including Khyber Pakthunkhwa, adding each beneficiary would earn about Rs 100,000 per month after passing the six month IT course at their home towns.\nRana Mashhood said that Uraan Pakistan would largely benefit youth of Pakistan and economy to achieve new heights.\nHe expressed the hope that upcoming 2025 budget would be passed without an assistance of IMF.\nThe Nawaz Sharif Govt had said good bye to IMF, eradicate terrorism, addressed load shedding and made Pakistan an atomic power,he added and said PMLN had made Pakistan defense impregnable on May 28, 1998 and now no foreign power can keep an evil eye on it.\nRana Mashood said that PML had created Pakistan after a lot of sacrifices by our forefathers led by Quaid-e-Azam Muhammad Ali Jinnah and will make it an Asian Economic Tiger.\nHe said In the previous 16 months Shehbaz Sharif Govt had saved the country from bankruptcy and an imminent economic default.\nRana Mashhood said that present PMLN Government has put the economy back on track of stability and foreign investment started coming back to Pakistan. He said stock exchange achieved new heights and price hikes slashed significantly.\nRana Mashhood questioned that where was the Pro PTI founder’s western lobby when innocent Palestinians at Ghaza were massacred and innocent people at Lebanon bombed.\nHe said that Imran Khan Govt has plunged the country into foreign loans burdens, inflation and price hike after signing an agreement with IMF on very tough conditions, resulting an increase in employment and poverty in the country.\nHe said that people of Khyber Pakthunkhwa had voted during referendum in favour of Pakistan in 1947 and their sacrifices and services for Pakistan were highly praiseworthy.\nRana Mashhood praised the services of Engr. Amir Muqam for the party and suggested for formation of committee to discuss projects for youth of Khyber Pakthunkhwa especially for Swat at Islamabad.\nFederal Minister Engr Amir Muqam were also present.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:22:14.303Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-youth-empowerment-program-to-open-gates-of-employment-in-pakistan-rana-mashood/",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T13:23:00.000Z"
}
