{
  "title": "NA speaker stresses self-determination as fundamental right for Kashmiris",
  "author": null,
  "content": "ISLAMABAD, Jan 05 (APP):National Assembly Speaker Sardar Ayaz Sadiq has reaffirmed Pakistan’s unwavering support for the Kashmiri people, emphasizing that the right to self-determination is an inherent and fundamental right of all nations.\nIn his message on Right to Self-Determination Day, observed annually on January 5 for the people of Jammu and Kashmir, the speaker praised the Kashmiri people for their steadfast struggle over seven decades to secure this right. He emphasized that the day represents their unwavering commitment to attaining their inalienable freedom, as acknowledged by the United Nations.\nSpeaker Sardar Ayaz Sadiq underscored the significance of January 5, 1949, when the United Nations Security Council passed a resolution endorsing the Kashmiri people’s right to determine their future through a fair and impartial plebiscite. However, he expressed regret that despite the lapse of more than seventy years, these resolutions remain unimplemented, leaving the Kashmiri people’s aspirations unfulfilled.\nNA Speaker strongly condemned the Indian government’s actions of August 5, 2019, when it unilaterally abrogated the special status of Illegally Occupied Jammu and Kashmir. He described these measures as draconian and a blatant assault on the rights of the Kashmiri people.\nHe reaffirmed that such oppressive tactics would never diminish the Kashmiri people’s resolve to pursue their rightful demand for self-determination.\nReiterating Pakistan’s unwavering support for the Kashmiri people’s struggle, Speaker Sardar Ayaz Sadiq urged the international community to recognize the legitimate demand of the Kashmiri people for self-determination and to take meaningful steps toward resolving the longstanding Kashmir dispute. He emphasized that a peaceful resolution, in accordance with UN resolutions and the aspirations of the Kashmiri people, is essential for regional stability and global peace.\nSpeaker Sardar Ayaz Sadiq assured that Pakistan stands resolutely alongside the Kashmiri people in their just cause. He reiterated that Pakistan will continue to provide moral, diplomatic, and political support for the peaceful resolution of the Kashmir issue across all regional and international platforms.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:22:28.499Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-speaker-stresses-self-determination-as-fundamental-right-for-kashmiris/",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T11:48:00.000Z"
}
