{
  "title": "Supreme Court Bar Association condemns recent terror attacks in Parachinar, Turbat",
  "author": null,
  "content": "ISLAMABAD, Jan 5 (APP):Supreme Court Bar Association President Mian Muhammad Rauf Atta on Sunday expressed deep sorrow over the recent terrorist attacks in Kurram, Parachinar and Turbat which have resulted in considerable loss of life.\nAccording to press release, in Kurram several individuals including the Deputy Commissioner and law enforcement officials sustained injuries. Meanwhile, in Turbat, four innocent civilians lost their lives due to an explosion and over thirty-two others were seriously injured.\nMian Muhammad Rauf Atta extended heartfelt condolences to the families of the victims and wished a speedy recovery for the injured.\nHe emphasized the urgent need for attention to the deteriorating security situation in Balochistan.\nDespite a peace agreement signed by local leaders, the violence on the day designated for the movement of convoys to Parachinar raises serious concerns.\nAtta criticized the Khyber Pakhtunkhwa government’s inaction, stating that their efforts appear to be superficial and lacking a genuine commitment to resolving critical issues.\nHe urged the federal government and security agencies to take immediate action to restore law and order in Kurram and ensure the timely delivery of essential medical and food supplies to prevent a potential crisis.\nAs the security situation worsens in Khyber Pakhtunkhwa and Balochistan, Atta called for federal intervention to assist provincial governments with necessary resources.\nHe stressed that for Pakistan to thrive, there must be a united condemnation of terrorism in all its forms.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:23:11.267Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/supreme-court-bar-association-condemns-recent-terror-attacks-in-parachinar-turbat/",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T10:39:00.000Z"
}
