{
  "title": "Senate body lauds Information Ministry for fast-track digitization of state media institutions",
  "link": "https://www.app.com.pk/national/senate-body-lauds-information-ministry-for-fast-track-digitization-of-state-media-institutions/",
  "date_published": "2022-01-19T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): Chairman Senate Standing Committee on Information and Broadcasting Senator Faisal Javed Khan  Wednesday lauded the Information Ministry to carry out fast-track digitization of state media institutions under PM’s ‘Digital Pakistan’ vision.\nPresiding over meeting of Standing Committee on Information and Broadcasting, Faisal Javed said it was imperative to transform the state media organizations on modern lines to meet new era tasks.Managing Director Associated Press of Pakistan (APP) Mobashir Hasan apprised the meeting that a project worth Rs 786.79 million had been launched for upgrading and digitalization of APP. Out of the total amount, some Rs 671 million would be spent to procure equipment for the overall transformation of APP from textual to digital mode.\nData centres and new state-of-the-art studios were also being set up for the purpose, he added.Senator Faisal Javed appreciated the MD APP for transforming the state news agency on modern lines and in accordance with the vision of the prime minister.\nThe meeting was also briefed on overall functioning, human resource and financial portfolio, current strength and footprint of the state news agency, mandated to create, develop and disseminate content for public consumption through different media.\nThe MD APP apprised the Senate body that there had been over 400 subscribers of the news agency which had bilateral news exchange agreements with 50 international news agencies.It also had international clients including Agence France-Presse (AFP), Gulf News, Khaleej Times, BBC Monitoring, China Economic Net, Al-Jazeera and others.\nHe said the APP was offering news services to its clients in multiple national and regional languages including Arabic and Chinese and English. Its services for different forms of news media included textual, digital, pictorial, video, features etc, he added.\nThe meeting was informed that the APP had its correspondents in foreign countries to disseminate Pakistan related news to the local subscribers, and their deployment was made on merit under a transparent process.The meeting was also briefed on award of TV broadcast rights for HBL Pakistan Super League (PSL) to a private television channel.\nThe PTV officials briefed the committee that the matter was sub judice and explained that an advertisement was issued in the national newspapers to award the broadcast rights for PSL.Senator Irfan-ul-Haque Siddiqui asked whether due process was followed in awarding broadcast rights to the TV channel.\nIt was informed that specific TV channel with some reservations did not take part in the bidding process.Senator Irfan asked the PTV officials to submit a comprehensive report to the committee on award of broadcast rights.The PTV officials explained that a comprehensive reply, already submitted to the court, would be presented to the body in next meeting.\nThe committee chairman took up the royalty issue for the artists and asked the PTV to explain the reasons for discontinuing the facility to the artists.It was informed that the national TV provided royalty to the artists in 1980s.The chairman said the PTV did generate revenues by telecasting dramas, but it was unfortunate that now the artists were not getting any royalty in the country, whilst it was given across the globe.\n“Rich artists may not need the royalty, but poor ones are facing financial constraints,” he noted.Senator Faisal asked the PTV management to take steps to give royalty for the artists and submit a formal report on the dramas telecast by the national TV in the last one year.He asked the MD PTV to visit the residences of artists who were facing financial issues.The PTV management was also directed to update the committee in the next meeting about mechanism to award royalty for artists.\nThe chairman proposed to set up a welfare fund at the PTV for artists. Details of the mechanism, to be evolved for the purpose, should be shared with the committee in the next meeting, he added.Senator Faisal also sought complete details of the assets and buildings owned by the PTV.Senator Irfan said there was no need to vacate existing or set up new buildings for the PTV, rather full support be ensured for improving the national TV performance.\nThe committee chairman said the PTV had a huge network for disseminating footage to all organizations across the country.Senator Faisal noted telecast of Turkish drama series ‘Ertugrul’ on the national TV had an overwhelming response and added efforts were underway to produce documentaries on great Muslim ruler Tipu Sultan and Mughal King Zaheer Uddin Babar.\nThe chairman said due coverage was being given to the opposition leaders on the national TV, unlike the practice of previous government.The forum was briefed about working and performance of Shalimar Recording and Broadcasting Company.The meeting was attended by Senators Anwar Lal Dean, Tahir Bizinjo and others. Federal Secretary of Ministry of Information and Broadcasting Shahera Shahid and senior officers of attached departments also attended the meeting.",
  "retrievedAt": "2025-08-11T14:09:00.646Z"
}
