{
  "title": "Increased indigenous urea production ensures cheaper rates: PM",
  "link": "https://www.app.com.pk/national/increased-indigenous-urea-production-ensures-cheaper-rates-pm/",
  "date_published": "2022-01-19T12:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): Prime Minister Imran Khan Wednesday said that increased indigenous production led to urea fertilizer availability to farmers at a five times cheaper rate compared to prices in the international market.\nHe said that the government had devised a comprehensive mechanism for the distribution of urea with the help of district administration that would ensure availability of urea fertilizer to farmers at the controlled rate.\nThe prime minister chaired a high-level meeting on fertilizer issues.\nThe meeting was given a detailed briefing on urea production, its distribution across the country, monitoring mechanism to curb hoarding and smuggling and the price differential between Pakistan and international market including regional countries.\nThe meeting was attended by Federal Ministers Shaukat Fayyaz Tarin, Fawad Chaudhary, Hammad Azhar, Makhdoom Khusro Bakhtiyar, Syed Fakhar Imam, Minister for State Farrukh Habib, SAPM Dr. Shehbaz Gill, Jamshed Iqbal Cheema, stakeholders from the fertilizer industry and concerned officials.\nA comprehensive plan was also presented in the meeting which after implementation would ensure smooth distribution of urea fertilizer at union council level under the monitoring of district administration, agricultural department and revenue department.\nThe prime minister directed to implement the plan immediately saying that the facilitation of the small farmers was among the topmost priorities of the government.\nThe meeting was briefed that the urea production in three-year tenure of the government surpassed 6.1 million tons, 440,000 bags per day, which prior to 2018 never crossed 5.5 million tons, 370,000 bags per day.\nThis was achieved due to the government’s policies, including unhindered supply of gas to urea plants.\nIn addition to that, due prime minister’s vision to prioritize food security, a robust system to monitor fertilizer supply and demand with constant monitoring has been put in place that has led to resolution of issues on daily basis.\nExcept Sindh, with a production of 90% and verification of of 23%, all other provinces have been ensuring verification on PITB Portal.\nThe prime minister said that the government was taking strict anti-smuggling and anti-hoarding measures to curb illicit profiteering from urea distribution across the country.\nThe government had achieved record production of urea fertilizer in its three-year tenure, which surpassed 6.1 million tons. Prior to 2018 it never crossed 5.5 million tons., he observed.\nThe meeting was also given details regarding anti-smuggling operations and number of bags confiscated at the border crossing by authorities.\nThe meeting was also briefed on other factors responsible for creating hurdles in plugging demand and supply gap in urea sector, such as panic buying by farmers, buying by people other than farmers to sell at a premium, increased cultivation by farmers due to increased incomes in the last produce.",
  "retrievedAt": "2025-08-11T14:09:03.810Z"
}
