{
  "title": "Ministry for all out efforts to complete low-cost project in Alipur Frash",
  "link": "https://www.app.com.pk/national/ministry-for-all-out-efforts-to-complete-low-cost-project-in-alipur-frash/",
  "date_published": "2022-01-19T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):The Ministry of Housing and Works are making all out efforts to complete low-cost project in Alipur Farash, a project of the Naya Pakistan Housing Development Authority (NAPHDA).\nThe excavation work for 26 blocks has been carried out and the raft was prepared in two blocks while a steel cage for columns was developed for 16 blocks to be established under the project, an official in the Ministry of Housing and Works told APP.\nHe said that under the project a total of 2,400 flats were being constructed, out of which 400 flats were reserved for rehabilitating dwellers of Katchi Abadis (slum areas) of the federal capital.\nThe official said that currently around 1,000 workers were deployed on the project site and the number would be increased from 3,000 to 5,000 in coming days, which would not only help in completion of project in time, but will also enhance employment opportunities.\nHe said that a site laboratory was set up at the project site to test the quality of construction material, which would help not only test the material used in construction but also save time.\nThe ministry was taking various steps to facilitate low income people of the country by restarting stalled schemes, constructing new apartments worth Rs109 billion, he added.\nThe official said the ministry revived some stalled projects including Kurri Road Islamabad, Wafaqi Colony Lahore, G-10/2 Islamabad, I-16/3 Islamabad and I-12/1 Islamabad.\nThese long stalled projects have been put on track and completed by the Pakistan Housing Authority (PHA), however, the work on I/16-3 and I/12-1 projects were in progress, he added.\nRegarding the initiatives taken in Balochistan, he said Kuchlak Road Quetta project was consisted of 1,350 housing units, which was inaugurated in 2019 on the land provided by Government of Balochistan.\nThe official said the membership drive was executed and over 7,700 applications were received and automated balloting was also held successfully.\nThe PC-I has been approved from Development Working Party (DWP) and endorsed by the PHA-F’s Board of Directors.\nBidding and tendering process has been completed, he said adding that the letter of commencement to the contractors has been issued and work has also been started, he added.\nRegarding initiatives taken in Khyber Pakhtunkhwa, PHA Residencia Sorazai Project, Peshawar, he said land measuring 8500 kanal was provided by Government of KHYBR Pakhtunkhwa and in first phase, PHA-F would construct 10,000 housing units.",
  "retrievedAt": "2025-08-11T14:09:04.451Z"
}
