{
  "title": "Success of Afghan dialogue depends on Ghani & stakeholders: Afridi",
  "link": "https://www.app.com.pk/national/success-of-afghan-dialogue-depends-on-ghani-stakeholders-afridi/",
  "date_published": "2021-07-29T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):Parliamentary Committee on Kashmir Chairman Shehryar Khan Afridi on Thursday said Afghan President Ashraf Ghani and other stakeholders bore the responsibility to make the intra-Afghan dialogue process a success.\nPakistan had already done what it could do to facilitate the Afghan peace process, he said while addressing the participants of Pak-Afghan Media Conclave held under the aegis of Pak-Afghan Youth Forum at the Pakistan National Council of the Arts (PNCA).\nAfridi said Pakistan fully believed in the sovereignty of Afghanistan and not in interfering in its affairs. It did not believe in the so-called strategic depth into Afghanistan, rather it strongly believed that the Afghan people must resolve their issues themselves.\nPakistan had been fully supporting the Afghan peace process, he added.\nThe minister said it was ready to help in the capacity-building of Afghan journalists and media workers, particularly for reporting in the conflict zone.\nAfridi said Prime Minister Imran Khan had a meeting with the Afghan media delegation and what transpired in the meeting would be shared with the Afghan security team.\nHe said Pakistan had contributed hugely in the development of war-torn Afghanistan. Over 20 persons, who had born and grown up in Pakistan, were included in Ashraf Ghani’s last government, and now more than 1,000 such Afghans were playing an important role in the reconstruction of their country, he added.\nHe said most of the Afghan cricketers had also got profound training in Pakistan, while the top Pakistani cricketers, including Rashid Latif, Inzamamul Haq and others, trained the Afghan team.\nAfridi said Pakistan had the unique distinction in modern history of hosting millions of Afghan refugees for decades, and even today 3.5 million were still residing on its soil.\n“Pakistan is the only nation in the world, which had mainstreamed 68 percent Afghan refugees per the United Nations recommendations, who are living outside the camps and enjoying all facilities like the Pakistani nationals,” he added.\nHe said Prime Minister Imran Khan had allowed Pakistan’s air space for transhipment of Afghan goods to India despite its own trade blockade with the latter.\nThe minister said a peaceful Afghanistan was imperative for peace in Pakistan. However, the enemies wanted to keep the region destabilized and for the purpose, they were creating misunderstandings between the two sister states, he added.",
  "retrievedAt": "2025-08-11T21:00:53.981Z"
}
