{
  "title": "Pakistan, Bahrain agree to work for B2B interaction, finalize MoU for trade",
  "link": "https://www.app.com.pk/national/pakistan-bahrain-agree-to-work-for-b2b-interaction-finalize-mou-for-trade/",
  "date_published": "2021-07-28T20:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 28 (APP): Pakistan and Bahrain on Wednesday agreed to work together for B2B interaction between the businessmen of two countries and the finalization of Memorandum of Understanding (MoU) between the Trade Development Authority of Pakistan (TDAP) and Bahrain Tourism and Exhibition Authority.\nThis was agreed during the 2nd meeting of the Bahrain-Pakistan Joint Ministerial ommission held in Manama, the capital of Bahrain.\nThe Bahraini side was chaired by Minister of Foreign Affairs, Dr Abdullatif Bin Rashid Al Zayani, while the Pakistani side was chaired by Minister for Foreign Affairs, Makhdoom Shah Mahmood Qureshi, a press release issued by the Ministry of Foreign Affairs here said.\nFor the establishment of Joint Ministerial Commission, an agreement was signed between the two countries in 2014.\nBoth countries held fruitful discussions and agreed to work for cooperation for joint investment in industrial sector and holding expert level meetings of joint working groups in agriculture, Trade & Investment, labour and manpower, oil and gas sector and IT sector.\nThe meeting focused on bilateral cooperation in various sectors including political, economic, commerce, finance & banking, industry, public health, overseas employment, higher education, science & technology, information, culture & arts, agriculture & livestock and technical cooperation.\nDr. Al Zayani welcomed the Pakistani delegation and expressed his keen interest in furthering the deep-rooted bilateral relationship between the two countries.\nHe recalled the visit of the former Minister of Foreign Affairs, Shaikh Khalid bin Ahmed bin Mohammed Al Khalifa to Pakistan in February 2017, co-chairing the 1st Joint Ministerial Commission meeting held in Islamabad; during which a range of bilateral and regional matters of mutual interest were discussed with the Pakistani senior leadership.\nDr. Al Zayani underlined the importance of establishing an open and enabling environment for business and economic cooperation, so that the potential for development between the two countries could be fully harnessed.\nHe also highlighted the two countries’ efforts in combating the COVID-19 pandemic, from its very outset, as an outstanding example of their close and effective cooperation, noting the efficient work to repatriate citizens back in 2020, the free access to vaccination for the Pakistani expatriate community, and the ongoing care and assistance provided to Pakistanis in Bahrain.\nFor his part, Mr. Qureshi thanked the Bahraini side for the warm welcome and hospitality extended to him and his delegation. He highlighted the longstanding relations between the Kingdom of Bahrain and the Islamic Republic of Pakistan, characterized by a spirit of friendship and solidarity.\nHe further observed that the experience and expertise acquired by both countries in many spheres over time could be shared for their mutual benefit. He emphasized the need to expand economic ties between the two countries.\nThe two sides highlighted the importance of the regular meetings of established bilateral mechanisms and high-level bilateral visits, recalling the successful visit to the Kingdom of Bahrain by Imran Khan, Prime Minister of the Islamic Republic of Pakistan on 16 December 2019,  and the landmark State visit of King Hamad Bin Isa Al Khalifa to Pakistan in February 2014, which laid a strong foundation to build a close partnership between the two countries, and the visit of HRH Prince Salman bin Hamad Al Khalifa, Crown Prince and Prime Minister of the Kingdom of Bahrain to Pakistan in December 2006.\nOn the sidelines of JMC, an MoU between Bahrain Development Board (EDB) and Board of Investment of Pakistan was also signed to promote bilateral investment between the two friendly countries.\nBoth sides resolved to implement the decisions reached during the 2nd Session expeditiously and finalize at the earliest, the MoUs/Agreements under consideration.\nBoth sides agreed in principle to hold the 3rd Meeting of Pakistan-Bahrain Joint Ministerial Commission in Islamabad in 2022.",
  "retrievedAt": "2025-08-11T21:01:00.676Z"
}
