{
  "title": "Pak-China unique, robust relationship proves resilience amid challenges: COAS",
  "link": "https://www.app.com.pk/national/pak-china-unique-robust-relationship-proves-resilience-amid-challenges-coas/",
  "date_published": "2021-07-29T18:14:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 29 (APP):Chief of Army Staff (COAS) General Qamar Javed Bajwa Thursday said Pakistan China relationship was unique and robust that had proven its resilience in the face of challenges.\nThe Army Chief addressed a ceremony in connection to the 94th Anniversary of the founding of Chinese Peoples’ Liberation Army (PLA) that was commemorated at GHQ here, said an Inter Services Public Relations (ISPR) media release.\nThe Chief of Army Staff was the Chief Guest on the occasion.\nThe COAS felicitated PLA’s leadership and lauded PLA’s role in China’s defence, security and nation building while highlighting various facets of the deep rooted ties between the two states, militaries and the people.\n“In the evolving security milieu, Pakistan China partnership is becoming increasingly important for regional peace and stability,” he said.\nThe COAS said, ” our past and present testifies that we never given in to challenges.”\nPLA and Pakistan Army were brothers in arms and their relationship would continue to contribute towards safeguarding their collective interests, the COAS concluded.\nSpeaking on the occasion China’s Defence Attaché thanked the COAS for hosting a reception on the eve of PLA’s 94th Anniversary.\nRecalling Chinese President Xi Jinping’s view that Pakistan Armed Forces are the mainstay of Pak-China strategic relations, the Defence Attaché said China and Pakistan were iron brothers, all-weather friends and strategic partners.\n“No matter how the world situation changes, we will always stand together in safeguarding our national sovereignty, territorial integrity and maintaining regional peace and stability,” he said.\nAmbassador of China to Pakistan Nong Rang, Defence Attache Major General Chen Wenrong, officials from Chinese Embassy and officers from tri-services of Pakistan attended the event.",
  "retrievedAt": "2025-08-11T21:01:02.213Z"
}
