{
  "title": "PM for paying equal attention towards setting up STZs in Baluchistan, AJK",
  "link": "https://www.app.com.pk/national/pm-for-paying-equal-attention-towards-setting-up-stzs-in-baluchistan-ajk/",
  "date_published": "2021-07-29T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 29 (APP): Prime Minister Imran Khan Thursday called for paying equal attention towards setting up of Special Technology Zones (STZs) in Baluchistan and Azad Jammu and Kashmir (AJK) besides major cities that were already ahead of the curve in establishing such STZs.\nHe observed that enhanced number of STZs with all needed ecosystem will go a long way in facilitating tech businesses to thrive in the country.\nThe Prime Minster was chairing a meeting to review the progress made towards streamlining business processes especially in priority sectors including Small and Medium Enterprises (SMEs) and the establishment of STZs in the country.\nDuring review, he appreciated the progress made so far by different departments of federal and provincial governments towards improving the ease of doing business along with steps including easy and fast registration of companies and online approvals through a fast track system.\nThe Prime Minister directed the relevant authorities to expedite work on remaining identified steps in that regard.\nHe expressed satisfaction towards efforts being made to reform tax system and directed that maximum facilitation of business community be ensured.\nThe Prime Minister said that the proposal of levying a fixed tax on goods at an affordable rate may also be considered in consultation with all stakeholders besides introduction of international standards rating regime to ensure quality control.\nHe also commended the efforts of Special Technology Zones Authority (STZA) in attracting big tech companies like Huawei and Samsung along with top boot camps to start operations in Pakistan.\nIt would not only offer lot of training opportunities to talented Pakistani Information Technology (IT) professionals but would also lend them rewarding employment opportunities, the Prime Minister maintained.",
  "retrievedAt": "2025-08-11T21:01:05.769Z"
}
