{
  "title": "Bahrain desires augmented ties with Pakistan, King Hamad tells Qureshi",
  "link": "https://www.app.com.pk/global/bahrain-desires-augmented-ties-with-pakistan-king-hamad-tells-qureshi/",
  "date_published": "2021-07-29T17:04:00.000Z",
  "source": "APP",
  "content": "MANAMA, Bahrain, July 29 (APP): King Hamad Bin Isa Al Khalifa of Bahrain on Thursday underlined that Bahrain valued its historic relationship with Pakistan and desired to further augmenting the bilateral relationship for mutual benefit.\nHe also expressed appreciation for the contribution made by Pakistani expatriate community towards Bahrain’s progress and economic development.\nThe King of Bahrain expressed these view during a meeting with Foreign Minister Shah Mahmood Qureshi, who called on in Manama.\nThe Foreign Minister conveyed the warm regards of President Dr. Arif Alvi and Prime Minister Imran Khan to His Majesty, as well as best wishes for the continued progress and prosperity of the brotherly people of Bahrain. His Majesty reciprocated the sentiments.\nForeign Minister Qureshi said that Pakistan attached importance to its close relations with the Kingdom of Bahrain and remained committed to expand this relationship in all spheres of bilateral cooperation.\nHe expressed deep gratitude to the Kingdom of Bahrain for hosting a large number of Pakistani citizens, according to a press release issued by the Ministry of Foreign Affairs.\nThe Foreign Minister expressed gratitude for inviting Prime Minister Imran Khan as Guest of Honour at the National Day of Bahrain in December 2019 and decorating him with Bahrain’s prestigious award “King Hamad Order of the Renaissance”.\nThanking His Majesty for the generous gift of King Hamad Nursing University and Associated Medical Sciences Hospital in Islamabad, Foreign Minister Qureshi said that the facility would be a symbol of enduring friendship between the two countries.\nHe said that the project reflected the special and deep relations between the countries.\nThe Foreign Minister extended the invitation, on behalf of the President and Prime Minister, to His Majesty to visit Pakistan at the earliest convenience.\nPakistan and Bahrain enjoy traditionally close and fraternal ties, rooted deep in common faith and shared values.\nBilateral relations with Bahrain have been following an upward trajectory since Prime Minister Imran Khan’s visit to the Kingdom of Bahrain in December 2019, on the invitation of King Hamad bin Isa Al Khalifa.",
  "retrievedAt": "2025-08-11T21:01:05.758Z"
}
