{
  "title": "Farrukh asks Afghan media to highlight Pakistan’s commitment to ‘peaceful’ Afghanistan",
  "link": "https://www.app.com.pk/national/farrukh-asks-afghan-media-to-highlight-pakistans-commitment-to-peaceful-afghanistan/",
  "date_published": "2021-07-29T09:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):Minister of State for Information and Broadcasting Farrukh Habib Thursday called upon Afghan media to highlight Pakistan’s strong commitment and determination to ‘peaceful’ Afghanistan on other side of the Durand Line.\nAddressing the second session of Pak-Afghan Youth Forum Media Conclave, he said history could not be ignored as people of erstwhile FATA and Khyber Pakhtunkhwa enjoyed decades old family ties with Afghan people.\nHe said Pakistan had been providing shelter to a large number of Afghan refugees who were now doing businesses in Pakistan. “Even today Pakistan is accommodating around three million refugees from Afghanistan.”\nApart from medical treatment which Pakistan had been providing to scores of Afghan people every day, he also mentioned trade ties between the two countries.\nFarrukh said, he himself knew many businessmen from Afghanistan who used to come to Faisalabad to buy goods from its markets.\nThe history of two countries showed that as to how much support Pakistan had extended to Afghanistan in its socioeconomic development, he said, adding that it would not change in future.\nHe said Pakistan had also been playing critical role in the Afghan peace process to ensure stability and an inclusive government in Afghanistan after withdrawal of the US forces from there. Pakistan would continue to do its utmost for the purpose, he added.\nFarrukh said Prime Minister Imran Khan and the current government in Pakistan had strong belief and commitment to fully support the Afghan government backed by its people.\nHe said the PM had said time and again that there was no military solution to Afghan imbroglio. It was a time-tested solution so there was a need for dialogue to resolve it once and all.\nFarrukh said Pakistan was the major country which borne brunt of Afghan war in the past as it lost 70,000 lives and 150 billion dollars to the economy.\n“War is no solution anymore, let’s give peace a chance,” he said while highlighting positive role that both the countries’ media could play in reshaping their bilateral ties.\n“Peaceful Afghanistan is our priority and commitment as economic future of both the countries lies in connecting Central Asian States with us by rail and road,” he said, adding that both Afghanistan and Pakistan will reap benefits from better bilateral economic ties.\n“There is need to give serious consideration to not only those economic aspects but also to understand the ensuing socioeconomic development in Afghanistan,” he emphasized.\nHe also appreciated the organizers of conclave and termed it a positive step at such a critical time when the foreign troops were leaving the land-locked country.\nThe Ministry of Information and Broadcasting, its different forums and departments were opened for Afghan media men, he said, adding “We are ready to play our role in capacity building of Afghanistan’s media.”\nThe ministry could arrange conferences and interactions, as one arranged today, in future so that the people of Afghanistan could learn from Pakistan in various areas and vice versa.\nHe said such interaction would not only remove communication gap, but also provide opportunities to understand each other.\nFarrukh remarked that the media was considered an important pillar of a State which could not only highlight positive aspects of its country,\nbut also have potential to shape its ties with international community.",
  "retrievedAt": "2025-08-11T21:01:00.404Z"
}
