{
  "title": "Hina for prudent int’l engagement to achieve shared objectives of peaceful, stable Afghanistan",
  "link": "https://www.app.com.pk/national/hina-for-prudent-intl-engagement-to-achieve-shared-objectives-of-peaceful-stable-afghanistan/",
  "date_published": "2022-05-23T18:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): Minister of State for Foreign Affairs Hina Rabbani Khar on Monday emphasized that persistent, patient, and prudent engagement of the international community would go a long way in achieving the shared objectives of a peaceful, stable, democratic and prosperous Afghanistan.\nThe Minister of State expressed these views as she participated in an event on “Afghanistan: The Path Forward” at the World Economic Forum (WEF) Annual Meeting in Davos.\nShe highlighted that as an immediate neighbor, with a 2600 km border, Pakistan has to deal with Afghanistan with a broader lens that encompasses all dimensions – peace, security, and socio-economic development, a press release issued here by the Ministry of Foreign Affairs said.\nThe Minister of State said as a country that has constitutional provisions for women to have an equal and effective role in all institutions and walks of life, Pakistan looks towards full respect for and enjoyment of fundamental rights of women and girls, especially the right to education.\n“Pakistan is equally concerned about the devastating effects of the serious humanitarian situation and economic implosion on the lives and livelihoods of ordinary Afghans,” she added.\nThe Minister of State underlined that both the international community and the interim Afghan government need to revisit their approaches by prioritizing the interests and aspirations of the ordinary Afghans.\nThis would be essential to avoid a further exacerbation of the already dire economic situation, she maintained.\nAchim Steiner, Administrator, UN Development Programme (UNDP) also delivered remarks at the event as a panelist.\nThe attendees included representatives from the business community, civil society organizations and international media.",
  "retrievedAt": "2025-08-11T14:57:09.599Z"
}
