{
  "title": "NCHR launches fact finding report on minority rights",
  "link": "https://www.app.com.pk/national/nchr-launches-fact-finding-report-on-minority-rights/",
  "date_published": "2022-05-23T17:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): The National Commission for Human Rights (NCHR), with the support of European Union (EU)), on Monday launched its fact finding report highlighting the discrimination against minorities especially with reference to government job advertisements and the treatment of sanitary workers.\nThe report titled ‘Unequal Citizens: Ending Systemic Discrimination against Minorities’\nshows that nearly half of the posts reserved for minorities lie vacant. Even within the posts that are filled, 80 per cent of non-Muslims are employed in low paid work from BPS 01 to BPS 04, said a press release.\nIt also highlights the hazardous working conditions, insufficient safety gear and equipment, lack of job security, low compensation for cases of hurt and death and the recounting of heart breaking stories of non-Muslim sanitary workers who have faced societal ostracisation, stigma, discrimination and death in the deadly manholes that they sought to unclog.\nThe Commission in the report recommends to ensure the protection of sanitary workers ranging from replacing manual unclogging of gutters with machine unclogging, besides  fair wages, social security and healthcare for workers. It also suggests ending discrimination against minorities in the employment quota, immediate ban on practice of publishing discriminatory advertisements and ensuring public transparency in the number of minority posts filled across each basic pay scale.\nFederal Minister for Human Rights Riaz Hussain Pirzada, who was the chief guest, said discrimination against minorities was one of the foremost human rights issues that his ministry was committed to address.\n“On the basis of the letter sent by NCHR, the Ministry of Human Rights took immediate action and issued a letter to the chief secretaries of each province, directing them to ensure the protection of minority rights in line with international obligations and constitutional guarantees.”\nIslamabad High Court Chief Justice Ather Minallah, in his keynote address, said his three ideal judges from Pakistan’s judiciary were from minority. He said conferences and court judgments were not enough unless a proactive role was played by the government, civil society and media.\nHe said it was the obligation of the state to encourage, cultivate and promote diversity.  “Human rights violations occur because of the abuse of rule of law. Under the Constitution, every citizen is equal. Still we have the term ‘ordinary citizen’ commonly used.”\nHe said every year, the President of Pakistan was obligated to submit a report on the status of implementation of “Principles of Policy” of the Constitution, which ensured basic human rights. “Regrettably, this constitutional obligation has never been fulfilled by any president or the governor.”\nNCHR Chairperson Rabiya Javeri Agha briefed the participants on findings of the report.\nBesides Federal Minister for Poverty Alleviation and Social Safety Shazia Marri, Dr Shoaib Suddle,  MNA Asiya Nasir and Ashraf Mall, CEO Pakistan Partnership Initiative, also spoke on the occasion.\nThe event featured presentation of report findings, screening of a documentary on the condition of sanitary workers and panel discussion on “Ending systemic discrimination against minorities.”\nThe launch of five short films on minority rights by the NCHR in collaboration with Sharmeen Obaid Chinoy (SOS) Films was also announced.",
  "retrievedAt": "2025-08-11T14:57:09.624Z"
}
