{
  "title": "Nobody will be allowed to misuse social media: Marriyum",
  "link": "https://www.app.com.pk/national/nobody-will-be-allowed-to-misuse-social-media-marriyum/",
  "date_published": "2022-05-23T17:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Monday said the government fully believed in free expression on the social media, but nobody would be allowed to use the platform for creating anarchy, spreading fake news and character assassination of others.\nThe minister, in a meeting with a six-member delegation of TikTok led by its Regional Head of Asia Pacific Jiagen Eep here at her office, said the Constitution fully protected the rights of citizens, including freedom of expression.\nAny post which contravened the provisions of Constitution could not be allowed on the social media platforms, she added.\nMarriyum underlined the need for sensitizing the citizens on effective and appropriate use of the TikTok – an application for making and sharing short videos. The local administration of the TikTok should prefer the local language for creating awareness among the public, she added.\nThe minister urged the TikTok management to take effective measures keeping the reasons in view that led to the banning of platform in the past.\nIt was imperative to sensitize the youth on safety measures for preparation of the videos on TikTok, she noted, adding there was also a need to create awareness among the parents regarding the use of appropriate content on the platform.\nThe minister said the TikTok management might use by the Information Service Academy’s platform for awareness purposes.\nTikTok could also launch an awareness campaign in collaboration with the Pakistan Broadcasters Association, she said, assuring the platform of full support of the Information Ministry in that regard.\nShe said the young people needed to be sensitized about social and religious values vis-e-vis the social media. Awareness drives related to the health could also be promoted on TikTok so maximum people could access such content on the platform, she added.\nThe minister said a partnership would be developed with TikTok to celebrate Pakistan’s 75th Golden Jubilee which would eventually help promote patriotism among the youth.\nShe hoped that the platform would play the best possible role in guiding the youth through a partnership with the government. TikTok could also play an important role in promoting the country’s culture and values.\nThe delegation informed the minister that the anti-state and blasphemous content had never been shared on TikTok. On the occasion of Pakistan’s National Day and Pakistan Super League, millions of videos were posted on the TikTok app to promote national spirit.\nThey assured the minister of keeping the spirit continue in future and said the patriotism would be promoted among the youth in connection with the national days.\nThe delegation, comprising Regional Head APAC Outreach Kerri Woods, Head GR Pakistan Fahad Niazi, Head Public Policy Programs Zara Basharat Higgs and officials of Trust and Safety Pakistan Asma Anjum and Sania Akhtar, thanked the minister for sparing time for the meeting.",
  "retrievedAt": "2025-08-11T14:57:09.606Z"
}
