{
  "title": "PIA briefs Aviation minister on upcoming Hajj flights operation",
  "link": "https://www.app.com.pk/national/pia-briefs-aviation-minister-on-upcoming-hajj-flights-operation/",
  "date_published": "2022-05-23T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): Pakistan International Airlines (PIA) management on Monday gave a detailed briefing to Aviation Minister Khawaja Saad Rafique on the national flag carrier’s working including upcoming Hajj flight-operation, promotion of religious tourism within the country and abroad besides the expansion in the airlines’ fleet.\nThe minister directed the PIA to give special attention to the cargo sector and prepare necessary recommendations for its strengthening on a sustainable basis, according to a news release issued here.\nHe also asked the PIA authorities in renovating business-class lounges at Karachi, Lahore and Islamabad airports so that the passengers of this category could be extended maximum facilities.\nDuring the briefing, the minister was informed that the PIA’s Hajj flights operation, comprising 297 flights would start from May 31 and continue till August 13.\nThe special flights would be operated from eight major cities, including Karachi, Lahore, Islamabad, Faisalabad, Sialkot, Multan, Peshawar and Quetta, for Jeddah and Madina-ul-Munawwara.\nSaad Rafique asked to use one Boeing-777 and an Airbus-320 in the Hajj flights operation as these aircraft were standing dormant in the hangars for a long time.\nThe minister was apprised that the process of inducting four new planes (Airbus-32)0 in the PIA’s fleet had already been started, adding an airbus had reached Pakistan that was being cleared from the departments of Customs and Federal Board of Revenue, while the second would be arriving next month.\nSaad Rafique was of the view that with induction of new planes in the PIA fleet, the flight operations of the national flag carrier would get further strength besides expansion of its network.\nHe also directed PIA to start additional flights for Damascus (Syria) and Najaf (Iraq) aimed at facilitating Zaireen during ‘Arba’een’ and ‘Ashura.\nThe PIA authorities also apprised the minister that the number of flights to Baku (Azerbaijan) were being doubled to facilitate Pakistani tourists, adding the flights to Skardu, Gilgit and Chitral for promotion of tourism activities in scenic northern areas of the country.\nCurrently, the PIA management said 18 weekly flights were being operated for Skardu, 24 for Gilgit and two for Chitral, After Islamabad, these flights were being connected with other major cities like Karachi and Lahore.",
  "retrievedAt": "2025-08-11T14:57:15.771Z"
}
