{
  "title": "Elections (Amendment) Ordinance 2022 laid in NA",
  "link": "https://www.app.com.pk/national/elections-amendment-ordinance-2022-laid-in-na/",
  "date_published": "2022-05-23T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): Minister for Parliamentary Affairs Murtaza Javed Abbasi on Monday laid the Elections (Amendment) Ordinance, 2022 (Ordinance No. I of 2022) in the National Assembly as required by clause (2) of Article 89 of the Constitution of the Islamic Republic of Pakistan.\nMurtaza Javed Abbasi also introduced the bill to amend the Trade Organizations Act, 2013 [The Trade Organizations (Amendment) Bill, 2022] on behalf of Minister for Commerce Syed Naveed Qamar.\nHe also laid the bill to establish the Forensic Science Agency in the Islamabad Capital Territory (ICT) for forensic examination of documents, materials, equipment, impressions or other objects [The Islamabad Capital Territory Forensic Science Agency Bill, 2022] on behalf of Minister for Law and Justice Azam Nazeer Tarar.\nMurtaza Javed Abbasi presented 10 periodical reports of different standing committees, including that of the Standing Committee on Law and Justice on the bill further to amend the National Accountability Ordinance, 1999 [the National Accountability (Second Amendment) Bill, 2022 (XXIII OF 2021)], and laid first quarterly report of the Board of Directors of the State Bank of Pakistan on the state national economy for the quarter ending September, 2021 under section 9A(2) of the State Bank of Pakistan Act, 1956.\nMeanwhile, the House passed a bill for the establishment of the Pakistan Global Institute, which was presented by Minister for Parliamentary Affairs Murtaza Javed Abbasi on behalf of Minister for Education, Professional Training, National Heritage and Culture Rana Tanveer Hussain.\nThe legislation titled “The Pakistan Global Institute Bill, 2021” was okayed by the House with majority vote after its clause by clause reading.",
  "retrievedAt": "2025-08-11T14:57:10.919Z"
}
