{
  "article_id": "2025-08-09_f4c548e36c474ed3d1c35321c56bd9e3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/khawaja-asif-dismisses-indian-air-chiefs-claims-as-false-ill-timed/",
    "retrieved_at": "2025-08-10T10:52:48.828Z"
  },
  "metadata": {
    "title": "Khawaja Asif dismisses Indian Air Chief’s claims as false, ill-timed",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 307,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 09 (APP): Minister for Defence Khawaja Muhammad Asif while terming Indian Air Chief's comical claims of downing Pakistani aircrafts as false, ridiculous and far from truth, on Saturday clarified that the belated assertions made by the Indian Air Force chief regarding alleged destruction of Pakistani aircraft during Operation Sindoor are as implausible as they are ill-timed. Responding to the claims in a post on X, the defence minister said, \"It is also ironic how senior Indian military officers are being used as the faces of monumental failure caused by strategic shortsightedness of Indian politicians. For three months, no such claims were voiced-while Pakistan, in the immediate aftermath, presented detailed technical briefings to the international media, and independent observers recorded widespread acknowledgment of the loss of multiple Indian aircraft, including Rafales, by sources ranging from world leaders, senior Indian politicians to foreign intelligence assessments. \"Not a single Pakistani aircraft was hit or destroyed by Indian. Pakistan destroyed 6 Indian jets, S400 air defence batteries and unmanned aircraft of India while swiftly putting several Indian airbases out of action\". \"The losses on the Line of control for Indian armed forces were disproportionately heavier as well. If the truth is in question, let both sides open their aircraft inventories to independent verification-though we suspect this would lay bare the reality India seeks to obscure. Wars are not won by falsehoods but by moral authority, national resolve and professional competence,\" he said. The minister further said, \"Such comical narratives, crafted for domestic political expediency, increase the grave risks of strategic miscalculation in a nuclearised environment. As demonstrated during Operation Bunyanum Marsoos, every violation of Pakistan's sovereignty and territorial integrity will invite swift, surefire and proportionate response, and responsibility for any ensuing escalation will rest entirely with strategically blind leaders who gamble with South Asia's peace for fleeting political gains.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}