{
  "article_id": "2025-08-09_ab53a796962e5667be08f6898d1f0b3e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kheeal-das-kohistani-pledges-minority-rights-protection-highlights-pakistans-stance-on-kashmir/",
    "retrieved_at": "2025-08-10T10:51:06.852Z"
  },
  "metadata": {
    "title": "Kheeal Das Kohistani pledges minority rights protection, highlights pakistan’s stance on Kashmir",
    "author": null,
    "date_published": "2025-08-10T15:50:39+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 302,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI, Aug 09 (APP):State Minister for Religious Affairs and Inter-Faith Harmony Kheeal Das Kohistani on Saturday said Pakistan remains committed to safeguarding the rights of its minorities in line with the vision of Quaid-e-Azam Muhammad Ali Jinnah. Speaking at a Minorities Day celebration at the Federation House, Kheeal Das Kohistani said all political parties, including PTI and MQM, were invited to attend the event. He noted that while August 14 is celebrated since independence, this year's Independence Day was unique. He said the Minority Day is observed annually since 2009. \"The words of the Quaid regarding minorities were not just statements but a document, and Pakistan continues to operate on that vision,\" he said. \"The Constitution of Pakistan and Islam do not permit any form of coercion. Laws will be made and justice ensured to address the issues faced by minorities.\" Kohistani described this year's Independence Day as \"unique,\" claiming that Pakistan had not only defeated its enemy on the battlefield but also shattered its arrogance. While stressing that Pakistan had no enmity with the Indian people, he reiterated Islamabad's opposition to New Delhi's policies, particularly over Kashmir, and called for a resolution of the dispute under UN resolutions. He praised the armed forces under the leadership of COAS General Asim Munir for humbling Indian arrogance and linked the celebrations to India's setback. Kohistani alleged that Indian Prime Minister Narendra Modi's politics was in decline, and referred to the aftermath of the Pulwama incident, saying Prime Minister Shehbaz Sharif had then offered an impartial third-party investigation to identify the perpetrators, which bolstered Pakistan's international narrative. \"India's attempt to associate Islam with terrorism is shameful and only served Modi's political agenda,\" he said, adding that Pakistan acted responsibly during the tensions, avoiding harm to Indian civilians despite damage inflicted on Pakistani civilian areas.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}