{
  "article_id": "2025-05-10_7a9ff65c9a6fba912884c0a84aa78340",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nbf-holds-literary-event-adabi-rabtay/",
    "retrieved_at": "2025-08-27T15:19:17.800Z"
  },
  "metadata": {
    "title": "NBF holds literary event “Adabi Rabtay”",
    "author": null,
    "date_published": "2025-05-09T19:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 274,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 09 (APP):National Book Foundation(NBF) under the Ministry of Federal Education and Professional Training held a literary event titled \"Adabi Rabtay\" (Literary Connections). A special event was held at Ahmed Faraz Auditorium, said a press release here on Friday. The gathering featured renowned poet, educationist, and Iqbal scholar Professor Jaleel Aali; fiction writer, playwright, and poet Farheen Chaudhry; writer and literary enthusiast Saeed Akhtar Malik; and acclaimed poet and researcher Dr. Shazia Akbar. The event opened with welcoming remarks by Murad Ali Mohmand, Secretary of the National Book Foundation (NBF), who highlighted the organization's initiatives, services, and objectives. In the first segment of the program, a prose session was held where Farheen Chaudhry and Saeed Akhtar Malik each presented a selected short story from their work. Following this, a musical performance featuring traditional rubab and student participation added a cultural touch to the event. In the second half, Dr. Shazia Akbar recited a poem themed on war and peace, followed by selected ghazals that captivated the audience. Senior poet Professor Jaleel Aali presented his thought-provoking poetry addressing social issues, and later enchanted the audience with his ghazals carrying powerful national messages and intellectual depth. A discussion on literature and culture was also held. The event concluded with remarks by Dr. Kamran Jahangir, Managing Director of the National Book Foundation, who shared future plans for promoting literature and books. He thanked the participants and acknowledged their contributions to enriching the evening. He emphasized that the National Book Foundation was tirelessly working for the promotion of books and literary figures. The event was attended by writers, poets, scholars, and literary enthusiasts from Islamabad and beyond.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}