{
  "article_id": "2025-05-10_33d7789e25a9dd8d63ccd17778d2d83a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-hits-back-with-strong-cyber-military-response-under-bunyan-al-marsoos-operation/",
    "retrieved_at": "2025-08-27T15:19:24.030Z"
  },
  "metadata": {
    "title": "Pakistan hits back with strong cyber, military response under Bunyan-al-Marsoos operation",
    "author": null,
    "date_published": "2025-05-10T10:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 189,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "RAWALPINDI , May 10 (APP): Pakistan's Armed Forces have launched a strong response under Operation Bunyan-al-Marsoos (Iron Wall), targeting India through both traditional military means and cyber operations. According to security sources, Pakistani cyber teams disrupted major parts of India's digital network. Several important Indian websites were hacked, including those of the Bharatiya Janata Party (BJP), Hindustan Aeronautics Limited, Border Security Force, and the Unique Identification Authority of India. In a major cyberattack, Pakistani hackers breached the Maharashtra State Electricity Transmission Company. The attack caused power outages and wiped out meter data across the region. Sensitive data from Indian institutions such as Assam Rifles, the Department of Atomic Energy, and the Defence Production division was also leaked online. The data reportedly contains proof of India's links to terrorism and is now available on the dark web. More than 2,500 Indian surveillance cameras were also hacked, exposing serious flaws in India's internal security system. Throughout the operation, Pakistan's Armed Forces have shown bravery, advanced technical skills, and a strong will to respond to threats. The nation is united behind its military, showing readiness and strength to defeat any enemy plans.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}