{
  "article_id": "2025-05-10_53fb2dafde43bdd72996ef255a4b7a6c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-engages-political-leaders-amid-rising-tensions-with-india-hails-military-response/",
    "retrieved_at": "2025-08-27T15:19:33.565Z"
  },
  "metadata": {
    "title": "PM engages political leaders amid rising tensions with India; hails military response",
    "author": null,
    "date_published": "2025-05-10T08:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 329,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 10 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday reached out to key political leaders across the spectrum in light of the escalating tensions between Pakistan and India, following a series of hostile actions by New Delhi. In a series of telephonic conversations, the Prime Minister briefed Pakistan Peoples Party Chairman Bilawal Bhutto Zardari, PTI Chairman Barrister Gohar, Jamiat Ulema-e-Islam (F) chief Maulana Fazlur Rehman, MQM Convener Khalid Maqbool Siddiqui, Jamaat-e-Islami Ameer Hafiz Naeem ur Rehman, BAP leader Khalid Hussain Magsi, and PML-Q's Chaudhry Salik Hussain about the current security situation and Pakistan's measured yet firm response to Indian aggression, a Prime Minister's Office news release said. \"Alhamdulillah, the armed forces of Pakistan have today given a powerful and well-coordinated response to India's unprovoked aggression,\" said Prime Minister Sharif. \"India launched missile and drone attacks on Pakistan, targeting Noor Khan Airbase and other locations early this morning, killing innocent civilians.\" Despite repeated provocations, he stated, Pakistan had exercised restraint. He recalled how, after the Pahalgam incident, Pakistan had demanded an impartial investigation-an offer India rejected. However, today's fresh assaults left Pakistan with no choice but to respond decisively. PM Sharif confirmed that Pakistan's retaliatory action under *Operation Banyan al-Marsous* specifically targeted Indian military installations used in the attacks. \"Today, we have delivered a resounding reply and avenged the blood of the innocent,\" he said. \"We are proud of our armed forces.\" The Prime Minister extended congratulations to the nation and praised the armed forces for their valor and professionalism. The country's top political leaders echoed their support, applauding the military's composure and tactical expertise. They also pledged full solidarity with the government and armed forces during this critical juncture. \"The professionalism of our armed forces in defending the homeland deserves the highest praise,\" said the joint political leadership, assuring the Prime Minister of their unified backing. In return, PM Sharif expressed gratitude for their clear and unwavering support, emphasizing national unity in the face of external threats.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}