{
  "article_id": "2025-05-10_8b256ccdce9c8617a49b70b31b2b904a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistans-decisive-response-proved-military-supremacy-forced-enemy-to-retreat-cm-balochistan/",
    "retrieved_at": "2025-08-27T15:19:00.638Z"
  },
  "metadata": {
    "title": "Pakistan’s decisive response proved military supremacy, forced enemy to retreat: CM Balochistan",
    "author": null,
    "date_published": "2025-05-10T15:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 254,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA, May 10 (APP): Chief Minister of Balochistan, Mir Sarfraz Bugti, on Saturday praised Pakistan's armed forces for delivering a decisive and forceful response to Indian aggression, asserting that the counteraction not only demonstrated Pakistan's military superiority but also compelled the adversary to retreat. Sharing his remarks on the social media platform X (formerly Twitter), CM Bugti commended the professionalism and bravery of the Pakistani Armed Forces, especially the Air Force for their precision, courage, and discipline during the operation. \"Our armed forces, particularly the Pakistan Air Force, have exhibited remarkable skill and valor that is a source of immense pride and reassurance for the entire nation,\" he said. Sarfraz highlighted that the deep strikes within Indian territory were both effective and precise, surprising the enemy and ultimately pushing them to seek foreign mediation for a ceasefire. \"This swift and powerful reaction is a clear message to the world that Pakistan is fully capable of delivering an immediate and effective response to any hostile action,\" he emphasized. CM Bugti extended congratulations to Pakistan's civil and military leadership, armed forces and the nation on a significant achievement. He noted that the unified resolve displayed by the people of Pakistan stands as a testament to their unwavering commitment to the homeland. He also paid tribute to the soldiers and civilians who sacrificed their lives in defense of the country. \"The sacrifices of our martyrs will always be remembered. It is because of them that Pakistan continues to rise as a strong and sovereign nation,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}