{
  "title": "PM appeals to nation to donate for relief, rehabilitation of flood-stricken countrymen",
  "link": "https://www.app.com.pk/national/pm-appeals-nation-to-donate-for-relief-rehabilitation-of-flood-stricken-people/",
  "date_published": "2022-08-23T06:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): Prime Minister Shehbaz Sharif on Tuesday appealed to the nation to donate for supporting the relief and rehabilitation of the people and infrastructure in flood-hit areas where hundreds have been killed and thousands rendered homeless.\nHe said the government was distributing Rs 37.2 billion as cash relief among the flood-stricken people. Rs 5 billion have immediately been released to the National Disaster Management Authority (NDMA) to accelerate the rescue, relief and rehabilitation efforts.\nHe said Rs 25,000 cash assistance was being paid to the flood victims in addition to the compensation of Rs1 million for the family of the deceased, and additional support for the injured people and damages to the houses.\n“All this requires Rs 80 billion. It also requires hundreds of billions of rupees to overcome the losses as well as for rehabilitation of the victims,” he added.\nThe prime minister said the provincial governments were working round the clock in collaboration with the federal government and armed forces.\nHe said the country had received unprecedented rains this year breaking the 30-year average rainfall record, particularly in Sindh and Balochistan which caused flashfloods to kill hundreds of people.\nConveying his prayers for those injured in the calamity, the prime minister said the flash floods had left a huge number of people homeless besides causing losses to livestock, crops, orchards and other properties.\nThe prime minister said the government was carrying out relief and rehabilitation works with utmost responsibility and honesty. The helicopters had been provided for relief operations in the areas where roads and bridges had been destroyed.\nThe prime minister also paid tribute to the Pakistan Army officers who were martyred in a helicopter crash in Balochistan during the flood relief operation.\nHe recalled that the Pakistani people and the institutions had set an example by showing the passion to sacrifice following the deadly earthquake of 2005 and disastrous flash floods in 2010. He said the rehabilitation of the flood-stricken people could be expedited if the whole nation showed the same spirit to support their countrymen.\n“Our nation is ahead of all in the world when it comes to the passion to sacrifice. I appeal to you all to support,” the prime minister said.\nHe urged the people to donate to the flood relief fund wholeheartedly, reviving the spirit of the sacrifice shown by the Ansar-e-Madina out of the love for the Holy Prophet (Peace Be Upon Him).",
  "retrievedAt": "2025-08-11T15:27:02.351Z"
}
