{
  "title": "IHC serves show cause notice to Imran Khan, summons him in contempt case on Aug 31",
  "link": "https://www.app.com.pk/national/ihc-serves-show-cause-notice-to-imran-khan-summons-him-in-contempt-case-on-aug-31/",
  "date_published": "2022-08-23T14:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): A larger bench of the Islamabad High Court (IHC) on Tuesday issued a show-cause notice to Pakistan Tehreek e Insaf (PTI) Chairman Imran Khan and summoned him in person on August 31, in a contempt of court case pertaining to his threatening remarks about Additional Sessions Judge Zeba Chaudhry.\nThe bench comprising Justice Mohsin Akhter Kayani, Justice Miangul Hassan Aurangzeb and Justice Babar Sattar also summoned Attorney General for Pakistan (AGP) for assistance and sent the case file to Acting Chief Justice Aamer Farooq recommending addition of more judges in the bench.\nDuring the course of proceedings, Advocate General Islamabad Barrister Jahangir Jadoon informed the court that he had filed a miscellaneous application to bring the relevant material on record. He also wanted to submit the record of previous anti-judiciary speeches and statements of Imran Khan, including video clips, he added.\nHe sought the court’s permission to bring Imran’s statements about the judiciary and other institutions on electronic and digital media, on record, and also play the same in the courtroom through a USB or other digital resources.\nBarrister Jadoon said Imran Khan had a given threatening statement about the woman judge during his speech at a rally in F-9 Park Islamabad on August 20.\nThe female judge was hearing a case regarding the remand of the PTI chief’s aide Shahbaz Gill, he said, adding Imran Khan had repeatedly had been making such remarks against the Election Commission of Pakistan (ECP) and the judiciary.\nHe (Imran) was creating hurdles in way of justice, he added.\nJustice Kayani remarked how someone could comment on sub-judice matters, as even the courts could not interfere into the investigation process.\nThreatening a woman judge was an unfortunate act, he said, adding the whole judicial system could not function if such attitude against the judges working across the country were adopted.\nJustice Kayani remarked that anyone would deliver speeches against courts if an order was passed against them. Whether they wanted the people to pass judgments by themselves, he asked.\nThe bench said it was not expecting such statements from a former prime minister. Even at the moment when the court were hearing the case it was being defamed, it added.\nThe court said it was ready to provide extra security to the woman judge concerned. Barrister Jadoon said it was necessary to provide security to the female judge after the PTI chief’s threatening remarks.\nThe court asked whether it should first hear Imran Khan or serve him a show-cause notice directly. At this, the advocate general said apparently in the situation a direct show-cause notice should be issued.\nJustice Kayani observed it was a serious mater and it was not limited to the lower courts of Islamabad as even the civil bureaucracy and police high-ups were being threatened.\nHe further observed that certain people had a grip on the whole system, and would start hurling threats if they lost their government.\nThe court then served a show-cause notice to Imran Khan and summoned him on August 31, and also sought the transcript his speech.\nThe IHC judges after consultation on Monday decided to initiate the contempt of court proceedings against Imran Khan on his objectionable remarks about the woman judge.\nImran Khan in his speech had threatened that cases would be prepared against the Inspector General of Police and Deputy Inspector General Islamabad for allegedly torturing Shahbaz Gill. He also named Judicial Magistrate Zeba Chaudhry and said an action would also be taken against her.",
  "retrievedAt": "2025-08-11T15:26:59.015Z"
}
