{
  "title": "Islamabad Police register another case against Imran Khan",
  "link": "https://www.app.com.pk/national/islamabad-police-register-another-case-against-imran-khan/",
  "date_published": "2022-08-23T18:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): Islamabad Police have registered another case against Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan and other top party leaders for violating Section 144 in the Federal Capital.\nThe PTI held a rally on August 20 in the capital to protest the arrest of Shahbaz Gill despite ban on public gatherings exceeding four persons under Section 144.\nThe first information report (FIR) was lodged by the Aabpara Police Station on August 22 under section 109 (punishment of abetment if the act abetted committed in consequence and where no express provision is made for its punishment), 188 (disobedience to order duly promulgated by public servant), 186 (obstructing public servant in discharge of public functions), 341 (punishment for wrongful restraint), and 506 (punishment for criminal intimidation) of the Pakistan Penal Code.\nThe complaint, filed by Assistant Sub Inspector (ASI) Muhammad Anwar, also included Section 2 (restriction on the use of loudspeakers) of the Control of Loudspeaker and Sound Amplifiers Act, 1965.\nMurad Saeed, Faisal Javed Khan, Sheikh Rashid Ahmed, Asad Umar, Raja Khurram Nawaz, Ali Nawaz Awan, Faisal Vawda, Shahzad Wasim, Sadaqat Ali Abbasi, Shibli Faraz, Fawad Chaudhry, Saifullah Khan Niazi, Shehryar Afridi, Fayyazul Hasan Chohan, Firdous Shamim Naqvi, Asad Qaiser, Zaheer Abbas Khokar and  Ghulam Sarwar are the other PTI leaders nominated in the FIR.\nAccording to the complaint, approximately 1,000 to 1,200 PTI supporters had gathered near Islamabad’s Zero Point Interchange on call of Imran Khan and carried the party’s flags.\n“They were chanting slogans demanding Shahbaz Gill’s release,” the ASI said, alleging that they “scared and threatened” the residents by blocking the road.\nHe stated that commuters were stopped from passing through the area, which disrupted their daily activities. The rally’s participants, while using loudspeakers, chanted anti-government slogans.\nThe FIR added that during the rally, the Islamabad Police made announcements via loudspeakers that Section 144 had been imposed in the city and a ban had been imposed on rallies.\nHowever, the PTI leaders turned a deaf ear to the police and led the supporters to the F-9 Park, all the while sloganeering on loudspeakers, it said.\nLast week, Imran Khan was booked under Section 7 of the Anti-Terrorism Act (punishment for acts of terrorism) regarding his threatening comments against a female judge and police high-ups during a rally in Islamabad.\nThe FIR argued that Imran’s speech was meant to terrorize the top police officials and the judiciary so they could not perform their functions and abstain from pursuing any action against any PTI individual(s) if required to do so.",
  "retrievedAt": "2025-08-11T15:26:56.209Z"
}
