{
  "title": "Denying Yasin right to appearance in court, lying on Mirwais’ house arrest shameful: Mushaal",
  "link": "https://www.app.com.pk/national/denying-yasin-right-to-appearance-in-court-lying-on-mirwais-house-arrest-shameful-mushaal/",
  "date_published": "2022-08-23T15:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): Peace and Culture Organisation (PCO) Chairperson Mushaal Hussein Mullick on Tuesday lashed out at Hindutva regime for constant denial of the fundamental right to Yasin Malik to appear physically in courts, and lying on the house arrest of Mirwais Umar Farooq.\nThe spouse of Yasin Malik, in a statement, said Narendra Modi-led fascist India was so scared of the ‘lion of Kashmir’ that they denied him of his fundamental right to appear physically in courts.\nShe said Jammu and Kashmir Liberation Front (JKLF) Chairman Yasin Malik demanded physical appearance during the hearing in a case registered against him in a Jammu court about the killing of four Indian Air Force (IAF) personnel in 1990.\nHowever, she said, coward Indian kangaroo courts refused to entertain his legal, constitutional and fundamental rights, which was shameful and condemnable.\nTalking about Hurriyat Leader Mirwaiz Umer Farooq, Mushaal said fascist Modi government just got caught lying red handed to the media that the senior Hurriyat leader was not house arrested and was a free man.\n“What a nasty joke as the media exposed the dirty face of the notorious regime that kept the senior Kashmiri leader in detention.”\nShe went on to say that the Indian brutal forces used all inhuman and fascist acts to silence the dissenting voices.\nHowever, Mushaal made it clear that the Kashmir freedom movement entered into a defining moment, hence nothing could dampen the courage of brave Kashmiris. “They would take the freedom struggle to its logical end.”\nShe also lamented the double-standard of the world and human rights organizations which observed criminal silence over the world’s worst human rights violations in the Indian Illegally Occupied Jammu and Kashmir.",
  "retrievedAt": "2025-08-11T15:26:58.964Z"
}
