{
  "title": "Medicines worth over Rs 15 million being dispatched to flood hit areas, says Patel",
  "link": "https://www.app.com.pk/national/medicines-worth-over-rs-15-million-being-dispatched-to-flood-hit-areas-says-patel/",
  "date_published": "2022-08-23T11:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): Minister for National Health Services, Regulation and Coordination Abdul Qadir Patel on Tuesday said that the necessary medicines valuing over Rs 15 million, and other relief items including 0.6 million medicated mosquito nets were being dispatched to flood hit areas of Sindh, Balochistan and Punjab within the next few days.\nTalking to media persons, he said his ministry was making extraneous efforts to help flood hit people in distress.\nGiving details of the relief work he said: “A 12-member team of doctors has already been sent to the worst hit Lasbela district. Some 30,000 vaccines, a truck carrying medicines worth Rs 100,000 has already been sent to flood hit areas.\nA contingent of 200,000 vaccines was also being sent to the affected areas. The ministry has already dispatched 36,000 medicated mosquito nets. Over 1.4 million more medicated mosquito nets would soon be dispatched to flood hit areas.”\nHe said anti-venom serum was ready for immediate delivery to any flooded areas that might be in need. He said a donor conference had also been arranged on Wednesday for helping flood hit people as the government did not have enough resources to rehabilitate the destroyed infrastructure. He said Lasbela district was among the worst hit areas as its infrastructure had completely been destroyed.\nHe said the federal government would serve the flood hit people without any discrimination.\nHe further said Punjab had sought help for the flood hit people of Rajanpur and Dera Ghazi Khan and federal government would respond soon. He also added that he would visit Thatta this week for distributing relief items among the flood hit people.\nHe said the Health ministry had appointed two coordinators to have liaison and promptly convey the needs of flood hit people of Balochistan and Sindh.",
  "retrievedAt": "2025-08-11T15:27:01.040Z"
}
