{
  "title": "PM for effective Pakistan-Qatar engagement to boost trade, investment relations",
  "link": "https://www.app.com.pk/national/pm-for-effective-pakistan-qatar-engagement-to-boost-trade-investment-relations/",
  "date_published": "2022-08-23T16:26:00.000Z",
  "source": "APP",
  "content": "DOHA, Qatar, Aug 23 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday terming Qatar as a “reliable friend” of Pakistan called for effective bilateral engagement to boost trade and investment ties according to their true capacity and potential.\nAddressing Pakistan-Qatar Trade and Investment Roundtable 2022 here, he appreciated Qatar for supporting Pakistan during this era of extreme inflationary trends worldwide and the economic tightness “beyond our imagination”.\nThe Prime Minister termed the panel discussion during the trade and investment roundtable as very productive and informative, which he added gave them a way forward for the friendly countries of Pakistan and Qatar, enjoying decades’ old fraternal relations based on mutual trust, respect and support.\nHe said Pakistan offered huge opportunities of investment in the areas of agriculture, solar energy, renewable energy and Information Technology (IT).\nThe Prime Minister said that the present government took over at a time when Pakistan was facing huge challenges of hovering economy, trade deficit and huge pressure on resources.\nThe only way forward to cut imports including that of the fuel imports was to boost the country’s exports through increased industrial production and moving towards renewable energies, he added.\nHighlighting the country’s huge hydropower potential, the Prime Minister said Pakistan offered foreign investment especially to the Qatari investors to benefit from investing hydropower generation for immediate profits.\nLauding Qatar for its mediatory role in Afghanistan, he said that Qatar had established its credibility to promote peace, tranquility and harmony not only in Afghanistan but in the region.\nThe Prime Minister said that Pakistan and Qatar should synergize their efforts in the area of trade and investment.\nThe Prime Minister highlighted his government’s firm commitment to providing a friendly environment for business and investments in the country.\nHe stressed that Pakistan was blessed with immense natural and human resources and that Pakistan’s geographical location enabled it to become the region’s premier trade, energy and transport corridor.\nThis unique advantage made Pakistan a market full of promise and opportunities, the Prime Minister said.\nHe underscored that, having a large consumer market with an ever-expanding middle class, Pakistan offered attractive business opportunities for investors in the fields of food security, energy including renewables, agriculture and livestock, information technology, hospitality and tourism sectors.\nThe Prime Minister assured of the government’s full support to Qatari investors in deepening their footprint in Pakistan.\nHe appreciated the efforts of the organizers in arranging the Roundtable with Pakistani and Qatari businessmen.\nEarlier, the Ambassador of Pakistan to Qatar, in his welcome address, expressed the confidence that the visit of the Prime Minister would lead to substantial enhancement of bilateral trade, investment and economic ties.\nThe Qatar Financial Centre (QFC), the Pakistan Business Council Qatar, and the Embassy of Pakistan in Doha jointly organized the Roundtable.\nAli bin Ahmed Al Kuwari, Finance Minister of Qatar; Sultan Bin Rashid, Undersecretary Ministry of Commerce and Industry of Qatar; and Yousaf Al Khater Jaida, CEO, Qatar Financial Canter also participated in the event.\nA large number of leading Qatari business and corporate executives as well as Qatar-based Pakistani business community in Doha also attended.\nDuring the Roundtable, a distinguished panel discussed the enhancement of bilateral trade and economic relations.\nThe Panel discussion mainly focused on exploring new areas of cooperation to forge stronger business-to-business linkages.\nThe panelists included Syed Naveed Qamar, Minister of Commerce; Ms. Hina Rabbani Khar, Minister of State for Foreign Affairs; Ms. Alanoud bin Hamad Al Thani, Chief Business Officer of QFC; Mohsin Mujtaba, Honorary Investment Counsellor; and Dr. Javaid Iqbal, President of Pakistan Business Council.",
  "retrievedAt": "2025-08-11T15:26:56.992Z"
}
