{
  "title": "Construction of new water reservoirs top priority of govt: Faisal Vawda",
  "link": "https://www.app.com.pk/national/construction-of-new-water-reservoirs-top-priority-of-govt-faisal-vawda/",
  "date_published": "2020-01-01T21:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 2 (APP):Minister for Water Resources Faisal Vawda has said that building water reservoirs and ensuring availability of water is the top most priority of the government.\nChairing a meeting to review progress of water sector development projects here Thursday, the minister said that currently Ministry of Water Resources has 61 ongoing water related projects, while 51 new projects have been included in water sector development portfolio.\n“Keeping in view the water situation in Balochistan, 34 out of 51 new projects are proposed for the province” he added.\n“Water projects inaugurated for the sake of optics are pending since last thirty years adding burden to the national exchequer,” he said. “Let us pledge not to inaugurate projects without funds availability and a defined timeline for completion” he added.\nThe meeting was also attended by Secretary Water Resources Muhammad Ashraf, senior officials from Federal, provincial governments and WAPDA, said a press release.\nVawda said that under existing scenario, the importance of building reservoirs in the country could not be ignored. Keeping in view the current water situation, it would be prudent to give weightage to the opinion of the professionals if we were truly committed to overcoming the issue of looming water crisis in the country.\n“We believe in building consensus of all stakeholders on the matter. I urge all provincial representatives to assist us in prioritizing the projects vis-à-vis availability of funds and their long term impact on the water availability for the country,” he said.\nHe also said that because of the lack of funds and planning various projects have been pending more than 3 decades “Delay in construction of such projects has resulted in cost escalation, loss of time and water scarcity” he added.\nThe Minister was briefed about completion of seven water related projects in current financial year (2019-20) including RBOD-I & III and six dams in Balochistan province.\n“RBOD I & III will help 2.5 million acres of land in Sindh and Balochistan to overcome the issues of water logging and salinity”.",
  "retrievedAt": "2025-08-11T18:33:47.777Z"
}
