{
  "title": "PM seeks civil servants’ support in realization of 2020 as year of growth, development",
  "link": "https://www.app.com.pk/national/pm-seeks-civil-servants-support-in-realization-of-2020-as-year-of-growth-development/",
  "date_published": "2020-01-02T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 2 (APP):Describing the promulgation of NAB Amendment Ordinance as a “tough decision”, aimed at protecting bureaucracy and businessmen from the unnecessary pressures, Prime Minister Imran Khan Thursday sought the support of civil servants in the realization of 2020 as the year of growth and development.\n“As we have to lift the country in the year 2020, I need your support in this respect,” he said while addressing a gathering of senior civil servants and bureaucrats here at the Prime Minister House.\nThe prime minister said that his government never asked bureaucracy to take any illegal decision rather insulated it as against the past.\nHe said the improvement of governance system was inevitable to bring in stability.Wealth creation would be possible if the industries were allowed to flourish.\nImran Khan said the National Accountability Bureau (NAB) was meant to take action against the public office holders for misusing the office while the business community had nothing to do with the public offices.\nHe said those, who were criticizing the NAB Amendment Ordinance, should first understand NAB’s mandate.\nThe prime minister said fearing NAB, the bureaucracy was frightened to take decisions as the procedures involved risks and they had been facing unnecessary pressure from the Bureau.\nIn order to achieve the target of 5 million houses, he said, the government expected cooperation from the bureaucracy. The present government’s ambitious housing programme would boost the 40 allied industries, create job opportunities and stimulate economic activity in the country, he added.\nHe said the bureaucracy as well as the business community needed protection from NAB’s pressure.\nThe prime minister told the gathering that the business community did not fall under NAB for not holding public offices as the tax cases were related to the Federal Board of Revenue.\nHe said 2019 was a tough year for the government during which they focused on stabilization of economy through various macroeconomic measures which led to strengthening of rupee, restoration of investors’ confidence and improvement in the stock market – vital for running the wheels of economy.\nThe prime minister also spoke of the bad economic situation his government inherited and said the country’s debt was increased from Rs 6 trillion to Rs 30 trillion during 2008 to 2018 by the previous governments. Half of the country’s revenue was used for debt-servicing alone, he added.\nHighlighting the importance of improved governance system, Imran Khan said he expected the bureaucracy to achieve the standards and reputation of 1960s.\nHe described nine million Pakistani expatriates as asset for the country and pointed out that many among them, who were investors and small and media entrepreneurs, did not invest in their homeland – which offered a lot of opportunities – due to the impediments of poor governance system and opted for other destinations.\nThe prime minister said after stabilizing economy in 2019, the government would now focus on growth and development in 2020, and also beat inflation and unemployment by boosting industrial and agricultural development.\nEarlier, Advisor to the Prime Minister on Establishment Muhammad Shehzad Arbab, in his welcome remarks, said after the promulgation of NAB Amendment Ordinance, the government was also working on other areas of concern for the bureaucracy, including their capacity building and training; tenure protection and compensation package.",
  "retrievedAt": "2025-08-11T18:33:41.783Z"
}
