{
  "title": "Govt taking measures for promotion of higher education: Ch Sarwar",
  "link": "https://www.app.com.pk/national/govt-taking-measures-for-promotion-of-higher-education-ch-sarwar/",
  "date_published": "2020-01-01T23:49:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 02 (APP):Governor Punjab Chaudhry Mohammad Sarwar has said that the incumbent government is taking far-reaching measures for promotion of higher education as it is vital for development of the country.\nHe said this while addressing the 18th Convocation of the University of Management and Technology (UMT), here on Thursday. He said it was necessary to serve humanity, adding that merely wealth and power do not guarantee successful life.\nThe Governor said that hard work and giving respect to elders, especially parents, was necessary to achieve success in life. He said that the 21st century had changed the dynamics of education, adding that education had become a tool for nation-building. He said, “After graduation, students enter a phase of life which requires strong sense of responsibility.”\nCh Muhammad Sarwar congratulated students over completing their degrees and hoped that they would face challenges of practical life with strength. He said that students should give respect to teachers because they play a role in their achievements in life, like their parents. He advised the students to be courageous and always remain steadfast in achieving desired goals.\nThe Governor said, “Be a proud Muslim and never forget your culture.”\nHe said that with the grace of Allah Almighty, he became the first Muslim member in British Parliament and took oath on the Holy Quran. He said, “We need to develop international connections.” Pakistan had given a lot of sacrifices in the war against terrorism, he added.\nCh Sarwar said law and order situation had improved in the country and investment was coming into the country besides tourists. He said in Pakistan minorities enjoy equal rights, adding that we were following the mission of Quaid-i-Azam Muhammad Ali Jinnah in a real sense.\nHe said that the Citizenship Amendment Act in India was discriminatory against one religion. He said, “I pay tribute to the people of Kashmir and Muslims living in India, who had rejected to accept the Act.” He said Pakistan wanted peace, but if India showed any aggression, they would be given a strong reply. He said that entire Pakistani nation was with the people of held Kashmir in their just cause of freedom.\nThe Governor also paid tribute to the late Dr Hassan Shoaib Murad. He also welcomed Abdul Rehman bin Muhammad from Saudi Arabia, adding that Saudi Arabia had always stood with Pakistan in difficult times.\nFederal Minister for Privatization Mohammad Mian Soomro said, “It is the age of technology and students must acquire the best education to face all types of challenges in life.”\nUMT Rector Dr Muhammad Aslam and others were also present.\nLater, the Governor and the federal minister distributed medals and degrees among students.\nSouvenirs were also presented to Chaudhry Mohammad Sarwar and Mohammad Mian Soomro.",
  "retrievedAt": "2025-08-11T18:33:45.496Z"
}
