{
  "title": "UK expanding its fleet of submarines to boost ‘warfighting readiness’ - World - DAWN.COM",
  "author": null,
  "content": "LONDON: Britain will expand its nuclear-powered attack submarine fleet as part of a defence review to be published on Monday that is designed to prepare the country to fight a modern war and counter the threat from Russia.\n\nPrime Minister Keir Starmer, like other European leaders, is racing to rebuild the UK’s military capabilities after US President Donald Trump told the continent it needed to take more responsibility for its own security.\n\nMonday’s Strategic Defence Re­­view will call for Britain’s armed forces to move to a state of “war­fi­g­­hting readiness” and reverse its post-Cold War military decline. “The moment has arrived to transform how we defend ourselves,” St­­armer told workers at BAE Sys­t­e­­ms’ Govan shipbuilding site in Scot­land, saying he would “end the hollowing out of our armed forces.”\n\n“When we are being directly threatened by states with advanced military forces, the most effective way to deter them is to be ready.” Despite cuts to the military budget in recent years, Britain still ranks alongside France as one of Europe’s leading military powers, with its army helping to protect Nato’s eastern flank and its navy maintaining a presence in the Indo-Pacific.\n\nWith 70,860 full-time trained soldiers, the army is at its smallest since the Napoleonic era\n\nBut the army, with 70,860 full-time trained soldiers, is the smallest since the Napoleonic era and the government has said it must rebuild given the growing strategic threats.\n\nElected last July, Starmer has already cut the aid budget to fund an increase in defence spending to 2.5pc of GDP by 2027, from 2.3pc, with an ambition to get to 3% over the longer term.\n\nStarmer has sought to cast the higher defence spending as a way to create jobs and wealth, as he juggles severely strained public finan­ces, a slow-growing economy and declining popularity among an inc­reasingly dissatisfied electorate.\n\nThe authors of the defence review, led by the former Nato boss, George Robertson, and a former Russia adviser to the White House, Fiona Hill, said the higher spending had enabled them to set out a 10-year military programme.\n\nRecommendations\n\nAmong the report’s 62 recommendations that will be accepted by government, Britain will build at least six new munitions plants, procure up to 7,000 British-made long-range weapons, and launch new communication systems for the battlefield.\n\nA Cyber and Electromagnetic Command will lead defensive and offensive cyber capabilities, after UK military networks faced more than 90,000 “sub-threshold” attacks in the last two years.\n\nBritain will also build up to 12 of its next-generation attack submarines — which are nuclear-powered but carry conventional non-nuclear weapons — to replace the current fleet of seven from the late 2030s, developed by the UK, US and Australia, under a security partnership known as AUKUS.\n\nBritain also put a price for the first time on the replacement of the nuclear warheads on a separate fleet of submarines, with the pre-existing programme set to cost 15 billion pounds before the next election due in 2029.\n\nPublished in Dawn, June 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:25:16.852Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915092/uk-expanding-its-fleet-of-submarines-to-boost-warfighting-readiness",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T02:26:44.000Z"
}
