{
  "title": "Bangladesh launches fresh reform bid - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Bangladesh’s caretaker government launched a fresh bid on Monday to seek agreement between rival political parties on critical democratic reforms after a mass uprising last year.\n\nThe South Asian nation of around 170 million people has been in political turmoil since former prime minister Sheikh Hasina was ousted by a student-led revolt in August 2024, ending her iron-fisted rule of 15 years.\n\nThe National Consensus Commission is headed by Muhammad Yunus, the 84-year-old Nobel Peace Prize winner who is leading the caretaker government as its chief adviser until elections are held.\n\n“Let’s not miss this opportunity”, Yunus said in a speech at the opening as a second round of meetings began. “The remaining differences can be narrowed”. Last month the consensus commission said political parties had failed to reach agreement.\n\nYunus has previously said he inherited a “completely broken down” system of public administration, and said it required a comprehensive overhaul to prevent a future return to authoritarian rule. He set up six commissions to do that work, overseen by the consensus commission, which he heads.\n\nOn May 26, Ali Riaz, the commission’s vice president, said that despite marathon efforts — stretching over 45 sessions with 38 political parties and alliances — they had not reached a deal in the first round. Several political parties, especially the powerful Bangladesh Nationalist Party (BNP) have demanded an election date be set.\n\nSalahuddin Ahmed, a senior BNP leader, last week said there was growing impatience at the pace of progress made by the reform commission. “How many times do they want to stage the drama of reforms?” he said. “A first launch, followed by a second… This is nothing but dancing with bananas”.\n\nPublished in Dawn, June 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683e2aae0ba67.jpg",
  "retrievedAt": "2025-10-12T03:24:26.105Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915094/bangladesh-launches-fresh-reform-bid",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T02:26:44.000Z"
}
