{
  "title": "MCI restrained from hiking property tax till LG polls - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) has restrained the Metropolitan Corporation Islamabad (MCI) from increasing property taxes until the local government elections are conducted.\n\nThe direction was issued by Justice Mohsin Akhtar Kayani while hearing petitions concerning the delay in the local government elections and the scope of municipal authority in Islamabad.\n\nBarrister Umar Ijaz Gilani and others appeared on behalf of the petitioners.\n\nRepresentatives from the Election Commission of Pakistan (ECP), Capital Development Authority (CDA), MCI as well as the additional and assistant attorneys general were present during the proceedings.\n\nThe additional attorney general informed the court that the proposed Islamabad Local Government Election Commission Act 2025 was currently under review by a parliamentary standing committee and will be forwarded to the National Assembly for further debate and approval.\n\nThe ECP submitted a report outlining a 120-day timeline for holding local government elections in Islamabad, noting that the process was more complex than general elections due to the variety of nomination papers required.\n\nJustice Kayani questioned the additional attorney general on the urgency of the proposed legislative amendments, drawing a comparison with the swift implementation of the 26th constitutional amendment. The official responded that the upcoming amendment would also be enacted promptly.\n\nThe petitioners argued that without an elected local government in place, MCI lacked the authority to impose or increase property taxes.\n\nJustice Kayani concurred, stating that the old property tax rates will remain in force until a new local government is elected.\n\nThe court adjourned the hearing till September 24.\n\nPublished in Dawn, June 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/03/261132544f1ac57.jpg?r=113350",
  "retrievedAt": "2025-08-18T03:08:45.804Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915052/mci-restrained-from-hiking-property-tax-till-lg-polls",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T02:27:14.000Z"
}
