{
  "title": "Fertiliser companies fined Rs375m for ‘anti-competitive conduct’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Competition Commission of Pakistan (CCP) on Tuesday imposed fines of Rs375 million on fertiliser companies for “anti-competitive conduct”.\n\n“The Competition Commission of Pakistan has taken decisive action against anti-competitive conduct in the fertiliser sector, imposing a penalty of Rs50 million on each of the six major urea manufacturers,” said a press release by the CCP.\n\nIt added that it also penalised a leading industry association Rs75m, totalling Rs375m in fines.\n\nThe CCP said that following a detailed inquiry-initiated suo motu, the Commission’s bench comprising Dr Kabir Ahmed Sidhu and Mr Salam Amin determined that six urea manufacturing companies — Fatima Fertiliser Limited, Fauji Fertiliser Company Limited, Fauji Fertiliser Bin Qasim Limited, Fatima Fertiliser Company Limited, Engro Fertiliser Company Limited and Agritech Limited — in coordination with their trade association, Fertiliser Manufacturers of Pakistan Advisory Council (FMPAC), were involved in anti-competitive conduct.\n\n“Under the guise of conducting an awareness campaign/advertisement, [they] have effectively fixed the price of urea across the country. Such conduct goes beyond the bounds of lawful information dissemination and enters into the realm of anti-competitive behaviour in violation of Section 4 of the Competition Act, 2010,” the press release said.\n\nDespite claiming price independence, the manufacturers failed to justify their synchronised pricing strategy. The Commission’s “investigation uncovered that the conduct not only distorted competition but also harmed farmers across Pakistan, especially during the critical Rabi and Kharif seasons, by artificially influencing fertiliser prices and limiting market choice”.\n\n“The respondents’ attempt to claim protection under the ‘state action doctrine’ was also rejected. The bench held that no formal government directive or compulsion existed to justify their collusive behaviour,” the statement said.\n\nThe CCP osberbed that the respondents took advantage of a federal government direction regarding initiating an awareness campaign encouraging farmers regarding urea price and used it as a tool to fix the price in due coordination among themselves and jointly announced the uniform price for the urea consumers.\n\nThe bench also held that such “actions, under the pretext of complying with government instructions, effectively undermined market forces and distorted competitive pricing mechanisms”.\n\nIt was also noted with great concern that all respondents were charging an identical price for the size of a urea bag bag — Rs1,768, despite significant variations in input costs, different economies of scale, size of the market, different prices of gas, etc.\n\nThe bench further observed that “in a market where each undertaking’s production capacity and market share are matters of common knowledge, such a coordinated disclosure cannot be viewed as incidental or competitively benign. Rather, the joint announcement constitutes an overt manifestation of concerted conduct”, according to the press release.\n\nMoreover, repeated directions from the Fertiliser Review Committee were given to the respondents to address their failure to manage supply imbalances.\n\nPreviously as well, warnings were issued by the Commission to the fertiliser Manufacturers and FMPAC in the years 2010, 2012 and 2014; however, they failed to produce any lasting change, according to the CCP.\n\nThe chairman reiterated the commission’s message that associations across the country should not provide a platform for sharing price-sensitive information or the exchange of views on prices.\n\nLast month, in a significant move to curb deceptive marketing practices, the CCP had imposed a hefty fine on a housing society for false and misleading advertisements.\n\nThrough a cautionary notice, the CCP had also warned undertakings of financial penalties of up to Rs75 million or 10 per cent of annual turnover if they enter into prohibited agreements without seeking prior exemption.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:08:28.256Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915182/fertiliser-companies-fined-rs375m-for-anti-competitive-conduct",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T09:52:40.000Z"
}
