{
  "title": "Faisalabad suspect held for 17-year-old social media influencer’s Islamabad murder over ‘repeated rejections’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Islamabad Police said on Tuesday they had arrested the main suspect in the murder case of 17-year-old social media influencer Sana Yousaf, a day after she was shot dead in her house.\n\nA first information report (FIR) had been filed yesterday evening at the Sumbal police station against an unidentified man on the complaint of Sana’s mother, Farzana Yousaf, invoking Section 302 (intentional murder) of the Pakistan Penal Code (PPC).\n\nThe teenager was well-known for her social media activities, with nearly 800,000 followers on her TikTok account and almost 500,000 on her Instagram account.\n\nAddressing a press conference, Islamabad Inspector General (IG) Syed Ali Nasir Rizvi said the culprit was a 22-year-old man arrested from Faisalabad and termed it a case of “repeated rejections”.\n\n“A beast, cold-blooded murderer is now in the law’s grip,” IG Rizvi announced, adding that the man had tried to contact Sana repeatedly and was being “rejected by her again and again”.\n\nThe police chief said the culprit wanted to establish contact with the social media influencer and “become friends” with her.\n\nIG Rizvi described the man as having done matriculation and hailing from a lower-middle-income family, with “no source of income”.\n\nThe IG highlighted that the police conducted 11 raids — three in the federal capital and the rest in various cities of Punjab, with multiple raids in the Faisalabad district.\n\nHe detailed that the suspect had taken Sana’s mobile phone in a bid to wipe out the evidence but it had been recovered, along with the weapon of offence.\n\nIG Rizvi noted that the man had “tried his best to contact” Sana on her birthday on May 29. “He reached her home and tried to meet her for seven to eight hours but failed.”\n\nThe officer added that yesterday, the culprit made another similar attempt for the same amount of time but could not succeed. “First, it was a cellular rejection. Now, it was a physical mode of rejection.”\n\nRizvi asserted it was “necessary to give a clear message that if any of our sister or daughter or youngster is becoming a social media influencer, and pursuing it as a profession, […] as a hobby and even as their bread and butter, we have to encourage it”.\n\nThe Islamabad police chief termed the murder a “very challenging case”, stressing that arresting the perpetrator in the “shortest time possible was necessary”.\n\n“It was a blind murder; there was no clue, things were not clear, and it was further attempted to give it another angle, even though the aim of taking the mobile was to wipe out the clues,” he said, listing the hurdles faced by the police.\n\nIG Rizvi appreciated members of the social, electronic and print media, stating that “many leads” came from journalists, who “offered their services in analysing social media”.\n\nHe also hailed seven police teams, as well as officials of the Crime Investigation Agency, for their efforts.\n\nEarlier today, Interior Minister Mohsin Naqvi confirmed the arrest in a post on X.\n\n“The incident occurred yesterday in Islamabad when a young girl was murdered by a masked accused,” the minister said, adding that the suspect was arrested at around 12pm.\n\nNaqvi stated that the police have recovered the murder weapon and pistol from the man, as well as the mobile phone used by the slain girl. The suspect has confessed to the murder, he added.\n\nIn the FIR, a copy of which is available with Dawn.com, the mother said that a man with a pistol in his hand entered their house suddenly at around 5pm and “shot straight at my daughter with the intention to kill”.\n\nShe added that two shots struck Sana in her chest, injuring her severely. The girl was taken to a hospital but she had succumbed to her wounds, the FIR added.\n\nThe mother described the suspect as having a “smart appearance, moderate physique and height”, and dressed in a black shirt and pants. She asserted that she and her sister-in-law, Lateefa Shah, were eyewitnesses to the incident and could identify the suspect if they saw him in person.\n\nFarzana detailed that her 15-year-old son was not present at the house as he had gone to their native village in Upper Chitral, while her sister-in-law was visiting them for a few days.\n\nIn January, a man who recently brought his family back to Quetta from the United States confessed to shooting his 15-year-old daughter dead, motivated by his disapproval of her TikTok content, according to police.\n\nThe same month, two TikToker men died in separate incidents in Lahore after their pistols went off accidentally in Lahore.\n\nMore than 54 million people use TikTok in Pakistan, with authorities blocking the video-sharing app several times in recent years over content deemed objectionable.\n\nThe platform was banned four times in 2021 alone. It is currently accessible, with stringent moderation in place and complying with requests to remove certain content.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/031105475459269.png",
  "retrievedAt": "2025-08-18T03:08:33.121Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915163/faisalabad-suspect-held-for-17-year-old-social-media-influencers-islamabad-murder-over-repeated-rejections",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T06:11:28.000Z"
}
