{
  "title": "High prices of sacrificial animals in KP keep buyers at bay - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The prices of sacrificial animals in the provincial capital and other neighbouring districts have surged despite presence of a huge number of animals in the cattle markets.\n\nTraders attribute the price spiral to tensions with India and trade ’restrictions’ with Afghanistan, besides most animals are brought here from Punjab and Sindh provinces, leading to increased costs.\n\nThere’s no doubt the number of animals in all cattle markets has increased significantly but the business is still very slow. Along with traditional livestock markets, the number of sacrificial animals at the unofficial regional markets has also increased to the extent that alleys and streets resemble livestock markets.\n\nDuring a visit to weekly livestock markets in various areas of Peshawar, Charsadda, and Nowshera districts, including Ring Road, Kala Mandi, Saifan Mandi, Sarband Mandi, Palosai, Chehel Ghazi Baba, Sar Dheri, Naguman, Shabqadar, and Tangi, it was observed that a large number of customers were searching for animals of their choice.\n\nTraders attribute high rates to restrictions on trade with Afghanistan, increased transportation costs\n\nMany people from low-income groups were seen searching for big-size sacrificial animals on a partnership basis at affordable rates.\n\nThe buyers said they had been visiting different livestock markets for several days but couldn’t make a purchase due to high prices of sacrificial animals.\n\nUbaidullah, a resident of Tehkal here, who visited Kala Mandi, said they wanted to buy a suitable bull but the price was out of their reach.\n\nIn Nasirpur market, traders Wasim Khan and Habib Khan said that animal prices had increased due to the prevailing tensions between India and Pakistan. Compared to last year, they said prices had increased by Rs50,000 to Rs100,000 per animal this year.\n\nTraders said majority of animals came from Punjab and Sindh, where prices were high. They suggested that trade with India and Afghanistan should be restored to bring prices back to normal.\n\nTraders Rahim Khan and Shamsur Rehman attributed the price hike to the outbreak of different diseases among animals. Mouth and foot disease is said to be widespread but there is no proper check from the livestock department to create awareness and protect the animals from the fatal disease.\n\nMany traders said they had lost several animals to the FMD because there was no proper treatment available and they had to purchase medicines on their own.\n\nThey said fines imposed by police, increased transportation costs, and fodder expenses were common factors contributing to the high prices.\n\nTraders said that in the past, people used to raise animals locally, which benefited both the breeders and buyers. However, due to the increasing population, agricultural land is fast disappearing, resulting in a several-fold increase in fodder prices. Due to these reasons, local animals have become extremely scarce, and the few that remain are weak due to lack of proper food, making them unattractive to buyers. In contrast, animals from Punjab are plump and visually appealing.\n\nMursalin Khan, a retired schoolteacher, said in the past, people used to raise animals, which provided numerous benefits. “However, now people tend to buy all dairy products from market, and they no longer consider water-added milk as bad.\n\nIn Peshawar, the largest livestock animal market is known as Kala Mandi, located on the GT Road in Jhagra area. There are separate spaces for buffaloes, bulls, and cows here. Most traders involved in buffalo trade hail from Punjab, who regularly bring livestock from their cities, particularly from Lahore, Dera Ghazi Khan, Zahir Pir, Multan, Goondal, Rajanpur, and Sahiwal. They say that people in rural areas prefer buffaloes, while in cities, bulls, cows, goats, and sheep are the choice.\n\n“At Saifan livestock market on Kohat Road and Sarband cattle market on Bara Road, there is a good number of goats and sheep.\n\nRahman Ali, a trader in Sarband area, said compared to last year, the price of sheep has increased by Rs30,000 to Rs40,000 this year. “In the past, a large number of sheep were brought from Afghanistan, but currently, due to border restrictions, animal trade is almost non-existent.”\n\nIn the current situation, most sheep come from Swabi, Mansehra districts of Khyber pakhtunkhwa and Talagang, Gali Jahangir and Mianwali areas of Punjab.\n\nAdnan, a trader, said last year, a nine-month-old goat was available for Rs40,000, but this year, it’s hard to find one for even Rs70,000 to Rs80,000. Some customers also complained they were charged from Rs1,000 to Rs3,000 per animal by the contractor when they bought an animal in the market.\n\nThe contractors said they were allowed by the district administrations to charge a six per cent fee for exit of per animal, but they used to charge less than that owing to the poor financial position of people.\n\nPublished in Dawn, June 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683e1b4bb0bfd.jpg",
  "retrievedAt": "2025-10-12T03:25:29.841Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915036/high-prices-of-sacrificial-animals-in-kp-keep-buyers-at-bay",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T02:27:23.000Z"
}
