{
  "title": "Milky Way may not be destroyed in galactic smash-up after all - World - DAWN.COM",
  "author": null,
  "content": "PARIS: The Milky Way may not have a catastrophic collision with another huge galaxy as has been predicted, computer simulations revealed on Monday, giving our home galaxy a coin-flip chance of avoiding destruction.\n\nBut don’t worry either way: no galactic smash-up is expected for billions of years, long after our ageing Sun will have burnt away all life on Earth. The Milky Way and the even-larger galaxy Andromeda are speeding towards each other at 100 kilometres (60 miles) a second, and scientists have long predicted they will collide in around 4.5 billion years. That would be bad news for our neighbourhood.\n\nPrevious research has suggested that the Sun — and our Earth — could wind up in the centre of this newly merged “Milko­meda” galaxy and get sucked into its supermassive black hole. Alternatively, the Sun could be shot out into the emptiness of intergalactic space.\n\nHowever “proclamations of the impending demise of our galaxy seem greatly exaggerated”, according to a new study in the journal Nature Astronomy. There is only a roughly 50 percent chance the Milky Way and Andromeda will smash into each other in the next 10 billion years, the international team of astrophysicists determined.\n\n“It’s basically a coin flip,” lead study author Till Sawala of the University of Helsinki said. The researchers ran more than 100,000 computer simulations of our universe’s future, using new observations from space telescopes. A galaxy merger in the next five billion years is “extremely unlikely”, Sawala said.\n\nMuch more likely is that the galaxies will zoom relatively close to each other — say, a little under 500,000 light years away. In only half of the simulations did dark matter then eventually drag the two galaxies together into a cataclysmic embrace. But this would likely only occur in around eight billion years — long after our Sun has died, the researchers found. “So it could be that our galaxy will end up destroyed,” Sawala said.\n\n“But it’s also possible that our galaxy and Andromeda will orbit one another for tens of billions of years — we just don’t know.”\n\nGalaxy’s fate ‘open’\n\n“The fate of our galaxy is still completely open,” the study summarised. The researchers emphasised that their findings did not mean that previous calculations were incorrect, just that they had used newer observations and taken into account the effect of more satellite galaxies.\n\nFuture data releases from Europe’s rec­ently retired Gaia space telescope as well as Hubble could provide a definitive answer to this question within the next decade, Sawala predicted. How much all this all matters to us is a matter of debate. The Sun is expected to make Earth inhospitable to life in around a billion years. “We might have some emotional attachment” to what happens after we’re gone, Sawala said. “I might prefer the Milky Way not to collide with Andromeda, even though it has absolutely no relevance to my own life — or the lives of my children or great-great grandchildren.”\n\nPublished in Dawn, June 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/030945005f113f3.jpg",
  "retrievedAt": "2025-08-18T03:08:46.602Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915090/milky-way-may-not-be-destroyed-in-galactic-smash-up-after-all",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T02:26:44.000Z"
}
