{
  "title": "Senate panel wants PCC under IT ministry - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Se­­nate Standing Commit­tee on Information Tech­no­logy and Telecom­muni­ca­tion has recommended that the Pakistan Crypto Council (PCC) be placed under the IT Ministry instead of the Ministry of Finance.\n\nThe committee meeting, chaired by Senator Palwasha Khan, held on Monday, reviewed the scope and mandate of the PCC.\n\nIt also questioned the council’s legal standing and reiterated that the legislature had not been consulted before the council’s establishment.\n\nSenator Mohammad Humayun Mohmand inquired whether the council could be established by executive order. The officials informed the committee that financial matters were the purview of the finance ministry, and currency-related subjects were the domain of the State Bank.\n\nSecretary IT Zarrar Hasham Khan informed the committee that the IT ministry has an advisory role in providing input regarding the terms of reference for the PCC.\n\nThe committee was of the view that the PCC should be under the mandate of the Ministry of IT rather than the Ministry of Finance.\n\nAfter due deliberations, the committee deferred the matter and decided to invite the Finance Ministry to the next meeting for a comprehensive briefing.\n\nLDI/FLL licences\n\nDiscussing the issue of renewing Long Distance International (LDI) and Fixed Local Loop (FLL) licences, Mr Hasham informed that consultation with stakeholders had been completed as per the directions of the Sindh High Court, and the final decision would be announced in two to three weeks.\n\nPublished in Dawn, June 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:24:22.708Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915121/senate-panel-wants-pcc-under-it-ministry",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T02:47:23.000Z"
}
