{
  "title": "Rana Tanveer for expediting completion of ongoing projects under PNCU",
  "link": "https://www.app.com.pk/national/rana-tanveer-for-expediting-completion-of-ongoing-projects-under-pncu/",
  "date_published": "2022-10-25T11:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):Federal Minister for Education and Professional Training Rana Tanveer Hussain Tuesday directed the authorities concerned to expedite the completion of ongoing projects under the Pakistan National Commission for UNESCO (PNCU).\nThe direction was given during a briefing given to the minister by senior officials of the education ministry on the working of PNCU , said a press release issued here.\nHe was informed about the on-going projects that include UNESCO emergency funding program – finalized with Government of GB in October 2022 for rehabilitation of damaged schools in Diamer district, Malala Funds – Trust for Girls’ Right to Education Program in Pakistan, “Rehabilitation of Street Children through Football” ICESCO, Training of non-formal basic education community schools teachers, ICESCO and WASH Program awareness of cleanliness in school children, health hygiene, ICESCO.\nThe senior officials of the ministry also attended the meeting.\nRana Tanveer was told that Pakistan joined UNESCO in 1949 and the country had been a member of the executive board since 1951.\nThe minister was informed that PNCU coordinated with UNESCO, ICESCO, provincial governments, federal departments, INGOs and NGOs in order to fulfill its mandate.\nHe was apprised of the working and accomplishments of the organization.\nRana Tanveer was informed that PNCU was leading numerous projects which included UNESCO Associated Schools Project Network and Tangible and Intangible Cultural Heritage of Pakistan on UNESCO World Heritage list and ICESCO list etc.\nRana Tanveer was informed of successful projects undertaken by PNCU which include Capacity Building Workshop for School Teachers on Climate Change Education through Inquiry based science Education (IBSE), pedagogy at Sukkur IBA, University, Poverty Alleviation through Health Improvement of Rural Female Involved in Cotton Picking at Pakistan Agricultural Research Council (PARC), Promoting Adult Literacy through ICT and Distance Learning at National Commission for Human Development, Strengthening of PNCU by developing e-office and Capacity Building of PNCU staff through NITB, PNCU, and Capacity Building in Science & Technology COMSAT, Islamabad COMSATs.\nHe said that all the vacant posts of the organization should be filled on urgent basis so that the organization could work on full capacity.\nHe said that there was a dire need for the organization to work pro actively so that it deliver on its mandate.",
  "retrievedAt": "2025-08-11T15:47:38.318Z"
}
