{
  "title": "Normal life possible for patients with type-1 diabetes: Experts",
  "link": "https://www.app.com.pk/national/normal-life-possible-for-patients-with-type-1-diabetes-experts/",
  "date_published": "2022-10-25T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Experts at a seminar ‘Marriage with Type-1 Diabetes’ held here on Tuesday said that it was possible to live a normal life with the disease by adopting a healthy lifestyle and understanding basic needs of the patients.\nAddressing the seminar, health experts said that marriage with type-1 diabetes was not a stigma, but a normal thing.\nThey said that DiaBuddies is a peer support programme, which was started to connect people with type-1 diabetes who wanted to live a healthy life with a focus on educating the community.\nHead of Umar Diabetes Foundation and Consultant Diabetologist Dr Muhammad Umar Wahab said that being diagnosed with diabetes did not have to derail one’s life and marriage.\nHe further said that communicating regularly about diabetic care, expressing support and affection, solving problems together and seeking external support could increase the odds of successfully managing diabetes and protecting one’s marriage.\nDr Umar said diabetes required many daily management tasks. “If your partner is not aware of what all those tasks are and why each is important, it can be difficult for them to support you,” he added.\nHe said, “I encourage people to educate their partner or have a healthcare team who can help educate their partner about each step in managing type-1 diabetes.”\nHe said “Your partner needs to be able to offer support — not only when you are not feeling well, but also in the day-to-day activities. That means support in making healthy choices when it comes to eating, exercise, and other activities as it can be really hard to manage type-1 diabetes when you feel like you are all on your own.”\nConsultant Endocrinologist Dr Umar Yusuf Raja said that dealing with type-1 diabetes required a lot of planning. “If your partner thinks your blood sugar is low, agree that you’ll check it. If your partner sees that your blood sugar is low or if you’re exhibiting signs that it is, agree to take the snack they offer you, without any question.”\nDiabetologist Dr Bilal Afzal said that diabetes could be a very invisible disease. “One may look fine even if one is not feeling well, and explaining what the different symptoms feel like can be challenging,” he added.\nHe said that seeking social support, either in person or online, where one could get other couples’ perspectives on what the issues were and how to handle them, was a good idea. “Online communities are a great source of support,” he added.",
  "retrievedAt": "2025-08-11T15:47:44.501Z"
}
