{
  "title": "Targeting $100 bn exports in 5 years vital to address external financing issues: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/targeting-100-bn-exports-in-5-years-vital-to-address-external-financing-issues-ahsan-iqbal/",
  "date_published": "2022-10-25T13:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):Minister of Planning, Development, and Special Measures, Professor Ahsan Iqbal on Tuesday said that there is a need to increase domestic exports from $30 billion to $100 billion in the next five years to cope with the external financial needs of the country.\nHe said the annual funding requirements for Pakistan’s development programme were over Rs 1900 billion, however the government could manage to set aside only Rs 700 billion for the current financial year due to financial constraints in the ongoing fiscal year.\nThe Federal Minister expressed these views while briefing a meeting of the National Assembly Standing Committee on Planning presided over by Khalid Magsi.\nThe minister said that the PML-N government gave Vision 2010 and then Vision 2025 during its tenure, but the previous government failed to approve the five-year plan.\nHe further said that the former government kept calling everyone thieves, and it angered China by accusing the friendly country of expensive projects. “We are now restoring China’s confidence, and the government is all set to hold 11th meeting of Pakistan-China Joint Coordination Committee on China Pakistan Economic Corridor (CPEC).”\nAhsan Iqbal added that the whole government was running on borrowing as the tax and non-tax revenues of the federal government would be Rs 9000 billion this year, out of which Rs 4000 billion would go to the provinces, and Rs 4000 billion would be spent on paying debts.\nChina has the grand Belt and Road Initiative plan and Pakistan has advantage of its location, he said adding that benefiting from this advantage, we can become a trade hub between a large region.\nHe said that China also has the advantage of getting an alternative corridor in CPEC. If even 5 percent of China’s trade starts from Pakistan, it will be of great benefit to Pakistan.\nChinese companies have set up energy projects on IPPs mode, he said adding that the concessional loans were given by China for infrastructure projects.\nThe minster said due to the high cost of labor in China, more than 80 million new employment opportunities were being created from which Pakistan could benefit.\nAhsan Iqbal said that during the Tehreek-i-Insaaf tenure, there were problems regarding visas for Chinese companies. He said that after the 18th amendment, 58% of the revenue under NFC goes to the provinces, the continuation of economic development policies on sustainable basis and political stability is necessary.\nIn the meeting, member committee Syed Mahmood Shah complained that in his constituency, not a single project was included in the Public Sector Development Programme (PSDP) 2022-23.",
  "retrievedAt": "2025-08-11T15:47:36.626Z"
}
