{
  "title": "President launches commercial helicopter flight service in AJK to promote tourism",
  "link": "https://www.app.com.pk/national/president-launches-commercial-helicopter-flight-service-in-ajk-to-promote-tourism/",
  "date_published": "2022-10-25T13:20:00.000Z",
  "source": "APP",
  "content": "BAGH (AJK), Oct 25 (APP): President Dr Arif Alvi on Tuesday launched the commercial helicopter flight operations of Kashmir Air in Azad Jammu and Kashmir (AJK) as part of an effort to promote tourism in the region.\nThe president, addressing the launching ceremony of Kashmir Air, at Bagh, said the AJK was blessed with immense natural beauty and tourism potential, and the private sector should come forward to develop AJK’s tourism sector to realize its fullest potential.\nKashmir Air is a private company that is going to start commercial helicopter flights to AJK and northern areas of Pakistan for the transportation of tourists.\nDuring his day-long stay in the AJK, the president launched the helicopter flight service, visited a newly established high-end private school, and the flagship campus of a healthcare Information Technology company at Bagh, and was briefed on the establishment of a hospital at Abbaspur.\nThe president urged the AJK government to promote sustainable and environment-friendly tourism, besides evolving tourism-friendly policies for facilitating private-sector investment.\nHe said that tourism had become the mainstay of many developing economies in the world and was considered a prime source for earning foreign exchange, creating jobs, stimulating growth, and reducing economic disparities.\nHe called for adopting an integrated approach to tourism planning in AJK, adding that a careful assessment of the economic, social, and environmental impacts of tourism on the region should be conducted, besides establishing linkages between stakeholders, businesses, resources and tourism activities.\nPresident Alvi said that Pakistan possessed enormous human resources in the form of youth and women, which with relevant skills and training could become an asset to the national economy in the future.\nHe urged the need to provide technical and vocational skills and training to AJK’s youth in the tourism and hospitality sector to provide gainful employment to youth, particularly women, in their own region.\nHe said that the adoption of IT tools and artificial intelligence could help in the development and promotion of the tourism sector in AJK to market AJK’s tourism assets as well as provide information, online booking facilities and tourism packages to domestic and foreign tourists.\nPresident Alvi said that the IT sector was akin to a “fast train”, that could help Pakistan achieve accelerated economic growth with little investment as compared to traditional brick-and-mortar dependent infrastructure development.\nDuring his visit to the school, the president appreciated the private sector for providing quality education to students of AJK to help improve the education standard.\nReiterating his call for making investments in the IT sector, he said that advancements in the field of IT had opened up new avenues for women’s empowerment, as they could offer their services online worldwide using the latest ICT tools.\nHe highlighted that Meta (Facebook) had provided training to over 5000 Pakistani women to enable them to market their products and services online.\nHe added that Prime Minister’s Digiskills program had benefitted 2.4 million people, in which people from different academic backgrounds had participated.\nThe president highlighted that women should be encouraged to enter into the workforce in all sectors, including the tourism sector, by providing them safe and secure working environment as it would help in the development of AJK’s tourism sector and their economic empowerment.\nHe said that women’s employment rate in Pakistan was as low as 24%, adding that efforts should be made to enhance women’s employment rate and economic participation.\nHe said that Islam had allocated the due share of women in inheritance, however, regrettably, women were being deprived of their God-given right in different parts of our country.\nWhile expressing his views during his visit to the flagship campus at Bagh, he said that the facility would provide high-quality healthcare services to the people of AJK.\nHe stressed that keeping in the mountainous landscape of AJK, telemedicine could provide quality health care services to the people of far-flung areas at their doorsteps.\nHe urged the private sector to make contributions to society through their Corporate Sector Responsibility (CSR) initiatives by developing partnerships among industry, academia and government.\nDuring his visit, he was also briefed on the establishment of a hospital in Abbaspur, which was providing quality healthcare services to the people of AJK.\nThe president said that Pakistan was committed to providing moral, political and diplomatic support to the people of the Indian Illegally Occupied Jammu and Kashmir and called upon the international community and international organizations to play their role in resolving the Jammu and Kashmir dispute as per the UN Security Council’s resolutions and the aspirations of the people of Jammu and Kashmir.\nPrime Minister of AJK Sardar Tanveer Ilyas also accompanied the president.",
  "retrievedAt": "2025-08-11T15:47:36.509Z"
}
