{
  "title": "Women in Nuclear Science & Technology honoured at PNS special session",
  "link": "https://www.app.com.pk/national/women-in-nuclear-science-technology-honoured-at-pns-special-session/",
  "date_published": "2022-10-25T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Women in the field of Nuclear Science and Technology were honoured during a special session ‘Women in Nuclear (WiN) Pakistan’ on the second day of three-day conference ‘Applications of Nuclear Techniques for Sustainable Socioeconomic Development’, being held here.\nThe session, organized by the Pakistan Nuclear Society (PNS) on Tuesday, aimed at empowering the women scientists in the field of nuclear science and technology by celebrating their achievements.\nAddressing the event, the chief guest, Ex-Director of CTC Naseem Bhatti lauded the role of women in the field of nuclear science and technology saying that the field had a lot of opportunities for women which needed to be explored, especially by the future generations.\nShe said that the field of nuclear science and technology was once considered a no go area for women, “but now a lot of women are exploring this field due to the vast exposure.”\nEarlier in her welcome address, Dr Ismat Fatima from Pakistan Nuclear Society highlighted the role of WIN forum, saying “Women in Nuclear Global (WiN Global) is a global non-profit organization of women working professionally in various fields of nuclear energy and radiation applications.”\nShe said that WiN currently had around 35,000 members including chapter members and individuals from 129 countries.\nTalking about WiN Pakistan, Dr Fatima said, “WiN Pakistan has great potential to contribute in the field of nuclear science and inspire women to join and contribute in this field.”\nShe was of the view that formation of the formal executive body through election was required to make the forum more effective in the future.\nDuring the session, DCS/Head Electronic Division PINSTECH, Nazneen Kosar gave a presentation on ‘Instrumentation in Nuclear Power Plant’, while DCS/Head Chemistry Division PINSTECH, Dr Naila Siddique talked about the Nuclear Chemistry in her address.\nDr Ayesha Ammar from NORI Hospital talked about nuclear medicine. PS, LINAC Project, Dr Sumaira Javed briefed the participants about applications of LINAC while PS PINSTECH, Samreen Shehzadi spoke about agriculture and biotechnology.",
  "retrievedAt": "2025-08-11T15:47:35.663Z"
}
