{
  "title": "NA committee proposes to fix minimum support price for wheat at Rs2,200 per-40 kg",
  "link": "https://www.app.com.pk/national/na-committee-proposes-to-fix-minimum-support-price-for-wheat-at-rs2200-per-40-kg/",
  "date_published": "2021-11-01T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP): National Assembly Standing Committee on National Food Security and Research on Monday proposed to fix minimum support price of wheat for crop season 2021-22 at Rs 2,200 per 40 kg in order to ensure proper rate of returns to local farmers.\nThe committee, which met here with Members National Assembly Rao Muhammad Ajmal Khan in the chair noted that inputs cost including seeds, fertilizers and fuel witnessed manifold increases and make cost of production higher as compared to the previous period.\nHe informed that due to increase in inputs cost, per-acre wheat cultivation costing above Rs 62,000 and increasing minimum support price would help to compensate local farmers with proper rate of their produces and encourage them to bring more area under wheat cultivation to get rid from swelling import bills.\nHe said that due to import, the farmers of Ukraine and Brazil were getting Rs300 per 40 kg, adding that if the local farmers provided proper prices of their produces and provided appropriate assistance, it could encourage to bring maximum land under wheat cultivation that create food safety and security in the country.\nThe Chairman of the Committee also asked for expediting research in order to produce climate smart, heat, drought and disease tolerant varieties of wheat, rice, maize and cotton for the uplift of national economy.\nThe committee expressed its concerns over the waste of garlic seeds cultivated on National Agricultural Research Centre’s research plot and asked to submit report of negligence with in two weeks.\nHe stressed the need to upgrade research and development standards according to the international standards for achieving the required results for maintaining food safety and security to tackle with increasing demand.\nMeanwhile, Secretary Ministry of National Food Security and Research Khursheed Anwar apprised the meeting that the modalities for fixing minimum support price of wheat were finalized and would be submitted in the next meeting of the Economic Coordination Committee of the Cabinet for approval.\nHe said that government was also providing Rs15 billion subsidy on agriculture inputs during current season to achieve the fixed targets of different crops.\nHe told the meeting that cotton intervention price was also announced by the government to protect cotton growers, adding that farmers were also provided Rs9.7 billion subsidy to purchase inputs.\nFood Security Commissioner Dr Waseem informed the meeting that Plant Protection department was revamped in order to make strict compliance of international standards.\nThe committee also expressed its concerns over the closing of research institutes including including Ayub Agriculture Research Institute Fasilabad and Agriculture Research Institute Multan and providing research land to develop South Punjab Secretariat.\nThe committee also called for addressing the financial matters of Central Cotton Research Institute Multan as the institute was playing vital role in cotton crop development.\nBesides others, the meeting was attended by Member National Assembly Main Muhammad Shafiq, Dr Nausheen Hamid, Javed Ali Shah Jillani and senior officials of Ministry of National Food Security and Research, Pakistan Agriculture Research Council.",
  "retrievedAt": "2025-08-11T21:32:32.459Z"
}
