{
  "title": "Envoy eulogizes Pakistan’s stand on Azerbaijan’s territorial integrity",
  "link": "https://www.app.com.pk/national/envoy-eulogizes-pakistans-stand-on-azerbaijans-territorial-integrity/",
  "date_published": "2021-11-01T13:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 1 (APP): Ambassador of Azerbaijan to Pakistan Khazar Farhadov on Monday appreciated Pakistan for its position and support on issues of Azeri territorial integrity before and during the patriotic war against Armenia, describing it “a true demonstration of brotherhood.”\n“During the patriotic war, the government, the Parliament and people of Pakistan morally and politically supported us, condemning Armenian aggression and supporting our just position to restore territorial integrity,” Ambassador Farhadov said while addressing a news conference here to mark 1st anniversary of ‘44-day Patriotic War’ against Armenia.\nDuring the war, the Azeri forces liberated more than 300 cities and villages from 30-year illegal occupation of Armenia. Azerbaijan, he said, being member of the Kashmir Contact Group of the Organization of Islamic Cooperation (OIC), fully supported the settlement of the Kashmir issue in accordance with the relevant United Nations Security Council resolutions.\nHe recalled that Armenia for almost 30 years kept under occupation almost 20 percent of Azerbaijan’s territory, committing notorious war crimes and crimes against humanity.  Armenia committed the Khojaly genocide in February 1992, killing hundreds of civilians, including 106 women and 63 children.\nAs many as 1275 Azerbaijanis were taken hostage, 150 of them are still missing. Armenia’s ethnic cleansing had resulted in more than a million Azerbaijanis becoming refugees and internally displaced persons.  In 1993, he further highlighted that the UN Security Council adopted four resolutions calling for the immediate, complete and unconditional withdrawal of Armenian armed forces from the occupied territories of Azerbaijan.\nHowever, these and all other similar decisions adopted by relevant international organizations had been ignored by Armenia, Ambassador Khazar Farhadov maintained. During the occupation, he said, Armenia tried to maintain the status quo, adding “unfortunately, no international sanctions had been imposed on Armenia to ensure the implementation of UN Security Council resolutions.\nThe overthrow of the war criminal regime in Armenia in 2018 was not accompanied by real changes.” In July 2020, he said, Armenia committed a military provocation on the state border with Azerbaijan and as a result of an artillery strike in the Tovuz region of Azerbaijan as many as 13 servicemen and civilians were killed.\nMoroever, in August last year, the envoy said, an Armenian sabotage group tried to penetrate through the former line of contact in order to commit terrorist acts against Azerbaijani military servicemen and civilians, but was successfully neutralized by the Azeri forces.\nHe said at the General Debates of 75th Session of the UN General Assembly on September 24, 2020, President Ilham Aliyev warned that hostile statements and provocations of Armenian leadership demonstrated that it was preparing for a new aggression against Azerbaijan.\n“Three days later, on September 27 last year, Armenia launched a large-scale attack on Azerbaijani military positions and civilians,” he added. In response, the ambassador narrated that Azerbaijan launched a counterattack in its own territories against Armenia, using the right to self-defense enshrined in Article 51 of the UN Charter. For 44 days, the Armenian armed forces intensively fired on the regions and cities along and also far from the front line, he added.\nArmenia used ballistic missiles such as the Scud and Iskander-M, as well as banned white phosphorus and cluster munitions. As a result of these Armenian war crimes, more than 100 civilians, including 11 children, were killed and more than 450 were injured.\nMore than 12,000 civilian infrastructure, including individual houses, have been destroyed or severely damaged in Azerbaijan. Armenia has attracted mercenaries and foreign fighters from abroad and placed them against Azerbaijan.  In total, he said, more than 300 cities and villages were liberated on the battlefield and Armenia had to sign an act of capitulation on November 10, 2020.\nAccordingly, Armenia was obliged to withdraw its troops from the remaining parts of Azerbaijan’s territories, namely Aghdam, Lachin and Kalbajar regions.\nKhazar Farhadov said the Nagorno-Karabakh conflict was left in the past and there was no administrative territorial unit called Nagorno-Karabakh in Azerbaijan.\n“We have about 4,000 citizens registered as missing during the First Karabakh War.\nArmenia must inform us about their fate. We have solid evidence that almost all of them were tortured to death by Armenian servicemen in violation of international humanitarian law and buried in mass graves,” he said.\nAnswering a question, the envoy said the patriotic war that ended with a victory of the brave Azerbaijani Army, opened a new era, establishing international justice and changing realities in the region.\nAfter the liberation, Azerbaijan began to revive the liberated territories, which were completely destroyed by Armenia, he said, adding his country began to rebuild and restore its territories and in just 8 months, the Fizuli international airport had been built in Azerbaijan, and work was underway in all the liberated territories.\nReplying to another question, he said direct flights between Azerbaijan and Pakistan would be operational soon as the procedural work in that regard was almost completed, but unfortunately it delayed due to COVID-19 restrictions in both the countries.\nHe said efforts were underway to further promote the bilateral ties in diverse fields especially information technology, education, health, science and technology, logistics and defense.",
  "retrievedAt": "2025-08-11T21:32:32.609Z"
}
