{
  "title": "Covid-19 claims 6 more lives, one of lowest since pandemic outbreak",
  "link": "https://www.app.com.pk/national/covid-19-claims-6-more-lives-one-of-lowest-since-pandemic-outbreak/",
  "date_published": "2021-11-01T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 1 (APP): The national tally of Covid-19 active cases on Monday was recorded 22,545 with 482 more people testing positive for the deadly virus and 1,024 people recovered from the disease during the last 24 hours.\nSix corona patients have died during the last 24 hours, two of the deceased were under treatment in different hospitals and two of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Khyber Pakhtunkhwa (KP) followed by Punjab.There were 1,338 Covid-19 infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country. The National Covid positivity ratio during the past 24 hours was recorded at 1.18 percent.\nThe maximum ventilators were occupied in four major cities including Sargodha 16 percent, Peshawar 17 percent, Lahore 16 percent, and Multan 41 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per the medical requirement of Covid patient) were also occupied in four major cities of Swabi 22 percent, Lahore 20 percent, Sargodha 21 percent, and Multan 39 percent.\nAround 166 ventilators were occupied elsewhere in the country while no Covid affected person was on a ventilator in Azad Jammu and Kashmir (AJK), Balochistan, and Gilgit Baltistan (GB).\nSome 40,621 tests were conducted across the country on Sunday, including 11,339 in Sindh, 16,295 in Punjab, 9,174 in Khyber Pakhtunkhwa (KP), 2,769 in Islamabad Capital Territory (ICT), 527 in Balochistan, 344 Gilgit Baltistan (GB), and 173 in AJK.\nAround 1,222,559 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,273,560 cases were detected that also included the perished, recovered, and under treatment Covid-19 patients so far, including AJK 34,478, Balochistan 33,263, GB 10,390, ICT 106,921, KP 178,074, Punjab 440,259 and Sindh 470,175.\nAbout 28,456 deaths were recorded in the country since the eruption of the contagion. Around 7,568 people perished in Sindh, one of them perished in the hospital on Sunday.\nIn Punjab, some 12,918 deaths occurred across the province due to Covid-19. Two of the infected people died in the hospitals in the past 24 hours.\nAs many as 5,748 people expired in KP, three of them died in hospitals on Sunday, 940 individuals died in ICT, 356 people died in Balochistan, 186 infected people perished in GB, and 740 people died in AJK.\nA total of 20,839,791 corona tests have been conducted so far, while 640 hospitals are equipped with Covid facilities across the country. Some 1,394 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:32:34.107Z"
}
