{
  "title": "Asad Umar reviews progress of GB Development Plan",
  "link": "https://www.app.com.pk/national/asad-umar-reviews-progress-of-gb-development-plan/",
  "date_published": "2021-11-01T13:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 1 (APP): Minister for Planning Development and Special Initiatives, Asad Umar on Monday reviewed the progress on Giglit Baltistan  Development Plan.\nThe progress review meeting on the GB Development Plan was attended by Additional Secretary Development and Special Initiatives, Additional Chief Secretary GB, and other senior officers from Ministries and Division.\nAdditional Chief Secretary GB briefed the Minister on the GB projects funded through Public Sector Development Programme (PSDP) and non-PSDP sources, as well as in the Public-Private Partnership mode, said a news release issued here.\nVarious priority sectors included in the GB Development Package like clean energy/Hydropower, skill development, tourism, private sector development were discussed in the meeting.\nIt was informed that 19 new projects were already included in the GB Plan, out of which PC-Is and PC-IIs of 10 projects had been approved, wherein nine projects were under preparation for PSDP 2022-23 and 11 non-PSDP projects at various stages of implementation.\nAsad Umar said aim of the GB development package was not only to produce energy but also to build the right institutional and regulatory framework, and generation, transmission, and distribution of capacity as well.\nHe directed the GB government to expedite work on the transaction structure and feasibility studies of the P3 Power projects.\nHe instructed Public Private Partnership Authority (PPPA) to assist the GB government in strengthening GB PPP Unit and also help identify private sector partners.\nThe Minister emphasized the need of establishing primary schools for girls in different districts of upper Hunza.\nFor promotion and development of the tourism sector, he stresses that accessibility, tourist facilitation, information about sites should be improved.",
  "retrievedAt": "2025-08-11T21:32:32.497Z"
}
