{
  "title": "Ashrafi called implementation of Khilafat-e-Rashida principles for judicial reforms",
  "link": "https://www.app.com.pk/national/ashrafi-called-implementation-of-khilafat-e-rashida-principles-for-judicial-reforms/",
  "date_published": "2023-12-31T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP): Pakistan Ulema Council (PUC) Chairman Hafiz Muhammad Tahir Mahmood Ashrafi on Sunday called for the implementation of the Khilafat-e-Rashida system in Pakistan, with the foremost demand being an equitable and unbiased justice system.\nSpeaking at a seminar on Syedna Siddique Akbar, he highlighted that Pakistan, as an ideological state, is built on the principles of Khilafat-e-Rashida, with a focus on justice and fairness.\nHighlighting the need to emulate first caliph Siddique Akbar’s adherence to Islamic beliefs and duties, he asserted that universal Zakat contributions could alleviate hunger across the nation.\nAshrafi stressed the importance of a robust Zakat system, asserting that with proper implementation, hunger could be eradicated.\nExpressing concern over the stagnant justice system after 76 years, he lamented the lack of accountability for those attacking state defense institutions and urged the judiciary to deliver fair decisions, especially regarding the events of May 9.\nHe expressed concern, stating that if the culprits of May 9 go unpunished, then Allah safeguards the nation. He questioned the impediments preventing their punishment and raised the issue of the necessity of military courts, suggesting a potential challenge in the absence of such a system.\nAshrafi emphasized the deterioration of the justice system in the country and urged the Chief Justice of Pakistan to institute reforms in the lower-level courts.\nExpressing condemnation for Israeli brutality in Palestine, he suggested that, rather than mere celebrations on the new year, Pakistanis should actively contribute financial aid to Palestinians and offer prayers for them.\nHighlighting international perspectives, he expressed that the stance of the Organization of Islamic Cooperation (OIC) and the Arab League is to foster a consensus on the two-state solution, adding that discussions are proposed with Egypt and Qatar to address the Palestinian issue in a bid to secure a lasting ceasefire.\nAshrafi said Commander-in-Chief of the Nation, General Syed Asim Munir, forthrightly conveyed to American leadership that persistent Israeli aggression could result in global repercussions affirming that Pakistan stands in solidarity with oppressed Palestine and pledges unwavering support.\nHe, paying tribute to Syedna Siddique Akbar, stated that Hazrat Siddique Akbar holds the esteemed position of being the first Caliph of Muslims.\nEmphasizing the fundamental tenet of the Khilafat system, he underscored the paramount role of justice adding that regardless of one’s religious affiliation, the scales of justice must remain impartial.\nAllama Zubair Abid, Maulana Aslam Qadri, Maulana Qari Abdul Hakeem Athar, Maulana Mufti Falak Shabir, Maulana Mufti Anees, and Maulana Abdul Ghaffar were also present on the occasion.",
  "retrievedAt": "2025-08-11T11:19:00.725Z"
}
