{
  "title": "NA passes resolution condemning alleged verbal abuse of senior journalist by PTI founder - Pakistan - DAWN.COM",
  "author": null,
  "content": "Members of the Parliamentary Reporters Association of Pakistan (PRA) on Monday staged a mass walkout from a session of the National Assembly, over senior journalist Ijaz Ahmed allegedly being subjected to misbehaviour by PTI founder Imran Khan.\n\nAccording to Ahmed, who spoke to Dawn.com, the walkout was organised by the PRA Pakistan’s Election Committee.\n\n“[The] PTI founder hurled abuse at me for asking questions,” Ahmed said.\n\nNational Assembly Speaker Sardar Ayaz Sadiq directed Law Minister Azam Nazeer Tarar to hold talks with PRA. During the walkout, the speaker noted that the PRA submitted a written complaint over the issue, which Tarar spoke about during his address.\n\nLater, the National Assembly released visuals of Ahmed meeting with Speaker Sadiq in his office.\n\n“It is your (reporters) right to protest and politics and journalism have a deep relationship,” the minister said, requesting that the reporters listen to what he has to say. “You have a valid complaint.”\n\n“A senior member of the PRA was involved in a verbal altercation at Adiala Jail with a senior leader who hurled foul language at him,” the law minister stated, not mentioning the PTI founder by name.\n\n“It is the job of reporters and journalists to criticise us and show us our reflection in the mirror. We should take this criticism to heart and not silence or attack them.”\n\nTarar said that Ahmed requested the speaker’s office for permission to speak with Imran at Adiala and requested protection.\n\n“After the discussion and the way he (Ahmed) was abused, there was a social media onslaught targeting him,” Tarar added. “Posts said ‘Look at this man’s face’, ‘don’t forgive him’ and ‘look what he said about our Quaid’.\n\n“This is a distinguished House and I must request that we behave democratically,” he said. “We need to prove through our own attitudes that we listen to other people and that there is room for decency and politics in this House.”\n\nPPP lawmaker Shazia Marri noted in her address that Ahmed is a renowned journalist in Islamabad and has links to Sindh.\n\n“In terms of his reporting, he is a decent journalist,” she said. “We may have differences of opinion, but in terms of his reporting and ethics, he is commendable.”\n\nMarri added that journalists expose problems plaguing the country and face issues while doing so. She also condemned people posting Ahmed’s face on social media and “making him a target of hate”.\n\n“We keep saying that they criticise politicians, but we criticise each other for not protecting journalists. Why do we forget to offer them protection?”\n\nAfter a recess, Ahmed himself spoke on the floor of the House and said that he had gone to Adiala Jail on the speaker’s request and heard from Khan about his treatment at Adiala Jail.\n\n“We told him that we would speak about this on the floor of the House,” Ahmed said.\n\n“He (Imran) had two demands: the first being that Ahmed speak about how no PTI members were part of an opposition delegation to visit him in jail. The other was that he wanted a resolution passed about this incident.”\n\nImran also demanded that the Sindh government launch a “high-level investigation” into the murder of anchorperson Imtiaz Mir.\n\nMuttahida Qaumi Movement (MQM) MNA Syed Aminul Haque, who was a part of the delegation, alleged that Imran hurled threats and foul language at Ahmed.\n\n“Immediately afterwards, we saw him being trolled on social and digital media,” Haque said, adding that the MQM condemned the incident. “People were trying to get his address and threaten his family. Journalists have a right to ask questions. People are free not to answer, but to threaten them and be rude is undemocratic.”\n\nA resolution was presented before the House condemning the verbal altercation and stating that not only did Imran use harsh language, but also launched a social media campaign against Ahmed and other senior journalists.\n\nIt demanded that Ahmed and other journalists receive immediate protection, legal action be taken against those responsible and also condemned Mir’s murder in Karachi, demanding an investigation into the shooting.\n\nPTI Chairman Barrister Gohar Ali Khan, however, requested that the resolution not be presented because it would “ruin the atmosphere of the House”.\n\n“We pay tribute to the media; they have played a key role in highlighting our struggles and raising their voices for the people,” he said. “I was not able to meet [Imran] Khan sahib, so I wanted to know what happened. I reached to three of their (PRA) people.\n\n“A limited number of people are allowed at Adiala Jail,” he added. “We don’t know the exact words he used. We do not know what happened, we don’t even know what happens during jail trials.”\n\nThe resolution was adopted after a vote, however, there was booing and hollering heard in the House.\n\n“If you are saying no, does that mean you are saying that what happened with Ijaz Ahmed was right?” Speaker Sadiq asked after the resolution was passed.\n\nTarar took the floor once again, stating that he is one of those who has always tried to ensure that there is no pressure on the media.\n\n“We heard what the PTI chairman said and we will not say anything distressing, but a journalist came and spoke in parliament saying that he was called an ‘agent’,” he said. “We need to see how people who raise their voices are treated.”\n\nImran, imprisoned since August 2023, is serving a sentence at the Adiala Jail in the £190 million corruption case and also faces pending trials in May 9 cases under the Anti-Terrorism Act.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/29190531dcfe655.webp",
  "retrievedAt": "2025-10-12T00:17:47.173Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945454/na-passes-resolution-condemning-alleged-verbal-abuse-of-senior-journalist-by-pti-founder",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T13:00:23.000Z"
}
