{
  "title": "Work on Islamabad’s 10th Avenue project stalls as govt withdraws funding - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The multibillion-rupee under-construction 10th Avenue project has almost come to a halt as the federal government has decided not to fund it anymore, while CDA has yet to arrange any financing for it.\n\nWork is continuing at a snail’s pace, apparently only to keep a handful of labourers and machinery engaged by the contractor, the National Logistics Cell (NLC).\n\nThe earthwork on the project has been almost completed from IJP Road to H-9, and with little attention the government and CDA could finish this portion of the road after carrying out asphalt work.\n\nTwo bridges built under the project are already being used by motorists, but other incomplete infrastructure, such as pillars, is deteriorating.\n\nCDA yet to arrange funds for multi-billion project as only 48pc work completed despite two deadline extensions\n\nThe project was started by the CDA with federal government funding in 2022 and was supposed to be completed by March 2024.\n\nHowever, it has yet to achieve even 50 per cent progress. Launched in 2022 under the Public Sector Development Programme (PSDP) at a cost of Rs10.2 billion, the project was to be completed by March 2024.\n\nIts deadline has been extended twice, but so far, only around 48pc work has been completed, according to sources.\n\nCDA officials have attributed the delay to the slow release of funds, saying the government has released around Rs4 billion so far.\n\nUnder the project, a five-kilometre road is being constructed from Katarian Bridge on Karnal Sher Khan Road (formerly IJP Road) to Srinagar Highway near the intersection of G-9 and G-10 sectors.\n\nIn the federal budget for fiscal year 2025-26, the project was dropped from the funding list, and it was expected that the CDA would complete it through its own resources.\n\nHowever, sources said the CDA has not paid any attention to resolving the issue.\n\nMeanwhile, residents of adjoining areas have been waiting for the project’s completion for over three years.\n\nIt is worth noting that 10th Avenue is a major artery in Islamabad, included in the city’s master plan.\n\nAccording to the plan, after every one sector, a major road is to be constructed. For example, 7th Avenue runs between G-6 and G-7, 8th Avenue (Faisal Avenue) passes through G-7 and G-8, and 9th Avenue divides G-8 and G-9.\n\nAfter 9th Avenue, however, the CDA has failed to build any new major road, with 10th Avenue stuck in limbo.\n\nWhen contacted, the CDA spokesperson in a written reply said,\n\n“The construction work is in progress, with the CDA engineering team and the consultant working to maintain high standards of quality construction. However, the project is awaiting funds from the PSDP to ensure its timely completion.”\n\nHe said the release of these funds is important to avoid delays and maintain momentum in construction activities.\n\n“Out of Rs10 billion for the project, Rs8 billion is still required. The CDA has already taken up the matter with the Planning Commission for expediting the allocation of the requisite funds to ensure the project’s completion,” he added.\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:17:59.010Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945293/work-on-islamabads-10th-avenue-project-stalls-as-govt-withdraws-funding",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:07:24.000Z"
}
