{
  "title": "HPV vaccine campaign extended for 3 days in Punjab to maximise coverage: health minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Punjab Health Minister Khawaja Imran Nazir said on Monday that the province was extending the human papillomavirus (HPV) vaccination campaign until Wednesday, hoping to achieve a target of 100 per cent.\n\nEarlier in September, Pakistan rolled out the HPV vaccine nationwide as part of the routine immunisation programme to protect adolescent girls against cervical cancer. However, vaccine hesitancy in Pakistan remains a major public health challenge, driven by a mix of misinformation, safety concerns, and mistrust of authorities.\n\n“Success rate in Punjab has been 72pc,” Punjab’s health minister said during an interview with Geo News show “Geo Pakistan”.\n\n“But we have not ended the campaign; instead, we have extended it for three days.”\n\nHe added, “The primary reason is that if we administer this vaccine to our girls now, those aged 9 to 14 will get it for free. But after the campaign ends, people will have to pay money for it, and only 9-year-old girls will be able to get it free of charge.”\n\nReferring to the attacks on women health workers while administering vaccines in Punjab’s Mandi Bahauddin district, the minister said he has ensured the suspects were arrested and that security measures have been put in place to protect health workers.\n\nIn the latest incident this week, the HPV vaccination team was performing its duty in a non-formal education school in the village of Ratuwal, within the limits of Kathian Sheikhan police station, when a 55-year-old resident of the village entered the school and attempted to attack a female health supervisor.\n\nHe said the rate of refusals was greater at the beginning of the campaign, with only 250,000 girls receiving the vaccine on the first day. However, towards the end, the number of refusals dropped to 90,000 from 300,000 after counselling was provided through their teams.\n\n“More than 5.2 million girls have been vaccinated; however, our target was 7.2 million, which we hope to achieve by Wednesday,” the minister said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/29114724f2aa0d9.webp",
  "retrievedAt": "2025-10-12T00:17:45.208Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945426/hpv-vaccine-campaign-extended-for-3-days-in-punjab-to-maximise-coverage-health-minister",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T07:05:40.000Z"
}
