{
  "title": "‘It is Punjab’s water’: Maryam resurrects Cholistan canals issue amid rift with PPP - Pakistan - DAWN.COM",
  "author": null,
  "content": "In her latest censure of the PPP, Punjab Chief Minister Maryam Nawaz on Monday resurrected the issue of the contentious Cholistan canals project, saying the water that would have been diverted towards the desert belonged to her province.\n\n“If Punjab wants construct canals for its water, why are you bothered? It is Punjab’s water. It belongs to the people, farmers and fields of Punjab,” she said at the inauguration ceremony of an electric bus service in Faisalabad.\n\n“If I want to create canals, why do you object to it?” she questioned. “I wouldn’t have stolen water. I would have [used] them to create waterways and developed Cholistan,” she continued, taking a fresh jibe at her party’s coalition partner in the Centre.\n\nThe now-shelved canals project had turned out to be a cause of contention between the Punjab and Sindh, which are governed by the PML-N and PPP, respectively.\n\nThe project aimed to irrigate a total of 4.8 million acres of barren land by constructing six canals — two each in Sindh, Balochistan and Punjab. Five of those canals would have been built on the Indus River, while the sixth would have been constructed along the Sutlej River, supplying approximately 4,120 cusecs of water to irrigate the Cholistan desert in Punjab.\n\nMaryam and Chief of the Army Staff Gen Asim Munir had inaugurated the project to irrigate south Punjab’s lands on February 15 amid public uproar and strong reservations in Sindh. What was being hailed as a game-changer for Punjab had triggered an uproar in Sindh, which believed the scheme would have further disturb the ecological balance in the province and deprived it of its mandated water share.\n\nAfter months of protests from various fragments of society as well as opposition from Sindh, the federal government had announced on April 23 that it was halting the project until a consensus on the issue could be reached in the Council of Common Interests — a key body tasked with resolving power-sharing disputes between the federal and provincial governments. The decision came amid uncertainty created by India’s unilateral suspension of the Indus Waters Treaty.\n\nThen, on April 28, CCI meeting had endorsed the federal government’s move to halt the initiative until “mutual understanding” could be achieved among provinces.\n\nAs Maryam resurrected the issue during her speech again, the Punjab CM mentioned flood relief and the Benazir Income Support Programme (BISP) — the latest cause of dispute between the PPP and PML-N over flood relief.\n\nThe PPP and PML-N have lately been arguing over the means for flood relief, with the PPP insisting on the use of BISP and the PML-N disapproving the proposition.\n\nReiterating her argument that funds given under the BISP were insufficient for flood relief, she, once again rejected the PPP’s proposition to seek international assistance to help people affected by recent floods in Punjab.\n\n“Keep your advice to yourself,” she rebuked, adding the seeking international help was not the only solution.\n\n“Punjab never interferes in your matters, so you don’t interfere in Punjab’s matters,” she said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/292030439b592b0.webp",
  "retrievedAt": "2025-10-12T00:17:43.377Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945463/it-is-punjabs-water-maryam-resurrects-cholistan-canals-issue-amid-rift-with-ppp",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T15:48:04.000Z"
}
