{
  "title": "2 new poliovirus cases in Sindh take nationwide tally for this year to 29 - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two new poliovirus cases have been confirmed in Sindh’s Badin and Thatta districts, taking the nationwide tally to 29 for this year and the total number of cases in the province to nine, the National Institutes of Health (NIH) said on Monday.\n\nThe development comes days after a poliovirus case was confirmed in Sindh’s Hyderabad district.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress.\n\nThe statement issued by the NIH today said: “With these two cases, both girls, the total number of polio cases in Pakistan in 2025 has reached 29, including 18 from Khyber Pakhtunkhwa, nine from Sindh, and one each from Punjab and Gilgit-Baltistan.”\n\nThe NIH handout stated that this month, a sub-national polio vaccination campaign was conducted across 88 districts of the country, including Badin and Thatta. “The campaign successfully reached nearly 21 million children under the age of five,” it said.\n\nIt added that the next nationwide polio vaccination campaign would be held from October 13 to 19, aiming to protect around 45.4 million children under the age of five.\n\n“During the campaign, Vitamin A will also be administered alongside the oral polio vaccine (OPV) to boost children’s immunity levels. More than 400,000 dedicated frontline workers will go door-to-door to ensure that every eligible child receives this essential protection,” the NIH said.\n\nThe institute said that these campaigns were aimed at “rapidly boosting children’s immunity and strengthening protection as part of Pakistan’s ongoing efforts to eradicate polio”, encouraging parents and caregivers to ensure their children were vaccinated.\n\n“Polio eradication is a shared responsibility. While dedicated frontline polio workers deliver vaccines, parents and caregivers must ensure their children receive all recommended doses, including routine immunisations,” it said.\n\nIn 2024, the country reported at least 71 polio cases, with the virus detected in around 90 districts.\n\nPolio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine for every child under five during each campaign, along with the timely completion of all essential immunisations.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:17:44.382Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945439/2-new-poliovirus-cases-in-sindh-take-nationwide-tally-for-this-year-to-29",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T09:29:22.000Z"
}
