{
  "title": "Trump says Netanyahu agreed to US-backed Gaza peace plan, thanks Pakistan PM and COAS for support - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Monday that Israeli Prime Minister Benjamin Netanyahu has agreed on a proposal to end the Gaza conflict and thanked Prime Minister Shehbaz Sharif and Chief of Army Staff Field Marshal Asim Munir for their support of the plan.\n\nIn less than two years, Israel’s onslaught on Gaza has killed at least 65,549 people and wounded 167,518, besides displacing millions from their areas. Earlier this month, UN investigators said that Israel was committing genocide in Gaza in a bid to “destroy the Palestinians”, accusing Israel’s prime minister and other top officials of incitement.\n\nTrump announced Netanyahu’s agreement to his plan at a press conference in Washington, DC, ahead of which the White House had released Trump’s 20-point plan for Gaza.\n\nAddressing the press conference, Trump said this was a “big, big day”.\n\n“The prime minister and the field marshal of Pakistan … they were with us right from the beginning. In fact, they just put out a statement that they fully believe in this pact,” Trump stated. “They back this 100 per cent.\n\n“Things that have been going on for hundreds of years, thousands of years … at minimum, we are very, very close and beyond very close,” Trump said, thanking Netanyahu for his role in the peace process. “We worked well together, and have with many other countries, which is how this situation gets solved.”\n\nTrump said that he was aiming for peace in the Middle East at large, not just the Gaza Strip. He added that he and Netanyahu discussed issues like Iran, the Abraham Accords and ending the Gaza conflict.\n\n“This is part of the bigger picture, which is peace in the Middle East … let’s call it ‘eternal’ peace in the Middle East,” he said.\n\nUnited States President Donald Trump said on Monday that Israeli Prime Minister Benjamin Netanyahu, who is visiting the White House, is “very close” to agreeing on a deal to end the Gaza conflict. Addressing a press conference, Trump said this was a “big, big day”. “The prime minister and the field marshal of Pakistan … they were with us right from the beginning. In fact, they just put out a statement that they fully believe in this pact,” Trump stated. “They back this 100 per cent.” The US president also thanked Netanyahu for agreeing to the plan and for “trusting that if we work together, we can bring an end to the death and destruction” in the region. Read more: https://www.dawn.com/news/1945467/ DawnToday\n\n“After extensive consultation with our friends and partners throughout the region, I am formally releasing our principles for peace,” Trump announced, adding that people “have really liked” them.\n\n“These are done with total consideration and working with the nations we are talking about,” he added. “I want to thank the leaders of many Arab and Muslim nations for their tremendous support in developing the proposal, as well as our allies in Europe.\n\nThe US president also thanked Netanyahu for agreeing to the plan and for “trusting that if we work together, we can bring an end to the death and destruction” in the region.\n\n“If accepted by Hamas, this proposal calls for the release of all remaining hostages immediately, but in no case, more than 72 hours,” Trump said. “The hostages are coming back.”\n\nTrump said this means “an immediate end to the war itself”.\n\n“Under the plan, Arab and Muslim countries have committed … to demilitarise Gaza quickly, decommission the military capabilities of Hamas and all other terror organisations and we are relying on the countries we named and others to deal with Hamas and I’m hearing Hamas wants to get this done too.”\n\nTrump added that as part of the agreement, “terror infrastructure”, including tunnels and weapon production facilities, would be dismantled and local police forces would be trained in the Gaza Strip.\n\n“Working with the new transitional authority in Gaza, all parties will agree on a timeline for Israeli forces to withdraw in phases … no more shooting hopefully,” Trump stated.\n\n“Arab and Muslim nations need to be allowed a chance of fulfilling these commitments of dealing with Hamas. They are the one group I have not dealt with,” he added. “If Hamas rejects the deal, which is always possible … I have a feeling that we’re going to have a positive answer, but if not, as you know Bibi (Netanyahu) you have my full backing to do what you have to do.\n\nThe US president emphasised that ultimately, the goal is to eliminate any danger in the reason, which he attributed to Hamas.\n\n“To ensure the success of this effort, my plan calls for the creation of a new international oversight body,” he said, calling it the ‘Board of Peace’ and stating that it would be led by Arab leaders, Israel and Trump himself.\n\n“We’re going to do it right, we’re going to put leaders from other countries on and leaders who are very distinguished,” Trump said. “One of the people who wants to be on the Board is the UK former prime minister Tony Blair.”\n\nTrump said there would be more leaders and that their names would be announced in the coming days.\n\nHe added that the World Bank would be charged with training and recruiting a new government made up of Palestinians and “highly qualified experts from around the world”.\n\n“Hamas and other terror organisations will play no role in the governance of Gaza, at all,” he stated. “It’s time to get our hostages back and try to build something very great and very important.”\n\nHowever, Trump noted that Netanyahu remains opposed to a Palestinian state but said what he is doing today would be good for Israel. He added that the Israeli public wanted an end to the fighting and the return of the hostages.\n\n“Some other countries have foolishly recognised a Palestinian state … but I think they’re very tired of what’s [been] going on for so many decades,” he said. “The people of Israel want it (an end to the fighting).\n\n“I challenge the Palestinians to take charge of their destiny,” Trump added. “If the Palestinian Authority does not complete my reforms … they only have themselves to blame.”\n\nTrump added that this agreement would bring a sustainable, long-term peace and added that “maybe Iran can even get in there”, in relation to the Abraham Accords.\n\n“They could be a member,” Trump added. “I long ago said that Iran would be a member of the Accords.\n\n“This is the closest we’ve ever come to real peace.”\n\n“The leaders discussed a proposal for ending the war in Gaza, prospects for a more secure Middle East, and the need for greater understanding between their countries,” the White House said before a news conference with Trump and the Israeli prime minister.\n\nTrump added that Netanyahu expressed regret for an Israeli attack in Doha to Qatar’s leader in a three-way call in the Oval Office.\n\n“Bibi was talking to Prime Minister al-Thani of Qatar … they really had a heart-to-heart conversation,” the US president said. “We agreed to launch a formal trilateral mechanism between Israel, Qatar and the United States to begin a dialogue to enhance mutual security, correct misperceptions and avoid future misgivings.”\n\nTrump said it was time for Hamas to accept the terms of the proposal, noting that with their leadership mostly killed during the Gaza conflict, Hamas were “not the same people” the US was dealing with.\n\n“Everybody who wants to see an end to the violence and destruction should be united and calling for Hamas to accept the extremely fair proposal, so that we can end the war and get us back our hostages right now and have everlasting peace,” Trump declared.\n\nTaking the floor, Netanyahu thanked Trump for his hospitality and for his friendship and leadership.\n\n“While you focus at home on making America great again, your leadership abroad is changing the world for the better: ending wars and advancing peace,” the Israeli PM said.\n\n“I believe that today, we are taking a critical step towards both ending the war in Gaza and setting the stage for dramatically advancing peace in the Middle East and I think beyond the Middle East — very important Muslim countries.\n\n“I support your plan to end the war in Gaza, which achieves our war aims,” Netanyahu said to Trump. “It will bring back to Israel all of our hostages, dismantle Hamas’ military capabilities and its political rule and ensure that Gaza never again poses a threat to Israel.”\n\nNetanyahu added that the plan would not have been achieved without the “courage and sacrifice of our incredibly brave soldiers”, calling the conflict “a war between civilisation and barbarism”.\n\n“We are taking the next step to win the war and expand the peace,” he stated. “Your (Trump’s) plan is consistent with the five principles my government set for the end of the war and the day after Hamas.\n\n“Here’s our plan: all of our hostages, both those who are alive and those who died, will return home immediately. Hamas will be disarmed. Gaza will be demilitarised. Israel will retain security responsibility, including a security perimeter for the foreseeable future. And lastly, Gaza will have a peaceful civilian administration that is run neither by Hamas, or the Palestinian Authority.”\n\nNetanyahu said that if Hamas agrees to the plan, the first step would be a “modest withdrawal” and the release of all hostages within 72 hours.\n\n“The next step will be the establishment of an international body charged with fully disarming Hamas and demilitarising Gaza,” he added, expressing appreciation for Trump leading the body.\n\n“If this international body succeeds, we will have permanently ended the war. Israel will conduct further withdrawals linked to the extent of disarmament and demilitarisation, but will remain within the security perimeter for the foreseeable future.”\n\nHowever, Netanyahu said that if Hamas rejects or violates the agreement, then Israel “will finish the job by itself”.\n\n“This can be done the easy way … or the hard way, but it will be done. We prefer the easy way, but it has to be done.”\n\nNetanyahu added that after Trump’s statement at the UN General Assembly, he was encouraged against recognising Palestine, stating that it would “reward terrorists, undermine security and endanger Israel’s very existence”.\n\n“I appreciate your (Trump’s) firm position that the PA can have no role in Gaza without undergoing a radical and genuine transformation,” he stated.\n\nNetanyahu said that there needs to be a fundamental change, which would include ending “pay-to-slay”, changing Palestinian textbooks that “teach hatred [of] Jews”, ending “lawfare” at the International Court of Justice and the International Criminal Court and stopping incitement in the media among “many, many other reforms”.\n\nHe added that Trump’s proposal presents a “practical and realistic path forward” in which Gaza would be administered by “those committed to genuine peace with Israel”.\n\n“I think this can be not only a new beginning for Gaza [but] a new beginning for the entire region,” the Israeli PM said, adding that the plan could reenergise the Abraham Accords.\n\nEarlier, PM Shehbaz said in a post on X that he welcomed Trump’s plan to bring the Israeli invasion of Gaza to an end.\n\nHis statement came as the US president greeted Netanyahu at the White House for talks on the US-led peace plan. Before the meeting, Trump had told reporters he was “very confident” that there would be peace in Gaza.\n\nAsked if all parties were on board with his 21-point plan, he repeated, “very confident”.\n\nMeanwhile, PM Shehbaz posted on X: “I welcome President Trump’s 20-point [sic] plan to ensure an end to the war in Gaza.\n\n“I am also convinced that durable peace between the Palestinian people and Israel would be essential in bringing political stability and economic growth to the region,” the PM wrote.\n\nHe added, “It is also my firm belief that President Trump is fully prepared to assist in whatever way necessary to make this extremely important and urgent understanding to become a reality.”\n\nPM Shehbaz also lauded “Trump’s leadership and [his] special envoy Steve Witkoff for their efforts in bringing an end to the nearly two-year-long conflict”.\n\n“I also strongly believe that the implementation of the two-state proposal is essential to ensure lasting peace in the region,” he added.\n\nEarlier in the day, he also spoke to Pakistani journalists in London, where he spoke about Trump’s meeting with Muslims leaders on Gaza in New York last week.\n\nThe meeting on the sidelines of the 80th United Nations General Assembly had brought together leaders from Pakistan, Saudi Arabia, Qatar, the United Arab Emirates, Egypt, Jordan, Turkiye, and Indonesia, who discussed Trump’s proposal for ending the Israeli onslaught in Gaza.\n\nDuring his interaction with journalists in London today, PM Shehbaz “a very constructive discussion took place” at the meeting. He added, “As a result of that meeting, very soon, a positive result may come that in the Gaza war, there may be a ceasefire.”\n\nAdditional input from AFP and Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/29233514abd1930.webp",
  "retrievedAt": "2025-10-12T00:17:47.090Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945467/trump-says-netanyahu-agreed-to-us-backed-gaza-peace-plan-thanks-pakistan-pm-and-coas-for-support",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T16:10:52.000Z"
}
