{
  "title": "Kotri past peak but medium flood persists - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Flood pressure mounts in Nawabshah; rescue efforts intensify\n• Punjab govt sets Oct 4 deadline to plug Sutlej breaches\n• M5 still shut as over 200 villages inundated in south Punjab\n• China airlifts tents, blankets for flood-hit families\n\nHYDERABAD/DADU/ LAHO­RE: Kotri Barrage passed the peak of its medium flood on Sat­urday but remained in a medium-flood state through Sunday evening.\n\nOn Saturday morning, Kotri recorded 421,075 cusecs upstream and 393,560 cusecs downstream, easing to 412,965 and 386,650 cusecs by noon.\n\nOn Sunday, upstream flows were 387,808 cusecs with 362,253 cusecs downstream; some 25,555 cusecs were drawn for the barrage’s four canals. Flood peaks have already moved past Guddu and Sukkur barrages, where flows have normalised.\n\nMeanwhile, high pressure persisted along the Indus at Nasri Bund, Lakhhat Bund, Mid Bangli Bund and Amri Bridge, leading to intensified rescue efforts.\n\nRescue 1122 Shaheed Benazirabad evacuated dozens of residents from Ali Khan Mari village to safer locations and helped move livestock and belongings.\n\nOfficials have termed the situation “alarming” and urged residents in vulnerable areas to remain vigilant and cooperate with rescue teams. Local authorities said they were monitoring embankments and stood ready to take further protective measures.\n\nThe Punjab government has set Oct 4 as the deadline to plug all broken embankments along the Sutlej to contain flooding that has submerged more than 200 villages across Multan, Bahawalpur and Lodhran districts. The villages of Multan’s tehsil Jalalpur Pirwala, Lodhran and Uch Sharif were submerged after Noraja Bhutta embankment at the Sutlej River broke due to extremely high water flow 15 days ago.\n\nThe floodwater passed from these breaches and rose around the Multan-Sukkur Motorway (M5) from Jhangra in the Bahawalpur district to Jalalpur Pirwala. The floodwater passed through M5 after breaching it at several points and created a 20km to 25km-long inland lake between Gilani Road and the motorway.\n\nDue to the breaches, the motorway has been closed for traffic from Uch Sharif interchange to Jalalpur Pirwala for the last 15 days. The closure of all traffic between southern and central Punjab has disrupted supply chains and stranded thousands of vehicles and forced travellers onto perilous alternative routes.\n\nThe situation remains dire in the eastern areas of Jalalpur Pirwala, where villages, including Noraja Bhutta, Basti Lang, Kotla Chakar, Bahadurpur, Mouza Kanu, Kandeer, Jhaiyu, Deepal, Tarut Basharat, Daily Rajanpur, Belaywala, Dunyapur, Jhangra, Muradpur Soiwala and Sabra are surrounded by eight to 10 feet of stagnant water. The relentless pressure has caused widespread destruction of homes and property.\n\nMeanwhile, as the Punjab government earlier this week launched a survey to assess the losses caused by recent floods, the PPP urged PM Shehbaz to accept its demand for providing immediate relief to the flood-affected people through the Benazir Income Support Programme. The PML-N and the PPP — coalition partners at the Centre and in Punjab — have been at odds over how to help the flood victims, with the former’s government in Punjab insisting on using its own resources, while the latter is adamant about using BISP.\n\nPunjab Minister for Irrigation Kazim Ali Pirzada said on Sunday that three out of seven breaches at the Noraja Bhutta embankment on the Sutlej River were plugged completely and they were carrying the work to plug two more breaches. He said that the largest breach was 3,300 feet wide, which, according to the latest updates, was reduced to 1,650 feet.\n\nThe minister said that the Irrigation Department was utilising all its capabilities and resources to ensure that the remaining breaches should be completely plugged by the evening of Oct 4.\n\nHe further stated that the water level in the area is gradually receding. A team of experts will conduct another technical review of the situation on Oct 6 to better plan future measures.\n\nEarlier, Multan Deputy Commissioner Waseem Hamid Sindhu said that the rehabilitation and relief activities for flood victims have been formally initiated. He said that as the river situation has normalised, affected people have started returning to their homes, while the administration continues to provide dry rations in the affected areas.\n\nChina sends relief flights\n\nTwo Chinese relief flights carrying 300 tents and 9,000 blankets landed at Nur Khan Air Base in Rawalpindi on Sunday for families displaced by the floods.\n\nFederal Minister Engr Amir Muqam, NDMA Chairman Lt Gen Inam Haider Malik, Chinese Ambassador Jiang Zaidong and officials from the Foreign Office and NDMA received the consignment.\n\nSpeaking on the occasion, Mr Muqam thanked China for the timely assistance and said that China’s contribution is not only a humanitarian endeavour but also a reaffirmation of the everlasting Pakistan-China friendship.\n\nBakhtawar Mian in Islamabad also contributed to this report\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:25:35.381Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945391/kotri-past-peak-but-medium-flood-persists",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:03:15.000Z"
}
