{
  "title": "Gabriel earns late win for Arsenal at Newcastle - Sport - DAWN.COM",
  "author": null,
  "content": "NEWCASTLE: Arsenal defender Gabriel headed a stoppage-time winner from a corner to secure his side a 2-1 Premier League victory over Newcastle United at St James Park on Sunday and close the gap on leaders Liverpool to two points with a stunning late show.\n\nArsenal climbed to second place in the table with 13 points from six matches while Newcastle are in 15th with six points from the same number of games.\n\nNewcastle took the lead in the 34th minute when Nick Woltemade rose highest to meet a cross from a short corner and head into the net after Arsenal defender Crist­hian Mosquera had needlessly given away the set-piece with a miscued back-pass.\n\nThe visitors were frustrated as they wasted several opportunities, but netted twice late on as Mikel Merino glanced in a header in the 84th minute, before Gabriel found the winner in the 96th.\n\n“To win in the manner that we have done it, wow, what a feeling!” Arsenal boss Mikel Arteta said.\n\nLiverpool’s first defeat of the season at Crystal Palace on Saturday had handed Arsenal the chance to close in at the top of the table.\n\nFor a long time it looked like Arteta’s men would let that opportunity slip by in a bad-tempered encounter on Tyneside.\n\nBut the manner of victory will give the Gunners belief this is their season after finishing second in each of the last three campaigns.\n\nEarlier on Sunday, Ollie Watkins ended his barren spell in front of goal as Aston Villa came from behind to beat Fulham 3-1 for their first Premier League win of the season.\n\nChampions League quarter-finalists last season, Villa began the day in the relegation zone after taking just three points from their opening five league games.\n\nUnai Emery’s men got off to another woeful start when Raul Jimenez headed in Sasa Lukic’s corner after just three minutes. Watkins’ long wait for a goal has played a major factor in Villa’s slow start to the season.\n\nHowever, his 11-game scoreless streak came to an end with a cushioned lob over Bernd Leno to turn the game around just before half-time.\n\nVilla then took control with two goals in as many minutes just after the break.\n\nJohn McGinn blasted into the bottom corner from outside the box to give the home side the lead.\n\nAnother Watkins burst in behind created the third as his low cross was fired in by Emi Buendia.\n\nVictory lifts Villa up to 16th, two points behind Fulham, who slip to 10th.\n\nOn Saturday, Tottenham Hot­s­pur needed a 94th minute equaliser from Joao Palh­inha to rescue a 1-1 draw at home to bottom-of-the-table Wolverhampton Wanderers.\n\nNewly-promoted Sunde­rland are up to fourth after Omar Alderete scored the only goal at the City Ground to leave Ange Postecoglou still without a win as Nottingham Forest manager.\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d9a38bd8e07.gif",
  "retrievedAt": "2025-10-12T04:25:54.325Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945350/gabriel-earns-late-win-for-arsenal-at-newcastle",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:05:28.000Z"
}
