{
  "title": "FBR says deadline for filing income tax returns will not be extended beyond tomorrow - Business - DAWN.COM",
  "author": null,
  "content": "The Federal Board of Revenue (FBR) said on Monday that the deadline for filing income tax returns for the 2025 tax year would not be extended beyond September 30 (Tuesday).\n\nIn a statement, the board said: “The FBR has taken notice of unverified reports circulating on various media platforms claiming that the deadline for filing income tax returns for tax year 2025 will be extended.\n\n“Some elements have also attempted to link this perceived extension to the recent floods.”\n\nMillions of people have been affected and hundreds of casualties have been reported across the country during the recent floods and monsoon rainfall.\n\n“It is pointed out that a vast majority of taxpayers reside in areas unaffected by floods and have had ample time to discharge their national obligation of filing returns,” the FBR said.\n\nIt also termed reports suggesting that the board’s Integrated Risk Information System (Iris) had slowed as “unfounded”. It added that the system was “fully operational, functioning smoothly, and taxpayers can easily file their returns using the new simplified income tax return form”.\n\nFurthermore, taxpayers were also cautioned about the failure to file returns by the due date, with the FBR saying that it would “result in late-filer status and imposition of penalties under the law”.\n\nIt urged all eligible taxpayers to act responsibly and file their income tax returns with “accuracy and honesty” before the deadline of September 30, 2025 to avoid any legal consequences.\n\n“In case of extreme hardship, the taxpayers can avail an extension of return up to fifteen days with payment of due taxes by September 30 subject to approval by the relevant committee as per law,” it added.\n\nLast week, in a dramatic U-turn, the government had scrapped the asset valuation column from the tax return form for 2025 — just a day after issuing a strongly worded clarification — bowing to mounting pressure from various stakeholders.\n\nPrime Minister Shehbaz Sharif had formed a high-powered committee led by Law Minister Azam Nazeer Tarar to examine the new column in the IRIS tax return system that required the declaration of estimated fair market value of movable and immovable assets.\n\nAfter consultations with top tax officers, the committee had decided to remove the estimated market value column from the 2025 income tax return form on the directives of the prime minister.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/291629349f6b48f.webp",
  "retrievedAt": "2025-10-12T00:17:43.511Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945449/fbr-says-deadline-for-filing-income-tax-returns-will-not-be-extended-beyond-tomorrow",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T11:49:46.000Z"
}
