{
  "title": "Four mortar blast victims laid to rest in Bajaur - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR: Hundreds of people on Sunday attended the funeral prayers of the four teenagers, who were killed in the Saturday’s mortar shell explosion in Laghari area of Lowi Mamund tehsil here.\n\nThe funeral prayers of Sajad Khan, 18, Nawshad Khan, 13, Fawad Khan, 18, and Jawad Khan, 15, were led by Sahibzada Haroon Rashid, emir of Jamaat-e-Islami’s local chapter and head of the Bajaur Aman Jirga.\n\nLater, the deceased were laid to rest in their ancestral graveyard.\n\nEarlier, addressing the participants of the funeral, Mr Rashid attributed the blast to the ongoing operation against terrorists in the region.\n\nHe pointed out that ensuring the safety and security of citizens and their properties was the responsibility of the government.\n\nThe Jamaat leader claimed there was no marked improvement in the security situation in the region despite the operation against terrorists.\n\nThe JI local head urged the federal government to address the longstanding unrest in Bajaur and other areas.\n\nFour young individuals lost their lives, and two others sustained critical injuries when an unexploded mortar shell went off in a field in Laghari area of Lowi Mamund tehsil on Saturday afternoon.\n\nThough the police have not disclosed any details about their investigation into the explosion, sources claim it was a mortar shell, which had been left behind by terrorists fleeing the region.\n\nMeanwhile, the police on Sunday asked the local residents to inform the nearest police station or bomb disposal squad if they spotted any explosive device in their areas, warning that such devices might be present in various localities.\n\nThe residents of the areas of Lowi and War Mamund tehsils, where the operation against terrorists was conducted, are asked to instantly inform the authorities concerned if they spotted any suspected device in their areas, according to a statement issued from the district police officer’s office.\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d99bd71196a.gif",
  "retrievedAt": "2025-10-12T00:17:58.411Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945311/four-mortar-blast-victims-laid-to-rest-in-bajaur",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:13:17.000Z"
}
