{
  "title": "One killed, several injured in US church shooting - World - DAWN.COM",
  "author": null,
  "content": "GRAND BLANC: One person was killed and several others injured on Sunday after a shooter targeted a Mormon church in the US state of Michigan, where the building was also set on fire, authorities said.\n\nThe suspect, a 40-year-old man from a nearby town, was shot dead by law enforcement after the attack, police said, without specifying any possible motive.\n\nPresident Donald Trump called the shooting “horrendous” and said on his Truth Social platform it “appears to be yet another targeted attack on Christians in the United States of America”.\n\nImages from the scene showed emergency services escorting people on stretchers and a large plume of dark smoke at the Church of Jesus Christ of Latter-day Saints in Grand Blanc Township.\n\nLocal police chief William Renye told reporters the suspect drove his vehicle through the front doors of the church and then began firing at people inside with an assault rifle.\n\nHe said the service was active with “hundreds of people within the church”.\n\nAuthorities believe the gunman also deliberately set fire to the church before he was killed by responding police officers, Renye said. Ten gunshot victims were transported to hospital, including one who has died, the official said.\n\nHe added that the fire had been extinguished but that “we do believe that we will find additional victims once we have that scene secure.”\n\nA woman who lives near the church said: “My husband heard people screaming, one lady yelling for help.”\n\nFBI agents are on the scene to assist the investigation, chief Kash Patel said on X.\n\n“Violence in a place of worship is a cowardly and criminal act. Our prayers are with the victims and their families during this terrible tragedy,” he wrote.\n\nAttorney General Pam Bondi also said she had been briefed on the incident.\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/291147395af1b76.webp",
  "retrievedAt": "2025-10-12T00:18:10.775Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945377/one-killed-several-injured-in-us-church-shooting",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:04:58.000Z"
}
