{
  "title": "Pak-Saudi pact aims to contain Israeli threat: ex-senator - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A new defence pact between Pakistan and Saudi Arabia was forged in response to a perceived rising threat of “Greater Israel” aggression and a consequential loss of confidence in American security guarantees in the Middle East, former Pakistani Senator Mushahid Hussain said on Sunday.\n\nSpeaking at the launch of a new research report in Islamabad, Hussain identified the agreement’s two key architects as Field Marshal Syed Asim Munir and Saudi Crown Prince and Prime Minister Mohammed bin Salman. He asserted that the pact would serve as a bulwark to contain what he described as an “emerging Indo-Israeli Axis”.\n\nSenator Hussain, who heads the Pakistan-China Institute think tank, pres­ented these views during the release of the report “Pakistan & Saudi Arabia: Mus­lim World’s Strategic Security Partners”.\n\nHe cited three primary reasons for the timing and necessity of the landmark defence agreement. The first, he expl­a­ined, was Israeli aggression against Qatar, a US-allied nation where representatives from both Israel and the US had previously met the Palestinian resistance movement, Hamas. He said this demonstrated Israel’s intention to impose regional hegemony through military force.\n\nThe second reason, according to him, is the void left by Washington’s failure to act, positioning Pakistan as a viable security alternative in the Middle East.\n\nMushahid says deal reflects waning confidence in US security guarantees for Muslim nations\n\n“Pakistan emerged as a security altern­ative in the Middle East after the vacuum created by the US failure to prevent or oppose the Israeli attack on Qatar,” Mr Hussain said, while calling this a “turning point” after the US failed play the role of providing protection, “thereby indicating that the United States could no longer be relied upon as a protector of the security of friendly Muslim countries in the region”.\n\nConsequently, he argued, regional powers were seeking new alliances. “The Mus­lim countries in the region have now sta­r­t­ed looking at new security options,” Mr Hussain said, adding that Pakistan’s hist­o­ry of defence cooperation made it “a feas­ible alternative to provide effective secur­i­ty for Muslim states, as and when needed”.\n\nThe third driver for the agreement, he said, was Pakistan’s demonstration of its military capabilities when it successfully defended itself against Indian aggression in a future conflict.\n\n“Pakistan has proved its muscle in the military domain when it successfully def­ended against Indian aggression in May, in fact, giving a bloody nose to a numerically superior and a larger and stronger adversary,” he said, adding that this was “a fact that has been confirmed by none other than President Trump”.\n\nThis proved “Pakistan has demonstrated the will, skill and capability and the political and military strength to take on and defeat India,” he said. He claimed that during that conflict, Israeli Harop drones were used against Pakistan, and Pakistani forces shot down over 80 of them, showcasing both defensive and offensive prowess.\n\nIn its new proactive role, he said, Pak­istan and Saudi Arabia have established a new template for regional security, creating a “natural combination of Pakistan’s military muscle and Saudi Arabia’s economic strength to provide for deterrence against any kind of aggression”.\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://www.dawn.com/news/amp/1942686",
  "retrievedAt": "2025-10-12T00:18:12.318Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945368/pak-saudi-pact-aims-to-contain-israeli-threat-ex-senator",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:04:33.000Z"
}
