{
  "title": "UN’s birthday blues - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE UN marks 80 years of its founding in a state of uncertainty with its credibility increasingly in question.\n\nThe General Assembly’s high-level week was dominated by Palestine and the war in Gaza. This brought into sharp focus the UN’s failure to live up to its core mission and primary responsibility of maintaining international peace and security. True it is big powers who are to blame for the UN’s paralysis in stopping the wars in Gaza and Ukraine. But UN inaction and lack of activist diplomacy on issues of war and peace have left its reputation damaged.\n\nUN Secretary-General António Guterres has repeatedly warned that trust in global institutions is at a breaking point with ailing multilateral organisations in need of urgent reform. The loss of faith in multilateralism, he has said, is because people see “broken promises, unmet commitments, double standards, and vast inequalities”.\n\nAlthough multilateralism has been under stress for well over a decade President Donald Trump’s conduct has accelerated this trend and magnified the pressure. US disengagement from the UN is reflected in its exit from WHO, Unesco, UNRWA (UN Relief and Works Agency for Palestine Refugees) and decision to stop funding and withdraw from the Human Rights Council. Trump’s unilateralist actions have also shown contempt for the principles of the UN Charter.\n\nOther big states and regional powers have also played their part by acting in defiance of international law and violating the UN Charter. In a recent essay in The Economist co-authored with Helen Clark, former UNSG Ban Ki-moon wrote: “The UN is slipping into dysfunction as some of its traditional champions, notably the United States, retreat from multilateral cooperation, cut funding and disregard the rule of law when it suits them.”\n\nAt the heart of UN’s dysfunction lies the Security Council’s paralysis.\n\nThe contrast could not have been sharper during UNGA’s high-level week. Kicking off the debate, Guterres said the world needed the UN’s “unique legitimacy” and convening power. To no one’s surprise, Trump voiced his characteristic disdain for the UN. He lashed out at the world body on several counts and falsely accused it of funding migrants to ‘invade’ Western countries.\n\nJust before he spoke, Brazil’s President Luiz Inácio Lula da Silva said multilateralism is at a new crossroads, with the ideals that inspired the UN’s founders under unprecedented threat. He lamented the UN’s weakening authority while calling on it to revive its role as a “promoter of equality, peace, sustainable development, diversity and tolerance”.\n\nIn fact, the common refrain in speeches at the debate was the UN’s ineffectiveness at a time when it is needed most to deal with multiple challenges. Many leaders condemned the resort to unilateralism by some and stressed the need to strengthen multilateralism. They also urged the UN to reclaim and reassert its authority.\n\nBeyond these speeches, the widespread view across the world is that the UN has become increasingly irrelevant as it acts as a bystander in wars and crises. If the UN is seen as failing to deliver on its core goal of maintaining international peace and security, the rest of what it does (some of it quite well; say, on the development pillar of its mandate and humanitarian initiatives) fades into insignificance. It is on the peace and security pillar that the UN is judged by governments and publics everywhere and seen not to be ‘fit for purpose’.\n\nThat is the Security Council’s responsibility but deadlock and rivalry between the big powers — its five veto-wielding permanent members — prevents the Council from acting. Nothing illustrates this better than the two main wars of the moment in Gaza and Ukraine.\n\nThe US has been the obstacle in ending the war Israel imposed on Gaza, exercising the veto six times in the past two years to scotch ceasefire resolutions. This marks a continuity in Washington’s policy which over decades has seen it use the veto 51 times to shield Israel. On Ukraine, Russia has used the veto several times on resolutions against its 2022 invasion. This has left the Security Council completely logjammed.\n\nIn response to rising criticism of the UN and funding cuts, the secretary general announced the UN 80 reform initiative. This seeks to build on previous reforms in management, development and peace and security. It is aimed at streamlining mandates and making the UN leaner and more efficient. But this is unlikely to change much.\n\nDriven by funding shortages, these reforms may be used to end mandates deemed as “inefficient” on politically motivated grounds and reflecting the priorities of big powers. This will make the reform process disputed.\n\nIn any case, what is consequential to the UN’s effectiveness and credibility is reform of the Security Council. What lies at the heart of UN dysfunction is the Council’s paralysis. As usual, calls for its reform were heard from world leaders during UNGA. Negotiations have been going on in the General Assembly for over 20 years but with little progress except agreement on expanding the Council. The veto continues to be a source of intense contention.\n\nThe principal disagreement is between countries that aspire for permanent seats for themselves and others who oppose more permanent members and, instead, propose enlarging the Council by adding more elected, non-permanent members. This has put the G4 — Germany, Japan, India and Brazil — at odds with the Uniting for Consensus (UFC) countries led by Italy and including Pakistan.\n\nThe UFC seeks a more representative, accountable and effective Council by adding elected members who can counter-balance the power of the veto-wielding P5 countries. It argues the Council’s chronic deadlocks are due to discord and clashing interests of the P5, which prevents it from playing its due role. Adding more veto-empowered permanent members will compound this dysfunction, not end it.\n\nEven if the impasse is overcome, reform is a complicated process that requires amendment of the UN Charter. This involves the General Assembly adopting a resolution by a two-thirds majority, which then has to be ratified by at least two-thirds of the UN membership as well as the P5. This makes reform a remote possibility. It will be up to the General Assembly to mount pressure on the big powers to allow the Council to function. Unfortunately, the prospect of that too is not bright.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d9bfa862442.jpg",
  "retrievedAt": "2025-10-12T04:25:29.937Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945406/uns-birthday-blues",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:12:00.000Z"
}
