{
  "title": "Clashes break out in Lahore after raid on TLP HQ goes awry - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Violence broke out in the city late on Wednesday night, after police launched a crackdown on the headquarters of Tehreek-i- Labbaik Pakistan (TLP) in a bid to arrest its chief, Saad Rizvi.\n\nAt least three police constables were reportedly injured in clashes with enraged TLP supporters, who attacked law enforcers with stones and iron rods. Police responded with tear-gas shelling, turning Multan Road into a battleground.\n\nVideos shared on social media, which could not be immediately verified by Dawn, showed TLP activists running as police fired tear gas. Other clips showed TLP activists holding up spent bullet casings and tear gas shells.\n\nThe crackdown on TLP’s central office came after the group annou­nced plans for a massive anti-Israel demonstration outside the US emb­as­sy in the federal capital on Friday.\n\nIn anticipation of the protest, the Islamabad administration has also begun placing shipping containers at Faizabad Interchange — the historic site of several TLP sit-ins.\n\nA statement issued by TLP in the early hours of Thursday claimed a number of their workers had been arrested, condemning raids on their supporters’ homes.\n\nPolice sources said that the group had called a large number of supporters to Lahore, who had taken up position in temporary shelters. These elements attacked police parties as they moved in to raid the TLP main office.\n\nArmed with stones, clubs and iron rods, the enraged TLP men managed to push police back. Clashes were on­­going at the time of going to press.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/09085416bc3a195.webp",
  "retrievedAt": "2025-10-12T00:18:24.972Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947558/clashes-break-out-in-lahore-after-raid-on-tlp-hq-goes-awry",
  "dateList": "2025-09-29",
  "date_published": "2025-10-09T02:17:21.000Z"
}
