{
  "title": "Varma guides India to Asia Cup final triumph over Pakistan - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: Tilak Varma hit an unbeaten 69 as India defeated Pakistan by five wickets for a record-extending ninth Asia Cup title with no handshakes between the sides again on Sunday.\n\nChasing 147 for victory, India depended on Varma’s 53-ball knock and a key 60-run stand with fellow left-hander Shivam Dube to reach their target with two balls to spare in Dubai.\n\nDube got out for 33 at the end of the 19th over and, with India needing 10 off the last six deliveries, Varma struck a six and Rinku Singh hit the winning boundary as the pair ran off to celebrate with their team, leaving Pakistan to shake hands among themselves.\n\nKuldeep Yadav set up India’s third victory over their rivals in the regional tournament played under the T20 format as his figures of 4-30 helped bowl out Pakistan for 146.\n\nIndia were in trouble at 3-20 and 4-77, but Varma kept calm to anchor the chase as he hit three fours and four sixes in his knock.\n\nWicketkeeper-batsman Sanju Samson’s 24 and then a supporting knock by Dube took India home at a nearly packed stadium dominated by Indian fans.\n\nThe two neighbours came into the title clash with tensions high from their previous two clashes in the competition, which witnessed political posturing and aggressive on-field behaviour.\n\nIndia pace bowler Jasprit Bumrah raised the heat in the first innings on Sunday when he bowled Haris Rauf for six and made a gesture similar to the one the Pakistan bowler had done to the crowd in the previous meeting between the two teams.\n\nPut in to bat after no handshakes at the toss, Pakistan started strongly as openers Sahibzada Farhan, who made 57, and Fakhar Zaman, who made 46, put on 84 runs but the team slipped from 113-1 to be bowled out in 19.1 overs.\n\nSahibzada fell after his second fifty in this edition of the Asia Cup after the batter attempted a second successive six off spinner Varun Chakravarthy.\n\nFakhar took charge and along with Saim Ayub kept up the attack with regular boundaries until Kuldeep struck in the 13th over.\n\nSaim fell to Kuldeep’s left-arm wrist spin as Pakistan lost six wickets for 21 runs.\n\nFakhar fell short of his fifty and Kuldeep struck with three wickets in the 17th over, including skipper Salman Ali Agha for eight.\n\nIndia and Pakistan met earlier in the competition for the first time after deadly fighting between the nuclear-armed neighbours, who have not played a bilateral series in over a decade.\n\nThe two only meet in multi-nation tournaments at neutral venues as part of a compromise deal.\n\nIndia comfortably won their earlier two matches. In the group match, India skipper Suryakumar Yadav had refused to shake hands with Pakistan counterpart Agha and the two teams kept up the stance for the rest of the tournament.\n\nThe Asia Cup was widely seen as a dress rehearsal for the T20 World Cup to be co-hosted by India and Sri Lanka in February-March of next year.\n\nSCOREBOARD\n\nPAKISTAN:\n\nSahibzada Farhan c Varma b Varun 57\n\nFakhar Zaman c K. Yadav b Varun 46\n\nSaim Ayub c Bumrah b K. Yadav 14\n\nMohammad Haris c Singh b Patel 0\n\nSalman Ali Agha c Samson b K. Yadav 8\n\nHussain Talat c Samson b Patel 1\n\nMohammad Nawaz c Singh b Bumrah 6\n\nShaheen Shah Afridi lbw b K. Yadav 0\n\nFaheem Ashraf c Varma b K. Yadav 0\n\nHaris Rauf b Bumrah 6\n\nAbrar Ahmed not out 1\n\nEXTRAS (B-1, LB-2, W-4) 7\n\nTOTAL (all out, 19.1 overs) 146\n\nFALL OF WICKETS: 1-84 (Sahibzada), 2-113 (Saim), 3-114 (M. Haris), 4-126 (Fakhar), 5-131 (Hussain), 6-133 (Salman), 7-134 (Shaheen), 8-134 (Faheem), 9-141 (Haris)\n\nBOWLING: Dube 3-0-23-0, Bumrah 3.1-0-25-2, Varun 4-0-30-2, Patel 4-0-26-2, K. Yadav 4-0-30-4 (4w), Varma 1-0-9-0\n\nINDIA:\n\nA. Sharma c Haris b Faheem 5\n\nS. Gill c Haris b Faheem 12\n\nS. Yadav c Salman b Shaheen 1\n\nT. Varma not out 69\n\nS. Samson c Sahibzada b Abrar 24\n\nS. Dube c Shaheen b Faheem 33\n\nR. Singh not out 4\n\nEXTRAS (W-2) 2\n\nTOTAL (for five wickets, 19.4 overs) 150\n\nDID NOT BAT: A. Patel, K. Yadav, V. Chakravarthy, J. Bumrah\n\nFALL OF WICKETS: 1-7 (Sharma), 2-10 (S. Yadav), 3-20 (Gill), 4-77 (Samson), 5-137 (Dube)\n\nBOWLING: Shaheen 4-0-20-1, Faheem 4-0-29-3, Nawaz 1-0-6-0, Haris 3.4-0-50-0 (1w), Abrar 4-0-29-1 (1w)\n\nRESULT: India won by five wickets.\n\nPakistan’s sub-par batting show at Asia Cup\n\n(Tabulated under player, matches, innings, runs, highest, average, strike-rate)\n\nSahibzada Farhan 7 7 217 58 31.00 116.04\n\nFakhar Zaman 7 7 181 50 30.16 120.66\n\nMohammad Haris 7 6 131 66 21.83 133.67\n\nMohammad Nawaz 7 7 113 38* 18.83 136.14\n\nShaheen Shah Afridi 7 5 83 33* 41.50 176.59\n\nSalman Ali Agha 7 7 72 20 12.00 80.89\n\nHussain Talat 4 4 46 32* 15.33 92.00\n\nSaim Ayub 7 7 37 21 5.28 97.36\n\nPublished in Dawn, September 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/29080411b3ccdb1.webp",
  "retrievedAt": "2025-10-12T00:17:59.695Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945347/varma-guides-india-to-asia-cup-final-triumph-over-pakistan",
  "dateList": "2025-09-29",
  "date_published": "2025-09-29T01:05:28.000Z"
}
