{
  "title": "Sindh CM Murad orders crackdown on vehicles with fancy number plates - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sindh Chief Minister Syed Murad Ali Shah on Wednesday directed police to launch a crackdown on vehicles with fake or fancy number plates from next month.\n\nChairing a high-level meeting to review the progress of the Karachi Safe City project, the CM emphasised that the Safe City Authority should begin using facial recognition technology to identify suspicious individuals travelling in vehicles or moving on the roads beginning next month, to ensure the project’s objectives are met.\n\nThe meeting, held at the Chief Minister House, was attended by Home Minister Zia-ul-Hasan Lanjar, Chief Secretary Asif Haider Shah, Inspector General of Police Ghulam Nabi Memon, Sindh Safe Cities Authority director general Asif Ijaz Sheikh and other senior officials.\n\nThe CM said that the initiative would improve traffic management and law enforcement.\n\nHe also asked the Safe City Authority to arrange 110 emergency response vehicles to boost mobile surveillance.\n\nHe said these vehicles would strengthen CCTV coverage and improve patrolling efficiency.\n\nThe chief minister instructed officials to replicate the Safe City project in Hyderabad and Sukkur, extending the initiative’s benefits beyond Karachi.\n\nOfficials reported that procurement of key equipment, including hardware and surveillance systems, has been completed. Over 300 poles for CCTV cameras have been installed, with foundations laid for 200 more.\n\nSpeaking on the occasion, CM Shah expressed satisfaction with the project’s progress but stressed the need for timely completion. “This is a vital step toward improving public safety and curbing crime in Karachi,” he said.\n\nThe Karachi Safe City project is expected to serve as a model for modern urban security, with its expansion reflecting the Sindh government’s commitment to enhancing safety across the province.\n\nPublished in Dawn, January 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:41:11.069Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882525/sindh-cm-murad-orders-crackdown-on-vehicles-with-fancy-number-plates",
  "dateList": "2025-01-02",
  "date_published": "2025-01-02T03:02:12.000Z"
}
