{
  "title": "Punjab government urged to raise minimum age for girls’ marriage - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Participants of an awareness session on Wednesday urged the Punjab government to raise the minimum age of marriage for girls from 16 to 18 years in the province to ensure a safe future for them.\n\nThey were attending an event organised by the Potohar Organisation for Development Advocacy (Poda) in collaboration with the Norwegian embassy in Islamabad.\n\nTitled ‘Reduce Early Marriages to Enhance Gender Equality’, the moot unanimously agreed to advocate for an amendment to the Child Marriage Restraint Act 2015.\n\nThe resolution aimed to safeguard adolescent girls’ fundamental rights, including access to education, reproductive health services and employment opportunities.\n\nThe session drew diverse participants, including academicians, members of bar associations, health professionals, rights activists and government officials.\n\nSpeaking at the event, legal expert Advocate Khawaja Zahid Nasim presented an overview of the prevailing laws concerning child marriages.\n\nHe referred to the Lahore High Court’s verdict on the definition of ‘child’ in Section 2 (a) of the Child Marriage Restraint Act 1929 and termed it unconstitutional.\n\nHe said the Sindh Child Marriage Restraint Act sets the minimum age for girls and boys at 18 years.\n\nThe legal expert also said that around 40 other Muslim countries have set the minimum marriage age for girls at 18 years to combat child marriages. Project Manager at Poda Nabeela Aslam emphasised that child marriages constituted a gross violation of human and child rights.\n\nBy depriving children of their childhood, education and economic empowerment opportunities, child marriages exacerbate the severe marginalisation of already vulnerable children, she said.\n\nShe pointed out that underage marriages disproportionately affect vulnerable girls, who were often malnourished, illiterate and powerless to advocate for their rights.\n\nAdvocate Bano Jahangir emphasised the importance of timely nikah registration, highlighting it as a common issue. She briefed that typically when parents marry off their underage daughters, they do not get their nikah registered.\n\n“When children are born from such unions, complications arise in legitimising the marriage,” she added. Dr Mariam Nawaz, a doctor at a government hospital, shed light on the alarming health consequences of child marriages.\n\nPublished in Dawn, January 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:41:09.848Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882560/punjab-government-urged-to-raise-minimum-age-for-girls-marriage",
  "dateList": "2025-01-02",
  "date_published": "2025-01-02T03:01:41.000Z"
}
