{
  "title": "IHC grants bail to accused in multi-billion rupee fraud - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) on Wednesday granted bail to an accused in a Rs40b tax fraud case.\n\nIHC’s Justice Babar Sattar granted bail to a branch manager of the First Women Bank, Imperial Court Branch, Karachi, who was arrested for allegedly aiding and abetting in a sales tax fraud case.\n\nAlthough the Federal Board of Revenue (FBR) claimed the embezzlement amounted to the tune of Rs40b, the court observed that it just amounted to Rs3.2b.\n\nThe case stems from an FIR registered under Section 2 (37) of the Sales Tax Act, 1990.\n\nCourt rules criminal liability not established against bank manager\n\nA private company has been accused of seeking tax benefits using fraudulent invoices.\n\nThe petitioner, however, was not named in the FIR, and his counsel argued that there was no evidence of his involvement in the alleged fraud.\n\nIt was contended that the petitioner, as a bank manager, had no role in the company's business operations.\n\nThe court ruled that criminal liability in tax fraud cases was contingent upon the prior determination of tax liability through an assessment process.\n\nReferring to the Lahore High Court’s judgment in Taj International (Pvt) Ltd versus FBR (2014), the court emphasised that pre-trial actions cannot proceed without assessment.\n\nThe state counsel argued that civil and criminal proceedings could run simultaneously.\n\nHowever, the court found no material evidence implicating the petitioner.\n\nThe judgment also criticised tax officials for abusing their powers.\n\nThe court noted that this conduct undermined constitutional rights.\n\nAs per the investigation report, tax authorities have uncovered a massive fraud scheme involving two leading battery manufacturers.\n\nThe companies are accused of propping up a network of fake companies and rerouting financial transactions to evade taxes amounting to billions of rupees.\n\nSleuth revealed that both companies, part of the ACM group, benefited from fake invoices.\n\nThe alleged dummy suppliers were created and registered under the names of low-income individuals, including labourers, and transactions through these dummy entities were rerouted back to the battery manufacturers, creating a facade of compliance.\n\nThe investigation report found that four immediate suppliers of Pakistan Accumulators—Omega Metals Treatment (Pvt) Ltd, Wahid Metals (Pvt) Ltd, Prime Smelters (Pvt) Ltd and Yazman Traders (Pvt) Ltd—declared supplies worth Rs46.72 billion over five years.\n\nHowever, investigations revealed these suppliers were non-existent at their listed business addresses.\n\nProbes into the bank accounts of Yazman Traders (Pvt) Ltd revealed staggering transactions of Rs14.55 billion, with funds rerouted to the manufacturers.\n\nAs per the investigation, Kinesis Energy declared fake supplies of lead worth Rs6.1 billion to Pakistan Accumulators and Rs3.5 billion to ACM Hi-Tech Engineering.\n\nPublished in Dawn, January 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:01:21.413Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882504/ihc-grants-bail-to-accused-in-multi-billion-rupee-fraud",
  "dateList": "2025-01-02",
  "date_published": "2025-01-02T03:02:28.000Z"
}
