{
  "title": "New Orleans attack suspect acted alone, supported Islamic State: FBI - World - DAWN.COM",
  "author": null,
  "content": "A US Army veteran who drove a truck into a crowd of New Year’s Day revellers had pledged allegiance to the banned militant Islamic State (ISIS) group but acted alone in the attack that killed at least 14 people, the Federal Bureau of Investigation (FBI) said on Thursday.\n\nThe suspect, who was shot dead at the scene after firing at police, was identified as Shamsud-Din Jabbar, a 42-year-old Texan who once served in Afghanistan.\n\nHe drove from Houston to New Orleans on December 31 and posted five videos on Facebook between 1:29am and 3:02am on the morning of the attack in which he said he supported ISIS, the militant group with fighters in Iraq and Syria, the FBI said.\n\nIn the first video, Jabbar explains he had previously planned to harm his family and friends but was concerned that the media coverage would not focus on the “war between the believers and the disbelievers”, FBI Deputy Assistant Director Christopher Raia said at a press conference.\n\nJabbar also said in the videos that he had joined IS before last summer and provided his last will and testament, Raia said.\n\n“This was an act of terrorism,” Raia said. “It was premeditated and an evil act.”\n\nNew Orleans officials said the Sugar Bowl college football game that was scheduled for Wednesday in a New Year’s Day tradition would take place on Thursday afternoon. The city will also host the National Football League’s Super Bowl next month.\n\nThe FBI said there appeared to be no link between the attack in New Orleans and the episode in Las Vegas on the same day in which a Tesla Cybertruck packed with gasoline canisters and large firework mortars exploded in flames outside the Trump International Hotel in Las Vegas, just weeks before President-elect Donald Trump returns to the White House on January 20.\n\nThe injured victims in the New Orleans attack included two police officers wounded by gunfire from the suspect, taking place a mere three hours into the new year on Bourbon Street in the historic French Quarter.\n\nAt least 15 people were killed, including the suspect, the FBI said. Among the victims was the mother of a four-year-old who had just moved into a new apartment after getting a promotion at work, a New York financial employee and accomplished student-athlete who was visiting home for the holidays, and an 18-year-old aspiring nurse from Mississippi.\n\nWitnesses described a horrifying scene. “There were people everywhere,” Kimberly Strickland of Mobile, Alabama, said in an interview. “You just heard this squeal and the rev of the engine and this huge loud impact and then the people screaming and debris — just metal — the sound of crunching metal and bodies.”\n\nMeanwhile, authorities in other US cities said they had boosted security, including at Trump Tower and Times Square in New York City, adding that there were no immediate threats.\n\nIn Washington, police also said they had increased their presence as the capital prepares to host three major events this month: Congress’ January 6 certification of President-elect Trump’s election win, the January 9 state funeral for former president Jimmy Carter and Trump’s January 20 inauguration.\n\nThe FBI said an ISIS flag was found on the trailer hitch of the rented vehicle involved in the New Orleans attack.\n\nUS President Joe Biden condemned what he called a “despicable” act.\n\nPublic records showed Jabbar worked in real estate in Houston. In a promotional video posted four years ago, Jabbar described himself as born and raised in Beaumont, a city about 130 kilometres east of Houston.\n\nJabbar was in the regular army from March 2007 until January 2015 and then in the army reserve from January 2015 until July 2020, an army spokesperson said. He deployed to Afghanistan from February 2009 to January 2010 and held the rank of staff sergeant at the end of service.\n\nISIS is a militant group that once imposed a reign of terror over millions of people in Iraq and Syria until it collapsed following a sustained military campaign by a US-led coalition. Even as it has been weakened in the field, ISIS has continued to recruit sympathisers online, experts say.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/02230700852268d.jpg",
  "retrievedAt": "2025-08-26T06:01:05.863Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882619/new-orleans-attack-suspect-acted-alone-supported-islamic-state-fbi",
  "dateList": "2025-01-02",
  "date_published": "2025-01-02T09:08:46.000Z"
}
