{
  "title": "Govt notifies pension reforms to cut expenses - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Multiple emoluments abolished, pension to be calculated on average of salary drawn over last two years of service\n• Future benefits curtailed; penalties for voluntary retirement on the cards\n\nISLAMABAD: The government on Wednesday notified major reforms to the country’s pension system, abolishing multiple pensions and shifting future pensionable benefit calculations to an average of the salaries drawn over the last two years of service, instead of the last pay drawn before retirement.\n\nIn a series of notifications issued on the first day of 2025, the Ministry of Finance said these changes had been approved on the recommendations of the Pay and Pension Commi­ssion-2020 (PPC) and come into force with immediate effect.\n\nThese were announced as part of the 2024-25 federal budget and approved by the Economic Coordination Committee (ECC) of the Cabinet in June last year for implementation with effect from July 1, 2024, but were notified after six months.\n\nAccording to the first notification, henceforth “pension shall be calculated on the basis of average of pensionable emoluments drawn during last 24 months of service prior to retirement”. This puts new pensioners at a disadvantage, who were earlier entitled to such benefits on the basis of the last pay drawn on retirement.\n\nIn the second order, the finance ministry said that “in the event where a person becomes entitled to more than one pension, such [a] person shall only be authorised to opt to draw one of the pensions”. This is subject to the provision that “where a federal government employee becomes entitled to a pension, such federal government employee shall be not eligible to receive such pensions”.\n\nIn addition, “the in-service/pensioner spouse shall be eligible for pension of his/her spouse in addition to his/her own pay/pension”. This decision was announced in parliament by then-finance minister Ishaq Dar as part of the 2023-24 budget, but remained unimplemented due to resistance from powerful “pensioners drawing double and multiple pensions”, an official said.\n\nIn yet another notification, the government also slightly curtailed the future benefits for an increase in pensions. It said “the net pension (gross pension minus commuted portion of pension) calculated at the time of retirement will be termed as baseline pension” and “any increase in pension shall be granted on baseline pension”.\n\nAlso, “each increase in pension shall be maintained as a separate amount until the time the federal government decides to review and authorise any additional pensionary benefits” and the baseline pension would be reviewed by the pay and pension committee after every three years. However, the current pension of existing pensioners as of January 1, 2025 shall be treated as a baseline pension. Moreover, baseline pension is deemed to include restored commuted portion of the pension, as and when restored.\n\nIt may be noted that the government has already notified a contributory pension scheme for future employees with effect from July 1, 2024 for civilians and exactly a year later for armed forces personnel. For this, the government has already established a Rs10bn pension fund through a budgetary allocation.\n\nAccording to the Ministry of Finance, all pension reforms were in line with recommendations of the PPC-2020 for existing pensioners/employees to curtail a future increase in pension costs without compromising on the government’s pension philosophy.\n\nIt claimed that under civil service regulations, the federal government had the powers and the “right of changing the provisions in these regulations regarding pay, allowance, leave and pension, from time to time at its discretion, and of interpreting in case of dispute”.\n\nThe ministry is also seeking penalties for voluntary retirement. “A federal government employee may opt for retirement after putting in 25 years of service; however, the employee shall be liable to a flat reduction rate of 3pc per year in gross pension based on the number of completed months from the date of retirement to the date of superannuation,” draft rules suggested.\n\nSuch flat reduction in gross pension shall be capped at 20pc. However, this penalty would apply in cases of armed forces and civil armed forces voluntary retirement only if retirement is sought or granted prior to the prescribed rank service.\n\nPublished in Dawn, January 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:01:08.549Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882580/govt-notifies-pension-reforms-to-cut-expenses",
  "dateList": "2025-01-02",
  "date_published": "2025-01-02T03:36:58.000Z"
}
