{
  "title": "Multan crime rate goes down in 2024 - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Multan Police on Wednesday claimed to have reduced overall crime rate of the city by 45 percent through a combination of effective strategies, enhanced patrolling, checkpoint operations, and snap checking.\n\nThe police claimed it arrested 914 members of 338 criminal gangs, recovering stolen goods worth over Rs1 billion including vehicles, motorcycles, cash, jewellery, and other valuables.\n\nCompared to 2023, incidents of dacoity decreased by 54pc, robbery by 14pc, murders during robberies by 33pc, and house robberies by 75pc. Motorcycle and car snatching incidents dropped by 12pc, while thefts saw a 15pc reduction.\n\nThe police made significant arrests in serious crime cases, including 128 murder cases, 266 attempted murder cases and 16 robbery-related murder cases. Additionally, 65 rape offenders, 99 individuals accused of child sexual abuse, and 37 involved in gang rape were apprehended. A total of 405 kidnapping cases were resolved, boosting public trust in the police.\n\nIn the campaign against illegal arms, 1,327 cases were registered, with the seizure of 20 Kalashnikovs, 51 rifles, 62 shotguns, 1,161 pistols, and 3,467 rounds of ammunition.\n\nThe anti-drug drive led to 3,533 cases being registered, resulting in the arrest of 3,596 offenders and the confiscation of significant quantities of narcotics, including over 29 kg of ice, 50 kg of heroin, 1,182 kg of charas, 8 kg of opium, 129,544 bottles of liquor, 59 liquor distilling units, and 477 kg of hemp.\n\nStrict action was taken against illegal gambling and kite flying, with 1,260 individuals arrested in 428 gambling-related cases and 629 people apprehended in 624 kite flying cases. Over 70,000 kites and 12,000 rolls of string were seized.\n\nIn 2024, 40 police encounters resulted in the death of 13 dangerous criminals and the arrest of 48 others who were injured.\n\nPublished in Dawn, January 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/thumbnail/2025/08/21112533c345c22.jpg",
  "retrievedAt": "2025-08-26T06:01:13.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882491/multan-crime-rate-goes-down-in-2024",
  "dateList": "2025-01-02",
  "date_published": "2025-01-02T03:03:12.000Z"
}
