{
  "title": "Several injured as Peshawar police tear gas, baton-charge protesting local government members - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Police used tear gas and batons to disperse hundreds of local government representatives during a protest outside the provincial assembly here on Wednesday, leaving several injured.\n\nMayors and chairmen of city, tehsil, and village and neighbourhood governments resumed their protest against denial of funds and powers after a break of four days.\n\nThey demonstrated on the busy Khyber Road and GT Road for five hours.\n\nThe protest organisers insisted that several protesters fainted or were injured due to tear gas shelling, while the police detained seven of them.\n\nLocal Council Association says demonstration for funds, powers will continue\n\nLocal Council Association president Himayatullah Mayar condemned the police’s action and told Dawn that local government members would continue protesting to claim rights, including release of development funds and powers clipped by the PTI government on different pretexts.\n\nHe criticised the PTI government over the use of unprecedented action against peaceful protesters and said the protest would continue until demands were met.\n\n“We will gather at the Jinnah Park at 11am on Thursday and march on the assembly’s premises to stage a protest. Tear gasand baton charge can’t block our struggle for funds and powers,” he said.\n\nMr Mayar said the police also arrested seven protesters, while several others suffered injuries or fainted due to tear gas.\n\nLCA member and Tarkha village council chairman Taimur Kamal told Dawn that a large number of local body representatives gathered at Jinnah Park at 2pm on Wednesday and marched on the assembly building.\n\n“Police used tear gas to disperse us when we reached near the assembly,” he said. Mr Kamal said that the LG members’ street fight for rights would continue.\n\nHe said that the protesters shouted slogans against the provincial government and the chief minister over the denial of funds and powers as well as the useof force against them.\n\nMeanwhile, Himayatullah Mayar told Dawn that since the formation of local governments in the province three years ago, the provincial government had not released a single penny out of their due share of Rs120 billion.\n\nHe said that under the LG Act, 2013, the government was bound to release 20 per cent of the total Annual Development Programme funds to local governments, but the government had failed to implement the law. Mr Mayar said that local governments were formed to empowerpeople at grassroots level.\n\n“We [LG representatives] held four meetings with the chief minister and his cabinet’s members, who promised the meeting of our demands, but the promise is still unmet,” he said.\n\nMajor demands of the protesting LG members include the implementation of the Local Government Act in letter and spirit and formulation of the LG Rules of Business in line with Section 112 of the LG Act, 2019.\n\nThey also urge the government to immediately release the outstanding allocated funds to local bodies under the Provincial Finance Commission Award for the fiscal years from 2021-22 to 2024-25, and provide them with offices, funds, powers and other amenities.\n\nRecently, the provincial government withdrew Rs3.6 billion funds it had ‘released’ to the tehsil governments on Dec 5, apparently due to the chief minister’s displeasure with the finance department for not adhering to his directives that the money be given away to the ruling PTI-backed councils only.\n\nThe development funds were released to the tehsil chairmen affiliated with the ruling PTI, ignoring those aligned with the opposition parties.\n\nFollowing the release of funds, which had mostly gone to the PTI-affiliated mayors and tehsil council chairpersons, the opposition parties decried that “discrimination” and staged a protest outside the Adiala Jail in Rawalpindi in a bid to inform incarcerated PTI founder Imran Khan about it.\n\nMeanwhile, the Awami National Party condemns the police’s action against protesting local government representatives, saying the use of force by the provincial government on a peaceful protest was a shameful act.\n\nIn a statement, the ANP said the LG members had in vain been staging street protests for the last three years to claim due funds and powers to address people’s problems.\n\nPublished in Dawn, January 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67759fb20dfa3.jpg",
  "retrievedAt": "2025-10-12T00:41:15.311Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882484/several-injured-as-peshawar-police-tear-gas-baton-charge-protesting-local-government-members",
  "dateList": "2025-01-02",
  "date_published": "2025-01-02T03:02:40.000Z"
}
