{
  "article_id": "2025-07-07_27e8a9d7d2691fd69a5fbb029db523e0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-ndma-rescue-teams-to-stay-high-alert-during-heavy-rains/",
    "retrieved_at": "2025-08-27T09:17:59.592Z"
  },
  "metadata": {
    "title": "PM directs NDMA, rescue teams to stay high alert during heavy rains",
    "author": null,
    "date_published": "2025-07-07T10:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 257,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 7 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed the National Disaster Management Authority (NDMA), rescue agencies, and administrative authorities to remain on high alert during the recent heavy rains and any potential emergency situations. In anticipation of possible flooding in areas along the Indus River and other rivers, the prime minister has instructed the NDMA, rescue agencies, and administrative bodies to immediately implement safety measures and precautionary actions. The prime minister directed the NDMA to strengthen coordination with the Provincial Disaster Management Authorities (PDMAs) for effectively dealing with the flood situation. The NDMA has also been instructed to strengthen close coordination with provincial governments and other relevant institutions, a press statement issued by the PM Office said.. The prime minister directed the Pakistan Telecommunication Authority (PTA) to keep the public informed using all available means, providing accurate and real-time information. He expressed concern that the operation of the Tarbela Dam spillways may increase flooding in the lower districts along the Indus River. All provincial administrations have been directed to continue effective public awareness campaigns in view of the potential flood situation. The National Emergency Operations Center (NEOC) has also been instructed to identify and clarify through the media, the areas that are vulnerable or less protected, where there is a risk of high, medium, or low-level flooding, so that the public can be warned in a timely manner. The prime minister further directed that provincial administrations must be fully prepared in advance for any situation, and that the NDMA should ensure this preparedness.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}