{
  "article_id": "2025-07-07_3b4790d1d1861c80eb2cedb7cecb9c38",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/parliamentary-delegation-meets-speaker-of-azerbaijani-milli-majlis/",
    "retrieved_at": "2025-08-27T09:18:48.848Z"
  },
  "metadata": {
    "title": "Parliamentary delegation meets Speaker of Azerbaijani Milli Majlis",
    "author": null,
    "date_published": "2025-07-07T16:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 605,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 07 (APP): A parliamentary delegation led by the Speaker of National Assembly Sardar Ayaz Sadiq Monday met with the Speaker of Milli Majlis of Azerbaijan, Sahiba Gafarova at the Milli Majlis in Baku. Ayaz Sadiq conveyed his heartfelt gratitude to Speaker Sahiba Gafarova for the kind invitation to visit Azerbaijan and for the warm welcome extended to him and his delegation, said a news release received here. He commended Azerbaijan's principled and steadfast stance on key regional and international issues. Ayaz Sadiq particularly acknowledged Azerbaijan's steadfast support for Pakistan's principled stance on the Jammu and Kashmir dispute, as well as its clear and resolute positions on India's recent escalations against Pakistan, the situation in Gaza and the Iran-Israel conflict. He highlighted the symbolic significance of Prime Minister Muhammad Shehbaz Sharif's recent visit to Azerbaijan's liberated territories, which was attended by several heads of state and sent a powerful message of solidarity to the international community in support of Azerbaijan's victory. He recalled two landmark resolutions presented and unanimously adopted by the National Assembly of Pakistan under his leadership: the first strongly condemned Armenian aggression, including brutal attacks on Azerbaijani civilians and military operations in Nagorno-Karabakh; the second was adopted following Azerbaijan's victory and the liberation of its territories, reaffirming Pakistan's unwavering support. Ayaz Sadiq raised concerns regarding India's suspension of the Indus Waters Treaty, urging a collective condemnation at international forums as a pressing necessity. He emphasized the importance of enhancing connectivity and infrastructure links, highlighting the transformative potential of Gwadar Port for regional trade and economic cooperation. Ayaz Sadiq proposed convening the next trilateral meeting between the Speakers of the Parliaments of Azerbaijan, Pakistan and Turkiye at the earliest mutually agreeable opportunity, emphasizing the importance of such engagements in further strengthening strategic partnerships. For further institutional collaboration, Ayaz Sadiq proposed organizing staff-level training programs to familiarize parliamentary personnel with each country's legislative processes, rules of procedure and constitutional frameworks. He said that robust parliamentary and people-to-people interactions can play a pivotal role in enhancing bilateral ties and fostering mutual understanding. Ayaz Sadiq also apprised his Azerbaijani counterpart of key parliamentary initiatives undertaken in Pakistan, including the establishment of the SDGs Secretariat under his leadership, the Women's Parliamentary Caucus, the Young Parliamentarians Forum, and the Parliamentary Caucus on Child Rights (PCCR). In response, Speaker of Milli Majlis, Sahiba Gafarova acknowledged Pakistan's consistent and unwavering support on matters of vital importance to Azerbaijan, reaffirming the enduring bonds of brotherhood between the two nations. She recalled the impactful visit of the President of Azerbaijan to Pakistan in 2024 and underscored the importance of the Azerbaijan-Pakistan-Turkiye trilateral parliamentary meeting hosted in Azerbaijan, which served to further deepen the ties among the three brotherly countries. Sahiba Gafarova fondly recollected her visit to Pakistan in 2021. She underscored Azerbaijan's enduring support for Pakistan, affirming that Azerbaijan has supported Pakistan, continues to do so, and will remain a steadfast partner in the future. She proposed organizing a visit of the Pakistan-Azerbaijan Parliamentary Friendship Group during the autumn session of the Milli Majlis in Baku and stressed the importance of increasing the number of direct flights between the two countries to facilitate closer ties. Members of the delegation present during the meeting included Dr. Mahesh Kumar Malani, Chaudhary Iftikhar Nazir, Sadiq Iftikhar, Umair Khan Niazi,Muhammad Afzal Khokhar, Muhammad Moin Aamer Pirzada, and Nazir Ahmed Bhugio. Ayaz Sadiq also inscribed his remarks in the guest book of the Milli Majlis of the Republic of Azerbaijan. The meeting concluded with both sides affirming their shared commitment to deepening inter-parliamentary engagement and strengthening cooperation between the legislative bodies of the two brotherly nations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}