{
  "title": "Imran Khan exploits innocence of people: Interior Minister",
  "link": "https://www.app.com.pk/national/imran-khan-exploits-innocence-of-people-interior-minister/",
  "date_published": "2023-05-28T18:00:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, May 28 (APP):Federal Interior Minister Rana Sanaullah Khan has said that Imran Khan exploited innocence of the people and hoodwinked them with false accusation against his political opponents.\nHe was addressing a rally at Zila Council Chowk here on Sunday evening. This rally was taken out from his public secretariat near Chak No.65-JB Bypass in connection with Yaum-e-Takbeer-e-Pakistan and Takreem-e-Shuhda-e-Pakistan. A large number of the participants participated in the rally which marched on various city roads by holding banners, placard and chanting slogans.The minister said that Imran Khan had cultivated seed of hatred among the nation due to which the nation had to face the mayhem of 9th May. He illusioned the youths who followed him blindly and vandalized Jinnah House Lahore.They first looted and plundered the household items and then put it on fire, he said. They also damaged the sensitive military installations, he added. It was not only a corps commander house but was also his camp office where sensitive information for national integrity was present, he mentioned. It was now the responsibility of Pak army to recover these sensitive items by bringing the culprits to the justice, he added.He said that the accused tried to weaken the national defense and they could be compared with the Kalbushan who trespassed in our territory. They must be nabbed and their cases should be sent to the military courts.The minister said that only those individual would be granted forgiveness whose crime was lesser nature.He said that Prime Minister Shehbaz Sharif had issued clear instruction that no innocent people should be implicated and no criminal arsonist should be allowed to go escort free. He said that Imran Khan was reluctant to condemn the 9th May incident and now he was expecting from us to negotiate with him.“We openly condemn this incident and support the families of martyrs and Ghazis who had devoted their lives to defend the geographical and ideological territories of Pakistan. If we accepted the offer of negotiation with terrorist, how we can face families of the martyrs”, he added. He said that our Jawans were equipped with so unmatched bravery and valor that it was also recognized by our enemy. But the PTI activists had shown disrespect to the monuments of these Jawans who laid down their lives for the country. How we could negotiate with them.He said that Imran Khan also hatched a conspiracy to divide Pak army during appointment of army chief but it was foiled by the maturity of army high command. God forbid, if he succeeded it was tantamount to fulfill aspiration of the enemies of Pakistan, he added.He said that another conspiracy was also hatched which was detected in-time by our agencies. Under this conspiracy, they had planned to attack house of a known PTI worker and kill innocent people there so that they could put its blame on the government and agencies. “We immediately informed the people as it was a ripe strategy which could be exercised any time”, he added.The minister said that Inter-Services Intelligence (ISI) was the first defense line of Pakistan and it had played a key role in war against terrorists. The PTI activists attacked the ISI office and pelted stones. They were also hell-bent to put it on fire but could not succeed in their vicious designs.Now this rally would move to Chenab Club Chowk and present a bouquet to the ISI officials who faced this blatant attack with full patience, he said.He also paid tribute to the untiring efforts of Pakistani scientists and their teams and said that PML-N believed in national sovereignty. It had made defense of the country invincible by conducting atomic explosions 25 years ago on 28th May 1998 and now every Pakistan had proud on it, he added.Later, the minister along with rally also went to Chenab Club Chowk and presented a bouquet to ISI regional commander.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T08:34:22.346Z"
}
