{
  "title": "IWMB educating village population to avoid killing leopard: Rina Saeed",
  "link": "https://www.app.com.pk/national/iwmb-educating-village-population-to-avoid-killing-leopard-rina-saeed/",
  "date_published": "2023-05-28T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP): Islamabad Wildlife Management Board (IWMB) Chairperson Rina Saeed Khan on Sunday said the Board was educating the village population of 32 villages existing inside the Margalla Hills National Park (MHNP) during jumma prayer’s sermon to avoid leopard killing and habitat intrusion.\nThe IWMB after witnessing a thriving population of endangered Common Asian Leopards and other wildlife species expedited its conservation, education and preservation efforts to protect the world’s unique and living ecosystem nourishing along a human settlement, the Chairperson told APP in an exclusive interaction to share her insights on the story behind the success of Leopard preservation in MHNP.\nRina Saeed Khan said the Board used to hold training for the village population to avoid killing leopards by educating them on prevention and safety measures to abstain leopard encounters.\n“Leopards are not interested in going into villages. There have been cases that goats have been attacked by leopard but that needs to be probed and we will work out some compensation mechanism as well. However the prevailing economic conditions are not viable,” she said.\nShe underlined that urbanisation in the federal capital and population boom had extended human frontiers to wild areas.In 1980 Margalla Hills National Park was designated as a protected area and it was a small trip in the sprawling forest area, not big, as it was between capital and Khyber Pakhtunkhwa (KP) province.\nThe Chairperson added that in 2021, the Board got full fledge recruitment and last year it got proper management team including a Director, Deputy Director, Assitant Director and an Accounts Officer.\n“We don’t stop anyone from going to hiking trails, but we have to do coexistence with nature. You can see pheasants, jackals, barking deers and leopards.”\nLeopards, she said was an indicator of a good ecosystem whereas the visitors and trekkers should avoid venturing into the national park in the early morning and evening hours.\nThe National Park, she said was divided into 20 blocks and 20 camera traps were installed so that the Board could hold a study of leopard and other wild animals’ movement.\nShe said interestingly every leopard has a unique forehead pattern that helps in its identification. “We have identified eight individual leopards that are the only ones captured in the cameras. Leopards, both male and female, live in separate territories and only unite for matings,” she added.\nShe informed that there was no poaching and hunting in the MHNP whereas only Shah Allah Ditta and Quaid-e-Azam University area strip was vulnerable to hunting.\nIn 1970, these hills were barren and it was called military grasslands and there were no big trees at that time, she said, adding, “Capital Development Authority (CDA) did plantation to green that area but population and housing pressure is threatening it’s nature. Margalla Avenue will now give way to the development of more residential sectors.”\nThe CDA, Revenue Department, IWMB and Survey of Pakistan were working on the demarcation of the boundary of the MHNP that would help control encroachments into the protected area, she added.\nCommenting on the hotels polluting the MHNP, Rina Saeed said the Islamabad High Court (IHC) order has declared Monal and others as illegal hotels in MHNP. “They (hotels) are dumping their sewage in the national park. We need to understand to that it’s not Murree and we do not need to have big hotels. We want to preserve and protect this thriving wildlife,” the Chairperson said and added, the federal capital residents take pride in condemning MHNP as their identity.\n“We ask the people to avoid entering into the MHNP during evening and night. The people should do picnic but they should bring their trash back. We have started checking on trail heads to clean trash. It is strange to see that why plastic water bottles are not brought back by the visitors,” she said.\nThe Chairperson said now the trash bags were shrinking as volunteers on weekends clean it that showed increasing responsible behavior of the visitors.“The people in cars going through Pir Sohawa Road do picnic on the hilltops and leave trash there. We discourage trash cans in the national park as cleanliness is all about my waste my responsibility. We want to make the masses realize to avoid barbecue in the national park as it is forest fire season starting from April till June”.\nShe also denounced that it was a myth that leopards were the man eaters. “They (leopards) are not interested in encountering humans. They had a huge list of prey.”\nThe IWMB head noted that pets especially dogs were not allowed because they were the favorite prey of wildcats.\n“If a leopard is encountered people should avoid panic and stay calm and still,” she said.\nCommenting on the Leopard movement, she said night was leopard’s hunting time and the Board was trying to put gates at trails to control movement.\nShe referred to the leopard encounter at the Saidpur village as an exaggerated episode as the leopard was at the top of the hill and did not enter the human population.\nThe people should consult IWMB for awareness as many educational institutions take time from the Board to educate and train students on nature and wildlife, she added.\nThe senior IWMB Board member and renowned Wildlife and biodiversity Z.B. Mirza used to give training on eco-system and wildlife.\nShe regretted that camera traps were stolen by the unknown as the Board had placed camera traps on locations based on pug marks and scats to study animal movement.\n“Cameras are motion sensors based working on batteries. They work for three to four days continuously.”\nThe Board had also created two volunteer groups on WhatsApp one of active members and the other only for information, she added.\n“We have a research officer that handles it. The Board also have active Facebook and Twitter accounts that could be reached out for information.”\nThe Rawal Lake which was also part of the national park had a Kinara Park that was being protected by the Board, she said.\nShe informed that the Board had converted the old Islamabad Zoo into a rescue and rehabilitation center where the injured and rescued animals were rehabilitated.She added that the Board was working on starting children guided tours into the national park.",
  "retrievedAt": "2025-08-11T08:34:30.467Z"
}
