{
  "title": "Intelligence agencies unearth PTI’s plan to malign govt, LAEs: Rana Sanaullah",
  "link": "https://www.app.com.pk/national/intelligence-agencies-unearth-ptis-plan-to-malign-govt-laes-rana-sanaullah/",
  "date_published": "2023-05-27T21:04:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, May 28 (APP): Interior Minister Rana Sanaullah on Saturday said the intelligence agencies had intercepted a telephonic conversation about a staged police attack on one of the Pakistan Tehreek-e-Insaf (PTI)’s leaders, killing its occupants, and then blaming law enforcement agencies for the act.\nAddressing a hurriedly called press conference here late night, the minister said the second plan revealed in the intercepted audio involved staging incidents of firing and disgracing women with the intention of portraying it as the work of intelligence and law enforcement agencies and also highlighting it as a human right issue at international level\nHe said as the matter was of huge importance he thought it necessary to apprise the nation as the orchestrated event was planned for tonight (Saturday night). However, he added, the timely action from the intelligence agencies foiled the nefarious design, resulting in the exposure of the plot even before its execution.\nHe further said that the intended purpose of the orchestrated event was to generate controversy surrounding the legal actions taken after May 9 vandalism and to present these staged plays as grave human rights violations and state oppression through international media.\nThe minister said that these people hurt the sentiments of martyrs’ families and the nation by attacking the martyrs’ monuments, Jinnah House, and military installations.\nHe also expressed firm resolve that the May 9 miscreants would definitely be brought to justice. Those, who attacked Jinnah House and broke into military installations, would be tried in military courts under the Military Act 1952, he added.\nFor all others involved in the May 9 riots, Sanaullah said their trial would be conducted in civil courts.\nThe minister conveyed the strict directives of Prime Minister Shehbaz Sharif, and the firm resolve of the federal government that no innocent would be prosecuted.\nHe said they [PTI leadership] employed method without considering it was wrong or right including lobbying with external forces like Zalmay Khalilzad to achieve their objectives. However, he added, when they failed, they hatched a dreadful plan to stage such attack and put the blame on law enforcers.\nRana Sanaullah said the gang and its ringleader were near to meet their logical end, and they would never be allowed to achieve their objectives.",
  "retrievedAt": "2025-08-11T08:34:32.484Z"
}
