{
  "title": "PM felicitates nation on Youm-e-Takbir, says no compromise over country’s defence, sovereignty",
  "link": "https://www.app.com.pk/national/pm-felicitates-nation-on-youm-e-takbir-says-no-compromise-over-countrys-defence-sovereignty/",
  "date_published": "2023-05-27T19:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP):Prime Minister Muhammad Shehbaz Sharif Sunday said the country’s defence, sovereignty, national dignity and freedom was above everything to the nation and no one had the courage to take away its freedom.\nIn a message on the occasion of Youm-Takbir to mark the day of nuclear tests carried out by Pakistan in 1998, the prime minister said the day reminded that for the defence, solidarity and national interests, they would not budge from any sacrifice.\nHe said the historic day was a clear declaration of ‘no compromise over country’s sovereignty, and defence’.\n“Twenty five years ago today, the people of Pakistan announced the invincibility of their defense by detonating five nuclear explosions in response to India’s nuclear explosions,” he added.\nThe prime minister stressed that they would have to move ahead with the same spirit as manifested on Youm-e-Takbir to attain economic sovereignty and self-dependence.\nHe underlined that it was a day to get united for the solidarity of the country as it was the main strength of the nation and expressed his determination that with such unity, hard work and staunch faith, they would turn Pakistan into ‘an economic power’.\nThe prime minister paid tributes to the patriotism of then prime minister Muhammad Nawaz Sharif who raised the head of Pakistan among the comity of nations with pride, adding the former prime minister had rejected all the pressures and temptations of billions of dollars and made Pakistan, the seventh nuclear world power and the first Islamic country possessing nuclear deterrence.\nHe also lauded Shaheed Zulfikar Ali Bhutto, the founder of Pakistan’s nuclear programme and also paid rich tributes to Benazir Bhutto Shaheed who, as an opposition leader backed prime minister Nawaz Sharif’s decision of nuclear tests in 1998.\n“I want to tell the youth that there were deep political differences between the government and Mohtarma Benazir Bhutto but setting aside all the differences for the sake of the country, she supported the government,” he added.\nThe prime minister said the armed forces of the country had rendered valuable services for the country’s nuclear programme which had been a golden chapter in its history.\nHe also appreciated Dr Abdul Qadir Khan, (Mohsin e Pakistan), all scientists, engineers and other individuals who contributed to Pakistan’s atomic proramme.\nThe prime minister also expressed his gratitude to Saudi Arabia and other brotherly and friendly countries that had helped Pakistan during the economic sanctions.\nThe prime minister said the mountains of Chagi still echoed with the same resolve, and Balochistan province still bore distinction with regard to defence of the country.\nPM Shehbaz said on May 28 1998, the whole world was on the other side putting pressures, threats and giving temptations, but the leadership of the country, with the support of nation and the opposition, made the impossible, possible.\n“We also faced economic difficulties. The unity of the nation is the real nuclear power of Pakistan,” he added.",
  "retrievedAt": "2025-08-11T08:34:32.535Z"
}
