{
  "title": "CCP scrutinizes misleading discount advertisements",
  "link": "https://www.app.com.pk/national/ccp-scrutinizes-misleading-discount-advertisements/",
  "date_published": "2024-09-21T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP):The Competition Commission of Pakistan (CCP), while taking action against retailers advertising discounts as “up to a percentage” during the “End of Season Sales” issued notices to 20 brands, seeking clarification on their potentially misleading discount practices.\nSuch unspecified discount offers are akin to ‘Bait and Switch Advertising’ defined as a tactic to mislead buyers, whereby a seller advertises an appealing but  spurious offer to sell a product or service that the seller does not actually intend to sell, said a news release.\nInstead, the seller offers an unwanted alternative which is prohibited under Section 10 of the Act as Deceptive Marketing Practices.\nMarket Intelligence Unit/Office of Fair Trade of the CCP conducted a random survey in the twin cities and identified various brands offering discounts “Up to Some Percentage” on their products. The survey revealed that maximum (upper limit) discount was being offered on a small collection of least attractive articles and the most popular and frequently purchased items were available with minimal or no discount.\nConsequently, a clear gap was observed between the advertised discounts and the real offers, compelling the customers to ask multiple questions to determine the actual discounts available on their chosen items. Some of the brands were, however, offering flat discounts or concessions (discounts up to some upper limit) with adequate disclosures/disclaimers i.e. on the entire/limited or specified stock which is highly appreciated by the CCP.\nThe Commission advises various consumer brands offering discounts to preclude distributing any misleading information and ensure clear and adequate disclosures regarding actual and discounted prices with the details of the stock on offer with flat or differential discounts.\nUndertakings, Brands and outlets violating this directive may face enforcement action by the CCP under Section 10 of the Competition Act, 2010. Similarly, consumers are also advised to exercise vigilance while availing discounts and sales offers to avoid falling victim to deceptive marketing practices.\nCCP remains committed to its mandate under the Competition Act, 2010 continuously striving to ensure free competition, enhance economic efficiency, and protect consumers from anti-competitive behavior.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:16:18.927Z"
}
