{
  "title": "CDA launches Technology & Digitalization Wing block",
  "link": "https://www.app.com.pk/national/cda-launches-technology-digitalization-wing-block/",
  "date_published": "2024-09-21T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP):The Capital Development Authority (CDA), under the directives of its Chairman Muhammad Ali Randhawa, has taken a significant step towards modernization by officially launching its Technology and Digitalization Wing block.\nThis milestone marks a new era in the Authority’s operations as it transitions to a corporate model and collaborative working culture, aiming to streamline services and enhance efficiency, said a press release.\nOn the occasion of the launch, Chairman CDA Muhammad Ali Randhawa said the future of public service delivery lies in embracing modern technology and adopting corporate best practices.\nAs part of this initiative, the newly established Technology and Digitalization Wing block, has been made operational.\nThis block is equipped with state-of-the-art hardware and software to enhance efficiency. A corporate-style work\nenvironment has been introduced, featuring open desks work environment and an open-door policy to enhance efficiency and transparency.\nThe implementation of this modern technology is part of a broader initiative aimed at increasing transparency in office operations and improving overall performance.\nBy leveraging modern technology in this block, the CDA aims to enhance transparency and improve operational efficiency. Initially, this corporate culture and advanced technology has been implemented in the Technology and Digitalization Wing, with plans to extend it to other wings of the CDA in the near future.\nOne of the main feature introduced by the wing is an advanced e-filing system, paperless working environment which is set to replace the traditional paper-based filing system.\nThis shift is expected to reduce reliance on physical documents, cutting down on paper usage and reducing operational costs.\nThis transition promises to streamline processes, making it easier to access and manage documents efficiently.\nThis transformation is aligned with the broader national vision of a Digital Islamabad , with the CDA playing its role in bringing that vision into practice at its operational level.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:16:14.049Z"
}
