{
  "title": "Jazz’s employees participate in cleanup drive",
  "link": "https://www.app.com.pk/national/jazzs-employees-participate-in-cleanup-drive/",
  "date_published": "2024-09-21T11:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP):As part of its commitment to environmental sustainability, Jazz, Pakistan’s leading digital operator, organized a beach cleanup at Clifton Beach, Karachi, on World Cleanup Day.\nThe initiative, aligned with Jazz’s ESG agenda, aimed to raise awareness about marine pollution and encourage the protection of marine ecosystems, with employees actively participating to promote a cleaner environment, said a news release.\nThis year’s World Cleanup Day, themed ‘Make Room For Life,’ emphasizes the urgent need to tackle global waste and marine debris. With 80% of ocean pollution from land-based sources, over 10 million metric tons of plastic enter the oceans annually, threatening marine life and ecosystems, and introducing harmful microplastics into the food chain.\nSyed Fakhar Ahmed, Jazz’s Chief Corporate & Regulatory Affairs Officer, stated, “Jazz’s commitment to environmental sustainability drives us to combat marine pollution actively. By raising awareness about solid waste’s impact on ecosystems, we aim to foster environmental stewardship and protect the planet for future generations. Every step towards a cleaner environment contributes to a better future for all.”\nJazz is committed to reducing its environmental footprint through its Net Zero program, aiming to become a net-zero carbon-emitting entity by 2050. Over the last two years, the company has diverted 77 tons of waste from landfills, promoted recycling, and composted food waste into organic fertilizers. Jazz has also organized tree plantation drives in Peshawar and Islamabad as part of its Carbon Sink project, reinforcing its commitment to environmental conservation and sustainability.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:16:17.293Z"
}
