{
  "title": "Monkey death toll rises: Call to end human feeding in National Parks",
  "link": "https://www.app.com.pk/national/monkey-death-toll-rises-call-to-end-human-feeding-in-national-parks/",
  "date_published": "2024-12-22T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP):The tragic death of a third monkey from electrocution in Islamabad’s Margalla Hills National Park has triggered urgent calls for stricter regulations and heightened public awareness regarding human interactions with wildlife.\nThe incident, which occurred earlier this week, involved a rhesus monkey fatally electrocuted while climbing power lines in search of food.\nThis marks the third such fatality in recent months, underscoring the growing dangers of human feeding habits.\nAccording to Sana Raja, a wildlife rescuer, the monkey climbed the electrical infrastructure in search of food scraps left by park visitors.\nShe believed human feeding has conditioned the animals to associate humans with food, pushing them into unsafe areas like roads or power lines.\nTo a query, Sana told APP that human feeding disrupts the instincts of monkeys.\n“Monkeys are highly intelligent and opportunistic creatures. When visitors feed them, it conditions them to associate humans with food. This not only leads to unnatural behaviours but also draws them into hazardous environments, such as roads or areas with electrical infrastructure.”\nShe added that the overpopulation of rhesus monkeys in the park is a direct consequence of human feeding habits.\n“Their numbers have grown manifold over the years, causing increased competition for resources, injuries, and aggression toward humans. Many monkeys suffer severe health issues from eating trash, including fungal infections in their digestive systems.”\nEnvironmental experts have raised concerns about the broader ecological impact.\nSakhwat Ali, an environmental scientist warned, “Feeding wildlife disrupts ecosystems. Monkeys and other animals may abandon their natural diet, leading to malnutrition and aggression within populations. This not only affects their health but also creates an imbalance in the ecosystem, putting undue pressure on human-animal coexistence.”\nMany park visitors expressed regret over the monkey deaths, admitting they were unaware of the consequences of their actions.\n“I thought I was helping by sharing my snacks with them,” one visitor admitted. “Now I see it’s more harmful than I imagined. I’ll think twice in the future.”\nOthers shared their sorrow and emphasized the need for stricter rules. “It’s heartbreaking. We need better education and enforcement to stop this,” said Sadia Babar, a frequent visitor to the park.\nWhen contacted Umar Bilal, spokesperson for the Islamabad Wildlife Management Board (IWMB), said “These deaths are preventable. We appeal to the public to help us protect our wildlife by following the guidelines.”\nThe IWMB, he said has ramped up efforts to curb harmful practices. Park rangers are intensifying patrols, distributing educational materials, and urging visitors to follow park rules prohibiting feeding and littering.\n“The public must understand that their actions have consequences,” Umar Bilal stressed. “By respecting park guidelines, visitors can play a crucial role in safeguarding our wildlife and ensuring a safer environment for all species.”\nTo prevent further tragedies, conservationists and environmentalists are advocating for stricter penalties for violations, increased signage to educate visitors, Installation of monkey-proof waste bins to discourage scavenging and ongoing public awareness campaigns.\nAs the Margalla Hills National Park grapples with the challenges of preserving its natural habitat, the responsibility lies not just with authorities but with every visitor.\nBy respecting nature and its inhabitants, the delicate balance of the ecosystem can be protected for generations to come.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:58:01.270Z"
}
