{
  "title": "Umar Hayat advises regular inspection of gas equipment to prevent accidents",
  "link": "https://www.app.com.pk/national/umar-hayat-advises-regular-inspection-of-gas-equipment-to-prevent-accidents/",
  "date_published": "2024-12-22T13:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP):The General Manager of Sui Northern Gas Pipelines Limited (SNGPL) Rawalpindi, Umar Hayat, has advised consumers to adopt safe practices, including using high-quality gas appliances and regularly inspecting equipment and pipelines for leaks, to avoid accidents during the winter season.\nSpeaking to the media, Umar Hayat said that despite awareness campaigns, negligence during winter often results in unfortunate incidents.\nHe specifically warned against using rubber pipes with gas heaters, attributing many past accidents to their use.\nThe GM highlighted the importance of fostering a culture of safe and efficient gas usage to ensure consumer safety and uninterrupted gas services.\nHe urged consumers to avoid excessive gas usage and educate their families and staff about essential safety measures.\nHotel and guesthouse owners were also advised to display safety instruction cards in rooms, outlining guidelines for the proper use of gas heaters.\nHe recommended using soapy water instead of matches for leak detection and seeking assistance from certified plumbers for repairs.\nHe pointed out that many accidents occur due to a lack of awareness, such as operating electrical switches or devices during a gas leak, which could ignite accumulated gas.\nHe advised consumers to immediately shut off the main gas valve, open windows and doors for ventilation, and avoid using fans or exhaust systems in such situations.\nThe GM also highlighted the importance of proper ventilation in rooms with gas heaters and urged consumers to turn off all gas-powered devices, including stoves, geysers, and heaters, and shut the main gas valve before sleeping.\nUmar Hayat encouraged consumers to contact SNGPL’s 24/7 helpline at 1199 or visit the nearest SNGPL Rawalpindi office for emergencies.\nHe assured emergency teams are always on standby at complaint centres to address critical situations.\nReiterating SNGPL’s commitment to consumer safety, Umar Hayat underscored the company’s dedication to preventing accidents through continuous awareness efforts and support.\nHe also assured consumers of an uninterrupted gas supply, particularly during the winter season.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:58:01.896Z"
}
