{
  "title": "Over 3,700 trained at capital police college Islamabad",
  "link": "https://www.app.com.pk/national/over-3700-trained-at-capital-police-college-islamabad/",
  "date_published": "2024-12-22T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP):The Capital Police College Islamabad has successfully trained more than 3,700 police officers and officials this year through departmental courses and workshops aimed at enhancing professional skills and promoting public safety.\nA public relations officer told APP on Sunday that the Capital Police College Islamabad regularly holds departmental promotion courses and practical workshops to enhance the capabilities of police officers and align them with modern requirements.\nIn this regard, 14 departmental promotion courses were organized during the ongoing year, in which 1,108 police officers received training according to international standards from senior police officers and experts.\nThese courses included advanced course, upper-class course, intermediate course, a lower course, a basic recruit course, a drill instructor course, and a VIP protection course.\nAdditionally, during this timeframe, 87 training workshops were also organized at the Capital Police College Islamabad, in which 2,610 police officers attended lectures and participated in practical workshops conducted by experts from various organizations to enhance their skills.\nThese workshops covered topics such as Basic and Modern Investigation, Pakistan Penal Code, Code of Criminal Procedure, Crime Scene Investigation, Departmental Administrative Affairs, Police Order 2002, Interviews, Interrogation, Human and Refugee Rights, Gender-Based Violence, Crimes Against Women, Investigation of Fatal Accidents, Countering Terrorism Financing, Cyber Crime Investigation, etc.\nMoreover, to train citizens, the Capital Police College also organized self-defence and weapon handling courses, where citizens were trained in weapon handling, swimming, live firing practice, rappelling, obstacle crossing, horse riding, and archery.\nThe purpose of these training courses is to provide citizens with knowledge about weapons, their safe use, and how to defend themselves in emergencies.\nCommandant Capital Police College, Shakir Hussain Dawar, said that these training courses and workshops aim to equip police officers with modern skills so they can perform their duties professionally.\nSuch training programs will continue to be organized in the future for the betterment of police officers’ careers, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:58:48.591Z"
}
