{
  "article_id": "2025-06-17_4105289d2b7bdab1681aaaf78cd0a4d9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ppp-positive-suggestions-presented-to-govt-on-budget-nafisa-shah/",
    "retrieved_at": "2025-08-27T11:13:06.866Z"
  },
  "metadata": {
    "title": "PPP positive suggestions presented to Govt on budget: Nafisa Shah",
    "author": null,
    "date_published": "2025-06-17T10:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 300,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 17 (APP):Pakistan Peoples Party leader Syeda Nafisa Shah has said that we have presented our positive response and suggestions on the budget to the government, we have also presented our position in the Standing Committee on Finance, the government will take our suggestions positively keeping in mind the public interest, the MQM should support the PPP on the issue of canal water because their interest is related to Sindh. Talking to the media outside the Parliament House, Syeda Nafisa Shah said that there should be a tax on smoking, we have raised this issue in the Standing Committee on Finance, as far as the issue of tax evasion of Rs 300 billion on illegally smuggled cigarettes is concerned, we have also presented our strong position in the Standing Committee. Syeda Nafisa Shah said that there are strong lobbies on both sides regarding tobacco, whether it is the formal sector or the informal sector, we will consider whatever decision is taken in the Standing Committee so that the government also benefits from it and the implementation of taxes to prevent smoking is also made effective. He said that the state has taken steps to prevent terrorism from Karachi and has largely controlled it. He said that the interests of MQM are related to Sindh and Sindh should support the PPP's stance regarding canal water. We do not have to support PTI but support the interests of the people. We have presented all the positive suggestions for the budget at the relevant forum and the government will definitely remove our concerns keeping in mind the public interest. He said that the FBR should not be made on the lines of NAB with regard to taxpayers but should facilitate the business community so that the tax net increases and businesses flourish.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}