{
  "article_id": "2025-06-17_8db8cad2d90ba77bb0ddf878544f9798",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/abbottabad-public-school-alumni-visits-parliament-house/",
    "retrieved_at": "2025-08-27T16:09:07.640Z"
  },
  "metadata": {
    "title": "Abbottabad Public School alumni visits Parliament House",
    "author": null,
    "date_published": "2025-06-17T14:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 190,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 17 (APP): A delegation from the Abbottabad Public School Alumni Association on Tuesday visited Parliament House and commended the nonpartisan leadership of Speaker Ayaz Sadiq and the efficient conduct of the Assembly's proceedings. The delegation also observed the National Assembly proceedings during their visit. Speaker Ayaz Sadiq welcomed the delegation, praising Abbottabad Public School as a leading educational institution and recognizing the significant contributions of its alumni across various national sectors. During the meeting, the members of delegation were beriefed about legislative process and structure of the parliamentary system, underscoring the significance of standing committees in ensuring detailed deliberations on national matters. The Speaker highlighted the establishment of parliamentary forums such as the Women's Parliamentary Caucus, Child Rights Caucus, Young Parliamentarians Forum, and the SDGs Secretariat within the National Assembly. He noted that these platforms are designed to tackle challenges faced by women, children, and youth, and have now been expanded to all provinces and Azad Jammu & Kashmir to address common concerns effectively. The Speaker further added that the National Assembly's internship program, initiated in 2014, continues to engage young people in understanding legislation and democratic values.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}