{
  "article_id": "2025-06-17_1a7bb7cd78750836ae415292b1187c3d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-for-institutional-solution-to-challenges-faced-by-media/",
    "retrieved_at": "2025-08-27T16:09:37.286Z"
  },
  "metadata": {
    "title": "Tarar for institutional solution to challenges faced by media",
    "author": null,
    "date_published": "2025-06-17T11:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 446,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 17 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Tuesday that media was fourth pillar of the state and the government intended an institutional solution to the challenges faced by the media. During a meeting with a delegation of Council of Pakistan Newspaper Editors (CPNE), he said the government was taking effective steps for protection, welfare and professional facilities of journalists. The meeting discussed Pakistan Electronic Crimes Act ( PECA), elimination of newspapers not published regularly, payments to print media, Journalists Protection Commission and other important issues. The minister said that PECA law provided protection to credible journalists. Tarar said he believed in consultation and further improvement, suggestions about rules would be welcomed. \"We are ready to consult with journalist organizations on PECA law. Misunderstandings between journalists and the relevant ministry regarding PACA will be removed\", Attaullah Tarar remarked. He informed the delegation that a committee has been established to eliminate newspapers not published regularly. He assured that payments would be made to print media this year in the form of dues and said Journalists Protection Commission would start working soon. The minister said that the main purpose of the PECA was to bring so-called and fake journalists, hiding in the guise of journalism under the ambit of the law. The Federal Information Minister appreciated the role of the media in the national interest during recent Pak-India stand-off. The media demonstrated a mature perspective in protecting national security and the state's position., he added. The Pakistani media played an effective role in disseminating accurate information and dispelling rumors, Attaullah Tarar said. The message of national solidarity from the media in difficult circumstances was highly commendable, he added. He said that freedom of the press was the crucial hallmark of a democratic system in the world. The CPNE delegation appreciated the role of Ministry of Information and Broadcasting and the Public Relations Department of the Pakistan Army (ISPR) in providing timely and certified information. The CPNE delegation acknowledged that Ministry of Information has ensured timely and authentic provision of information and kept the flow of information effective and coherent, which was commendable. The CPNE delegation made suggestions regarding the protection of journalists, access to information and improvement of the professional environment of journalism. The Federal Minister for Information assured to seriously consider the suggestions of the CPNE delegation. \"We will provide all possible cooperation to resolve the problems of journalists,\" Attaullah Tarar assured. He said the government will form a joint working group with media representatives and resolve the problems on priority basis. Prime Minister's Media Coordinator Badar Shahbaz Warraich and Principal Information Officer Mubashir Hassan were also present in the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}