{
  "article_id": "2025-06-17_c82fbaef9293adbfd807a178c48f2cb0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/reserved-seats-cant-be-distributed-arbitrarily-ecp-responds-to-sc/",
    "retrieved_at": "2025-08-27T16:09:56.455Z"
  },
  "metadata": {
    "title": "Reserved seats can’t be distributed arbitrarily; ECP responds to SC",
    "author": null,
    "date_published": "2025-06-17T11:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 492,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 17 (APP): The Supreme Court of Pakistan on Tuesday adjourned the hearing in the review petitions against the verdict on reserved seats until Wednesday, June 18, after Advocate Faisal Siddiqi, counsel for the Sunni Ittehad Council (SIC), concluded his arguments. The hearing was conducted by an eleven-member Constitutional Bench headed by Justice Amin-ud-Din Khan. Continuing his arguments, Advocate Siddiqi emphasized the constitutional and public importance of the case. Justice Jamal Khan Mandokhail asked Siddiqi what led him to believe that the court's powers had been curtailed, to which he replied that he never made such a claim. Justice Hashim Kakar noted that Articles 187 and 175 of the Constitution must be read together. Siddiqi argued that the 26th Constitutional Amendment was not intended for clarification purposes. However, Justice Amin-ud-Din disagreed, stating that neither the amendment nor Article 184(3) was directly relevant to the current case. Siddiqi countered, claiming that the entire case hinges on these constitutional provisions. Justice Mandokhail reminded the counsel that the court would deal with the matter under the original language of Article 187 and warned that if arguments were not concluded by the end of the day, the court would deem them completed. Justice Amin-ud-Din noted that no one denied joining SIC and that PTI was effectively under SIC's control. He added, \"You want us to ignore all the facts and grant you relief.\" Justice Mandokhail cited a land dispute case from Balochistan where the court ruled in the government's favor, highlighting the principle that those declaring themselves independent cannot have their autonomy arbitrarily revoked. Siddiqi pointed out that the ECP had not issued notifications for SIC's reserved seats. Justice Mandokhail asked if those seats had been left vacant, to which the ECP replied that notifications were withheld for disputed seats. Justice Rizvi asked whether the instructions in the majority judgment had been followed. Siddiqi responded that all members had submitted their credentials and party affiliation, and the real question was why the ECP failed to implement the court's order. He criticized the ECP for both non-compliance and filing a review petition. Justice Mazhar observed that while 39 members were notified as PTI candidates, the reserved seats were withheld. He questioned whether the reserved seats were allocated proportionately. The ECP's Director General (Law) said that seat allocation follows a specific formula, and reserved seats cannot be distributed arbitrarily. Justice Mandokhail acknowledged that all involved were state institutions. \"Today I'm sitting here, tomorrow someone else will,\" he said. \"If something violates the Constitution or the law, does that mean it must still be followed?\" Siddiqi replied that unless something is struck down, it must be observed. Justice Mandokhail responded, \"Then the ECP has done the same.\" He added, \"That doesn't mean you can come here and attack the Supreme Court while I'm presiding.\" Following this, Advocate Faisal Siddiqi concluded his arguments. The Supreme Court adjourned further proceedings in the reserved seats review case until Wednesday, June 18.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}