{
  "title": "PM to launch Pakistan’s first “citizen-centric” National Security Policy Friday",
  "link": "https://www.app.com.pk/national/pm-to-launch-pakistans-first-citizen-centric-national-security-policy-friday/",
  "date_published": "2022-01-13T14:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): Prime Minister Imran Khan will launch the National Security Policy 2022-2026 Friday which articulates a citizen-centric framework, placing economic security at its core and seeking a secure and economically resilient Pakistan.\nThe prime minister will launch the public version of the otherwise classified NSP which is the first national security policy document of Pakistan.\nThe policy emphasizes a geo-economic vision to supplement the focus on geostrategy and highlights that the foremost aim of Pakistan’s foreign policy and military capability was peace and stability in the region and beyond, based on mutual respect and sovereign equality.\nThe formulation process of the policy includes multiple consultations with official stakeholders and input from over 600 individuals, including national security experts.\n“Our national security thinking seeks to identify means of expanding economic resources such that Pakistan can simultaneously strengthen its traditional and non-traditional security,” said National Security Adviser to PM Dr Moeed Yusuf.\nThe main themes of the NSP are national cohesion, securing an economic future, defence and territorial integrity, internal security, foreign policy in a changing world and human security.\nThe policy is aimed at addressing three critical economic challenges, external imbalance, socio-economic inequalities, and geographic disparities between developed and under-developed regions of Pakistan.\nThe document emhasized the non-negotiable focus on defence and territorial integrity of Pakistan, strengthening space-based technology and its application and combating hybrid warfare through enhancing information and cyber security.\nRegarding internal security, the policy seeks to ensure writ of the state across the country, zero-tolerance towards terrorism, extremism, and violent sub-nationalisms and fighting the menace of organized crimes.\nThe NSP will secure Pakistan’s interest and position globally. A just and peaceful resolution of the Jammu and Kashmir dispute in accordance with UNSC resolutions has been declared a vital security interest for the country.\nThe national security document would provide for pursuing youth-focused policies, guaranteeing food security, improve preventive healthcare and mainstreaming climate adaptation.",
  "retrievedAt": "2025-08-11T14:06:03.452Z"
}
