{
  "title": "PPPP, PML-N introduced majority IMF programs in Pakistan’s history",
  "link": "https://www.app.com.pk/national/pppp-pml-n-introduced-majority-imf-programs-in-pakistans-history/",
  "date_published": "2022-01-13T11:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP):Advisor to Prime Minister on Parliamentary Affairs Dr. Babar Awan on Thursday said the previous governments of PPPP and PML-N introduced 13 out of 22 programs of International Monetary Fund (IMF) in the history of Pakistan.\nTalking to media along with spokesperson of Ministry of Finance Muzammil Aslam, he said that those criticizing the mini-budget and deal with IMF should review their own performance in past as they approached IMF for 13 out of 22 times in the history of the country.\nHe said that national economy was weakened in past due to personal interests of the former rulers who strengthened their ‘personal economy’ and damaged the country.\nThe Adviser said that economic team of Prime Minister Imran Khan deserved appreciation over successful negotiations with IMF by keeping national and public interests on priority. He said it was proposed to increase electricity rate at the cost of Rs. 5 per unit but team successfully handled the matter by bringing these rates down to Re 1 and 40 paisas. Likewise, he said that tax ratio was also reduced and it was imposed on luxurious items.\nThe Adviser said that PPPP in their last tenure made a deal of 10 billion dollars with IMF of which around eight billion dollars were received.\nAll demands of IMF were accepted by PPPP which was criticizing now PTI government over the same demands it accepted.\nDr. Babar Awan said government would bring back self-exiled former prime minister Nawaz Sharif to the country as he would never return himself. He said that opposition was scaring due to the determination of the government to bring back Nawaz Sharif. “All means to live abroad have been blocked while routes are open for Nawaz Sharif to go to prison in Pakistan,” he added.\nHe said a drama was made in past over the health issue of Nawaz Sharif who was never treated or admitted to hospital in abroad after his departure from Pakistan.\nThe Adviser also criticized the opposition leader in National Assembly Mian Muhammad Shahbaz Sharif and said that he used to pretend backache during imprisonment but make illogical speeches in the National Assembly for hours.\nHe said that opposition would get nothing through protests as incumbent government led by Prime Minister Imran Khan would complete five years.\nThe opposition, he said, announced long march for seven times but it could not get support from the public.\nThe Adviser said that a legislative proposal – the Islamabad Capital Territory Local Government Ordinance 2021 – would be laid in the National Assembly which was aimed to transfer power at grassroots level.\nHe said that elections of local government would be held in Islamabad and people would directly elect Mayor under this system.\nThe Mayor would have Cabinet comprising 12 members of which six would be elected and other six to be professionals or technocrats. Around 100 -104 neighborhood councils would be elected through this system and each neighborhood councils shall have a population of at least twenty thousand, in addition, Election Commission of Pakistan may have the power of ten percent margin to increase or decrease any neighborhood council.\nThe Adviser said that Imran Khan has fulfilled the promise for free and fair elections and next elections would be held through EVMS while overseas would be able to poll their votes.\nHe also offered opposition to have negotiations on the legislative proposals instead of ruckus in the Parliament. The Finance (Supplementary) Bill, 2021 would smoothly sail in the National Assembly, he said adding that government allies are supporting it on it.\nThe Adviser said that Minister for Finance and Revenue Shaukat Tareen would also make important announcements during his concluding budget speech keeping in view the demands of people.",
  "retrievedAt": "2025-08-11T14:05:51.683Z"
}
