{
  "title": "PM to undertake three-day visit to China from Feb 3",
  "link": "https://www.app.com.pk/national/pm-to-undertake-three-day-visit-to-china-from-feb-3/",
  "date_published": "2022-01-13T18:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): Prime Minister Imran Khan will pay a three day visit to China from February 3 to attend the opening ceremony of Winter Olympics Games, Beijing 2022 at the invitation of Chinese leadership.\nThis was stated by Foreign Office Spokesperson Asim Iftikhar at his weekly news briefing here on Thursday.\nThe spokesperson said Prime Minister Imran Khan, during his visit, will have interaction with the Chinese leadership to further strengthen Pakistan-China all-weather strategic cooperative partnership and to exchange views on regional and international issues.\nThe Spokesperson said Pakistan looked forward to the successful Winter Olympics in Beijing.\nAsim Iftikhar said Pakistan welcomed the Global Development Initiative put forward by Chinese President Xi Jinping as a timely and good intention step to facilitate implementation of the UN 2030 agenda for sustainable development.\nHe noted it will help promote international cooperation required to overcome the triple challenge faced by the world including Covid-19, related economic crisis and climate change.\nThe Spokesperson said the Global Development Initiative will open up new avenues of collaboration with developing countries in support of their post pandemic economic recovery as well as long term sustainable growth.\nHe said Pakistan and China were strong development partners and “we look forward to further strengthen this partnership under China’s Global Development Initiative”.\nResponding to a question, the Foreign Office Spokesperson said Pakistan remained committed for peaceful relations with its neighbours including India. He, however, said the onus was on India to create an enabling environment for dialogue. He regretted that there was no visible change in the hostile attitude and negative behaviour of India.\nThe Spokesperson said Pakistan will continue to highlight Kashmir dispute and the rights of oppressed Kashmiri people at all the international forums.\nIt was reprehensible that Indian occupation forces were continuing with the killing spree in Indian Illegally Occupied Jammu and Kashmir (IIOJK). Since the start of this year, at least 15 Kashmiris had fallen victim to extra-judicial killings in fake encounters and so-called cordon-and-search operations. At least 210 Kashmiris were martyred in 2021. India was also shamelessly targeting journalists and human rights defenders.\nThe spokesperson said there was a real possibility that India might stage another false flag operation to complicate the current situation. He said, “we continue to alert our friends in international community about this prospect”.\nHe called on the international community to take immediate notice of the Indian state-terrorism in Indian illegally occupied Jammu and Kashmir and hold India accountable for the egregious violations of human rights and international humanitarian law in IIOJK.\nHe said India must allow unhindered access to international human rights and humanitarian organizations to conduct independent investigations in the IIOJK.\nTalking about Afghanistan, the spokesperson said urgent action was required to avert a humanitarian disaster there.",
  "retrievedAt": "2025-08-11T14:05:55.130Z"
}
