{
  "title": "President for enhanced trade, economic cooperation with South Korea, Algeria",
  "link": "https://www.app.com.pk/national/president-for-enhanced-trade-economic-cooperation-with-south-korea-algeria/",
  "date_published": "2022-01-13T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): President Dr Arif Alvi on Thursday stressed for enhanced relations with the Republic of Korea and Algeria in diverse fields with particular focus on trade and economic cooperation for mutual benefit.\nHe was talking to Pakistan’s Ambassador-designate to the Republic of Korea Nabeel Munir and Ambassador-designate to Algeria Dr Muhammad Tariq, who separately called on him here at the Aiwan-e-Sadr.\nDuring his meeting with Ambassador-designate Nabeel Munir, the President said that Pakistan highly valued its relationship with the Republic of Korea and wanted to further enhance collaborations for promoting political, economic, people-to-people, and cultural relations.\nHe emphasized the need for proactive measures to increase the quantum of trade between the two countries.\nThe President highlighted that Pakistan was a key investment destination for foreign investors in view of its investor-friendly policies and improved business environment.\nHe asked the Ambassador to urge the Korean investors to invest in different sectors of Pakistani economy, particularly in the Special Economic Zones (SEZs) and China Pakistan Economic Corridor (CPEC) projects.\nThe President said that both countries had great scope for promoting religious tourism as Pakistan possessed a number of historic Buddhist religious sites and religious tourists from Korea needed to be encouraged to visit the country.\nHe appreciated the assistance and cooperation extended by the EXIM Bank of South Korea for initiating work on the construction and establishment of Information Technology Park, at the cost of USD 88.80 million in Islamabad.\nHe welcomed the recent launch of the Samsung Mobile Phones Manufacturing Unit in Pakistan, being established in Karachi.\nThe President also underscored the need to encourage the exchanges of Parliamentary Friendship Groups of the two countries to further boost bilateral cooperation.\nLater, during the separate meeting with Ambassador-designate of Pakistan to Algeria, Dr Muhammad Tariq, the President said that Pakistan and Algeria enjoyed cordial relations based on a common religion and cultural values.\nHe stated that Pakistan had a vibrant IT sector and underscored the need for increasing collaboration between the two countries in the field of IT.\nThe President asked the ambassador to work for further promoting bilateral relations by arranging the exchange of Parliamentary and Chamber of Commerce delegations between the two countries.\nHe also proposed to set up a Joint Business Council to improve bilateral trade between Pakistan and Algeria.",
  "retrievedAt": "2025-08-11T14:06:23.862Z"
}
