{
  "title": "FMs of Pakistan, Canada discuss bilateral, regional issues",
  "link": "https://www.app.com.pk/national/fms-of-pakistan-canada-discuss-bilateral-regional-issues/",
  "date_published": "2022-01-13T18:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP):The newly-elected Foreign Minister of Canada Mélanie Joly called Foreign Minister Makhdoom Shah Mahmood Qureshi Thursday and discussed bilateral and regional issues.\nDuring the call, the Foreign Minister congratulated her on her appointment as Canada’s Foreign Minister and hoped that ties between Pakistan and Canada would further strengthen and widen during her tenure.\nThe Foreign Minister underlined that a large and strong Pakistani community in Canada was an essential part of the Canadian economy and social fabric. Underscoring that Pakistan was making vigorous efforts to harness the imperatives of geo-economics and human development, the Foreign Minister emphasized that Pakistan and Canada must deepen their engagement in the investment, trade, and financial sectors.\nThe Foreign Minister stressed the significance of a peaceful and stable Afghanistan for regional security and hoped that the global community will avoid making mistakes of the 1990s. Regarding the special session of OIC Foreign Ministers on Afghanistan held last month in Islamabad, the Foreign Minister apprised his counterpart about the unanimous resolution adopted by OIC CFM calling unequivocally for all possible humanitarian assistance for Afghanistan.\nThe Foreign Minister underscored the urgent priority of addressing the dire humanitarian needs and ensuring economic stability in Afghanistan. He also welcomed Canada’s humanitarian aid for Afghanistan worth 56 million Canadian dollars. The Foreign Minister also informed Foreign Minister Joly about Pakistan’s in-kind humanitarian assistance package of US$30 million, for Afghanistan, including food items and medicines.\nThe Foreign Minister stressed that Pakistan wanted to pursue policies of peace and economic development in the region and apprised the Canadian Foreign Minister about the dangers that BJP’s extremist policies were posing to regional peace and stability.Under the Hindutva-inspired BJP-RSS dispensation in New Delhi, space for minorities particularly Muslims and Christians was continuously shrinking in India, the Foreign Minister added.\nIn the global context, the Foreign Minister underscored Pakistan’s belief that the main driver in the international relations should be cooperation, not confrontation, and win-win solutions.The two Foreign Ministers resolved to further deepen bilateral co-operation and coordination in areas of mutual interests.",
  "retrievedAt": "2025-08-11T14:05:53.954Z"
}
