{
  "title": "HEC holds training of english language teachers",
  "link": "https://www.app.com.pk/national/hec-holds-training-of-english-language-teachers/",
  "date_published": "2022-01-13T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP):The National Academy of Higher Education (NAHE) of the Higher Education Commission (HEC), held a two-day training programme for English language teachers of different universities and affiliated colleges across the country.\nThe training is a part of an ongoing nine-month certificate course funded by Regional English Language Office (RELO) at the US Embassy, Islamabad in collaboration with University of Oregon. Twenty four teachers took part in the course. They have completed the first two phases of the programme online.\nThe objective of this programme is to train the participants on the newly designed English expository writing courses as part of the Undergraduate Education Policy 2020. Under the programme, the courses have been developed by a group of experts from Pakistani and US universities under a collaborative project by HEC, RELO Pakistan and Pak TESOL.\nIn her opening remarks, Rector NAHE Dr. Shaheen Sardar Ali underlined the role of university faculty in preparing the future generation of the nation. Dr. Kelli Odhuu, the head of RELO, highlighted the significance of professional development and briefed the participants on various opportunities created by RELO for the English language teachers community of the country.\nFormer Vice Chancellor Fatima Jinnah Women University Dr. Samina Amin Qadir shed light on the history of English language teaching reforms initiated by HEC since 2004-5. She also guided the participants on various aspects of research supervision in the English language.\nProgramme Specialist Academics, PERU, Dr. Zulfiqar Gilani shared with the participants the philosophy and approaches of the revamping project. Sharing their views, the participants appreciated the efforts of HEC, RELO and Pak TESOL for the improvement of English language teaching in the country.",
  "retrievedAt": "2025-08-11T14:06:06.351Z"
}
