{
  "title": "PM chairs CCI meeting; conduct of 7th Population & Housing Census approved",
  "link": "https://www.app.com.pk/national/pm-chairs-cci-meeting-conduct-of-7th-population-housing-census-approved/",
  "date_published": "2022-01-13T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP): The Council of Common Interests (CCI) during its 49th meeting held here Thursday with Prime Minister Imran Khan in chair approved the conduct of 7th Population and Housing Census as well as the establishment of “Census Monitoring Committee”.\nThe committee will be chaired by Deputy Chairman Planning Commission, all Provincial Chief Secretaries, Chairman National Database and Registration Authority (NADRA), Chief Commissioner Islamabad Capital Territory (ICT) and other senior officials.\nThe committee will oversee and monitor the census activities to ensure expeditious, transparent and credible census operations, a press release issued by the PM Media Office here said.\nAs per recommendations of the Census Advisory Committee, the CCI decided to conduct the 7th Census adopting international best practices, using digital technology and GIS monitoring system. It was apprised that Housing Census would be conducted before the Population Census.\nWhile welcoming the Chief Ministers, the Prime Minister stated that frequency of CCI meetings can be increased as per demands of the provinces.\nHe congratulated the CCI members on the establishment of CCI’s permanent secretariat and stated that it manifested a collaborative spirit between the Federal and Provincial governments.\nThe Prime Minister emphasized that the federal government was fully committed to resolve national issues in consultation with all federating units and stakeholders.\nHe further emphasized that the government wanted to have a credible census data that can be used for initiating policies and projects for the welfare of citizens.\nThe meeting approved Annual Report of CCI for the Fiscal Year 2020-21. It was informed that a total of 6 meetings were conducted during the FY 2020-21 during which 21 agenda items were considered with 13 decisions implemented and 06 decisions under process.\nWhile discussing the implementation status of previous decisions, the CCI was informed that an independent CCI Secretariat has been established with a budget of Rs. 110.928 million.\nAn independent Secretariat will facilitate effective coordination between the Federal and Provincial governments.\nThe CCI also decided that additional water requirements for Karachi would be discussed by the committee formed to reconcile views of the provinces at the political and technical levels and issues related to water.",
  "retrievedAt": "2025-08-11T14:06:01.131Z"
}
