{
  "article_id": "2025-05-18_320276cfc25cd05a1f8335f74410e44f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/n-75-cleared-for-expansion-in-bhara-kahu-anti-encroachment-drive/",
    "retrieved_at": "2025-08-27T15:36:00.284Z"
  },
  "metadata": {
    "title": "N-75 cleared for expansion in Bhara Kahu anti encroachment drive",
    "author": null,
    "date_published": "2025-05-18T13:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 603,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, May 18 (APP):In a coordinated effort to clear space for the expansion of National Highway N-75, the Islamabad district administration and the National Highway Authority (NHA) launched an extensive anti-encroachment operation in Bhara Kahu. The drive, supported by federal police and heavy machinery, targeted illegal structures and parking spaces that had occupied government land for years, said the spokesman of ICT administration here. He said that the operation aimed at clearing government land in Bhara Kahu began in the afternoon and continued late into the night. The focus of the effort was to facilitate the planned widening of National Highway N-75, a major road linking Islamabad to Murree and Azad Kashmir. The anti-encroachment operation was jointly conducted by the National Highway Authority and Islamabad's district administration. Personnel from the federal police also assisted in maintaining order during the drive, which was carried out without prior announcement to prevent interference. In this regard, Assistant Commissioner Secretariat Uzair Ali Khan supervised the operation on behalf of the district administration. The spokesman stated that illegal parking spaces belonging to several commercial centers were removed. In addition, signboards and extended stairways built on public land were taken down using heavy machinery. The drive led to the removal of encroachments from 26 commercial units. These businesses had set up structures on land owned by the government, hindering traffic flow and delaying road expansion work. The cleared area is now expected to be used for road development and public use. Officials said that the operation had been planned for weeks, based on a detailed survey identifying key encroachment hotspots. Shopfronts, ramps, and temporary structures that had been extended beyond legal limits were marked in advance. Business owners were not issued fresh notices during the latest phase of the drive, as prior warnings and deadlines had already been given in previous weeks. NHA officials said that the clearance of these areas was essential to proceed with the long-delayed expansion of N-75. The highway has seen increased traffic pressure in recent years due to population growth and urban sprawl in and around Bhara Kahu. Daily commuters have often complained about long traffic jams in the area, especially during peak hours and on weekends. The administration said the decision to start the operation came after repeated delays in construction work caused by unauthorized use of state land. A spokesperson noted that the presence of illegal extensions had created bottlenecks, leaving little room for road-widening machinery to function safely. Officials confirmed that no untoward incidents were reported during the hours-long drive. Police presence was maintained throughout the operation to avoid any resistance from shopkeepers or local residents. The operation continued under floodlights after sunset to ensure all marked locations were cleared within the day. The administration also dismissed concerns that small businesses were being unfairly treated. Officials explained that encroachment notices had been served earlier and that businesses had been given ample time to remove unauthorized structures voluntarily. The Islamabad district administration has announced that more such operations will follow in other areas where public projects are facing hurdles due to similar issues. Officials emphasized that there would be no exceptions in future drives and that all encroachments-regardless of size or location-would be removed. The joint operation reflects the administration's plan to accelerate delayed infrastructure projects, particularly those involving major roads. The expansion of National Highway N-75 is expected to improve connectivity and reduce travel time between Islamabad and surrounding regions. The district administration urged business owners and local residents to cooperate with ongoing and future development efforts. Officials added that restoring public land is critical for meeting the city's transportation needs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}