{
  "article_id": "2025-05-18_8efb1c0be8c840392e7d51a5b97140f8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kamal-hails-gates-foundations-role-in-anti-polio-initiatives/",
    "retrieved_at": "2025-08-27T15:35:32.327Z"
  },
  "metadata": {
    "title": "Kamal hails Gates Foundation’s role in anti-polio initiatives",
    "author": null,
    "date_published": "2025-05-18T17:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 265,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 18 (APP):Federal Minister for Health, Syed Mustafa Kamal on Sunday held a high-level meeting with Dr Chris Elias, President of Global Development at the Bill & Melinda Gates Foundation, to discuss ongoing and future collaboration in Pakistan's polio eradication campaign. According to a spokesperson of the Ministry of Health, the meeting focused on strengthening bilateral efforts to eliminate polio from the country. Minister Kamal expressed gratitude for the Gates Foundation's consistent support and acknowledged its vital role in advancing Pakistan's anti-polio initiatives. \"The fight against polio has required tremendous sacrifice from all stakeholders, including our law enforcement personnel who continue to play an essential role in this national mission,\" stated Minister Kamal. \"Our goal is absolute eradication, and we remain firmly committed.\" He noted that under the leadership of the Prime Minister, Pakistan has demonstrated a strong national resolve, with frequent high-level reviews of the eradication program and allocation of necessary resources. He also highlighted enhanced coordination with Afghanistan through synchronized national immunization drives. The Minister reported successful nationwide anti-polio campaigns in February and April, and announced the next round, commencing May 26, which will target over 45.4 million children under the age of five. He also cited a significant reduction in vaccine refusals, attributing it to improved campaign quality and strengthened community engagement. Minister Kamal expressed optimism that Pakistan is on track to achieve full eradication of polio by the end of 2025. Dr Elias lauded the Government of Pakistan's sustained efforts and reaffirmed the Gates Foundation's ongoing support. He expressed confidence in the country's ability to meet its 2025 eradication target.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}