{
  "title": "Passerby killed by fleeing robbers in Karachi’s Orangi Town - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A man was killed and another wounded when fleeing robbers resorted to indiscriminate firing in Orangi Town on Wednesday afternoon, police said.\n\nThey identified the deceased as Hashim Qasim, 28, and the wounded as Mohammed Sohail alias Shoaib, 53.\n\nOrangi Town SHO Mehar Yusuf told Dawn that two suspects snatched a motorcycle from a citizen. They were fleeing on that bike when the citizens chased them. However, the robbers resorted to indiscriminate firing in their bid to escape.\n\nVictims Hashim and Sohail were sitting on a street near the Monday Bazaar and as they stood up after hearing gunshots, they were hit by the bullets, the SHO added. The suspects managed to escape from the spot with the snatched motorcycle. Both the wounded men were taken to the Abbasi Shaheed Hospital, where one was pronounced dead while the other was admitted for treatment.\n\nMan shot dead by estranged wife\n\nA man was shot dead allegedly by his estranged wife in Orangi Town early Wednesday morning.\n\nIqbal Market SHO Shahbaz Yusuf told Dawn that Mohammed Husain, 35, was gunned down by his estranged wife inside her home in Sector-11 ½.\n\nThe officer said that the couple often quarrelled with each other, which prompted the woman to approach a court for dissolution of marriage, and the case was still pending. However, it infuriated the man, who attacked his in-laws around 10 days ago and wounded his father-in-law and two others.\n\nThe SHO added that the same suspect attempted to shoot his wife with his pistol but she snatched the weapon from him and shot him dead.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/09101506e4d5f0f.webp",
  "retrievedAt": "2025-10-16T20:48:35.103Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947503/passerby-killed-by-fleeing-robbers-in-karachis-orangi-town",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:17:54.000Z"
}
