{
  "title": "KP strongman ousted ‘on Imran’s orders’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "• MPA Sohail Afridi picked to replace Gandapur as chief minister\n• Outgoing CM claims he steered KP to financial stability, countered militancy with courage\n• Raja says decision based on ‘poor security situation in KP’; Gohar rules out presence of ‘forward bloc’ in the party\n• PTI mulling registration of ‘two party names’ with ECP to circumvent any adverse moves\n\nISLAMABAD: Ali Amin Gandapur stepped down as the chief minister of Khyber Pakhtunkhwa on Wednesday after incarcerated PTI leader Imran Khan ordered him to resign, apparently due to the deteriorating law and order in the province.\n\nPTI MPA from Khyber Sohail Afridi will replace Mr Gandapur as the chief executive of the restive province, confirmed party leader Salman Akram Raja in a media interaction.\n\nThe removal of the KP CM comes amid a growing rift within the KP’s ruling party, which has pitted Mr Gandapur against Imran’s sister Aleema Khan — as both sides recently having gone public with their reservations against each other.\n\nIn the resignation letter released to the media on Wednesday evening, Mr Gandapur said it was his ‘honour’ to resign in compliance with the orders of his leader, Imran Khan.\n\n“When I took over as [the] chief minister, the province was faced with a dual challenge of financial ruin and menace of terrorism. Over the last one and a half years…we steered the province to financial stability and countered the threat of militancy with resolute courage and unwavering decision-making. We initiated mega projects of nation-building in a province that was militarily categorised as a war zone.”\n\n“I thank all my cabinet colleagues, members of the assembly — both from PTI as well as opposition — and all KP bureaucrats who helped me face extraordinary challenges of governance in KP. I may not be able to claim with certainty that I did well on all these challenges, but one thing that I can say with utmost certainty is that I served the people of KP with absolute sincerity and always acted in the best interests of Pakistan,” he wrote.\n\nEarlier in the day, PTI General Secretary Salman Akram Raja told reporters that the decision to remove Mr Gandapur had been made by the jailed party chief.\n\nSpeaking to the media in Rawalpindi, Mr Raja announced that as per the directions of the founding chairman, Mr Gandapur would be replaced by MPA Sohail Afridi.\n\nReplying to questions, he claimed that Imran Khan had informed him about the background of the decision and instructed him to brief the media.\n\nHe said terrorism was badly affecting KP and a record number of incidents were being reported. He said that Mr Khan was very perturbed by the situation, especially the recent incident in the Orakzai district, and he had no choice but to change the CM.\n\nMr Raja also said that the PTI founder had been continuously saying that the policies of the federal government were ‘wrong’ and the KP government should distance itself from them.\n\n‘No forward bloc’\n\nDawn.com quoted PTI Chairman Barrister Gohar as saying that the decision regarding the replacement of the KP CM would not lead to any forward blocs in the party.\n\n“Khan’s instructions will be acted on. Ali Amin Gandapur will depart for Peshawar in half an hour and send his resignation via summary to the governor tomorrow. Everyone will support the PTI government that will be formed as per Khan’s instructions,” he said earlier in the day.\n\nThe interim PTI chairman said he wanted to make it ‘clear’ that there was ‘no forward bloc’ in the party. Mr Gohar said the party would maintain its two-thirds majority in KP with 91 MPAs.\n\nMr Gohar added that Mr Gandapur had clearly said that he was the chief minister only as long as Imran’s trust was reposed in him.\n\nPTI to register more parties\n\nSeparately, the PTI has also been deliberating a decision to register one or two political parties to circumvent any adverse situation like the one it had encountered during the Feb 8 elections.\n\nSources told Dawn it was being considered to register one or two political parties to avoid any untoward situation in the future. The names which are being considered are ‘Tehreek-i-Insaf Pakistan’ and ‘Insaf Pakistan’ etc.\n\nAccording to sources, the new party or parties will have separate chairmen so that in case of the disqualification of one party’s chairman, the other party would be available to contest elections. PTI stalwart Asad Qaiser confirmed to Dawn that the idea was under consideration and that they were working on different names.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e6e2ad17b4b.jpg",
  "retrievedAt": "2025-10-12T13:15:20.729Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947574/kp-strongman-ousted-on-imrans-orders#:~:text=PTI%20to%20register%20more%20parties",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:12:06.000Z"
}
