{
  "title": "Genetics play a role in higher depression risk for women: study - World - DAWN.COM",
  "author": null,
  "content": "BRISBANE: Genetic factors contribute more to depression risk in females than in males, according to a large Australian study that may help further understanding of why women are more likely to suffer from the condition.\n\nAnalysing DNA samples from nearly half a million people, researchers found roughly twice as many genetic flags for depression in females compared with males, the research team reported in Nature Communications.\n\nWe already know that females are twice as likely to suffer from depression in their lifetime than males, study leader Dr Brittany Mitchell of QIMR Berg­hofer Medical Research Institute in Brisbane said in a statement.\n\nUntil now, there hasn’t been much consistent research to explain why depression affects females and males differently, including the possible role of genetics, Mitchell said. The team identified about 7,000 changes in DNA that could cause depression in both sexes, and about a further 6,000 DNA changes that could cause depression in females only.\n\nThe researchers also found that the genetic factors linked to depression overlap more with genes for metabolic traits in females than in males. The differences may help explain why females with depression more often experience metabolic symptoms such as weight changes or altered energy levels, they said.\n\nThe researchers say most drug trials and therapies are tested on males, and they hope their work will also translate to a greater clinical understanding of female depression. These findings underscore the importance of considering sex-specific genetic (factors) in the study of health conditions, including major depressive disorder, paving the way for more targeted treatment strategies, the researchers concluded.\n\nMicroplastics alter bacteria population\n\nTiny pieces of plastic that find their way into human intestines can adversely impact the healthy bacteria and other microbes that naturally live there, known as the gut microbiome, laboratory experiments suggest. Some of the microplastic-induced changes in gut microbes observed in test tubes were similar to changes seen with depression, colorectal cancer, and other diseases, researchers reported at the ongoing United European Gast­roenterology Week meeting in Berlin.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:48:56.079Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947552/genetics-play-a-role-in-higher-depression-risk-for-women-study",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:17:43.000Z"
}
