{
  "title": "What critical minerals are on China’s export control list now? - Business - DAWN.COM",
  "author": null,
  "content": "China on Thursday expanded its export controls over rare earths and related technology in a move to further tighten its grip and dominance on the critical minerals key to the energy transition.\n\nFive more medium to heavy rare earth elements — holmium, erbium, thulium, europium and ytterbium — and related material will be added from November 8, China’s commerce ministry said.\n\nThe rare earths will join over twenty elements and related materials already listed, in each case forcing exporters to apply to Beijing for licences before selling overseas. China has also separately banned exports of gallium, germanium and antimony to the United States.\n\nBelow is a summary of all Beijing’s mineral export restrictions since 2023:\n\nChina produces around 90 per cent of the world’s rare earths, a group of 17 elements with small but crucial uses in sectors like clean energy, defence and automotive.\n\nChina first placed seven of the elements and related material on an export control list in April before adding a further five on Thursday. The five new elements play small but crucial roles in fibre optics, nuclear power and other sectors.\n\nWhile rare earths are common in the Earth’s crust, China has mastered the technically difficult and environmentally harmful refining process comparatively cheaply.\n\nChina has spent years tightening its control over the rare earths sector. In December 2023, Beijing banned the export of technology to make rare earth magnets, adding it to an existing ban on refining technology.\n\nOn Thursday, it added dozens more machines and materials used in mining and refining to the control list. Domestic production is tightly controlled by a system of quotas that are only granted to state-owned miners.\n\nChina imposed export controls on five other metals used in defence, clean energy and other industries — tungsten, indium, bismuth, tellurium and molybdenum — in early February, shortly after US President Donald Trump’s first 10pc tariff on Chinese goods took effect.\n\nLicences are now required to export 20 related products. However, the curbs stopped short of outright bans and were narrowly targeted in the cases of some metals, like molybdenum.\n\nChina in January proposed to restrict the export of some technology used to make cutting-edge battery components and process critical minerals lithium and gallium. The controls were imposed in July.\n\nAt least one company has stopped exporting products on the list since the proposal was floated.\n\nOn Thursday, China widened those controls to include more lithium battery-related items and equipment used to manufacture certain lithium-ion batteries.\n\nBeijing banned the export of antimony, gallium and germanium to the US in late 2024 in response to a fresh crackdown on China’s chip sector from Washington. The outright ban only applies to the US, although over the previous 18 months, China had steadily introduced export licensing regimes for the three metals.\n\nIn the case of antimony, a strategic metal used in flame retardants, solar power equipment and munitions, exports to big buyers like Japan, India and South Korea had barely restarted three months after export licences were introduced.\n\nChina dominates the supply chain for the three metals and mines or refines between half and 90pc of the global supply of those minerals.\n\nBeijing on Thursday widened existing export controls on graphite to include some synthetic graphite materials, effective from November 8.\n\nIn October 2023, China said it would require export permits for three types of “highly sensitive” graphite products to protect national security.\n\nChina is the world’s top graphite producer and exporter, and also refines more than 90pc of the world’s graphite into a material that is used in virtually all EV batteries.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/09232830c77ef33.webp",
  "retrievedAt": "2025-10-12T13:14:29.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947713/what-critical-minerals-are-on-chinas-export-control-list-now",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T17:49:48.000Z"
}
