{
  "title": "Workers remittances increase by 8.41pc to $9.5bn in FY26’s 1st quarter - Pakistan - DAWN.COM",
  "author": null,
  "content": "The State Bank of Pakistan (SBP) said on Thursday that overseas workers’ remittances witnessed an increase of 8.41 per cent during the first quarter (July-September) of fiscal year 2025-26.\n\nThe central bank said an inflow of $9.536 billion was recorded during July-September 2025 as compared to $8.796bn during the same period last year.\n\nOn a year-on-year basis, the SBP said workers’ remittances went up by 11.33pc in September to $3.183bn from $2.859bn during the same month last year.\n\nIt added that remittance inflows during September were mainly sourced from Saudi Arabia ($750.9 million), the United Arab Emirates ($677.1m), the United Kingdom ($454.8m) and the United States ($269m).\n\nAdviser to Finance Minister Khurram Schehzad said Pakistan received $38.3bn in remittances during the last fiscal year, adding that remittances were expected to surpass $41bn in the current fiscal year.\n\nRemittances are a lifeline for millions of households across the country, he said, adding that the continuous increase in remittances strengthened Pakistan’s external accounts.\n\n‘‘Remittances are not merely a source of financial inflow but a symbol of national and economic resilience.’’\n\nCurrency experts believe remittance growth this year is weaker than in FY25. They cite concerns over a “managed” exchange rate, suggesting some inflows may be diverted away from official banking channels. Despite the rupee’s appreciation over the past two months, market participants argue the current rate may not reflect true market parity.\n\nThe government received $38bn in remittances in FY25 and has set a target of $40bn for the current fiscal year. Currency analysts believe maintaining FY25’s inflow level would support exchange rate stability.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/091749259160862.webp",
  "retrievedAt": "2025-10-12T13:14:30.623Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947689/workers-remittances-increase-by-841pc-to-95bn-in-fy26s-1st-quarter",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T13:03:44.000Z"
}
