{
  "title": "Three Lyari gangsters running extortion rackets from abroad - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Officials say Interpol to be approached for red notices against Wasiullah Lakho, Samad Kathiawari and Jamil Chhanga\n• Out of 118 extortion cases reported in 2025, 44 are found to be genuine: police\n• IGP pledges full protection of economic activity with traders’ cooperation\n\nKARACHI: As the city’s trade and industry leaders voiced concern over an alarming surge in cases of extortion in the metropolis, police authorities have identified three organised gangs whose ringleaders and members are allegedly operating from abroad using foreign SIMs.\n\nAccording to police, the three gangs are led by Lyari-based gangsters — Wasiullah Lakho, Samad Kathiawari and Jamil Chhanga — who fled Karachi a couple of years ago and are now residing overseas.\n\n“These gang leaders are reportedly settled in Iran and are using Iranian phone numbers to carry out their operations,” police officials said.\n\nCrime statistics shared by police says 118 incidents of extortion have been reported in Karachi this year. However, only 44 (37 per cent) of the total cases were found to be genuine, while 74 complaints turned out to be related to business or personal disputes.\n\nRegarding the detection and investigation of these cases, the police report noted that the detection rate stood at over 88pc, as 39 out of 44 genuine cases had been detected, with 43 suspects arrested and five killed in encounters, while 30 suspects remain at large.\n\nPolice investigations have identified the involvement of the three organised gangs in 12 of the 44 genuine cases. The authorities have completed the necessary paperwork for the issuance of red notices against the gang leaders, and all procedural requirements have been fulfilled.\n\nPolice officials added that the Wasiullah Lakho and Samad Kathiawari gangs had “reportedly merged their operations,” intensifying extortion activities in recent months.\n\n“These gangs have recently begun targeting builders — including members of the Association of Builders and Developers (Abad) — as well as other businessmen,” the report said.\n\nOver the past 10 days, four alleged extortionists have been killed in police encounters. They included two suspects, Abdul Hadi and Saeed, involved in the Mateen Food case; Ghulam Qadir, an extortionist/financier/handler linked to the Jillani case; and Ehtisham alias Asif Burger, an extortionist/shooter associated with the Kathiawari gang.\n\nIGP reiterates resolve to protect economic activities\n\nSindh Inspector General of Police (IGP) Ghulam Nabi Memon reaffirmed the police department’s commitment to ensuring full protection of economic activities across the province in collaboration with the business community.\n\nHe said the Sindh police, with the support of traders, were determined to eliminate elements disrupting the smooth functioning of the economy.\n\n“We have taken strict action in the past against those hindering economic stability, and similar indiscriminate action will continue in the future,” said the IGP.\n\nMr Memon praised the installation of CCTV cameras at business centres by traders in response to the police’s appeal, terming it a “commendable initiative” that would strengthen overall security.\n\nHe added that the Sindh government, law enforcement agencies, and the business community were working in close coordination to sustain and promote economic stability in the province. The IGP said the Sindh police, utilising resources provided by the provincial government, were conducting daily operations against criminal elements across the province.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/09100446b68cf67.webp",
  "retrievedAt": "2025-10-16T20:47:44.837Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947504/three-lyari-gangsters-running-extortion-rackets-from-abroad",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:17:54.000Z"
}
