{
  "title": "Sindh CM Shah welcomes Saudi delegation, highlights 12 priority investment sectors - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Chief Minister Murad Ali Shah welcomed a high-level Saudi business delegation on Thursday and highlighted 12 priority sectors for investment in the province.\n\nThe high-level business delegation from Saudi Arabia, led by Saudi-Pakistan Joint Business Council Chairman Prince Mansour bin Mohammad Al Saud, arrived in Pakistan on Tuesday to discuss trade, investment and collaboration.\n\nThe development followed Pakistan forming an 18-member committee to oversee bilateral economic engagements and negotiations with the kingdom. Last month, the two countries also signed a mutual defence agreement, pledging a joint response to any act of aggression.\n\nA press release issued today from the CM Secretariat said the delegation was welcomed at CM House by Shah and provincial ministers. It added that the delegation included over 30 prominent businessmen and investors associated with the energy, infrastructure, agriculture, livestock, mining, construction, logistics and investment sectors.\n\nRepresentatives of the Pakistan Business Council, Overseas Investors Chamber of Commerce and Industry (OICCI) and the Saudi Embassy also attended the meeting.\n\nOn the occasion, two memorandums of understanding (MoUs) were signed, marking significant progress in K-Electric’s ownership and future collaboration framework.\n\nThe first MoU was signed for the sale and purchase of shares in KES Power Ltd. The second MoU was signed between K-Electric Limited and Trident Energy Ltd to explore strategic cooperation and investment opportunities in Pakistan’s power sector.\n\n“These agreements reflect growing international investor confidence in Pakistan’s energy market and a renewed commitment to enhancing power generation, transmission and distribution infrastructure in the country,’’ a press release from the CM Secretariat said.\n\n“Sindh CM highlights 12 priority investment sectors of Sindh. Saudi companies invited to invest in agriculture, energy, infrastructure, logistics and industrial projects,” the press release said.\n\nIt said the chief minister acknowledged the historical and brotherly relations between the two countries.\n\n“Sindh is ready to become the gateway for Pakistan’s economic development. We have digitised land records and simplified investment procedures. Investor-friendly and reform-oriented environment is Sindh government’s priority.”\n\n‘‘Our partnership with Saudi Arabia is very important for the economic future of the region. Sindh government is fully aligned with the goals of Saudi Vision 2030,’’ the press release quoted the chief minister as saying.\n\nHe pointed out that the Hyderabad-Sukkur Motorway presented investment opportunities and invited the delegation to participate in Karachi’s Blue and Yellow Line transit systems.\n\nJoint ventures in the fisheries and livestock sectors were also offered to the Saudi delegation, along with an invitation to participate in the establishment of special economic zones.\n\nThe chief minister and the Saudi delegation agreed to establish joint working groups, with Shah saying that different sectoral working groups were necessary to ensure continuity of cooperation.\n\n‘‘Sindh government is working in full coordination with federal institutions. The Sindh government has close links with the Federal Ministry of Investment, Special Investment Facilitation Council and Trade Development Authority of Pakistan so that foreign investors will be provided with complete facilities from feasibility to practical implementation,’’ CM Shah said.\n\nThe press release added that promoting cooperation between the public and private sectors was also discussed.\n\nPrince Mansoor thanked CM Shah for hosting him and said he had come with the delegation to establish a “new partnership’’ between the two countries.\n\nHe said sub-committees would be established for each sector and investment would be initiated to promote funding inflows.\n\nPointing out Karachi’s status as a port city, the Saudi prince said there were “great investment opportunities here’’ while CM Shah said the Sindh government had opened its doors for investment and all possible cooperation would be extended to Saudi investors.\n\nAddressing the delegation, CM Shah said bilateral relations had gained a new dimension with the Saudi-Pakistan Joint Business Council, adding that the country’s relations with Sindh would also further strengthen.\n\nHe invited Saudi investors to explore long-term partnerships in Sindh under public-private partnerships, government-to-business and business-to-business models, emphasising collaboration for innovation, technology transfer and industrial growth.\n\nOn the occasion, two memorandums of understanding (MoUs) were signed, marking significant progress in K-Electric’s ownership and future collaboration framework.\n\nThe first MoU was signed for the sale and purchase of shares in KES Power Ltd. The second MoU was signed between K-Electric Limited and Trident Energy Ltd to explore strategic cooperation and investment opportunities in Pakistan’s power sector.\n\n“These agreements reflect growing international investor confidence in Pakistan’s energy market and a renewed commitment to enhancing power generation, transmission and distribution infrastructure in the country,’’ a press release from the CM Secratariat said.\n\nThe two countries have long shared a multifaceted relationship rooted in mutual economic interests, strategic military cooperation, and shared Islamic heritage. These ties have encompassed economic assistance and energy supplies, with the kingdom being a significant source of financial aid and oil for Islamabad.\n\nIn February, Riyadh signed a $1.2 billion deferred oil facility, releasing $100 million monthly until February 2026. Islamabad is also seeking a rollover of $5bn Saudi loans — $2bn maturing in December 2025 and $3bn in June 2026 — at a concessional four per cent interest rate.\n\nLast year, Prime Minister Shehbaz Sharif said Riyadh was “central to Pakistan’s economy” as he met Saudi Crown Prince Moha­m­med Bin Salman on the sidelines of the Future Investment Initiative in Riyadh.\n\nThe government is seeking large investments in state-owned enterprises and the development of a petrochemicals plant, according to a Reuters report.\n\nRiyadh has also shown interest in mining in the past, including in buying part of the Pakistani government stake in the multibillion-dollar Reko Diq copper mine being developed in Balochistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/091752378094e8f.webp",
  "retrievedAt": "2025-10-12T13:14:30.603Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947684/sindh-cm-shah-welcomes-saudi-delegation-highlights-12-priority-investment-sectors",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T12:53:53.000Z"
}
