{
  "title": "Spanish parliament approves Israel arms embargo - World - DAWN.COM",
  "author": null,
  "content": "MADRID: Spanish lawmakers on Wednesday approved the enshrinement in law of an arms embargo on Israel that Prime Minister Pedro Sanchez introduced to end “the genocide in Gaza”.\n\nParliament backed by 178 votes to 169 the decree announced in September by Sanchez, one of the most virulent critics among world leaders of Israel’s devastating two-year-old bombing in the Palestinian territory.\n\nThe support of far-left party Podemos, which has four MPs and had criticised the decree, helped swing the vote the leftist minority coalition’s way after days of speculation about their lawmakers’ position. The government says it had already banned buying weapons from or selling them to Israel since the start of the conflict.\n\nBut Sanchez announced last month a decree to “consolidate in law” the embargo as part of a series of measures against Israel’s action.\n\nIt bans all exports of defence equipment, products or technology to Israel and imports of such goods from the country. The decree also outlaws the transit of aviation fuel with potential military use and bans the advertising of products “coming from illegal colonies in Gaza and the West Bank”.\n\nThe text allows the government to make exceptions for dual-use defence equipment “if the application of the ban harmed general national interests”.\n\nSeptember’s anno­uncement triggered furious condemnation from Israel, which had already withdrawn its ambassador to Madrid in 2024 after Spain recognised a Palestinian state.\n\nThe vote was initially scheduled for Tuesday, but Spanish media said it was held a day later to avoid coinciding with the two-year anniversary of the Hamas raid.\n\nIsrael’s embassy in Spain had criticised the original plan, calling it “a cynical and reprehensible decision” in a letter released late on Monday.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/09074931b46d137.webp",
  "retrievedAt": "2025-10-16T20:48:48.866Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947551/spanish-parliament-approves-israel-arms-embargo",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:17:43.000Z"
}
