{
  "title": "More areas of KP’s Lowi Mamund cleared of terrorists - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR: Authorities claimed to have declared seven more areas of Lowi Mamund tehsil of terrorists, allowing displaced persons to return to their homes which they evacuated some two months ago.\n\n“We are delighted to announce that as a result of security forces’ successful and comprehensive action against terrorists, seven more localities of Lowi Mamund tehsil have been declared completely free of all anti-state, anti-social and anti-peace elements,” said a notification issued by the administration on Tuesday night.\n\nAccording to the notification, Zari, Gelay, Gat, Ghundi, Zagai Lara Zagai and Bara Zagai areas have been cleared of terrorists. “After declaring the areas free of militants, complete peace and writ of state have been restored there, allowing their residents to return to their homes, which they had evacuated for the sake of peace,” it added.\n\nDisplaced people start returning home\n\nThe notification did not specify as to how many areas in Lowi and War Mamund tehsils were still not cleared of terrorists. However, an official told this scribe that the recent declaration of seven areas as terrorist-free raised the total number of cleared localities to 40 in Lowi and War Mamund tehsils, a result of the targeted operation launched on August 11.\n\nScores of residents of the cleared areas started returning to their homes on Wednesday morning with great excitement. “We are returning to our homes after residing outside for 59 days. We are very thankful to Allah for seeing this day, which we had been waiting for,” said social media posts of several displaced persons, shared ahead of their departure for home.\n\nMoreover, many residents of the said areas, mostly youths who returned to their homes on Wednesday evening, also shared their feelings on social media after entering their homes. “Thanks to Allah, we’ve arrived home safely after about two months of staying outside,” said a social media post.\n\nAn official of Provincial Disaster Management Authority (PDMA) overseeing arrangements for displaced persons told this scribe on Wednesday that residents of the freshly-cleared areas started returning home in large numbers.\n\nHe claimed that most of the displaced persons, out of around 178,000 who had evacuated their homes owing to the military operation, returned to their homes.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/09103734007cea1.webp",
  "retrievedAt": "2025-10-12T13:14:55.463Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947511/more-areas-of-kps-lowi-mamund-cleared-of-terrorists",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:18:14.000Z"
}
