{
  "title": "UNHCR expresses concern over govt decision to de-notify 16 refugee villages - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The UNHCR on Wednesday expressed concern over the government’s decision to de-notify 16 refugee villages and forcibly return Afghans, including refugees, to Afghanistan.\n\nThe federal government recently de-notified these 16 refugee villages in Balochistan, Khyber Pakhtun­khwa and Punjab. In August, the government asked Afghan refugees to leave the country as part of its Illegal Foreigners Repatriation Plan (IFRP).\n\nAs many of the refugees have lived in these villages for decades and established livelihoods, forcing them to return within a short period has a serious and negative impact on their lives and livelihoods, as well as their reintegration in Afghanistan, the UNHCR says.\n\n“Return of refugees should be organised, phased, voluntary, in dignity and safety, with respect for rights and protection of those in need,” said UNHCR Representative Philippa Candler.\n\nUN refugee agency is also concerned about women and girls being forced to return to a country where their rights to work and education are at risk\n\nPakistan has been a generous host to Afghans for over 45 years, providing protection to millions of people. “There are still many people in Pakistan who would be at risk of persecution should they be obliged to return to Afghanistan. These individuals need to be exempted from the IFRP,” she said.\n\nThe UN refugee agency is also concerned about women and girls being forced to return to a country where their rights to work and education are at risk.\n\nThe UNHCR has urged the government to take measures for organised and phased return and to exempt Afghans with continued international protection needs from involuntary return.\n\n“We also appeal to Pakistan to allow legal stay for Afghans with medical needs, those currently pursuing higher education, and those in mixed marriages,” Ms Candler added.\n\nThe UN refugee agency reaffirmed its commitment to work closely with the government of Pakistan to identify solutions that respect Pakistan’s concerns while upholding international principles.\n\nMeanwhile, a situation report released by the World Health Organisation (WHO) says between the second fortnight of September, a total of 73,560 Afghans returned to Afghanistan through the five main border points with Iran and Pakistan.\n\nThe majority, 61 per cent (44,878 people) returned from Iran, while 39 per cent (28,682 people) arrived in Afghanistan from Pakistan. This marks a significant 35 per cent decline in overall returnee numbers compared to the previous two weeks (from 113,693 to 73,560 individuals).\n\nAmong the points of entry, Islam Qala remained the busiest, receiving 43 per cent (31,907) of all returnees from Iran. In contrast, Bahramcha recorded the lowest number, with only 2.3 per cent (1,763) arrivals from Pakistan.\n\nThis drop in movement may reflect shifting migration dynamics or temporary factors affecting cross-border flows, which will require continued monitoring in the coming weeks.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e6dd39e3961.jpg",
  "retrievedAt": "2025-10-16T20:48:11.269Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947560/unhcr-expresses-concern-over-govt-decision-to-de-notify-16-refugee-villages",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:17:21.000Z"
}
