{
  "title": "Putin admits Russian role in 2024 crash of Azerbaijani jet - World - DAWN.COM",
  "author": null,
  "content": "Russian President Vladimir Putin on Thursday admitted for the first time his country played a role in the 2024 crash of an Azerbaijani passenger plane, describing it as a “tragedy”.\n\nThe Azerbaijan Airlines flight crash landed in Kazakhstan on December 25, killing 38 of the 67 people on board, after being diverted from a scheduled landing in the southern Russian city of Grozny.\n\nIn a meeting with Azerbaijani President Ilham Aliyev, Putin said Russia had deployed two missiles to destroy Ukrainian drones on the morning of the incident, and that they exploded “a few meters away” from the aircraft.\n\n“The two missiles that were fired did not directly hit the aircraft. If that had happened, it would have crashed on the spot,” Putin said.\n\nRussian air traffic controllers advised the pilot attempt a landing in the Russian city of Makhachkala, but he instead attempted to land at his home airport and then in Kazakhstan, where the plane came down, Putin said.\n\n“Russia will do everything necessary in such tragic cases to provide compensation, and the actions of all officials will be legally assessed,” he said. Aliyev previously accused Russia of attempting to conceal the true cause of the crash.\n\nOn Thursday, he thanked Putin for providing “detailed information about the tragedy”, the Kremlin said in a readout.\n\nInitial statements by Russia’s air transport agency suggested that the plane, an Embraer 190, was forced to divert after a bird strike.\n\nRussia’s handling of the incident dramatically soured relations with Azerbaijan, an oil-rich post-Soviet state with historically close links to Moscow.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:14:29.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947715/putin-admits-russian-role-in-2024-crash-of-azerbaijani-jet",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T18:09:08.000Z"
}
