{
  "title": "Eliud Kipchoge hoping to complete marathon legacy with New York City Marathon run - Sport - DAWN.COM",
  "author": null,
  "content": "Eliud Kipchoge is hoping to leave a lasting legacy in sport when he crosses the finish line at next months New York City Marathon.\n\nThe 40-year-old, widely considered the greatest marathon runner of all time, is the only man to have run the 26.2-mile distance in under two hours and has claimed two Olympic gold medals along with a record 11 wins across the World Marathon Majors.\n\nRunning the five-borough New York classic was the only marathon he had yet to check off his list among the six majors, having made a triumphant debut in Chicago 11 years ago.\n\n“I’ve been training for major marathons for a very long time and I have never completed all of them. If I don’t complete, I feel like I am halfway - I am not a rounded person,” he said.\n\n“My legacy will be complete because I will have a sixth star.”\n\nKipchoge collected his last marathon major title in Berlin two years ago and most recently finished ninth in August at the Sydney Marathon, the newest race added to the prized Abbott World Marathon Majors series.\n\nWhile Father Time has taken a toll — he was unable to finish last year’s Paris Olympics marathon — he credited advances in technology, including continuous glucose monitoring, with helping him push past the boundaries of age.\n\n“From 2013 to 2020 then I was just trying to eat in a good way, try to make sure that I have energy in my body,” said Kipchoge, who has partnered with the marathon majors’ title sponsor Abbott since 2021.\n\n“That’s what made changes — I can monitor my glucose on time. It’s wonderful.”\n\nKipchoge said he would announce what is next on his agenda following the New York marathon on November 2.\n\nA long-time anti-doping advocate, his lengthy career has also overlapped with a spate of high-profile doping cases in marathon running, particularly from his native Kenya.\n\nAsked about compatriot and world record-holder Ruth Chepngetich, who was handed a provisional suspension in July after testing positive for a prohibited substance, Kipchoge said: “It’s a shame actually for people to break the rule in sport.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/09160251d592505.webp",
  "retrievedAt": "2025-10-12T13:14:29.898Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947678/eliud-kipchoge-hoping-to-complete-marathon-legacy-with-new-york-city-marathon-run",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T11:11:34.000Z"
}
