{
  "title": "Peace body member killed in clash with terrorists in Bannu - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: A tribal peace committee’s member was killed in a clash with terrorists in Ahmadzai area of Bannu district on Wednesday.\n\nResidents and police officials said that the armed tribesmen had started patrolling after terrorists asked them to vacate their area by Oct 10.\n\nThey said the clash occurred when a group of terrorists showed up and started laying a siege around the area.\n\n“An intense exchange of fire led to the martyrdom of tribesman Farman,” a resident told Dawn.\n\nBannu RPO Sajjad Khan met with tribal elders and acknowledged people’s bravery in the fight against terrorism.\n\n“Police and area people are united to eliminate terrorism completely,” he said.\n\nThe RPO also attended the funeral prayer of Farman.\n\nAlso, armed men kidnapped two activists of Marwat Bettani Tehreek from the Baran Dam area in Bannu district on Wednesday.\n\nPolice and BMT leaders confirmed the kidnapping and said abductees Farmanullah and Waliullah had gone to the Baran Dam to check water availability in the Marwat canal.\n\nA police official said both the men were kidnapped from the Baran Dam area within the limits of the cantonment police station.\n\nMBT chairman Inamullah said in a video message that terrorists had kidnapped senior workers of his organisation.\n\nHe warned that a protest would be staged if kidnapped workers were not released within 24 hours.\n\nMeanwhile, two school teachers, kidnapped from Musakhel Zindi Falak Sher area in Bannu on Tuesday, were freed.\n\nHeadmaster Rafiullah and Secondary School Teacher Nisar Ali Shah reached home safely, according to police.\n\nThey said the police’s quick action forced kidnappers to free teachers.\n\nGOVT LAND RETRIEVED: A large tract of government-owned land was recovered from illegal occupants in Bannu district on Wednesday.\n\nAn official said that deputy commissioner Muhammad Fahim had ordered action against land grabbers after receiving complaints about the occupation of government land.\n\nHe said the anti-encroachment squad led by assistant commissioner Allah Nawaz immediately reached the area and retrieved the occupied land from grabbers.\n\nThe assistant commissioner warned that the district administration would not tolerate encroachments of state-owned lands and that the land mafia would face stern legal action.\n\nMeanwhile, Karak’s district administration has decided to serve legal notices on illegal occupants of a cemetery’s land in Takht-i-Nusrati town.\n\nAssistant commissioner Hazrat Bilal along with local elders and officials of revenue department paid a visit to the burial place on the instructions of deputy commissioner Asad Sarwar.\n\nHe directed revenue officials to identify encroachments on the cemetery land and submit a comprehensive report to the administration.\n\nMeanwhile, the construction of Kunda Bypass Road will start soon with all resources being utilised to complete it within the specified time, claimed an official of the National Highway Authority on Wednesday.\n\nBriefing a high-level meeting chaired by Karak deputy commissioner Asad Sarwar in a meeting here, the NHA official said work on installation of signboards along the busy Peshawar-Karachi Highway within the limits of Karak district had already been completed.\n\nHe assured that bridges for approach roads and construction work on U-turns would be completed soon.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0910325346d8f9a.webp",
  "retrievedAt": "2025-10-12T13:14:55.557Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947515/peace-body-member-killed-in-clash-with-terrorists-in-bannu",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T02:18:14.000Z"
}
