{
  "title": "IT ministry committed for bridging digital divide between urban, rural areas: Amin Ul Haque",
  "link": "https://www.app.com.pk/national/it-ministry-committed-for-bridging-digital-divide-between-urban-rural-areas-amin-ul-haque/",
  "date_published": "2020-09-30T16:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): Federal Minister for Information Technology and Telecommunication Syed Amin Ul Haque has said that the ministry is committed for bridging digital divide between urban and rural areas of the country.\nHe was addressing a signing ceremony for award of Rs1.28 billion contracts by Universal Service Fund (USF) to cellular companies for provision of voice and high speed mobile broadband data services in areas of Balochistan and Sindh. Prime Minister Imran Khan was chief guest at ceremony.\nThe contract signed between USF and Jazz will cover the areas of Khairpur, Sukkur and Ghotki in Sindh, whereas the areas under the contract signed between USF and Ufone include Bolan, Jhal Magsi, Ziarat and Kalat in Balochistan.\nThe contracts were signed by USF Chief Executive Officer (CEO) Haaris Mahmood Chaudhary with Jazz CEO Aamir Ibrahim and Ufone CEO Rashid Khan.\nThe minister said through USF, the IT ministry was committed to bridging the digital divide by development, deployment and uptake of information communications technology (ICT) initiatives to make a real difference in people’s lives.\nHe informed that through the contracts, around 2.4 million people in 1146 mauzas of Bolan, Jhal Magsi, Ziarat, Kalat, Khairpur, Sukkur and Ghotki districts would be provided high speed mobile broadband services, covering an unserved area of 34,660 sq km.\nHe said the projects had the potential to impact important areas such as healthcare, communications, agriculture and transportation.\nSyed Amin ul Haq said the Ministry of IT and Telecommunication would continue to undertake more challenging and productive programmes in future including establishment of IT Parks, including the ones to be opened in Islamabad and Gilgit in near future.\nLaunch of triple bundle in Gilgit Baltistan is also in completion phase, he said.\nFederal Secretary for IT and Telecommunication Shoaib Ahmad Siddiqui and senior officials of USF, Jazz and Ufone were present.",
  "retrievedAt": "2025-08-11T19:51:15.963Z"
}
