{
  "title": "Pakistan’s first dialysis machine to start functioning soon",
  "link": "https://www.app.com.pk/national/pakistans-first-dialysis-machine-to-start-functioning-soon/",
  "date_published": "2020-09-30T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): The government on Wednesday assured full support for fully functioning of Pakistan’s first bloodless kidney dialysis machine in the country.\nSpecial Assistant to Prime Minister on National Health Services Dr Faisal Sultan called on Federal Minister for IT and Telecommunication Syed Amin Ul Haque in this regard.\nOn the occasion Farrukh Usman, founder Byonyks demonstrated the machine. Byonyks developed dialysis machine.\nHe briefed Dr Faisal Sultan that Byonyks’ unique technology did not require extracting blood out of the human body to perform dialysis.\nHe added patients could perform dialysis at home without any supervision with protection from life threatening infections.\nSpeaking on the occasion, the minister said that this blood dialysis machine was developed by Byonyks through funding provided by Ignite, the attached department of Ministry of IT.\nHe vowed to extend the support of his Ministry to all such innovative products that could facilitate the lower strata of society in the field of health, education, agriculture, energy, telecom, finance and other verticals.\nHe expressed the hope that Ministry of National Health Services would extend its help regarding the provision of this machine in hospitals for patients treatment.\nWhile appreciating the efforts of Byonyks team, Dr. Faisal Sultan said that these type of innovations should be encouraged. He also congratulated Ministry of IT, Ignite and Byonyks.\nEarlier, Syed Junaid Imam, CEO Ignite said that having funded the project our thrust was towards commercialization of the product and today’s presentation of the product to Dr. Faisal Sultan was the first step to highlight it to the concerned quarters of the federal government.\nByonyks is preparing for industrial manufacturing of machine that uses Peritoneal Dialysis (PD) technique. The company hoped to reduce the cost of single dialysis by one third of the hemodialysis.",
  "retrievedAt": "2025-08-11T19:51:15.961Z"
}
