{
  "title": "Hectic efforts of Speaker NA result in liberal visa policy for Afghanistan",
  "link": "https://www.app.com.pk/national/hectic-efforts-of-speaker-na-result-in-liberal-visa-policy-for-afghanistan/",
  "date_published": "2020-09-30T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): The landmark initiative of Speaker National Assembly Asad Qaiser to improve Pak-Afghan trade relations and people to people contacts had started bearing fruit.\nOn Tuesday, the cabinet approved a new and highly liberal visa policy for Afghanistan owing to Speaker’s hectic efforts.\nThe new visa policy took a people centric approach and was highly facilitative for ordinary visitors, students, businessmen and medical patients.\nIt would not only benefit Afghans but also have a positive impact for the economies of Khyber Pakhtunkhwa and Balochistan. The policy came after three months’ comprehensive process at the National Assembly, wherein the Speaker constituted an executive committee and four task forces to look into the issues restraining trade potential and people to people contacts with Afghanistan.\nThe policy was the result of over 40 meetings involving six cabinet members and 30 institutional stakeholders.\nUnder the policy framework, cross border pedestrian movement with Afghanistan was opened for four days a week. Hassle free transit of Afghanistan bound cargo was another big achievement.\nIt can be gauged from the fact that the number of containers stuck between ports and Border Crossing Points (BCPs) was substantially reduced from 5000 in July to 800 whilst time taken by an Afghanistan bound truck between the two points was also reduced from 28 days to 4 days.\nRent seeking from Afghan transit trade by nefarious elements was taken head on and all illegal staging areas were closed down.\nNew border crossing points were opened for trade including Ghulam Khan, Kharlachi and Angoor Adda and necessary infrastructure was being developed.\nA major bottleneck to trade were lengthy clearance procedures at the border, like scanning of cargo. It had been thoroughly rationalized and made facilitative.These were major milestones achieved in pursuit of Asad Qaiser’s vision to scale up bilateral trade to its potential of US$10 billion.\nIn his recent meeting with Abdullah Abdullah, the Chair of Afghanistan’s High Council for National Reconciliation, the Speaker underscored the value of CPEC and CAREC trade and infrastructure linkages for Afghanistan and Pakistan.\nIt was agreed in the meeting that all efforts would be undertaken for the mutual benefit of the people of Afghanistan and Pakistan. Issues of Pakistani prisoners in Afghan jails and visa problems for Pakistanis wishing to visit Afghanistan were also raised during the meeting.\nPrime Minister’s initiative to open border markets was also welcomed by Abdullah Abdullah.",
  "retrievedAt": "2025-08-11T19:51:17.890Z"
}
