{
  "title": "Dr Zafar confirms fifth case of coronavirus from Pakistan",
  "link": "https://www.app.com.pk/national/dr-zafar-confirms-fifth-case-of-coronavirus-from-pakistan/",
  "date_published": "2020-03-03T01:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 03 (APP):Special Assistant to the Prime Minister on National Health Services, Dr Zafar Mirza on Tuesday confirmed the report of a fresh case of Coronavirus in the country, bringing total to five.\n“We have now fifth confirmed case of Coronavirus in federal areas. Patient is stable and is being managed well, Dr Zafar Mirza said in a tweet.\nHe once again appealed the media to respect the privacy of the patient and the family and avoid sharing personal details of patients. He said that there was no need to panic as things are under control.\nHe said “In present situation, we need to focus on prevention and showing of responsibility.”\nIn case of any suspected coronavirus patient with having disease symptoms, information should be shared immediately with the health officials, doctors or direct to Health Ministry’s helpline number 1166.\nHe said that the government had made all necessary arrangements to have check on suspected coronavirus patients and its further spread.\nHe said that those citizens with having travel history of Iran and China and having Coronavirus disease symptoms should contact to the medical experts.\nDr Zafar Mirza said effective screening mechanism had been adopted at all Points of Entry (POE) to have check on coronavirus patients.\nHe said that proper screening mechanism was also developed at all airports besides availability of personal protection equipment kits for health staff and regular surveillance.\nHe expressed the hope that due to better health strategy there was no chance of outbreak of the disease in Pakistan.\nHe added during last one month, the federal government had taken several steps and adopted Standard Operating Procedure (SOP) about the disease.\nHe said that due to such steps Pakistan was the last country in the region where Coronavirus case was reported very late when cases were reported in all neighboring countries included China, Iran, Afghanistan and India.\nHe urged the media to play their positive role in providing information to the people regarding Coronavirus.\nHe said that the federal and provincial governments were on same page and implementing a unified policy to protect Pakistan from the virus.",
  "retrievedAt": "2025-08-11T18:53:27.126Z"
}
