{
  "title": "FM reaffirms Pakistan’s support to advancement of Afghan-own, led peace process",
  "link": "https://www.app.com.pk/national/fm-reaffirms-pakistans-support-to-advancement-of-afghan-own-led-peace-process/",
  "date_published": "2020-03-03T03:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP):Foreign Minister Shah Mahmood Qureshi while reaffirming Pakistan’s continuous support to the advancement of Afghan-own and Afghan-led peace process after the signing of historic peace agreement between the United States and Taliban, cautioned against elements who could throw spanner in the works.\nDuring an interview with the BBC Urdu, the foreign minister stressed upon taking further confidence building measures including prisoners swap after signing of the peace agreement to help improve the situation in Afghanistan.\nQureshi termed the peace deal as “a first step towards the right direction”.\nHe said the parties involved would prefer and give due consideration to the peace and reconciliation in the country, adding that they expected that the confidence building measures would not be unilateral.\nTo a query, he said that certain elements who had fears from the agreement could act as spoilers.\nThese elements did not want to see such development and wanted to use the Afghan soil against Pakistan, he added.\nHe said for avoiding internal conflicts and chaos in Afghanistan, the agreement was reached after learning from the past experiences.\nThe foreign minister said Pakistan always supported the Afghan peace and reconciliation process owned and led by Afghans themselves.The country belonged to Afghans and they had to move ahead to decide about their future.\nTo another question, Qureshi maintained that for securing a permanent peace, an all inclusive- Afghan dialogue process would be effective.\nThe foreign minister said that they had offered huge sacrifices for securing Pakistan. To make the Pak-Afghan border secure, it was being fenced and they expected the Afghan government to take it as positive step.\nThe foreign minister also strongly rebuffed any interference in the internal affairs of Afghanistan and said Pakistan always supported the global efforts for the betterment of Afghanistan and the region.\nAbout Indian Occupied Jammu and Kashmir issue, he said Indian government had committed a blunder on August 5 last year. Strong protests had exploded throughout India over such illegal steps.\nHe said the Indian forces had laid siege and complete lockdown in the occupied valley after enactment of the discriminatory laws in sheer violations of the basic human rights, besides putting the whole Kashmiri political leadership behind bars. Under such situation, dialogue with the neighboring country was not possible, he emphasized.",
  "retrievedAt": "2025-08-11T18:53:40.423Z"
}
