{
  "title": "Transparent ‘Ehsas Kafalat program’ making its women Socially, financially empowered: Sania Nishtar",
  "link": "https://www.app.com.pk/national/transparent-ehsas-kafalat-program-making-its-women-socially-financially-empowered-sania-nishtar/",
  "date_published": "2020-03-03T02:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation,\nDr Sania Nishtar Tuesday reiterated that creation of job opportunities for youth and women socially, financially empowerment topmost priority for the government.\nPrime Minister Imran Khan’s government Ehsaas Kafaalat Programme would financially empower million deserving women across the country in three phases, she said while talking to private news channel.\nShe expressed Ehsas Kafalat program beneficiaries would be given payment through Automated Teller Machine (ATM) under a transparent mechanism and emphasized media to spread more awareness among rural women about the use of ATMs to mitigate fraud in the disbursement of payment system.\nSocieties can only be empowered through education and awareness, she said, adding “I personally believe the development of an economy is measured by the development of its women.”\nSania Nishtar said in a bid to control fraud and corruption, bio metrically enabled ATMs have been opened for the first time, minimizing interaction with Points of Sales (PoS) agents and touts.\nAll beneficiaries under this program will be able to access the payments at special ATMs and bank branches and will also have the option to deposit funds into a savings account, she added.\n“With the present government’s effort to promote entrepreneurship skills among Youth, government has initiated number of youth related programs”, she added.\nTalking about Ehsaas Undergraduate Scholarship Program, she said program launched by PM Imran Khan is one of the biggest program under which 50,000 scholarships will be awarded to deserving students in the country per year.\nThis program will help the youth overcome obstacles in the way to progress and development, she said.\nShe explained under ‘Ehsaas Undergraduate Scholarship Program more than 200,000 students will benefit and government wishes to ensure that no student is deprived of education because of financial need.\nThe criteria of this program is that student will get admission on merit and the family income of the applicant should be below poverty threshold, she added.",
  "retrievedAt": "2025-08-11T18:53:25.653Z"
}
