{
  "title": "Pakistan committed for liberation of Palestine: Asad Qaiser",
  "link": "https://www.app.com.pk/national/pakistan-committed-for-liberation-of-palestine-asad-qaiser-2/",
  "date_published": "2020-03-03T05:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP):Speaker National Assembly Asad Qaiser on Tuesday said that the people of Pakistan were committed for liberation of Palestine and their hearts beat with their Palestinian brothers.\nHe said that both the countries were tied in eternal bonds of religion, history and culture. Pakistan strongly condemned Israeli occupation of Palestinian territories and turning them into Israeli settlements which were historically part of Palestine, he added.\nHe expressed these views while talking to Palestinian Ambassador to Pakistan Ahmed Jawad Rabi in a meeting at Parliament House , said a press release issued here.\nThey discussed the current situation in Palestine and Kashmir, issues facing by Ummah and other issues of mutual interest.\nHe said that Pakistan had not recognized Israel and would continue raising its voice against the Israeli atrocities in Palestine on all international and regional forums.\nHe said that Palestinian liberation was an indigenous movement and international community should assert its pressure on Israel to accept the just demand and vacate the occupied territory.\nThe speaker said that Pakistan believed in settlement of all disputes through negotiations and would continue to provide moral, diplomatic support to the Palestinian people.\nHe also apprised the ambassador about latest situation in Kashmir and asked for extending support at international forum.\nThe speaker said that the Pakistan believed in the Muslim unity and was playing its due role in achieving the objective.\nHe added that Prime Minister Imran Khan highlighted the issues faced by the Muslim Ummah in his address to the UN General Assembly, adding the government under the vision of the prime minister was working to make Pakistan an Islamic welfare state.\nPalestinian Ambassador Ahmad Jawad Rabi appreciated the solidarity and goodwill for Palestine, saying that Palestine considers Pakistan a brother and trusted friend and appreciated its close relations with Pakistan.\nHe said that Palestinians considered Pakistan as their home and were grateful to the Pakistani people for their unwavering support for the freedom movement.\n“Pakistan is the most important country in the Islamic world and its role is commendable for the unity of the Muslim community,” he added.\nThe ambassador said that unity and solidarity between Muslim countries was essential for resolving disputes and problems faced by the Muslim Ummah.\nHe expressed his gratitude for giving educational opportunities to more than 50,000 Palestinian students who graduated from Pakistani universities and were contributing to the development of Palestine.\nHe suggested for enhancing parliamentary interaction between the two countries.",
  "retrievedAt": "2025-08-11T18:53:36.015Z"
}
