{
  "title": "UN shipping body okays first global carbon pricing system - World - DAWN.COM",
  "author": null,
  "content": "LONDON: Member states of the Intentional Maritime Organisation (IMO) voted in favour of a global pricing system to help curb maritime emissions, the UN shipping body announced on Friday.\n\nFrom 2028, all ships will be required to use a less carbon-intensive fuel mix or face financial penalties — but the system is deemed by Pacific Island states as insufficiently ambitious.\n\nThe initial agreement comes after a week of negotiations in London to decide which mechanism to adopt to reach carbon neutrality in shipping by 2050.\n\nThose who do not meet the guidelines will have to pay annually for every tonne of greenhouse gas emissions that exceeds the targets set.\n\nThe IMO said the funds raised will be used to “reward” zero or near-zero greenhouse gas emissions technologies and to financially support developing countries to transition to lower-emissions shipping.\n\nA majority of members, 63 states, voted for the carbon pricing system, including the European Union, Brazil, China, India and Japan.\n\nSixteen states voted against the measure, including major oil producers like Saudi Arabia, Russia and the United Arab Emirates.\n\nNotably, Pacific Island states abstained from the vote, deeming it insufficient to meet decarbonisation goals.\n\nIsland nations in the Pacific and Caribbean, particularly vulnerable to the effects of climate change, supported a more ambitious universal carbon levy on maritime transport.\n\nThe United States did not participate in the vote.\n\nShipping accounts for nearly three per cent of global greenhouse gas emissions, according to the IMO.\n\n“This is a groundbreaking moment for the shipping industry, which should signal a turning of the tide on greenhouse gases from global shipping,” Mark Lutes, senior adviser at the NGO World Wildlife Fund for Nature, said in a statement.\n\n“However, key aspects of this agreement fall short of what is needed and risk blowing the transition off course,” he added.\n\nThe carbon pricing me­­asure must now be form­a­l­­ly adopted at an IMO asse­mbly in October.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/121048193bdc026.jpg",
  "retrievedAt": "2025-08-25T14:09:23.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903668/un-shipping-body-okays-first-global-carbon-pricing-system",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:43.000Z"
}
