{
  "title": "Mahmoud Khalil’s deportation case can go ahead: US court - World - DAWN.COM",
  "author": null,
  "content": "JENA: An immigration judge in Louisiana ruled on Friday that President Donald Trump’s administration can proceed with its deportation case against Columbia University graduate student and Palestinian activist Mahmoud Khalil, who was arrested in New York City last month.\n\nThe ruling was made by judge Jamee Comans of the LaSalle immigration court, located inside a jail complex for immigrants surrounded by double-fenced razor wire run by private government contractors in rural Louisiana.\n\nKhalil, a prominent figure in the pro-Palestinian student protest movement that has roiled Columbia’s New York City campus, was born in a Palestinian refugee camp in Syria, holds Algerian citizenship and became a US lawful permanent resident last year. Khalil’s wife, Noor Abdalla, is a US citizen.\n\nSecretary of State Marco Rubio determined last month that Khalil should be removed because his presence in the United States has “potentially serious adverse foreign policy consequences”, citing a 1952 law called the Immigration and Nationality Act.\n\nKhalil and his lawyers have said the Trump administration was targeting him for speech that is protected under the US constitution’s First Amendment, including the right to criticise American foreign policy.\n\nHis case is a high-profile test of efforts by the Republican president to deport foreign pro-Palestinian students who are in the United States legally and, like Mahmoud Khalil, have not been charged with any crime.\n\nThe administration has said Khalil and other international students who take part in such protests are harming US foreign policy interests.\n\nKhalil, 30, has called himself a political prisoner. He was arrested on March 8 at his Columbia University apartment building and transferred to a Louisiana jail. His lawyers have said they are being rushed to review the evidence that the administration submitted on Wednesday on the orders of the judge.\n\nIn a two-page letter submitted to the court and Khalil’s lawyers, which they shared with reporters, Rubio wrote that Khalil should be removed for his role in “anti-Semitic protests and disruptive activities, which fosters a hostile environment for Jewish students in the United States”. Rubio’s letter did not accuse Khalil of breaking any law.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/12093003ab5970f.jpg",
  "retrievedAt": "2025-08-25T14:09:40.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903695/mahmoud-khalils-deportation-case-can-go-ahead-us-court",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:02.000Z"
}
