{
  "title": "UN warns US aid cuts threaten millions of Afghans with famine - World - DAWN.COM",
  "author": null,
  "content": "Fresh US cuts to food assistance risk worsening already widespread hunger in Afghanistan, according to the World Food Programme, which warned it can support just half the people in need — and only with half rations.\n\nIn an interview with AFP, WFP’s acting country director Mutinta Chimuka urged donors to step up to support Afghanistan, which faces the world’s second-largest humanitarian crisis.\n\nA third of the population of around 45 million people needs food assistance, with 3.1 million people on the brink of famine, the UN says.\n\n“With what resources we have now barely eight million people will get assistance across the year and that’s only if we get everything else that we are expecting from other donors,” Chimuka said.\n\nThe agency already has been “giving a half ration to stretch the resources that we have”, she added.\n\nIn the coming months, the WFP usually would be assisting two million people “to prevent famine, so that’s already a huge number that we’re really worried about”, Chimuka said.\n\nAlready grappling with a 40 per cent drop in funding for this year globally, and seeing a decline in funding for Afghanistan in recent years, the WFP has had to split the standard ration — designed to meet the daily minimum recommended 2,100 kilocalories per person.\n\n“It’s a basic package, but it’s really life-saving,” said Chimuka. “And we should, as a global community, be able to provide that.”\n\nThe WFP, like other aid agencies, has been caught in the crosshairs of funding cuts by US President Donald Trump, who signed an executive order freezing all foreign aid for three months shortly after his inauguration in January.\n\nEmergency food aid was meant to be exempt, but this week WFP said the US had announced it was cutting emergency food aid for 14 countries, including Afghanistan, amounting to “a death sentence for millions of people” if implemented.\n\nWashington quickly backtracked on the cuts for six countries, but Afghanistan — run by Taliban authorities who fought US-led troops for decades — was not one of them.\n\nIf additional funding doesn’t come through, “Then there’s the possibility that we may have to go to communities and tell them we’re not able to support them. And how do they survive?”\n\nShe highlighted the high levels of unemployment and poverty in the country, one of the world’s poorest where thousands of Afghans are currently being repatriated from Pakistan, many without most of their belongings or homes to go to.\n\nThe UN Assistance Mission in Afghanistan, UNAMA, this week urged international donors to keep supporting Afghanistan, saying 22.9 million needed assistance this year.\n\n“If we want to help the Afghan people escape the vicious cycle of poverty and suffering, we must continue to have the means to address urgent needs while simultaneously laying the groundwork for long-term resilience and stability,” said Indrika Ratwatte, the UN’s resident and humanitarian coordinator in Afghanistan, in a statement.\n\nThe statement warned that lack of international aid in Afghanistan could lead to increased migration and strain on the broader region.\n\nThe call for funding comes as other countries including Germany and Britain have also made large cuts to overseas aid.\n\nBut the Trump administration cut has been the deepest. The US was traditionally the world’s largest donor, with the biggest portion in Afghanistan — $280ml — going to the WFP last fiscal year, according to US State Department figures.\n\nBut other UN agencies, as well as local and international NGOs are being squeezed or having to shut down completely, straining the network of organisations providing aid in Afghanistan.\n\nThe Trump administration also ended two programmes — one in Afghanistan — with the UN Population Fund, an agency dedicated to promoting sexual and reproductive health, the agency said on Monday.\n\nAnd other organisations working on agriculture — on which some 80 percent of Afghans depend to survive — and malnutrition are impacted.\n\n“We all need to work together,” said Chimuka. “And if all of us are cut at the knees… it doesn’t work. “",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:09:08.589Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903748/un-warns-us-aid-cuts-threaten-millions-of-afghans-with-famine",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T09:30:17.000Z"
}
