{
  "title": "Stocks tumble 1,336 points after China raises tariffs - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: After a spectacular overnight rally triggered by Donald Trump’s decision to pause the enforcement of reciprocal tariffs for 90 days, excluding China, the Pakistan Stock Exchange (PSX) faced renewed selling pressure on Friday as Beijing retaliated against the US.\n\nChina said it would raise its tariffs on US goods to 125 per cent in a further escalation of a trade war that threatens to bring exports to a halt between the world’s two biggest economies.\n\nBeijing’s retaliation sparked fresh market volatility, with global stocks seesawing, gold prices surging and US government bonds under pressure.\n\nAli Najib, Head of Sales at Insight Securities, said the benchmark KSE 100 index settled at 114,853.33, marking a fall of 1,335.88 points or 1.15pc day-on-day. However, the pharma sector had a wonderful day as scrips rallied in the range of 1-10pc during the session.\n\nThe rationale behind this surprise upside against the market trend was falling crude oil prices, which fell to $60 per barrel. This decline would reduce the cost of Active Pharma Ingredients (APIs), especially those containing Benzene. This benefits pharma companies by improving margins and profitability.\n\nPrices of APIs like Paracetamol, Amoxicillin and Cefixime have already dropped 10–20pc, with further declines expected in coming months, barring supply-demand disruptions. Consequently, GlaxoSmithKline Pakistan Ltd, Haleon Pakistan Ltd, Abbott Laboratories (Pakistan) Ltd and Highnoon Laboratories Ltd added 121 points to the index.\n\nIn addition, Pak Elektron Ltd (PAEL) also contributed positively by adding 33 points to the index as market vibes suggest that it may likely get an increase in its transformer’s export to the US considering recent massive tariffs of over 100pc to Chinese exports.\n\nAhsan Mehanti of Arif Habib Corporation said the index closed sharply lower in the earning season on bearish global equities and weak global crude oil prices.\n\nHe added that the rupee instability and 9pc year-on-year decline in March cement sales catalysed the bearish close at PSX.\n\nTopline Securities Ltd said volatility persisted on the PSX amid the intensifying US-China trade war. The top negative contribution came from United Bank Ltd, Fauji Fertiliser Company, Engro Fertiliser, Engro Holdings and Mari Energies, as they cumulatively lost value to weigh down on the index by 837 points.\n\nMarket activity remained on the lower side as the trading volume fell 28.13pc to 458.58 million shares while the traded value decreased 14.34pc to Rs31.62bn day-on-day.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f9b6e79a97a.gif",
  "retrievedAt": "2025-10-12T02:30:02.588Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903693/stocks-tumble-1336-points-after-china-raises-tariffs",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:30.000Z"
}
