{
  "title": "Water recycling plant a must for houses bigger than one kanal: LHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court on Friday ordered that no approval should be granted for the construction of houses bigger than one kanal without the installation of a water recycling plant on the site.\n\nDuring a weekly hearing of the petitions related to environmental issues, Justice Shahid Karim observed, “Water is essential for life and effective measures must be taken to protect it.”\n\nThe judge stressed the need for regulations to ensure the operation of water recycling plants.\n\nA member of a court-formed water commission stated that 400 liters of water are wasted just in washing a single car. He suggested that to prevent water wastage, prayer leaders should be engaged in awareness campaigns.\n\nThe judge observed that Islam provides clear guidance on conserving water, noting that anyone witnessing water wastage should speak up and stop it.\n\nThe judge expressed concern over the excessive and unjustified use of water at service stations, calling it a punishable offense. He directed that penalties for water wastage must be enforced strictly.\n\nJustice Karim also praised the LDA Sports Complexes for their role in promoting sports and noted that Pakistan had achieved the top position in squash after 23 years.\n\nHe directed the LDA to write to all educational institutions under its ambit to provide athletics facilities to students.\n\nHe called for organising competitions modeled after talent-hunt events to discover young athletes. The judge adjourned the hearing for next week.\n\nACE DG: Anti-Corruption Establishment (ACE) Director General Sohail Zafar Chattha on Friday appeared before the Lahore High Court in a case regarding sealing of Rs110 million worth of sugar stock at a sugar mill.\n\nJustice Ali Zia Bajwa was hearing a petition filed by Rahim Yar Khan Sugar Mill’s representative Farrukh Naseem Akhtar Naik.\n\nAt the previous hearing, the judge had taken exception to the non-appearance of the ACE DG despite an order.\n\nOn Friday, ACE DG Chattha appeared before the court and submitted a report on the matter. However, the judge expressed his dissatisfaction over the report, declaring it incomplete.\n\nAdvocate Amir Saeed Rawn, the counsel for the mills, argued that RYK Sugar Mills was an independent entity, yet its sugar stock worth Rs110 million was sealed due to corruption allegations against former principal secretary to CM Muhammad Khan Bhatti.\n\nThe judge asked, “DG Sahib, what is the matter? Sugar worth Rs110 million was sealed for an alleged amount of Rs5 million?”\n\nMr Chattha informed the court that another case of corrupt practice had also been registered against Muhammad Khan Bhatti. An additional prosecutor general told the court that the accused, Bhatti, had confessed to investing illicit funds in RYK Sugar Mills.\n\nThe judge directed the ACE DG to submit a detailed report on the matter.\n\nFurther hearing on the petition was adjourned till April 22.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/12110250ad391c3.jpg",
  "retrievedAt": "2025-08-25T14:09:14.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903638/water-recycling-plant-a-must-for-houses-bigger-than-one-kanal-lhc",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:56.000Z"
}
