{
  "title": "Karachi’s road mishaps an administrative failure, not an ethnic issue: ANP’s Shahi Sayed - Pakistan - DAWN.COM",
  "author": null,
  "content": "With recent traffic accidents in Karachi causing enraged mobs to torch heavy vehicles that were responsible for them, Awami National Party (ANP) Sindh Chapter President Shahi Sayed on Saturday, along with MQM, tried to pacify the situation by saying that the ongoing issues plaguing the city including road mishaps are an administrative failure, not the product of an ethnic issue.\n\nThe city has lately witnessed a rise in traffic accidents — especially involving dumpers and water tankers — which killed nearly 500 people and injured 4,879 were in 2024, according to hospital data.\n\nA total of nine dumpers and water tankers were set on fire by angry mobs in Karachi on Wednesday night near the main road leading to 4-K Chowrangi after a heavy vehicle hit a bike rider, injuring him in the North Karachi area.\n\nSindh Chief Minister Syed Murad Ali Shah on Tuesday ordered the police and transport authorities in Karachi to conduct random drug tests on drivers of heavy vehicles to ensure safe and responsible driving.\n\nRights activists and members of civil society have said that the increasing number of fatal road accidents in the city and the poor state of traffic law enforcement are violations of human rights, which the state has failed to safeguard.\n\nAddressing a press conference in Karachi alongside MQM-P Chairman Khalid Maqbool Siddiqui, the ANP chapter leader stressed that people are concerned about how they can make ends meet due to increasing inflation.\n\n“Engineers with degrees are unable to get jobs and they have to feed their families and pay bills,” he lamented. “Every man in Karachi is anxious. We treat the Urdu speakers as brothers and they respond in kind.”\n\nSayed added that nobody looks at titles like MPA or MNA and instead engages with others with “love and brotherhood”.\n\n“I want to tell the country not to look at Karachi as a city, I urge them to look at it as Pakistan,” he said. “Punjab and Balochistan are all here. Karachi has such strength that if we come together and operate without corruption, we can grow 10 times stronger.\n\n“There is no shortage of anything other than political strength and will,” he said, adding that he aimed to speak to the PPP about “discrimination and tanker mafias” troubling the city.\n\nSayed appealed to the citizens of Karachi that if they wanted to make Pakistan strong, they needed to start with the metropolis.\n\n“We have issues with traffic accidents. Instead of drawing guns, we need to simply condemn the accidents and take legal action,” he emphasised.\n\n“We appeal to the people to not act on emotion and remember that this is an administrative issue. We must make demands from the government through proper channels,” Sayed added. “These are not ethnic issues but administrative failures.”\n\nMQM’s Siddiqui said that although his party represents the largest ethnic group in Karachi, its aim is to represent all ethnicities living in the metropolis.\n\n“The MQM is the representative of the biggest ethnic group in this city, though we aim to represent all ethnic groups in the future,” he said. “It is our biggest responsibility to ensure that conditions in the city do not go back to the way they were.”\n\nThe MQM chairman also noted Sayed’s role in Karachi and that he has “been a part of the MQM’s programmes and he understands the suffering of Karachi’s citizens”.\n\n“For the last 25 years, the quota system in Sindh has played the biggest role in ruining the city,” Siddiqui lamented. “There have been no jobs or places at educational institutions allocated in Sindh’s urban areas due to quotas.\n\n“Today’s meeting emphasised that we cannot allow plans that harm the people of Karachi to go forward,” he stated. “We call on all ethnic groups to stand united and through political efforts, secure their rights. This is essential for national unity and security.”\n\nA four-year-old was killed today in yet another accident involving a heavy vehicle in Karachi, police said.\n\nSpeaking to Dawn.com today, Baldia police Station House Officer (SHO) Imran Saad said that a four-year-old boy was playing on a road in Abidabad when a water tanker ran over and killed him.\n\nSHO Saad said that the driver managed to escape from the spot, whereas the water tanker was impounded.\n\nHe added that the accident outraged the locals, who tried to damage the tanker, however, the police prevented them from doing so.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/12181534f4b00fe.png",
  "retrievedAt": "2025-08-25T14:09:07.076Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903754/karachis-road-mishaps-an-administrative-failure-not-an-ethnic-issue-anps-shahi-sayed",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T11:05:55.000Z"
}
