{
  "title": "LHC redefines NAB hearing procedure after 26 years - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: In a landmark ruling, the Rawalpindi bench of the Lahore High Court has redefined the National Accountability Ordinance (NAO) after 26 years, mandating that constitutional petitions against the National Accountability Bureau (NAB) be heard by a single judge, overturning the longstanding practice of referring such cases directly to a division bench.\n\nThe judgement, delivered by a two-judge bench comprising Justice Jawad Hassan and Justice Tariq Mahmood Bajwa, emphasised adherence to procedural laws and the protection of citizens’ rights to a fair trial and due process. The ruling was issued during proceedings on a petition filed by Aamir Nawaz Minhas and others against NAB and other respondents.\n\nThe petitioners had sought a court directive for NAB to expedite inquiries into their complaints, alleging that inordinate delays and lack of transparency violated their constitutional rights under Articles 4, 10A and 19A of the Constitution.\n\nRules petitions against bureau be heard by a single judge instead of a division bench\n\nThe bench asked the additional registrar (judicial) why NAB matters were routinely placed before division benches, despite no provision in the NAO 1999 or the High Court Rules allowing it.\n\nThe registrar cited a “longstanding practice”, but the court rejected this justification, asserting that such practices cannot override statutory procedures.\n\nReferencing to Rule 1 of Chapter 3 of the LHC Rules, the judgement clarified that constitutional petitions under Article 199(1) of the Constitution must be heard by a single judge unless explicitly mandated by law.\n\nThe bench highlighted Section 32 of the NAO, which limits division benches to appeals against final judgements, not initial petitions.\n\nThe ruling stated: “No provision (express or implied) is available under the Ordinance which deals with direct placement of matters before the division bench of high court except the appeals arising out of final judgement or order of the court under Section 32 of the [Natio­nal Accountability Ordinance].”\n\nThe court underscored that bypassing single judges deprives litigants of their right to appeal and violates Article 10A (right to fair trial).\n\nIt cited multiple precedents, including Azgard Nine Limited vs. Registrar of Companies (2022) and Ms Shagufta Shaheen vs. NAB (2019), where single judges adjudicated NAB-related petitions.\n\nThe court noted that “rule outlines the procedure for presenting a particular type of writ petition, unless a law permits, before a single judge for its decision unless the chief justice orders something different.\n\n“It is inalienable right of every person to be treated as per law and rule of justice which has two major components: first is access to justice and second is dispensation of justice and, if the cases before the division bench are directly fixed or filed, it will deny the access to justice to a party’s right to file appeal against the order of a single judge of the high court before the division bench leaving aside a party remediless.\n\n“Article 4 of the Constitution itself deals with enjoyment of protection of law and to be treated as per law and Article 10A of the Constitution deals with right of fair trial and due process.”\n\nThe bench subsequently ordered the additional registrar to relist the current petition before a single judge and ensure that future cases are categorised correctly.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:09:36.928Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903684/lhc-redefines-nab-hearing-procedure-after-26-years",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:21.000Z"
}
