{
  "title": "Head of US base fired for disputing Greenland agenda - World - DAWN.COM",
  "author": null,
  "content": "COPENHAGEN: The head of the US military base in Greenland, a Danish territory coveted by US President Donald Trump, has been fired for criticising Washington’s agenda for the Arctic island.\n\nColonel Susannah Meyers, who had served as commander of the Pituffik space base since July, was removed after reports she distanced herself and the base from US Vice President J. D. Vance’s criticism of Denmark and its oversight of the territory during his visit two weeks ago.\n\n“Commanders are expected to adhere to the highest standards of conduct, especially as it relates to remaining non-partisan in the performance of their duties,” the US Space Force said in a statement late on Thursday.\n\nThe statement did not expand further, but website Military.com said Meyers sent a March 31 email to all personnel at Pituffik “seemingly aimed at generating unity among the airmen and guardians, as well as the Canadians, Danes and Greenlanders who work there, following Vance’s appearance”.\n\nDuring his March 28 visit to the base, Vance told a press conference: “Our message to Denmark is very simple: You have not done a good job by the people of Greenland.\n\n“You have under-invested in the people of Greenland and you have under-invested in the security architecture of this incredible, beautiful landmass.”\n\n`We decide our own future’\n\nBoth Nuuk and Copenhagen viewed the visit as a provocation.\n\nDanish Foreign Minister Lars Lokke Rasmussen said on social media: “We are open to criticism, but let me be completely honest, we do not appreciate the tone in which it’s being delivered.” And Greenland’s new prime minister, Jens-Frederik Nielsen, said in a Facebook post that “the United States will not get Greenland. We don’t belong to anyone else. We decide our own future”.\n\nIn her email, relayed to Military.com, Meyers wrote: “I do not presume to understand current politics, but what I do know is the concerns of the US administration discussed by Vice President Vance on Friday are not reflective of Pituffik space base.”\n\nOn X, Pentagon spokesman Sean Parnell said “actions to undermine the chain of command or to subvert President Trump’s agenda will not be tolerated at the Department of Defence”.\n\nMeyers has been replaced by Colonel Shawn Lee, the Space Force said.\n\nTrump has insisted that Washington needs control of Greenland for national and international security and has refused to rule out the use of force to secure it, causing tensions to soar between the United States and Denmark.\n\nDenmark’s Prime Minister Mette Frederiksen travelled to Greenland last week, telling the United States that “you cannot annex another country”.\n\n“It is clear that with the pressure put on Greenland by the Americans, in terms of sovereignty, borders and the future, we need to stay united,” she said during the trip. Polls show a vast majority of Greenland’s 57,000 people want to become independent from Denmark, but do not wish to become part of the United States.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/121024557c5b223.jpg",
  "retrievedAt": "2025-08-25T14:09:23.267Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903667/head-of-us-base-fired-for-disputing-greenland-agenda",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:43.000Z"
}
