{
  "title": "Mob sets another water tanker on fire in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A water tanker was torched by an angry mob in North Nazimabad late on Thursday night, police and rescue services officials said on Friday.\n\nShahrah-i-Noor Jehan SHO Abid Husain Shah told Dawn that the tanker driver had struck a motorcyclist near Paposh Nagar. The bike rider was injured but the tanker driver fled the scene along with the heavy vehicle.\n\nHowever, a group of 10-12 people chased and intercepted him near Five Star Chowrangi. They initially attacked the driver and damaged the vehicle’s windows. Thereafter, they set the heavy vehicle on fire.\n\nRescue-1122 spokesperson Hassaan Khan told Dawn that as soon as they received the information, they rushed to the spot and controlled the fire. However, the front portion of the tanker was badly damaged in the blaze, he added.\n\nPolice said they were waiting for the complainant to lodge an FIR to initiate legal proceedings.\n\nOn late Wednesday night, around 10 dumpers and water tankers were also torched after one of the heavy vehicles hit and injured a bike-rider but rumour had spread that a woman had been killed.\n\nThe police conducted raids and arrested 19 suspects who were booked under terror charges. The police have termed the incidents as “pre-planned arson acts.”\n\nOne held as mob tries to attack fast-food outlet\n\nA man was apprehended as a mob attempted to attack the outlet of an international fast-food chain in Gulshan-i-Iqbal on Friday.\n\nGulshan SP Ahmed Iqbal Memon told Dawn that some religious activists tried to attack the restaurant near Disco Bakery, but the police foiled their attempt and arrested one suspect.\n\nArea SHO Mohammed Naeem Rajput said the suspects were aged between 16-17 years.\n\nHe added that no case had been registered so far.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:09:15.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903662/mob-sets-another-water-tanker-on-fire-in-karachi",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:50.000Z"
}
