{
  "title": "Protesters in AJK seek practical support for Palestinians - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Thousands of people across Azad Jammu and Kashmir (AJK), including Muzaffarabad, staged demonstrations after Friday prayers to denounce Israeli aggression on Gaza and urge Muslim leaders to abandon expediency and extend practical support to the oppressed Palestinians.\n\nThe largest protest in Muzaffarabad, titled “Labbaik Ya Aqsa March,” drew people from all walks of life. Chanting slogans in solidarity with the Palestinians and against Israeli terrorism, demonstrators marched along Bank Road, Shah Sultan, and Old Secretariat Road before converging at Burhan Wani Chowk, where a large public meeting was held.\n\nSpeakers at the event urged the international community to take immediate and decisive action against the ongoing genocide in Gaza and hold Israel accountable for its crimes. They described Israeli brutality against unarmed civilians as a flagrant violation of human rights and questioned the silence of global powers who claimed to champion peace.\n\nThey stressed that the Labbaik Ya Aqsa March was not only a message of solidarity from the people of Kashmir to their Palestinian brethren but also a call to the government of Pakistan and the international community to take effective diplomatic steps for an urgent ceasefire.\n\nEmphasizing that the Palestinian issue was no longer merely territorial but a humanitarian, moral, and Islamic cause, they pointed to the suffering of civilians in Gaza.\n\nInnocent children, women, and unarmed civilians continue to be killed, while hospitals, schools, mosques, and refugee camps are bombed in open violation of international law.\n\nThe speakers warned that Israel’s actions raised serious concerns for international human rights institutions and should stir the conscience of all humanity. In contrast, the inaction of the global community — particularly the helplessness of the United Nations — cast doubt on its relevance and role in preserving global peace, they said.\n\nThey stressed that if the UN was sincere in its mission, it must immediately pressure Israel to stop its aggression, lift the siege of Gaza, and restore Palestinians’ basic human rights.\n\nThe speakers also condemned the United States for its blind support of Israel, particularly criticizing President Donald Trump’s decisions — including the recognition of Jerusalem as Israel’s capital — which they said undermined prospects for peace in the Middle East.\n\nExpressing disappointment over the continued silence of the Muslim world, they appealed to Muslim nations to rise above sectarian, political, and regional differences, forge unity and stand with the people of Palestine.\n\nThey also urged scholars to remind Muslim rulers that jihad had become obligatory in such circumstances.\n\nIf rulers lacked the courage to act, they should at least offer unequivocal moral support and raise a powerful voice against oppression — and if they could not even do that, they should relinquish power, they demanded.\n\nAt the conclusion of the protest, Israeli flags and an effigy of Prime Minister Benjamin Netanyahu was torched by the demonstrators.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f978aab5c03.jpg",
  "retrievedAt": "2025-10-12T02:30:20.481Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903613/protesters-in-ajk-seek-practical-support-for-palestinians",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:24:03.000Z"
}
