{
  "title": "Peshawar High Court stops LEAs from arresting Jhagra - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court on Friday stopped Federal Investigation Agency (FIA) and other law enforcement agencies from arresting former provincial minister and leader of Pakistan Tehreek-i-Insaf Taimur Saleem Khan Jhagra in any of the cases against him till further order.\n\nA bench consisting of Justice Syed Arshad Ali and Justice Dr Khurshid Iqbal issued notices to respondents including federal interior ministry, FIA, KP home department, etc asking them to provide details of cases, if any, against Mr Jhagra.\n\nThe bench issued the order after preliminary hearing of a petition filed by Mr Jhagra, seeking directives of the court for the respondents to provide complete and comprehensive information as to whether any inquiry, investigation or criminal proceedings were pending against him before the FIA and Khyber Pakhtunkhwa Anti-Corruption Establishment (ACE).\n\nHe also sought directives of the court for the respondents to refrain from taking any coercive or adverse action against the petitioner without informing him of the nature and status of any proceedings and affording him reasonable notice and opportunity to appear and respond.\n\nMr Jhagra, who is presently abroad and is scheduled to return on April 13, apprehended his arrest on return to Pakistan by the FIA in connection with an investigation by a JIT (joint investigation team) constituted by the federal government under the Prevention of Electronic Crimes Act (PECA) for probing ‘chaos and disorder in Pakistan through malicious social media campaign’.\n\nIn a notice issued to him last month by the JIT he had been asked to appear in person on March 21, 2025, and explain his position in this regard.\n\nThe notice stated that there was sufficient material available with the JIT upon which it was assumed that he (Mr Jhagra) was involved or closely acquainted with the facts and circumstances of the matter before the JIT.\n\nAdvocate Ali Gohar Durrani appeared for the petitioner and stated that the petitioner had informed the Islamabad inspector general of police (IGP) through electronic mail that he was out of the country and intended to appear before the JIT on his return.\n\nHe stated that Mr Jhagra had also offered that in the interest of facilitating the inquiry he was also available to join the proceedings through a video link.\n\nWhen the bench inquired where the petitioner was now and why he had not appeared in the case, the counsel stated that he was abroad and apprehended his arrest on his return to the country on April 13.\n\nMr Durrani pointed out that the petitioner had previously been subjected to frivolous criminal process, for which he had approached the high court for information on criminal investigations/inquiries/FIRs against him.\n\nHe added that the said petition was disposed of after the required information was provided.\n\nHe stated that although the petitioner had assured the Islamabad IGP about his appearance once he returned to the country, but he had come to know that the FIA intended to arrest him.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:29:45.999Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903599/peshawar-high-court-stops-leas-from-arresting-jhagra",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:24:10.000Z"
}
