{
  "title": "Three villagers booked for hunting rare Himalayan grey goral in AJK - Pakistan - DAWN.COM",
  "author": null,
  "content": "Police in the Bhimber district of Azad Jammu and Kashmir (AJK) on Saturday booked three villagers for capturing and slaughtering a Himalayan grey goral — a rare and protected species — in a serious violation of the Wildlife Act 2014.\n\nThe illegal hunting of protected species of animals is an issue for wildlife conservation efforts. Previously, in January, three people, including two government employees, were arrested for illegally hunting the rare Suleiman Markhor in the mountainous Takato Range in Balochistan.\n\nThe first information report (FIR) was lodged at the Choki (Samahni) police station on the complaint of Aamir Rafique, a game watcher, after video clips of the grisly act went viral on social media, confirmed Syeda Shaista Ali, an official at the Wildlife and Fisheries Department in Muzaffarabad.\n\n“Today [Friday] at 11pm, I came across a video on social media showing Sajid Hassan, Muhammad Nawaz, and Muhammad Mushtaq — residents of Bandala Baghcha village — capturing and slaughtering a rare species of deer,” the FIR, registered at 1:20am, quoted Rafique as saying.\n\n“I immediately rushed to the scene along with three colleagues, but the culprits had fled by the time we arrived. I am now filing this formal complaint for legal action against them.”\n\nShaista Ali said the suspects had been booked under Section 10(2) of the AJK Wildlife Act, 2014, which prohibits the hunting and killing of protected wildlife.\n\nThe Himalayan grey goral (Naemorhedus goral bedfordi), a species native to the Himalayan region and found in both Pakistan and India, is listed as “Near Threatened” on the International Union for Conservation of Nature (IUCN) Red List. Its declining population is largely attributed to habitat destruction, illegal hunting, and competition with livestock.\n\nThe two clips shared with Dawn.com show a man in a bright blue shalwar kameez and his companions performing acts of cruelty on the animal as it cries throughout the ordeal.\n\n“This is an inhuman and criminal act that breaks our hearts,” said Shaista. “Such people deserve no leniency, and we are committed to bringing them to justice.”\n\nEarlier in the week, the Punjab Wildlife Department and PSL franchise Lahore Qalandars signed a memorandum of understanding (MoU) aimed at bolstering wildlife conservation efforts in the region.\n\nThe MoU signing ceremony was graced by the presence of stakeholders, including the cricketers from the franchise, who expressed their commitment to this noble cause. Among them was Sikandar Raza, a renowned Pakistani-Zimbabwean cricketer and the captain of the Zimbabwe national team, who delivered an inspiring speech that resonated with the audience, emphasising the importance of wildlife conservation. The MoU will primarily focus on educational outreach, community engagement and awareness efforts to support wildlife projects.\n\nIn June of last year, a wildlife team had also arrested five people involved in illegal hunting and seized four slaughtered chinkara deer, two rifles and a four-by-four vehicle.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:09:09.202Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903739/three-villagers-booked-for-hunting-rare-himalayan-grey-goral-in-ajk",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T08:40:50.000Z"
}
