{
  "title": "Iran, US end high-level talks in Oman, agree to resume ‘next week’, Tehran says - World - DAWN.COM",
  "author": null,
  "content": "Iran and the United States held talks in Oman on Saturday and agreed to reconvene next week, the Iranian side said, a dialogue meant to address Tehran’s escalating nuclear programme with US President Donald Trump threatening military action if there is no deal.\n\nIranian Foreign Minister Abbas Araqchi posted on his Telegram channel that his delegation had a brief encounter with its US counterpart, headed by Trump’s Middle East envoy Steve Witkoff, after they exited the indirect talks mediated by Oman.\n\n“After the end of more than two-and-a-half hours of indirect talks, the heads of the Iranian and American delegations spoke for a few minutes in the presence of the Omani foreign minister as they left the talks,” Araqchi said.\n\nHe said the talks — a first between Iran and a Trump administration, including his first term in 2017-21 — took place in a “productive and positive atmosphere”.\n\n“Both sides have agreed to continue the talks next week,” Araqchi wrote, without elaborating on the venue and date.\n\nMeanwhile, US special presidential envoy Steve Witkoff met with Araqchi and had “very positive and constructive” discussions, the White House said later on Saturday.\n\n“Special Envoy Witkoff underscored to Dr Araqchi that he had instructions from President Trump to resolve our two nations’ differences through dialogue and diplomacy, if that is possible,” the White House said in a statement.\n\n“These issues are very complicated, and Special Envoy Witkoff’s direct communication today was a step forward in achieving a mutually beneficial outcome.”\n\nThe two sides will meet again next Saturday, it said.\n\nUnderlining the profound rift between the US and Iran, Iranian Foreign Ministry spokesman Esmail Baghaei earlier said on X that each delegation had its separate room and would exchange messages via Oman’s foreign minister.\n\n“The current focus of the talks will be de-escalating regional tensions, prisoner exchanges and limited agreements to ease sanctions [against Iran] in exchange for controlling Iran’s nuclear programme,” an Omani source told Reuters.\n\nBaghaei denied this account but did not specify what was false.\n\nOman has long been an intermediary between Western powers and Iran, having brokered the release of several foreign citizens and dual nationals held by the Islamic Republic.\n\nTehran approached the talks warily, sceptical they could yield a deal and suspicious of Trump, who has repeatedly threatened to bomb Iran if it does not halt its accelerating uranium enrichment programme — regarded by the West as a possible pathway to nuclear weapons.\n\nWhile each side has talked up the chances of some progress, they remain far apart on a dispute that has rumbled on for more than two decades.\n\nIran has long denied seeking nuclear weapons capability, but Western countries and Israel believe it is covertly trying to develop the means to build an atomic bomb.\n\nSaturday’s exchanges appeared indirect, as Iran had wanted, rather than face-to-face, as Trump had demanded.\n\n“This is a beginning. So it is normal at this stage for the two sides to present to each other their fundamental positions through the Omani intermediary,” Baghaei said.\n\nSigns of progress could help cool tensions in a region aflame since 2023 with conflicts in Gaza and Lebanon, missile fire between Iran and Israel, Houthi attacks on Red Sea shipping and the overthrow of the government in Syria.\n\nHowever, failure would aggravate fears of a wider conflagration across a region that exports much of the world’s oil. Tehran has cautioned neighbouring countries that have US bases that they would face “severe consequences” if they were involved in any US military attack on Iran.\n\n“There is a chance for initial understanding on further negotiations if the other party (the US) enters the talks with an equal stance,” Araqchi told Iranian TV.\n\nIran’s Supreme Leader Ayatollah Ali Khamenei, who has the final say on key state matters, has given Araqchi “full authority” for the talks, an Iranian official told Reuters.\n\nIran has ruled out negotiating its defence capabilities such as its ballistic missile programme.\n\nWestern nations say Iran’s enrichment of uranium, a nuclear fuel source, has gone far beyond the requirements of a civilian energy programme and has produced stocks at a level of fissile purity close to those required in warheads.\n\nTrump, who has restored a “maximum pressure” campaign on Tehran since February, ditched a 2015 nuclear pact between Iran and six world powers in 2018 during his first term and reimposed crippling sanctions on the Islamic republic.\n\nSince then, Iran’s nuclear programme has leapt forward, including enriching uranium to 60 per cent fissile purity, a technical step from the levels needed for a bomb.\n\nIsrael, Washington’s closest Middle East ally, regards Iran’s nuclear programme as an existential threat and has long threatened to attack Iran if diplomacy fails to curb its nuclear ambitions.\n\nTehran’s influence throughout the Middle East has been severely weakened over the past 18 months, with its regional allies — known as the “Axis of Resistance” — either dismantled or badly damaged since the start of the Hamas-Israel conflict in Gaza and the fall of Bashar al-Assad in Syria in December.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/122134345a53896.jpg",
  "retrievedAt": "2025-08-25T14:09:06.478Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903764/iran-us-end-high-level-talks-in-oman-agree-to-resume-next-week-tehran-says",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T12:31:46.000Z"
}
