{
  "title": "Fact-finding body formed to probe rising traffic accidents in Karachi: Sharjeel - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Senior minister says CM has established high-level committee to investigate causes of over 600 fatalities since November\n• Announces action against social media accounts involved in ‘spreading hate or misusing digital platforms’\n• Slams PML-N senator’s criticism against PPP over canals issue\n\nKARACHI: Sindh Senior Minister Sharjeel Inam Memon on Friday said that the provincial government had formed a fact-finding committee to investigate the causes of traffic accidents that had suddenly increased since November last in the metropolis.\n\nSpeaking at a press conference, he said that since November 2024, 603 people had been killed in road traffic accidents and 160 of them involving heavy vehicles.\n\nHe said that heavy traffic and motorcycles had long been operating in the city, but recent developments prompted a decisive action.\n\nHe said that Chief Minister Murad Ali Shah had constituted the fact-finding committee comprising the chief secretary, inspector general of police among others.\n\n“The committee has already initiated work on ascertaining causes of sudden increase in the road accidents and its report is expected to be submitted shortly,” he said.\n\n250 heavy vehicles impounded for traffic violations\n\nMr Memon, who also holds the portfolios of information and transport, said that the provincial government had initiated a comprehensive crackdown on traffic violations in Karachi.\n\n“Over the past three days alone, 250 heavy vehicles — trucks, trailers, and water tankers — have been seized for violating traffic laws or being physically unfit for operation,” he said.\n\nHighlighting penalties for non-compliance with traffic safety regulations, he noted that the fine for not wearing a helmet was Rs1,000, and if the bike rider was caught again without a helmet, he would be fined Rs1,500.\n\n“It’s better to invest in a Rs2,500 helmet than pay fines or risk your life,” he remarked.\n\nIn addition, he said, the provincial government had made it mandatory for all heavy, light, and public transport vehicles to be equipped with trackers and dashcams. “The speed limit for heavy vehicles in Karachi has been set at 30 kilometres per hour,” he added.\n\nParties slammed for politicising traffic accident issue\n\nThe senior minister also criticised certain political parties for attempting to politicise the issue of traffic accidents over the past few days.\n\n“They have been making hateful statements and using an inflammatory tone in an attempt to pit people against each other,” he said.\n\nHe warned that strict action would be taken against anyone trying to incite unrest.\n\nHe made it clear that those who attempted to exploit these incidents for political gain or to instigate riots would not be spared.\n\nBan on arms display\n\nThe minister said that the provincial government had taken strict notice of the unauthorised use of police blue lights on vehicles, tinted windows, and public display of weapons.\n\n“In addition to police, Rangers have also been authorised to take action,” he added.\n\nCommenting on recent attacks on outlets of an international fast-food chain, he said that some private restaurants were damaged during recent incidents.\n\n“While everyone has the right to express their emotions, no one should act in a way that harms Pakistan. Taking the law into one’s own hands is unacceptable. It is the responsibility of the state to make major decisions and enforce the law,” he said.\n\nBriefing journalists about decisions taken in the recent meeting of the Sindh Apex Committee, he said after a detailed discussion on the misuse of social media it was decided that strict action would be taken against individuals who contribute to a hateful environment online.\n\nHe said that the provincial government in collaboration with the Federal Investigation Agency’s Cyber Crime Wing and the National Response Centre for Cyber Crime would take action against social media accounts involved in “spreading hate or misusing digital platforms”.\n\nAbout repatriation of illegal immigrants to their home countries, he emphasised that special laws regarding illegal immigration exist around the world and no one was permitted to reside illegally in any country.\n\n“Since April 1, a total of 991 immigrants have been deported from Sindh, including 476 men, 179 women, and 336 children”, he said, adding that currently 220 individuals remained in a camp awaiting deportation.\n\nAdditionally, the minister said, thousands of immigrants had voluntarily returned to their home countries. “These operations will continue on a daily basis,” he added.\n\nCriticises PML-N senator’s remarks against PPP\n\nThe senior minister also took exception to the remarks of Pakistan Muslim League-Nawaz Senator Irfan Siddiqui about the PPP and said that he was either ignorant or uninformed.\n\nHe stated that Senator Siddiqui claimed in an interview that the PPP had never opposed the construction of canals, and then made a reference to the President.\n\nMr Memon recalled that the PPP had been consistently opposing the canals projects. In 2021, the party had passed a resolution against the Rathal Canal and in 2022, it passed another resolution against the Greater Thal Canal Phase II and the Jalalpur Canal.\n\nHe said that the chief minister had written multiple letters to the federal government on this matter.\n\nHe noted that PPP Chairman Bilawal Bhutto-Zardari had clearly communicated the party’s opposition to the canals project to the prime minister. “The president, during his address to the joint session of parliament, affirmed that no such project will be supported,” he added.\n\n“The PPP has maintained a clear and unequivocal stance on the issue of water — this is not a secret,” he said and condemned Senator Siddiqui’s statement, urging the PML-N leadership to educate its members on the PPP’s position and discourage them from making such misleading remarks.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:30:00.087Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903666/fact-finding-body-formed-to-probe-rising-traffic-accidents-in-karachi-sharjeel",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:50.000Z"
}
