{
  "title": "Ousted South Korean president leaves official residence - World - DAWN.COM",
  "author": null,
  "content": "SEOUL: Former South Korean president Yoon Suk Yeol returned to his private home on Friday from the official residence after his removal from office, with crowds of supporters turning out to greet his motorcade.\n\nThe constitutional court upheld Yoon’s impeachment last Friday, capping four months of unprecedented constitutional turmoil after his short-lived attempt to impose martial law in December sent shockwaves through Asia’s fourth-largest economy.\n\nSouth Korea will now hold a snap election on June 3, and questions remain over whether Yoon might still play a role given how his impeachment appears to have deepened polarisation in society and stirred up his conservative supporters.\n\nHundreds had gathered outside the gates of the official residence, where Yoon briefly stopped to hug and shake hands with supporters, some of whom were crying.\n\nThe ousted president has not been seen in public since he was released from prison on March 8 when a court cancelled his detention warrant in the criminal case against him. He did not attend the impeachment ruling by the constitutional court on April 4.\n\nBut a number of his ruling party members and supporters have been seen visiting the official residence where Yoon reportedly discussed the upcoming election.\n\nAs he left the official residence, Yoon donned a red baseball cap saying “Make Korea Great Again” given to him by a supporter, video footage showed.\n\n“Now I will go back to being one of the people… and find a new way for the country and the people,” Yoon said in a written message relayed via his lawyer.\n\nHe and his wife were driven in a motorcade from the official presidential residence to their private apartment in a 37-storey building in Seoul. The pet-loving couple will also take back more than 10 dogs and cats they own.\n\nSome 280 police officials were deployed around his private home on Friday ahead of the move, and Yoon is to be accompanied by a security detail of about 50 people.\n\nThe former president still faces trial on a criminal charge of leading an insurrection, which is punishable by death or a life sentence if he is convicted.\n\nReplacement for Yoon\n\nThe race to replace Yoon kicked off this week with nearly 20 hopefuls expected to contest for the candidacy of the conservative People Power Party, which is in a fight to retain the presidency against a populist liberal who leads in the polls.\n\nCandidates are set to face an uphill battle against the populist former leader of the Democratic Party, Lee Jae-myung, who declared his bid on Thursday.\n\nAll the conservative candidates are receiving single-digit support in polls, with former labour minister Kim Moon-soo leading the pack at nine per cent, far behind Lee at 37 per cent, according to a Gallup Korea poll released on Friday.\n\nLee, who faces potential legal obstacles to his presidential bid from various legal cases, has pledged to overcome polarisation in society and spur economic growth if elected.\n\nUnveiling his policy vision on Friday, Lee said he wanted to help the industrial powerhouse focus on cutting edge science and technology.\n\n“To survive in the ruthless global battlefield, I make an appeal to you to shift the paradigm from copying to leading,” he told a news conference.\n\nYoon has said his Dec 3 martial law was meant to expose the abuse of parliamentary majority by the Democratic Party to stall his policies and not meant to impose full military rule.\n\nThe Democratic Party and his critics say his actions amounted to an insurrection that nearly destroyed democracy.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f9b143d4267.gif",
  "retrievedAt": "2025-08-25T14:09:27.836Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903671/ousted-south-korean-president-leaves-official-residence",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:43.000Z"
}
