{
  "title": "Shangla DPO, his convoy remain unharmed in roadside blast - Pakistan - DAWN.COM",
  "author": null,
  "content": "Shangla District Police Officer (DPO) Shah Hassan and his convoy survived an improvised explosive device (IED) attack on Shekolai Road while were on their way to inspect the damages on a checkpost targeted earlier.\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in KP and Balochistan, after the proscribed Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022.\n\nThe DPO told Dawn.com that despite the roadside blast, no policeman was harmed in the attack.\n\nHowever, the blast damaged the private vehicle of a Special Branch official.\n\nThe police have cordoned off the entire area and launched a search operation.\n\nThe DPO added that the local people also reached the police station to express their solidarity with them.\n\nA statement issued by his spokesperson earlier quoted the official as saying, “A large number of terrorists attacked the Shekolai police checkpost using heavy weaponry.”\n\nHe said that there were seven to nine police personnel stationed at the checkpost, adding that they retaliated effectively and forced the terrorists to flee from the area. However, he continued that the checkpost sustained significant damage from the heavy gunfire.\n\nThe DPO further said that the exchange of fire continued for nearly four hours during the night. A police contingent from the Aloch police station was also dispatched to assist during the attack, he added.\n\nHe said the attackers eventually escaped to the nearby mountains, and a police team was sent to the surrounding area to track them down.\n\nAccording to a statement issued by the KP Police, “Shangla Police foiled a terrorist attack late last night on the police post of Choga police station.”\n\n“At midnight, the Fitna Al Khawarij attacked the police post at Shekolay with light and heavy weapons,” it added.\n\nFitna Al Khawarij is a term the state uses to refer to the banned TTP.\n\nIn the statement, the KP Inspector General of Police Zulfiqar Hameed applauded the bravery of the Shangla police personnel who thwarted the attack and announced cash prizes and appreciation certificates for them.\n\nA day earlier, security forces killed two terrorists, including a “high-value target”, during an intelligence-based operation in the Timergara area of Lower Dir. Meanwhile, nine terrorists were killed during a separate operation in the Takwara area earlier this week.\n\nOn Monday, KP Governor Faisal Karim Kundi expressed concern over the current situation in the province, naming terrorism as one of the key issues.\n\n“KP has long been affected by terrorism,” he said. “Although the security forces have made tremendous sacrifices to restore peace, the threats have not been entirely eliminated.”\n\nCounter-terrorism operations have intensified amid the recent wave of militant violence. Last month, the KP government compiled profiles of 1,987 individuals involved in terrorist activities in order to develop a comprehensive database of terrorists and their sympathisers under the recently unveiled Provincial Action Plan against terrorism.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/121412297fe49b0.jpg",
  "retrievedAt": "2025-08-25T14:09:09.923Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903737/shangla-dpo-his-convoy-remain-unharmed-in-roadside-blast",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T07:28:17.000Z"
}
