{
  "title": "SPI records its biggest decline ever - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Sensitive Price Indicator (SPI), a basket of items used to measure short-term inflation, posted its biggest-ever fall during the week ending on April 10, dropping 2.81 per cent compared to the same period a year ago.\n\nThe major decrease came on the back of a significant decline in the prices of onions, wheat flour, tomatoes, electricity and fuel.\n\nAccording to the research firm Arif Habib Ltd, this is the lowest-ever year-on-year SPI since available data.\n\nThe SPI has now declined for the sixth week in a row, meaning the prices of the 51 items in the basket dropped on average when compared to last year.\n\nCompared to the previous week, the SPI also noted a fall of 0.83pc, according to data released by the Pakistan Bureau of Statistics (PBS).\n\nThe products or services whose prices dropped the most year-on-year during the week included onions (-71.2pc), wheat flour (-34.9pc), tomatoes (-31pc), chilli powder (-20pc), garlic (-19.8pc), electricity charges (-18.9pc), packaged tea (-17pc), eggs (-15pc), petrol (-11.9pc) and diesel (-8.3pc).\n\nIn contrast, the items whose prices increased the most on an annual basis included ladies sandal (55.6pc), pulse moong (27.6pc), powdered milk (25.7pc), beef (21.3pc), pulse gram (19.8pc), sugar (18.77pc), vegetable ghee 1kg (16.2pc), cooked daal (12.8pc), printed lawn (12.5pc), and georgette (10.5pc).\n\nOn a week-on-week basis, the items whose prices saw a decline included garlic (-14.7pc), tomatoes (-12.8pc), onions (-11.4pc), chicken (-8pc), eggs (-7.4pc), bananas (-6.7pc), wheat flour (-4.7pc) and potatoes (-2.3pc).\n\nThe items whose prices increased the most over the previous week included pulse gram (1.63pc), LPG (0.64pc), beef and curd (0.59pc each), long cloth (0.54pc), gur (0.46pc), pulse moong (0.35pc), powdered salt (0.26pc), pulse masoor (0.24pc), and mutton (0.20pc).\n\nThe index, comprising 51 items collected from 50 markets in 17 cities, is computed weekly to assess the prices of essential commodities and services at shorter intervals. Data showed that the prices of 14 items increased, 11 decreased, and those of 26 items remained stable compared to the previous week.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f9b7172af1f.gif",
  "retrievedAt": "2025-10-12T02:30:19.037Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903692/spi-records-its-biggest-decline-ever",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:30.000Z"
}
