{
  "title": "HBL PSL 2025: Abrar tears through Peshawar Zalmi batting lineup as Quetta win big by 80 runs - Sport - DAWN.COM",
  "author": null,
  "content": "Abrar Ahmed tore through the Peshawar Zalmi batting lineup as Quetta Gladiators won by 80 runs after scoring 216-3 batting first in the first outing for the two sides in the Pakistan Super League 2025 at the Rawalpindi Cricket Stadium on Saturday.\n\nPeshawar’s batting innings never recovered after Mohammad Amir got Peshawar Zalmi captain Babar Azam out for a duck in the very first over of their chase.\n\nHowever, it was mystery spinner Abrar Ahmed who made sure that Peshawar never got the chance to recover as he claimed the wickets of both opener Mohammad Haris and the dangerous Tom Kohler-Cadmore in the fourth over of the innings.\n\nHe ended up with figures of 4-42 and came back to clean up the tail, making a mess of Mohammad Ali’s stumps with a wrong’un to get the penultimate wicket of the innings.\n\nAfter the match, he said he liked the discipline with which he bowled in the powerplay, adding, “The captain turned to me and told me to go for wickets.”\n\nThere was brief resistance by the Peshawar batters when Saim Ayub and Hussain Talat got together at the crease for a 63-run partnership for the third wicket. This vigil at the crease was broken by spinner Usman Tariq when he got Hussain out for 35.\n\nSaim reached the 50 mark before giving an easy return catch to Kyle Jamieson — his dismissal triggered a procession of wickets as Peshawar got bundled out for 134 in just 15.1 overs.\n\nEarlier in the match, Quetta had gotten off to a rollicking start after being put into bat on a batting-friendly Rawalpindi pitch with skipper Saud Shakeel and New Zealand’s Tim Allen scoring 60 of the powerplay.\n\nAllen went after the left-arm leg spinner Sufiyan Muqeem in the seventh over, hitting three mammoth sixes before miscuing a shot towards long-on and being dismissed.\n\nSaud, however, continued to carry the momentum of the innings, scoring 59 of 42 with four boundaries and two sixes, which included an incredible lap shot off the bowling of seamer Alzarri Joseph.\n\nSouth Africa’s Rilee Rossouw and Sri Lanka’s Kusal Mendis chipped in with a quick-fire 21 and 35 respectively to take Quetta over the 200-run mark in the penultimate over of the innings.\n\nAli Raza, Sufiyan and Joseph picked up a wicket apiece for Peshawar as Quetta made their way to 216-3 at the end of 20 overs.\n\nEarlier in the day, Peshawar captain Babar had won the toss and elected to bowl first.\n\nTeams:\n\nQuetta Gladiators: Saud Shakeel (captain), Finn Allen, Hasan Nawaz, Rilee Rossouw, Kusal Mendis, Shoaib Malik, Faheem Ashraf, Kyle Jamieson, Mohammad Amir, Abrar Ahmed and Usman Tariq.\n\nPeshawar Zalmi: Babar Azam (captain), Saim Ayub, Mohammad Haris, Tom Kohler-Cadmore, Hussain Talat,, Max Bryant, Mitchell Owen, Alzarri Joseph, Mohammad Ali, Sufiyan Muqeem and Ali Raza.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1220201614183e1.jpg",
  "retrievedAt": "2025-08-25T14:09:08.196Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903765/hbl-psl-2025-abrar-tears-through-peshawar-zalmi-batting-lineup-as-quetta-win-big-by-80-runs",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T12:37:17.000Z"
}
