{
  "title": "Trump defends tariff policy after China strikes back - World - DAWN.COM",
  "author": null,
  "content": "• Hits US with 125pc tariff hike; tells Washington to stop ‘destructive behaviour’\n• UN economist sees 3pc fall in global trade\n• Fed official says tariffs will push up inflation, unemployment\n• US senators ask SEC for insider trading probe against Trump\n\nBEIJING: China increased its tariffs on US imports to 125pc on Friday, hitting back against US President Donald Trump’s decision to hike duties on Chinese goods and raising the stakes in a trade war that threatens to upend global supply chains.\n\nAlthough it indicated this would be the last time it matched US tariff rises, Beijing has nevertheless left the door open for other types of retaliation.\n\n“If the US truly wants to have talks, it should stop its capricious and destructive behaviour,” Liu Pengyu, spokesperson for the Chinese Embassy in the US, wrote on social media.\n\nBut despite the spiralling trade war, the US president insisted that his tariff policy was “doing really well”.\n\nPress Secretary Karoline Leavitt added that “the president made it very clear, when the United States is punched he will punch back harder.”\n\nBut pressure is growing on Trump as markets continue to fret.\n\n“Recession risk is much, much higher now than it was a couple weeks ago,” noted Adam Hetts, global head of multi-asset at Janus Henderson.\n\nAs a result, the dollar slid and a sell-off intensified in US government bonds, the world’s biggest bond market. Gold, a safe haven for investors in times of crisis, scaled a record high.\n\nWith the dollar weakening, selling of US assets was perhaps most exemplified by the drop in prices of the US 10-year Treasury note, long considered among the world’s safest investments.\n\nAlso on Friday, a top UN economist said global trade could shrink by three per cent as a result of the new US tariff measures.\n\n“There will be shifting, I think, in supply chains, there will be a reassessment of global alliances. There will be geopolitical shifts and economic as well,” said Pamela Coke-Hami­lton, head of the International Trade Centre (ITC).\n\nMeanwhile, US Federal Reserve officials warned that the Trump administration’s current trade policies will accelerate inflation this year.\n\n“It’s hard to know with any precision how the economy will evolve,” New York Federal Reserve President John Williams said on Friday.\n\nThe University of Michigan said its Consumer Sentiment Index dropped to 50.8 this month from a final reading of 57.0 in March. Economists polled by Reuters had forecast the index falling to 54.5.\n\nIn a reversal of previous surveys, the latest one also showed weakening confidence among Trump’s fellow Republicans.\n\nConsumers’ 12-month inflation expectations soared to 6.7pc this month, the highest reading since 1981, from 5.0pc in March, according to the survey.\n\nHowever, Boston Fed President Susan Collins said the Federal Reserve is “absolutely” prepared to intervene to help calm nervous financial markets if the need arose.\n\nSeparately, a group of US senators have urged the Securities and Exchange Commission (SEC) to investigate whether President Donald Trump or White House insiders broke securities laws ahead of his dramatic reversal on global tariffs.\n\nThe six Democrats — led by Elizabeth Warren — noted in a letter to the SEC that Trump posted on his website Truth Social early on Wednesday: “THIS IS A GREAT TIME TO BUY!!!”\n\nA few hours later, he anno­unced a 90-day suspension of additional tariffs against dozens of countries, triggering a historic stock market rebound and the best day for the S&P 500 since the recovery from the 2008 financial crisis.\n\n“We urge the SEC to investigate whether the tariff annou­ncements… enriched administration insiders and friends at the expense of the American public,” senators said.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:29:46.736Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903703/trump-defends-tariff-policy-after-china-strikes-back",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:22:56.000Z"
}
