{
  "title": "Wildfire destroys scrub forest near Tarbela Dam - Pakistan - DAWN.COM",
  "author": null,
  "content": "HARIPUR: A sizable area of scrub forest was burnt when a fire broke out in the hilly range of Tarbela Dam, local residents and police said.\n\nThe cause of the blaze could not be ascertained. Police and people said the fire erupted from a small portion of the hilly area mostly covered under scrub and spread to several kanals due to heavy winds.\n\nThe fire destroyed small shrubs and grassy area of the hilly range overlooking Tarbela Golf Club and Garhi Maira village, police and area people told reporters.\n\n“The villagers informed the police and rescue authorities but due to the hilly area fire engines could not be moved there, forcing the residents of the surrounding villages to fight the fire applying indigenous methods,” said Fazal Karim, a local journalist, while talking to Dawn.\n\nHe said the villagers used the fire beaters made of tree branches and managed to control the fast spreading inferno beneath the high transmission power lines, putting it out after an effort of three hours.\n\nBOY INJURED: A minor boy was critically injured when a moving train struck him near Hattar Industrial Estate, police and rescue sources told reporters here on Friday.\n\nThey quoted eyewitnesses as saying that some boys from Dohriyan area were playing on the track passing through their locality, when Karachi-bound Hazara Express 12 Down arrived from Havelian side on Thursday evening, and the minor boy, identified as Mohammad Bilal, 5, got hit by the boarding step of one of the bogies leaving him critical injured.\n\n“The boy was hit in the head and fell unconscious,” said an official of Rescue 1122. The rescue workers shifted the boy to Haripur Trauma Centre, wherefrom he was referred to Ayub Medical Complex, Abbottabad, in critical condition.\n\nMeanwhile, Haripur railway station’s administration expressed ignorance about the accident, while Rescue 1122 and local police flashed the information with pictures of the injured boy on their social media accounts.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:09:13.207Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903598/wildfire-destroys-scrub-forest-near-tarbela-dam",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:24:10.000Z"
}
