{
  "title": "Gold hits new peak amid global tensions - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Domestic gold prices surged to an all-time high on Friday, driven by soaring international rates amid intensifying trade tensions between the United States and other countries, particularly China.\n\nAccording to the All Pakistan Sarafa Gems and Jewellers Association (APSGJA), the price of 10 grams of gold jumped by Rs8,673 to reach Rs290,466, while the rate for one tola surged by Rs10,000 to a historic Rs338,800.\n\nInternational gold prices also touched a record high of $3,218 per ounce, rising by $100 in a single day.\n\nAPSGJA President Muhammad Qasim Shararpuri said this was the highest single-day increase in gold prices.\n\nPosts highest single-day jump to surpass Rs338,000 per tola\n\nRecalling a previous record from July 29, 2022, he noted that the largest single-day gains at that time were Rs7,288 per 10 grams and Rs8,500 per tola, bringing prices to Rs137,603 and Rs160,500, respectively.\n\nHe said both global and domestic gold markets remain volatile and investor-driven, with price swings often triggered by geopolitical developments, including tariff announcements by US President Donald Trump and retaliatory measures by other nations.\n\nAmid the surge in prices, domestic gold markets remain largely deserted. “Consumers simply lack the purchasing power due to the rising cost of living,” he explained. “Only investors are keeping the market alive, mostly dealing in gold biscuits according to their capacity.”\n\nHe added that many customers are now bringing in old jewellery and small gold bars, requesting only a few grams of additional gold to redesign pieces — a stark contrast to previous years when consumers commonly placed orders for heavy bridal sets.\n\nMr Shararpuri said that jewellers were also faced with growing challenges amid negligible footfall in jewellery shops, and many of them were struggling to pay electricity bills and staff salaries due to the slump in sales.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:09:28.453Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903687/gold-hits-new-peak-amid-global-tensions",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:30.000Z"
}
