{
  "title": "Speaker regrets opposition’s conduct as quorum issue derails NA, again - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As political circus continued for a second consecutive day in the National Assembly on Friday, Speaker Sardar Ayaz Sadiq expressed indignation over the opposition’s conduct in the House.\n\nPTI lawmaker Iqbal Afridi pointed out a lack of quorum soon after the recitation of verses from Holy Quran — just like he did a day earlier.\n\nBefore ordering a count, Mr Sadiq lambasted the opposition over its behaviour.\n\nHe noted that a significant number of queries listed for the day’s Question Hour had been submitted by opposition members.\n\nOpposition staged walkout rather than joining discussion on canals controversy, regrets Ayaz Sadiq\n\nHowever, he said, instead of engaging in the proceedings, the opposition opted to stage a walkout and subsequently pointed out the lack of quorum, thereby disrupting the session.\n\nWhile commenting on the opposition’s walkout during a discussion on the issue of controversial canals for corporate farming in Cholistan, Speaker Sadiq said as many as 30 members had actively participated in the debate.\n\nHowever, despite the significance of the matter, all opposition parties—with the exception of the Jamiat Ulema-i-Islam (Fazl) chose to leave the House.\n\nThe NA speaker highlighted that the PPP had submitted a resolution on the canals issue on April 7, and an extensive debate on the topic took place the very same day, in which 30 MNAs expressed their concerns.\n\nHe said he wrote the next day that the issue had already been discussed in detail. Yet a similar resolution was submitted by lawmakers belonging to the PTI on April 10, he said, adding that the opposition staged a walkout when discussion on the issue came up.\n\nMr Sadiq observed that those raising concerns about the lack of debate on critical issues such as Palestine, border areas, and canals were the same members who had deliberately and consistently refused to participate in the house proceedings.\n\nHe termed this approach regrettable, and stressed that the effective and orderly functioning of the National Assembly requires the active, constructive, and responsible participation of all its members.\n\nThe NA speaker after the brief remarks ordered a head count and then had to suspend the proceedings for 30 minutes.\n\nWhen the proceedings resumed, Deputy Speaker Syed Ghulam Mustafa Shah had to adjourn the house to meet again on Monday at 4pm, due to continued low attendance.\n\nThis was the second consecutive day the house could not transact any business, including Question Hour.\n\nPublished in Dawn, April 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:09:40.748Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903686/speaker-regrets-oppositions-conduct-as-quorum-issue-derails-na-again",
  "dateList": "2025-04-12",
  "date_published": "2025-04-12T01:23:21.000Z"
}
