{
  "article_id": "2025-09-25_7e6a9d8eba6a1378fe04dee93b052cd2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-minister-calls-for-global-action-to-protect-oceans-unveils-blue-economy-plans/",
    "retrieved_at": "2025-10-11T23:30:23.878Z"
  },
  "metadata": {
    "title": "Federal Minister calls for global action to protect oceans, unveils blue economy plans",
    "author": null,
    "date_published": "2025-09-25T15:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 441,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 25 (APP):Federal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry on Thursday called for urgent international efforts to protect oceans, warning that the world's seas are under mounting pressure from climate change, pollution, and overuse. In a message marking World Maritime Day, Junaid Anwar Chaudhry said oceans stand at a \"pivotal point\" and must be safeguarded as vital to environmental sustainability, economic growth, and global security. The 2025 World Maritime Day theme, \"Our Ocean, Our Obligation, Our Opportunity,\" highlights the shipping industry's responsibility to ensure sustainable practices while recognizing the economic and climate benefits oceans provide. \"Our oceans are not limitless; every action on land echoes in the sea,\" the minister said, urging governments, industries, scientists, and citizens to share responsibility for protecting marine ecosystems. Minister Chaudhry cited plastic waste, untreated effluents, sea-level rise, and ocean acidification as key threats to marine life and coastal communities. He reaffirmed the government's commitment to international maritime and climate agreements, pointing to mangrove restoration and wetland conservation projects as part of national adaptation efforts. He also praised technological advances in maritime logistics, digital monitoring, and renewable ocean energy, describing them as essential to building a \"green blue economy.\" The minister said Pakistan's location along the Arabian Sea gave it both \"opportunities and responsibilities\" to balance development with conservation. He called for stronger regional cooperation, scientific research, and public awareness campaigns to tackle maritime challenges. Minister Chaudhry further stressed inclusive participation in the sector, urging greater involvement of youth, women, and local communities. \"Together, we can protect our oceans for future generations while harnessing their potential for development,\" he said, calling for deeper international partnerships, especially in the Indo-Pacific region. Turning to national initiatives, the minister announced that Pakistan Maritime Week would be held from November 1 to 7, 2025, bringing together stakeholders to showcase the country's maritime potential. He also unveiled ambitious projects for the sector, including making the Gaddani Ship Recycling Yards compliant with the Hong Kong Convention, setting up an Artificial Intelligence Maritime Secretariat (AIMS), and digitizing seaport operations. He said the Pakistan National Shipping Corporation's fleet is to expand to 30 vessels within a year, while maritime incubators, the country's first solar-powered fishing boat, and digital pollution monitoring systems at Karachi Port will also be introduced. \"Scientific surveys will be carried out in the Exclusive Economic Zone, and Gwadar Port and Free Zone will be developed in line with International Maritime Organization standards\", he added. Junaid Anwar Chaudhry concluded by paying tribute to seafarers, fishermen, scientists, environmentalists, port and terminal operators, and those involved in various maritime-related jobs, saying their daily efforts embody the spirit of World Maritime Day.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}