{
  "article_id": "2025-09-25_64ccaae00949a442f4820951900b8921",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-invites-azerbaijans-speaker-to-interparliamentary-speakers-conference/",
    "retrieved_at": "2025-10-11T23:29:39.911Z"
  },
  "metadata": {
    "title": "Gilani invites Azerbaijan’s speaker to Interparliamentary Speakers’ Conference",
    "author": null,
    "date_published": "2025-09-25T15:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 467,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 25 (APP): Chairman Senate and Founding Chairman of the Interparliamentary Speakers' Conference (ISC) Syed Yousaf Raza Gilani, held a cordial telephonic conversation Sahiba Gafarova, Speaker of the Milli Majlis (Parliament) of the Republic of Azerbaijan. The Chairman Senate also extended warm greetings and lauded Speaker Gafarova's dynamic leadership as Chairperson of the Non-Aligned Movement Parliamentary Network and her distinguished service as former President of the Asian Parliamentary Assembly (APA). He observed that her active role in advancing multilateral parliamentary diplomacy reflects her strong commitment to dialogue, cooperation, and shared progress. Gilani fondly recalled his visit to Baku earlier this year for the APA plenary session, during which he held constructive discussions with Speaker Gafarova. He noted that such engagements have deepened parliamentary linkages and reinforced the longstanding bonds of brotherhood between Pakistan and Azerbaijan. Extending a formal invitation, the Chairman Senate invited Speaker Gafarova to attend the Interparliamentary Speakers' Conference (ISC), being hosted by the Senate of Pakistan in Islamabad from 10-12 November 2025. He underscored that her presence would be a great honour for Pakistan and would significantly enrich the outcomes of the forum. Highlighting the objectives of the newly established ISC, Mr. Gilani emphasized that the platform seeks to bring together parliamentary leaders from across the globe for candid deliberations on peace, security, sustainable development, and cooperative solutions to global challenges. He added that Speaker Gafarova's vast experience and commitment to peace and multilateralism would greatly add value to the ISC's agenda. The Chairman Senate also expressed his anticipation of welcoming Speaker Gafarova to Islamabad in October for the Trilateral Speakers' Conference, being organized by the National Assembly of Pakistan on 12-13 October 2025. He noted that the occasion would provide an opportunity to review bilateral as well as wider multilateral cooperation. The Chairman Senate will be having separate meetings with Speakers of Azerbaijan and Turkiye parliaments. In response, Speaker Sahiba Gafarova extended a formal invitation to Chairman Senate Syed Yousaf Raza Gilani to participate in the International Parliamentary Conference scheduled in Baku on 29 October 2025, dedicated to the 30th Anniversary of the Constitution of the Republic of Azerbaijan. She expressed confidence that Pakistan's participation would meaningfully contribute to the proceedings of the historic event, while further strengthening the enduring bonds of friendship and parliamentary collaboration between the two nations. Chairman Senate warmly welcomed the invitation and reaffirmed Pakistan's commitment to advancing parliamentary cooperation with Azerbaijan. He noted that Pakistan and Azerbaijan enjoy deep-rooted ties, grounded in shared history, cultural affinity, and mutual respect. He expressed appreciation for Speaker Gafarova's gracious gesture and assured Pakistan's strong participation in the Baku conference. The International Parliamentary Conference in Baku is expected to bring together parliamentarians and dignitaries from around the world to deliberate on constitutional development, parliamentary democracy, and avenues for enhanced inter-parliamentary cooperation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}