{
  "title": "Resolution of Kashmir issue vital for peace in the region: AJK President",
  "link": "https://www.app.com.pk/national/resolution-of-kashmir-issue-vital-for-peace-in-the-region-ajk-president/",
  "date_published": "2021-09-19T16:58:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 19 (APP): President Azad Jammu and Kashmir (AJK) Barrister Sultan Mahmood has said that no nation on the basis of power could suppress any other nation for a long period of time.\nHe said this during meet the press function held at Lahore Press Club on Sunday.\nHe said that recent development in Afghanistan had left positive impact on the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK). He said, “International community has realized that resolution of Kashmir issue is vital to establish peace in the region.”\nSultan Mahmood said that on August 5, 2019, the BJP led government revoked the special status of IIOJK by abrogating Article 370 and 35A of the constitution adding that this strategic blunder by India  had drawn the world attention towards the importance of resolving Kashmir issue.\nHe paid tribute to the unprecedented struggle of late Hurriyat leader Syed Ali Geelani. He condemned the India’s attitude on the death of Syed Ali Geelani and added that every incident in IIOJK by India had fully exposed the ugly face of Modi government. International community besides taking notice of human rights violations in IIOJK should impose severe sanctions on India, he added.\nPresident Azad Jammu and Kashmir (AJK) Barrister Sultan Mahmood said that despite all challenges Pakistan had always stood with the people of IIOJK in their freedom struggle.He said on September 25, Modi was going to New York to address UN General Assembly session adding that protest would be lodged in front of UN office to exert pressure on India to solve Kashmir issue as per UN resolutions.\nSultan Mahmood said that in October, he would be visiting different countries where Kashmir issue would be highlighted adding that it was a high time to speed up efforts for resolution of Kashmir issue. He said that day was not far off when innocent and unarmed people of IIOJK would get their right to self-determination.\nHe further said that efforts were being made to ensure improvement in Azad Jammu and Kashmir.\nHe said that local bodies elections would be held in AJK so that transfer of power to grassroots level could be ensured. He said soon accountability process in AJK would be started.\nPresident Azad Jammu and Kashmir (AJK) Barrister Sultan Mahmood said that legislation would be done to give right to vote to the overseas Kashmiris in AJK. He said overseas Kashmiris could play significant role in effectively raising Kashmir cause at all international fora.",
  "retrievedAt": "2025-08-11T21:16:55.712Z"
}
