{
  "title": "Riyasat-e-Madina essence of Pakistan ideology: Ashrafi",
  "link": "https://www.app.com.pk/national/riyasat-e-madina-essence-of-pakistan-ideology-ashrafi/",
  "date_published": "2021-09-19T16:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 19 (APP): Special Aide to Prime Minister on Religious Harmony and Middle East Hafiz Tahir Mehmood Ashrafi Sunday said that Pakistan’s ideology was based on the idea of transforming the country into Riyasat-e-Madina [state of Madina].\nAddressing the ‘Istehkam-e-Pakistan Ulema and Mashaikh Conference’ here at Nazria-e-Pakistan Trust (NPT), he said that a mega conference should be organised to highlight the welfare state of Riyasat-e-Madina during the upcoming month of Rabi-ul-Awwal.\nAshrafi urged ulema to come forward for promoting unity and harmony in society as Pakistan came into being in the name of Islam/ He said that religious scholars had a great responsibility in establishing a pro-Islamic society and maintaining ideal atmosphere of interfaith harmony.\nHe said that Pakistan could face numerous challenges due to recent change in the regional situation as the enemies of the country were trying to harm the Muslim Ummah in general and Pakistan in particular through their negative tactics of fanning sectarianism.\nIn order to cope with the threats and nefarious designs of the enemies, ulema, scholars and all segments of society would have to play a proactive role in forging unity in the Muslim Ummah.\nFor the last 20 years, he said India had been conspiring against Pakistan from inside Afghanistan, but failed in its reprehensible plans. After failure in Afghanistan, India was now attempting to ignite sectarian violence to create chaos and anarchy in Pakistan.\nHe said, “We welcome Taliban authorities’ stance of not allowing use of Afghanistan soil against Pakistan or any other country. Pakistan had always been a key facilitator of peace in the reign.”\nHe called upon the world to cooperate with Afghanistan for restoring peace and ensuring economic stability in the war-torn country, as it would also strengthen the regional peace as well as enhance trade and economy in the South Asian region.\nHe said Islam never allowed forcible conversion, and majority cases of forced marriages had no link with Islamic teachings. “If any such incident takes place, we will stand with our minorities communities,” he promised.\nAbout signal national curriculum (SNC), he said that new curriculum was being implemented with prime objective of promoting national unity as well as inculcating tolerance, Islamic teachings and respect for other religions among the students to transform Pakistan into what was envisioned by Quaid-i-Azam Muhammad Ali Jinnah and Dr Allama Muhammad Iqbal.",
  "retrievedAt": "2025-08-11T21:16:55.720Z"
}
