{
  "title": "EVMs should be used to eliminate rigging chances forever: Farrukh Habib",
  "link": "https://www.app.com.pk/national/evms-should-be-used-to-eliminate-rigging-chances-forever-farrukh-habib/",
  "date_published": "2021-09-19T18:05:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Sep 19 (APP):Minister of State for Information and Broadcasting Farrukh Habib said that Election Commission of Pakistan (ECP) is duty bound to educate the voters and train the staff for holding free, fair and transparent elections and for this purpose technology could also be used to eliminate all chances of rigging on permanent basis.\nHe was talking to media persons before inaugurating construction of a link-road from Niamoana Sammundri Road to Fish Farm Sitiana Road at Mogiyanwala Chowk in Chak No.225-RB Malkhanwala here on Sunday evening.\nFarrukh Habib said that the opposition does not like the use of technology in the elections as it want to win the elections through unfair means.\nIf the Electronic Voting Machines (EVMs) were used, the ‘Thappa mafia’ could not win the elections, therefore, the EVMs were not acceptable to the opposition, he said.\nHe said that PTI was emphasizing on the use of EVMs because it wants free, fair and transparent elections. This technology was also used in more than 20 countries successfully, but the opposition was opposing it under baseless apprehensions and making propaganda against the PTI. If the opposition had any alternative suggestion, it should present and discuss it in the parliament, he added.\nHe said that Prime Minister Imran Khan had asked everyone to come and talk about electoral reforms but the opposition was not ready for it because it had won all elections with rigging and fake votes.\nMinister of State for Information and Broadcasting said that 9 million Pakistanis were working abroad and sending remittances of 30 billion dollars to Pakistan per annum. The clause 94 of Election Act gives them right to vote but the PPP and PML-N despite enjoying powers three times each failed to give them right of vote. Now the PTI had decided to give them right of vote. Therefore, elections 2023 will be held through EVMs at all costs, he added.\nHe said that Maryam Safdar had raised question about our foreign funding even though we had provided all the evidences to the Election Commission. Now it was the turn of Maryam Safdar, Shahbaz Sharif, Asif Zardari, Bilawal and Maulana Fazlur Rehman to present details of their funding.\nResponding to a question, the state minister said that loot, plunder, corruption and nepotism were on the rise during tenure of previous rulers; exports were continuously declining; current account deficit was increasing; foreign exchange reserves were left for a few days; the country was at the verge of bankruptcy.\nThat’s why when PTI took government, Ahsan Iqbal immediately said that the government should go to the IMF to support the country’s economy. However, PTI under dynamic leadership of Prime Minister Imran Khan not only dragged country out of the quagmire but also put it on road to progress and prosperity.\nNow SBP had reserves of 20 billion dollars; construction and industrial sectors were working with full capacity, vehicles, motorcycles and agricultural machinery had witnessed record sale; farmers had received additional money of Rs.1100 billion.\nNow the government was focusing on increasing production in agriculture, industrial, livestock and IT sectors so that we could make our economy stable on strong footing, he added.\nReplying to another question on Shahbaz Sharif’s statement regarding no-confidence motion against the Chief Minister of Balochistan, he said that the PML-N had not fielded even a single candidate in Baluchistan. How I can believe in statement of Shahbaz Sharif when his own niece Maryam Safdar doesn’t take it seriously.\nIt was the same Shahbaz Sharif who was supposed to drag Asif Zardari in the streets of Larkana but now he (Shahbaz Sharif) was following the footprints of Zardari so that he can get NRO somehow, he added.\nResponding to another query, the state minister said that inflation was global phenomena which occurred due to coronavirus pandemic. Earlier the price of petrol in world markets was 34 dollar per barrel which had now increased up to 75 dollars per barrel but the prices of petroleum products in Pakistan were still low and the government was saving the people from extra financial burden by reducing its taxes.\nMinister of State for Information and Broadcasting Farrukh Habib said that PTI government was doling out targeted subsidy to the poor which will help in controlling inflation soon. The government had also planned to increase productivity of various agri commodities so that we could save valuable foreign exchange which was earlier spent on import of pulses and edible oil.\nHe said that Pakistan had 220 million acres of land but we were cultivating crops on only 50 million acres due to which we have to import edible oil which was earlier available at rate of 500 dollars per tonne but now its price had jumped up to 1200 dollars per tonne in the international market.\nHe said that government will also provide health cards to all families in Punjab by end of December 2021 while loans of Rs.60 billion had been sanctioned for housing sector as well.\nThe state minister further said that a summary had been moved for approval to facilitate the journalists at maximum extent. He said that all journalist groups of Faisalabad had jointly prepared the final list of real working journalists and the plots will be allotted to them in the journalist’s colony very soon.\nThe PTI government was also including journalists in Kamyab Jawan Programme so that the journalists could also take advantage of this scheme.",
  "retrievedAt": "2025-08-11T21:16:55.716Z"
}
