{
  "title": "Pakistan Strongly condemns unprovoked Afghan firing: Mohsin Naqvi",
  "author": null,
  "content": "ISLAMABAD, Oct 12 (APP): Interior Minister Mohsin Naqvi strongly condemned the incidents of unprovoked firing by Afghan forces on Pakistani territory, calling the act a flagrant violation of international law and a direct threat to regional peace.\nIn a strongly worded statement, the Prime Minister said that firing on civilian populations by Afghan forces was “an open breach of international norms and humanitarian principles.” He emphasized that Pakistan has always exercised restraint, but will not compromise on its sovereignty and the safety of its citizens.\n“Pakistan’s brave forces have proven—through their immediate and effective response—that any provocation will never be tolerated,” said Naqvi.\nHe added that Pakistan’s armed forces remain fully alert and prepared to respond decisively to any act of aggression. “Afghanistan is being given a fitting and proportionate response. Any hostile move will be met with strength and resolve,” he said.\nThe Prime Minister also alleged that the recent escalation by Afghan forces appears to be influenced by Pakistan’s ‘eternal enemy’, hinting at foreign elements trying to destabilize the region.\n“The game of fire and blood that Afghanistan is playing has deep links with our adversaries who have always sought to undermine Pakistan’s stability,” Naqvi remarked.\nReaffirming national unity in the face of external aggression, Mohsin Naqvi said the people of Pakistan stand firmly with their armed forces, describing the nation as “a wall of steel” behind its defenders.\n“Afghanistan will receive a strong and clear response, just as India did when it tested Pakistan’s patience,” he said, warning that no country should dare look toward Pakistan with ill intent.\nSecurity analysts believe the government’s statement reflects a tougher stance by Islamabad, amid growing tensions along the Pakistan-Afghanistan border. Sources within the security establishment confirmed that Pakistan’s forces remain on high alert, with additional measures being taken to safeguard border communities.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-16T23:57:14.262Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-unprovoked-afghan-firing-mohsin-naqvi/",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T08:00:00.000Z"
}
