{
  "title": "COMSTECH launches Life-Saving Training Program for Palestinians",
  "author": null,
  "content": "ISLAMABAD, Oct 12 (APP): In a major step to strengthen emergency healthcare capacity in Palestine, COMSTECH in collaboration with Fatima Memorial Hospital and NUR International University, Pakistan launched the Basic Life Support (BLS) and Basic Trauma Management Course for Palestinian Nationals at the OIC-COMSTECH Secretariat, Islamabad.\nSpeaking at the ceremony, Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General of COMSTECH, said that education and skill development are among the most powerful tools for empowering communities in crisis.\nHe described the initiative as a gesture of solidarity and a long-term investment in Palestine’s human capital and health resilience.\nProf. Choudhary appreciated Fatima Memorial Hospital and NUR International University for their collaboration and thanked the Organization of Islamic Cooperation (OIC) and the Representative Office to the State of Palestine for their continued support.\nProf. Dr. Farooq Anwar, Pro-Vice Chancellor of NUR International University, praised COMSTECH’s leadership and reaffirmed the university’s commitment to advancing humanitarian training and technical education.\nMr. Tawfiq Khader, Counsellor at the Embassy of Palestine to Pakistan, acknowledged the unwavering support of COMSTECH and its partners for the Palestinian people.\nJoining online, Prof. Dr. Omar Melad, Vice Chancellor of Al-Azhar University, Gaza, and Mr. Ahmad Ali Hanoun, Director General of the OIC Representative Office to the State of Palestine, expressed deep gratitude to COMSTECH and its partners for initiating a program of such vital importance.\nThe program reflects COMSTECH’s commitment to promoting science, technology, and innovation for the collective progress of OIC member states, with special focus on humanitarian development in Palestine.\nThe one-month online course includes modules on Basic Life Support (BLS), Cardiopulmonary Resuscitation (CPR), Trauma and Wound Management, Spinal and Limb Immobilization, Psychological Support, and Physical Rehabilitation, equipping Palestinian medical professionals and youth with life-saving skills to respond effectively during emergencies and crises.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-16T23:56:09.013Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/comstech-launches-life-saving-training-program-for-palestinians/",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T16:16:00.000Z"
}
