{
  "title": "Ayaz strongly condemns Afghanistan’s unprovoked aggression at Pakistan border",
  "author": null,
  "content": "ISLAMABAD, Oct 12 (APP):Speaker National Assembly Sardar Ayaz Sadiq has strongly condemned Afghanistan’s unprovoked aggression along the Pakistan border, terming it a blatant violation of international law and human rights.\nIn a statement, the Speaker paid glowing tribute to the Pakistan armed forces for giving a befitting response to Afghan aggression, saying that the nation stands united behind its defenders like a solid rock.\n“Firing on civilian population by Afghan forces is a grave violation of international law and human rights,” he said, adding that such provocations pose a serious threat to regional peace and stability.\nAyaz Sadiq reaffirmed that no one would be allowed to challenge Pakistan’s sovereignty and territorial integrity. “Our armed forces are fully prepared to defend the motherland at every moment,” he added.\nHe emphasized that Pakistan has always supported a peaceful, stable and prosperous Afghanistan and has hosted over four million Afghan refugees for more than four decades.\n“Pakistan is a peace-loving country and harbors no aggressive designs against anyone,” he said. “However, our patience should not be mistaken for weakness — border violations are intolerable.”\nThe Speaker underscored that mutual respect and diplomatic cooperation are essential for regional peace and development.\nCommending the leadership of Field Marshal Syed Asim Munir, he expressed full confidence in the Pakistan armed forces’ capability to respond decisively to any act of aggression.\nHe said that Afghan soil is being used for terrorist activities against Pakistan, which is unacceptable. “With the presence of our valiant armed forces, no enemy can dare cast an evil eye on Pakistan,” the Speaker added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-16T23:56:56.249Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ayaz-strongly-condemns-afghanistans-unprovoked-aggression-at-pakistan-border/",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T14:30:00.000Z"
}
