{
  "title": "Afghan forces’ unprovoked firing violation of UN Charter, Doha Agreement: Experts",
  "author": null,
  "content": "PESHAWAR, Oct 12 (APP):The recent unprovoked cross-border firing by Afghan forces on multiple Pakistani checkposts has sparked serious concerns among foreign relations and defense experts, who have termed it a blatant violation of the United Nations (UN) Charter and the Doha Agreement.\nOn Saturday night, Afghan troops started indiscriminate firing on Pakistani security posts located in Bajaur, Kurram, Upper Dir, Chitral, Baram Cha, and Angoor Adda in South Waziristan.\nThe Pakistani security forces responded swiftly, successfully repulsing the attacks and inflicting significant losses on the attackers, according to security sources.\nExperts have strongly condemned the attacks, stating that the Afghan interim government, led by the Taliban, is failing to uphold its international commitments.\nBrigadier (Retd) Mahmood Shah, a senior defense analyst and former secretary for law and order in the erstwhile FATA region, told APP that the attacks were in direct violation of the Doha Agreement, under which the Taliban led Afghan Govt had pledged not to allow Afghan soil to be used for attacks against neighboring countries, particularly Pakistan.\n“The presence of banned terror outfits, including the Fitnaul Khawarij, TTP and their training camps in Afghanistan shows that the Taliban regime is not serious about implementing the peace commitments it made in Doha,” Brig. Mehmood Shah said.\nHe emphasized that Pakistan is increasingly left with no alternative but to take defensive and offensive measures to counter threats emanating from Afghan territory.\nIn recent press conference in Peshawar, DG ISPR Lt. Gen. Ahmed Sharif Chaudhry issued a stern warning to supporters and facilitators of Fitnaul Khawarij, demanding they surrender or face full-scale military action. He also criticized the Taliban administration for failing to prevent cross-border infiltration and militant attacks. He said that Afghan interim Govt failed to honour commitment made in Doha agreement.\nBrig. Mehmood Shah added that the Afghan interim Foreign Minister, Amir Khan Muttaqi, cannot deflect from his government’s responsibilities by issuing “irresponsible and irrational” statements, such as those he made against Kashmir during a recent visit to India.\n“The Taliban’s failure to combat terrorism and dismantle militant infrastructure within Afghanistan is eroding regional peace, and stability he said.\nExperts also expressed alarm over the recent joint communiqué issued by India and Afghanistan, calling it a strategic ploy by New Delhi to drive a wedge between Pakistan and Afghanistan.\nBrig. Mahmood Shah labeled the communiqué as against Kashmiris and a “deep-rooted conspiracy” orchestrated by India to exploit current tensions.\nHe added that such a move not only undermines regional stability but also violates multiple UN Security Council resolutions, especially those relating to the disputed territory of Jammu and Kashmir.\n“The Kashmir issue remains unresolved as per UN resolutions and must be decided through the right of self-determination of the Kashmiri people,” he stated.\nHe further criticized India’s track record in the region, accusing it of widespread human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nProfessor Dr. Ejaz Khan, an expert in international relations and former Chairman International Relations at University of Peshawar, said that Pakistan has shown considerable restraint despite being repeatedly targeted by cross-border terror attacks originating from Afghanistan.\n“Pakistan had no choice but to take necessary security measures to protect its civilians after the Afghan Taliban government failed to curb the activities of banned Fitnaul Khawarij and TTP,” Dr. Ejaz Khan said.\nHe accused India of attempting to provoke conflict between Afghanistan and Pakistan, especially after suffering a crushing defeat at the hands of Pakistan in Operation Iron Wall.\nHe said that the Pakistan Air Force had shot down seven Indian warplanes, including Rafale jets, on May 10, which India has yet to recover from diplomatically or militarily.\nProfessor Dr. A.H. Hilali, former Chairman of the Political Science Department at the University of Peshawar, pointed to the aftermath of the U.S. withdrawal from Afghanistan as a contributing factor to the region’s instability.\n“The United States left behind arms and equipment worth over $7.2 billion in Afghanistan, which have now fallen into the hands of various militant groups, fueling terrorism in the region,” he said.\nDr. Hilali also criticized Afghanistan’s ill diplomatic engagement with India, suggesting that the Afghan foreign minister should have acknowledged Pakistan’s decades-long support, especially in hosting over 4 million Afghan refugees since 1979.\n“From transit trade concessions to open hospitals and humanitarian aid, Pakistan has stood by Afghanistan in its times of need. That goodwill is now being undermined by controversial diplomatic moves,” Dr. Hilali added.\nThe experts said the cross-border violence and negative diplomatic posturing of Afghanistan besides infiltration of Fitnaul  Khwarij, have raised alarms about regional peace and stability.\nExperts are calling for urgent international attention to ensure that agreements like the Doha Peace Accord and UN Charter are not only honored but enforced.\nAs the security situation evolves, both regional diplomacy and security responses are expected to intensify, with Pakistan signaling that it will not tolerate further violations of its sovereignty or threats to its people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-16T23:57:17.513Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/afghan-forces-unprovoked-firing-violation-of-un-charter-doha-agreement-experts/",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T12:43:00.000Z"
}
