{
  "title": "Pak Army repels Afghan Taliban, Khwarij cross-border attack; kills over 200 terrorists",
  "author": null,
  "content": "Media error: Format(s) not supported or source(s) not found\nRAWALPINDI, Oct 12 (APP): Pakistan Armed Forces, late on the night of October 11/12, repelled a cross-border attack by the Afghan Taliban and Indian-sponsored Fitna al-Khwarij along the Pakistan-Afghanistan border.\n“Over 200 Taliban and affiliated terrorists have been neutralized, besides the capture of 21 hostile positions on the Afghan side of the border by the Pakistan Armed Forces,” said an Inter-Services Public Relations (ISPR) news release.\nHowever, during overnight skirmishes, 23 brave sons of Pakistan embraced Shahadat while defending territorial integrity of our beloved country against this outrageous action while 29 soldiers sustained injuries, it further said.\n“On the night of 11/12 Oct 2025, Afghan Taliban and Indian-sponsored Fitna al Khawarij launched an unprovoked attack on Pakistan, along the Pak-Afghan border. The cowardly action, which included fire and few physical raids, was aimed at destabilizing the border areas to facilitate terrorism, furthering Fitna al Khawarij’s nefarious designs,”  the news release said.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/10/WhatsApp-Video-2025-10-12-at-4.51.22-PM.mp4Media error: Format(s) not supported or source(s) not foundDownload File: https://www.app.com.pk/wp-content/uploads/2025/10/WhatsApp-Video-2025-10-12-at-4.51.22-PM.mp4?_=100:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\n“Exercising the right of self-defence, the alert Armed Forces of Pakistan repelled the assault decisively all along the border and inflicted heavy casualties on Taliban Forces and affiliated Khwarjis. Precision fires and strikes, as well as physical raids were directed against Taliban camps and posts, terrorist training facilities and support networks operating from Afghan territory, including elements linked to Fitna al Khwarij (FAK), Fitna al Hindustan (FAH) and ISKP/ Daesh. All possible measures were taken to avoid collateral damage and to protect civilian lives,” the news release said.\nMultiple terrorist training camps, used to plan and facilitate attacks against Pakistan, were also rendered inoperative, it further said.\nThe infra-structural damages to Taliban posts, camps, Headquarters and support networks of terrorists are extensive, all along the border and range from tactical to operational depth.\nThe Armed Forces of Pakistan remain ever ready to protect the territorial integrity, life and property of the people of Pakistan. Our resolve to defend Pakistan’s territorial integrity and to defeat those who threaten our security is unwavering.\n“While the people of Pakistan prefer constructive diplomacy and dialogue over violence and belligerence, we will not tolerate the treacherous use of Afghan soil for terrorism against Pakistan. We have noted with concern that this serious provocation has occurred during the visit of Taliban Foreign Minister to India – the biggest sponsor of terrorism in the region,” the news release said.\n“In the interest of regional peace and security, we call upon the Taliban Government to take immediate and verifiable actions to neutralize the terrorist groups, inter alia, FAK, FAH and ISKP/ Daesh operating from their territory. Otherwise, Pakistan will continue to exercise its right to defend its people by persistent neutralization of terror targets. The Taliban Government should shun any ill-begotten notions and prioritize well being, peace, prosperity and development of Afghan people over irresponsible sabre-rattling,” it said.\n“Last night’s episode vindicates Pakistan’s long-standing position that the Taliban Government is actively facilitating the terrorists. If the Taliban Government continues to sponsor terrorist outfits, in cohorts with India, for shortsighted objective of destabilizing the region, the people and the state of Pakistan will not rest until the menace of terrorism emanating from Afghanistan is completely eliminated,” the news release added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-16T23:55:56.975Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-army-repels-afghan-taliban-khwarij-cross-border-attack-kills-over-200-terrorists/",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T16:25:00.000Z"
}
