{
  "title": "No major uptick in Covid-19 disease spread after new variant arrival",
  "link": "https://www.app.com.pk/national/no-major-uptick-in-covid-19-disease-spread-after-new-variant-arrival/",
  "date_published": "2023-03-31T08:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP): Parliamentary Secretary for Health, Dr Shazia Sobia Aslam Soomro on Friday informed the House that there was no major uptick in Coronavirus disease spread after the new variant’s arrival.\nSpeaking during the question hour of the 51st Session of the National Assembly, the parliamentary secretary apprised the House and the mover of the question in particular on the government measures and the prevailing situation of the contagious disease in the country.\nSoomro in response to the query of MNA Asiya Azeem of Pakistan Tehreek-e-Insaf (PTI), pertaining to the new variant prevalence and new vaccines introduced by Moderna and Pfizer to counter the latest deadly virus variants, said that the pandemic situation was much controlled as compared to the previous waves as no major deaths and critical care admissions were recorded so far.\nShe added that the previous standard operating procedures (SOPs) of mask-wearing, hand washing and others were intact to contain the disease spread. However, the Covid-19 disease spread ratio was 3 percent at the moment that had earlier spiked up to 9 and 12 percent, she said.\nSoomro informed the house that almost 90 percent of the population was vaccinated with Covid-19 vaccine shots and also administered booster doses that helped manage the situation despite consequent disease waves due to different variants.On the supplementary question of MNA Azeem, she said the government had already rolled out vaccine doses for mass vaccination and would continue to do so further as per the need.\nMoreover, the parliamentary secretary said the government had already started to procure newly modified vaccines if deemed necessary amid emerging Covid-19 variants.\nOn a question of MNA Moaulana Abdul Akbar Chitrali of Muttahida Majlis-e- Amal Pakistan on poor treatment of heart patients at the Capital’s hospital, she replied to the member that an inquiry was initiated to probe the matter, whereas proper action would be taken and report would be shared with him.",
  "retrievedAt": "2025-08-11T08:11:02.510Z"
}
