{
  "title": "Huawei releases 2022 Annual Report",
  "link": "https://www.app.com.pk/national/huawei-releases-2022-annual-report/",
  "date_published": "2023-03-31T17:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP): Huawei reported steady operations throughout 2022, having generated USD 92.37 billion in revenue and USD 5.12 billion in net profits.\nIt was disclosed in the Huawei 2022 Annual Report, released in Shenzhen, China on Friday, a press release received here said.\nAccording to the report, Huawei continued to strengthen investment in R&D, with an annual expenditure of USD 23.22 billion in 2022, representing 25.1% of the company’s annual revenue and bringing its total R&D expenditure over the past 10 years to more than USD 140.55 billion.\n“In 2022, a challenging external environment and non-market factors continued to take a toll on Huawei’s operations”, said Eric Xu, Huawei’s Rotating Chairman, at the company’s annual report press conference.\n“In the midst of this storm, we kept racing ahead, doing everything in our power to maintain business continuity and serve our customers. We also went to great lengths to grow the harvest – generating a steady stream of revenue to sustain our survival and lay the groundwork for future development.”\nAlso present at the event was Sabrina Meng, Huawei’s CFO. She noted,“Despite substantial pressure in 2022, our overall business results were in line with forecast. At the end of 2022, our liability ratio was 58.9% and our net cash balance was USD25.35 billion. In addition, our balance of total assets reached 0.14 trillion USD, largely composed of current assets such as cash, short-term investments, and operating assets. Our financial position remains solid, with strong resilience and flexibility. In 2022, our total R&D spend was USD23.22 billion, representing 25.1% of our total revenue – among the highest in Huawei’s history. In times of pressure, we press on – with confidence.”\nIn 2022, revenue from Huawei’s carrier, enterprise, and consumer businesses was USD40.84 billion, USD19.15 billion, and USD30.84 billion, respectively.\nHuawei is a strong proponent of growing together with its ecosystem partners, and believes that openness and collaboration lead to shared success. The company has continued to open up its platform capabilities across its HarmonyOS, Kunpeng, Ascend, and cloud portfolio, focusing on improving developer experience as well as enabling and supporting its ecosystem partners on all fronts. Huawei currently works with more than nine million developers and over 40,000 ecosystem partners to fuel ecosystem-based innovation and create greater value for its customers.\n“2023 will be crucial to Huawei’s sustainable survival and development,” Xu noted. “Plum blossoms tend to grow sweeter from a harsh winter’s freeze. Today, Huawei is like a plum blossom. While it’s true that we have considerable pressure ahead of us, we have what it takes to come out the other end – with opportunities to grow, a resilient business portfolio, a unique competitive edge, the enduring trust of our customers and partners, and the courage to invest heavily in R&D. We are confident in our ability to rise above any challenge that comes our way, laying a solid foundation for sustainable survival and development.”\nAll financial statements in the 2022 Annual Report were independently audited by KPMG, an international Big Four accounting firm.",
  "retrievedAt": "2025-08-11T08:10:48.527Z"
}
