{
  "title": "Govt to generate 10,000 MW solar energy besides solarizing all public buildings: Senate told",
  "link": "https://www.app.com.pk/national/govt-to-generate-10000-mw-solar-energy-besides-solarizing-all-public-buildings-senate-told/",
  "date_published": "2023-03-31T11:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP): Minister for Climate Change Sherry Rehman on Friday informed the Senate that the incumbent government has given a complete plan to harness Renewable Energy (RE) and generate 10,000 megawatt solar energy besides switching all public buildings on environmental-friendly solar energy.\nReplying to various questions during the Question Hour, the minister said that it would not only reduce import bill but also control greenhouse emissions in the country.\nShe said that recommendations would be finalized in consultation with the provincial governments for a long-term strategy to meet the challenges of global warming and greenhouse gas emissions.\nTo a question, she said that electrical vehicles (EVs) were very expensive and ordinary person could not import it. Indian Tata company was locally manufacturing EV and unfortunately in Pakistan, we have no such local manufacturing facility of EV and batteries, she added. She said in Pakistan EV policy for two and three-wheelers has been framed.\nThe minister said that around 3.3 million tons plastic waste was generated in Pakistan but the plastic recycling facility was available in few European countries.\nTo another question, she said the Prime Minister launched “Protected Areas Initiative? to improve flora and fauna of 15 protected areas extending over an area of 7500 square kilometer.\nA PC-I was prepared after detailed consultation with provinces/territories to improve flora and fauna of 23 protected areas extending over 23606.373 square kilometres, she said.\nShe said an amount of Rs. 3895.000 million have been allocated through Federal PSDP to execute the project in the province/territories. The project aimed at protecting the existing flora and fauna, improve governance, create protected areas fund and promote eco-tourism in the 23 protected areas, she said.\nShe said implementation of project activities would start after final approval by Central Development Working Party (CDWP). Since 2018, 44 Protected areas have been notified throughout Pakistan extending over 23592.633 square kilometres, she said.\nTo a separate question, Sherry Rehman said Intergovernmental Panel on Climate Change (IPCC) was created to provide policymakers with regular scientific assessments on climate change, its implications and potential future risks, as well as to put forward adaptation and mitigation options.\nShe said the establishment of Heat Wave Task force-Under the PM directives a task force has been established, engaging all stakeholders both at Federal and Provincial levels. The major role is to take immediate actions to address emergency relief services as well as proposing the long term actions to take adaptation interventions for heat waves, she added.\nThe minister said with 7,253 known glaciers, there was more glacial ice in Pakistan than anywhere on Earth outside the polar regions, according to various studies.",
  "retrievedAt": "2025-08-11T08:10:59.665Z"
}
