{
  "title": "Kashmiris remember Quaid-e-Azam on his 146th birth anniversary",
  "link": "https://www.app.com.pk/national/kashmiris-remember-quaid-e-azam-on-his-146th-birth-anniversary/",
  "date_published": "2022-12-25T13:09:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Dec 25 (APP): People across Azad Jammu Kashmir observed the146th birth anniversary of the founder of Pakistan, Quaid-e-Azam Muhammad Ali Jinnah on Sunday with great enthusiasm and devotion coupled with the renewal of the pledge to continue the individual and collective role for making Pakistan a progressive and prosperous state as envisioned by the Father of the Nation.\nThe day dawned with special prayers in the mosques throughout AJK for the integrity, solidarity, progress and prosperity of Pakistan and for the early success of the Kashmir freedom movement.\nSpecial ceremonies were held in all the districts and its tehsil headquarters of the State including Muzaffarabad and divisional headquarters of Mirpur and Rawalakot. Various social, political and intellectual organizations held special programs to celebrate the Day with great fervor and enthusiasm. Special cake cutting ceremonies were by the jubilant participants to express their heartiest love and affection with the great leader of the Sub-continent.\nSpeakers paid glorious tributes to the founder of Pakistan besides highlighting his life, ideas and achievements.\nIn Mirpur, a special. ceremony in this connection was hosted by a Kashmir based NGO Jinnah Foundation which was addressed by Deputy Chief of the organization Dr. Khalid Yousaf, Secretary General Altaf Hamid Rao and others who paid rich tributes to Quaid-e-Azam for his unprecedented services for the Muslims of the Sub-continent.\nThe speakers said that the best way to pay tribute to Quaid-e-Azam was to continue his mission with national spirit and devotion as envisioned by the late Father of the Nation. They reiterated Kashmiris’ resolve coupled with the renewal of the pledge to continue to follow the policy of founder of Pakistan on Kashmir, who had described Kashmir as the jugular vein of Pakistan.\nThey said that the people of Jammu and Kashmir would continue their freedom struggle for the liberation of occupied Jammu Kashmir from the Indian illegal and forced rule and for the achievement of their legitimate right to self determination and to reach their ultimate destination, Pakistan. They emphasized for performing their individual and collective role for turning Pakistan a true Islamic welfare, prosperous state to enter the ranks of the developed nations by strictly acting upon the vision of the Quaid.\nSimilar special ceremonies were also held in other towns of AJK and Pakistan by the Kashmiri refugees under the auspices of various social and political organizations.\nAll the three radio stations of Azad Jammu Kashmir including Mirpur, Muzaffarabad and Tararkheil and AJK TV aired special programs highlighting the marvelous role of the great leader, his meritorious and remarkable services for the emergence of the separate homeland for the Muslims of the Sub-continent.",
  "retrievedAt": "2025-08-11T16:03:53.462Z"
}
