{
  "title": "PM felicitates Christian community on Christmas",
  "link": "https://www.app.com.pk/national/pm-felicitates-christian-community-on-christmas-2/",
  "date_published": "2022-12-24T19:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP): Prime Minister Shehbaz Sharif felicitated the Christian community in Pakistan and around the world on the auspicious occasion of Christmas.\nIn a message on the occasion of Christmas to be celebrated on December 25, the PM said Christmas gave message of universal love, brotherhood, tolerance, and sacrifice and these values played a crucial role in putting society on the path of development.\nHe said Hazrat Isa (AS) was a panacea for the sorrow of humans and spread God’s message to the whole of humanity.\nHazrat Isa (AS) made better the worldly life and hereafter of humanity and his moral teachings and guidance were a beacon of light for everyone.\nHe underlined the need for following the values of compassion, love, tolerance, and brotherhood in the 21st century to strengthen the moral fabric of humanity.\nHe pointed out that across the world in the last few decades, a wave of religious intolerance had intensified and humans needed to follow the message of interfaith harmony and religious tolerance to stop this negative trend.\nThe nations would have to make the message of love of Hazrat Isa, their guiding light, to eradicate hate and create a peaceful world.\nHe said history was witness that the Christian community in Pakistan played a positive role in every walk of life including defence, judiciary, and education, and contributed to the progress and development of the country.\nHe said the sacrifices of the Christian community for the integrity and solidarity of Pakistan were unforgettable.\nIn the Pakistan of Quaid e Azam Muhammad Ali Jinnah every person had complete religious freedom and the constitution of Pakistan gave special protection to the minorities.\nThe minorities were not only given equal rights but had complete liberty to worship according to their religion and their religious places were protected, he added.\nShehbaz Sharif said Pakistan was passing through a difficult period of history and the whole nation should unite and work day and night for the progress and prosperity of the country.\n“This country belongs to us all and on the occasion of Christmas let us pledge to make Pakistan an example of religious tolerance, brotherhood and peace and play our role to take it out of difficulties. Long live Pakistan,” he added.",
  "retrievedAt": "2025-08-11T16:03:56.189Z"
}
