{
  "title": "Pakistan team arrives in Huawei ICT Competition Global Finals",
  "link": "https://www.app.com.pk/national/pakistan-team-arrives-in-huawei-ict-competition-global-finals/",
  "date_published": "2022-12-25T12:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP):Pakistan team, after securing second position in the Huawei Information and Communications Technology (ICT) Regional Competition 2022 held in Muscat, Oman on Thursday, the world is flexing muscles for the Global Finals to be held in Shanghai, China next year.\nVice President of Huawei Middle East and Central Asia Shunli Wang, in an exclusive interview with APP, informed that the Pakistan team had consecutively been winning the Middle East Competition for the last three years. He was optimistic that the Pakistan team could win the Global Finals.\nAppreciating the Pakistan team’s performance, he said there was a huge ICT talent in Pakistan as 12,000 students from 135 universities appeared in the test while from the rest of the regional countries, including Saudi Arabia, Iraq, Oman, United Arab Emirates, Bahrain, Qatar, Kuwait, Jordon, Lebanon, and Kazakhstan, only 7,300 students attempted the test this year.\nHe said that there was a good sense and knowledge of ICT in the Pakistani students that’s why they were gradually excelling in the rising technology industry with confidence around the globe.\nShunli Wang said, “Huawei is committed to supporting and nurturing young ICT talent in the region. Through this mega event, Huawei aims to empower the youth to advance their ICT skills, hence contribute to the talent ecosystem, and support accelerating digital economies.”\nHe said that we believed in the power of open collaboration with our partners in the public and private sectors, alongside academia to nurture the skills of the young ICT talents and encourage them to participate in achieving the national goals and visions of their respective countries.\nHe further informed that the competition was one of several corporate social responsibility initiatives undertaken by Huawei in the region to train the youth of the day in the ICT sector. Over 80,000 students across the region had participated in the contest since its launch in 2017 and it witnessed a remarkable increase in students with every passing year, he maintained.\nTwo teams from Pakistan participated in the ICT Regional Finals and Team One comprising Team Lead Muhammad Faeez Ali and Asad Anwar Arain from Mehran University of Engineering and Technology (MUET), Jamshoro, and Maryam Fareed from Lahore College for Women University (LCWU) under the Team Instructor Faheem Yar Khan Khuhawar got the second position.\nTeam Two, comprising Team Lead Umar Raza from FAST National University, Eman Yaqoob from LCWU and Fatima Shafique from MUET, Jamshoro under Team Instructor Zeeshan Iqbal could not get any position in the contest.\nInstructor Faheem said the students were self-motivated and well-equipped with ICT knowledge. They left no stone unturned to prove their mettle in the comity of nations and added another feather to the national cap, he added.\nExpressing gratitude to Huawei Pakistan, Team Lead Faeez said he had no idea that he would be given such a massive platform to demonstrate his abilities and further necessary training to polish his skills in the ICT sector.\nIt is worth mentioning here that the Jordan Team comprising students Hamzah Al-Zubaidi and Aws Al-Rayya from Princess Sumaya University for Technology and Yazan Al Shannik from Yarmouk University won the first prize of $20,000.\nAlongside Pakistan, Iraq Team One comprising Sadeem Moulood from Ninevah University, Mohammed Shakr from Salahaddin University, and Mohammed Hussein from the University of Anbar clinched the second position.\nThe third prize went to the United Arab Emirates Team comprising Eyasu Araya and Smon Ftwi from Higher Colleges of Technology and Meriem Aoudia from the University of Sharjah, the Bahrain Team comprising Dana Kamal, Husain Hasan, and Joud Ebrahim from Bahrain Polytechnic, and the Kazakhstan Team comprising Nikolay Zhilaykov from Almaty University of Power Engineering and Telecommunications, Aida Begaldarova from al-Farabi Kazakh National University, and Algerim Turarbekova from International Information Technology University.",
  "retrievedAt": "2025-08-11T16:03:55.053Z"
}
