{
  "title": "Govt takes measures to control Congo virus",
  "link": "https://www.app.com.pk/national/govt-takes-measures-to-control-congo-virus/",
  "date_published": "2023-11-12T16:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP): The Ministry of National Health Services has taken effective measures to protect citizens from the Congo virus.\nIn a statement, Caretaker Federal Minister for Health Dr. Nadeem Jan said that after the outbreak of the Congo virus in Balochistan, the ministry is monitoring the current health situation.\nThe Minister said that when there was an outbreak in Balochistan, the National Institute of Health (NIH) immediately sent a mission to find out the causes of the outbreak.\nHe said, “The ministry is in full contact with the provincial governments and continuously monitoring the situation.”\nHe made it clear that there is no vaccine to prevent Congo fever.\nDr Nadeem Jan asked the citizens to follow the guidelines of the National Institute of Health.\n“Therefore, this disease can be avoided by following preventive measures,” he added.\n“The virus is mostly found in the hair follicles of sheep, goats, cows, buffaloes and other livestock.”\n“When this tick bites a cattle or human, the virus becomes active in it,” he added.\n“The virus can also be transmitted through the blood of an infected person or animal.”\nHe advised, “Before buying or slaughtering sheep or goats, citizens make sure that there are no ticks on the animal’s body.”\nHe asked to use gloves when examining the animal and protect pets from fleas and use medicines in consultation with the Livestock Department.\nHe said citizens should use gloves when slaughtering animals and preparing meat besides protecting from animal blood contamination.\nHe advised to dispose of blood and offal carefully after slaughtering animals.\nHe asked doctors to use personal protective measures such as gloves and masks when treating a Congolese patient.\nHe asked to keep the patient in a separate room (isolation) during treatment and implement all infection control guidelines.\nHe said doctors should use gloves when treating a Congolese patient, adding he advised to take proper precautions while injecting and dispose of syringes or needles properly.",
  "retrievedAt": "2025-08-11T10:29:19.312Z"
}
