{
  "title": "Pakistan, WFP & Green Climate Fund launch climate project to protect flood-prone communities",
  "author": null,
  "content": "ISLAMABAD, Jul 17 (APP):The Government of Pakistan, in partnership with the United Nations World Food Programme (WFP) and the Green Climate Fund (GCF), has launched a major climate resilience project to protect vulnerable communities in Khyber Pakhtunkhwa from the growing threat of floods and extreme weather.\nThrough a US$9.8 million investment from the Green Climate Fund, the Integrated Climate Risk Management for Strengthened Resilience to Climate project aims to directly benefit 1.6 million people in Buner and Shangla—two of the province’s most climate-affected districts.\nThe project was launched during an inception workshop in Islamabad, attended by key stakeholders from federal and provincial governments, including representatives from the Ministry of Climate Change and Environmental Coordination (MoCC & EC), disaster management authorities, and development agencies.\nThe initiative will install early warning systems such as weather stations and river level monitors, improve inter-agency coordination, and ensure timely dissemination of alerts. Local communities will be trained in interpreting warnings, evacuating safely, and protecting lives and property before disasters occur.\nIn addition, the project will enhance the capacity of local disaster management institutions, equip emergency responders, and improve infrastructure to ensure faster and more effective climate emergency responses.\nThe launch comes just weeks into Pakistan’s 2025 monsoon season, which has already claimed over 100 lives through flash floods and landslides, according to the National Disaster Management Authority (NDMA). In 2022, record-breaking floods caused catastrophic damage across the country, with KP province suffering over US$1.5 billion in losses. Buner and Shangla are especially at risk due to recurring disasters, high poverty, and limited climate adaptation investment.\nSameera Sheikh, Joint Secretary at MoCC & EC, said the initiative reflects urgent national priorities: “Pakistan is among the most climate-vulnerable countries in the world. Projects like this are crucial to help frontline communities build resilience against intensifying climate shocks.”\nDr. Ehtisham Ulhaq, Chief of the International Development Section, Government of KP, emphasized the importance of joint governance: “This project not only addresses immediate threats but also opens doors to long-term climate financing for our most at-risk populations.”\nWFP Pakistan Country Director Coco Ushiyama added, “This is a multi-layered investment—combining early warning, anticipatory action, and local adaptation planning. It will help protect lives, food systems, and livelihoods.”\nThe project aligns with Pakistan’s national climate strategies and KP’s disaster risk frameworks, supporting the GCF Strategic Plan 2024–2027 by targeting urgent adaptation needs and building community resilience where it is most needed.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:47:31.769Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-wfp-green-climate-fund-launch-climate-project-to-protect-flood-prone-communities/",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T13:42:00.000Z"
}
