{
  "title": "FGEHA considering price revision of F-14/15 Housing Scheme",
  "author": null,
  "content": "ISLAMABAD, Jul 17 (APP):Federal Government Employees Housing Authority(FGEHA) is considering price revision of the Housing Scheme PHASE VII (F-14/15).\nThe scheme was launched in 2015 after getting formal approval from the Prime Minister of Pakistan on May 1, 2015, official spokesperson of FGEHA informed APP on Thursday.\nHe acknowledged that the price revision of plots in Sectors F-14 and F-15 was under consideration and the authority was diligently working to determine the pricing for these sectors.\n“Currently, the consultation and decision-making process is ongoing which includes the signing of construction agreements, the developer commencing work, and payments to landowners. The authority is meticulously developing a proper schedule for each plot within Sectors F-14 and F-15,” he informed.\nTalking to APP, Director Administration of FGEHA stated that any information concerning pricing or installment plans would only be officially provided to allottees after approval by the Executive Board. The pricing and assessment for these sectors would be determined with the interests and financial well-being of the allottees in mind, to ensure the swift development of these sectors. Approval of the PC-I (Planning Commission-I) was also anticipated very soon.\n“The delay in the completion of the F-14/15 project is due to court cases that began in 2016. These cases were conducted in three phases in these sectors. In November 2024, some of the cases were resolved; however, the rest are still ongoing in the High Court, and the final decision is pending. Despite this, we are moving forward with the development work, and have also opened the transfer process for plots for some of the allottees,” he informed.\n“The public and allottees can be assured that the Housing Authority will complete its work on these sectors promptly and will soon share positive news,” he assured.\nAccording to official documents, the scheme offered plots in three sizes—50×90, 40×80, and 35×70—to members of Category-I, Category-II, and Category-III, respectively. The total number of plots is 6,746, of which 2,457 are reserved for registered members of Category-I (BPS 20–22), 2,259 for Category-II (BPS 18–19), and 2,030 for Category-III (BPS 16–17).\nRegistered members of Phase-II Membership Drive are eligible for allotment under this scheme on age-wise seniority. A total of 5860 Consent letters have been issued to the members of Cat-I, Cat-II, and Cat-III whose cases are matured on age-wise seniority. Whereas, the 4871 allottees endorsed their consent and deposited the down payment are being issued Provisional Offer letters (POL).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:48:40.807Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fgeha-considering-price-revision-of-f-14-15-housing-scheme/",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T10:12:00.000Z"
}
