{
  "title": "ICT Excise Links number plates to vehicle owners, not cars",
  "author": null,
  "content": "ISLAMABAD, Jul 17 (APP):The Excise and Taxation Department of Islamabad has decided to issue vehicle number plates based on ownership rather than the vehicle itself for improving vehicle registration and transfer processes.\nDirector Excise Islamabad, Bilal Azam, announced that under the new system, number plates will remain linked to the registered owner instead of the vehicle. When a vehicle is sold or transferred, a new registration number will be issued to the buyer by the Excise Department.\nAccording to the notification issued by the Director General of Islamabad Excise and Taxation, this decision will apply to both existing and future vehicle registrations. Vehicle numbers issued before the notification will also be subject to the new rules.\nThe policy states that when a vehicle owner sells their vehicle, they will be required to return the registration number to the Islamabad Excise Department. However, the seller will have the right to retain their number for up to one year without using it on any vehicle.\nBilal Azam clarified that if the number remains unused for more than a year, it will be cancelled by the department. This condition is part of the efforts to regulate and manage vehicle numbers systematically while ensuring that the ownership record remains updated and traceable.\nThe Excise Department emphasized that this step is designed to streamline the vehicle registration system and make it easier to track vehicle ownership.\nThe notification formalizes the implementation of the ownership-based number plate system, which is expected to bring clarity and efficiency to vehicle transfers within Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:49:29.854Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ict-excise-links-number-plates-to-vehicle-owners-not-cars/",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T06:32:00.000Z"
}
