{
  "title": "“Breaking Indus Water Treaty will loos global trust”: Musadik Malik warns on water security",
  "author": null,
  "content": "ISLAMABAD, Jul 17 (APP):Federal Minister for Climate Change and Environmental Coordination, Dr. Musadik Malik, on Thursday warned that any violation of the Indus Waters Treaty (IWT) would not only threaten regional stability but also undermine global confidence in international agreements.\nSpeaking at an interactive policy roundtable on the challenges facing the Indus Waters Treaty, held at the National Centre for Rural Development (NCRD) in Islamabad, the minister said, “If India unilaterally breaks the Indus Waters Treaty, it will set a dangerous precedent that no global treaty will hold any significance.”\nDr. Malik emphasized that water is no longer a local or regional matter, but a central issue of global peace and security. “Water is the essence of life,” he stated. “Any action to block the flow of water to a lower riparian country is not just a legal violation—it is a violation of fundamental rights.”\nThe Indus Waters Treaty, brokered by the World Bank in 1960, is a water-sharing agreement between Pakistan and India that governs the use of the Indus River and its tributaries.\nOver the years, the treaty has survived political tensions, but recent developments have raised concerns about its future viability.\n“Over 70% of the world’s countries are lower riparian states,” Dr. Malik noted. “If this treaty is disregarded, it would signal a global disregard for the rights of downstream nations.”\nThe minister further said that climate and environmental issues know no borders. “If you destroy our environment, you harm yourselves as well,” he warned, underlining the interconnected nature of ecological challenges.\nHe made it clear that Pakistan will not remain passive. “We are not weak. We have both the strength and the capacity to respond,” said Dr. Malik. “No one should doubt our ability or resolve.”\nIn closing, Dr. Malik called for global solidarity to uphold international laws and protect the rights of nations that rely on transboundary rivers. “The violation of global treaties will have far-reaching consequences for the entire planet, especially for countries dependent on shared water resources.”\nThe roundtable was attended by policymakers, environmental experts, and representatives from civil society and international organizations, marking an urgent and high-level dialogue on water security and regional cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:48:37.436Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/breaking-indus-water-treaty-will-loos-global-trust-musadik-malik-warns-on-water-security/",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T10:36:00.000Z"
}
