{
  "title": "Heavy rains hit Capital, ICT Police deployed for public assistance",
  "author": null,
  "content": "ISLAMABAD, Jul 17 (APP):Islamabad Capital Territory (ICT) Police, including the Dolphin Response Unit, Ababeel Squad, Traffic Help Unit, and on-wheel mechanic services, have been deployed across the city to assist citizens during the ongoing spell of torrential rains.\nA police spokesperson told APP on Thursday that the Inspector General of Police (IGP) Syed Ali Nasir Rizvi has instructed officers to remain in the field and ensure assistance to residents affected by the heavy rainfall. All operational units of the police have been mobilized to respond swiftly to public calls and emergencies.\nHe said that traffic police officers have also been directed to manage road conditions and ensure smooth traffic flow, particularly on key arteries like the Expressway and Srinagar Highway. Special squads have been deployed during office hours to prevent congestion and accidents.\nHe said Islamabad Police officers, including the IGP Rizvi and senior officials, are themselves present in the field to oversee the situation and coordinate relief efforts.\nHe said Safe City surveillance is actively monitoring the situation across the capital to respond to any untoward incidents promptly.\nHe said citizens facing vehicle breakdowns can also avail help from the on-wheel mechanic service and the Traffic Help Unit, which are patrolling major roads during the downpour.\nHe said for any emergency, residents can contact Islamabad Police through the emergency helpline PUKAAR-15 or reach the Traffic Police at 1915.\nHe said citizens are being kept informed of the latest developments and road conditions through Islamabad Police’s dedicated FM Radio 92.4 channel.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:46:43.980Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/heavy-rains-hit-capital-ict-police-deployed-for-public-assistance/",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T15:07:00.000Z"
}
