{
  "title": "IHC clubs identical petitions regarding auctions of playgrounds",
  "author": null,
  "content": "ISLAMABAD, Jul 17 (APP):The Islamabad High Court (IHC) on Thursday clubbed identical petitions against the auctions of 20 cricket and football grounds in various sectors of capital.\nJustice Inaam Ameen Minhas heard the case and made the results of the auction subject to the court’s decision and issued notices to the CDA and Metropolitan Corporation Islamabad (MCI) for their response. A new petitions was filed by Rawalpindi-Islamabad Sports Journalists Association (RISJA).\nThe petitioner’s lawyer Barrister Umar Ijaz Gilani and Muhammad Ali appeared in the court and took the position that the CDA does not have the authority to auction the grounds. The playgrounds cannot be outsourced for commercial purposes under the Islamabad Local Government Act, he said, adding that if money is demanded to play in the grounds, the access of citizens will be limited.\nThe lawyer said that the maintenance of cricket and football grounds in Islamabad is the responsibility of the MCI. It is requested that the auction of the grounds of Islamabad by the CDA be declared illegal. The court should declare that the grounds maintenance and provision of sports facilities there is the prerogative of MCI.\nJustice Inaam said that there are other similar petitions and they will be heard together. The court made the results of the CDA auction subject to the court decision and, merging the petition with other related cases. It issued notices to CDA and MCI for response and adjourned the hearing of the case.\nIt should be noted that CDA has set July 18 for the auction.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:46:33.481Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ihc-clubs-identical-petitions-regarding-auctions-of-playgrounds/",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T15:13:00.000Z"
}
