{
  "title": "SC grants time to PTI founder’s lawyer for preparations on objections",
  "author": null,
  "content": "ISLAMABAD, Jan 20 (APP):The Supreme Court of Pakistan on Monday granted time to PTI founder’s lawyer for preparation about objections of registrar office on a petition against alleged rigging in general elections 2024.\nA six-member bench headed by Justice Amin ud Din Khan heard the case filed by Pakistan Tehreek e Insaf (PTI)’s founder against alleged rigging in general elections. Petitioner’s lawyer Hamid Khan appeared before the court and gave arguments on maintainability of the case.\nDuring the course of proceeding, Justice Jamal Khan Mandokhail remarked that if you think the Election Commission of Pakistan is biased, then you should have gone to the relevant forum.\nHe said that the court have to be told for the notification of each candidate. If there is a difference between Form 45 or 47, then one of them will be correct, he said, adding that a full inquiry is needed to check the form.\nJustice Jamal Khan Mandokhail questioned that if the entire election from Khyber Pakhtunkhwa to Balochistan was wrong.\nThere will be a separate inquiry for each constituency and each candidate will tell the allegations of his constituency.\nHe remarked that the issue of rigging in elections had been raised previously as well and an ordinance had to be brought for the inquiry. The matter didn’t fall in jurisdiction of this court under article 184.\nThe Deputy Attorney General, on the occasion, said that the Deputy Speaker has also formed a committee on the matter.\nJustice Mandokhail said that the court has no connection with that committee.\nJustice Muhammad Ali Mazhar asked the petitioner’s lawyer Hamid Khan to come on next hearing with case preparations.\nThe court, subsequently granted time to the PTI founder’s lawyer for case preparations and adjourned hearing for indefinite time.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:50:40.992Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-grants-time-to-pti-founders-lawyer-for-preparations-on-objections/",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T14:14:00.000Z"
}
