{
  "title": "CPEC to connect distant production hubs with Pakistani ports: Macaes",
  "link": "https://www.app.com.pk/national/cpec-to-connect-distant-production-hubs-with-pakistani-ports-macaes/",
  "date_published": "2020-01-20T23:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP):“CPEC would remain an important driver for the future economic policies and set to make major contributions to Pakistan’s economy by connecting the distant production hubs to the country’s ports”.\nThis was expressed by Bruno Macaes, Senior Adviser at Flint Global and a former Europe Minister of Portugal during his lecture at COMSATS Secretariat here.\nMacaes who is the author of “The Dawn of Eurasia: On the Trail of the New World Order” and several books on international affairs explored various dynamics of Belt and Road Initiative (BRI) relating to the economic, commerce and geo-political aspects of this grand project.\nThe lecture was jointly organized by the Commission on Science and Technology for Sustainable Development in the South (COMSATS) and Global Think Tank Network (GTTN) under a Distinguished Guest Lecture Series.\nThe lecture was attended by a number of officials from academia, COMSATS Secretariat and GTTN, including Dr S M Junaid Zaidi, Executive Director COMSATS, Owais Ahmad Ghani, former Governor for Balochistan and Khyber Pakhtunkhwa, Dr Shoaib Suddle, Pakistan’s former Federal Tax Ombudsman and Dr Akram Sheikh, Chairman of the Board – GTTN and former federal minister/deputy chairman Planning Commission of Pakistan.\nIn his lecture, Macaes explored various dynamics of BRI and delineating that the project is set to form new value chains involving major parts of Asia.\nBRI, it was noted, is going to improve China’s access to world markets, create more complex value chains and achieve international standards by creating and retaining technological advantage.\nThe ambitious project is going to be major influence of geo-political scenario of the world by establishing a global network of influence.\nThe question and answer session resulted in discussions on creation of more value chains and systems; role of Europe in BRI, risks related to the project, technology absorption and adaptation, geopolitical changes, foreign policy, internationalization of Chinese currency, and terms of technology transfer.\nThe environmental aspects of BRI were also touched upon. CPEC, it was observed, has become a major framework for economic policies environment for future years.\nDr Zaidi concluded the event with a note of appreciation for the speaker and hoped to work out new projects and programmes under the said collaboration that would be mutually beneficial for BRI and COMSATS’ member states.",
  "retrievedAt": "2025-08-11T18:39:55.570Z"
}
