{
  "title": "India continuously facing defeat at every World forum: Fakhar Imam",
  "link": "https://www.app.com.pk/national/india-continuously-facing-defeat-at-every-world-forum-fakhar-imam/",
  "date_published": "2020-01-20T23:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP):Chairman Kashmir Committee Syed Fakhar Imam Tuesday said that Indian government would not be able to keep hold over occupied Kashmir for long as Pakistan has fully exposed the fascist, racist and extremist face of Indian regime at every World forum.\n“Kashmir issue would be resolved under the dynamic leadership of Prime Minister Imran Khan”, he said while talking to private news channel.\n“India badly failed to convince the world that Kashmir is its internal matter, adding, India is being defeated at every international forum”.\nFakhar expressed that every Pakistani has profound love for people of Kashmir and same is the case with Kashmiris who passionately love with Pakistan.\nIt is high time for World community to take practical steps to resolve Kashmir issue in accordance with the will of Kashmiri, he added.\nHe emphasized that war is not the solution of Pak-India crisis. They must be resolved with dialogue for prolonged peace and prosperity for both the nations.\nThe legitimate right of self determination cannot be detained from the brave people of Kashmir, he said.\nChairman Fakhar says, “We won on the diplomatic front; we internationalized the Kashmir issue, talked to heads of states, their embassies and the UN Security Council called a session on Kashmir for the first time.\nIt is diplomatic victory of Pakistan that Kashmir issue is being discussed in the United Nations Security Council, he mentioned.\nThe World powers have endorsed Pakistan’s narrative that Kashmir is not an internal issue of India, he said, adding, incumbent government has taken concrete steps to strengthen Kashmir committee.\nWe have organized Worldwide conferences to expose Indian brutalities in Indian occupied Kashmir, he said.\nThe parliamentarian would also committed to highlight Kashmir issue at every possible international forum.\nBJP led government has committed massive massacres to impose its fascist agenda in Indian occupied Kashmir, he regretted.",
  "retrievedAt": "2025-08-11T18:39:57.236Z"
}
