{
  "title": "Kamyab Jawan Programme: 200,000 to 300,000 youth likely to get concessionary loans under ‘YES’",
  "link": "https://www.app.com.pk/national/kamyab-jawan-programme-200000-to-300000-youth-likely-to-get-concessionary-loans-under-yes/",
  "date_published": "2020-01-21T00:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP):Around 200,000 to 300,000 budding entrepreneurs are likely to get benefit of the Youth Entrepreneurship Scheme (YES), a component of the government’s flagship Kamyab Jawan project launched to offer soft loan facility to those having workable business ideas.\n“Only 15 to 25 per cent of the total applicants may get the concessionary loans under the ‘YES’ as it seems that some 50 to 60 per cent apparently applied in haste and got rejected for having no business plans,” Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar informed APP while highlighting the current statistics of the loan scheme.\n“Most of them, when asked about their business ideas, said we shall think of the plans after getting the loan,” he said while pointing out that the scheme was not a ‘grant’ or ‘lottery’ but a ‘loan’.\nThe YES was launched under the banner of Kamyab Jawan Programme in October last year under which Rs 100 billion allocated for the youth and loans ranging from Rs 100,000 to Rs 5 million would be disbursed among the youth coming up with practicable business ideas.\n“Some 1.3 million youth applied for the loan scheme in merely 15 days which brings it into international spotlight as a team of the United Nations has discussed this Kamyab Jawan programme for attracting such a large proportion of youth, the special assistant said.\nThe scheme was almost in launching process as the applications were being scrutinized and verified by making phone calls, doing Smart Message Service (SMS) and carrying out a third party verification of the applicants.\nHe assured that the allocated money belonged to youth and would be spent on deserving one.\n“The core Agenda of Kamyab Jawan Programme is job creation for youth through promotion of entrepreneurship culture, provision of quality professional trainings and easy access to soft loans.”\nThe programme got unprecedented response, he said while pointing out that the previous launched youth empowerment schemes could not catch the interest of such a large number of youngsters.\nHe said the loans would be distributed on equitable basis as Rs 25 billion had been dedicated for the women under the YES exclusively. Initially, the soft loans would be distributed in Sindh and then extended to the other provinces.\n“Prime Minister Imran Khan will distribute loan cheques among the successful applicants of the Youth Entrepreneurship Scheme (YES) from Sindh on January 27,” he informed.\nTerming the former government’s pro-youth programme politically motivated, Usman said the Prime Minister’s Kamyab Jawan Programme was rolled out specifically for job creation after holding 10-month long extensive deliberations.\nNational and International youth experts, civil societies and other stakeholders were also engaged for the purpose, he added.\nHe said youth was being given a fair chance to emerge as a multiplier force for the country economy through transparent and merit-based process.",
  "retrievedAt": "2025-08-11T18:39:53.924Z"
}
