{
  "title": "Govt to improve business regulation for promoting SMEs",
  "link": "https://www.app.com.pk/national/govt-to-improve-business-regulation-for-promoting-smes/",
  "date_published": "2020-01-21T01:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP):Chairman Board of Investment (BOI) Syed Zubair Gilani on Tuesday said the government was committed to improve the business regulation for providing the enabling business environment to promote Small and Medium Enterprises (SMEs) in the country.\nSmall and Medium Enterprises (SMEs) were the backbone of the economy to generate the new jobs in the country, he said this while addressing a press conference here.\nZubair Gilani was flanked by Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan .\nWhile announcing abolishing the license condition for 70 different business procedures, he said the government had provided a conducive business environment for promoting the SMEs culture and enhancing small businesses at district level.\nHe said after the execution of this process, 100 businesses would get benefits in local market to provide new opportunities to small businesses in the country.\nHe said all these procedure for small business would help increasing connectivity to the small businesses at national level.\nHe said that through the modern technological intervention, the government wanted to improve the business regulation for Ease of Doing Business (EODB) in all four provinces.\nZubair said that initially Pakistan had achieved huge mile stone of improving the World Bank (WB) ranking from 136 to 108.\nThe Chairman BOI said that all the provinces were in good coordination for improving the business regulation to promote the small business and to flourish the local economy.\nIn that regards, Punjab and Khyber Paktunkkwa (KPK) had played better role for improving the business facilitation at district level, he added.\nZuabair said that priority of the government was to improve governance structure and transparency through modern mechanism in order to enhance the capacity of the institutions.\nHe said the government had prioritized the local investors and give them opportunity for investment within the country for starting the new businesses.",
  "retrievedAt": "2025-08-11T18:39:53.192Z"
}
