{
  "title": "Govt to clear refunds within March, grant export rebates in April: Hafeez Shaikh",
  "link": "https://www.app.com.pk/national/govt-to-clear-refunds-within-march-grant-export-rebates-in-april-hafeez-shaikh/",
  "date_published": "2020-03-20T02:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP):Adviser to the Prime Minister on Finance and Revenue Dr Abdul Hafeez Shaikh Friday assured the exporters that the government would clear the GST refunds within the month of March while the export rebates would be granted within April.\nIn a meeting with a delegation of exporters, the advisor expressed his government’s resolve to do whatever possible to ease out the exporters and provide them relief with earlier repayments of export rebates, duty drawback and GST refunds.\n“I would like to make a statement here that the government has no desire or policy to keep the money even a day longer that belongs to the exporters and nor do we find any reason to delay the repayments,” he said while discussing each and every proposal in detail with the exporters.\nHe further directed Secretary Finance and Chairperson Federal Board of Revenue (FBR) to hold meetings with the relevant stakeholders and provide relief to the export sector as much possible for the government.\nHe appreciated the decision taken by All Pakistan Textile Mills Association (APTMA) not to lay off their labour in the time of crisis and advised them to take care of their workers as the government is taking care of them.\nEarlier, the exporters discussed with minister various issues being faced by them after the outbreak of Corona Virus and the evolving position of the global economies and its impact on the export sector of Pakistan.\nAdvisers to PM on Commerce and Textile and Austerity and Institutional Reforms were also present during the meeting.\nThe delegation briefed the Adviser that due to the outbreak of the corona virus pandemic the global economies have gone into a recessionary phase and the demand for their products especially apparel has reduced to a considerable level.\nThe exports which had shown an improvement in the February and March will receive a setback in the coming months.\nIn view of the changing position of the global trade they had been facing problems with their cash flow situation and need help and assistance from the government mainly in expediting the re-payments/ refunds due so that they could come out of this crisis and could resume their business as early as possible.\nThe delegation presented a list of proposals to the Adviser Finance that could help them improve on their liquidity position and to run their businesses in the current situation when they are not expecting further orders and faster recoveries from their international buyers.\nThe delegation apprised the government that they have decided not to lay off their daily wage staff in this difficult time.",
  "retrievedAt": "2025-08-11T18:58:35.976Z"
}
