{
  "title": "Becker regrets winning Wimbledon as teenager - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Boris Becker says he regrets winning Wimbledon at the age of just 17 because he struggled to cope with the expectations that followed his first Grand Slam title.\n\nBecker defeated Kevin Curren in the 1985 final at the All England Club to become Wimbledon’s youngest men’s singles champion.\n\nThe German, known for his flamboyant style of play, went on to win five more Grand Slams, including Wimbledon in 1986 and 1989, after his breakthrough triumph.\n\n“If you remember any other wunderkind, they usually don’t make it to 50 because of the trials and tribulations that come after,” the 57-year-old told BBC Sport on Wednesday.\n\n“Whatever you do, wherever you go, whoever you talk to, it becomes a world sensation.\n\n“It becomes the headline of some of the most important papers of tomorrow.\n\nAnd you’re just trying to mature, just trying to find your feet in the world.”\n\nBecker has endured a tempestuous life off the court as he battled personal issues and financial problems.\n\nIn 2022, he served eight months in prison in England after being sentenced to two-and-a-half years for hiding 2.5 million ($3.3 million) worth of assets and loans to avoid paying debts.\n\n“When you start a second career everything is measured at this success of winning Wimbledon at 17. And that changed the road ahead tremendously,” Becker said.\n\n“I’m happy to have won three, but maybe 17 was too young. I was still a child.”\n\nBecker, who retired in 1999, had a successful spell as Novak Djokovic’s coach between 2013 and 2016.\n\nThe former world number one was deported from the United Kingdom following his release from prison.\n\n“I was too comfortable. I had too much money. Nobody told me ‘no’.\n\nEverything was possible. In hindsight, that’s the recipe for disaster,” Becker said.\n\n“So you take accountability for your actions, which is very important because you cannot look back any more. You cannot change the past. You can only change the future because you live in today.”\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:13:00.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944449/becker-regrets-winning-wimbledon-as-teenager",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T00:15:45.000Z"
}
