{
  "title": "Lighting the way - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE World Bank has issued a stark warning to Pakistan in a report released on Tuesday.\n\nThe country’s growth model has run its course, and over the past five years, the number of people living below the poverty line has begun to swell after two decades of shrinkage.\n\nNot only that. Nearly 40 per cent of children are stunted, and this percentage has not changed much over a long period of time. One quarter of children of primary school age remain out of school. Of the ones that do go to school, 75pc of those who finish primary schooling cannot read, or follow a simple story.\n\nOne after another, the dismal state of the population as seen in the social indicators testifies to the fact that the economy is not delivering, whether or not it grows. The middle of the decade of the 2010s saw a high-growth spurt, yet between the years 2011 and 2021, “real wage growth in sectors employing the poor remained minimal at just 2-3pc” the report notes, “making the poor ill-equipped to convert economic growth into income-generating opportunities”.\n\nThe report is a strong reminder that Pakistan’s economic urgency is actually not about growth. It is about reform. This economy cannot lift people out of poverty even when it grows. It cannot reduce income disparities between urban and rural, or between geographical regions. It cannot create enough jobs for the youth, or furnish income-generating opportunities for women at a rate sufficiently fast to make any meaningful impact in the lives of the multitude.\n\nOne reason for this, the report points out, is that 95pc of all job growth for the poor in the early years of the 2000s, when poverty levels fell sharply, was due to opportunities in the informal sector, and the movement of labour from agriculture to low-quality jobs in services and construction. That drop in poverty was not brought about due to expanding opportunities in the formal sector.\n\nThe World Bank report is a strong reminder that Pakistan’s economic urgency is actually not about growth.\n\nMeanwhile, the state as presently constituted cannot educate its children, reduce the incidence of stunting among them, build resilience to shocks (such as floods) at the local level — and on and on and on.\n\nThe report proposes a number of pathways forward. These include strengthened public service delivery, devolution to local governments and their empowerment via a fiscal model that provides them with the resources they need to discharge their responsibilities.\n\nOther ways forward include what they call “building resilience” via social safety nets and improved targeting through the National Socio-Economic Registry, and finally developing better data systems “through a robust statistical infrastructure that produces accessible, high-frequency, and granular data” to drive evidence-based research, which can serve both as a feedback loop and an input in policy design.\n\nOf all these, the last deserves particular mention. I have long argued for more legally mandated data release templates across government departments. This has many benefits that appear slowly, but reliably, and help focus attention on metrics against which to measure progress.\n\nFor now, the single most robust data dissemination template that operates in the country is the one that focuses on the health of the external sector. We get high-quality data on the balance of payments and trade, and multiple data points against which to measure the foreign exchange reserves, as well as the forward positions taken by the State Bank. The debt statistics are more thorough than any other, and a clear picture of Pakistan’s debt profile can be easily built very quickly.\n\nTry finding out a few basic facts about education or health, however, and you’ll notice how woefully inadequate our data is. Try looking for more regular data on the power sector, and you will have to wade through unspeakably complex Nepra documents to piece the picture together yourself. Forget about employment. That data gets released once a year in a good year.\n\nMaybe the World Bank can play a proactive role here in helping develop a data release template for the power sector, for starters. Maybe it would be a good idea for data on the accumulation of circular debt to be released officially, as per pre-defined protocols, on a fortnightly basis.\n\nMaybe there should be a simple data page on the Nepra website, where we can see fuel consumption data broken down by power plant every month. Maybe units sent out can be shown on a map by coverage area, and next to it we can see recoveries made in the same area during the same period.\n\nThere is a lot of room for expansion here. The provincial governments should also be mandated to release key data relating to health and education on a regular basis. The template for this release should be standardised to enable comparisons across provinces, and ideally with other countries as well.\n\nThis sort of data release requirement helps bring some discipline in government departments. It enables outsiders to track performance. It helps identify those areas where policy needs to be strengthened. And it reduces the scope for discretionary decision-making. In short, an expansive and standardised data collection and disclosure requirement on government departments can help bring about the kinds of reforms the World Bank is saying Pakistan needs to undertake.\n\nOne big reason why change is so hard to bring about in this country is precisely because large swathes of it operate in the dark, in the sense that there is no transparency. Without transparency, it is hard to build accountability. And without accountability, there is no incentive to change, because continuing with business as usual is easier and risk-free.\n\nMaybe a little daylight in the darker recesses of the state will help jolt a few civil servants out of their complacency. Maybe some evidence-based metrics will help light the way, away from the culture of idle complaining that has taken root among the elites.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d4a24e5ee85.jpg",
  "retrievedAt": "2025-10-12T00:12:31.763Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944466/lighting-the-way",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T02:01:49.000Z"
}
