{
  "title": "Loan scheme for affordable housing - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The federal government has introduced a subsidised housing financing scheme aimed at helping Pakistanis from middle and lower-income groups build or purchase affordable homes.\n\nThe initiative, named “Mera Ghar — Mera Ashiana,” was outlined in a circular sent by the State Bank to banks, Housing Building Finance Corporation (HBFCL), and microfinance banks (MFBs) on Wednesday.\n\nThe scheme seeks to address the growing housing affordability crisis, which has worsened over the last five years due to escalating property prices. A small house in Karachi, for example, now costs no less than Rs10 million, making homeownership increasingly out of reach for most Pakistanis.\n\nRising property prices, driven by the inflow of black money and speculative investment, have particularly impacted the middle and lower-middle classes. Another dark side of this problem is that the government never intervened to check the property prices, which skyrocketed over the decade.\n\nMera Ghar — Mera Ashiana offers loans up to Rs3.5m\n\nUnder the new scheme, eligible applicants can access financing for the purchase of a house, construction of a home on an existing plot, or the purchase of a plot followed by construction. The scheme targets homes of up to 5 marlas or flats/apartments up to 1,360 square feet (equivalent to 120 square yards).\n\nThe financing is divided into two tiers: Tier-1, for loans up to Rs2m, and Tier-2, for loans ranging from Rs2m to Rs3.5m. The loan term can extend to 20 years, with a subsidy on the markup for the first 10 years. The participating banks will charge interest based on the one-year Karachi Interbank Offered Rate (KIBOR) plus a 3pc margin, but there will be no processing fees or prepayment penalties.\n\nTo qualify, applicants must be first-time homebuyers, Pakistani citizens, and must not own any property in their name. The loan-to-value (LTV) ratio is set at 90:10, with the government covering 10pc of the portfolio risk on a first-loss basis.\n\nThe scheme aims to ease the financial burden on low-income buyers, offering fixed pricing of 5pc for Tier-1 and 8pc for Tier-2. The State Bank has directed participating financial institu-tions (PFIs) to effectively communicate the details of the scheme and implement the necessary systems to ensure its smooth rollout and prevent misuse.\n\nA mechanism for the payment of markup and credit loss subsidies will be communicated in due course. This initiative is part of the government’s broader efforts to address the country’s chronic housing shortage, particularly for underserved segments of the population.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:21:32.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944471/loan-scheme-for-affordable-housing",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T02:11:52.000Z"
}
