{
  "title": "FBR mulls tax on TikTok content creators - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) is preparing to impose taxes on TikTok content creators, a parliamentary committee was informed on Wednesday during a meeting of the Senate Standing Committee on Finance and Revenue at Parliament House.\n\nSenator Faisal Vawda claimed that the FBR is finalising a plan to tax income earned by TikTokers, suggesting that the largest share of recoverable taxes would come from Punjab. He urged the tax authority to begin enforcement there.\n\nThe committee, chaired by Senator Saleem Mandviwalla, also reviewed the Pakistan Remittances Initiative (PRI) and the government’s remittance subsidy policy. Deputy Governor of the State Bank of Pakistan informed members that the subsidy, originally introduced in 2020 at 20 Saudi riyals per transaction, was raised to 30 in 2024 but has since been reduced back to 20 riyals.\n\nSenators question remittance subsidies benefiting banks\n\nVawda criticised the move and described the policy as a “scandal”, alleging that commercial banks were benefiting disproportionately from the scheme. He called for a formal inquiry and urged the FBR to recover the allegedly misappropriated funds.\n\nChairman Mandviwalla also raised concerns, stating that while the PRI was designed to support overseas Pakistanis, its financial benefits were not reaching intended recipients. Instead, he noted, banks and money transfer operators appeared to be absorbing the subsidy. He called for rationalisation of transaction costs to ensure that remittance beneficiaries in Pakistan receive full value.\n\nIt directed the Ministry of Finance to provide a detailed report on expenditures and reversals linked to the remittance subsidy scheme over the past three to four years. It also recommended a comprehensive review of the PRI framework to prevent misuse and improve transparency.\n\nIn response, Minister of State for Finance and Revenue Bilal Azhar Kayani assured the committee that the issue would be examined in consultation with the State Bank and other stakeholders. He emphasised the need to streamline the mechanism and address gaps in implementation.\n\nThe FBR chief updated the committee on the non-implementation of a Presidential Order issued on July 16, 2025, noting that the matter is under litigation before the Sindh High Court.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:12:42.446Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944470/fbr-mulls-tax-on-tiktok-content-creators",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T02:10:50.000Z"
}
