{
  "title": "Danish PM apologises to victims of Greenland forced contraception - World - DAWN.COM",
  "author": null,
  "content": "COPENHAGEN: Danish Prime Minister Mette Frederiksen on Wednesday apologised in person to victims of a forced contraception programme in Denmark’s autonomous territory, Greenland, that ran for more than three decades.\n\nBetween the late 1960s and 1992, Danish authorities aimed to reduce the Inuit birth rate by forcing around 4,500 women to wear a contraceptive coil — or intrauterine device (IUD) — without their consent.\n\nFrederiksen said during a ceremony in Nuuk on Wednesday afternoon, it had been a “betrayal that had major consequences for Greenlandic girls”, adding: “On behalf of Denmark, I apologise.” Greenlandic Prime Minister Jens-Frederik Nielsen told the audience that the apology “does not mean that we accept what has happened”.\n\nMany of the women were left sterile, and almost all of them have suffered from physical or psychological problems. The scandal is one of several tainting Denmark’s ties to Greenland, including forced adoptions and the removal of Greenlandic Inuit children from their families.\n\nDuring the ceremony at the Nuuk Cultural Center on Wednesday, many of the victims, dressed in black, wiped away tears and listened silently to the prime minister’s apology. Among them was Kirstine Berthelsen, who said she had suffered two ectopic pregnancies, long hospital stays, operations, and the removal of one fallopian tube — issues she said were linked to the IUD.\n\nHearing the apology in person was vital to her healing process, the 66-year-old ret­i­ree said. “I can then move on in my life without hatred, anger, and negativity eating me up from within,” she said. When some of the victims got a chance to speak at the event, they were greeted with a standing ovation.\n\n‘Good news’\n\nDenmark has been keen to smooth over tensions with its strategically located, res­o­urce-rich Arctic territory, which US President Donald Trump has said he wants to take over for security reasons. At the end of August, Frederiksen presented a long-awaited apology to the victims of the forced contraception campaign, in a written statement.\n\nOn Monday, she also announced the creation of a reconciliation fund to compensate the victims, as well as other Greenlanders who suffered discrimination because of their Inuit heritage.\n\n“It’s very good news because my clients are not satisfied with just an apology,” said lawyer Mads Pramming, who represents around 150 of the victims who have sued the Danish state for violating their rights.\n\n‘External pressure’\n\nAaja Chemnitz, an MP who represents Greenland in the Danish parliament, said the apology was a direct result of Trump’s assertive statements about taking over Greenland.\n\n“It’s the external pressure, especially from the United States, that is forcing Denmark to increase its efforts,” she said. “I’ve been an MP for 10 years and I’ve never seen so much effort until now.” Nevertheless, she said it would be an “imp­ortant moment” for the women affected and for society as a whole.\n\nFrederiksen has broken with the tradition of her predecessors, who insisted Denmark had no reason to apologise. “In the past, Danish prime ministers have always been extremely reluctant to acknowledge injustices committed in Gre­enland,” said historian Astrid Andersen, a researcher at the Danish Institute for International Studies.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/25104718889b84c.webp",
  "retrievedAt": "2025-10-12T04:21:39.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944428/danish-pm-apologises-to-victims-of-greenland-forced-contraception",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T00:15:53.000Z"
}
