{
  "title": "Isak opens Liverpool account, Ekitike scores winner and sees red - Sport - DAWN.COM",
  "author": null,
  "content": "LIVERPOOL: Alexander Isak scored his first goal for Liverpool while Hugo Ekitike was sent off after bagging a late winner as the hosts beat second tier Southampton 2-1 at Anfield to reach the fourth round of the League Cup on Tuesday.\n\nThe Swede, a record 125 million pounds ($169.04 million) signing from Newcastle United, found the net in the 43rd minute of a scrappy match — 38 seconds after Southampton’s Adam Armstrong had hit the crossbar.\n\nFederico Chiesa provided the assist, as he did for Ekitike, cutting the ball back for Isak to slot coolly home.\n\nSouthampton hit back through Shea Charles in the 76th after a glaring error by midfielder Wataru Endo but Ekitike, who replaced Isak at halftime, maintained Liver­pool’s 100% start to the season with a winner five minutes from time.\n\nHe was then sent off for a second yellow after removing his shirt in celebration.\n\nEkitike later apologised to Liverpool fans on the celebration, labelled “stupid” by manager Arne Slot.\n\nA shame-faced Ekitike, who sig­ned for the club in July for 69 million, said he had got carried away.\n\n“I was so excited tonight to help the team achieve another victory here in our home for my first Carabao Cup [League Cup] match,” he posted on Instagram.\n\n“The emotion got the better of me tonight,” he added. “My apologies to all the Red family.”\n\nSlot was distinctly unimpressed, labelling Ekitike’s behaviour in the third-round tie “needless” and “stupid”.\n\n“I told him that if you score in the Champions League final in the 87th minute after outplaying three players and hitting it in the top corner I can maybe understand,” he said.\n\n“He is like, ‘This is all about me, what did I do’? “But I am old-fashioned, I’m 47 and old. I never played at this level but did score a few goals and if I scored a goal like this, I’d have turned around and walked up to Federico Chiesa and said: ‘This goal is all about you, this is not about me’.”\n\nIsak missed a golden opportunity in the first minute of only his second start and recognised he needed playing time after a protracted transfer saga.\n\n“It’s still early, a new club and new teammates, but I feel good,” he said. “I think with all the games I get I’m only going to get better.”\n\nCHELSEA SURVIVE\n\nEarlier, Chelsea were in danger of a humiliating exit after boss Enzo Maresca made eight changes following the 2-1 defeat at Manchester United on Saturday.\n\nIn their first meeting with Chelsea since 1911, Lincoln took the lead thanks to a Blues blunder in the 42nd minute.\n\nEnzo Fernandez’s careless pass inside his own penalty area was intercepted by Ivan Varfolomeev.\n\nVarfolomeev headed on to Rob Street and he guided a composed finish past Filip Jorgensen from 12 yards.\n\nChelsea had lost their last two games against United and Bayern Munich.\n\nBut Tyrique George got them back on track three minutes into the second half with a half-volley that crashed in off the post.\n\nFacundo Buonanotte put Maresca’s men in front after 50 minutes, dancing through the Lincoln defence before slotting home.\n\n“I told the players it would not be an easy game. That is why I was so annoyed in the first half, because we know we needed to do better. But overall, they did well in the end,” Maresca said.\n\nMeanwhile, Burnley crashed to a shock 2-1 defeat against third-tier Cardiff at Turf Moor.\n\nClarets boss Scott Parker paid the price for changing his entire team from last weekend’s game against Nottingham Forest.\n\nCardiff’s Joel Colwill prodded home in the 30th minute and Callum Robinson bagged the visitors’ second five minutes later.\n\nZian Flemming’s 56th-minute reply wasn’t enough to spare Burnley’s blushes.\n\nIn Tuesday’s other matches, Wolverhampton Wanderers lifted the gloom around Molineux with a 2-0 win against Everton while Fulham edged Cambridge 1-0.\n\nWolves — who sit bottom of the Premier League after losing all five of their top-flight games — went ahead after a Marshall Munetsi tap-in in the 29th-minute and Toluwalase Arokodare chipped home the second in the 87th minute.\n\nAt Craven Cottage, Emile Smith Rowe’s 66th-minute goal sent Fulham through with a win against fourth-tier Cambridge.\n\nElsewhere, Diego Gomez scored four times as Brighton and Hove Albion thrashed third-division Barnsley 6-0 at Oakwell while second tier Wrexham gave their Hollywood owners another home night to savour by beating Reading 2-0.\n\nChampionship side Swansea City and fourth tier giantkillers Grimsby Town are already through to the fourth round along with Premier League Brentford and Crystal Palace.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d48055c7519.jpg",
  "retrievedAt": "2025-10-12T00:13:00.150Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944454/isak-opens-liverpool-account-ekitike-scores-winner-and-sees-red",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T00:15:45.000Z"
}
