{
  "title": "PM Shehbaz meets Trump, discusses regional security, counterterrorism in landmark visit to White House - World - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif and US President Donald Trump discussed regional security and cooperation along the lines of counter-terrorism, among other matters, as the two met for the first time at the Oval Office in Washington in the early hours of Friday morning, according to a press release from the PM Office.\n\nThe premier was accompanied by the Chief of Army Staff (COAS) Field Marshal Asim Munir, while the US President was joined by US Vice President JD Vance and Secretary of State Marco Rubio, as per an earlier statement from the PM office.\n\nPM Shehbaz thanked Trump for “his public endorsement of Pakistan’s role in counterterrorism and stressed the need to further enhance cooperation in security and intelligence,” as the two discussed matters of regional security.\n\nThe premier described Trump as a “man of peace”, lauding his “sincere” efforts in ending conflicts around the world. PM Shehbaz branded Trump’s style of leadership “bold, courageous and decisive,” and thanked the US president for his role in mediating a ceasefire between India and Pakistan in their four-day military conflict in May.\n\nHe helped “avert a major catastrophe in South Asia,” the statement quoted the PM as saying.\n\n“The Prime Minister also extended a warm and cordial invitation to President Trump to undertake an official visit to Pakistan, at his convenience,” the PM office said.\n\nOn the situation in the Middle East, PM Shehbaz “lauded President Trump’s efforts to bring about an immediate end to the war in Gaza, especially his initiative to invite key leaders of the Muslim world in New York, earlier this week, for a comprehensive exchange of views for restoration of peace in the Middle East, in particular Gaza and the West Bank.”\n\nThanking Trump for the recent tariff agreement signed with Pakistan, PM Shehbaz hoped that “under President Trump’s leadership, the Pakistan-US partnership would be further strengthened to the mutual benefit of both countries.”\n\n“In this regard, the Prime Minister invited the US Companies to invest in Pakistan’s agriculture, IT, mines and minerals and energy sectors,” the PM Office added.\n\nPhotos released after the meeting showed both PM Shehbaz and Field Marshal Munir exchanging views with Trump. Trump was also all smiles as he flashed his signature thumbs up sign during a group photo.\n\nThe meeting, which was closed to the press, was originally slated to begin at 4:30pm Washington time (1:30am PST) but was delayed by approximately 30 minutes as the US president spoke to reporters after signing executive orders. The meeting itself lasted approximately one hour and 20 minutes.\n\nPhotos from the White House press pool before it began showed PM Shehbaz and Field Marshal Munir waiting patiently on the Oval Office’s gold-gilded furniture as, across the room, the US president wrapped up his previous engagement.\n\nThe army chief could also be seen speaking to White House staffers as media personnel packed up their equipment. When US Secretary of State Rubio entered the room, he could be seen enthusiastically greeting both leaders.\n\nThe visit, the first formal bilateral interaction between the two leaders, comes six years after former premier Imran Khan met Trump during the latter’s first term in July 2019.\n\nSpeaking to reporters before the meeting, Trump said that a “great leader” was coming to the White House.\n\n“We’ve got the prime minister of Pakistan coming and the field marshal … [he’s] a great, great guy and so is the prime minister, both,” he told reporters.\n\nPresident Trump was also conscious of the delay, telling the media: “They are coming and they may be in this room right now. I don’t know because we are late.”\n\nPrime Minister Shehbaz Sharif has arrived in Washington, DC for a much-anticipated meeting with US President Donald Trump, according to state-run PTV. Speaking to reporters before the meeting, Trump said that a “great leader” was coming to the White House. “We’ve got the prime minister of Pakistan coming and the field marshal … [he’s] a great great guy and so is the prime minister, both,” he told reporters. Video via WhiteHouse/YouTube Follow updates on Dawn.com DawnToday\n\nThe meeting itself, however, was closed to the press — a break from Trump’s usual modus operandi, as he is known for inviting select cameras and reporters into the Oval Office for photo-ops.\n\nRadio Pakistan reported earlier that the two were “expected to discuss matters of mutual interest as well as regional and global situation”.\n\nThe development comes as the premier is in the US for the 80th session of the United Nations General Assembly (UNGA) in New York. During his whirlwind tour, PM Shehbaz has attended UNGA sessions, a key multilateral summit of the Muslim bloc, as well as side meetings with the heads of international financial institutions in New York.\n\nThe premier will now make his way back to New York, as he is due to address the UN General Assembly on Friday.\n\nEarlier, at a media briefing in New York, a senior State Department official told Dawn that ties between Washington and Islamabad were “gradually warming up” in Trump’s second term.\n\nFor years, the United States had viewed India as a counterweight to China’s growing influence in Asia, while Pakistan was seen as a close Chinese ally.\n\nSince Trump returned to office in January 2025, US relations with India have come under strain over visa hurdles for Indians, steep tariffs imposed by Washington on Indian goods, and the president’s repeated claim that he personally brokered an India-Pakistan ceasefire in May following cross-border hostilities.\n\nThe senior official emphasised that US relations with Pakistan were not tied to its partnership with India.\n\n“We have an independent relationship with Pakistan,” he said, recalling recent American investments worth hundreds of millions of dollars in Pakistan’s mineral sector, and noting continued US interest in petroleum exploration.\n\nResponding to a question, the official added that Washington was still reviewing the recently concluded defence deal between Pakistan and Saudi Arabia.\n\nOn July 31, the two countries announced a trade agreement under which the US imposed a 19 per cent tariff on Pakistani goods. Trump has yet to finalise a similar deal with India. Analysts note that in response to tensions with Washington, New Delhi has begun recalibrating its ties with China as a hedge.\n\nEarlier this year, Trump welcomed Field Marshal Munir to the White House — the first time a US president hosted Pakistan’s military leader without senior civilian officials present, underscoring the military’s central role in bilateral relations.\n\n“We’re working through a number of issues when it comes to counterterrorism, when it comes to economic and trade ties,” the senior State Department official said when asked about Pakistan.\n\n“And so the president remains focused on advancing US interests in the region, that includes through engaging with Pakistan and their government leaders.”\n\nOn India, the official said Trump believed in being frank about frustrations in the relationship but still considered it strong. Washington, he added, continued to see New Delhi as “a good friend and partner” whose ties with the US would “define the 21st century”.\n\nIslamabad has publicly backed Trump for the Nobel Peace Prize for his efforts to defuse tensions with India, even as it has condemned Israeli bombardments in Gaza, Qatar and Iran.\n\nPrime Minister Sharif also joined Trump on Tuesday in a meeting with leaders of several Muslim-majority countries, where the US president discussed Israel’s assault on Gaza and shared American peace proposals on the sidelines of the UN General Assembly.\n\nPrior to the meeting with Trump, PM Shehbaz also met Bangladesh’s chief adviser, Muhammad Yunus, in New York, according to state broadcaster Radio Pakistan.\n\nIn this meeting, the premier reaffirmed Pakistan’s commitment to strengthening “constructive and forward-looking ties” with Bangladesh, rooted in mutual respect, trust and shared aspirations of regional peace and prosperity, the Radio Pakistan report said.\n\nThe two leaders reviewed the current state of Pakistan-Bangladesh bilateral relations, discussing ways to strengthen cooperation in areas including trade, regional connectivity and people-to-people exchanges, it added.\n\nFor his part, Yunus appreciated Pakistan’s initiative to deepen engagement and highlighted the importance of enhancing bilateral trade and cultural linkage, it said.\n\nAdditional input from Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/26033213329b18b.webp",
  "retrievedAt": "2025-10-12T00:12:30.314Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944526/pm-shehbaz-meets-trump-discusses-regional-security-counterterrorism-in-landmark-visit-to-white-house",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T06:41:03.000Z"
}
