{
  "title": "‘Pakistan produced record 21.7TWh nuclear energy in 2024’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Yearly report on nuclear energy criticises Chashma-5 for high cost, precedence over renewable energy projects\n• World Nuclear Industry Status Report says solar outshone nuclear in terms of efficiency, cost; reveals Pakistan’s renewable energy, including hydro, rose to 15.2GW from 14.2GW in 2023\n\nISLAMABAD: Pakistan’s net nuclear energy generation touched a record 21.7 terawatt-hours (TWh) in 2024, even though overall electricity costs and inefficiencies reached a systematic tipping point, forcing consumers to switch to renewables, particularly solar, said the World Nuclear Industry Status Report (WNISR) 2025.\n\n“Pakistan operates six nuclear reactors with a combined (net) capacity of 3.3 gigawatts (GW). Nuclear electricity production has increased from 21.3TWh in 2023 to a new all-time high of 21.7TWh (net) in 2024,” it said, adding Pakistan started developing another 1200MW plant in December 2024 with Chinese support.\n\nThe share of electricity from nuclear power plants to the commercial grid increased from the 16.2pc peak in 2023 to a record 17pc in 2024, it said, adding all operating reactors were built by the China National Nuclear Corporation (CNNC). This includes two Hualong One reactors (Kanupp-2 and Kanupp-3) outside Karachi and four CNP-300 nuclear reactors in Chashma.\n\nCNNC was also building another 1200-MW Hualong One reactor in Chashma (Unit 5). The agreement to build this reactor dates back to 2017, but it took over seven years to progress to the formal construction start, i.e. first pour of concrete for the base slab of the reactor building, which occurred on December 30, 2024. It is China’s only ongoing nuclear newbuild project abroad and represents the first non-Russian construction start anywhere in the world in the past five years.\n\nIn January this year, the National Electric Power Regulatory Authority published an estimated overnight cost of Rs966 billion ($3.4bn) for the Chashma-5 project and the total cost (including financing and other costs) of Rs1.125 trillion ($4 billion). The majority of the cost is planned to be covered by credit from China for the project to start production by 2030, the report said, adding the project had been criticised for its high cost of power, and shelving renewable energy projects to make way for it.\n\nThe report said India had 21 operational nuclear power reactors, with a total net generating capacity of 7.4GW, more than double that of Pakistan (3.3GW), and New Delhi planned to add another 100GW by 2047, a target unlikely to be met.\n\nRenewables vs nuclear\n\nTalking about global trends, the report said solar energy added hundreds of gigawatts globally while nuclear remained irrelevant in market development in 2024. “As storage passed a trigger point, there are first signs of a revolution behind the meter and low-income countries are starting to leapfrog,” it said.\n\nIn 2024, total investment in non-hydro renewable electricity capacity reached a record $728bn, 21 times the reported global investment in nuclear energy. “Solar and wind power capacities grew by 32 per cent and 11 per cent, respectively, resulting in 565GW of combined new capacity, over 100 times the 5.4 GW of net nuclear capacity addition. Global wind and solar facilities generated 70 per cent more electricity than nuclear plants”.\n\nNot only this, as challenges of integrating nuclear power into the energy system remain, new energy technologies disrupt markets and systems. Photovoltaics directly produce electricity from solar radiation in harmless nanometre-thin semiconductor junctions, allowing for ongoing steep cost reductions and performance increases. This is complemented by similar advances in power electronics and batteries.\n\nTogether these new technologies are evolving towards a highly flexible fully electrified energy system with a decentralised control logic outcompeting traditional centralised fossil and nuclear systems. “Nuclear energy increasingly has difficulties to survive in this context. 2024 has been a pivotal year as battery storage costs have dropped by 40pc.”\n\nAs behind-the-meter installations continue to scale, their capacity is becoming increasingly important. This was recently illustrated in Pakistan, the report noted.\n\nThe 10pc decline in power demand in the public grid between 2022 and 2023, while the economy grew, can be partly explained by examining the import statistics for PV panels. In 2024 alone, the imported solar generation capacity amounted to 22GW (compared to 46GW of mostly conventional capacity operating in the public grid in 2023), primarily adding to private installations behind the meter.\n\n“The chaotic development, intensified by sharply rising public electricity prices and unsatisfactory reliability of the grid, is creating new opportunities but also causing social problems,” it said. It highlighted new challenges in managing the transition in emerging economies with intense sunshine. “In the case of Pakistan, it appears that a combination of key cost trends has reached a systemic tipping point,” the report said.\n\nPakistan’s renewable electricity capacity was 15.2GW in 2024, up from 14.2GW in 2023. While hydropower, with a total capacity of 11.5 GW, was the most important component of this capacity, solar energy is the fastest-growing source of energy. In 2024, the total capacity of solar energy was 1.4GW, up from 1.2GW at the end of 2023, while wind constituted 1.8 GW, the same as the two previous years.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:21:19.518Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944409",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T00:15:27.000Z"
}
