{
  "title": "South China cleans up after powerful Typhoon Ragasa - World - DAWN.COM",
  "author": null,
  "content": "Hundreds of thousands of people in southern China were clearing up Thursday after powerful Typhoon Ragasa crashed through Guangdong Province, ripping down trees, destroying fences and blasting signs off buildings.\n\nRagasa churned into Guangdong, home to tens of millions of people, with winds up to 145 kilometres (90 miles) per hour, on Wednesday after sweeping past Hong Kong and killing at least 14 in Taiwan.\n\nAFP journalists at the impact point around the city of Yangjiang on Thursday saw fallen trees, while road signs and debris were strewn across the streets.\n\nA light rain and breeze still lingered as residents worked to clean up the damage; however, authorities have not reported any storm-related fatalities.\n\nOn Hailing — an island administered by Yangjiang —relief workers attempted to clear a huge tree that had fallen across a wide road. Cars drove on muddy tracks to get around the wreckage as the team worked to saw off branches.\n\nA seafood restaurant had sustained heavy damage, its back roof completely collapsed, or in parts flown away entirely.\n\n“The winds were so strong, you could see it completely ripped everything apart,” said restaurant worker Lin Xiaobing, 50.\n\n“There’s no electricity (at home),” she said while helping clear up the mess inside the restaurant, where the floors were covered in water, mud, and debris. “Today, some homes still have electricity and others don’t.”\n\nThe island is a popular holiday spot, and many locals rely on the tourism industry to make a living.\n\n“We can’t do business here during the National Day,” she said, referring to China’s annual holiday period centred on October 1 but that lasts until October 8.\n\n“We were planning to do some business this National Day to make up for it,” she added. “But now we may not be able to.”\n\nRagasa’s passage in Taiwan killed at least 14 and injured dozens more when a decades-old barrier lake burst in eastern Hualien county, according to regional officials who late Wednesday revised the death toll down from 17 after eliminating duplicate cases.\n\nAuthorities initially said 152 people were unaccounted for, but later made contact with more than 100 of them and were still trying to confirm the actual number of missing.\n\nThe storm made landfall in mainland China near Hailing Island on Wednesday evening.\n\nBy that point, authorities across China had already ordered businesses and schools to shut down in at least 10 cities across the nation’s south, affecting tens of millions of people.\n\nNearly 2.2 million people in Guangdong were relocated by Wednesday afternoon, but local officials later said several cities in the province started lifting restrictions on schools and businesses.\n\nChinese state broadcaster CCTV said Ragasa made its second landfall in Beihai, Guangxi, on Thursday morning as a tropical storm.\n\nChinese authorities earmarked the equivalent of about $49.2 million to support rescue and relief work in regions hit by Typhoon Ragasa, Xinhua news agency said.\n\nHong Kong authorities said 101 people were treated at public hospitals for injuries sustained during the typhoon as of Wednesday evening, with more than 900 people seeking refuge at 50 temporary shelters across the city.\n\nThe Chinese finance hub recorded hundreds of fallen trees and flooding in multiple neighbourhoods.\n\nMany of the city’s tall buildings swayed and rattled in the harsh winds.\n\nAbout 1,000 flights were affected by Ragasa, the airport authority said Wednesday evening, adding that they expected to return to normal operations within the next two days.\n\nThe top typhoon warning was downgraded in Hong Kong on Wednesday afternoon after being in force for 10 hours, 40 minutes — the second-longest on the city’s record.\n\nHong Kong’s weather service ranked the storm the strongest yet in the northwestern Pacific this year.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2513571522dfec3.webp",
  "retrievedAt": "2025-10-12T00:12:29.210Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944531/south-china-cleans-up-after-powerful-typhoon-ragasa",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T08:05:33.000Z"
}
