{
  "title": "Terrorists receive ‘state patronage’ in Afghanistan: Sarfraz Bugti - Pakistan - DAWN.COM",
  "author": null,
  "content": "Balochistan Chief Minister Sarfraz Bugti said on Thursday that terrorists were receiving “state patronage” in Afghanistan, from where they launched attacks on Pakistan.\n\nHis comments come against the backdrop of a tumultuous security situation in Balochistan, which has worsened in recent months, as terrorists, long involved in a low-level insurgency, have stepped up the frequency and intensity of their attacks. The banned so-called Balochistan Liberation Army (BLA), in particular, has adopted new tactics to inflict higher casualties and directly target Pakistani security forces.\n\nIslamabad, for the last couple of years, has been insisting that terrorists use Afghan soil to lauch attacks across the country. Kabul, however, denies the allegations.\n\nResponding to a question during a press conference in Islamabad, CM Bugti reiterated the state’s narrative and said, “Terrorists were provided safe havens and places to run training camps in Afghanistan.”\n\nHe highlighted that many among the recently killed terrorists were from Afghanistan.\n\nThe CM called on the Taliban rulers in Afghanistan to abide by the Doha agreement, in which, he said Kabul had “committed not to let your soil be used against any country”.\n\nEarlier in the press conference, he shared details of a intelligence-based operation conducted in Chagai yesterday, in which he said two men were killed and another surrendered. Bugti said one of the two killed “terrorists” was a lawyer by profession.\n\nHe detailed that the lawyer was traced following some arrests over the killing of Pakistan Air Force men on May 8 in Dal Badin. “We observed him for two to three months and surrounded his house yesterday. Then, through a loud speaker, we asked him to surrender, and as soon as we did that, firing started from their end.”\n\nA Federal Constabulary soldier was injured, and retaliatory firing by security personnel led to a fire exchange which went on for two to three hours, he said, adding that eventually two of the “terrorists” were killed and their third companion surrendered.\n\nAnswering a question, he alleged that efforts were being made to gather terrorist organisations in Balochistan. He went on to say that this was a “war” facilitated and funded by Indian intelligence agency Research and Analysis Wing. “They have foisted an intelligence-based war on us, and they are trying to bring together all those who want to destabilise Pakistan.”\n\nBugti also touched upon the suspension of 4G mobile network services in Balochistan.\n\n“We faced criticism for suspending 4G services,” he said, clarifying that the authorities’ intention behind such moves was not to cause inconvenience for the people. “But, terrorists have started using means of communication that are beyond the capacity of our intelligence agencies,” he explained, adding that the suspension of mobile network services helped with tracking down and catching terrorists.\n\nIn response to another questioned, he stressed the need to distinguish between the “youth” who had not taken up arms and those who had taken up arms with the intention to break Pakistan.\n\nHe questioned if an area was deprived of development and resources, should its people kill others. “How are you justifying violence on this basis? … We continue to link this violence to deprivation, unparalleled development, [violation of] human rights.”\n\nBalochistan, where violence has been a problem for long, continues to face neglect in terms of development and resource availability as well. Human rights organisations, such as Amnesty International, have also repeatedly called out the authorities over action against rights activists, notably Baloch Yakjehti Committee’s Mahrang Baloch. Mahrang has particularly raised voice on the issue of missing persons.\n\nBugti also directed criticism toward her and said “there is a huge difference between self-disappearance and enforced disappearance”.\n\n“Unfortunately, you continue to buy the narrative being peddled out here, without thinking that the reality may be different from perception,” he continued.\n\nHe also dispelled the impression that there “is a puppet government in Balochistan”.\n\nThe CM shared that the federal and Balochistan government had decided to carry out an exercise with the help of satellite images and would not get Pakistan’s poppy-free status get compromised.\n\nHe was also asked about the reports of killing of a terrorist identified as Rehman Gul in Afghanistan, who is said to be the mastermind of the Jaffer Express attack.\n\nCM Bugti said these were unconfirmed reports. “It cannot be said that this is 100 per cent true. This is what we have been informed of from different sources … But I believe that this is a big success of ours, even if the reports are unconfirmed. Though, it seems they will be confirmed soon.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/251638599dd7119.webp",
  "retrievedAt": "2025-10-12T00:12:28.181Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944550/terrorists-receive-state-patronage-in-afghanistan-sarfraz-bugti",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T11:40:04.000Z"
}
