{
  "title": "Underage worker crushed to death in brick kiln mixer in Mandi Bahauddin - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: A 12-year-old boy was crushed to death in a mud mixer machine while working at a brick kiln at Pahrianwali village of Mandi Bahauddin district on Wednesday.\n\nReports say that Rehan Ahmed (12) had been working at Ahmed Raza Warraich brick kiln at Pahrianwali. The boy was extracting mud from the mixer when its operator Arfan started the machine. As a result, the boy was crushed to death by the blades of the mixer machine.\n\nPahrianwali police have registered a case against the machine operator under section 322 of the Pakistan Penal Code (PPC) on the report of Maqsood Ahmed, the victim’s father, and started investigation.\n\nThe suspect is yet to be arrested.\n\nThe deceased boy was later buried in the graveyard of Phirey village near Pahrianwali after his funeral prayers were offered.\n\nReacting to the incident, the spokesman for the Punjab chapter of the Pakistan Brick Kiln Workers Association accused the police of not nominating the brick kiln owner in the FIR deliberately, alleging that he (the owner) not only employed an underage worker but also failed to ensure his safety.\n\nHe demanded registration of a murder case against the owner.\n\nMoreover, the spokesman said that the labour department too was responsible for such incidents, demanding that the brick kiln should be sealed for taking no safety measures.\n\nHe said the authorities must enforce the regulations for the protection of brick kiln workers across the province.\n\nZohaib Virk, a spokesman for Mandi Bahauddin police, said that Pahrianwali police had lodged another case against a suspect, Wakeel Ahmed, who is administrator and owner of the brick kiln where the boy died.\n\nThe second case was lodged on the report of Saqib Hayat, Assistant Director of labour department, under various sections of Punjab Occupational Safety and Health Act 2019.\n\nThe owner has been charged for not ensuring workers’ safety at the workplace.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:12:31.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944492/underage-worker-crushed-to-death-in-brick-kiln-mixer-in-mandi-bahauddin",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T03:26:17.000Z"
}
