{
  "title": "Trump urges Turkey’s Erdogan to stop buying Russian oil - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump on Thursday urged Turkish counterpart Recep Tayyip Erdogan to stop buying Russian oil over the war in Ukraine, as Erdogan sought a long-awaited deal to buy US stealth fighter jets.\n\nAs Erdogan visited the White House for the first time since 2019 during Trump’s first term, Trump called on him to use his influence with Russian President Vladimir Putin to end Moscow’s invasion.\n\nTrump said that he would discuss Ankara’s wish to buy high-tech F-35 aircraft and was ready to end sanctions on Turkey over its purchase of Russian air defence missiles.\n\nNato ally Turkey was booted out of the flagship US stealth fighter programme during Trump’s first term after it defiantly bought Russia’s S-400 surface-to-air missile system.\n\n“I’d like to have him stop buying any oil from Russia while Russia continues this rampage,” Trump told reporters alongside Erdogan in the Oval Office.\n\nTrump said Erdogan was “very respected” by both Putin and Ukrainian President Volodymyr Zelensky and “could have a big influence if he wanted to. Right now, he’s being very neutral.\n\n“The best thing he could do is not buy oil and gas from Russia,” Trump added.\n\nAsked when the US sanctions on Turkey’s defence sector imposed over the Russian missiles could end, Trump replied: “If we have a good meeting, almost immediately.”\n\nThe first Trump administration took the action out of concern that Turkey’s purchase of the Russian anti-aircraft system would end up giving Nato’s main adversary a window into the alliance’s capabilities.\n\nTrump, who was wearing a badge of a gold fighter jet on the lapel of his suit jacket, confirmed that they would discuss Turkey’s push to end the long-running rift over buying more US aircraft.\n\n“He wants the F-35 and he’s wanted that, and we’re talking about that very seriously,” Trump said, adding that Turkey also wanted to buy more of the older F-16 jets and “you’ll know about that by the end of the day”.\n\nTrump, known for his admiration for forceful foreign leaders, has long shown a fondness for Erdogan and is embracing him despite a crackdown in Turkey on the opposition. His warm welcome also came despite the fact that Erdogan is at odds with key US ally Israel on Gaza and Syria.\n\n“This is a guy who’s highly opinionated. Usually, I don’t like opinionated people, but I always like this one, but he’s a tough one,” Trump told reporters.\n\n“He knows about rigged elections better than anybody,” Trump added about his counterpart, after saying that they had stayed friends even while the Republican was out of office due to what he called a “rigged election”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/252305595ee6d87.webp",
  "retrievedAt": "2025-10-12T00:12:31.311Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944572/trump-urges-turkeys-erdogan-to-stop-buying-russian-oil",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T18:16:38.000Z"
}
