{
  "title": "Special courts to decide Punjab land grab cases in 90 days: CM Maryam - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Chief Minister Maryam Nawaz has announced establishing special courts to ensure decisions in the land grabbing cases within mandatory 90 days.\n\nAddressing a ceremony organised by the Punjab Enforcement and Regulatory Authority (Pera) here on Wednesday, the CM said that the new legislation will eliminate grabbing of the land owned by orphans, widows and underprivileged citizens in the province.\n\n“And for the purpose, special courts to expedite decisions on land grabbing cases with mandatory resolution within 90 days will be established in the province,” she said.\n\nThe proposed law, she said, would include up to 10-year imprisonment for illegal occupants of land.\n\nAnnounces fee waiver for flood-hit area students\n\n“There will be no encroachment on the land of the weak and helpless in Punjab. Wherever injustice occurs, the Punjab government will be there to bring the oppressors to justice,” she said.\n\nThe CM also administered an oath to Pera officials, who pledged to serve the people with dedication, never accept bribe and work diligently to ensure public welfare and convenience.\n\nIn some recent incidents, Pera officials were allegedly found involved in corruption.\n\nMs Nawaz said Pera was aimed at fighting inflation, hoarding and encroachment. She lauded that Pera force played a key role during the recent floods, engaging in rescue, relief and rehabilitation operations across Punjab.\n\nShe said that artificial inflation and black marketing must be rooted out. “While in Tokyo, I was informed about rising prices of flour and wheat. Thanks to the efforts of Pera and the administration, price of wheat came down.”\n\nThe CM said the businessmen were encouraged to earn fair profits, but profiteering would not be tolerated under any circumstance.\n\n“Money earned through corrupt practices brings no good to anyone,” she told Pera officials.\n\nShe also praised the Crime Control Department (CCD) for helping restore peace across Punjab. She said the crime rate had dropped to zero in several tehsils due to the CCD efforts, where hundreds of cases used to be reported daily.\n\nFee waiver: Chief Minister Maryam Nawaz has approved a ‘special relief package’ for students hailing from flood-affected regions.\n\nUnder this package, semester fee for all students from the affected areas has been waived off.\n\nAdditionally, admission fee for the first-year BS (Bachelor of Studies) students from these regions has also been withdrawn.\n\nThis package will benefit students from Muzaffargarh, Multan, Lodhran, Vehari, Sialkot, Narowal, Gujrat, Chiniot, and Kasur, who will be granted full fee waiver for their first academic year.\n\nRegistration deadline in all universities located within the flood-affected districts has been extended by 20 days, whereas deadline for applying for ‘Honhaar’ scholarship has been extended by a month, says a handout.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:21:38.304Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944505/special-courts-to-decide-punjab-land-grab-cases-in-90-days-cm-maryam",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T03:35:11.000Z"
}
