{
  "title": "Quaid’s grandson booked by Mumbai police ‘for forgery’ - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: The Mum­b­ai police registered a case against 81-year-old business tycoon Nusli Nevil Wadia, the grandson of Quaid-i-Azam Mohammed Ali Jinnah, and some of his family members among others for allegedly using forged and fabricated documents in their court proceedings against Ferani Hotels Pvt Ltd, news reports said.\n\nAccording to Hindustan Times, the FIR was registered following orders by the metropolitan magistrate court at Borivili, which directed the Bangur Nagar police to register an FIR against Nusli Wadia, Maureen Wadia, 78, Ness Wadia, 54, Jehangir Wadia, 52, H.J. Bamji, 75, K.F. Bharucha and R.E. Wandewala, 65, for alleged cheating and forgery.\n\nThe case revolves around a 30-year-old development agreement between Wadia and Ferani Hotels on a plot of land in Malad, which Ferani Hotels was to develop with builder K. Raheja and pay Wadia 12pc of the gross sale proceeds. Disputes arose in 2008, leading to legal battles over Wadia’s share of sales and the management of the land. The case has involved allegations of mala fide, lack of authority, and commercial disputes, and has proceeded through various courts, including the Bombay high court and the Supreme Court.\n\nOn Monday, the case was registered under Sections 3(5) (general explanations), 318(4) (cheating), 331(2) (punishment for house-trespass or house-breaking), 336(3) (forgery), 339 (possession of a document described in Section 337 or Section 338, knowing it to be forged and intending to use it as genuine), 340(2) (forged document or electronic record and using it as genuine), and 61(2) (criminal conspiracy) of the Bharatiya Nyaya Sanhita.\n\nAccording to the FIR, Mahendra Chande, the chief executive officer of Ferani Hotels Private Limited and its group companies, complained to the police that the accused persons had allegedly forged documents and submitted them to the Bombay high court in 2010 in a commercial matter against them.\n\nChande said he had lodged a complaint with the Bangur Nagar police station on March 15, and again with the Mumbai police commissioner on March 24, but the police did not register an FIR. Based on his complaint, the metropolitan magistrate court at Borivali on Sept 20 issued the order to the Bangur Nagar police station.\n\n“We are still verifying the complaint and will be able to comment on the matter only after scrutinising the bulky documents involved in the case,” said a police officer from Bangur Nagar police station.\n\nDespite text and WhatsApp messages, Nusli’s son, Ness Wadia, remained unavailable for comment, the paper said.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2511274256596e9.webp",
  "retrievedAt": "2025-10-12T00:13:00.989Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944411/quaids-grandson-booked-by-mumbai-police-for-forgery",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T00:15:27.000Z"
}
