{
  "title": "Apex court affirms SJC’s sole authority over judges’ conduct - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Allowing judges to target peers would lead to ‘internal conflicts’, Justice Mandokhail warns\n• Ruling underscores principle of judicial equality, places emphasis on judicial discipline; affirms that judges cannot ‘pick and choose’ cases\n• IHC judges’ pleas ‘still under review’, says SC spox\n\nISLAMABAD: Justice Jamal Khan Mandokhail of the Supreme Court, in an 11-page verdict, has ruled that judges cannot initiate contempt proceedings against their peers, establishing that only the Supreme Judicial Council (SJC) has the constitutional authority to probe misconduct allegations against the judges of both the apex and high courts.\n\nHe explained that judges within the superior cou­rts share equal power and status, with no individual holding superiority or inferiority over another. He warned that allowing judges to take such punitive mea­sures against one another would cripple the judiciary.\n\nThe ruling formally justified why a six-judge Supreme Court bench on Jan 27 disposed of an Intra-Court Appeal (ICA) filed by Additional Registrar (Judicial) Nazar Abbas. Mr Abbas had faced contempt proceedings from a smaller two-judge bench for his non-compliance with a judicial order.\n\nThe additional registrar was subsequently removed from his office for withdrawing a case challenging the Customs Act from that two-judge bench, which was headed by a senior puisne judge Justice Syed Mansoor Ali Shah, and transferring it to a larger Constitutional Bench.\n\nJustice Mandokhail warned that permitting judges to hold their colleagues in contempt could ignite internal conflicts, ultimately threatening the integrity of the entire justice system.\n\n“Permitting superior court judges to initiate contempt proceedings against his fellow judges would militate against the necessity of maintaining a high degree of comity amongst them,” Justice Mandokhail wrote.\n\nHe cautioned that such a practice would foster an environment of hostility rather than collegiality, severely damaging the institution’s credibility.\n\n“The maintenance of cordial relations amongst members of the superior judiciary is important for the smooth functioning of courts and issuing a process of contempt of court by a judge against his fellow judge would create internal conflicts, grievances and grudges amongst themselves,” the judgement said.\n\nThe justice painted a dire picture of the potential consequences.\n\n“There would be anarchy and justice system would crumble, which will be against the principle of ‘Esprit de corps’ (common spirit existing in the members of a group and inspiring enthusiasm, devotion, and strong regard for the honour of the group),” Justice Mandokhail observed.\n\nHe added that “the trend will erode public trust and that no legal system can permit judicial system to collapse.”\n\nThe judgement affirmed that while judges possess inherent constitutional power to initiate contempt of court proceedings, this authority does not extend to their colleagues on the bench.\n\n“Judges of the superior courts possess the same status and power within their hierarchy, therefore, no one amongst them neither was superior or inferior to issue direction nor can punish the other,” he noted.\n\nThe ruling clarified the boundaries of judicial immunity, observing that while judges are generally protected for their judicial work and administrative functions, this protection is not absolute and does not shield them from accountability for misconduct. However, the proper and sole channel for such accountability is the Supreme Judicial Council.\n\n“The allegation of misconduct against a judge of the Supreme Court or of a high court can only be inquired into and dealt with under Article 209 of the Constitution by the Supreme Judicial Council (SJC),” Justice Mandokhail observed.\n\nRecalling a rare historical instance, the justice referenced the case of Iftikhar Chaudhry and others, in which the Supreme Court had issued contempt notices to several apex and high court judges for violating a restraining order from Nov 3, 2007. However, Justice Mandokhail stressed that the context of that case was unique and markedly different from the matter at hand.\n\nThe judgement also delved into crucial matters of judicial procedure and discipline, particularly the handling of “part-heard” cases.\n\nJustice Mandokhail affirmed the well-settled legal principle that matters partially heard by a bench should not be transferred administratively unless explicitly permitted by law or constitutional rules.\n\n“The purpose behind this principle was that once a bench or a court hears a case at a considerable length, transferring that case from that court can lead to a denovo hearing,” he explained.\n\nHowever, he introduced a critical exception that directly applied to the registrar’s case: if a court’s jurisdiction is removed through new legislation or a constitutional amendment while a matter is pending, that court loses all authority to proceed. “The court where the matter is pending or is treated as part-heard, it loses its authority to take any further action into the matter, hence, must stop proceedings,” Justice Mandokhail observed.\n\n“With great respect, there was no justification for the regular bench for further proceedings into the matter in contravention of the relevant provisions of the Constitution after the amendment,” he emphasised. He noted that court committees also had no power to override the constitutional change.\n\nUnderscoring that judges are bound by their oath and a strict Code of Conduct, he said, “If every judge of the SC or of a High Court starts picking and choosing cases for disposal by him, without following the practice and procedure in vogue, of their respective courts, the discipline in the court will be damaged.”\n\nIHC judges’ petition under review\n\nSeparately, the Supreme Court said that petitions filed by five senior sitting judges from the Islamabad High Court are in the normal process of review and that any order regarding their fate will be made in due course.\n\n“Petitions are in the normal process of procedural scrutiny and any order thereon is to be made in due course,” said Dr. Shahid Hussain Kamboyo, a spokesperson for the Supreme Court.\n\nOn Sept 19, five judges — Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Raffat Imtiaz — personally appeared before the apex court to file their constitutional petitions.\n\nThe petitioner judges pleaded with the Supreme Court to declare that the administrative powers of the Chief Justice of the Islamabad High Court cannot be deployed to undermine or trump the judicial powers of high court judges. They sought a declaration that the CJ-IHC was not authorised to constitute benches or transfer cases once a high court bench was already seized of a matter.\n\nIt also asked the apex court to declare that the CJ-IHC cannot exclude available judges from the roster at will and use the power to issue a roster to oust judges from performing judicial functions.\n\nPublished in Dawn, September 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:21:37.662Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944447/apex-court-affirms-sjcs-sole-authority-over-judges-conduct#:~:text=IHC%20judges%E2%80%99%20petition%20under%20review",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T00:15:20.000Z"
}
