{
  "title": "GB traders reject agreement reached with federal govt, to continue protest at Sost Dry Port - Pakistan - DAWN.COM",
  "author": null,
  "content": "Traders in Gilgit-Baltistan have decided to continue their sit-in despite the government agreeing to conditionally exempt imports routed through the Sost Dry Port from key federal taxes, trade leader Javed Hussain — who has been leading the protest — told Dawn.com on Thursday.\n\nLocal traders in GB have been staging a protest sit-in, blocking the port since July. The protest was launched against the government’s taxation policies and suspension of customs clearance at the port.\n\nYesterday, the government agreed to tax exemptions on imports coming through the port — provided that the goods were for local consumption and meet strict eligibility conditions. The total annual value of tax exemptions was capped at Rs4 billion.\n\nThis was announced after talks between the federal government, GB government and local business leaders in Islamabad.\n\nBut, Hussain said traders were not satisfied with this agreement.\n\n“After the agreement and its announcement in Islamabad, it was suggested to us to end the protest. But we don’t agree with this [suggestion] and have decided to continue the sit-in and keep the trade suspended,” he said.\n\nHussain said traders would now have a sitting with its representative body that held talks with the government. If its members were able to give a satisfactory justification regarding yesterday’s agreement, traders would deliberate on whether to continue the protest, he added.\n\n“Setting a limit on imports and placing a cap of Rs4bn goes against our demands,” he asserted, adding that traders’ demands were based on GB’s “legal status” in the country and the “exemption it was provided under the Constitution”.\n\nBut the decision made in Islamabad is contrary to this, and “we are of the view that by setting a limit on imports, decision-makers have [failed to resolve] the fundamental dispute”, he said.\n\nHussain also pointed out that a statutory regulatory order (SRO) had not been issued so far and only an agreement was finalised. “We are carefully reviewing the provisions of this agreement,” he added.\n\nReiterating the traders were not satisfied with the agreement, he said they could go for a “Plan C”.\n\nHe added that they would also consult the stakeholders and discuss the shortcomings of the agreement, after which they would consider ending the protest.\n\nThe trade leader also raised the questioned that why “dozens of containers that were stuck for several months” were not being given clearance through an SRO and other procedures were being opted for, for this purpose.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:12:28.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944525/gb-traders-reject-agreement-reached-with-federal-govt-to-continue-protest-at-sost-dry-port",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T09:15:31.000Z"
}
