{
  "title": "President Alvi urges politicians to resolve issues with sagacity, patience",
  "link": "https://www.app.com.pk/national/president-alvi-urges-politicians-to-resolve-issues-with-sagacity-patience/",
  "date_published": "2023-05-18T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP): President Dr. Arif Alvi Thursday said sanity should prevail and political issues should be resolved with sagacity and patience and focus should be brought back to economic issues facing the nation.In an interview with a private television channel, he said political instability would create problems for Pakistan, adding it was good omen that politicians were not ready to impose emergency.He said action should be taken against the persons involved in the incidents of May 9.“I was aggrieved by the incidents of May 9. Transparent and independent investigations should be held and those who attacked government and army installations and were involved in vandalism should be punished. These incidents should be condemned.”He said he wrote letters to the Prime Minister and army chief and condemned the incidents as it was painful for him that the house of Corps Commander, the office of the intelligence agency and martyrs’ monument were vandalized.However, human rights should be upheld and no one should be tortured, he stressed, adding the right to protest should be exercised within the confines of law.The President said politicians should consider the matter of filing of cases under the army act. In the past, Parliament and Supreme Court undid punishments handed down by the military courts, he mentioned. He said anti-terrorism laws were being used to try politicians which was a cause of concern.To a question, he said he was in support of Pakistan army, democratic forces and people of Pakistan.He said politicians should hold talks and elections should be held to reduce problems in the country. Elections should be held as early as possible so that somebody should come and also replace him as President, he remarked.He recalled that Pakistan suffered damage after the martyrdom of Benazir Bhutto and the violence only subsided after Asif Ali Zardari raised the slogan of “Pakistan Khapay”.Dr Alvi was of the view that the national discourse was focused on other issues at a time when the national economy was in bad shape, inflation was breaking back of the poor and more than 20 million children were out of school.He said the world was watching the situation in Pakistan in a year when the government would have to present its case for Generalised System of Preferences (GSP+) before the European Union.He advised that harmony should be created among institutions, adding “when institutions are destroyed it is difficult for nations to survive and move forward.”The President said in important cases, Supreme Court judges should have acted with unanimity so that people would have listened to them and the nation would have a clear direction to follow.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T08:31:00.345Z"
}
