{
  "title": "NCOC’s decision to be implemented in letter and spirit: Dr Firdous",
  "link": "https://www.app.com.pk/national/ncocs-decision-to-be-implemented-in-letter-and-spirit-dr-firdous/",
  "date_published": "2021-03-22T14:36:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 22 (APP):Special Assistant to Punjab Chief Minister on Information Dr Firdous Ashiq Awan has said that strict smart lockdown will be ensured in areas where infection rate of coronavirus is between 8 to 12 percent.\nAddressing a press conference here on Monday, she said that National Command and Operation Centre (NCOC) had expressed concern over increasing cases of COVID-19 in Punjab.\nShe said that today’s (NCOC) meeting had identified the large scale violation of coronavirus related standard operating procedures (SOPs).\nShe said the Punjab government would ensure implementation on the decisions of NCOC in letter and spirit.\nDr Firdous said that it would be strictly ensured that wedding functions were held as per SOPs.\nShe said that regarding closure of cinemas and ‘Mazaars’ meeting with stakeholders would be held and important decisions would soon be made in this regard.\nThe SACM said that 7.4 million people in Punjab would be vaccinated against COVID-19 till December next adding that till now 95,211 people of 60 years and above 60 years of age had been vaccinated.\nShe said that 394,000 people of Punjab had got themselves registered on Toll Free number ‘1166’ for coronavirus vaccine.\nShe said the CM had issued directives to provide all possible facilities to vaccinate old people at district level, adding that people of different age groups would be vaccinated against coronavirus in phases.\nDr Firdous said that those who wanted to get benefit from vaccine should visit designated centres as per rules.\nShe said the incumbent government was going to start Universal Health Card programme in DG Khan and Sahiwal divisions.\nCommenting on Maryam Nawaz yesterday’s address to youth convention, Dr Firdous said that Maryam Nawaz tried to hoodwink youngsters besides persuading them to attack institutions.\nShe said, “Maryam Nawaz should understand that hollow slogans seem good in films not in real life.” The SACM said that it was difficult for Sharif family to abide by the law.",
  "retrievedAt": "2025-08-11T20:31:50.326Z"
}
