{
  "title": "Dr. Nishtar visits G-11 to review street hawkers’ economy firsthand",
  "link": "https://www.app.com.pk/national/dr-nishtar-visits-g-11-to-review-street-hawkers-economy-firsthand/",
  "date_published": "2021-03-22T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar on Monday visited G-11 Markaz to review the street vendors’ economy firsthand and realize the positive role and potential of street vendors in supporting poverty alleviation efforts.\nEhsaas is striving to improve the operating environment for street vendors through multi-stakeholder engagement.\nIn this regard, Ehsaas is collaborating with Islamabad Municipality, Capital Development Authority (CDA) and Pakistan Institute of Development Economics (PIDE) to explore a sustainable and evidence-based solution to support street vendors.\n“Ehsaas is aware of the difficult working conditions for street vendors, but it is also the matter of fact that other citizens also have the right on the usage of public space”, Dr. Sania Nishtar said while talking to street vendors during her visit to G-11 Markaz.\nDr. Nishtar toured the whole Markaz, met different street vendors and listened to their plight. It included the 42-year Shaheen Akhtar, the only female street vendor in the market, who is selling home-cooked food.\nStreet vendors informed Dr. Nishtar about various operational issues being faced by them in the market.\nSyeda Shafaq Hashmi, Administrator Metropolitan Corporation Islamabad and Zia Banday, Focal Person for Street Vendors’ Initiative at the Poverty Alleviation and Social Safety Division also accompanied Dr. Nishtar.\nAt present, 85 street vendors are operating in the area, among which some have been vending for over 15-years, but none of them has any vending license.\nLack of legal status makes vendors susceptible to frequent eviction campaigns and rent-seeking exploitation.\nMajority of the street vendors are less educated and low skilled migrants from other areas of the country, who have limited capacity and resources for earning their livelihood.\nPublic spaces in markets with sufficient footfall provides them room to make their living.\nA whole informal ecosystem existed in commercially viable public spaces for accommodating street vending.\nOn per square feet basis, they are paying more monthlies to do their business than rent of the formal shop in the area. However, perpetual fear and uncertainty of tenure constraint restrict capacity of vendors to sustain more hygienic practices.\nHygienic neglect and market demand is inducing more congestion and cleanliness issues in street vending.\nStreet vendors asked the government to recognize their positive role in generation of self-sustaining economic activities and poverty alleviation.\nUnder Ehsaas, Vendors’ Support Group has also been set up which is overseeing the development of number of interventions in streamlining vending in the city.\nMs. Hashmi informed that municipality is pioneering efforts through the setting-up of dedicated Street Economy Unit to recognize and organize better governance and management of street vendors.\nMr. Banday shared details of an inclusive pilot project for street vendors planned in collaboration with different partners.\nPIDE has been providing the intellectual input and design of the pilot.",
  "retrievedAt": "2025-08-11T20:32:01.287Z"
}
