{
  "title": "Amin scuba dives into Charna Island to observe bleaching Coral Reefs",
  "link": "https://www.app.com.pk/national/amin-scuba-dives-into-charna-island-to-observe-bleaching-coral-reefs/",
  "date_published": "2021-03-22T10:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Special Assistant to the Prime Minister (SAPM) Malik Amin Aslam on Monday scuba dived into the Charna Island waters to assess damage being inflicted due to bleaching of Coral reefs amid rising pollution and environmental degradation.\nThe SAPM after wearing proper scuba diving kit had dived into the deep water and reached the coral reefs that had gone white due to bleaching at the bottom of the sea.\nSpokesperson of the Ministry of Climate Change Muhammad Saleem Sheikh told APP the SAPM had also observed the colors of coral reefs found on the rocks in deep waters and recorded videos and snapshots to present a detailed report the Prime Minister on the matter.\nThe federal government was going to make Charna Island, a 4 kilometers coastline shared by the provinces of Sindh and Balochistan, a “Second Marine Park” which would become a protected area, he added.\n“It will help conserving the depleting marine life and also boost eco-tourism in the area. However, timely action by the federal and provincial governments will save valuable natural resources,” Sheikh said.\nAs many as, he said 55 species of coral reefs had been identified in the Island’s deep waters by World Wide Fund for Nature and University of Karachi’s Centre of Excellence in Marine Biology under the Darwin Initiative Project.\nHe added that Corals were naturally colorful species with mesmerizing structures that were actually the habitats of various marine life including jelly fish and other aquatic species.\nThe rise in temperature of water in the sea also cause bleaching of the corals as it was mostly volatile in nature with abrupt rise and fall with developing environment and scenario, he told.\nReplying to a query, he said Pakistan hosted one of the diverse and unique species of corals that were rare on the earth whereas environmental pollution mainly caused due to contamination made by industrial liquid waste being dumped untreated into the sea was causing its bleaching.\nHe underscored that a scuba diver back in November 2020 during his routine venture into the deep sea to view the corals indicated bleaching of the corals.\nIt created huge outcry at the local and global levels where the Ministry of Climate Change and provincial authorities took notice of the situation and in collaboration with all stakeholders initiated probe into the matter, he added.\nResponding to another query, Sheikh said the provincial governments of Sindh and Balochistan and the federal government were on the same page to convert the Island into a marine protected area to ensure immediate intervention for preserving the most precious asset of the country.\n“Effective and sustainable conservation of the Island is not possible unless it is declared a marine protected area and all the polluters of its environment are held accountable to play their in circumventing all sorts of threats being posed by their interventions to one of the rarest marine ecosystem,” he added.\nIt merits mention that Astola Island in Baloochistan was the first marine protected area which was one of the most scenic and potential key destination for eco-tourism where its regular monitoring was ensured by the Environmental Protection Agency of Balochistan.",
  "retrievedAt": "2025-08-11T20:31:58.333Z"
}
