{
  "title": "Pakistan’s Ehsaas Emergency Cash programme averted an economic catastrophe: Report",
  "link": "https://www.app.com.pk/national/pakistans-ehsaas-emergency-cash-programme-averted-an-economic-catastrophe-report-2/",
  "date_published": "2021-03-22T12:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): A new report released on Monday found that Pakistan’s innovative emergency cash programme helped avert an economic catastrophe during the COVID-19 pandemic.\nThe report released by the International Policy Centre for Inclusive Growth (IPC-IG), “What’s next for social protection in light of COVID-19: country responses” focused on experiences from countries in Asia, including Pakistan, sub-Saharan Africa, the Middle East and North Africa (MENA), and Latin America and the Caribbean.\nThe deep dive into social protection responses to the COVID-19 crisis highlights Pakistan’s effort to tackle poverty amidst the biggest global crisis in more than a century and provides over all lessons for the future including shock-responsive and universal social protection.\nIn Pakistan, the report analyzed how the COVID-19 pandemic was a watershed period for Pakistan in terms of government functioning: making it more agile, data-driven, experimental, and ambitious. The full report is available for download here: http://ipcig.org/publication/30008?language_content_entity=en\n“I welcome the analysis of this report on Pakistan quickly reacted to the COVID-19 pandemic and focused on saving lives and livelihoods,” said Dr. Sania Nishtar, Special Assistant of Pakistan’s Prime Minister, Poverty Alleviation and Social Safety Ministry, Government of Pakistan.\n“I hope lessons learned from Pakistan’s experience can help other countries protect people during an emergency”, she further added.\nRecounting Pakistan’s social protection response to the COVID-19 crisis, the report says, “The Ehsaas Emergency Cash (EEC) programme demonstrated how cash transfer programmes can be deployed to counter the socio-economic fallout due to external shocks such as the COVID-19 pandemic.\nThe lockdown in Pakistan—the fifth most populous country in the world affected the livelihoods of 24.9 million.”\nThe study reveals that social protection had been an integral component of Pakistan’s response to the crisis.\nIn response to the economic impact of the pandemic, the Government of Pakistan launched the emergency cash transfer scheme and delivered approximately USD 1.1 billion to 14.8 million families at risk of extreme poverty. Each low-income household received a one-time payment of USD75, enough to buy staple food items for the four months.”\nFurther, the report highlights that the EEC programme augmented the digital infrastructure already in place and followed a hybrid targeting approach to identify beneficiaries.\nThe programme accelerated the adoption of cost-effective, digital initiatives that enabled new ways of coordinating across multiple stakeholders and deploying a whole-of-government approach.\nThe current Policy in Focus presents the key discussions of the global e-conference: “Turning the COVID-19 crisis into an opportunity: What’s next for social protection?” held in the first week of Oct 2020.\nAt the e-conference, Dr. Sania Nishtar was invited to represent Pakistan at the country panel on Asia Pacific.\nThe IPC-IG is a global forum for international dialogue on innovative development policies, guided by a partnership agreement between the Government of Brazil, represented by the Ministry of Economy and the Brazilian Institute for Applied Economic Research (Ipea), and the United Nations Development Programme (UNDP).",
  "retrievedAt": "2025-08-11T20:31:55.457Z"
}
