{
  "title": "Pakistan Day Parade postponed to March 25 for inclement weather",
  "link": "https://www.app.com.pk/national/pakistan-day-parade-on-march-25-due-to-inclement-weather/",
  "date_published": "2021-03-22T13:23:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 22 (APP):The Joint Services (JS) Pakistan Day Parade has been rescheduled on March 25, amid ongoing inclement weather and rains being forecast over the next two days.\n“The JS Pakistan Day Parade will now be held on March 25, as per programme and timings already specified,” said an Inter Services Public Relations (ISPR) media release on Monday.\nIt may be mentioned here that the ISPR had also released its public service message on creating awareness among the general public for participating in the JS parade with strict adherence to the Covid-19 standard operating procedures (SOPs).\nThe message highlighted that March 23, was not only Pakistan Day rather a moment of national commitment and resolve demanding the masses to remain firm, resolute and steadfast in all times whereas it was decided to celebrate this year’s Pakistan Day under strict Covid-19 SOPs.\nIt added that the parade participants were kept in a bio secure bubble to ensure least possibility of viral infection among the troops and other officials partaking in the parade. However, all the visitors were advised to wear masks and use hand sanitizers while entering into the Parade Ground.\nIn order to ensure strict compliance of safety protocols mask wearing compliance would be checked at all of the entry points of the parade venue.\nMoreover, use of face masks and hand sanitizers was also being ensured at the entry points of all enclosures of the venue.\nThe sitting arrangement for the participants was also planned as per the Covid-19 SOPs of social distancing and all were advised to comply with the safety guidelines and celebrate the Pakistan Day with safety and care, said the ISPR awareness message.",
  "retrievedAt": "2025-08-11T20:31:52.462Z"
}
