{
  "title": "USF approves Rs 8.15 bln projects for providing HSMBS to 7.59 mln people",
  "link": "https://www.app.com.pk/national/usf-approves-rs-8-15-bln-projects-for-providing-hsmbs-to-7-59-mln-people/",
  "date_published": "2021-03-22T12:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): The Universal Service Fund (USF) Board approved as many as nine projects worth approximately Rs 8.15 billion to provide High Speed Mobile Broadband Services (HSMBS) to approximately 7.59 million people in un-served and under-served areas of Punjab, Sindh, Balochistan and Khyber Pakhtunkhwa.\nOn the advised of Minister for Information Technology (IT) and Telecommunication, Syed Amin Ul Haque, the USF Board approved award of Next Generation Broadband for Sustainable Development contracts to Jazz, Telenor and Ufone and Optic Fiber Cable contracts to Nayatel and PTCL ,said a news release issued here.\nThe Board also approved the launch of a new program called the ‘Next Generation Broadband for Sustainable Development Program for Tourist Locations’ to promote tourism in the country.\nThe Federal Secretary for Ministry of IT and Telecommunication and Chairman of USF Board, Shoaib Ahmad Siddiqui chaired the 76th Board of Directors meeting.\nThe Secretary and the Chairman of USF Board said “Digital Pakistan Vision” can see fruition only if every citizen of the country has access to mobile technology and internet services. “\nIn this regard, Federal Minister for IT and Telecommunication, Syed Amin Ul Haque has issued clear instructions that development projects need to be initiated and executed in all remote and economically marginalized areas.\nThe minister has expressed his satisfaction with USF’s performance whereby USF has in the current 31 months cumulatively presented Rs 30 billion worth of projects.\nThese projects include unserved and underserved areas in the Ex-FATA region, Balochistan, Sindh, Punjab and Khyber Pakhtunkhwa provinces.\nThe secretary also added that as advised by Syed Amin Ul Haque, the Board has approved special projects on an urgent basis for the provision of High Speed Mobile Broadband services in tourist areas.\nThe completion of these projects is not only aligned with the Prime Minister’s vision on promoting tourism but also provide these services to visiting tourists, and local citizenry and support them in income generating activities as well.\nChief Executive Officer of USF, Haaris Mahmood Chaudhary apprised the Board members about the projects.\nHe also shed light on the new programme that focuses on providing High Speed Mobile Broadband services to tourist destinations.\nFurthermore, he added that the team of USF was working relentlessly to provide High Speed Mobile Broadband services in areas such as Babusar Top, Lake Saif Ul Malook and Sharan Forest in Manshera district, Kumrat Valley in Upper Dir district, Mahodand Lake in Swat district and Galiyaat.\nThis will not only provide Information and Communication Technologies (ICT) to domestic and foreign tourists but also play a significant role in sending timely response to the concerned agencies in case of an emergency.\nAccording to the details, the Board approved award of contracts under the Next Generation Broadband for Sustainable Development program worth around Rs 3.68 billion to Jazz, Telenor and Ufone that will benefit an unserved population of approximately 2.6 million and an approximate unserved area of 37,730 sq. km.\nJazz is being awarded the contract of Shikarpur, Jacobabad and Kashmore districts in the province of Sindh, Multan and Khanewal districts in the province of Punjab and Pishin, Killa Abdullah and Quetta districts in the province of Balochistan.\nThis will serve an unserved population of around 2.22 million in 819 unserved muazas and an approximate unserved area of 16,357 sq. km. Similarly, Telenor is being awarded the contract of Swat, Swabi, Nowshera, Mardan and Charsadda districts in the province of Khyber Pakhtunkhwa that will benefit an unserved population of approximately 0.22 Million in 120 unserved muazas and approximately 2,279 sq. km of unserved area.\nLikewise, Ufone is being awarded the contract of Panjgur district in the province of Balochistan that will benefit an unserved population of approximately 0.15 Million in 69 unserved muazas and approximately 19,094 sq. km of unserved area.\nThe Board also approved award of contracts under the Optic Fiber Cable programme to Nayatel and PTCL for the province of Punjab.\nNayatel is being awarded the contract of Ranjanpur and Muzaffargarh districts while PTCL is being awarded the contract of DG Khan District. The Optic Fiber Cable projects are valued at approximately Rs 4.47 billion that aimed at laying of 1,632 km of optical fiber cable to connect 228 towns and union councils thereby providing High Speed Mobile Broadband services to an unserved population of approximately 4.98 million.",
  "retrievedAt": "2025-08-11T20:31:54.179Z"
}
