{
  "title": "Donor-driven parliamentary forums diverge from their core objectives: Ayaz Sadiq",
  "author": null,
  "content": "ISLAMABAD, Feb 12 (APP): Speaker of the National Assembly Sardar Ayaz Sadiq on Wednesday emphasized that parliamentary forums, comprising representatives from all political parties are fundamentally established to advance public welfare and formulate legislation for the betterment of marginalized segments of society including children, women, and youth.\nHe stressed that the goal of these forums transcends the mere convening of donor-driven meetings. Their paramount objective is to craft substantive legislation that addresses the needs of marginalized communities, firmly rooted in the prevailing socio-economic realities.\nHe said this while presiding over the National Women’s Convention, organized by the Women Parliamentary Caucus (WPC), under the leadership of its Convener/MNA Dr.Shahida Rehmani at the Parliament House here.\nAyaz Sadiq further underscored that the National Assembly of Pakistan, in collaboration with the Pakistan Institute of Parliamentary Services (PIPS) is adequately equipped with the necessary human resources to support and enhance the efficiency of parliamentary forums.\nHe advocated for the imperative transformation of these forums into more purposeful and effective bodies, dedicated to fulfilling their legislative mandates with integrity and impact.\nHe commended the contributions of women parliamentarians in the legislative proceedings of the House.\nAyaz Sadiq lauded their pivotal role across all socio-economic sectors in Pakistan, acknowledging their significant contributions to the nation’s development.\nHe further stated, “Women working in the National Assembly are permitted to leave before evening to maintain a balance between their professional responsibilities and family life.” He also stressed on the need to support women in every socio-economic sector of the country.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:39:24.793Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/donor-driven-parliamentary-forums-diverge-from-their-core-objectives-ayaz-sadiq/",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T14:21:00.000Z"
}
