{
  "title": "IMF chief meets PM Shehbaz; lauds Pakistan’s efforts to implement IMF program; assures support",
  "author": null,
  "content": "ISLAMABAD, Feb 12 (APP): Prime Minister Muhammad Shehbaz Sharif held a meeting with Managing Director of the International Monetary Fund (IMF) Kristalina Georgieva wherein both sides discussed Pakistan’s ongoing IMF program and the macroeconomic stability achieved through the government’s comprehensive reform agenda.\nThe meeting held on the sidelines of the World Governments Summit (WGS) 2025 in Dubai, highlighted Pakistan’s commitment to implementing structural reforms and maintaining fiscal discipline, which had been instrumental in restoring economic stability and would be critical in driving sustainable growth, according to a PM Office press release issued Wednesday.\nPrime Minister Shehbaz Sharif underscored the progress made under the IMF’s Extended Fund Facility (EFF), which has played a key role in stabilizing Pakistan’s economy; setting it on the path of long-term recovery.\nHe reaffirmed the government’s resolve to sustain the reform momentum, particularly in critical areas such as tax reform, energy sector efficiency, and private sector development.\nHe assured the IMF chief of Pakistan’s commitment to economic prudence, efficiency, and sustainability as essential pillars for achieving inclusive and sustained growth.\nKristalina Georgieva commended Pakistan’s efforts in effectively implementing the IMF-supported program, highlighting the country’s improving economic performance with rising growth and declining inflation. She recognized that Pakistan is on the path to growth and has undergone economic recovery.\nThe IMF Managing Director also acknowledged Prime Minister Shehbaz Sharif’s leadership and personal commitment to driving the country’s reform agenda, which has been critical in achieving economic stability and progress.\nShe reiterated the IMF’s continued support for Pakistan’s reform agenda, emphasizing the importance of sustained fiscal discipline, structural reforms, and good governance to ensure long-term economic stability and growth.\nLater, the IMF chief took to her X timeline saying, “Wonderful to meet Pakistan Prime Minister Shehbaz Sharif and his team. I am encouraged by their strong commitment to Pakistan’s IMF-supported reforms and support their decisive actions to pave the way to higher growth and more jobs for Pakistan’s youthful population.”\nPrime Minister Shehbaz also responded that in their meeting, they discussed Pakistan’s economic progress and the ongoing reforms, besides reaffirming their shared commitment to achieving sustainable growth and financial stability.\n“We appreciate IMF’s continued support as Pakistan transitions from macroeconomic stability to a path of sustained economic growth and prosperity,” he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:40:28.170Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/imf-chief-meets-pm-shehbaz-lauds-pakistans-efforts-to-implement-imf-program-assures-support/",
  "dateList": "2025-02-12",
  "date_published": "2025-02-12T05:42:00.000Z"
}
