{
  "title": "From survivors, politicians to intelligentsia, all denounce premature release of Rajiv Gandhi’s killers",
  "link": "https://www.app.com.pk/national/from-victims-politicians-to-intelligentsia-all-denounce-premature-release-of-rajiv-gandhis-killers/",
  "date_published": "2022-11-12T12:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP): The Indian supreme court on Friday ordered a premature release of six people convicted for killing former Indian premier Rajiv Gandhi, prompting a strong reaction from the victim families, the politicians and intelligentsia calling it “shocking” and another “blot” on the reputation of the BJP-influenced Indian judiciary.\nIn 1991, a women suicide bomber had killed Rajiv Gandhi in Indian state of Tamil Nadu when he was 46.\nThe assassination was carried out by the Liberation Tigers of Tamil Eelam (LTTE), a Sri Lankan separatist group. A total of 16 people were killed in the 1991 suicide bombing, including Rajiv Gandhi, 9 police personnel and 6 others.\nThe court released the killers based on their “satisfactory conduct” in prison and that they had served over three decades of jail time.\nHowever, the decision was widely denounced in India and being dubbed as another tactic of the BJP government to pursue Hindutva ideology through arm-twisting the political opponents and ethnic minorities across the country.\nSome critics called it out as “national disgrace,” “egregious” and “dangerous precedent”,  while others opined that it could only happen in “banana judiciary.”\nBe it is Babri Masjid, Samjhauta Express blast, Bilkis Bano rape or Hijab ban case, this is not the first time, the Indian judiciary has passed a judgment siding with the RSS agenda and letting the hardcore elements go free putting the lives of millions from the minority communities at risk.\nThe Indian National Congress came up with a strong reaction with its general secretary in charge of communications Jairam Ramesh calling the decision “totally unacceptable and completely erroneous”.\n“The Congress party criticises it clearly and finds it wholly untenable. It is most unfortunate that the Supreme Court has not acted in consonance with the spirit of India on this issue,” he said.\nChairperson Social Media and Digital Platforms of Indian National Congress Supriya Shrinate, said, “The assassination of Rajiv Gandhi was an attack on the soul of India – it can never be pardoned.”\n“Rajiv Gandhi’s assassination was a national tragedy… His assassins’ release is a national disgrace. It sets the worst kind of soft-state precedent,” said Shekar Gupta, Founder, ThePrint, an Indian online newspaper.\nRenowned Indian journalist Barkha Dutt calling the release of Rajiv Gandhi’s killer “egregious” said “We cannot possibly complain about the release in other rape and murder cases if the assassination of an Indian prime minister is not sufficient reason to mean Life for Life.”\nIndian news anchor Rajdeep Sardesai believed that the release of Rajiv Gandhi’s assassins serving a life sentence sets a very dangerous precedent. “They are guilty of a heinous crime, rarest of rare. Life in such cases is, and ought to be life.”\nIndian billionaire business magnate and the founder and CEO of Zoho Corporation, Sridhar Vembu said it was sad to see the Supreme Court prematurely release convicted criminals, whose guilt in the brutal assassination of Rajiv Gandhi and so many others was beyond doubt.\n“Commuting the death sentence to make it a life sentence is mercy. This is mockery. There is a difference,” he wrote on Twitter.\nProminent Indian Editor Aarti Tikoo, who has been vocal on human rights issues called the court decision as “shameful” as “only in the ‘banana judiciary’ of a soft state could the assassins of former Prime Minister of India, get freedom from jail.”\nThe release of Gandhi killers also hurt the survivors and victim families.\n“How is this justice?” said Abbas talking to the Indian media, who was orphaned after his mother died in the blast. “They planned and killed a PM and innocent Tamils. This is unacceptable,” he says.\n“What about justice for those killed and injured survivors?” asked a survivor Anusuya Daisy Ernest, a retired woman police officer who was regulating crowd when the blast took plave.\nTalking to Indian news agency PTI, Ernest said, “I am still undergoing treatment for pellet injuries. This is the plight of the injured people. Where is justice?”\nThe history of the Indian judiciary was replete with the controversial decisions, ignoring the facts as well as the ground realities.\nIn 2020, an Indian court, despite audio and video evidences, acquitted Hindu nationalist leaders in the Babri Masjid demolition case which had sparked nationwide riots and killed more than 3,000 people in a decades-long dispute.\nIn another verdict, the Indian supreme court observed that all insults to persons belonging to Dalit or tribal communities would not be considered an offence.\nIn 2020, the Indian apex court granted bail to all 14 convicts in the Sardarpura massacre that took place in wake of the Godhra train burning incident in 2002.\nIn the recent past, the Karnataka high court banned the wearing of ‘hijab’ by Muslim girls in educational institutions failing to uphold the principle of freedom to religious practices.\nA special India court had acquitted four men accused of bombing a Samjhauta Express train which had killed 68 people in 2007.\nIn August this year, the Gujarat government ordered the premature release of 11 men sentenced to life imprisonment in the Bilkis Bano gang rape case.",
  "retrievedAt": "2025-08-11T15:52:34.008Z"
}
