{
  "article_id": "2025-01-02_7af8cb5a2705f75f97d67434cdade340",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/muqam-expresses-solidarity-with-lg-representatives-after-brutal-police-lathi-charge-shelling/",
    "retrieved_at": "2025-08-27T11:15:32.809Z"
  },
  "metadata": {
    "title": "Muqam expresses solidarity with LG representatives after brutal police lathi charge, shelling",
    "author": null,
    "date_published": "2025-01-02T11:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 227,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Jan 02 (APP): Federal Minister for States and Frontier Regions, Gilgit Baltistan and Kashmir Affairs, Engr Amir Muqam here on Thursday expressed solidarity with the local government representatives of Khyber Pakthunkhwa after brutal lathi charge and shelling against them by police and demanded of the PTI Government to address their problems on priority basis. The federal minister visited the camp of the protesting LG representatives here and expressed complete solidarity with them. Addressing the LG representatives and later talking to media, Engr Amir Muqam said that brutal shelling and lathi charge against peaceful protestors were highly condemnable. He said that PTI leadership on one side were talking about protest was their democratic right while the other side used police force against peaceful LG protestors. He said the undemocratic attitude of the PTI leadership were stand exposed before the entire nation yesterday at Peshawar. Engr Amir Muqam said that local government representatives were mandated for resolution of people problems at grassroot level and their demands should be addressed on priority basis by the KP Government. He expressed the hope that PTI would also respect the mandate of other politcal parties and LG representatives in Khyber Pakhtunkhwa. He assured to raise the issues of LG representatives on all appropriate forums. Earlier, Engr Amir Muqam was accorded warm welcome by the LG representatives and thanked him for the solidarity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}