{
  "article_id": "2025-01-02_6faeab8d7dbb6e79cf9b78136b35c431",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/citizens-mental-well-being-drives-progress-ahsan-iqbal/",
    "retrieved_at": "2025-08-27T11:16:27.086Z"
  },
  "metadata": {
    "title": "Citizens’ mental well-being drives progress: Ahsan Iqbal",
    "author": null,
    "date_published": "2025-01-02T16:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 324,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 02 (APP): Federal Minister for Planning, Development and Special Initiatives, Professor Ahsan Iqbal here on Thursday underscored the critical role mental well-being plays in driving a nation's progress. \"Any nation's progress hinges on its citizens' mental well-being,\" the minister said while addressing an international conference on mental health. He said, like individuals, nations also have mental health which determines their success or failure likewise like a person, when nation's self-esteem is wounded, it also falls prey to depression. Quoting the digital census, he said, the country's population was increasing exponentially, however vaious diseases were also on the rise, highlighting need to focus on both physical and mental health. He said, with a population of 24 crore, only 900 psychiatrists are available, and this number needs to be increased. He emphasized that improving mental health was crucial for individuals and nations alike. In recent years, he said, negative attitudes have been promoted in politics, and stressed the need to eliminate hate and prejudice from society. He warned that extremism in societal attitudes is dangerous for the country. Ahsan Iqbal noted that humans have been endowed with the power of thought and understanding, so it is essential to improve collective attitudes and work together to build a better future for Pakistan. He said, Pakistan has faced numerous challenges, including terrorism, economic instability, and natural disasters, which have had a profound impact on people's mental health. Ahsan Iqbal emphasized the need for collective effort to think about the country's future and prioritize peace, political stability, reforms, and policy continuity. Under the prime minister's leadership, the 'Udaan Pakistan' initiative has been launched, he said, stressing the need to work on agriculture, industry, and IT sectors to drive progress. He emphasized that Pakistan must strive to achieve economic milestones as a unified nation. He said, work on the National Mental Health Policy will commence soon, and the Mental Health Policy draft would be approved and implemented promptly.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}