{
  "article_id": "2025-01-02_7b179a76479d621e508d3dca35c169ce",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/governor-kundi-emphasizes-support-for-talented-youth/",
    "retrieved_at": "2025-08-27T11:15:37.866Z"
  },
  "metadata": {
    "title": "Governor Kundi emphasizes support for talented youth",
    "author": null,
    "date_published": "2025-01-02T11:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 878,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "PESHAWAR, Jan 02 (APP): Governor Khyber Pakhtunkhwa, Faisal Karim Kundi, on Thursday highlighted the importance of encouraging the province's talented youth, saying that the Governor House was actively working towards supporting young individuals. The Governor made these remarks while interacting with a representative delegation from the 71st Harvard National Model United Nations Pakistan at the Governor House in Peshawar. The delegation was led by Fahad Malik, consisted of young people from various cities of Pakistan. Governor Kundi highlighted that when Pakistan People's Party (PPP) Chairman Bilawal Bhutto Zardari visited the Governor House for the first time, a representative group of talented athletes from the province was invited on short notice. He praised the exceptional abilities of these individuals. He urged the youth not to be discouraged, emphasizing that Pakistan has both talented youth and ample resources. He stressed the need for collective effort to build a better future for the country. Kundi urged the youth to continue making their country proud on their own, saying that with proper government support, Pakistan's global reputation could be further enhanced. He encouraged young people to take on roles as ambassadors of their country while abroad, emphasizing that the future of the nation lies in education and technology. Meanwhile, Governor Faisal Karim Kundi praised the recent achievements of the Blind Cricket Team for bringing honor to the country during a meeting with the Peshawar Cricket Club for the Blind, led by Habibullah Khattak. During the meeting, the Governor was informed that two players and one coach from the club participated in the T20 Blind Cricket World Cup, held in December 2024, where Pakistan emerged as the world champion. Additionally, one player from the club served as the head coach of the Afghanistan Blind Cricket Team. The club representatives presented their demands to the Governor, including requests for jobs, grounds, the organization of the Governor's Cup and financial support for sports activities. Governor Faisal Karim Kundi acknowledged the exceptional talent in Pakistan's sports community, citing the success of the Blind Cricket Team as a prime example. He highlighted the lack of adequate facilities for players, whether it be training grounds or other essential resources. The Governor assured that he is in contact with relevant officials to address the challenges faced by players and improve the promotion of sports activities in the province. Kundi further pointed out that the provincial government has not been sufficiently proactive in supporting sports initiatives. He stressed that these athletes are valuable assets to the province and bring great pride to the region. He urged the provincial government to provide them with the necessary support and facilities to enhance their performance and continue making the province proud. Similarly, Chairman of the FATA Tribunal, Kifayatullah Khan, met with the Governor of Khyber Pakhtunkhwa, Faisal Karim Kundi, at the Governor House. During the meeting, discussions were held on judicial matters, public issues, and the provision of justice in the former FATA regions. The Chairman briefed the Governor on the tribunal's performance and progress in the resolution of cases. He highlighted the complexities of legal matters in the region and the challenges of delivering prompt justice to the public. Governor Faisal Karim Kundi praised the performance of the FATA Tribunal, emphasizing that the provision of justice in the former tribal areas and resolving their issues with federal departments are top priorities. He assured full cooperation in strengthening the role of the Tribunal and facilitating the public. He further said that the people of the tribal areas have high expectations from the FATA Tribunal, and the Governor House will provide all possible support in this regard. Meanwhile, Deputy Auditor General (North), Sajid Ali Nadeem held a meeting with Governor Faisal Karim Kundi at the Governor House. The meeting was attended by Director of Audits, Dr. Ameen Ullah, Sajid Khan, and Liaqat Ali. During the meeting, the Deputy Auditor General presented the Special Study Report for the year 2023-24 on the Water and Sanitation Services Company (WSSC) in Abbottabad District. The report provides a detailed assessment of water supply and sanitation services in Abbottabad's four urban union councils and 11 neighborhood councils. Additionally, the Deputy Auditor General also presented the Performance Audit Report for the Double Shift Schools Program in Charsadda District for 2023-24. The report highlighted several key findings and made recommendations for the program's improvement. Among the recommendations were the immediate closure of non-functional programs and the introduction of greater transparency in the process of transferring students from morning shifts to evening classes. The report also called for the confirmation of records for teacher payments under the program within a month. Governor Kundi emphasized the importance of financial discipline and adherence to rules and regulations in order to navigate the province out of the financial crisis. He stressed that financial transparency is crucial for good governance across all sectors. Speaking about local governance, Governor Kundi highlighted the pivotal role of local representatives at the Union Council level, saying that they are closely connected to the local population and district administration. He urged the local representatives to work with audit bodies to ensure transparency in development initiatives at the Union Council level. \"The implementation of good governance in all sectors will require ensuring financial transparency in all matters,\" Governor Faisal Karim Kundi added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}