{
  "article_id": "2025-01-02_766a68dfa29390ef39e1772488597757",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/comstech-to-launch-its-expert-service-program-for-technological-cooperation-in-oic-countries/",
    "retrieved_at": "2025-08-27T11:16:17.951Z"
  },
  "metadata": {
    "title": "COMSTECH to launch its Expert Service Program for technological cooperation in OIC countries",
    "author": null,
    "date_published": "2025-01-02T09:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 315,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 2 (APP):COMSTECH, the OIC Ministerial Standing Committee on Scientific and Technological Cooperation has decided to launch its Expert Service Program to foster technological collaboration among member states of the Organization of Islamic Cooperation (OIC), as follow up of preliminary discussion with Secretary General OIC. It was decided during an important meeting of the Advisory Committee for the COMSTECH Expert Service Program held on Thursday. The meeting was presided over by Coordinator General COMSTECH Prof. Dr. M. Iqbal Choudhary while convener of the Committee Prof. Dr. Shahid Mahmood Baig, former Chairman Pakistan Science Foundation and Head of Life Sciences Department, Health Services Academy, Prof. Dr. Moazur Rahman Director Centre of Excellence in Molecular Biology, University of the Punjab, and officials from COMSTECH attended the meeting. Coordinator General COMSTECH remarked that recognizing the abundant yet underutilized technical expertise within OIC member states, this initiative aims to build a robust network of experts, engineers, technologists, and professionals to provide hands-on training and knowledge sharing. The program addresses critical developmental sectors, enabling recipient institutions, such as universities, research centers, industry, companies, and laboratories, to access specialized technical services and enhance their capacities. The key objectives of this initiative would include facilitating the transfer of technical expertise and best practices, strengthen technical capabilities through training and capacity-building programs, establishing a collaborative network of experts and promoting solidarity, volunteering, and shared responsibility within the OIC community. The program will support diverse fields, including biomedical engineering and health, renewable energy, information technology, manufacturing and engineering sciences, agriculture, urbanization, and smart cities, etc. The participants appreciated the initiative and assured their utmost cooperation in making it a successful, vibrant, and productive one. This program is a strategic step toward enhancing technological self-reliance, fostering sustainable development, and mitigating brain drain in OIC member states. It also underscores the values of collaboration and mutual benefit, reinforcing the collective progress of the OIC community.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}