{
  "article_id": "2025-01-02_d7952f84751b8e1f8030b36c3212f75a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mercy-petitions-of-19-convicted-persons-in-may-9-riots-accepted/",
    "retrieved_at": "2025-08-27T11:15:59.438Z"
  },
  "metadata": {
    "title": "Mercy petitions of 19 convicted persons in May 9 riots accepted",
    "author": null,
    "date_published": "2025-01-02T08:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 314,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jan 02 (APP): The mercy petitions of 19 convicted persons involved in May 9, 2023 riots have been accepted on humanitarian grounds. \"Sequel to the promulgation of punishments to 9th May Tragedy convicts, they have exercised their right to appeal and have asked for mercy/ remission in their punishments,\" a news release issued by Inter Services Public Relations (ISPR) on Thursday. \"A total of 67 convicts have given their mercy petitions. 48 petitions have been processed to Courts of Appeal while, petitions of 19 convicts have been accepted purely on humanitarian grounds, in accordance with law. Mercy petitions of remaining will be decided in due course of time, following the legal process,\" it further said. Those whose punishment has been remitted are: 1.Muhammad Ayaz s/o Sahibzada Khan 2.Sami Ullah s/o Meer dad Khan 3.Laeeq Ahmed s/o Manzoor Ahmed 4.Amjad Ali s/o Manzoor Ahmed 5.Yasir Nawaz s/o Ameer Nawaz Khan 6.Said Alam s/o Maaz Ullah Khan 7.Zahid Khan s/o Muhammad Nabi 8.Muhammad Suleman s/o Said Ghani Jan 9.Hamza Sharif s/o Muhammad Azam 10.Muhammad Salman s/o Zahid Nisar 11.Asher Butt s/o Muhammad Arshad Butt 12.Muhammad Waqas s/o Malik Muhammad Khalil 13.Sufayan Idrees s/o Idrees Ahmed 14.Muneeb Ahmed s/o Naveed Ahmed Butt 15.Muhammad Ahmed s/o Muhammad Nazir 16.Muhammad Nawaz s/o Abdul Samad 17.Muhammad Ali s/o Muhammad Boota 18.Muhammad Bilawal s/o Manzoor Hussain 19.Muhammad Ilyas s/o Muhammad Fazal Haleem They all shall be released after completion of procedural formalities. All those convicted retain the right of appeal and other legal remedies as per the law and the constitution, it further said. \"The remission of punishments is a testament to the strength of the due process and fairness, which ensures that justice is served while also taking into account the principles of compassion and mercy,\" the statement added. Earlier in April 2024, release of 20 convicts was also carried out on humanitarian grounds in accordance with the law.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}