{
  "title": "M-6 Sukkur-Hyderabad project set to begin in April 2026: NA body told",
  "author": null,
  "content": "ISLAMABAD, Jul 31 (APP): The Standing Committee on Communications, in its 12th meeting held on Thursday, reviewed a range of crucial infrastructure projects aimed at enhancing national connectivity and road safety. Among the key issues discussed was the M-6 Sukkur-Hyderabad project, scheduled to begin in April 2026 with funding from the Islamic Development Bank.\nThe National Highway Authority (NHA) informed the Committee that it has requested advance procurement approval from the Bank, with land acquisition expected to commence within a month. Consequently, the NHA will formally write to the Sindh government to initiate land acquisition procedures, said a press release.\nThe meeting, chaired by Aijaz Hussain Jakhrani, MNA, opened with a recitation of the Holy Quran, followed by the confirmation of the minutes from the previous session. The Committee then focused on reviewing the Ministry’s responses to earlier recommendations, which emphasized the importance of strategic infrastructure initiatives across the country.\nThe Committee expressed displeasure over the absence of the Secretary of the Ministry of Communications, issuing a stern warning that repeated non-attendance would be brought before the House and Privilege Committee for necessary action.\nMembers also voiced concerns regarding the National Highway Authority’s (NHA) third toll rate increase within a short period. This increase appears to contradict NHA’s policy, which stipulates toll rate revisions every three years. The Committee deemed the repeated toll hikes detrimental to the public interest and instructed NHA to provide a detailed justification at the next meeting.\nThe Inspector General of the Motorway Police briefed the Committee on the legal framework under which FIRs are registered for motorists exceeding the speed limit of 150 km/h on motorways, as per Section 279 of the Pakistan Penal Code (PPC) relating to fast and negligent driving.\nIt was noted that since the enforcement of this law, motorway casualties have significantly decreased over the past five months. The Committee decided to re-examine these provisions and in consultation with all political parties, consider amendments aimed at replacing corporal punishment, FIRs, and imprisonment with stricter financial penalties and possible license suspensions.\nA Calling Attention Notice moved by the MNA Syed Waseem Hussain regarding the presence of two toll plazas within a 5-kilometer stretch on the M-9 Motorway, which contradicts the existing policy that mandates a minimum distance of 35 kilometers between toll plazas.\nThe National Highway Authority (NHA) responded that a major bridge is located at that point, and under current policy, toll plazas are permitted at each major bridge regardless of the distance. The Committee directed the NHA to submit a comprehensive list of all bridges that have toll plazas installed.\nThe Member also asked the NHA to extend the same toll exemption to residents of Hyderabad District for daily vehicle use as is currently provided to residents of Jamshoro. Additionally, concerns were raised over the poor condition of the bridge in question, despite the collection of tolls and revenue. The Committee instructed the NHA to conduct an inquiry into the state of the bridge and present a detailed report, including photographs and videos, at the next meeting. The NHA was also asked to propose a viable solution during the upcoming session.\nThe Committee was also informed that Karachi Northern Bypass will be part of the M-10 project, which will resolve the congestion of Karachi city once for all.\nFurther, the Committee decided to write to the Senate Standing Committee on Communications, requesting the findings of its Sub-Committee regarding how the contractor previously disqualified and terminated by the NHA was able to secure a major contract valued at Rs. 166 billion under the CAREC Tranche-III project. The NHA was also directed to provide an update on the matter at the next meeting.\nThe meeting was attended by Members of the Standing Committee, including Sardar Muhammad Yaqoob Khan Nasar, Haji Jamal Shah Kakar, Mr. Shamsher Ali Mazari, Dr. Darshan, Mir Shabbir Ali Bijarani, Mr. Nazir Ahmed Bhugio, Mr. Mehboob Shah, Mr. Muhammad Azhar Khan Laghari, Syed Ayaz Ali Shah Sheerazi, Mr. Ramesh Lal (Zoom), Mr. Ali Khan Jadoon, Mr. Fiaz Hussain, Mr. Muhammad Usman Badini, and Mr. Hameed Hussain, all MNAs. Syed Waseem Hussain, MNA and mover of the Calling Attention Notice, also participated. Senior officials from the Ministry of Communications and representatives from affiliated departments were present as well.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:24:36.728Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/m-6-sukkur-hyderabad-project-set-to-begin-in-april-2026-na-body-told/",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T17:01:00.000Z"
}
