{
  "title": "Through narrative, diplomatic front Pakistan proved its desire for peace not weakness: Tarar",
  "author": null,
  "content": "ISLAMABAD, Jul 31 (APP):Federal Minister for Information and Broadcasting Attaullah Tarar said on Thursday that on the narrative and diplomatic front,  Pakistan established that its desire for peace must not and should not be mistaken for its weakness.\n” The response given (to unprovoked Indian aggression) by our Armed Forces, valiant soldiers, has proven our military might to India. (It proved) that we are capable of a befitting response to any unprovoked aggression “, he said while delivering his speech as chief guest at the policy dialogue of the Institute of Regional Studies titled, “Building Peace in South Asia.”  He said Pakistan has always been desirous of peace in the region, and it has always contributed towards peacebuilding in the region.\n“The deterioration that we see in the region was directly in proportion to the rise of fundamentalism and extremism in India”, he said, adding that the way Hindutva ideology was propagated in the power corridors in India was the greatest threat to peace in the region.\nThe minister said Pakistan had always proved that if an unprovoked and unjustified war was imposed on it, Pakistan had the capability and the potential to respond back effectively. “I think the deterrence that we have created in the region has contributed to maintaining peace “, he remarked.\nTarar said  India had assumed the position of a bully in this region, and India was behind the surge in terrorism in Pakistan during the past few years. He said when the Pahalgam incident happened, on the narrative front, Pakistan was facing a challenge. The biggest argument that Pakistan had was that it was the biggest victim of terrorism, and how can a nation victim of this scourge be involved in terrorism.\nPakistanis rendered matchless sacrifices in the war against terrorism as armed forces, security forces, and civilians embraced martyrdom while fighting against terrorism. He said Pakistan was a shield, a wall between terrorists and the rest of the world. He said that when the Pahalgam incident happened,  baseless allegations were leveled by the Indian government, pointing fingers towards Pakistan.\nTarar said it was a diplomatic master stroke when Prime Minister Shehbaz Sharif at Kakul academy offered an investigation into the Pahalgam incident, but India, instead of responding positively, fanned war hysteria and war mongering.\nThe minister said that Pakistan’s allies and the countries having a say in the whole crisis sided with Islamabad’s narrative due to the best diplomatic move by its leadership. He said that on the contrary e questions were asked in India and Modi has never been on a weaker footing than he was now because the civil society in India, the media, the intelligentsia, the opposition members alike were all questioning his policies.\nHe said when India attacked innocent civilians, national and international media representatives were taken to Bela Noor Shah near the Line of Control to negate  Indian propaganda of terrorist camps there.\nSimilarly, media teams were also to be sent to Mureedke and Bahawalpur, but India had attacked the night before that visit.\nHe said that in a post-war scenario, Pakistan wanted peace, but all disputes, including the Kashmir issue should be solved through dialogue. He said that the Kashmir dispute once again has been highlighted as President Trump said he would play his role to resolve it.\nThe minister said Pakistan had always proved that if an unprovoked and unjustified war was imposed on it, Pakistan had the capability and the potential to respond back effectively. ” I think the deterrence that we have created in the region has contributed to maintaining peace “, he remarked.\n” The response given by our Armed Forces,  valiant soldiers, has proven our military might to India. (It proved) that we are capable of a befitting response to any unprovoked aggression “.\nHe said that the whole idea behind the Pehalgam incident was to weaponise water and it conspired to manipulate Indus Water Treaty. He said how is it possible that a treaty, a legally binding document, be suspended and held in abeyance unilaterally without the consent of the other party. He said that water was the lifeline of the 240 million people of Pakistan and no compromise will be made on the water issue.\nTarar suggested that the IRS president should publish a paper after this policy dialogue so that it could be forwarded to the PM for implementation of its recommendations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:26:30.463Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/through-narrative-diplomatic-front-pakistan-proved-its-desire-for-peace-not-weakness-tarar/",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T10:00:00.000Z"
}
