{
  "title": "Pakistan, Morocco mark ‘Enthronement Day’ with calls for more collaboration in key sectors",
  "author": null,
  "content": "ISLAMABAD, Jul 31 (APP): The Centre for Afghanistan, Middle East and Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with the Pakistan Africa Institute for Development and Research (PAIDAR), on Thursday organized an event to commemorate Morocco’s ‘Enthronement Day’.\nThe event, hosted at the ISSI, was graced by dignitaries and diplomats, including Ambassador Sohail Mahmood, Director General ISSI; Ambassador Mohammed Karmoune, Dean of the African Diplomatic Corps and Ambassador of Morocco to Pakistan; Ambassador Syed Adil Gilani, Ambassador of Pakistan to Morocco; and Ambassador Khalid Mahmood, Chairman BoG ISSI, said a press release.\nThe Chief Guest on the occasion was Mushahid Hussain Sayed, President PAIDAR, and the Keynote Speaker was Ambassador Hamid Asghar Khan, Additional Foreign Secretary (Africa), Ministry of Foreign Affairs Pakistan (MOFA).\nDirector of CAMEA, Amina Khan moderated the proceedings, which kicked off with the national anthems of both countries.\nSpeaking on the occasion, Senator Mushahid Hussain Sayed, highlighted the historical context of Pakistan-Morocco relations, recalling Pakistan’s support for Morocco during its struggle against colonial rule. He shared how prominent Moroccan leader Ahmed Balafrej was granted Pakistani passport and how Pakistan’s then Foreign Minister, Sir Zafarullah Khan, facilitated him to present Morocco’s case at the United Nations. He also noted Morocco’s rich civilizational heritage, referring to the world’s oldest University in Fez and the legendary 14th-century traveler Ibn Battuta.\nMushahid Hussain Sayed commended the warmth and affection of the Moroccan people and underscored the importance of close collaboration between Pakistan and Morocco to further reinforce the enduring bonds between the two peoples.\nAmbassador Sohail Mahmood, in his remarks, said that over the past 26 years, under His Majesty King Mohammed VI’s wise and dynamic leadership, Morocco has been on a journey of forward-looking and systematic reform leading to remarkable renewal and progress.\nHe noted that the Kingdom has made impressive strides in people-centered governance, infrastructural transformation, industrial diversification, green transition and innovation, social inclusion, human development especially youth empowerment, and active global engagement. At the same time, Morocco has remained firmly rooted in its civilizational heritage and continued to promote inter-faith dialogue, mutual understanding, and peaceful coexistence.\nHe expressed that Pakistan and Morocco’s partnership, rooted in mutual respect and shared goals, continues to strengthen, particularly through cooperation in the fields of governance, trade, and cultural exchange.\nAmbassador Karmoune outlined Morocco’s impressive economic and social strides despite global challenges, inviting Pakistani investors to explore opportunities in Morocco’s large-scale development projects. He stressed that the two countries should collaborate even more closely, especially as high-level meetings are scheduled to unlock further avenues for cooperation.\nAmbassador Hamid Asghar Khan lauded Morocco’s successful infrastructure, dynamic foreign policy, and hospitable environment, noting the country’s appeal as a global tourist destination. He added that tourism brings 17.5 million visitors annually and contributes 14% to the GDP. He stressed the importance of continuing to build on the warm ties between Pakistan and Morocco, particularly as Morocco takes a leading role not only regionally but on the continental stage.\nMs. Amina Khan reflected on the deep cultural affinity between the two nations, stating that Morocco is a key partner for Pakistan in its engagement with Africa. She highlighted the significant potential for collaboration in sectors such as higher education, renewable energy, agriculture, and climate resilience.\nAmbassador Syed Adil Gillani, while expressing his views, said that Morocco is an example of prosperity and development with landmark achievements in various fields like governance. He further said that Morocco is a global leader in sustainable development, with access to good health care and education.\nAmbassador Khalid Mahmood, Chairman of the ISSI Board of Governors, wrapped up the event by reiterating the importance of the exemplary friendship between Pakistan and Morocco, noting Morocco’s strategic location as a gateway to international markets.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:25:35.594Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-morocco-mark-enthronement-day-with-calls-for-more-collaboration-in-key-sectors/",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T13:53:00.000Z"
}
