{
  "title": "Biden’s India visit uncertain after US foils murder plot of Sikh leader",
  "link": "https://www.app.com.pk/national/bidens-india-visit-uncertain-after-us-foils-murder-plot-of-sikh-leader/",
  "date_published": "2023-12-13T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP):US President Joe Biden is unlikely to visit India to attend its Republic Day celebrations and Quad Leaders Summit in January next year amidst differences after the US authorities foiled India’s plot to murder a Sikh leader on its soil.\nIndian Prime Minister Narendra Modi had invited Biden to be the chief guest for India’s Republic Day celebrations on January 26. India also extended the invitation to the US president for the Quad Leaders Summit, according to the media reports.\nHowever, in November the United States said that it had thwarted a plot to kill pro-Khalistan leader Gurpatwant Singh Pannun on its soil. The US raised concerns with New Delhi that the Indian government may have known about the plot.\nThe highly unlikely visit of President Biden is being dubbed as the consequence of the widening intelligence network and murder plots by the Indian government in other countries.\nOn one hand, India pretends to be the ally of the Western powers but on the other, it hatches conspiracies to kill its unwanted individuals on foreign soils. Such conspiracies have made India lose the trust of the erstwhile Western allies.\nFollowing the development, the Indian authorities are working to revise the dates for the Quad Summit – a diplomatic group of the US, India, Japan and Australia.\nIn September, Canada said that it was “actively pursuing credible allegations” linking the Indian government agents to the murder of Sikh leader Hardeep Singh Nijjar in British Columbia in June.\nPrime Minister Justin Trudeau had said that any involvement of a foreign government in the killing of a Canadian citizen was “an unacceptable violation of our sovereignty”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:00:13.733Z"
}
