{
  "title": "Pakistan’s huge scope of sports tourism needs regulation, infrastructure facilities: President",
  "link": "https://www.app.com.pk/national/pakistans-huge-scope-of-sports-tourism-needs-regulation-infrastructure-facilities-president/",
  "date_published": "2023-12-13T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): President Dr Arif Alvi on Wednesday said Pakistan had immense potential for sports and adventure tourism, however stressed effective regulation and improved infrastructure to explore the untapped sector.\nAddressing the concluding ceremony of the third Sustainable Mountain Sports Tourism Conference, he said the provision of facilities was the top factor in the development of domestic and sports tourism.\nThe event themed ‘Revival of Mountain Glory’ was organized by the Alpine Club of Pakistan and gathered the country’s renowned mountaineers including Samina Baig, Naila Kiani, and Sajid Sadpara among others who won titles by scaling the highest peaks of the world.\nPresident Alvi said Pakistan was blessed with incredibly serene natural beauty, particularly its northern areas where the mountains and snowy peaks were a big source of attraction for tourists and trekkers.\nHe mentioned that the country’s scenic Malam Jabba and Naltar areas offered amazing skiing facilities and had huge potential for adventure sports. Also, the Hunza Valley has the world’s best treks amidst the gigantic mountains of Karakoram, he added.\nThe president, however, stressed the need to put in place a tourist regulatory mechanism to promote domestic tourism.\nHe emphasized ensuring facilities for tourists such as easy access to destinations, better roads, clean hotels and guest rooms, and trained human resources.\nHe pointed out that the unregulated influx of tourists caused nuisance of traffic jams and disruption of the civic system. In this regard, he proposed proper management and development of new tourist destinations to shift the quantum of visitors.\nThe president also called for raising consciousness among the general public to be kind towards the environment while exploring tourist places.\nHe termed security and a peaceful environment significant factors in promoting tourist activities in the country.\nPatron Alpine Club of Pakistan Air Vice Marshal (retd) Ijaz Malik said Pakistan being the home of the highest mountain peaks and glaciers outside the Arctic region had great scope for adventure and mountain tourism.\nHe outlined the outcome of the sports tourism conference which stressed the need for formulating a policy on domestic tourism to accrue economic benefits, introducing tourism as a subject in the national curriculum, and training human resources with contemporary skills.\nPresident Alpine Club of Pakistan Abu Zafar Sadiq said the organization was playing its role in promoting sports tourism in the country through rock and sport climbing, hiking, and trekking. The other activities in collaboration with partners included winter sports, paragliding, mountain biking, and rafting, he said.\nPresident Alvi on the occasion gave away recognition shields to the mountaineers, trekkers, and officials of the Alpine Club.",
  "retrievedAt": "2025-08-11T11:00:34.528Z"
}
