{
  "title": "Migrating Afghan population’s vaccination to be ensured",
  "link": "https://www.app.com.pk/national/migrating-afghan-populations-vaccination-to-be-ensured/",
  "date_published": "2023-12-13T15:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): The inter-ministerial meeting agreed on a mechanism to ensure vaccination of all age population at Afghan repatriation centers and international regular border posts.\nThis was decided in an important inter-ministerial meeting held under the joint chairmanship of Secretary, Ministry of National Health Services, Regulations and Coordination and Secretary, Ministry of Interior to review the vaccination status of Afghan migrating population.\nThe meeting was held in the backdrop of the directives issued by the prime minister to ensure vaccination of all eligible population to minimize the risk of poliovirus spread.\nIt was attended by Director General Health, high ranked officials from Ministry of Interior including Additional Secretary- Interior, Director General immigrations and Passport, representatives of NADRA, Border Health Services, Federal Directorate of Immunization, Polio Program, donor agencies and implementing partner organisations.\nThe meeting was apprised by the Polio Program on the vaccination data at the voluntary Repatriation Centres, (six in Balochistan, two in KP and three in Islamabad) highlighting that 39 vaccination teams and 14 supervisors have been deployed for the purpose. The teams have managed to vaccinate 24,335 children since the start of the repatriation process.\nIn addition to the repatriation centres, permanent transit points (PTPs) at international borders also vaccinated travelers up to all age groups.\nThe forum was told that instructions have been issued by the Ministry of Interior to relevant authorities in all provinces and Gilgit Baltistan to ensure compliance to the directive of the prime minister to facilitate and ensure polio vaccination at borders exit crossing points.\nThe leadership of both ministries agreed that the Polio Program to synchronize their permanent polio transit points with all international border crossings to make sure no child is left behind.\nThe NADRA was also assigned to ensure registration of all age Afghan population at Voluntary Repatriation Centres and digitize the information to support Polio vaccination.\nThe officials of the Border Health Services were tasked to support the polio teams deployed at airports and land ports to ensure vaccinations of eligible population.\nThe meeting also highlighted the important aspect in addition to international borders, the inter-provincial movement that is also a risk factor in poliovirus circulation and demanded strengthening of the polio teams deputed at the inter-provincial permanent transit points.\nThe meeting advised WHO to share a list of countries where certification to vaccination is required so that the country ensures compliance with the international guideline for international health regulations.",
  "retrievedAt": "2025-08-11T10:59:53.704Z"
}
