{
  "title": "Team Europe signs strategic agreement to address climate challenges in Punjab",
  "link": "https://www.app.com.pk/national/team-europe-signs-strategic-agreement-to-address-climate-challenges-in-punjab/",
  "date_published": "2023-12-13T11:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): As a part of the Team Europe Initiative ‘Building Back Better through Green Jobs Creation,’ combining support from the European Union (EU), Germany, France and Italy, the EU and the Agence Française de Développement (AfD) on Wednesday signed an agreement to spearhead a new climate initiative in urban centres of Punjab.\nThe joint effort by the Government of Pakistan and Team Europe partners will allocate €179 million to tackle urgent water and sanitation service delivery challenges in Faisalabad and Lahore, while strengthening climate resilience, a news release said.\nThe collaborative initiative, entitled ‘Punjab Urban Water and Wastewater Governance and Services Improvement,’ spans six years and blends grant support from the EU and a soft loan from the AfD. The agreement has been signed by EU Ambassador Dr. Riina Kionka and Deputy Director AfD Eastern Europe, Middle East, and Asia, Ms. Julie Marsaudon, in the presence of German Ambassador Alfred Grannas and Italian Ambassador Andreas Ferrarese.\nAcknowledging Punjab’s pivotal economic role in contributing 54% of Pakistan’s GDP, EU Ambassador Dr. Riina Kionka highlighted persistent water and sanitation challenges. She underscored the EU’s commitment to support Pakistan in improving resilience to climate change and the EU’s readiness to redouble efforts to support the country’s green inclusive growth, a priority under the EU Pakistan Strategic Engagement Plan and also for EU assistance to the country.\nShe further discussed the EU’s role as the world’s leading contributor to international climate finance, emitting about 9% of greenhouse gases but contributing some 30% of global public financing.\nThe French Ambassador’s representative noted that the fight against climate change was a top priority for France. Since the Geneva Conference on a “Resilient Pakistan” on January 9, 2023, France has committed to strengthening its cooperation on climate change: today, some 97% of AFD financing also benefits the climate. The partnership with the EU on water and sanitation is an example of this priority; it will mobilise expertise towards climate-resilient solutions in the water and sanitation sectors.\nThe project aims to improve access to drinking water and sanitation services by installing 200 kilometres of new water supply pipes and providing 55,000 new connections. It focuses on enhancing capacities, increasing water treatment capacity by 135,000 cubic meters per day and bolstering urban water governance.\nThe initiative will improve the access of 400,000 individuals to drinking water. This joint intervention underscores the joint commitment of the Government of Pakistan and Team Europe to sustainable development, marking a crucial step towards building climate resilience and ensuring a better quality of life for people and businesses in Faisalabad and Lahore.",
  "retrievedAt": "2025-08-11T11:00:25.622Z"
}
