{
  "title": "‘We need to promote Arabic literature in Pakistan’ says Madad Ali Sindhi",
  "link": "https://www.app.com.pk/national/we-need-to-promote-arabic-literature-in-pakistan-says-madad-ali-sindhi/",
  "date_published": "2023-12-13T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Federal Minister for Education and Professional Training, Madad Ali Sindhi on Wednesday said that we need to promote Arabic literature in Pakistan.\nHe said this while addressing the opening session of the two-day international conference on “Modern Trends of the Arabic Novel in the Second Half of the Twentieth Century”, at Allama Iqbal Open University (AIOU).\nThe minister said, “Learning Arabic is considered essential for every Muslim. In Pakistan, there is a need to promote Arabic literature. This conference is on a unique and most important topic.”\n“I congratulate the vice chancellor and the entire team, and I am grateful for the invitation to participate in this conference,” he added.\nThe Department of Arabic at AIOU is organizing a conference, with the participation of 13 scholars from Iraq, Saudi Arabia, Morocco, Egypt, Jordan, Thailand, Malaysia, Oman, Algeria, Nigeria and Syria in person, and 15 international scholars joining the conference online.\nOn the occasion, the minister emphasized the importance of this unique conference, as the people are not familiar with the modern Arabic novel.\nVice Chancellor AIOU, Prof. Dr. Nasir Mahmood, expressed his gratitude to the Federal Minister, Madad Ali Sindhi, for attending the conference as the chief guest.\nHe also mentioned that Islamic scholars from all over the world are participating in the conference and presenting their research papers, which will provide a real picture of Arab society.\nDr. Nasir said that the presence of foreign scholars at the conference would be beneficial for the promotion of Arabic literature. He believes that Arabs have a unique history and their language is very broad, which allows the Arab society to relate to its civilization and culture.\nDr. Habibur Rahman Asim, Faculty of Arabic Language, International Islamic University, Dean Faculty of Arabic and Islamic Studies at AIOU, Prof. Dr. Mohyuddin Hashmi and Chairman, Department of Arabic, Dr. Abdul Majeed Baghdadi also addressed the opening session.\nThe two-day international conference will consist of parallel sessions on both days, and a closing ceremony is scheduled on Thursday.",
  "retrievedAt": "2025-08-11T11:00:26.245Z"
}
