{
  "title": "PM Shehbaz inaugurates modernized Geoscience Laboratories to boost Pakistan’s mineral sector",
  "author": null,
  "content": "ISLAMABAD, Oct 17 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday inaugurated the upgraded Geoscience Advanced Research Laboratories (GARL) of the Geological Survey of Pakistan (GSP), marking a major milestone in advancing the country’s mineral research and exploration capabilities.\nThe inauguration ceremony, held at the revitalized GARL complex in Chak Shehzad, was attended by Chief of Army Staff Field Marshal Syed Asim Munir, federal ministers, and distinguished foreign dignitaries, a Prime Minister’s Office news release said.\nSpeaking on the occasion, Prime Minister Shehbaz Sharif said the modernization of the laboratory represented a significant stride toward realizing Pakistan’s vast mineral potential through scientific innovation and global collaboration. He said the government was committed to equipping national institutions with the latest technology to ensure sustainable and internationally competitive development in the mineral sector.\nEstablished in 1991, the facility has now been comprehensively upgraded to meet international standards and has earned ISO/IEC 17025 accreditation, certifying its technical competence for testing and calibration according to globally recognized benchmarks.\nThe upgraded laboratories will now produce analytical data compliant with international reporting standards such as JORC and NI 43-101, enabling mining companies to conduct accurate reserve estimations and attract global investment.\nOfficials from the Geological Survey of Pakistan said the laboratory’s accreditation would significantly enhance investor confidence by providing reliable and verifiable data required by international mining companies and financial institutions for large-scale projects.\nBuilding on over three decades of legacy, the modernized GARL complex is now poised to serve as a state-of-the-art hub for mineral research, exploration, and development reflecting Pakistan’s renewed focus on harnessing its natural resource wealth for national progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-20T18:05:27.748Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-shehbaz-inaugurates-modernized-geoscience-laboratories-to-boost-pakistans-mineral-sector/",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T17:27:00.000Z"
}
