{
  "title": "KP CM’s absence from key meeting reflects lack of interest in public issues: Ikhtiar Wali Khan",
  "author": null,
  "content": "ISLAMABAD, Oct 17 (APP):Prime Minister’s (PM) Coordinator on Information for Khyber Pakhtunkhwa (KP) affairs, Ikhtiar Wali Khan, expressed Friday, serious concern over the absence of KP Chief Minister (CM), Sohail Afridi from a high-level national meeting aimed at addressing critical provincial and national issues.\nSpeaking to the media, he said that the meeting was called by Prime Minister, attended by the Chief Minister’s of all four provinces, including Gilgit-Baltistan and the Prime Minister of Azad Jammu and Kashmir.\n“Everyone attended — except for the KP Chief Minister, Sohail Afridi — despite the fact that he was in Islamabad at the time,” he noted.\nHe emphasized that the meeting’s agenda included urgent matters such as the worsening wheat and flour crisis in KP, flood-related damages, and the repatriation of Afghan refugees.\n“The first item on the agenda was to assess and resolve the wheat and flour shortage in specially in KP,” he said.\nHe further explained that the second agenda point focused on evaluating flood damages across the country and formulating a national response policy. The third and final item, he added, was to present a unified national policy on the repatriation of Afghan refugees. He warned that such disregard from the KP leadership could directly harm the people of the province.\n“If KP continues to suffer from wheat shortages or is left out of flood relief and international aid, the responsibility will lie squarely with the provincial government led by Sohail Afridi and his party,” he cautioned. He urged the KP government to take its responsibilities seriously and to collaborate with the federal government in addressing the needs of its citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-20T18:05:27.266Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kp-cms-absence-from-key-meeting-reflects-lack-of-interest-in-public-issues-ikhtiar-wali-khan/",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T17:33:00.000Z"
}
