{
  "title": "IAEA Regional Training Course concludes at NIAB",
  "author": null,
  "content": "ISLAMABAD, Oct 17 (APP): Regional Training Course (RTC) on agriculture came to a close on a high note at Nuclear Institute for Agriculture and Biology (NIAB), a leading research institution of Pakistan Atomic Energy Commission (PAEC) here on Friday.\nThe RTC, which commenced on October 06 at NIAB, Faisalabad was titled “Advanced Mutation Breeding Techniques for the Improvement of Nutritional Quality.”\nOrganized under the framework of the IAEA technical cooperation project RAS5101, the training course brought together 30 participants from 14 member states of the Agency, including Bangladesh, Cambodia, China, Fiji, Indonesia, Lao PDR, Malaysia, Mongolia, Myanmar, Nepal, Philippines, Sri Lanka, Thailand and Vietnam besides Pakistan. Whereas two IAEA experts, one from China and another from Bulgaria, also took part.\nAddressing the concluding ceremony as Chief Guest, Prof Dr Muhammad Youssef Saleem, Director General, Agriculture & Biotechnology, PAEC, congratulated IAEA, NIAB and the participants for making the interactive training course successful.\nHe said, “Pakistan’s population is increasing at a fast rate and while the country is blessed with diverse landscapes and a varied climate, it is severely affected by the impacts of climate change and natural calamities.\nWe have to adapt to climate change and its impacts. This is not only true for Pakistan but also the region. To face this common challenge, we have to share our knowledge and expertise.\nThe most serious issue we face is health-related stemming from malnutrition also affects our livestock. Depletion of water sources and pollutants are posing another serious problem. Emergence of new pathogens has further added to these challenges. Mutation breeding offers solutions to these diverse challenges as we can solve these problems by changing the genetic architecture of organisms.\nWe also need to shift our dietary habits. We have to utilize pulses, cereals and mushrooms to fulfil our dietary and nutritional requirements.”\nHe shared with the gathering that Pakistan is an active member of Codex Alimentarius Commission (CAC), an international body that establishes food standards to protect consumer health and ensure fair trade practices.\nProf Dr Muhammad Youssef Saleem further said, “In the next 25 years, the world will need new pharmaceuticals, medicines and foods for which bio-diversification and use of mutation is need of the hour. We need to change research modalities by adopting proactive and cumulative need-based strategies as a ray of hope for attaining food security since there can be no food security without food safety.”\nHe added, “PAEC  is striving hard to achieve this goal and Pakistan is ready to cooperate with all countries of the world through the IAEA program.”\nEarlier, Dr Uzma Maqbool, Director NIAB, said, “As we conclude the RTC, I have a feeling that we have done something commendable by sharing insightful knowledge and expertise.\nPakistan has a long history of collaboration with the IAEA for promoting sustainable agriculture. This collaboration is now bearing fruit for the Asia Pacific region, aptly termed ‘food basket’ of the world.”\nDirector NIAB further said, “We are committed to foster this culture of sharing and collaboration under the aegis of IAEA, for healthier and more resilient crops and a world free from the menace of malnutrition and food insecurity.”\nOn this occasion, Dr Zia-ul-Qamar, the Course Director from NIAB said, “I would like to thank you all for the active participation in the course which resulted in gaining valuable\nhands-on-experience. The RTC was very helpful in grooming technical skills of all stakeholders and building enduring relationships that will go a long way.”\nDr Kai Wang, the IAEA expert from China, commended Pakistan’s consistent role in supporting regional capacity building.\nThe training course featured interactive sessions, laboratory demonstrations, and field visits.\nThe participants showed great interest in these activities.It is pertinent to mention here that NIAB is a designated IAEA Collaborating Centre in Food and Agriculture, recognized for its outstanding contributions to nuclear applications in crop improvement, soil management, and plant nutrition.\nThis is the third IAEA regional training course organised by the Govt. of Pakistan through PAEC’s premier agriculture research center, NIAB in 2025.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-20T18:06:58.833Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/iaea-regional-training-course-concludes-at-niab/",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T21:27:00.000Z"
}
