{
  "title": "Two-day Islamabad Symposium 2025 concludes at NUST",
  "author": null,
  "content": "ISLAMABAD, Oct 17 (APP): The two-day Islamabad Symposium 2025, themed “Balancing Relationship Between Global North and Global South: Challenges and Opportunities,” concluded at the National University of Science and Technology (NUST) main campus on Friday.\nThe symposium offered unique deliberations over diverse subjects, such as the present-day regional and global issues, particularly conflicts and wars, the need for technological advancement and accessibility, climate change preparedness, iron-clad relations of Pakistan and China, and the need for accountability measures for the rogue states promoting an utter disregard for international law.\nSpeaking at the closing session, Rector NUST, Dr Muhammad Zahid Latif, thanked the esteemed speakers and audience, and complimented NUST Institute of Policy Studies (NIPS) for their efforts to organise the event at the university.\nHe shared the NUST vision of nurturing young minds into competent and responsible citizens, and developing partnerships through knowledge diplomacy and collaborations.\nThe chief guest of the closing ceremony, General Sahir Shamshad Mirza, NI, NI (M), Chairman Joint Chiefs of Staff Committee, noted that global affairs are now more complex than ever.\nHe highlighted that Pakistan shares the spirit of multilateralism and equality, evidenced by its repeated calls for peace, responsible conduct, and dialogue. Talking to young scholars, he emphasised the role of academia and appreciated NUST for the success of the Islamabad Symposium 2025.\nDr Atia Ali Kazmi, President Global Peace Strategy Forum, masterfully chaired the symposium’s last plenary session titled “From Challenges to Solutions: Roadmap for a More Inclusive and Sustainable Global Order.”\nShe succinctly discussed the plethora of issues raised in the previous plenaries and reiterated that united action and shared will are the building blocks for creating a road to an inclusive and sustainable world order.\nMr Victor Gao, Vice President, Center for China and Globalization, echoed the tale of decades of unequal exchange between the Global North and South, and emphasised the importance of inclusive cooperation to alleviate the fault lines that divide the world into two blocs and hinder global unity.\nPer Albert Ilsaas, Ambassador of the Kingdom of Norway to Pakistan, elucidated that contemporary times require multilateralism with greater urgency than ever.\nAmbassador Naghmana Hashmi reiterated the significance of pragmatic diplomacy, citing the Iran nuclear deal, the ceasefire efforts between Israel and Hamas, as well as the diplomatic efforts to stop the four-day conflict between India and Pakistan.\nAnother speaker, Dr Shahid Mahmud, Senior Advisor OIC COMSTECH & CEO and Chairman Interactive Group of Companies, highlighted the limited representation of the Global South in the AI domain, underscoring greater fairness in AI advancement for global prosperity.\nEarlier on the first day of the symposium, Federal Minister for Defence, Mr Khawaja Muhammad Asif (NI) graced the inaugural session as chief guest.\nBesides the plenary sessions, the first day featured the launch of the book: Pakistan’s Search for Peace with Afghanistan: Statecraft, Policy, and Strategy by Dr Muhammad Zahid Latif. The Defence Minister, Khawaja Asif congratulated the author on his impeccable work and expertise on the subject, noting that the book offers an original take on the current and future trajectory of Pakistan-Afghanistan relations, providing insightful pointers for the peaceful coexistence of the two neighbors.\nAnother book, Domestic Politics and Foreign Policy: A Case Study of Pakistan-India Relations, by Dr Arshad Mahmood, was launched on the second day of the Islamabad Symposium.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-20T18:05:22.054Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/two-day-islamabad-symposium-2025-concludes-at-nust/",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T18:36:00.000Z"
}
