{
  "title": "No laxity, compromise on anti-smuggling operation: PM",
  "link": "https://www.app.com.pk/national/no-laxity-compromise-on-anti-smuggling-operation-pm/",
  "date_published": "2020-05-14T06:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):Prime Minister Imran Khan Thursday resolved that the government would neither show any laxity nor make any compromise in its ongoing operation against smuggling owing to its two-pronged adverse economic impacts.\nChairing a meeting to discuss the anti-smuggling measures and prices of daily use items, the prime minister said the smuggling was bane to the national economy for causing food insecurity and inflicting irreparable loss to the local industry, a PM Office statement said.\nIndustries Minister Hammad Azhar, National Food Security Minister Fakhar Imam, Finance Advisor Abdul Hafeez Shaikh, Commerce Advisor Abdul Razzak Dawood, federal secretaries of interior, finance and food security, FBR Chairman, provincial chief secretaries, home secretaries and IG police attended the meeting.\nThe meeting was told that an ordinance had been promulgated to further strengthen the existing anti-smuggling law and strictly handle the elements involved in smuggling of currency and essential items.\nMoreover, the law enforcement agencies (LEAs) have been empowered to act against smugglers at the airports as well as within five kilometers of the borders. The LEAs have also been given the powers to take such people into custody. Moreover, the ordinance would ensure a better coordination among the district administration, custom officials, secret agencies and LEAs.\nThe chairman FBR and provincial chief secretaries apprised the meeting on the measures taken so far for enforcement of anti-smuggling ordinance.\nThe prime minister directed all the departments concerned to submit fortnightly report on the actions against smuggling and the people involved in the offense.\nThe provincial chief secretaries briefed the prime minister about the wheat crop and harvesting, prices of the essential commodities and the steps taken to reduce their rates.\nThe provincial governments also presented a report to prime minister on action against the hoarders and profiteers.\nThe prime minister directed the provincial administrations to pass on the impact of the reduced oil prices to the masses for providing them relief.",
  "retrievedAt": "2025-08-11T19:12:59.668Z"
}
