{
  "title": "India destines to lose war in Kashmir: AJK President",
  "link": "https://www.app.com.pk/national/india-destines-to-lose-war-in-kashmir-ajk-president/",
  "date_published": "2020-05-14T01:17:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): May 14 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan while strongly condemning the brutal killing Pir Merajuddin Shah at the hands of occupying Indian forces in Indian-held Jammu and Kashmir, said , on Thursday, that the aggravation of the Indian Army was a proof that Delhi has lost its war in the disputed State.\n“I condemn the murder of Peer Mehrajudin in cold blood by occupation forces for crossing a checkpoint. I also condemn the use of brute force, including, pellet guns, against the demonstrators protesting the gruesome murder, Masood Khan said.\nReacting over the latest killing in IOK on Thursday, he said: “India cannot keep Kashmiris enslaved at gunpoint for a long time because a majority of the people of the occupied region are now totally alienated from New Delhi.”\nAJK president said that on one hand, the international community including Pakistan and Azad Kashmir are fighting coronavirus while on the other, the occupation army was busy in massacring defenceless and innocent Kashmiri people, and Merajuddin’s killing on Srinagar-Gulmarg Highway is its latest example.\nHe said that such happenings are proof that occupied Kashmir has become a battlefield where the sanctity of precious human lives has ceased to exist. The people of occupied Kashmir are undergoing double lockdown – the first which had started on August 5, 2019, and the other after the outbreak of coronavirus.\nHe added that the entire world was enforcing lockdown to protect human lives but occupied Kashmir is the only region in the world where the people are being killed under the garb of lockdown.\nThe president said that under the cover of COVID-19 pandemic, in the dead of night, stealthily, on April 2, 2020, while the whole world was preoccupied with Coronavirus, the BJP-RSS regime unveiled an evil plan called the new domicile rules to usurp the livelihoods, land and businesses from the people of IOJ&K. This all was done without the consent of the people. It was a decree that emanated from New Delhi.\nEarlier in an article written for Halal Magazine of Pak Army, AJK President stated that the fascist regime rolled the dice last year when it abrogated Article 35A of its own Constitution, which recognised the established rights of the people of the occupied state to permanent residence, acquisition of property, jobs and seats and scholarships in educational institutions. These rights predated the Indian occupation of the state in 1947, he asserted.\nSardar Masood Khan went on to say that new domicile rules will give domicile to anybody who has lived in the occupied territory for 15 years, has studied there for seven years or has appeared in the 10th or 12th class examinations.\nThus, they open doors for Hindus from all over India. First the military officers and civil servants, overwhelmingly Hindus, who have served in IOJ&K, as well as their families and children would have the right to get domiciles. Then hundreds of thousands of Hindu refugees and migrant workers, not from Jammu and Kashmir, would qualify.\nThe state President said this will pave the way for land grab — attachment of Kashmiri properties and fertile farmland as well as plundering of Kashmir’s forests and biodiverse habitats. Non-natives will expropriate large tracts of land for RSS operatives and Indian enterprises. This move is a lever for the saffronisation of Jammu and Kashmir.\nKhan said that the Indian forces deployed in occupied Kashmir consider themselves above law and believe that they have got the license to operate and kill any civilian with impunity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:13:04.615Z"
}
