{
  "title": "Railways to install 2000 fire extinguisher in trains",
  "link": "https://www.app.com.pk/national/railways-to-install-2000-fire-extinguisher-in-trains/",
  "date_published": "2020-05-13T23:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):Pakistan Railways was planning to install as many 2,000 fire extinguishers in the trains to ensure safety of passengers.\nThe process of procurements would be made after the availability of funds, an official in the Ministry of Railways told APP.\nHe said that Pakistan Railways had suffered over Rs410million in terms of losses in various train accidents in between August 2018 to till date.\nAbout the casualties and injured persons, he said that five major train accidents of passenger and good trains occurred during the said period in which 110 persons died and 123 injured.\nPakistan Railways was going to revamp and upgrade the existing railway infrastructure through the Main Line-I project of China-Pak Economic Corridor (CPEC) which would transform the overall organization and ensure the safety of the traveling public, he said.\nBesides, he said the department was taking several measures to prevent accidents in the future including up-gradation of 550 vulnerable unmanned level crossings throughout Pakistan Railways network in collaboration with the respective provincial governments.\nHe said the Directorate of Public Relations has circulated different video messages over social media for the awareness and information of the general public regarding crossing the railway crossings in a safe way.\nThe official said the conversion of old age kerosene oil-based signals with LED’s on mainline, which have better visibility. Training and refresher courses were being conducted regularly at the Pakistan Railway Academy Lahore.\nHe said that regular inspections in accordance with prescribed standards and quota were conducted by the officers and officials of Pakistan Railways to maintain safety standards. This process was being constantly monitored at appropriate levels.\nSpecial bulletins and instructions were issued regularly for the guidance of staff. Cameras were being installed inside locomotives for inspections of officers and staff, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:13:08.030Z"
}
