{
  "title": "NAB strongly believes in “Zero Corruption, 100% Development”: Chairman",
  "link": "https://www.app.com.pk/national/nab-strongly-believes-in-zero-corruption-100-development-chairman/",
  "date_published": "2020-05-13T23:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):Chairman National Accountability Bureau (NAB) Justice (Retd) Javed Iqbal Thursday said that the anti graft watchdog strongly believed that the zero tolerance in eradicating corruption guaranteed hundred percent development.\nChairing a meeting via video link at NAB Headquarters by maintaining social distancing and ensuring all precautionary measures, he said NAB was absolutely committed to root out corruption with iron hands in an atmosphere of renewed energy and dynamism, where fight against corruption was being taken as national duty, said a news release.\nHe said that the Father of the Nation Quaid-i-Azam Muhammad Ali Jinnah in his address to the Constituent Assembly of Pakistan had termed corruption and bribery as one of the biggest curses. “That really is a poison. We must put it down with an iron hand”.\nChairman NAB said that National Accountability Bureau was established to eradicate corruption in a holistic and integrated manner. NAB is striving to accomplish its mission to rid the nation from corruption and corrupt practices.\nHe said that NAB’s operational methodology has set three stages for proceeding of cases complaint verification, inquiry and investigation. NAB’s officers/officials need to follow Anti Corruption Strategy by Adopting “Accountability for All” policy against eradication of corruption.\nHe said that the hard work, commitment, transparency and merit being put in by NAB officers are being appreciated by national and international reputed organizations.\nHe said that NAB officers should double their efforts in nabbing corrupts elements and recover from them hard earned looted money of the innocent citizens of Pakistan.\nHe said that to close the possibility of any single NAB officer/official influencing the discharge of official business, the new concept of a “Combined Investigation Team” (CIT) was introduced where two investigation officers and a legal consultant, financial expert under the supervision of Additional Director/Case and concerned Director were working as a team for a fair, transparent and unbiased, inquiry/ investigations.\nHe said that the quality of inquiry and investigation of NAB must have further improvement due to establishment of NAB’s first Forensic Science Lab (FSL) in Islamabad which has all facilities of Digital Forensics, Questioned Documents and Fingerprint Analysis which will help lending quality and solid evidence in conduct of inquiries and investigations.\nHe said that NAB has devised Monitoring & Evaluation System (MES) to monitor its performance and all Regional Bureaus in qualitative and quantitative term which has proved very helpful in evaluation of overall performance.\nHe said that NAB was the only Organization with whom China has signed memorandum of understanding (MoU) to oversee projects being undertaken under China Pakistan Economic Corridor (CEPC).\nHe said that NAB Ordinance 1999’s preamble emphasizes to nab corrupt and recover looted money.\nNAB has recovered Rs. 328 billion since its inception and its overall conviction ratio is about 70% in Accountability Courts.\nHe said that NAB hopes that joint efforts of all stakeholders can collaborate to check corruption before happening with the help of all stakeholders.",
  "retrievedAt": "2025-08-11T19:13:09.625Z"
}
