{
  "title": "Shibli asks nation to get united as govt can’t fight coronavirus alone",
  "link": "https://www.app.com.pk/national/shibli-asks-nation-to-get-united-as-govt-cant-fight-coronavirus-alone/",
  "date_published": "2020-05-14T05:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):Minister for Information and Broadcasting Senator Shibli Faraz Thursday said the government could not take on the fight against the coronavirus alone and the nation must be united and adopt precautionary measures.\nTalking to the PTV news channel, the minister invited the opposition parties to join hands with the Pakistan Tehreek-e-Insaf government to effectively contain the spread of COVID-19 in the country.\nHe said nobody knew for how long the coronavirus pandemic would persist, while the with limited resources could not not feed the people for long.\n“This is not the time to indulge in politics, rather we should work jointly to protect the people from the contagion,” he added.\nShibli Faraz said a common Pakistani was the focus of policies of Prime Minister Imran Khan, as they were suffering a lot from the coronavirus.\nOn the other hand, he said, it was the opposition leader, who had persistently demanded summoning of the National Assembly session, but he himself did not attend it. In fact he was doing a ‘political drama’ in the name of coronavirus, the minister added.\nHe regretted that despite repeated appeals the people were not cooperating with the government and showing irresponsible attitude which could further increase the coronavirus cases. It was the people’s responsibility to adopt the precautionary measures and follow the guidelines issued by the government, as otherwise there would be no option except to tighten the lockdown, he warned.\nThe minister said the decision to ease the lockdown in a phased manner was taken with the consultation of all the provinces which was aimed at bringing ease in the lives of common man.\nReplying a question related to Sindh , he said the Federal Government had specified Rs 31 billion for the province while it held consultations with health experts and provinces on daily basis on ways and means to combat the coronavirus pandemic.\nThe Centre would continue assisting the provincial governments for the welfare of the people of Sindh, he added.\nShibli Faraz said the decision of easing the lockdown was necessary as far as the present economic situation of the country was concerned. Many people had lost their jobs due to the lockdown, which had been in force for over one and a half months.\nHe said Prime Minister Imran Khan was too much concerned about the quarantine facilities. The government was doing its best to provide facilities to the corona patients in limited resources, he added.\nTo a question, the minister said the process of ruthless accountability of the corrupt politicians would continue in the country. There would no mercy for corrupt elements, who had looted the national wealth, he added.\nHe said the Pakistan Muslim League-Nawaz (PML-N) and the Pakistan Peoples Party (PPP) had appointed the National Accountability Bureau (NAB) chairman and the present government could not be blamed.\nThe Pakistan Tehreek-e-Insaf (PTI) governments had ended the monopoly of two corrupt parties in the country with the help of media, he added.\nThe minister said after the decrease in the petroleum prices the government was focusing on the provision of electricity to the domestic and industrial consumers at reasonable rate. The reforms in the energy sector with checking power losses were the foremost priority of the government, he added.\nTo a question, Shibili Faraz he said the information ministry was a challenging assignment for him. With the blessings of Allah Almighty, and through hard work and dedication, he would set an example.\nHe appreciated the performance of Pakistan Television, saying that it would attain its lost glory under the PTI government.\nThe minister said Kohat was near to his heart and the government was working to reduce its distance with Islamabad.\nA project to build a link road between Kohat and Islamabad would undertaken, he added.",
  "retrievedAt": "2025-08-11T19:13:01.858Z"
}
