{
  "title": "Regional peace depends on resolution of Kashmir dispute: NA Speaker",
  "link": "https://www.app.com.pk/national/regional-peace-depends-on-resolution-of-kashmir-dispute-na-speaker/",
  "date_published": "2020-10-09T12:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 9 (APP):National Assembly Speaker Asad Qaiser Friday said the Kashmir issue should be resolved in accordance with the United Nations Security Council’s resolutions and aspirations of Kashmiri people to ensure lasting peace in the world as well as in the region.\nAddressing the 15th anniversary of the establishment of Kashmir Orphan Relief Trust (KORT) in Mirpur Azad Jammu and Kashmir, he said the regional and world peace was depended on the resolution of Kashmir dispute, said a news release issued here.\nHe said Pakistan would continue to support the cause of Kashmir on every regional and international fora till the resolution of Kashmir dispute.\nThe government would utilize all possible channels to sensitize the world about Indian atrocities being committed on innocent Kashmiri people in Indian Illegally Occupied Jammu and Kashmir (IIOJK), the speaker stressed.\nHe remarked that the Kashmir cause and its awareness at global level was the top priority of the present government.\nAsad hoped that Indian atrocities would not last longer and the people of Kashmir would soon get their basic right-to-self determination.\nHe said the brutalities inflicted by Indian Army were felt by each Pakistani and they stood shoulder by shoulder with their Kashmiri brethren.\nHighlighting the pro-poor policies of the present government, he said the special focus was being given to the welfare of needy and destitute.\nThe speaker said he had been making all-out efforts to establish welfare and rehabilitation centers in the country with the help of different welfare organizations.\nHe said the establishment of a welfare city for orphans and street children in Alamaabad Swabi was underway.\nAsad also resolved to continue working for the welfare of the needy and destitute in all parts of the country.\nHe assured his all out support for legislation on welfare of the needy people.\nThe speaker lauded the passion and determination of Ch. Muhammad Akhtar for his endless efforts to establish and successfully manage Orphanage House in Mirpur Azad Kashmir.\nAddressing the children of Kort, he said that they should not feel themselves homeless and hapless as every Pakistani stood with them.\nHe advised the children to dream big and then strive hard to achieve the dreams. He also advised children to work hard to achieve their dreams.\nEarlier, Speaker National Assembly Asad Qaiser also inaugurated the Sports Aacademy in Kashmir and prayed for the continuity of sports activity in the Mirpur Azad Kashmir.\nThe anniversary ceremony was attended by Ex-Prime Minister Azad Kashmir Sardar Attique Ahmed Khan, chief Patron of Orphan Refugee Trust Ch. Muhammad Akhat, Hurrait leader Rana Muhammad Ahmed, the Finance Minister of Azad Kashmir Sardar Farooq Skandar Khan ,  the large numbers of Pakistani expatriates from different countries",
  "retrievedAt": "2025-08-11T19:53:01.968Z"
}
