{
  "title": "KP CM directs completion of formalities to operationalize Centre on Countering Violent Extremism",
  "link": "https://www.app.com.pk/national/kp-cm-directs-completion-of-formalities-to-operationalize-centre-on-countering-violent-extremism/",
  "date_published": "2022-07-15T15:03:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 15 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan has directed the authorities concerned to complete necessary steps for operationalizing the Centre of Excellence on Countering Violent Extremism.\nHe issued these directives while presiding over the 2nd meeting of the Board of Governors of the Centre of Excellence on Countering Violent Extremism here on Friday.\nMinister for Higher Education Kamran Bangash, MPA Dr. Ayesha Asad, administrative secretaries of concerned departments, Chief Coordination Officer Centre of Excellence and other board members attended the meeting.\nThe chief minister said that the provincial government was taking every possible step to create a peaceful and violence free society adding that establishment of the proposed centre of excellence was also a part of this struggle.\nHe expressed the hope that the Centre would play an important role in creating a peaceful society by using evidence-based innovative approaches and worldwide research to prevent and combat violent extremism in the province.\nBriefing about the implementation status of the decisions taken in the last BoG meeting, it was informed that human resource and finance committees under the board had been constituted and notified as well.\nThese five members HR and Finance committees chaired by the Chief Coordination Officer of the centre also include representatives from the departments of law, establishment, Home, finance and higher education.\nThe agreed composition of the aforesaid committees and formally approved the HR and Financial Regulations 2022 under the board. The board has also accorded approval to initiate the recruitment process of staff required to operationalize the centre.\nEarlier, briefing about the aims and objectives of the Centre of Excellence on Countering Violent Extremism, its proposed functions and other important aspects, the forum was informed that the Centre would work as a Research Based Institute to cope with the issues emerging from terrorism, subversive activities, hatred, extremism, intolerance and radicalization etc.\n“The vision behind establishing this centre was to create a society free of violent extremism and terrorism”, the authorities told and added that this would be a unique initiative of its kind not only in Pakistan but across the Asia.",
  "retrievedAt": "2025-08-11T15:14:52.929Z"
}
