{
  "title": "Delayed climate justice ‘death sentence’ for vulnerable: Sherry Rehman",
  "link": "https://www.app.com.pk/national/delayed-climate-justice-death-sentence-for-vulnerable-sherry-rehman/",
  "date_published": "2022-11-09T14:03:00.000Z",
  "source": "APP",
  "content": "SHARM EL-SHEIKH, Nov 09 (APP): “There is a race against time now for adapting to the climate crisis, and those with better resources will adapt faster, whereas for others, it will be delayed. In every country the vulnerable will be the first to go down, and we are here to serve the reminder that delaying climate justice for the vulnerable is subjecting them to a death sentence,” stated Senator Sherry Rehman, Federal Minister for Climate Change Senator at the Pakistan Pavilion at COP27 in Sharm El-Sheikh.\nThe senator was speaking at a panel discussion titled ‘The Lost & the Damaged: Pakistan’s Climate Catastrophe’, and was joined by Vicente Paolo, Thematic Coordinator Loss and Damage G77, Liane Schalatek, Associate Director, Heinrich Bol Stiftung, Amb. Shafqat Kakakhel, Chairperson Sustainable Development Policy Institute, and Paul V. Desanker, Manager Adaptation Program, UNFCCC.\nThe panel was moderated by environmental lawyer and activist Ahmad Rafay Alam, a news release here said.\nSenator Sherry Rehman stated that her agenda at COP27 was to ensure that Loss & Damage moves beyond a ‘bumper sticker’ catchphrase for the Global South, and some bargain is broken with parties from the Global North.\nIn response to a question on expectations from the loss and damage negotiations, Senator Rehman stated that these were political decisions waiting to be taken by the negotiating parties, and not based on financial or economic convenience.\n“This is the time now to ask for clarity and timelines. We can’t be making the entire COP27 pivot on an adversarial ask, which is why we haven’t gone into the business of reparations. We are seeking to build consensus because the whole system hinges on it as every country has a veto. Without prejudice to longer goals, our ask is there should be enough appetite to hear us from the Global South, who are literally on the edge of a perilous new frontline to climate risk. It is time for us also to get our act together where we don’t have to wait for somebody else to define it for us,” she said.\nFormer Pakistani ambassador and Chairperson SDPI Shafqat Kakahel highlighted obstacles in the path to Loss & Damage that needed to be addressed. “The first obstacle will be how we define Loss & damage; some of the losses are irretrievable and irreplaceable such as loss of lives, land and livelihoods, whereas damage is what can be brought back. There has never been a comprehensive definition that will encompass all areas, because only after such a definition, can we see how the international community deals with Loss & Damage,” he explained. Amb. Kakakhel observed that the principal reason for no definition is a lack political will in developed countries to formulate commitments, and whose focus has instead been to ensure that developing countries lower their carbon emissions.\nOn the invitation of Mr. Md. Shahab Uddin, Minister of Environment, Forest and Climate Change for Bangladesh, and Chairman of the Governing Council of South Asia Cooperation Environment Programme (SACEP), Senator Sherry Rehman also attended the South Asia Environmental Ministers Meeting ‘One Voice South Asia’. Highlighting environmental commonalities between South Asian nations, she stated that flooding and droughts will cost the region a US$215 billion, which is a conservative estimate. “The fact that climate knows no borders should sober our minds; this requires constant dialing up of cooperation across borders. We share so much in South Asia, but it looks like we are only sharing climate calamity. We need to share knowledge, data platforms, best practices, experiences and plans to progress together, and to fight our way out of humanity’s most important challenge,” she stated. The Indian Minister for Climate Change did not attend the meeting.\nLastly, the minister also spoke at a panel discussion at the UNFCCC’s Pavilion titled ‘Turning Financing Commitments into Net-Zero Action in Asia Pacific’ where she highlighted Pakistan’s Living Indus Initiative, which aims to save rivers from climate and human impacts, creating plastic-free cities and resilient agriculture. The Initiative has the potential to re-invent the entire country’s ecology, employment and productivity through transforming green jobs, recycling and detoxification of the Indus river.",
  "retrievedAt": "2025-08-11T15:51:52.402Z"
}
