{
  "title": "Nation celebrates 145th birth anniversary of Dr Allama Iqbal with great zeal, enthusiasm",
  "link": "https://www.app.com.pk/national/nation-celebrates-birth-anniversary-of-allama-iqbal/",
  "date_published": "2022-11-09T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 9 (APP):The 145th birth anniversary of the great poet and philosopher Dr Allama Muhammad Iqbal was observed with national enthusiasm, traditional zeal and fervour across the country including Gilgit-Baltistan and Azad Jammu and Kashmir (AJK) on Wednesday.\nThe day dawn with special prayers at the mosques for the peace, national integrity, prosperity and development of Pakistan and eternal peace of all martyrs of the country including those Muslims, who laid down lives during Pakistan’s freedom movement.\nThe government had declared a public holiday in connection with the momentous day and all the federal and provincial government’s offices, schools and colleges were closed.\nPeople from different walks of life paid glowing tributes to Dr Allama Iqbal for his unmatched contributions in terms of awakening and uniting Muslims to stand for the cause of acquiring a separate homeland, through his thought provoking messages and poetry.\nAn impressive change of guards ceremony was held at the mausoleum of Dr Allama Muhammad Iqbal. A smartly turned out contingent of Pakistan Navy clad in immaculate whites, assumed ceremonial guard duties with traditional spirit and enthusiasm. The ceremonial guard mounting was followed by wreath laying at the mausoleum of the national poet by station commander (Navy) on behalf of the chief of the naval staff, officers, sailors and civilians of Pakistan Navy. Later, the station commander offered Fateha and recorded his impressions in the visitor’s book.\nSpecial programmes were arranged by different literary, political, social, educational and cultural organizations to pay homage to Dr Allama Iqbal for his unmatched literary contributions and his role in character building of the entire Muslim Ummah.\nSeminars, conferences, debate and poetry competitions and discussion programmes were arranged to highlight different aspects of poetry, thoughts and messages of Dr Allama Iqbal. Allama Iqbal is officially recognized as national poet of Pakistan and known as Muffakir-e-Pakistan, Shair-e-Mashriq and Hakeem-ul-Ummat.\nHis best literary work includes Asrar-e-Khudi, Payam- i-Mashriq, Bang-i-Dara, Bal-i-Jibril, Zarb-i-Kalim and Armughan-e-Hijaz.\nSocial media, Twitter, Facebook and Whatsapp were the most prominent social media sites where this great scholar remained center of discussion and eulogized for his contributions, besides electronic and print media.\nMinister for Information and Broadcasting Marriyum Aurangzeb while paying rich tribute to Dr Allama Muhammad Iqbal on his birth anniversary, said his philosophy of “Khudi” (self) was a beacon for the humanity. Allama Iqbal, through his inspirational message of Khudi, inculcated a visionary lesson of self-realization in the young generation, the minister said in her message on the Iqbal Day being marked today across the country.\nShe said the whole nation paid glowing tribute to Dr Allama Muhammad Iqbal on his birth anniversary. He was a great poet, philosopher and thinker.\nMarriyum said the nation would have to pledge today that they would strive hard for realising Allama Iqbal’s dream for a prosper Pakistan.\nMinister of Federal Education & Professional Training Rana Tanveer Hussain urged the masses to work together to make Pakistan prosperous and formidable member of global community in the light of Iqbal’s vision.\nIn his message, while paying rich tribute to the great philosopher and poet, Allama Muhammad Iqbal, on his birth anniversary, he said that it is an occasion to recall that seeking knowledge and continuous hard work are the real objectives of life.\nThe beauty of Allama Iqbal’s vision is that he not only saw the dream of Pakistan but also highlighted the issues Pakistan had to encounter after its creation, he added.\nTherefore, Rana Tanveer said, there is a great need to follow Allama Iqbal’s message which focuses on joint efforts for the progress and prosperity of our nation by keeping our differences aside.\nPunjab Governor Muhammad Balighur Rehman visited Mazar-e-Iqbal on the occasion of 145th birth anniversary of Poet of the East, Dr Allama Muhammad Iqbal. A smartly turned out contingent of Pakistan Navy presented the guard of honor to the Governor. The Punjab Governor also noted down his comments in the guest log.\nPunjab Governor said that today there was a need to revisit the thought of Allama Iqbal. He said, “We should forge unity among our ranks in the light of Allama Iqbal’s philosophy.”\nThe Governor said that young generation should study and understand the spirit of self-reliance of Dr. Allama Iqbal and create qualities like ‘Shaheen’ (eagle) in themselves.\nThe Directorate General of Public Relations of the Pakistan Air Force released a short documentary video paying tribute to the poet of the East, Dr Allama Muhammad Iqbal on the occasion of his birth anniversary. The short documentary highlighted that Iqbal’s poetry has depth of thought and insight. The creation of the motherland had been accomplished by his intellectual efforts, it added.\nAllama Iqbal Open University (AIOU) organized various programs to celebrate “Iqbal Week” on account of the birth anniversary of a great philosopher, thinker and poet, Dr. Allama Muhammad Iqbal. A seminar was organized on “Iqbal and Ishq e Rasool”.\nLive portrait-making competitions were organized at Punjab Arts Council (PAC) Rawalpindi in connection with the Iqbal festival.\nSialkot Chamber of Commerce and Industry (SCCI) held a cake-cutting ceremony at Iqbal Manzil (the birthplace of Allama Iqbal).\nSCCI President Abdul Ghafoor Malik, PRO Tajammal Hussain and other SCCI officials jointly cut the cake and paid homage to Dr Allama Muhammad Iqbal.\nSpeaking on the occasion, SCCI President Abdul Ghafoor Malik said that Allama Muhammad Iqbal was a visionary figure who conceived the idea of separate homeland for the Muslims of subcontinent that was ultimately materialized in the shape of Islamic Republic of Pakistan. He said the teachings of Allama Iqbal were like a beacon to maintain tolerance, peace and stability in the society.\nMeanwhile. All Parties Hurriyat Conference (APHC) leaders also paid glowing tributes to the Poet of the East, Allama Muhammad Iqbal. APHC leaders and organizations including Ghulam Muhammad Khan Sopori, Dr Musaib, and Jammu and Kashmir Muslim League in their statements issued in Srinagar said that Allama Iqbal had fully supported the people of Kashmir in their struggle against the Dogra regime and encouraged them through his poetry.\nIn Azad Jammu & Kashmir, the birth anniversary of Allama Dr. Muhammad Iqbal also celebrated with a pledge to work shoulder to shoulder to make the country a true forward-looking Muslim state Various cultural, political and social organizations held meetings and seminars in various parts of the liberated territory to highlight the services rendered by the great visionary of 20th century.\nIn Mirpur, the birth anniversary was celebrated with zeal and fervor. The day was marked with a special ceremony held in Mirpur Campus of International Islamic University Islamabad School presided over by its principal.\nA similar ceremony was also held under the auspices of the NGO Jinnah Foundation Jammu & Kashmir State with its Chairman Dr. Amin Chaudhry in the chair to pay rich tribute to the vision of Dr. Allama Muhammad Iqbal in addition to highlighting his life and services for an ideological Muslim state in this part of the world.\nThe AJK state print and electronic media also brought out special supplements on this occasion. Several organizations, delegations and citizens paid rich tributes and offered Fateha for the departed soul of Dr Allama Muhammad Iqbal in the ceremonies held throughout the day.\nOn the direction of the Prime Minister of Pakistan, Ministry of Federal Education and Professional Training directed all of the Federal Educational Institutions to ensure holding of special events in connection with the birth anniversary of Dr. Allama Muhammad Iqbal. All departments including HEC, PEIRA, NCHD, BECS, NEF, FCE, QAU, AIOU etc. under ministry of FE & PT organized special programs to celebrate the Iqbal Day with full zest and fervor.",
  "retrievedAt": "2025-08-11T15:51:49.263Z"
}
