{
  "title": "China donates 100,000 Hepatitis-A vaccine doses to Pakistan",
  "link": "https://www.app.com.pk/national/china-donates-100000-hepatitis-a-vaccine-doses-to-pakistan/",
  "date_published": "2022-11-09T14:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 09 (APP): People’s Republic of China on Wednesday donated 100,000 vaccine doses of Hepatitis-A to Pakistan.\nFederal Minister for National Health Services, Regulations and Coordination Abdul Qadir Patel on behalf of the Government of Pakistan received vaccines from Gao Qiang, Chief Executive Officer (CEO) of Sinovac.\nWhile addressing on the occasion, Qadir Patel acknowledged the government and the people of China and said it is heartening to see that Pak-China friendship achieves another milestone.\nPakistan and China are enjoying strong, genuine and enduring relationships, he added.\nHe said Pakistan is facing with the aftermaths of the worst floods in the history of country, where to date, large communities in the provinces of Sindh and Balochistan are living in flood relief camps.\nThese relief camps residents both children and adults are highly vulnerable to disease transmission.\nHe said emergence of an outbreak of Hepatitis-A virus is very high adding that the provision of assistance to the flood affected populations of Pakistan is government’s top priority.\n“In this difficult time, we are really grateful for the donation of 100,000 doses of Hepatitis-A vaccine by Sinovac for children and adults.”\nHe said that this act reinforces the strategic cooperative partnership between Pakistan and China for health and prosperity of the two nations.\nGao Qiang, Chief Executive Officer (CEO) of Sinovac said that today marks another event in continuation of the seventy years of everlasting and unprecedented bilateral friendship based on mutual trust, respect and goodwill between Pakistan and China.\nHe added that the Government of China considers the children and adult populations living in the flood affected communities as their own people and the assistance provided in form of 100,000 doses of Hepatitis -A vaccine is a positive gesture of care and affection.\n“On behalf of the government and the people of China, I am pleased to share that we are proud to be part of this initiative.”\nHe added, “This is just a little step and a new beginning as our long term vision is beyond that focusing on a strategic health partnership where in-land production facilities of life saving vaccines will be fostered in near future in Pakistan.”\nDG Federal Directorate of Immunization (FDI) Dr. Muhammad Ahmed Kazi thanked all officials and said that the management of FDI is always honored to convene such events as it is always an experience of great learning for the whole team.\nHe said, “On behalf of the programme, I thank the whole team of Sinovac for the assistance provided and assure that it will be used in the best possible manner to benefit the children and adult populations of Pakistan.”\nThe event was attended by health officials from the Ministry of National Health Services, Polio Programme (NEOC), NIH, NCOC, DRAP, FDI and Country Representatives of World Health Organization, UNICEF and other partner organizations.",
  "retrievedAt": "2025-08-11T15:51:53.367Z"
}
