{
  "title": "India starts blaming Pakistan for its failure to hold G-20 moot in IIOJK",
  "link": "https://www.app.com.pk/national/india-starts-blaming-pakistan-for-its-failure-to-hold-g-20-moot-in-iiojk/",
  "date_published": "2023-04-20T19:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): India has started to blame Pakistan for the possible failure of its announced meeting of the G-20 countries from May 21-23 to be held in Srinagar, Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAccording to media reports, recently the fire that broke out in an army truck in Rajouri district at around 3 pm and resulted in the death of four soldiers was attributed to lightning.\nHowever, at 6 pm, the Indian Army declared the accident as a grenade attack by unknown terrorists. After seven o’clock, Indian media, former government officials and pro-Modi journalists blamed Lashkar-e-Taiba and other banned organizations for the attack. Some retired Indian Army officers and analysts started to blame Pakistan.\nThe purpose of the G-20 countries’ moot was to convince the world that the law and order situation in Kashmir was absolutely normal. In view of the worsening law and order situation and the disputed status of IIOJK, the Modi government was under severe pressure due to no participation of most of the G-20 countries.\nDuring the meeting, anticipated severe protests and strikes by Kashmiris were also a headache for the Modi government. However, in the pursuits of its war-mongering ambitions Pakistan’s offer of peace to war-obsessed India was not bore and given a cold shoulder.\nForeign Minister Bilawal Bhutto’s possible participation in the SCO meeting in Goa also undermined India’s efforts to isolate Pakistan on the external front. The experts claimed that in the retrospect, the Rajouri incident also seems to be a self-inflicted Pulwama-style attack.\nThe motive behind the self-inflicted Rajouri incident is to shift the G-20 summit from Srinagar, they said. By justifying the incident, India can also justify the participation of the Pakistani foreign minister in the SCO meeting.",
  "retrievedAt": "2025-08-11T08:21:27.357Z"
}
