{
  "title": "President imposes fine on accused in harassment case over frivolous litigation",
  "link": "https://www.app.com.pk/national/president-imposes-fine-on-accused-in-harassment-case-over-frivolous-litigation/",
  "date_published": "2023-04-21T08:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 21 (APP): In order to discourage unnecessary litigation filed on flimsy grounds, President Dr Arif Alvi has imposed a fine upon the accused in a harassment case to bear the airfare charges of the complainant for filing representations on flimsy grounds in a hasty manner.\nThe president fined the accused also for putting the alleged victim under further mental and financial hardships by making her travel from Karachi to Islamabad with her counsel to attend the hearing.\nThe president gave this order in a case of sexual harassment where a female Assistant Sub-Inspector (ASI) (the complainant) at Airport Security Force (ASF) posted in Sukkur was allegedly harassed by the airport manager.\nAccording to her, the accused pressurized her to solemnize marriage with her, however, within four months of the marriage, the accused statedly started maltreating her and ultimately handed over the divorce deed to her in the month of February 2022.\nShe alleged that the accused pressurized her to reside with him after the divorce failing which he threatened to destroy her job as he was the airport manager. The accused was also reported to have sent indecent WhatsApp messages to the complainant.\nFeeling aggrieved, the complainant approached the Federal Ombudsman for Protection against Harassment of Women at Workplace (FOSPAH). During the course of proceedings before the Ombudsman, the accused filed an application for rejection of the complaint on the ground that it was not maintainable as the allegations were vague and pertained to domestic issues of the parties.\nThe counsel of the accused contended that the competent forum for such issues had been specified in the Domestic Violence (Prevention and Protection) Act, 2013 promulgated by the Provincial Assembly of Sindh.\nFOSPAH, after hearing the parties, rejected his application for dismissal of the complaint. The accused then filed a representation with the president assailing FOSPAH’s order, which was also rejected.\nThe president rejected his representation by stating that the proceedings in the main case were still pending before FOSPAH wherein the evidence was yet to be recorded to ascertain the factum of harassment or otherwise.\nHe held that the accused had filed the representation unnecessarily to prolong the proceedings and such a tendency needed to be discouraged as it was nothing but a time-buying tactic.\nPresident Alvi said that it was well settled that no party was allowed to file representations in a hasty manner to cause inordinate delay not only wasting the precious time of the ombudsman and the president but also dragging the complainant into un-meritorious representations. “Such tendency of uncalled-for litigation needs to be discouraged”, he added.\nThe president further said that the preamble of the Protection against Harassment of Women at the Workplace Act, 2010 explicitly provided that the main objective of the legislation was to provide speedy and expeditious relief by redressing the grievances of the litigants to promote good governance.\nHe added that in order to achieve the objective of the Act, imposing an exemplary cost on the party filing representations on flimsy grounds was appropriate to curb inordinate delay in the disposal of harassment matters.\nHe stated that Section 14 of the Reforms Act, 2013 empowered the president to dispose of a representation by passing an order as he deemed fit and such power entailed that such power was to be exercised reasonably, fairly, justly and for the advancement of the purposes of the enactment.\nThe president stated that the application filed by the accused for rejection of the complaint on the grounds which could not be adjudicated except by appraisal of evidence was nothing but an abuse of the process of law not only to defeat the main objective of the Act but also to put the complainant under further mental and financial hardships who had to travel to Islamabad from Karachi with her counsel to attend the hearing of the representation by incurring airfare cost.\nPresident Alvi, therefore, rejected the representation of the accused and imposed the cost of air travel expenses of the complainant upon the accused.\nHe further directed the ombudsman to conclude the proceedings expeditiously within a period of ninety days as contemplated in section 8 of its Act, besides ensuring the payment of airfare cost by the accused to the complainant before proceeding ahead.",
  "retrievedAt": "2025-08-11T08:21:23.933Z"
}
