{
  "title": "Inquiry committee formed by PM on Broadsheet matter to present report within 45 days : Shibli",
  "link": "https://www.app.com.pk/national/inquiry-committee-formed-by-pm-on-broadsheet-matter-to-present-report-within-45-days-shibli/",
  "date_published": "2021-01-21T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): Minister for Information and Broadcasting Senator Shibli Faraz said on Thursday the Prime Minister has already constituted an inquiry committee to investigate the Broadsheet matter and determine the responsibility within 45 days.\nThe minister said this during the meeting of the National Assembly’s Standing Committee on Information and Broadcasting chaired by Javed Latif, MNA.\nHe said there was no point to summon the Chairman National Accountability Bureau (NAB) in the committee at this time.\nHe said as per terms of reference of the inquiry committee responsibility would be fixed and its details would be shared with the information committee.\nMoreover, he said the matter did not come in the domain of the committee on Information and Broadcasting.\nShibli Faraz opined that at a time when an inquiry committee was working, summoning the NAB Chairman in the committee could create confusion.\nHe said that when the inquiry committee report comes, if the committee was not satisfied it could summon him then.\nHe said that if the committee summons the chairman NAB, then it should also summon all persons named in it.\nDuring past five years the committee has never taken any agenda like this, he said adding that the PTI had no worry on the Broadsheet issue, as it had nothing to do with this all saga.\nPTI MNA Farrukh Habib said that it was an open and shut affair and if the committee summons the Chairman NAB, then all aspects of the case should be discussed.\nHe said that he differed with the proposal to summon the Chairman NAB as it was not in the domain of the committee.\nPTI MNA Kanwal Shauzab also opposed the idea to summon the head of the NAB.\nHowever the Chairman of the Committee Javed Latif said that at the first stage the NAB chairman could send his representative to brief the committee, if he could not satisfy the panel it may summon the Chairman NAB in its next meeting.\nJaved Latif said that it was the responsibility of the institution to explain who was responsible for payment of millions of dollars to Broadsheet without recovery of any looted money.\nOn the proposal of PTI MNA Kanwal Shauzab, the committee also decided to summon the owners of the media houses whose employees have not been paid salaries for many months.\nFormer President Pakistan Federal Union of Journalists Afzal Butt said that it was the responsibility of the government to ensure implementation of law of the land so that the poor media workers get their salaries in time.\nKanwal Shauzab said that it was the age of fifth generation war and the media had a very important role to play, but unfortunately working journalists had no protection of their jobs and labour laws were not being followed.\nDr Nafeesa Shah said that the bill related to the safety of journalists should be enacted and implemented.\nThe committee formed a sub-committee to look into the media issues comprising Naz Baloch, Kanwal Shauzab and Saad Waseem.\nThe committee deferred the issue of kidnapping of senior journalist Matiullah Jan as it was informed that the matter was sub judice in the Supreme Court of Pakistan.\nWhile discussing the issue of PTV showing incomplete map of Pakistan, the committee asked the management to look into the issue of termination of lower staff on humanitarian grounds.\nThe committee was informed that Chairman PTV was the appellate authority in this regard and presently the post was vacant.\nThe meeting was attended by MNAs Nasir Khan Musazai, Tahir Iqbal, Akram Cheema, Aftab Jehangir, Javaria Zafar Aheer, Kanwal Shauzab, Farrukh Habib, Nadeem Abbas, Dr Nafeesa Shah, Saad Wasseem and Naz Baloch.\nBesides Secretary Information and Broadcasting Shahera Shahid, senior officials of the Ministry of Information and Broadcasting were also present during the meeting.",
  "retrievedAt": "2025-08-11T20:15:53.448Z"
}
