{
  "title": "PM launches online system for succession certificates within 15 days",
  "link": "https://www.app.com.pk/national/pm-launches-online-system-for-issuance-of-administration-letters-succession-certificates-within-15-days/",
  "date_published": "2021-01-21T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): Prime Minister Imran Khan on Thursday launched the online system for issuance of letters of administration and succession certificates within 15-day period, saying the step would greatly facilitate the local citizens and overseas Pakistanis.\nAddressing the launch ceremony here, the prime minister said the main objective of digitalization of inheritance system was to facilitate the general public and provide them justice without any inordinate delay.\nLIVE #APPNews : Prime Minister Imran Khan addresses at Launching ceremony of Letters of Administration and Succession Certificates #Islamabad . @PakPMO @ImranKhanPTI https://t.co/tWrplx4hJ7\n— APP  (@appcsocialmedia) January 21, 2021\nThe letters of administration and succession certificates, which earlier took around two to seven years to issue, will now take two weeks.\nImran Khan said the government considered the law reforms crucial in ensuring justice through people-friendly legislation.\nHe regretted that delay in matters relating to inheritance of property caused utmost grievances to the heirs, particularly among the families dispersed abroad.\nImran Khan said the overall system that denied the spirit of facilitation for general public in fact encouraged criminal activities in shape of bribery or illegal occupation of property. “When crime pays, crime multiplies.”\nBesides reforms in the Civil Procedure Courts, he said, the government would bring improvement in the Criminal Justice System as well.\nFor the purpose, all the stakeholders, including judiciary and lawyers would be taken on board, he addded.\nThe prime minister said the main goal of his government was to emulate the welfare State of Madina, where revenues and wealth were diverted towards uplift and facilitation of the underprivileged.\nHe lauded Minister for Law and Justice Barrister Farogh Nasim and his team for materializing the difficult task meant to facilitate the common man.\nDr Farogh Nasim said the Law Ministry had devised a mechanism to establish Succession Facilitation Units in collaboration with the National Database and Registration Authority (NADRA) for the issuance of Letters of Administration and Succession Certificates.\nHe said the certificates would be issued within 15 days of initiation of application by the legal heirs of the deceased.",
  "retrievedAt": "2025-08-11T20:15:51.225Z"
}
