{
  "title": "Food Security Dashboard to monitor consumption, availability of basic commodities, PM told",
  "link": "https://www.app.com.pk/national/food-security-dashboard-to-monitor-consumption-availability-of-basic-commodities-pm-told/",
  "date_published": "2021-01-21T18:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): Prime Minister Imran khan was on Thursday told that after technical completion of the Food Security Dashboard prepared in cooperation with the Sustainable Development Policy Institute (SDPI) has been handed over to the Ministry of Food Security.\nHe was presiding over the weekly meetings of the priority sectors including Agriculture, Economic Outreach and Knowledge Economy.\nThe high level meeting on agriculture was attended by Federal Ministers Makhdoom Khusro Bakhtiar, Syed Fakhar Imam, Advisor Abdul Razak Dawood, Special Assistant Dr Moeed Yusuf and senior officers concerned. Besides, Chief Secretaries of the four provinces attended the meeting through video-link.\nThe prime minister was told that the acquisition of data from provinces was being ensured for decision making with the help of dashboard and for that purpose the capacity of provincial departments was also being enhanced.\nIt was further told that in addition to ensuring the collection of data from public and private sources, the dashboard will also monitor the consumption and availability of sugar and wheat besides the low shelf life commodities like vegetables in the country.\nThe meeting was also told about strict monitoring of sugar sale and the acquisition of information from `Atta Chakis’ for the collection of accurate data.\nThe prime minister while appreciating the measures stressed for activation of the dashboard on priority basis.\nHe further said that since the next ten years were very important for Pakistan in terms of food security, the project of dashboard should be strictly implemented and the institutions showing slackness in providing data should be proceeded against.\nThe prime minister directing for transparent monitoring of the sale of sugar from the mills said accurate data had vital importance in decision making and saving the country from future crises.\nDuring the meeting on economic outreach, also attended by Advisor Abdul Razak Dawood, SAPM Moeed Yousuf, and senior officers, the prime minister was apprised of the measures taken for capacity building to boost exports.\nHe was told that a timeline had been defined for target setting as well as their accomplishment. Moreover, the impediments in exports sector would be removed on priority.\nThe prime minister instructed the authorities concerned to take all out step to enhance exports besides emphasizing the formulation and implementation of a comprehensive action plan to bring in remittances.\nDuring the meeting on knowledge economy, Vice Chairman of Knowledge Task Force Dr Attaur Rehman briefed the prime minister on record completion of Pakistan-Austrian University of Applied Sciences in Haripur in two and half years.\nFederal Minister Asad Umar, SAPM Mood Yousuf and senior officers also attended the meeting.\nIt was told that after project’s completion in 2018, the classes had been started in 2020. Affiliated with three Austrian and five Chinese universities, the institution was providing high quality educational facilities and teaching modern sciences.\nMoreover, the prime minister was also briefed on teaching and implementation of 12 modern technologies like the automation of education, energy conservation, 3D printing, renewable energy and robotics.\nThe participants were also briefed on the strategy for capacity building and enhancement of skilled workforce. Moreover, it was told that education system would be reformed from primary to post graduate level to increase the number of skilled workforce.\nDr Attaur Rehman also updated the prime minister on progress regarding recently approved international engineering university in Sialkot.\nThe prime minister appreciated the project and also assured of his support.\nThe vice chairman briefed the prime minister on 17 proposed and as many ongoing projects of knowledge economy.\nThe prime minister said the measures taken in knowledge economy sector were welcoming as teaching of modern sciences was vital to change the nation’s fate.\nThe establishment of international standard institutions was also appreciating, he said, and also sought proposals to increase development budget for the sector.",
  "retrievedAt": "2025-08-11T20:15:48.409Z"
}
