{
  "title": "Pakistan firmly believes in ACD’s founding values; committed to Vision 2030, Ankara Declaration: FM",
  "link": "https://www.app.com.pk/national/pakistan-firmly-believes-in-acds-founding-values-committed-to-vision-2030-ankara-declaration-fm/",
  "date_published": "2021-01-21T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi while welcoming the establishment of Asia Cooperation Dialogue (ACD) Permanent Secretariat in Kuwait on Thursday reiterated Pakistan’s firm belief in ACD’s founding values and its commitment to ACD’s Vision 2030 and the Ankara Declaration.\nThe Foreign Minister expressed these views while representing Pakistan at the 17th ACD Ministerial meeting held in a virtual format on 21 January 2021.\nHe said ACD being a leading platform has transformed into a robust institutional mechanism for dialogue and discussions among the member states on issues of mutual interest, a press release issued by the Ministry of Foreign Affairs here said.\nHighlighting the devastating repercussions of the COVID-19 pandemic on sustainable development and developing countries, Pakistan stressed the need to coordinate actions, benefit from each other’s experiences, and pool resources for responding to the pandemic and financing the implementation of the 2030 Agenda for Sustainable Development.\nThe Foreign Minister stated that Pakistan was open to share its experience and internationally acknowledged approach in effectively combating the pandemic, and emphasized the need for the COVID-19 vaccine to become easily and equitably accessible to all.\nAssuring full support to the ACD’s agenda on Tourism and Culture, being the Co-prime Mover, Pakistan stated that the theme “the New Normal and Safe and Healthy Tourism” will help in fostering networking, improving connectivity, and promoting tourism in the ACD Member States.\nHighlighting the importance of connectivity and announcing an early convening of the inaugural meeting of the Executive Committee of the Joint Working Group on Connectivity, Pakistan emphasized the need to implement the ACD Blueprint 2021-2030 and the Road Map for ACD Regional Connectivity.\nACD is a continent-wide forum, which provides a platform to Asian countries to regularly exchange views on areas of mutual interest and foster an Asian community. Pakistan is one of the founding members of ACD and assigns high priority to this forum.",
  "retrievedAt": "2025-08-11T20:15:51.056Z"
}
