{
  "title": "CDA, KORT signed MoU to make Islamabad friendly for disabled",
  "link": "https://www.app.com.pk/national/cda-kort-signed-mou-to-make-islamabad-friendly-for-disabled/",
  "date_published": "2021-01-21T18:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): A memorandum of understanding (MoU) was signed between Kashmir Orphan Relief Trust (KORT) and Capital Development Authority (CDA) at Parliament House here on Thursday to make Islamabad friendly for disabled.\nThe MoU was signed by Chairman KORT and Director General CDA.\nSpeaker National Assembly Asad Qaiser after witnessing the signing of the MOU, said that taking care of needy and destitute was the collective responsibility as this segment of the society was marganizalized, needed care and attention.\nHe also emphasised to take initiatives to cater to the needs of street children.\nHe appreciated the performance of the Special Parliamentary Committee on Disabled Persons which was the first Special Parliamentary Committee to deliberate upon and take policy initiatives for the welfare of orphans, street children and disabled segment of the society.\nHe said that Parliament House was also in process of being made disabled friendly. He stressed on all government departments to get their buildings checked for making them more disabled friendly.\nThe Speaker said that the present government envisioned a true welfare state based on Islamic principles of justice, equality and respect for humanity. He said that various measures had been adopted for welfare of the marginalised segments.\nHe said that through implementation of this MoU, CDA and KORT would work together to make Islamabad disability friendly.\nMNA Nafeesa Khattak appreciated the efforts of Speaker Asad Qaiser to take pain for the welfare of the needy and destitute.\nChairman KORT Chaudhry Muhammad Akhtar appreciated the cause of Speaker National Assembly Asad Qaiser and assured to collaborate with CDA to make Islamabad a first ever disabled friendly city of the country.",
  "retrievedAt": "2025-08-11T20:15:48.407Z"
}
