{
  "title": "Macro-economic indicators showing accelerated growth: Asad Umar",
  "link": "https://www.app.com.pk/national/macro-economic-indicators-showing-accelerated-growth-asad-umar/",
  "date_published": "2021-01-21T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): Minister for Planning, Development and Special Initiatives, Asad Umar on Thursday said that for the first time in a decade or more, the accelerated growth was being witnessed in major macro-economic indicators including current account deficit, large scale manufacturing industry and exports.\n“Exports of the country in December 2020 witnessed a record growth of 18.5 percent which is highest in a single month in 12 years,” the minister said while addressing a press briefing along with Minister for Power Omer Ayub here.\nHe said 15 Large Scale Manufacturing Industries also showed a sharp increase in November 2020 as it grew by 15 percent which was a record growth in several years.\nSimilarly, he said spending under federal Public Sector Development Programme (PSDP) 2020-21 was also showing a healthy increase as the federal government spent a record amount of Rs 208 billion on development projects during first six months of the current fiscal year.\n“This amount is 32 percent of total development outlay for the year 2020-21 which is the highest in eight years,” Asad Umar added.\nHe said the journey of sustainable development under the incumbent government was getting pace which would continue in coming years.\nFurhtermore, he said that the government had also improved monitoring of projects.\nLikewise, Asad Umar said the Current Account Deficit had turned to surplus after decades.\nHe recalled that the previous government’s performance was so poor that the deficit was expanding to over US $ 2 billion a month.\nHe said the primary budget of the country was also in surplus that also was happening after several years.\nHe said a few weeks ago, the government had announced industrial tariff and after that about 8 percent additional electricity was being utilized by the industries.",
  "retrievedAt": "2025-08-11T20:15:51.086Z"
}
