{
  "title": "Pakistan commits to building community resilience against climate change: Romina",
  "link": "https://www.app.com.pk/national/pakistan-commits-to-building-community-resilience-against-climate-change-romina/",
  "date_published": "2024-11-07T17:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):Coordinator to the Prime Minister on Climate Change Romina Khurshid Alam on Thursday said Pakistan was committed to bringing resilience at the community level against adverse impacts of climate change.\nShe was speaking at the concluding plenary of the four-day Sustainable Development Conference organized by the Sustainable Development Policy Institute (SDPI) here, according to a press release.\nRomina said collaboration between the Ministry of Climate Change (MoCC) and SDPI had forged new synergies, with the intention to drive well-informed policy discourse.\nAt the upcoming COP29, Pakistan will passionately be advocating for climate finance, technology transfer, and capacity building of vulnerable communities, she said. Ms Alam said that she would be sharing recommendations from this conference at COP29.\nMeanwhile, experts, stakeholders, and policymakers deliberated on a range of issues at the conference, giving recommendations to the relevant authorities for bringing improvements.\nIn the session, ‘Beyond Fake News: Finding Truth in a World of Misinformation’ senior journalist Mazhar Abbas outlined the severe impact of fake news on public trust in the media, especially in a society increasingly polarised by political and social divides.\nIn the session titled ‘Transforming Food Systems for Climate-Resilient Food Security in Pakistan’, scientists, academics and industry experts spoke on the urgent need to strengthen the country’s agricultural infrastructure to withstand the increasing impacts of climate change.\nEric Kenefick, a representative from the World Food Programme (WFP) stressed the importance of building resilience in food systems to mitigate the effects of climate shocks such as heatwaves and floods, which have been devastating crop yields and livelihoods.\nAlessia De Caterina from WFP Italy stressed the importance of raising awareness among policymakers about the long-term impacts of climate change on food security.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:08:17.445Z"
}
