{
  "title": "Ahsan directs timely completion of Jinnah Medical Complex in capital",
  "link": "https://www.app.com.pk/national/ahsan-directs-timely-completion-of-jinnah-medical-complex-in-capital/",
  "date_published": "2024-11-07T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Thursday directed the quarters concerned to ensure completion of the Jinnah Medical Complex, a state-of-the-art healthcare facility designed to revolutionize healthcare standards in Islamabad, within the given time-frame of three years.\nHe passed these directives while chairing a meeting to review the progress of the Rs120 billion project, which attended by Minister for National Health Services, Regulations and Coordination (NHSRC) Dr Nadeem Jan, Health Coordinator Dr Mukhtar, Secretary of the Ministry of Health, Chief Health, DC Health, senior officers from the Capital Development Authority (CDA), and officials from the departments concerned, a news release said.\nThe master plan for this landmark Rs120 billion project includes a Center of Excellence, Diagnostic and Treatment Podium, Student Housing, Academic Podium, Academic and Research Towers, Physical Plant, Grid Station, Auditorium, Mosque, Emergency Department and a hotel to cater to the needs of medical tourism and patients.\nAddressing the meeting, the minister highlighted the necessity of a stringent selection process for hiring qualified staff and credible contractors to ensure the project’s successful completion.\nTo further strengthen efficiency and transparency, the minister directed that the project be executed under the Engineering, Procurement and Construction (EPC) mode rather than through regular budgeting.\nThe government has allocated Rs5 billion in the fiscal year 2024-2025 under the Public Sector Development Program (PSDP) to start the project. While the CDA has earmarked 200 kanals of commercial land in Sector H-16 for the Jinnah Medical Complex, which underscores the government’s commitment to strengthening healthcare infrastructure.\nAhsan Iqbal highlighted that the project’s strategic location in Islamabad, near the airport and national highways, has made it an ideal hub for regional and international medical tourism, adding a steering committee has been established to oversee the project’s progress and ensure that all time-lines and milestones set forth by the Prime Minister were met.\nHe further said that the Jinnah Medical Complex must incorporate green design principles, ensuring that it stood as a sustainable and environmentally friendly structure.\nThe health complex is envisioned as a monumental project for the capital city, featuring a self-contained vertical health tower with comprehensive medical services, and its master plan will optimize land use, building layout, landscaping, site accessibility and traffic management aimed at promoting health tourism and enhancing healthcare infrastructure in the country.\nTo further enrich the project, the minister instructed the inclusion of vice chancellors from two prominent Pakistani medical universities to provide their expertise. Besides, regular consultative sessions will be held to track progress and ensure the smooth execution of activities, thereby guaranteeing the successful implementation of the project.\nGroundbreaking of the Jinnah Medical Complex performed by Prime Minister Shehbaz Sharif on July 21, 2024, marking a significant milestone in Pakistan’s journey toward a robust and modern healthcare system.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:07:05.075Z"
}
