{
  "title": "Immediate regulation on emerging tobacco, nicotine products: SPARC",
  "link": "https://www.app.com.pk/national/immediate-regulation-on-emerging-tobacco-nicotine-products-sparc/",
  "date_published": "2024-11-07T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):The Society for the Protection of the Rights of the Child (SPARC) is urgently calling for immediate regulation on emerging tobacco and nicotine products, which have seen a troubling rise in popularity among children and youth in Pakistan.\nHealth activists warn that these products, often marketed as safer alternatives to traditional cigarettes, pose significant health risks and contribute to the growing tobacco epidemic, particularly among vulnerable populations.\nDr. Khalil Ahmad, Program Manager at SPARC, expressed grave concern over the tobacco industry’s tactics.\n“The industry is aggressively promoting emerging nicotine products, which are designed to attract young users through appealing marketing strategies that mislead them into believing that these products are less harmful than conventional cigarettes. This deceptive narrative undermines public health efforts and exposes children to addictive substances,” he stated.\nResearch indicates that many young people mistakenly believe that using emerging nicotine products is safe, often leading to increased experimentation and addiction. This trend is particularly alarming, as it fosters a new generation of nicotine users and complicates efforts to reduce overall tobacco consumption in the country.\nDr. Khalil further highlighted the urgent need for regulatory measures.\nThe marketing tactics employed by the tobacco industry are particularly troubling. Emerging tobacco and nicotine products often feature vibrant packaging, trendy designs, and enticing flavors aimed specifically at younger audiences. This intentional targeting has led to a concerning increase in nicotine addiction among minors, with many youth believing they can use these products without significant health risks.\nDr. Khalil Ahmad emphasized the broader implications of this crisis.\n“The tobacco industry is at war against our children’s right to health. By normalizing the use of these emerging products, they jeopardize the well-being of our youth while prioritizing profit over public health. The long-term consequences of widespread nicotine addiction are profound, affecting not only individual health but also the socioeconomic fabric of our society.”\nSPARC calls for comprehensive tobacco control measures that encompass all forms of tobacco and nicotine delivery systems. “We urge the government to introduce stringent policies restricting the sale and production of emerging tobacco and nicotine products, ensuring a healthier future for our children and society,” Dr. Khalil added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:07:42.643Z"
}
