{
  "title": "Public schools show overall improvement, private schools excel in English: PIE reports",
  "link": "https://www.app.com.pk/national/public-schools-show-overall-improvement-private-schools-excel-in-english-pie-reports/",
  "date_published": "2024-11-07T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):The Pakistan Institute of Education (PIE) has released an evaluation report on the performance of students in Grade 4 from public and private educational institutions (low-fee schools) in Islamabad.\nAccording to the results, public school students demonstrated improved performance, with 44% of students achieving a score of 41%. Private school students, however, outperformed in English, with an average score of 46%. Public school boys performed better overall, while private school girls showed stronger performance.\nOn Thursday, PIE held a policy dialogue on improving educational standards, during which the performance comparison of public and private schools in Islamabad was presented.\nSpecial guest Senior Joint Secretary at the Ministry of Education and Vocational Training, Sohail Akhtar emphasized the importance of a comprehensive strategy to enhance educational standards. He stated that the government had implemented several measures, including teacher training, provision of modern teaching materials, and improvements in educational infrastructure.\nSohail Akhtar highlighted the need to reduce class sizes and increase the number of teachers in public schools to ensure that each student receives a quality education. He also stressed the need for a standard framework for monitoring the quality of education in both public and private institutions to achieve uniformity in educational standards across the country.\nDr. Mohammad Shahid Soroya, Director-General of PIE, explained that the report evaluates the academic performance of Grade 4 students in Islamabad using the latest available data from the National Assessment Test. Additionally, surveys conducted with students, parents, and teachers provided further insights into various educational topics.\nThe analysis showed that students in public schools in rural areas performed better than their counterparts in private schools, while private school students in urban areas outperformed public school students.\nHe pointed out that the average class size in public schools is 41 students per class, while private schools have an average of 19 students per class.\nThe larger class sizes in public schools can lead to less individual attention for students. Furthermore, 65% of public school teachers hold a Master’s degree, compared to just 23% in private schools.\nIn terms of teaching experience, 73% of public school teachers have 11 or more years of experience, while only 17% of private school teachers have such experience.\nDr. Soroya also noted that 33% of teachers in private schools teach multiple classes in one day, compared to only 4% of teachers in public schools, indicating a higher teaching workload in private institutions.\nApproximately 70% of students reported that their school is located within 2 kilometres of their home, showing no significant difference between public and private school proximity.\nDuring the survey, many parents of public school students raised concerns about teacher absenteeism, limited teaching materials, and large class sizes.\nIn contrast, parents of private school students expressed greater satisfaction with teacher attendance and the completion of the academic curriculum.\nThe report recommends strengthening quality monitoring in the educational system, particularly by increasing teacher training and the number of teachers in public schools and reducing class sizes. It also suggests developing a standard framework for private schools to ensure they meet at least basic educational standards.\nThese recommendations provide a solid foundation for policymakers to improve the education system.\nDr. Mohammad Zigham Qadeer, Director of Research at PIE, Dr. Tobi Salem, Assistent Professor at Allama Iqbal Open University, Dr. Rafat Jabeen, Director of Academic Affairs at the Federal Education Directorate, Samia Rehman Dogar from FCE, and Member Paro Waqas Mehmood Kayani participated in the discussion.\nThey emphasized the urgent need to introduce standardized teacher training programs in public schools and suggested reducing class sizes to improve student performance. They also stressed the importance of incorporating parents’ opinions and experiences into educational policy planning and ensuring the availability of educational resources.\nAdditionally, they recommended developing a comprehensive framework for both public and private schools, including standardized guidelines and strategies for increasing teacher numbers to improve the overall quality of education.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:07:13.998Z"
}
