{
  "title": "Pakistan’s maritime sector earns 90 bln rupees profit in last FY: Minister",
  "link": "https://www.app.com.pk/national/pakistans-maritime-sector-earns-90-bln-rupees-profit-in-last-fy-minister/",
  "date_published": "2024-11-07T12:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 7 (APP): Federal Minister for Maritime Affairs Qaisar Ahmed Sheikh on Thursday said Pakistan’s maritime sector recorded a profit of 90 billion rupees in last fiscal year due to strategic initiatives and investments aimed at transforming Pakistan into a regional maritime hub.\nAddressing a press conference here at Press Information Department (PID), the minister said the share of maritime earnings in across the globe are almost 8 percent of their GDP, whereas Pakistan’s maritime earnings are 0.5 percent of our GDP which is less than 2 billion.\nThe minister highlighted the growing importance of natural ports, noting that larger vessels are now docking at the country’s ports. Previously, ships carried around 4,000 to 5,000 containers; however, vessels with capacities of 20,000 to 22,000 containers are now arriving. This shift has led to a reduction in global freight costs and significantly increased activity at nearby ports.\nThis year, key among these achievements, the Karachi Port Trust’s global ranking improved from 84 to 61, signaling a boost in operational efficiency, he added.\nHe said the inclination of all companies towards our ports has increased. The world’s biggest companies are showing their interests to invest in Pakistan because from here they can transport their goods to Central Asian States easily.\nThe minister said Abu Dhabi Ports will invest $330 million over the next three years, and global shipping company Hutchison Ports has agreed to invest $1 billion. These partnerships reflect Pakistan’s growing appeal as a destination for maritime investments.\nQaisar said a $2 billion investment agreement was signed with Denmark in the maritime sector. Through this MoU they would invest in infrastructure around ports for the quick consignment movements.\nThe federal minister said his ministry was focusing on improving port efficiency and container management to streamline the processing of these goods, ensuring that shipments were processed in a timely and cost-effective manner.\nHe said recent visit of Secretary General of the International Maritime Organization (IMO), Arsenio Antonio Dominguez Velasco to the Pakistan is great milestone and he personally went to Gadani Ship Breaking Yard and assured his all-out assistance to Pakistan in various areas especially promoting Green energy, port infrastructure.\nThe minister said holding of the International Maritime Conference was a big breakthrough.\nAbout water pollution, minister said it is a critical environmental issue as most of the untreated sewage waste are being discharged directly into the sea. This practice not only degrades marine ecosystems but also endangers marine life. He stressed the role of Sindh government to counter this practice and added the performance of the Marine Pollution Control Board is much better than before.\nThe Federal Minister highlighted the ongoing improvements at Gwadar port’s dredging system, aimed at enhancing the port’s efficiency. Pakistan is also adhering to the International Maritime Organization (IMO) standards in ship recycling, reflecting its commitment to global maritime protocols. For the first time, Pakistan has become a party to the Hong Kong Convention of the International Maritime Organization, he added.\nOn the aquaculture front, the Ministry of Maritime Affairs is working to strengthen export capacity. Reforms are also underway at the Karachi Dock Labour Board to improve labor standards.\nOur government brought amendments to the Pakistan National Shipping Corporation Ordinance, which improved its performance, he added and said that in the next couple of months, permanent chairmen of all port authorities will be appointed. The US Department of Commerce has extended the export of fisheries from Pakistan for two years. Shares of Pakistan National Shipping Corporation increased by 40%, he said.\nReplying to a question, the minister said Pakistan National Shipping Corporation will soon buy new ships.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:06:54.163Z"
}
