{
  "title": "Telenor hosts expert panel on green energy transition to foster climate action",
  "link": "https://www.app.com.pk/national/telenor-hosts-expert-panel-on-green-energy-transition-to-foster-climate-action/",
  "date_published": "2024-11-07T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):Telenor on Thursday hosted a panel discussion on “Climate Change and Green Energy Transition” in line with its commitment to advancing green energy solutions in Pakistan.\nThe event gathered industry experts and leaders to explore the critical role of businesses in addressing climate challenges and promoting sustainable energy practices across the country.\nThe panel discussion was co-organized by The Pakistan Business Council’s Center of Excellence in Responsible Business (CERB) held here at Telenor Campus 345.\nTelenor Pakistan’s CEO, Khurrum Ashfaque, set the stage for the panel discussion by emphasizing the critical need to accelerate green energy adoption.\nHe remarked: “With a substantial footprint across the country, organizations like Telenor Pakistan have a role to play in transitioning to sustainable energy solutions.”\nAshfaque further highlighted the company’s strong commitment to sustainability, outlining the ambitious target to reduce carbon emissions by 50% by 2030, using 2019 as the baseline. He also emphasized the importance of engaging partners in this effort, stating, “Beyond our own operations, we are actively engaging our partners to join us on this decarbonization journey, amplifying our impact across the value chain.”\nDirector and Head of Sustainability at Telenor Asia, Johan Martin Seland delivered a keynote address, where he shared valuable insights into Telenor’s sustainability strategies and achievements.\nHe emphasized that increasing access to renewable energy was central to the green transition, underscoring the need for an enabling policy environment that supported predictable, long-term corporate power purchase agreements. Such policies, he noted, will drive investments in renewable energy projects, fostering a low-emission future in Pakistan.\nThe panel highlighted that cross-sector collaboration and robust sustainable policies are pivotal to unlocking Pakistan’s renewable energy potential. By aligning public and private stakeholders, these partnerships can catalyze innovation in clean energy solutions. This unified approach not only accelerates the transition to renewable energy but also bolsters Pakistan’s resilience to climate challenges, setting the stage for a sustainable and secure future.\nModerated by Mr Ahmad Usman Bhatti, Senior Manager of HSE & Sustainability at Telenor Pakistan, the panel featured notable speakers, including Ms. Sobiah Becker, Advisor for the Pak-German Climate & Energy Partnership at GIZ GmbH, Farhan Haider, Vice President of Network Design and Service Delivery at Telenor Pakistan and Dr. Gul Muhammad Khan, Professor at UET and Director of the Centre for Intelligent Systems and Networks Research (CISNR).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:07:28.431Z"
}
