{
  "title": "Pakistan welcomes UN rapporteur report calling out Israel’s genocidal acts in Gaza, seeking decisive action",
  "link": "https://www.app.com.pk/national/pakistan-welcomes-un-rapporteur-report-calling-out-israels-genocidal-acts-in-gaza-seeking-decisive-action-fo-spox/",
  "date_published": "2024-11-07T09:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 7 (APP):Pakistan on Thursday welcomed the report of the UN Special Rapporteur on the Occupied Palestinian Territories, Francesca Albanese calling out Israel for pushing through a systematic agenda of forced displacement, annihilation, and genocide in Gaza and the West Bank.\n“Pakistan endorses Ms. Albanese’s stance that Israel is obstructing international investigation efforts, including denying the entry of fact-finding teams from the United Nations. We support her call on the international community to act decisively in ending Israel’s unbridled atrocities against Palestinians and to ensure unhindered humanitarian assistance to Gaza, as well as full financing and protection of UNRWA,” Foreign Office spokesperson Mumtaz Zahra Baloch said at her weekly press briefing.\nThe report highlights how Israel has been committing genocide against the Palestinian people through acts of territorial expansion and ethnic cleansing.\nThe spokesperson expressed concerns about Israeli actions against relief workers and agencies, including UNRWA, and its ongoing war on hospitals and vaccination centers.\n“After destroying Gaza’s health infrastructure, Israeli occupation forces are now targeting hospitals in Lebanon. So far, 34 hospitals have been damaged, 111 emergency medical technicians killed, and 107 ambulances targeted in Lebanon,” she said and reiterated Pakistan’s call for an immediate cessation of hostilities in Gaza, Palestine, and Lebanon, the protection of civilians and civilian infrastructure, and unhindered humanitarian access and healthcare to those in urgent need.\nReferring to the reports of the deteriorating health of Kashmiri leader Muhammad Yaseen Malik, who is on a hunger strike protesting poor conditions and insufficient medical care in New Delhi’s Tihar Jail, she urged the Indian authorities to provide quality medical care and immediately release him.\nThe spokesperson also apprised the media of the recent visit of Iranian Foreign Minister Seyed Abbas Araghchi who met Prime Minister Shehbaz Sharif and Deputy Prime Minister Ishaq Dar wherein two sides agreed to strengthen regular high-level exchanges, advance cooperation and dialogue on trade, energy, and security, and enhance border management and people-to-people contacts.\nThe spokesperson announced that Prime Minister Shehbaz Sharif would visit Saudi Arabia to participate in the Second Joint Arab Islamic Summit being held in Riyadh on November 11.\nBeing held at the initiative of the Saudi government to discuss the situation in the Middle East, the summit will be a follow-up to the Joint Arab Islamic Extraordinary Summit held last year on the subject.\nHeads of state and governments and senior officials from Arab League and OIC member countries are expected to participate in the Summit.\nThe spokesperson said that at the summit, the prime minister would reiterate Pakistan’s full support for the Palestinian cause and call for an immediate end to the genocide in Gaza, an urgent and unconditional ceasefire, and an immediate cessation of ongoing Israeli adventurism in the region that endangers the security of countries in the Middle East.\nHe will also call for international protection for the Palestinian people and the establishment of an independent State of Palestine on the borders of 4 June 1967, with Al-Quds Al-Sharif as its capital, besides holding bilateral meetings with participating leaders.\nShe told the media that the prime minister would also visit Baku, Azerbaijan, to participate in the World Leaders Climate Action Summit taking place on November 12-13 as part of the 29th UN Climate Change Conference.\nAt COP29, the Prime Minister will make a robust call for climate solidarity and climate justice based on the established principles of equity and common but differentiated responsibilities and respective capabilities.\nThe COP29 is taking place at a time when millions around the world, including in Pakistan, are facing severe adverse impacts of climate change. As an important stakeholder, Pakistan will continue to make positive contributions to the global climate debate, negotiations, and collective action.\nReplying to a question regarding victory of Donald Trump in US elections, the spokesperson said the President of Pakistan and the Prime Minister of Pakistan have congratulated President elect Donald Trump on his election as the 47th President of the United States. “Our relations with the United States are decades old, and we look forward to further strengthen and broaden Pakistan-US relationship in all fields,” she said adding that Pakistan and the United States would continue to pursue bilateral relations on the basis of mutual respect, mutual confidence and non-interference in each other’s domestic affairs.\nResponding to a question regarding Pakistan’s relations with China and China Pakistan Economic Corridor, she said Pakistan-China relations were ironclad. “Pakistan and China are all weather strategic cooperative partners who have continued to stand by each other over the last several decades. We support each other on core issues of national interest, and our cooperation extends to all domains of foreign policy. China Pakistan Economic Corridor, is an important pillar of our bilateral relationship, and both countries are committed to further expanding and strengthening this partnership,” she added.\nAs regards the matter of Pakistani nationals who were stuck in Myanmar, the spokesperson said “Our Missions in East Asia, including in Myanmar, remain in contact with the relevant authorities for the release and recovery of Pakistani nationals who have been illegally detained by criminal gangs and to assist them in recovery and early repatriation of these individuals to Pakistan. It is transnational criminal networks and organizations operating in parts of Southeast Asia that pose a serious threat to regional security.”\nIshtiaq Ahmed, APP’s Foreign Editor, leads coverage of the Prime Minister, President, Foreign Office, and special assignments, bringing over 20 years of journalism experience from local and international publications – Reach out at 03335293238/ ishtiaqrao@gmail.com/ X: ishtiaqrao\nReferring to the reports of the deteriorating health of Kashmiri leader Muhammad Yaseen Malik, who is on a hunger strike protesting poor conditions and insufficient medical care in New Delhi's Tihar Jail, the spokesperson urged the Indian authorities to provide quality medical care and immediately release him.",
  "retrievedAt": "2025-08-10T15:07:35.078Z"
}
