{
  "title": "Naqvi reaffirms commitment to Chinese security after Karachi incident",
  "link": "https://www.app.com.pk/national/naqvi-reaffirms-commitment-to-chinese-security-after-karachi-incident/",
  "date_published": "2024-11-07T08:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP):Federal minister for Interior Mohsin Naqvi visited the Chinese Embassy in Islamabad following an incident in Karachi where two Chinese nationals were injured by gunfire from a security guard.\nShowing solidarity and diplomatic engagement during his meeting with Chinese Ambassador Jiang Zedong, Minister Naqvi expressed regret over the incident and conveyed Pakistan’s commitment to ensuring justice and enhancing security for Chinese nationals in the country.\nHe conveyed heartfelt sympathy to the injured Chinese nationals and their families, underscoring that Pakistan places the utmost priority on the well-being and security of Chinese citizens, particularly those working on projects under the China-Pakistan Economic Corridor (CPEC).\nHe briefed Ambassador Jiang on the incident’s details and assured him of a swift, transparent investigation to bring those responsible to justice.\nNaqvi highlighted Pakistan’s commitment to aligning its developmental goals with robust security measures, referencing China’s own model of integrated development and security.\nNaqvi stated, “We fully agree with the Chinese approach of combining development with security, and we will ensure the safety of Chinese nationals and projects as a top priority.”\nAddressing concerns surrounding the security of CPEC projects, Naqvi affirmed that Pakistan is taking “all possible measures” to protect Chinese citizens and assets linked to CPEC. He revealed that additional security protocols are being implemented to create a safe and stable environment, especially in regions where Chinese nationals reside or work. Security forces are actively working to bolster protective measures, particularly in Karachi, to prevent similar incidents from occurring in the future.\nNaqvi further assured that Pakistan’s law enforcement agencies are coordinating to enhance security at all CPEC project sites, with a focus on strengthening communication, surveillance, and emergency response capabilities.\nAmbassador Jiang expressed China’s appreciation for Pakistan’s quick response to the Karachi incident and its dedication to securing Chinese interests in the region.\nHe reiterated that China views Pakistan as a “true and enduring partner,” describing the two nations as “iron brothers” who share a resilient and strategic partnership.\n“Through joint efforts, our friendship and cooperation have grown continuously. We value Pakistan’s support and are committed to building a secure environment for mutual growth,” Jiang stated.\nHe emphasized that China is willing to further advance security cooperation and provide resources to enhance Pakistan’s institutional capabilities to protect Chinese nationals.\nThe two officials reached an agreement on developing a joint strategy to prevent similar incidents in the future, emphasizing the need for close communication and a shared approach to security.\nAmbassador Jiang thanked Minister Naqvi for Pakistan’s hospitality and security arrangements during the recent visit of Chinese Prime Minister Li Qiang.\nHe also inquired about the health of President Asif Ali Zardari, conveying well wishes for his recovery. Jiang shared that Chinese President Xi Jinping had sent a letter to President Zardari, extending personal wishes for his health and expressing goodwill toward Pakistan’s leadership.\nThe meeting included senior officials from Pakistan’s Ministry of Interior and high-ranking representatives from the Chinese Embassy, underscoring the enduring commitment on both sides to maintaining a secure environment for Chinese citizens in Pakistan and enhancing cooperation between the two countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:07:58.404Z"
}
