{
  "title": "Moderna Covid-19 vaccine administration starts at F-9 Park MVC: NCOC",
  "link": "https://www.app.com.pk/national/moderna-covid-19-vaccine-administration-starts-at-f-9-park-mvc-ncoc/",
  "date_published": "2021-07-03T18:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP): Health authorities on Saturday started administering the double dose US made Moderna Covid-19 vaccine to eligible population at mass vaccination centre (MVC) F-9 Park in the federal capital.\nThe nerve center of the country in fight against Covid-19 pandemic, National Command and Operation Centre (NCOC), took to Twitter to apprise the general public on vaccine administration of the newly arrived vaccine donated by the United States through COVAX programme.\nThe Forum wrote, “Administration of Moderna Vaccine started at Mass Vaccination Center F-9 Park Islamabad. Moderna Vaccine will be available in selected Covid vaccination centres (CVCs) across the country from Monday Onwards.”\nThe Forum in two separate tweets shared picture of an individual being administered Moderna first jab and details of CVCs locations and detailed guidelines highlighting eligibility criteria for Moderna jabs.\nThe guidelines mentioned that Modema Vaccine will be administered to the following categories, provided they are 18 years of age or older and have not received any other currently available Covid-19 vaccines.\nHowever, post organ transplantation, the patient may receive the vaccine 3 months after transplantation procedure, post chemotherapy, the patient may receive the vaccine 28 days after chemotherapy.\nMoreover, those individuals are eligible with a mandatory requirement of vaccination for travel particularly overseas workers who have a mandatory need for travel for employment overseas with valid work visas/iqama in a country where Chinese vaccines are not accepted at present, students and also those travelling for official or business purposes.\nThe guidelines underscored that women who are pregnant and lactating falling under the above listed categories can receive Modema Vaccine.\nThe Moderna Covid-19 vaccine jabs were deployed at 45 different locations of all the federating units.\nThe vaccine deployment was made at 15 location across Punjab. In Lahore, Expo Center CVC, LDA Sports Complex, in Rawalpindi, Red Crescent CVC, Sargodha had Civil Defense Hall, Faisalabad had Samanabad Sports Complex, Multan had Quiad-e-Azam Academy for education Development, in Gujranwala DHO office CVC,\nBahawalpur Red Crescent MVC, DG Khan Canal rest House Medical College, Sahiwal Sahiwal Club (Panagah), Rahim Yar Kham Sheikh Khalifa Allied Health School, Aziz Bhatti Hospital in Gujrat, Hockey Stadium in Sialkot, Comprehensive Boys School in Jehlum and Chief Executive Health Office in Chakwal.\nThere were 13 locations with Moderna vaccine in Khyber Pakhtunkhwa (KP) Lady Reading Hospital, KTH and HMC in Peshawar, Ayub teaching hospital in Abbotabad, Saidu group of teaching hospital in Swat, Civil hospital Matta in Mansehra,\nDHQ Hospital in Dir Upper, DHQ Hospital in Dir Lower, DHQ Hospital in Bajour, DHQ Hospital in Kohat, DHQ Hospital in Dera Ismail Khan, and MMC Hospital in Mardan.\nThree locations were set up in Balochistan to administer Moderna vaccine where all of them were in Quetta including Banazeer Hospital, SPHBMC Hosp and BMC Hospital.\nThere two locations in Sindh, one each in Karachi and Hyderabad namely Karachi Expo Center and LUHMS in Jamshoroo.\nIn the Islamabad Capital Territory (ICT) there were five locations namely F-9 Park, FGH, PIMS, RHC Tarlai and CDA Hospital in G-6.\nHowever, in Gilgit Baltistan six different locations were established at Gilgit, Hunza\nSkardu and Ghizer districts including MVC and CVC PHQ in Gilgit, MVC in Hunza, MVC Skardu, MVC Ghizer and CVC DHQ Gahkuch.\nFurthermore, five locations were established in Azad Jammu and Kashmir (AJK) including AJK University in Muzzaffarabad, Baldia Hall in Mirpur, Sports complex in Poonch, Baldia hall in Kotli and District complex in Bagh.",
  "retrievedAt": "2025-08-11T20:55:51.479Z"
}
