{
  "title": "Resolution of Kashmir issue vital for regional peace: AJK Speaker at 18th Speakers’ Conference",
  "link": "https://www.app.com.pk/national/resolution-of-kashmir-issue-vital-for-regional-peace-ajk-speaker-at-18th-speakers-conference/",
  "date_published": "2024-12-19T06:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): Azad Jammu and Kashmir Legislative Assembly, Speaker Chaudhry Latif Akbar, on Thursday, emphasised the vital role of coordination in improving the performance of legislative bodies.\nAddressing the 18th Speakers’ Conference, Chaudhry Latif expressed gratitude for the opportunity to participate in the conference, calling it an honour.\nHe also lauded National Assembly Speaker Sardar Ayaz Sadiq for organising the event, describing it as a significant step towards fostering dialogue among legislative leaders.\nHighlighting the plight of the Kashmiri people, Akbar paid tribute to their resilience and bravery, stating, “Sustainable peace in the region cannot be achieved without resolving the Kashmir issue.”\nHe criticised India’s revocation of Articles 370 and 35A, which he said altered the region’s status quo and led to serious human rights violations in Jammu and Kashmir.\nThe AJK Speaker thanked Pakistan’s National Assembly’s Special Committee on Kashmir for its visit to the Line of Control (LoC) and expressed his appreciation to President Asif Ali Zardari and Prime Minister Shehbaz Sharif for addressing the concerns of Kashmiri refugees.\nReferring to the recent elections in Indian Illegally Occupied Jammu and Kashmir (IIOJK), Akbar said the people had firmly rejected the BJP’s policies.\nHe also welcomed Speaker Ayaz Sadiq’s initiative to bring the government and opposition together for dialogue, describing it as a step towards national unity.\n“The United Nations’ 1949 resolution remains the legal foundation of Kashmir’s status,” Akbar stressed, reiterating his commitment to the Kashmir cause.",
  "retrievedAt": "2025-08-10T13:54:44.645Z"
}
