{
  "title": "PM, President of Iran resolve to enhance ties in diverse fields",
  "link": "https://www.app.com.pk/national/pm-president-of-iran-resolve-to-enhance-ties-in-diverse-fields/",
  "date_published": "2024-12-19T16:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): Prime Minister Muhammad Shehbaz Sharif held a bilateral meeting with Iranian President Masoud Pezeshkian on the sidelines of the 11th D-8 Summit here on Thursday.\nBoth leaders hoped that the decisions taken at the D-8 Summit would pave the way for enhanced cooperation among D-8 member states in mutually beneficial areas.\nBoth leaders expressed resolve to further strengthen Pakistan-Iran fraternal ties in all areas of mutual interest, particularly trade and economy, energy, security and regional connectivity.\nPrime Minister Shehbaz Sharif emphasized on utilizing the vast scope in bilateral trade and economic cooperation by identifying new sectors through various existing institutional mechanisms.\nIn order to develop and improve livelihood of border regions, Prime Minister Shehbaz Sharif stressed on the importance to operationalize border markets, which have already been inaugurated and work on the inauguration of remaining markets.\nThe two leaders also highlighted the mutual support extended by the two countries on each other’s core issues and reaffirmed commitment to remain closely engaged on all matters of regional and global significance.\nBoth leaders showed grave concern at the genocide of innocent Palestinians by Israel and agreed to continue raising voice for the oppressed Palestinians.\nThe prime minister reiterated that Pakistan stands in complete solidarity with their brothers and sisters from Palestine, Lebanon and Syria.\nHe conveyed profound regards to His Eminence, the Supreme Leader of Iran.\nThe prime minister also congratulated Iran on becoming a full member of BRICS and requested Iran’s support for Pakistan’s membership of BRICS. He also extended an invitation to President Masoud Pezeshkian to visit Pakistan.",
  "retrievedAt": "2025-08-10T13:53:21.792Z"
}
