{
  "title": "18th Speakers’ Conference emphasizes unity, legislative reforms, and democratic progress",
  "link": "https://www.app.com.pk/national/18th-speakers-conference-emphasizes-unity-legislative-reforms-and-democratic-progress/",
  "date_published": "2024-12-19T10:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): The 18th Speakers’ Conference, inaugurated at the Parliament House in Islamabad on Thursday, brought together parliamentary leaders from across Pakistan to discuss pressing national issues, legislative reforms, and the strengthening of democracy.\nNational Assembly Speaker Sardar Ayaz Sadiq presided over the two-day event, attended by speakers of provincial assemblies, Gilgit-Baltistan, Azad Jammu and Kashmir, and key parliamentary leaders.\nIn his keynote address, Speaker Ayaz Sadiq underscored the need for consistent reforms in parliamentary processes and called for greater collaboration among stakeholders to resolve constitutional, legal, and governance challenges.\n“Mistakes from the past must be corrected,” he said, highlighting the significance of legislative bodies in addressing issues like climate change, economic stability, and unemployment.\nSadiq also emphasized the importance of empowering young minds through initiatives like the National Assembly’s internship program.\nSpeakers from provincial assemblies echoed Sadiq’s sentiments.\nSindh Assembly Speaker Awais Qadir Shah called for unity and technology-driven legislative empowerment, while Punjab Assembly Speaker Malik Ahmad Khan stressed the importance of dialogue to maintain national unity.\nKhyber Pakhtunkhwa Speaker Babar Saleem Swati highlighted the sanctity of the Constitution and the need for inter-legislative communication to uphold democratic values.\nBalochistan Assembly Speaker Captain (Retd) Abdul Khaliq Achakzai emphasized self-reliance and peace-building, while Gilgit-Baltistan Speaker Nazir Ahmed lauded the conference as a step towards strengthening civil governance.\nAzad Jammu and Kashmir Legislative Assembly Speaker Chaudhry Latif Akbar reiterated Pakistan’s unwavering support for Kashmir and condemned India’s actions in the region.\nThe conference, revived after a decade-long hiatus, also saw calls for institutionalizing annual sessions to foster legislative collaboration and unity.\nParticipants praised Sardar Ayaz Sadiq’s leadership in convening the forum, terming it a milestone for democratic progress.\nAs the conference continues, legislative leaders aim to build consensus on key national issues, reaffirming their commitment to transparency, accountability, and democratic values in Pakistan.",
  "retrievedAt": "2025-08-10T13:54:31.430Z"
}
