{
  "title": "Maintenance of law & order in Kurram prime responsibility of KP govt: Senate told",
  "link": "https://www.app.com.pk/national/maintenance-of-law-order-in-kurram-prime-responsibility-of-kp-govt-senate-told/",
  "date_published": "2024-12-19T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP):Minister for Overseas Pakistanis and Human Resource Development Chauhdry Salik Hussain on Thursday informed the Senate that maintenance of law and order is the prime responsibility of the provincial government in Khurram District under the constitution.\nResponding to a Calling Attention Notice raised by Raja Nasir Abbas about the deteriorating law and order situation of Parachinar, District Kurram, resulting into loss of lives and shortage of medicines and food items due to closure of main Peshawar–Parachinar road leading to humanitarian crisis in the area, the minister said that Federal government has already offered complete assistance to the provincial government in this regard.\nHe said that the governor Khyber Pakhunkhwa who is representative of the federal government had also convened a Jirga to sort out the issue but the Chief Minister did not bother to participate in it.\nHe went on to say that the politics should be set aside while dealing such grave issues. Earlier, raising the notice, Raja Nasir Abbas said that hundreds of thousands  innocent people have been killed in Khurram so far. 99 percent of the people do not want to fight each other, he added.\nHe said some anti-social elements want to pitch both Suni and Shia sects each other for their divide and rule policy. Coming hard on the provincial government, he said that the KP government appointed an incompetent person as a spokesperson who doesn’t know about peace and security.\nHe said that a committee of the House should also be constituted to look into this grave issue. He also called upon the central, provincial governments and the interior minister to take notice of the matter and take concrete steps for reopening of the road immediately so medicines and other essential food items can be sent to Kurram district.\nMeanwhile, the House also offered Fateha for the departed souls of innocent people who lost their lives in Kurram.  Raja Nasir Abbas led the Fateha on the request of Chair.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:53:43.853Z"
}
