{
  "title": "US sanctions on NDC, commercial entities biased, defy security objectives: FO",
  "link": "https://www.app.com.pk/national/us-sanctions-on-ndc-commercial-entities-biased-defy-security-objectives-fo/",
  "date_published": "2024-12-18T20:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): Pakistan on Wednesday calling the US decision to impose sanctions on NDC and three commercial entities as “unfortunate and biased” said it defied the objective of peace and security.\n“Pakistan considers the US decision to impose sanctions on NDC and three commercial entities as unfortunate and biased,” according to a Foreign Office statement issued on late Wednesday night.\nThe Foreign Office’s reaction came after the United States designated Pakistan’s National Development Complex (NDC), Affiliates International, Akhtar and Sons Private Limited, and Rockside Enterprise for sanctions pursuant to Executive Order (E.O.) 13382.\n“Pakistan’s strategic capabilities are meant to defend its sovereignty and preserve peace and stability in South Asia. The latest installment of sanctions defies the objective of peace and security by aiming to accentuate military asymmetries. Such policies have dangerous implications for strategic stability of our region and beyond,” the Foreign Office statement said.\nIt said that Pakistan’s strategic programme was a sacred trust bestowed by 240 million people upon its leadership. The sanctity of this trust, held in the highest esteem across the entire political spectrum, cannot be compromised.\n“We also regret the imposition of sanctions on private commercial entities. Similar listings of commercial entities in the past were based on mere doubts and suspicion without any evidence whatsoever.”\nIt said that while claiming strict adherence to non-proliferation norms, licensing requirement for advanced military technology to other countries had been waived off in the past.\n“Such double standards and discriminatory practices not only undermine the credibility of non-proliferation regimes but also endanger regional and international peace and security,” it added.",
  "retrievedAt": "2025-08-10T13:54:46.098Z"
}
