{
  "title": "PM, Turkish President discuss bilateral ties",
  "link": "https://www.app.com.pk/national/pm-turkish-president-discuss-bilateral-ties/",
  "date_published": "2024-12-19T16:46:00.000Z",
  "source": "APP",
  "content": "CAIRO, Dec 19 (APP):Prime Minister Muhammad Shehbaz Sharif held a bilateral meeting with the Turkish President Recep Tayyip Erdogan on the sidelines of 11th D-8 Summit here on Thursday and discussed bilateral ties and matters of mutual interest.\nThe prime minister underscored that the historic, fraternal and multi-dimensional relations between Pakistan and Turkiye are without parallel and have withstood the test of time.\nHe noted with deep appreciation tremendous strides made by Türkiye under President Erdogan’s leadership. Prime Minister Shehbaz Sharif emphasized that the two countries should increase economic cooperation in new areas for foreign investment and joint ventures, particularly in IT, agriculture and green technology.\nThe two leaders held wide-ranging talks and discussed further strengthening of bilateral relations, particularly boosting economic ties to achieve the bilateral trade target of US$ 5 billion set by the two leaders. They agreed to continue to work together for further deepening economic, trade, and defense cooperation.\nThe two leaders also reiterated their resolve to support each other on core issues of national interest including Turkiye’s support for Jammu & Kashmir and Pakistan’s support for Turkiye’s stance on the Cyprus issue.\nWhile condemning the Israeli genocidal actions against the innocent Palestinians, particularly the worsening situation since 7 October 2023, the two leaders reaffirmed their unwavering support for the Palestinian people and their legitimate aspirations for a promised homeland. They also discussed the latest situation in the Middle East and Syria.\nPresident Erdogan said that Pakistan-Turkiye brotherhood and friendship is deep rooted in history and the people of Turkiye have a special place in their hearts for Pakistan.\nHe highlighted the enhanced collaboration between the two countries in various fields. President Erdogan stressed the need to closely work together to promote regional peace and stability.\nPresident Erdogan appreciated notable improvement in Pakistan’s economy under Prime Minister Shehbaz Sharif. He also lauded Pakistan for sending substantial humanitarian support to Palestine and Lebanon.\nPrime Minister Shehbaz Sharif renewed his invitation to President Erdogan to visit Pakistan at his earliest convenience for co-chairing the 7th session of High-Level Strategic Cooperation Council in Islamabad.",
  "retrievedAt": "2025-08-10T13:53:21.794Z"
}
