{
  "title": "President for greater parliamentary cooperation, exchanges with Saudi Arabia",
  "link": "https://www.app.com.pk/national/president-for-greater-parliamentary-cooperation-exchanges-with-saudi-arabia/",
  "date_published": "2024-12-19T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): President Asif Ali Zardari has emphasized the need for enhancing parliamentary cooperation and high-level exchanges with the Kingdom of Saudi Arabia (KSA) to further deepen the fraternal relationship between Pakistan and KSA.\nThe President reaffirmed Pakistan’s commitment to further strengthening economic, political, and cultural ties with KSA for the mutual benefit of both nations while talking to the Chairman of the Shura Council of KSA, Dr Abdullah bin Mohammad bin Ibrahim Al-Sheikh, who along with members of the Shura Council called on him, at Aiwan-e-Sadr, a President Office’s press release said.\nSpeaker National Assembly, Sardar Ayaz Sadiq, Deputy Speaker National Assembly Syed Ghulam Mustafa Shah, Ambassador of Saudi Arabia to Pakistan, Nawaf Bin Said Al-Malki, members of Parliament and senior government officials also attended the meeting.\nWelcoming the delegation, the President said that Pakistan and Saudi Arabia enjoyed historic and brotherly ties, rooted in shared faith, history, and culture. He highlighted the immense potential for expanding economic and investment cooperation and called for making efforts to fully realize this potential.\nThe President expressed concern over the grave situation in the Middle East, arising out of the Israeli aggression targeting innocent civilians in Palestine, Lebanon and Syria. He said that Pakistan stood in complete solidarity with their brothers and sisters from Palestine, Lebanon, and Syria.\nThe President conveyed his greetings and good wishes to the Custodian of the Two Holy Mosques, His Majesty King Salman bin Abdulaziz, and His Royal Highness Prince Muhammed bin Salman. He said that the people of Pakistan prayed for the good health, well-being and long life of His Majesty King Salman bin Abdulaziz.\nDuring the meeting, both sides emphasized the need to transform the longstanding bilateral relationship into a more robust and strategic partnership. Dr Al-Sheikh described his visit to Pakistan as highly productive, noting that he had fruitful discussions with Pakistan’s leadership and parliamentarians.\nChairman of the Shura Council of KSA conveyed the greetings and good wishes of His Majesty King Salman bin Abdulaziz and His Royal Highness Prince Muhammed bin Salman for the President’s health.",
  "retrievedAt": "2025-08-10T13:54:08.995Z"
}
