{
  "title": "Pakistan’s ICT exports reach record $3.223 billion, NA told",
  "link": "https://www.app.com.pk/national/pakistans-ict-exports-reach-record-3-223-billion-na-told/",
  "date_published": "2024-12-19T11:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): Ms. Shaza Fatima Khawaja, the Minister for Information Technology and Telecommunication, stated that remittances from Telecommunications, Computer, and Information Services hit a record high of $3.223 billion in exports during the fiscal year 2023-24.\nIn response to Malik Shakir Bashir Awan’s question in the National Assembly, she highlighted that Pakistan’s ICT sector saw a 24% growth, adding US$ 627 million to the US$ 2.596 billion achieved in FY 2022-23.\nMinister Khawaja highlighted that the\nIT & ITeS industry achieved a record trade surplus of US$ 2.827 billion in FY 2023-24, marking a 22.31% increase from the previous year’s surplus of US$ 2.297 billion.\nDespite the services sector’s overall trade deficit, the ICT sector led the way, contributing 41.29% of total service exports, with other business services following at $1.550 billion.\nShaza Fatima also pointed to Pakistan’s efforts in workforce development, including the DigiSkills.pk program, which has seen over 4.5 million enrollments in high-demand freelancing courses, empowering youth, especially women, to capitalize on global freelance markets.\nFurthermore, over 6,100 professionals have been certified in cutting-edge technologies like AI, cybersecurity, and cloud computing, ensuring a competitive edge in the global market.\nThe Minister emphasized the success of initiatives like the Academia Bridge program, which has trained over 1,600 graduates in high-demand IT skills, and the launch of new IT parks across the country. The Islamabad IT Park, scheduled for completion by 2025, will create 7,500 jobs and add $70 million annually to IT exports, while the Karachi IT Park, set for 2027, is expected to create 15,000 jobs and contribute $100 million annually.\nMinister Khawaja expressed confidence that these efforts, alongside the establishment of 250 co-working centers for freelancers by 2027, will strengthen Pakistan’s position as a leading player in the global IT landscape.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:54:16.606Z"
}
