{
  "title": "USAID, HEC to support research offices in Pakistani varsities",
  "link": "https://www.app.com.pk/national/usaid-hec-to-support-research-offices-in-pakistani-varsities/",
  "date_published": "2024-12-19T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP):The United States Agency for International Development (USAID), through its Higher Education System Strengthening Activity, on Thursday organized a four-day training workshop on proposal writing and grant management for public sector universities in Pakistan.\nIt was hosted by Fatima Jinnah Women University (FJWU), this event aimed to enhance the effectiveness of Offices of Research, Innovation, and Commercialization (ORICs) at select universities across the country, said a press release.\nThe workshop was attended by 60 faculty members and officials from 16 universities.\nThe closing session was chaired by Noor Amna Malik, Managing Director, National Academy of Higher Education (NAHE), Higher Education Commission, alongside Kate Somvongsiri, Mission Director for USAID/Pakistan, and Dr Bushra Mirza, Vice Chancellor of FJWU.\nNoor Malik highlighted the importance of strengthening the relationship between academia and research. “Pakistan must close the gap between academia and industry by enhancing research and development facilities to support both local and international industries,” she stated.\nUSAID/Pakistan Mission Director Kate Somvongsiri emphasized the agency’s commitment in strengthening research initiatives, particularly in building knowledge in environmental management. “We are proud that our partnership with all 16 universities and the Higher Education Commission is laying the foundations for continued economic growth and development in Pakistan,” she said.\nDr Michael Barber, Professor at the University of Utah, encouraged greater collaboration among Pakistani faculty researchers. “It is essential to support local researchers in conducting applied research and engaging with both local and international peers to secure research funding,” he explained. “Pakistan’s higher education sector can play a leading role in advancing research and innovation.”\nThe Higher Education System Strengthening Activity, implemented by the University of Utah, supports the HEC and 16 partner universities across Pakistan to enhance institutional capacity for market-driven education and research. For more information on USAID/Pakistan’s support in the education sector, visit: usaid.gov/pakistan/education.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:54:06.745Z"
}
