{
  "article_id": "2025-01-05_2ee2e2abd346e6afce81a8590f9a364b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883216/petroleum-exploration-limited-acquires-energy-assets-from-kuwaiti-firm",
    "retrieved_at": "2025-08-26T07:27:16.596Z"
  },
  "metadata": {
    "title": "Petroleum Exploration Limited acquires energy assets from Kuwaiti firm - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-05T04:03:12.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 215,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: Petroleum Exploration (Pvt) Ltd has acquired energy assets from Kuwait Foreign Petroleum Exploration Company (KUFPEC), including the acquisition of oil and gas concessions located in Dadu, Kirthar, Tajjal, and Qadirpur. This includes Bhit and Qadirpur leases, expanding the company's exploration portfolio and strengthening its presence in the energy sector. The company has announced that acquiring some of the country's most energy-rich regions will help harness the country's untapped energy potential and solidify PEL's position in this sector. In a statement, PEL chief executive Shahzad Zaheer said that the acquisition aligns with the long-term strategy of the company to continue exploring the world, discovering energy and unlocking the country's vast energy resources, as it will extend the local presence in the country's energy security at a time when the sector faces immense challenges. \"We are confident that the addition of these assets will help us drive forward our mission to meet the growing energy demands of Pakistan,\" Mr Zaheer added. The company has said that currently, the energy sector of Pakistan is facing multiple challenges, including rising energy demands, high import costs, and inadequate domestic production, and the added reserves and production capacity from the acquired assets will help reduce reliance on costly energy imports like Liquefied Natural Gas. Published in Dawn, January 5th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}