{
  "article_id": "2025-01-05_b935622d5c5138d1bc725113554b5402",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883109/terrorist-hideouts-destroyed-during-kps-karak-operation",
    "retrieved_at": "2025-08-26T07:27:27.957Z"
  },
  "metadata": {
    "title": "Terrorist hideouts destroyed during KP’s Karak operation - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-05T02:39:35.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 509,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "LAKKI MARWAT: A clean-up operation was launched in the mountainous terrain of Banda Daud Shah in Karak district on Saturday to flush out terrorists and eliminate their hideouts. \"Commanded by district police officer Shahbaz Elahi, a large police contingent assisted by the commandos of Counter-Terrorism Department took part in the daylong offensive,\" an official said. He said that the cops equipped with modern gadgets and armed with light, heavy and thermal weapons raided suspected hideouts of criminals and anti-social elements in the mountainous areas near Ali Khankhel and Jata Ismailkhel localities. The official claimed that several hideouts of miscreants were destroyed, but he did not disclose the details about any arrests. DPO seeks people's help to make actions against criminal gangs effective On the occasion, the district police officer said that the police were fully committed to ensuring writ of law in the region. He asked the citizens to cooperate with the police so that actions against criminal gangs and narcotics peddlers could be made result-oriented. FOOD STREETS OPENS: Provincial minister for public health engineering Pakhtoonyar Khan along with deputy commissioner Abdul Hameed Khan inaugurated a food street in the Bannu city on Saturday. Speaking at the inaugural ceremony, the minister said with the completion of the food street project, the Khyber Pakhtunkhwa government had realised another promise made with the people of Bannu. \"The area where a state-of-the-art food street has been established was used as a cattle market in the heart of the urban locality,\" he said. Mr Pakhtoonyar said the cattle market was shifted outside the city in the larger interest of cattle traders. He said the district administration would soon allot shops and outlets to traders in the food street. He said work on setting up a park adjacent to the food street was near completion. Also in the day, the provincial minister met regional police officer Imran Shahid and discussed the overall law and order situation in the region. He declared that lasting peace was inevitable for sustainable development and praised the police actions against criminals. The minister said the bravery and valour of the Khyber Pakhtunkhwa police in the war on terror had been acknowledged at all levels. DISPUTE RESOLVED: A local jirga resolved a murder enmity between two families in Jhangkhel area of Lakki Marwat district on Saturday. Local residents said the enmity had claimed a life a few years ago when a man was killed during a cricket match in the village. \"Both the families had since been at loggerheads, and this was proving detrimental to the area's peace,\" they said. The residents said a jirga of local elders and clerics intervened and convinced both parties to patch up their enmity in the larger interest of the area and for their own future. When elders of both the families accepted the jirga decision, 'nanawatey' (a traditional ceremony where the accused party offers repentance to the complainant party) was held where elders from both the sides hugged each other and vowed to live peacefully in future. Published in Dawn, January 5th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}