{
  "article_id": "2025-01-05_9459c5d0da62d14771a6d45fb4827568",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883250/kp-govt-spokesperson-vows-peace-at-all-costs-day-after-attack-on-kurram-dc",
    "retrieved_at": "2025-08-26T07:27:13.675Z"
  },
  "metadata": {
    "title": "KP govt spokesperson vows peace ‘at all costs’, day after attack on Kurram DC - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-05T09:18:36.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 290,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Khyber Pakhtunkhwa government spokesperson Barrister Muhammad Ali Saif on Sunday said that peace would be ensured in Kurram \"at all costs\", a day after Deputy Commissioner (DC) Javedullah Mehsud was injured when unknown assailants fired at a convoy he was travelling in near Bagan. The KP government on Wednesday said that both warring sides in Kurram districts had finally signed a peace agreement after more than three weeks of efforts to broker a ceasefire amid violence in the area. Clashes stemming from decades-old land disputes have claimed at least 130 lives in Kurram since November, with food and medicine shortages reported due to weeks-long road blockades. The main sit-in against road closures in the district, held outside the Parachinar Press Club, persisted. Meanwhile, following yesterday's shooting incident, the Bagan protest sit-in was relocated to Manduri, where the Bagan tribes continued to hold a demonstration for their demands. In a statement issued today, the KP government spokesperson said that according to the agreement signed between the parties earlier this week, peace will be ensured in Kurram \"at all costs\". \"We will fight the enemies of peace with iron fists,\" Barrister Saif said. Saif termed the attack on DC Mehsud a \"failed nefarious conspiracy\" to sabotage peace and said that people should be wary of those who want disruption, calling on the locals to cooperate with the administration and government to ensure lasting peace. The attack was condemned by all senior governing bodies, including the president and premier. The chief minister has taken strict notice of the attack and directed that those involved be brought to justice, he said. He added that the aid convoy - carrying food and other necessities - was stopped temporarily and will be sent after receiving clearance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}