{
  "article_id": "2025-01-05_ad886fbd8703933ac57539261104f8de",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883188/soldier-in-tesla-blast-suffered-from-ptsd-fbi",
    "retrieved_at": "2025-08-26T07:27:18.031Z"
  },
  "metadata": {
    "title": "Soldier in Tesla blast suffered from PTSD: FBI - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-05T02:52:00.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 218,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LOS ANGELES: The decorated Green Beret, who died by suicide in a blazing Cybertruck outside a Trump hotel in Las Vegas, was suffering from post-traumatic stress disorder (PTSD), investigators said on Friday, adding that they had found no links to \"terrorist\" groups. Matthew Livelsberger, 37, a member of the elite US special forces, shot himself on New Year's Day in the rented Tesla vehicle filled with fuel containers and fireworks, which exploded. Seven people nearby in the valet area of the glass-fronted Trump International Hotel were wounded in the blast. \"Although this incident is more public and more sensational than usual, it ultimately appears to be a tragic case of suicide involving a heavily decorated combat veteran who was struggling with PTSD and other issues,\" FBI Special Agent Spencer Evans told a press conference. Investigators said they were still examining Livelsberger's devices but that so far, they had found two letters on his phone in which he spoke of the \"burden\" of having taken lives, among other issues. \"[W]e're also aware that there were potential other family issues or personal grievances in his own life that may have been contributing factors,\" the FBI official pointed out. He said investigators have \"not identified any connection between this subject and any other terrorist organisation.\" Published in Dawn, January 5th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}