{
  "article_id": "2025-01-05_833e0470642e8f1f360f073f7186b432",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883178/south-africas-colourful-minstrel-carnival-draws-thousands",
    "retrieved_at": "2025-10-12T00:43:30.324Z"
  },
  "metadata": {
    "title": "South Africa’s colourful minstrel carnival draws thousands - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-05T02:37:58.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6779d8c9a07f5.gif",
    "categories": [],
    "word_count": 272,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "CAPE TOWN: Thousands of colourfully costumed minstrels paraded through Cape Town on Saturday in an exuberant century-old carnival rooted in the South African city's history of slavery that drew large crowds of spectators. In glitzy uniforms matched with flashy hats, parasols and face paint, the marchers walked and danced through the city's historic centre in an annual event that an organiser said had grown to become the biggest such parade on the continent. The highly anticipated New Year parade celebrates Cape Town's mixed-raced community descended from slaves brought from Africa, Southwest Asia and Indian Ocean territories after the city was settled by the Dutch in the 1650s. It is celebrated every year on Jan 2, as slaves at the time of Dutch colonisation were permitted to celebrate the new year in their own way. Because of this, the festival came to be known as \"second New Year\". Organisers said 18 troupes of around 20,000 performers took part in this year's event, with marchers from all ages and accompanied by trumpets, trombones and tambourines. The first formal parade was held in 1907, Muneeb Gambeno, director of the Kaapse Klopse Karnival Association that organises the event, told broadcaster SABC, with slavery abolished in Cape Town in 1834. Similar to London's Notting Hill Carnival, it is the biggest event of its kind on the African continent, he said. A prime location for Cape Town's history, the Grand Parade is where crowds gathered to watch Nelson Mandela's first address to the nation as a free man after 27 years in jail, made from the balcony of the Old Town Hall. Published in Dawn, January 5th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}