{
  "article_id": "2025-01-05_03b8604fdf0e5ff9daab9cf1a24546ca",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883162/real-go-top-as-late-bellingham-strike-earns-win-at-valencia",
    "retrieved_at": "2025-10-12T00:42:49.295Z"
  },
  "metadata": {
    "title": "Real go top as late Bellingham strike earns win at Valencia - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-05T02:38:46.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6779c9f546b5f.gif",
    "categories": [],
    "word_count": 402,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "VALENCIA: Late strikes from Luka Modric and Jude Bellingham earned 10-man Real Madrid a 2-1 comeback win at relegation-threatened Valencia on Friday as the visitors moved top of the La Liga standings. Real were a goal down with five minutes to go, but mounted another trademark comeback with Bellingham's winner arriving seven minutes into stoppage time as Real moved on to 43 points, two clear of second-placed Atletico Madrid, who have a game in hand. The match started in a thrilling fashion as Real's Federico Valverde and Valencia's Hugo Duro both went close to breaking the deadlock within the first minutes, only to see their efforts blocked. Duro then put Valencia ahead in the 27th minute by tapping into an open goal after Thibaut Courtois had blocked Javi Guerra's first close-range effort. Real pushed hard for an equaliser, but Bellingham missed a golden chance to score with a poor penalty that hit the post after Enzo Barrenechea's foul on Kylian Mbappe in the 55th minute. Mbappe thought he had equalised five minutes later, but his strike was disallowed by the VAR for offside. Carlo Ancelotti's side were then reduced to 10 men in the 79th minute when Vinicius Jr was shown a straight red card for slapping Valencia goalkeeper Stole Dimitrievski. The Brazil forward later apologised for his behaviour on his X account where he wrote: \"Sorry and thank you team\". But substitute Modric finally brought the visitors level when he beat Dimitrievski with a low shot off Bellingham's through ball five minutes from time. The England midfielder then sealed the win, bearing down on goal before calmly beating the keeper with a right-footed finish to hand the hosts their first loss under new coach Carlos Corberan. \"The missed penalty gave (Bellingham) extra motivation, he gave a few minutes as only he can do. He worked hard, the goal is a deserved reward for him for the game he played,\" coach Ancelotti told reporters. Valencia remain second-bottom with 12 points, four points from the safety zone. \"It hurts a lot to lose like this. We are not in a good momentum and we had chances,\" Valencia striker Duro told Movistar. \"It hurts a lot to lose the advantage like that, especially after the sending off. We have to focus on the pitch. Whatever is on the outside doesn't matter to us. The fans have helped us.\" Published in Dawn, January 5th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}