{
  "title": "Indian origin citizen tries to attack White House, “seize power”",
  "link": "https://www.app.com.pk/national/indian-origin-citizen-tries-to-attack-white-house-seize-power/",
  "date_published": "2023-05-26T16:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP):People in India had fallen victim to the ideology of extremism and this extremist thinking was reflected in an incident in which an Indian origin citizen tried to enter the White House in Washington and carry out an attack.\nAccording to Hindustan Times, the U.S. authorities this week arrested 19-year-old, Indian-origin Sai Varshith Kandula for crashing truck into White House barriers when Joe Biden was inside.\nThe young man who was accused of deliberately crashing a rented U-Haul truck into the White House barrier told authorities that he wanted to get inside the mansion to “seize power” and “kill” US President Joe Biden, according to media reports.\nUS Park Police arrested Sai Varshith Kandula after he crashed the truck into the security barriers on the north side of Lafayette Park shortly before 10 pm on Monday, sending multiple pedestrians running from the scene, The Washington Times reported.\nKandula, of Chesterfield, Missouri, rented the truck on Monday night immediately after flying from St Louis to Dulles International Airport on a one-way ticket, a Secret Service agent said in a statement of facts filed in federal district court in Washington DC, NBC News reported.\nHe drove the vehicle onto a sidewalk outside the White House and into a metal barrier just north of the White House, according to the document.\nKandula put the truck in reverse and crashed into the barrier a second time before United States Park Police officers took him into custody, according to the document.\nKandula told authorities he had been planning the attack for six months and detailed the plans in a “green book,” the document says.\nHe “stated his goal was to ‘get into the White House, seize power, and be put in charge of the nation,'” the document states.\n“When agents asked how he would seize power, Kandula stated he would ‘kill the President if that’s what I have to do and would hurt anyone that would stand in my way.'” The document was included with a criminal complaint charging Kandula with depredation of property of the United States over USD 1,000, the NBC News report said.\nWhen Secret Service agents asked Kandula about a flag with a Hakenkreuz symbol he removed from a backpack, he allegedly said he’d bought it online because Nazis “have a great history,” according to the court document.\nHe allegedly said he “admires their ‘authoritarian nature, Eugenics, and their one world order,'” according to the document. Kandula identified Hitler as a “strong leader” he admires, the report said.\nThe US federal agents are investigating the matter.",
  "retrievedAt": "2025-08-11T08:33:46.216Z"
}
