{
  "title": "Giant blue whale found dead drifting towards Jiwani coast near Gwadar",
  "link": "https://www.app.com.pk/national/giant-blue-whale-found-dead-drifting-towards-jiwani-coast-near-gwadar/",
  "date_published": "2023-05-26T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP):The giant blue whale found dead in the sea near Jiwani tehsil of Gwadar District is drifting towards the coast that might explode due to the corpse’s decomposition causing a serious health hazard for the local masses.\nThe dead whale was swept away by the waves of the sea that came close to the shore of Bandri Beach of Jiwani.\nWorld Wildlife Fund for Nature (WWF-Pakistan) senior researcher Sudhir Baloch, a native of Gwadar, was the first to respond to the emergency and reached the spot. He dived into the water to reach the largest mammal floating overwater as it was not close to shore and easily accessible for examination.\nThe dead whale as per the initial report was around 36 feet long whereas its weight was unknown.\nThe local authorities amid preemptive measures have started sensitizing the local population to abstain from reachingthe spot as the bulging carcass of the whale could shatter releasing the decayed entrails and rotten stench in the atmosphere.\nA WWF senior official told APP that Pakistan hosts different species of whale from the blue whale to humpback whaleand melon-headed whale. The whales of Pakistan and India were mercilessly hunted by Russian ships in 1964 and excessively hunted after the 1950s across the world which endangered its population.\nGwadar Development Authority (GDA) Director General, Mujeeb ur Rehman Qambrani has decided to preserve the remains and carcass of the dead whale as taxidermy for public awareness and education related to the largest mammal found the ocean of the country.\nThe Director General GDA has directed the Deputy Director Environment of the Authority and Marine Expert Abdur Raheem Baloch to take proper measures for the taxidermy of the whale.\nThe Marine Expert Abdur Raheem Baloch informed that Blue Whale that was found along the shores of Makran off andon which had a length of 29.9 meters (98 feet) and weighed upto 199 tonnes.\nHe added that it was the largest animal of the world due to its gigantic size and mass whereas its species were facinga plethora of risks and dangers. The International Union for Conservation of Nature (IUCN) had declared the Blue Whale as an endangered animal till 2018 as it was facing multifaceted manmade risks like collision with ships, marine pollution, ocean-based noise, and climate change.\nHe added that the taxidermy of the whale would help educate the masses to play their role in the conservation and protection of the endangered species. Baloch said he would himself visit the spot to examine the corpse of the whale to ensure its preservation on scientific lines, whereas another whale had already been preserved at Jiwani.",
  "retrievedAt": "2025-08-11T08:33:46.258Z"
}
