{
  "title": "NDMA advisory puts provincial depts on guard against impending wind-dust, thunderstorm rain",
  "link": "https://www.app.com.pk/national/ndma-advisory-puts-provincial-depts-on-guard-against-impending-wind-dust-thunderstorm-rain/",
  "date_published": "2023-05-26T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP):The National Disaster Management Authority (NDMA) on Friday issued an advisory to all the federal and provincial departments concerned to ensure precautionary measures against wind-dust and thunderstorm rain forecast in the Upper and Central parts of the country.\nThe NDMA in light of the Met Office weather forecast issued the advisory stating Wind-Dust and Thunderstorm-Rain was expected in upper and central parts of the country with temperatures remaining normal to below normal (May 28 – 31).\nIt added that Pakistan Meteorological Department (PMD) forecast that a westerly wave was likely to enter the western and upper parts of the country on May 28 and would likely persist until May 31.\nUnder the influence of this weather system, wind-dust, thunderstorm and rain was expected in Punjab, Balochistan, and Sindh.\nHowever, wind-dust, thunderstorms, rain, few hailstorms and isolated heavy walls with occasional gaps were expected in the Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB), Khyber Pakhtunkhwa (KP), Punjab and Islamabad Capital Territory (ICT) urban and rural areas during the period.\nIn the light of the forecast shared by PMD, following impacts namely dust or windstorm may cause damage to loose structures such as under-construction buildings, hoardings and tall trees etc., strong winds may cause damage to standing crops, heavy rainfall may cause landslides or avalanches and disrupt traffic flow, heavy hailstorms and thunderstorms can endanger lives (human & livestock) and property.\nThe provincial disaster management authorities and others were required to undertake measures as per respective mandates.\nThe local administrations to assess and plan deployment of additional resources and exercise control over traffic leading to and in vicinity of vulnerable or choke, points, tourist spots and attractions.\nThe local administration will secure loose infrastructure such as buildings under construction and advertisement hoardings etc to prevent losses/ damages and save precious lives.\nMoreover, engage local communities at traditionally, historically dangerous, hazard-prone sites to enable round the clock monitoring and establish feedback mechanism for early warnings and alerts for at-risk population.\nIt also demanded to coordinate with relevant district and municipal administrations to ensure mitigation & preparedness measures for landslides, flash flooding, hill torrents and to secure or remove billboards or hoardings in view of thunderstorms, high winds and hailstorms.\nThe farmers should also be advised to take all necessary precautionary measures to safeguard their crops, i.e. timely harvesting, safe storage or any other precaution from adverse effects of dust-wind-thunderstorms and hailstorms.\nThe cattle and sheep herders should be advised to undertake necessary mitigative and precautionary measures to protect their livestock, i.e. safe sheltering or any other precaution from adverse effects of dust-wind-thunderstorms and hailstorm.\nThe NDMA demanded that the travelers on provincial and National Highways in at-risk or affected areas be forewarned of adverse conditions and detoured to safe waiting areas under guidance of respective PDMAs, Local Authorities, National Highway & Motorway Police, law enforcement agencies (LEAs) etc.\nThe general public was advised to seek shelter in safe areas such as sturdy buildings or underground structures during dust-wind-hail, thunderstorms and avoid objects that pose a risk of falling or being struck by lightning. It also demanded to ensure availability of emergency services personnel during the period.",
  "retrievedAt": "2025-08-11T08:33:52.011Z"
}
