{
  "title": "Victim families of Sopore massacre await justice in IIOJK",
  "author": null,
  "content": "ISLAMABAD, Jan 6 (APP):Justice continues to elude the victim families of the gory Sopore massacre for the past 32 years, whose loved ones lost their lives at the hands of Indian Border Security Force (BSF) personnel in Sopore town on the chilly morning of January 6, 1993, in Indian illegally occupied Jammu and Kashmir.\nOver 50 innocent civilians were killed, and the main business area of the town was set ablaze and looted by the Indian BSF troops on that fateful day when they went on a rampage after a rifle was allegedly snatched from a BSF soldier by an unknown individual, press released received from APHC office.\nShortly after the incident, Indian BSF personnel from the 94th Battalion butchered 57 civilians. Witnesses of the gruesome massacre recounted that the marauding troops dragged a bus driver out of the vehicle and pumped bullets into the bus passengers, killing 20 of them on the spot. “After killing the passengers, the troops started spraying gunpowder, petrol, and kerosene on the surrounding buildings and then torched them,” they said.\n“Among the 57 dead civilians, 48 died due to gunfire, and nine were burnt alive. More than 400 commercial establishments and 75 residential houses were set ablaze in five localities of Sopore — Arampora, Muslimpeer, Kralteng, Shallapora, Shahabad, and Bobimir Sahab. Among the burnt buildings and shops were landmark structures like the Women’s Degree College,” said a witness.\n“We couldn’t comprehend anything as we watched BSF personnel targeting every civilian with bullets. Days after the gruesome massacre, we came to know that a BSF soldier was robbed of his rifle by an unknown man, and to avenge that incident, they targeted innocent civilians,” added another eyewitness.\nManzoor Ahmed, who witnessed the massacre and arson, said the marauding troops dragged the driver of a bus (JKY-1901) from the vehicle and fired into the passengers, killing 20 of them. “The troops then set shops and buildings on fire after sprinkling gunpowder. About 400 shops and buildings, including 75 residential houses, were gutted in Shalpora, Shahabad, Muslimpeer, Kraltang, and Arampora areas of the town,” he said. Among the gutted buildings were the Women’s Degree College and Samad Talkies.\nThe Shalla family of Shalpora suffered the highest number of casualties, with four of its members killed.\nThe Sopore massacre, which serves as a horrific example of brutal Indian military actions in IIOJK, was described by Time Magazine as one of the worst atrocities in Kashmir’s history.\nMeanwhile, All Parties Hurriyat Conference leaders and rights activists, while paying glowing tributes to the victims of the Sopore massacre, have stated that the deteriorating situation in the territory warrants international intervention to resolve the Kashmir dispute.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:26:01.754Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/victim-families-of-sopore-massacre-await-justice-in-iiojk/",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T07:23:00.000Z"
}
