{
  "title": "PM directs strict legal action against all human trafficking groups, confiscation of properties",
  "author": null,
  "content": "ISLAMABAD, Jan 06 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed for taking of strict legal action against all human trafficking groups in the country to set an example, besides called for immediate legal action to confiscate the properties and assets of human traffickers.\nThe prime minister chaired a review meeting on measures taken against human trafficking in the country, PM Office Media Wing said in a press release.\nThe prime minister appreciated the recent actions taken by the Federal Investigation Agency (FIA) against government officials involved in human trafficking.\nFollowing disciplinary actions, he further directed that strict punitive measures should also be taken against facilitators.\nIn the meeting, the prime minister was briefed on the measures taken against human trafficking, progress in the legal actions against facilitators, and in legislation for the eradication of human trafficking.\nThe meeting was attended by Minister for Information and Broadcasting Attaullah Tarar, Federal Minister for Kashmir and Gilgit-Baltistan Engineer Amir Muqam, and senior officials from the relevant departments.\nThe prime minister said the prosecution process against all individuals involved in this heinous trade should be made more effective, adding the top lawyers should be appointed for prosecution after consultation with the Ministry of Law and Justice.\nThe prime minister said the Foreign Office should contact relevant countries to expedite the extradition of Pakistanis running human trafficking operations abroad.\nHe further directed that the Ministry of Information and Broadcasting, in collaboration with the Ministry of Interior, launch an awareness campaign to educate the public about using only legal channels for overseas employment.\nHe said the country should promote technical training institutions that could provide certified professionals to the international market according to modern requirements, adding that the screening process for individuals traveling abroad at airports should be made more effective.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:25:05.687Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-directs-strict-legal-action-against-all-human-trafficking-groups-confiscation-of-properties/",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T11:21:00.000Z"
}
