{
  "title": "Secy Info, Bangladesh High Commissioner discuss enhanced media cooperation",
  "author": null,
  "content": "ISLAMABAD, Jan 6 (APP): Secretary Information and Broadcasting Ambreen Jan and Bangladesh’s High Commissioner in Pakistan Iqbal Hussain Khan met here Monday and discussed ways to boost media cooperation and people-to-people contacts between their countries.\nIn a meeting held here at the Ministry of Information and Broadcasting, the two sides focused on enhanced partnerships to highlight shared historical narratives and cultural values that strengthen mutual understanding.\nSecretary Information Ambreen Jan said Pakistan and Bangladesh had a longstanding diplomatic and cultural ties along with a shared history of cooperation in diverse sectors.\nShe emphasized collaboration between state media organizations including Pakistan Television Corporation, Associated Press of Pakistan and Radio Pakistan with their Bangladeshi counterparts in fields of joint productions and exchange of news.\nShe highlighted that a journalist exchange programme could provide the media persons from Pakistan and Bangladesh an opportunity to learn about each other’s perspectives and narratives on various matters.\nHigh Commissioner Iqbal Hussain Khan lauded the government of Pakistan for taking steps to encourage multifarious cooperation between the two countries.\nHe likened the people of two countries as brothers and added that their connectivity through joint cooperation programmes would bring both nations further closer.\nThe two sides also discussed expanding the availability of Pakistani news and entertainment channels on Bangladeshi cable networks and organizing film festivals and photographic exhibitions.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:25:02.056Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/secy-info-bangladesh-high-commissioner-discuss-enhanced-media-cooperation/",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T11:57:00.000Z"
}
