{
  "title": "Mirza announces special package for healthcare workers",
  "link": "https://www.app.com.pk/national/mirza-announces-special-package-for-healthcare-workers/",
  "date_published": "2020-06-12T01:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP):Special Assistant to Prime Minister on National Health Services Dr Zafar Mirza on Friday announced special package for healthcare workers, who are fighting as frontline force against coronavirus.\nTalking to media at National Command and Operation Centre (NCOC), he said that the package has been made in consultation with all stakeholders and after thorough deliberations while the national package will be implemented by the provinces.\nThe package covers financial incentives, security, training, support mechanism in case of contracting COVID, private sector incentives and remembering the services of deceased workers at national level.\nHe said the frontline health workers would be offered income tax exemptions, payment of three million rupees to 10 million rupees for the deceased as per their grades, uninterrupted provision of Personal Protective Equipment (PPE) to them in collaboration with National Disaster Management Authority (NDMA), besides their online training on correct usage of PPE under the name of ‘We Care’.\nHe added 100,000 workers would be trained while the training of 20,000 workers has already been completed. The psycho-social support of these health workers was started for stress and anxiety management.\nDr Zafar Mirza said the helpline 1166 was being expanded to ensure best possible support to citizens. Under the package, the security of health workers would also be ensured, he added.\nHe said a code of ethics would also be devised in collaboration with Pakistan Electronic Media Regulatory Authority (PEMRA) to monitor character assassination of health care workers on electronic media.\nHe said some 5,000 workers would be trained on critical care through courses while training of 1,000 workers has already been completed and training of the rest was continued.\nHe said the tests of their family members would be conducted on priority basis and medicines will also be provided on priority basis in public or private hospitals.\nHe said the services of deceased health workers would be remembered on national days. A special programme is being prepared to pay tribute to the services of deceased workers which will be telecast on September 6 on Defence Day.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:19:53.578Z"
}
