{
  "title": "Govt envisages an amount of Rs 4500 mln for federal education ministry",
  "link": "https://www.app.com.pk/national/govt-envisages-an-amount-of-rs-4500-mln-for-federal-education-ministry/",
  "date_published": "2020-06-12T03:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP):The Federal Government has envisaged approximately an amount of Rs 4,500 million in 2020-21 for the Ministry of Federal Education and a Professional Training.\nAccording to the Annual Development Plan (ADP), the amount has been envisaged for a total of 27 schemes (19 ongoing-and 08 new) during 2020-21 for the basic and college education sector.\nThe general sectoral objectives 2020-21 plan focuses on to improve access to and introduce a uniform education system, improve quality of education for all including vulnerable girls, Increase adult literacy rate and skill development-enhance access to and relevance of skills training.\nThe other objectives are including the regulation and promotion of private education sector, reducing out of school children, jacking up of education share in GDP on annual basis, elevating gender parity index and enrollment at all levels of basic and college education.\nDue to COVID-19, the specific objectives are also taken like education continuity and learning through Tele Schools and Digital Platforms, reducing gender inequalities arising out of COVID-19 implication, leveraging on expertise of laid off female labor force by ensuring job security.\nThe government has also planned COVID-19 specific interventions at federal level during 2020-21 including National Action Plan on education related to mitigate COVID-19 impact, development of remote/distance learning, e-learning and online technical courses, rescheduling of exams to safeguard 350,000 students registered with federal board.\nFurthermore, the steps like development of alternative learning models and programmes to serve hard-to-reach areas, distribution of learning material to go along with distance learning TV and radio platforms, provision of safe school environment that includes cleaning, disinfection, decontamination and WASH facilities proposed reforms, ramping up of ‘Tele School’ and Digital Platform initiative particularly for females to insulate learning outcomes for them, existing widespread access to television and smartphones may be capitalized for remote learning , and the involvement of and incentives to Private Sector Education were also taken.\nTo reduce educational gap particularly for girls remedial, classes may be introduced in consultation with the relevant ministries, it added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:19:50.600Z"
}
