{
  "title": "ICT services export remittances Rise by 28%: Shaza Fatima",
  "author": null,
  "content": "ISLAMABAD, Jan 17 (APP):Minister of State for Information Technology and Telecommunication, Shaza Fatima Khawaja, informed the National Assembly on Friday that Pakistan’s ICT services export remittances recorded a 28% increase, reaching approximately $1.86 billion during the first six months of the current financial year.\nDuring the question hour, she attributed this growth to improved internet usage and speed in the country.\nHowever, she acknowledged that internet users are facing challenges, emphasizing that efforts are underway to address these issues.\n“At present, WhatsApp is fully functional, and all VPNs are operational,” she said.\nThe minister highlighted that the Pakistan Telecommunication Authority (PTA) operates a 24/7 service center to register complaints, assuring that technicians are dispatched promptly to resolve issues. “My primary duty is to protect and promote the IT industry,” she added.\nThe minister said that Pakistan’s current internet bandwidth operates at 274 MHz, which limits accessibility. The government plans to add 562 MHz, recently vacated through court proceedings.\nShe appreciated the efforts of the Law Ministry and Special Investment Facilitation (SIFC) for working to resolve these legal hurdles.\nShe also shared that Pakistan has eight submarine cables, one of which has reached the end of its lifespan. She announced that the world’s largest submarine cable has now arrived in Pakistan, expressing optimism that it will help address connectivity problems.\nShe further mentioned that the Pakistan-China optic fiber cable is currently operational.\nHighlighting the government’s achievements, the minister pointed to foreign direct investment in the IT and telecom sectors.\nShe also emphasized the importance of VPN registration for the freelancing and IT industry. “PTA has made VPN registration free of cost, and to date, over 31,000 IPs have been registered,” she said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:45:31.520Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ict-services-export-remittances-rise-by-28-shaza-fatima/",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T09:48:00.000Z"
}
