{
  "title": "CDA starts new mechanism to relocate plants from one place to other: Senate told",
  "author": null,
  "content": "ISLAMABAD, Jan 17 (APP):Minister for Law and Justice Azam Nazeer Tarar on Friday informed the Senate that the Capital Development Authority (CDA) has started a new mechanism of transfer [relocation] of plants/trees from one place to another during any road expansion or development projects.\nReplying to various supplementary questions during Question Hour, the minister said that although it was a challenging task but now plants were shifted from one place to another to protect flora and fauna.\nHe said as far as a plantation in Islamabad is concerned, CDA has the mandate of development which includes landscape development and planting as well. Large green belts have been provided in the Master plan of the city, he added.\nHe said CDA carried out plantation twice during the year. These plantations were further protected from illicit cutting through stringent legislation like Landscape Act, 1967 and the Forest Act, 1927, he added.\nHe said due to the efforts of CDA Islamabad is one of the greenest cities in the world. As far as cutting of trees is concerned, it is allowed only during the execution of mega projects with conditions that the trees being cut would be replaced three times, he added.\nTo another question, the minister said  NADRA has provided the National Police Bureau (NPB) with state-of-the-art digital infrastructure and sophisticated protocols to ensure an efficient data management system to protect privacy and confidentiality.\nIn case of unauthorized access and misuse of NSOR data, a person found involved will strictly be dealt in accordance with Section 26 of Anti Rape (Investigation & Trial) Act 2021, he added.\nTo another separate question, Azam Nazeer told the House that  CDA has not imposed any fines on HTV vehicles. Furthermore, CDA is not authorized to impose any kind of fine on HTV vehicles, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:45:31.873Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-starts-new-mechanism-to-relocate-plants-from-one-place-to-other-senate-told/",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T09:26:00.000Z"
}
