{
  "title": "Three Commodores of Pakistan Navy promoted to Rear Admiral",
  "link": "https://www.app.com.pk/national/three-commodores-of-pakistan-navy-promoted-to-rear-admiral/",
  "date_published": "2021-01-14T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP): The Pakistan Navy on Thursday has promoted Commodore Javed Iqbal, Commodore Muhammad Sohail Arshad and Commodore Salman Ilyas to the rank of Rear Admiral.\nAll three newly promoted Rear Admirals are recipients of Sitara-e-Imtiaz (Military) and are graduate of Pakistan Navy War College, Lahore and National Defence University, Islamabad and had illustrious service career with vast experience of various Command and Staff appointments, said a Pakistan Navy press release.\nRear Admiral Javed Iqbal got commission in Weapon Engineering Branch of Pakistan Navy in 1989. He holds Master’s degree in (Communication & Electrical Systems) from United Kingdom.\nHis Command appointments include Commanding Officer NPEC and Commander Technical Support (Coastal) Jinnah Naval Base, Ormara. His major Staff appointments include Pakistan Navy Technical Liaison Officer at France, Senior Staff Officer (Submarine) to Commander Logistics, Director Submarine Maintenance, at Naval Headquarters and Deputy Chief Manager Technical, Maritime Technological Complex.\nRear Admiral Muhammad Sohail Arshad got commission in Weapon Engineering Branch of Pakistan Navy in 1989. His Command appointments include Deputy Managing Director Submarine and General Manager Submarine Projects, Pakistan Navy Dockyard. His major Staff appointments include Staff Officer (Electrical) COMSUBS, Staff Officer (Submarine) to Commander Logistics Headquarters and Member Technical AGOSTA 90-B Submarine, France and DG Submarine Projects. He also performed duties as Directing Staff at Pakistan Navy War College, Lahore.\nRear Admiral Salman Ilyas got commission in Construction Branch of Pakistan Navy in 1990. He holds Master’s degree in (Naval Architecture) from United Kingdom. His Command appointments include Commandant PNS KARSAZ and General Manager (Technical) Karachi Shipyard & Engineering Works. His major Staff appointments include Assistant Manager (Structure & Quality Assurance) Saudi Arabia, Manager Piping at Pakistan Navy Dockyard and Manager (Design & Shipbuilding) KS&EW, Karachi. Rear Admiral Salman Ilyas has served as Director Naval Construction at Naval Headquarters, Islamabad.",
  "retrievedAt": "2025-08-11T20:14:28.117Z"
}
