{
  "title": "PM for pacing up measures, removing all hurdles to ensure improved governance",
  "link": "https://www.app.com.pk/national/pm-for-pacing-up-measures-removing-all-hurdles-to-ensure-improved-governance/",
  "date_published": "2021-01-14T18:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP): Prime Minister Imran Khan on Thursday stressed for further pacing up the implementation of measures for improved governance in the country by removing any types of hurdles coming in the way.\nHe said administrative reforms should be implemented in stipulated time to provide relief to the masses. Since there was no discrimination of rich and poor in the welfare state and reformation was impossible without strengthening the system of reward and punishment, legal action against the corrupt elements should be ensured, he added.\nThe prime minister was presiding over a high level meeting here regarding Governance Action Matrix, which was attended by the federal and provincial officers concerned.\nImran Khan was briefed in detail about the measures taken for bringing about improvement in administrative matters.\nHe was told that the steps for providing relief to the people, registration and redressal of complaints, holding of Khuli Kachehris (open courts), resolution of problems relating to Mehakma Mall (department of land and revenue) on priority basis, establishment of one-window operation and facilitation of the people in government departments, have been practically implemented.\nThe prime minister was told that the process of large scale implementation of measures to ensure improvement in governance in Punjab has been started, with steps to boost its pace.\nHe was also informed about the timely redressal of complaints in Khyber Pakhtunkhwa, coordination with the administration of merged districts, strict monitoring of the prices of daily use items and the resultant significant reduction in flour price in the province.",
  "retrievedAt": "2025-08-11T20:14:25.853Z"
}
