{
  "title": "Healthcare workers to be registered for Corona vaccine in respective provinces",
  "link": "https://www.app.com.pk/national/healthcare-workers-to-be-registered-for-corona-vaccine-in-respective-provinces/",
  "date_published": "2021-01-14T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP): The Ministry of National Health Services, Regulations and Coordination on Thursday said that healthcare workers (HCWs) in Punjab, Sindh and Khyber Pakhtunkhwa at public and private hospitals will be registered in provincial health system by the relevant health facility for COVID-19 vaccination.\nAccording to an official of the ministry, HCWs will have to contact health facility administration to confirm all required details including name, CNIC, mobile number and designation for communication to concerned district and provincial health department for registration.\nHCWs in Islamabad, Balochistan Gilgit Baltistan and Azad Jammu and Kashmir will be directly registered in Resource Management System (RMS) by the concerned health facility or district health department. HCWs will contact health facility administration to confirm that all required details have been entered in the system by health facility focal person for RMS or by district health department.\nHe said that the healthcare workers should contact relevant health facilities to contact local health authorities to get information related with their registration for COVID-19 vaccination. They have been asked to have all related information as the government has started C0VID-19 vaccination registration for frontline healthcare workers of both public and private health facilities in wake of start of vaccine purchase process.\nHe said that the vaccine registration process was started in Provincial Health Systems of Punjab, Sindh and Khyber Pakhtunkhwa and Resource Management System of Islamabad, Balochistan, Gilgit-Baltistan and Azad Jammu and Kashmir.\nHe said that at initial stage, only frontline health workers will be eligible for COVID-19 vaccine and asked them to visit NCOC’s website as only registered persons will be entitled for this vaccine.\nHe said that frontline healthcare workers included all staff of COVID-19 hospitals both public and private sector and isolation centers. All staff included clerical, administrative and support staff like sanitary workers and guards in addition to doctors, nurses, paramedics etc.\nHe said that those public health staff involved with test, track and quarantine as these are staff visiting patients at home, collecting data and samples from home besides health care workers deputed to inject Covid-19 vaccine and essential staff at Adult Vaccine Counters (AVCs) involved in handling of individuals being vaccinated.\nSimilarly, all laboratory staff for both public and private sector will also be included who are collecting and processing specimens of COVID-19 like staff carrying out screening or triage of suspected COVID patients in fever or screening clinics at non COVID hospitals, PHC facilities, emergency departments and Points of Entries in public or private sector taking into consideration high risk areas.\nHe said that other eligible workers included EPI vaccinators for outreach and fixed sites, staff of ambulance services public and private like Edhi, Chippa etc. dealing with Covid-19 suspected patients besides general practitioners registered with their respective health care commissions while in federating units without a formal regulator, the department or ministry of health will have to certify the bona fides.",
  "retrievedAt": "2025-08-11T20:14:28.147Z"
}
