{
  "title": "Fawad asks opposition to focus on constructive, positive activities rather political rallies",
  "link": "https://www.app.com.pk/national/fawad-asks-opposition-to-focus-on-constructive-positive-activities-rather-political-rallies/",
  "date_published": "2021-05-29T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain Saturday asked the opposition parties to focus on constructive and positive activities instead of indulging in undue political rallies.\nThe minister, in a statement, said the opposition parties were confused, frustrated, and divided, besides their direction and intentions were in contradiction to each others’ point of view.\nReacting to the Pakistan Democratic Movement (PDM)’s announcement with regard to rallies, he said there was a clear contradiction within the alliance’s ranks, one faction wanted to hold a rally while the other one gave a statement of dialogue inside the parliament.\nThe minister said a detailed briefing on Afghanistan would be arranged soon, adding, Foreign Minister Shah Mehmood Qureshi and the Foreign Office had already given a Pakistan’s loud and clear stance over the issue of airbases.\nThe minister said the opposition wanted an escape from the electoral reforms which was the indicative of a contradiction in their position.\nThe opposition did not want to talk with the government on electoral reforms but simultaneously it wanted electoral reforms, he astonished.\nHe said the government had invited the opposition time and again for dialogue on the much-needed electoral reforms in the Parliament.\nHe asked JUI-F Chief Maulana Fazlur Rehman not to take revenge for his political deprivation from the democratic system.\nHe said that Shehbaz Sharif and Maulana Fazlur Rehman’s point of views were in contradiction to each other.\nThe minister said opponents of the electronic voting system wanted to promote and safeguard the rigged election system.\nFawad asked the opposition to focus on the upcoming elections in Azad Jammu and Kashmir, as its results would determine the political standing of all parties.\nHe was of the view that the outcome of today’s sitting of the PDM was only protest rallies, speeches, and a press conference.",
  "retrievedAt": "2025-08-11T20:46:44.594Z"
}
