{
  "title": "Pakistan has emerged as growth model despite corona lockdown: Farrukh Habib",
  "link": "https://www.app.com.pk/national/pakistan-has-emerged-as-growth-model-despite-corona-lockdown-farrukh-habib/",
  "date_published": "2021-05-29T12:23:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, May 29 (APP):State Minister for Information and Broadcasting Farrukh Habib Saturday said Pakistan had emerged as a growth model for the entire world as it had made unexpected achievements despite corona lockdowns.\nAddressing a press conference at Ali Zaib Foundation Centre in General Hospital Ghulam Muhammad Abad here, he said all economic indicators were positive and stock exchange had recorded unprecedented surge, which was showing confidence of the investors in economic policies of the government.\nHe said that the volume of foreign investment had increased and the country had been put on the road to progress and development, and its benefits were being enjoyed by all stakeholders.\nHe termed the opposition alliance a group of divergent forces and said that instead of supporting the productive policies of the government, they were creating unnecessary hurdles. However, he added, they had failed in their designs.\nHe said: “Our exports have recorded an increase of 13% while 54% increase was witnessed in sale of automobiles, 44% in IT products, 40% in cement and 9% in large manufacturing group products.\nHe said the federal government provided Rs1600 to Rs 1800 billion to Sindh under the National Finance Commission (NFC) Award, but it failed to use the huge financial support for welfare and betterment of masses. He lamented that children were facing malnutrition in interior Sindh.\nThere was no vaccine in hospitals for dog-bite victims, and even the irrigation water being supplied to Sindh was stolen, he said and added that at Sukkur, Sindh got 16,000 cusecs of water, and out of it 8,000 cusecs water was stolen at Kotary.\nHe said instead of improving the overall governance, Sindh had been surrendered to mafias, adding that growers in Kotary could not sow paddy crop as the Sindh government failed to check the water theft.\n“Our efforts are to enhance exports,” he said and added that the government would not give any NRO [deal] to the opposition parties, which are already facing clear division in their ranks. He said that Shehbaz Sharif should first focus on his party before forging unity in divergent forces gathered under the banner of the Pakistan Democratic Movement (PDM).\nFarrukh Habib said: “The parliament is the only platform where we can resolve our major national issues, but the opposition is ignorant of the fact and wasting its energies outside parliament to achieve its vested interests.”\nAbout dacoit gangs, he said the government would not allow state within state and elements treating the poor with oppression, particularly in far-flung rural areas, would not be tolerated at any cost, adding that these oppressive elements had their hideouts in Sulaiman Range for the last many years and no government took action against them.\nHowever, on the special directive of Prime Minister Imran Khan, the law-enforcing agencies had initiated a joint operation against outlaws, which would continue till their complete elimination.\nAbout the NGOs [non-governmental organisations], working in the health sector, he said these organisations were doing commendable job and the government would continue to encourage and patronise them so that they could expand their scope of services.\nHe particularly appreciated Ali Zaib Foundation and other organisations working for the welfare of thalassaemia patients and said that parents of young children were facing a very difficult situation. These organisations were trying their best to minimise their sufferings by providing blood to them, he said.\nLater, the minister also visited different sections of Ali Zaib Foundation Centre and expressed satisfaction over the treatment facilities being provided to the patients.\nChief Executive Officer of Ali Zaib Foundation Shahid Ali Zaidi briefed the state minister about medical facilities being provided to patients at the centre.",
  "retrievedAt": "2025-08-11T20:46:48.256Z"
}
