{
  "title": "Qureshi meets Iraq’s interior minister; stresses easing visa for pilgrims",
  "link": "https://www.app.com.pk/national/qureshi-meets-iraqs-interior-minister-stresses-easing-visa-for-pilgrims/",
  "date_published": "2021-05-29T17:11:00.000Z",
  "source": "APP",
  "content": "BAGHDAD, May 29 (APP): Foreign Minister Shah Mahmood Qureshi Saturday met with Iraqi Interior Minister Othman Al-Ghanmi where he drew attention towards easing visa procedures for Pakistani pilgrims.\nThe foreign minister said around 200,000 Pakistani pilgrims visited Iraq annually and in order to facilitate them and address their issues, Pakistan’s government would announce Pilgrims Management Policy.\nHe said the cooperation from Iraq’s government would also be required for effective implementation of the said policy.\nGood to meet Interior Minister #OthmanAlGhanimi. Appreciated Iraqi Govt coordination & management for well-being of thousands of  Zaireen visiting sacred sites in Iraq annually. is streamlining process of Zaireen pilgrimage to  with the devpt of a Zaireen Management Policy pic.twitter.com/MZaFXUr4v9\n— Shah Mahmood Qureshi (@SMQureshiPTI) May 29, 2021\nIn the meeting held at the Iraq’s interior minister during his ongoing three-day visit, Qureshi said Pakistan greatly valued its bilateral relations with Iraq as both the countries were bound in religious, cultural and historical ties.\nMoreover, the people of Pakistan had also deep religious association with Iraq, he added.\nForeign Minister Qureshi said just like Iraq, Pakistan also went through a long war against terrorism and also faced huge loss of life and properties. Both the countries can also benefit from each other’s experiences to effectively counter terrorism, he added.\nIraqi Interior Minister Othman Al-Ghanmi welcomed the foreign minister at his ministry and thanked Government of Pakistan for extending assistance to the Iraqi people during COVID-19 pandemic. He also assured the foreign minister of all out cooperation on the issue of mutual interest.",
  "retrievedAt": "2025-08-11T20:46:44.370Z"
}
