{
  "title": "Sindh govt bans entry of dumper trucks in Karachi during the day - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Heavy vehicles to be allowed on city roads only between 11pm and 6am\n• Solid Waste Management Board told to carry out its garbage removal operations during night-time\n\nKARACHI: Against the backdrop of an alarming rise in fatalities involving dumper trucks, the Sindh government on Saturday imposed a ban on the entry of the heavy vehicle into the city during daytime.\n\nOfficials said that the dumpers would only be allowed to enter the city between 11pm and 6am.\n\nWhile the Sindh High Court had already banned the entry of all heavy vehicles during the daytime, the local administration had only restricted the entry of trailers and there was no check on the movement of thousands of dumpers carrying goods, construction material, etc, in the city.\n\nOnly in the last 40 days, as many as 112 people have been killed and 216 others injured in traffic accidents, several of which involved dumpers.\n\nThe recent killing of innocent people by dumpers on the city streets triggered strong condemnation of provincial authorities and traffic police for their failure in implementing the traffic laws and orders of the SHC regarding the movement of heavy vehicles in the city.\n\nBesides opposition parties, Sindh Governor Kamran Tessori also strongly condemned the traffic police for its failure to regulate the movement of heavy vehicles that had killed so many citizens.\n\nIn view of the criticism, the provincial government decided to ban the entry of dumper trucks during the daytime.\n\nA decision to this effect was taken at a meeting chaired by Chief Secretary Asif Hyder Shah to discuss traffic-related issues in the city on the directives of the chief minister.\n\nThe meeting was attended among others by the provincial and city police chiefs, commissioner, transport secretary and DIG traffic.\n\nThe CS said that the decision aimed to reduce the increasing number of road accidents caused by heavy vehicles and improve traffic flow in the metropolis\n\nHeavy vehicles’ verification\n\nThe meeting also decided that all heavy vehicles and their drivers would undergo physical verification to ensure compliance with safety regulations. Additionally, all vehicles operating in the city must obtain a QR Code-certified certificate from the provincial transport department.\n\nThe chief secretary also directed the Sindh Solid Waste Management Board, which has a fleet of over 1,000 dumper trucks for garbage disposal, to shift its operations, involving heavy vehicles, to night-time within three months.\n\nMoreover, the transport secretary was directed to inspect all water tankers and bowsers of the Karachi Water and Sewerage Corporation within a month to ensure their safety and compliance with traffic laws.\n\nHe also ordered that reckless drivers should not only be fined but also be booked in FIRs to ensure accountability.\n\nHighlighting the major causes of accidents, he stated that the primary reason was the lack of enforcement of laws regarding heavy traffic.\n\nIt was revealed in the meeting that 65 per cent of vehicles in the city were motorcycles and 55 per cent of all road accidents involve motorcyclists.\n\nMeanwhile, the provincial government’s Road Checking Committee continued crackdown against overloading, over-speeding, and substandard commercial vehicles and inspected 33 vehicles.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7f1532bef3.gif",
  "retrievedAt": "2025-08-25T19:28:08.747Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890717/sindh-govt-bans-entry-of-dumper-trucks-in-karachi-during-the-day",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:45.000Z"
}
