{
  "title": "Federal minister Aleem Khan proposes toll tax for GB tourists - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Federal Minister for Comm­unications Abdul Aleem Khan has proposed the introduction of a toll tax for tourists visiting the scenic Gilgit-Baltistan, with a blanket exemption for residents.\n\nGB Chief Minister Haji Gulbar Khan met the federal minister in Islamabad where they discussed the National Highway Authority’s (NHA) role in Gilgit-Baltistan and expanding communication facilities to improve transportation, according to a press release issued on Friday.\n\nThe minister for communications said that the federal government was committed to improving the road network through the NHA, asserting that Gilgit-Baltistan’s development was linked to the country’s prosperity.\n\nWith the number of tourists to Gilgit-Baltistan multiplying each year, the federal minister proposed introducing a toll tax to fund road infrastructure development. However, locals should be exempt from this tax, he suggested.\n\nCM Gulbar Khan suggests construction of tunnels to ensure travellers’ safety on Baltistan Road\n\nCM Khan praised the federal minister’s development initiatives and expressed his determination to collaborate with the NHA for regional development.\n\nThe chief minister discussed the issue of frequent roadblocks on the Baltistan Road and the need for tunnels to ensure travellers’ safety. The federal minister said a Rs15 billion feasibility study was submitted to the Planning Commission to address the issue.\n\nOn this occasion, Aleem Khan also assured the chief minister that steps would be taken to pay land compensation to the affected people of Karakoram Highway.\n\nMeanwhile, the Gilgit-Baltistan government has announced a new ‘fee’ for non-local vehicles.\n\nThe GB government termed it an updated fee for non-local vehicles, including motorbikes and private vehicles, entering the region and registration fee for hotel businesses in Gilgit-Baltistan.\n\nAccording to the notification, tourists on motorbikes will now pay Rs500 per person, which was previously Rs300. Private vehicles entering the region will now be charged Rs2,000 per vehicle.\n\nA one-time registration fee has been introduced for hotels operated by non-domicile holders of Gilgit-Baltistan, ranging from Rs40,000 for 1-star hotels to Rs250,000 for five-star hotels, along with a periodic renewal fee.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:28:22.971Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890699/federal-minister-aleem-khan-proposes-toll-tax-for-gb-tourists",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:17.000Z"
}
