{
  "title": "Infant girl killed by aerial firing in Karachi’s Lyari: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "An infant girl died on Sunday as a result of aerial firing in Karachi’s Lyari area, police and rescue services officials said.\n\nBaghdadi police station house officer (SHO) Majid Alvi told Dawn.com that Hayat Fatima Siaknder, a two-and-a-half-year-old girl, died after getting struck by a stray bullet at Ali Arcade in Lyari’s Moosa Lane.\n\nSHO Alvi said, “The bullet, fired from an unknown direction, struck the infant girl while she was in her flat on the eighth floor.”\n\n“She suffered a bullet injury on her head and was taken to the Civil Hospital Karachi, where doctors pronounced her dead on arrival.”\n\nSouth Deputy Inspector General of Police Syed Asad Raza — who took notice of the incident earlier and formed a special team — told Dawn.com that after the tragic incident, the police launched a search operation within a distance of two-and-half kilometres.\n\nIt transpired that celebratory aerial firing was carried out at a wedding ceremony of the police constable Aftab Ahmed in the vicinity of the same area. Thus, the groom has been taken into custody.\n\nHowever, DIG Raza said it was yet to be established whether it was the same shell that killed the infant girl.\n\nThe detained groom is a police officer, posted in the metropolis, whose barat procession took place in a police line within Dock’s police limits, adjacent to Baghdadi.\n\nIncidents of aerial firing are a routine occurrence in Pakistan on occasions such as weddings, the birth of a son, Independence Day and New Year’s Eve despite bans imposed in the past, often leaving people injured.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:27:49.980Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890858/infant-girl-killed-by-aerial-firing-in-karachis-lyari-police",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T18:19:35.000Z"
}
