{
  "title": "Trump says Musk will help uncover ‘hundreds of billions’ in US govt fraud - World - DAWN.COM",
  "author": null,
  "content": "President Donald Trump said in remarks airing on Sunday that Elon Musk, who is presiding over a purge of US government jobs, will help find “hundreds of billions of dollars of fraud” in federal agencies.\n\nSpeaking in a Fox News interview set to air before the Super Bowl football championship, Trump said the American people “want me to find” waste and that Musk, the world’s richest man and the leader of the president’s cost-cutting efforts, has been “a great help” in rooting out unnecessary spending.\n\n“We’re going to find billions, hundreds of billions of dollars of fraud and abuse. And, you know, the people elected me on that,” Trump said in interview excerpts released by Fox.\n\nThe president, in just his third week back in the White House, has unleashed a flurry of executive orders aimed at slashing federal spending.\n\nHe has appointed SpaceX and Tesla boss Musk to lead his federal cost-cutting efforts under the so-called Department of Government Efficiency, or DOGE.\n\nMusk has already taken steps to shut down the US Agency for International Development, laying off thousands of employees.\n\nFederal judges have stepped in to temporarily halt such layoffs.\n\nTrump said in his interview that over the next day or so he will order Musk to turn his government scalpel to the Department of Education.\n\n“Then I’m going to go to the military,” Trump said, reiterating his call for a review of spending at the Pentagon, whose 2025 budget totals some $850 billion.\n\nMusk’s role faces criticism in part because his companies have had billions of dollars in contracts with the federal government — more than $20 billion, according to House Democrat Mark Pocan.\n\nAsked whether he trusts Musk to fairly root out wasteful spending, Trump appeared to assert that the wealthy entrepreneur and his businesses are not benefiting financially through Musk’s work with DOGE.\n\n“He’s not gaining anything,” Trump said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:27:49.965Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890853/trump-says-musk-will-help-uncover-hundreds-of-billions-in-us-govt-fraud",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T16:18:06.000Z"
}
