{
  "title": "Aga Khan, late leader of Ismailis, to be buried in Egypt today - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Prince Karim Aga Khan Al Hussaini, the 49th imam of Ismaili Muslims, will be buried in the Egyptian city of Aswan on Sunday.\n\nHis funeral at the Ismaili Centre in Lisbon was attended by more than 300 guests, including Canadian Prime Minister Justin Trudeau, Portuguese President Marcelo Rebelo de Sousa and former Spanish king Juan Carlos I, leaders of the Ismaili community and other dignitaries on Saturday.\n\nIn Gilgit-Baltistan and other parts of Pakistan, thousands of followers of the late spiritual leader gathered at their community centres and Jamaat Khanas to view the funeral ceremony broadcast from Lisbon.\n\nIn Gilgit, Hunza and Nagar, shops and businesses remained closed to mourn the death of Prince Karim, who died on Tuesday in Lisbon after nearly seven decades as the spiritual leader of the Ismaili Muslims.\n\nAccording to a statement by the Ismaili Imamat, the funeral was a closed event attended only by invited guests. The Ismaili community was represented by the 22 National Council presidents from around the world, including Pakistan.\n\nFinance Minister Muhammad Aurangzeb also represented Pakistan.\n\nThe ceremony was televised live on Ismaili TV and arrangements were made at community centres and Jamaat Khanas for the late leader’s followers to witness the funeral.\n\nIn Gilgit-Baltistan, members of the Ismaili community congregated in Gilgit, Hunza, and Ghizer districts to witness the ceremony.\n\nA large number of people witnessed the funeral across GB despite harsh weather.\n\nCondolences\n\nPrince Karim was regarded as a direct descendent of the Holy Prophet Muhammad (Peace be upon him) and enjoyed near-divine status as the 49th hereditary imam of Ismaili Muslims. He held British and Portuguese nationalities, as well as honorary Canadian citizenship, a distinction rarely given.\n\nPrince Karim’s burial on Sunday would be a private ceremony, to be followed by a special homage ceremony in Lisbon on Tuesday.\n\nHis son and successor, Prince Rahim Al-Hussaini, who was named the 50th hereditary Imam, or spiritual leader, according to his father’s will, would also attend Tuesday’s ceremony.\n\nHe will grant an audience to senior leaders of the community, who will pledge their allegiance to him on behalf of Ismailis all over the world.\n\nIt is expected that Prince Rahim will ordain an update to the Ismaili constitution and bless the community.\n\nOn Saturday, Finance Minister Aurangzeb met Prince Rahim and expressed condolences on behalf of the president, the prime minister and the people of Pakistan, according to a statement issued by the finance ministry.\n\nThe minister lauded the services of Prince Karim and the Aga Khan Development Network for the socio-economic well-being of people and honouring cultural heritage.\n\nHe called Prince Karim’s demise a “monumental loss” not only for his family, friends and followers but also for the underprivileged and destitute people of the world. He recalled the late leader’s special attachment to Pakistan and its people.\n\nSpecial prayers were also held for the late leader at Ismaili community centres across Pakistan.\n\nDelegations representing various sects, political parties, social organisations, civil society and officials have been visiting Ismaili Council Centres in Gilgit, Ghizer, and Hunza for condolences.\n\nThey paid tribute to the late leader for his contribution to the region’s socio-economic development.\n\nA day of mourning was observed across Pakistan on Saturday over the demise of Prince Karim.\n\nNational flags on important government buildings remained at half-mast across the country.\n\nAs Aga Khan, Al-Hussaini expanded the work of his grandfather, who created hospitals, housing and banking cooperatives in developing countries.\n\nHe invested part of the immense family fortune in the most deprived countries, combining philanthropy with business acumen.\n\nTo this end, he founded the Aga Khan Development Network, a gigantic foundation which is thought to have 96,000 employees worldwide and which funds development programmes, mainly in Asia and Africa.\n\nA keen racehorse owner, he continued the family tradition of breeding thoroughbreds in his eight stables in France and Ireland. His horses won many of the most prestigious races.\n\nWith input from Agencies\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7d79a7e702.jpg",
  "retrievedAt": "2025-08-25T19:28:22.630Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890700/aga-khan-late-leader-of-ismailis-to-be-buried-in-egypt-today",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:17.000Z"
}
