{
  "title": "PSX stays bearish for third straight week on IMF concerns - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The stock market continued its downward trend for the third consecutive week on persistent institutional selling driven by renewed concerns over significant shortfalls in tax revenues against the collection projection and an inordinate delay in debt rollovers.\n\nThese issues are particularly worrisome ahead of the International Monetary Fund’s review later this month, leaving investors anxious without any positive developments.\n\nHowever, the government hopes for a successful IMF review, which would lead to releasing a second tranche under the 37-month $7bn Ext­ended Fund Facility, which is crucial to meeting the country’s external debt repayment obligations.\n\nAccording to Arif Habib Ltd (AHL), the market remained negative throughout the week, driven by profit-taking, selling pressures, and some concerns related to the upcoming IMF review.\n\nOn the economic front, the headline inflation for January dropped to a 101-month low of 2.4pc year-on-year. The trade deficit widened by 18pc to $2.3bn in January. The petroleum sales remained stable at 1.38m tonnes in January, with 8pc month-on-month growth. The cement despatches increased by 14pc to 3.89m tonnes in the first month of 2025. Meanwhile, the urea and DAP sales declined by 27pc and 6pc year-on-year, respectively.\n\nThe SBP reserves increased by $46m to $11.4bn week-on-week.\n\nThe benchmark KSE 100 index, which reached an intra-week high of 114,621 after opening at 114,525, fell to 109,406. By the end of the week, it closed at 110,323 level, marking a decline of 3,933 points, or 3.44pc, the second-highest correction of the year in percentage terms.\n\nAccording to AKD Securities Ltd, the decline was mainly driven by low payouts by higher dividend-yielding sectors, including fertiliser, E&P, and banks, as stock prices corrected, adjusting their dividend yields in line with rising secondary yields.\n\nNotably, in the last T-bill auction, cut-off yields increased by 10-21bps, taking 12-month yields to 11.59pc, as investors reacted to a lower-than-expected policy rate cut in the last State Bank of Pakistan’s Monetary Policy Committee meeting and opted to wait for the IMF review.\n\nAdditionally, uncertainty surrounding US trade tariffs on their major import partners also dampened investor confidence. Further­more, the Sindh and Balochistan assemblies passed the agriculture income tax bill during the week, ticking off another IMF condition ahead of the upcoming review. Additionally, the President’s ongoing visit to China generated positive sentiment, with discussions on CPEC Phase-II continuing to unfold.\n\nMeanwhile, the domestic currency weakened marginally against the greenback, depreciating 0.07pc week-on-week to Rs278.95.\n\nSector-wise negative contributions came from oil and gas exploration companies (821 points), commercial banks (593 points), fertiliser (479 points), technology and communication (264 points), and oil and gas marketing companies (232 points). Meanwhile, the sectors that contributed positively were insurance (23 points) and REIT (4 points). Scrip-wise negative contributors were Mari Energies (291 points), Fauji Fertiliser (241 points), Pakistan Petroleum (235 points), Habib Bank (226 points), and Engro Fertiliser (202 points). Whereas scrip-wise positive contributions came from Lucky Cement (81 points), Sazgar Engineering Works (56 points), National Bank (26 points), Adamjee Insurance (26 points), and Colgate-Palmolive (19 points).\n\nForeigner selling continued, clocking in at $9.88m compared to a net sell of $4.7m last week. Major selling was witnessed in ‘all other sectors’ ($6.9m), followed by cement ($2.3m). On the local front, buying was reported by insurance companies ($9.6m) and individuals ($8.0m).\n\nThe average trading volume was down 12.8pc to 434m shares, and the value traded fell 22.9pc to $76.0m week-on-week.\n\nAccording to AHL, the market will likely turn positive on the back of the expected strong financial results of certain companies.\n\nThe AKD Securities believes the upcoming MSCI review next week could serve as a potential catalyst for market movements. Over the medium term, the KSE-100 index is anticipated to sustain its upward momentum through CY25 reaching 165,215 points by December, primarily driven by the strong profitability of fertiliser companies, higher sustainable ROEs of banks and improving cash flows of E&Ps and OMCs, benefitting from falling interest rates.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:28:08.778Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890721/psx-stays-bearish-for-third-straight-week-on-imf-concerns",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:35.000Z"
}
