{
  "title": "Abducted girl rescued in Zehri, 14 suspects held - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHUZDAR: Police safely reco­vered Asma Jattak, who was ab­­ducted two days ago from Khu­zdar, during a raid in Zehri town on Saturday and arrested 14 suspects. However, the main accu­s­­ed, Zahoor Zehri, remains at large.\n\nDeputy Inspector General (DIG) of Police Kalat Range, Sohail Khalid, confirmed the recovery at a press conference, alongside Deputy Commissioner Khuzdar Yasir Iqbal Dashti and SSP Javed Zehri. Asma Jattak was also produced before the media on the occasion.\n\nAccording to DIG Khalid, the incident occurred between the night of Feb 5 and 6 when armed men stormed the Jattak residence and abducted Asma Jattak at gunpoint. He claimed that instead of reporting the incident to the police immediately, the victim’s family and members of their tribe staged a protest, blo­cking the Quetta-Karachi highway.\n\nThe next day, an FIR was lo­­­d­ged, prompting law enforcement agencies to launch a search operation.\n\nThe accused reportedly swit­ched off their mobile phones and went into hiding. However, intelligence agencies provided crucial leads that helped police track down the kidnappers’ location.\n\nHunt for main suspect continues\n\nActing on intelligence, police and Levies forces raided a site in Zehri town, successfully recovering Asma Jattak. However, the main accused managed to escape into the nearby mountainous region.\n\n“The accused was attempting to move Asma to another location when the raid was conducted,” DIG Khalid told the media.\n\nA total of 14 suspects were ta­­k­en into custody for further interrogation regarding the whereabouts of Zahoor Zehri and his accomplices. Law enforcement agencies have launched a search operation in the region, conducting raids at suspected hideouts.\n\nDIG Sohail credited Kalat Commissioner Naeem Bazai, along with the Khuzdar administration and tribal elders, for their assistance in securing Asma’s safe recovery.\n\nDespite Asma’s recovery, protesters have refused to reopen the Quetta-Karachi highway, de­­m­­anding that she be handed over to her family at the sit-in site.\n\n“We will not call off our protest until Asma is handed over to her family in the presence of all demonstrators,” the family announced.\n\nThe highway has remained blocked for three days, causing sev­e­­re disruption. Thousands of travellers have been stranded, with buses, coaches and other vehicles stuck on both sides of the highway.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:20:12.400Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890701/abducted-girl-rescued-in-zehri-14-suspects-held",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:17.000Z"
}
