{
  "title": "Head of UN chemical weapons watchdog meets Syrian leader - World - DAWN.COM",
  "author": null,
  "content": "DAMASCUS: The head of the world’s chemical weapons watchdog met Syria’s new leader on Saturday, in a first visit to Damascus since the ousting of Bashar al-Assad, who was repeatedly accused of using such weapons during Syria’s 13-year civil war.\n\nMore than a decade ago, Syria agreed to hand over its declared stockpile for destruction, but the Organisation for the Prohibition of Chemical Weapons (OPCW) has always been concerned that the declaration was incomplete and that more weapons remained.\n\nWith new authorities now in power, the OPCW visit has raised hope Syria will be conclusively rid of such weapons after years of delays and obstructions to the body’s work. “This visit marks a reset. After eleven years of obstruction by the previous authorities, the Syrian caretaker authorities have a chance to turn the page,” OPCW chief Fernando Arias said.\n\nThe Syrian presidency said interim leader Ahmed al-Sharaa and Foreign Minister Asaad al-Shaibani had received a delegation from the Organisation for the Prohibition of Chemical Weapons led by Arias.\n\nOPCW expresses concern that valuable evidence regarding equipment may have been destroyed in intense Israeli strikes on military sites\n\nThe presidency also shared pictures of Sharaa and Shaibani shaking hands with Arias. “For over a decade, Syria’s chemical weapons dossier was at a deadlock. Today, we must seize this opportunity together and break that impasse for the good of the Syrian people and the international community,” Arias said, according to a statement from the watchdog.\n\nThere has been widespread concern about the fate of Syria’s stockpile of chemical weapons since Assad’s dramatic overthrow at the hands of Islamist-led fighters.\n\nThe OPCW has also expressed concern that valuable evidence may have been destroyed in intense Israeli strikes on Syrian military sites in the wake of his fall. Israel has said its targets included chemical weapons to prevent them from falling into the hands of “extremists”.\n\nRepeated use\n\nIn 2013, Syria agreed to join the OPCW and disclose and hand over its toxic stockpile under Russian and US pressure, and to avert the threat of air strikes by Washington and its allies. This came after a suspected chemical attack on the Eastern Ghouta suburb of Damascus that killed more than 1,000 people, according to US intelligence, and was attributed to the Syrian government, which denied involvement and blamed rebels.\n\nDespite insisting the use of chemical weapons was a red line, then-US president Barack Obama held back on conducting strikes, instead reaching a deal with Russia on the dismantlement of Syria’s chemical arsenal under UN supervision.\n\nAssad’s government had long denied using chemical weapons. But in 2014, the OPCW set up what it called a “fact-finding mission” to investigate chemical weapons use in Syria, subsequently issuing 21 reports covering 74 instances of alleged chemical weapons use.\n\nInvestigators concluded that chemical weapons were used or likely used in 20 instances. In 14 of these cases, the chemical used was chlorine. Sarin was used in three cases and a mustard agent was employed in the remaining three.\n\nIn 2021, OPCW members stripped Syria of voting rights after a probe blamed Damascus for poison gas attacks carried out after it had claimed the stockpile was eliminated. In Nov 2023, France issued international arrest warrants against Assad, his brother Maher and two generals on suspicion of complicity in the 2013 chemical attacks.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7f4a5e1080.gif",
  "retrievedAt": "2025-10-12T01:20:11.586Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890735/head-of-un-chemical-weapons-watchdog-meets-syrian-leader",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:26.000Z"
}
