{
  "title": "Sri Lankan monkey causes nationwide blackout - World - DAWN.COM",
  "author": null,
  "content": "An intruding monkey at a Sri Lankan electrical grid sub-station caused a general island-wide blackout on Sunday, government officials said.\n\nThe power outage, which began around 11:30am (0600 GMT), had yet to be fully restored after three hours.\n\n“A monkey has come in contact with our grid transformer causing an imbalance in the system,” Energy Minister Kumara Jayakody told reporters.\n\nThe intrusion took place in a south Colombo suburb, he said.\n\nWhile power was restored in some areas, it was not immediately clear how much longer the outage would last.\n\n“Engineers are attending to it to try and restore the service as soon as possible,” the minister said.\n\nSri Lankans had to endure months electricity blackouts in the summer of 2022 when the country plunged into an economic crisis.\n\nFuel stations ran out of petrol and diesel, forcing thermal power stations to ration electricity to 13 hours each day.\n\nSri Lanka had defaulted on its $46 billion external debt in April 2022 after running out of foreign exchange to finance the import of food, fuel, medicines and other essentials.\n\nThe unprecedented economic meltdown forced then-president Gotabaya Rajapaksa to step down. His successor, Ranil Wickremesinghe, secured a $2.9bn bailout loan from the International Monetary Fund.\n\nSri Lanka’s new President Dissanayake, who defeated Wickremesinghe in elections last September, is maintaining the tough austerity measures introduced under his predecessor’s administration and has vowed to continue the four-year IMF bailout programme.\n\nDissanayake’s government concluded a long-delayed debt restructuring with both bilateral and private creditors late last year, ending Sri Lanka’s status as a bankrupt nation.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:27:51.603Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890829/sri-lankan-monkey-causes-nationwide-blackout",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T10:29:27.000Z"
}
