{
  "title": "China inflation picks up after Lunar New Year spending boost - World - DAWN.COM",
  "author": null,
  "content": "Inflation picked up in China last month, official figures showed Sunday, as the Lunar New Year holiday boosted January spending.\n\nChina has struggled to raise consumption and stave off deflation for months as sluggish spending, a property slump and ballooning local government debt all weigh on growth.\n\nThe consumer price index (CPI), a key measure of inflation, rose 0.5 per cent last month, up from a 0.1pc rise in November, according to the National Bureau of Statistics.\n\nThe reading from January, which coincided with the start of the long Lunar New Year holiday this year, is the highest since August’s reading of 0.6pc.\n\nLast month’s reading exceeded the 0.4pc rise predicted by Bloomberg analysts.\n\nThe NBS reported a rise in prices for goods associated with the holiday, where millions of people travel to their hometowns and celebrate with feasts and drinking.\n\nFresh vegetable prices rose by 2.4pc year-on-year and the price of pork rose by 13.8pc.\n\nThe boost in prices last month is “mainly due to higher food prices and tourism-related services prices on an earlier-than-usual Lunar New Year holiday,” Goldman Sachs analyst Xinquan Chen wrote in a note on Sunday.\n\n“But the boost is likely to become a drag in February as seasonal demand fades,” Chen said.\n\nChina suffered its sharpest fall in prices for 14 years in January 2024, at the end of a four-month period of deflation.\n\nInflation stayed below 0.5pc for nine months of 2024.\n\nWhile deflation suggests the cost of goods is falling, it poses a threat to the broader economy as consumers tend to postpone purchases under such conditions, hoping for further reductions.\n\nA lack of demand can then force companies to cut production, freeze hiring or lay off workers, while potentially also having to discount existing stocks— dampening profitability even as costs remain the same.\n\nBeijing unveiled a slew of measures to boost the economy last year, including cutting interest rates and cancelling restrictions on homebuying.\n\nLast month, policymakers expanded a subsidy scheme for common household items, from water purifiers to laptops and electric vehicles.\n\nDuring the holiday period, sales of household appliances and communication equipment at “key monitored retail enterprises” were up more than 10pc year-on-year, the Chinese commerce ministry said on Thursday.\n\nChina’s top economic planner said on Sunday it would reduce some renewable energy subsidies in reforms intended to open the booming sector to market forces.\n\nChina has sought to scale back government support for renewable energy companies in recent years as the sector reaches critical mass.\n\nIt installed a record amount of renewable energy last year and has already surpassed a target to have at least 1,200 gigawatts of solar and wind capacity installed by 2030.\n\nNew clean energy projects completed after June 1 must sell electricity at rates determined by the market rather than at preferential rates previously used to support China’s energy transition, the National Development and Reform Commission (NDRC) said in a statement.\n\nThe NDRC urged energy producers to “push forward clean energy’s participation in market transactions”.\n\nThe commission also said it “encourages electricity providers and electricity buyers to sign multi-year purchase agreements and pre-emptively manage market risks”.\n\nBeijing invested more than $50 billion in new solar supply capacity from 2011 to 2022, according to the International Energy Agency.\n\nIt has built almost twice as much wind and solar capacity as every other country combined, according to research published last year.\n\nHowever, China’s grid is struggling to keep up.\n\nRenewable supply is increasingly being blocked to prevent the grid from becoming overwhelmed, a process known as curtailment.\n\nBeijing has rolled out a series of measures over the past decade aimed at weaning renewable energy providers off state financial support.\n\nIt ended subsidies for new solar power stations and onshore wind power projects in 2021.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:27:51.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890831/china-inflation-picks-up-after-lunar-new-year-spending-boost",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T11:15:07.000Z"
}
