{
  "title": "Hamas, Israel complete fifth prisoner swap - World - DAWN.COM",
  "author": null,
  "content": "• 183 Palestinians, three Israelis released under Gaza ceasefire deal\n• Jubilant crowds on both sides cheer prisoners’ freedom\n• Red Cross urges all parties to ensure dignified, private future releases\n\nDEIR BALAH: Israel and Hamas completed their fifth prisoner swap under a fragile Gaza ceasefire deal on Saturday.\n\nOut of the 183 inmates released by Israel in return for three Israelis, the Palestinian Prisoners’ Club advocacy group said seven required hospitalisation, decrying “brutality” and mistreatment in jail.\n\nAn AFP correspondent later reported that more than 100 Palestinian prisoners had arrived in Gaza.\n\nThe fifth exchange since the truce took effect last month comes as negotiations are set to begin on the next phase of the ceasefire, which is intended to pave the way for a permanent end to the war.\n\nBut senior Hamas official Bassem Naim on Saturday said Israel’s “procrastination and lack of commitment in implementing the first phase…expo­ses this agreement to danger and thus it may stop or collapse”.\n\nHe also described, in an interview with AFP, the condition of the prisoners as “acceptable under the difficult circumstances that the Gaza Strip was living”.\n\nSaturday’s swap followed remarks by President Donald Trump suggesting the United States should take control of the Gaza Strip and clear out its inhabitants, sparking global outrage.\n\nOr Levy, Ohad Ben Ami and Eli Sharabi, who were all sei­zed by Hamas during the Oct 7, 2023 attack that sparked the war, “crossed the border into Israeli territory” on Saturday, the Israeli military said.\n\nWith their return, 73 out of 251 prisoners taken during the attack now remain in Gaza, including 34 the Israeli military says are dead.\n\nJubilant crowds in Israel’s commercial hub Tel Aviv cheered as they watched live footage of the three prisoners, flanked by masked gunmen, brought on stage in Deir el-Balah before being handed over to the International Committee of the Red Cross.\n\nThe ICRC called on “all parties, including the mediators, to take responsibility to ensure that future releases are dignified and private”.\n\nSharabi, 52, and Ben Ami, a 56-year-old dual German citizen, were both abducted from their homes in kibbutz Beeri when Hamas fighters stormed the small community near the Gaza border. Sharabi lost his wife and two daughters in the attack. Levy was abducted from the Nova music festival, where his wife was murdered.\n\nIn the occupied West Bank city of Ramallah, relatives and supporters gathered to welcome inmates released by Israel, embracing them and cheering as they stepped off the bus that brought them from nearby Ofer prison.\n\nBut Fakhri Barghouti, 71, whose son was among the prisoners, told AFP that Israeli soldiers had stormed his home and beaten him, warning him not to celebrate his son’s release.\n\n“They entered after midnight, smashed everything, took me into a side room, and beat me before leaving”, Barghouti said. “I was taken to the hospital, where it was found that I had a broken rib.”\n\n‘Slow killing’\n\nIsrael’s prison service said that 183 Palestinians were released to the occupied West Bank and Gaza.\n\nThe Palestinian Prisoners’ Club advocacy group and the Palestinian Red Crescent said that seven of them had been admitted to hospital in the West Bank.\n\n“All the prisoners who were released today are in need of medical care … as a result of the brutality they were subjected” to in jail, said the advocacy group.\n\nHamas in a statement accused Israel of undertaking a “policy of… the slow killing of prisoners”.\n\nHamas has so far freed 21 prisoners, including 16 Israelis in exchange for hundreds of mostly Palestinians released from Israeli jails.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7d4b5ddd04.jpg",
  "retrievedAt": "2025-10-12T01:20:10.605Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890690/hamas-israel-complete-fifth-prisoner-swap",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:00.000Z"
}
