{
  "title": "Between China and the US - Pakistan - DAWN.COM",
  "author": null,
  "content": "DURING his recent official trip to China, President Asif Zardari reaffirmed Pakistan’s commitment to the strategic partnership with that country.\n\nIn his meetings with Chinese leaders, especially President Xi Jinping, the Pakistani leader emphasised new avenues of cooperation under the China-Pakistan Economic Corridor (CPEC). His visit came at a critical time when terrorism and security challenges within Pakistan are testing the strength of bilateral ties.\n\nThe visit holds particular significance as President Zardari’s party is in power in Balochistan and Sindh, the two provinces where Chinese nationals have been targeted in recent terrorist attacks. The attacks have raised grave concerns and have put pressure on the government to ensure the safety of Chinese nationals in the country. While it is true that it is the establishment that manages security matters, the provincial governments are responsible for law enforcement and policing. Their cooperation is crucial to addressing the threat.\n\nThe priority is to attract more Chinese investment, whether under the banner of CPEC 2.0 or other bilateral economic projects. While Pakistan’s strategic and defence ties with Beijing are strong, the aim is to strengthen these without compromising its foreign policy stance, particularly with regard to its ties with the US and the West. However, Chinese investors are becoming more hesitant to invest here because of security risks, debt repayment uncertainty, bureaucratic red tape, and what they see as the Western leanings of the bureaucracy.\n\nEnsuring the safety of Chinese nationals in Pakistan is critical to maintaining mutual trust. Unrelenting security threats have strained bilateral ties, underscoring the need for Pakistan to instal effective measures to reassure China of its commitment to safeguarding its interests.\n\nPakistan is struggling to balance its relationships with both China and the West.\n\nTime and again, the two countries are seen reaffirming their commitment to strengthening economic and security cooperation. But progress on overcoming the hurdles has been slow, with the Pakistani establishment often making commitments that may not be entirely practical where implementation is concerned.\n\nTo give an example, in the aftermath of two incidents last year in which Chinese citizens lost their lives, Interior Minister Mohsin Naqvi agreed to put in place a joint security strategy with China. This agreement was reached during a meeting with Chinese ambassador Jiang Zaidong after an incident in Karachi in which two Chinese nationals were injured in a shooting by a security guard.\n\nHowever, subsequent national and international media reports suggested that such a joint security mechanism might not be viable, as Pakistan does not allow foreign troops on its soil except for joint military exercises or related activities. To appease China, Pakistan has intensified its counterterrorism efforts and crackdown on the insurgencies in Balochistan and KP. However, significant security challenges persist.\n\nMoreover, the specifics of the proposed security arrangement are hardly clear. What does China want — direct protection for its citizens, an inner-circle security set-up, or a joint effort that would involve security personnel from both countries? Additionally, who are the Chinese security officials involved? Are they private contractors or members of the regular security apparatus? All this remains ambiguous.\n\nIt was evident that China has actively pursued the development of such a mechanism. But more clarity is needed from Pakistan. While China and Pakistan already maintain deep security cooperation at multiple levels — bilaterally, under the Shanghai Cooperation Organisation, and through special security arrangements for CPEC — its multi-layered collaborations face challenges.\n\nDuring President Zardari’s visit to China, the interior minister, who was part of the delegation, agreed to enhance intelligence sharing and deepen counterterrorism cooperation in a meeting with his counterpart, Minister of Public Security Qi Yanjun. This meeting carried particular significance. It came on the heels of reports alleging that Mr Naqvi had attended an anti-China event in the US, which the minister later denied. This incident is perceived as another challenge in promoting trust and confidence between the two countries.\n\nChina has never objected to Pakistan’s functional relations with the West and understands that this country has maintained a long-standing bilateral relationship with the US. In fact, Pakistan’s ties with the US have, at times, even served Beijing’s interests — for instance, in facilitating a secret meeting between Zhou Enlai and Henry Kissinger in the 1970s. However, Beijing’s concerns stem from different factors. China does not want Islamabad to leverage its relationship with Beijing while simultaneously managing its ties with Washington, particularly when US-Pakistan relations are strained.\n\nThe Chinese perceive Mr Naqvi as being closely aligned with Pakistan’s military establishment rather than being an integral part of the civilian government. If Mr Naqvi was in Washington, D.C., during President Donald Trump’s inauguration, they perceive it in a different context — speculating that Pakistan seeks to maintain financial supply lines, particularly through the International Monetary Fund and the World Bank. Their primary concern is that Pakistan’s dependence on international financial institutions affects CPEC in multiple ways, from loan repayments to maintaining project secrecy.\n\nPakistan is struggling to balance its relationships with both China and the West. Some close advisers within the military establishment, including former diplomats and generals, continue to advocate for aligning more closely with China, arguing that China’s rise differs from that of the Soviet Union. However, the establishment has yet to fully assess the long-term costs and implications of relying on a single global power — particularly in view of the question of how such a relationship would function in strategic, political, and economic cooperation.\n\nThis equation is further complicated by Pakistan’s India-centric security doctrine, which is also grappling with the challenge of integrating the Taliban regime into its broader strategic framework. Despite these complexities, the prime minister and planning minister remain optimistic that China will initiate work on two key mega projects — Karakoram Highway Phase Two and ML-1 — this year.\n\nThe writer is a security analyst.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a81a34e3deb.jpg",
  "retrievedAt": "2025-10-12T01:20:41.594Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890769/between-china-and-the-us",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T03:01:01.000Z"
}
