{
  "title": "Trump revokes Biden’s security clearance - World - DAWN.COM",
  "author": null,
  "content": "• Escalates foreign aid crackdown, freezes US aid to South Africa\n• Names himself as chairman of Kennedy Centre\n\nWASHINGTON: President Donald Trump has revoked his predecessor Joe Biden’s security clearance in a blizzard of new orders, while escalating his campaign to dismantle the US humanitarian agency charged with helping the world’s poorest and extending American influence around the globe.\n\nIn a new series of rapid-fire power plays on Friday, the 78-year-old billionaire also froze aid to South Africa, where his top donor Elon Musk was born, and named himself head of one of Washington’s premier cultural venues, the Kennedy Centre.\n\n“There is no need for Joe Biden to continue receiving access to classified information,” Trump said on his Truth Social network, adding that he was “immediately” revoking the Democrat’s security clearances and ending his daily intelligence briefings.\n\n“JOE, YOU’RE FIRED,” he added in all caps.\n\nUS presidents are traditionally given the right to receive intelligence briefings even after they step down.\n\nTrump also stepped up his assault on the United States Agency for Interna­tional Development (USAID), which distributes humanitarian aid globally.\n\n“THE CORRUPTION IS AT LEVELS RARELY SEEN BEFORE. CLOSE IT DOWN!” he wrote on his Truth Social app about USAID, without offering evidence.\n\nOn Friday, Musk — who along with Trump has spread blatantly false information about USAID’s finances — reposted photos of the agency’s signage being removed from its Washington headquarters.\n\nThe Trump administration has frozen foreign aid, ordered thousands of internationally-based staff to return to the United States, and begun slashing the USAID headcount of 10,000 employees to around only 300.\n\nLabour unions are challenging the legality of the onslaught. A federal judge on Friday ordered a pause to the administration’s plan to put 2,200 USAID workers on paid leave by the weekend.\n\n‘Campaign of misinformation’\n\nThe president also followed up on a promise to freeze US aid to South Africa, citing a law in the country that he alleges allows farmland to be seized from white farmers, despite Johannesburg’s denials.\n\nSouth Africa condemned Trump’s decision to freeze aid to the country. “We are concerned by what seems to be a campaign of misinformation and propaganda aimed at misrepresenting our great nation,” the government said.\n\n“It is disappointing to observe that such narratives seem to have found favour among decision-makers in the United States of America.”\n\nThe law would “enable the government of South Africa to seize ethnic minority Afrikaners’ agricultural property without compensation”, Trump alleged in the executive order, which also noted foreign policy clashes over the war in Gaza.\n\nSoft power\n\nThe United States’ current budget allocates about $70 billion for international assistance, a tiny fraction of overall spending. But it gets a big bang for its buck. USAID alone runs health and emergency programmes in around 120 countries, including in the world’s poorest regions, boosting Washington’s battle for influence against rivals such as China.\n\n“We are witnessing one of the worst and most costly foreign policy blunders in US history,” Samantha Power, the USAID chief under former president Joe Biden, wrote in a scathing New York Times opinion piece.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:20:40.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890742/trump-revokes-bidens-security-clearance",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:07.000Z"
}
