{
  "title": "Muzaffarabad police break up PTI protests, place leaders under house arrest - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Police used tear gas and batons to disperse activists and leaders of Pakistan Tehreek-i-Insaf (PTI) on Friday as they protested against alleged rigging in last year’s general elections in Pakistan, purportedly in violation of Section 144 of the Criminal Procedure Code.\n\nThe confrontation initially erupted outside the Press Club before intensifying near Domel, where PTI activists clashed with law enforcement personnel.\n\nSeveral PTI workers, including the party’s regional vice president Zeeshan Haider Kazmi, councillor Hamid Jamil, Munna Shah, and Malik Ansar, were taken into custody. While officials did not confirm the number of arrests, sources estimated that at least 20 activists were detained, most of whom were released later in the evening.\n\nVideo footage showed police chasing and striking protesters near Quaid-e-Azam Bridge in Domel, where PTI’s regional president and former AJK prime minister Sardar Abdul Qayyum Niazi was leading the demonstration. As the protesters attempted to march toward the Press Club, police fired tear gas shells and resorted to baton charges to push them back.\n\nAmid the chaos, a Suzuki van, reportedly fitted with a sound system for the protest, caught fire in Domel. The cause of the fire remained unclear.\n\n“This is fascism… this is oppression,” a visibly enraged Mr Niazi said. “We won’t allow this to continue. We will call for a shutter-down and wheel-jam strike in response.”\n\nAuthorities later escorted Mr Niazi to the residence of PTI’s district president, Azhar Gillani, in Rawani, where he was placed under house arrest.\n\nEarlier, another group of PTI activists had gathered separately outside the Press Club, but their demonstration was also broken up by police, reportedly resulting in further arrests.\n\n“If they think that using brute force against Imran Khan’s loyalists will deter them from responding to his calls, they are gravely mistaken,” said PTI councillor Zulfiqar Baig from the Plate neighbourhood of Muzaffarabad.\n\nLeader of the Opposition Khawaja Farooq Ahmed and former minister Hanif Awan were also removed from outside the Press Club and placed under house arrest at their respective residences.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/09121850985c01e.png",
  "retrievedAt": "2025-08-25T19:28:07.960Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890686/muzaffarabad-police-break-up-pti-protests-place-leaders-under-house-arrest",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:32:02.000Z"
}
