{
  "title": "PTI demands return of ‘stolen mandate’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: The PTI marked the first anniversary of the Feb 8 general elections with a public meeting at the Swabi Interchange on the Islamabad-Peshawar Motor­way, where it demanded the release of former prime minister Imran Khan and the return of its ‘stolen mandate’.\n\nOn the occasion, several PTI leaders, including Khy­ber Pakhtunkhwa Chief Minister Ali Amin Gandapur, made speeches, claiming that the Feb 8 elections were rigged and their mandate was stolen under “a well-pla­nned conspiracy and a fake government was installed”.\n\nThe PTI leaders claimed that the government has failed to realise that the more Imran Khan remai­ned in jail the more his po­­pularity would rise. They demanded his immediate release and vowed to continue their struggle for his freedom. PTI interim chairman Barrister Gohar Ali Khan said the universal right of the franchise was violated in the Feb 8 elections because the inc­u­mbent government cons­isted of ‘defeated leaders’.\n\n“This is the reason we are campaigning; to make it clear to the masses that their true mandate and decision to vote for Imran Khan had been stolen,” said Barrister Gohar. He claimed that the PTI could easily form a government in the Centre and in Punjab if its mandate was not ‘stolen’.\n\nCM Gandapur claimed he had sent a message to the army chief about terrorism in the country, particularly in KP. “There is also terrorism in Khyber Pakhtunkhwa. You cannot defeat terrorism without the support of people,” he said.\n\nPashtunkhwa Milli Aw­­a­mi Party (PkMAP) chief Mahmood Khan Achakzai claimed that the government stole the mandate in the last elections and it should be overthrown for this reason. “I am saying that this country is sinking because of the wrong policies of the government,” he said, claiming that the government would not last long because “we have ent­ered the field”.\n\nPTI leader Salman Akram Raja said the government had adopted various policies which were not in the interest of the nation and the country, and the biggest loss of their policies and strategies was that the integrity of Pakistan had been “greatly damaged” at the international level.\n\nAsad Qaiser said their only option was to go to the people’s court and they were standing in front of the people in Swabi, educating them about the wrong policies of the government. Junaid Akbar and Sheikh Waqas Akram also spoke.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7d481eb6a7.jpg",
  "retrievedAt": "2025-08-25T19:28:36.193Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890695/pti-demands-return-of-stolen-mandate",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:23:53.000Z"
}
