{
  "title": "BJP wins New Delhi assembly after 27 years - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: Indian Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP) won the state election in New Delhi on Saturday after 27 years.\n\nWhile complete results were yet to be announced, the BJP is expected to win 48 of the 70 seats in the New Delhi legislature. The Aam Aadmi Party (AAP), which had been ruling New Delhi for over a decade, ended with 22 seats.\n\n“It is our guarantee that we will leave no stone unturned in developing Delhi, improving the overall quality of life for the people,” Mr Modi wrote on social media platform X on Saturday.\n\nThe election was a much tighter contest than what the results reflect as the BJP got 46 per cent of votes and AAP 44pc.\n\nThe BJP managed to make inroads in the affluent areas of the city, comprising mainly Punjabi families dislocated after the partition in 1947.\n\nModi’s party defeats incumbent AAP, Congress\n\nThe lower-income areas, mostly slum-dwellers from Uttar Pradesh, Bihar and West Bengal, largely stayed with AAP.\n\nThe Congress party failed to win any seat, but acted as a spoiler for AAP’s chances in at least 10 constituencies.\n\nThe inability of the Congress and AAP, both members of the INDIA opposition alliance, to keep the BJP at bay is expected to give Mr Modi’s party a boost following last year’s general election, where the party lost its majority.\n\nAAP’s heavyweights like former chief minister Arvind Kejriwal, Manish Sisodia, Saurabh Bharadwaj and Durgesh Pathak bit the dust in their constituencies, with margins that the Congress took away.\n\nCongress remained a non-starter in Saturday’s outcome, but increased its vote share from 4.26pc in 2020 to around 6.40pc — a minor bump but enough to have damaged AAP, according to news website The Wire.\n\nThe AAP’s victories mostly came on seats reserved for Dalits and in areas with a huge population of low-income groups, referred to derisively as Jhuggi-Jhopri seats.\n\nIn contrast, the BJP scored its biggest wins in outer Delhi’s semi-urban constituencies and relatively prosperous seats of central Delhi, reflecting the success of the party’s systematic outreach among the formerly agrarian Jat and Gujjar demographics, middle-class voters and government servants.\n\nThe inherent class difference had never been so apparent in New Delhi polls.\n\nThe BJP’s chances were also boosted by the prospect of having the same party in power in the federal and New Delhi governments. The BJP systematically slashed the powers of the AAP government, both administratively and financially.\n\nIt first overturned the Supreme Court’s 2023 decision that empowered the elected government of New Delhi by amending the Government of National Capital Territory of Delhi (GNCT) Act.\n\nThe amendments effectively empowered New Delhi’s lieutenant governor (LG) — appointed by the federal government — in such a way that the elected New Delhi government lost its power to even appoint or transfer its officers of choice.\n\nSecondly, when the AAP wrested the municipality from the BJP, the LG was given exclusive power by the Supreme Court to appoint “aldermen” in municipal committees, without whose approval none of the decisions can be unilaterally taken by elected councillors.\n\nIt impacted AAP’s functioning in the Municipal Corporation of Delhi (MCD) as its mayors could not approve any project that was worth over 50 million rupees.\n\nThe ruling party in the centre also kept the AAP busy with the Delhi excise policy case, as the latter struggled to keep its flock together amid the jailing of its biggest leaders, including then-sitting chief minister Kejriwal.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7f6fb4de91.gif",
  "retrievedAt": "2025-10-12T01:20:42.682Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890744/bjp-wins-new-delhi-assembly-after-27-years",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:07.000Z"
}
