{
  "title": "Punjab agri plan on the cards to counter drought in Potohar region - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Punjab government is developing a plan for the agricultural development of the Potohar region to avoid drought-like conditions amid a prolonged dry spell that threatens yields in the region.\n\nThis was stated by Agriculture Secretary Iftikhar Ali Sahoo, while chairing a special meeting at the Commissioner’s Office, Rawalpindi.\n\nIn the Agricultural Transformation Plan, the focus will be on increasing the cultivation of high-value crops, like olives, avocados, groundnuts, apples, and exotic vegetables. It also aimed to increase the number of water reservoirs, like small and mini dams and water ponds.\n\nA special package will be announced by the Punjab government on the installation of high-efficiency irrigation systems and solarisation.\n\nOfficial says agriculture department asked to prepare emergency plan\n\nSpecial projects for training of farmers will be the focus of this initiative along with a particular focus on the training of women.\n\nThe meeting reviewed the current situation of wheat and other crops in light of prevailing weather conditions. Participants included Commissioner Aamir Khattak and other officials while deputy commissioners from Attock, Chakwal, Jhelum, and Murree joined the meeting via video link.\n\nMr Sahoo said that climate change and drought were the foremost challenges in recent years.\n\n“There is a need for research to cope with this challenge and scientists should focus on introducing varieties and cultivars, which can survive in these conditions, as climate change is arriving fast and it will be difficult for the present crop cultivars to maintain the yield,” he said.\n\nHe added that scientists should also focus on introducing chemicals for the increase of moisture levels in soils. He said that soil erosion was also the biggest issue in Potohar and this issue should also be addressed.\n\nHe said that terracing was a solution for the cultivation of crops and orchards on uneven lands and drip irrigation system was suitable for irrigation in such cases.\n\nHe stated that public representatives and other stakeholders would be taken on board to prepare the transformation plan. He further added that the total cultivable land in Rawalpindi Division exceeded 2.5 million acres, and wheat was cultivated on over 1.5 million acres this year.\n\nExcept for a partial area, the wheat crop’s condition in Rawalpindi Division is satisfactory, he claimed.\n\nThe secretary directed the relevant officers to guide farmers in protecting the crop from the adverse effects of dry weather in the region. The water management wing of the agriculture department was instructed to prepare an emergency plan to combat drought in the rain-fed areas.\n\nAdditionally, he said that all relevant field formations of the Agriculture Department Punjab must play an active role in guiding farmers. He emphasised the immediate arrangement for the irrigation of wheat through small dams, mini dams, and ponds in the rain-fed areas.\n\nThe performance of installed drip irrigation systems for orchard irrigation must also be reviewed.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:28:07.850Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890689/punjab-agri-plan-on-the-cards-to-counter-drought-in-potohar-region",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:32:02.000Z"
}
