{
  "title": "Asad Qaiser says talks can’t be held with govt amid ‘crackdown’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The PTI has refused to become part of talks with the government, with its leader asking how they could enter into a dialogue with the government when the rulers had stepped up the crackdown on the former ruling party.\n\nMeanwhile, party founder Imran Khan filed a contempt petition in the Islamabad High Court against the superintendent of Adiala jail for allegedly defying court orders by not allowing him to meet his wife, Bushra Bibi, who is also in the same prison.\n\nAbout the government’s offer to resume dialogue, former National Assembly speaker Asad Qaiser alleged the government had started raids to round up the PTI workers, and dozens of them had reportedly been arrested across the country.\n\nNA speaker refutes PTI claim; Imran moves IHC against jail official\n\n“In the current circumstances, how can we start negotiations?”\n\nhe said, accusing the government of using delaying tactics to buy time.\n\n“We have been left with no option but to stop negotiations and start a countrywide movement to regain the mandate of the masses,” he said. Mr Qaiser said that the PTI was holding talks for the country so that the people of Pakistan would not suffer.\n\n“Founding chairman of PTI Imran Khan has already made it clear that he does not want any relief through dialogue, and he will pursue his cases in the court of law and eventually will get justice,” he said.\n\n“The negotiations are not held on wishes; they are held with determination to address the issue,” National Assembly opposition leader Omar Ayub said while talking to media persons.\n\nHe claimed that the government failed to show commitment and determination for the talks, adding that the PTI was serious about the talks, but unfortunately the government was least interested.\n\nHe made it clear that the PTI was not interested in dialogue any more, as it had already given a chance to the government to hold a dialogue and to ensure that the country moved forward.\n\nNA Speaker Ayaz Sadiq on Friday reportedly suggested that the PTI resume talks. While speaking to media persons in Lahore, he said that the doors for the talks cannot be closed and assured that the incumbent government always showed willingness for the talks.\n\nHowever, in response to Omar Ayub’s claim on Saturday, a spokesman for the NA Secretariat clarified that Speaker Sadiq had not extended any such offer to the opposition.\n\nHe said the NA speaker had merely stated that his doors were open to every member of the house. He emphasised that the speaker would formally invite both the government and the opposition for talks once a request was made by either side.\n\nIrfan Siddiqui, the spokesperson for the government’s committee to negotiate with PTI, said the committee had practically become inactive and ineffective.\n\nIt may be noted that after three rounds of talks, the PTI had called off the dialogue with the government after the government failed to constitute judicial commissions to probe the May 9 protests and the November 26 crackdown at D-Chowk, Islamabad.\n\nThe government, however, said that it had prepared a written response to the PTI’s charter of demands and that the party should have joined the fourth round to pave the way for further negotiations. But after a deadlock, the talks finally collapsed.\n\nImran moves IHC\n\nSeparately, Mr Khan filed a contempt of court petition in the Islamabad High Court against the superintendent of Adiala Jail for allegedly defying court orders by not allowing his wife, Bushra Bibi, to meet him.\n\nThe petition, submitted by Advocate Faisal Farid Chaudhry, stated that a regular schedule had been established for meetings with family members and legal representatives.\n\nAccording to the petition, Bushra Bibi, who was also imprisoned in Adiala, was granted permission to meet her husband by an IHC order issued on January 28. However, despite this directive, the jail authorities allegedly failed to facilitate the meeting.\n\nThe petition requested the court to take contempt of court action against the jail superintendent for violating the order.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:28:22.378Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890703/asad-qaiser-says-talks-cant-be-held-with-govt-amid-crackdown",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:17.000Z"
}
