{
  "title": "Baltic nations cut link with Russia’s power grid - World - DAWN.COM",
  "author": null,
  "content": "VILNIUS: The three Baltic states on Saturday cut ties with Russia’s power grid to join the European Union’s network, the culmination of a years-long process that gained urgency with Moscow’s invasion of Ukraine.\n\nEstonia, Latvia and Lithuania — all former Soviet republics that are now in the European Union and NATO — had wanted to block Russia’s ability to geopolitically blackmail them via the electricity system.\n\n“We have removed any theoretical possibility of Russia using energy (grid) control as a weapon,” Lithuanian Energy Minis­ter Zygimantas Vaiciunas said on Saturday.\n\nThe European Com­missio­ner for Energy, Dan Jorgensen, said: “This is indeed a historic day.” “I like the light better when there’s no Russian electrons involved,” he told reporters in Estonian capital Tallinn.\n\n“It’s important to underline that this is about security... No Euro­pean country should be dependent on Russia for anything,” he added. Vaiciunas said the Baltic states had completed the disconnection process at 9:09am. Latvia later physically cut a power line to Russia. “Now we have complete control over our power grid,” Latvian Energy Minister Kaspars Melnis told reporters while holding a piece of the dismantled wire.\n\nVaiciunas said the Baltics were now operating in so-called “isolated mode” before they integrate with the European grid on Sunday.\n\nA total of 1.6 billion euros ($1.7 billion) — mostly EU funds — have been invested in the synchronisation project across the Baltic states and Poland.\n\nEuropean Commis­sion president Ursula von der Leyen was to attend a ceremony with Baltic leaders in Vilnius on Sunday.\n\nThe Baltics have long prepared to integrate with the European grid but faced technological and financial issues. The switch became more urgent after Russia invaded Ukraine in 2022, spooking the Baltic states into thinking they could be targeted.\n\nThey stopped purchasing Russian gas and electricity after the invasion but their power grids remained connected to Russia and Belarus, controlled from Moscow.\n\nThis left them dependent on Moscow for a stable electricity flow, which is crucial for factories and facilities requiring a reliable power supply.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7f4ed79bf1.gif",
  "retrievedAt": "2025-10-12T01:20:28.414Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890736/baltic-nations-cut-link-with-russias-power-grid",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:26.000Z"
}
