{
  "title": "Govt warns PTI against creating another May 9 - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Defence minister accuses party of planning violence ahead of Champions Trophy\n• Barrister Aqeel slams opposition party for lack of commitment to negotiations, urges constructive role\n\nSIALKOT: Defence Minister Khawaja Asif warned on Saturday that the government will not allow Pakistan Tehreek-i-Insaf (PTI) to disrupt the state again by repeating the events of May 9 or Nov 26.\n\nSpeaking at a press conference at his residence in Sialkot Cantt, Mr Asif criticised PTI’s plans to hold protests, accusing the Khyber Pakhtunkhwa government of misusing public funds for the party’s rally scheduled for Sunday.\n\n“The Khyber Pakhtunkhwa government is spending immense resources and wealth on the PTI rally to be held tomorrow. Millions of rupees are being spent on this rally and government employees are being forced to participate in it,” the minister claimed.\n\n“Government missionaries and government employees are working day and night for the success of the rally,” he added.\n\nHe alleged that PTI consistently attempted to tarnish Pakistan’s image on the international stage. “Whenever there is an opportunity to elevate Pakistan’s status, whether through the Shanghai Cooperation Organisation (SCO) summit or other global events, PTI launches protests,” he said.\n\n“The Champions Trophy is set to take place in Pakistan, yet PTI is planning protests on Feb 18 or 19, coinciding with the event. Why are there no such rallies and processions in other provinces? PTI’s demonstrations have always been violent, and such actions cannot be allowed,” Mr Asif said.\n\nThe minister said parties should adopt political behaviour and not attack the state like violent groups.\n\n“This behaviour of PTI is unacceptable for the state of Pakistan in any way. These people are incit­ing the atmosphere of terrorism, which is not the right thing to do. Khyber Pakht­u­nkhwa Chief Min­ister Ali Amin Gandapur said that 99 per cent of their demands have been fulfilled, so why are they still protesting? They should be celebrating instead.” he added.\n\nHe dismissed PTI’s negotiations with the government as insincere. “They were never serious about talks. The same happened before, and the discussions led nowhere. Instead, they plan rallies whenever a significant international event is scheduled,” he added.\n\nIn response to a question, Mr Asif said, “We want good relations with the international community, but there will never be any compromise with anyone on the issue of Pakistan’s integrity and Pakistan’s honour and dignity will be given priority at all costs.”\n\nRegarding the May 9 attacks, he said that those responsible had been charged with treason. “They were convicted for betraying their country and legal proceedings have been initiated against them,” he added.\n\nPM’s adviser slams PTI\n\nThe prime minister’s adviser on legal affairs, Barrister Aqeel Malik, criticised PTI for avoiding negotiations and displaying a lack of commitment to dialogue, calling on the opposition to engage constructively for national progress.\n\nSpeaking to PTV News on Saturday, Mr Malik expressed frustration over PTI’s reluctance to engage in meaningful talks. He said the government had repeatedly extended an offer for negotiations without any preconditions, only to be met with chaos.\n\nMr Malik slammed PTI for its stubborn attitude and disregard for Pakis­tan’s interests. He noted that by ignoring calls for talks, the party had shown a worrying lack of commitment to finding solutions that benefit the country.\n\nResponding to a question, he claimed that the PML-N government play­­ed a crucial role in rescuing the country from default and improving its economic outlook.\n\n“During our tenure, foreign reserves increased, exports grew and GDP showed significant impro­vement,” he claimed.\n\nHe emphasised that the opposition must play a constructive role in the country’s progress, rather than merely criticising the government.\n\nHe stressed that a collaborative approach is essential for addressing Pakistan’s challenges and achieving stability.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/0907432602ab68e.jpg",
  "retrievedAt": "2025-08-25T19:28:24.581Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890691/govt-warns-pti-against-creating-another-may-9",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:00.000Z"
}
