{
  "title": "European far-right hails Trump at Madrid event - World - DAWN.COM",
  "author": null,
  "content": "MADRID: Leaders of far-right parties in the European Parliament’s third-largest voting bloc, Patriots for Europe, praised Donald Trump’s return to power at a gathering in Madrid on Saturday held under the slogan “Make Europe Great Again”.\n\nThe event featured Hungarian Prime Minister Viktor Orban and Italian deputy premier Matteo Salvini, as well as the leaders of France’s National Rally (RN), Marine Le Pen, and the Netherlands’ PVV party, Geert Wilders.\n\n“The Trump tornado has chan­ged the world in just a few weeks ... yesterday we were heretics, today we’re mainstream,” Orban told around 2,000 supporters, most of whom waved Spanish flags.\n\nAll the speakers railed against immigration and most called for a new “Reconquista”, a reference to the Medieval re-conquest of Muslim-controlled parts of the Iberian Peninsula by Christian kingdoms.\n\nHungarian PM, Italian dy PM and French leader Marine Le Pen attend gathering\n\nPatriots was formed after the May 2024 European election and consists of 86 MEPs from 14 countries, representing a combined 19 million votes. Madrid was chosen as venue for their first official summit so that Patriots’ president Santiago Abascal, who leads Spain’s Vox party, could host.\n\nSpain’s ruling Socialist Party said in a statement it rejected what it described as a “coven of ultras”, adding: “They won’t succeed in making their black-and-white world view prevail in this country”. Vox has steadily gained ground in several polls over the past months.\n\nAccording to the Centre for Sociological Studies (CIS), it garners the strongest support among young men, members of the military and law enforcement. Despite Patriots’ stated goal of unifying Europe’s nationalist conservatives, some of the EU’s most influential parties in that camp — such as Italian Prime Minister Giorgia Meloni’s Brothers of Italy, Alterna­tive for Germany and Poland’s Law and Justice — have refused to join.\n\n“Yesterday we were the heretics. Today we are the mainstream... We are the future,” proclaimed Orban, sharing the stage with other leading extreme-right nationalists including Dutch anti-Islam firebrand Geert Wilders, Italian Deputy Prime Minister Matteo Salvini and former Czech premier Andrej Babis.\n\nBoth Orban and Le Pen hailed Trump’s “tornado” as showing the way forward for the EU, which the parties had condemned in a joint statement as riven with “climate fanaticism”, “illegal immigration” and “excessive regulation”.\n\n“We’re facing a truly global tipping point. Hurricane Trump is sweeping across the United States,” Le Pen said. “For its part, the European Union seems to be in a state of shock.”\n\nMEGA slogan\n\nThe summit in the Spanish capital has adopted the slogan “Make Europe Great Again”, a nod to Trump’s rallying cry “Make America Great Again”.\n\nOrban is seen as one of Trump’s closest EU allies, while Vox leader Santiago Abascal has highlighted the ideological affinity between the group and Trump, especially on immigration. “President Trump, to us, is like a brother in arms,” said Wilders, who called for a “reconquista” of Europe.\n\nPublished in Dawn, February 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a7f59651dce.gif",
  "retrievedAt": "2025-08-25T19:28:21.411Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890740/european-far-right-hails-trump-at-madrid-event",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T02:31:26.000Z"
}
