{
  "title": "New Zealand’s Ravindra bloodied by ball to face in Lahore tri-nation series match - Sport - DAWN.COM",
  "author": null,
  "content": "New Zealand said Rachin Ravindra was recovering well after taking a ball full in the face during the opening match of a tri-nations series in Lahore on Saturday.\n\nThe 25-year-old was fielding at deep square leg when he seemed to lose sight of the ball against the Gaddafi Stadium floodlights as he shaped to take a catch to dismiss Khushdil Shah in the 38th over of Pakistan’s innings.\n\nBlood poured from the head of a dazed Ravindra while the crowd looked on with concern. After being treated, he left the field holding a bandage tight to his bloodied forehead.\n\nThe team said Ravindra had suffered a cut to his face but was “otherwise well” and had passed his first Head Injury Assessment (HIA).\n\n“He’s been conscious the whole time, which is fantastic,” his teammate Glenn Phillips told reporters at Gaddafi Stadium.\n\n“Obviously it was a pretty terrifying moment, he lost the ball in the lights and unfortunately the ball won that situation this time. He’s being monitored and I’m sure he’ll be raring to go as soon as possible.”\n\nIn a post on Instagram, an update by the Black Caps said Ravindra was unlikely to feature in tomorrow’s match against South Africa after he “sustained a laceration to the forehead”.\n\n“The player passed the initial head injury assessment and the laceration, which required stitches, was addressed and treated at the ground,” the statement read.\n\n“He is otherwise well and will continue to be monitored under HIA protocols,” it added.\n\nRavindra had scored 25 from 19 balls at the top of the order as New Zealand piled up 330-6 before his team went on to claim a 78-run win in yesterday’s match.\n\nPhillips was named Player of the Match after scoring his maiden one-day international century to drive New Zealand to victory.\n\nHis unbeaten 106 came from just 74 deliveries and helped the Black Caps to a bumper score of 330 for six in their 50 overs before they bundled out their hosts for 252.\n\n“ODI cricket has been my favourite format growing up and it’s always something I’ve been reaching for to get that century,” said Phillips, who was playing his 37th one-day international.\n\n“It was a pretty surreal moment, I’ve been chasing it for a couple of years now, obviously batting at six doesn’t mean your opportunities to score a hundred are always there.\n\n“Thankfully today everything lined up nicely.”\n\nNew Zealand take on South Africa on Monday at the same stadium in the tri-series warm-up for the upcoming Champions Trophy, which begins when the Black Caps take on tournament hosts Pakistan again in Karachi on February 19.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/091439016d21689.jpg",
  "retrievedAt": "2025-08-25T19:27:51.677Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890825/new-zealands-ravindra-bloodied-by-ball-to-face-in-lahore-tri-nation-series-match",
  "dateList": "2025-02-09",
  "date_published": "2025-02-09T09:53:49.000Z"
}
