{
  "title": "NDMA holds 2nd National Coordination Conference for Winters Contingencies",
  "link": "https://www.app.com.pk/national/ndma-holds-2nd-national-coordination-conference-for-winters-contingencies/",
  "date_published": "2023-01-05T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): The National Disaster Management Authority (NDMA) to tackle winter-related emergencies here on Thursday organized the second National Coordination Conference for Winters Contingencies 2022-23 with key stakeholders.\nChairman NDMA, Lieutenant General Inam Haider Malik presided over the conference participated by the representatives of relevant ministries, Provincial Disaster Management Authorities (PDMAs), State Disaster Management Authority (SDMA), Gilgit Baltistan Disaster Management Authority (GBDMA), Islamabad Capital Territory (ICT), Islamabad Metropolitan Corporation (MCI), National Highway Authority (NHA), Water and Sanitation Agency (WASA), Water and Power Development Authority (WAPDA), Pakistan Meteorological Department (PMD), Armed Forces, Emergency services, and Space and Upper Atmosphere Research Commission (SUPARCO), a news release said.\nThe PMD presented the weather forecast for three months including that of January, February & March, and noted that prevailing fog and frost conditions were likely to add moisture into the soil, standing crops and inundated areas of flood zones.\nDuring the conference, the PDMAs and Rescue Agencies briefed about winters contingencies and Disaster Risk Management plans along with stock status for hazard-prone areas. They informed that respective Provincial Emergencies Operations Centers (PEOCs) were fully vigilant of the current situation and equipped to respond to the emergencies accordingly. The Rescue Agencies and Motorway Police apprised of held-mock drills for winters related emergencies.\nChairman NDMA Lieutenant General Inam Haider Malik acknowledged the efforts of relevant departments for effective management of this winter season. He appreciated SDMA for the timely response during Pir Chansi incident. However, he instructed Provincial Authorities to improve the logistics arrangements and tourist facilitation services especially in hilly areas.\nHe underlined the need of active participation of local communities in response and emergency situations. He directed the relevant departments to sensitize the communities for hospitability behavior towards tourists in case any disaster strikes in their area.\nThe Chairman NDMA also highlighted that NDMA was working on formulation of ‘Disaster/risk Calendar’ based on foreseeable disasters for generating region-specific emergency alerts and response which would be subjected to revision by end of calendar year in light of practical experiences. He also apprised the participants of his vision on establishment of remodeled and technology-driven National Preparedness and Response System in the country for a proactive approach to disaster management.\nThe PDMAs were directed to produce disaster management audit of disaster-prone areas to pitch guidelines, customized emergency plans and rapid need assessment along with stocking at warehouses and logistic needs.",
  "retrievedAt": "2025-08-11T05:41:22.111Z"
}
