{
  "title": "Mushahid for coherent counter terrorism policy amid NACTA’s lead role",
  "link": "https://www.app.com.pk/national/mushahid-for-coherent-counter-terrorism-policy-amid-nactas-lead-role/",
  "date_published": "2023-01-05T14:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): Chairman Senate Standing Committee on Defence, Senator Mushahid Hussain Sayed on Thursday said that there was a need to develop a coherent counter-terrorism policy with the National Counter Terrorism Authority (NACTA) in the lead role.\nThe Chairman of the Senate body on Defence made these remarks while presiding the committee meeting held here where the forum was briefed on the Pakistan-Afghanistan border situation amid an increase in cross-border attacks and remedial measures undertaken to ensure peace and security throughout the country, a news release said.\nThe Committee was also briefed on the deteriorating internal security situation in the Province of Khyber Pakhtunkhwa with specific reference to the recent attack, capture and hostage situation at Bannu Cantonment, it said.\nSecretary, Ministry of Defence, Lt Gen (R) Hamood Uz Zaman Khan assured the committee members that the security forces were adept and well-equipped to counter any security threat. He apprized that a peaceful and stable Afghanistan was in the best interest of Pakistan and engagement with the Afghan side on security and border management was a continuous process.\nSenator Mushahid Hussain Sayed was of the view that there was a need to gain strategic clarity to deal with the menace of terrorism for which the National Action Plan should be revisited considering the challenging geo-strategic environment.\nThe Chair further emphasized for an effective intelligence-sharing mechanism among different security agencies and enhanced border management between Pakistan and Afghanistan.\nThe Committee expressed the resolve that the people of Pakistan stand by the valiant armed forces in such testing times and appreciated the Pakistan Army’s successes in the fight against terrorism and continued efforts for bringing peace and stability to the region.\nThe Defence Committee also appreciated the role and sacrifices of the Police, the Counter Terrorism Department (CTD) and other law enforcement agencies in combating terrorism.\nThe Committee offered Fateha for those martyred in various terror-related incidents in the recent past.",
  "retrievedAt": "2025-08-11T05:41:17.177Z"
}
