{
  "title": "Marriyum busts Imran’s false narrative of ‘helplessness’",
  "link": "https://www.app.com.pk/national/marriyum-busts-imrans-false-narrative-of-helplessness/",
  "date_published": "2023-01-05T18:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Thursday said it was only Imran Khan who was responsible for the ruined economy and damaged social fabric of the country as it was the result of his four-year misrule marred by massive unemployment, extreme inflation, poverty, incivility, immorality, and media muzzling.\nAddressing a news conference, the minister busted Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan’s narrative of “helplessness”, which was nothing but a “pack of lies”.\nThe PTI even today had its governments in four federating units, including Punjab, Khyber Pakhtunkhwa, Azad Jammu & Kashmir, and Gilgit-Baltistan, but ironically its chairman was complaining of “helplessness”, she said.\nMarriyum said Imran Khan had changed his narrative on the “regime change” as he was now blaming only one person instead of a foreign country.\n“Imran Khan now keeps on hyping that his government was changed by only one person, who also planned for his murder,” she said. The PTI chief was right as it was only one person – Imran Khan himself who had played havoc with the country, deprived the poor of their livelihood, traded off Kashmir, taken historic foreign debts, and looted the national wealth ruthlessly during his four-year rule, the minister added.\nShe said it was only Imran Khan who had allowed mafias to rob the national exchequer, pushed the country into an economic quagmire that caused extreme inflation and unemployment, increased gas and electricity prices, muzzled the media, not only got beaten journalists with their ribs and nasal bones broken but also sent many behind the bars, damaged moral values and promoted the culture of intolerance among the youth by churning out lies consistently.\nThe minister said Imran Khan had boasted to create 10 million jobs and wipe out corruption within 90 days of taking charge of the government, but instead he deprived the youth of sports facilities, rendered 6 million unemployed, and set records of embezzlement and kickbacks.\nIt was also Imran Khan who squarely damaged the social values by instilling vulgarity into young minds, and launched malicious campaigns against the armed forces martyrs and vile attacks on working women.\nMarriyum said it was astonishing that the person, who remained imposed on the country for four years, was persistently complaining of his “helplessness” since his ouster from power. How a “helpless person” had plundered the Toshakhana and also allowed his cabinet members to get kickbacks by delaying the purchase of LNG from abroad, she wondered.\nShe asked how his wife Bushra Bibi had demanded a five-karat diamond ring and sold expensive watches “purchased” from the Toshakhana, and her friend Farah Gogi in connivance with the former Punjab chief minister accumulated a huge sum of illegal money if he (Imran) was helpless.\nHow it was possible for a “helpless Imran Khan, to keep Tayyba Gul hostage in the Prime Minister’s House to blackmail the then NAB chairman, she added.\nSimilarly, she said, a question arose that how he had managed to get Maryam Nawaz arrested in the presence of his father and send all the other leaders of Pakistan Muslim League-Nawaz behind bars in fake cases.\nMarriyum said it was now for his supporters to introspect that how a “liar and impersonator” could be their leader, who changed his narratives like the weather.\nShe said the person whose party still had a government in Punjab, was complaining of helplessness in registering a case of a murder attempt on him. He made the announcement of dissolving the Punjab Assembly but was surprisingly unable to get the attackers arrested despite having his own government and chief minister in the province.\nShe said the medical board, formed by his own party’s government, had ruled that he (Imran) did not receive a bullet during the Wazirabad incident rather a few metal fragments.\nThe minister said Imran Khan also had government in Khyber Pakhtunkhwa, where extreme inflation coupled with terrorismruled the roost but its chief minister remained busy serving his party chief at Zaman Park, Lahore.",
  "retrievedAt": "2025-08-11T05:41:13.468Z"
}
