{
  "title": "Sherry Rehman urges Apex Court for formal hearing of Z.A. Bhutto’s reference",
  "link": "https://www.app.com.pk/national/sherry-rehman-urges-apex-court-for-formal-hearing-of-z-a-bhuttos-reference/",
  "date_published": "2023-01-05T12:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):On the occasion of 95th birth anniversary of the founder of Pakistan Peoples Party and former premier Zulfikar Ali Bhutto, Federal Minister for Climate Change, Senator Sherry Rehman on Thursday urged the apex court to conduct a formal hearing of the reference filed regarding his judicial killing and correct the historical mistake.\nIn a flurry of tweets, the Federal Minister paid homage to her leader. “Today, under the leadership of Chairman Bilawal Bhutto Zardari, People’s Party is following the mission of Shaheed Bhutto and Shaheed Bibi,” she added.\nSenator Rehman extended her best wishes on the occasion of the 95th birthday of Shaheed Zulfiqar Ali Bhutto to his family, party leadership, workers and his fans all over the world including Pakistan.\n“As a Pakistani and a member of People’s Party, today is a very happy day for us. Born in Larkana on January 5, 1928, Zulfiqar Ali Bhutto became the first constitutionally elected Prime Minister of Pakistan, the founder of the People’s Party, the creator of the Constitution of Pakistan and the nuclear programme. Because of his public vision, politics, struggle and sacrifices, people gave him the title of Quaid-e-Awam (the people’s leader).”\nShe added that the main objective of his politics was to empower the oppressed lower class and the workers. He laid the foundations of public politics and parliamentary democracy in Pakistan, giving the people electoral politics as the center of power and authority that was never seen before in the country’s history.\nThe minister underlined that Shaheed Bhutto gave a social contract to keep the federating units united. Bhutto ensured the rights of the poor, women and minorities along with social and economic justice, she added.\nHe introduced Pakistan as an important partner in the world and gave the country a nuclear programme for national defense and integrity.\n“By judicially killing Shaheed Bhutto, the enemies thought that the constitution, democracy and People’s Party would be destroyed from the country. Today, I want to tell this mindset that despite all your efforts and oppression Shaheed Zulfikar Ali Bhutto’s constitution, democracy and People’s Party are intact.”",
  "retrievedAt": "2025-08-11T05:41:17.635Z"
}
