{
  "title": "Australia committed to promoting gender equality in sports: Australian HC",
  "link": "https://www.app.com.pk/national/australia-committed-to-promoting-gender-equality-in-sports-australian-hc/",
  "date_published": "2023-01-05T08:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP):The Australian High Commissioner to Pakistan, Neil Hawkins on Thursday said that Australia is committed to promoting inclusivity and gender equality in sports and would love to see talented women.\nHe made these remarks during a meeting with Pakistan National Women’s Cricket Team in Karachi and wished them good luck ahead of their tour of Australia.\nSpeaking at the event, the High Commissioner said, “It is a great privilege to meet Pakistan National Women’s Cricket Team. Our countries share a passion for cricket. I wish the team a fantastic stay in Australia. They will receive a very warm Australian welcome. We expect some fabulous cricket”. The High Commissioner also invited fans and visitors from Pakistan to be part of the series and Pakistan Cricket Board’s #BackOurGirls campaign.\nThe High Commissioner also met with the Pakistan U19 Women’s squad who are also practicing in Karachi for the inaugural ICC U19 Women’s T20 World Cup scheduled to take place in South Africa later this month. “The Australian High Commission has been supporting under-19 girls’ cricket in Pakistan since 2016 as we believe cricket and other sports can help tear down barriers and stereotypes,” he said.\nStarting from Friday 16 January, hosts and reigning champions Australia will host Pakistan National Women’s Cricket Team for an ODI and a T20I series scheduled in Brisbane, Sydney, Hobart, and Canberra. The ODIs are part of the 2020-2025 ICC Women’s Championship.\nThe captain of the Pakistan Women’s Cricket Team Bismah Maroof said, “We had a good 2022 year, where we won five of the six ICC Women’s Championship matches. We are looking forward to playing a competitive series in Australia. The series against Australia will provide an opportunity for players to express their talent on the field and make new fans in the tour Down Under,” she added. The Pakistan National Women’s Cricket Team held a seven-day camp in Karachi and will be flying from Karachi to Brisbane from Karachi on 6 January.",
  "retrievedAt": "2025-08-11T05:41:20.846Z"
}
