{
  "title": "Govt determined to overcome economic challenges: PM",
  "link": "https://www.app.com.pk/national/govt-determined-to-overcome-economic-challenges-pm/",
  "date_published": "2023-01-05T17:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 5 (APP): Prime Minister Shehbaz Sharif Thursday here expressed the resolve of the government to overcome economic challenges at any condition with the support of the business community and the people.He was talking during a meeting with a representative delegation of the Pakistan Business Council.The delegation expressed confidence in the economic policies of the government and assured of cooperation to the government for different steps taken for energy saving.They exchanged views on different suggestions for improving the present economic and business conditions.Chairman Pakistan Business Council Muhammad Aurangzeb was leading the five-member delegation which met the prime minister.The delegation said the Pakistan Business Council stood with the government till the complete rehabilitation of the country’s economy.The delegation gave useful suggestions for economic stability and progress.\nWhile welcoming the suggestions, the prime minister said due to criminal negligence of the past government during the last four years, the country’s economy suffered an irreparable loss.“When our coalition government took helm of affairs of the country with the desire to serve, the country’s economy was on the brink of disaster. We started work with dedication and devotion in every sector and took upon ourselves the task to take the country’s economy out of the quagmire,” he added.Minister for Finance Ishaq Dar, Minister for Investment Board Chaudhry Salik Hussain, Minister for Economic Affairs Sardar Ayaz Sadiq, Advisor to PM Ahad Cheema, Special Assistant to PM Tariq Bajwa, Dr Jehanzeb Khan, Governor State Bank Jameel Ahmed, Chairman FBR Asim Ahmed and officials concerned attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:41:13.048Z"
}
