{
  "title": "PM for measures to enhance IT exports from $2.6b to $15b in three years",
  "link": "https://www.app.com.pk/national/pm-for-measures-to-enhance-it-exports-from-2-6b-to-15b-in-three-years/",
  "date_published": "2023-01-05T12:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 05 (APP): Prime Minister Shehbaz Sharif on Thursday directed the authorities concerned to take practical steps to enhance country’s IT exports from current $2.6 billion to $15 billion within next three years.\nThe prime minister, who chaired a meeting to discuss the promotion of information technology sector, also directed to enhance the number of IT professionals from 0.6 million to 1.5 millions.\nHe instructed the Higher Education Commission, universities and training institutes to work on the said target on priority basis, besides improving the educational curriculum in accordance with the market needs.\nThe prime minister also ordered the formation of a standing committee to deliberate over the linkages between the government and the IT industry and for resolution of the industry ‘s issues.\nThe committee would comprise the representatives of the IT industry, State Bank of Pakistan, finance ministry, IT ministry and other relevant departments.\nThe prime minister assured to resolve the IT industry’s issues and asked the relevant authorities to take effective measures for the purpose.\nHe also urged the IT industry to bring its export revenue to Pakistan and instructed the State Bank of Pakistan and Federal Board of Revenue and other departments to take effective measures.\nHe said Pakistan had a huge potential in the IT sector which needed to be exploited. He said the IT industry stood alongside the government to improve the national economy.\nThe prime minister said the IT entrepreneurs had played a key role in the promotion of the IT sector. However, the country’s IT exports were not in accordance with the existing talent.\nHe said the government would recognise the exporters who had played their role to enhance the IT exports.\nThe representatives of the IT sector apprised the prime minister of their issues and put forward their suggestions.\nFederal ministers Ishaq Dar and Aminul Haq, Advisor Ahad Cheema, SAPMs Tariq Bajwa, Jahanzeb Khan and Syed Fahad Hussain, senior government officers and representatives of the IT sector attended the meeting.",
  "retrievedAt": "2025-08-11T05:41:19.630Z"
}
