{
  "title": "Remember poor during Eidul Azha, says Ashrafi",
  "link": "https://www.app.com.pk/national/remember-poor-during-eidul-azha-says-ashrafi/",
  "date_published": "2021-07-21T11:54:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 21 (APP): Special Representative to Prime Minister on Religious Harmony and Middle East Allama Tahir Ashrafi has urged the people to remember the poor segments\nof society while observing the Eidul Azha in commemoration of the sacrifices rendered by Hazrat Ibrahim (A.S) and his son Hazrat Ismail (A.S).\nHe was talking to the media at Bahria Town Grand mosque after delivering\nEid sermon on Wednesday.\nHe said the message of this Eid was the sacrifice and every one should\nobserve this spirit to help the unprivileged people.\nHe welcomed the release of Pakistani prisoners from Saudi Arabia on the eve of Eidul Azha and thanked the Saudi King Salman Bin Abdul Aziz and the Crown Prince Mohammad Bin Salman for granting relief to these prisoners.\nAshrafi told that the release was made after the efforts of the Prime Minister Imran Khan.\nHe said that on the request of Prime Minister Imran Khan, Saudi government will release\nmore Pakistanis from prisons during coming days.\nTo a question, PM’s Special Representative said that Israelis and Indians\nwere behind the baseless propaganda against the brotherly ties between\nSaudi Arab and Pakistan.\nHe urged the social media community to verify the information before circulating\nit on their channels.\nTahir Ashrafi, appreciating the Saudi Authorities for successfully organizing\nthe Hajj 2021 during the COVID-19 pandemic, said that not a single positive\ncase was reported among the pilgrims due to the arrangements.\nHe appealed to the people to strictly adhere to the COVID-19 Standard Operating Procedures (SOPs) while celebrating Eid.\nEarlier, he delivered Eid sermon and stressed upon the need to forge unity among the Muslim Ummah.\nHe prayed for the liberation of the oppressed Muslims of Palestinians and Kashmiris. He also prayed for the stability, prosperity and sovereignty of Pakistan.",
  "retrievedAt": "2025-08-11T20:59:33.038Z"
}
