{
  "title": "Youth to foil hybrid war launched against Pakistan: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/youth-to-foil-hybrid-war-launched-against-pakistan-sheikh-rashid/",
  "date_published": "2021-07-21T11:02:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 21 (APP): Minister for Interior Sheikh Rashid Ahmed on Wednesday said youth would foil the hybrid war launched against Pakistan under a conspiracy by the enemies of the country including India and Israel.\nAddress a press conference here the minister said, youth, particularly those who were well versant with the social and electronic media, must be ready in the face of ongoing hybrid war, which might be expedited in the days to come.\nThe youngsters should come forward to play a role to defend the country as in the contemporary world; social and electronic media was being used for hybrid war.\nThe enemies were hatching conspiracies to malign Pakistan. Indian media was aggressively propagating against Pakistan and trying to make it an abduction case, he said adding, the ambassador’s daughter changed four taxis to travel in few hours which reflects that there is no issue of law and order in Islamabad.\nThe enemies, however, were trying to give the incident a different angle which had nothing to do with reality, he added.\nHowever, he said, crime is reported all over the world including Indian cities.\nPrime Minister Imran Khan had directed the agencies, all the Chief Secretaries and Inspector General of police of the four provinces to remain fully alert and keep a vigil on the security situation, he added.\nThe enemy countries were in hybrid warfare against Pakistan, but their nefarious designs were doomed to fail.\nTo a question, he said, whether she (Afghan ambassador’s daughter) wants to fight her case or not, but the Pakistani agencies would fully investigate the case.\nHe said that the investigation into the case had been completed to a large extent. “We had traced all four taxis that were used for traveling by the ambassador’s daughter.\nThe drivers of all the taxis were ordinary persons, who had no previous criminal record,” he added.To a question, he informed that a high-level investigation in Dasu case was underway.\nPakistan, he said, was moving forward under the leadership of Prime Minister Imran Khan as all the armed forces and civil institutions were fully ready to cope with any situation. Punjab police had traced the culprits of Johar Town incident within 16 hours, he said.\nShiekh Rashid said PML-N leader Maryam Nawaz Sharif was not running the election campaign in Azad Jammu and Kashmir (AJK) as she was making speeches against Imran Khan.\nImran Khan and Usman Buzdar would launch the Lai Expressway soon, he replied to a question.",
  "retrievedAt": "2025-08-11T20:59:34.343Z"
}
