{
  "article_id": "2025-04-27_ea43b4882937960b3f4f04836d4c867a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-chairman-inspects-development-work-in-sectors-e-12-c-14/",
    "retrieved_at": "2025-08-27T14:56:38.033Z"
  },
  "metadata": {
    "title": "CDA chairman inspects development work in sectors E-12, C-14",
    "author": null,
    "date_published": "2025-04-27T11:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 193,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 27 (APP): Chairman Capital Development Authority (CDA) Muhammad Ali Randhawa conducted inspections in Sectors E-12 and C-14 on Sunday, directing the officials to expedite development work and take strict action against illegal constructions and encroachments. During his visit, Randhawa emphasized zero tolerance for compromised construction quality and ordered the immediate removal of encroachments on CDA land. \"There will be no compromise on standards,\" he stated, instructing the installation of main gates in E-12 and modern LED lighting on roads. He also called for completing infrastructure in E-12's sub-sectors to facilitate plot handovers. In Sector C-14, where 65% of development work is complete, Randhawa directed the release of funds to ensure timely project completion. He also mandated LED lighting for the area's roads. Additionally, the chairman ordered a crackdown on illegal constructions near Margalla National Park and Margalla Road, including utility disconnections and public awareness campaigns. \"CDA land will be cleared of illegal occupants,\" he warned, urging the public to avoid investing in unauthorized properties. Randhawa reiterated CDA's commitment to planned development, vowing to utilize all resources to safeguard public land. The visit was attended by senior CDA and Islamabad Administration officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}