{
  "article_id": "2025-04-27_fae83495dd4c942169a999a9b11ed7d8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/security-forces-foil-infiltration-attempt-killed-54-khawarij-terrorists-ispr/",
    "retrieved_at": "2025-08-27T14:56:13.806Z"
  },
  "metadata": {
    "title": "Security forces foil infiltration attempt, killed 54 Khawarij terrorists: ISPR",
    "author": null,
    "date_published": "2025-04-27T14:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 332,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Apr 27 (APP): Security Forces while thwarting infiltration attempt of a large group of Khwarij terrorists through Pak-Afghan border killed 54 Khwarij in general area Hassan Khel, North Waziristan District. \"On night 25/26 and 26/27 April 2025, movement of a large group of khwarij, who were trying to infiltrate through Pakistan-Afghanistan border, was detected by the security forces in general area Hassan Khel, North Waziristan District,\" said a news release by Inter Services Public Relations (ISPR) here. \"Own troops effectively engaged and thwarted their attempt to infiltrate. As a result of precise and skillful engagement, all fifty four khawarij have been sent to hell. A large cache of weapons, ammunition & explosives was also recovered from the killed Khawarij,\" it further said. Intelligence reports indicate that this group of Khawarij was specifically infiltrating on behest of their \"foreign masters\" to undertake high profile terrorist activities inside Pakistan. Such actions by Fitna al Khwarij (FAK), at a time when India is leveling baseless accusations against Pakistan, clearly implies on whose cues FAK is operating, the press release said. Such actions amount to treason and betrayal against the state and its citizens. The recent NSC also underscored the fact that distracting Pakistan's security forces from their focus on the war against terror seems to be the strategic intent of India to allow a breathing space to FAK which is reeling from the onslaught of our Armed Forces resolute offensive against them, it further said. The security forces demonstrated exceptional professionalism, vigilance & preparedness and prevented a potential catastrophe. This is the highest ever number of khwarij killed by our Security Forces in a single engagement during entire campaign against terrorism. \"The Security Forces of Pakistan remain resolute and unwavering in their commitment to defend the nation's frontiers and to eradicate the menace of terrorism. Such bold and decisive actions further strengthen our collective resolve and underscore that Pakistan is winning the war against terrorism, while achieving significant successes against terrorists,\" it further said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}