{
  "article_id": "2025-04-27_513d42dd52297a8d00574efcab31c1ff",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/comstech-aust-sign-mou-to-facilitate-scholarships-for-palestinian-students/",
    "retrieved_at": "2025-08-27T14:56:17.233Z"
  },
  "metadata": {
    "title": "COMSTECH, AUST sign MoU to facilitate scholarships for Palestinian students",
    "author": null,
    "date_published": "2025-04-27T12:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 245,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 27 (APP): The Organization of Islamic Cooperation Standing Committee on Scientific and Technological Cooperation (COMSTECH) and Abbottabad University of Science and Technology (AUST) on Sunday signed a Memorandum of Understanding (MoU) to offer scholarships to Palestinian students for the academic year 2025-2026. The MoU was signed by Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General, OIC-COMSTECH, and Prof. D. Mujadad ur Rehman Vice Chancellor of Abbottabad University of Science and Technology, at a ceremony attended by senior officials from both COMSTECH and AUST. Under this collaboration, Abbottabad University of Science and Technology has committed to providing higher education opportunities to Palestinian students through both online and on-campus learning modes. This initiative is aimed at ensuring flexibility and promoting academic excellence among Palestinian youth. The UST Abbottabad will offer 40 scholarships in various undergraduate programs including Doctor of Physiotherapy, Doctor of Pharmacy, BS Medical Laboratory Technology (MLT), BS Microbiology, BS Food Sciences, BS Computer Science, and BS Software Engineering. Furthermore, a dedicated Freelancing Program in Computer Science and Software Engineering is also available online, offering as many as 2,000 placements to equip students with essential digital skills. This MoU is part of the broader \"COMSTECH Scholarships and Research Fellowships for Palestinian Nationals\" program, reflecting the commitment of Pakistan's higher education institutions towards supporting the academic pursuits of Palestinian youth. The ceremony marked a significant step towards strengthening international cooperation in higher education and fostering the empowerment of Palestinian students through quality education and skill development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}