{
  "title": "Afridi meets MCL delegation",
  "link": "https://www.app.com.pk/national/afridi-meets-mcl-delegation/",
  "date_published": "2022-04-25T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): Deputy Chairman Senate, Mirza Muhammad Afridi on Monday met a delegation led by the Member of the Legislative Council (MCL) of New South Wales of Sydney, Australia, Shaoquett Chaher Moselmane comprising of ten Charity-cum Business Community members here at the Parliament House.\nDuring the meeting, Mr Shaoquett Chaher Moselmane said that the trade volume between Pakistan and Australia is under 2 billion dollars which need to be elevated given the size of the Pakistani Community.\nThe Deputy Chairman Senate, Mirza Muhammad Afridi underlined that the existing cordial ties between the two countries need to be enhanced further as the vast potential exists for enriching bilateral cooperation in politics, trade and economy, agriculture, technical education and vocational training science & technology and sports.\nThe Deputy Chairman asserted that efforts should be made to reduce the trade deficit between the two countries. “Business Communities and TDAP should be sent to Australia for showcasing expo’s which will accelerate the Business activities.”\nMuhammad Afridi apprised the delegation that Gwadar will be a game-changer in the entire region and we are inviting countries to invest in Gwadar.\nHe underscored that opening the central Asia gateway and making transportation operational will pave way to the upward trajectory of our bilateral relations.\nSenator Bahramand Khan Tangi urged the Charity cum Business Community members to facilitate Pakistan with advance equipments for disabled citizens.\nShaoquett Chaher Moselmane said that over 125,000 strong diasporas and more than 11, 500 Pakistani students in Australia are a source of great Strength for Australia, adding that Australia plans to set up Australian faculties in Islamabad and create opportunities to start student exchange programs between the two countries.\nThe meeting discussed Islamophobia and ways to tackle this challenge in detail.\nMember of the Legislative Council (MCL) of New South Wales of Sydney, Australia enlightened the Pakistani side that laws exist to protect the social and religious rights of every citizen, however, further legislative reforms are being made to counter it.\nMuhammad Afridi said that Pakistan welcomes cooperation with Australia in the areas of Information Technology, including software development and electronic manufacturing. The two countries can also explore cooperation in agriculture, water management and mining etc.\nSenator Bahramand Khan Tangi, Senator Zeeshan Khanzada, Senator Afnan Ullah Khan, Senator Faisal Saleem also attended the meeting. Secretary Senate, Mohammad Qasim Samad Khan along with senior officers of the senate also attended the meeting.",
  "retrievedAt": "2025-08-11T14:45:42.699Z"
}
