{
  "title": "Fawad should not mislead  masses through false  propaganda about PM’s Saudi visit: Marriyum",
  "link": "https://www.app.com.pk/national/fawad-should-not-mislead-masses-through-false-propaganda-about-pms-saudi-visit-marriyum/",
  "date_published": "2022-04-25T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Monday stated that Prime Minister Shehbaz Sharif was not going to Saudi Arabia on a chartered plane.\nThe minister, in a statement in response to a tweet of former information minister  Chaudhry Fawad Hussain, said the Pakistan Tehreek-e-Insaf (PTI) leaders should not mislead the masses through false and baseless propaganda.\nShe clarified that the prime minister would go to Saudi Arabia on a commercial flight and he would bear the expenses of his visit. For 10 years as Punjab’s chief minister, Shehbaz Sharif used to pay his travel expenses out of his own pocket.\nMarriyum Aurangzeb said as former information minister, Fawad should not make  such a baseless statement against journalists as no media person was going to Saudi Arabia at the government’s expenses.\nShe said fake news was the hallmark of former information minister.\nThe minister recalled that the media used to give prominent coverage to Imran Khan when he was in the opposition, but after coming to power he targeted and victimised the media houses and media persons.\nDuring the PTI rule, she said, news channels were closed down, airing of certain programmes (by news channels) and publishing of columns were banned, while  journalists were arrested and even physically thrashed.\n” Now after being thrown out of power in a disgraceful manner, the PTI leadership is maligning the media,” she added.  Sometimes they involved journalists in conspiracies and sometimes posted false tweets about their visits, she maintained.\nThe minister said the four-year PTI’s government tenure had deprived the masses of affordable flour, sugar, medicines, electricity and gas, besides ruining economy and employment opportunities.\nShe asked Chaudhry Fawad to also tweet on the watch, necklace and rings of the Tosha Khana.\nMarriyum asked Imran Khan asked to lecture on austerity as everyone now knew  about the realty of his “farce of austerity”, which had resulted into the biggest fiscal deficit in the country’s history after four years.\nThose involved in the dramas of buffalo auctions, chicken and eggs should stop misleading the masses through false propaganda, she added.",
  "retrievedAt": "2025-08-11T14:45:52.244Z"
}
