{
  "title": "Science Minister stresses for effective role of ministry in facilitating people",
  "link": "https://www.app.com.pk/national/science-minister-stresses-for-effective-role-of-ministry-in-facilitating-people/",
  "date_published": "2022-04-25T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): Federal Minister for Science and Technology, Agha Hassan Baloch Monday gave directives to enhance the effective role of the ministry in facilitating people particularly in underprivileged areas.\nHe was chairing a briefing on the progress of Public Sector Development Program (PSDP) projects under the ministry and gave directions.\nFederal Secretary for Ministry of Science and Technology, Humaira Ahmed and heads of all attached departments briefed the minister regarding the ongoing projects and their progress.\nThe minister was pleased to know that the ministry was working on a variety of initiatives that would boost the country’s socio-economic status.\nHe appreciated the work of all departments and also gave directions for equitable progress in all provinces.\nHe directed that a state of the art forensic lab must be established in Balochistan to facilitate the local people as well as those of nearby regions of Khyber Pakhtunkhwa and Sindh.\nHe expressed that people in distress should not be made to wait for weeks to get their samples tested from the major forensic lab in Lahore.\nHe was of the view that skill development centers must be established in multiple areas of Balochistan in order to empower the locals to maximize their employment opportunities under China Pakistan Economic Corridor (CPEC).\nHe also reiterated that three new campuses of COMSATS University at Quetta, Jafarabad, and Gawadar, that are already approved, be established on priority basis to provide state of the art higher education facilities in general and uplift the standard of education in the field of Science and Technology in particular for the socio-economic uplift if the people of Balochistan.\nAgha Hassan acknowledged the efforts of the ministry to provide quality education to the people of Balochistan through Science Talent Farming scheme and upgradation of three schools at Quetta, Pishin, and Qila Saifullah to the STEM program.",
  "retrievedAt": "2025-08-11T14:45:45.060Z"
}
