{
  "title": "OIC-COMSTECH and HUCM Launch 2nd Joint Technicians Training Program to Boost STEM Capacity",
  "author": null,
  "content": "ISLAMABAD, May 30 (APP):The Ministerial Standing Committee on Scientific and Technological Cooperation (COMSTECH) of the Organization of Islamic Cooperation (OIC) and Hunan University of Chinese Medicine (HUCM), China, have decided to launch of the Second Joint Technicians Training Program, to be held from June 08-17 in Changsha, China.\nFollowing the resounding success of the inaugural program, this year’s edition will once again convene a diverse group of technicians and technologists from OIC member states and other countries. Participants, drawn from across Science, Technology, Engineering, and Medicine (STEM) disciplines, will receive practical, hands-on training in cutting-edge laboratory techniques and instrumentation within HUCM’s advanced research facilities\nThe program responds to the pressing need to strengthen technical expertise in the OIC region, where shared challenges such as poverty, public health crises, food insecurity, and climate change continue to hinder sustainable development. Despite the immense potential across the 57-member states of the OIC, a critical shortage of trained technical personnel and researchers remains a major obstacle to scientific and technological progress.\nRecognizing this gap, COMSTECH and HUCM have collaborated to develop a targeted training initiative aimed at enhancing laboratory and instrumentation skills essential for research and innovation. Nineteen selected participants will receive intensive instruction in high-end analytical and diagnostic techniques, including LCMS, GCMS, FTIR, MS, and NMR, among others.\nThe program is tailored for laboratory technologists, technicians, and early-career researchers affiliated with universities, hospitals and R&D institutions.\nCandidates with educational backgrounds in engineering technology, laboratory sciences, or postgraduate STEM education are eligible, with special preference given to women and applicants from Least Developed Countries (LDCs) within the OIC.\nThis joint initiative underscores the value of international academic cooperation in driving capacity building and fostering resilience in science and technology sectors across the Global South.\nThe COMSTECH–HUCM Joint Technicians Training Program exemplifies a forward-looking model of partnership, one that is committed to empowering individuals, advancing innovation, and promoting inclusive scientific development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:04:21.797Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/oic-comstech-and-hucm-launch-2nd-joint-technicians-training-program-to-boost-stem-capacity/",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T10:40:00.000Z"
}
