{
  "title": "Eid security boosted: over 6,800 police deployed to curb aerial firing & one-wheeling",
  "author": null,
  "content": "ISLAMABAD, May 30 (APP):Inspector General of Police (IGP) Syed Ali Nasir Rizvi, chaired an operational commanders’ conference on Friday to review the security and crime prevention measures for the upcoming Eid-ul-Azha holidays.\nAn official told APP that the meeting began with special prayers for martyred officer Sudheer Abbasi and for the speedy recovery of injured officer Jafar Jahangir. The IGP was briefed on Eid security preparations, deployment plans, crime control strategies, and interfaith harmony initiatives.\nIG Rizvi said that Eid-ul-Azha symbolizes unity, sacrifice, and inter-sectarian harmony, and the police force will ensure peaceful celebrations across the capital.\nIG Rizvi said six designated cattle markets have been set up in Islamabad, where more than 1,000 police officers and security guards will be deployed. Police help desks will also be established at these markets to prevent fraud, counterfeit currency circulation, and to assist citizens.\nEid prayers, IG Rizvi informed, will be offered at 832 locations in the city, with special duty points set up at marketplaces and entry checkpoints to ensure security.\nAn additional 1,000 police officers, IG Rizvi added, will be deployed on duty across 44 key locations on the night before Eid.\nUnder a special patrolling plan, 982 officers will be assigned for regular patrols to maintain law and order during the holidays, according to IG Rizvi.\nHe noted that around 1,040 police personnel will be deployed at public parks and recreational spots to ensure safety for families and visitors.\nSpecial patrols, neighborhood watch systems, and targeted duties, IG Rizvi stated, will be activated to prevent house thefts during the Eid holidays.\nA comprehensive traffic management plan will also be introduced to facilitate smooth flow of traffic and prevent congestion near key areas, IG Rizvi said.\nPolice help desks will be set up at all major commercial centers to provide swift assistance to citizens, according to IG Rizvi.\nA specialized patrolling plan has been devised for Margalla Hills to ensure visitor safety, IG Rizvi said.\nStrict action will be taken against aerial firing, one-wheeling, and illegal arms possession during the Eid holidays, IG Rizvi warned.\nCattle markets must only be set up at designated spots, and officers will visit marketplaces to ensure compliance, IG Rizvi emphasized.\nStrict measures will also be taken against professional beggars during the holidays, and all officers have been directed to carry out visits and enforcement, IG Rizvi added.\nSearch and sweep operations across the city will be intensified to prevent any untoward incidents, IG Rizvi said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:04:42.504Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/eid-security-boosted-over-6800-police-deployed-to-curb-aerial-firing-one-wheeling/",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T08:46:00.000Z"
}
