{
  "title": "Ethiopia, Pakistan discuss bilateral cooperation in higher education",
  "author": null,
  "content": "ISLAMABAD, May 30 (APP): Ethiopia Ambassador to Pakistan Dr. Jemal Beker Abdula, Friday met with Chairman Higher Education Commission (HEC), Dr. Mukhtar Ahmed and discussed various avenues for bilateral cooperation in the higher education sector in a bid to further strengthen the bilateral ties and foster academic excellence through potential collaborative initiatives.\nThe meeting took place between two official in HEC Chairman Office in Islamabad.\nBoth sides discussed a wide range of initiatives, including student and faculty exchange programs, curriculum development for quality assurance in higher education, exchange of knowledge and expertise in educational digitalization, and joint research projects in various fields such as agriculture, science and technology, medicine, engineering and Artificial Intelligence.\nAmbassador Dr. Jemal highlighted the great importance attached by Prime Minister Dr. Abiy Ahmed to quality assurance in education and the promotion of modern technologies in the country.\nHe noted Pakistan’s extensive experience and knowledge in higher education, which Ethiopia could leverage for its human resource development.\nThe Ambassador also emphasized education diplomacy as a cornerstone for building lasting and sustainable ties between the two countries.\nHEC Chairman Dr. Mukhtar Ahmed warmly welcomed the Ambassador’s initiative, reiterating Pakistan’s commitment to supporting Ethiopia’s educational aspirations.\nHe briefed the Ambassador on the advancements in Pakistan’s higher education sector, particularly in digital learning platforms and research infrastructure.\nThe Chairman assured the Ambassador of HEC’s full support in facilitating institutional linkages and providing opportunities for Ethiopian students to pursue higher education in Pakistan’s public sector universities.\nHe also extended an invitation for the higher officials of the Education Ministry of Ethiopia and top universities in Ethiopia to attend the 6th Vice Chancellors Forum, scheduled for June 23-25, 2025, in Rabat, Morocco.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:04:01.030Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ethiopia-pakistan-discuss-bilateral-cooperation-in-higher-education/",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T09:46:00.000Z"
}
