{
  "title": "ICT anti-polio campaign reaches over 447,000 children in five days",
  "author": null,
  "content": "ISLAMABAD, May 30 (APP): The fifth day of the anti-polio drive in the federal capital concluded with the campaign achieving 97 percent of its target.\nThe progress was shared during a review meeting chaired by Additional Deputy Commissioner East Mehreen Baloch.\nThe meeting was attended by assistant commissioners and health department representatives.\nAccording to a briefing in the session, polio teams had successfully vaccinated 447,747 children by the fifth day of the campaign. Officials also discussed the issue of refusals—cases where families had declined to vaccinate their children. The meeting reviewed strategies to address these cases and increase acceptance among parents.\nThe security of polio workers and their daily performance was another focus of the meeting. ADC East urged families to cooperate with vaccination teams visiting homes.\n“Polio teams are reaching door-to-door to ensure every child receives the vaccine,” said ADC East Mehreen Baloch. She emphasized that the teams were also stationed at schools, recreational areas, and bus terminals to ensure broad coverage.\nShe called on parents to support the campaign by allowing workers to administer the drops and helping secure a healthy future for all children. “Let’s work together to make this campaign a success,” she said.\nThe health department is monitoring the campaign closely and addressing challenges as they arise. With strong coordination between health officials, district administration, and field teams, Islamabad’s campaign is moving steadily toward completion.\nAuthorities have also taken steps to ensure the safety and support of polio workers, who are operating across the city in various settings. From residential areas to busy public spots, these workers are playing a key role in the national health effort.\nIn conclusion, Islamabad’s polio campaign has made notable progress in just five days. With continued support from the public and coordinated efforts by local officials, the drive is expected to achieve its full target in the coming days.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:04:51.933Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ict-anti-polio-campaign-reaches-over-447000-children-in-five-days/",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T18:29:00.000Z"
}
