{
  "article_id": "2025-01-02_2348941a8357fa0c74d59a6b9e83451c",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882496/20pc-increase-in-medical-emergencies-across-punjab",
    "retrieved_at": "2025-10-12T00:41:08.928Z"
  },
  "metadata": {
    "title": "20pc increase in medical emergencies across Punjab - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:03:12.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 434,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "LAHORE: Air Punjab Emergency Services Secretary Dr Rizwan Naseer says his department has performed well in 2024. He said the ambulance service and motorway ambulance service were started during 2024 for shifting of critically ill patients from far flung areas of Punjab to specialised healthcare facilities and emergency services on all 76 motorway interchanges and 1,588 km stretch throughout Punjab. Likewise, he said, the prestigious certification by United Nations INSARAG of Pakistan Rescue Team enabled the country to host two historic events of International Rescue Challenge and United Nations INSARAG Asia Pacific Exercise in Lahore, which attracted 274 international delegates from 23 countries and 30 organizations in Pakistan that is great honor for the country. Holding the annual performance review meeting at the Emergency Services Headquarters, which was also attended by the all heads of wings of emergency services, divisional & district emergency officers through video link, Dr Rizwan Naseer said the service rescued over 2.2 million emergency victims during the year while maintaining its average response time of 8 minutes in all districts of Punjab. The data showed 22.7pc increase in the number of emergencies as compared to previous year 2023. The secretary was briefed about rescue operations during 2024 which include 1.5 million medical emergencies, 467,561 road traffic crashes, 56,260 delivery cases, 55,589 fall from height/ slip, 45,857 crime, 28,018 fire incidents, 23,088 occupational injuries, 12,860 electric shock, 12,689 animal rescue operations, 4,528 burn cases, 1,150 drowning, 691 structural collapse and 50,032 miscellaneous emergencies. At this occasion, the provincial monitoring cell briefed the secretary that 467,561 road traffic crashes took place across Punjab in 2024, whereas 420,387 road crashes were reported in 2023 with an increase of 11.2pc. Similarly, 28,018 fire incidents were reported in all districts of Punjab in 2024 whereas 20,665 cases of fires were reported in 2023 with increase of 35.6 percent. Rescue 1122 managed 1.5 million medical emergencies in 2024, whereas the service responded to 1.17 million medical emergencies in 2023 with increase of 29.1 percent. Furthermore, the Punjab Emergency Service responded to 45,857 crime emergencies in 2024, as compared to 43,302 in 2023 with increase of 5.9 percent cases. The monitoring cell further briefed that during last year 131,773 victims were provided Patients Transfer Services free of cost from primary healthcare facility to specialised advance healthcare facility and 47 critically ill patients were shifted from far flung areas of Punjab to specialised healthcare facilities through the air ambulance service. The Motorbike Rescue Service responded to over one million emergencies with average response time of four minutes in all districts of Punjab. Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}