{
  "article_id": "2025-01-02_73f8ca6c9a75b02f0d9edfccf931537e",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882538/pakistans-morale-high-despite-heartbreak-in-centurion-test-says-salman",
    "retrieved_at": "2025-10-12T00:41:12.368Z"
  },
  "metadata": {
    "title": "Pakistan’s morale high despite heartbreak in Centurion Test, says Salman - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:01:50.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6775b0c81ad0f.jpg",
    "categories": [],
    "word_count": 657,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "CAPE TOWN: Ending up on the losing side in the first Test despite pushing South Africa to the brink of defeat in Centurion is regretted by the Pakistan dressing room but the team's morale remains high, all-rounder Salman Ali Agha has said. Pakistan had reduced the Proteas, who were chasing 148, to 99-8 on a tough Centurion Park wicket, only for all-rounder Marco Jansen and fast bowler Kagiso Rabada to carry the hosts to victory. The win saw South Africa seal their place in the World Test Championship final, set to be held at Lord's this summer. For Pakistan, who have lost seven of their nine matches of the ongoing WTC cycle, fighting it out to take the first match down to the wire was an encouraging sign. The Shan Masood-led side, however, is looking for nothing less than a win in the second Test here at Newlands - starting Friday - also drawing their confidence from the 3-0 whitewash of the hosts in the preceding One-day International series. \"It was a great game; it could go anywhere,\" Salman said of the opening fixture during a media talk on Wednesday. \"I think Rabada and Jansen played very well. There were a few moments in the game, where we could have put them away but we couldn't capitalise on that. But we have learnt from our mistakes and we'll look to do better. \"We are very confident about beating them in the next game and our morale is very high since we also won the ODI series. I hope the second Test turns out to be a cracker.\" Centurion, which proved to be a paradise for seamers due to the amount of grass on the playing surface, was a different ball game as compared to what Newlands is expected to be. The previous Test played at Newlands against India 12 months ago lasted only 107 overs as the visitors won by seven wickets inside two days, the shortest Test that has had a winner in history. The wicket should be better this time round, but at a ground that used to be a fortress for the home team, they have lost two of their last three Tests in Cape Town. As per Salman's observation, the pitch at the venue will definitely wouldn't be as green and spinners, unlike what happened in Centurion, would play a key role. \"It looks like a different pitch from Centurion; there's less grass here,\" said the off-spinner. \"But we'll have a better idea by tomorrow and then we can tell how we'd go about the Test match. \"If you look at the stats, the spinners do come handy here. But we haven't decided anything so far. \"When I saw the wicket I felt I'll probably bowl in this game, because I haven't bowled in the last three Test matches. I think my role will be key in this Test match.\" Salman was full of praise for Pakistan pacer Mohammad Abbas, who, returning to Test colours after three years, bowled a marathon spell in the first Test to drag Pakistan back into the game by breaking a solid partnership between South African captain Temba Bavuma and Aiden Markram before going on to register figures of 6-54. \"He is very accurate, he knows what he is doing, he knows about his bowling,\" said Salman. \"I haven't seen any other bowler who knows his skill as much as he does. \"He was a bit rusty in the first innings with the new ball but you can expect that from a guy coming into the team after three years. \"The way he came back in the second innings was outstanding. I think he was the one who put us back in the game. The way Markram and Bavuma were going, I thought it would be a one-sided game but how he came back and bowled a whole session was just outstanding.\" Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}