{
  "article_id": "2025-01-02_a42fea3329e2d09d620eb0005bdc80d9",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882621/may-9-riots-mercy-petitions-of-19-convicts-accepted-on-humanitarian-grounds",
    "retrieved_at": "2025-08-26T06:01:07.644Z"
  },
  "metadata": {
    "title": "May 9 riots: Mercy petitions of 19 convicts accepted on humanitarian grounds - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T07:44:03.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 1163,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "The mercy petitions of 19 convicts involved in the May 9 cases have been accepted on humanitarian grounds, the Inter-Services Public Relations (ISPR) announced in a statement on Thursday. The development comes less than a month after military courts sentenced a total of 85 civilians involved in the May 9 riots of 2023. On December 21 last year, military courts sentenced 25 civilians to prison terms ranging from two to 10 years over the May 9 events. A week later, another 60 civilians were handed jail terms ranging from two to 10 years for their involvement in the nationwide riots. \"Sequel to the promulgation of punishments to 9th May Tragedy convicts, they have exercised their right to appeal and have asked for mercy/remission in their punishments,\" the statement said. \"A total of 67 convicts have given their mercy petitions,\" it said, adding that 48 petitions have been processed to Courts of Appeal, while petitions of 19 convicts have been accepted \"purely on humanitarian grounds, under the law.\" \"Mercy petitions of remaining will be decided in due course of time, following the legal process,\" it said. Those whose punishment has been remitted include: Muhammad Ayaz s/o Sahibzada Khan - was sentenced to two years of rigorous imprisonment for involvement in the Main Gate FC Cantt Peshawar incident Sami Ullah s/o Meer dad Khan - was sentenced to two years of rigorous imprisonment for involvement in the Bannu Cantt incident Laeeq Ahmed s/o Manzoor Ahmed - was sentenced to two years of rigorous imprisonment for involvement in the ISI Office Faisalabad incident. Amjad Ali s/o Manzoor Ahmed - was sentenced to two years of rigorous imprisonment for involvement in the ISI Office Faisalabad incident Yasir Nawaz s/o Ameer Nawaz Khan - was sentenced to two years of rigorous imprisonment for involvement in the Punjab Regimental Centre Mardan incident. Said Alam s/o Maaz Ullah Khan - was sentenced to two years of rigorous imprisonment for involvement in the Punjab Regimental Centre Mardan incident. Zahid Khan s/o Muhammad Nabi - was sentenced to two years of rigorous imprisonment for involvement in the PRC Mardan incident. Muhammad Suleman s/o Said Ghani Jan - was sentenced to two years of rigorous imprisonment for involvement in the HQ Dir Scouts Timergara incident Hamza Sharif s/o Muhammad Azam - was sentenced to two years of rigorous imprisonment for involvement in the ISI Office Faisalabad incident Muhammad Salman s/o Zahid Nisar - was sentenced to two years of rigorous imprisonment for involvement in the ISI Office Faisalabad incident Asher Butt s/o Muhammad Arshad Butt - was sentenced to two years of rigorous imprisonment for involvement in the Rahwali Gate Gujranwala incident Muhammad Waqas s/o Malik Muhammad Khalil - was sentenced to two years of rigorous imprisonment for involvement in the Rahwali Gate Gujranwala incident Sufayan Idrees s/o Idrees Ahmed - was sentenced to two years of rigorous imprisonment for involvement in the Rahwali Gate Gujranwala incident Muneeb Ahmed s/o Naveed Ahmed Butt - was sentenced to two years of rigorous imprisonment for involvement in the Rahwali Gate Gujranwala incident Muhammad Ahmed s/o Muhammad Nazir - was sentenced to two years of rigorous imprisonment for involvement in the Rahwali Gate Gujranwala incident Muhammad Nawaz s/o Abdul Samad - was sentenced to two years of rigorous imprisonment for involvement in the Rahwali Gate Gujranwala incident Muhammad Ali s/o Muhammad Boota - was sentenced to two years of rigorous imprisonment for involvement in the ISI Office Faisalabad incident Muhammad Bilawal s/o Manzoor Hussain - was sentenced to two years of rigorous imprisonment for involvement in the Jinnah House incident. Muhammad Ilyas s/o Muhammad Fazal Haleem - was sentenced to two years of rigorous imprisonment for involvement in the HQ Dir Scouts Timergara incident \"They all shall be released after [the] completion of procedural formalities. \"All those convicted retain the right of appeal and other legal remedies as per the law and the constitution.\" The ISPR added: \"The remission of punishments is a testament to the strength of due process and fairness, which ensures that justice is served while also taking into account the principles of compassion and mercy.\" In April 2024, 20 people convicted over the May 9 riots -who had been jailed and had served a major part of their sentences - were also pardoned on humanitarian grounds after their sentences were remitted by the army chief. PTI Chairman Barrister Gohar Ali Khan, in response to a question regarding the development, termed the decision by the military as \"not a development\". \"PTI's position has not changed,\" he said while speaking to reporters today. \"No civilian should be tried in military court. It remains unconstitutional and the matter will be decided by the Supreme Court.\" While calling the remission a \"good thing\", Gohar said, \"There should not be a conviction stigma by the military courts. This should be a civilian court.\" Meanwhile, Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur said the development was a good step while talking to reporters after the second round of meetings between the PTI and the government in Islamabad today. He added that most of the time for the sentences had already elapsed and if a month or two was left, it was a good step to release the convicts. \"The state is like a mother that grooms them rather than shooting at them to martyr them.\" On May 9, 2023, violent protests erupted across the country following the brief arrest of PTI founder Imran Khan. At least 10 people lost their lives and hundreds sustained injuries, while approximately 40 public buildings and military installations were damaged. These included the Lahore Corps Commander's House (Jinnah House) and Askari Tower in Lahore, General Headquarters (GHQ) in Rawalpindi, Inter-Services Intelligence (ISI) Office in Faisalabad, FC Fort in Chakdara, Radio Pakistan building in Peshawar, Toll Plaza at Swat Motorway and the PAF Base Mianwali. In total, 62 outbreaks of violence were documented, inflicting a loss of Rs2.5 billion on the country, of which, according to the state, Rs1.98bn in losses were suffered by the army. The military says the events were a coordinated attack by the PTI leadership. In its widely praised verdict, a five-member bench on Oct 13, 2023, had unanimously declared the military trials of 103 civilians null and void. The apex court had declared that the accused would not be tried in military courts but in criminal courts of competent jurisdiction established under the ordinary or special law of the land. However, on December 13, 2023, in a 5-1 majority verdict, the SC conditionally suspended its own Oct 23 ruling - albeit by a different bench - pending a final judgement as it heard a set of intra-court appeals (ICAs). In March 2024, a six-member SC bench had also conditionally allowed military courts to pronounce reserved verdicts in the cases. It had also modified its Dec 13 injunction, ordering that military courts could commence trials but they would not convict or acquit any suspect until the pendency of government-instituted ICAs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}