{
  "article_id": "2025-01-02_e7bbd998faf07ff0867648708fe8c2a0",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882565/israeli-strikes-kill-17-on-new-years-day",
    "retrieved_at": "2025-08-26T06:01:12.055Z"
  },
  "metadata": {
    "title": "Israeli strikes kill 17 on New Year’s Day - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:10:20.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 430,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "JERUSALEM: Israeli air strikes on al-Bureij refugee camp and Jabalia town in central and northern Gaza killed at least 17 Palestinians on the first day of the New Year, the official Palestinian news agency WAFA reported. The Israeli military had no immediate comment although in a post on X, its Arabic spokesperson warned residents of al-Bureij earlier to evacuate ahead of an imminent strike against fighters firing rockets from the area. It also said overnight that it killed Abd al-Hadi Sabah, a Hamas fighter. The instruction to clear the al-Bureij camp has caused a new wave of displacement, although it was not immediately clear how many people were affected. WAFA said the military blew up residential blocks in Beit Lahiya and in and around Jabalia, while tanks shelled parts of Gaza City and the al-Bureij camp. Palestinian and United Nations officials say no place is safe in Gaza and that evacuations worsen the humanitarian conditions of the population. According to the Palestinian civil defence, more than 1,500 tents sheltering displaced people across Gaza were flooded by heavy rains over the past two days, leaving people exposed to the cold, their belongings damaged. Hundreds more tents experienced less severe flooding that still left displaced people unable to use them. Much of the area around the northern towns of Beit Hanoun, Jabalia and Beit Lahiya has been cleared of people and razed, fuelling speculation Israel intends to keep the area as a closed buffer zone after the fighting in Gaza ends. Israel's Gaza campaign has killed more than 45,500 Palestinians, according to health officials in the Hamas-run enclave. Most of Gaza's 2.3 million people have been displaced and much of the tiny coastal strip is in ruins. Israel warned on Wednesday that it will intensify its strikes in Gaza if Hamas keeps up its rocket fire. Over the past week, Palestinian fighters have repeatedly fired rockets at Israel, particularly from northern Gaza, where the Israeli military is conducting a major offensive. The rockets have caused little damage and have been fired in far smaller numbers than in the early stages of the war, but they have been a political blow for the Israeli government after nearly 15 months of fighting. Defence Minister Israel Katz said he wanted to send a clear message to the heads of the fighters in Gaza that if Hamas does not soon allow the release of the Israeli prisoners from Gaza, and continues firing at Israeli communities, it will face blows of an intensity not seen in Gaza for a long time. Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}