{
  "article_id": "2025-01-02_6b4c27bda95d87960261a4ac2ff3c541",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882533/sialkot-peshawar-set-to-vie-for-quaid-e-azam-trophy-honours",
    "retrieved_at": "2025-08-26T06:01:32.553Z"
  },
  "metadata": {
    "title": "Sialkot, Peshawar set to vie for Quaid-e-Azam Trophy honours - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:01:51.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 444,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "KARACHI: Sialkot and Peshawar will vie for the Quaid-e-Azam Trophy honours with the final of Pakistan's premier first-class tournament set to start here at the UBL Sports Complex on Thursday. Peshawar and Sialkot have made it to the top after completion of 45 group matches and three triangular stage matches. Among the three six-team groups at the start of the tournament, Peshawar were placed in Group 'B' while Sialkot were stationed in Group 'C'. Peshawar topped their group with three wins and two draws out of five matches and in the two triangular stage fixtures they won one and lost one. Sialkot have been unbeaten in the tournament as they won three and drew two of their group games while their two triangular stage fixtures included a win and a draw. Left-hand batter Azan Awais stands out among the batters with 807 runs in seven matches in his maiden first-class season, inclusive of four centuries, two half-centuries and a highest score of 203 not out. For Peshawar Maaz Sadaqat has scored the most runs with 557 in five matches including one century and five-half centuries. On the bowling front, Islamabad's Musa Khan stands tall with 38 wickets - seven best of the second placed Ahmed Bashir - in five matches. For Peshawar pacer Niaz Khan has bagged 30 scalps in seven games at an average of 22.43. Sialkot's Test fast bowler Mohammad Ali has the most wickets for his team - 22 in four matches at 15.95. \"Peshawar has a number of proven match winners in the side and we look forward to put our best step forward during the all-important final,\" Peshawar skipper and Pakistan Test player Sajid Khan said in a statement on the eve of the finale. \"The conditions are different from where we have played our group and triangular stage matches but I trust my side to adjust to the varying conditions.\" Sialkot will also be led by a Pakistan international in Amad Butt, who also remained satisfied with his team's show throughout the tournament. \"We have had a very good season both with the bat and ball and the target is to finish it on a high as winners of the prestigious Quaid-e-Azam Trophy,\" he said. Squads: Peshawar: Sajid Khan (captain), Abuzar Tariq, Azam Khan, Hilal Khan, Israrullah (vice-captain), Maaz Sadaqat, Mehran Ibrahim, Mohammad Amir Khan, Mohammad Zulkifal, Nabi Gul, Niaz Khan, Sajjad Ibrahim, Waqar Ahmed, Zubair Khan Sialkot: Amad Butt (captain), Abdul Rehman, Afzal Manzoor, Ahsan Hafeez Bhatti, Ali Raza, Ashir Mehmood, Awais Ali, Azan Awais, Fahad Jamil, Hamza Nazar, Mohammad Huraira (vice-captain), Mohsin Riaz, Mohammad Waleed, Shahzaib Bhatti, Shoaib Akhtar Jr. Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}