{
  "article_id": "2025-01-02_799f78127ed52bbd824f35c06543ea05",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882512/only-half-of-pakistans-population-has-access-to-universal-healthcare-report",
    "retrieved_at": "2025-08-26T06:01:22.462Z"
  },
  "metadata": {
    "title": "Only half of Pakistan’s population has access to universal healthcare: report - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:02:28.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 448,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD: The Universal Healthcare (UHC) Monitoring Report for Pakistan 2024 - a yearly report that assesses and monitors the progress of the country's health sector - has revealed that only half of Pakistan's population has access to UHC. The country lagged far behind in achieving the global target of over 80pc, said the report, which was prepared in collaboration between the Ministry of National Health Services, Regulations and Coordination and the World Health Organisation (WHO). Last year's results revealed mixed performance across the country with the Islamabad Capital Territory securing at 63.9pc, which was the highest out of all federating units. Punjab followed with a score of 55.5pc, Khyber Pakhtunkhwa 51pc, Sindh 50.7pc, and Balochistan 38.4pc. UHC is the main outcome of health-related SDGs and is measured with two targets - one for coverage of essential service delivery and the other for financial protection. According to the report, though there was considerable improvement in the UHC service coverage index from 40 in 2015 to 53.9 in 2023, the real challenges still lay ahead. \"Health is a long-term investment in human capital needed to fully realise human potential by contributing to the protection and empowerment of all people. But formal monitoring mechanism was critical to assessing the progress,\" the report stated. It also said there was a need to ensure efficiency and effectiveness while building the capacity of districts and the private sector in delivering essential health services. \"There is also a need to address serious equity issues as Balochistan and Gilgit-Baltistan have a lower score in comparison to the other federating areas,\" it maintained. Furthermore, the report said the indicator to monitor catastrophic health expenditure was also critical and has shown a worsening trend between 2013 and 2021. As the government scales up the Sehat Sahulat Programme, the results in the future should indicate the effectiveness of this investment, it read. In 2021, 5.4pc of the households in Pakistan spent more than 10pc of their household budget on health care. \"Low government investment in health including out-of-pocket (OOP) payments constitute a large share of total health expenditure in Pakistan,\" the report revealed. These payments deter some people from using essential health services and push them into poverty,\" it stated. Although the burden of disease has declined from 70,086 disability-adjusted life years (DALYs) lost per 100,000 population in 1990 to 42,399 DALYs lost per 100,000 population in 2021, with improved performance in maternal and child health sectors, the report also highlighted the forthcoming challenge of tackling non-communicable diseases and mental health issues. It said that more than half of the burden of disease in Pakistan could be tackled through inter-sectoral policies and interventions. Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}