{
  "article_id": "2025-01-02_3eaa61f186f29e5cedf6bd0e0c7ce9f5",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882571",
    "retrieved_at": "2025-08-26T06:01:08.401Z"
  },
  "metadata": {
    "title": "Economic plan - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:16:52.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 451,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "THE 'home-grown', five-year economic plan Uraan Pakistan, which was unveiled by Prime Minister Shehbaz Sharif this week, hopes to build on the country's nascent economic recovery to boost growth. The initiative is based on the ruling PML-N's five-point development agenda referred to as the '5Es Plan'. It focuses on exports, information technology, environment and climate, energy and infrastructure, and justice for all as a \"unified roadmap\" to make Pakistan a trillion-dollar economy - roughly triple its present size - by 2035. The roadmap aims to address key economic challenges through a 'National Economic Transformation Plan', providing short- to medium-term solutions for stabilisation and growth. However, the targets are ambitious, if not unrealistic, as they seek to achieve a sustainable growth rate of 6pc by 2028 and attract $10bn in private investment each year to double exports to $60bn over the next five years. But then, the state minister for finance has downplayed the focus on the plan's targets. According to him, the plan was an effort to give the economy direction so that it does not heat up when the growth accelerator is pressed. The plan is elaborate regarding what the government desires to achieve over the five-year period but it does not offer any glimpse into the policy reforms or solutions it intends to implement to fix the problems ailing the economy. At best, it has set up a delivery unit at the Prime Minister's Office to coordinate the implementation of sectoral plans and roadmaps with a view to executing the initiative and ensuring transparency and accountability. The nine-month track record of this government on promised structural reforms also does not inspire much confidence in its ability to follow through on its pledges. For example, we have seen the government capitulating on retail tax and SOE reforms. That is not all. Many of its policies run counter to Uraan Pakistan's objectives. On the one hand, it envisages encouraging IT exports and supporting start-ups; and on the other, it has slowed down internet speeds, despite warnings of IT export losses. Furthermore, the programme points at decades of political instability, policy inconsistency, and repeated military-led disruptions in the political process as reasons for the current state of the economy. Yet, there has been little inclination to address these challenges. The absence of clear mentions of policy reforms backed by a solid strategy to execute the targets allows the bureaucracy a lot of space to wriggle out of responsibility. While monitoring and evaluation of progress on the initiative is important, they cannot be a substitute for real reforms and policy changes when it comes to fixing the economy to put it on the road to sustainable growth. Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}