{
  "article_id": "2025-01-02_b8eae20798e6bce2f2f4d32cbd3b984f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882660/economic-progress-dependent-on-complete-peace-amid-security-challenges-pm-shehbaz",
    "retrieved_at": "2025-08-26T06:01:02.424Z"
  },
  "metadata": {
    "title": "Economic progress dependent on ‘complete peace’ amid security challenges: PM Shehbaz - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T14:28:00.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/0218262219737d7.png",
    "categories": [],
    "word_count": 341,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Prime Minister Shehbaz Sharif on Thursday said the economic progress of the country was dependent on achieving \"complete peace\" amid the security challenges the country was facing. Pakistan has recently witnessed an uptick in terror activities, especially in KP and Balochistan. Terror attacks have increased since the banned Tehreek-e-Taliban Pakistan (TTP) broke a fragile ceasefire agreement with the government. According to an annual security report, issued by the Centre for Research and Security Studies, with at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for civil and military security forces of Pakistan in a decade. Speaking at a meeting of the Special Investment Facilitation Council (SIFC) in Islamabad today, he said that economic development was directly linked with political stability as the strength of a country's economy was deeply rooted in its political framework. \"Security has become a big challenge today and we cannot move forward without crushing the head of [terrorism].\" He stressed the need to honour the sacrifices of officers and soldiers from the army, law enforcement agencies, and police who were laying down their lives and leaving their loved ones behind to protect the country. \"This is the ultimate sacrifice which we need to honour and we need to tell the people that terrorism has risen again,\" he added. \"Every day, an incident occurs where 10 people - be it from Frontier Corps, police, or army personnel- are martyred. This is the story of ultimate sacrifice,\" he said, adding that collective efforts were essential to achieving the goal of eradicating terrorism. The prime minister also congratulated everyone on the signing of the peace agreement in Kurram while cautioning that, \"This is a lesson that such a heartbreaking incident should not happen again.\" After protracted negotiations that spanned three weeks, the warring sides in Kurram signed a 14-point peace agreement, providing for a permanent ceasefire, resolution of land disputes and banning of weapons in the restive district, the provincial government announced on Wednesday.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}