{
  "article_id": "2025-01-02_eafb5af6786f3ca21a5b14927c1367a0",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882554/sc-regrets-fraudulent-increase-in-losing-candidates-votes",
    "retrieved_at": "2025-08-26T06:01:37.107Z"
  },
  "metadata": {
    "title": "SC regrets ‘fraudulent’ increase in losing candidate’s votes - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:01:41.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 399,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: The Supreme Court on Wednesday regretted a sudden increase of votes secured by Agriculture Minister Mir Ali Madad Jattak - from 195 to 5,107 - during the Feb 8 general elections for the Balochistan Assembly's seat PB-45 (Quetta) through fraud, misrepresentation and manipulation of record including Form-45. On the other hand, 1,623 votes bagged by JUI-F candidate Mir Muhammad Usman Pirkani (respondent) remained the same, observed Justice Aqeel Ahmed Abbasi in a detailed reason to explain why the court had rejected Mr Jattak's civil appeal on Nov 20, 2024. Justice Abbasi was a member of the three-judge SC bench, headed by Justice Shahid Waheed, that had taken up the appeal against the Election Tribunal, Balochistan, which on Sept 16, 2024 had nullified Mr Jattak's victory with a direction to conduct re-polling at 15 disputed polling stations in the constituency. \"Reaching...such conclusion, the election tribunal has taken pains to scrutinise the entire election material and the record, relevant forms and even noted the overwriting and cutting made in the Form-45 and thereafter scrutiny and appraisal of the evidence reached...the conclusion that the Form-45 produced by the returned candidate (appellant) are the product of fraud and misrepresentation for which not only the appellant Ali Madad Jattak, but also the RO of the said constituency is equally responsible,\" the 25-page judgement explained. \"No valid reason or lawful justification whatsoever was assigned by RO to change the date for consolidation of result from Feb 13 to Feb 9, 2024 while antedating the same without notice to all the contesting candidates nor even the service of purported Feb 9, 2024 Corrigendum upon the parties concerned could be established from record,\" Justice Abbasi observed. This fact alone is sufficient not only to create serious doubts on the so-called consolidation made by the RO on Feb 9, 2024 in the absence of all the contesting candidates or their representatives, but also reflects upon the credibility of the ECP and RO of the subject constituency, particularly these 15 polling stations. \"In view of the factual and legal position as emerged in the present case, we are of the considered opinion that instant appeal is devoid of any merits, whereas, no illegality or procedural defect could be pointed out by the counsel for the appellant which may require the interference of the Supreme Court in the tribunal's decision,\" the judgement said. Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}