{
  "article_id": "2025-01-02_ee880107d748e5fd0bb62e48904b563a",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882539/kazakhstan-end-germanys-title-defence-us-in-united-cup-semis",
    "retrieved_at": "2025-08-26T06:01:34.678Z"
  },
  "metadata": {
    "title": "Kazakhstan end Germany’s title defence, US in United Cup semis - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-02T03:01:50.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6775b0d42dd09.jpg",
    "categories": [],
    "word_count": 566,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "SYDNEY: Kazakhstan ended Germany's title defence at the United Cup on Wednesday while inaugural champions United States also made the last four beating China in the mixed team tennis tournament. Meanwhile, world number two Iga Swiatek inspired Poland to progress into the last eight while Katie Boulter helped Britain secure the quarter-final berth. Elena Rybakina put Kazakhstan ahead with a comprehensive 6-3, 6-1 victory over Laura Siegemund in the first match of the tournament's knockout stages. Germany suffered a blow when world number Alexander Zverev withdrew from the quarter-final tie with a bicep strain minutes before his match. His replacement Daniel Masur began well but Alexander Shevchenko prevailed 6-7(5), 6-2, 6-2 to give Kazakhstan an unassailable 2-0 lead in the tie. Shevchenko significantly cut down on his unforced errors after the first set and asserted himself more in a brilliant comeback, despite a medical timeout in the second set, complaining about difficulty breathing. \"I was struggling in this heat, it was so rough,\" said the world number 78 Shevchenko, who upset Stefanos Tsitsipas in group play on Monday. \"I had a headache and my head was spinning. But I wanted to win this one. \"After (losing) the first set I knew I had to shorten the rallies and play aggressively, tee off on the ball. I just kept pushing after the first set and I'm really happy about it.\" Coco Gauff and Taylor Fritz won their respectively singles matches against their Chinese opponents to put the US in the last four. Gauff downed an erratic Zhang Shuai 7-6(4), 6-2 to giver her team a perfect start. The American looked under pressure in the opening set but found a way to get out of trouble before asserting herself. Gauff made amends for her nine double faults in the match with 14 fewer unforced errors compared to her opponent's 40. \"I felt like, the hard I hit, the harder she was hitting,\" the 2023 US Open champion said. \"I felt like I couldn't get her on defence. She was playing so aggressive.\" Fritz downed Zhang Zhizhen 6-4, 6-4 to clinch the tie for them with the mixed doubles to spare. Earlier, Swiatek led Poland to a 2-1 victory against Czech Republic in Group 'B', keeping their journey alive. Tomas Machac put the Czech Republic ahead with his 7-5, 3-6, 6-4 victory against Hubert Hurkacz. The 23-year-old Swiatek brought Poland level with a hard-fought 6-3, 6-4 win against Karolina Muchova. Swiatek and Muchova had played three times before and they all went three sets, with the Pole winning two including her memorable Roland Garros triumph. Swiatek then returned to team up with Hurkacz to beat the Machac-Muchova pair 7-6(3), 6-3 in the deciding mixed doubles to secure their place in the last eight. With this, Swiatek became the first player to secure 10 singles victory at the United Cup. In Group 'F', Boulter's 6-2, 6-1 victory against Australian Olivia Gadecki ensured Britain progress to the next stage as group leaders. Boulter dominated Gadecki from the start, showing more consistency and depth from the baseline, needing just 70 minutes to secure victory. Boulter's Australian fiance Alex de Minaur crushed Billy Harris 6-2, 6-1 in the men's singles and later the pair of de Minaur and Gadecki downed the duo of Charles Broom and Olivia Nicholls, but it was in vain with Britain already through. Published in Dawn, January 2nd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}