{
  "title": "Ministry plants 67.5m trees, creates 0.2m green jobs, secured $91.5m for climate projects",
  "author": null,
  "content": "ISLAMABAD, Mar 06 (APP):Ministry of Climate Change and Environmental Coordination (MoCC&EC) over the past year, had planted 67.5 million trees under the Green Pakistan Programme, creating 200,000 green jobs and secured $91.5m for climate projects.\nAccording to an official document, available with APP, the climate finance saw remarkable growth in 2024, securing $8.1 million from the Global Environment Facility (GEF) and $83.4 million from the GCF for bio-diversity conservation and land degradation efforts.\nSimilarly, the Green Climate Fund (GCF) backing the Acumen Climate Action Fund and the Recharge Pakistan project, aimed at enhancing climate resilience. In a year marked by robust international engagement, the ministry signed the SCO Environmental Protection Agreement and the Joint Action Plan for the SCO Green Belt Programme, reinforcing its commitment to regional cooperation on sustainable development and climate change mitigation.\nKey bilateral climate agreements were also secured with Belarus, UNICEF, and the International Rescue Committee.The country’s leadership in global climate forums was evident through its active participation in the United Nations Framework Convention on Climate Change (UNFCCC), where it played a pivotal role in various committees.\nIt further demonstrated its dedication to gender-responsive climate policies by hosting the AFPPD meeting.The ministry reaffirmed its commitment to international climate agreements by achieving a 67.5% reduction in Hydrochlorofluorocarbons (HCFCs) phase-out under the Montreal Protocol and banning pre-blended polyols with HCFC-141b.\nPakistan also submitted its Biennial Transparency Report (BTR) to the UNFCCC and implemented carbon market trading policies under the Paris Agreement.\nTo align with the Kunming-Montreal Global Bio-diversity Framework, the ministry revised Pakistan’s Land Degradation Neutrality (LDN) targets and updated its Nationally Determined Contributions (NDC-2021).\nThe appointment of a regular Executive Director at the Global Change Impact Study Centre (GCISC) strengthened research and policy development, while the creation of a Climate Finance Wing ensured efficient allocation of resources for climate action.\nIn a bid to enhance transparency and accountability, the ministry fully implemented e-office systems and launched the e-Pak Acquisition & Disposal System (EPADS), streamlining procurement processes and improving operational efficiency.\nThe ministry also implemented a comprehensive media strategy to raise awareness about climate change, organizing seminars, workshops, and dialogues to highlight Pakistan’s vulnerabilities and resilience measures.\nCollaborations with local and international media for events like World Environment Day and campaigns to reduce plastic use were widely applauded. A bi-monthly newsletter was launched to keep stake-holders informed about climate-related updates and achievements.\nOn the global stage, Pakistan submitted a statement to the International Court of Justice (ICJ) on climate justice, joined the International Mangrove Center, and launched the Mangrove Sustainability Initiative, further solidifying its stance on environmental protection.\nMeanwhile, stake-holders had commended the Ministry of Climate Change for its proactive approach in coordinating national efforts towards sustainable development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:24:32.902Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ministry-plants-67-5m-trees-creates-0-2m-green-jobs-secured-91-5m-for-climate-projects/",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T11:31:00.000Z"
}
