{
  "title": "Crackdown on profiteering: 117 arrested as Islamabad admin ensures affordable Ramazan essentials",
  "author": null,
  "content": "ISLAMABAD, Mar 06 (APP): In a decisive move to protect consumers from price hikes during Ramazan, the Islamabad administration has arrested 117 profiteers and imposed hefty fines during surprise inspections.\nThe crackdown comes as part of the government’s Ramazan Relief Package, aimed at ensuring the availability of essential food items at affordable prices for the public.\nThe first meeting of the Monitoring Committee, chaired by Convener Dr. Tariq Fazal Chaudhry, was held on Thursday to review the implementation of the relief measures.\nDuring the meeting, the committee reviewed the establishment of subsidized markets and Ramazan stalls across the city.\nIt was revealed that five major subsidized markets and 20 Ramazan stalls have been set up in various sectors of Islamabad, offering essential food items at reduced prices.\nJoint teams, comprising officials from the Islamabad Police and district administration, have been formed to monitor and control prices.\nThe committee was informed that the prices of essential food items in Islamabad’s subsidized markets are significantly lower than those in Lahore and Rawalpindi.\nUnder the Ramazan Relief Package, sugar is being sold at Rs. 130 per kilogram at special stalls, and efforts are underway to ensure an adequate supply of sugar and other essentials such as ghee, flour, chicken, and eggs.\nThe committee directed the district administration to engage with shopkeepers and devise strategies to further reduce prices in subsidized markets.\nAssistant Commissioners and Price Control Magistrates were instructed to ensure the availability of essential items at official prices in their respective areas.\nAdditionally, the committee emphasized the importance of prominently displaying official price lists at all subsidized markets and stalls.\nStrict action was also ordered against those charging more than the official prices or engaging in illegal profiteering.\nTo facilitate consumers, the committee directed that helpline numbers and WhatsApp contact details of officials be shared widely, enabling the public to report violations and seek assistance.\nFollowing the meeting, members of the monitoring committee visited subsidized markets and Ramazan stalls to conduct a detailed review of prices and ensure the effective implementation of the relief package.\nThe meeting was attended by Federal Minister Hanif Abbasi, Federal Secretary Interior Khurram Agha, Chairman CDA and Chief Commissioner Islamabad Ch Muhammad Ali Randhawa, IG Islamabad Ali Nasir Rizvi, Deputy Commissioner Islamabad, and other senior officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:24:07.088Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/crackdown-on-profiteering-117-arrested-as-islamabad-admin-ensures-affordable-ramazan-essentials/",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T17:31:00.000Z"
}
