{
  "title": "PM approves plan to provide youth with training programs according to market, industry skills & demand",
  "author": null,
  "content": "ISLAMABAD, Mar 06 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday chaired the review meeting on the National Youth Employment Plan and approved the plan to provide youth with training programs according to market and industry skills and demand.\nThe meeting was briefed on the action plan to provide training and employment opportunities through various institutions in the next 4 years, whereas the Prime Minister had decided to personally chair the monthly review meeting and would personally monitor the implementation of the plan, the Prime Minister’s Office news release said.\nPrime Minister Muhammad Shehbaz Sharif said that the talented youth of Pakistan were the most valuable asset of the country, whereas the government was empowering and employing the youth by providing them with vocational training and necessary skills.\nThe prime minister added that the government was taking steps to promote the export of manpower by providing international quality training to Pakistani youth.\nDuring the review meeting, the prime minister had directed to maintain continuous liaison with local industries for training youth in various sectors and to meticulously consider the demand of international organizations for manpower. The Prime Minister has also directed to establish comprehensive database regarding the skills required in local industries.\nThe meeting was informed that in the next 4 years, 2.4 million to 6 million youth annually would be asssited to gain employment opportunities by providing them vocational training and skills. The meeting was informed that the market, industries and international manpower consumption were being kept in mind to provide skills and vocational training to the youth.\nThe meeting was informed that the Digital Youth Hub was in the final stages and would be launched this month. The Prime Minister appreciated the efforts of all the relevant ministries and institutions working on the plan.\nFederal Ministers Ahad Khan Cheema, Shaza Fatima Khawaja, Chairman Prime Minister Youth Program Rana Mashhood Ahmed Khan, Chairman Higher Education Commission Dr. Mukhtar Ahmed and relevant senior officials attended the meeting.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:25:04.161Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-approves-plan-to-provide-youth-with-training-programs-according-to-market-industry-skills-demand/",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T06:57:00.000Z"
}
