{
  "title": "Delegations of Multan and Jhang Bars call on CJP",
  "author": null,
  "content": "ISLAMABAD, Mar 06 (APP): A delegation from the District Bar Associations of Multan and Jhang met with the Chief Justice of Pakistan, Mr. Justice Yahya Afridi, at the Supreme Court of Pakistan on Thursday.\nThe Chief Justice welcomed the delegation and attentively listened to their concerns.\nDuring the meeting, the representatives of the District Bar Associations highlighted issues regarding the lack of coordination and communication between the High Court and the Bars in Punjab. They emphasized the need to strengthen this communication channel.\nIn response, the Chief Justice clarified that High Courts function independently, and it would not be appropriate for him to intervene in their affairs. However, he acknowledged the concern and suggested that the matter could be discussed with the Chief Justice of the Lahore High Court.\nThe Chief Justice also highlighted the representation of Bar Councils in the Law and Justice Commission of Pakistan (LJCP). He informed the delegation about the upcoming meeting of the LJCP and invited feedback from the legal fraternity to ensure their concerns and recommendations are considered.\nEmphasizing the importance of capacity building within the legal fraternity, the Chief Justice informed the delegation about the legal education training programs offered under the Continuing Legal Education (CLE) initiative of the Federal Judicial Academy (FJA). He highlighted that these programs are readily accessible on the FJA’s website, enabling Bar Associations to leverage them for enhancing legal expertise and professional development.\nAddressing financial concerns, the Chief Justice apprised the delegation of the Access to Justice Development Fund (AJDF), which provides financial assistance to legal practitioners. He encouraged them to apply for support under this initiative, aimed at strengthening the legal profession by promoting justice and ensuring equitable access to legal resources\nThe delegation also extended an invitation to the Chief Justice to visit the District Bars. In response, he expressed his commitment to engaging with the legal community and stated that his priority is to visit the most remote and underdeveloped areas. However, he assured them that he would visit their Bar at a suitable time.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:24:07.986Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/delegations-of-multan-and-jhang-bars-call-on-cjp/",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T15:41:00.000Z"
}
