{
  "title": "FO rubishes Indian MEA’s claim of ‘a developed, empowered’ Kashmir",
  "link": "https://www.app.com.pk/national/fo-rubishes-indian-meas-claim-of-a-developed-empowered-kashmir/",
  "date_published": "2021-08-05T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): The Foreign Office on Thursday rubbished the claim of Indian External Affairs Minister (MEA) Dr S. Jaishankar who had stated that the Occupied Jammu and Kashmir “had seen real development, democracy and empowerment’.\nFO Spokesperson Zahid Hafeez Chaudhri in response to media queries regarding the Indian MEA’s tweet on so-called ‘New Jammu Kashmir’ on completion of two years of India’s illegal and unilateral actions of August 5, 2019, said contrary to India’s false propaganda, the world was in fact seeing the human rights violations.\n“In a tweet today, the Indian External Affairs Minister has made unsubstantiated and self-serving remarks about the situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK),” he said.\nThe FO Spokesperson said, “We wish to remind India that Jammu and Kashmir remains an internationally recognized dispute and one of the longest outstanding items on the UN Security Council’s agenda”.\nHe said as for Indian false propaganda of the so-called democracy, development, good governance and empowerment in the Occupied Territory, the international community had seen the most unprecedented military siege, gross and systematic human rights violations, and curbs on all fundamental rights and freedoms of the Kashmiri people in IIOJK.\n“India has taken a series of illegal steps for further disempowerment and disenfranchisement of the already deprived and oppressed Kashmiri people,” he said.\nThese include illegal changes in demographic demographic structure of IIOJK and farcical exercise of delimitation of constituencies to turn the Kashmiris into a minority in their own land, he added.\n“As for India’s own ‘unity and integrity’, RSS-BJP regime’s record is replete with instances of most egregious violations of the rights of minorities, Muslims in particular,” he said.\nThe Spokesperson said voices from inside India were questioning the current regime, adding that “a minister claiming enhanced unity was divorced from reality and nothing more than an amusing display of out-of-place hubris”.\n“We reiterate that Kashmir never was and never will be a part of India. Ultimately, India will have to give in to the will of the Kashmiris and the commitment of international community as enshrined in numerous UNSC Resolutions,” he stressed.",
  "retrievedAt": "2025-08-11T21:02:35.388Z"
}
