{
  "title": "Nandipur power plant generating 500 MW electricity: Senate body told",
  "link": "https://www.app.com.pk/national/nandipur-power-plant-generating-500-mw-electricity-senate-body-told/",
  "date_published": "2021-08-05T12:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): The Senate Standing Committee on Power on Thursday informed that Nandipur Power Plant was generating 500 MW electricity with 49 percent efficiency.\nThe committee which met with Saifullah Abro in the chair sought compliance report on the previous committee meetings, briefing on aims, objectives of establishment of GENCO Holding Company Limited, GENCO-I, GENCO-II and GENCO-III etc.\nBriefing the committee, the Chief Technical Officer GENCO said the Nandipur Power Plant earned Rs 5.5 billion revenue and now was running on gas. Earlier, it was being run on furnace oil, he added.\nHe said process of WAPDA unbundling was started in 1992 aimed at major reforms in entire power sector.\nHe said in 1998, WAPDA was unbundled in 12 separate entities Including three GENCO, eight power distribution companies and National Transmission and Despatch Company (NTDC).\nGiving compliance report, Secretary Power Ali Raza Bhutta told that 132 KV Grid Station Lala Qila and 132 KV Grid Station Munda (Balochistan) would be completed by November 2021 and March 2022 respectively.\nThe Chairman Committee said that recovery from government departments in both Hyderabad and Sukkur Electric Supply Companies were low.Even the whole police colony was getting free electricity, he added.\nThe secretary said that directives have been issued to recover all pending dues from all government departments.\nThe committee was told that Board of Directors (BoDs) of HESCO has already approved compensation to the victims of electricity related incidents.\nThe HESCO Chief apprised the committee that several irregularities were found in appointment of Chief Financial Officer and others high posts. However, he said it was prerogative of the BoDs to take action. Saifullah Abro directed the ministry to take action in this regard.\nThe meeting was attended by Senators Fida Muhammad, Saifullah Sarwar Nyazee. Zeeshan Khanzada, Prince Ahmed Umer, Sana Jamali, Haji Hidayatullah and Hafiz Abdul Karim, CEOs HESCO, PESCO, SEPCO, MD NTDC and senior officials of concerned departments.",
  "retrievedAt": "2025-08-11T21:02:39.534Z"
}
