{
  "title": "Nawaz’s visa rejection welcome development: Fawad",
  "link": "https://www.app.com.pk/national/nawazs-visa-rejection-welcome-development-fawad/",
  "date_published": "2021-08-05T18:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain on Thursday said the rejection of extension in visa of former prime minister Nawaz Sharif by the United Kingdom was a welcome development.\nThe Pakistan Muslim League-Nawaz (PML-N) leader should better approach the Pakistan High Commission in London for getting temporary traveling documents and return home to serve the remaining jail term, he said in a video statement.\nFawad said it was abundantly clear that Nawaz Sharif was not sick as he was seen dining in restaurants and strolling (on London roads), but he had obtained the visa by telling lies to the British authorities about his health.\nHe said,“We have said time and again that Prime Minister Imran Khan and the Pakistan Tehreek-e-Insaf (PTI) have no personal enmity against Nawaz Sharif.”\nThe issue, in fact, was that he (Nawaz) was a fugitive (in London) after looting billions of rupees of the national wealth, and he should have to return that in order to live a normal life at his home, he added.\nIn case, he did not return the looted money, he would have to go to jail, the minister said.\nHe said the Pakistan Government and the community had demanded the British Government not to give refuge to the people, who were involved in billions of rupees corruption.\nFawad said the first option for Nawaz Sharif was to turn up at the Pakistan High Commission, get travel documents, return home, complete the jail sentence and fight his corruption cases.\nSecondly, the minister said, he could challenge the decision of UK authorities. But he had no grounds for the purpose.\nHe was not ill as the relevant authorities were witnessing his dining at restaurants and roaming on the roads, besides holding meetings. He might be sentenced by the UK courts again for not providing actual information about his health, he added.",
  "retrievedAt": "2025-08-11T21:02:30.582Z"
}
