{
  "title": "AJK Legislature denounces continued state terrorism, HR abuses in IIOJK",
  "link": "https://www.app.com.pk/national/ajk-legislature-denounces-continued-state-terrorism-hr-abuses-in-iiojk/",
  "date_published": "2021-08-05T16:48:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 05 (APP): The newly elected Azad Jammu and Kashmir Legislative Assembly at its special session in the State metropolis on Thursday, strongly denounced continued atrocities and gruesome human rights violations by the Indian occupation forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe House urged upon the United Nations to fulfill its obligations and grant the Kashmiri people their fundamental right to self determination in accordance with the UN Security Council’s agreed regulations.\nThe session of the Assembly was held to condemn the completion of 730 days of military siege of IIOJK.\nThe speakers through their condemnation resolutions, strongly denounced the Indian government’s illegal action of 5th of August 2019 to change the demography of the State.\nThe members while addressing the House, called for convening intra-Kashmir conference of the Kashmiri leadership of the both sides of Line of Control and to allow the Hurriyet leadership to move freely and expressed their serious concern over the deteriorating health conditions of the Hurriyet leaders and called for taking solid measures to save the lives.\nThe House highly appreciated the Kashmir policy of the federal government and its serious efforts of projecting the core issue of Jammu and Kashmir in its true perspective at international level.\nThe Speaker of the Azad Jammu and Kashmir Legislative Assembly Ch Anwar-ul-Haq presided over the session.\nMeanwhile the newly elected Prime Minister of Azad Jammu and Kashmir Sardar Abdul Qayyum Khan Niazi said that the entire Kashmiri nation, the government as well as the Opposition are on the same page and united for achieving the supreme goal of Kashmir liberation.\nHe was addressing the Azad Jammu and Kashmir legislative Assembly on the condemnation resolutions moved by the Assembly members on Youme-e-Estehsal here on Thursday.\nThe Prime Minister said the government and the Opposition are on same page against the Indian government’s illegal action and gave a strong message to the Indian government that Kashmiri people will continue their struggle for the liberation of IIOJK from the Indian clutches.\nThe Prime Minister assured the Opposition that the government would take the Opposition on board on Kashmir issue as well to carry forward the developmental activities for the well being of the people of the State.\nThe Prime Minister rejected the impressions regarding the change of the status of Azad Kashmir and added that the Prime Minister of Pakistan Imran Khan in his address at Kotli, had categorically stated that the longstanding Kashmir dispute would be resolved in accordance with the wishes and aspirations of the Kashmiri people and assured that the Opposition would be taken into confidence at every stage of Kashmir issue and urged the members of the Assembly to join hands with the government to carry forward the developmental work in Azad Kashmir.\nHe assured the people of Occupied Kashmir that the entire Pakistani and Kashmiri nation stand shoulder to shoulder with them and day was not far off when their struggle would bear fruits.",
  "retrievedAt": "2025-08-11T21:02:34.706Z"
}
