{
  "title": "ICT agri dept kick start monsoon plantation drive in outskirts",
  "link": "https://www.app.com.pk/national/ict-agri-dept-kick-start-monsoon-plantation-drive-in-outskirts/",
  "date_published": "2021-08-05T12:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): Islamabad Capital Territory (ICT) Agriculture Directorate Thursday started monsoon plantation drive with an aim to cover all rural areas of the federal capital.\nMore than 25,000 saplings, both of fruit and forest varieties, will be planted to check Soil erosion and for clean and green environment.\nDirector General ICT Administration Syeda Shafaq Hashmi initiated the drive by planting a tree at Tarlai Veterinary Hospital.\nThe Directorate Agriculture was also distributing free-of-cost plants among the citizens to promote clean and green environment in the area.\nAwareness campaign has also been launched to sensitise the citizens regarding impending challenges of climate change and global warming and the importance of increasing forest cover in the country.\nSpeaking on the occasion, ICT Director General Syeda Shafaq Hashmi said that Pakistan’s future hinged on planting more and more tree and that future economies would ill-afford the burden of climate change and global warming.\nWide-spread forestation was tantamount to ensuring better future for our posterity, she concluded.\nThe Department of Soil Conservation, working under the administration control of ICT, has chalked out a comprehensive plan for carrying out the monsoon plantation activity in all suburban areas of Islamabad.\nNot only the field staff of the Soil Conservation Department but the outreach of the Agriculture Department and the Livestock Centers and Hospitals have also been brought into use for identification of land and farmers where plantation is to be carried out.\nUnder the initiative, farmers and area officers have been made responsible for safety and security of plants. This has been done to maximize the survival rate of plants and to ensure that plant’s death owing to neglect, could be minimized.\nThe Directorate has started the free plantation drive under the instructions of Chief Commissioner ICT Amer Ali Ahmed and Director General ICT Syeda Shafaq Hashmi to fulfill Prime Minister’s vision for clean and green Pakistan.\nIt is worth mentioning that free plantation will be done in suburban areas of Bara Kahu, Rawat, Bhembertrar, Tarlai, Golra, Kurii, Jodh, Sohan, Sihala, Pend Bagwal, Chirah, Noon, Tumair, especially on lands where Agriculture Directorate has recently or in the past has carried out agriculture schemes like building check dams, mini dams, spill ways, farm ponds, dug wells, lift irrigation schemes as water availability for long-term survival of plants will be better guaranteed there.\nThe forest plant species of Kachnar, Cheer, Sheesham, Shahtoot, Sukh Chain, Mor Pankh, Bottle Brush, Popular, Weeping Willos, Feeder-wood will be planted along with fruit plant species of lemon, grapes, mitha, peach, lokat, guava, olives, etc.\nSpeaking on the occasion, ICT Director Agriculture Muhammad Waqar Anwar told that along with plantation, the survival of plants and growing them into trees is also a priority and such mechanisms have been put in place which will maximize plants’ survival rate.",
  "retrievedAt": "2025-08-11T21:02:38.183Z"
}
