{
  "title": "Non-Iranian goods exempted from e-import form - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Ministry of Commerce has granted a 60-day exemption from the Electronic Import Form (EIF) for imported goods of non-Iranian origin.\n\nA formal note in this regard was issued by Deputy Secretary (Afghanistan, CEO & Cars) Mohammad Zubair Khan. It informed the authorities concerned that during a meeting chaired by the additional secretary (trade diplomacy) on Jan 27, federal Minister for Commerce Jam Kamal Khan had decided to grant the exemption for 60 days for containers carrying non-Iranian origin goods.\n\nCustoms clearing agents are required to present the Master Bill of Lading (MBL) or Iranian customs records, showing that the goods reached Iran by October 31, 2024. Importers will be allowed to bring in the non-Iranian origin goods through land routes for the next 60 days from the issuance of this circular. Customs and other authorities have been notified accordingly.\n\nQuetta Chamber of Commerce and Industry president Haji Mohammad Ayub Mariani, senior vice president Haji Akhtar Kakar and Patron-in-Chief Haji Ghulam Farooq Khilji expressed their gratitude to the minister and Chairman of Senate’s Functional Committee on Underdeveloped Areas Agha Shahzeb Durrani for their support. They commended the decision to grant the 60-day exemption from the EIF for containers carrying non-Iranian origin goods that were previously stuck.\n\nBan on transportation\n\nMeanwhile, the Balochistan government has imposed a ban on commercial transportation on the China-Pakistan Economic Corridor (CPEC) highway at Talar checkpoint on Sundays.\n\nGwadar Deputy Commissioner Hamoodur Rehman, acting on the orders of the Balochistan government, has informed all vehicle owners transporting diesel and petrol that vehicles traveling beyond Talar on the CPEC highway will be permitted to operate only six days a week, with Talar remaining closed on Sundays.\n\nThe district administration later issued a notification.\n\nBehram Baloch in Gwadar also contributed to this report\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:48.131Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889013/non-iranian-goods-exempted-from-e-import-form",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:28:33.000Z"
}
