{
  "title": "Gunmen kill 10 in Syria village ‘massacre’: monitor - World - DAWN.COM",
  "author": null,
  "content": "Gunmen in Syria have shot dead 10 people in a “massacre” in a village home to members of ousted president Bashar al-Assad’s Alawite minority, a war monitor said on Saturday.\n\nThe Syrian Observatory for Human Rights said Friday’s attack killed “10 citizens in Arzah village in the northern Hama countryside, which is inhabited by citizens of the Alawite sect”.\n\nThe Britain-based monitor, which has a large network of sources on the ground in Syria, said gunmen “rapped on the doors of houses in the village and shot at people using handguns equipped with silencers” before fleeing.\n\nObservatory chief Rami Abdel Rahman said a child and an elderly woman were among the victims. He said the gunmen “were Sunni Muslims, and the attacks bear all the hallmarks of sectarian killings”.\n\nSyrian newspaper Al-Watan, quoting a security source in Hama, said security forces “are surrounding the Arzah area to hunt the criminals” behind the killings. It said “former officers and soldiers” were among those who died in the attack.\n\nA resident told AFP that two vehicles carrying seven gunmen entered the village and targeted homes under the pretext of conducting weapons inspections.\n\nThe gunmen took the men out of the homes and forced them onto their knees before killing them “in cold blood”, the resident said on condition of anonymity due to fears of reprisals.\n\nThe gunmen left and the bodies were taken to Hama National Hospital before being buried, the resident added.\n\nDespite reassurances from Syria’s new rulers, who toppled Assad in early December, members of the Alawite community — a branch of Shia Islam — fear reprisals because of the minority’s link to the Assad clan.\n\nSince Assad’s ouster, violence against Alawites has soared, with the Observatory recording at least 162 killings.\n\nEarlier on Friday, the new authorities announced the arrest of Assad’s cousin Atif Najib, accused of orchestrating a crackdown in Daraa, where the 2011 Syrian uprising began.\n\nThe nationwide uprising was brutally crushed by Assad, spiralling into a civil war that killed more than half a million people.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/02/01172954728ff7e.png",
  "retrievedAt": "2025-08-25T19:16:35.588Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889101/gunmen-kill-10-in-syria-village-massacre-monitor",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T13:00:09.000Z"
}
