{
  "title": "Washington crash: US Army Black Hawk unit was responsible for doomsday readiness - World - DAWN.COM",
  "author": null,
  "content": "The Black Hawk helicopter that collided with a passenger jet in Washington on Wednesday was on a training flight along a route core to a seldom-discussed military mission to evacuate senior officials to safety in the event of an attack on the United States, officials say.\n\nThe military mission, known as “continuity of government” and “continuity of operations”, is meant to preserve the ability of the US government to operate.\n\nMost days, crews like the one killed on Wednesday transport VIPs around Washington, which is buzzing with helicopter traffic.\n\nBut US Defence Secretary Pete Hegseth disclosed the Black Hawk crew’s ties to the mission during a White House press conference on Thursday, saying they “were on a routine, annual re-training of night flights on a standard corridor for a continuity of government mission”.\n\nStill, little of such missions is publicly discussed.\n\nThe three soldiers killed in the collision were part of the 12th Aviation Battalion at Fort Belvoir in Virginia, whose responsibilities in a national crisis include evacuating Pentagon officials. Another 64 people were killed in the passenger plane.\n\nThe Black Hawk crew, using night vision goggles, flew the training mission along the Potomac River on a path known as Route 4. As the army comes under scrutiny for operating at night near a busy airport, officials have pointed to the battalion’s sensitive operations.\n\n“Some of their mission is to support the Department of Defence if something really bad happens in this area, and we need to move our senior leaders,” said Jonathan Koziol, the chief of staff of the army’s Aviation Directorate.\n\nThe most recent time the US government is known to have activated a continuity of operations mission in an emergency was on September 11, 2001, when Al Qaeda hijackers flew airplanes into the World Trade Centre in New York City and the Pentagon, killing almost 3,000 people.\n\nReuters was able to establish some of the activities of the 12th Aviation Battalion that day. “The battalion helped transport some senior leaders out of Washington DC to ‘hide sites’,” said Bradley Bowman, a former army aviation officer who flew on Sept 11 as part of the 12th Aviation Battalion.\n\nThat evening, Bowman flew a Black Hawk to pick up then-deputy secretary of defence Paul Wolfowitz at one of those sites and fly him back to the Pentagon.\n\nThere was just one problem — the Pentagon’s helicopter landing pad used to pick up and drop off VIPs was destroyed. “We just repositioned and landed in the traffic circle of 395, which had been closed by that point,” Bowman said, referring to the I-395 highway that loops around the US military’s headquarters.\n\nWolfowitz was quoted in a 2017 book describing going to a “bizarre location that was prepared to survive nuclear war”.\n\nThe book’s author, Garrett Graff, said the site was called Raven Rock Mountain Complex, or “Site R”, located just miles from Camp David. It remains one of three main backup facilities for the US government, and the main one for the Pentagon leadership.\n\n“It’s 100 per cent operational today. There’s a team of maybe 100 personnel inside Raven Rock right now, ready to pick up the pieces of the US government,” Graff said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/01182704d379981.jpg",
  "retrievedAt": "2025-08-25T19:16:35.592Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889106/washington-crash-us-army-black-hawk-unit-was-responsible-for-doomsday-readiness",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T13:54:48.000Z"
}
