{
  "title": "Trump says Blackhawk was ‘flying too high’; black boxes found - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: In what appeared to be a major disclosure about the investigation, US President Donald Trump said on Friday the Blackhawk helicopter that collided with a regional passenger jet in Washington, D.C. was flying too high at the time of the accident.\n\nThe US Army did not immediately respond to a request for comment.\n\nUS military helicopters regularly fly a route over the Potomac river near the busy Ronald Reagan Washington National Airport, known as Route 4. For safety reasons, the altitude on those helicopter flights is capped at 200 feet (61 metres).\n\n“The Blackhawk helicopter was flying too high, by a lot. It was far above the 200-foot limit. That’s not really too complicated to understand, is it???” Trump said in a Truth Social post.\n\nThe crash remains under investigation by federal transportation authorities.\n\nDepartment of Defence to examine military chopper’s flight recorder; report expected in 30 days\n\nUS Defense Secretary Pete Hegseth earlier said there appeared to have been an elevation issue with the Blackhawk, and said army investigators were on the ground looking into the matter.\n\nHowever, Hegseth and the army said the three-member crew of soldiers on the Blackhawk were experienced. The army said the instructor pilot, who was the designated pilot in command, had 1,000 flying hours while the other pilot had 500 hours.\n\nThe third soldier was a crew chief, typically riding in the back of the helicopter.\n\nInvestigators also recovered the so-called black boxes from the plane, an American Airlines Bombardier jet carrying 60 passengers and four crew members, which collided with the Blackhawk helicopter and crashed into the Potomac River as it prepared to land at Ronald Reagan Washington National Airport.\n\nNo one survived. The names of all the victims have not been released, but they included promising young figure skaters and people from Kansas, where the flight originated.\n\nSenator Maria Cantwell said that the dead also included citizens from Russia, the Philippines and Germany, and Chinese state media Xinhua reported two Chinese citizens had been killed in the crash.\n\nInitial report in 30 days\n\nInvestigators recovered the cockpit voice recorder and flight data recorder from the Bombardier CRJ700 passenger jet, the National Transportation Safety Board said. A preliminary report about the incident is expected within 30 days.\n\nNTSB member Todd Inman said the military helicopter was equipped “with some form of recording devices and those will be read either by DOD or by us.” He said NTSB and DOD have agreements to share data on those recorders.\n\nThe agency has begun collecting wreckage, including portions of the helicopter, and is storing it at a hangar at Reagan National. Washin­gton’s fire and emergency department said its divers had searched all accessible areas and would conduct additional searches to locate aircraft components on Friday.\n\nUS Transportation Secretary Sean Duffy said both aircraft had been flying standard flight patterns on Wednesday and there had been no breakdown in communication.\n\n“Everything was routine up to the point of the accident,” Virginia Governor Glenn Youngkin insisted. More than half of the bodies had been recovered, he said.\n\nThe airport is just across the river from Washington in Virginia.\n\nPresident Trump, however, without providing evidence said that “federal diversity efforts” could have been a factor, reiterating a theme that has become a focus of his presidency. Rights groups and Democrats complained he was politicising the disaster.\n\nTrump also criticised the helicopter pilots and suggested air traffic controllers were to blame.\n\nRadio communications showed air traffic controllers alerted the helicopter about the approaching jet and ordered it to change course.\n\nAir traffic controllers\n\nOne controller rather than two was handling local plane and helicopter traffic on Wednesday night at Reagan National, a situation deemed “not normal” but considered adequate for lower volumes of traffic, accor­ding to a person briefed on the matter.\n\nThe decision to combine duties in the evening is not uncommon, the source said. The New York Times first reported the “not normal” designation.\n\nA shortage of air traffic controllers in the United States in recent years has spurred safety concerns. At several facilities, controllers work mandatory overtime and six-day work weeks to cover shortages. The Federal Aviation Administration has about 3,000 fewer controllers than it says it needs.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679d407795c52.jpg",
  "retrievedAt": "2025-10-12T01:04:58.079Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888943/trump-says-blackhawk-was-flying-too-high-black-boxes-found",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:28:27.000Z"
}
