{
  "title": "Multan SHO held for torture of elderly man - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The New Multan station house officer (SHO) was suspended from service and arrested for torturing an elderly man on the road during the security protocol for the national cricket team two days ago.\n\nThe incident came to light after a mobile camera footage went viral on social media, showing SHO Muhammad Shafiq manhandling an elderly motorcyclist for violating protocol.\n\nThe footage showed the policeman pulling the motorcyclist down on the road and thrashing him with kicks and fists.\n\nThe incident sparked outrage on social media, with users condemning the policeman’s conduct and demanding action by police high-ups.\n\nMultan Regional Police Officer (RPO) Sohail Chaudhry took notice of the incident and directed the city police officer (CPO) to take strict action against the SHO.\n\nThe Multan CPO responded promptly by suspending the SHO from service and closing him to the police line.\n\nMeanwhile, Bahauddin Zakariya police registered a case against Shafiq under sections 352, 341 and 155 c of the Pakistan Penal Code (PPC) on behalf of the state and arrested the SHO.\n\nRPO Sohail Chaudhry later met the elderly motorcyclist, Ghulam Akbar, and apologised for the misbehaviour of the police officer.\n\nHe assured Akbar that his motorcycle would be repaired, and a new mobile phone would be provided to him as his phone was damaged in the incident.\n\nChief Minister Maryam Nawaz also took notice of the police officer’s torture of the elderly man.\n\nShe sought a report from the Punjab IGP on the incident, stating the police had no right to torture people, and should give respect to them.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:42.202Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888919/multan-sho-held-for-torture-of-elderly-man",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:29:33.000Z"
}
