{
  "title": "PTI to mark Feb 8 as black day, says MNA Qaiser - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: Former National Assembly speaker Asad Qaiser has said that the federal government’s continued apathy forced Pakistan Tehreek-i-Insaf to abandon the talks’ process.\n\nTalking to Dawn here on Friday, he claimed the party had adopted a flexible policy in negotiations with the government.\n\nMr Qaiser said the PTI’s scheduled public meeting in Swabi on Feb 8 was a reaction to the “negative” approach of the federal government.\n\n“How can we expect progress and prosperity from a government that is itself fake?” He remarked. “The government’s agenda revolves around its own interests and not around people’s welfare.”\n\nInsists centre’s apathy forced party to abandon talks\n\n“February 8 will be observed as a black day as the people’s mandate was stolen on this day a year ago, and the PTI was deprived of its mandate,” Mr Qaiser said, adding PTI’s “flexible” position was considered its weakness.\n\nHe called Shehbaz Sharif a fake prime minister and castigated the policies of his government. “The decisions made by the fake government have no legal or constitutional standing.”\n\nReferring to the amendments made to the Prevention of Electronic Crimes Act (Peca), he said: “The laws passed by this government have no legal standing because this government does not have the support of people.”\n\nHe said:“The present rulers are not the representatives of people but they are representatives of someone else.”\n\nSHOT DEAD: A man, his son and a passerby woman were killed and a student was injured when their rival opened fire on them here on Friday, police and Rescue 1122 officials said.\n\nDSP Adnan Azam Khan said Inayat Khan and his son, Mohammad Nabi, residents of Maneri Bala village, were on way home on a motorcycle when their rivals opened fire at them at the Kala Bridge on Swabi-Jehangira Road.\n\nThey died on the spot. A passerby woman, who hailed from Maini village of Topi, and a student, identified as Adil Khan, were critically injured.\n\nThey were taken to Bacha Khan Teaching Hospital, where the woman, identified as wife of Sher Alam, succumbed to her injuries.\n\nThe police arrested the accused, identified as Qayash Khan, and recovered a pistol from him.\n\nThe accused told the police he killed the man and his over an old enmity.\n\nThe police registered an FIR and started investigation.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:38.279Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888936/pti-to-mark-feb-8-as-black-day-says-mna-qaiser",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:29:47.000Z"
}
