{
  "title": "The story of a Sunni pilgrim at Arbaeen - Prism - DAWN.COM",
  "author": null,
  "content": "“You’re so lucky to be here, Bilal. You can’t just come here like that … it’s an invitation. You’re handpicked.”\n\nArbaeen marks the 40th day after Ashura — the day Imam Hussain embraced martyrdom. Every year, over 20 million people make their way to Karbala at this time, making the journey one of the largest, if not the largest, pilgrimages in the world.\n\nMy journey to Iraq wasn’t exactly planned. I’ve been to over 43 countries around the globe, but Arbaeen, specifically, was purely based on luck — the opening of a random Instagram DM.\n\nOne fine day, I received a message from a kind follower who insisted that I should make the journey to Iraq. We exchanged numbers, got talking, and one thing led to another; by then, I had given him my passport details.\n\nHe disappeared for weeks, only to return with a confirmation receipt. As it turned out, he had paid for my entire pilgrimage.\n\n“I don’t understand. This is a lot. I don’t even know you. Why?” I asked him. “Because I think you should go. May God be with you. Allah Hafiz. Have a great journey.\n\n“The tour leader will get in touch with you soon,” he replied.\n\nAnd that’s literally how it happened. The next thing I knew, I was on a flight to Baghdad. Throughout the flight, pilgrims would sporadically break into hymns and chants, culminating in the final euphoric “Nara e Haidari; Ya Ali”. This was one of the biggest sojourns of their lives.\n\nThe Baghdad airport welcomed me with chaos, packed to the brim. You can’t blame it, though — after all, it is the gateway to one of the largest pilgrimages in the world. This realisation, and the patience that came with it, was not mine alone but was also shared by fellow pilgrims, none of whom lost their cool despite the mayhem. All of us waited for nearly eight hours until our caravan was finally stamped out.\n\nThe first pit stop of the pilgrimage was at Kadhmiya, aka Kazmain. It’s home to the shrines of the 7th and 9th Shia Imams, Musa Kadhim and Muhammad Al Jawad, respectively. It was at this point that the gravity of the pilgrimage finally dawned upon me.\n\nAfter the long flight and subsequent chaotic immigration, emotions were running high, and so the first glimpse of the shrines — a short walk away from our guesthouse — brought tears to everyone’s eyes.\n\nI didn’t exactly feel the same way, though. For perspective, I was raised in a Sunni Muslim household, and so I couldn’t exactly comprehend the scale and magnitude of the occasion or the place until I got there. This was, after all, a predominantly Shia pilgrimage.\n\nNaturally, I was unfamiliar with the significance of this stage of the pilgrimage, and also overwhelmed. Seeing the very visible confusion on my face, one of my roommates asked: “Are you feeling okay, my friend? You seem a bit lost.”\n\nI didn’t know how to respond. Do I just tell him up front that I am not Shia? How do I say it? How will he respond? What is the right way to do it? There was a barrage of thoughts in my mind. And so I just blurted it all out.\n\nTo my surprise, he didn’t flinch one bit. In fact, very quickly, the news spread amongst the caravan that I am not Shia. But did that mean people from other faiths or sects were not welcome here? By the end of the journey, I had my answer: No, not at all.\n\nIn fact, I was welcomed with open arms by everyone in my caravan. Oftentimes, I even felt that they treated me better than other Shia pilgrims. “You’re Imam Hussain’s guest; that means you’re our guest,” they would say.\n\nThis warmth was not just restricted to the people in my caravan — in Iraq, kindness and hospitality know no bounds. Everyone I met extended the same generosity. One of them was a friend in Najaf, whom I had been trying to connect with for years.\n\nWhen I finally met him, he was adamant that I go back with something special. “You can’t leave Najaf without getting a Dur-e-Najaf ring. Please take this as a gift from me for being here,” he insisted.\n\nDur-e-Najaf, also known as Durr al-Najaf, is a highly prized gemstone, specifically a type of clear quartz, found exclusively in Najaf, as the name suggests. It is believed that the stone has blessings from God and is used for prayers, healing and spiritual strength.\n\nNajaf is the next pitstop after Kadhmiya, and is home to the shrine of Imam Ali (AS) — a sprawling complex crowned with an iconic golden dome. This is also where the walk to Karbala commences, from Imam Ali’s Shrine to Imam Hussain’s, from father to son. Both of their fates were written in tragedy.\n\nIn total, the journey is about 80km long. Along the route are a series of poles, each numbered to help you pace yourself and keep track of the long walk comprising 1,452 poles.\n\nThe biggest shocker for me here, though, was how you don’t have to worry about food, water or accommodation throughout the journey. Everything is free.\n\nHumanitarians from across the globe congregate here to set up their Moakibs — rest shops. They are all laid out along the route from Najaf to Karbala, ranging from sober establishments to full-fledged multi-storey air-conditioned complexes, serving as resting stops for pilgrims.\n\nSince it was the middle of summer, I would begin walking after sunset, when the temperature outside cooled, and continue until sunrise. On the walk, I met all kinds of people — rich, poor, young and old; the newly born; the politically and religiously charged; the apolitical and irreligious looking to find God.\n\nThere’s a firm belief amongst the pilgrims that if you’re a guest of Hussain, nothing will happen to you. If you’re lost, you’ll be found; if you’re sick, you’ll be tended to; if you’re thirsty, you’ll be quenched.\n\nThis is the land of the Tigris and Euphrates, two blessed and heavily contested rivers, both of which have been mentioned in the Bible and the Quran. Prophets have passed through this land, and many people have laid down their lives on these very routes.\n\nThey say that angels, martyrs and djinns are walking with you along the way, guiding you to your final destination. So even if you’re a sceptic like me, somewhere along the way, you start to feel the power of this place, its significance, its magnanimity, and its pain.\n\nOn my last day of walking, I was very close to giving up. It was past midnight, and I had stopped to sit down for some time, when an old man took a seat beside me. We got talking and soon he was passing a series of dad jokes.\n\nI don’t recall how long we sat there, but what I do clearly remember is that by the end of our conversation, I felt much better and was back on my feet to continue the journey.\n\n“I hope you see the world, Bilal. Good luck with your journey. Try your best to finish it,” the man bid me farewell. I didn’t pay much attention to his words at that moment, but a few metres later, it suddenly hit me. I never mentioned my name to him, nor did I tell him I loved to travel.\n\nI was at a loss for words. What had happened? Where did he come from? Why was he there at the very moment I was going to give up? Serendipity? Chance? Fate?\n\nI always consider myself to be a relatively fit person, but as I kept moving forward, one step after the other, none of that truly mattered. After all, this journey was an invitation from the skies and what exists beyond that.\n\nThroughout the journey, I kept thinking: What did I do to deserve to be here? Before coming to Iraq, I didn’t know much about the gravity of our shared Islamic history, but walking all alone in the thick of the night brought a lot of time for quiet contemplation.\n\nWhat was it like for Bibi Zainab to walk back to Karbala, broken, to mourn her family? She was Imam Hussain’s sister after all, and a living witness to the entire tragedy. If she could do it 1,300 years back without all the luxuries that we have now, I surely can too.\n\nThe blisters on my feet, the back pain, the sunburn, the sweat that congealed on my t-shirt into salt; none of it seemed to matter because somewhere along the way, I realised that I was doing this out of sheer love for one man: Imam Hussain.\n\nIt is love at the end of the day that gets you to the end. There is no other plausible explanation.\n\nI made it to the Shrine complex just as dawn was about to break; the golden dome of Imam Hussain’s shrine was gleaming as the first rays of daylight caressed it. In that moment, the words I had heard the most in all these days rang through my ears, accompanied by a quiet realisation — I really was handpicked for this journey.\n\nHeader image: Inside Imam Hussain’s shrine in Karbala. — All photos by author",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/13170342dae783b.jpg",
  "retrievedAt": "2025-10-12T01:05:26.899Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929543/the-story-of-a-sunni-pilgrim-at-arbaeen",
  "dateList": "2025-02-01",
  "date_published": "2025-08-15T07:20:52.000Z"
}
