{
  "title": "SBP chief pushes banks to expand agri-financing - Business - DAWN.COM",
  "author": null,
  "content": "• Hails record Rs2.22tr agriculture credit in FY24\n• Financing in first half of FY25 reaches Rs1.27tr\n\nKARACHI: The State Bank of Pakistan reported a record agricultural credit disbursement of Rs2.216 trillion in FY24, marking a 25 per cent increase from the previous year, SBP Governor Jameel Ahmad said on Friday.\n\nSpeaking at the Agricultural Credit Advisory Committee (ACAC) meeting in Multan, Mr Ahmad reaffirmed SBP’s commitment to boosting agricultural financing and ensuring sustainable growth in the agriculture sector.\n\n“Building on this momentum, the first half of FY25 recorded disbursements of Rs1.266tr, whereas the number of borrowers rose modestly to 2.86 million,” he said.\n\nEmphasising the need to expand financial outreach, the SBP governor urged banks to increase their rural presence, particularly in underserved and unserved areas, by designating more branches for agricultural lending and deploying additional credit officers to facilitate small farmers.\n\nMr Ahmad underscored the vital role of agriculture in the country’s economy, highlighting its contributions to food security, rural livelihoods and its integration with the industrial and services sectors.\n\nWhile acknowledging the sector’s persistent challenges — including low productivity, climate change impacts, and limited financial inclusion — he called on banks to prioritise agricultural finance as a core business line rather than treating it as an ancillary function.\n\nHe said the agriculture sector witnessed remarkable growth in FY24, but the momentum slowed in the first quarter of FY25, with agricultural growth dropping to 1.2pc from 8.1pc in the same period last year. This slowdown has contributed to a lower overall GDP growth rate of 0.9pc in the first quarter of FY25 compared to 2.3pc a year ago.\n\n“There are signs of a modest wheat crop, highlighting the need for resilience and innovation in agriculture for sustained growth,” he said.\n\nHe also urged banks to fully implement their Agricultural Credit Expansion Plans and invest in human resources, infrastructure and digital technologies to better serve the farmers.\n\nHe told the financial institutions to collaborate with relevant government depa­rtments, fintechs, microfinance institutions and agri-tech companies to deliver end-to-end digital loan solutions and advisory services tailored for small farmers.\n\nHe highlighted that there are three key areas for stakeholders to focus on to uplift the agriculture sector.\n\nFirst, addressing the climate change challenges calls for targeted strategies to mitigate risks and enhance resilience by adopting climate-smart agriculture, green financing and farmer training to ensure food security and sustainable growth.\n\nSecond, leveraging modern technology is crucial for transforming Pakistan’s agriculture. Globally, geospatial technologies are transforming agriculture by enabling precise crop monitoring, enhancing resource management, and minimising production risks. Pilot projects in Pakistan can adopt these tools to enhance productivity and reduce resource waste.\n\nThird, enhancing focus on the livestock sector, which contributes 14pc of the GDP and 2.1pc of the country’s total exports, offers a massive opportunity for diversifying income streams and reducing dependency on traditional crop cycles by creating an exportable surplus.\n\n“Adopting advanced technologies like efficient breeding, improved dietary regimes and manure management systems, can increase productivity and also align with Pakistan’s climate goals to reduce greenhouse gases by 50 per cent till 2030,” he said.\n\nWhile listening to the issues faced by farmers from Balochistan, the SBP governor shared that SBP would take the lead and convene all the stakeholders, including relevant government departments, bank and farmer associations and service providers in Quetta, to take a holistic approach in addressing agriculture credit bottlenecks faced by farmers in the province.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:45.564Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889000/sbp-chief-pushes-banks-to-expand-agri-financing",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:28:39.000Z"
}
