{
  "title": "90 Palestinians to be swapped with three Israelis today - World - DAWN.COM",
  "author": null,
  "content": "• First medical evacuation to take place as Rafah crossing set to reopen\n• UN says humanitarian work continues despite Israeli ban\n\nRAMALLAH: Israel is to release 90 Palestinians today (Saturday) in exchange for three Israeli prisoners in the fourth swap of the Gaza ceasefire, a Palestinian advocacy group said.\n\n“Ninety prisoners will be released tomorrow in exchange for the three Israeli detainees, nine of whom are serving life sentences and 81 of whom have long sentences,” Palestinian Prisoners’ Club spokeswoman Amani Sarahneh said on Friday.\n\nSeparately, a Hamas official told AFP that Gaza’s Rafah border crossing with Egypt will reopen on Saturday following the exchange of prisoners.\n\nThe Rafah crossing was a vital entry point for humanitarian aid to enter Gaza before the Israeli military seized the Palestinian side of it in May.\n\nSince then the gateway has been closed, drawing repeated condemnation from Egypt and other countries as well as from aid organisations.\n\n“The mediators informed Hamas of Israel’s approval to open Rafah crossing tomorrow, Saturday, after the completion of the fourth batch of prisoner exchange,” the Hamas official said, with the source explaining evacuations of the injured would take place at the crossing as per the truce agreement.\n\nThe health ministry in Hamas-run Gaza said in a statement that the first group of sick people will leave the territory for treatment in Egypt on Saturday.\n\nMonitoring mission\n\nLast Monday, the European Union agreed to restart its monitoring mission at the Rafah crossing, with 18 EU and local personnel including a police security detachment from Italy, Spain and France.\n\n“The mission was launched at the request of Israel and the Palestinian Authority, with the full support of Egypt,” the Italian government said, adding that the “primary objective is to coordinate and facilitate the daily transit of up to 300 wounded and sick”.\n\nYarden Bibas, Keith Seigel, who also has US citizenship, and Ofer Kalderon, who also holds French nationality, are to be freed by Hamas, according to an Israeli campaign group.\n\nThe UN Palestinian relief agency said its humanitarian work across the occupied territories and Gaza was still ongoing on Friday despite an Israeli ban that took effect a day before and hostility towards its staff.\n\nAn Israeli law adopted in October bans operations by UNRWA (United Nations Relief and Works Agency for Palestine Refugees) on Israeli land — including annexed East Jerusalem — and contact with Israeli authorities from Jan 30.\n\nBritain, France and Germany on Friday reiterated their concern over Israel implementing the new law, which humanitarian agencies say will have a huge impact on devastated Gaza as staff and supplies transit to the Palestinian enclave via Israel.\n\n“We continue to provide services,” Juliette Touma, director of communications of UNRWA, told a presser in Geneva.\n\n“In Gaza, UNRWA continues to be the backbone of the international humanitarian response. We continue to have international personnel in Gaza, and we continue to bring in trucks of basic supplies.”\n\nShe said any disruptions to its work in Gaza would put the ceasefire deal at risk.\n\n“If UNRWA is not allowed to continue to bring and distribute supplies, then the fate of this very fragile ceasefire is going to be at risk and is going to be in jeopardy,” she said.\n\nTouma said its Palestinian staff in the West Bank and East Jerusalem are facing difficulties, citing examples of stone-throwing and hold-ups at checkpoints.\n\n“They face an exceptionally hostile environment as a fierce disinformation campaign against UNRWA continues,” she said. “It has been a really rough ride, it has not been easy. Our staff have not been protected.”\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679d40827acd2.jpg",
  "retrievedAt": "2025-10-12T01:05:12.930Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888947/90-palestinians-to-be-swapped-with-three-israelis-today",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:28:27.000Z"
}
