{
  "title": "Positive results of US visit to be visible ‘very soon’: Interior Minister Naqvi - Pakistan - DAWN.COM",
  "author": null,
  "content": "Interior Minister Mohsin Naqvi said on Saturday that positive results of his visit to the United States during President Donald Trump’s inauguration would be witnessed very soon.\n\nPakistan views its ties with the US as vital, with hopes of navigating shared interests in a region marked by evolving dynamics and competing priorities. The government, therefore, made an early effort to engage with the Trump administration by quietly dispatching Naqvi as a special envoy to meet members of the administration’s foreign policy team and Congressional leaders.\n\nNaqvi reportedly made a diplomatic misstep by attending an event hosted by the New Federal State of China, the US-based political lobby, composed of Chinese dissidents and Americans, that advocates for the overthrow of China’s ruling Communist Party, a major ally of Pakistan.\n\nQuestioned about his visit while speaking to the media in Lahore, Naqvi said: “You will see positive results very soon. Pakistan’s government and the US government have a very good relationship, I went there in the same stead.\n\n“I met with several senators and congressmen there. Some things are only based on social media demand and some things are based on reality. You have already started seeing some results in reality and some will be happening soon.”\n\nQuestioned about the PTI’s call for a protest in Lahore on February 8 coinciding with the tri-nation ODI series involving Pakistan, New Zealand and South Africa from February 8-14, Naqvi said the PTI would be requested to not do so, saying it had similarly picked dates that matched up with sensitive events in November.\n\n“If they don’t then …,” the interior minister said as he trailed off with a smile towards reporters with a nod of his head.\n\nA day of pitched battles between security forces and PTI protesters across the federal capital ended in a hasty retreat of the party’s top leadership and supporters from the Red Zone in the early hours of Nov 27.\n\nAt least six lives were lost in the three days of protests, which included a policeman and three Rangers officials who were knocked down by a speeding vehicle, officials and hospital sources said. Claims and counter-claims over deaths purportedly caused by law-enforcement action against the PTI marchers remain a major bone of contention between the government and the opposition party.\n\nEarlier this week, an associate of Trump, who was leading a delegation of investors to Pakistan to explore business opportunities, said the US administration had nothing but respect for the incumbent leadership of Pakistan.\n\nGentry Beach, who also met PM Shehbaz, made these remarks at a press conference as journalists asked him questions about Richard Grenell — Trump’s special missions envoy in the new administration — who had tweeted in support of incarcerated PTI chief Imran Khan, stirring controversy.\n\nThe US investor said Grenell “may have been misled” about Pakistan. “He personally told me there are a number of deepfakes, AI presentations on the internet … it’s not true or real,” he said in response to a question.\n\nBeach had said Trump believed in economic diplomacy and that their visit was part of that effort. “We plan on investing billions of dollars in Pakistan across a number of different areas, including critical minerals and real estate […] From a real estate perspective, we brought our real estate development partners, and I am going to build some of the most high-end and luxury properties ever seen in Pakistan,” he had said.\n\nAsked about the recent cases of human smuggling, the interior minister responded: “Give us some time, we will be revamping the Federal Investigation Agency (FIA) soon on a massive scale.”\n\nHe said that the highest number of people involved in the smuggling cases were from Faisalabad and Gujranwala divisions, saying, “We get happy if a Pakistani goes abroad via the proper channels and not in a manner that gives the country a bad name. Give us some time, you will see much better results.”\n\nNaqvi was also asked about immigration-related issues at airports and regarding reports that travellers were being asked for bribes to which he responded: “Just wait a little while. You will see a major revamp in the FIA. We have had to take strict measures at immigration but I don’t want people who are going rightfully to face issues.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/01171004f4003e5.jpg",
  "retrievedAt": "2025-08-25T19:16:35.590Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889089/positive-results-of-us-visit-to-be-visible-very-soon-interior-minister-naqvi",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T13:50:09.000Z"
}
