{
  "title": "Taliban govt-run corporation takes over luxury Kabul Serena hotel - World - DAWN.COM",
  "author": null,
  "content": "Afghanistan’s Taliban government took over management of Kabul’s famed Serena hotel on Saturday, a hotel statement said, a luxury property targeted by Taliban attacks during their insurgency.\n\nThe Kabul Serena Hotel was run for nearly 20 years by the Aga Khan Fund for Economic Development in the Afghan capital and was popular with business travellers and foreign guests.\n\n“Kabul Serena Hotel shall be closing its operations effective February 1, 2025,” a statement from Serena on Friday night said.\n\nHotel operations are now handled by the Hotel State Owned Corporation (HSOC), the statement added.\n\n“Since opening in 2005, Kabul Serena Hotel has been an integral part of Kabul’s social fabric, an iconic presence in the city, and a symbol of our unwavering commitment to the people of Afghanistan,” the statement said.\n\nTaliban government spokesmen did not immediately respond to requests for comment and AFP journalists were not allowed onto the property on Saturday morning.\n\nOn Saturday, the hotel’s website only showed the statement about the handover and Kabul has been removed from the Serena brand’s list of destinations.\n\nThe Switzerland-based organisation also did not respond to AFP requests for comment.\n\nThe Serena has been the target of multiple deadly attacks by the Taliban before they swept to power in 2021, ousting the foreign-backed government.\n\nIn 2014, just weeks before a presidential election, four teenage gunmen with pistols hidden in their socks managed to penetrate several layers of security, killing nine people, including an AFP journalist and members of his family.\n\nIn 2008, a suicide bombing left six dead, in an attack blamed on the current Taliban interior minister, Sirajuddin Haqqani.\n\nIn 2021, the United States and Britain warned their citizens to avoid hotels in Afghanistan, singling out the Serena, underlining the shaky security situation in the aftermath of the Taliban takeover.\n\nIn the years since their return to power, however, the Taliban authorities have worked to attract tourism to Afghanistan, touting a return to security.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/01142827ca83ca3.jpg",
  "retrievedAt": "2025-08-25T19:16:36.076Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889078/taliban-govt-run-corporation-takes-over-luxury-kabul-serena-hotel",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T09:30:01.000Z"
}
