{
  "title": "Five more Morocco boat survivors return - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: Five more Morocco boat tragedy survivors reached back here on Friday, while the arrival of 10 bodies of the deceased Pakistani immigrants further del­ayed, according to official sources.\n\nThe five survivors belonging to Gujrat, Mandi Bahauddin and Hafizabad districts of Punjab landed at Islamabad airport a day after two flights had brought seven survivors to Islamabad.\n\nThe repatriation operation by the Ministry of Foreign Affairs will complete on Saturday with the scheduled arrival of the final batch of eight survivors.\n\nHowever, official sources said, the 10 bodies of the deceased Pakistani immigrants were yet to be brought back. They said the Moroccan authorities had not confirmed the identity of a few among them till Friday, which was causing the overall delay.\n\nAuthorities yet to repatriate bodies of 10 Pakistanis\n\nAll the boat tragedy survivors were handed over to the Gujranwala and Gujrat circles of the Federal Investigation Agency (FIA) by the immigration authorities soon after their arrival. After necessary questioning, all those who were brought on Thursday were allowed to return home.\n\nMeanwhile, the FIA Gujran­wala circle claimed to have arrested a human trafficker namely Waris Ali, a resident of Gondalanwala Street, in connection with a complaint registered against him.\n\nAccording to the complainant, the suspect had extorted Rs2.5 million from him with a promise to send him to Italy, but failed to do so. Further investigation is underway.\n\nOn the other hand, some 15 immigration officials received training on basic travel document security at the Sialkot International Airport.\n\nThe trainers from International Center for Migration Policy Development (ICMPD) conducted different training sessions for two days. The officials said the training helped them in meeting the challenges of illegal human trafficking and attempt to travel on fake documents.\n\nOn the other hand, a joint team of ICMPD, Sialkot International Airport Limited (Sial) and an architect firm conducted a survey for space allocation in the departure lounge for the establishment of a second line office, which will scrutinise suspicious passengers even after the clearance from the main immigration counters.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:49.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888944/five-more-morocco-boat-survivors-return",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:28:27.000Z"
}
