{
  "title": "January collection target missed by Rs85bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) missed its revenue collection target of nearly Rs85 billion in January due to lower-than-expected inflation.\n\nThe FBR collected Rs872bn in January against the target of Rs957bn. However, the collection is 26pc higher than Rs677bn collected a year ago, according to provisional data released on Friday.\n\nThe overall shortfall in revenue collection between July and January of the current fiscal year reached Rs468bn, reflecting a daunting task for FBR to cover the gap in the remaining months.\n\nAccording to provisional figures, the FBR collected Rs6.497 trillion during the first seven months (July-January) of FY25 against the target of Rs6.965tr. However, the collection is 26pc higher than the year-ago figure of Rs5.143tr.\n\nRevenues grow 26pc to Rs6.5tr in 7MFY25\n\nThe shortfall is largely attributed to reduced tax collection from imports, sluggish manufacturing growth and unexpectedly low inflation, which has dropped to single digits in recent months.\n\nThe government’s overly ambitious revenue target of Rs12.913tr for FY25, a 40pc increase from FY24, is now backfiring. The refusal to cut expenses and the unexpected hike in the revenue target makes it seem nearly impossible to achieve.\n\nThe FBR paid Rs307bn in refunds to taxpayers in 7MFY25, up 12.45pc from Rs273bn in the same period last year. However, January saw an almost 13pc fall in refund payments to Rs34bn year-on-year.\n\nThe government believes an additional Rs3.659tr revenue in FY25 will be achieved from three main factors. It hopes that GDP growth of 3pc, large-scale manufacturing expanding at 3.5pc with inflation at 12.9pc, and imports growing at 16.9pc will collectively yield an additional Rs1.863tr in revenue in FY25.\n\nIndependent economists estimate that real revenue collection in FY25 will be approximately Rs12tr.\n\nThe IMF team will visit Islamabad in late February or early March to conduct the first economic review under the 37-month $7bn Extended Fund Facility. The revenue shortfall is expected to be managed by adjusting autonomous growth and reducing expenditures instead of introducing new taxes.\n\nIn July-January, income tax collections totalled Rs3.160tr, exceeding the target of Rs2.877tr by Rs283bn. The income tax collection recorded a growth of 29pc when compared with last year’s Rs2.445tr.\n\nThe sales tax collection fell short of the target by Rs467bn in 7MFY25, totalling Rs2.218tr. The sales tax collection recorded a growth of 26pc compared with last year’s Rs1.763tr.\n\nThe customs collection also fell short of the projected target by Rs166bn to Rs713bn in 7MFY25. The customs collection recorded a growth of 14pc when compared with last year’s Rs628bn.\n\nThe Federal Excise Duty collection fell short of the target by Rs120bn to Rs404bn in 7MFY25. The excise duty recorded a growth of 31pc over last year’s Rs307bn.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:45.786Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889004/january-collection-target-missed-by-rs85bn",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:28:39.000Z"
}
