{
  "title": "Fragile Kurram peace shaken after AC injured in firing - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Saeed Manan shot amid security deployment in restive district\n• KP govt spox reaffirms resolve against those who challenge state authority\n• Chief secretary calls on elders to prevent ceasefire disruptions\n\nKURRAM: A hard-won ceasefire agreement suffered a major setback when a senior district administration official, who was mediating to halt fresh clashes between warring sides in Kurram, was injured along with two others in a firing incident in the Bushehra area of the restive district on Friday.\n\nAccording to the police and district administration, a firing incident took place in Upper Kurram’s Bushehra area in which locals Gul Ali Tori and Abbas Ali were injured. They were taken to Parachinar hospital.\n\nFollowing the incident, a gunfire erupted between the warring groups in the area. Later, Assistant Commissioner (Revenue) Saeed Manan, along with police and administration personnel, arrived in the area and mediated a ceasefire.\n\nWhile security personnel were being deployed, AC Manan was shot at, leaving him injured. He was rushed to the district headquarters hospital in Parachinar.\n\nDHQ hospital medical superintendent Dr Syed Mir Hassan Jan said the AC underwent surgery and was out of danger. He was shot in the stomach and later transferred to Peshawar via helicopter.\n\nEarlier in November last year, an attack on a convoy in Lower Kurram’s Bagan area killed over 40 people. At least 130 more lives were claimed in the ensuing clashes. The volatile security situation led to the closure of a main road for weeks, resulting in a shortage of essential goods and medicines in Upper Kurram’s Parachinar.\n\nWhile a ceasefire deal was signed between warring tribes on Jan 1, attacks on government and aid convoys this month have put peace in peril.\n\nOn Jan 4, an attack in the Bagan area injured Deputy Commissioner Javedullah Mehsud and six others. In a Jan 16 attack on a convoy in the same area, two security officials were martyred and five others injured. Retaliatory action by security forces left six attackers dead and 10 injured.\n\nIn response, authorities launched a limited “counter-terrorism operation” in Lower Kurram on Jan 19, which used gunship helicopters and concluded after four days.\n\n‘Conflict fuelled by hatred’\n\nMeanwhile, addressing a grand jirga at the commissioner’s office in Kohat, Muhammad Ali Saif, adviser to the Khyber Pakhtunkhwa chief minister on information, reaffirmed the government’s commitment to restoring peace in Kurram, emphasising that the conflict was not religious or sectarian but fueled by hatred.\n\nMr Saif urged all stakeholders to recognise the devastating impact of violence, stressing that internal divisions — not external forces — were responsible for loss of life and property. He said war and hatred lead only to destruction, while progress comes from unity.\n\n“The real issue is not religious but personal hatred. When we allow hatred to consume us, we forget Islam’s teachings and the values of humanity,” he added.\n\nCondemning the recurring cycles of violence, Mr Saif called on the participants to reflect on past mistakes and commit to coexistence. He acknowledged the peace agreement facilitated by the government, signed with consensus from local leaders and stakeholders, but expressed concern over elements attempting to disrupt peace efforts through misinformation and violence.\n\n“The government has acted as a facilitator and remains committed to implementing the agreement. However, lasting peace requires active participation and responsibility from the people. Identifying and handing over miscreants to law enforcement is crucial for stability,” he said.\n\nRegarding governance and security, he assured that the government is fully engaged in ensuring regional safety, citing the sacrifices made by law enforcement, including the deputy commissioner who was injured while working towards peace.\n\nOn the issue of compensation, Mr Saif confirmed the government’s allocation of relief funds, including financial assistance for victims and businesses affected by the conflict. He announced that a dedicated relief package for Kurram is set for approval, reinforcing the administration’s commitment to supporting the affected communities.\n\nHe reiterated the government’s firm stance against those challenging state authority, warning that legal action would be taken against instigators of violence. “The government will not allow anyone to sabotage peace. Those who take the law into their hands will face consequences,” he warned.\n\nOn the occasion, KP Chief Secretary Nadeem Aslam Chaudhary commended the elders and jirga members for their efforts in maintaining dialogue and working toward peace. He reaffirmed the government’s full support in implementing the peace agreement and addressing community concerns.\n\nAcknowledging the suffering endured by the people of Kurram, he assured that financial compensation for victims was in process. He revealed that the provincial cabinet had allocated relief funds, including Rs160 million for medical aid and Rs120m for business rehabilitation.\n\nHighlighting the role of security forces and civil administration, he said their sacrifices should not be overlooked. “Our officials, including the deputy commissioner and law enforcement personnel, have risked their lives to protect the people.”\n\nThe chief secretary urged tribal elders to take an active role in enforcing the agreement and preventing miscreants from derailing the peace process, adding that collective efforts were necessary to rebuild trust among communities.\n\nHe reiterated the government’s commitment to addressing the region’s challenges, and urged all parties to implement the peace agreement sincerely and work together for lasting peace.\n\nThe grand jirga was attended by IGP Zulfiqar Hameed, the Kohat division commissioner, senior government officials, tribal elders and community leaders. All reaffirmed their commitment to implementing the peace agreement and restoring stability in the region.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:05:26.425Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888953/fragile-kurram-peace-shaken-after-ac-injured-in-firing",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:28:20.000Z"
}
