{
  "title": "UP govt tried to play down Kumbh crush to ‘protect’ CM Adityanath - World - DAWN.COM",
  "author": null,
  "content": "PRAYAGRAJ: Indian officials downplayed a deadly stampede at the world’s largest religious festival this week because they wanted to “protect the public image of a potential successor” to Prime Minister Narendra Modi, an analyst says.\n\nWednesday’s stampede took place at the Kumbh Mela, a 12-yearly festival of ritual bathing that has been held in the northern city of Prayagraj for more than a millennium.\n\nAlthough deadly incidents are regrettably common at public gatherings in India, where this week differed from past stampedes was a concerted effort by authorities to understate its severity — or deny outright that it happened.\n\nOfficials insisted for hours that no one was seriously injured, despite graphic television footage from the scene, that the situation was under control, and that suggestions to the contrary amounted to rumour-mongering.\n\nOfficials insisted for hours that no one was seriously injured, despite TV footage, an analyst says\n\nThey waited for almost a day before confirming that 30 people had been killed in the chaotic pre-dawn crowd surge at a festival that has drawn tens of millions of pilgrims from around India.\n\n“They underplayed it. They said it was a `stampede-like situation’. What does that mean? It is either a stampede or it is not,” Hartosh Singh Bal, executive editor of Indian news magazine Caravan, said.\n\n“Officials on the ground in India just don’t do things on their own,” he said. “Everything happens according to orders from the top.”\n\nResponsibility for staging of the Kumbh event — and the unfathomable numbers of devotees who visit over its six-week duration — this year fell on officials in Uttar Pradesh, a state home to more people than Brazil.\n\nUttar Pradesh is run by Chief Minister Yogi Adityanath, 52, a firebrand former monk who has become one of the leading figures in Narendra Modi’s Bharatiya Janata Party and is seen as a potential future prime minister.\n\nAdityanath had taken steps to make the Kumbh Mela a sign of the success of his stewardship, with billboards showing the smiling saffron robe-clad leader a ubiquitous feature of the festival.\n\nThe Indian Express newspaper reported last month that his government had recruited “digital warriors” — a coterie of social media influencers — to publicise the good work of police at the festival and combat “fake news”.\n\nNew Delhi-based writer and analyst Nilanjan Mukhopadhyay said Adityanath’s political appeal, like Modi’s, rested on being seen as a custodian of the Hindu faith.\n\n“The success of Kumbh without any blemish was very important,” he said.\n\n“But now, there is a blemish.”\n\n‘There was no stampede’\n\nAuthorities scrambled to put their own spin on events as news of a pre-dawn stampede spread on Wednesday.\n\n“There was no stampede. It was just overcrowding, due to which some devotees got injured,” a police official told one briefing nearly 12 hours after the fatal crush.\n\nAnother officer insisted to media later that afternoon that no one had been seriously injured at all.\n\nAdityanath, the chief minister, himself said the situation was under control and told the public “not to believe any kind of rumours”.\n\nThe festival’s official communications team continued to give regular updates on the number of pilgrims participating in bathing rituals, but ignored requests for information about how many had been caught in the stampede.\n\nPolice finally confirmed after sunset that 30 people had been killed and dozens more injured when the day’s rituals were drawing to an end.\n\nThe long information blackout fuelled scepticism that it reflected the true extent of the disaster, with several media outlets suggesting the toll was higher.\n\n‘Heads should roll’\n\nThe police announcement of the death toll was accompanied by an official statement praising officers for acting quickly to prevent the situation from spiralling out of control.\n\n“Eyewitnesses praised the swift action … their timely intervention prevented a major disaster,” the statement said.\n\nThe official account has been vehemently contradicted by witnesses.\n\n“It took an hour and a half for police to come and get her body,” Tarun Bose, whose relative was trampled to death on Wednesday, said. “There were no police officers around during the accident.”\n\nAshish Tripathi, a resident of Prayagraj, said it was clear festival organisers had failed in their duties to anticipate crowd numbers.\n\n“Heads should obviously roll for this tragedy,” he said.\n\nTripathi said he felt sorry for those killed in the stampede who, like millions of other Hindu faithful, had travelled to bathe in the rivers running by the city in the belief it would free them from the cosmic cycles of death and rebirth.\n\n“Some people say that dying here in Prayagraj gives you salvation,” he said. “Not like this.”\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:43.385Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889020/up-govt-tried-to-play-down-kumbh-crush-to-protect-cm-adityanath",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:29:13.000Z"
}
