{
  "title": "PPP ignores opposition protest as Sindh Assembly passes varsity law tweaks - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Controversial bill allows non-PhD bureaucrats to become vice chancellors in Sindh\n• Muttahida, PTI and Jamaat lawmakers tear copies of the amended law\n• Another bill passed to end pecuniary limit on district courts in civil suits\n\nKARACHI: Amid strong protest by all three opposition parties, the Pakistan Peoples Party, based on its numeric majority in the Sindh Assembly, on Friday got passed the Sindh Universities and Institutes Laws (Amendment) Bill enabling current bureaucrats to become vice chancellors of universities across the province.\n\nThe situation in a thinly attended house became tense when members of the Muttahida Qaumi Movement-Pakistan, Jamaat-i-Islami and Tehreek-i-Insaaf-backed Sunni Ittehad Council gathered in front of the Speaker’s desk, chanting slogans against the controversial legislation.\n\nAs Law and Parliamentary Affairs Minister Ziaul Hassan Lanjar began clause by clause approval of the bill, the opposition members tore up the copies of the amended law.\n\nUnder the amendment law, any bureaucrat holding degree of master’s can be appointed vice chancellor in any university.\n\nAs per the new law, a cadre officer of BPS-21 or above, having bachelor’s degree in engineering and master’s degree in any discipline from the Higher Education Commission-recognised university or institute can be appointed VC in any university of Sindh.\n\nHowever, after being appointed as vice chancellor, he will have to leave the civil service.\n\nBesides, an eminent academician and who is qualified to be a full professor, having PhD from recognised HEC University/Institute in relevant field having registered with the Pakistan Engineering Council or the candidates having PhD in relevant field and having 15 years’ experience in academic, research or management leadership position and possess distinguished research and publication record can also be appointed VC under the new law.\n\nThe candidate for the VC post shall not be more than 62 years of age on the last date of applying for the post.\n\nThe appointment of the vice chancellor will be from among the three names recommended by the search committee.\n\nSimilarly, the house smoothly passed with majority votes the Sindh Civil Courts (Amendment Bill) into law.\n\nAs per the amended law, the original jurisdiction of the district court in civil suits and proceeding shall be without pecuniary limit.\n\nUnder the law, all suits and proceedings pending disposal in the Sindh High Court in original jurisdiction shall stand transferred to the courts of the concerned district judge.\n\nThe law and parliamentary affairs minister said that the amended law would reduce the case burden on the high court.\n\nEarlier, when Deputy Speaker Anthony Naveed allowed the opposition leader to speak, he asked the government as to what was the compulsion to approve these laws in such a hurry. “If the government wants to suppress our voice, then it must stop talking about democracy,”\n\nAs for the Sindh Courts (Amendment) Bill, he said that it was presented in the house for approval without sending it to the standing committee and without any consultation from the opposition parties. “The Peoples Party is making legislation arbitrarily on the basis of majority,” he deplored.\n\nThe law minister said that the provincial government wanted ordinary citizens to get quick and cheap justice through this law. “This is not being done to benefit any particular person or any approved opinion,” he added.\n\nCall attention notices\n\nIn reply to a call attention notice given by MQM-P lawmaker Najam Mirza, the law and parliamentary affairs minister said that the water supply to Karachi would not be affected due to the lining of KB Feeder that supplied water to the Keenjhar Lake.\n\nThe MQM-P member had pointed out that the lining work of the KB Feeder Canal coming out of Kotri Barrage could not be completed on the given time and there was an apprehension of water crisis in the city.\n\nMr Lanjar told the house that the timeframe for the lining project was from Dec 25, 2024 to Jan 10.\n\nHe said that there was sufficient water in the Keenjhar Lake for three-month supply to the city before the water supply to the lake from KB feeder was suspended.\n\nThe minister said that lining would be completed shortly.\n\nThe house was later adjourned to Monday at 10am.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:16:42.302Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888968/ppp-ignores-opposition-protest-as-sindh-assembly-passes-varsity-law-tweaks",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:29:17.000Z"
}
