{
  "title": "6 dead as medical jet crashes in Philadelphia days after Washington disaster - World - DAWN.COM",
  "author": null,
  "content": "A medical jet with six Mexican nationals on board crashed into a busy Philadelphia neighbourhood on Friday, authorities said, marking another US aviation disaster after a passenger plane and a military helicopter collided midair in Washington earlier this week.\n\nVideo footage appeared to show the twin-engine plane descending at a sharp angle towards a residential area, sparking a huge fireball upon impact and showering wreckage over homes and vehicles.\n\nThe Federal Aviation Administration (FAA) said the aircraft was a Learjet 55 — an American-French business jet — that had taken off shortly before from Northeast Philadelphia Airport bound for Branson, Missouri.\n\nThe crash happened just after 6pm (4am PKT).\n\nA young girl who had been in the United States for medical care, her mother, and members of the flight and medical crews accompanying her onboard were killed in the crash, the children’s hospital that treated her told AFP.\n\n“The patient had received care from Shriners Children’s Philadelphia and was being transported back to her home country in Mexico on a contracted air ambulance when the crash happened,” said Mel Bower, a spokesman for Shriners Children’s.\n\nAll six of those onboard were Mexican citizens, the country’s foreign ministry said in a statement.\n\n“The airline company… confirmed to the consulate that six people of Mexican nationality were traveling on the aircraft,” the ministry wrote on X.\n\nThe operator, Jet Rescue Air Ambulance, confirmed in a statement to US media that there were two passengers and four crew, adding, “At this time, we cannot confirm any survivors.”\n\nDozens of emergency workers were on the scene outside Roosevelt Mall, a strip mall in Northeast Philadelphia with retailers and food outlets.\n\nUS President Donald Trump posted on Friday on his Truth Social platform that he was “sad” to see “more souls lost” in the Philadelphia tragedy.\n\nHe praised first responders, adding: “God Bless you all.”\n\nWitnesses told local TV crews that they saw body parts in or near the wreckage, as Philadelphia City Council member Mike Driscoll said he feared residents or others on the ground may have been killed.\n\n“It doesn’t look good. And it’s a sad situation here,” he told CNN.\n\nThe FAA said it was launching an investigation with the National Transportation Safety Board.\n\nBoth agencies are already probing the deadliest US air disaster in almost a quarter century, after a passenger jet operated by an American Airlines subsidiary collided with a Black Hawk helicopter on Wednesday.\n\nThe airliner with 64 people onboard was landing at Reagan National Airport in Washington — just miles from the White House — when it collided with the US Army helicopter on a training mission.\n\nDivers were scouring on Friday for the remaining bodies in the frigid Potomac River, after having pulled at least 41 from the water.\n\nInvestigators on Friday found the helicopter’s black box after having already retrieved the cockpit voice and flight data recorder from the Bombardier jet operated by an American Airlines subsidiary.\n\nOfficials are confident data can be fully extracted from the recorders, said NTSB member Todd Inman, adding an investigation was still being carried out.\n\nHowever, the lack of clarity over the accident’s cause did not deter Trump’s politicized commentary.\n\nHe appeared to place blame on the military helicopter in a post on the Truth Social platform, saying it was “flying too high, by a lot.”\n\nThis followed a news conference on Thursday where the Republican pinned the blame for the crash on his Democratic predecessors Joe Biden and Barack Obama, claiming without evidence they had hired the wrong people due to non-discrimination initiatives known as DEI.\n\nChesley Sullenberger, who famously landed a stricken passenger plane on New York’s Hudson River in 2009, told network MSNBC he was “disgusted” but “not surprised” by Trump’s rhetoric.\n\nAviation experts homed in on whether the helicopter crew could see through military night-vision goggles — and whether the control tower was understaffed.\n\nThe collision was the first major crash in the United States since 2009, and the deadliest since an American Airlines jet crash in Belle Harbor, New York in 2001 that killed all 260 aboard.\n\nAmong those on Wednesday’s doomed airliner were several US skaters and coaches, and Russian couple Evgenia Shishkova and Vadim Naumov, who won the 1994 world pairs title.\n\nTwo Chinese citizens and a Filipino were also among the victims.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/01125119991496e.jpg",
  "retrievedAt": "2025-08-25T19:16:39.989Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889063/6-dead-as-medical-jet-crashes-in-philadelphia-days-after-washington-disaster",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T07:52:20.000Z"
}
