{
  "title": "German legislators reject anti-immigration bill tabled by CDU, far right - World - DAWN.COM",
  "author": null,
  "content": "BERLIN: German legislators on Friday narrowly voted against a bill to restrict immigration proposed by the opposition conservatives with the support of the far-right Alternative for Germany (AfD) party.\n\nThe CDU-CSU conservatives had on Wednesday passed a non-binding motion calling for an immigration crackdown, with backing by the AfD — a move widely criticised for breaching a long-standing political “firewall” against extremists.\n\nBut Friday’s push to pass a full law failed with 338 votes in favour, 350 votes against and five lawmakers abstaining in the Bundestag, the German legislature.\n\nThe result was greeted by a brief burst of applause from the ruling Social Democrats and Greens who were the biggest parties to oppose it.\n\nThe debate was delayed for hours to allow for last-ditch talks bet­ween the CDU-CSU and other moderate parties to find a compromise, but these failed and the vote went ahead as planned.\n\nAlice Weidel, the AfD leader, told reporters that the result was a “bitter defeat” for CDU chief Friedrich Merz and showed his inability to push through measures restricting immigration.\n\nOn Wednesday the CDU provoked a backlash by pushing through a non-binding resolution on immigration with AfD votes, the first such majority formed in the Bundestag since the Second World War.\n\nFriedrich Merz, the CDU chief, had vowed before the vote to pass the bill with the support of the far-right, repeating a tactic that has sparked an outcry and street protests.\n\nAs MPs traded bitter recriminations in parliament, centre-left Chancellor Olaf Scholz warned that Merz could no longer be trusted and voiced fears the conservative candidate may in future invite the Alterna­tive for Germany into a coalition government.\n\nIn a climate inflamed by a string of deadly attacks blamed on asylum seekers, CDU chief Merz, whose alliance has a strong lead ahead of Feb 23 elections, has vowed a harsh crackdown on illegal migrants and to beef up border controls if he comes to power.\n\nHe has faced huge blowback for breaking a long-standing safeguard against cooperating with the AfD in a motion on Wednesday — but on Friday vowed to stay the course.\n\nAfter hours of frantic backroom talks between mainstream party leaders failed to reach a compromise, Merz vowed to go ahead, arguing passionately that German voters demand greater security.\n\nPublished in Dawn, February 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/679d69e718803.gif",
  "retrievedAt": "2025-08-25T19:16:43.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889029/german-legislators-reject-anti-immigration-bill-tabled-by-cdu-far-right",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T00:29:12.000Z"
}
