{
  "title": "Los Angeles fires fully contained after burning for 3 weeks: state agency - World - DAWN.COM",
  "author": null,
  "content": "Two devastating wildfires in Los Angeles were declared fully contained by firefighters on Friday after burning for more than three weeks, killing about 30 people and displacing thousands more.\n\nThe Palisades and Eaton fires in Southern California’s Los Angeles County were the most destructive in the history of the second-largest US city, burning more than 150 square kilometres and over 10,000 homes, causing damage estimated to cost hundreds of billions of dollars.\n\nCal Fire, the state’s firefighting agency, updated the figures on its website on Friday to show 100 per cent containment of both fires, meaning their perimeters were completely under control. Evacuation orders were lifted earlier, with the fires not posing a serious threat for days.\n\nBoth blazes started on January 7 and their exact cause remains under investigation.\n\nBut human-driven climate change set the stage for the infernos by reducing rainfall, parching vegetation, and extending the dangerous overlap between flammable drought conditions and powerful Santa Ana winds, according to an analysis published this week.\n\nThe study, conducted by dozens of researchers, concluded that the conditions fuelling the blazes were approximately 35pc more likely due to global warming caused by burning fossil fuels.\n\nThe two fires destroyed thousands of structures over more than three weeks in the affluent Pacific Palisades neighbourhood of Los Angeles and Malibu, and in the Altadena community in Los Angeles County, forcing thousands of residents to evacuate their homes.\n\n“Our recovery effort is based around getting people back home to rebuild as quickly and safely as possible,” Los Angeles Mayor Karen Bass said in a statement on Friday.\n\n“We are making sure that the Palisades will be safe as residents access their properties.”\n\nCity police chief Jim McDonnell said the presence of law enforcement officers in the area would be “more than 10 times” what it was before the start of the fires.\n\nPrivate meteorological firm AccuWeather has estimated the damage and economic loss at between $250-$275bn.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/011645460e11c9b.jpg",
  "retrievedAt": "2025-08-25T19:16:34.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889095/los-angeles-fires-fully-contained-after-burning-for-3-weeks-state-agency",
  "dateList": "2025-02-01",
  "date_published": "2025-02-01T12:00:09.000Z"
}
