{
  "title": "Independent inquiry underway to ascertain root cause of power outage: Omar",
  "link": "https://www.app.com.pk/national/independent-inquiry-underway-to-ascertain-root-cause-of-power-outage-omar/",
  "date_published": "2021-01-15T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP): Federal Minister for Energy Omar Ayub Khan on Friday informed the Senate that an independent inquiry was being underway to ascertain the root cause of the recent power breakdown in the country.\nConcluding debate on a motion about gas and energy crisis in the entire country, he said eight major power breakdowns were occurred during PML-N government which took days to restore the system.\nHowever, he said despite the complete breakdown, the power system was restored within few hours.\nOmar said the power outage caused due to technical fault developed at Guddu Power Plant. Initial fault occurred at Guddu power station at 2341 hours, dropping the frequency to zero, he said.\nHe said that the past government did not upgrade the transmission system. The incumbent government was making huge investments in the transmission and distribution system, he said.\nHe said Lahore to Matiari transmission line has already been laid with huge investment. The masses were facing the problems due to the miss-management and poor planning by the previous governments, he added.\nThe minister said that more investment would be made on the low performing units to enhance the capacity of the power generation.\nHe said today Energy Ministry was going to hold open bidding for 20 new oil and gas exploration blocks.\nHe said past governments did not work on the exploration of new blocks adding that the new exploration would make the country self-sufficient in the energy sector.\nRecounting the initiatives for the welfare of the masses, he said that the present government has initiated Ehsas programme for the poor segment of the society while Co Chairman PPP Asif Ali Zardari embezzled billions of rupees during his government tenure.\nHe said that opposition was in pain owing to the good work being done by the government.\nHe said that Pakistan Democratic Movement (PDM) rallies were flopped and people have rejected their narrative.\nHe said that the opposition looted public money during their governments and even people in Larkana have no health facilities.\nThe minister said that he would brief the house about reforms in energy sector. He said, “ We will sign Memorandum of Understanding with IPPs”.\nEarlier, Speaking on the motion Robina Khalid criticized the government for failing to control inflation.\nShe said that tall claims were made but people were facing problems due to inflation of essential commodities.\nSenator Dilawar Khan demanded that Audit of Islamabad club and Lahore Jamkhana should be carried out.\nSenator Aurangzeb Khan said that discussing personal issues in the House should be avoided. He said that those facing NAB investigation should go to courts.\nHe said that accountability should be held across the board and this house would not be used for personal issues. Later the house was adjourned to meet again on Monday at 3:00 pm.",
  "retrievedAt": "2025-08-11T20:14:41.692Z"
}
