{
  "title": "Digital survey to enroll deserving households underway in Rawalpindi district: Dr Sania",
  "link": "https://www.app.com.pk/national/digital-survey-to-enroll-deserving-households-underway-in-rawalpindi-district-dr-sania/",
  "date_published": "2021-01-15T11:57:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 15 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection Dr Sania Nishtar Friday said Ehsaas digital survey has been launched in Rawalpindi district and the teams were visiting door-to-door to gather data in Kahuta, Kalar Syedan, Kotli Sattian and Murree, four tehsils of the district.\nAddressing a press conference here at Deputy Commissioner’s office, she said that the survey to enroll deserving households would start in Taxila tehsil on January 25 and in Rawalpindi and Gujar Khan tehsils on Feb 25.\nShe said, Ehsaas was conducting a door-to-door survey all over the country to gather data about the socioeconomic status of households.\nIt is first ever fully digital survey that continues in various districts across the country to register deserving households under Ehsaas, she said adding that the survey had been completed in 41 districts of the country while it’s underway in 75 districts.\nDr Sania said that special desks had also been set up in the districts where the survey was completed to register households if any that could not be enrolled in door-to-door survey.\nThe training programme which is an important element in launching the survey was also being completed in 25 districts of the country, she said.\nThe adviser said that the digital survey was launched in all districts of Punjab province.\nShe said the Ehsaas survey was 63 percent has been completed and is progressing smoothly to accomplish by June 2021.\nAccording to the inclusive social protection policy of Ehsaas, the results of the survey will facilitate proper targeting the poor households across the country and the households registered under the survey for Ehsaas initiatives particularly the new Ehsaas beneficiaries for Kafaalat, Nashonuma, Waseela-e -Taleem Digital, Amdan and Interest-free Loans and several other Ehsaas initiatives.\nTo ensure transparency and integrity in data collection, the entire survey process has been made end-to-end digital. The field teams are going door-to-door to collect the socioeconomic data of the households at their doorsteps through an android based application.\nOwing to the technical nature of computerized Ehsaas survey, massive training of master trainers, trainers, enumerators and supervisors is an important element of the Ehsaas survey methodology. This is also critical to ensure survey quality, she added.\nThis is a digital survey being completed under a transparent procedure and without any discrimination.\nShe urged the citizens to get registered in Ehsaas, the households should cooperate with the survey teams and share factually true data when the survey teams visit them.\nNo forms are being distributed among the citizens for the survey, she said adding, it’s free of cost and no one was allowed to charge any fee for carrying out survey of the households.\nTo ensure 100 percent coverage of the households under the survey, tehsils have been divided into blocks based on the population. This approach ensures 100 percent coverage and enables the identification of left out households in the survey operations.\nFurther, to facilitate deserving households in self-registration, Ehsaas registration desks are also being launched at Tehsil levels in the country. The opening of registration desks is linked to the completion of the survey in each district.\nOn the occasion Deputy Commissioner, (DC) Rawalpindi Capt. ® Anwar ul Haq was also present.",
  "retrievedAt": "2025-08-11T20:14:40.990Z"
}
