{
  "title": "Country expected to start procurement of COVID-19 vaccine by February, says Dr. Faisal Sultan",
  "link": "https://www.app.com.pk/national/country-expected-to-start-procurement-of-covid-19-vaccine-by-february-says-dr-faisal-sultan/",
  "date_published": "2021-01-15T16:56:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 15 (APP): Country is expected to start procurement of COVID-19 vaccine within first quarter of 2021 – possibly sometime in February, said Dr. Faisal Sultan, the Special Assistant to the PM on health.\nSharing details of the process, he told APP on Friday that along with bilateral arrangements to get it directly from the manufacturers, COVAX facility through GAVI is also there.\nImport of these by private companies was said to have been allowed to those who can afford the same.\nTo a query, he said first quarter of 2021 has been set as the targeted time frame to help arrange the first batch of the vaccine for the country with the objective aimed at protecting people most vulnerable to the viral infection.\n“Chances are that availability will be there from February,” said the SAPM on health.\nAnswering a question, he said there is little possibility to have the first batch in next two weeks time, but efforts are fast underway for earliest availability.\nDispelling the impression about any preferences, Dr. Faisal Sultan said top priority is availability, efficacy (with no or negligible side effects) and supply capacities of the companies.\nHe said six to eight companies identified by a committee of experts have been contacted.\n“Several months ago we had set-up a Committee of Experts to help identify best of the vaccine manufacturers,” said SAPM on Health.\nHe reminded that countries with strongest of the economies had placed orders worth of billions of dollars for vaccines that were still in trial phase, with little care towards the result.\nThis was not possible for the developing countries, however, we within our available resources are in process to have the best at the earliest possible time.\nTo another query, Dr. Faisal Sultan said country to meet the time frame would go for the “availability” option and these could be Chinese as well as Western vaccines.\nHe also mentioned that Pakistan along with other countries is also part of an ongoing trial program of a Chinese company with all possibilities of success and thus early accessibility.",
  "retrievedAt": "2025-08-11T20:14:37.498Z"
}
