{
  "title": "Confirmed coronavirus cases reach 1,625: Dr Mirza",
  "link": "https://www.app.com.pk/national/confirmed-coronavirus-cases-reach-1625-dr-mirza/",
  "date_published": "2020-03-30T02:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):Special Assistant to Prime Minister on National Health Services Dr Zafar Mirza on Monday said that the coronavirus caseload in Pakistan had reached 1,625 with five deaths during last 24 hours.\nIn a televised daily briefing on COVID-19, Dr Mirza said that total 21 deaths had been reported from the disease so far while 10 patients were still in critical condition.\nHe said that 32 patients had been recovered while 508 cases were reported from Sindh, 596 from Punjab, 195 from Khyber Pakhtunkhwa, 144 from Balochistan, 51 from Islamabad Capital Territory, 128 in Gilgit Baltistan and six in Azad Jammu and Kashmir.\nDr Mirza said that over 7,507 people were living in different quarantine in provinces while as many 783 confirmed patients were admitted in various hospitals out of which 773 patients were recovering.\nHe said that PCR test of 4,255 people at various quarantine had been conducted with corona positive ratio of 19% as 796 people had COVID-19 positive.\nHe added in total 1,625 confirmed corona patients, 883 patients had travel history of Iran while 247 had travel history of other countries and 29% patients had received virus in local transmission, which was gradually increasing.\nHe said that in order to encourage country’s experts or to get advantages from their expertise in combating coronavirus, the government had launched national level COVID-19 relief tigers program under which services and research proposals had been sought through Higher Education Commission (HEC).\nHe said proposals will be received by April 3 and best ideas will be financially supported and implemented at nation level. He said that the opportunity was open for researchers and common citizens.\nHe said that the government had also planned to start another program with the support of National Incubation Centre.",
  "retrievedAt": "2025-08-11T19:01:19.725Z"
}
