{
  "title": "Passenger train service to remain suspended till further orders: Sh. Rasheed",
  "link": "https://www.app.com.pk/national/passenger-train-service-to-remain-suspended-till-further-orders-sh-rasheed/",
  "date_published": "2020-03-30T00:20:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 30 (APP):Minister for Railways Sheikh Rasheed Ahmad on Monday announced that the passenger train operations would remain\nsuspended in the country.\nTalking to media persons he said that initially it was decided to resume the operations from April 1, however, the passenger rail service on the directives of the prime minister would remain suspended till further orders.\n“However, the freight train operations will continue as usual in order to ensure smooth supply of essential commodities across the country,” he said.\nThe minister said that they had made special arrangements at the railway stations for coronavirus patients.\nSeven big Railway Hospitals would also be dedicated for treating coronavirus patients, he said adding that a 50-bed quarantine had been established here while Rawalpindi Railway Hospital having capacity to accommodate 450 patients could also used to treat the virus patients.\nTo a question, he said that the cabinet meeting on Tuesday would make key decisions including provision of funds\nfor ration through ‘Ehsas programme.’\nTo another question the minister rejected any chance of curfew imposition in the country adding the masses should adopt preventive measures on their own.\n“Next 15-day are important for controlling the virus,” he said adding that the situation in Pakistan was far better than Italy or United States.\nHe said, Pakistan Railways had decided not to restore the operation of all its passenger trains on April 1, suspended throughout the country for one week, till March 31 in view of fast-spreading coronavirus outbreak.\nThe minister said, Pakistan Railways had set up a 310-bed isolation facility having a ventilator in a special coach.\nSpecial arrangements had been made at Rawalpindi, Multan, Karachi, Peshawar, Sukkar and Quetta, he said.\n“We have 1700 coaches and 570 Railways Stations including 16 new railways stations. All railways stations have toilets and water facility to wash hands properly,” he informed.\nSheikh Rashid said, 65 hospitals and dispensaries including six big hospitals of Pakistan Railways would be available for the provinces to treat coronavirus patients.\nChairman Pakistan Raialways, Habib ur Rehman Gilani, Divisional Superintendent Rawalpindi Division, Syed Munawar Shah and Chief Medical Superintendent Rawalpindi Railway Hospital Brig. (R) Dr. Waseem Ahmed Malik were present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:22.261Z"
}
