{
  "title": "Pakistan to get 1,200 ventilators from China in April: NDMA chairman",
  "link": "https://www.app.com.pk/national/pakistan-to-get-1200-ventilators-from-china-in-april-ndma-chairman/",
  "date_published": "2020-03-30T03:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):National Disaster Management Authority (NDMA) Chairman Lieutenant General Muhammad Afzal Monday said around 1,200 ventilators would be made available across the country during the month of April.\nAddressing a presser with Special Assistant to the Prime Minister (SAPM) on Health Dr Zafar Mirza and SAPM on National Security Moeed Yusuf, he said the authority was importing ventilators and personal protection equipment (PPE) from China.\nGeneral Afzal said around 5,000 sets of PPE’s, ventilators and chemical used for fumigation would be received from China during the next moth.\nHe added that 100 thermal walkthrough gates would be brought from Beijing in coming days. “It will be helpful in ensuring better arrangements at the airports. We will gradually revive international flights whereas domestic flights will remain suspended.”\nHe briefed that around 7,800 testing kits for coronavirus diagnosis were provided to Punjab, 5,000 to Sindh and 4,800 to Balochistan. “Gilgit Baltistan and Azad Jammu and Kashmir have been given medical equipment to meet with the need of doctors for 5 weeks.”\nNDMA, he said, was working to boost testing capacity of laboratories across the country. “Abbottabad and Dera Ismail Khan will soon get testing labs. Around seven machines related to lab equipment have been distributed to different areas.”\nGeneral Afzal informed that laboratories in Faisalabad and Sargodha were being upgraded to carry out coronavirus diagnosis tests.\nHe mentioned that two laboratories established in SIUT and JPNC were made operational.\nHe said medical teams could get safety equipment at one call. “NDMA’s top priority is to provide protective equipment to medical teams fighting in the frontline against the pandemic of coronavirus.”\nHe said around 150,000 medical items would be received from China before April 15.",
  "retrievedAt": "2025-08-11T19:01:16.282Z"
}
