{
  "title": "FM calls OIC SG, discusses COVID-19, developments in IOJ&K",
  "link": "https://www.app.com.pk/national/fm-calls-oic-sg-discusses-covid-19-developments-in-iojk/",
  "date_published": "2020-03-30T02:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi on Monday during a telephonic conversation with Secretary General Organization of Islamic Cooperation (OIC), Dr Yousef A. Al-Othaimeen, discussed the situation arising out of COVID-19 pandemic, OIC’s responses, and developments in the Indian Occupied Jammu and Kashmir (IOJ&K).\nStressing that the pandemic posed a grave challenge to the entire humanity, including OIC member States, the foreign minister endorsed the Secretary General’s call on Members to bring together governments, scientists and research institutions to contribute to efforts for finding solutions, a press release said.\nThe foreign minister further underscored that, as already called for by Prime Minister Imran Khan, the current crisis made for a compelling case for debt relief and restructuring for developing States, as a means to enable them to divert resources to save lives and shore up economies.\nThe OIC, together with the Islamic Development Bank, needed to play an effective role in helping members cope with the challenges, he added.\nQureshi further highlighted the implications of the rising wave of “Hindutva ideology” in India, as reflected in the systematic violence and targeted killings of Muslims in New Delhi in February 2020.\nWith regard to IOJ&K, he highlighted that continued restrictions on communication and movement in IOJ&K were preventing unfettered supply of medicines and other essentials, as well as dissemination of information needed to combat the disease.\nIn this context, he noted the significant number of coronavirus affected persons and two deaths reported in IOJ&K.\nThe foreign minister highlighted concerns regarding the possibility of spread of COVID-19 among the large number of Kashmiri youth incarcerated by India.\nHe further noted that the senior Hurriyat leadership was under detention at homes or in different prisons. Yasin Malik, already suffering from deteriorating health, has threatened an indefinite hunger strike to protest a false charge-sheet by the Indian government on a 30-year old case.\nQureshi also highlighted India’s attempts to change the demographic structure in IOJ&K. In this regard, he drew attention to forcible confiscation of properties of Kashmiris and allocation of over 6,000 acres of land to non-Kashmiris in clear violation of international law, including the 4th Geneva Convention.\nForeign Minister Qureshi also conveyed Pakistan’s appreciation for the recent visit by the Secretary General’s Special Envoy on Jammu and Kashmir, Ambassador Yousef Aldobeay, to Pakistan and Azad Jammu & Kashmir, and said that it underscored OIC’s commitment to the just cause of Kashmir.\nWhile appreciating OIC’s principled position on these issues, the Foreign Minister underlined the importance for the OIC and the Secretary General to continue taking them up, including at other international fora as well.",
  "retrievedAt": "2025-08-11T19:01:19.286Z"
}
