{
  "title": "Military stand with nation in every crucial time : GOC Maj Gen",
  "link": "https://www.app.com.pk/national/military-stand-with-nation-in-every-crucial-time-goc-maj-gen/",
  "date_published": "2020-03-30T01:45:00.000Z",
  "source": "APP",
  "content": "ATTOCK, Mar 30 (APP):General Officer Commanding (GoC) Major General Majid Jehangir reviewed the anti-Coronavirus Disease (COVID-19) measures taken by the health department and local administration in district Attock.\nOn this occasion Commissioner Rawalpindi Captain (retd) Muhammad Mehmood, Deputy Commissioner Attock Ali Annan Qammar, District Police Officer Khalid Hamdani and officials of health department, local administration and army were also present on this occasion. During his visit, he checked the preparedness of the administration to meet any challenge in wake of outbreak of Coronavirus Disease (COVID-19) in district Attock. He visited the COVID-19 control room established to monitor the situation in the district besides checking the facilities available at isolation wards established in District Headquarters Hospital.\nMajor General Majid Jehangir also attended a briefing at Deputy Commissioner office.Deputy Commissioner Attock Ali Annan Qammar briefed the participants about current statistics, action taken, issues and future planning of district.\nChief Executive Officer District Health Authority Dr. Sohail Ejaz on the occasion highlighted the geographical sensitivity of district as bordering with KP at one side and Rawalpindi on other and prominent mean of public transport through GT road and motorway, KP to Punjab and suggested authorities for activation of permanent transit posts for strict monitoring of commuters with vision to stop transmission of suspected or positive cases as WHO have rule regarding EPI.Commissioner Rawalpindi Captain (retd) Muhammad Mehmood urged for a database by profiling of Health professionals, volunteers, 1122, paramedics etc who could help in any emergency situation.\nHe also described road map for future and directed concerned authorities for action especially to define District hotspots areas of different cultural/ethnic backgrounds, more focus on sensitive areas and ensuring lock down to overcome burden of disease, defined burial plan and training of staff as per SOPs, defined comprehensive HR plan for medical staff, janitorial staff, security staff and support staff considering emergency situation in case of need base only, define rational threshold plan for patients admission at different levels, – Increase patients capacity at least by 30 percent.\nDr Asad Ismail, District Health Officer preventive services briefed the participants about track ,trace and treat with on line data submission and being in charge of preventive services briefed about district and tehsil rapid response teams and how many screening done and how they are working.\nMajor General Majid Jehangir lauded the efforts of district administration and health authorities to curtail the Corona virus disease (COVID-19) epidemic in the district. He also praised the dedication of health staff deputed at isolation ward and said military stood with nation in every crucial time and ready to support all the functionaries to meet any challenge.\nLater General Majid Jehangir also visited Village Gharibwal of Tehsil Pindi Gheb in Attock district where first case of Corona Virus has been confirmed with a number of suspected in Attock district. He also attended briefing about measures from local administration there.",
  "retrievedAt": "2025-08-11T19:01:20.304Z"
}
