{
  "title": "Coronavirus testing kits, ventilators to hit country markets soon: Fawad Ch",
  "link": "https://www.app.com.pk/national/coronavirus-testing-kits-ventilators-to-hit-country-markets-soon-fawad-ch/",
  "date_published": "2020-03-29T20:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):Federal Minister for Science and Technology Fawad Chaudhry Monday hoped that the locally manufactured ventilators and testing kits would hit the country market soon that were previously manufactured only by China and other countries to fights the coronavirus.\nThe coronavirus testing kits developed by Pakistan’s National University of Science and Technology (NUST) have been handed to the Drug Regulatory Authority of Pakistan (DRAP) for final approval, he said while talking to private news channel.\nSimilarly, the Pakistan Engineering Council (PEC) has developed ventilators, in collaboration with NED and Pakistan Engineering Board, which will be handed over to DRAP this week.\nThe minister said that he is in talks with various ministries and hopes that the products will hit the market in the coming days.\n“Two initiatives of the Ministry of Science and Technology are in final stages of approval 1) coronavirus testing kits (NUST) 2) ventilators (PEC) this will immensely bring down costs of war against coronavirus”, he added.\n“At this time, a coronavirus testing kit is available at the cost of Rs7,000 to Rs8,000. Moreover, a detection test will not be fruitful until it is properly conducted by the medics”, he added.\nThe minister said that Prime Minister Imran Khan directed all authorities to rapid act upon the developments regarding the coronavirus pandemic across the country.\nFawad Chaudhry further said that the steps related to acquiring testing kits and ventilators were taken prior to the latest situation.\nWhile commenting on the provision of relief to the nationals, Fawad Chaudhry said he has prepared a list of deserving families present in his constituency in order to help them.",
  "retrievedAt": "2025-08-11T19:01:24.341Z"
}
