{
  "title": "PM, Sheikh Ahmad exchange views on enhancing bilateral cooperation between Pakistan, Kuwait",
  "link": "https://www.app.com.pk/global/pm-sheikh-ahmad-exchange-views-on-enhancing-bilateral-cooperation-between-pakistan-kuwait/",
  "date_published": "2024-06-17T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 17 (APP): Prime Minister Muhammad Shehbaz Sharif and Prime Minister of the State of Kuwait Sheikh Ahmad Abdullah Al-Ahmad Al-Sabah on Monday exchanged views on enhancing bilateral cooperation in various fields, including trade, investment, energy, and export of skilled labour.\nThey also discussed regional and global issues of mutual interest, reaffirming their commitment to working closely together for the advancement of shared goals and objectives.\nThe prime minister extended warm Eid-ul-Adha greetings to Sheikh Ahmad Abdullah Al-Ahmad Al-Sabah, Prime Minister of the State of Kuwait in a cordial telephone conversation, PM Office Media Wing said in a press release.\nThis was the first interaction between the two prime ministers since the Kuwaiti Prime Minister assumed office in April this year.\nOn this auspicious occasion, the prime minister conveyed his sincere wishes and prayers for peace, prosperity and happiness of the brotherly people of Kuwait as well as Muslims around the world.\nDuring their conversation, the two prime ministers reaffirmed the significance of the deep-rooted fraternal ties between Pakistan and Kuwait, characterized by mutual respect, shared values, and common religious heritage.\nTracing the historic ties between both countries who had always stood by each other, especially in difficult times, Prime Minister Shehbaz Sharif recalled that former Prime Minister Muhammad Nawaz Sharif had visited the then Amir of Kuwait when the Government of Kuwait was temporarily based in Taif due to Iraq’s forcible occupation in 1990-91.\nThis gesture of solidarity bore testament to the close and enduring ties between both countries.\nIn response, the prime minister of Kuwait reciprocated the warm sentiments and expressed appreciation for the longstanding friendship and cooperation between the two brotherly nations.\nWhile referring to the Pakistani diaspora in Kuwait, the prime minister thanked the Government of Kuwait for hosting a large Pakistani community who were gainfully employed and contributing to the economic development of both countries.",
  "retrievedAt": "2025-08-11T03:19:34.394Z"
}
