{
  "title": "CDA launches massive post-Eid cleanliness drive",
  "link": "https://www.app.com.pk/national/cda-launches-massive-post-eid-cleanliness-drive/",
  "date_published": "2024-06-17T11:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): The Capital Development Authority (CDA) on Monday initiated an extensive in the capital city to remove all sacrificial animal remains and collect thousands of tons of waste generated during Eid-ul-Adha.\nThe CDA spokesman stated, “Over 2,500 personnel and more than 200 vehicles and machines are deployed in the field to remove garbage and animal waste from every nook and cranny of the city.”\nThe Authority, along with Islamabad Administration and Islamabad Police, is jointly participating in a special cleaning operation to ensure a clean festival and to prevent inconvenience for people traveling in the city. The plan will continue through the second and third days of Eid-ul-Adha.\nThe Deputy Commissioner is overseeing all arrangements. The operation is being monitored from the central control room located in Islamabad Safe City, sector H-11.\nHe said, “Two emergency centers are operational at the Sanitation Directorate in G-6/1-4 and at Fire Headquarters in G-7/4.”\nCDA has distributed biodegradable bags to citizens for the first time, intended for disposing of animal waste. These bags naturally decompose into waste over time.\nThe CDA administration has instructed the public to use biodegradable bags for disposing of sacrificial animal waste and to ensure it is placed in designated areas.\nCDA urged the public not to throw animal waste in drains, forests, etc., and advised against putting offal in dustbins and garbage trolleys. Violations will be followed by legal action.\nCitizens can call the sanitation helpline numbers 1334 or 9213908 and also contact 9203216, 9211555, or 9223171 to report issues or complaints related to urban sanitation.\n“Citizens can send messages via WhatsApp or SMS to the number 0335 5001213. Efforts are underway to promptly address all received complaints,” the spokesman said.\nChairman of CDA and Chief Commissioner Muhammad Ali Randhawa said, “Achieving the desired outcomes relies heavily on citizens’ full cooperation and the strict implementation of the provided guidelines.”\nHe directed all relevant officers to be present in the field and ensure cleanliness standards.\nThe chairman stressed the importance of providing support from the control room to the field staff and instructed the ICT, CDA, and police to collaborate effectively in delivering top-notch facilities to citizens.\nThe chairman of CDA, Muhammad Ali Randhawa, also conveyed Eid greetings to all the residents of Islamabad on his behalf.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:19:58.083Z"
}
