{
  "title": "Rs. 125.54 billion disbursed among deserving persons under Ehsaas Emergency Cash Program",
  "link": "https://www.app.com.pk/national/rs-125-54-billion-disbursed-among-deserving-persons-under-ehsaas-emergency-cash-program/",
  "date_published": "2020-06-15T23:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP):The Ehsaas Emergency Cash programme has disbursed over Rs.125.54 billion among more than 10,329,000 beneficiaries under different categories so far since start of the payment process.\nThe programme was initiated to disburse cash amount of Rs. 12,000 among those affected from the Coronavirus lockdown. The payment process under different categories of the programme was continued across the country.\nAccording to the cash update received by official source on June 16, a total of over Rs. 54.70 billion has been disbursed among over 4,509,000 deserving families in Punjab so far while around Rs. 37.13 billion has been disbursed among 3,075,000 families in Sindh.\nOver Rs. 23.61 billion has been disbursed among more than 1,921,000 beneficiaries in Khyber Pakhtunkhwa while over Rs. 6.33 billion has been disbursed among 520,000 persons in Balochistan.\nIn Azad Jammu and Kashmir, over 2.19 billion have been distributed among 177,000 persons while Rs. 910 million has been distributed among more than 73,000 people in Gilgit Baltistan.\nAn amount of Rs. 640 million has been disbursed among more than 53,000 beneficiaries in Islamabad.\nThose beneficiaries having problems regarding their bio-metric verification will be able to receive their payments from the designated banks without going to the National Database Registration Authority (NADRA).\nHabib Bank in Punjab, Sindh and Balochistan, Bank Al-Falah in Khyber Pakhtunkhwa, Gilgit-Baltistan and Azad Jammu and Kashmir will provide services to the beneficiaries.\nAll such beneficiaries will receive the message from 8171 again of receiving their payments with mentioning bank name, address and date.\nThe beneficiaries should visit the relevant bank branch to receive their payments after receiving the message and keep their Computerized National identity Cards (CNICs) and cell phone with them.",
  "retrievedAt": "2025-08-11T19:20:58.632Z"
}
