{
  "title": "Provinces apprise NCOC on smart lockdowns, enforcement measures based on TTQ",
  "link": "https://www.app.com.pk/national/provinces-apprise-ncoc-on-smart-lockdowns-enforcement-measures-based-on-ttq/",
  "date_published": "2020-06-16T03:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP):The National Command and Operation Centre (NCOC) on Tuesday was apprised by the provinces including Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB) on smart lockdowns and enforcement measures in various areas across the country based on Trace, Test and Quarantine (TTQ) strategy.\nAccording to NCOC, more than 1512 markets and shops, 14 industries and 1466 transport vehicles were warned, fined, sensitized and sealed. It said that during the past 24 hours more than 12,400 violations of health guidelines and instructions were observed across the country.\nIn line with the prime minister’s instructions for compliance to health guidelines and instructions particularly working places, industrial sector, transport, markets and shops whereas NCOC daily morning situational brief was in progress where the provincial chief secretaries of all the provinces including AJK, GB and ICT representatives were participating through video link.\nTo ensure the implementation of the health guidelines and instructions and preventive measures including wearing of face mask in public as per WHO new guidelines on the subject particular special teams were operating all across the country to ensure that the standard operating procedures (SOPs) were being implemented.\nThe details of violations of health guidelines across the country and enforcement measures as under as in Azad Jammu and Kashmir (AJK) 865 violations were noted and around 153 shops and markets sealed and 321 transport vehicles were fined.\nIn Gilgit Baltistan (GB), around 218 violations were noted whereas 48 markets and shops were sealed and 53 transport vehicles were fined.\nIn Khyber Pakhtunkhwa (KP), around 5336 violations were noticed whereas in consequence 257 shops and markets were sealed, 104 transport vehicles wede fined.\nIn Punjab, 3682 violations of safety guidelines were witnessed in different parts of the province and 655 shops and markets were closed, 7 industries sealed and 834 transport vehicles were also fined on violations.\nIn Islamabad Capital Territory (ICT), as many as 364 violations of SOPs and safety guidelines were noted where in its consequence 154 shops, 147 transport vehicles were fined for flouting the safety and health guidelines.\nIn Sindh, 860 violations were noted whereas in consequence 41 shops and markets were sealed and 7 transport vehicles were fined on violating health guidelines.\nIn Balochistan as many as 1,075 violations of safety guidelines were observed and 104 shops and markets were sealed for violating safety protocols.",
  "retrievedAt": "2025-08-11T19:20:54.123Z"
}
