{
  "title": "NUML signs MoUs with NADRA, Dream Sports Group to foster research and youth engagement",
  "author": null,
  "content": "ISLAMABAD, May 24 (APP):The National University of Modern Languages (NUML) on Saturday signed two Memorandums of Understanding (MoUs) with the National Database and Registration Authority (NADRA) and Dream Sports Group Pvt Ltd, marking a strong step forward in promoting research, innovation and youth development through collaborative efforts.\nThe MoU between NUML and NADRA aims to foster cooperation in innovative research projects and the exchange of expertise in areas of mutual interest.\nBoth institutions agreed to jointly determine the scope and subject of collaborative research and development activities, in alignment with their respective objectives.\nThe agreement was signed by Director General NUML, Brigadier Shahzad Munir, and TL (SID) NADRA, Dr. Qamar Farooq.\nIn another key development, NUML also partnered with Dream Sports Group Pvt Ltd to promote sports and healthy activities among the youth.\nThe MoU, signed by DG NUML Brigadier Shahzad Munir and Ch Qaiser Iqbal Baryar,\nChairman Dream Sports Group underscores the importance of engaging students in physical and extracurricular development.\nRector NUML, Major General Shahid Mahmood Kayani (Retd), graced both signing ceremonies with his presence. He appreciated the initiatives and expressed hope that these collaborations will lead to meaningful outcomes, particularly in the fields of research, innovation, and youth empowerment.\nNUML remains committed to expanding its collaborative horizons and providing its students and faculty with new opportunities for growth and engagement through strategic partnerships.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:51:29.994Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/numl-signs-mous-with-nadra-dream-sports-group-to-foster-research-and-youth-engagement/",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T12:38:00.000Z"
}
