{
  "title": "NA body raises concerns on MDCAT irregularities",
  "link": "https://www.app.com.pk/national/na-body-raises-concerns-on-mdcat-irregularities/",
  "date_published": "2024-10-11T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): The National Assembly Standing Committee on National Health Services, Regulations and Coordination on Friday raised serious concerns over the reported irregularities in the MDCAT examination result, 2024.\nThe committee also raised concerns over the inconsistencies in the Medical and Dental College Admission Test (MDCAT) 2024 results.\nThe committee voiced apprehension over the alarmingly high scores, with the top students achieving 199 out of 200 marks in the admission test.\nThis unprecedented result had prompted questions about the integrity of the examination process, pointing towards potential discrepancies within the system.\nThe meeting which was held under the Chairmanship of Dr. Mahesh Kumar Malani, MNA, emphasized that the MDCAT’s credibility and fairness are critical to the future of Pakistan’s aspiring medical and dental students.\nThe committee stressed the importance of addressing the concerns of both students and their parents, noting that the issue was currently under review by the Sindh High Court.\nThe committee recommended several reforms aimed at restoring confidence in the MDCAT examination process. One key recommendation was making complete FSC result a mandatory criterion for eligibility in the MDCAT.\nThe committee proposed that all educational boards should conduct their exams earlier, allowing students to appear in the MDCAT based on their final board results, ensuring more accurate assessments.\nThe committee also took a firm stance on universities found to have involved in discrepancies in the MDCAT process, suggesting that they should not be given the opportunity to conduct the exam again in the future.\nTo prevent future issues, the committee proposed that a centralized committee should be made be responsible for creating the examination paper, with accountability measures in place in case of errors or discrepancies.\nThe committee called for the implementation of IT-based systems to enhance the transparency and efficiency of the exam process.\nA detailed post-hoc analysis of MDCAT results provided by various universities revealed significant inconsistencies with UHS Lahore and DUHS Karachi with the highest score of 199.\nGiven these results the committee suggested that if allegations of misconduct were proven true, a re-conduct of the MDCAT exams should be considered to safeguard the interests of the students.\nThe meeting concluded with a call for swift and decisive action to ensure the integrity of future MDCAT exams and restore the trust of students, parents and educational institutions alike.",
  "retrievedAt": "2025-08-10T20:00:03.146Z"
}
