{
  "title": "Tarar rules out any negotiation rumours with PTI",
  "link": "https://www.app.com.pk/national/tarar-rules-out-any-negotiations-rumours-with-pti/",
  "date_published": "2024-11-23T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP):Federal Minister for Information, Broadcasting, National Heritage, and Culture, Attaullah Tarar, on Saturday stated categorically that no negotiations are being held at any level with Pakistan Tehreek-e-Insaf (PTI).\nAddressing a news conference, Tarar said that Interior Minister Mohsin Naqvi, following Islamabad High Court (IHC) orders, contacted PTI Chairman Barrister Gohar to convey that protests or sit-ins in the federal capital were illegal.\nTarar warned that those participating in violent protests would be arrested and held accountable for any damage, as the government would not tolerate actions jeopardizing public safety. The minister said protests are illegal and disrupting public life will have consequences, stressing the government’s commitment to law and order.\nHe said that PTI aims to create divisions between friendly countries. It’s baffling that a protest is called on the same day a friendly country seeks to enhance cooperation with Pakistan, he maintained.\nHe stated that PTI and the country’s enemies share the same goal of hindering economic progress. He mentioned that Belarus is Pakistan’s close ally, and preparations have been finalized to welcome the president of Belarus in Islamabad.\nHe noted that similar protests and sit-ins occurred during the 2014 visit of the Chinese president and the SCO summit.\nHe said Belarus and Pakistan are planning to jointly manufacture tractors. “While the administration prepares to welcome Belarusian guests, it is also ensuring citizen security. Can the system function effectively under such conditions?”, he questioned.\nHe warned that officers involved in political activities will face strict action.\nHe said the investment is flowing into Pakistan, the economy is growing, inflation has dropped from 32% last year to 6.9% this year, and foreign remittances totalled $8.8 billion in the first quarter. The economy is improving due to lower interest rates, and these figures cannot be disputed.\nHe said Pakistan’s stock market is the second-best performing in the world, and its growth reflects improvements in economic indicators.\n“37 people were killed in Kurram Agency, but the Khyber Pakhtunkhwa Chief Minister did not visit to console the people. How could the Chief Minister forget Parachinar’s pain?”, the minister stated adding that said Pakistan Army soldiers are sacrificing to protect the people, while Khyber Pakhtunkhwa police need better training against terrorism.\nHe said that the province must focus more on law and order, as terrorism persists, even around Adiala Jail.\nResponding to a question, he said PTI is divided into the Aleema, Nooreen, and Bushra Bibi groups. He called it a melodrama between “Nand” and “Bhabhi”.\nThe country they once sought gifts from is now speaking against them, the minister said and condemned PTI members for the disgraceful protest at the Prophet’s (PBUH) Mosque, questioning if they remembered Sharia when raising slogans there.\nIn response to another question, he said PTI has continually caused chaos and tried to harm relations with friendly countries. Bushra Bibi doesn’t even know how to spell “international relations”, the minister remarked.\n“PWD was closed due to corruption, while we are advancing toward digitization and billions of rupees have been saved through anti-smuggling efforts”, the minister underlined.\nResponding to another question, he said the Pak Army is sacrificing in the fight against terrorism, while the Khyber Pakhtunkhwa Chief Minister shows no concern for law and order. He condemned PTI supporters for setting fire to trees in Islamabad and noted that the Apex Committee had warned such actions wouldn’t be tolerated.\nThe minister said that public anger is growing, and one day, people of Khyber Pakhtunkhwa will hold them accountable. He stressed that if PTI wants to protest, it should be in Khyber Pakhtunkhwa, as attacks on the federation won’t be tolerated.\nHe also claimed they aim to drop bodies as part of a plan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:34:17.953Z"
}
