{
  "title": "Govt taking steps to empower women: Shaza Fatima",
  "link": "https://www.app.com.pk/national/govt-taking-steps-to-empower-women-shaza-fatima/",
  "date_published": "2023-03-07T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Special Assistant to the Prime Minister (SAPM) on Youth Affairs, Shaza Fatima Khawaja Tuesday described women as an integral part of national development and said that the incumbent government is taking several steps for empowering women aiming to strengthen their role in society.\nAddressing a seminar titled “Innovation and Technology for Gender Equality” held here in connection with International Women’s Day, the SAPM said that under the Digiskills program, the government is conducting fee courses for men and women without any discrimination which is changing the lives of thousands of people.\nShe said aiming to equip women with the latest digital skills Punjab Government introduced the first digital policy program in Pakistan titled ‘ICT for Girls’ in 2008.\nShah Fatima Khawaja said that in 2008, Prime Minister Shehbaz Sharif, who was the Chief Minister at that time, had given 5 million laptops and internet devices to the students with an aim of promoting digital education and providing opportunities to the young generation to work from home.\nThese laptops became a source of employment for the youth during Covid -19 pandemic, she added.\nShe said that the government is making every possible effort to impart skills among the youth and organizing bootcamps with the objective to promote entrepreneurship culture among the youth.\nThe SAPM said that the government has re-launched the laptop scheme, under which 0.1 million laptops will be distributed among the students.\nShe said that various short courses will also be conducted in which equal importance will be given to men and women.\nSpeaking at the occasion, the founder of Euro Industries, Shamama Arbab said that only 22 percent of women in Pakistan can use Internet.\nShe said that due to the online cyberspace harassment, lack of family support and other similar problems, women representation in online digital entrepreneurs is insufficient.\nShe said that we all have to play our role to empower women and housewives should be given equal opportunities to in all fields of life.",
  "retrievedAt": "2025-08-11T06:18:21.276Z"
}
