{
  "title": "Nawaz conviction brought disaster to Pakistan: Maryam",
  "link": "https://www.app.com.pk/national/nawaz-conviction-brought-disaster-to-pakistan-maryam/",
  "date_published": "2023-03-07T17:43:00.000Z",
  "source": "APP",
  "content": "SHEIKHUPURA, Mar 7 (APP):Pakistan Muslim League-Nawaz (PML-N) Senior Vice President and Chief Organiser Maryam Nawaz said on Tuesday that all those involved in illegal conviction of Nawaz Sharif had met their ultimate fate.\nSpeaking at PML-N workers convention here, she said that Nawaz Sharif had left the matter of the injustice committed to him to Allah Almighty.\nAnd today, all those hatching conspiracies against him were themselves admitting that injustice was committed to the former prime minister, she added.\nReferring to former chief justice Saqib Nisar’s press talk the other day, she said he had not spoken the full truth yet, but soon he would tell the nation who were other characters involved in the conspiracy hatched against Nawaz Sharif.\nShe said those who were bestowed with the quality of speaking the truth, do it in their life like Nawaz Sharif, and those who had ever told lies say that they would tell the truth in their posthumously published book.\nShe said deposing of Nawaz Sharif for life brought economic disaster and miseries to the people of Pakistan.\nFlaying former CJP’s claim that his whatsapp account was hacked, she said it was not Saqib Nisar’s account which was hacked, but it was the future of Pakistani youth which was hacked due to his wrong decisions.\nCalling PTI chairman Imran Khan a coward and a ‘jackal’ she said judiciary at that time supported him and people were facing unprecedented price hike due to those wrong decisions.\nCiting the statement of Saqib Nisar, she said those behind such wrong decisions should have thought of the Pakistani children like their own children while giving rulings in their favourite.\nMaryam Nawaz said that Nawaz Sharif was convicted for not taking salary from his son, and on the basis of an expired iqama. But Imran Khan committed theft of toshakhana gifts and his wife received jewellery and other gifts for getting illegal works done by her husband.\nShe said why a watch thief could not be convicted and sent to jail if Nawaz Sharif could be convicted for not receiving salary from his son. She said the PTI chairman concealed billions of rupees he had made through corruption and theft of toshakhana gifts, adding that he not only concealed gifts but also his daughter from the people of Pakistan.\nThe PML-N leader said a man who is not in his senses most of the time was imposed on the people of Pakistan. An injustice was committed with the 220 million Pakistanis by making Imran Khan prime minister of the country. She said Imran was not only incompetent but also a coward person.\nShe said even today his lawyer told the court that he (Imran Khan) could not appear in the court as his leg was still under plaster cast. She said Imran must have borrowed some bravery from Nawaz Sharif.\nThe PML-N chief organiser said there was no comparison between Imran Khan and Nawaz Sharif. The PML-N supremo came to Pakistan from London like a ‘lion’ to appear before courts, along with his daughter.\nBut Imran Khan was escaping from courts even while sitting in Lahore. She said how come this coward person could compete with the PML-N supremo when he was even unable to compete with a female PML-N activist.\nShe said sarcastically that when the police reached to arrest the coward person, he hid himself under a charpoy.\nMaryam Nawaz said that she was also convicted, though she never held any public office.",
  "retrievedAt": "2025-08-11T06:17:53.033Z"
}
