{
  "title": "Minister for developing strong voice of civil society in support of policy continuity",
  "link": "https://www.app.com.pk/national/minister-for-developing-strong-voice-of-civil-society-in-support-of-policy-continuity/",
  "date_published": "2023-03-07T10:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Minister for Planning, Development and Special Initiatives Ahsan Iqbal on Tuesday called for developing a strong voice of the civil society and the common citizens in support of positive reforms especially in the education sector to ensure continuity of policies despite changes in the governments.\n“Our civil society and citizens need to be given ownership of the reforms and the policies, if we can develop a strong voice of our citizens, they can probably guarantee that if there is political change, they can use their voice to tell the new government that we want to follow this policy and it should not be thrown out,” he said while addressing a two-day event titled “Decade of Learning” organized by the British High Commission Islamabad here.\nAhsan Iqbal recalled that he as a minister of planning had moved a Vision 2025 setting ambitious but achievable targets to be attained by 2025 but after the change of government, the new government has thrown the whole agenda out of the window.\nHe said the lack of stability and continuity of policies was one of the major challenges in Pakistan’s development process.\nThe minister said he was also in support of managing the education and health sectors are district level to promote professionalism in the sectors.\nFor this, he said each district should have a brilliant and highly professional person either from the government or from the private sector as a chief executive of the respective sectors.\nHe said this move would also develop a culture of competition among the districts.\n“We are not poor in policy-making but the real challenge is implementation”, he said adding that lack of implementation of the policies and poor management system has led to poor performance in the public sectors.\nAhsan Iqbal said he also had asked the education minister to hold a national summit to discuss and propose curriculum reforms, measures to improve the exams system, and teachers.",
  "retrievedAt": "2025-08-11T06:18:30.483Z"
}
