{
  "title": "PM reiterates commitment to eradicate all forms of polio",
  "link": "https://www.app.com.pk/national/pm-reiterates-commitment-to-eradicate-all-forms-of-polio/",
  "date_published": "2023-03-07T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP):Prime Minister Muhammad Shehbaz Sharif on Tuesday stressed that Pakistan remained committed to ending all forms of polio in the country.\nThe prime minister had a telephone call with Co-Chair of the Bill & Melinda Gates Foundation (BMGF) Bill Gates, the PM Office Media Wing said in a press release.\nThe prime minister appreciated the valuable support extended by the BMGF to Pakistan in polio eradication and improving immunisation, nutrition and financial inclusion, particularly during the recent floods.\nHe also reaffirmed Pakistan’s desire to further strengthen the fruitful partnership with the Foundation in all the ongoing areas of cooperation.\nWhile expressing concern over reporting of new cases in 2022 after one year without any polio case, he noted that there had been a pause in polio cases since September 2022.\nIn light of the last year’s devastating floods, which had adversely affected the ongoing polio vaccination efforts due to large-scale displacements and destruction of healthcare infrastructure, the prime minister emphasized that the government was actively implementing the special emergency response plan and would continue to find and adopt ways to reach out to children in such times.\nHe apprised Gates of the efforts of the federal minister for national health services and his team to eradicate polio from the country and appreciated those efforts.\nBoth sides also discussed other government-led programmes, supported by the BMGF, to address malnutrition and stunting, essential immunization services, micropayment gateway RAAST, and digitalization of the National Savings Programme.\nGates acknowledged Pakistan’s efforts to eradicate polio, while reiterating his Foundation’s continued support to Pakistan in its aim to ensure that no child would be at risk of paralysis due to poliovirus.\nBoth sides agreed to continue working together on the shared objectives.",
  "retrievedAt": "2025-08-11T06:17:57.177Z"
}
