{
  "title": "Imran Khan to indicted in Toshakhana case on March 13",
  "link": "https://www.app.com.pk/national/imran-khan-to-indicted-in-toshakhana-case-on-march-13/",
  "date_published": "2023-03-07T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP): The district court on Tuesday summoned Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan in personal capacity on March 13 for indictment in the Toshakhana case.\nAdditional Sessions Judge Zafar Iqbal took three recessions during the hearing of the case filed by the District Election Commissioner Islamabad as Imran Khan’s appeal against the issuance of his non-bailable warrants was being heard by the Islamabad High Court.\nWhen the court was told about the suspension of Imran Khan’s arrest warrants by the IHC, it issued a summon notice for the accused for indictment on March 13.\nEarlier, during the hearing, the judge indicated for fixing the case on March 9, as Imran Khan was going to appear before the high court on the same date, and he would issue orders to the Islamabad Police and Interior Ministry for security arrangements.\nThe private security team of the PTI chief could review the security arrangements at the district courts, he added.\nImran Khan’s lawyer Sher Afzal Murawat pleaded that his client could not appear before the court due to certain reasons. Imran Khan had repeatedly highlighted security threats to his life and moreover, his appearance in court would put the lives of citizens, lawyers and judges at risk as well, he added.\nThe judge, however, observed that it was the court’s responsibility to ensure security arrangements.\nEarlier, the judge also asked about the guarantor on the non-appearance of Imran Khan. The guarantor was bound to produce the accused before the court, he observed.\nThe ECP lawyer said the legal team of Imran Khan should have informed about the non-appearance of the accused in the morning to avoid wastage of time.\nImran Khan’s lawyer prayed the court to adjourn the case till next week, citing the health issues of his client.\nBarrister Mohsin Shahnawaz Ranjha requested the court to fix the case for March 9 as the PTI chief would surely appear before the IHC on that day.\nThe court held recessions three times due to the hearing of IHC bench in the case and later summoned Imran Khan on March 13, after the high court issued verdict.",
  "retrievedAt": "2025-08-11T06:18:02.749Z"
}
