{
  "title": "IK’s indictment inevitable come what may: Tarar",
  "link": "https://www.app.com.pk/national/iks-indictment-inevitable-come-what-may-tarar/",
  "date_published": "2023-03-07T10:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Special Assistant to the Prime Minister on Interior Attaullah Tarar Tuesday said PTI chairman Imran Khan would have to face indictment in the Toshakhana case at every cost as it was a fit case of ‘technical money laundering and ‘undervaluation’ of foreign gifts he received as prime minister during three-and-a-half-year period.\nAddressing a news conference here, he said Imran Khan was fearful of his arrest, but the indictment had to be done and now it was up to him to face it cowardly or gracefully.\nHe alleged that the PTI chief committed billions of rupees in ‘technical money laundering as he used Farah Gogi for transporting precious foreign gifts abroad.\nExplaining the modus operandi, he said Farah Gogi was used to transport the precious gifts abroad for selling purposes, adding “if a person wears a Rs one billion wristwatch or Rs 500 million bracelet onboard a flight, no immigration staff will ask for their value.”\nAttaullah Tarar appealed apex court for the Toshakhana case’s live broadcast, and said it was unfortunate that the Pakistan Tehreek-e-Insaf chairman remained using delaying tactics to avoid appearing before the courts.\nHe said if Imran Khan failed to appear before the court, the government would follow the instructions of the court and ensure producing him before the court.\nHe urged Imran Khan to appear before the courts wherever he had been summoned and defend himself in a legal way.\nHe said Imran Khan was scared of facing cases and imprisonment because he had been involved in crimes of stealing gifts from Toshakhana and others.\nHe said fake receipts were arranged by Imran Khan from a local trader in Islamabad for the Toshakhana gifts sold out abroad, which was also a crime.\nAttaullah Tarar said that an amount of Rs 1.6 billion was embezzled and transacted into the accounts of Farah Gogi, a close aide of Imran’s wife Bushra Bibi.\nThe SAPM said all this amount was bribed money for which 10-12 accounts were opened to keep it.\nHe said a huge amount was received for the posting and transfers in the Punjab province in connivance with the wife of Usman Buzdar, Bushra Bibi and Farah Gogi. All of them would have to face accountability for the embezzlement of the national wealth, he added.",
  "retrievedAt": "2025-08-11T06:18:21.189Z"
}
