{
  "title": "IHC directs Imran Khan to appear before trial court on March 13",
  "link": "https://www.app.com.pk/national/ihc-directs-imran-khan-to-appear-before-trial-court-on-march-13/",
  "date_published": "2023-03-07T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP):The Islamabad High Court (IHC) on Tuesday suspended the non-bailable arrest warrants against PTI chairman Imran Khan and directed him to appear before the trial court on March 13, in the toshakhana case.\nChief Justice Aamer Farooq announced the verdict which was earlier reserved on the petition challenging the decision of the session court.The court remarked that the accused had to appear before the court in a personal capacity for indictment in the case.\nThe chief justice remarked that the warrants were issued just to produce the accused before the court to run the case trial, adding that the bench wouldn’t pass any out-of-practice order. Imran Khan should have appeared before the court, he said.\nJustice Farooq questioned how the court should summon the accused if he was not appearing. He observed that Imran Khan could appear before the lower court as well on March 9, as he was going to appear before the high court on the same date.\nAddressing the lawyers, the chief justice remarked that they wouldn’t get anything here as per merit and asked the counsels to provide a date regarding the appearance of the accused. He further observed that the high court was receiving threats on daily basis, adding whether the courts should stop working on this excuse.\nThe chief justice remarked that it had to be viewed what happened in high court premises on the last hearing as there was a crowd where no one knew the intention of anyone. When they would bring 2,000 people things could go wrong, he added.\nJustice Aamer Farooq said that whether the petitioner could submit an affidavit regarding his appearance before the court, adding that Imran Khan didn’t appear even today before the trial court. The court asked the lawyers to be fair with the system instead of making fun of it or the court should grant two months date while stopping the trial.\nBarrister Mohsin Shahnawaz Ranjha prayed to the court to dismiss the appeal of Imran Khan. He said that the police could produce the accused before the trial court in foolproof security if he surrendered.\nImran Khan’s counsel Qaiser Imam argued that there were severe life threats to his client during his appearance in F-8 Kachehri. He said that the trial court had granted twice exemptions to his client from appearance. He said that he had consulted with Imran Khan, and he was ready to appear within four weeks.\nHe prayed the court to set aside the decision of the lower court and suspend the arrest warrants against PTI’s head.\nAdvocate General Islamabad said that Imran Khan didn’t want to face the trial.The court earlier reserved the verdict and later ordered Imran Khan to appear before the trial court on March 13.",
  "retrievedAt": "2025-08-11T06:17:56.043Z"
}
