{
  "title": "NA Speaker calls for simultaneous elections across Pakistan",
  "link": "https://www.app.com.pk/national/na-speaker-calls-for-simultaneous-elections-across-pakistan/",
  "date_published": "2023-03-07T11:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP):National Assembly Speaker Raja Pervaiz Ashraf has called for general elections across the country to be held on the same day, stating that Parliament was ready to play its role in this regard.\nHe was speaking to media representatives at an event on “Policy Dialogue on Climate Smart Agriculture and Food Security: Challanges and Way forward for Pakistan,”. The event was organized by the Pakistan Institute of Parliamentary Services (PIPS) in collaboration with Syngenta in Islamabad,\nThe Speaker emphasized the struggle for democracy can only succeed through the Parliament and highlighted the importance of consensus and dialogue among all political parties to address the socio-economic challenges facing Pakistan.\nHe urged the three key stakeholders – the Election Commission of Pakistan, the incumbent government, and all political parties – to develop a consensus on holding elections.\nResponding to a question about the rising support prices of wheat for farmers, he noted that the cost of agricultural inputs must be rationalized to control this trend.\nThe Speaker said that Pakistan was facing severe impacts of climate change, including droughts, forest fires, and recent devastating floods.\nHe praised the Pakistani nation for successfully grappling with these challenges and said that climate change, food security, and sustainable agriculture are strongly interlinked.\nHe further highlighted the pivotal role of the Pakistani diaspora in finding new ways of transforming agriculture in response to climate change. He commended the country’s agriculture scientists for their work in inventing new seeds and techniques to increase agricultural production.\nThe Speaker emphasized the critical role of Parliament in a democratic society, stating that parliamentarians are uniquely placed to ensure the effective ratification of international climate change treaties and the implementation of the Paris Agreement.\nThe General Secretary of the Women Parliamentary Caucus, Ms. Shahda Rehmani, was also present at the event.",
  "retrievedAt": "2025-08-11T06:18:20.508Z"
}
