{
  "title": "PM urges society’s joint support for women’s emancipation",
  "link": "https://www.app.com.pk/national/pm-urges-societys-joint-support-for-womens-emancipation-2/",
  "date_published": "2023-03-07T12:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 08 (APP): Prime Minister Muhammad Shehbaz Sharif has said that the government is committed to ensuring equal and just rights for women in the country by providing them opportunities in all fields of life.\nIn his message on the International Women’s Day, the prime minister said a joint support by the government, civil society and media was crucial in protecting the rights of women in the country.\nTerming women the ‘pride of the nation’, he said the country needed their services and skills to progress.\nShehbaz Sharif said the government was taking effective steps for the inclusion of women in the national mainstream and was extending them equal opportunities in all sectors including education and employment.\nHe mentioned in this regard the legislation on women’s inheritance, educational scholarships for girls, women’s special quota in Punjab Endowment Fund, provision of laptops and ensuring merit in Recruitment as Chief Minister of Punjab. Recently, a 25 percent quota has been reserved for women in the Prime Minister’s Youth Loan Scheme, he said.\nHe felicitated women in Pakistan and across the globe, saying that theWomen’s Day acknowledged the significant role played by women in society and also in recognition of their services for the evolution of mankind.\nThe prime minister said the history was witness to the fact thatsocial development was not possible without the key role of womankind.\nHe said each aspect of a woman, may it a mother, sister or a daughterwas a source of positivity and thus deserved utmost respect from thesociety.\nThe Prime Minister mentioned that Islam as a religion granted equal rights to women some 1,400 years ago and honoured a mother by laying heaven beneath her feet and regarded a daughter as a blessing of the home.\nIslam, he said, focuses on emancipation of women by encouraging them to explore every aspect of life with dignity.\nShehbaz Sharif said women in the 21st century were bringing positivechange in the society side by side with their male counterparts.\nHe said that it was an encouraging sign that women were leading with examples in all spheres of life, may it be fulfillment of domestic responsibilities or exercising their leadership roles.\nFrom the women icons of the Independence Movement including Mohtarma Fatima Jinnah and Begum Raana Liaquat Ali Khan to former prime minister Benazir Bhutto Shaheed and activist Malala Yousufzai, he said their contribution was significant for the country’s progress.\nShehbaz Sharif expressed satisfaction that the highly capable daughters, mothers and sisters of the nation were engaged in the service of the country in a dignified manner.\nHe said the entire society needed to actively join hands in furtherempowering the women and ensuring their protection and just rights.",
  "retrievedAt": "2025-08-11T06:18:02.186Z"
}
