{
  "title": "Imran Khan must be brought to justice for corruption, other crimes: Marriyum",
  "link": "https://www.app.com.pk/national/imran-khan-must-be-brought-to-justice-for-corruption-other-crimes-marriyum/",
  "date_published": "2023-03-07T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Tuesday called for bringing Pakistan Tehreek-e-Insaf Chairman Imran Khan to justice for his crimes, including massive corruption.\n“Till date, Imran Khan has not appeared before courts in any case whether it is related to Malam Jabba, Billion Tree Tsunami, BRT Peshawar, Toshakhana, foreign funding or Tyrian White’s parental issue,” the minister said while talking to the media.\nImran Khan, she said, had been avoiding the courts as he had nothing in defence to escape from punishment for the crimes.\nShe said Imran Khan was a “foreign agent”, who had “indulged in laundering money through his cronies and using charity in his politics”.\nBy evading court appearances, Imran Khan, in fact, had made fun of the law and the Constitution, the minister said, adding he was the first accused who despite being summoned repeatedly, was not appearing before the courts. It would be better that Imran Khan should be arrested and produced in the courts.\nIf Imran Khan were not brought to justice for his crimes, then it would set a precedent for other accused to stop appearing before courts, Marriyum said.\nShe said ironically, Imran Khan had run his government through video links and now wanted to face the law in the same way.\nThe minister said,”Like a jackal, he had hidden at his Zaman Park residence while his workers were receiving bullets in the long march.”\nShe said Imran Khan had announced to start another movement, aiming to escape from accountability. His “save judiciary” movement was, in fact, an “Adalat Sy Bacho Tehreek” (movement for escaping from courts), she added.\nMarriyum said Imran Khan would never appear before the courts as he was bent on creating chaos in the country to hamper the economic stabilization process.\nThe PTI chief was afraid of the police and got himself hidden whenever the policemen visited his home, she added.\nMarriyum said Pakistan Muslim League-Nawaz Quaid Nawaz Sharif had appeared before the courts along with his daughter regularly as he knew that he had not committed any crime.",
  "retrievedAt": "2025-08-11T06:18:06.036Z"
}
