{
  "title": "Negligence, ill-preparedness, corruption responsible for factory fires",
  "link": "https://www.app.com.pk/national/negligence-ill-preparedness-corruption-responsible-for-factory-fires-2/",
  "date_published": "2021-10-13T12:55:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 13 (APP): The Sindh Government has widely criticized for lack of will, ill-preparedness and alleged corruption in its concerned departments leading to rise in factory fire incidents, especially in Karachi for putting innocent lives and huge infrastructures of the industrial sector at risk.\nIt has been revealed through different sources including investigation reports that a big number of industrial units were illegally operating in residential areas of the city – only in Mehran Town 1401 such units were operative where factory fire in M/s BM Luggage on Aug.27, 2021 killed 16 workers.\nAPP interviewed different stakeholders to collect information about the alarming situation of increasing fire incidents in the city; they were unanimously concerned on the poor governance by Pakistan People’s Party government in Sindh. Lack of the required infrastructure/logistics complemented with shortage and untrained staff, non-implementation of the policies/laws, and alleged favoritism and corruption increasing day-on-day.\nThe court has also held the concerned Sindh Government Departments and District administration officers responsible for the horrible fire incident.\nLeader of the Opposition in Sindh Assembly and Tehreek-e-Insaf leader, Haleem Adil Shaikh raised alarm that fires incidents especially in factories of Karachi were causing loss of many innocent lives and of property worth billions of rupees. And, all this happened due to non-serious and non-professional attitude of the PPP government and the administration under it.\nHe referred to the supplementary charge-sheet filed on Korangi factory fire incident of Aug.27, 2021 in which besides charging owner of M/s.BM Luggage, Hassan Meetha alias Ali Meetha and of the building Faisal Tariq ,some key officers of civic agencies and utilities including K-Electric, Karachi Development Authority, Sindh Environment Protection Agency, Fire Brigade, Sindh Building Control Authority, and Administrator and Deputy Commissioner of District Korangi under sections 322 and 34 of Pakistan Penal Code since they were aware that the industrial unit was being run without proper legal authorization, emergency equipments and exists.\nThe report stated that negligence and carelessness on the part of owners of the factory and of the building, factory management as well as the top officials of the civic agencies and utilities led to the death of 16 workers.\nHe also mentioned Ali Enterprises Garment Factory fire incident of Sept.12, 2012 in SITE industrial area of the city taking lives of 255 workers and injuring at least 100 workers. Three separate investigations by the police and Federal Investigation Agency found a series of irregularities and almost a complete absence of fire and safety mechanisms. The factory was not registered with Sindh Labour Department and, therefore, never inspected by the concerned government agencies.\nHowever, he regretted, no lesson was learnt from Ali Enterprises factory fire incident and no serious steps to ensure safety of workplaces were taken.\nResultantly, the fire incidents at workplaces had risen sharply.\nIt is pertinent to mention here that in Bangladesh, after incident of Rana Plaza fire, the government, labour organizations, factory owners and international brands reached an agreement named Bangladesh Accord and was strictly implemented which not only made workplaces safer but the workers found opportunities to get organized and get their due rights.\nThe Sindh Health and Safety Act was passed in 2016, but it lacked implementation; not a single meeting of the council constituted under the law held till date.\nBusiness leaders representing different trade bodies emphasized on making robust regulations, their strict implementation and in case of non-compliance they recommended strict legal action against the factory owners and the concerned government agencies to avoid fires in industrial and commercial entities in future.\nThey demanded for an efficiently managed chain of hydrants in the city especially in the industrial estates and at commercial centers so that fires could easily and quickly be doused. In the most reported cases, it took long hours to overcome blazes for non-availability of water to fire tenders at reasonable distance, and those were seen running here and there in search of it.\nIn the olden days, there were many hydrants along the main roads and spots of the city which helped very much in fighting fires.\nThey pointed out that Sindh Industries Department had not been fulfilling its due responsibility to support industries in the province especially in Karachi where huge number of industries were located. Industrial management companies under this department like\nSITE Limited had failed even to arrange the required number of fire tenders to ensure safety of industries at seven industrial zones of the city. Absence of proper roads and depilated existing ones, and destroyed sewerage system in industrial zones also created problems in fire fighting operations.\nThe main business leaders interviewed by APP included President, Federation of Pakistan Chambers of Commerce and Industry, Mian Nasser Hayatt Maggo, former vice president FPCCI and in-charge of WTO Cell at FPCCI’s Headquarters , Engineer MA Jabbar, President, Karachi Chamber of Commerce and Industry, Shariq Ahmed Vohra, Patron-in-Chief of SITE Association of Industry, former president KCCI and former chairman Sindh Investment Board, Muhammad Zubair Motiwala, and Chairman Pakistan Apparel Forum and former president SAI, Muhammed Jawed Bilwani.\nPresident, Federation of Pakistan Chambers of Commerce and Industry, Mian Nasser Hayatt Maggo demanded that government should constitute a high-powered body comprising representatives of FPCCI, PEC, Pakistan Standards and Quality Control Authority, SBCA and industrial estates to revise and issue new national codes for construction of buildings for industrial operations by categorizing high, medium and low risk industrial activities.\nTalking to APP on the condition of anonymity, a senior officer of Sindh Labor Department said there was big number of non-registered factories operating in the province and the employers used to threaten to move their businesses to other provinces in case the Labor Department initiated any action against such factories; thus creating economic crisis in the province.\nHe said not only Sindh Labor Department but other provincial departments including SBCA and local bodies were also responsible for issuing NOCs to factories for their establishment and operation. He pointed out that usually fire incidents happened in factories not registered with Labour Department.\nKarachi Development Authority (KDA) planed cancellation of lease of all the illegal factories operating on 1401 residential plots in Mehran Town, which originally meant for a housing scheme for Overseas Pakistanis. But, High Court of Sindh, on a petition, barred KDA from this action.\nThe leadership of Karachi Chamber of Commerce and Industry, and other trade bodies of the city have also pleaded that instead of canceling the lease of that big number of plots in Mehran Town in reaction to the fire incident of Aug.27, 2021, the government should ensure implementation of fire-related SOPs at all the factories to avoid such incidents in future.\nShutting down factories was not a wise decision as cottage, and small and medium size industrial units were the backbone of an economy throughout the world. Fire could breakout any moment in any industrial, commercial or residential locality.\nBut, precious lives could only be saved when the factories were well-equipped with fire-fighting ingredients including fire extinguishers and proper fire exits etc.They urged that the government must understand that cottage industries in Mehran Town were not established overnight.\nThose had grown up over the period of three decades. By the time, those were expanded and transformed into medium-size factories providing jobs to 200,000 workers which was rather a good thing happening to the province. Mehran Town must also be provided with an exclusive fire fighting vehicle to escape big human or material loss in future.\nAll the above assertions and recommendations from different stakeholders and institutions demand for a comprehensive workers’ safety policy, and availability of required machinery and other logistics with trained fire fighting staff, strong checks on violation by factory owners and negligence or mismanagement by the concerned Sindh Government Departments, and full coordination among the line departments to stop occurrence of fire incidents and the resultant loss of life and property in future.",
  "retrievedAt": "2025-08-11T21:27:12.994Z"
}
