{
  "title": "PIA generates Rs94.4 bln revenue, suffers Rs680 mln loss in 2020: Senate body informed",
  "link": "https://www.app.com.pk/national/pia-generates-rs94-4-bln-revenue-suffers-rs680-mln-loss-in-2020-senate-body-informed/",
  "date_published": "2021-10-13T14:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): Pakistan International Airlines (PIA) management Wednesday informed the Senate’s Standing Committee on Aviation that the national flag-carrier had generated Rs 94.989 billion revenue and suffered loss of Rs 680 million during the year 2020.\nThe committee meeting, chaired by Senator Hidayat Ullah, was apprised in a comprehensive briefing that in the year-2020 PIA faced a total loss of Rs 35.354 billion including the burden of ‘legacy debt.’\nThe PIA officials told the lawmakers that a 10-year performance audit and statistical analysis was conducted with a comprehensive business plan 2019-2023 aimed at operational turnover towards profitability and balance-sheet restructuring for addressing the legacy debt.\nThey said coronavirus had badly hit the aviation sector that halted its operation by around 60 per cent.\nThey said PIA had recovered $412.0 million from the airbus which was not pursued by previous regimes and also resolved a claim of $ 4 million from Air Asia.\nThe officials said the PIA had terminated 814 employees on fake credentials and tracked 700 bogus daily-wage employees and removed them from service.\nThey said the national flag-carrier was also in the process of enhancing tourism- related flights by 300 per cent in line with the vision of Prime Minister Imran Khan to promote tourism activities in the country.\nThe PIA has introduced new routes to Gilgit from Lahore, Karachi, Faisalabad, Sialkot and Multan besides Launching Air Safari Flight in partnership with Shangri-La Hotels for diplomats.\nThe body was informed that the PIA was inducting a simulator to reduce training cost as an initiative for 2022 & 2023, and also implementing Engineering MRO (Maintenance, Repair and Operations) project mostly for commercial activities.\nThe committee also discussed a matter regarding a PIA-owned property in New York, for which the PIA officials requested an in-camera meeting, saying “it [the issue] has already been misinterpreted and misconceived through the media.\nHowever, the PIA authorities put it on record that the property had not been taken over nor attached by anyone and “the case is under trial, no final decision has been announced as yet.”\nThey said the property was initially taken over by the bankers temporarily due to some financial liabilities of Roosevelt Hotel Corporation including payment of local taxes and utilities. “Now all dues are paid and the case is under trial,” informed the PIA officials.\nThe matter of the ban imposed by the European Union on flight operations of PIA was also discussed by the lawmakers. The PIA officials said the delay in ban-lifting was due to delay in the audit.\n“The ICAA kept pursuing the ICAO to conduct Audit at an early time frame; the ICAO announced the audit in July 2021 which was postponed due to Covid-19. The ICAO has announced the new schedule for the audit from 29 November 2021 till December 10, 2021. The resumption of flights to the European Union will take place, after the Validation Audit.”\nAmong others, the meeting was attended by Senators Faisal Saleem Rahman, Raza Rabbani, Sherry Rehman, Aon Abbas, Mohsin Aziz, Saleem Mandviwala and Afnan Ullah Khan, besides Minister for Aviation Ghulam Sarwar Khan, senior officials from Aviation Division and PIA.",
  "retrievedAt": "2025-08-11T21:27:06.910Z"
}
