{
  "title": "China, Pakistan to push ahead with cooperation on TCM",
  "link": "https://www.app.com.pk/national/china-pakistan-to-push-ahead-with-cooperation-on-tcm/",
  "date_published": "2021-10-13T11:38:00.000Z",
  "source": "APP",
  "content": "BEIJING, Oct. 13 (APP): Pakistan Ambassador to China, Moin ul Haque has said that Sino-Pakistan Cooperation Center on Traditional Chinese Medicines (SPCCTCM) would play an important role in boosting the traditional medicine cooperation between China and Pakistan.\nDuring a meeting with Prof. Liu Xinmin, Co-Director of SPCCTCM, also WHO Advisor on Traditional Medicine, and Prof. Wang Qiong, vice director of SPCCTCM, Ambassador Haque pledged to give full supports to SPCCTCM in terms of in registration and clinical trial of Chinese Herbal medicines in Pakistan.\nRumman Ahmad, permanent representative of Pakistan to the Shanghai Cooperation Organization (SCO) Secretariat, and Zulfiqar Ali, Second Secretary of Pakistan Embassy to China accompanied the ambassador.\nAttending this meeting online, Prof. Muhammad Iqbal Choudhary, Co-Director of SPCCTCM, also Director of International Centre for Chemical and Biological Sciences (ICCBS), University of Karachi, said that both of Pakistan Ministry of Science and Technology and Sindh government pay great attention to SPCCTCM based in University of Karachi, and take it as a priority of China-Pak cooperation on traditional medicine.\nProf. Wang told China Economic Net (CEN), the two sides also discussed registration of Shugan Jieyu Capsule in Pakistan, along with joint training programme on Master and Ph.D degree in China and Pakistan.\nInstitutes and universities will take part in this program include ICCBS in University of Karachi, Hamdard university from Pakistan, Hunan University of Medicine, Institute of Food Science and Technology, Chinese Academy of Agricultural Sciences (CAAS), Southwest Medical University, Ningbo University and Shihezi University from China.\nSPCCTCM is dedicated to China-Pakistan traditional medicine cooperation, which was approved by China National Administration of Traditional Chinese Medicine in December 2020.\nThe center was launched respectively in University of Karachi in Pakistan and Hunan University of Medicine in Huaihua, Hunan province, China.\nNow, SPCCTCM has attracted many famous experts and organizations in China and Pakistan.\nSPCCTCM will carry out various cooperation between China and Pakistan including research and development of drugs, health foods from herbal plants, academic and cultural exchanges, talents training, medical treatment, and industrial cooperation.",
  "retrievedAt": "2025-08-11T21:27:16.284Z"
}
