{
  "title": "Prof. M. Iqbal Choudhary honoured with top Muslim World Science Award",
  "link": "https://www.app.com.pk/national/prof-m-iqbal-choudhary-honoured-with-top-muslim-world-science-award/",
  "date_published": "2021-10-13T12:32:00.000Z",
  "source": "APP",
  "content": "The Mustafa Prize, a top science and technology award, is granted biennially to the top researchers and scientists of the Islamic world in four categories: “Life and Medical Science and Technology”, “Nanoscience and Nanotechnology”, “Information and Communication Science and Technology”, and “All areas of science and technology”.\nThe Mustafa Prize was established in 2012 as a symbol of scientific excellence at the international level, and it is regarded as Nobel prize of the Muslim world, said a news release.\nFive scientists each from Pakistan, Iran, Bangladesh, Lebanon and Morocco have been awarded ‘The Mustafa Prize’ in their respective fields of study.\nProf. Dr. Muhammad Iqbal Choudhary is world renowned medicinal chemist. He has published 1,175 research papers in the fields of organic and bioorganic chemistry in international journals, 76 books and 40 chapters in books published by major US and European press. He has secured 40 US patents so far.\nDr. Iqbal’s work has been cited by the researchers from around the world by 27,407 times and his h-index is 70. By now 94 national and international scholars have completed their PhD degrees under his supervision.\nDr. Iqbal is D.Sc., Ph.D., and C. Chem. He has been awarded by different governments of Pakistan with Hilal-e-Imtiaz, Sitara-e-Imtiaz, and Tamgha-e-Imtiaz.\nHe has been elected fellow by world renowned science academies named Academy of Sciences for the Developing World, Islamic World academy of Sciences, Pakistan Academy of Sciences, Royal Society of Chemistry, and Chemical Society of Pakistan.\nProf. Iqbal has been honored by the President of Iran with Khwarizmi International Award, President of Azerbaijan, with ECO Award in Education and the Prime Minister of Pakistan with COMSTECH Award in Chemistry.\nHe has been given the prestigious title of “Distinguished National Professor” by the Higher Education Commission in 2004 and Meritorious Professor by the University of Karachi in 2013.",
  "retrievedAt": "2025-08-11T21:27:14.923Z"
}
