{
  "title": "Sharif family following Modi’s footsteps to defame Pakistan: Farrukh",
  "link": "https://www.app.com.pk/national/sharif-family-following-modis-footsteps-to-defame-pakistan-farrukh/",
  "date_published": "2021-10-13T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Wednesday said that Sharif family, a gang of thieves and robbers, was vigorously following the footsteps of Indian Prime Minister Narendra Modi.\nResponding to media talk of Pakistan Muslim League Nawaz (PML-N) Maryam Safdar, he said the history of Sharif family was repleted with corruption and attempted weakening of the country’s institutions.\nModi was also playing the same dirty game of defaming Pakistan, he added.The minister said the Sharifs were trying unsuccessfully to destabilize the institutions that guaranteed national defense and security of the country.\nHowever the attempted defamation of Pakistan’s security institutions were not acceptable at any cost, he added.\nFarrukh said the fugitive and convicted Nawaz Sharif was enjoying a luxurious life in London.\nHe said corruption would have to be accounted for, and various gimmicks of Maryam could not escape the accountability.\nAnd such gimmicks could not help escape sentences awarded to the Sharifs on corruption, he added.\nThe minister said the fake Calibri font and fake Qatri letters could not held prove innocence of Sharif family.\nMaryam Safdar had exhausted political options to clarify her family’s corruption, he said, adding she should better appraise the nation about the invention of Calibri font in 2006.\nShe owed to appraise the nation how a seventeen years her brother become billionaire and bought property worth billions of rupee and how Maryam become beneficiary of Avenfield properties through a magic wand, the minister said.\nHe said Maryam was not allowing her corruption case to proceed further despite passage of three years as she managed to seek over 12 adjournments of her cases.",
  "retrievedAt": "2025-08-11T21:27:03.042Z"
}
