{
  "title": "People in Middle East campaign for boycott of Indian products",
  "link": "https://www.app.com.pk/national/people-in-middle-east-campaign-for-boycott-of-indian-products/",
  "date_published": "2021-10-13T14:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): People across Middle Eastern countries have started a campaign on social media to boycott Indian products to protest against the Assam police’s brutality against Muslims during an eviction drive.\nThe incident drew wide condemnation after the video of the police shooting a Muslim man went viral.\nThe boycott of Indian products on social media in the Arab world is currently in full swing. The widely circulated video also showed an Assam government photographer repeatedly stomping on a dead man during the eviction drive. The horrific video has triggered a backlash in the Gulf countries.\nOn September 30, Middle East Monitor, a portal focused on reporting from the region, revealed that members of the Kuwait National Assembly had condemned “the atrocities committed by the Indian authorities and Hindu extremist groups against the Muslim community”.\nKuwait’s National Assembly members issued a joint statement condemning the attacks on Muslims in India. “The lawmakers said in a joint statement that in the wake of the wave of violence and discrimination committed against Indian Muslims, including killing, displacement and burning, the lawmakers stand in solidarity with Muslims in India.”\nThey called on international, humanitarian, human rights and Islamic organisations to immediately work to stop the Indian authorities’ actions and restore security to Indian Muslims,” Middle East Monitor reported.\nKuwaiti member of Parliament Shuaib Al-Muwaizri called for a boycott of Indian goods. Kuwaiti news outlet Sabr News on September 29, quoted Al-Muwaizri as saying, “The Islamic World Organization, the leaders of Islamic countries, the leaders of the Gulf Cooperation Council, the United Nations, where are you about the heinous crimes committed by the Indian government against Muslims, men, women and children? Boycotting India and its products is a legal duty.”\nOman’s Grand Mufti Sheikh Ahmed Al Khalili, one of the most influential clerics in the country, had tweeted on September 28, about violence against Muslims in India. He claimed the violence in India was “a blatant aggression against Muslim citizens at the hands of extremist groups—supported by official bodies—it hurts everyone with a conscience.”\nSheikh Ahmed Al Khalili said, “I appeal—in the name of humanity—to all peace-loving countries to intervene to stop this aggression, and I also appeal to the Ummah as a whole to stand united in this matter.” The same day, the Grand Mufti of Oman, Sheikh Ahmed Bin Hamad Al-Khalili, also tweeted a post in Arabic from his official handle, seeking international intervention.\nIn such a situation, the hashtag ‘India kills Muslims’ has been trending in Arab countries in which India has been accused of genocide. In these trends, many people expressed their support for the displaced families and condemned the treatment meted out to them by the authorities.\nKhaled Beydoun, author and researcher of the book Islamophobia, described it as “state-sponsored Islamophobia” and “Hindutva violence”.\nFormer director of Islamic Educational, Scientific and Cultural Organization (IESCO), A. Altwaijri, tweeted that the Narendra Modi’s “Hindu Government” was abusing and persecuting Muslims “within the framework of a systematic policy and in light of international silence and Islamic inaction.”\nAbdul Rahman Al-Nassar who had over 3,18,000 followers on Twitter tweeted the viral video of violence at Darrang and said, “There are more than three million Hindus in the Gulf, they bring tens of billions of dollars to India, and we treat them with respect, so why are our brothers in India being killed just because they are Muslims?”\nSocial media was up in arms with the boycott campaign.\nThe campaign under the hashtags of ( #IndianMuslimsUnderAttack, is gearing momentum among Arabs and all Middle Eastern countries.",
  "retrievedAt": "2025-08-11T21:27:07.252Z"
}
