{
  "title": "Canadian HC, UNDP resident representative inaugurate flood affected girls’ school in Chitral",
  "link": "https://www.app.com.pk/national/canadian-hc-undp-resident-representative-inaugurate-flood-affected-girls-school-in-chitral/",
  "date_published": "2023-10-13T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): Canadian High Commissioner to Pakistan, Leslie Scanlon and Resident Representative, UNDP Pakistan, Samuel Rizk on Friday inaugurated a Government Girls’ High School in the remote Brep village in Upper Chitral, affected by floods in 2022.\nThe inauguration ceremony was attended by officials of the High Commission of Canada, Education Department, local administration, UNDP, students, teachers, and parents, said a press release issued here.\nFollowing the 2022 torrential rains and flash floods, the Brep school building sustained extensive damage, making it unusable and posing serious safety concerns for students and teachers. This natural disaster disrupted the education of girl students, who were temporarily relocated to a nearby rented facility. In September 2022, the Honourable Harjit S. Sajjan, Minister of International Development for Canada, visited the affected area and committed to rehabilitating the school, by providing $80,000 in funding through Global Affairs Canada.\nIn collaboration with UNDP and the Education Department of Khyber Pakhtunkhwa, the rehabilitation and restoration work has now been completed. More broadly, Canada has committed a total of $58M for flood response and resilience building in Pakistan, following the 2022 floods. Of this, $33M was provided for disaster response, and another $25M will be utilized for longer-term resilience building and rehabilitation.\nWhile addressing the inauguration ceremony, H.E. Leslie Scanlon, High Commissioner of Canada to Pakistan said, “Canada will continue to look for opportunities to increase access to and improve the delivery of basic education in Pakistan, including for refugees, forcibly displaced children/youth, and host communities, with a focus on reducing barriers for girls.”\nCanada has been at the forefront of empowering women and girls in KP province for decades, focusing on remote, marginalised communities in areas with some of the lowest gender indicators. The rehabilitation of the Brep School is part of the $7 million Improved Access to Quality Education in the merged districts of Khyber Pakhtunkhwa project, funded by Global Affairs Canada and jointly implemented by the UNDP, UNICEF and the Elementary & Secondary Education Department of KP.\nThrough this project, a total of 102 girls’ schools have undergone comprehensive rehabilitation and are equipped with educational resources, leading to a significant improvement in both enrolment and quality of education for around 14,000 girls in Kurram, Orakzai and Upper Chitral.\nThrough this project, Canada has also strengthened the capacities of provincial education institutions, such as the Education Monitoring Authority and the Directorate of Professional Development, funded extensive enrolment campaigns, established Early Childhood Centres, trained hundreds of teachers, provided teaching-learning materials and furniture to schools, and improved the curriculum for training of teachers in the province.\nCanada believes that a holistic approach to education needs is necessary to create a larger impact and sustain the results of girls’ education in the province.\nThis intervention is part of UNDP’s broader 2022 flood recovery programme, which aims to develop long-term resilience to natural hazards and climate change. UNDP’s vision of resilient and integrated recovery – in tune with UNDP’s Crisis Offer is guided by the needs on the ground and government priorities, while implemented in coordination with humanitarian and development partners.\nUNDP’s approach to resilient recovery in Pakistan spans the humanitarian-development nexus, and bridges short, medium- and long-term dimensions of the response, with underlying principles of gender equality and environmental sustainability integrated into all activities.\nThe Resilient Recovery Strategy in Pakistan is built on four key pillars. The first pillar focuses on rebuilding housing and community infrastructure to provide safe living conditions following the 2022 floods. The second pillar, livelihood recovery, is dedicated to helping people regain their sources of income and rebuild their economic well-being. Meanwhile, the third pillar emphasizes restoring governance systems to ensure effective and accountable government services.\nLastly, the fourth pillar concentrates on enhancing disaster resilience and environmental protection, aiming to prepare communities for future challenges and promote sustainable practices. All of these pillars collectively contribute to the broader goal of fostering resilience to natural hazards and climate change in Pakistan.\nIn the Brep School, UNDP’s extensive rehabilitation initiative encompassed a wide array of essential tasks. These included the meticulous removal of over 121,000 cubic feet of debris surrounding the school, the reconstruction of boundary walls, and the construction of a new room and toilet block. Moreover, UNDP provided crucial Water, Sanitation, and Hygiene (WASH) facilities, undertook necessary repairs and installations of doors, windows, and the main gate, electrified the premises, and revitalized the IT and science lab spaces.\nIn addition to these infrastructural enhancements, the Canada-funded project also furnished the school with modern school furniture, essential IT equipment, and state-of-the-art science lab apparatus. These comprehensive measures have transformed the school into a well-equipped institution, poised to deliver quality education to over 150 girls’ students.\nUNDP has developed a strong collaborative partnership with the Education Department, the local community, and the Parents-Teacher Committee to establish a sense of ownership and effective oversight over civil works. This collaborative effort is aimed at ensuring that the project truly meets the needs and expectations of all stakeholders.\nTo maintain stringent quality control and adherence to project timelines, UNDP’s technical team consistently and rigorously monitored the construction activities. This proactive approach not only guaranteed the high quality of the work but also ensured that the project was completed within the specified timeframe, further enhancing its impact on the school and the community.\nSamuel Rizk, Resident Representative UNDP Pakistan shared his remarks “The rehabilitation of this school is not just about repairing a building, it is about restoring hope and opportunity for young girls who deserve the chance to learn, grow and thrive in a safe and supportive environment”\nCanada, UNDP and the Education Department of Khyber Pakhtunkhwa will continue to work together to ensure education remains a priority area KP and to empower children, especially girls and young women to achieve their full potential.",
  "retrievedAt": "2025-08-11T10:03:42.950Z"
}
