{
  "title": "Speakers term two-state solution to Israel-Palestine conflict complex challenge",
  "link": "https://www.app.com.pk/national/speakers-term-two-state-solution-to-israel-palestine-conflict-complex-challenge/",
  "date_published": "2023-10-13T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): The Speakers at the ISSI webinar on Palestine conflict Friday termed the two-state solution to Israel-Palestine issue a complex challenge to achieve path to peace.\nThe Centre for Afghanistan Middle East and Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with the Middle East Monitor (MEMO), hosted a webinar titled, “Palestine – Latest Developments and Impact on the Region,” a news release said.\nThe webinar was moderated by Amina Khan, Director CAMEA. The speakers at the webinar included Ambassador Sohail Mahmood, Director General ISSI; Ambassador Khalid Mahmood, Chairman BoG, ISSI; Dr. Daud Abdullah, Director Middle East Monitor (MEMO); Dr. Azzam Tamimi, British Palestinian Academic, Dr. Motasem Dalloul, MEMO correspondent based in Gaza; and Mr. Oves Anwar, Director of the Research Society of International Law (RSIL).\nDG ISSI Ambassador Sohail Mahmood said that the Israel-Palestine dispute cannot be reduced to security concerns or counterterrorism rhetoric; at its core lies the Palestinians’ inalienable right to self-determination as enshrined in international law, the UN Charter, and relevant UN Security Council and General Assembly resolutions.\nA two-state solution, which has had international consensus, has suffered substantial setbacks due to recent deliberate actions that undermine it, he added.\nIsrael’s response, he said to Hamas’s attack has been characterized by indiscriminate and disproportionate use of force, with serious implications for regional stability.\n“The continuing humanitarian catastrophe in Gaza, home to 2.2 million people, many of whom are children, women, and the elderly, is unconscionable,” the ISSI DG said.\nThey face relentless bombing, with vital supplies such as water, fuel, and electricity cut-off, medical facilities targeted, and UN personnel losing lives in the line of duty.\nMoreover, the conflict is not confined to Gaza, as demonstrated by the bombing of airports in Syria and unfounded accusations against Iran, with Lebanon at risk of being drawn in.\nThe international community has fallen short in stopping the ongoing humanitarian nightmare, and some powerful nations’ unequivocal support for Israel’s ‘right to self-defence’ may have emboldened it to take further excessive military actions, while turning a blind eye to the immensely tragic humanitarian consequences.\nHe said strategic interests appeared to be taking precedence over international law and humanitarian norms. He underscored how Pakistan has called for an urgent global intervention to halt further escalation and loss of life. The imperative now is immediate de-escalation, ensuring humanitarian access, implementing a ceasefire, and reviving the peace process.\nDirector CAMEA, Amina Khan stated that the recent events in the Gaza Strip have brought a new level of brutality by the Israeli occupation forces. What sets this situation apart is the ‘declaration of war’ against the subjugated population, a move that defies international norms.\nThe disregard for principles of international humanitarian law, particularly the concepts of necessity and proportionality, is evident, given the absence of safe areas for Gaza’s civilian population. It is crucial to emphasize that civilian casualties on both sides are deeply regrettable and cannot be condoned.\nThese tragic losses underscore the urgency of finding a peaceful and just resolution to the Israeli-Palestinian conflict. A two-state solution remains the path towards peace, which is a matter of international concern. Achieving a just and lasting solution that respects the rights and dignity of all involved is imperative. However, it is essential to recognize that systemic oppression, tantamount to apartheid and genocide, inevitably breeds resistance, she said.\nDr. Azzam Tamimi emphasized his refusal to recognize Israel as a legitimate entity, rejecting the two-state solution and UN resolutions due to his identity as a Palestinian Muslim. His personal history, marked by displacement at the hands of Israelis when he was 17 years old, underscores the profound impact of the conflict. Dr. Tamimi shed light on the perception that Israelis view themselves as superior, a perspective exemplified by the Israeli Defence Minister’s dehumanizing remarks towards Palestinians.\nHe urged the international community not to adopt the narrative of colonial powers and to recognize the daily suffering of Palestinians, who experience their homes being burned continuously. While the international community can advocate for a ceasefire, the imposition of a specific conflict resolution, such as a two-state solution, remains a complex challenge. He called for a reevaluation of how the world perceives this enduring conflict.\nAmbassador Khalid Mahmood highlighted how since 1948, and particularly following the 1967 war, this region has been plagued by ongoing challenges. Despite various peace efforts facilitated by the UN, this long-standing issue remains unresolved. Palestinian resistance endures, even in the face of regional changes and recurring crises.\nSuch persistence reflects a sense of desperation stemming from the international community’s apparent indifference. While the international community, including the Arab League and OIC, has expressed support for the humanitarian cause, concrete actions have been limited. Pakistan maintains its position advocating a two-state solution with secure borders. Amidst the current situation, there is an immediate need for a ceasefire and a comprehensive humanitarian response.\nDr. Daud Abdullah said that recent events in Jerusalem and Gaza, spanning the last eight months, have been marked by the extrajudicial killings of Palestinians and the repeated desecration of Al-Aqsa Mosque.\nThe current situation reflects the foreseeable consequences of these actions. Warnings were issued to the Arab world regarding the potential for Israel’s policies to incite a religious war in the region, yet these cautionary voices were disregarded. The response from the Western world has exposed a striking double standard. While considerable resources were mobilized to address the Ukrainian conflict and oust the “aggressor,” the same level of action has not been taken in the case of Palestine.\nDr. Motasem Dallou, providing insights into the dire conditions on the ground in Gaza, highlighted the severe challenges faced by the population. Essential items such as food, fuel, and water have been severely restricted or entirely cut off, resulting in a dire humanitarian crisis. Hospitals are overwhelmed, struggling to cope with a surge of injuries, while local news agencies have ceased operations due to power outages and disrupted Internet connectivity, severely limiting information dissemination.\nDr. Giorgio Cafiero highlighted the risks of the ongoing Palestine conflict and said that the evolving situation is highly unpredictable, with global implications. The Abraham Accords, a hallmark of the Trump era, particularly the potential participation of Saudi Arabia, face growing uncertainty due to recent events in Israel. The ongoing Gaza conflict also threatens Saudi Arabia’s Vision 2030 plan, which relies on attracting foreign investment for economic diversification.\nOves Anwar gave an international law perspective on the ongoing situation in Gaza. He expressed profound concern over the distressing current situation, acknowledging the complex challenges international law faces in the modern world.\nHe highlighted the right of Palestinians to resist in accordance with UNSC resolutions, asserting that Palestine’s use of force, driven by the pursuit of self-determination, is legally justified.\nNoting the prevalence of disinformation, he emphasized the impermanence of the occupation and annexation, citing violations of international and humanitarian law. He contended that Israel, as the occupier, lacks the moral ground to claim self-defence, condemning the reckless loss of civilian lives.\nAfter the Speakers’ remarks, an interactive session followed during which further complex aspects of the evolving situation and its regional and global ramifications were taken up.",
  "retrievedAt": "2025-08-11T10:03:44.332Z"
}
