{
  "title": "Saudi King Khalid’s 1976 visit to Pakistan bolsters diplomatic, religious bonds",
  "link": "https://www.app.com.pk/national/saudi-king-khalids-1976-visit-to-pakistan-bolsters-diplomatic-religious-bonds/",
  "date_published": "2023-10-12T21:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):Saudi King Khalid bin Abdulaziz’s six-day state visit to Pakistan on October 10, 1976, held significant diplomatic and religious importance, strengthening the ties between the two nations.\nUpon his arrival to Pakistan, he was accorded a warm and ceremonious welcome from then President Fazl Elahi Chaudhry and Prime Minister Zulfikar Ali Bhutto.\nThe central highlight of King Khalid’s visit was his participation in the foundation stone-laying ceremony of the magnificent Faisal Mosque in Islamabad. The grand event took place on October 12, 1976, and witnessed the convergence of political leaders, religious figures, and dignitaries from both Saudi Arabia and Pakistan.\nMarking the 47th anniversary of King Khalid’s historic visit to Pakistan and the stone-laying ceremony of Faisal Mosque in Islamabad, Saudi Press Attaché Dr. Naif Al-Otaibi, on Thursday graciously shared a collection of cherished photographs from this momentous journey on his official social media account ‘X.’\nhttps://twitter.com/dr_naif777/status/1712367016227881327?s=48&t=ZDee3xmTnmDx_tvUcALw8g\nAccording to details, King Khalid, an influential figure in the Muslim world, was greeted with great enthusiasm as he arrived in Islamabad, symbolizing the strong bonds of friendship between the two nations. He was known for his commitment to Islamic unity and cooperation, which was particularly important during the geopolitical landscape of the time.\nDuring the foundation stone-laying ceremony, King Khalid and the Pakistani leadership, including President Chaudhry and Prime Minister Bhutto, symbolically laid the first stones of the Faisal Mosque. The mosque, named after the late King Faisal of Saudi Arabia, was envisioned as a grand tribute to the Islamic world and a symbol of Pakistan’s commitment to Islam.\nIn a solemn moment, King Khalid unveiled the plaque of the Faisal Mosque, marking the beginning of its construction. The mosque’s design was the work of the renowned Turkish architect Vedat Dalokay, and the ceremony underscored the mosque’s significance as one of the largest in the region, with the capacity to accommodate tens of thousands of worshipers.\nAs a testament to the special relationship between Saudi Arabia and Pakistan, King Khalid was honored with the prestigious Pakistan Medal during the visit. This recognition served as a symbol of gratitude for his contributions to the promotion of Islamic solidarity and diplomatic ties between the two nations.\nDuring his stay in Pakistan, he also visited Lahore. He went to Badshahi Mosque and the Shalimar Garden and attended the National Horse and Cattle Show at the Fortress Stadium. King Khalid was joined by the Saudi Foreign Minister Saud bin Faisal bin Abdulaziz and Minister of Defence and Aviation Prince Sultan bin Abdulaziz Al Saud.\nThe visit of King Khalid to Pakistan in 1976 left an indelible mark in the history of Pakistan’s diplomacy and religious heritage. It showcased the shared commitment of the two nations to Islam and their dedication to fostering harmony and cooperation in the Muslim world. The Faisal Mosque, whose foundation stone was laid during this historic visit, stands today as a lasting testament to this commitment and the enduring friendship between Saudi Arabia and Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:04:42.411Z"
}
