{
  "title": "Role of Parliament, government crucial to ensure effective implementation of climate policies: Experts",
  "link": "https://www.app.com.pk/national/role-of-parliament-government-crucial-to-ensure-effective-implementation-of-climate-policies-experts/",
  "date_published": "2023-10-13T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): The speakers at a panel discussion on Friday emphasized that the parliamentarians and government have a crucial role to play for effective implementation of climate policies which can build resilience by undertaking effective interventions needed to avert whooping impacts of environmental degradation.\nThe Sustainable Development Policy Institute (SDPI) in collaboration with Oxfam Pakistan, Indus Consortium and SPO organized a launch event titled “Climate Action: Panel discussion at the launch of four thematic policy position papers” in Islamabad.\nSenator Seemi Ezdi, Chairperson Senate Standing Committee on Climate Change in her address, said that Pakistan was blessed with glaciers, but they had become a curse for the country due to global warming and lead to recurrent floods in summers. She highlighted that the policy and legislative process was a tedious process marred by bureaucratic hiccups and political biases.\nShe hailed the efforts of the Ministry of Climate Change and Environmental Coordination for presenting a comprehensive National Adaptation Plan. However, she said that the implementation of the plan was hampered due to lack of sufficient funds needed to catalyze climate adaptation, develop the institutional and technical capacity for adaptation. Effective implementation of laws and coordination is very low, but it is the key to achieve resilience against spiking up climate disasters, she added.\nDr Shafqat Munir, Deputy Executive Director, SDPI remarked that there were critical gaps in institutional capacity which hindered the flow of climate finance and a significant portion of the cost incurred due to the recurrent climate crises stemmed from our inaction to avert climate change.\nHe said, “there is an important need to change the mindset of the nation and institutions towards natural resources which belong to the nation and no one has the right to over exploit them for corporate greed.” He added that for instance, many multinationals were exporting water pumped from Pakistan to Central Asian countries at the cost of the country’s already depleting natural resources.\nHe suggested that there should be a responsibility fixed on every stakeholder so that unsustainable excavation of natural resources could be limited.\nBilal Anwar, Chief Executive Officer, NDRMF expressed that the evolution of the climate financing infrastructure and environment in Pakistan like many other developing countries had been weak and broken.\nHe attributed this due to complex nature of climate finance mechanism combined with the lack of knowledge on how these can be accessed which leads to the inadequacy of international climate finance.\nHe stressed that we should judiciously evaluate if the Loss and Damage Fund would be like the previously established global climate finance tools and highlighted that in such a case, the efficiency of the fund would be reduced.\nHe informed that in 2021, 83.6 billion were mobilized as climate finance but a significant portion of it was conditional/soft loan which again undermines the ability of developing countries to develop resilience and adaptation.\nSyed Shahid Kazmi, Country Coordinator, Pakistan Humanitarian Forum (PHF) said the international non-governmental organizations have contributed some $370 million in the post 2022 floods relief efforts. He pointed out that lack of coordinated efforts reduced the efficacy of response measures in climate disaster.\nHe said that climate change was a reality and we would have to face it and synergize our efforts for better responses and handling of such disasters in the future. He stressed that the Parliament must take the lead to improve coordination among key stakeholders.\nZohaib Durrani, SFDRR Specialist, NDMA said that there was little risk knowledge available and the infrastructure to cater to the requirements for risk assessment in the country needs to be strengthened.\nHe informed that NDMA had introduced anticipatory actions in disaster response in the past few years which filled the previously identified grey areas between resilience and adaptation. He said inadequate resource allocation further adds crisis, leaving the country at the back in addressing effective disaster risk reduction and management issues. He hopes that with new policy frameworks now in place will be operationalized to ease the situation.\nDr Sofia Khalid, Associate Professor and Head of Department, Environmental Sciences Department, Allama lqbal Open University said that the legislation done by the country was commendable but it lacked effective systems for implementation and monitoring. She urged the government to update and revise the curriculum to incorporate the latest climate data and research.",
  "retrievedAt": "2025-08-11T10:03:50.059Z"
}
