{
  "title": "PUC observes ‘Palestine Solidarity Day’ across nation",
  "link": "https://www.app.com.pk/national/puc-observes-palestine-solidarity-day-across-nation/",
  "date_published": "2023-10-13T13:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): Pakistan Ulema Council (PUC) on Friday observed ‘Palestine Solidarity Day’ across the nation expressing unity with the oppressed Palestinians and offering special prayers in Friday sermons.\nThe PUC Chairman Hafiz Muhammad Tahir Mahmood Ashrafi, along with other prominent religious leaders, spoke out in support of Palestine.\nThey highlighted the critical juncture in the Palestinian issue and called on Muslim leaders to play their role immediately.\nAddressing the issue of human rights, PUC Chairman Ashrafi deplored the silence on the mass killings of the oppressed Palestinians.\nHe emphasized that for decades, Israel had been subjecting innocent civilians, hospitals, schools, and ambulances to its ruthless aggression.\nNotably, he said the United States, India, the United Kingdom, and other Western nations remained silent in the face of Israeli brutality, disregarding the principles of human rights.\nHe called for swift action from the Muslim leaders to halt Israel’s aggression stressing that at this moment, the entire Muslim world stood with their oppressed Palestinian brothers and sisters.\nHe appreciated the unwavering efforts and stance of the leadership of Saudi Arabia, Qatar, Turkey, Iran, Kuwait, Egypt, Jordan, and other Muslim-majority countries.\nHe urged the Kingdom to take a leadership role in resolving the Palestinian and Kashmir issues expressing its pivotal position in the Organization of Islamic Cooperation (OIC).\nHe stated that without the establishment of an independent, sovereign Palestinian state, no solution could be achieved, and the support of Saudi Arabia was crucial in this regard.\nHe announced an International Conference of Solidarity with Palestine scheduled to be held in Islamabad on October 18th, 2023, under the umbrella of PUC, where key discussions and plans would be presented to work towards the recognition of a free and independent Palestinian state by the international community.\nBesides PUC Chairman Hafiz Muhammad Tahir Mahmood Ashrafi (Lahore), the religious scholars and leaders included, Maulana Dr. Abu Bakr Siddique (Islamabad), Allama Abdul Haq Mujahid (Multan), Maulana Asadullah Farooq, Allama Zubair Abid (Lahore), Maulana Asad Zakaria (Karachi), Maulana Haq Nawaz Khalid, Maulana Ubaidullah Gormani, Allama Tahirul Hasan (Faisalabad), Maulana Muhammad Shafi Qasmi, Maulana Hanif Usmani (Sahiwal), Maulana Muhammad Asghar Khosa (Dera Ghazi Khan), Maulana Nauman Hashir, Maulana Tahir Aqeel Awan (Rawalpindi), Maulana Abu Bakr Sabri, (Islamabad), Maulana Anwar-ul-Haq Mujahid, Maulana Abdul Malik Asif (Multan), Maulana Aslam Siddiqui, Maulana Abdul Hakeem Athar, Qari Muhammad Aslam Qadri (Lahore), Maulana Muhammad Khurshid Nomani (Bahawalnagar), Maulana Abdullah Haqqani, Maulana Abdullah Rashidi (Kasur), Maulana Asim Shad, Maulana Abdul Waheed Farooqui (Narowal), Maulana Abu Bakr Hamza (Chakwal), Maulana Habibur Rahman Abid, Maulana Aminul Haq Ashrafi, Maulana Izharul Haque Khalid, Sahibzada Hamza, Tahir-ul-Hasan (Faisalabad), Maulana Saadullah Ludhianvi (Toba Tek Singh), Maulana Anis-ur-Rehman Baloch (Gujrat), Maulana Abdul Rasheed (Hafizabad), Mufti Muhammad Umar Farooq (Khanewal), Maulana Abdul Ghafar Shah Hijazi (Lodhran), Maulana Tanveer Ahmad (Bahawalpur), Maulana Muhammad Ahmad Makki, Maulana Muhammad Ashfaq Pitafi (Muzaffargarh), Maulana Kaleemullah Muawiya (Nankana), Maulana Azizur Rehman Muawiya (Talagang), Maulana Aziz Akbar Qasmi (Rajanpur), Maulana Saadullah, Shafiq (Rahim Yar Khan), Maulana Hussain Ahmed Petitioner (Karachi), Maulana Yasir Alvi (Samandri), Qari Abdul Rauf, Maulana Mokhtaal Mahar (Bahawalnagar), Maulana Zubair Khatana (Gujranwala), Maulana Aqeel Zuberi (Sargodha), Qari Azizur Rahman ( Layyah), and Maulana Atif Iqbal (Kamalia).",
  "retrievedAt": "2025-08-11T10:03:50.128Z"
}
