{
  "title": "Interpol red notices issued against model Sophia Mirza, her sister",
  "link": "https://www.app.com.pk/national/interpol-red-notices-issued-against-model-sophia-mirza-her-sister/",
  "date_published": "2023-10-13T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): The Interpol red notices have been issued against former model and actress Sophia Mirza (Khushbakht Mirza) and her sister Mariam Mirza.\nSophia and Mariam have resided in London for several months, following cases filed against them in Pakistan by Umar Farooq Zahoor, a Dubai-based businessman.\nHe shares two teenage daughters with Sophia Mirza, and the two parties have been entangled in a prolonged legal battle over custody rights.\nThe Ministry of Interior, in collaboration with the Federal Investigation Agency (FIA), has issued red notices for the accused individuals, Sophia Mirza under Notice number 2023/66146, and Mariam Mirza under Notice number 2023/66156.\nThe FIA’s relevant director writes in the notice: “I am directed to convey the approval of the competent authority i.e. Special Secretary, MOI for the issuance of red notices against the accused persons namely Khushbakht Mirza and Mariam Mirza involved in FIR No.156/23, dated 17.05.2023 u/s 420/468/471/385/386/389/500/506 PPC, Police Station Secretariat, District Islamabad.”\nThe FIA’s notice adds: “It is requested that Secretary General, INTERPOL Secretariat, Lyon, France may please be requested for the issuance of Red Notices against the accused Khushbakht Mirza and Mariam Mirza to arrest them through INTERPOL.”\nThe red notice for Interpol relates to a criminal complaint Zahoor registered in May this year in Islamabad against the former accountability minister Shehzad Akbar, model Sophia Mirza, her tennis player sister Mariam Mirza and others for registering false and vindictive cases against him in the summer of 2020 – when Pakistan Tehreek-e-Insaaf (PTI) was in power.\nThe complaint was registered under Sections 420, 468, 471, 385, 386, 389, 500, and 506 of PPC 1860, for cheating, preparation of forged documents, extortion of money, defamation, and criminal intimidation.\nAs per the story of FIR, inquiry No. 72/20 against Umar Farooq Zahoor and others was initiated by the Federal Investigation Agency (FIA) Corporate Crime Circle (CCC) Lahore in May 2020 by treating an application submitted by his ex-wife Khushbakht Mirza as a source report.\nIt further revealed that the persons nominated in the FIR acted in connivance to extort money from Umar Farooq Zahoor by registering false cases against him at FIA Corporate Crime Circle Lahore.\nThe FIR application in particular mentions the role of Shehzad Akbar who used the cabinet to run a campaign against Umar Farooq Zahoor.\nThe FIR says: “After the registration of the aforesaid criminal cases, Shehzad Akbar the then Special Advisor to Prime Minister (PM) on Accountability, for illegal monetary gains, fraudulently obtained approval from the Cabinet under Section 188 CrPC 1898 by concealing the fact that the cases have already been closed at Switzerland and Norway.\nThe Applicant joined the investigation in the year 2023 and the Joint Investigation Team constituted for the investigation of FIR No.36/20 and 40/20 after a thorough investigation reached a conclusion that the allegations in the aforesaid FIRs are false, frivolous and concocted.\nSubsequently, the JIT FIA with the approval of the Board, submitted a Cancellation Report under Section 173 CrPC before the Competent Courts in both the FIRs. The Learned Court accepted the Cancellation Reports and allowed the cancellation of FIRs No. 36/20 and 40/20 vide Orders dated 29.04.2023 and 11.05.2023 respectively.”\nThe FIR says Sophia Mirza (Khushbakht Mirza), who married Umar Farooq Zahoor in 2006, initiated a custody case against the applicant in order to blackmail him and extort money from him. It says: “Umar Farooq Zahoor also paid her a hefty sum of Rs. 10,00,000 in the year 2013 on the directions of the Supreme Court after which the Supreme Court decided the controversy once and for all.\nHowever, Khushbakht Mirza, in the year 2020, in connivance with Shehzad Akbar the then Advisor to PM on Accountability, and Umaid Butt and Ali Mardan Shah (officials of FIA) again started blackmailing the Applicant in order to extort more money from him. Khushabkht Mirza then with the help of the aforesaid persons managed to get false criminal cases registered against the Applicant and his other family members. The Applicant was blackmailed, threatened, and harassed.”\nWhen registering the cases, Sophia Mirza used her name as a complainant Khushbakht Mirza to conceal her identity and the fact that Zahoor was her former husband and both were involved in a court dispute over the custody of their two teen daughters. Umar Farooq has publicly alleged that Sophia and her accomplices tried to extort money from him and when he refused they started cases against him using their govt connections in the PTI govt.\nThe FIA told the court that during the course of the investigation, it was brought on the record that Umar Farooq Zahoor not only denied the allegations but also produced a letter from Norway Police confirming the said inquiry was closed due to lack of evidence and also produced another document of Oslo Police to the Public Prosecutor with the recommendation of dismissal of the case.\nSophia Mirza, when contacted, said she was not aware of the red notices issued by the Interior Ministry of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:04:03.669Z"
}
