{
  "title": "RERA to protect people’s rights, genrate more employment opportunities: Ali Nawaz Awan",
  "link": "https://www.app.com.pk/national/rera-to-protect-peoples-rights-genrate-more-employment-opportunities-ali-nawaz-awan/",
  "date_published": "2020-10-26T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): Special Assistant to the PM of the Capital Development Authority (CDA), Ali Nawaz Awan Monday assured that real estate and construction sector is set to become the prime employment generator in country and booming with each passing day with the fruitful policies of government.\nTalking to a private news channel, he said there was a dire need for an authority to regulate real estate business in federal capital to protect rights of people, adding, on the directives of PM establishment of a real estate regulatory body is preparing a road map for a one-window facility and online approval of cases relating to construction and housing sectors.\nThe federal government will soon implement a Real Estate Regulatory Authority (RERA) to manage the affairs of real estate with an appellate tribunal to settle the disputes of the concerned sector, he said.\nHe said under the new regulatory authority for the real estate agents will have to register with the authority for the sale of plots, houses or buildings which would further control the fraud cases in property business.\nAli Nawaz said all interested people in property business would be registered with the regulatory authority, adding,\nwithout approval, no promoter will be able to sell or purchase any plot or publish an advertisement.\nThe developer will have to submit details of his past projects and a present full plan for the future with the authority, he explained.\nHe also emphasized the need for utilization of information technology at all levels in the construction sector to make it swifter and easier.\nThe real estate and construction industry remained the main focus of the Pakistan Tehreek-e-Insaf (PTI) government as it reduced taxes and allocated funds for giving a boost to construction and allied industries in an attempt to revive economic growth and create job opportunities, he added.\nUnder new legislation of real estate business we will facilitate our clients with documented necessary marketing services and contribute to social development, he said.\nHe also explained that due to past government’s weak law related to rent, traders of Islamabad have been facing several challenges that include abrupt eviction and increase in rent but after the implementation of regulatory authority which was approved by National assembly will provide legal covers to both tenant and landlords.\nRERA will be authorized to revoke the license of the promoter in case of any violation, he said, adding, the authority will look after the rights of the allottees and real estate agents.\nReplying a Question, the multi-billion Islamabad Blue Area commercial project will be inaugurated soon and\nwith the construction of 2nd phase of blue area in capital the business activities will further increased and generate more revenues.\nHe said after the successful ecnomic revival and huge packages for construction industry the foreign investors are moving to Pakistan as well.\nAli Nawaz re promised the upcoming fiscal year will bring significant development activities in Islamabad.",
  "retrievedAt": "2025-08-11T19:56:30.975Z"
}
