{
  "title": "PM shares master plan of Pakistan’s first knowledge city",
  "link": "https://www.app.com.pk/national/pm-shares-master-plan-of-pakistans-first-knowledge-city/",
  "date_published": "2020-10-26T09:35:00.000Z",
  "source": "APP",
  "content": "Prime Minister Imran Khan on Monday said his dream was to build the country’s first Knowledge City offering quality education to the students.\nThe Prime Minister had performed the ground-breaking of the first phase of Namal Knowledge City in Mianwali on Saturday.\nThe Prime Minister on twitter shared a video of the master plan of the project.\nThe Master Plan of my dream to build Pakistan’s first knowledge city. pic.twitter.com/uxZKAUGFzc\n— Imran Khan (@ImranKhanPTI) October 26, 2020\nRenowned architect Tony Ashai, who will carry out the project of Namal Knowledge City, thanked Prime Minister Imran Khan for providing him the opportunity.\nThank you PM @ImranKhanPTI for giving me the opportunity to be part your dream. A proud moment for Pakistanis and inshallah @Namaledu will be an institution that will produce the future leaders of Pakistan. And all this made possible by #AleemaKhan the force behind Namal. https://t.co/AqwbMNcwaQ\n— Tony Ashai (@tonyashai) October 26, 2020\nThe Namal Knowledge City has been envisioned by Imran Khan as a center of academic excellence for the marginalized population residing in remote areas.\nAfter completion of first phase, more than 10,000 students from deprived areas will benefit from the Knowledge City.\nThe project will be environment-friendly with a state-of-the-art green structure.\nThe master plan sets a new precedent in urban planning, environmental stewardship, and provides innovative ways for fusing nature with city planning.\nThe master plan will also support efforts for enhancing social equity by using locally sourced materials and human input.\nImran Khan during the visit to Namal University for launch of first phase of the Knowledge City said the institution would also house facilities like schools and research centers to enhance agriculture yield, and develop new seed technologies.\n“Nations can only excel through knowledge economies. They do not progress or become rich by just selling cotton or textile products. The richness comes when you invest in the people and provide them higher education,” he said.\nThe students of Namal University have also been able to obtain first division from Bradford University, England while being in Pakistan, manifesting huge talent of the area.",
  "retrievedAt": "2025-08-11T19:56:31.474Z"
}
