{
  "title": "October 27: A black chapter in history of Jammu & Kashmir: KP Governor",
  "link": "https://www.app.com.pk/national/october-27-a-black-chapter-in-history-of-jammu-kashmir-kp-governor/",
  "date_published": "2020-10-26T18:50:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 26 (APP):Khyber Pakhtunkhwa Governor, Shah Farman has said that October 27 is observed as black chapter in the history of Jammu & Kashmir as on that day Indian military entered in Occupied Jammu & Kashmir against the well of the people of Kashmir.\nHe expressed these views in a special message issued by him in connections with the commemoration of Kashmir Black Day tomorrow (October 27).\nThe Governor Khyber Pakhtunkhwa said that atrocities in occupied Kashmir are continued since last 73 years that are increasing in different shape with each passing day. On August 5, 2019, the Indian government by abolishing the special constitutional status of occupied Kashmir added another black chapter to its wild occupation and history of atrocities.\nThe KP Governor Shah Farman was of the view that Indian government and her security forces are committing such atrocities on Kashmiris including women and children that are also shameful for humanity.\nHe said that today Indian government is illegally establishing Hindus settlements in occupied Kashmir that is tantamount to a dacoity on the right of self-determination and citizenship of Kashmiris. The step of the Indian government is not only the violation of the UN resolutions, rather is a nefarious effort toward the genocide of majority Muslim population in which India will never succeed.\nThe KP Governor on his own and behalf of the people of Khyber Pakhtunkhwa assured the innocent Kashmiris that like past the people of KP and tribesmen are standing by them and will always continue support to them.\nHe said that by seeing the miserable conditions of the people of occupied Kashmir, he feels sorry over the role of international human rights organizations, whose silence on Indian atrocities is question mark.\nThe Governor Khyber Pakhtunkhwa appealed the international community to play their effective role in the resolution of longstanding international dispute of occupied Kashmir according to the resolutions of the United Nations.\nHe said that Pakistan had always stood by the people of Kashmir and will continue full support to them on both moral and diplomatic fronts till their liberation from Indian occupation.",
  "retrievedAt": "2025-08-11T19:56:25.814Z"
}
