{
  "title": "Scientists call for promoting importance of `Science’ in socio-economic development of country",
  "link": "https://www.app.com.pk/national/scientists-call-for-promoting-importance-of-science-in-socio-economic-development-of-country/",
  "date_published": "2024-03-01T09:43:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 01 (APP):Scientists in different fields have laid stress on promoting importance of `Science’ for socio-economic development in the country and for attracting the youth towards attainment of scientific education.\nThe august gathering of scientists was held here at a convention organized by Pakistan Science Foundation (PSF) at National Center of Excellence In Geology Peshawar University.\nTiled as `Science for Socio Economic Development’, the Scientific Convention was a maiden event to kick off Golden Jubilee Celebrations of Pakistan Science Foundation in the field of Science and Technology.\nOutgoing Interim Provincial Minister for Education, Dr. Muhammad Qasim Jan was chief guest on the occasion. The convention was attended by renowned scientists from across the country, Phd scholars, heads of Research and Development organizations and students from different educational institutions.\nSpeaking on the occasion, Interim Minister for Education KP, Dr. Qasim Jan highly eulogized the role played by Pakistan Science Foundation in promotion of Science and Technology through serving as a platform for scientists of the country.\nWithout attainment of scientific education, we can never enter into the comity of developed nations, Dr. Qasim remarked. He also informed convention participants that Khyber Pakhtunkhwa government is making huge spending, around 23 percent of its budget, on Education but still a lot of challenges are faced in shape of 4.7 million out of school children.\nHe also thanked PSF for selecting Peshawar University as first site for initiating celebration of 50 years of Excellence in the field of Science and Technology.\nDr. Qasim said in our country, the importance and power of science is not realized and this mindset is needed to be changed by promoting awareness about importance of S&T in attaining development and progress.\nHe stressed for holding awareness sessions with people from different walks of life including policy makers, politicians, academia, media, parents and students.\nChairman Pakistan Science Foundation, Dr. Muhammad Akram Sheikh apprised participants of the convention about services being provided by PSF in promotion of science and technology in the country.\nPSF has made remarkable contribution in development of S&T by serving as financing agency for the promotion of basic and fundamental research on scientific issues related to socio-economic development of the country.\nHe also made detailed presentation of different projects completed by PSF, ongoing initiatives and future plans.\nDr. Akram Sheikh also laid stress on promotion of importance of scientific education, innovations in the field through involvement of media.\nHe said science education cannot be achieved without public awareness about importance of S&T.\nIn this regard, he continued, PFS is soon launching its own Y-Tube channel and will hold training of journalists on reporting of science and technology.\n“Glorification of role of science is imperative for attaining socio-economic development in the country”, Dr. Akram stressed.\nDr. Anisa Qamar, Chairperson Department of Physics also spoke on the occasion and made a presentation on `Plasma physics and its Applications’.\nDr. Taza Gul, Director Science and Technology Khyber Pakhtunkhwa threw light on progress of his department in promotion of S&T.\nA panel discussion was also held wherein people from different walks of life including academic, Phd scholars, students of higher education and media person threw light on challenges in promotion of S&T in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:03:37.239Z"
}
