{
  "title": "COMSTECH, Huawei join hands to elevate cybersecurity proficiency of OIC nations",
  "link": "https://www.app.com.pk/national/comstech-huawei-join-hands-to-elevate-cybersecurity-proficiency-of-oic-nations/",
  "date_published": "2024-03-01T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP): COMSTECH and Huawei have joined hands to elevate the cybersecurity proficiency of OIC nations, focusing on areas like security management, security incident response, vulnerability management, and staying abreast of emerging security technologies and requirements.\nThis partnership is reiterated during the high level meetings held at the Mobile World Congress in Barcelona, Spain, said a message received here.\nCoordinator General COMSTECH, Prof. Dr. M. Iqbal Choudhary and Advisor COMSTECH, Dr. Syed Khurshid Hasnain met with the Cyber security and Privacy Protection team at the Mobile World Congress to chart out the future of the strategic collaboration.\nCOMSTECH, the Ministerial Standing Committee on Scientific and Technological Cooperation of the Organization of Islamic Cooperation and Huawei Technologies Pakistan recently signed a Memorandum of Understanding to bolster national cybersecurity awareness and fortify the capabilities of OIC member states in cybersecurity.\nCOMSTECH’s core mandate revolves around fostering cooperation among OIC Member States in science and technology. It aims to bolster capabilities through training in emerging areas, implementing OIC resolutions, and developing programs to enhance scientific capabilities for socio-economic development and rapid industrialization.\nSet against the background of an increasingly interconnected world, securing systems and data has never been more crucial, as has the development of regulations, policies and capacity to manage the same.\nCutting-edge technologies like AI, quantum computing, and cloud infrastructures are rapidly evolving, presenting both unprecedented opportunities and complex cybersecurity challenges at the intersection of technology and policy.\nThe collaboration between COMSTECH and Huawei aims to elevate the cybersecurity proficiency of OIC nations, focusing on areas like security management, security incident response, vulnerability management, and staying abreast of emerging security technologies and requirements.\nHuawei, renowned for its digital transformation, networking, and communication technologies globally, recognizes the pivotal role of the digital economy in fostering economic growth and sustainable development. With a commitment to extending the boundaries of science and technology, Huawei collaborates closely with governments and communities to deliver secure ICT technology across various industries.\nIn an era where industries and sectors rapidly embrace digital solutions, cybersecurity stands as a pivotal component ensuring the continuity, stability, and growth of economies.\nIts significance spans across all sectors, particularly in government, financial services, and healthcare. Prof Dr. M Iqbal Choudhary shared that by virtue of its mission, COMSTECH intends to use the strengths and opportunities of Huawei Technologies, a technological giant, for the benefit of the member states.\nAs the OIC member states are spread across four continents, using science and technology as essential tools for rapid and sustainable, inclusive socio-economic development.\nCOMSTECH has many programmes in different regions of the OIC and all of them are focused on some tangible benefit to and for the local people. The partnership with Huawei Technologies is at the center of many of the programmes.\nSpeaking to the scale and scope of the partnership, Prof Choudhary described the relationship as a very flexible cooperation as the leadership of Huawei Technologies was both forward-looking and willing. COMSTECH was at the MWC to both see the vast portfolio of technologies Huawei has to offer but also meet with member states.\nHe expressed the intention of expanding the cooperation to have Huawei Technologies introduce, implement and use in areas such as healthcare, education, agriculture and cyber security which remains a cross-cutting essential component in all technological applications.\nUnder the existing MoU, Huawei will collaborate with COMSTECH to host cybersecurity training based on its practices and experiences, contributing to enhanced cybersecurity awareness and capacity building for selected OIC governmental employees. Additionally, participation in influential regional cybersecurity events like GISEC and GITEX is on the agenda.\nCOMSTECH members will engage with the Huawei Global Cybersecurity and Privacy Protection Department, fostering an environment that supports the digital economy.\nCOMSTECH and Huawei intend to drive cybersecurity innovation, creating knowledge products such as white papers and technical guidelines, showcasing OIC cybersecurity advancements and contributing to industry growth.\nProf Choudhary added that the OIC world is very asymmetrical with many of the member states face a huge capacity deficit in not only technological competencies but also in the understanding of policies, regulations and strategies.\nTo that end, the COMSTECH-Huawei partnership is broad-based, with COMSTECH wanting to leverage the Huawei expertise to develop better understanding of national strategies of member states so they can have their own digital transformation policies and legislations.\nBeyond that, developing technical competencies for the implementation of many of these policies and deploying Huawei in delivering many of these solutions is also on the cards,\nHighlighting the complexity and magnitude of the endeavour, Prof Choudhary shared that out of 57 member states between 40 to 45 percent are least developed countries, depending on the standards used.\nThese countries have natural resources and for the most part youthful populations who are capable of quickly absorbing these technologies.\nRecognizing the opportunity in the asymmetry, he highlighted that the new technologies are more intellectually demanding than requiring tremendous infrastructure or finance.\nThus, the intent is to focus on youth-centric programmes that benefit both the individuals and the countries where they are located. The partnership with Huawei offers a fast-track implantation of the plans for the least developed countries.\nThis partnership works toward a future characterized by robust cybersecurity, cutting-edge AI applications, and seamless integration of 5G technologies, which would allow the OIC countries to leapfrog forward in development.\nWith government buy-in, a vibrant private sector and the support of a technological giant like Huawei, development would be accelerated.\nDr. Syed Khurshid Hasnain is working closely with the Huawei Pakistan team to develop a matrix of activities including workshops, national and international trainings and implementation of some of the technologies.",
  "retrievedAt": "2025-08-11T01:03:28.744Z"
}
