{
  "title": "SPARC to share statistics significant burden tobacco  use",
  "link": "https://www.app.com.pk/national/sparc-to-share-statistics-significant-burden-tobacco-use/",
  "date_published": "2024-03-01T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP):The Society for the Protection of the Rights of the Child (SPARC) shared statistics highlighting the significant burden tobacco use imposes on Pakistan, both in terms of public health and economic costs.\nInstead of increasing taxes on utilities such as electricity and gas, the government should prioritize increasing taxes on cigarettes to reduce the health cost burden and economic crisis,said in a press release issued here on Friday.\nMalik Imran Ahmad, Country Head of the Campaign for Tobacco-Free Kids (CTFK), stated that Pakistan faced a considerable challenge in combating the tobacco menace.\nHe also presented statistics showing a high prevalence of tobacco use in the country, with 31.9 million adults (15 years and above) consuming tobacco products, accounting for about 19.7% of the adult population.\nHe further added that tobacco-related illnesses, such as cancer, diabetes, and heart diseases, contributed to over 160,000 deaths annually in Pakistan.\nThese deaths not only affect individuals but also have broader impacts on families, communities, and the healthcare system.\nMalik Imran proposed an immediate 30% FED increase in 2024, which could recover 19.8% of costs, narrowing the gap between health burdens and tax revenues.\nThis tax proposal represents a clear ‘win-win’ in terms of health and revenue for the government and the people of Pakistan.\nMoreover, the recently initiated track & trace system on cigarettes is expected to reduce counterfeiting, restrain tax evasion, and maintain accountability.\nDr. Khalil Ahmad, Program Manager at SPARC, highlighted that low cigarette prices were the reason of children and youth to initiate smoking.\nHe added that smoking-related illnesses and deaths incur substantial economic costs, amounting to 1.6% of Pakistan’s GDP each year.\nThese costs encompass healthcare expenses, productivity losses due to illness and premature death, as well as other indirect economic impacts.\nAdditionally, he said that the tobacco epidemic required comprehensive strategies encompassing public health interventions, strong tobacco control policies, and awareness campaigns.\nBy tackling tobacco use, Pakistan can mitigate economic losses associated with smoking-related illnesses, potentially alleviate the burden on its healthcare system, and keep youth safe from the harms of tobacco use.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:03:20.390Z"
}
