{
  "title": "Ayaz pledges to conduct affairs of NA in accordance with constitution",
  "link": "https://www.app.com.pk/national/ayaz-pledges-to-conduct-affairs-of-na-in-accordance-with-constitution/",
  "date_published": "2024-03-01T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP): Newly elected Speaker of the National Assembly, Sardar Ayaz Sadiq, pledged on Friday to conduct the affairs of the National Assembly in accordance with the constitution and the law.\nSoon after being elected as Speaker for the third time, he expressed gratitude to his leader, Mian Muhammad Nawaz Sharif, for nominating him again, as well as to the President of the Pakistan Muslim League-Nawaz (PML-N), Mian Shahbaz Sharif, and his party colleagues for their trust in him.\nHe also thanked the former President Asif Ali Zardari and the Chairman of the Pakistan People’s Party (PPP), Bilawal Bhutto Zardari, for their support.\nHe expressed gratitude to the leaders and members of other political parties in the assembly for their confidence in him.\nSardar Ayaz Sadiq extended special thanks to the voters and supporters of his constituency, NA-120, whose valuable votes enabled him to achieve this position.\nHe also acknowledged the participation of Malik Muhammad Amir Dogar in the democratic process.\nHighlighting the importance of both the government and the opposition in the assembly, Ayaz Sadiq said that the assembly is incomplete without their participation.\nHe urged all members to refrain from personal criticism and emphasized the need for everyone to play their role in advancing democratic practices.\nAddressing the media, he stressed the significance of their role in completing the parliamentary process and ensuring transparency. He also underscored the importance of an active media for a functioning assembly.\nAyaz Sadiq reiterated that Pakistan’s progress lies in the collective efforts of its people and called for unity in advancing the country’s development. He urged everyone to come together to propel democratic processes and contribute to Pakistan’s prosperity.\nMalik Amir Dogar of the Sunni Ittehad Council congratulated Sardar Ayaz Sadiq for his election as Speaker for the third time.\nHe alleged that rigging had occurred in the election.\nRaja Pervaiz Ashraf, in his address, said it was a historic moment of his life to have administered the oath to the members.\nHe added, “This House is a source of power for the people.”\nHe further said it was the responsibility of the members to find a solution to the problems the country was facing through mutual consultation.\n“People’s eyes are on you. Your every action should be in the national interest,” Ashraf suggested, adding that the responsibility of upholding the constitution rested on the members who have been appointed by the nation as guarantors.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:02:55.603Z"
}
