{
  "title": "Saudi embassy, PBM join hands for Ramadan ration distribution, orphan care",
  "link": "https://www.app.com.pk/national/saudi-embassy-pbm-join-hands-for-ramadan-ration-distribution-orphan-care/",
  "date_published": "2024-03-01T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 1 (APP):The Saudi Embassy on Friday agreed to collaborate with Pakistan Bait-ul-Mal (PBM) to distribute ration bags during Ramadan ul Mubarak and take responsibility for the care of 100 orphans supported by Pakistan Sweet Home, with formal documentation to follow soon.\nManaging Director of Pakistan Bait-ul-Mal, Syed Tariq Mahmood Al-Hassan, visited the Saudi Embassy in Islamabad upon a special invitation from the Saudi Ambassador, Nawaf Al-Maliki.\nThe Saudi Ambassador warmly welcomed him during the visit. He congratulated Syed Tariq Mahmood Al-Hassan on assuming the position of Managing Director of Pakistan Bait-ul-Mal.\nIn the meeting, the Managing Director of Bait-ul-Mal and the Saudi Ambassador reached an agreement to collaborate on initiatives within Pakistan’s social sectors. The Saudi Ambassador assured the Managing Director of Bait-ul-Mal of seeking further cooperation for additional social projects in the country.\nPreviously, Saudi relief agencies and other social organizations from Saudi Arabia have collaborated with Pakistan Bait-ul-Mal on numerous projects aimed at the welfare of the needy and vulnerable individuals. The Saudi Embassy in Islamabad has consistently maintained positive and fruitful cooperation with Pakistan Bait-ul-Mal.\nThe Managing Director of Bait-ul-Mal recognized the Saudi Arabian government’s particular focus on global social sectors. He highlighted the enduring support between the two brotherly nations during challenging periods, emphasizing Saudi Arabia’s continual prioritization of Pakistan’s economy and social well-being. This commitment underscores the mutual trust shared between the two countries.\nThe Managing Director of Bait-ul-Mal acknowledged Saudi Arabia’s keen interest in global social sectors. He emphasized the enduring support and prioritization of Pakistan’s economy and social welfare by the two nations, reflecting mutual trust.\nManaging Director Syed Tariq Mahmood Al-Hassan also extended some gifts to His Excellency Saudi Ambassador and expressed gratitude for their full support of Pakistan Bait-ul-Mal’s initiatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:02:54.955Z"
}
