{
  "title": "IHC awards jail sentence to DC, SSP ICT in contempt case",
  "link": "https://www.app.com.pk/national/ihc-awards-jail-sentence-to-dc-ssp-ict-in-contempt-case/",
  "date_published": "2024-03-01T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP):The Islamabad High Court (IHC) on Friday awarded six month imprisonment sentence to Deputy Commissioner ICT Irfan Nawaz Memon while four month to SSP Operations Malik Jameel Zafar in a contempt of court case for issuance of MPO orders against Shahryar Khan Afridi.\nThe court also announced two month jail sentence to SHO Margalla Police Station Nasir Mehmood in the same case and, however, discharged SP Farooq Buttar from the charges.\nThe court suspended the sentences of the accused for one month and said that they would be sent to Adiala Jail if they failed to file the appeals against their convictions within the said time.\nIHC’s Justice Babar Sattar pronounced the 73 pages verdict which was earlier reserved.\nThe court also imposed Rs.100,000 fine against the each accused and ordered to distribute the amount among the affectees of MPO orders.\nThe court said that the amount was not a compensation to the petitioners rather it was just symbolic step. The order said that the executive powers were associated with the elected representatives of public and state would use these powers through them.\nIt said the three accused belong to bureaucracy who could use the powers only in limits of law for the protection of fundamental rights. These powers couldn’t be used against citizens as weapons, the court said.\nThe verdict said that it also couldn’t be happened that the officials violate the court orders and commit contempt. It said that apparently the MPO orders issued by administration in Islamabad and other parts of the country after May 2023 were compatible and seemed as the state policy.\nThe court said that there was need of further investigation in line of this policy which should be conducted under the supervision of executive. The copy of this judgment should be sent to the Prime Minister who would ensure that the state would use its powers only through the elected representatives.\nMeanwhile, Deputy Commissioner Irfan Nawaz Memon and SSP Operations Malik Jameel Zafar have filed intra court appeals against their convictions to Islamabad High Court (IHC).\nMemon has stated in his appeal that he has issued MPO orders against the petitioners in May 2023 on the information shared by SSP Operations. The IHC declared the detention orders of the petitioners as illegal on June 2, 2023. After this, the district administration Rawalpindi has issued several MPO orders which has no connection with deputy commissioner ICT.\nHe said that the single member bench didn’t initiate any contempt of court proceeding against district administration of Rawalpindi.\nIrfan Memon further said that PTI founder was arrested on August 5, 2023 and on August 8,  DC Islamabad issued detention orders on the basis of report of special branch.\nHe said that contempt of court proceeding was started against him on issuance of 8 August’s orders.\nHe produced all record before the court while Intelligence Bureau (IB) and Special Branch also endorsed his statement in their reports before court.\nHe said that the single member bench ignored all statements and record, and convicted him in contempt case.\nHe prayed the court set-aside the judgment of single member bench and release him from the charges.\nA division bench comprising Chief Justice Aamer Farooq and Justice Tariq Mehmood Jahangiri would take up the ICAs on March 4.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:03:07.790Z"
}
