{
  "title": "Federal, provincial govts supporting people of flood-affected areas: PM",
  "link": "https://www.app.com.pk/national/federal-provincial-govts-supporting-people-of-flood-affected-areas-pm/",
  "date_published": "2022-08-01T11:19:00.000Z",
  "source": "APP",
  "content": "CHAMAN, Aug 1 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday reiterated that the federal government in collaboration with the provincial government had been making all-out efforts to provide succour to the flood-hit population of Balochistan.\nAddressing a cheques distribution ceremony, the prime minister said that he reached to the people of the province at a time when they were facing a natural calamity that caused indescribable damage in different parts.\nHe said Balochistan was an important and huge province and its different areas like Chaman, Qilla Saifullah, Lasbela, Jhal Magsi, Noshki and Quetta had been inundated by flash floods, adding about 142 lives were lost, while hundreds of others were injured and a large number of houses were partially or completely destroyed. Besides, bridges and road infrastructures were dismantled due to monsoon deluge.\nThe prime minister said that he had visited different parts of the province where all departments of the federal and provincial governments and Pakistan army had been working closely for rescue, relief and rehabilitation operations.\nThe law enforcement agencies were also working day and night to help the affected population, he said.\n“In this time of natural calamity, the provincial and federal governments and all their departments are serving you with the provision of medicines, food and tents. Medical camps have been set up, besides ensuring the provision of clean drinking water and treatment for the domestic animals” he added.\nThe federal ministers and Chief Minister Balochistan Abdul Quddus Bizenjo and other relevant authorities were present on the occasion.\nThe prime minister said that he could not say that everything was right despite all these efforts as there were loopholes which were being removed and cited an incident of negligence in Qilla Saifullah where food and water were not provided in tents.\nHe said the chief minister took immediate action and suspended the responsible staff. It should be a warning to others that no leniency would be tolerated in this regard, he added.\nThe prime minister said that lethargic officials would be taken to task and expressed the hope that relevant officials would take the responsibility with full devotion.\nHe said that he had directed the NDMA chairman to distribute all the cheques among the affected families without any delay while maintaining transparency.\nThe financial amount was no substitute for the human losses, the prime minister observed and said, but the life had to move on and it was the responsibility of the government to cater to the needs of affected people.\nThe prime minister assured that the compensation support would be provided within the next few days and estimates were being made over the damages caused to crops and residences for the sake of transparency so that the deserving could get the due amount.\nHe further informed that the NDMA and PDMA in collaboration with the provincial government would make such estimates and said that he would request the chief of army staff to lend support in these efforts through relevant authorities.\nThe chief minister and other notables also highlighted the issues being faced by the local population and the efforts for the rescue and relief.",
  "retrievedAt": "2025-08-11T15:19:35.641Z"
}
