{
  "title": "Shujaat says he wants to change PML-Q’s constitution, make it vibrant political entity",
  "link": "https://www.app.com.pk/national/shujaat-says-he-wants-to-change-pml-qs-constitution-make-it-vibrant-political-entity/",
  "date_published": "2022-08-01T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP): Pakistan Muslim League-Quaid (PML-Q) President Chaudhry Shujaat Hussain on Monday said he wanted to change the party’s constitution to make it a strong political entity so that it could play a vibrant role for the supremacy of democracy.\n“I have been with the party for 20 years, and have always supported the truth and will continue to do so. The party is united and will remain so,” he said while addressing a press conference.\nShujaat said a campaign had been launched against him on the social media. “I had told Pervaiz Elahi to be my candidate instead of being a nominee of Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan. We will be happy if the PTI makes Pervaiz Elahi the chief minister for life, but we will not support Imran Khan,” he added.\nChaudhry Shujaat said,”We are all concerned about division in the family.” He, however, added that there was no truth in the accusations against his sons, and those spreading such false propaganda should better tender apology.\nHe said on Eid day he had asked Chaudhry Wajahat to apologize for his statement, but he did not do so.\nHussain said one should be truthful as defined in the Holy Quran. Truthfulness would be made a part of the party’s constitution.\nHe said whatever had happened in the PML-Q’s Lahore office, had no legal or constitutional status. “No legal procedure was adopted regarding the meeting of Central Working Committee. All the party’s provincial and regional presidents and central officials are with me. Pervaiz Elahi being a provincial president of the party should come and explain the whole situation to us.”\nReferring to PTI chief Imran Khan, Shujaat said he could never go along with those who criticized the institutions. “Words like traitor and Mir Jafar were used, and campaigns are being held to defame the institutions.”\nHe said he had asked Imran Khan to make Moonis Elahi a part of his cabinet. “But Imran said he cannot make him a minister as there are allegations against him. However, I told Imran to prove the same if there were any evidence instead of mere leveling allegations.”\nThe PML-Q president said it was time for all the political leadership to forget their differences and sit together to save the country from economic default. The politicians could hold a grand dialogue in that regard.\nHe said the government should also start a national dialogue on the economy. “I am also starting consultations with leaders of other political parties.”\nFederal Minister for National Food Security and Research Tariq Bashir Cheema said Chaudhry Shujaat could not be removed as the party’s president. He had founded the PML-Q some 22 years ago and had been running it as president since then.\n“How could a party official from Punjab call the meeting of Central Executive Committee and also preside it to remove Chaudhry Shujaat from the top slot?” he questioned.\nHe said Chaudhry Shujaat was an honest person and had always done politics based on moral values. He did not believe in hatching conspiracies.\n“I do not want to open the Pandora box as it will arise more problems for the family,” he added.\nChaudhry Pervaiz Elahi had become Punjab Assembly speaker twice and deputy prime minister once, but Chaudhry Shujaat just remained the country’s prime minister for a few months, he added.\nThe minister said he had criticized Imran Khan time and again. “I had told Chaudhry Shujaat many times that Imran as prime minister was incompetent and I do not want to be his cabinet minister.”\nTo a question, he said the ruling of former National Assembly speaker (Qasim Suri) was declared as illegal by the Supreme Court. If necessary, they might take a legal action against him in the light of detailed decision, he added.\nHe said Chaudhry Shujaat had meetings with Pakistan Peoples Party Co-Chairman Asif Ali Zardari, Jamiat Ulema-e-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman and Pakistan Muslim League-Nawaz leaders when discussions were going on to make Chaudhry Pervaiz Elahi the deputy prime minister.",
  "retrievedAt": "2025-08-11T15:19:31.067Z"
}
