{
  "title": "President rejects 30 representations; directs FBR to undo unjust taxation on lecturers’ salaries",
  "link": "https://www.app.com.pk/national/president-rejects-30-representations-directs-fbr-to-undo-unjust-taxation-on-lecturers-salaries/",
  "date_published": "2022-08-01T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): President Dr Arif Alvi on Monday rejected 30 identical representations filed by the Federal Board of Revenue (FBR) against Federal Tax Ombudsman’s decision directing the FBR to stop charging excessive tax deductions from wages of the hired lecturers at the withholding stage.\nWhile upholding FTO’s decision, the president observed that the withholding income tax at the rate of 20% over the monthly salary of Rs. 36,000 of lecturers, provisionally hired on semester-to-semester basis, was unlawful and an act of maladministration on the part of FBR.\nHe directed FBR to ensure that hired lecturers of Post Graduate College for Women, Bannu or other such educational institutions were not burdened with excessive tax deductions at the withholding stage.\nHe further directed Regional Tax Officer Peshawar to reprocess the instant cases under relevant legal provisions and issue necessary clarifications and instructions to all withholding agents to implement his (president’s) decision and report compliance within 45 days.\nPresident Alvi rejected FBR’s arguments that the payments made to hired lecturers fell under the definition of “Services” which attracted withholding tax at the rate of 20%.\nHe observed that under Section 12 read with sections 149 and 153(1)(b) of the Income Tax Ordinance, 2001, the wages received by hired employees under any of the forms of employment i.e., regular, ad-hoc, temporary, daily wages, contingency etc. would be treated as “Salary” and would liable to taxation as “Salary Income”.\nHe said the hired lecturers were under Master-Servant Relationship with hiring institutions as in the cases of regular, ad-hoc, temporary, hired, daily wages, contingency staff. Moreover, the law saw their wages at par with Salary pay and, therefore, their wages could not be excluded from the ambit of salary taxation.\nThe president in his decision held that in view of the circumstances and facts of the cases, FTO’s orders were based on valid justifications and sound legal footings, therefore, the representations of FBR were liable to be rejected.",
  "retrievedAt": "2025-08-11T15:19:32.515Z"
}
