{
  "title": "Senate passes unanimous resolution expressing solidarity with flood-affected people in Balochistan",
  "link": "https://www.app.com.pk/national/senate-passes-unanimous-resolution-expressing-solidarity-with-flood-affected-people-in-balochistan/",
  "date_published": "2022-08-01T17:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP): Senate on Monday passed a unanimous resolution expressing solidarity and assuring full support to the flood-affected people particularly in Balochistan.\nAccording to the resolution presented by Senator Sana Jamali, the upper house of the parliament had showed sympathy with the bereaved families who had lost their loved ones in the recent floods across the country especially in Balochistan.\nIt said the ninety percent infrastructure of Balochistan had been damaged, the provincial economy had been affected badly and a lot of loss had been incurred to the agriculture sector.\nThe resolution said the house was of the opinion that the compensation amount announced by the government for the bereaved families who had lost their dear ones and those who had suffered economic losses due to the natural calamity was insufficient.\nThe house appreciated the rescue and rehabilitation operation carried out by the Pakistan Army besides their services relating to health facilities and provision of food to the flood victims, it added.\nPresenting their recommendations through the resolution, the Senate said the outstanding of agriculture loans against the farmers of Balochistan should be waived off, they should be provided sufficient financial support so that they could cultivate crops in the next season easily, and the government should announce a special package for the reconstruction of provincial infrastructure and revival of the economy.\nThe house also recommended to enhance the support amount to mitigate the sufferings of flood affected people on priority, the resolution maintained.",
  "retrievedAt": "2025-08-11T15:19:23.947Z"
}
