{
  "title": "Asad distributes promotion letters to 239 NA officers, staff",
  "link": "https://www.app.com.pk/national/asad-distributes-promotion-letters-to-239-na-officers-staff/",
  "date_published": "2020-01-12T22:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP):Speaker National Assembly (NA) Asad Qaiser on Monday distributed up-gradation and promotion letters to 239 officers and supporting staff of the NA secretariat in the next grade.\nThe officers and supporting staff who have been promoted in the next grade included 83 ex-cadre officer and 156 supporting staff.\nA special ceremony was held in the National Assembly for the distribution of promotion letters, said a press release.\nSpeaking on the occasion, the speaker congratulated the employees who have been promoted to the next grade and said he was delighted to issue letters to the employees who had been looking for promotion for the last several years.\nHe expressed confidence that employees who promoted in the next grade would perform their duties more diligently than ever before and would play a vital role in strengthen and dignity of the institution.\nThese promotions have been made under the new rules formulated on the direction of Speaker, National Assembly for the employees of the National Assembly Secretariat.\nAccording to these rules, time-scale up-gradation has been provided to National Assembly employees in addition to providing uniform promotion opportunities.\nAfter the introduction of these rules, 38 employees and officers have been given promotions in the first phase, while in the second phase, 239 employees were approved for up-gradation to the next grade.\nUnder the new rules, Chamber Attendants, Dispatch Riders, Qasids, Naib Qasids and all Machine Operators will be promoted to the next grade after completing five years service.\nThe employees promoted had been either waiting for promotion since past several years or did not had any channel for further promotions. They thanked the Speaker for his kind initiative.\nThe employees were of the view that this favorable initiative of the Speaker National Assembly will eliminate the deprivation among the employees and would enhance performance of their official duties.\nMinister for Interior Syed Ijaz Shah, Minister of State for Parliamentary Affairs Ali Muhammad, members National Assembly Amjad Ali Khan, Agha Rafiullah and Maulana Abdul Akbar Chitrali, Secretary National Assembly Tahir Hussain and large number of senior officers of the National Assembly Secretariat and staff members attended the ceremony.",
  "retrievedAt": "2025-08-11T18:37:03.039Z"
}
