{
  "title": "MOHR to submit report on prison before Jan 18",
  "link": "https://www.app.com.pk/national/mohr-to-submit-report-on-prison-before-jan-18/",
  "date_published": "2020-01-12T22:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 13 (APP):Federal Minister for Human Rights Dr. Shireen M Mazari chaired the meeting of commission formed by Islamabad High Court on jail reforms to finalise its report.\nChairing the meeting, Dr. Shireen Mazari said there should be separate cells for transgenders and people with disabilities to cater their needs.\nShe also instructed the participants to operationalize the recommendations in their respective provinces, said a press release on Monday.\nSecretary of Ministry of Human Rights Ms. Rabiya Javeri Agha briefed the participants about the recommendations of the report.\nShe highlighted that the recommendations were based on Nelson Mandela guidelines adopted by UN and Bangkok rules which deals with female prisoners.\nThe main recommendations included capacity building of staff of prisons and appointment of medical staff of prisons at vacant seat.\nThe report will be submitted to Islamabad High Court before January 18, 2020.\nThe meeting was attended by Iqbal Hussain Special Secretary Home, Home Department Punjab, Babar Qadeer, Additional Secretary, Home Department Sindh, Mirza Shahid Saleem Baig, Punjab Prison, Asghar Ali Deputy Secretary ,Ministry of National Health Services, Muhammad Arshad Director General Ministry of Human Rights, Col. Taj Sultan ,Additional Inspector General Prison Khyber Pukhtoonkhawa, Syed Hammed Ullah , Additional Inspector General Prisons Baluchistan ,Dr. Tariq Additional Secretary , Ministry of Interior and Mr. Irfan Bashir, Ministry of Human Rights.\nThe commission was formed on a writ petition filed by Khadim Hussain, currently a prisoner at the Central Jail Adyala, Rawalpindi, before the Honourable Islamabad High Court after his vision was impaired during the course of his sentence due to failure and negligence of prison authorities.\nAfter hearing the plight of the prisoner, the Honourable High Court constituted a Commission chaired by the minister for human rights to look into the following areas (the Terms of Reference): To investigate human rights violations in the prisons of Pakistan and lack of medical assistance and obstacles in access to a court of law of prisoners who do not have means or assistance in this regard. To investigate failure on part of the executive authorities and respective Governments to fulfil obligations and enforce the Prison Rules and the Code of Criminal Procedure, 1898 relating to prisoners who suffer from illness and diseases. To carry out a review of the Prison Rules and other relevant laws with the object of fulfilling the commitments of the State of Pakistan under the Constitution, International Treatise and Conventions. Propose regarding solutions to deal with the human right violations in the prisons and amendments in any law, rules or regulations. Proposals regarding appropriate governance and management systems. How to ensure individual and institutional accountability.\nThe commission was comprised of following members; Federal Minister of Human Rights (Chairperson), Secretary Ministry of Interior, Secretary Ministry of Health, Former Chairperson of Human Rights Commission of Pakistan, Ghazi Shahabuddin Journalist, Zia Awan Advocate Supreme Court, Tariq Khosa, Former Director General Federal Investigation Agency, the Provincial Chief Secretaries and Secretary Ministry of Human Rights.",
  "retrievedAt": "2025-08-11T18:37:03.027Z"
}
