{
  "title": "Heatwaves, high temperatures threatening young lives in South Asia: UNICEF",
  "link": "https://www.app.com.pk/national/heatwaves-high-temperatures-threatening-young-lives-in-south-asia-unicef/",
  "date_published": "2023-08-07T17:55:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Aug 07 (APP): Three-quarters of children in South Asia are already exposed to extreme high temperatures compared to only one in three globally, the UN Children’s Fund (UNICEF) said Monday, urging authorities to do more to help them beat the heat.\nIn parts of Pakistan’s Sindh province, including Jacobabad, the world’s hottest city in 2022, temperatures were in their 40’s in June, exposing 1.8 million people to severe short- and long-term health risks, UNICEF said.\nThe scorching heat came less than one year after the devastating floods which left most parts of the southern Sindh underwater in August 2022.\nEven in the rainy season, the heat can exacerbate the situation for children, the UN agency said. Since children cannot adapt quickly to temperature changes, they are not able to remove excess heat from their bodies.\nOverall UNICEF said it estimates that 76 per cent of children under 18 in the region – 460 million – are exposed to extreme high temperatures where 83 or more days in a year exceed 35° Celsius.\nJuly was the hottest month ever recorded globally, raising further concerns about a future where children, including those living in South Asia, are expected to face more frequent and severe heatwaves, largely due to climate change.\n“With the world at global boiling, the data clearly show that the lives and well-being of millions of children across South Asia are increasingly threatened by heat waves and high temperatures,” Sanjay Wijesekera, UNICEF Regional Director for South Asia, said in a statement.\nAccording to UNICEF’s 2021 Children’s Climate Risk Index (CCRI), children in Afghanistan, Bangladesh, India, Maldives, and Pakistan are at ‘extremely high risk’ of the impacts of climate change.\n“We are particularly concerned about babies, toddlers, malnourished children and pregnant women as they are most vulnerable to heat strokes and other serious effects,” Wijesekera added.\nThis can cause symptoms and illnesses such as higher body temperature, rapid heartbeat, cramps, severe headache, confusion, organ failure, dehydration, fainting and coma, in young children; poor mental development in infants; and developmental setbacks such as neurological dysfunction, and cardiovascular diseases, it was pointed out.\nEarly contractions, hypertension, seizures, high blood pressure, preterm births and stillbirths are risks for pregnant women, who are particularly susceptible to heat.\nFor young children, ice packs, fans or misting with water can help lower their body temperature, while cold water immersion can help older children.\nDuring high temperatures, UNICEF urged frontline workers, parents, families, caregivers and local authorities to protect children and beat the heat by taking the following steps:\n— Be aware of heat stress and protect yourself and your children. Take preventive measures and recognize heat stress and know what actions to take;\n— Easily identify the symptoms. Recognize the symptoms of various heat-related illnesses that caregivers, communities and front-line workers need to know;\n— Act immediately to protect. Learn the first-aid actions that caregivers and front-line workers need to take to rebalance body heat in the short term; and\n— Take to a health facility. Front-line workers, families and caregivers should recognize the symptoms of heat stress symptoms immediately, especially signs of heat stroke, and help take affected people to a health facility.\nUltimately, the most vulnerable children, adolescents and women are the ones that pay the highest price for extreme weather events.\n“Young children simply cannot handle the heat,” said  Wijesekera. “Unless we act now, these children will continue to bear the brunt of more frequent and more severe heatwaves in the coming years, for no fault of theirs.”",
  "retrievedAt": "2025-08-11T09:05:47.472Z"
}
