{
  "title": "IT Minister calls for supporting least developed OIC member countries through skill development",
  "link": "https://www.app.com.pk/national/it-minister-calls-for-supporting-least-developed-oic-member-countries-through-skill-development/",
  "date_published": "2023-08-07T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): Federal Minister of Information Technology and Telecommunication, Syed Amin uI Haque Monday stressed the need to support least developed countries of OIC through skill development in the field of science, education, IT, and digital economy.\nThe minister was speaking during a meeting with the organizing committee of Nobel Fest VI to be held in Islamabad.\nThe Nobel Fest VI will be held during November 29-30 at COMSTECH. The theme of this year’s festival is “Bridging Science and OIC Countries in the Digital Future”.\nThe meeting was attended by Prof. Dr M. Iqbal Choudhary, Coordinator General, COMSTECH, Maxat Kurbenov, founder and CEO, Nobel Fest, Senator Dr. Serik, Deputy Head of Organizing Committee, Nobel Fest, Prof. Dr. Khalid M. Iraqi. Vice Chancellor, University of Karachi, and Haris Akram, Program Manager, COMSTECH.\nThe organizing committee briefed the minister about the mission, objectives and program of the Nobel Fest.\nThe minister appreciated the festival’s noble mission and expressed gratitude for hosting the event in Islamabad.\nHe assured full support from his ministry and the institutions under the umbrella of the Ministry of Information Technology and Telecommunication.\nThe minister emphasized on capacity building of Pakistan’s youth in the fields of science and technology.\nThis year’s Nobel Fest will focus on scientific discoveries and technological innovations, with a particular focus on key topics such as the future of medicine, digitalization in education, disruptive technologies, efforts to combat climate change, and strategies for socio-economic development through science.\nNobel Fest is a unique and one of the most impactful educational and technological gatherings with an annual audience of 5K offline, 800K online participants from more than 500 universities, and 100 countries. Since 2020, 15 Nobel Laureates, 15 breakthrough winners, eminent experts, innovators, leaders of international organizations and global businesses have participated in the yearly event of the Nobel Fest.\nThe Nobel Fest event planned to be held in Islamabad, it is expected that several Nobel Laureates, and CEO’s of global tech giants will join as speakers to interact with young students from Pakistan and other OIC member states through physical and virtual studios.",
  "retrievedAt": "2025-08-11T09:06:02.930Z"
}
