{
  "title": "Senate unanimously declares August 5, 2019 a ‘Black Day’ in solidarity with Kashmiri people",
  "link": "https://www.app.com.pk/national/senate-unanimously-declares-august-5-2019-a-black-day-in-solidarity-with-kashmiri-people/",
  "date_published": "2023-08-07T13:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): The Senate on Monday passed a unanimous resolution, terming August 5, 2019, as a ‘Black Day’ and expressing unwavering support for the innocent people of Kashmir residing on the other side of the line of control.\nThe resolution was presented by Senator Kamran Murtaza of Jamiat Ulema-e-Islam-Fazl.\nRecalling the historic moment, the Senate highlighted the abrogation of Articles 35-A and 370 of the Indian Constitution by the Bharatiya Janata Party (BJP)-led government on August 5, 2019. The move effectively stripped Jammu and Kashmir of its autonomy and led to the division of the state into two Union territories.\nThe Senate firmly rejected India’s actions, deeming them illegal and in direct violation of United Nations Security Council (UNSC) Resolutions.\nThe Senate expressed its deep concern over the blatant violation of human rights by the Indian government and the escalation of human rights violations by Indian occupation forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK). These actions were deemed to infringe upon the civil, political, economic, social, and cultural rights of the Kashmiri people.\nReaffirming the principles enshrined in the UN Charter, the Senate emphasized the importance of self-determination for all peoples. It underscored the significance of several unimplemented UNSC Resolutions on the Jammu and Kashmir dispute, asserting that the final resolution of the state’s status should be determined by the will of the people.\nThe Senate strongly condemned state-sponsored terrorism and crimes against humanity perpetuated by Indian occupation forces in IIOJK. It acknowledged the efforts of international human rights organizations and the media, as well as international parliamentary fora, particularly the European Parliament, for their steadfast concerns regarding the severe human rights violations in the IIOJK.\nCalling upon the global community to support the freedom struggles of the Kashmiri people, the Senate drew parallels to the international support extended to Ukraine during the Russian-Ukrainian conflict.\nIn light of these developments, the Senate recommended that the government of Pakistan should intensify its diplomatic endeavours to spotlight the Kashmir issue at the UNSC. It advised the government to regularly provide updates and issue joint communications to international human rights bodies regarding the evolving situation in the IIOJK.\nThe Senate’s unanimous resolution served as a resounding affirmation of Pakistan’s unwavering solidarity with the people of Kashmir and its commitment to advocating for their rights on the international stage.\nMeanwhile, Advisor to the Prime Minister on Kashmir Affairs Qamar Zaman Kaira praised Foreign Minister Bilawal Bhutto Zardari for passionately presenting the Kashmir case during his recent visit to India and voiced the issue in all forums he attended, raising global awareness about the severe human rights violations and annexation in the IIOJK.\nHe said, “Pakistan stands firmly with the Kashmiris until they achieve their right to self-determination.”",
  "retrievedAt": "2025-08-11T09:05:51.244Z"
}
