{
  "title": "No option for terrorists except to submit to writ of state: COAS",
  "link": "https://www.app.com.pk/national/no-option-for-terrorists-except-to-submit-to-writ-of-state-coas/",
  "date_published": "2023-08-07T13:25:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 7 (APP): Chief of Army Staff (COAS), General Asim Munir on Monday said the surge in terrorism in the recent past was a futile effort on the part of terrorists to get the talks re-initiated, however, there was no option for them except to submit to the writ of state before they were decimated, if they persisted on their wrong path.\nThe Army Chief made these remarks during his visit to Peshawar.\nThe COAS laid a floral wreath at Yaadgar-e-Shuhada at Fort Bala Hisar (Headquarters Frontier Corps Khyber Pakhtunkhwa – North) and offered Fatiha, an Inter Services Public Relations (ISPR) news release said.\nThe COAS met tribal elders from Newly Merged Districts (NMDs ) of Khyber Pakhtunkhwa as well as notables from all walks of life.\n“With the unflinching resolve of the Nation, Pakistan is successfully countering terrorism to enable a stable and peaceful environment for socioeconomic development in the area,” the COAS remarked.\nThe COAS reiterated, “Terrorism has no place in Pakistan and the involvement of Afghan nationals in terrorist incidents in Pakistan is detrimental to regional peace, stability and deviation from the Doha Peace Agreement by the interim Afghan Government.”\nHe also said, “Pakistan has concerns over sanctuaries available to banned outfits and liberty of action they enjoy on Afghan soil. Pakistan will spare no effort to dismantle terrorist networks and protect its citizens at all costs.”\nDuring an interactive session, the COAS paid rich tribute to the supreme sacrifices of brave and resilient tribals of Pakistan and appreciated their indomitable resolve for standing shoulder to shoulder with the Security Forces in defeating the menace of terrorism.\nTribal elders assured that the banned Tehreek-e-Taliban Pakistan (TTP) and its ideology would never be acceptable to any tribe and they would continue to stand with the state during the thick and thin.\nThe Army Chief emphasised the potential of NMDs and on going efforts in uplifting the socio-economic growth under the umbrella of Special Investment Facilitation Council (SIFC).\nHe also opined, “KP province is blessed with huge reserves of Mines & Minerals, also beautiful areas for tourism which will certainly change the destiny of the area for the good of the people.”\n“Pak Army stands with our tribal brothers and will never leave them alone as over the years they have given innumerable sacrifices for the peace and prosperity of the motherland. It’s time to develop all tribal areas and concentrate on youth,” the COAS said.\nHe reiterated the resolve of Pakistan Army, Frontier Corps and other Law Enforcement Agencies in their fight against terrorism, till the elimination of this menace from the country. He showed resolve to finish peril of narcotics which was becoming a lifeline for these TTP khawaraj (seceders).\nThe Army Chief said that propaganda by inimical forces against Armed Forces of Pakistan, would be dealt as per the law.\nPaying tribute to brave tribesmen, officers and soldiers of Pakistan Army, Frontier Corps (FC), Levies, Khasadars and Police, the COAS vowed that sacrifices of Shuhada would not go in vain and complete peace would return to Pakistan, InshaAllah (By the will of Almighty Allah).\nEarlier, upon arrival, the COAS was received by Commander Peshawar Corps.",
  "retrievedAt": "2025-08-11T09:06:00.721Z"
}
