{
  "title": "Interior Minister terms NACTA true reflection of anti-terrorism efforts",
  "link": "https://www.app.com.pk/national/interior-minister-terms-nacta-true-reflection-of-anti-terrorism-efforts/",
  "date_published": "2023-08-07T15:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 7 (APP): Interior Minister Rana Sanaullah Khan on Monday expressed his satisfaction with National Counter Terrorism Authority (NACTA)’s complete functioning as an institution and termed it the reflection of the country’s anti-terrorism efforts.\nThe Minister for Interior made these remarks while presiding over the fourth meeting of NACTA’s Board of Governors which was participated by Secretary Interior, Syed Ali Murtaza, DG FIA Mohsin Butt and members of the Board of Governors, a news release said.\nKhan said the reforms in the Authority were completed and it was performing its role in a befitting manner. He directed that in view of the resurgence of terrorism and recent events, a clear and comprehensive policy should be formulated immediately.\n“I hope that NACTA will spare no effort as a front-line organisation in counter-terrorism strides and all provinces and other relevant organizations will implement this strategy,” the Interior Minister said.\nHe vowed that the government of Pakistan would exterminate terrorism and extremism once and for all. “Inshallah, permanent peace and economic prosperity will return to the motherland,” he hoped.\nThe Interior Minister assured NACTA of his full support in that regard.\nNational Coordinator, NACTA Muhammad Tahir Rai gave a detailed briefing to the meeting. Rai informed the forum that based on the decision of the last meeting, the organization of NACTA was almost completed.\nHe said NACTA remained very active over the past year, whereas a national narrative was formulated on the basis of the Paigham-e-Pakistan Fatwa, which was essentially the foundation of Pakistani society.\n“NACTA will act as a frontline force to eradicate extremism from Pakistan. It will provide guidance, briefing to all concerned bodies,” he added.\nMoreover, various decisions related to NACTA were also approved in the meeting.",
  "retrievedAt": "2025-08-11T09:05:42.789Z"
}
