{
  "title": "BISP marks remarkable progress in alleviating poverty: Shazia Marri",
  "link": "https://www.app.com.pk/national/bisp-marks-remarkable-progress-in-alleviating-poverty-shazia-marri/",
  "date_published": "2023-08-07T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): Federal Minister for Poverty Alleviation and Social Safety (PA&SS) and Chairperson Benazir Income Support Programme (BISP), Shazia Marri Monday said that BISP has marked remarkable progress in alleviating poverty through achieving key milestones during the present government’s tenure.\nIn a statement issued here, the minister highlighted that Benazir Kafaalat programme, which provides essential financial support to deserving families, witnessed an impressive increase in coverage from 7.6 million to nine million families and this expansion reflects the programme’s commitment to inclusivity and reaching those most in need.\nIn a significant boost to the welfare of beneficiary families, the cash transfer stipend amount was increased by 25 percent, raising it from Rs 7000 to Rs 8750 per quarter per family. This increase has provided much-needed relief and support to vulnerable households.\nThe government’s commitment to social welfare was evident as the budgetary allocation for BISP was significantly increased from Rs 235 billion in FY 2021-22 to Rs 404.2 billion in FY 2022-23, representing a remarkable 72% increase.\nThis financial commitment underscores the government’s dedication to uplifting the less privileged.\nShe said BISP demonstrated exemplary financial management by disbursing Rs 404.2 billion during the last year, with a near-perfect utilization rate of 99.99%. This seamless disbursement mechanism ensured timely financial assistance to beneficiaries.\nA transformative step towards improving data accuracy and efficiency, the Dynamic Registry was launched for real-time socio-economic data updates. The transition from a static registry to a dynamic one with real-time updates ensured the most current information on beneficiaries. Notably, 2.8 million households were re-surveyed in the last five months alone.\nThe Benazir Taleemi Wazaif initiative saw a remarkable increase in children’s enrolment from 2.6 to 7.52 million, marking an astonishing 189% growth in educational development. This initiative fosters a brighter future for the young generation.\nBenazir Nashonuma coverage expanded to all districts from 15 pilot districts, resulting in a significant enrollment increase of 285%, reaching 0.85 million beneficiaries. This expansion highlights the programme’s commitment to providing healthcare support to vulnerable populations.\nInclusive Measures: In line with the principles of inclusivity and equality, the programme enrolled transgender persons, recognizing their rights and providing them with equal opportunities.\nThe BISP rapidly disbursed Rs 70 billion to 2.8 million flood-affected families, providing critical support at Rs 25,000 per family during the times of floods.\nAn essential fuel subsidy of Rs 16.3 billion was provided to 8.6 million families at Rs 2000 per household, easing their financial burden and ensuring access to necessary resources.\nThe Benazir Scholarships for Undergraduate Students increased from 82,000 to 92,003, empowering deserving students with access to higher education.\nDuring flood-related emergencies, a blanket Specialized Nutritious Food allocation of Rs 1 billion was provided to pregnant and lactating women and children under two years, ensuring their well-being.\nThe BISP collaborated with Provincial Governments to provide targeted wheat flour subsidy using BISP’s robust database and efficient payment delivery system.\nUnder a special initiative by the Government of Sindh, Rs 8.39 billion was disbursed among flood-affected farmers in the province, offering support during difficult times.\nThe Conditional Cash Transfer programme (Benazir Taleemi Wazaif and Benazir Nashonuma) now covers Balochistan, strengthening support to marginalized communities.\nTo ensure inclusivity, Mobile Registration Vehicles were introduced for surveys in far-flung, hard-to-reach areas, ensuring that no deserving family was left behind.\nThe Benazir Social Protection Accounts were launched by the prime minister in July, 2023. The initiative empowers deserving women to choose a bank of their choice, access to cheque books, debit cards and options to switch banks if necessary.\nLooking forward to the forthcoming year (FY 2023-24), Shazia Marri highlighted the programme’s next set of commitments under which the annual budget has been increased to Rs 471.68 billion, marking a substantial 17 percent increase, reaffirming the government’s dedication to poverty alleviation and social welfare.\nThe Benazir Kafaalat programme is set to increase its coverage from 9 to 9.3 million families, aiming for a 3% increase.\nThe budgetary allocation for the Benazir Kafaalat has also been augmented to Rs 361.5 billion, representing a 31% increase.\nBenazir Taleemi Wazaif aims to increase children’s enrolment from 7.52 to 9.2 million, accompanied by a budgetary allocation of Rs 55.4 billion, signaling a 38% rise in educational investment.\nBenazir Nashonuma coverage is planned to expand from 0.77 to 1.5 million beneficiaries, with a budgetary allocation of\nRs 32.27 billion, reflecting a 59% increase in healthcare support.\nShazia Marri expressed her gratitude to all stakeholders, including government officials, partner organizations, and the dedicated staff of BISP, for their unwavering support and commitment in achieving these transformative milestones.\nShe emphasized that these achievements and commitments reflect the government’s vision to create a more prosperous, inclusive, and equitable society for all.",
  "retrievedAt": "2025-08-11T09:05:53.396Z"
}
