{
  "title": "PR all set to upgrade Rawalpindi Railway Station",
  "link": "https://www.app.com.pk/national/pr-all-set-to-upgrade-rawalpindi-railway-station-2/",
  "date_published": "2023-10-29T09:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP): Pakistan Railways is all set to upgrade and commercialize the Victoria-era Rawalpindi Railway Station aimed at facilitating the passengers and making it the business hub, considering its location in the centre of business activities.\n“The Railway Station was built a century ago in a British style, the value addition to the station and its surroundings would make it commercially viable and would generate significant revenues for all the stakeholders involved”, an official in the Ministry told APP.\nHe said the upgrade was already decided in a meeting that reviewed the upgradation as well as commercialization plan of Rawalpindi Railway Station, and observed that the railway stations will remain important commercial hubs in the future, earning substantial revenue and generating economic opportunities at a large scale.\nThe official said that besides improving passenger facilitation, the redeveloping of Rawalpindi Railway Station can become a business hub.\nAs per the plan, he said around 100 kanal space available adjacent to Jinnah Road (City Saddar Road) would be commercialized, besides uplifting the railway station. However, the Victorian-era building depicting ‘Indo-Saracenic’ architecture will remain intact.\nHe said the main purpose of the plan is to redevelop the Rawalpindi Railway Station as a business hub and multi-model network; expand platforms and create separate cargo platforms; bring inside the retail space; service apartments and motels; connect it to all transport services; ensuring energy as well as water efficiency and commercially and financially viable interventions on the adjacent land.\nThe official said the main building of Rawalpindi Railway Station consisted of three sections including the freight section, the passenger section and the main offices.\nThe Railway Club building and Police Station are adjacent to the main building which has three separate entrances for regular passengers and baggage passengers.\nTo a question, he said that Pakistan Railways had already started to upgrade the five major railway stations across the country on modern lines to facilitate the passengers and help the department generate more revenue.\n“The purpose of upgrading the railway stations is to make them commercial hubs for business activities and facilitate the passengers,” he added.\nHe said the stations included Karachi, Lahore, Faisalabad, Peshawar and Quetta, while the department was taking other steps to improve the performance of Pakistan Railways and would provide maximum facilities to the masses.\nThe government had allocated Rs 50 million in the Public Sector Development Programme (PSDP), in the last three years for the up-gradation and renovation of railway stations across the country, he added.\nThe official said the renovation of the railway stations had been approved by the Central Development Working Party (CDWP) and the department had already upgraded six railway stations in different parts of the country.\nThe names of the upgraded railway stations were Bahawalpur, Raiwind, Narowal, Okara, Sahiwal and Gujranwala.\nThe basic aim of the upgrade was to facilitate the passengers improve the outlook and modernize the railway stations.\nPakistan Railways had upgraded the passenger waiting halls, prayer area, operation offices, water filtration plant, toilets, passenger shelter, platforms, ticket counters, parking area and external development work.",
  "retrievedAt": "2025-08-11T10:17:53.194Z"
}
