{
  "title": "24 hours left in government’s deadline for undocumented immigrants",
  "link": "https://www.app.com.pk/national/24-hours-left-in-governments-deadline-for-undocumented-immigrants/",
  "date_published": "2023-10-29T09:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP):The deadline for undocumented immigrants, including Afghan refugees, to return to their home countries on a voluntary basis was left only for twenty-four hours, after which the government’s crackdown against them will start in full swing.\nOn the caretaker government’s advice, about a month ago, thousands of Afghan refugees and other illegal immigrants of different nationalities started to return to their home countries, but many are still hiding to escape the government’s warning.\nAhead of the deadline, the interim minister for interior, Sarfraz Bugti, warned in his press conference of strict action against those trying to escape and the locals who will facilitate illegal immigrants in Pakistan.\nThe minister informed that the government collected data on all illegal immigrants across Pakistan through geo-fencing, and after the deadline, they will be detained in holding centres, where they will be forcibly deported to their home countries after necessary paperwork.\nAgainst the backdrop of the evacuation of illegal immigrants from Pakistan, the government of the UK also guaranteed the resettlement of 2,000 Afghan refugees in Britain.\nThe departure of Afghan refugees from Pakistan under resettlement operations started on October 26 through chartered flights.\n12 special charter flights will shift 2,000 refugees to Britain by the end of December, as one weekly flight will depart for the UK carrying 200 passengers.\nCivil Aviation of Pakistan had established special counters for Afghan refugees for their facilitation at Islamabad Airport.\nFor the flights, the landing and take-off arrangements were made in mutual consultation between the British authorities and the CAA.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:18:17.043Z"
}
