{
  "title": "President Alvi congratulates Turkiye people on 100th anniversary",
  "link": "https://www.app.com.pk/national/president-alvi-congratulates-turkiye-people-on-100th-anniversary/",
  "date_published": "2023-10-29T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP):President Dr Arif Alvi on Sunday congratulated the President and people of Turkiye on the occasion of the 100th anniversary of the country.\n“On behalf of the people of Pakistan and the government of Pakistan, I would like to extend my warmest congratulations to President Recep Tayyip Erdogan on the auspicious occasion of 100th anniversary of Republic of Turkiye which was found on October 29 in 1923 under the charismatic leadership of Mustafa Kemal Ataturk, the great leader of Turkiye,” President Alvi said in his video message.\nHe said the relationship between Pakistan and Turkiye had been very old, even before the formation of Turkiye and Pakistan when there was a great friendship of people of this region and the people Turkiye.\nHe highlighted that the good relationship was evident from the fact that people along with relief goods from this region were sent to fight along with them in the Russian battle which Turkiye had always reciprocated.\nThe president believed that a tremendous progress had been made under the outstanding leadership of Tayyip Erdogan while at the same time there had been a great leadership shown in the issues of the Muslim world by the current Turkiye leadership.\nThe outstanding friendship between Pakistan and Turkiye is based on mutual understanding on world issues as well as Turkiye stood by us on Kashmir, the president said.\nHe said the Turkish president had taken bold stance on the recent brutal events happening in Gaza. He believed that the Muslim world would also take a bold stance on this very painful issue of Gaza and on the issue of Kashmir as well.\nThe president said the world had forgotten how the Muslims had always welcome people from all all religions in Anatolia and Andalus throughout history.\n“I believe tremendous progress has been shown by my brother in Turkiye and I must express a brotherly bond between both our people which is everlasting and which will hold forever,” he remarked.",
  "retrievedAt": "2025-08-11T10:17:56.107Z"
}
