{
  "article_id": "2025-02-05_0cb7527a12128abbc8ad911357ab28e3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nation-stands-with-kashmiris-in-their-struggle-for-freedom-dr-musadik-malik/",
    "retrieved_at": "2025-08-27T12:24:34.975Z"
  },
  "metadata": {
    "title": "Nation stands with Kashmiris in their struggle for freedom: Dr. Musadik Malik",
    "author": null,
    "date_published": "2025-02-05T07:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 234,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 05 (APP): Federal Minister for Petroleum Dr. Musadik Malik on Wednesday reaffirmed the nation's unwavering support for the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) in their struggle for freedom from Indian forces. Addressing a Kashmir Solidarity Day Walk from the Ministry of Foreign Affairs (MOFA) to D-Chowk, he said that Pakistan remains committed to UN resolutions on Kashmir and will stand with Kashmiris until their freedom from Indian occupation. Dr. Musadik Malik described Kashmir as a paradise on earth, stating that its natural beauty rivals any other country's. However, he lamented that Indian forces have turned the region into a living hell through grave human rights violations and crimes against humanity, particularly targeting women and children. He further asserted that had UN resolutions on Kashmir been implemented, children in IIOJK would have received education in top global institutions, and the region would have developed into a premier tourist destination. Instead, Indian forces have turned the valley into a war zone. Criticizing India's claim of being the world's largest democracy, he said that New Delhi has continuously denied Kashmiris their right to self-determination as promised by the United Nations. \"We strongly condemn the atrocities committed by Indian forces in Indian Illegally Occupied Jammu and Kashmir,\" he said, adding that Prime Minister Shehbaz Sharif's visit to Azad Jammu and Kashmir today is a demonstration of Pakistan's solidarity with the Kashmiri people.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}