{
  "article_id": "2025-02-05_c0beb0646c154a9cb9960d760d3e89a0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-reaffirms-solidarity-with-kashmiri-people-on-kashmir-solidarity-day-2/",
    "retrieved_at": "2025-08-27T12:25:05.137Z"
  },
  "metadata": {
    "title": "Pakistan reaffirms solidarity with Kashmiri people on ‘Kashmir Solidarity Day’",
    "author": null,
    "date_published": "2025-02-05T14:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 276,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 05 (APP): The Government and people of Pakistan on Wednesday observed the 'Kashmir Solidarity Day', expressing their resolve to stand with the Kashmiri people in their just struggle for the realization of their right to self-determination. In their special messages on the occasion, the President, the Prime Minister and the Deputy Prime Minister and Foreign Minister highlighted Pakistan's unwavering moral, diplomatic and political support to the Kashmir cause, a Foreign Office news release said. The Deputy Prime Minister and Foreign Minister addressed letters to the President of the UN Security Council and General Assembly, the UN Secretary-General, the UN High Commissioner for Human Rights and the OIC Secretary-General on the situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). Calling for implementation of relevant UN Security Council resolutions, the Deputy Prime Minister and Foreign Minister emphasized for holding a fair and impartial plebiscite in Jammu and Kashmir under the UN auspices to determine the will of the Kashmiri people. He also urged the UN and OIC leadership to play their role in improving the human rights situation in IIOJK. Ahead of the Kashmir Solidarity Day, a briefing was organized for Islamabad-based diplomats to apprise them of the situation in IIOJK. The officers and staff members of the Ministry, led by the Foreign Secretary, participated in the 'Solidarity Day Walk' held on the Constitution Avenue, earlier today. A wide range of other activities, including seminars, webinars, public rallies and photo exhibitions are being organized across the country, and at Pakistan's diplomatic missions around the world. These activities are aimed at expressing solidarity with the Kashmiri people and highlighting the human rights violations in IIOJK.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}