{
  "article_id": "2025-02-05_793f47b7759dbd6f800cb3449ccb17cd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/president-zardari-zhao-leji-underscore-time-tested-pak-china-ties/",
    "retrieved_at": "2025-08-27T12:24:08.692Z"
  },
  "metadata": {
    "title": "President Zardari, Zhao Leji underscore time tested Pak-China ties",
    "author": null,
    "date_published": "2025-02-05T11:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 181,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "BEIJING, Feb 05 (APP): President Asif Ali Zardari and Chairman of the Standing Committee of National People's Congress, Zhao Leji on Wednesday underscored the time-tested and all-weather friendship between the two countries, which continued to grow in depth and scope over the decades. The president met with Chairman of the Standing Committee of the National People's Congress of the People's Republic of China, Zhao Leji, President Secretariat Press Wing said in a press release. They also underlined strategic mutual trust as the cornerstone of the China-Pakistan relationship and emphasized the importance of continued high-level exchanges to further deepen the ongoing practical cooperation. The two sides also discussed the high-quality development of CPEC 2.0, with a particular emphasis on promoting cooperation in science & technology, renewable energy, infrastructure and agriculture sectors. They described CPEC as a shining example of people-centric development, with its focus on win-win cooperation, shared benefits and common prosperity. The two sides discussed the opportunities to strengthen institutional linkages, including through parliamentary exchanges and participation in the CPEC Political Parties Joint Consultative Mechanism, to further solidify the bilateral cooperation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}