{
  "title": "Easter Celebration: Zulfikar Bukhari distributes ration, medical supplies among Christian community",
  "link": "https://www.app.com.pk/national/easter-celebration-zulfikar-bukhari-distributes-ration-medical-supplies-among-christian-community/",
  "date_published": "2020-04-12T06:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):Special Assistant to the Prime Minister on Overseas Pakistanis and Human Resource Development Sayed Zulfikar Abbas Bukhari Sunday joined the Easter celebration of Christian community at the federal capital to promote the religious harmony in the country.\nHe visited Christian colonies at the sectors H-9 and G-7 and extended the Easter greetings to its dwellers. More than 1,000 ration parcels and medical supplies were distributed among the poor and needy families of multiple slums of the federal capital.\nSpeaking on the occasion, Zulfikar Bukhari said he had decided to launch a ration distribution campaign at the slums of Islamabad where a large number of people had been facing financial implications due to a partial lock-down, enforced in the city in wake of the coronavirus threat.\nHe said the representatives of the Christian community had been asked to provide the complete data of people living in the city’s ‘Katchi Abadis’ so that an uninterrupted supply of food could be ensured to them.\nThe special assistant urged the philanthropists and overseas Pakistanis to join the government’s relief efforts so that the most vulnerable could be protected in this hour of distress.\nHe hinted to disinfect all the slums of Islamabad to ensure protection of its residents’ lives by sanitizing their homes, churches, streets and other specific places.\nAll the religious groups should join hands to fight the coronavirus in Pakistan, he remarked.\nZulfikar Bukhari pointed out that the government was taking concentrated measures to stem spread of the COVID-19. All out efforts were being made to support the lock-down-affected families financially, he added.\nHe said a website was also being launched to facilitate the overseas Pakistanis to donate to the Prime Minister’s COVID-19 Pandemic Relief Fund, set up recently to support the lockdown-affected people in the country.\nZulfikar Bukhari asked the overseas Pakistanis to donate for the PM’s Corona Relief Fund at the covid.ophrd.gov.pk.\nThe people, who received the ration, thanked the government for taking care of poor in such testing time.\nA woman at G-7 slum, requesting anonymity, said she had spent all her savings in the last two weeks as there was no work available at the moment.\nShe appreciated the government and philanthropists for supporting the needy in such tough times.",
  "retrievedAt": "2025-08-11T19:05:12.609Z"
}
