{
  "title": "Fawad lauds Pakistani engineering talent for manufacturing ventilators",
  "link": "https://www.app.com.pk/national/fawad-lauds-pakistani-engineering-talent-for-manufacturing-ventilators/",
  "date_published": "2020-04-12T04:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):Minister for Science and Technology, Chaudhry Fawad Hussain on Sunday lauded the role of Pakistani engineering talent for manufacturing ventilators in the country. Talking to a private news channel programs, the minister said that Pakistan Engineering Council had received 48 design of ventilators. The design has been forwarded to Drug Regulatory Authority of Pakistan (DRAP) for necessary procedure, he added. The trial of indigenously made ventilators would be conducted in public sector hospitals, he stated. “I am so proud of the initiatives of Pakistani engineers, technicians and scientists, who would made this task successful within a week, “ he said. The ministry of science and technology has given the task to the engineering council for preparation of ventilators, he disclosed. The cost of the ventilators would be affordable as compared to other countries. The commercial use of the ventilators at the initial stage would not be permitted. The final approval of design would be given on Monday so that the project could be made functional in the hospitals by the end of next week, he said. Commenting on performance of the young engineering boys and girls, he said we have talented engineers and technicians who are fully capable to manufacture complex machinery and testing kits. Comparing capacity of neighboring country regarding ventilators, Fawad Chaudhry said India was importing the ventilators from China for using in hospitals to tackle coronavirus patients, while the most developed countries like America was also purchasing the essential item now a days, from China. The federal minister revealed that we had some 2700 ventilators, in which, some 1000 were found out of order.\nHe appreciated the Pakistani engineers and technicians for using expertize and converting this dysfunctional equipment to functional.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:05:14.526Z"
}
