{
  "title": "PM Ehsaas Kafalat Program to help poor, daily wagers peoples: Murad Saeed",
  "link": "https://www.app.com.pk/national/pm-ehsaas-kafalat-program-to-help-poor-daily-wagers-peoples-murad-saeed/",
  "date_published": "2020-04-12T04:55:00.000Z",
  "source": "APP",
  "content": "SWAT, Apr 12 (APP)::Federal Minister for Communications and Postal Services Murad Saeed Sunday said that under the Prime Minister Ehsaas Kafaalat Program Rs 200 billion was being distributed among over seven million families which would somehow help them in the present circumstances.\nIn a statement issued here, the minister said Rs 12000 to each deserving family during the lock down due to outbreak of coronavirus would help to reduce their difficulties.\nHe said under a planned mechanism established in each district of the country, thousands of rupees had been distributed so far. The minister said that the program was for poor, orphans, widows, homeless, disabled people who were missing medical facilities, unemployed, poor farmers, laborer, ill or under nutrition, students from poor families, and poor women and elderly people who were currently being affected.\nWhile appreciating the Prime Minister Imran Khan for his visionary approach, he said that it was the largest relief package in the history of the country to resolve the problems of the poor people. He asked all the deputy commissioners at the district level to prevent illegal cuts from poor people’s money in cash distribution.\nHe said there were complaints from the people of Swat that the distributing staffs were involved in illegally cash cuts of Rs 200 to 600 on receipt of cash.\nOn this, the minister took immediate action and asked the DC Saqib Raza Aslam, and Deputy Commissioners of other areas to issue directives for the immediately arrest of those involved in such cuts from the poor and needy people. Those looting the poor and needy people, who are already suffered badly due to the coronavirus pandemic, would not be spared at any cost.",
  "retrievedAt": "2025-08-11T19:05:13.146Z"
}
