{
  "title": "Rs. 22.466 billion disbursed among 1.77 million poverty-stricken families till Sunday afternoon: Dr. Nishtar",
  "link": "https://www.app.com.pk/national/rs-22-466-billion-disbursed-among-1-77-million-poverty-stricken-families-till-sunday-afternoon-dr-nishtar/",
  "date_published": "2020-04-12T07:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania said that the government has distributed an amount of Rs. 22.466 billion among 1.77 million individuals under Ehsaas Emergency Cash Program till today afternoon since the beginning of the payment process.\nThis she disclosed in a media briefing on Sunday about on-the ground progress of the emergency cash payments.\n“It has been four days, since Ehsaas started one-off cash distribution of Rs. 12,000 each to the low-income households in all provinces of Pakistan including Gilgit Baltistan and Azad Jammu and Kashmir from Thursday.\nEhsaas Emergency Cash program is the largest ever social protection and relief operation in the history of Pakistan aimed to help alleviate sufferings of low-income households, who have been distressed by the coronavirus shut down across the country.\nMentioning the hurdles being faced in smooth delivery of payments, Dr. Nishtar said few agents deducted the amount from the cash payment of Rs. 12,000 of the beneficiaries which will not be tolerated at all.\nShe warned that strict action will be taken against whosoever responsible for exploiting the innocent people. FIRs have been registered against 40 agents and were sent to the jails also.\nThe beneficiaries are also facing issues at some payment centers due to long queues, she said while urging those to reach payment centers only who received the message from the authorities with mention of date and time.\nDr. Nishtar informed that out of 17,000 payment centers, half of these have been opened while the others were delayed due to the lockdown restrictions in the provincial areas.\nShe said we are in efforts to open the rest of the payment centers in coordination with provinces through opening banks so that the crowding can be avoided in view of preventing Coronavirus.\nDr. Nishtar explained that this assistance is only for those daily wagers or piece-rate workers whose work has been severely affected due to the lockdown while those whose salaries have been stopped are not eligible for this amount.\nShe urged the people who have not received the message yet should wait at home. Do not proceed to centers unless you receive the message mentioning the payment center, time and date of receiving payment.\nDr. Nishtar urged those facing problems to contact call center of Ehsaas Emergency Cash program.\nA sudden surge in the number of incoming calls in the Ehsaas call centre was observed soon after the Ehsaas Emergency Cash advertisements appeared in the newspapers today.\nDr. Nishtar sat with call centre operators today and interacted with the callers on the phone to get the better sense of what callers were asking about the program.\n“I wanted to hear first-hand about people’s complaints pertaining to Ehsaas Emergency Cash distribution, so that we can make improvements in the program in real time”, she said.\nOn average 1,500 calls are being received on the daily basis in the call centre and this number has increased since the advertisement appeared.\nMostly people were asking about when the payment messages would be received; millions of people have received messages stating that they are eligible but that they need to wait for the “payment message”.\nIn this regard, people want to know what the timelines is, and the Call centre is proving very useful in giving out details.\nDr. Nishtar was briefed that some of those who have received regrets want to make appeals. Family members of eligible households whose heads of family had died wanted to know how they could be helped. Staff in the Call Centre is regularly briefed about the program so that they can answer questions with clarity.\nDr. Nishtar thanked the Call Centre staff for their dedication and hard work and spent a lot of time with the staff to get insights and boost their morale.\nThe government has deployed biometric technology along with other COVID-19 precautionary measures, to ensure the safe and transparent delivery of emergency cash.",
  "retrievedAt": "2025-08-11T19:05:09.366Z"
}
