{
  "title": "President lauds authorities’ collective efforts over coronavirus infection in GB",
  "link": "https://www.app.com.pk/national/president-lauds-authorities-collective-efforts-over-coronavirus-infection-in-gb/",
  "date_published": "2020-04-12T09:53:00.000Z",
  "source": "APP",
  "content": "SKARDU, Apr 12 (APP):President Dr Arif Alvi Sunday said that no casualty from the coronavirus infection had been reported in Gilgit Baltistan whereas recovery of 78 patients out of total 83 infected with virus, reflected the success of close coordination among various departments.\nThe president arrived here on a brief visit to chair a meeting on the coronavirus situation, a press release said.\nAddressing the participants, the president said that he had also brought testing kits and other necessary equipment which would further help in the efforts against the novel coronavirus.\nHe also stressed upon the authorities to formulate a mechanism with close cooperation of Ulema for minimizing gatherings during the month of Ramzan.\nSpecial assistant to PM Dr Zafar Mirza briefed the president about the coronavirus situation in Skardu and said that testing facility in the area would be enhanced from 5,000 to 25,000.\nDr Mirza further apprised that they would send a high level team from the federal capital that would review the epidemic diseases in Gilgit Baltistan.\nHe also assured that he would take up with the prime minister, the issue of special grant to control coronavirus in Gilgit Baltistan.\nOn the occasion, chief minister Hafiz Hafeez ur Rehman and commissioner also briefed the president about measures taken by the provincial government to control coronavirus infection.\nGovernor Gilgit Baltistan Raja Jalal Hussain Maqpoon, federal minister Usman Dar, Chairman NDMA Lt. Gen. Muhammad Afzal, Force Commander Major General Ahsan Mahmood, chief organizer PTI Saifullah Khan Niazi and other senior officials also attended the meeting.",
  "retrievedAt": "2025-08-11T19:05:09.207Z"
}
