{
  "title": "CDA on toes to clear rainwater from Diplomatic Enclave - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The operation to pump out rainwater from portion of Diplomatic Enclave continued on the third consecutive day on Tuesday with the CDA also searching for the “missing culvert” to drain out the water.\n\nThe Diplomatic Enclave houses foreign missions and embassies. However, for the last few days, rainwater has accumulated in a portion of the enclave.\n\nCDA through tankers and other means has been making all-out efforts to pump out the water and so far its teams have managed to reduce the accumulated water to a significant extent. But it seems, the operation would continued on Wednesday as the culvert still remains untraced.\n\nIt is first time that Diplomatic Enclave has faced such a flooding.\n\nCivic team making efforts to trace missing culvert to dewater area\n\nRecently, CDA completed “fast track” multi-billion Jinnah Square Interchange project and many officials believe during its construction an old culvert under the road, which used to take out all storm water from Diplomatic Enclave to Rawal Dam, was blocked when tonnes of debris and surplus earth was dumped over there.\n\n“If this is the case, action should be taken against responsible officials of CDA as why the culvert was overlooked,” said a source.\n\nMeanwhile, CDA kept both sides of Srinagar Highway from Serena area to Murree Road closed as excavation work was in progress to find out the culvert.\n\nDue to blockage of the portion of the road, motorists used Kashmir Chowk roundabout to move towards Murree side. Traffic coming from Murree side also used the roundabout to enter Srinagar Highway.\n\nRecently, rainwater also accumulated beneath the Serena underpasses; however, CDA managed to clear it after half an hour.\n\nOn the other hand, rainwater is still present on a greenbelt which is about 400 metres long and 50 metres wide inside the enclave, raising question marks over the efficiency of the CDA.\n\n“Efforts are afoot to trace out the culvert and we are almost very near to it. But, I would say that choked sewage lines are also one of the main reasons behind the accumulation of rainwater inside Enclave,” said an official of CDA.\n\nOne of the European embassies faced flooding as rainwater had entered its basement; however, it was later drained out. Sources said diplomats of the embassy also took up the issue with the federal government.\n\nOn Monday, CDA’s member engineering Syed Nafasat Raza Shah had told Dawn that all-out efforts were being made to resolve the issue.\n\nHe said it would be premature to say that the culvert was blocked during the construction work on Jinnah Square. “We are trying to diagnose the problem. We are checking it out; we are checking if there was a culvert. If so how it was desilt…we are getting Google image as well,” he had said.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686d8e6e0f305.jpg",
  "retrievedAt": "2025-08-17T20:01:55.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922883/cda-on-toes-to-clear-rainwater-from-diplomatic-enclave",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:56.000Z"
}
