{
  "title": "Speeding likely cause of Diogo Jota car crash: police - Sport - DAWN.COM",
  "author": null,
  "content": "MADRID: Liverpool and Portugal star Diogo Jota was likely speeding when his car veered off a motorway in Spain last week killing him and his brother, Spanish police said on Tuesday.\n\nThe shock deaths of Jota, 28, and Andre Silva, 25, on July 3 plunged the football world into mourning, less than two weeks after the striker had got married.\n\nAn ongoing investigation is examining “the marks left by one of the vehicle’s wheels… everything points to a possible excessive speed beyond the road’s speed limit”, the Civil Guard said.\n\n“All the tests conducted so far indicate that the driver of the vehicle was Diogo Jota,” it added.\n\nSpeed limits on Spanish motorways are generally set at 120 kilometres per hour (75 miles per hour).\n\nThe site of the accident on the A-52 route in the northwestern province of Zamora was on a stretch of fairly straight road approaching a bend.\n\nThe force had previously said a tyre had probably blown out while the vehicle was overtaking, causing it to crash and burst into flames in the northwestern province of Zamora.\n\nJust hours before the accident, Jota had posted a video of his June 22 wedding to partner Rute Cardoso, with whom he had three children.\n\nThe deaths sparked an outpouring of grief, particularly in the brothers’ native Portugal and at Jota’s Premier League club Liverpool.\n\nPolitical leaders as well as star players from Portugal and Liverpool joined family and friends at the funeral on Saturday in the Porto suburb of Gondomar.\n\nFollowing spells at Atletico Madrid, Porto and Wolverhampton Wanderers, Jota became a fan favourite at Liverpool after joining the Premier League giants in 2020.\n\nHe netted 65 times for the Reds in five seasons, lifting the League Cup and FA Cup in 2021/22 and helping them win a record-equalling 20th English league title last season.\n\nThe striker also earned 49 caps for Portugal and was part of the team that won this year’s UEFA Nations League.\n\nYounger brother Andre played in midfield for FC Penafiel in Portugal’s second tier.\n\nMeanwhile, Liverpool’s stars also returned to training on Tuesday for the first time since the tragic incident. The Premier League champions postponed the start of pre-season training.\n\nMohamed Salah, Andy Robertson, Conor Bradley and Wataru Endo were among the players pictured arriving at the training ground.\n\nA site of remembrance has been set up at the club’s iconic Anfield stadium where hundreds of bouquets of flowers, shirts, scarves and pictures have been left by fans and former players in recent days.\n\nLiverpool’s first pre-season friendly is scheduled for Sunday away at Championship side Preston.\n\nBut ticket sales for that match have been suspended pending a final decision on whether the match will go ahead.\n\nLiverpool are then due to go on an Asian tour, playing AC Milan in Hong Kong and Japanese side Yokohama Marinos before the end of the month.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/091113597ed5c8c.png",
  "retrievedAt": "2025-08-17T20:02:39.379Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922939/speeding-likely-cause-of-diogo-jota-car-crash-police",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:31.000Z"
}
