{
  "title": "Govt forms body to slash container dwell time - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Federal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry has announced the formation of a high-level committee to devise concrete measures aimed at reducing container dwell time at ports by up to 70 per cent.\n\nThe decision was made during a meeting held at the Federal Board of Revenue (FBR) headquarters, chaired by the minister and attended by FBR Chairman Rashid Mahmood Langrial, along with senior officials and technical representatives from the Ministry of Maritime Affairs, FBR, Customs, and Karachi Port Trust (KPT).\n\nUmer Zafar Sheikh, Additional Secretary at the Ministry of Maritime Affairs, will lead the newly formed committee. It will comprise representatives from all key stakeholders, including KPT, Pakistan Customs, terminal operators, FBR, and other relevant ministries and departments.\n\nMinister Chaudhry stated that, following the directives of Prime Minister Shehbaz Sharif, container dwell time at port terminals will be reduced from one week to just two days. The committee has been tasked with identifying procedural bottlenecks and streamlining cargo clearance processes, with a comprehensive set of recommendations expected within ten days.\n\nTo support these efforts, a monitoring room is being set up at the Ministry of Maritime Affairs to oversee container movement and handling timelines. A dedicated team will manage the monitoring process, while drones and artificial intelligence (AI) will be deployed to track vessel docking through to the container exit from the terminal.\n\nThe minister emphasised that reducing dwell time is not just an administrative reform but a strategic initiative to boost port efficiency, reduce logistics costs, and enhance Pakis­tan’s competitiveness in regional trade and logistics.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/07/10083012aa39a3a.jpg?r=084258",
  "retrievedAt": "2025-08-17T20:02:54.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922981/govt-forms-body-to-slash-container-dwell-time",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:25.000Z"
}
