{
  "title": "Asfandyar Wali wins damages suit against Shaukat Yousafzai - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: A local court has decreed a defamation lawsuit of Awami National Party former president Asfandyar Wali Khan against former provincial minister and leader of Pakistan Tehreek-i-Insaf Shaukat Ali Yousafzai to the tune of Rs1 million as damages.\n\nAn additional district judge, Liaqat Ali, ruled that plaintiff Asfandyar Wali Khan had got a cause of action and was entitled to the decree.\n\nWhile Mr Asfandyar sought recovery of Rs100 million as damages and Rs50 million as aggravated damages, the court decreed the suit only to the tune of Rs1 million as general damages.\n\nMr Asfandyar had sued the PTI leader through his counsels Tariq Afghan and Sajeed Afridi, for alleging in a presser on July 25, 2019, that the ANP chief had “sold Pashtuns for $25 million.”\n\nPTI leader had accused ANP leader of ‘selling Pashtuns for $25m’\n\nMr Yousafzai was the spokesman for the then PTI government in Khyber Pakhtunkhwa.\n\n“Any false statement against the leader of a party with stature of Asfandyar Wali Khan, definitely hurts the reputation of the leader but also hurts the feelings of vast majority of workers, who always look at their leader as a man of principles and character and rightly do so,” the court observed in its 11-page detailed judgement.\n\nThe counsels for Mr Asfandyar told the court that their client was the son of Pakhtun leader Khan Abdul Wali Khan and the grandson of Pakhtun leader Bacha Khan, both prominent leaders of international repute in the Independence Movement.\n\nThey said that Mr Asfandyar had served as a member of National Assembly four times and as a senator and a member of KP Assembly once.\n\nThe lawyers insisted that the defendant made the defamatory accusation against their client intentionally to “adversely affect his reputation in the public mind and lower his status in public.”\n\nThe defendant, Shaukat Yousafzai, alleged that the suit had been brought by the plaintiff just to harass, humiliate and give mental torture to him.\n\nHe claimed that he had only quoted the words and phrases used by the leader of ANP namely late Mohammad Azam Khan Hoti published in different newspapers as well as uttered in different talk shows and that no opinion or statement was made by him in personal capacity against the plaintiff, therefore, he couldn’t be held responsible for the said allegations.\n\nThe judge observed that perusal of the extracts of the news made it clear that no reference to statement of Mohammad Azam Hoti had been given by the defendant, rather plain statement had been recorded that ‘Asfandyar Wali had sold Pashtuns for $25 million.’\n\nThe court observed that during cross examination, the defendant had admitted that in the newspapers concerned, there was no reference to allegations made by Mr Hoti.\n\n“Defendant himself had been associated with print media for a long time, before coming to politics. Had there been any misstatement or incomplete statement he should have corrected the same,” the judge ruled.\n\nThe judge further observed that the defendant in his written statement as well as in his earlier statement expressed respect towards plaintiff and his family, which provided grounds to substantially reduce the quantum of damages.\n\n“Yet the fact remains that defendant should have avoided issuing allegations that are not based upon solid grounds,” the judge observed.\n\nThe court also overruled the defendant’s stance that legal action should have been taken against Mr Hoti instead of him, observing that a responsible minister should not pass on allegations of serious nature without proof.\n\nIt is pertinent to mention that last year the court had decreed the suit in favour of Mr Asfandyar ex-parte, however, on the application of the defendant the suit was again restored and the defendant was allowed to put forward his defence.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/03/19105334425b420.jpg?r=110046",
  "retrievedAt": "2025-08-17T20:01:46.237Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922914/asfandyar-wali-wins-damages-suit-against-shaukat-yousafzai",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:57:01.000Z"
}
