{
  "title": "Musk’s AI firm deletes Grok posts after anti-Semitism criticism - World - DAWN.COM",
  "author": null,
  "content": "Billionaire Elon Musk’s artificial intelligence startup on Wednesday removed posts made by its chatbot Grok on X after it came under fire for anti-Semitic content.\n\nConcerns over political bias, hate speech and factual inaccuracy in AI chatbots have mounted since the launch of OpenAI’s ChatGPT in 2022.\n\n“We are aware of recent posts made by Grok and are actively working to remove the inappropriate posts,” said a post attributed to the AI system on Musk’s social media platform X, where the bot can be accessed.\n\n“Since being made aware of the content, xAI has taken action to ban hate speech before Grok posts on X.”\n\nThe firm said xAI was training the bot for “only truth-seeking” and thanked its users for helping the company identify the inappropriate posts.\n\nScreenshots posted on X showed several posts made by the bot in which it praised Adolf Hitler, and claimed Jews promoted “anti-white hate”.\n\nThe chatbot, developed by Musk’s company xAI, was criticised by Jewish activist group Anti-Defamation League (ADL) for answering multiple user prompts with the questionable posts.\n\n“What we are seeing from Grok LLM right now is irresponsible, dangerous and anti-Semitic, plain and simple,” the ADL said on X.\n\n“This supercharging of extremist rhetoric will only amplify and encourage the anti-Semitism that is already surging on X and many other platforms.”\n\nMusk has not commented on the controversy, but posted: “Never a dull moment on this platform.”\n\nGrok, which Musk promised would be “edgy” following its launch in 2023, has been mired in controversy.\n\nIn May, it caused a row for generating misleading and unsolicited posts referencing “white genocide” in South Africa, which xAI blamed on an “unauthorised modification”.\n\nSeparately, a Turkish court on Wednesday blocked access to some content from Grok after authorities said the chatbot generated responses insulting President Recep Tayyip Erdogan, modern Turkiye’s founder Mustafa Kemal Ataturk and religious values.\n\nAnkara chief prosecutor’s office said it launched an investigation, and marked Turkiye’s first such ban on content from an AI tool.\n\nAuthorities cited violations of laws that make such insults a criminal offence punishable by up to four years in prison.\n\nNeither X, nor its owner Elon Musk could immediately be reached for comment. They have not referred to the decision on the platform.\n\nLast month, Musk promised an upgrade to Grok, suggesting there was “far too much garbage in any foundation model trained on uncorrected data”.\n\nGrok, which is integrated into X, reportedly generated offensive content about Erdogan and Ataturk when asked certain questions in Turkish, media said.\n\nThe Information and Communication Technologies Authority (BTK) adopted the ban after the court order.\n\nTransport and Infrastructure Minister Abdulkadir Uraloglu was later cited by broadcaster NTV as saying that Turkiye had not yet imposed a total access ban on Grok but that it would do so if necessary, adding Turkish authorities would discuss the issue with X.\n\nYaman Akdeniz, a cyber law expert at Istanbul Bilgi University, said authorities had identified some 50 posts by Grok as the basis for the investigation, ruling on the access ban and removal of certain content to “protect public order”.\n\n“Turkiye has become the first country to impose censorship on Grok,” he said on X.\n\nTurkiye has in recent years significantly increased oversight on social media platforms and online streaming services, passing laws to give authorities more control over content, detaining or arresting individuals for posts, launching probes into companies and limiting or blocking access to certain sites.\n\nCritics say the law is frequently used to stifle dissent, while the government maintains it is necessary to protect the dignity of the office.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/0914232570c2fdb.jpg",
  "retrievedAt": "2025-08-17T20:00:35.403Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923046/musks-ai-firm-deletes-grok-posts-after-anti-semitism-criticism",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T15:00:04.000Z"
}
