{
  "title": "New Delhi ‘lied’ to public about Pahalgam attack, Bilawal tells Indian journalist - Pakistan - DAWN.COM",
  "author": null,
  "content": "In an exclusive interview with Indian journalist Karan Thapar, PPP Chairman and former foreign minister Bilawal Bhutto Zardari on Wednesday said the Indian public was “lied to” by New Delhi about Pakistan’s alleged involvement in the Pahalgam attack in occupied Kashmir.\n\nThe statement comes amid tensions between the two nuclear-armed countries in the wake of their recent military confrontation, sparked by New Delhi’s baseless allegations against Islamabad over the Pahalgam attack.\n\nIn an interview with The Wire’s Thapar, the PPP chief said that had Pakistan been involved in the attack, evidence would have surfaced and the perpetrators identified.\n\nThis is the first interview given by a Pakistani representative to Indian media since the military escalation.\n\n“As far as the Pahalgam terrorist attack is concerned, Pakistan has been willing to be part of an impartial international investigation; your government refused that,” Bilawal said.\n\nNotably, Bilawal led a delegation to present Pakistan’s case across the globe in the wake of the confrontation.\n\n“To this day, the Indian government has not shared with Pakistan, with the international community, with the Indian public … who exactly are these individuals that were involved in this terrorist attack that are from Pakistan?”\n\nWhen pressed on the issue, Bilawal said that if Pakistan was truly involved, the international community would endorse India’s perspective.\n\n“It’s very uncomfortable for you that I point out the truth to the Indian public, that they have been lied to … that Pakistan was involved in this attack when we were not,” he asserted.\n\n“The government has been unable to provide the evidence. That’s why during this war, the Indian media and the Indian government launched a campaign of disinformation to continue to bamboozle the people of India,” he added.\n\nLast Friday, Bilal had told Al Jazeera that Pakistan had no objection to extraditing “individuals of concern” — namely Laskhar-i-Taiba (LeT) chief Hafiz Saeed and Jaish-i-Muhammad (JeM) chief Masood Azhar — to India as a confidence-building measure, as long as New Delhi showed willingness to cooperate in the process.\n\nWhen Thapar asked about Saeed and the 2008 Mumbai attacks, Bilawal highlighted that the LeT chief was in prison and that the Mumbai attack case was still ongoing.\n\nThe attacks of November 26, 2008, targeting the symbols of India’s economic capital, including luxury hotels, left 166 people dead and more than 300 injured.\n\n“As far as Hafiz Saeed is concerned, the founder of Lashkar-e-Taiba, he was sentenced to 31 years in prison for terrorist financing in April 2022 by Pakistan,” Bilawal said.\n\n“As far as the Mumbai attack case is concerned, it’s absolutely true that the case is still sub judice. The frustration that the courts and the Pakistani government and legal system are having with achieving a conviction is that India is refusing to participate in the trial and produce the witnesses necessary to record their statements.”\n\nContinuing his answer, Bilawal said, “I appeal to you that we need to work towards a place where Pakistan and India have that sort of relationship again, where we have that sort of cooperation, that we can deliver justice to the people of Mumbai.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/09234226f792f45.jpg",
  "retrievedAt": "2025-08-17T20:00:11.272Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923094/new-delhi-lied-to-public-about-pahalgam-attack-bilawal-tells-indian-journalist",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T18:58:42.000Z"
}
