{
  "title": "Aurangzeb reaffirms govt’s commitment to consultative policy framework - Pakistan - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb on Wednesday reaffirmed the government’s commitment to maintaining a consultative policy framework as the Pakistan Business Council (PBC) transitioned its leadership.\n\nAurangzeb met with a delegation of the PBC led by outgoing Chief Executive Officer (CEO) Ehsan Malik and incoming CEO Javed Kureishi at the Finance Division, the division said in a press release.\n\nThe minister welcomed the PBC’s transition in leadership and extended his full support to the incoming team, reaffirming the government’s commitment to maintaining an inclusive and ongoing consultative process with key stakeholders in the business community.\n\nDuring the meeting, Aurangzeb appreciated the constructive role played by the PBC, particularly acknowledging the value of its policy input, research, and the extensive sectoral data regularly shared with the government.\n\nHe underscored the importance of evidence-based policymaking and informed the delegation that the Tax Policy Office had been relocated from the Federal Board of Revenue (FBR) to the Finance Division, intending to institutionalise tax policy formulation and strengthen engagement with forums such as the PBC.\n\nAurangzeb also emphasised that the government places high value on the perspectives and feedback of the business and industrial community, and in keeping with this approach, the consultative process for the federal budget 2025–26 was initiated earlier than usual this year.\n\nThis step was taken to allow greater time for dialogue, reflection and integration of a wide range of recommendations received from chambers, trade bodies, and business forums into the budget-making process, he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/091308240364afb.png",
  "retrievedAt": "2025-08-17T20:01:13.589Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923038/aurangzeb-reaffirms-govts-commitment-to-consultative-policy-framework",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T08:13:59.000Z"
}
