{
  "title": "Israel plans to move Gaza’s population to south: minister - World - DAWN.COM",
  "author": null,
  "content": "THE Israeli government has ordered its military to thrash out a plan to move all Palestinians in Gaza into a camp in the territory’s south, according to Israeli media reports.\n\nDefence Minister Israel Katz said on Monday he was in favour of establishing a “humanitarian city” on the ruins of Rafah city to house 600,000 Palestinians in the first phase. The entire 2.1 million people of Gaza will be relocated there later.\n\nThe BBC quoted the minister as saying the aim was to bring people inside after security screening to ensure they were not “Hamas operatives”, and that they would not be allowed to leave.\n\n“If conditions allow, work will begin during a 60-day ceasefire that Israel and Hamas are trying to negotiate.” But an Israeli human rights lawyer disapproved of the idea as nothing short of an “operational plan for a crime against humanity”.\n\n“It is the first step to deportation of the entire population of Gaza Strip outside the region,” Michael Sfard said in an interview with the Guardian.\n\nThe UN warned last month that the deportation of a territory’s population was “tantamount to ethnic cleansing”.\n\nDuring a meeting at the White House on Monday, Israeli Prime Minister Benjamin Netanyahu recalled President Donald Trump’s proposal that the US take over Gaza and resettle its population elsewhere for good.\n\nNetanyahu said: “I think President Trump has a brilliant vision. It’s called free choice. If people want to stay, they can stay, but if they want to leave, they should be able to leave.\n\n“We’re working with the United States very closely about finding countries that will seek to realise what they always say that they want to give the Palestinians a better future.”\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/09103727b3a860d.jpg",
  "retrievedAt": "2025-08-17T20:02:24.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922955/israel-plans-to-move-gazas-population-to-south-minister",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:38.000Z"
}
