{
  "title": "Gangs take away 260 buffaloes in Muzaffargarh district - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: More than 30 heavily armed members of multiple gangs stormed the Langarwah area of Alipur tehsil in district Muzaffargarh on Tuesday and snatched 260 buffaloes from locals.\n\nThe gang members pushed the cattle into the Indus River and relocated them to a nearby forest known as Zakheera.\n\nAccording to Muzaffargarh police, members of multiple gangs, including the notorious Bosan Gang, carried out the livestock theft. A large police contingent from Muzaffargarh and Rajanpur districts cordoned off the area but faced resistance as the gang members opened fire, prompting an exchange of gunfire with law enforcement.\n\n“The gang members stole the cattle from multiple herders and took them towards the river,” said Muzaffargarh District Police Officer (DPO) Dr Rizwan Ahmad Khan, confirming the number of stolen buffaloes. He added that police were attempting to advance toward the forest but were hindered by strong water currents in the area.\n\nA local landlord, Muhammad Ali Khatri, told Dawn that the gangsters took away his and his relatives 260 buffaloes worth millions. He said they were standing on the bank of the river when the police and gangsters exchanged heavy gin fire and they heard the firing.\n\nHe said that they could also see their cattle tied in the Katcha forest but no-one could go there because heavily armed men were guarding the area.\n\nThe DPO said that an operation was underway to recover the stolen livestock and arrest the gang members.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/080946439d97c74.jpg?r=094818",
  "retrievedAt": "2025-08-17T20:02:04.826Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922887/gangs-take-away-260-buffaloes-in-muzaffargarh-district",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:50.000Z"
}
