{
  "title": "Can US President Donald Trump win the Nobel Peace Prize? - World - DAWN.COM",
  "author": null,
  "content": "Israeli Prime Minister Benjamin Netanyahu on Tuesday nominated United States President Donald Trump for the Nobel Peace Prize, the highest-profile international award given to an individual or organisation deemed to have done the most to “advance fellowship between nations”.\n\nIn his letter to the Nobel Committee, which he shared online, Netanyahu said Trump had “demonstrated steadfast and exceptional dedication to promoting peace, security and stability around the world”.\n\nTrump, who is trying to broker a ceasefire between Israel and Hamas in Gaza, has been nominated before. Pakistan said in June it would recommend Trump for the prize for his work in helping to resolve the conflict with India.\n\nNetanyahu’s nomination of Trump has generated scepticism in some quarters, including from former Swedish prime minister Carl Bildt, who said on X that Netanyahu was seeking to flatter Trump.\n\nIf Trump won the prize, he would be the fifth US president to do so, after Theodore Roosevelt, Woodrow Wilson, Jimmy Carter and Barack Obama.\n\nHere is a look at how the award works:\n\nAccording to the will of Swedish industrialist Alfred Nobel, the inventor of dynamite, the prize should go to the person “who has done the most or best to advance fellowship among nations, the abolition or reduction of standing armies, and the establishment and promotion of peace congresses”.\n\nAll living persons or active institutions are eligible.\n\nIn an introduction on the Nobel website, Chair of the Peace Prize Committee Jorgen Watne Frydnes says, “In practice, anyone can be the recipient of the Nobel Peace Prize. The history of the prize shows clearly it’s given to people from all layers of society from all over the world.”\n\nThe Nobel Prizes are announced in October each year, but nominations close the previous January, meaning Netanyahu’s nomination of Trump could not be considered this year.\n\nThousands of people can propose names: members of governments and parliaments; current heads of state; university professors of history, social sciences, law, and philosophy; and former Nobel Peace Prize laureates, among others. You cannot nominate yourself.\n\nNominee lists are kept secret for 50 years, though there is nothing to stop those who make nominations from disclosing their choices.\n\nThe Norwegian Nobel Committee, which consists of five individuals appointed by the Norwegian parliament, is the arbiter. Members are often retired politicians, but not always. The current committee is led by the head of the Norwegian branch of PEN International, a group defending freedom of expression.\n\nThey are all put forward by Norwegian political parties and their appointments reflect the balance of power in Norway’s parliament.\n\nThe first meeting of the committee takes place in February of each year, when committee members can make their own nominations to add to the list.\n\nLast year, there were 286 nominees, and in 2025, there are 338 candidates nominated for the prize — 244 individuals and 94 organisations.\n\nThe committee whittles the nominations down to make a shortlist, and each nominee is then assessed by a group of permanent advisers and other experts.\n\nThe committee aims for unanimity but can decide by majority vote. A final decision is often only made a few days before the prize is announced.\n\nThe Nobel Peace Prize has often been seen as having a political message. The Nobel website says some recipients have been “highly controversial political actors”, while the prize has also increased public focus on international or national conflicts.\n\nObama won the award just a few months after taking office. Two members of the committee stepped down over the decision in 1973 to award the Peace Prize to US Secretary of State Henry Kissinger and Vietnamese politician Le Duc Tho for negotiating an end to the Vietnam War.\n\nOne member quit in 1994 when Palestinian leader Yasser Arafat shared the prize with Israel’s Shimon Peres and Yitzhak Rabin.\n\nA medal, a diploma, 11 million Swedish crowns ($1.15m) and immediate global attention, if they are not already famous.\n\nThe announcement of this year’s prize will be made on October 10 at the Norwegian Nobel Institute in Oslo.\n\nThe ceremony will take place at the Oslo City Hall on December 10, the anniversary of Alfred Nobel’s death.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/091943379253ee4.jpg",
  "retrievedAt": "2025-08-17T20:00:37.818Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923075/can-us-president-donald-trump-win-the-nobel-peace-prize",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T15:09:49.000Z"
}
