{
  "title": "FC to be deployed for security at Pat Feeder Canal project in Dera Bugti - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan will deploy paramilitary forces for the security of the Pat Feeder Canal project in Dera Bugti and intensify anti-smuggling drive in the province.\n\nThe decision to post Frontier Corps (FC) personnel for security at the canal was taken by the provincial Apex Committee on Tuesday.\n\nThe meeting was presided over by Chief Minister Sarfraz Bugti and Corps Commander Lt Gen Rahat Nasim Khan.\n\nThe meeting was convened to discuss the law and order situation and other issues in the province.\n\nThe meeting resolved to intensify the ongoing anti-smuggling drive, with strict action to be taken against transport companies involved in illegal activities and FIRs would be lodged against offending drivers.\n\nApex committee warns blocking of road or highway won’t be allowed in the name of protest\n\nWhile reviewing anti-terrorism measures, the meeting directed officials concerned to finalise rules under the Anti-Terrorism Act promptly.\n\nThe committee decided that protesters will not be allowed to block roads or highway in any area of Balochistan.\n\n“No road in the province will be allowed to be blocked. The Constitution stands with the person fighting for life in an ambulance,” Mr Bugti said.\n\nSpeaking on the occasion, the chief minister said action would be taken against those involved in smuggling, illegal remittances, extortion and subversive activities.\n\nThe committee also directed the FIA to act against illegal money transfers and step up action against those social media accounts spreading “anti-state propaganda”.\n\nThe committee also pledged to eliminate extortion and enhance operations against illegal immigrants.\n\nPolice and Levies personnel were ordered to strengthen the counter-terrorism response.\n\nThe Home Department briefed members of the committee on the digitalisation of the Fourth Schedule process.\n\nThe committee decided the provincial government will expand the Bolan route of the National Highway and construct the Dera Murad Jamali Bypass.\n\nThe National Highway Authority (NHA) was ordered to complete the Quetta Western Bypass by December 25.\n\nHe warned that anyone acting against the state would face consequences.\n\nIf the NHA delays or hinders road projects, the provincial government will assume responsibility for the project’s construction in public interest.\n\nTo that end, he said, the government has allocated Rs1.7 billion for the Bolan route expansion.\n\nThe meeting also resolved to ban the entry of liquefied petroleum tankers into residential areas.\n\nThe committee decided to celebrate Independence Day and ‘Marka-i-Haq’ — the official name for Pakistan’s response to Indian aggression in May — with patriotic spirit.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/01/16191547498ba51.jpg?r=191646",
  "retrievedAt": "2025-08-17T20:03:22.816Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922971/fc-to-be-deployed-for-security-at-pat-feeder-canal-project-in-dera-bugti",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:19.000Z"
}
