{
  "title": "Peshawar High Court halts oath of two women MPAs-elect - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Peshawar High Court orders ECP to modify notification of women seats in KP Assembly\n• Sets aside notification declaring JUI-F’s Gorpal Singh minority lawmaker\n• IHC also issues notice to Election Commission over KP reserved seats\n\nPESHAWAR: The Peshawar High Court (PHC) on Tuesday barred two women MPAs-elect of the Khyber Pakhtunkhwa Assembly from taking oath and directed the Election Commission of Pakistan (ECP) to modify its last year’s notification on the allocation of these seats.\n\nA two-member bench comprising Justice Syed Arshad Ali and Justice Dr Khurshid Iqbal also set aside the ECP’s notification dated March 26, 2024, which had declared Jamiat Ulema-i-Islam Fazl (JUI-F) candidate Gorpal Singh as MPA-elect on a seat reserved for non-Muslims in the KP Assembly.\n\nThe court directed the ECP to reallocate reserved seats for women and non-Muslims within 10 days in accordance with the law, after hearing all relevant political parties, their representatives and contesting candidates.\n\nUntil the ECP issues a new decision, the bench ordered that the oath should not be administered to JUI-F MPAs-elect Naheeda Noor and Arifa Bibi, who were elected on the disputed seats.\n\nThe bench issued a short order on a petition filed by the PML-N through its KP President Amir Muqam, who challenged two ECP notifications dated March 4 and March 26, 2024. These notifications declared candidates from various parties as MPAs-elect on reserved seats for women and non-Muslims.\n\nThe PML-N argued that both it and JUI-F had seven MPAs in the KP Assembly, but while PML-N received eight reserved seats for women, JUI-F was allotted 10. On the non-Muslim seats, JUI-F was granted two out of four seats, whereas PML-N was allocated only one.\n\nThe petition also challenged the ECP’s cut-off date of Feb 22, 2024, for independent MPAs to join political parties, after which reserved seat allocations were made.\n\nThe bench declared that the ECP’s use of the Feb 22 date for allocating reserved seats was illegal and contrary to the mandate of Article 106 of the Constitution, Sections 18 and 104 of the Elections Act 2017, and Rule 92 of the Elections Rules 2017.\n\nThe bench pointed out that the electoral college for reserved seats must include all members of political parties, as well as independent candidates who have joined parties, as of the actual date of election or allocation of the reserved seats.\n\nA panel of lawyers, including Aamir Javed, Saqib Raza and Syed Inayat Shah, appeared for the petitioner and stated that the PML-N had initially won five seats in the Feb 8 general elections, and two independents later joined it.\n\nMr Javed said that the ECP allegedly calculated reserved seat allocations based on only six MPAs rather than seven. He noted that although an independent MPA joined PML-N on Feb 22, the same day he was officially notified as an MPA-elect, the ECP did not include him in the final seat tally.\n\nInitially, the ECP allocated five women’s seats on Feb 22 — two each to PML-N and JUI-F, and one to PPP. On March 4, it issued a second notification for the remaining 21 seats, resulting in JUI-F receiving a total of 10 reserved seats and PML-N eight.\n\nAs for the four seats reserved for non-Muslims, one each was initially allocated to JUI-F, PML-N and PPP. The petitioner contended that the fourth seat should have been decided through a draw between JUI-F and PML-N, but the ECP unilaterally awarded it to JUI-F candidate Gorpal Singh.\n\nThe ECP was represented by Special Secretary Zafar Iqbal, legal counsel Mohsin Kamran Siddique, Special Secretary (Law) Mohammad Arshad and Deputy Director Saima Tariq Janjua. Advocate Naveed Akhter appeared for JUI-F and argued that his party had not been made a respondent in the petition despite being directly affected.\n\nIHC issues notice to ECP\n\nThe Islamabad High Court (IHC) on Tuesday also issued a notice to the ECP on a petition filed by Pakistan Tehreek-i-Insaf Parliamentarians (PTI-P), seeking suspension of the ECP’s July 2 notification allocating 21 reserved seats in the Khyber Pakhtunkhwa Assembly.\n\nJustice Raja Inaam Ameen Minhas heard the plea. PTI-P’s legal team, comprising Advocates Sultan Muhammad Khan and Tufail Shahzad, appeared in court alongside the party’s Central Secretary General Malik Habib Noor.\n\nAdvocate Khan argued that the ECP’s notification was based on flawed calculations and had deprived PTI-P, founded in 2023 by the former KP chief minister Pervez Khattak, of its lawful share of reserved seats. He maintained that the party should have received additional seats based on its performance in the Feb 8 general elections.\n\nJustice Minhas inquired whether any court had suspended the notification. The lawyer confirmed that no stay had been granted so far. The court declined to suspend the notification immediately but issued a notice to the ECP to submit a response and adjourned the hearing.\n\nPTI-P argued that allowing lawmakers elected through the disputed notification to take oath would cause “irreversible prejudice” and undermine the party’s main petition.\n\nThe party contended that the ECP’s March 4, 2024, notification erroneously recorded PTI-P as having secured only one general seat in KP, whereas it had actually won two — PK-73 and PK-103. This misrepresentation allegedly cost the party at least three reserved seats.\n\nThe matter was also earlier under review in the PHC, which had granted a stay on the oath-taking of MPAs on reserved seats. However, after a two-member PHC bench raised questions about the petition’s maintainability in light of similar proceedings at the IHC, PTI-P withdrew its petition from the PHC, resulting in the dismissal of the case and recall of the stay order.\n\nMalik Asad in Islamabad also contributed to this report\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/08092139de689bd.jpg?r=092143",
  "retrievedAt": "2025-08-17T20:03:40.331Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922947/peshawar-high-court-halts-oath-of-two-women-mpas-elect",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:08.000Z"
}
