{
  "title": "Service exports grow to $7.65bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s exports of services rose by 8.58pc to $7.65bn during the first 11 months of FY25, up from $7.04bn in the same period last year, largely driven by strong performance in telecommunication, computer, and information services.\n\nAccording to data compiled by the Pakistan Bureau of Statistics (PBS), services exports have shown consistent growth since February 2024, particularly in the information technology and other business segments. However, a 6.5pc decline was recorded in August 2024.\n\nIn rupee terms, the value of services exports increased by 6.94pc to Rs2.134tr during the July–May period of FY25, compared to Rs1.995tr in the same period of FY24. In May alone, exports of services grew by 1.57pc year-on-year to $715.45m from $704.39m.\n\nAccording to the State Bank of Pakistan, exports of telecommunication, computer, and information services rose by 18.62pc to $3.471bn during July–May FY25, from $2.926bn in the same period last year. Similarly, exports of other business services increased by 6.84pc to $1.53bn, while transport services grew 24.89pc to $878m.\n\nTrade deficit widens marginally in July-May 2024-25\n\nConversely, travel services posted a negative growth of 4.15pc, falling to $669m from $698m a year earlier.\n\nIn FY24, services exports recorded a modest growth of 2.77pc, reaching $7.80bn from $7.59bn in FY23. The previous year, FY23, had also seen marginal growth of 2.78pc from $7.10bn in FY22. The government has set an ambitious target of $15bn in IT exports over the next five years.\n\nMeanwhile, services imports rose 6.62pc to $10.317bn in 11MFY25, compared to $9.676bn in the same period last year. However, in May alone, services imports declined by 5.07pc to $888m from $935.45m a year earlier.\n\nThe increase in services imports was mainly driven by higher transport and travel expenditures. Transport services imports rose by 2.08pc to $4.404bn from $4.314bn, while travel services imports grew by 6.18pc to $2.266bn from $2.134bn. The rise in transport payments is largely attributed to increased airfares.\n\nFor FY24 as a whole, imports of services had increased by 17.14pc to $10.119bn from $8.638bn in the previous year. As a result, the services trade deficit widened slightly by 1.36pc to $2.669bn during July–May FY25, compared to $2.633bn in the same period last year. However, the monthly trade gap in May narrowed significantly by 25.32pc, falling to $172.54m from $231.06m a year earlier.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/090830406ac8340.jpg?r=083044",
  "retrievedAt": "2025-08-17T20:02:56.859Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922980/service-exports-grow-to-765bn",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:25.000Z"
}
