{
  "title": "Toll of Air India disaster rests at 260 as focus turns to crash report - World - DAWN.COM",
  "author": null,
  "content": "Indian forensic investigators have identified all 260 people killed in last month’s crash of a London-bound passenger plane, health authorities said on Wednesday, ahead of a hugely anticipated preliminary report into what went wrong.\n\nIndia’s Aircraft Accident Investigation Bureau is leading the probe into one of the deadliest air disasters in decades, with an initial report expected on Friday.\n\nAll but one of the 242 people aboard the Air India Boeing 787-8 Dreamliner were killed when it crashed on June 12.\n\nIt ploughed into housing just after takeoff in the western city of Ahmedabad, and authorities have also identified 19 people killed on the ground.\n\nNo details have been released about the probe, in which British and US air accident investigation agencies have also taken part.\n\nBut specialist website The Air Current, citing multiple sources familiar with the investigation, reported it had “narrowed its focus to the movement of the engine fuel switches”, while noting that full analysis will “take months — if not longer”.\n\nIt added that “the focus of the investigators could change during that time”.\n\nBut “at this point in the inquiry, the data available to investigators does not indicate a mechanical or design issue” with the 787 plane, or its engines.\n\nThe site said its sources “indicated that post-accident analysis showed no sign of fuel contamination or improper retraction of the aircraft’s flaps”, over which there had been speculation.\n\nHealth officials in the Indian state of Gujarat initially said at least 279 people were killed, but forensic scientists reduced the figure after multiple scattered and badly burnt remains were identified.\n\n“The final death toll in the plane crash now stands at 260,” Rakesh Joshi, head of Ahmedabad’s main state hospital, told AFP today.\n\n“All the human remains found so far from the crash site have been identified and handed over to their families,” Joshi added.\n\n“Our work is now over,” he added. “We have matched DNA of all the mortal remains that were collected from the crash site.”\n\nThe UN’s International Civil Aviation Organisation (ICAO) stipulates that states heading an investigation must submit a preliminary report within 30 days of an accident. That report, however, does not have to be made public.\n\nAccording to the ICAO, preliminary reports “may be marked as confidential or remain public at the investigating state’s discretion”.\n\nJoshi said it was doubtful any further remains would be found in the wreckage. “The possibility is almost negligible, I believe,” he said.\n\nOn Tuesday, health authorities handed over the remains of 26 victims to their relatives, or, for families who had already received parts of their dead kin’s bodies and held funerals, carried out ceremonies for them.\n\n“Seven families collected the remains of their kin … while 19 families gave consent to the hospital to carry out the rites,” Joshi said.\n\nThere were 230 passengers — 169 Indians, 53 British, seven Portuguese and a Canadian — along with 12 crew members.\n\nDozens of people were injured, with two remaining in the hospital.\n\nOnly one passenger miraculously survived, a British citizen who was seen walking out of the wreckage of the crash, and who has since been discharged from the hospital.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/09174137949f0c2.jpg",
  "retrievedAt": "2025-08-17T20:00:44.363Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923062/toll-of-air-india-disaster-rests-at-260-as-focus-turns-to-crash-report",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T13:19:03.000Z"
}
