{
  "title": "European heatwave caused 2,300 deaths, scientists estimate - World - DAWN.COM",
  "author": null,
  "content": "Around 2,300 people died of heat-related causes across 12 European cities during the severe heatwave that ended last week, according to a rapid scientific analysis published on Wednesday.\n\nThe study targeted the 10 days, ending July 2, during which large parts of Western Europe were hit by extreme heat, with temperatures breaching 40 degrees Celsius in Spain and wildfires breaking out in France.\n\nOf the 2,300 people estimated to have died during this period, 1,500 deaths were linked to climate change, which made the heatwave more severe, according to the study conducted by scientists at Imperial College London and the London School of Hygiene and Tropical Medicine.\n\n“Climate change has made it significantly hotter than it would have been, which in turn makes it a lot more dangerous,” said Dr Ben Clarke, a researcher at Imperial College London.\n\nThe study covered 12 cities, including Barcelona, Madrid, London and Milan, where the researchers said climate change had increased heatwave temperatures by up to 4°C.\n\nThe researchers used established epidemiological models and historical mortality data to estimate the death toll, which reflects deaths where heat was the underlying reason for mortality, including if exposure exacerbated pre-existing health conditions.\n\nThe scientists said they used peer-reviewed methods to quickly produce the estimated death toll because most heat-related deaths are not officially reported, and some governments do not release this data.\n\nLast month was the planet’s third-hottest June on record, behind the same month in 2024 and 2023, the EU’s Copernicus Climate Change Service said in a monthly bulletin on Wednesday.\n\nWestern Europe experienced its warmest June on record, with much of the region experiencing “very strong heat stress” — defined by conditions that feel like a temperature of 38°C or more, Copernicus said.\n\nSome estimate 50 metric tonnes of trash remain on the Mt Everest due to decades of climbing and lax regulations.\n\n“In a warming world, heatwaves are likely to become more frequent, more intense and impact more people across Europe,” said Samantha Burgess, Copernicus’ strategic lead for climate.\n\nResearchers from European health institutes reported in 2023 that as many as 61,000 people may have died in Europe’s sweltering heatwaves in 2022, according to new research, suggesting countries’ heat preparedness efforts are falling fatally short.\n\nThe build-up of greenhouse gas emissions in the atmosphere — which mostly come from the burning of fossil fuels — means the planet’s average temperature has increased over time.\n\nThis increase in baseline temperatures means that when a heatwave comes, temperatures can surge to higher peaks.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0221305958cbc1d.jpg?r=214959",
  "retrievedAt": "2025-08-17T20:01:03.465Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923043/european-heatwave-caused-2300-deaths-scientists-estimate",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T09:03:17.000Z"
}
