{
  "title": "Buoyant India unperturbed by prospect of spicy Lord’s pitch - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: India expect England to roll out a challenging track for the third Test at Lord’s but are confident their in-form batters can master it, batting coach Sitanshu Kotak said on Tuesday.\n\nIndia levelled the five-Test series 1-1 with a thumping 336-run victory at Edgbaston where they racked up 587 in the first innings and declared their second on 427-6.\n\nEngland are pondering overhauling their tired bowling attack and a fit-again Jofra Archer is in line to play his first Test in more than four years at Lord’s.\n\n“It will be a challenge if Jofra comes in,” Kotak told reporters ahead of the third Test beginning on Thursday. “England might want to make a couple of bowling challenges. The wicket, it seems, will also be a bit more challenging.\n\n“After the last two games, if England decides to roll out a more challenging wicket, it’s fair enough.”\n\nThe green tinge of the pitch tells Kotak that runs would not exactly flow at Lord’s.\n\n“This wicket looks greener than the last two matches. But one cannot be too sure before the final trimming tomorrow,” he said.\n\n“Normally the first and second innings scores at Lord’s tend to be lower. So bowlers can expect a bit more help here.”\n\nShubman Gill has been in sensational form in his first series as India’s Test captain smashing a hundred in the opening Test in Leeds and following it with scores of 269 and 161 at Edgbaston.\n\nRishabh Pant, KL Rahul and Yashasvi Jaiswal have also struck hundreds, which Kotak believed meant they would not be found wanting at Lord’s regardless of conditions.\n\n“For the batters, it will be a matter of just trying to spend as much time as possible on this wicket and adjust to it,” he said.\n\n“Our batters are so skilful that they are scoring at four an over even when they are not looking to score quickly.\n\n“But the mindset here would be, we won’t look for boundaries. If you don’t play silly shots, you’ll play long innings on these wickets.”\n\nOn Monday, England batting coach Brendon McCullum said Archer is fit and ready to go if called upon for the third Test.\n\nArcher has taken 42 wickets in 13 Tests but has not played in the format since February 2021 after a succession of elbow injuries and back issues sidelined him for long periods.\n\nThe 30-year-old was add­ed to the squad for the second test at Edgbaston but did not make the starting side.\n\n“Jofra is looking fit, he’s looking strong, he’s looking ready to go, and he’ll come into calculations,” McCullum told reporters.\n\n“It’s hugely exciting. He’s buzzing as well. He’s obviously been through his injuries and his time out of test cricket.\n\n“We all know what he’s capable of achieving in test cricket and we hope that when the opportunity does arrive for him, he’s able to recapture, and also improve on, what he’s been able to do already in that form of the game.”\n\nEngland would also resist any temptation to promote in-form Jamie Smith up the order after the wicket-keeper/batter scored 184 and 88 while batting at number seven, McCullum added.\n\n“He’s just developing at rapid speed, and from our point of view, we’re very happy with him at number seven and with the gloves on,” he said.\n\n“He does look world class. When we made the decision to bring Jamie Smith into Test cricket, we were hopeful that he’d be able to have that sort of impact, obviously in the middle, but also being able to have the power that he’s got with the tail too.”\n\nFormer fast bowling stalwart Stuart Broad believes a Test cricket return for Archer could help England hit back against India.\n\n“Look at this series so far: we’ve had 10 Test match days and I reckon India have won nine of them,” Broad said on his podcast.\n\n“They are going to be way stronger because they’re bringing the best bowler in the world [Jasprit Bumrah] back in on the back of a performance that was borderline perfect. That’s a pretty strong place to be.\n\n“When you get such a one-sided result it’s easy to be really critical of the other team but I’d lean against that, India were just superb.”\n\nCommenting on Archer, Broad said, “His attributes are amazing. He’s tall, incre­dibly athletic, gets bounce and pace and he does move the ball.\n\n“Time has made him more exciting as well. When he’s not been around for a huge amount of time you want to tune in and see what’s coming.”\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:02:38.434Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922944/buoyant-india-unperturbed-by-prospect-of-spicy-lords-pitch",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:31.000Z"
}
