{
  "title": "UAE denies granting lifetime Golden Visas to certain nationalities - Pakistan - DAWN.COM",
  "author": null,
  "content": "The United Arab Emirates (UAE) late on Tuesday night denied widespread media reports that claimed it had begun granting lifetime Golden Visas to select nationalities under a “new nomination-based” scheme, according to the Emirates News Agency (WAM).\n\nThe Golden Visa is a long-term residence visa that enables foreign talent to live, work, or study in the UAE while enjoying a range of exclusive benefits. According to the UAE government’s official portal, eligible categories include investors, entrepreneurs, scientists, outstanding students and graduates, humanitarian pioneers, and frontline heroes.\n\nThis week, several Indian media outlets, including The Press Trust of India and The Hindu, reported that the UAE government had initiated a “new nomination-based visa policy”, allowing Indians to “enjoy the UAE’s Golden Visa for life by paying a fee of AED100,000”.\n\nMeanwhile, Times of India reported that the newly launched scheme was in its pilot phase and was currently available to applicants from both India and Bangladesh, with over 5,000 Indian applications expected in the first three months. Dubai-based Gulf News also reported on Monday that Bangladeshi citizens could apply for the Golden Visa remotely if they meet the requirements.\n\n“The Federal Authority for Identity, Citizenship, Customs and Port Security (ICP) has denied the accuracy of rumours circulated by some local and international media outlets and websites regarding the United Arab Emirates granting lifetime Golden Visas to certain nationalities,” the WAM report said.\n\n“ICP clarified that the categories, conditions, and regulations of the Golden Visa are clearly defined in accordance with official laws, legislations, and ministerial decisions.”\n\nAccording to WAM, the ICP emphasised that “all Golden Visa applications are handled exclusively through official government channels within the UAE, and that no internal or external consultancy entity is recognised as an authorised party in the application process”.\n\nThe federal authority said it had “recently observed news articles from a consultancy office based in another country, suggesting that lifetime Golden Visas could be obtained for all categories from outside the UAE via consulting or commercial entities under simplified conditions”.\n\nThe WAM report further added: “These claims have no legal basis and were made without coordination with the relevant authorities in the UAE. The federal authority reaffirmed its commitment to providing a safe and transparent environment for applicants.”\n\nIt also stated that legal action would be taken against entities “spreading such false information in an attempt to illegally collect money from individuals aspiring to live and reside in the UAE, exploiting their hopes for a dignified and secure life.”\n\nThe federal authority urged individuals wishing to visit, live, or invest in the UAE not to respond to inaccurate rumours and false news aimed at a quick profit. They should avoid paying any fees or submitting personal documents to any party claiming to provide these services, the report said.\n\nThe Economic Times quoted a top golden visa consultant based in Dubai as rebutting the Golden Visa reports.\n\n“I checked with the authorities here, and they say they have no such information. So, the news is likely to be untrue,” Iqbal Marconi, ex-chief executive officer of ECH Group (which Khaleej Times has described as the largest golden visa facilitator in the region), told Economic Times.\n\n“The only new update they have is that crypto investors won’t be considered for the Golden Visa scheme. I checked with the GDRFA (General Directorate of Residency and Foreigners Affairs Dubai) also; they too said they don’t have any information on this, “ Marconi said.\n\nHe added that a “couple of officials […] in the same line of work” whom he contacted also did not have any information in this regard.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/081844147875ee1.jpg?r=184419",
  "retrievedAt": "2025-08-17T20:01:31.828Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923014/uae-denies-granting-lifetime-golden-visas-to-certain-nationalities",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T06:16:28.000Z"
}
