{
  "title": "Committee rebukes NHA over ‘unfair’ award of projects - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Authority told to ensure timely completion of projects\n• Limited funds, land acquisition, geographical and security challenges cited as reasons for delays\n\nISLAMABAD: A parliamentary committee on Monday expressed dissatisfaction over National Highway Authority’s (NHA) ‘poor performance’ and ‘lack of merit and transparency’ in award of mega infrastructure projects.\n\nThe Senate standing committee on communications directed the authority to ensure greater transparency, better project management, and enhanced coordination among relevant stakeholders to ensure timely and efficient completion of vital infrastructure projects across the country.\n\nChaired by Senator Pervaiz Rash­­id, the committee meeting reviewed the status of the ongoing NHA projects under public sector development programme (PSDP) and examine toll tax revenue details.\n\nThe senators expressed serious dissatisfaction over the lack of progress despite funds being made available. They also criticised the communications secretary besides the NHA for failing to meet their commitments.\n\nWhen the NHA chairman reassured the parliamentary body that all pending projects would be initiated without further delay, the committee sought a regular update on progress.\n\nSenators Saifullah Abro and Za­­mir Hussain Ghumro raised strong objections to the award of Tranche-III project to Ningxia Commu­nic­a­tion Construction — a company previously disqualified for failing to co­­­mplete the Lodhran-Multan project.\n\nSenator Abro highlighted a conflict of interests, noting that the arbitrator appointed in a related dispute was allegedly a former legal adviser of the company.\n\nThe committee, however, agreed to address the matter separately in next sittings.\n\nSenator Mohammad Abdul Qadir called for timely payments to contractors to avoid delays and asked the government to protect contractors’ rights during project allocation.\n\nSenators Dost Ali Jeesar, Zamir Hussain Ghumro, Palwasha Moham­mad Zai Khan, Kamil Ali Agha, Ab­­dul Wasay, Asad Qasim and Jam Saif­­ullah also attended the meeting.\n\nRajanpur-D.I. Khan carriageway\n\nThe senators were briefed on the additional carriageway project along the Rajanpur-D.G. Khan (121km) and D.G. Khan-D.I. Khan (208km) portions of the National Highway (N-55) under the CAREC Corridor Development Investment Programme, Tranche-III. The NHA chairman said the ADB-funded project, whose PC-1 was approved in 2023, had 11 bypasses, but pending land acquisition delayed work. It would take at least three to four months more to begin work on the project, the panel was informed.\n\nThe Senate committee chairman noted that delays significantly increased overall costs and said priority should be given to completing the ongoing projects instead of initiating work on other projects.\n\nPSDP\n\nHowever, NHA officials briefed the committee that uplift projects under the PSDP (2025-26) were categorised as critical national projects, petroleum development levy projects, essential rupee-cover projects, near-completion projects and strategic new projects.\n\nAt the briefing, the NHA officials said Rs226.982 billion was allocated for 71 projects against the demand of Rs655.499bn.\n\nThey cited limited funds, land acquisition problems and geographical challenges among the causes of delay in the completion of projects. Frequent damages to machinery and infrastructure in Balochistan also came up during the discussion.\n\nToll tax, revenue\n\nThe committee was briefed on toll tax rates and revenue collection for 2023-25. The NHA reported that total 211 toll plazas were operational, 100 on national highways and 111 on motorways. Out of all, 68 toll plazas are auctioned and managed privately, while 16 are directly managed by the NHA. According to a revenue report, the NHA collected Rs32.98bn during the fiscal year 2023-24 and had projected revenue of Rs64.79bn for 2024-25.\n\nToll rates on the National High­ways are set at Rs30 for cars, Rs50 for wagons, Rs100 for buses, Rs120 for two- and three-axle trucks, and Rs250 for articulated trucks. Slightly higher toll rates apply at some specific locations such as the Kohat tunnel and the Islamabad-Muzaffarabad dual carriageway.\n\nHowever, committee members expressed concern over the burden of high toll taxes on the general public. They also demanded the restoration of discontinued mobile phone service for toll tax payments to facilitate travellers.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/15100601949bfb2.png?r=100831",
  "retrievedAt": "2025-08-17T20:03:33.014Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922977/committee-rebukes-nha-over-unfair-award-of-projects",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:19.000Z"
}
