{
  "title": "Veteran journalist Zubeida Mustafa passes away in Karachi at 84: family - Pakistan - DAWN.COM",
  "author": null,
  "content": "Veteran journalist Zubeida Mustafa passed away on Wednesday in Karachi at 84, her family confirmed.\n\nShe was born in India in 1941 and moved to Pakistan at a young age. She earned her undergraduate degree and graduate degree in international relations from the University of Karachi and began her career as a research officer at the Pakistan Institute of International Affairs in the 1960s.\n\nShe worked as an assistant editor at Dawn, where her career spanned 1975-2008. She was the first female journalist from Pakistan to receive an International Women’s Media Foundation Lifetime Achievement Award in May 2012.\n\nA statement issued by the Karachi Press Club hailed her as a “true icon and veteran of Pakistani journalism” who left behind a legacy “that will continue to inspire generations of journalists”.\n\n“Zubeida Mustafa was not just a journalist; she was an institution. Her unwavering commitment to truth, her incisive analysis, and her relentless pursuit of social justice set a benchmark for ethical reporting. She was a pioneer, breaking barriers and paving the way for women in a field often dominated by men.\n\n“Her work on social issues, education, and health was particularly impactful, demonstrating her deep empathy and dedication to improving the lives of ordinary citizens. The Karachi Press Club extends its heartfelt condolences to her family, friends and colleagues during this difficult time. Her absence will be deeply felt, but her contributions to journalism and society will never be forgotten. May her soul rest in eternal peace,” the press club said.\n\nThe Human Rights Commission of Pakistan said it mourned the passing of a veteran journalist, columnist and editor who “championed social, cultural and language rights like few.\n\n“She was a comrade-in-arms and stood by the disadvantaged and the oppressed. May her family and friends find strength to bear this irreparable loss.”\n\nSindh Chief Minister Murad Ali Shah also expressed deep sorrow over the death and hailed her as an “excellent journalist” whose services would always be remembered.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/092324007d385a8.jpg",
  "retrievedAt": "2025-08-17T20:00:13.015Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923093/veteran-journalist-zubeida-mustafa-passes-away-in-karachi-at-84-family",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T18:28:33.000Z"
}
