{
  "title": "Nvidia leaps to $4 trillion as Wall Street shakes off tariff concerns - Business - DAWN.COM",
  "author": null,
  "content": "Wall Street’s main indexes climbed higher on Wednesday, with Nvidia soaring to a $4 trillion valuation, while investors shrugged off President Donald Trump’s latest tariff salvo.\n\nNvidia rose 2.2 per cent to become the first company to ever hit $4 trillion in market value, solidifying its position as one of Wall Street’s most-favoured stocks to tap in the ongoing surge in demand for artificial intelligence technologies.\n\nAt 9:47 am ET (6:47 pm PKT), the Dow Jones Industrial Average rose 286.20 points, or 0.65pc, to 44,526.96, and the S&P 500 gained 39.70 points, or 0.64pc, to 6,265.22, and the Nasdaq Composite gained 195.72 points, or 0.95%, to 20,614.19.\n\nSeven of 11 S&P sectors clocked gains, with the technology index leading the pack with a 1.2pc rise.\n\nTrump ramped up his trade offensive on Tuesday, announcing a 50pc tariff on copper and vowing to slap long-threatened levies on semiconductors and pharmaceuticals.\n\nThis came just a day after he jolted 14 trading partners with a fresh wave of tariff warnings, and said that at least seven new notices would drop later in the day.\n\nThe market’s reaction to the latest salvo was in contrast with Monday’s sell-off — triggered by the White House’s new tariff threats against Japan and South Korea.\n\nWith tariff deadlines now pushed to August 1, investors are pinning their hopes on negotiations to avert a full-blown trade war.\n\n“The tariff issue continues to be this sort of seesaw and because of that back-and-forth, it obviously has given investors a bit of a calm,” said Philip Blancato, chief market strategist at Osaic Wealth.\n\n“Markets will react if they see an impact of tariffs in second-quarter earnings next week. But if earnings continue to improve, that just gives them an even longer wait for the tariff negotiations to get finalised,” said Ross Bramwell, investment strategist at Homrich Berg.\n\nMeanwhile, after last week’s record closes for the S&P 500 and the Nasdaq —buoyed by a surprisingly robust jobs report — investors are turning their attention to Thursday’s initial jobless claims for the next pulse check on the labor market.\n\nTraders will also parse through the minutes from the Federal Reserve’s June meeting, due at 2:00pm ET (11pm PKT), for any hints about when policymakers might resume easing rates.\n\nWhile a July rate reduction is almost fully ruled out, the odds of a September cut stand at about 66pc, according to CME Group’s FedWatch tool.\n\nTrump’s erratic tariff actions have sparked concerns about global growth and inflation, while also complicating the work of the Fed, which has adopted a wait-and-see approach on monetary policy.\n\nAmong stocks, AES Corp rose 14.3pc after Bloomberg reported that the power provider was exploring options, including a sale.\n\nHealth insurer UnitedHealth Group slipped 2pc after the Wall Street Journal reported that the US Department of Justice was investigating how the company deployed doctors and nurses to gather diagnoses that increased its Medicare payments.\n\nShares of US advertising firms Interpublic and Omnicom fell over 1.5pc each, after peer WPP slashed its annual profit guidance.\n\nAdvancing issues outnumbered decliners by a 2.34-to-1 ratio on the NYSE. There were 70 new highs and 12 new lows on the NYSE and by a 2.23-to-1 ratio on the Nasdaq.\n\nThe S&P 500 posted 10 new 52-week highs and three new lows while the Nasdaq Composite recorded 31 new highs and 21 new lows.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/09194053ec1619e.jpg",
  "retrievedAt": "2025-08-17T20:00:24.656Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923076/nvidia-leaps-to-4-trillion-as-wall-street-shakes-off-tariff-concerns",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T15:22:31.000Z"
}
