{
  "title": "Extreme heat, rain trigger flooding in Punjab, GB - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Rapid melting of glaciers due to record temperatures causes floods in Hunza, Diamer, Chilas, Nagar\n• Karakoram Highway blocked at multiple points; locals evacuated as homes damaged\n• Downpour leads to urban flooding in several parts of Punjab\n\nGILGIT / LAHORE: Record-high summer temperatures in Gilgit-Baltistan have accelerated the melting of glaciers, leading to heavy flooding in districts across the region.\n\nThe melting of ice, which resulted in glacier lake outburst floods (Glofs), blocked roads, damaged homes and left people stranded across GB on Tuesday.\n\nAccording to the Gilgit-Baltistan Disaster Management Authority (GBDMA), high temperatures were recorded across GB last week.\n\nGBDMA DG Zakir Hussain told Dawn the situation in GB is “unusual” this year.\n\nHe said high temperatures have increased the risk of flooding in rivers and streams, particularly in Diamer and Gilgit.\n\nLast week, the maximum temperature in Chilas was 48.5°C, the highest since July 17, 1997, when it was recorded at 47.7°C. In Bunji, the temperature jumped to 46.1°C, the highest since July 1971.\n\nCurrently, the water level in rivers and streams across the region is dangerously high as inflows have increased due to rapidly melting glaciers.\n\nAccording to the GBDMA, a flash flood blocked the Karakoram Highway (KKH) at Gandlu-Muladad Padi near Chilas on Tuesday.\n\nA flood in Hamari stream damaged the Nagar Khas Valley road, while deluge in Supultar nullah blocked the Hoper Valley road.\n\nThe rising water level in rivers blocked the Chipurson Valley road in upper Hunza while Siachen Road in Ghanche was severely affected by river erosion in Thugs and Bangilongba areas.\n\nFlooding in the Botogah nullah in Chilas damaged makeshift bridges, leaving the communities without any route to cross the waterway.\n\nFlooding in Hamari and Supultar nullahs in Nagar damaged agricultural land, irrigation and drinking water supply systems, link roads and public and private infrastructures.\n\nMany areas were without water and electricity supply after damage to the infrastructure.\n\nLocal administration said continued land erosion in the Hamorkhay area in Nagar Khas has submerged fields, trees and other infrastructure and was threatening over a dozen households.\n\nFlood also damaged public and private properties in Chilas of Diamer, Chipurson areas.\n\nA Glof from Shishper glacier in Hassanabad nullah, Hunza, has once again threatened KKH and local properties.\n\nGBDMA said four houses were evacuated as a precautionary measure following the Glof event.\n\nThe local administration has warned people not to travel to affected areas as the risk of flooding and land erosion is high.\n\nRescue efforts\n\nMr Hussain, the head of GBDMA, said the authority has mobilised machinery to reopen roads blocked by flooding.\n\n“Our first responsibility is to save the lives of people,” he said, adding locals in affected areas have been shifted to safe places.\n\nThe GBDMA was also restoring irrigation channels as a majority of people in the region depended upon agriculture as their livelihood.\n\nAccording to Mr Hussain, the agency is now looking to identify the behaviours of glaciers to understand the scientific reasoning for melting.\n\nThe Space and Upper Atmosphere Research Commission has been requested to provide equipment for the monitoring of glaciers.\n\nMeanwhile, GB Chief Minister Haji Gulbar Khan has ordered the GBDMA, district administration and all relevant departments to remain alert in view of the floods.\n\nAll deputy commissioners have been ordered to take timely steps to prevent damage to life and property.\n\nUrban flooding in Punjab\n\nIn Punjab, heavy monsoon rainfall on Tuesday triggered urban flooding in several cities as the province braces for above-average rainfall in the coming days.\n\nIn Lahore, rainfall led to waterlogging in Jail Road, Qurtaba Chowk, Liberty Chowk, and Lakshmi Chowk.\n\nAccording to the Met Department, Jail Road and Qurtaba Chowk received the most rainfall, with 46 and 43 mm, respectively.\n\nThe average rainfall in the provincial capital on Tuesday was 40mm.\n\nThe deluge overwhelmed drainage systems in several areas, forcing the Water and Sanitation Agency (Wasa) workers to install pumps to drain water from inundated areas.\n\nWasa Managing Director Ghufran Ahmad has directed round-the-clock drainage of water.\n\nHe said all resources must be deployed to protect low-lying neighbourhoods from inundation.\n\nAcross Punjab, the rainfall pattern showed sharp variations, with Sheikhupura recording the province’s highest total at 48mm.\n\nThe provincial government has put all disaster response agencies on high alert after Lahore and several other districts recorded heavy downpours, with Nishtar Town receiving the highest rainfall at 52mm.\n\nPDMA meeting\n\nIn Sialkot, Provincial Disaster Management Authority (PDMA) DG Irfan Ali Kathia held an emergency meeting on the preparedness of local authorities.\n\nMr Kathia said the province is expected to receive 40 to 60 per cent above-normal rainfall in the coming days.\n\nThe heavy rain is expected to result in flooding, particularly in riverine areas near Head Marala, where water flow was 70,000 cusecs on Tuesday.\n\nLocal administrations have established relief camps stocked with food and water supplies, while electricity poles have been reinforced.\n\nIn rural areas, special teams have been mobilised to protect livestock and ensure their safety during the monsoon.\n\nGujranwala Division Commissioner Naveed Haider Shirazi has ordered the immediate evacuation of dilapidated buildings.\n\n“We cannot risk any loss of life due to structural collapses during these rains,” Mr Shirazi warned, noting that 16 million residents in his division were potentially at risk.\n\nThe authorities have warned people to avoid unnecessary travel and report flooding immediately.\n\nCM’s directives\n\nPunjab Chief Minister Maryam Nawaz Sharif has directed all institutions to remain on alert during the monsoon season.\n\nOfficials of Wasa, PDMA, local government, Rescue 1122 and traffic police must remain in the field to oversee relief activities and help citizens.\n\nShe further directed the commissioners and deputy commissioners to monitor water drainage from low-lying areas and the traffic police should prepare plans to avoid gridlock.\n\nPublished in Dawn, July 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686db207add6a.jpg",
  "retrievedAt": "2025-08-17T20:03:52.591Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922954/extreme-heat-rain-trigger-flooding-in-punjab-gb",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T00:56:08.000Z"
}
