{
  "title": "Russia launches largest drone strike of war with Ukraine after Trump vows to send more weapons - World - DAWN.COM",
  "author": null,
  "content": "Russia targeted Ukraine with a record 728 drones overnight, shortly after US President Donald Trump pledged to send more defensive weapons to Kyiv and aimed unusually direct criticism at Russian President Vladimir Putin.\n\nUkrainian air defence units destroyed almost all the drones, including through electronic jamming systems, Ukraine’s air force said on the Telegram messaging app.\n\nThe attack, which follows a series of escalating air assaults on Ukraine in recent weeks, showed the need for “biting” sanctions on the sources of income Russia uses to finance the war, including on those who buy Russian oil, Ukrainian President Volodymyr Zelensky said on Telegram.\n\nTrump said on Tuesday he was considering supporting a bill in the Senate that would impose steep sanctions on Russia, including 500 per cent tariffs on nations that buy Russian oil, gas, uranium and other exports.\n\n“We get a lot of ‘b******t’ thrown at us by Putin … He’s very nice all the time, but it turns out to be meaningless,” Trump said at a cabinet meeting.\n\nWhen asked by a reporter what action he would take against Putin, Trump said: “I wouldn’t tell you. We want to have a little surprise.” Separately, Europe is working on a new sanctions package against Moscow.\n\nTrump, who returned to power this year promising a swift end to the war in Ukraine, has shifted US rhetoric away from staunch support for Kyiv towards accepting some of Moscow’s justifications for its full-scale invasion.\n\nBut initial rounds of talks between Russia and Ukraine have so far borne little fruit, with Moscow yet to accept an unconditional ceasefire proposed by Trump and accepted by Kyiv.\n\nThe US president’s promise to supply more defensive weapons reversed a Pentagon decision days earlier to stall some critical munitions supplies to Ukraine, despite rising Russian attacks that spread fear in Kyiv.\n\nFollowing Trump’s new promise, Zelensky said on Tuesday he had ordered an expansion of contacts with the United States to ensure critical deliveries of military supplies, primarily air defence.\n\nTrump’s Ukraine envoy, Keith Kellogg, is due in Rome later on Wednesday to attend a July 10-11 international aid conference on Ukraine, attended by Zelensky and Kyiv’s European allies.\n\nEurope’s top human rights court ruled unanimously on Wednesday that Russia was responsible for the downing of Malaysian Airlines flight MH17 in 2014 and also that Moscow had repeatedly and systematically violated human rights in Ukraine.\n\nThe Strasbourg-based European Court of Human Rights (ECHR) said Russia had performed indiscriminate military attacks, summary executions of civilians, torture including the use of rape as a weapon of war, unjustified displacement and transfer of civilians and other violations.\n\nAhead of Wednesday’s ruling, Kremlin spokesman Dmitry Peskov said Russia would not abide by any court decisions, saying: “We consider them null and void.”\n\nThe ECHR is an international court of the Council of Europe, also based in Strasbourg, from which Russia was expelled in 2022 following its invasion of Ukraine. Russia’s parliament then voted in 2023 to end the ECHR’s jurisdiction in the country.\n\nIn its ruling, the ECHR said: “Taken as a whole, the vast volume of evidence before the court presented a picture of interconnected practices of manifestly unlawful conduct by agents of the Russian State (Russian armed forces and other authorities, occupying administrations, and separatist armed groups and entities) on a massive scale across Ukraine.”\n\nThe ruling concerned four consolidated cases, one of which involved Malaysian Airlines flight MH17, which departed Amsterdam for Kuala Lumpur in July 2014 and was shot down over eastern Ukraine amid fighting between Ukrainian forces and pro-Russian separatists. All 298 people on board the plane died.\n\nMoscow denies any responsibility for MH17’s downing and in 2014 denied any presence in Ukraine.\n\nThe ECHR ruled that Russia had failed to conduct an adequate investigation into the incident, to cooperate with requests for information or provide legal remedies for survivors. Its lack of cooperation and continued denial of any involvement has caused additional suffering for the victims’ relatives, the court said.\n\nResponding to the ruling, Dutch Foreign Minister Caspar Veldkamp said: “Nothing can take away this suffering and grief, but I hope the verdict offers a sense of justice and recognition.” A majority of those on the airliner were Dutch.\n\nThe other three cases covered by Wednesday’s ruling were brought by Ukraine, over pro-Russian separatists accused of abducting groups of Ukrainian children and transferring them to Russia, and over alleged patterns of human rights violations during Russia’s war in Ukraine, now in its fourth year.\n\nUkraine’s Justice Ministry, in a statement on the Telegram messaging app, hailed the ECHR ruling as “one of the most important in the practice of interstate cases”.\n\nThe court is expected to rule in due course on possible damages and compensation but it has no way of enforcing its rulings, especially on a country that no longer recognises its jurisdiction, meaning Wednesday’s verdict is mainly symbolic.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/09195207073ca35.jpg",
  "retrievedAt": "2025-08-17T20:00:26.908Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923078/russia-launches-largest-drone-strike-of-war-with-ukraine-after-trump-vows-to-send-more-weapons",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T16:20:03.000Z"
}
