{
  "title": "President expresses displeasure over delay in filling vacant posts of FUUAST Senate",
  "link": "https://www.app.com.pk/national/president-expresses-displeasure-over-delay-in-filling-vacant-posts-of-fuuast-senate/",
  "date_published": "2023-02-17T15:19:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 17 (APP): President Dr Arif Alvi on Friday expressed dismay over the inordinate delay in filling the vacant posts of members of the Senate of Federal Urdu University of Arts, Science and Technology (FUUAST).\nThe president in his direction said the process for appointments should be initiated, before the expiry of the tenure of the forum concerned, or the retirement of the office-bearers, so that all matters of important nature could not be disrupted or delayed.\nThe president expressed these views while presiding over a meeting of the FUUAST Senate, held at Governor House, Karachi, on Friday.\nChairman Higher Education Commission Professor Dr Mukhtar Ahmed, Acting-Vice Chancellor of FUUAST Professor Dr M Ziauddin, senate members of the university and representatives of the Ministry of Federal Education and Professional Training attended the meeting.\nSpeaking on the occasion, the president said that FUUAST was a prestigious higher education institution of Karachi and stressed the need to address various issues being faced by it to ensure the smooth functioning of the administrative and academic wings of the institution.\nHe said the ministry of Federal Education and Professional training should fast-track the process of nominations without further delay.\nThe president also took notice of the findings of the HEC committee which pointed out irregularities in the selection and appointment of academic and administrative officials, and other matters and instructed the University administration to submit a detailed report and fix responsibility against those who committed the irregularities.\nThe Chairman HEC briefed the meeting about the inquiry committee report and the irregularities in the university.\nSenate members of FUUAST said that all the important forums including the Senate and academic council should be made fully functional to take timely and prompt decisions.",
  "retrievedAt": "2025-08-11T06:06:43.034Z"
}
