{
  "title": "SC suspends transfer order of CCPO Lahore Ghulam Mahmood Dogar",
  "link": "https://www.app.com.pk/national/sc-suspends-transfer-order-of-ccpo-lahore-ghulam-mahmood-dogar/",
  "date_published": "2023-02-17T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): The Supreme Court on Friday suspended the transfer order of Capital City Police Officer (CCPO) Lahore Ghulam Mahmood Dogar.\nA three-member SC bench comprising Justice Ijaz Ul Ahsan, Justice Munib Akhtar, and Justice Sayyed Mazahar Ali Akbar Naqvi heard the CCPO Ghulam Mehmood Dogar transfer case.\nDuring the course of proceedings, the Secretary Election Commission and Director General (Law) ECP appeared in the court.\nJustice Ijaz-ul-Ahsan asked whether the Chief Election Commissioner had come to the court.\nUpon this, the Secretary Election Commission replied that the Chief Election Commissioner was not able to come due to his illness.\nHe said that the Punjab government made a first verbal request to transfer the CCPO on 23 January.\nJustice Mazahar Akbar Naqvi inquired whether the Election Commission could allow transfers and postings under normal circumstances.\nJustice Ijaz-ul-Ahsan said that the Election Commission could allow the transfer in important situations according to the rules.\nJustice Munib Akhtar inquired how the transfer was made on a verbal request. He asked who had empowered the Chief Election Commissioner to transfer officers on verbal request.\nHe asked if a Mr X called and made such a request, would the court allow it? He asked under what laws assistant commissioners were transferred at the request of a caretaker government.\nJustice Munib Akhtar remarked that the Election Commission had the power to permit the transfer, not just the Chief Election Commissioner.\nHe asked was it the tradition of Election Commission that transfer was done on verbal request.\nThe Secretary Election Commission said that after the verbal request, a written request was also made. He said that such transfers had taken place in the ECP earlier as well.\nJustice Muneeb Akhtar said that Ghulam Mehmood Dogar was transferred on a verbal request, then a written request came.\nThe Secretary Election Commission told the court that the government made an oral request for the transfer of Ghulam Mehmood Dogar on 23 January while a written request was received on January 24 and it was approved on February 6.\nJustice Munib Akhtar inquired whether orders were issued on oral request even in normal circumstances.\nJustice Ijaz-ul-Ahsan said that the oral request was received, approved, and implemented after the implementation correspondence was made.\nJustice Muneeb Akhtar asked whether government institutions work verbally. He asked could constitutional bodies issue oral orders. The Election Commission could approve the transfer, not the Chief Election Commissioner, he added.\nHe asked whether the Election Commission had delegated its powers to the Chief Election Commissioner.\nThe Director General Law said that there was no document regarding the delegation of powers.\nThe caretaker government of Punjab had asked CCPO Lahore Ghulam Mehmood Dogar to report to the Punjab Service and General Administration Department on 23 January.\nLater, the court suspended the Punjab caretaker government’s order to transfer CCPO Lahore.\nThe court said that a five-member bench of the Supreme Court was already hearing the matter of the transfer posting of police officers and this bench would also hear the transfer case of Ghulam Mehmood Dogar.\nDuring the hearing, a request was made by the Islamabad Bar Association to issue an order for the holding of general elections in 90 days, which was rejected by the court.\nJustice Ijaz-ul-Ahsan said that the issue of elections had already been sent to the Chief Justice as this was the discretion of the Chief Justice. The power of constituting a bench rests with the Chief Justice to fix a case for hearing or not, he added.",
  "retrievedAt": "2025-08-11T06:06:26.021Z"
}
