{
  "title": "NA passes bill for establishment of Pir Roshaan Institute in Miranshah",
  "link": "https://www.app.com.pk/national/na-passes-bill-for-establishment-of-pir-roshaan-institute-in-miranshah/",
  "date_published": "2023-02-17T10:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): The National Assembly on Friday unanimously passed a bill for the establishment of Pir Roshaan Institute of Progressive Sciences and Technologies in Miranshah area of North Waziristan district, Khyber Pakhtunkhwa, after clause-by-clause reading.\nTaking up supplementary agenda under the constitutional provision, Speaker Raja Pervaiz Ashraf allowed Pakistan Muslim League-Nawaz (PML-N) lawmaker Zeb Jaffar to move the bill on behalf of Minister for Federal Education and Professional Training Rana Tanveer Hussain.\nAccording to the statement of object and reasons for the bill, the institute would provide a new identity to the district as well as to the Ghulam Khan border (Afghanistan) as a ‘knowledge corridor,’ connecting South-East, South Asia, and Central Asian states.\n“The peacebuilding development driven academic friendly gesture of the federation for the youth of Waziristan may provide a platform to global partners in development to invest in training youth for global peace and development,” it said.\nThe strategic importance, engaging state citizenry, local commitments, and a huge gap in training to harness human capital for development could attract youth beyond Waziristan, deep into Afghanistan and Central Asia, the statement said.\nThe Ministry of Federal Education and Professional Training had drafted the Pir Roshaan Institute of Progressive Sciences & Technologies, Miranshah, Khyber Pakhtunkhwa Act-2022, and processed it after due consideration by the Federal Cabinet.\nFollowing the bill passage, independent lawmaker Mohsin Dawar thanked the House, Speaker National Assembly Raja Pervaiz Ashraf and Prime Minister Shehbaz Sharif for the bill’s smooth passage.\nHe termed the establishment of Pir Roshaan Institute of Progressive Sciences and Technologies in Miranshah a “welcoming step”.\nThe lawmaker said people of the area, who in the past had been facing severe law and order-related issues, would now be able to get a modern education facility for their children and play a due role in contributing to national development.",
  "retrievedAt": "2025-08-11T06:06:10.083Z"
}
