{
  "title": "US-Pakistan discuss strengthening economic ties, expanding people-to-people connections",
  "link": "https://www.app.com.pk/national/us-pakistan-discuss-strengthening-economic-ties-expanding-people-to-people-connections/",
  "date_published": "2023-02-17T09:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP): Counselor of U.S. Department of State Derek Chollet discussed a wide range of issues with Pakistan including strengthening of economic ties, cooperating to address the impacts of the climate crisis, and expanding people-to-people connections.\n“The United States and Pakistan have a robust partnership based on decades of bilateral cooperation and support, and we look forward to strengthen our relationship in trade, investment, climate, clean energy, health, security, education, and other shared priorities,” said Counselor Chollet who is in Pakistan on two day visit alongwith a delegation of senior U.S. government officials, including Counselor of the U.S.\nAgency for the International Development Clinton White, and Principal Deputy Assistant Secretary for Pakistan Elizabeth Horst to highlight the importance of our bilateral partnership and reaffirm our countries’ shared goals.\nFollowing the January 9 Conference on Climate Resilient Pakistan in Geneva, Counselor Chollet’s visit provided a chance to learn more about the progress Pakistan has made so far in response to the floods and how the United States, other donors and partners can most effectively support Pakistan’s resilient recovery, said a news release issued by the Embassy of UN in Pakistan.\nTo date, the United States has provided more than $200 million dollars in assistance provided to support disaster resilience and flood response efforts in Pakistan. This continued assistance reflects the endurance of the bilateral partnership and the United States’ long-term commitment to Pakistan and its people.\nSharing the details of the visit, the embassy said that Counselor Chollet met with Foreign Minister Bilawal Bhutto Zardari and discussed strengthening the U.S Pakistan bilateral partnership, including increased economic cooperation and Pakistan’s needs as it continues to recover and rebuild following the floods.\nAt a meeting with Minister of State for Finance and Revenue Dr. Aisha Ghaus Pasha, the delegation also talked about economic reform and improving the regulatory environment in Pakistan to boost foreign investment, including from U.S businesses.\nThe Counselor also met with Minister of Planning Ahsan Iqbal and discussed Pakistan’s flood recovery and future opportunities within the U.S. Pakistan Green Alliance.\nAppreciated Pakistani Minister of Planning, Development, and Special Initiatives Ahsan Iqbal @betterpakistan. We discussed flood recovery and reconstruction. The U.S. is one of the largest assistance providers to Pakistan, donating over $200M towards its flood response. pic.twitter.com/QSVQ2tQQvq\n— Derek Chollet (@CounselorDOS) February 17, 2023\nThe Green Alliance builds upon the rich U.S Pakistan history of environmental collaboration and will help both the countries jointly to meet the agricultural, energy, water, and economic needs of the present and future.\nThrough the Green Alliance, the two countries will support each other to holistically strengthen climate resilience, pursue energy transformation, and foster inclusive economic growth.\nThe U.S. government will build on the dialogues of the Counselor’s visit at the first Trade and Investment Framework Agreement Council since 2016 next week and the second Energy Security Dialogue and Climate and Environment Working Group this Spring.\nThe U.S. government is dedicated to expanding the full range of trade, security, education, people-to-people, climate, and clean energy cooperation and ties between the Pakistani and American people to promote a more stable, secure, and prosperous future for both our nations.",
  "retrievedAt": "2025-08-11T06:06:14.056Z"
}
