{
  "article_id": "2025-01-02_dab3f27d269383ead3f9a7bd28cd6bbb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/railways-earn-rs-46-bln-in-six-months/",
    "retrieved_at": "2025-08-27T11:16:22.973Z"
  },
  "metadata": {
    "title": "Railways earn Rs 46 bln in six months",
    "author": null,
    "date_published": "2025-01-02T08:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 397,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 2 (APP):Pakistan Railways has earned an amount of Rs46 billion in the first six months of the current fiscal year 2024-25 due to the organizationas effective policies which reflects the institutionas positive trajectory. aThe department has achieved a revenue of Rs46 billion in the first half of the fiscal year, marking an increase of Rs5 billion as compared to the same period last year,a an official in the Ministry of Railways told APP. As per the figure, he said Pakistan Railways has generated Rs24 billion from passenger trains and Rs16 billion from freight services while Rs6 billion was earned through land leases, coaching, and other sources. To a question, the official said around 41.91 million passengers traveled by train during 2023-24 compared to 35.40 million in 2022-23 a an increase of 6.51 million in the annual count. He said a total passenger earning in the fiscal year 2023-24 was Rs. 47.712 billion, exceeding the budgetary target by a margin of Rs. 8.712 billion. Besides, there is an increase in earnings by Rs. 13.799 billion as compared to the earnings of the previous financial year 2022-23. The official said Pakistan Railways has made special arrangements to facilitate passengers at stations and in trains en-route including provision of state-of-the-art dining cars, mobile charging sockets in coaches, and provision of water dispensers in coaches to provide clean drinking water to passengers. Besides this, the department has installed Ticket Vending Machines (TVM) for purchasing tickets, information counters to guide and facilitate passengers, digital display boards for the arrival and departure of trains, and provision of wheelchairs and ramps for disabled people. To improve the punctuality of trains, he said Pakistan Railways is removing speed restrictions through special maintenance of track, the signaling system is being improved through computerized interlocking and installation of solar system, locomotive failures are being removed through timely maintenance, and new passenger coaches are being inducted. Redressal of passenger complaints, he said the department has established a state-of-the-art call center under Railway Automated Booking and Travelling Assistance (RABTA), passengers can also lodge their complaints on Pakistan Railwaysa website, and complaint registers are also provided at stations and in trains so that the passengers can lodge their complaints. aIf a contractor is found selling substandard products, they are fined and issued a warning. Upon receiving three fines, the contractoras agreement with Pakistan Railways is terminated,a he added.",
    "summary": "Pakistan Railways earned Rs46 billion in the first six months of the 2024-25 fiscal year, a Rs5 billion increase compared to the previous year. This revenue was generated from passenger trains, freight services, land leases, and other sources. The department has implemented various measures to improve passenger experience and train punctuality.",
    "keywords": [
      "Pakistan Railways",
      "revenue",
      "passenger trains",
      "freight services",
      "fiscal year",
      "complaints"
    ]
  },
  "entities": [
    {
      "text": "Pakistan Railways",
      "label": "ORGANIZATION",
      "wikidata_id": "Q7124958"
    },
    {
      "text": "APP",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Ministry of Railways",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Islamabad",
      "label": "LOCATION",
      "wikidata_id": "Q1166"
    }
  ]
}