{
  "article_id": "2025-01-02_2cefdec6f592a4543be81cde190ceb15",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pti-threat-to-pakistans-existence-economy-claims-pml-n-leader/",
    "retrieved_at": "2025-08-27T11:15:32.719Z"
  },
  "metadata": {
    "title": "PTI threat to Pakistanâs existence, economy; claims PML-N leader",
    "author": null,
    "date_published": "2025-01-02T13:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 375,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 2 (APP): Pakistan Muslim League-Nawaz (PML-N) Khyber Pakhtunkhwa leader Ikhtiar Wali Khan stated on Thursday that Pakistan Tehreek-e-Insaf (PTI) threatened Pakistanas existence, ideology, and economy by working to destabilize the economy and attempting to push it towards potential default. During a news conference, he stated that PTI is spreading extensive propaganda in the country, claiming its agenda is neither focused on Pakistan nor its security. Ikhtiar Wali Khan stated that PTI opposes China Pakistan Economic Corridor (CPEC) and Gwadar and resents the nationas economic progress. PTI seeks the countryas default, operates social media accounts from hostile nations, and spreads false propaganda against institutions. PTI has yet to establish itself as a political party. Now, the people of Pakistan must be mobilized against both patriots and traitors, as a small mistake could lead to significant damage, he expressed. Ikhtiar Wali added that the countryas economy was currently thriving, with investments coming from foreign nations like Saudi Arabia and the Unied Arab Emirates (UAE), but PTI is uncomfortable with this progress. PTI demands the opposition leader be appointed chairman of the Public Accounts Committee in the National Assembly but refuses to implement this formula in their own province, Khyber Pakhtunkhwa. These individuals, who have been caught embezzling over 2800 billion rupees, are now attempting to portray themselves as defenders, he said. He said that hospitals and schools in KPK had been ruined, adding that in over three thousand schools, only one teacher was available to educate the children, who are forced to study on bare floors in poor conditions. The province faces a severe shortage of medicines, and residents are compelled to seek treatment from the federal government and Punjab, he added. He stated that whenever PTI was in opposition, it invited external hostile forces and was willing to go to any lengths to achieve its personal goals. He said that after the PTI founder was removed from power through a no-confidence motion, his first statement was that Pakistan would be divided into three parts. He added that Pakistanas enemies would continue to suffer in the same way. The PML-N leader further remarked that while the PTI founder once claimed his life was dedicated to Allah, it now appears it was dedicated to the empire.",
    "summary": "PML-N leader Ikhtiar Wali Khan accused PTI of threatening Pakistan's existence and economy through destabilization efforts and propaganda. He highlighted PTI's opposition to CPEC and Gwadar, alleging they seek the country's default and spread false information. Wali also criticized PTI's actions in Khyber Pakhtunkhwa, citing issues in education and healthcare.",
    "keywords": [
      "PTI",
      "PML-N",
      "Pakistan",
      "economy",
      "Khyber Pakhtunkhwa",
      "propaganda",
      "CPEC"
    ]
  },
  "entities": [
    {
      "text": "Ikhtiar Wali Khan",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Pakistan Muslim League-Nawaz",
      "label": "ORGANIZATION",
      "wikidata_id": "Q7124709"
    },
    {
      "text": "PML-N",
      "label": "ORGANIZATION",
      "wikidata_id": "Q7124709"
    },
    {
      "text": "Khyber Pakhtunkhwa",
      "label": "LOCATION",
      "wikidata_id": "Q12059"
    },
    {
      "text": "Pakistan Tehreek-e-Insaf",
      "label": "ORGANIZATION",
      "wikidata_id": "Q7125026"
    },
    {
      "text": "PTI",
      "label": "ORGANIZATION",
      "wikidata_id": "Q7125026"
    },
    {
      "text": "China Pakistan Economic Corridor",
      "label": "ORGANIZATION",
      "wikidata_id": "Q2995958"
    },
    {
      "text": "CPEC",
      "label": "ORGANIZATION",
      "wikidata_id": "Q2995958"
    },
    {
      "text": "Gwadar",
      "label": "LOCATION",
      "wikidata_id": "Q26343"
    },
    {
      "text": "Saudi Arabia",
      "label": "LOCATION",
      "wikidata_id": "Q851"
    },
    {
      "text": "Unied Arab Emirates",
      "label": "LOCATION",
      "wikidata_id": "Q878"
    },
    {
      "text": "UAE",
      "label": "LOCATION",
      "wikidata_id": "Q878"
    },
    {
      "text": "Allah",
      "label": "PERSON",
      "wikidata_id": "Q434"
    },
    {
      "text": "Punjab",
      "label": "LOCATION",
      "wikidata_id": "Q1036"
    }
  ]
}