{
  "title": "Iqra University students to represent Pakistan at Global Encounters Festival 2025 in Dubai",
  "author": null,
  "content": "ISLAMABAD, Jul 22 (APP):Iqra University Islamabad Campus is proud to announce a significant milestone for its students, as they continue to make their mark on the international stage. Two of our outstanding students have been selected to represent Pakistan at the prestigious Global Encounters Festival 2025 in Dubai.\nIn a remarkable achievement, Hira Ali, currently enrolled in the Media Studies program, has been selected to join the National Volleyball Team representing Pakistan at this global event. Her success is a testament to the university’s commitment to empowering students in all disciplines, promoting a balanced development of academics and co-curricular achievements,said a press release issued here on Tuesday.\nAziz Ahmed, a graduate of Iqra University, has been selected for the Pakistan International Squash Team. This incredible achievement is a proof of his dedication, rigorous training, and passion for the sport. His selection not only brings pride to the university but also reflects the nurturing environment Iqra provides for student-athletes to excel at both national and international levels.\nGlobal Encounters Festival 2025, being held in Dubai, is an international celebration that brings together youth from across the world through sports, arts, and cultural exchanges. The participation of Iqra University’s students is not only a personal triumph but also a proud moment for the entire campus community.\nWe extend our heartfelt congratulations to Hira Ali and Aziz Ahmed. Their achievements serve as an inspiration to fellow students and reinforce our university’s vision of producing globally competitive talent.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:55:59.132Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/iqra-university-students-to-represent-pakistan-at-global-encounters-festival-2025-in-dubai/",
  "dateList": "2025-07-22",
  "date_published": "2025-07-22T08:24:00.000Z"
}
