{
  "title": "PPP’s victory in by-election reflect AJK people’s confidence over PPP: Kundi",
  "link": "https://www.app.com.pk/national/ppps-victory-in-by-election-reflect-ajk-peoples-confidence-over-ppp-kundi/",
  "date_published": "2023-06-09T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 9 (APP): Federal Minister of State for Poverty Alleviation and Social Safety and Central Information Secretary of PPP Faisal Karim Kundi on Friday said Pakistan People’s Party’s success in Azad Jammu and Kashmir (AJK) by-election reflected the AJK’s people’s confidence and support for the party.\nAddressing a news conference here, Faisal Kundi congratulated the office bearers and workers of PPP for their hard work and sincerity that led to success in AJK by-election.\n“Support of AJK people were with PPP yesterday, today and will remain in future”, he said.\nFaisal Kundi while criticizing Imran Khan said that he who claimed that anyone given a ticket by him in the election will succeed can see how people of AJK supported PPP despite his video address.\n“This is a clear message for those who were saying that PPP is only limited to Sindh province that political leaders from Khyber Pakhtunkhwa, Punjab, and Gilgit-Baltistan are also joining PPP in a great number”, he said.\nAbout the newly formed political party, Faisal Kundi said that PPP always welcomed democratic political parties.\nThe SAPM also said that PPP has always advocated the stance of the people of Indian Illegally occupied Jammu and Kashmir (IIOJ&K) for their demand of holding a plebiscite.\nRegarding Minister for Foreign Affairs Bilawal Bhutto’s recent visit to Iraq, the SAPM said that the joint statement between Pakistan and Iraq was a historic act and added that during his highly successful visit, he discussed with the high official important issues including visa exemption, provision of legal assistance to the prisoners, facilitation for the Zaireen and legalization of Pakistani workers.\nMinister Kundi said fruitful discussions were also held regarding strengthening cooperation between the two countries in the trade, tourism, and health sectors.\nThe SAPM said that Bilawal Bhutto also laid the foundation stone for Pakistan’s new embassy building in Iraq which he termed as a significant step for fostering the diplomatic ties between the two countries.\nThe foundation stone will be laid for Pakistan’s Consulate in Najaf soon, he added.\nDuring the visit, the plan of starting a Ferry service from Karachi and Gwadar to Iraq also came under consideration to facilitate the visitors, Faisal Kundi conveyed.\nThe interior minister of Iraq will be coming to Pakistan to finalize the commitments made during the visit in the form of a Memorandum of Understanding (MoU) at the official level, Faisal Kundi said.\nReferring to President Pakistan People’s Party Parliamentarians (PPPP) Asif Ali Zardari’s recent address, the SAPM said that Asif Zardari’s address about economy was appreciated by the people, especially the business community.\nPPP will hold meetings with the Chambers of Commerce of different provinces to brief the business community about its plans and get their valuable feedback.\nAbout the Benazir Income Support Program (BISP) Faisal Kundi said that the dynamic survey continued across the country successfully. So far, around 1.9 million have registered in the dynamic National Socio-Economic Registry.\nHe also disclosed that the new installment of Rs. 9,000 (after an increase of 25 percent) will be issued soon for the Kafaalat beneficiaries.",
  "retrievedAt": "2025-08-11T08:40:40.093Z"
}
