{
  "title": "Pakistan fulfils all necessary conditions of IMF: Dar",
  "link": "https://www.app.com.pk/national/pakistan-fulfils-all-necessary-conditions-of-imf-dar/",
  "date_published": "2023-06-09T18:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 9 (APP): Minister for Finance Ishaq Dar on Friday said that Pakistan has tried its best to fulfil all necessary conditions of the International Monetary Fund (IMF).\nTalking to a private television channel, he said IMF should not object to presenting a people-friendly budget. He said that government has made all out efforts to provide maximum relief to people. The finance minister said that last regime of Pakistan Tehreek e Insaf (PTI), had formulated weak policies, due to which, the masses were facing immense difficulties in their routine life matters. He said Pakistan had to face financial crunch due to Imran’s policies.\nHe said that Pakistan Muslim League-N, after establishing coalition government was taking all important measures to re-negotiate with IMF on soft terms and condition. IMF should satisfy with Pakistan because we have completed necessary requirements, he added. He hoped that Pakistan will achieve growth rate as per set target of the government.\nTo a question, Ishaq Dar said, we are not pondering over increasing the rate of PDL from 50 to next digit. In reply to a question about protecting this country from default line, he said this a geo-politics to engage Pakistan. He said, our country will never fall into the category of “default group”.\n“We have fulfilled majority demands of IMF, ” he said. IMF shouldn’t have any objection because the government has presented a people-friendly budget. He said no new taxes imposed in this budget. About continuation of IMF program, he said that new government will decide after the elections.\nTo a question about PTI, he said that coalition government had made efforts to talk with PTI but Imran’s party was not willing to sit on the negotiating table for resolving issues.",
  "retrievedAt": "2025-08-11T08:40:23.732Z"
}
