{
  "title": "Five E’s  framework to prove game changer for economic development of Pakistan: Marriyum",
  "link": "https://www.app.com.pk/national/five-es-framework-to-prove-game-changer-for-economic-development-of-pakistan-marriyum/",
  "date_published": "2023-06-09T08:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Friday that the 5E’s framework formulated by the Ministry of Planning and Development & Initiatives (MoPD&SI) will prove a game changer for economic development in Pakistan.\nIn a series of tweets, she said that ‘Exports’, ‘E-Pakistan’, Environment & Climate Change, Energy & Infrastructure, and Equity & Empowerment were the pillars of the turnaround of Pakistan.\nگزشتہ مالی سال کے 5ہزار 348.2 ارب روپے کے مقابلے میں 6210 ارب روپے ٹیکس رینیوز جمع ہوئےرواں مالی سال کے پہلے 9 ماہ میں 7 لاکھ ایف بی آر ٹیکس دہندگان کے ہدف کے مقابلے میں تقریبا 9 لاکھ12 ہزار نئے ٹیکس دہندگان کو رجسٹرڈ کیا ہےیہ ٹیکس نیٹ میں اضافے کا ثبوت ہے 1.15 ٹریلین روپے کا… pic.twitter.com/qlj62C3nUC\n— Marriyum Aurangzeb (@Marriyum_A) June 9, 2023\nThrough this framework, she added, new businesses and employment opportunities will be encouraged to increase exports.\nShe stated that the promotion of education and health and population control will pave the way for the development of Pakistan.\nAffordable and uninterrupted energy supply will give a new boost to the economy and business, she said adding environment will be improved through water reservoirs and food security.\nThrough e-Pakistan, youth will be given development opportunities and they will be empowered, she said.\nShe opined that the reduction of fiscal deficit to 4.6 percent of GDP from 4.9 percent was a major achievement which was a positive outcome of the correct economic policy of the government.\nShe said that a 76 percent reduction in the current account deficit was also a sign of sound economic policy.\nAbout 40.4 percent reduction in trade deficit showed the positive impact of economic measures.\nThe minister remarked that the trade deficit has been reduced to $25.8 billion from $43.4 billion, which was a sign of improvement.\nShe said that imports decreased by 29.2 percent, which had a positive impact on the economic situation. Import bill has fallen to 51.2 billion dollars against 72.3 billion dollars last year which was a step towards economic improvement, she added.\nCompared to Rs 5,348.2 billion during the previous financial year, Rs 6,210 billion in tax revenue was collected during the current fiscal.\nIn the first 9 months of the current financial year, about 912,000 new taxpayers have been registered against the FBR target of 700,000 taxpayers which she said was a manifestation of an increase in the tax net.\nMarriyum Aurangzeb said that with the allocation of the federal development budget worth Rs1.15 trillion, the economic activities in the country will accelerate and employment opportunities will increase.",
  "retrievedAt": "2025-08-11T08:40:40.654Z"
}
