{
  "title": "President directs LESCO to pay marriage grant to retired employee",
  "link": "https://www.app.com.pk/national/president-directs-lesco-to-pay-marriage-grant-to-retired-employee/",
  "date_published": "2023-06-09T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): President Dr Arif Alvi on Friday directed the Lahore Electric Supply Company (LESCO) to pay Rs 200,000 as a “marriage grant” to a retired employee for the marriage of his son who had been denied payment by LESCO.\nThe LESCO had denied the payment on the ground that he had applied for the grant after the expiry of the prescribed time limit of six months.\n“We should take care of such people, who due to ignorance of the law or being unaware of the benefits for which they might be eligible due to their service, are unable to benefit from them in time”, the president said.\nHe regretted that the employee was not aware of his entitlement and found out from others that a marriage grant for his son was possible.\nHe further held that it was the responsibility of government agencies to inform people about such benefits.\nPresident Alvi gave these remarks while accepting a representation filed by Muhammad Asif (the complainant) against the decision of the Wafaqi Mohtasib.\nAs per the details, Muhammad Asif was an employee of LESCO and, after his retirement, he applied for the “marriage grant” in respect of his son.\nHe was denied payment on the ground that his son’s marriage was held on 02.12.2018 whereas the complainant applied for the grant on 08.12.2020 i.e., after the expiry of about 2 years.\nAs per SOP regarding marriage grants, all applications should reach the office of the Chief Executive of LESCO within a period of six months from the date of marriage and a maximum of one year in special cases.\nFeeling aggrieved, he approached Wafaqi Mohtasib, which held that LESCO did not commit any maladministration and rejected his complaint.\nSubsequently, he filed a representation with the president against Mohtasib’s decision.\nThe president in his decision observed that the entitlement for the marriage grant was not disputed except that the application was submitted late.\nHe said that government agencies should keep people informed about such benefits for which they might be eligible so that they were not deprived of their entitlement.\nHe accepted the representation and directed LESCO to pay Rs 200,000 to the retired employee within 30 days.",
  "retrievedAt": "2025-08-11T08:40:40.227Z"
}
