{
  "title": "Pakistan, UK to join hands to eliminate hate content on social, online media",
  "link": "https://www.app.com.pk/national/pakistan-uk-to-join-hands-to-eliminate-hate-content-on-social-online-media/",
  "date_published": "2023-05-17T09:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Pakistan and United Kingdom on Wednesday agreed to work together to eliminate content related to hate and terrorist attitudes on social and online media.\nThe decision was made during a meeting between Acting British High Commissioner Andrew Dagleish and Minister for Information and Broadcasting Marriyum Aurangzeb.\nDuring the meeting, the promotion of bilateral diplomatic relations including cooperation in various fields of media, digital media, media training and filmmaking was also discussed.\nThe minister congratulated the ambassador and the people of UK over the coronation of King Charles III.\nMarriyum Aurangzeb said that Prime Minister Shehbaz Sharif’s recent visit to the United Kingdom and his participation in the coronation of King Charles III were manifestation of the friendship based on respect and trust between the two countries.\nStating that Pakistan attached special importance to bilateral relations with Britain, she expressed the determination to further strengthen the bilateral ties.\nDuring discussion on the cooperation in film policy and media training, the minister said film and drama played an important role in highlighting the culture and positive identity of any country.\nMarriyum Aurangzeb appreciated the role of British government for development of health, education, governance and human resource in Pakistan.\nShe said Pakistan government would get help from Britain’s modern media curriculum to provide training to journalists.The Acting British High Commissioner appreciated the progress made in the information sector including the economic policies of the present government of Pakistan.\nHe hailed Pakistan’s improvement of 7 ranks in the Global Media Freedom Index and congratulated the Information Minister over the achievement.\nThe High Commissioner also assured all possible cooperation to reduce the economic crisis of Pakistan andexpressed his good wishes and deep interest in promoting bilateral relations.",
  "retrievedAt": "2025-08-11T08:30:51.603Z"
}
