{
  "title": "National Action Plan to be devised for tackling Out-of-School Children issue",
  "link": "https://www.app.com.pk/national/national-action-plan-to-be-devised-for-tackling-out-of-school-children-issue/",
  "date_published": "2023-05-17T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Federal and provincial governments on Wednesday agreed to prepare a National Action Plan to address the confronted issue of Out-of-School Children (OOSC) and maximize the enrollment of school-age children across the country.\nThe decision was made in a high-level consultative meeting, chaired by Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal and attended among others by the Additional Secretary of Ministry of Federal Education & Professional Training, Provincial Secretaries of Education Departments, Director General of Federal Board of Intermediate and Secondary Education, Member Social Sector and Development of Planning Commission and other stakeholders, a news release said.\nOver the years, the meeting observed that Pakistan has made considerable progress in providing access to education to its school-age population, but its pace remained slow as compared to other developing countries.\nWith an estimated 22.8 million children aged 5-16 years out of school, Pakistan has one of the highest numbers of Out-of-School Children in the world.\nHowever, the incumbent government is committed to resolving this critical issue as soon after coming into power it took several steps to counter Pakistan’s OOSC challenge.\nThe meeting was informed that the upcoming Public Sector Development Programme (2023-2024) would institutionalize several key initiatives to achieve universal education in Pakistan.\nA model Universal Enrollment Pilot Project would be in place in the Islamabad Capital Territory (ICT) to ensure no Out-of-School Children in the capital. After the successful execution of the pilot project, it would be replicated to produce similar results in other areas across the country.\nThe Planning Ministry will also identify Pakistan’s districts with the highest concentrations of OOSC.Furthermore, a National Out-of-School Children Fund would be established to provide performance-based cash grants to provincial governments for getting the required results in the most affected districts.\nAdditionally, to reduce dropout rates, especially for girls who face mobility issues, the government will launch a comprehensive virtual schooling system.\nEarlier, the provincial representatives briefed the meeting about the situation overview of OOSC in their respective provinces and shared their approaches to ensure maximum primary school enrollment.\nPlanning Minister Ahsan Iqbal directed the Federal Directorate of Education (FDE) to establish a birth certificate-basedadmission system in collaboration with National Database and Registration Authority (NADRA). “As soon as a child reaches school-going age, he/she should be enrolled in a nearby school by the state.”\nHe also highlighted the importance of adult literacy and directed to make a strategy accordingly.Member (Social Sector & Devolution) Planning Commission Rafiullah Kakar also asked for the data-driven need assessment for all projects targeting OOSS.\nHe briefed that the Planning Commission was also developing a national Education Index to monitor progress on education outcomes and encourage healthy competition among provinces.",
  "retrievedAt": "2025-08-11T08:30:38.005Z"
}
