{
  "title": "Mushaal fires broadside on Modi for turning IIOJK into fortress, gigantic prison",
  "link": "https://www.app.com.pk/national/mushaal-fires-broadside-on-modi-for-turning-iiojk-into-fortress-gigantic-prison/",
  "date_published": "2023-05-17T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP):Peace and Culture Organisation Chairperson Mushaal Hussein Mullick fired a broadside on the notorious Narendra Modi-led fascist Indian government for turning the occupied Kashmir into a fortress, military garrison and a gigantic prison.\nHowever, she vowed that brave Kashmiri people would leave no stone unturned to make G-20 summit a flopped show.Mushaal, who is the wife of incarcerated senior Hurriyat leader Yasin Malik, said in a statement on Wednesday that the notorious Indian government was holding G20 meeting in IIOJK aimed at diverting global attention from its illegal occupation of the scenic valley, said a press release here on Wednesday.\nMoreover, she said that hindutva regime was organizing the event in the disputed region to hoodwink the world and divert attention from its atrocities and inhuman acts in the occupied territory.\nShe urged that Pakistan should approach all G-20 countries conveying its reservations over the holding G-20 meeting in the disputed region.\nMushaal stated that it was high time Pakistan should sensitize the G20 states about state terrorism and rising human rights violations in IIOJK.\nThe Chairperson went on to say that the Pakistani government should write to all the member countries of the group to boycott the summit because their participation in the conference in a disputed region would send a wrong message that these states were siding with the oppressor and usurper.\nMushaal vowed that Kashmiri people would raise their voices on all forums across the world to foil the Indian government’s nefarious designs.\nShe said that they would expose the true and dirty face of the Indian notorious government to the world by exposing the ongoing violence, continued genocide, killings of innocent Kashmiris, and rapping of Kashmiri women.\nMushaal said that India was trying to hide its brutality and terrorism and change the disputed status of Kashmir.\nShe stated that besides deploying over one million troops, India was using its dreaded intelligence agencies and investigation institutions like National Investigation Agency, Enforcement Directorate and State Investigation Agency to create panic, fear and intimidate Kashmiris ahead of G20 meetings in the territory.\nThe Hurriyat leader urged that ‘Now is the time’, the G20 countries “Boycott Kashmir Summit” should show the same solidarity with Kashmiri people, who had been facing worst atrocities at the hand of the occupied forces for the last seven decades, the way they demonstrated with Ukraine in the face of a Russian invasion.\nLashing out at the RSS-Inspired hundutva regime for killing a Kashmiri youth by an Indian goon in Saudi Arabia, she asked: “Indians are after our blood in Kashmir, India and the outside world. Is there any place where a Kashmiri should feel safe, completely?”",
  "retrievedAt": "2025-08-11T08:30:43.609Z"
}
