{
  "title": "Digital ads truck goes around Washington flashing key message, ‘Say no to G20 meeting in occupied Kashmir’",
  "link": "https://www.app.com.pk/national/digital-ads-truck-goes-around-washington-flashing-key-message-say-no-to-g20-meeting-in-occupied-kashmir-2/",
  "date_published": "2023-05-16T20:00:00.000Z",
  "source": "APP",
  "content": "WASHINGTON, May 16 (APP): Flashing ‘Say no G-20 meeting in occupied Kashmir”, a digital advertising truck drove around key locations in Washington Monday that included the embassies of countries who are members of that group of nations.\nRented by the World Kashmir Awareness Forum (WKAF), a Washington-based advocacy organization, the truck also beamed messages that included a call on G-20 members to persuade India to abide by her pledge to allow the people of Kashmir their right to self-determination.\nOther messages on the electronic screens were: “G20 risks legitimizing India’s illegal occupation of Kashmir”; “Decolonize Kashmir”; “G20 in Kashmir violates UN resolutions”; “G20 in occupied Kashmir enables genocide”; “Kashmir for Kashmiris”; “Kashmir at the brink of Genocide (Genocide Watch)” and “Stop Hindutav Fascism.”\nA G-20 meeting of the working group on tourism is set to be held in Srinagar on 22-24 May.\nBesides targeting the embassies of G-20 countries, including India, the digital truck positioned itself in front of the State Department before moving to the Capitol Hill; the Library of Congress; the Washington Monument; the White House; various Museums; the Lincoln Memorial; the Washington National Cathedral; the World Bank and IMF.\nIn a statement, Dr. Ghulam N. Mir, Chairman of the Kashmir Diaspora Coalition & President of the World Kashmir Awareness Forum’ said that since its occupation of Kashmir 76 years ago, India had attempted to wish away the Kashmir conflict by various aggressive means, but only failed.\nIndia has tried to cover the evidence of thousands of mass graves and gang rapes committed by Indian military and paramilitary forces in Kashmir, he said. Now India will be entertaining its rich invitees on the grounds of a nations which is not it’s part.\n“We appeal to the G20 countries, as also Prime Minister Narendra Modi to show respect to the dead and the living of Kashmir whose country is being colonized by India and avoid dignifying the host country – India,’ Mir said.\nDr. Ghulam Nabi Fai, Secretary General of the World Kashmir Awareness Forum said that India is abusing its G-20 presidency to portray an image of normalcy in Kashmir. India’s aim is to divert global attention from the core issue of the occupation of a people, he said.\nDr. Fai emphasized that members of G20 countries are practicing democracies, except India, and they should abide by the Universal Declaration of Human Rights and not to sacrifice their moral authority and ethical values for commercial interests and lucrative business deals.\nHe quoted Professor Fernand de Vareness, United Nations Special Rapporteur on Minority Issues, who issued a statement on Monday that the G20 is unwittingly providing a veneer of support to a façade of normalcy (in Kashmir) at a time when massive human rights violations, illegal and arbitrary arrests, political persecutions, retractions and even suppression of free media and human rights defenders continue to escalate.\nDr. Imtiaz khan, Professor at George Washington Medical Center said that the people of Indian Occupied Kashmir express their strong reservations about the G20 meeting to be held in the disputed territory. Based on the UN resolutions, the final status of Jammu and Kashmir has to be decided by the plebiscite to be held under its auspices.\nNot only has India reneged on her promise to allow the people of Kashmir to exercise their will, it has also unleashed a reign of terror on the region that has been condemned by well reputed international human rights organizations, Khan pointed out.",
  "retrievedAt": "2025-08-11T08:30:54.486Z"
}
