{
  "title": "Police register FIR against TLP Chief as police constable mauled by protesters",
  "link": "https://www.app.com.pk/national/police-registers-fir-against-tlp-as-police-officer-mauled-by-tlp-protesters/",
  "date_published": "2021-04-13T17:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 13 (APP): The Lahore Police Tuesday registered an FIR against the TLP Chief Saad Rizvi and others for the murder of a police constable as the Federal Cabinet approved the deployment of Rangers to sternly deal with the TLP protesters and protect the lives and properties of the people.\nThe police constable was brutally murdered by workers of Tehreek e Labaik Pakistan (TLP) on Tuesday at Shahdara in Lahore while over 90 were injured in violent clashes, that erupted yesterday after the arrest of Amir of the party Allama Saad Hussain Rizvi.\nPolice spokesperson Lahore Rana Arif said Shahdara Police have registered a First Information Report against TLP Chief Saad Rizvi and other activists under section 302 PPC and 7ATA.\nThe Punjab Police-constable Muhammad Afzal, was deputed at the Shahdara police station. Over two dozen police constables received injuries in clashes with the protesters. His funeral was later held with full honours.\nLater Tuesday night another constable Ali Imran breathed his last in the Mao Hospital, the police said. He too was beaten by the TLP workers.\nThe federal cabinet which met here in Islamabad under the chair of Prime Minister Imran Khan was briefed on the latest situation after the arrest of the TLP leaders. Interior Minister briefed the meeting which later approved the deployment of paramilitary troops to maintain law and order, Minister for Science and Technology Fawad Chaudhry later told a press conference.\nHe said the additional companies of Rangers would be deployed besides those at Lahore, Rawalpindi and Bahawalpur at Rahim Yar Khan, Sheikhupura, Gujranwala and Chakwal.\nAccording to an official source, the cabinet also decided to take strict action and register terrorism cases against those violating the law.\nThe TLP is protesting against the blasphemous caricatures published in France and has demanded the expulsion of the French ambassador. The government in November agreed to take their demands before the Parliament. The TLP had given a deadline of April 20 to meet its demands, else it would march on to the Capital.\nAlso Read: TLP protest causes gridlocks in major cities; Ambulances stuck, oxygen supply disruption feared as Covid19 peaks\nMinister for Law, Parliamentary Affairs Raja Basharat while chairing a meeting in Lahore said the miscreants would be dealt with sternly. He also briefed Chief Minister Punjab Usman Buzdar who directed that all necessary measures be taken to protect the lives and property of the people and to clear all intersections and roads blocked by the TLP protestors.\nRaja Basharat asked the TLP workers and leaders not to resort to violence. He said Ramazan was a month of blessings, but the TLP was causing serious problems for the people who could not even get medical treatment, medicines and access to emergency care, as the third wave of coronavirus was at its peak.\nSpecial Assistant to Prime Minister Raoof Hussain in a tweet described the TLP as “a monster”.\n“It does not represent anything religious, least of all the teachings of the prophet (PBUH). It distorts the noble practices of Islam by spearheading violence. This monster must not be given any space. It must be eliminated using full might of the state.”\nTLP is a monster. It does not represent anything religious, least of all the teachings of the prophet (PBUH). It distorts the noble practices of Islam by spearheading violence. This monster must not be given any space. It must be eliminated using full might of the state.\n— Raoof Hasan (@RaoofHasan) April 13, 2021\nSocial media users uploaded images of injured police constables and expressed solidarity with them for protecting the lives and properties of the people.\nMeanwhile, the police and district administrations were able to get many roads cleared from the protestors in many cities. However small groups of TLP workers continued to play hide and seek with the police.\nSections of the Motorway closed yesterday remained open on Tuesday and the National Highway and Motorway Police, and Traffic police of major cities continued to update the people about the latest traffic situation through their social media accounts.\n-Report by Shafek Koreshe",
  "retrievedAt": "2025-08-11T20:37:24.243Z"
}
