{
  "title": "Sufficient stock of anti-COVID vaccine available: Asad Umar",
  "link": "https://www.app.com.pk/national/sufficient-stock-of-anti-covid-vaccine-available-asad-umar/",
  "date_published": "2021-04-13T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):Minister for Planning, Development and Special Initiatives Asad Umar on Tuesday said that more than 1.3 million people had so far been vaccinated against COVID-19 in the country.\nAddressing a press conference here, the minister informed that as of now, 900,000 vaccines are available in the country while more would be procured in coming days.\nThe minister who is also Chairman National Command and Operation Center (NCOC) said currently 60,000 to 70,000 people are receiving vaccines daily and this number would be increased up to 200,000 after Eid ul Fitre.\nHe said although people of all age group are vulnerable to the pandemic but young people have more immunity therefore the government has decided to give priority to the elderly people and the healthcare workers over other people for the vaccination.\nAsad Umar hoped that the vaccination for the people of age group 50 to 60 years would start soon whereas after Eid-ul-Fitre, people of all age group would be able to get the vaccine administered.\n“I ask all the citizens to get their name registered for vaccination because as soon as the vaccination is available for their age group, they receive it first.”\nThe minister added that so far only 1.7 million out of total 26 million people of over 60 years age have been registered for the vaccination.\nTo a question, he said in the beginning, queue jumping was happened and some people administered the vaccine out of turn but now every person is receiving the vaccine on his or her turn.\n“Even the President and Prime Minister received the vaccine on their turn and I being a Chairman of NCOC and the vaccine procurement committee, have not yet received the dose because my turn has not come yet,” he added.\nBut the areas where the pandemic is more speedily we can do vaccination for their areas.\nTo another query, the minister said “Our health department’s performance during past 12-13 months have been outstanding as their performance is being acknowledged from across the world”.",
  "retrievedAt": "2025-08-11T20:37:28.500Z"
}
