{
  "title": "ICT’s Ramzan Bazaars: Operation against price hike, 15 arrested, Rs 105,000 fine imposed",
  "link": "https://www.app.com.pk/national/icts-ramzan-bazaars-operation-against-price-hike-15-arrested-rs-105000-fine-imposed/",
  "date_published": "2024-03-20T10:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP):The ICT administration has continued crack down against price hike in the Federal Capital with an aim to ensure fair access to daily essentials and maintain order in markets, including Ramzan Bazaars.\nOn the directives of Deputy Commissioner Islamabad Irfan Nawaz Memon, all Assistant Commissioners and Magistrates, are leading these operations against the price hike and profiteer mafia.\nIn line with this initiative, inspections were conducted at 302 different locations including three Ramzan Bazaars which were set up by the district administration by Magistrates to curb the price hikes and arrested eleven accused while fines\nof Rs 94,000 were also imposed to the violators, said the ICT Spokesman, Dr Abdullah Tabassum.\nDuring the drive, five kilograms of polythene bags were also seized by the officials.\nSimilarly, Assistant Commissioners Nilore, Uzair Ali also conducted operations against price hike in the different areas of the federal capital to eliminate price hike and profit eaters.\nHe visited the expressway, Zia Masjid stop and surroundings to check the price lists.\nThe Assistant Commissioner Nilore imposed a fine of Rs 11,000 for non-availability of price lists and selling at higher\nrates while two persons were arrested and transferred to the police station.\nSimultaneously, the Assistant Commissioner Industrial Area Farwa Batool visited Mangal Bazar and arrested two\npersons on the violations of price lists and sent them to police stations.\nDeputy Commissioner Memon emphasized the importance of maintaining stable prices and availability of essential\ngoods at government rates, underscoring the ongoing commitment to address these issues on a daily basis.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:27:06.134Z"
}
