{
  "title": "Ramazan Kitchen’ provides cooked food to over 250 poor families in federal capital",
  "link": "https://www.app.com.pk/national/ramazan-kitchen-provides-cooked-food-to-over-250-poor-families-in-federal-capital/",
  "date_published": "2024-03-20T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP):The Ramazan Open Kitchen of Muslim Hands Pakistan, a non-profit organization,  is fully active in providing hygienic cooked food to over 250 poor and deserving families daily in the surroundings of the federal capital.\nIn the middle and poor population of the city, Muslim Hands Open Kitchen continues to provide nutritional cooked meals to the neediest communities, playing its part in fighting hunger and enhancing food security among communities.\n“We are engaged in helping people with care,” said Muslim Hands Country Director Syed Zia ul Noor, adding, “We are distributing cooked meals on a daily basis at the door steps over 250 poor and needy families through Muslim Hand Ramazan Open Kitchen while donors from United States, Canada, Australia, United Kingdom, Europe and other countries are fully cooperating to help the poor and deserving families for Ramadan open kitchens and ration packages.”\nZia Ul Noor said Muslim Hands also started Ramazan Open Kitchen in other cities of the country to support needy persons for a good cause. This Ramazan, he said Muslim Hands is set to distribute 10,000 cooked meals to the most vulnerable communities in Islamabad, Lahore and Karachi.\nHe said, “This initiative underscores our steadfast commitment to achieving zero hunger and promoting Better Nutrition and Health for all.”\nHe said several other welfare organizations, individuals and businessmen are pitching in to help the citizens and government through various initiatives with the hope that humanity would survive these dreadful times.\nZia ul Noor said, “Muslim Hands will continue to provide food support to such families and to help them have a reliable supply of meals in the absence of employment opportunities.”\n“The needy families are facing their worst times. They are worried about their own sustenance for the next 20 days or so in Ramazan. But we are doing our best to support them for humanity”, he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:27:07.822Z"
}
