{
  "title": "Dr. Khalid Maqbool urges provinces to harmonize food business rules",
  "link": "https://www.app.com.pk/national/dr-khalid-maqbool-urges-provinces-to-harmonize-food-business-rules/",
  "date_published": "2024-03-19T20:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP):Federal Minister for Science and Technology, Dr. Khalid Maqbool Siddiqui has called upon the provincial governments to harmonize rules related to food businesses.\nIn separate letters addressed to each chief ministers of Punjab, Khyber Pakhtunkhwa, Sindh and Balochistan, Dr. Siddiqui highlighted the need for uniformity to ensure food safety and quality nationwide.\nThe minister said the existing disparities in regulations and enforcement mechanisms among provinces and federal agencies have resulted in inconsistencies, inefficiencies and potential gaps in ensuring the safety and quality of food products available to consumers nationwide and for import and export purposes.\nHe emphasized the role of the Pakistan Standards and Quality Control Authority (PSQCA) as the national standards body and advocated for streamlining standards to prevent duplication of efforts between PSQCA and provincial authorities.\nHe said PSQCA is the sole national standards body to establish standards for all food and non-food products, services and processes.\n“After the 18th amendment, provinces started establishing their own standards which are against the international best practices”, the letter said.\nThe minister noted that manufacturers were suffering because of the duplication of these activities by PSQCA and provincial food authorities.\nThe minister said the Council of Common Interest has decided to standardize regulations and designate PSQCA as the primary authority for standards, certification, and labeling.\nHe said the Special Investment Facilitation Council has also decided to ease doing business, duplication should be removed by harmonizing rules and regulation between PSQCA and provincial authorities.\nThis move aims to enhance efficiency, eliminate inconsistencies, and facilitate a conducive environment for businesses in the food sector, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:27:33.343Z"
}
