{
  "title": "Minister for declaring education emergency to enrol out of school children",
  "link": "https://www.app.com.pk/national/minister-for-declaring-education-emergency-to-enrol-out-of-school-children/",
  "date_published": "2024-03-20T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 20 (APP):Federal Minister for Education and Professional Training Dr. Khalid Maqbool Siddiqui on Wednesday underlined the need to declare national education emergency in the country to bring back out-of-school children.\nHe stated this while chairing a meeting held here. Officials of the Ministry of Federal Education briefed the minister about different programs and projects, for advancing education in Pakistan. The participants of the meeting focused on the crucial initiatives to address the pressing issues within the education sector.\nDuring the meeting, the minister expressed deep concern over the alarming number of out-of-school children in the country. In response to this challenge, he said that we will suggest the prime minister and the federal cabinet to declare a national education emergency to enrol the out-of-school children without delay. This declaration aims to bring back these out-of-school children into the education system.\nFurthermore, federal minister Dr Khalid Siddiqui directed the ministry to swiftly formulate a strategy, with the urgency of a wartime effort, to train one million technology and IT-skilled workers.\nThis initiative will be funded by the National Vocational & Technical Training Commission (NAVTTC), with the goal of equipping the workforce with all necessary skills.\nIn addition to addressing the educational needs of children, federal minister unveiled plans for a School Meals Program to be implemented in all Islamabad Government Primary Schools.\nThis initiative will not only ensure proper nutrition for students but also promote their overall health and hygiene. Dr. Khalid emphasized the government’s unwavering commitment to improve access to quality education for all.\nHe stressed the importance of focusing on girls’ education to narrow the gender literacy gap, recognizing it as a crucial step towards achieving national development goals.The minister announced that a National Conference will be organized in collaboration with SIFC.\nThis conference will have aim to address the issue of out-of-school children and combat learning poverty by leveraging the transformative power of technology. The federal minister reiterated the government’s dedication to revolutionize the education sector in Pakistan.\nBy implementing comprehensive strategies and fostering collaboration with key stakeholders, he said, we will create a brighter future for the youth of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:28:41.875Z"
}
