{
  "title": "COMSTECH organizes ground breaking ceremony to establish Halal Authentication Laboratory in Uganda",
  "link": "https://www.app.com.pk/national/comstech-organizes-ground-breaking-ceremony-to-establish-halal-authentication-laboratory-in-uganda/",
  "date_published": "2024-03-20T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP):COMSTECH has organized a ground breaking ceremony for the establishment of Halal Authentication Laboratory at Islamic University in Uganda.\nThe ceremony for the reverse linkage project between Uganda and Pakistan on “Establishing of the Halal Authentication Laboratory”, was held at the Islamic University in Uganda (IUIU).\nCoordinator General, COMSTECH, Prof. Dr. Muhammad Iqbal Choudhary was the chief guest in the ceremony, said a news release.\nThe ceremony was attended by Prof. Ismail Simbwa Gyagenda, Rector, IUIU, H.E. Dr. Issahaq Umar Iddrisu, The Islamic Development Bank (IsDB) Manager, Regional Hub Kampala, Uganda, Dr. Shk Ramadhan Mubajje, Mufti of Uganda, Mr. Sameh Hussein, Lead Technical Cooperation Specialist (IsDB), Prof. Dr. Syed Ghulam Musharraf, and Dr. Shakil Ahmed Technical Leads, ICCBS, University of Karachi, Pakistan.\nThe ceremony agenda included discussions regarding the project, it’s implementation strategy and timeline, training of human resources, along with composition of the project steering committee.\nThe guests visited the site of construction of the laboratory where Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General COMSTECH, laid the foundation stone of the laboratory.\nCOMSTECH has played a pivotal role in developing the project in support of the Islamic Development Bank and International Center for Chemical and Biological Sciences (ICCBS). This is a part of the COMSTECH Africa initiative in science and technology. Under this initiative, COMSTECH has also helped in the launching of a master degree program in ICT in The Gambia, a citrus processing unit in Nigeria, faculty of engineering in Chad and training of eye surgeons from 10 west African countries.\nThe construction of the Halal Authentication Laboratory has begun and is expected to be completed by August, 2024.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:26:38.625Z"
}
