{
  "title": "World Frog Day: 90% decline in yellow-bellied frog due to habitat loss",
  "link": "https://www.app.com.pk/national/world-frog-day-90-decline-in-yellow-bellied-frog-due-to-habitat-loss/",
  "date_published": "2024-03-20T11:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): The population of the commonly found yellow-bellied frog has declined to 90% in the biome due to habitat loss amid unbridled urbanization, use of synthetic elements and non-scientific methods to capture frogs for school and college experimentation.\nVice President, Pakistan Wildlife Foundation (PWF), Safwan Ahmed on the occasion of World Frog Day aimed at increasing awareness on the tailless amphibian conservation told APP that there were some 20 species of frogs existing in the country’s fauna in the groups of 4-5 sprawling from Karachi to the north in Gilgit Baltistan.\nAhmed said there were five to seven species of frogs that alone existed in the Pothohar region of which yellow-bellied frog (Rana tigrina or Hoplobatrachus tigrinus) was commonly found and used for students education on dissection of amphibians.\nHe noted that there was very less interest found among the scientific community in studying the frogs’ behavior or its population, whereas a few were carried out by the University of the Punjab, University of Agriculture Faisalabad, and Quaid-i-Azam University.\nHowever, due to decrease in the number of Rana Tigrina common pigeon were used instead for experimentation at the educational institutions’ level, he added.\nWorld Frog Day is being celebrated globally since 2014 as awareness day to save the different frog species from extinction that are tailless amphibians with its origins reckoning back to 256 million years.\nAround the globe, researchers have identified approximately 6,000 frog species, with 4,800 of them discovered in various regions except Antarctica. Unfortunately, over the past decade, around 170 frog species have vanished due to a combination of human interference and fungal infections, contributing to their declining populations.\nThe factors such as fungal diseases, habitat destruction, pollution, climate change, and pesticide use, had a severe impact on frog populations worldwide. Addressing these issues through conservation efforts and raising awareness about the importance of preserving ecosystems is crucial in reversing these trends and protecting these vulnerable amphibians.",
  "retrievedAt": "2025-08-11T01:26:40.826Z"
}
