{
  "title": "Law Ministry’s clarification removes ambiguity created by President’s ‘tweet’: Solangi",
  "link": "https://www.app.com.pk/national/law-ministrys-clarification-removes-ambiguity-created-by-presidents-tweet-solangi/",
  "date_published": "2023-08-20T14:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi on Sunday said a clarification issued by the Ministry of Law and Justice had removed the ambiguity created by a statement posted by President Dr. Arif Alvi on its personal account on X (formerly known Twitter) regarding signing of two legislations.\n“The President is a head of the state, and his position demands respect. No one should expect that we would speak against the respect of the President,” said the information minister while addressing a news conference here.\nFlanked by Caretaker Minister for Law and Justice Ahmed Irfan Aslam and Principal Information Officer Asim Khichi, the minister said there was no need to politicize the caretaker government’s efforts, that were aimed at removing ambiguity on important matters.\nHe said the President had posted a statement on the X about the two bills, sent by the Parliament, from his personal account on the platform, which might have created some sort of confusion, but did not cause any upheaval.\nHowever, it was imperative to remove confusion on the matter and the Law Ministry had issued a statement in this regard, he added.\nTo a query, Solangi said he did not have any knowledge about the President’s intentions and desires, particularly concerning his continuation in office.\nInstitutions existed in the country for enforcement of laws, and a complete system was in place to ensure provision of rights to citizens and uphold the supremacy of the Constitution and laws, the minister said in response to another question.\nHe stressed that the caretaker government was fully committed to upholding the constitution and would not engage in any actions that violated the laws.\nWith a clear understanding that their mandate is not political in nature, Murtaza said the caretaker government would refrain from engaging in any political discussions.\nSolangi said there were no loopholes in the government system, and the present caretaker set up has been functioning within the framework of the constitution.\nIn case any attempt was made to create confusion on national issues, he said the response would be given which would strictly be adhered to the boundaries defined by the constitution and law.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:14:16.054Z"
}
