{
  "article_id": "2025-09-09_40bf4852d104fa2a20da3636742d9e42",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-fbr-to-reprimand-tax-evaders-facilitate-taxpayers/",
    "retrieved_at": "2025-09-19T16:26:19.789Z"
  },
  "metadata": {
    "title": "PM directs FBR to reprimand tax evaders, facilitate taxpayers",
    "author": null,
    "date_published": "2025-09-09T14:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 290,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 09 (APP): Prime Minister Shehbaz Sharif on Tuesday directed the Federal Board of Revenue to utilise its own workforce and engage private sector to identify tax-evading individuals and companies. The prime minister, chairing a meeting to review reforms in FBR, asked the organisation to provide a business-friendly environment and all possible facilities to taxpayers. Calling the regular taxpayers the backbone of the national economy, he instructed the FBR to swiftly complete the Income Tax and Sales Taxpayers' Directory to honor taxpayers. Honoring taxpayers and reprimanding tax evaders will help expand the tax net, the prime minister said and directed hiring professional services to identify tax evaders and recover revenue. He also called for launching a public awareness campaign on the government's measures against tax evasion. The prime minister also instructed the FBR to select top international auditors for third-party reviews of mis-declaration and under-invoicing in customs clearance, also emphasising a continuous third-party reviews to identify system flaws and further improve it. During the briefing, the prime minister was apprised of the measures being taken to identify tax evaders, complete the Taxpayers' Directory, and actions taken through super auditors to increase revenue. It was informed that work on completing the Taxpayers' Directory to honor income and sales taxpayers was progressing rapidly and a scientific auditing system had been developed for third-party reviews of mis-declaration and under-invoicing in customs clearance. The meeting was informed that super auditors had been appointed to thoroughly review customs clearance and the risk management system to utilise its output to improve the risk management system. The meeting was attended by federal ministers Azam Nazeer Tarar, Ahad Khan Cheema, Attaullah Tarar, Dr. Musadik Masood Malik, Muhammad Aurangzeb, Ali Pervez Malik, and senior officials from relevant institutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}