{
  "article_id": "2025-09-09_dc89a7315dbc8b023dc12de86c4e94e0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ibcc-akueb-organises-3-day-workshop-to-promote-conceptual-education/",
    "retrieved_at": "2025-09-19T16:44:57.488Z"
  },
  "metadata": {
    "title": "IBCC, AKUEB organises 3-day workshop to promote conceptual education",
    "author": null,
    "date_published": "2025-09-09T18:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 206,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 9 (APP):The Inter-Boards Coordination Commission (IBCC) in collaboration with the Aga Khan University Examination Board (AKUEB) organized a three-day \"Model Assessment Framework\" workshop, aiming to further enhance the professional skills of examiners, paper writers and assessors, so as to promote the trend of conceptual education and assessment across Pakistan. The workshop was held at the Federal Board Auditorium, Islamabad. The inaugural ceremony was presided over by Executive Director IBCC Dr. Ghulam Ali Mallah and Chairman Federal Board of Education Prof. Dr. Ikram Ali Malik, while senior trainers and educationists were also present. The workshop was being led by Deputy Director IBCC Sadia Naz, who was supported by experts from the Aga Khan University Examination Board, including Munira Muhammad, Kashif Hussain and Ali Bijani, said a press release on Tuesday. Addressing the inaugural ceremony, Dr. Mallah emphasized that conceptual tests were essential for achieving meaningful learning outcomes, as this method focused on application of knowledge, problem-solving and critical thinking rather than rote memorization. Dr. Ikram Malik also highlighted the important role of assessment in examinations and highlighted the importance of digitalization in modern education. They presented their research findings, which included points for question testing, selection and improvement and emphasized the need for evidence-based reforms.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}