{
  "article_id": "2025-09-09_ac88bd7202f617616e20f10c8d752eec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/heavy-rains-forecast-for-sindh-and-balochistan-pmd-issues-urban-flooding-warning/",
    "retrieved_at": "2025-09-19T16:44:10.972Z"
  },
  "metadata": {
    "title": "Heavy rains forecast for Sindh and Balochistan; PMD issues urban flooding warning",
    "author": null,
    "date_published": "2025-09-09T20:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 367,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 09 (APP):The Pakistan Meteorological Department (PMD) has forecast widespread rain, windstorms and thundershowers in south Balochistan and lower Sindh on Wednesday, with scattered heavy to very heavy falls likely in parts of south Balochistan. According to the PMD, partly cloudy weather with chances of rain, wind and thundershowers is also expected in northeast Punjab, Kashmir, and adjoining hilly areas. Islamabad and most districts of Punjab and Khyber Pakhtunkhwa will remain mainly dry, though isolated rain is likely in Murree, Galliyat, Abbottabad, and Mansehra. The Met Office has warned that torrential rains during tonight and tomorrow may trigger urban flooding, coastal flooding, and waterlogging in low-lying areas of Karachi, Hyderabad, Thatta, Badin, Sajawal, Dadu, Shaheed Benazirabad, Lasbela, Pasni, Ormara, Awaran and Makran coast. The water level in Hub Dam may also rise significantly. More downpours in already flood-affected areas of Punjab and Sindh may worsen the situation, while flash floods are expected in hill torrents of Dera Ghazi Khan, eastern and southern parts of Balochistan, and the Kirthar range. The PMD cautioned that heavy rainfall accompanied by windstorms and lightning could damage weak structures, rooftops, walls of kacha houses, electric poles, billboards, vehicles, and solar panels. The citizens, travelers, and tourists have been advised to avoid unnecessary exposure to vulnerable areas and remain updated about weather alerts. Rain-wind/thundershowers are expected in Karachi, Hyderabad, Sajawal, Thatta, Badin, Jamshoro and Dadu. Heavy rain is also forecast for Lasbela, Makran coast, Khuzdar, Awaran, Kharan, Panjgur and Kech. Hot and dry weather will prevail in most districts of Punjab, with isolated showers likely in Sialkot, Narowal, Gujrat, Jhelum, Rawalpindi, Murree and Galliyat. Khyber Pakhtunkhwa will remain mostly dry, though rain is expected in Abbottabad, Mansehra, and Battagram. Cloudy conditions with showers are expected in Kashmir, while Gilgit-Baltistan will remain mainly dry and partly cloudy. During the past 24 hours, rain-wind/thundershowers with scattered heavy falls lashed parts of Sindh, with Khairpur recording 81mm, Hyderabad up to 73mm, Diplo 69mm, Padidan 59mm, and Karachi up to 33mm. Lahore received 61mm of rain, while Layyah, Narowal, Malam Jabba and Zhob also recorded showers. Nokundi and Dalbandin remained the hottest places in the country with maximum temperatures of 43 C and 42 C respectively.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}