{
  "title": "Journalists call for global action to end Gaza’s humanitarian crisis",
  "link": "https://www.app.com.pk/national/journalists-call-for-global-action-to-end-gazas-humanitarian-crisis/",
  "date_published": "2024-03-28T18:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):Journalists hailing from various sections of media on Thursday expressed deep concern over the humanitarian crisis in Gaza and emphasized a global action to condemn Israel’s atrocities.\nA seminar titled ‘Gaza, a Holistic Perspective’, organized by the Palestine Foundation and the National Digital Journalists Club, attracted over 120 journalists who unequivocally condemned Israel’s actions, recognizing them as genocide against the people of Gaza.\nThe journalists condemned the relentless Israeli aggression that persisted for the past 175 days and highlighted that over 100,000 Palestinians had been martyred or injured, with hundreds of thousands left homeless and forced to endure life under the open sky.\nThey said despite the ceasefire resolution passed by the United Nations Security Council, Israel had persisted in its attacks on the civilian population of Gaza, displaying a blatant disregard for international law and human rights.\nThe resolution raised the alarming martyrdom of more than 130 journalists in Gaza and paid tribute to all them. It also demanded the global community to ensure safety of journalists in the war zone.\nThe journalists expressed admiration for the resilience, courage, and heroism displayed by the people of Gaza in the face of adversity. They called upon the international community to stand united in solidarity with Gaza and take immediate action to end the ongoing humanitarian crisis.\nParticipating journalists included anchorperson Harmeet Singh, Secretary General Palestine Foundation Dr Sabir Abu Maryam, Ex-President National Press Club Shakeel Qarar, Senior Journalist Mazhar Barlas, Journalist and Researcher Razi Tahir, Bureau Chief Bol News Ali Sher, Senior Journalist Ali Raza Alvi, Senior Journalist Dr Sadia Kamal, Senior Journalist and Bureau Chief Public News Aamir Saeed Abbasi.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:37:18.904Z"
}
