{
  "title": "High Commissioner of Malaysia hosts Iftar dinner reception",
  "link": "https://www.app.com.pk/national/high-commissioner-of-malaysia-hosts-iftar-dinner-reception/",
  "date_published": "2024-03-28T18:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP): The High Commissioner of Malaysia to Pakistan, Ambassador Mohammad Azhar Mazlan, hosted an “Iftar Dinner Reception for Pakistan’s former participants of the Malaysia Technical Cooperation Programme (MTCP)”.\nThe reception was graced by distinguished guests, including officials from Pakistan’s key ministries, the Malaysian High Commission, and Pakistan’s former participants of the MTCP, said a news release.\nThe purpose of the reception was to promote continuous engagements to foster a long-lasting and strong bond of friendship between officials of both countries.\nDuring the reception, Ambassador Azhar welcomed the guests and shared the salient features of the program.\nHe said that the event aimed to establish closer relations and strengthen networking between the High Commission of Malaysia in Islamabad and Pakistan’s former MTCP participants. “Malaysia attaches great importance to its bilateral relations with Pakistan,” the ambassador emphasized.\nHe added that the longstanding bilateral relations and close cooperation between the two brotherly countries have covered various areas including trade, investment, education, tourism, culture, defense, and technical assistance in human capital development.\nHe said the MTCP was officially launched on 7 September 1980, at the Second Commonwealth Heads of Government Meeting to signify Malaysia’s commitment to South-South Cooperation, particularly technical cooperation among developing countries, with its main objective being sustainable economic and social development.\nThe MTCP is a flagship program of the Malaysian government aimed at providing technical assistance and capacity-building to developing countries. It emphasizes human resources development mainly through training, short-term courses in public and private Malaysian training institutions, and long-term courses in Malaysian public universities.\nAnnually, Malaysia’s flagship MTCP offers more than 60 technical training and capacity-building programs in vast areas of development in collaboration with leading local training institutions and international development partners.\nSince its inception, the MTCP has benefited thousands of participants from various countries, including Pakistan, by offering training and knowledge-sharing opportunities in various fields.\nThe High Commissioner concluded his remarks by mentioning that Malaysia aims to encourage more future participation from Pakistani officials in the MTCP, as it would not only be beneficial for bilateral relations but would also assist in the career development of the participants.\nHe reaffirmed Malaysia’s commitment to further enhancing cooperation with Pakistan through programs like MTCP.\nMs. Maryam Mushtaq, Assistant Director of Economic Diplomacy and International Cooperation, Ministry of Foreign Affairs, who is also a former MTCP participant, expressed her sincere gratitude to the Malaysian government for efficiently managing the MTCP.\nShe stated that the MTCP not only provided a chance to further enhance her professional skills but also provided an opportunity to truly immerse in a cultural experience. She added that the MTCP has provided participants from an array of professional backgrounds to further polish their skills.\nShe hoped that the MTCP would be continued as it benefited thousands of participants from various countries, including Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:37:18.908Z"
}
