{
  "title": "Jazz Cash, SECP sign MoU",
  "link": "https://www.app.com.pk/national/jazz-cash-secp-sign-mou/",
  "date_published": "2024-03-28T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):The Securities and Exchange Commission of Pakistan (SECP) has signed a Memorandum of Understanding (MoU) with JazzCash, the country’s largest fintech operator.\nThis MoU fortifies JazzCash’s role as SECP’s knowledge partner said a news release. The partnership underscores a concerted effort to bolster digitalization and promote financial literacy.\nThe MoU delineates a comprehensive framework for leveraging JazzCash’s expertise to fortify Pakistan’s fintech ecosystem. Focusing on technical, educational, and regulatory enablers, the partnership aims to empower individuals and businesses through knowledge-building initiatives.\nSpeaking at the signing ceremony, SECP Chairman Akif Saeed highlighted the crucial role of financial literacy in unlocking the country’s potential, emphasizing the importance of empowering the entire ecosystem, including customers, MSMEs, and investors.\nJazz Cash and SECP will collaborate on multifaceted campaigns to raise awareness on critical issues such as customer protection, data security, and fraudulent activities, leveraging digital and customer service platforms.\nAamir Ibrahim, CEO of Jazz, said, “The MOU between JazzCash and SECP heralds a strategic partnership aimed at transforming the financial sector through digital innovation. Central to our alliance is the pursuit of technological advancements to improve consumer lending, accessibility, and efficiency. Additionally, we’re venturing into new areas like asset fractionalisation, insurance, and investments to democratise financial services for everyone.”\nConcerted efforts will be directed towards digitalising financial services, with a special emphasis on Micro, Small and Medium Enterprises (MSMEs). Through joint initiatives, such as mentorship programs and business development trainings, JazzCash and SECP aim to empower businesses and entrepreneurs, fostering innovation and growth in the sector.\nAdditionally, extensive research and analysis will be conducted to discern market trends, investor behaviour, and levels of financial literacy. By leveraging data analytics capabilities, JazzCash will provide valuable insights to SECP.The MoU marks a significant milestone in Pakistan’s journey towards a digitally empowered and financially inclusive society.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:37:23.414Z"
}
