{
  "article_id": "2025-01-27_9d7d26bad3a9a65503fdf041f4d6ff2b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/113-nyc-members-to-swear-in-on-tuesday/",
    "retrieved_at": "2025-08-27T12:04:47.142Z"
  },
  "metadata": {
    "title": "113 NYC members to swear in on Tuesday",
    "author": null,
    "date_published": "2025-01-27T13:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 385,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 27 (APP):The 3rd batch of the newly formed National Youth Council (NYC) had their maiden huddle on Monday to discuss their role and responsibilities to achieve national development and prosperity. Their first meeting was presided over by Dr. Ali Malik, Deputy Secretary of the Prime Minister's Youth Program (PMYP) who congratulated the new members of the third batch of the Prime Minister's NYC. As many as 113 members were selected for the NYC which will take its oath on Tuesday at the Convention Center. The members were also briefed on the occasion about their code of conduct by the Dr. Ali Malik. He shared that over 10,000 applications were received for the council, with candidates selected through interviews conducted by a panel of professionals and leaders. The selection process ensured representation for women, transgender individuals, and persons with disabilities. Dr. Malik announced that the 113 members representing 41 cities across Pakistan would take their oath in a ceremony on Tuesday. Highlighting the importance of the council, he stated, \"With 170 million youth in Pakistan, the NYC provides a platform for young people to contribute to policymaking.\" He also mentioned the upcoming launch of the Prime Minister Youth Digital Hub under the PMYP. During the event, Sushil Ram, Technical Advisor at the Commonwealth Secretariat, presented an overview of the Commonwealth, a voluntary association of 56 nations with a population of 2.5 billion. He emphasized the role of youth in advancing development, democracy, and peace, as outlined in Article XIII of the Commonwealth Charter. He also discussed the Commonwealth Youth Program's focus areas, including evidence-based youth policies, skill development, economic empowerment, and youth participation. Sushil highlighted the pivotal role of NYC members and added that you are the voices and aspirations of the young people. \"You are the custodian of collective interests of 220 million youth who represent the future of Pakistan\". Rabia Masood Pasha Gillani, Programme Officer at the United Nations Population Fund (UNFPA), shared insights into the organization's work on reproductive health and youth development in Pakistan. She provided a demographic overview of adolescents and youth, highlighting the importance of health awareness initiatives under Adolescents & Youth programme. At the event, registration cards and bags were distributed to NYC's third batch members, marking the beginning of their journey as representatives of Pakistan's youth.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}