{
  "article_id": "2025-01-27_3d45e40e3234476c70fdd8fceef3e11b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-ambassador-of-morocco-discuss-bilateral-ties/",
    "retrieved_at": "2025-08-27T12:03:33.085Z"
  },
  "metadata": {
    "title": "PM, ambassador of Morocco discuss bilateral ties",
    "author": null,
    "date_published": "2025-01-27T16:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 221,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 27 (APP): Ambassador of Morocco Mohamed Karmoune paid a courtesy call on Prime Minister Muhammad Shehbaz Sharif at the Prime Minister House on Monday and discussed matters of bilateral interest. During the meeting, the Prime Minister expressed Pakistan's deep appreciation to the King of Morocco, His Majesty King Muhammad VI and the government of Morocco for the support extended in rescuing stranded Pakistanis who survived the recent boat capsizing off the coast of Dakhla. He thanked the local Moroccan authorities for extending their full cooperation to the Pakistani officials involved in repatriation of the survivors as well as the remains of those deceased. While recalling the excellent historic and brotherly ties between Pakistan and Morocco, the Prime Minister said there was a need to strengthen trade and investment cooperation between the two countries. He recalled the great affection and goodwill between the peoples of the two countries and emphasized upon fostering more people-to-people contacts. The ambassador of Morocco reaffirmed his country's commitment to further strengthen cooperation with Pakistan across all areas of shared interest. He assured the Prime Minister that he would continue to work closely with Pakistani side to explore new avenues of mutually beneficial collaboration. The two sides are working closely to convene meetings of the institutional consultative mechanisms, including Bilateral Political Consultations at an early date.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}