{
  "article_id": "2025-01-27_a844625fa171b4ff7b89fc781918857d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/farah-naz-highlights-govts-commitment-to-education-innovation/",
    "retrieved_at": "2025-08-27T12:03:54.827Z"
  },
  "metadata": {
    "title": "Farah Naz highlights Govt’s commitment to education, innovation",
    "author": null,
    "date_published": "2025-01-27T16:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 646,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 27 (APP):Farah Naz Akbar, Parliamentary Secretary for the Ministry of Federal Education and Professional Training, reiterated that education remains the foremost priority of Prime Minister Shehbaz Sharif's government. During a speech at a ceremony organized by the Islamabad Chamber of Commerce and Industry (ICCI) to mark International Day of Education 2025, Akbar emphasized the government's dedication to securing a brighter future for the youth and enhancing the country's economic well-being through comprehensive educational reforms. Speaking at the event, titled \"AI and Education: Preserving Human Agency in a World of Automation,\" Farah Naz Akbar underscored the significance of equipping students with modern technological tools such as IT and Artificial Intelligence (AI). She highlighted that these tools are essential in preparing Pakistan's youth for future leadership roles, both in the country and globally. In her address, Akbar shared that under Prime Minister Shehbaz Sharif's vision, the Ministry of Education has initiated numerous reforms to improve educational standards across the nation. She highlighted the significant progress made in public schools, with 342 public sector schools in Islamabad receiving modern facilities, ensuring equal access to education for both urban and rural students. \"There is no distinction between urban and rural schools in Islamabad. All are being equipped with the same high-quality facilities,\" she stated, emphasizing the government's commitment to equal opportunities for all students. She also praised the efforts of the ICCI in organizing the event and stressed the importance of public-private partnerships to achieve educational milestones and build a better future for Pakistan's youth. Mohyuddin Ahmed Wani, the Federal Secretary of the Ministry of Education and Professional Training, provided a comprehensive presentation on the ministry's achievements. Wani shared several initiatives launched by the government, including the PM School Free Meal Programme, Wash Stations, Eye Screening Facilities, and Mother and Children Health Centres. He also highlighted the development of IT and digital training institutions, AI Robotics Labs, smart classrooms, mind sports rooms, and the PM's Free Pink Bus Initiative-all aimed at modernizing education and promoting holistic student development. Dr. Rizwan Riaz, Pro-Rector for Research, Innovation, and Commercialization at NUST, reinforced the need for a positive outlook, urging Pakistan's youth to capitalize on the nation's natural resources and the potential of technology. He stressed that hard work, combined with the country's talented youth, could overcome challenges and unlock immense national progress. Major General Najmul Hassan (Retd.), Chairman of Nobel STEM Schools, also addressed the gathering, highlighting the alarming statistics of illiteracy in the country. He shared that six crore people are illiterate, and 2 crore children between the ages of 5 to 15 are out of school, underscoring the urgent need to equip the next generation with the necessary skills to succeed in an increasingly technology-driven world. Nasir Mansoor Qureshi, President of the Islamabad Chamber of Commerce and Industry, emphasized the crucial role of collaboration between industry and academia. He stated, \"It is imperative to bridge the gap between industry, trade, and academia to ensure the promotion of industry and trade through practical, applicable research.\" Qureshi, along with his team including Senior Vice President Abdul Rehman Siddiqui, Vice President Nasir Mehmood Chaudhry, and the executive board members, has been tirelessly working to foster an environment conducive to business and educational growth. Nasir Mehmood Chaudhry, Vice President of ICCI, also commended the Ministry of Education's initiatives but drew attention to several educational institutions that require immediate attention. He encouraged the Ministry to continue prioritizing infrastructure and quality improvements across the education sector. Earlier in the event, Adnan Mukhtar, Convener of the HEC Standing Committee, welcomed the guests and praised ICCI's leadership under President Nasir Mansoor Qureshi for its dedication to strengthening industry-academia linkages and promoting educational advancement. Those present also included Senior Vice President Abdul Rehman Siddiqui, Executive Members Fatima Azeem, Shumaila Siddqiui, Irfan Chaudhry, Waseem Chaudhry, Malik Mohsin Khalid, Zulqurnain Abbasi, Advisor to ICCI President Naeem Siddqui and other.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}