{
  "article_id": "2025-01-27_d481ddaf6ee9b2c7d86d0b961e60b598",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/26th-constitutional-amendment-passed-to-ensure-supremacy-of-constitution-strengthen-of-democracy-muqam/",
    "retrieved_at": "2025-08-27T12:04:46.574Z"
  },
  "metadata": {
    "title": "26th constitutional amendment passed to ensure supremacy of constitution, strengthen of democracy: Muqam",
    "author": null,
    "date_published": "2025-01-27T13:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 455,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "SWAT, Jan 27 (APP):Federal Minister for States and Frontier Regions, Gilgit Balistan and Kashmir Affairs, Engr Amir Muqam here Monday said that the judicial reforms introduced through 26th constitutional amendments were aimed to ensure supremacy of law and constitution besides strengthening democracy in the country. Addressing the Swat Bar Association here, Engr Amir Muqam said that the 26th constitutional amendment has been passed by the political parties with consensus aimed at providing relief to the masses. He said that increasing the number of judges in the supreme court would help clear the rising cases backlog. Engr Amir Muqam said that great responsibilities rest on the bench and bars to provide speedy justice to the litigants. He said that the people of Malakanad had rendered great sacrifices for the country and held their sacrifices in fight against terrorism in high esteem. The Federal Minister said that he had raised voice on every forum for rights of people of Malakand and took credit for exempting Malakand division from taxes keeping in view of their long sufferings due to terrorism and floods in the past. He said progress and prosperity of the nation was linked with peace and the Govt would make no compromise on peace and rights of masses. Engr Amir Muqam criticized the PTI leadership over unilaterally ending talks with govt committee, adding Govt started negotiations with PTI with open heart and sincerity that was unfortunately not reciprocated well by the PTI leadership. Later talking to reporters, Engr Amir Muqam clarified that there was no difference among political parties of the ruling alliance and 'we all are united to take the ship of democracy forward.' He said the Govt would complete its five years term and address people's problems. He said KP would have achieved record development today had PTI Govt not stopped PMLN Govt projects. He supported the stance of providing uninterrupted electricity to the consumers with zero line losses and 100 percent recovery. To another question, Engr Amir Muqam said that the Kurram problem needs an inclusive approach by all stakeholders, and great responsibilities rest on the KP Govt to bring durable peace there. He said the entire nation was standing shoulder to shoulder with its valiant security forces to wipe out of terrorism. He said that 'we would continue support to the relevant security organizations till restoration of durable peace to the Kurram tribal district.' Engr Amir Muqam said that provinces have no mandate to talk directly with any country as only the Federal Govt has the authority to hold negotiations with a foreign state on any issue. The Federal Minister said that he was well aware of the problems of the lawyers community and assured to take their issues with relevant authorities.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}