{
  "title": "Laborers’ role key to development of country: Sadiq Sanjrani",
  "link": "https://www.app.com.pk/national/laborers-role-key-to-development-of-country-sadiq-sanjrani/",
  "date_published": "2021-04-30T15:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Chairman Senate Muhammad Sadiq Sanjrani, has said that the economic development and prosperity of the country is not possible without the tireless efforts of our laborers.\n“I believe that with the cooperation and support of all stakeholders we can achieve a better quality of life for our workers and labor class”, the workers of Chicago sacrificed their lives in the struggle against oppression, exploitation, and injustice”, he underlined in his special message on the occasion of International Labour Day.\nOn this day we also pay tribute to Pakistani workers and laborers who have made their valuable contribution to further strengthen the nation. “Every effort will be made to preserve the rights of our labors and workers”, he stressed.\nThe Chairman indicated that the government is keen to improve the living standards of the labor class and is taking further steps; through Legislation and better policy-making to improve the plight of the labourers.\nTo commemorate the International Workers’ Day, Deputy Chairman Senate, Mirza Muhammad Afridi, in his special message emphasized that the International Labor Day is an occasion of great pride for the nation.\nWe appreciate the services of those hardworking men and women who tirelessly work for the development of their homeland. Our labor class is an indispensable pillar of the nation, he added.\nFurthermore, Deputy Chairman senate said that the government is committed towards the well-being of the Labor class and their families. A plethora of steps are being taken, encompassing better legislation; related to laborers.\n“International Labor Day is celebrated every year in the memory of the tireless work of our labor class. This day allows us to acknowledge the efforts of our labors made for our country,”Mirza Muhammad Afridi underscored.\nThis year, due to the coronavirus pandemic, international labor day is of more significance.\nAround the world, Millions have lost their jobs and have been affected due to the calamity, greater attention needs to be paid to the welfare of these laborers than ever before, he emphasized.",
  "retrievedAt": "2025-08-11T20:40:43.363Z"
}
