{
  "title": "CPEC to continue to take pre-eminence in Pak development strategy: PM",
  "link": "https://www.app.com.pk/national/cpec-to-continue-to-take-pre-eminence-in-pak-development-strategy-pm/",
  "date_published": "2021-04-30T16:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP0: Prime Minister Imran Khan on Friday said that China Pakistan Economic Corridor (CPEC) was a testimony of time-tested and deep-rooted Pak-China friendship and will continue to take pre-eminence in the country’s development strategy.\nHe expressed satisfaction on the pace of ongoing projects and reiterated the resolve to complete the CPEC at all cost.\nThe Prime Minister was chairing a high level meeting to review progress on CPEC, the flagship project of Belt and Road Initiative.\nForeign Minister Shah Mehmood Qureshi, Minister for Energy Hammad Azhar, Minister for Finance Shaukat Fayyaz Tareen, Minister for Industries Makhdoom Khusro Bakhtiyar, Minister for Planning Asad Umar, Adviser to Prime Minister Abdul Razzaq Dawood, National Security Advisor Dr. Moeed Yousuf, Chief of Army Staff General Qamar Javed Bajwa, Chairman Board of Investment Atif Bukhari, Chairman CPEC Authority Lt General (R) Asim Saleem Bajwa and other high ranking officials attended the meeting, a press release issued by the PM Office here said.\nThe Prime Minister particularly emphasized that focus of industrialization should be export oriented and import substitution and our policies should be framed accordingly.\nHe also directed to prepare the country’s youth to take up new jobs being created by incoming Industry and high quality agricultural farms.\nThe Prime Minister was briefed about the progress of ongoing projects, in various sectors, under the umbrella of CPEC.\nThe meeting was informed that the present government not only completed the ongoing projects started by the previous government, but was able to complete large number of significant projects in just two and a half years.\nRegarding the infrastructure development projects, the meeting was informed that regardless of who started any project most of the projects have been completed by the current government.\nSpecial Economic Zones including Rashakai, Dhabeji, Allama Iqbal Industrial City and Gawadar Industrial Zones were attracting foreign and local investors.\nIt was also told that Chinese were expanding cooperation in agriculture and livestock sectors.",
  "retrievedAt": "2025-08-11T20:40:43.282Z"
}
