{
  "title": "Govt committed to improve working, living conditions of workers: PM",
  "link": "https://www.app.com.pk/national/govt-committed-to-improve-working-living-conditions-of-workers-pm-2/",
  "date_published": "2021-04-30T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Prime Minister Imran Khan has stated that the present government is committed to improve working and living conditions of the workers through better work environment, provision of housing and education facilities, and extending health cover to them and their families.\n“The government also aims to develop automated, integrated systems for workers’ welfare institutions to ensure transparency and curtail delays in providing relief to the workers,” he said in a message on the occasion of International Labour Day observed every year on May 1.\nThe prime minister said 1st May reminded them of the sacrifices, bravery and commitment of the workers, who laid down their lives for upholding their fundamental rights and for fair working environment.\n“The day symbolizes the dignity of labour and at the same time, it also provides us an opportunity to acknowledge invaluable contributions of our labour, both inland and abroad, towards nation building,” he added.\nThe prime minister said, “Our religion lays special emphasis upon the principles of social justice and respect for rights of workers. There are numerous Ahadiths highlighting rights of the workers, provision of adequate wages and ensuring fair treatment to the working class.”\nKeeping in view the requirements of labour market, he said, the present government had also embarked upon programmes of vocational training and skills development to enable workers to get their due share in job markets within and outside the country.\nThe prime minister said the government was fully aware of the challenges COVID-19 situation had been posing for the lives of workers, particularly the daily wagers.\n“Our policy of striking a balance between the lives and the livelihoods is aimed at enabling the work force to have sufficient earning for their families during the pandemic,” he added.\nThe prime minister said the government’s “Mazdoor ka Ehsaas” programme was especially designed to cater to the needs of low-income laborers.\n“We own our labour and we are fully cognizant of our responsibilities towards them. We are committed to ensure that benefits of economic progress translate into prosperity of all sections of the population, including the workers,” he added.\n“May Allah help us to truly put in our best efforts for the prosperity of our workers and our country,” the prime minister concluded.",
  "retrievedAt": "2025-08-11T20:40:40.813Z"
}
