{
  "title": "OPHRD Ministry launches survey report on socio-health conditions of informal sector’s workers",
  "link": "https://www.app.com.pk/national/ophrd-ministry-launches-survey-report-on-socio-health-conditions-of-informal-sectors-workers/",
  "date_published": "2021-04-30T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Ministry of Overseas Pakistanis and Human Resource Development (OPHRD) on Friday launched a survey report to highlight socio-health conditions of the informal sector’s workers, residing in the twin cities of Rawalpindi and Islamabad.\nThe survey-cum-research, conducted by OPHRD Ministry Deputy Director at Directorate of Workers Education Rai Muhammad Akbar, was released in connection with the Labour Day (May 1) falling on Saturday.\nThe labour from the informal sector was regarded as ‘very vulnerable group’ of workers in the report, a copy of which is available with APP.\nIt said the informal sector’s workers, unlike the one from formal sector, did not get basic facilities such as old age pension or health coverage along with other benefits like residence in labour colony or workers school for their children.\nMoreover, the report said, they were not united under any umbrella of union or association as in case of the formal one, who were protected by the different government organizations for his/her entitled facilities like pension, health care and education for their families.\nAccording to the report, which examined socio-health conditions of the two cities’ labourers, around 50 percent workers in the twin cities of Rawalpindi and Islamabad did not enjoy good health. They were having one or the other issue regarding their health and had to visit any health facility often, it added.\nThe document stated that around 41 percent workers had no access to fruit and remaining 34 percent ate some times, while 25 percent claimed that they ate fruit of some kind daily.\n“Portable water is one of the major issues of mostly workers as 87 percent workers use site water or the water available at work place which is usually non-filtered,” it noted.\nThe report said it was pertinent to know that 46 percent workers had food once or twice a day, while 54 per cent took their meal three times a day, which was usually prevalent in the society.\nThe study found ‘use of cigarette’ among those workers ‘very common’, which caused diseases of different kinds.\n“Sixty percent [such] workers were addicted to smoking and in such way they consume a considerable budget of their income,” it added.\nThe report maintained that counseling to the workers regarding hazards of smoking might reduce the percentage of smokers.\n“As majority of the workers are migrants, mainly from Khyber Pakhtunkhwa and Southern Punjab, so they face the residential problems,” it observed.\nAccording to the study, 51 percent were using the rental facility for accommodation purposes, and four percent workers just went to parks or roadside for sleeping purposes.\n“As many as 15 percent workers use the newly introduced facility of Panagah [Shelter Homes], while 13 percent share with their relatives,” it added.\nIt regarded the Panahgah as ‘a very good initiative of the present government.\nThe study said the economic condition of the workers was also not good as what did they earn. “It is usually insufficient to meet their requirements.”\n“For this very reason, 60 percent of the surveyed workers are under debt and they are in the vicious circle of getting loan and repaying it and then getting again loan to meet both ends,” it asserted.\nAnother important factor emerged from this study was that none of the workers who were interviewed, got no training regarding occupational safety and health nor had awareness of safety tools.",
  "retrievedAt": "2025-08-11T20:40:43.373Z"
}
