{
  "title": "Hungary to provide $84m credit line, $50m for tied aid program for Pakistan",
  "link": "https://www.app.com.pk/national/hungary-to-provide-84m-credit-line-50m-for-tied-aid-program-for-pakistan/",
  "date_published": "2021-04-30T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP):As Pakistan and Hungary Friday desired to develop economic partnership, the latter agreed to establish a credit line of $84 million for business-to-business cooperation and provide another $50 million for tied aid program.\n“We have established a credit line at Hungarian EXIM bank to the extent of $84 million which is exclusively to serve the enhancement of business to business cooperation between Pakistani and Hungarian companies… We are ready to provide $50 million for a tied aid credit program to be launched in Pakistan in fields of agriculture, water, industry and food processing,” Minister of Foreign Affairs and Trade of Hungary Péter Szijjártó said in a joint press stakeout with Foreign Minister Shah Mahmood Qureshi here.\nForeign Minister Péter Szijjártó arrived here on maiden official visit on the invitation of his Pakistani counterpart. Besides one-on-one meeting, both the foreign ministers also held delegation level talks in addition to attending a business conference to discuss ways of enhancing bilateral economic cooperation.\n“This rolls the ball for economic partnership we want to build,” Foreign Minister Qureshi said apprising the media of the decisions reached between the two sides.\nQureshi said Péter Szijjártó was accompanied by representatives from 17 top Hungarian companies which interacted with Pakistani companies in a matchmaking B2B event held under the Economic Diplomacy Initiative.\nKey Takeaways from the  #EconomicDiplomacy event: to extend credit line of USD 84 million to strengthen B2B sectors to provide USD 50 million for developing Agri-Food sector in possibility of establishing  air linkages. 5 MoUs signed in various sectors. pic.twitter.com/EXVUVY5PKF\n— Spokesperson  MoFA (@ForeignOfficePk) April 30, 2021\nBoth the sides also signed a number of MoUs in fields of diary production, cyber security and others, Qureshi added.\nThe foreign minister told media that Hungary had also expressed interest in starting direct flights between Pakistan to enhance people to people contact and promote business activity.\nForeign Minister Qureshi thanked for the Hungarian support to help Pakistan get GSP Plus status in European Union which doubled the Pakistan’s export to Europe.\nHe said both the sides also exchanged views on FATF as how the forum was used and how ought to be used. Both the sides agreed that the FATF should not be used as political tool rather only for checking money laundering and terror financing.\nThe two countries agreed to hold their next round of political consultation in Budapest.\nWill work closely to strengthen ties through cooperation at all int’l forums & in business across agricultural/food, environment including waste management, water resource & education.  appreciates Stipendium Hungaricum Scholarship Program, offering 200 scholarships to students https://t.co/CJKbuH4Yfv\n— Shah Mahmood Qureshi (@SMQureshiPTI) April 30, 2021\nQureshi said it was after 15 years that Hungarian foreign minister was visiting Pakistan.\nPéter Szijjártó told media that by visiting Pakistan after hiatus of 15 years, he had broken the unpleasant situation.\nHe said the Hungarian government had understood the security and economic significance of the region.\nReiterating his country’s commitment against terrorism and extremist ideologies, he said both the phenomenon were the root causes massive illegal migration to Europe.\nAccompanied by FM ⁦@SMQureshiPTI⁩ , Hungarian Minister of Foreign Affairs & Trade, Mr. Peter Szijjarto planted a Hungarian Willow sapling in Foreign Office Lawns. Its planting symbolizes renewed strength of  bilateral ties. #HungarianFMinPak pic.twitter.com/kjCInA1GIW\nReferring to the Afghan situation, he said if the two ideologies were not stopped there, those could also pose threats to Europe. Therefore, he said the European Union should support Pakistan in its anti-terror efforts particularly after the pullout of NATO troops from Afghanistan.\nHe said Afghanistan should not be allowed to become a safe haven for terrorism and extremist ideologies after NATO pullout.\nHe appreciated the role played by Pakistan for Doha peace agreement between Taliban and US.\nHe said in order to extend its physical presence in Pakistan, Hungary has established its consular representation in Karachi.\nis offering  students 200 scholarships for higher education under the framework of Stipendium Hungaricum Scholarship for 2020-2022 to study in Hungarian universities.  FM welcomed interest of  students to study in Hungary. #HungarianFMinPakistan pic.twitter.com/my9bGYxOe9\nMoreover, he said both the sides also signed an MoU under which Hungary would provide scholarships to 200 Pakistani students. The MoU was signed by Federal Education Minister Shafqat Mahmood and Péter Szijjártó.",
  "retrievedAt": "2025-08-11T20:40:46.891Z"
}
