{
  "title": "Physical Punishment violates children’s dignity: Experts",
  "link": "https://www.app.com.pk/national/physical-punishment-violates-childrens-dignity-experts/",
  "date_published": "2021-04-30T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Renowned child rights activists and civil society representatives on Friday highlighting physical and mental implications of corporal punishment at a conference said the practice violates dignity of children.\nThey were addressing to the participants of a session organized by the Society for the Protection of the Rights of the Child (SPARC) to observe International Day to End Corporal Punishment of Children, being marked globally.\nKhalil Ahmed Dogar, Program Manager SPARC said Pakistan was trying to eradicate corporal punishment in educational institutions.\nOn 23rd February 2021, the National Assembly of Pakistan passed ‘ICT Prohibition of Corporal Punishment Bill’ effectively banning all forms of corporal in formal/informal educational institution and child care institutions comprising of rehabilitation centers, foster centers or any other institution, he added.\n“It is a significant milestone in the realization of Pakistan’s commitment to United Nations Convention on the Rights of Child. The key development includes cancellation of Section 89 of the Pakistan Penal Code (PPC) that had allowed for physical punishment in case carried out by teacher or guardian in best interest of the child, ” he noted.\nHe said the bill had defined the definition of minor and specified the age of child to less than 18.\n“The bill defines corporal punishment various forms of abuse and usage of physical force as corporal punishment which will all be punishable under the law,” he added.\nHe highlighted that under the new bill, the children could put forward direct complaint before a court or a magistrate in case of abuse.\n“In case where administrative process does not satisfy the aggrieved party, then, unlike previous laws, there is clear and defined legal course available to the children to attain justice from the courts,” he observed.\nSenior Child Right Activist Syed Safdar Raza said that scientific evidence links corporal punishment to mental health problems and behaviors associated with violent tendencies in adulthood.\n“Physical punishment in childhood leads to the depression and anxiety in adulthood risking heightened vulnerability to radicalization,” he maintained.",
  "retrievedAt": "2025-08-11T20:40:40.823Z"
}
