{
  "title": "Air India crash probe focuses on actions of plane’s captain: report - World - DAWN.COM",
  "author": null,
  "content": "A cockpit recording of dialogue between the two pilots of the Air India flight that crashed last month indicates the captain cut the flow of fuel to the plane’s engines, the Wall Street Journal reported on Wednesday.\n\nThe newspaper cited people familiar with US officials’ early assessment of evidence uncovered in the investigation into the June 12 crash of a Boeing Dreamliner in Ahmedabad, India, that killed 260 people.\n\nA preliminary report into the crash released by India’s Aircraft Accident Investigation Bureau (AAIB) on Saturday said one pilot was then heard on the cockpit voice recorder asking the other why he cut off the fuel and “the other pilot responded that he did not do so”.\n\nInvestigators did not identify which remarks were made by Captain Sumeet Sabharwal and which by First Officer Clive Kunder, who had total flying experience of 15,638 hours and 3,403 hours, respectively.\n\nKunder, who was flying the plane, asked Sabharwal why he moved the fuel switches to the “cutoff” position seconds after lifting off the runway, the Wall Street Journal reported.\n\nThe Journal did not say if there was any evidence that Sabharwal did move the switches, beyond the verbal exchange it cited. But it quoted US pilots who have read the Indian authorities’ report as saying that Kunder, the pilot actively flying, likely would have had his hands full pulling back on the Dreamliner’s controls at that stage of the flight.\n\nIndia’s AAIB, Directorate General of Civil Aviation, Ministry of Civil Aviation, Air India and two unions representing Indian pilots did not immediately respond to Reuters’ requests for comment on the Wall Street Journal report. Boeing declined to comment.\n\nThe AAIB’s preliminary report said the fuel switches had switched from run to cutoff a second apart just after takeoff, but it did not say how they were flipped.\n\nAlmost immediately after the plane lifted off the ground, closed-circuit TV footage showed a backup energy source called a ram air turbine had deployed, indicating a loss of power from the engines.\n\nThe London-bound plane began to lose thrust, and after reaching a height of 650 feet, the jet started to sink.\n\nThe fuel switches for both engines were turned back to run, and the airplane automatically tried restarting the engines, the report said.\n\nBut the plane was too low and too slow to be able to recover, aviation safety expert John Nance told Reuters.\n\nThe plane clipped some trees and a chimney before crashing in a fireball into a building on a nearby medical college campus, the report said, killing 19 people on the ground and 241 of the 242 on board the 787.\n\nIn an internal memo on Monday, Air India CEO Campbell Wilson said the preliminary report found no mechanical or maintenance faults and that all required maintenance had been carried out.\n\nThe AAIB’s preliminary report had no safety recommendations for Boeing or engine manufacturer GE.\n\nAfter the report was released, the US Federal Aviation Administration and Boeing privately issued notifications that the fuel switch locks on Boeing planes are safe, a document seen by Reuters showed and four sources with knowledge of the matter said.\n\nThe circumstantial evidence increasingly indicates that a crew member flipped the engine fuel switches, Nance said, given there was “no other rational explanation” that was consistent with the information released to date.\n\nNonetheless, investigators “still have to dig into all the factors” and rule out other possible contributing factors, which would take time, he said.\n\nMost air crashes are caused by multiple factors, and under international rules, a final report is expected within a year of an accident.\n\nThe Air India crash has rekindled debate over adding flight deck cameras, known as cockpit image recorders, on airliners.\n\nNance said investigators likely would have benefited greatly from having video footage of the cockpit during the Air India flight.\n\nAir India has faced additional scrutiny on other fronts after the crash.\n\nThe European Union Aviation Safety Agency said this month it plans to investigate its budget airline, Air India Express, after Reuters reported the carrier did not follow a directive to change engine parts of an Airbus A320 in a timely manner and falsified records to show compliance.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/17165640e99029e.jpg",
  "retrievedAt": "2025-08-17T20:36:59.277Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924802/air-india-crash-probe-focuses-on-actions-of-planes-captain-report",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T12:23:22.000Z"
}
