{
  "title": "2 killed, 3 injured as building’s roof caves in Karachi’s Lyari: officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two people died and three others were injured when the roof of a six-storey building collapsed in the Khada Market area of Karachi’s Lyari, rescue and police officials said.\n\nThe incident occurred almost two weeks after a five-storey building collapsed earlier this month in Lyari’s Lea Market, killing 27 people. This incident raised serious concerns about building safety, prompting authorities to evacuate other dilapidated buildings in the city.\n\nRegarding the incident today, Rescue 1122 spokesperson Hassaanul Haseeb Khan told Dawn.com, “Two women have died in the accident, while more than two others are reported to have been injured.”\n\nProviding details of the incident, he said: “The building was dilapidated. Some labourers were working on the roof of the sixth floor when it collapsed.”\n\nHe added that the rescue operation has been completed.\n\nDeputy Inspector General of Police (DIGP) South, Asad Raza, confirmed that the two people were killed and three others were injured in the incident.\n\n“The top floor of the six-storey building — named Ghani Mansion, situated next to Bilal Masjid Peshawari Hotel — collapsed on the lower fifth floor,” he told Dawn.com.\n\nHe said three injured people and the bodies of the deceased, including two women, were taken to Ruth Pfau Civil Hospital.\n\n“The deceased women were sisters. Their daughters are among the injured and are being given medical assistance,” he said.\n\nAfter the collapse of the Lyari building earlier this month, Sindh Local Government minister Saeed Ghani had addressed an emergency press conference, revealing that 588 buildings across the city had been declared hazardous — 456 of them located in District South, including 107 in Lyari alone.\n\nThe Sindh government had suspended the director-general of the Sindh Building Control Authority (SBCA) for approving the building’s construction. The provincial government has formed a committee on hazardous and dilapidated buildings to ensure transparency.\n\nA day earlier, it was revealed that as many as 44 dilapidated buildings, including 10 declared protected heritage in the city’s South district, have been vacated for demolition in the aftermath of the Lyari building tragedy.\n\nA meeting, chaired by Commissioner Syed Hasan Naqvi, was told that so far, 44 dilapidated buildings had been vacated in the South and East districts for the safety of the residents.\n\nIn total, out of 588 buildings declared dilapidated by the SBCA, 68 buildings have been declared “highly dilapidated” by the city administration and will be vacated and demolished in the first phase.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/06192529ddd3262.jpg?r=192557",
  "retrievedAt": "2025-08-17T20:37:08.282Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924794/2-killed-3-injured-as-buildings-roof-caves-in-karachis-lyari-officials",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T11:18:34.000Z"
}
