{
  "title": "What are the fuel switches at the centre of the Air India crash probe? - World - DAWN.COM",
  "author": null,
  "content": "A cockpit recording of dialogue between the two pilots of the Air India flight that crashed last month indicates the captain cut the flow of fuel to the Boeing 787 jet’s engines, the Wall Street Journal has reported.\n\nBelow are a few facts about engine fuel switches, their functions in the aircraft and their movements on the Air India flight.\n\nThey are switches that regulate fuel flow into a plane’s engines. They are used by pilots to start or shut down engines on the ground or to manually shut down or restart engines if an engine failure occurs during a flight.\n\nAviation experts say a pilot would not be able to accidentally move the fuel switches that feed the engines. But if moved, the effect would be immediate, cutting off engine power.\n\nThere are independent power systems and wiring for the fuel cutoff switches and the fuel valves controlled by those switches, according to United States aviation safety expert John Cox.\n\nThe two fuel control switches on a 787, in Air India’s case, equipped with two GE Aerospace engines, are located below the thrust levers.\n\nThe switches are spring-loaded to remain in position. To change one from run to cutoff, a pilot has to first pull the switch up and then move it from run to cutoff or vice versa.\n\nThere are two modes: ‘CUTOFF’ and ‘RUN’.\n\nAccording to the flight recorder, a few seconds after takeoff, switches for both engines transitioned to ‘CUTOFF’ from ‘RUN’ one after another with a time gap of one second. As a result, the engines began to lose power.\n\nOne pilot was heard on the cockpit voice recorder asking the other why he cut off the fuel.\n\n“The other pilot responded that he did not do so,” the report said.\n\nThe report did not identify which remarks were made by the flight’s captain and which by the first officer.\n\nBut the Wall Street Journal reported on Wednesday that the first officer asked the captain why he moved the fuel switches to ‘CUTOFF’ seconds after lifting off the runway, citing people familiar with US officials’ early assessment of evidence uncovered in the investigation.\n\nSeconds later, the switches flipped back to ‘RUN’, according to the preliminary report. Both fuel control switches were found in the ‘RUN’ position at the crash site, it said.\n\nWhen fuel control switches are moved from ‘CUTOFF’ to ‘RUN’ while the aircraft is in flight, each engine’s control system automatically manages a relight and thrust recovery sequence of ignition and fuel introduction, the report said.\n\n“No sane pilot would ever turn those switches off in flight,” especially as the plane is just starting to climb, US aviation safety expert John Nance said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/17170622fe375ce.png",
  "retrievedAt": "2025-08-17T20:37:00.663Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924799/what-are-the-fuel-switches-at-the-centre-of-the-air-india-crash-probe",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T12:35:54.000Z"
}
