{
  "title": "July 31 deadline set to wind up Utility Stores - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A meeting of the committee formed by the prime minister to oversee the closure and privatisation of the Utility Stores Corporation (USC) was held at the Finance Division on Wednesday.\n\nChaired by Finance Minister Muhammad Aurangzeb, the meeting was attended by Special Assistant to the Prime Minister on Industries and Production Haroon Akhtar Khan, secretaries of the Establishment, Finance, and Industries & Production divisions, the USC managing director, and senior officials of the Finance Division.\n\nThe committee, mandated to ensure a smooth and transparent closure process, is tasked with devising a fair Voluntary Separation Scheme (VSS) for USC employees and recommending a structured timeline for privatisation.\n\nTo facilitate a comprehensive review, Mr Aurangzeb constituted a sub-committee led by the Establishment Secretary, with representation from the Finance and Industries & Production divisions. The sub-committee will examine the legal and operational framework, scale, and structure of the proposed VSS, and submit its report by the end of the week.\n\nSub-body formed to finalise VSS and assess privatisation options\n\nThe findings will allow the main committee to consolidate its recommendations for submission to the prime minister in accordance with its terms of reference.\n\nThe committee reviewed progress on its assigned tasks and held detailed discussions on the path forward. It reaffirmed the government’s decision to wind up all USC operations by July 31.\n\nDeliberations focused on formulating a financially viable and equitable VSS, with particular attention to the projected size, fiscal impact, and the legal and operational complexities involved.\n\nIt was also recommended that the Privatisation Commission be consulted to assess the most effective model for divestment, including the feasibility of full privatisation or selective asset sales associated with USC operations.\n\nEstablished in 1971, USC is a state-owned enterprise tasked with supplying essential commodities at subsidised rates, primarily targeting low-income households. It currently operates over 4,000 retail outlets nationwide.\n\nAccording to the Finance Ministry’s Federal State-Owned Enterprises (SOE) Performance Overview for the first half of FY25, USC posted a loss of Rs4.1bn over six months, with cumulative losses rising to Rs15.5bn — highlighting persistent structural and operational challenges.\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/3013335483d6cfb.jpg?r=133555",
  "retrievedAt": "2025-08-17T20:37:53.724Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924725/july-31-deadline-set-to-wind-up-utility-stores",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T03:10:26.000Z"
}
