{
  "title": "Rise in social media user base has deepened political divisions: study - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A comprehensive study of Islamabad Policy Research Institute (IPRI) unveiled on Wednesday highlighted how digital platforms have significantly deepened political divisions across the country.\n\nAccording to the study titled ‘Social Media Impact on Political Polarisation in Pakistan’, between 2017 and 2025, Pakistan’s social media user base more than doubled from 31 million to 66.9 million, drastically expanding the digital space for political engagement.\n\nHowever, this growth has also enabled echo chambers, misinformation and heightened partisanship and the use of social media by political actors to broaden their support base and malign their opponents, leading to political polarisation.\n\nThe study was launched by Information Minister Ataullah Tarar, along with senior academics, researchers and policy stakeholders.\n\nPresident IPRI retired Lt Gen Majid Ehsan opened the ceremony by outlining the growing influence of social media on public opinion and political behaviour in Pakistan.\n\nHe emphasised that while social media did not inherently create division, it often amplified existing ideological rifts.\n\nThe study, backed by rigorous qualitative and quantitative analysis, warned of the increasingly polarised political environment shaped by the rise of platforms like Facebook, X (formerly Twitter), Instagram, WhatsApp, TikTok and YouTube.\n\nThe study suggested that the government should strengthen libel laws to prosecute cases of online defamation in the court of law.\n\nThe research presents several policy-oriented recommendations: integrating digital literacy into school curricula, creating robust fact-checking mechanisms, implementing stronger libel laws and fostering accountability among social media companies.\n\nIt also advocates for design changes to encourage dialogue over conflict, and the development of an indigenous social media platform to reduce dependence on foreign networks.\n\nSpeakers at the event stressed that the responsibility for responsible digital engagement lies not only with governments and platforms but also with politicians, religious leaders, and individual users. They agreed that digital tools can either be used to unify or divide, depending on how they are wielded.\n\nIn essence, the study offers a roadmap to navigate the complexities of Pakistan’s digital public sphere, calling for urgent action to ensure that social media serves as a space for informed dialogue rather than divisive rhetoric.\n\nThe study has stressed to empower the users and promote responsible online behaviour.\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/678322651868d.jpg",
  "retrievedAt": "2025-08-17T20:38:24.225Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924635/rise-in-social-media-user-base-has-deepened-political-divisions-study",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T02:22:16.000Z"
}
