{
  "title": "PAF to showcase advanced JF-17 Thunder jets at UK airshow - Pakistan - DAWN.COM",
  "author": null,
  "content": "A contingent of the Pakistan Air Force (PAF) featuring the advanced JF-17 Thunder Block-III fighter jets arrived in the United Kingdom to take part in the Royal International Air Tattoo (RIAT) 2025, a statement from the military’s media wing said on Thursday.\n\nRIAT, which will run from July 18 to 20, is one of the world’s largest military airshows, has been running for over 50 years and powers the Royal Air Force Charitable Trust, according to its website.\n\nA PAF contingent comprising “state-of-the-art JF-17 Thunder Block-III fighter aircraft and the C-130 Hercules transport aircraft, has landed at the Royal Air Force Base Fairford, United Kingdom, to participate in the prestigious” RIAT 2025, a statement from the Inter-Services Public Relations (ISPR) said.\n\n“PAF’s participation in RIAT, one of the world’s largest military airshows, underscores Pakistan Air Force’s commitment to showcasing its professional excellence, operational capability and the indigenous strength of its aviation industry,” the ISPR highlighted.\n\nAdding to the operational significance of this international deployment, Pakistan Air Force’s JF-17 Thunder Block-III fighters executed successful Air-to-Air Refuelling operations en route to the UK with the support of a PAF IL-78 aerial refuelling tanker.\n\n“The intricate refuelling operation demonstrated PAF’s long-range operational capabilities and the proficiency of its air and ground crew in conducting extended operations beyond national borders.\n\n“JF-17 Block-III is an EASA Radar and Long Range BVR equipped 4.5 generation multi-role fighter aircraft which is capable of undertaking a wide variety of combat missions, bolstering airpower application in the face of contemporary challenges, thereby strengthening national security,” the statement added.\n\nIn May, when Pakistan downed 5 Indian jets as retaliation for late-night strikes during the Pakistan-India conflict, the PAF formally acknowledged a month later that it was the Kamra-based 15 Squadron that led the charge in shooting down the jets.\n\nThe event is now considered one of the largest air-to-air engagements in South Asia in more than half a century.\n\n“There is a palpable sense of enthusiasm across the United Kingdom following the recent Pakistan-India conflict, as aviation enthusiasts and defence observers were eagerly looking forward to the arrival of the Pakistan Air Force’s JF-17 Thunder Block-III,” the statement said.\n\n“The aircraft’s combat-proven capabilities and operational excellence have garnered significant global attention, making its appearance at RIAT a highly anticipated highlight in the aerospace and defence community.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1711453083c9d20.jpg",
  "retrievedAt": "2025-08-17T20:37:30.857Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924755/paf-to-showcase-advanced-jf-17-thunder-jets-at-uk-airshow",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T05:43:16.000Z"
}
