{
  "title": "JUI-F loses two, PPP one seat in KP Assembly - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR / ISLAMABAD: The Election Commission of Pakistan’s (ECP) recent order and subsequent notifications related to reserved seats have led to partial changes in the party positions in the Khyber Pakhtunkhwa Asse­mbly, with the JUI-F losing two and PPP losing one seat overall.\n\nWhile PTI-backed lawmakers maintain their tally of 92 members, opposition parties have experienced slight variations in their seat allocations. The development has not impacted the overall seat count for the opposition, but individual party positions have shifted.\n\nThe ECP reduced one reserved seat each for JUI-F and PPP, while one has been allocated to PML-N.\n\nWith the latest notifications, JUI-F and PML-N each hold 17 seats in the 125-member house, while PPP holds 10 seats. The Awami National Party (ANP) and PTI-Parliamentarians (PTI-P) each have three seats.\n\nECP fears delay in oath-taking may affect Senate polls; asks PHC to designate ‘oath commissioner’\n\nThe fate of one of the 26 seats reserved for women is to be decided by a draw between ANP and PTI-P, while the reserved seat for non-Muslims will be determined through a similar process between JUI-F and PML-N.\n\nThe opposition now holds a total of 52 lawmakers in the KP Assembly. This shift follows the June 27 judgement by the Supreme Court’s constitutional bench, which declared that PTI was not entitled to reserved seats in either the National or provincial assemblies.\n\nBefore that verdict, the opposition parties had 27 MPAs and were unable to requisition an assembly session. However, the opposition will now be able to requisition a session once their newly elected MPAs take the oath of office.\n\nBoth JUI-F and PML-N now hold seven general seats, nine seats rese­rved for women and one rese­rved seat for non-Muslims each.\n\nThe PPP holds four general seats, five reserved seats for women and one reserved seat for non-Muslims. ANP and PTI-P each hold two general seats and one reserved seat for women.\n\nBefore the ECP’s July 15 order, which granted PML-N entitlement to reserved seats for women and non-Muslims based on seven general seats, the commission had calculated these seats based on six general seats. In the 2024 general elections, JUI-F was entitled to 10 seats reserved for women and two reserved seats for non-Muslims based on the seven general seats it won.\n\nPML-N had previously been allocated eight reserved seats for women and one reserved seat for non-Muslims, while PPP had six reserved seats for women and one for non-Muslims. ANP and PTI-P each held one MPA-elect each on seats reserved for women.\n\nECP approaches PHC\n\nThe Peshawar High Court (PHC) last week annulled the original distribution of reserved seats in the KP Assembly and ordered the ECP to redistribute these seats within 10 days.\n\nA two-member bench, comprising Justice Syed Arshad Ali and Justice Dr Khurshid Iqbal, announced the reserved judgement on the petition of the PML-N against the distribution of reserved seats. In its verdict, the court declared both the ECP’s announcements regarding the allocation of reserved seats for women and minorities null and void.\n\nThe court had previously deemed the ECP’s Feb 22 deadline for independent candidates to join political parties unconstitutional.\n\nIn a desperate move, the ECP approached the PHC on Wednesday, requesting that it appoint a person to administer the oath to the notified MPAs-elect on reserved seats.\n\nIn a letter to the court’s registrar, the Election Commission pointed out that the Senate elections in KP were days away and the electoral college was still incomplete.\n\nAccording to the letter seen by Dawn, the ECP requested that the PHC chief justice, under Article 255(2) of the Constitution, may appoint a person to administer the oath to the elected members of the KP Assembly on the reserved seats before the Senate polling date (July 21).\n\nThe commission had previously written letters to the speaker of the KP Assembly, the governor and the chief minister, urging them to ensure the oath-taking of the members-elect; however, no progress has been made so far.\n\nWednesday’s letter emphasised that the conduct of the Senate election and the administration of oath to the returned candidates are constitutional imperatives and also a fundamental right of the members-elect to represent their constituencies.\n\nThe commission said that it is entrusted with the responsibility to organise and conduct elections under Articles 219(b) and 224(3) of the Constitution, and Section 107 of the Elections Act, 2017. Furthermore, Article 218(3) of the Constitution mandates the ECP to ensure that elections are conducted honestly, justly, fairly, and in accordance with the law.\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/16072806ddd2a55.jpg?r=072815",
  "retrievedAt": "2025-08-17T20:39:32.007Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924686/jui-f-loses-two-ppp-one-seat-in-kp-assembly",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T02:21:07.000Z"
}
