{
  "title": "Two cops martyred in Dera; Lakki gas pipeline blown up - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: Two police constables were martyred when unk­n­own assailants opened fire near Shahi Gate in the Kulachi tehsil of Dera Ismail Khan district on Wednesday.\n\nThe deceased were identified as Head Const­able Ghulam Muhammad, from Panyala village in Dera Ismail Khan, and Constable Shehzad, from Aba Khel village in Lakki Marwat district.\n\nAccording to a police spokesperson, the constables were travelling on a motorcycle when the incident took place. One of the constables, who had a disability, was being transported to a hospital by his colleague when they were attacked. The assailants fired upon them as they reached Shahi Gate, resulting in the death of both officers on the spot.\n\nPolice and other law enforcement agencies cordoned off the area after the attack and initiated a search operation. As the attackers attempted to flee, police returned fire, killing one assailant and injuring two others. A Kalashnikov rifle and ammunition were recovered from the deceased militant.\n\nThe Counter-Terrorism Department (CTD) and district police continue to conduct an extensive search operation in the area. The funeral prayer for the martyred constables was held with full official honours at Ijaz Shaheed Police Lines in Dera Ismail Khan.\n\nThe ceremony was attended by Commissioner Dera Zafarul Islam Khattak, Regional Police Officer Syed Ashfaq Anwar, District Police Officer Sajjad Ahmad Sahibzada, several civil and military officials A police contingent presented a guard of honour, and participants laid floral wreaths on the coffins and offered prayers for the elevation of the martyrs’ ranks.\n\nThe bodies of the constables were sent to their native villages, where they were laid to rest with full official honours. Initial investigations suggest that the attack was an act of terrorism.\n\nGas pipeline blown up\n\nMeanwhile, a gas pipeline was blown up with explosives for the fourth time in a month in the Torwah area of Lakki Marwat district late Tuesday night.\n\nAccording to police, an IED that had been planted along the pipeline detonated with a loud explosion that was heard in the surrounding areas. The blast caused significant damage to the pipeline, which supplies gas to Punjab.\n\nThe explosion occurred within the jurisdiction of Saddar police station. Police and bomb disposal units later arrived at the site to investigate the incident. The blast halted the supply of gas from the Bettani oil and gas field to several regions.\n\nIt was the fourth attack on the gas infrastructure in the district within a month. Police have noted increased terrorist activity in the area and have increased security measures around the gas facilities.\n\nGhulam Mursalin Marwat in Lakki Marwat also contributed to this report\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/04074655b60de04.jpg?r=075007",
  "retrievedAt": "2025-08-17T20:39:32.938Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924685/two-cops-martyred-in-dera-lakki-gas-pipeline-blown-up",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T02:21:07.000Z"
}
