{
  "title": "10 heritage buildings among 44 vacated for demolition in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: As many as 44 dilapidated buildings, including 10 declared protected heritage in the city’s South district, have been vacated for demolition in the aftermath of the Lyari building tragedy.\n\nA meeting, chaired by Commissioner Syed Hasan Naqvi, was told that so far, 44 dilapidated buildings had been vacated in the South and East districts for the safety of the residents.\n\nIn total, out of 588 buildings declared dilapidated by the Sindh Building Control Authority (SBCA), 68 buildings have been declared highly dilapidated by the city administration. In the first phase, these 68 buildings will be vacated and demolished.\n\nSouth Deputy Commissioner (DC) Javed Nabi Khoso informed the meeting that the 41 dilapidated buildings included 10 colonial-era structures which had been declared protected heritage. He said that the SBCA had declared these buildings as highly dilapidated in the district.\n\nHowever, the DC said that the historical buildings would be demolished in consultation with the advisory and technical committee.\n\nEast DC Abrar Jaffer said that the SBCA had declared nine buildings in district East as highly dilapidated, out of which three buildings had been vacated.\n\nHe informed the meeting that the owner of a building located in Gulistan-i-Jauhar had started the demolition work himself.\n\nIt was decided in the meeting that the approval of the commissioner or the SBCA director general would be required to start the process of demolishing the dilapidated building.\n\nThe commissioner has appointed four officers, including DC South, for the survey of dilapidated buildings.\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6878281ddf204.jpg",
  "retrievedAt": "2025-08-17T20:38:29.731Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924655/10-heritage-buildings-among-44-vacated-for-demolition-in-karachi",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T02:21:59.000Z"
}
