{
  "title": "Curfew in Hasina’s hometown after four die in clashes - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Violence erupted on Wednesday at a rally of Bangladesh’s youth-led National Citizen Party in the southern town of Gopalganj, with four people killed and more injured according to local media.\n\nThe Daily Star reported that the government has put Gopalganj under curfew from 8pm today until 6pm tomorrow, after the killings during day-long clashes between alleged cadres of the Awami League and its banned student wing Bangladesh Chhatra League (BCL), and law enforcers.\n\nDeadly student-led protests forced long-time Prime Minister Sheikh Hasina to flee to India in August last year, and since then there have been delays over promised reforms, growing protests and political division.\n\nNobel peace laureate Muhammad Yunus, who took over as interim head, said in a post on X that members of the NCP, police and media were attacked during a peaceful rally on Wednesday, with cars vandalised and individuals assaulted.\n\nViolence broke out after members of Awami League attempted to break up a rally by National Citizen Party\n\n“Preventing young citizens from peacefully holding a rally to commemorate the one-year anniversary of their revolutionary movement is a shameful violation of their fundamental rights,” he said, blaming Hasina’s political party the Awami League and its student group for Wednesday’s violence.\n\nBBC News Bangla reported that four people were killed while the local daily Prothom Alo said nine were injured.\n\nThe Awami League said on Facebook that one of its members had been killed by army gunfire.\n\nThe clashes were triggered after members of Hasina’s Awami League attempted to foil a rally by the National Citizen Party (NCP), made up of many students who spearheaded the uprising last year.\n\nFollowing a pre-announced rally in Gopalganj’s Poura Park area, NCP leaders and activists came under attack this afternoon. The attack was allegedly carried out by members of the banned BCL.\n\nArmy personnel and police rushed to the spot to bring law and order in the area.\n\nFour platoons of Bangladesh Border Guard (BGB) were deployed in the area around 5pm. Section 144 was then imposed as well in Gopalganj.\n\nEarlier around 1:45pm, 200–300 locals armed with sticks had attacked the NCP rally venue, vandalising sound equipment, chairs, and assaulting party activists ahead of the event.\n\nThree people were killed after police got involved, and 17 others sustained various injuries, including bullet wounds, said Monoj Baral, a nurse at the Gopalganj District Hospital.\n\n“One of the deceased was identified as Ramjan Sikdar. Families took away two other bodies,” Baral said. Gopalganj authorities imposed a curfew in the district following the violence.\n\nBangladesh’s interim leader Muhammad Yunus termed the attempt to foil the NCP rally “a shameful violation of their fundamental rights”. “This heinous act… will not go unpunished,” a statement from his office said.\n\nThe NCP was scheduled to hold the rally as part of their countrywide “July March” programme to commemorate the uprising anniversary, local media reported.\n\nGopalganj is a stronghold of the Awami League, as Sheikh Mujibur Rahman — the founding president of Bangladesh — hailed from this district, and Hasina also contested elections from this constituency.\n\nHasnat Abdullah, an NCP coordinator, said those rallying took refuge at a police station after being attacked.\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68782eb2eb1f1.jpg",
  "retrievedAt": "2025-08-17T20:38:50.656Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924682/curfew-in-hasinas-hometown-after-four-die-in-clashes",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T02:21:52.000Z"
}
