{
  "title": "British PM Starmer suspends several Labour rebels - World - DAWN.COM",
  "author": null,
  "content": "LONDON: British Prime Minister Keir Starmer purged his ruling Labour party of four lawmakers on Wednesday as tries to reassert his authority following a rebellion over welfare reforms.\n\nStarmer was forced to backtrack on plans to slash disability and sickness benefits earlier this month after dozens of his own MPs threatened to vote against the proposals.\n\nBrian Leishman, Neil Duncan-Jordan, Rachael Maskell, and Chris Hinchliff were suspended, weeks after voting against a watered-down version of the controversial reforms on July 1.\n\nAnother three Labour MPs were stripped on Wednesday of their roles as trade envoys over the rebellion, which spotlighted the tensions between the party’s left and its more centrist leader.\n\nStarmer had made his authority-sapping climbdown to avoid a humiliating defeat in parliament, even though he should be able to force through any legislation he wants to as he still holds a massive majority of about 160 seats.\n\nScottish MP Leis­hman, who will now sit as an independent, said in a statement he believed that “it is not my duty as an MP to make people poorer”.\n\nDuncan-Jordan, the representative for Poole in southern England, said he understood that voting against the government “could come at a cost, but I couldn’t support making disabled people poorer”.\n\nStarmer has endured a difficult first year in power and has made several damaging U-turns in recent weeks. Political scientist Steven Fielding said the mini purge was a bid by Starmer to reinforce party discipline.\n\n“He wants to send a signal to all the others that rebelled over the welfare bill and have rebelled on other things that, ‘Okay, you’ve got away with this one, but if you keep going, this is going to be your fate’,” Fielding said.\n\nBut the University of Nottingham politics professor added it was a risky strategy considering the large numbers of lawmakers who had opposed the welfare reforms.\n\n“I think he’s going about it in the wrong way. He needs to talk (to) and understand why the MPs are doing this,” Fielding said. Spokespeople for Labour declined to comment.\n\nNew party?\n\nStarmer’s popularity has plummeted since he won a landslide general election result in July last year, ending 14 consecutive years of Conservative rule. Labour now trails Eurosceptic Nigel Farage’s hard-right Reform UK party in many national polls, although the next election is likely four years away.\n\nIn June, the government reversed a policy to scrap a winter heating benefit for millions of pensioners, following widespread criticism and another rebellion from its own MPs. The same month, Starmer — a former chief state prosecutor in England and Wales — announced a national inquiry focused on a UK child sex exploitation scandal after previously resisting calls.\n\nBut some in the party complain of a disconnect between Starmer’s leadership, which is focused on combatting the rise of Reform, and Labour’s traditional centre-left principles. Maskell urged Starmer to engage with his backbenchers, saying she wanted to see “bridges built” and this would “make him a better prime minister”.\n\nBut as Labour loses votes to the right, it is also giving up supporters to the Greens on the left, surveys have shown, highlighting the tricky balancing act Starmer faces.\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/1217324638ab41c.jpg?r=173307",
  "retrievedAt": "2025-08-17T20:38:43.748Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924676/british-pm-starmer-suspends-several-labour-rebels",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T02:21:52.000Z"
}
