{
  "title": "Situationer: ‘Unprecedented melting’ in G-B - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Heatwaves, environmental degradation altering weather patterns\n• Glacial calving intensifying flooding\n• Questions raised over efficacy of early warning systems\n\nUnprecedented heat­­waves, erratic weat­her patterns, and glacial calving have triggered intense floods in Gilgit-Baltistan, leaving a trail of destruction behind that has locals feeling apprehensive about their future amid a climate change crisis.\n\nThe crisis is further exacerbated by faulty early warning systems, which are supposed to disseminate timely alerts amid disasters to minimise human and infrastructure losses.\n\nAccording to authorities, the unusual movements of glaciers and intense heatwaves across the region this year have resulted in massive destruction in downstream areas.\n\nThe region, home to around 8,400 glaciers and over 4,000 glacier lakes, has seen its ice cover deplete at a rapid pace, triggering glacial lake outburst floods and threatening future water shortages.\n\n“Glof events, glacier surges, land erosion from increasing water levels in rivers and streams across the region have badly affected livelihoods, damaged homes, public and private infrastructures, agriculture lands and crops recently,” said GB Disaster Management Authority (GBDMA) DG Zakir Hussain. He said it was obvious that climate change had altered the behaviour of glaciers.\n\nIn Hamorkhay village in Nagar Khas, dozens of households near the Hoper glacier have witnessed a surge in water levels, leading to erosion of swathes of land in this settlement.\n\nAccording to the local administration, six homes situated at the glacier side were damaged, with thousands of kanals of agriculture land, standing crops and cattle farms submerged by water released by the melting glacier.\n\nAkbar Hussain, a local, told Dawn the situation was unimaginable. “The glacier surged speedily this year. The water originating from the glacier flowed towards the village side and started eroding lands, crops, trees and cattle farms, and ultimately threatened homes,” he said.\n\nAccording to GB Environmental Protection Agency (GBEPA) Director Khadim Hussain, heatwaves triggered by climate change have disturbed the normal structure of glaciers across GB.\n\nHe pointed out several factors, including carbon emissions and environmental degradation, which were contributing to these anomalous phenomena. GB is facing environmental challenges such as deforestation, encroachment of green belts, reckless construction and emissions from vehicles. The duration of the dry season has increased and rainfall is becoming scant, he said.\n\nMeanwhile, snowfall is occurring in the months of February, March and May instead of the more suitable winter months, which allows snow enough time to solidify into ice before the summer sets in.\n\nHe said snowfall in these months was not adding to glaciers, rather melting rapidly in May and June, triggering floods.\n\nGlacial calving\n\nWhile the melting of glaciers is releasing heavy deluges in waterways, glacial calving is further exacerbating the intensity of these floods.\n\nThis phenomenon sees chunks of solid ice break away from the glacier and travel downstream. They damage homes and properties along the river and often block waterways, thus increasing the water level. When these ice blocks melts, the built-up water gushes down, causing widespread destruction.\n\nZubair Ahmed, who is the GBDMA Assistant Director in Hunza and Nagar, said the Shisper glacier in Hassanabad had demonstrated unusual movement this year, as pieces of ice were moving with the waters in Hassanabad nullah.\n\nHe said that chunks from the glacier blocked the flow of water, causing a flood in the nullah when the build-up eventually breaks. “We are monitoring the Shisper glacier to avoid any human loss downstream,” he added.\n\nIn other areas of GB, rapidly melting glaciers triggered floods in Supultar nullah, Hamari nullah, Shimshal river, Khunjerab river, Shigar river and Indus river. The rapid melting of ice in a short amount of time results in water shortages in the remaining months. The GBEPA has expressed fears of a major water crisis in the region due to climate change.\n\nFaulty early warning systems\n\nIn view of climatic threats, early warning systems and automatic weather stations worth billions of rupees were installed at glaciers in some parts of GB.\n\nHowever, most of these systems are either non-functional, have been stolen, or lack the capacity to disseminate timely alerts, according to sources.\n\nMr Hussain of the GBEPA claimed that international organisations had installed the equipment without consulting local bodies or adhering to environmental laws and regulations.\n\nThe GBEPA had imposed a fine of Rs5 million on a donor-funded Glof-II project for degrading the aesthetic beauty of the high-altitude Kutwal lake in Haramosh Gilgit by installing advanced weather stations station on green belts near the lake.\n\nThese systems are “actually damaging the environment”, Mr Hussain claimed.\n\nPublished in Dawn, July 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687829e17de0a.jpg",
  "retrievedAt": "2025-08-17T20:37:37.921Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924660/situationer-unprecedented-melting-in-g-b",
  "dateList": "2025-07-17",
  "date_published": "2025-07-17T02:21:20.000Z"
}
