{
  "title": "Govt striving to introduce uniform curriculum to eliminate discrimination in society: PM",
  "link": "https://www.app.com.pk/national/govt-striving-to-introduce-uniform-curriculum-to-eliminate-discrimination-in-society-pm/",
  "date_published": "2020-01-06T08:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP):Prime Minister Imran Khan on Monday said the present government was striving to introduce a uniform curriculum in the country so as to eliminate current education-based discrimination in the society.\nHe said the promotion of human resource and development was a big challenge\nin the presence of three different education systems.\nThe Prime Minister was talking to a delegation of students from Business Administration Department of Virginia University, who were currently on a visit to Pakistan to have first-hand information about the potential of business and tourism in the country.\nDuring the interactive meeting, matters relating to challenges faced by the country, reforms agenda of the present government, positive aspects of Pakistani society, existing potential of country in diverse sectors, economic challenges facing the country and the future strategy, were discussed.\nThe Prime Minister said that Pakistan was bestowed by Allah Almighty with abundant resources, adding, unfortunately development process in country got stagnant due to corruption and neglect of human resource promotion by previous governments.\nHe said that Pakistan was the fastest developing country in South Asia in the decade of 1960s, but the political philosophies of the decades of 1970s and 1980s not only led to blocking of industrial development but also inclusion of money and corruption in the politics.\nThe Prime Minister said that he, by keeping in view the loot and plunder and corruption in the society and the plight of common man, stepped into politics and his party succeeded in defeating the country’s two major political parties after 22 years of political struggle.\nImran Khan said he was fighting against the mafia which had been creating hurdles in the way of country’s progress.\nHighlighting importance of human resource promotion and development, he said the previous governments not only neglected human resource promotion altogether but also did not focus on reforms in education and other sectors.\nThe Prime Minister said that that challenge before him was not only the elimination of corruption but also improving the education system.\nAbout the economy, he said that when Pakistan Tehirk-e-Insaf (PTI) took over the reign of affairs, the country was facing severe economic crisis.\nThe Prime Minister said that owing to the present government’s efforts, the country’s economy had stabilized and the economic indicators showed significant improvement.\nHe said that the country’s economy would witness further improvement and growth due government’s business-friendly policies and various development projects including the construction of five million houses.\nThe Prime Minister said that the present government fully believed in the protection of minorities’ rights and deemed them equal citizens. “Our religion Islam and the teachings of the Father of Nation give us the lesson of protecting minorities’ rights,” he added.\nAbout current regional situation, the Prime Minister said that the Indian government’s policies based on the philosophy of RSS (Rashtriya Swayamsevak Sangh) posed serious threats to regional peace.\nHe said the oppressive policies of the Indian government had endangered the identity of Indians themselves, adding, Modi government’s policies had endangered the identity and existence of 500 million minorities living in India.\nThe Prime Minister also condemned the imposition of curfew in the Indian Occupied Jammu and Kashmir, which had continued for the last over 150 days and said that the Indian government’s brutalities had exposed the Indian democratic claims.\nHe also wished the students a pleasant stay in Pakistan and their objective of having first-hand knowledge about the country.",
  "retrievedAt": "2025-08-11T18:34:38.628Z"
}
