{
  "title": "Seven Private Members’ Bills introduced, four resolutions passed in Senate",
  "link": "https://www.app.com.pk/national/seven-private-members-bills-introduced-four-resolutions-passed-in-senate/",
  "date_published": "2020-01-06T02:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 06 (APP):The Senate on Monday passed four resolutions and referred seven private members’ bills to the relevant committees for their consideration after introduction in the House.\nThe private members’ bills introduced in the House were the Pakistan Engineering Council (Amendment) Bill, 2019; the Unani, Ayurvedic and Homoeopathic Practitioners (Amendment) Bill, 2019; the Islamabad Prevention of Beggary Bill, 2019; the Guardians and Wards (Amendment) Bill, 2019; the Dyslexia Special Measures Bill, 2019; the Rights of Persons Arrested, Detained or under Custodial Investigation Bill, 2019 and the National Highways Safety (Amendment) Bill, 2019.\nThe Chair deferred two bills of JI Senator Siraj ul Haq seeking the Constitutional Amendments in Articles 45 and 213. Another bill – the Pakistan Climate Change (Amendment) Bill, 2019 – was deferred after being opposed by the State Minister for Climate Change Zartaj Gul.\nThe Chair asked the mover of the bill Senator Mian Muhammad Ateeq Shaikh to consult with the minister for consensus on the bill before referring it to the Standing Committee.\nThe Chair deferred the Constitution (Amendment) Bill, 2019 (Amendment of Article 198) after the consent of the mover Senator Javed Abbasi who agreed to move it later.\nOn behalf of Chairman Standing Committee on Cabinet Secretariat, a member of the committee Senator Ashok Kumar presented report of the committee on the Naya Pakistan Housing and Development Authority Bill, 2019.\nA motion sponsored by JI Senator Siraj ul Haq under Rule 126 (7) was deferred following written request of the mover who did not attend the proceedings. This motion was about consideration of the Islamabad Capital Territory Prohibition of Interest on Private Loans Bill, 2019 in the joint sitting as it could not be passed by the National Assembly within 90 days after its transmission to it despite passage by the Senate.\nThe House also passed four resolutions to facilitate the businesses and promote business activities in the country, launch programs for imparting training in various skills to women, take necessary steps for increasing Pakistan’s share of value added exports to the European Union countries and to exempt disabled government employees appointed on disabled persons quota from payment of income tax.\nAnother resolution to withdraw recent 10 percent increase in Toll Tax on Motorways was deferred due to the absence of relevant mover JI Senator Siraj ul Haq.",
  "retrievedAt": "2025-08-11T18:34:47.540Z"
}
