{
  "title": "PM for joint efforts to tackle cancer of drug abuse",
  "link": "https://www.app.com.pk/national/pm-for-joint-efforts-to-tackle-cancer-of-drug-abuse/",
  "date_published": "2020-01-06T08:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 6 (APP):Prime Minister Imran Khan Monday said the cancerous threats of drug and child abuse could not be defeated unless collective efforts were made by all strata of the society, and stressed upon wider and effective mass awareness in this regard.\nHe underlined that the society had not yet been realizing the dangers posed by the two challenges, which could have alarming impacts upon the younger generation of the country.\nThe prime minister was addressing the launching ceremony of ‘Zindagi’ app developed by the Ministry of Narcotics Control to create mass awareness and prevent the drug use in young generation.\nReferring to the drug abuse in educational institutions, he said the vulnerable youth fell victim to the evil due to their immaturity.\nSimilarly, the shameful child abuse was turning out to be an endemic as the victim families did not want to highlight the issues out of social taboos, he added.\nImran Khan noted that the introduction of new technology like use of smart phones was not only helping in the creation of mass awareness, but also worsening the risks posed by the evils.\nHe said the government had decided on emergency basis to tackle the evils with full force and emphasized that the parents, educational institutions and Ulema should play their critical role in the mass awareness against them and their prevention.\nMinister for Interior Brig (retd) Ijaz Ahmad Shah, Minister of State for Narcotics Control Shehryar Afridi, PM’s Special Assistant on Information and Broadcasting Firdous Ashiq Awan, PM’s Special Assistant on Health Dr Zafar Mirza, high officials, foreign representatives and diplomats were present on the occasion.\nThe prime minister, during the ceremony, also formally launched the Zindagi app. He said the launching of the Zindagi app would help realize the parents about the dangers of twin threats emanating from the drug and child abuse, observing that the teachers would have a leading role in that regard as well.\nHe called upon the whole society to play their role in making the collective efforts through intensive awareness and prevention measures.\nImran Khan said he was alarmed with the reports presented by the inspectors general of police Islamabad and Khyber Pakhtunkhwa about the use of ice drug by the students of elite schools.\nThe prime minister said the evils could destroy the future of younger generations as the nascent youth were kept on switching from one drug to other. The powerful mafia had been involved in the business.\nAs part of the awareness drive, he agreed that he would ask the federal education minister to talk to the provincial ministers about the circulation of a booklet in the educational institutions, which had been prepared by the ministry concerned.\nAppreciating the efforts of Ministry of Narcotics Control, the prime minister said the app’s launch would definitely contribute to the efforts made at the national level to efface the threats posed by the issues.\nMinister of State for Narcotics Control Shehryar Afridi said the drug abuse had turned into a cancer, which was affecting the younger generation all over the globe.\nHe informed that the ministry had collected artificial intelligence based data and stressed upon all the stakeholders and the society to join their hands in the efforts being made to eliminate drug abuse among the young generation.\nThe minister said the booklet prepared by the ministry should be included in the educational curriculum from grade eight to intermediate level.\nSecretary Narcotics Control Amjad Javed Saleemi highlighted the benefits of Zindagi app and gave an overview of the functioning of his ministry.\nHe said about 60 million people in the country had been using the smart phones and the app would be an effective tool in the creation of mass awareness. An Urdu version app had also been developed, he added.",
  "retrievedAt": "2025-08-11T18:34:38.579Z"
}
