{
  "title": "Govt not to compromise country’s sovereignty: Qureshi",
  "link": "https://www.app.com.pk/national/govt-not-to-compromise-countrys-sovereignty-qureshi/",
  "date_published": "2020-01-06T02:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 06 (APP):Foreign Minister Shah Mehmood Qureshi on Monday informed the National Assembly that the Pakistan Tehreek-e-Insaf (PTI) government had never compromised the country’s sovereignty nor it would do so in future.\nThe minister, in his policy statement on the ongoing tense Middle East situation, said the present government had a very clear foreign policy direction that the country’s economic development was not possible sans peace in the neighbourhood.\nHighlighting the implications of the killing of a top Iranian commander in the US attack in Iraq, he apprehended that the incident might destabilize the already volatile region, especially Iraq and Syria, further. The situation in the Middle East was very sensitive, fluid and concerning.\n“It will be disastrous and Pakistan will also face the repercussions if a new war starts in the region,” he cautioned and feared that the menace of terrorism could again rear its ugly head in the country.\nHe, however, made it clear that Pakistan would neither allow use of its soil against any other state nor it would become a party to the regional conflict. It could rather play a role for reconciliation, peace and stability in the region, he added.\nQureshi said he had talked to his regional counterparts, including the Iranian foreign minister, and emphasized on exercising utmost restraint to avoid any conflict in the region as a new war would have disastrous impact on all the regional countries.\nHe viewed that any further escalation in the situation would have far reaching affects as it could affect the international economy. It might also negatively impact the peace process in Afghanistan, besides prompting the Houthi rebels in Yemen to intensify their attacks on Saudi Arabia and Hezbollah to target Israel with rocket attacks.\nQureshi said Pakistan backed principles of sovereignty and territorial integrity as enshrined in the United Nations (UN) Charter. The Middle East could not be pushed into another war and the UN Secretary General should play his role in “putting out this fire”.\nPakistan was in the favour that diplomatic channels should be used for de-escalation of tension between the US and Iran, he stressed.\n“We are constantly monitoring and assessing the situation,” he said. A task force had been set up in the Foreign Office for keeping watch on the evolving situation on day-to-day basis.\nThe minister said the Mideast tension had also impacted the Pakistani government’s efforts to unite the member states of the Organization of Islamic Cooperation on the ongoing human right violations in the Indian Occupied Kashmir.\nIndia, he said, might take benefit of situation to destabilize Pakistan and conduct some false-flag operations. India could also use the Mideast tension to divert the world’s attention from the grave human right violations in the occupied Kashmir and ongoing protest demonstrations across the country against the Citizenship Amendment Act and the National Register of Citizens.\nThe foreign minister said hundreds of civilians had been killed along the Line of Control in firing from the Indian side in recent days. He urged the international community, the United Nations, and other world bodies to play their due role in averting any conflict in the region.\nHe said the PTI government had highlighted the Kashmir issue at all the international forums. Prime Minister Imran Khan, in his speech at the United National General Assembly, had effectively raised the voice for the atrocities and human rights violations in the occupied Kashmir.\nHe said Pakistan was convinced that the solution of Afghan issue was possible only through dialogue, not through military means, and the whole world had now acknowledged it.\nHe dispelled an impression that China had reservations on the pace of work on China Pakistan Economic Corridor. The present government was moving fast to implement its second phase, he added.",
  "retrievedAt": "2025-08-11T18:34:44.814Z"
}
