{
  "title": "Govt allocates Rs 62812.146 mln in PSDP 2021-22 for Kashmir Affairs & Gilgit Baltistan Division",
  "link": "https://www.app.com.pk/national/govt-allocates-rs-62812-146-mln-in-psdp-2021-22-for-kashmir-affairs-gilgit-baltistan-division/",
  "date_published": "2021-06-11T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The federal government has allocated an amount of Rs 62812.146 million for completion of 9 on-going schemes in Azad Jammu and Khashmir (AJK) and 11 on-going projects in Gilgit Baltistan under Public Sector Development Programme (PSDP) of financial year 2021-22.\nAccording to PSDP document, an amount of Rs 32039.903 million has been allocated for on-going schemes in AJK while Rs 30772.243 million has been allocated for on-going schemes in Gilgit Baltistan.\nThe government would initiate seven new development projects in various sectors of Gilgit Baltistan with the cost of Rs 7147.75 million in the financial year 2021-22.\nAn amount of Rs 1700 million has been allocated in PSDP 2021-22 for the construction of 30 MW hydro power project at Ghanche Gilgit Balitistan.\nThe construction of Darel and Tangir Expressway along with roads in Khanbury and Buner in GB would also be initiated in the fiscal year 2021-22 with the cost of Rs 700 million.\nThe government has also allocated 500 million in the new financial year for the construction of road from Pissan to Hoper Nagar.\nThe government has also plan to establish Medical and Nursing College at Gilgit with estimated cost of Rs 1000 million in the financial year 2021-22.\nAn allocation of Rs 2050 has been made in the PSDP 2021-22 for Inter-Provincial Connectivity Economic Corridor through GB and AJK. The government has also been earmarked Rs 697.757 million in the PSDP 2021-22 for Inter-Regional Connectivity between Baltistan and Diamer-Astore division through construction of road in the area.\nFund has also been allocated in the PSDP for up-gradation of provincial headquarter hospital based on master plan of Gilgit.",
  "retrievedAt": "2025-08-11T20:50:09.652Z"
}
