{
  "title": "Qatar, Pakistan for joint efforts against drug mafia: Afridi",
  "link": "https://www.app.com.pk/national/qatar-pakistan-for-joint-efforts-against-drug-mafia-afridi/",
  "date_published": "2020-01-22T22:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Minister for Narcotics Control Shehryar Khan Afridi Thursday called on Ambassador of State of Qatar, Saqar bin Mubarak Al Mansouri and discussed matters of mutual interest.\nHe said Qatar and Pakistan would work together to tighten the noose against criminals involved in drug trafficking and all necessary measures would be undertaken to ensure security of future generations from the menace of drugs, said a press release.\nDuring the meeting, it was also agreed that Qatar would host an exhibition to showcase the traditional ornaments.\nShehryar Afridi said Pakistan and Qatar would take bilateral cooperation to the next level.\nHe said Prime Minister Imran Khan held Sheikh Tamim bin Hamad Al Thani, Amir of the State of Qatar, in the highest esteem and the extraordinary chemistry between the two leaders suggested the dawn of a new era of cooperation in bilateral relations.\nExpressing gratitude for warm welcome extended to his delegation during his recent visit to Qatar, Minister Afridi said the permission granted to him to visit Central Jail Doha and meet Pakistani inmates reflected the amount of respect Qatar government accorded to Pakistan.\n“The way 54 Pakistani prisoners were released also reflected the bond between Prime Minister Imran Khan and Sheikh Tamim bin Hamad Al Thani, Amir of the State of Qatar.\nPrime Minister Imran Khan was so happy to watch the video of my prison visit and he wanted it to be promoted as it reflected the deep relationship between the two countries,” the minister said.\nHe said Prime Minister Imran Khan wanted to ensure overseas Pakistanis are looked after well abroad.\n“I want that Ministry of Narcotics Control may cooperate with the government of Qatar so as the upcoming Soccer World Cup being held in Year 2022 may be made secure,” he asserted.\nAmbassador of State of Qatar, Saqar bin Mubarak Al Mansouri said state of Qatar would always keep supporting Pakistan in all its endeavours.\nHe said under special instructions from Sheikh Tamim bin Hamad Al Thani, a delegation from Qatar had visited Pakistan and the government is looking to establish two energy projects in Pakistan.",
  "retrievedAt": "2025-08-11T18:40:40.475Z"
}
