{
  "title": "Pakistan rejects US claims about CPEC financing",
  "link": "https://www.app.com.pk/national/pakistan-rejects-us-claims-about-cpec-financing/",
  "date_published": "2020-01-23T04:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Pakistan on Thursday categorically rejected the claims of US diplomat Alice Well that the China Pakistan Economic Corridor (CPEC) was always in the form of loans or non-concessional financing with sovereign guarantees.\nResponding to various queries of media persons at her weekly news briefing, Foreign Office Spokesperson Aisha Farooqui clarified that the total CPEC debt was about $ 4.9 billion, which was not even 10 percent of the country’s total debt.\nShe said the CPEC was a long term project negotiated through a multi-layered process. It had helped Pakistan to address development gaps in energy, infrastructure, industrialization and jobs creation. It should be perceived in terms of enormous economic benefits for the people of Pakistan and social economic development.\nThe government believed it was also beneficial for regional connectivity and prosperity, she added.\nThe spokesperson said Pakistan and China were all weather strategic cooperative partners.\nCPEC was a transformational project for Pakistan and its expeditious completion was the government’s top priority. In that regard, a CPEC authority had been established recently to oversee completion of the projects.\nAisha Farooqui said 12 CPEC related power projects had either been completed or were under construction with the total capacity of 7240 megawatts at an investment of $12.4 billion.  Nine other power projects were at an early stage with the capacity of 6390 megawatt, she added.\nShe pointed out that the power projects contributed over 14 percent of the total energy supplies in Pakistan. The projects had also paid about $250 million dollars in taxes during the construction phase and created over 10,000 jobs.\nShe said all the countries were welcomed to invest in the special economic zones of CPEC.\nResponding to a question, the spokesperson said Pakistan had taken a whole range of steps to meet the requirements of the Financial Action Task Force (FATF). The government remained closely engaged with the FATF members, including the United States.\nAisha Farooqui said Pakistan welcomed US President Donald Trump’s mediation offer on the Kashmir dispute and hoped it would be translated into some actions.\nWhen asked about the induction of S-400 Air Defence System by India, she said Pakistan had repeatedly expressed concerns over the induction of ballistic missile defence system in the region. Such destabilizing systems could undermine regional stability and might lead to an unnecessary arms race.\nShe said Pakistan had proposed discussion on a strategic restraint regime for South Asia, which included the proposal to avoid the induction of destabilizing weapons.\nThe induction of ballistic missile defence system by India, she said, should not lead to any false sense of security and any misadventure since Pakistan had the technological capability to ensure the continued efficacy of its deterrence.\nShe expressed the confidence that extra regional countries would be mindful of the legitimate security concerns of Pakistan.\nTo a question, the spokesperson reiterated support for One China Policy, saying there was only one China and Taiwan was part of it.",
  "retrievedAt": "2025-08-11T18:40:31.013Z"
}
