{
  "title": "Pakistani expats see Saudi Arabia as second home: Envoy",
  "link": "https://www.app.com.pk/national/pakistani-expats-see-saudi-arabia-as-second-home-envoy/",
  "date_published": "2020-01-22T23:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Pakistani expats considered Saudi Arabia to be “their second home” the country’s ambassador to the Kingdom has revealed.\nRaja Ali Ejaz was speaking during a meeting with Tabuk Governor Prince Fahd bin Sultan bin Abdul Aziz, during which they discussed matters of mutual interest.\nConveying his thanks to King Salman and the governor for the honor and respect shown toward the Pakistani community living in the Kingdom and Tabuk region, the envoy said: “Pakistani expatriates consider the Kingdom as their second home,” Arab News reported on Thursday.\nDuring his visit to the region, Ejaz met with members of the Pakistani expat community, assuring them of embassy support and urging them to abide by local laws and regulations.\n“You are the ambassadors of Pakistan in Saudi Arabia and your contributions in the development of Saudi Arabia and Pakistan are valued by both countries,” he said.\nThe ambassador added that long-standing relations between the two countries had “stood the test of time” and were “getting stronger with every passing day.”\nDuring their get-together, Prince Fahd noted Saudi Arabia’s appreciation of the contributions made by Pakistanis toward economic development in the Kingdom and the Tabuk region in particular.\nThe governor also acknowledged the significance of Pakistan’s religious and cultural ties with the Kingdom.\nEarlier, commenting on Saudi-Pakistan relations, Ejaz said that bilateral links between the two countries remained strong.\n“We have more than 2.2 million Pakistanis in the Kingdom. Pakistan’s prime minister has visited Saudi Arabia four times in less than a year and the Saudi crown prince also paid a visit to Pakistan last year which shows the strength of our cordial relations.”\nThe envoy and his accompanying delegation also visited Tabuk regional museum where they toured its various exhibits.",
  "retrievedAt": "2025-08-11T18:40:35.293Z"
}
