{
  "title": "Govt to launch campaign from Jan 25 to highlight Kashmir issue globally: Qureshi",
  "link": "https://www.app.com.pk/national/govt-to-launch-campaign-from-jan-25-to-highlight-kashmir-issue-globally-qureshi/",
  "date_published": "2020-01-23T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Minister for Foreign Affairs Shah Mahmood Qureshi Thursday said the government would launch a comprehensive campaign from January 25 encompassing rallies, seminars and exhibitions here and abroad to highlight the Kashmir dispute globally.\nThe government would run a media campaign in both print and electronic media to highlight the deteriorating human rights situation in the Indian Occupied Jammu and Kashmir (IOJK), he said while addressing a press conference here.\nMinister for Communications Murad Saeed and Special Assistant to the PM on Information and Broadcasting Dr Firdous Ashiq Awan flanked the foreign minister as he talked to the media after his return from Davos where Prime Minister Imran Khan also raised the Kashmir issue with US President Trump and reiterated his call for intervention.\nQureshi said the federal ministers had been assigned different tasks to make the campaign successful by mobilizing the masses on the issue, which was already supported by the whole nation unitedly.\nOn January 27, the Pakistan National Council of Arts would host a cultural show focusing Kashmir, which would follow a photo exhibition at the countrywide art galleries depicting the Kashmir cause, freedom struggle, the miseries of the people including the pellet gun victims and the ordeal of the homeless Kashmiri people.\nThe foreign minister said the comprehensive campaign would also help foil the Indian attempt to dub Pakistan’s stance as exaggerated by showing the on the ground situation to the global community.\nOn January 30, Chairman of the Parliamentary Committee on Kashmir Fakhar Imam would chair a seminar on Kashmir, who would also address a news conference the very next day along with the committee members.\nThe campaign also consists of an event to be held on February 3 at the Convention Center to be attended by youth activists and students followed by the distribution of ration among the Kashmiri refugees the same day.\nOn February 4, President Dr Arif Alvi would host an event at the Aiwan-e-Sadr on Kashmir to be attended by the diplomatic corps, which would also feature the running of documentaries on Kashmir.\nA series of activities had been planned on February 5, also annually observed as Kashmir Solidarity Day, including human chain in Azad Jammu and Kashmir (AJK) and rallies at all the provincial capitals and the chief ministers had been asked to personally lead their respective rallies.\nThe same day, the prime minister would address the members of the Kashmir Legislative Assembly in Muzaffarabad and address a public gathering in Mirpur.\nThe government had designed the publicity material and the slogans to reinforce the voice of the Kashmiri people to the global community, which, he viewed, could not keep mum for long.\nQureshi said Pakistan’s missions would also host similar events to be attended by the expatriates as well as the local figures. Moreover, the missions would also approach the local media to highlight the human rights situation in Kashmir through their media in their own languages.\nHe said the AJK president and prime minister had been asked to write letters to different heads of state urging them to play their role to help end the miseries of Kashmiri people. For activating the parliamentary diplomacy, the speaker of the AJK Legislative Assembly would contact his counterparts abroad for the purpose.\nHe desired that the Kashmir-related events should also be held at the district level.\nWhile giving the historical perspectives of Pakistan’s efforts post August 5, 2019, the foreign minister said the issue was discussed at the United Nations Security Council (UNSC) after 50 years.\nMentioning his letters to and personal interactions with the UN Secretary General and the UNSC President to highlight the deteriorating situation, the foreign minister said the UNMOGIP (United Nations Military Observer Group in India and Pakistan) had also admitted Pakistan’s cooperation in Kashmir, and not by India.\nEven in Davos, he said, the prime minister apprised the US president about the complex situation in the IOJK that could have serious implications if the US or the UN did not make timely intervention.\nTo a question, he said at the time when Pakistan had taken the Kashmir issue at its peak in the global community, the attention of local media was diverted to a sit-in held in Islamabad that had blurred the country’s narrative domestically.",
  "retrievedAt": "2025-08-11T18:40:30.977Z"
}
