{
  "title": "“Justice is the foundation of a successful society”: Ijaz Shah",
  "link": "https://www.app.com.pk/national/justice-is-the-foundation-of-a-successful-society-ijaz-shah/",
  "date_published": "2020-01-23T01:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 23 (APP):Federal Minister of Interior Brig (R) Ijaz Ahmad Shah Thursday said the justice was the foundation of a successful society and its speedy dispensation would ensure formation of an ideal society.\nHe expressed these views during a meeting with the Chief of UNODC Masood Karimipour who had come to brief him regarding the new project launch called “Terrorism Prevention Branch”.\nThe primary purpose of the project is to curb the menace of terrorism and achieve a peaceful society.\nThe project intends to function in collaboration with law enforcing agencies and relevant stakeholders.\nBrig (R) Ijaz Ahmed Shah said that it was a great initiative, adding that the process should be inclusive. Such projects could not be successfully operated in isolation, he added.\nHe said the awareness and educating the masses regarding the issues that harm the society was very important.\nThe minister said an aware and mature society made it difficult for the extremist school of thoughts to survive.\nFrom delivery of Justice to creating awareness, each step played a role in defending the society against problems like terrorism and crime, he added “It is one of my biggest dreams to see our country successful and flourish” Ijaz Shah said.\nThe UNODC chief said the minister’s guidance in this project would hold immense importance for the success of the project.\nThe Ministry of Interior had a vital role to play in successful execution of this project, he added.\nIjaz Shah promised all possible help under the available resources and his relevant experience. He also said that its heartening to see a sharp decline in terror related activities across the country. The meeting concluded with the hope of eliminating terrorism completely from the society.",
  "retrievedAt": "2025-08-11T18:40:35.253Z"
}
