{
  "title": "ICCI invites German companies for JV, investment",
  "link": "https://www.app.com.pk/national/icci-invites-german-companies-for-jv-investment/",
  "date_published": "2024-02-26T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):Islamabad Chamber of Commerce and Industry (ICCI) on Monday invited German small and medium entrepreneurs to explore Pakistan for joint ventures and investment to promote and further develop bilateral trade and business relations between both countries.\nA German delegation led by Matthew De Shaw, Country Head of Pakistan of the German Association of Small and Medium Size Businesses (BVMW), visited ICCI and discussed collaboration between the SMEs of Germany and Pakistan to achieve win-win results for both countries.\nAddressing the delegation, Ahsan Zafar Bakhtawari, President, of ICCI, said that Pakistan offers good opportunities to foreign investors, and German SMEs should explore Pakistan for JVs and investment. He said that Germany is a very important country for Pakistan, and we want to further strengthen business and investment relations between the two countries.\nHe urged Pakistan and Germany to focus on improving bilateral trade as the current trade volume between them is not up to the desired level. He said that ICCI would like to work with BVMW to promote direct connectivity between the SMEs of both countries.\nHe said that Pakistan’s population is young, while the populations of Europe and Germany are aging. Germany needs skilled manpower to continue its economic journey. He said that Pakistan can export nurses and other trained manpower to Europe and Germany.\nHe said that Pakistan is producing thousands of IT graduates every year and urged German IT companies to open their offices in Pakistan and take advantage of this huge human capital, adding that German companies also use the ICCI platform to improve B2B relations with local SMEs.\nSpeaking on the occasion, Matthew De Shaw, Country Head, BVMW, said that there are immense possibilities for cooperation between the SMEs of Germany and Pakistan. His organization is taking steps to connect SMEs in both countries.\nHe said that Pakistan is a large market, and the German business community wants to take advantage of its potential. The experience of German companies in terms of investment in Pakistan is excellent. We need to learn from these experiences to further strengthen cooperation between the private sectors of both countries.\nAkhtar Parvez, President of the German-Pakistan Chamber of Commerce, said that German companies want to invest in Pakistan. Our chamber is working to facilitate them. The Pakistani business community should benefit from the opportunities available in Germany and focus on technology transfer.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:56:42.645Z"
}
