{
  "title": "First Pakistani Astronaut  wins scholarship for space exploration",
  "link": "https://www.app.com.pk/national/first-pakistani-astronaut-wins-scholarship-for-space-exploration/",
  "date_published": "2024-02-26T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):Borderless Labs Inc (BLINC) has awarded  First Pakistani Astronaut, Namira Salim with a scholarship to train as an orbital scientist Astronaut, to further her path in space exploration.\n“By partnering with Borderless Labs Inc. (BLINC), Namira Salim will be embarking on an ambitious journey and will train at esteemed US institutions, including the International Institute of Astronautical Sciences (IIAS).” said Mac Malkawi, Founder, CEO and President of BLINC.\n“I will undergo rigorous training as a scientist Astronaut, designed to prepare me for future private orbital missions around the Earth and beyond, as they become available, at the advent of commercialization of space, which makes the final frontier Accessible to All,” said Namira Salim who will also be trained for Extra Vehicular Activity (EVA or spacewalks) and survival in Lunar and Martian gravity.\nAccording to the press note, Namira Salim is a Pakistani polar explorer and artist known for becoming the First Pakistani Astronaut and a pioneer astronaut with Sir Richard Branson’s Virgin Galactic on 6th October 2023.\nNamira Salim is the first Pakistani to reach both the North and South Poles, as well as the first Asian to skydive (tandem) Mount Everest, during the First Everest Skydive 2008.\nNamira’s contributions go beyond her spaceflight and polar exploits.\nShe is also an advocate for Space Diplomacy via her non-profit, Space Trust and promotes STEM/STEAM Education for capacity building in developing countries.\n“My upcoming training will inspire space enthusiasts and propel future Astronauts on private missions, particularly from Pakistan and South Asia,”  Namira Salim said.\n“Namira Salim is a role model for space generation leaders to push boundaries of human spaceflight not only in Pakistan but also in developing and new space nations,” said Mac Malkawi.\n“Her unwavering commitment to human space exploration will propel future Pakistani astronauts to space via the partnership between BLINC and Space Trust,” he added.\nBorderless Labs Inc (BLINC) is bridging the gap in bringing Space and STEAM fields to untapped markets through investment, Media, and inclusionn.\nFor further information and partnership opportunities, please contact: Mac Malkawi, Founder CEO & President of Borderless Labs Inc (BLinc).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:56:21.487Z"
}
