{
  "title": "Digital News Ideathon gets overwhelming response",
  "link": "https://www.app.com.pk/national/digital-news-ideathon-gets-overwhelming-response/",
  "date_published": "2023-03-20T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP):‘Click! The Digital News Ideathon’ has received an overwhelming response from the content creators who gathered at the Centre for Excellence in Journalism (CEJ-IBA) to learn monetization of their content and diversification of revenue stream for the sustainability of their platforms.\nNearly 150 beginners, intermediate, established, and aspiring content creators participated in ‘Click! The Digital News Ideathon’, organized by the CEJ-IBA in collaboration with Deutsche Welle Akademie (DW).\nMultimedia Journalist- Sabah Bano Malik kicked off the event with a warm welcome to the audience and spoke about the constant evolution of the digital landscape.\nCEJ Director Amber Rahim Shams underlined the need to reinvent journalism by learning new ways of news gathering and dissemination as well as engaging the audience.\nAmbassador Alfred Grannas highlighted the partnership between the CEJ-IBA and DW, and encouraged participants to learn how to monetize, with a caveat: “Make money- become millionaires! Just do not forget your duties as a journalist”.\nThe Ideathon also included a panel discussion to reflect on the Pakistani news audience’s desire for serious content, and the blurred lines between journalist, influencer, citizen journalist and vlogger.\nModerated by Amber Rahim Shamsi, the panelists addressed how to deal with negativity on social media platforms.\nBroadcast Journalist Syed Muzammil spoke about the various models, platforms, and strategies available for content monetization, and gave several tips on how to get the most out of the digital space.\nContent Creator and Entrepreneur, Amtul Baweja spoke about her personal journey in leveraging her social media to become an entrepreneur. She shared her experiences in discovering what kind of content worked and what did not, and the challenges she faced in dealing with trolls and haters. She also weighed in on whether influencers can be called the entrepreneurs of today.\nJournalist Alia Chughtai moderated an engaging panel discussion on ‘Clickbait,’ where panelists including Munazza Siddiqui, Ali Warsi, Maria Memon, Zeeshan Ahmed, and Risham Waseem discussed the accusation that content creators and digital news platforms often use misleading headlines to bait audiences. They also examined the advantages and disadvantages of ‘Clickbait’ and discussed alternatives.",
  "retrievedAt": "2025-08-11T06:26:29.822Z"
}
