{
  "title": "Mauritius embassy marks 55th Independence anniversary",
  "link": "https://www.app.com.pk/national/mauritius-embassy-marks-55th-independence-anniversary/",
  "date_published": "2023-03-20T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): Mauritius High Commissioner to Pakistan Rashidally Soobadar on Monday commemorated the 55th anniversary of Independence Day and 31st Mauritius Republic Day here at a local hotel.\nThe ceremony was commemorated by playing national anthems of both countries, which was also attended by the Dean of the diplomatic corps H.E. Mr Atadjan Novlamov, Additional Secretary Africa Mr Javed A. Umrani.\nSpeaking on the occasion Rashidally Soobadar lauded the deeply rooted cordial relations of both countries and said, today Mauritius is a safe and secure country, as it is one of the most peaceful countries on the African continent.\nHe also thanked prominent personalities, diplomats, and excellencies and special thanks to the Deputy Head mission and staff for organising this event in a peaceful manner.\nThe high commissioner also highlighted the significance of independence and cherished the value of freedom, Mauritius has changed the whole destiny of the island in a short span of time, he added.\nOn the occasion, his excellency offered sympathies with all the victims of natural calamities in Turkey, Syria and flood in Pakistan.\nHe also shed light on the achievements since independence on 12 March 1968. Mauritius values peace, security, law and order, good governance, accountability, accessibility and rule of law.\nHe said Mauritius offers tourism expertise to exploit the untapped potential of the sector, saying he believed it can significantly contribute to the national economy.\nMauritius has a strong road infrastructure and standard hotels quality transport was also vital to facilitate and attract tourists.\nHe said the entire world was facing a difficult time and despite severe lockdowns due to Covid-19, Mauritius’ economy was recovering gradually from these financial constraints.",
  "retrievedAt": "2025-08-11T06:26:25.663Z"
}
