{
  "title": "Techlift Boot camp launched to train IT graduates: IT minister",
  "link": "https://www.app.com.pk/national/techlift-boot-camp-launched-to-train-it-graduates-it-minister/",
  "date_published": "2023-03-20T16:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): Federal Minister of Information Technology and Telecommunication Syed Amin Ul Haque on Monday said the ministry had launched Techlift Boot camp to impart world class trainings to around 4,000 IT graduates.\nAddressing the graduation ceremony of Boot Camp, he said that the training of the IT graduates was being offered by the Pakistan Software Export Board, Pakistan Software House Association and 21 leading tech companies.\nSyed Amin Ul Haque said that Pakistan’s population boasted an enormous potential for young people, with more than two-thirds of the population under 30 years of age. “This demographic presents a unique opportunity for growth and development if we can harness their talents and channel them in the right direction.”\nIn pursuit of our objective to increase IT exports, he said the ministry had collaborated with both public and private sector stakeholders to set a goal of 100 percent growth in the coming years. “Achieving this target requires skilled youth trained in the latest technology trends to meet the demands of the market,” he added.\nHe said the industry-driven boot camp programme, funded by the government, was specifically designed to provide the latest technology training to the youth, making them competitive in the job market with an impressive 80 percent employability rate.\nThe minister said the boot camp programme had a target to train and recruit 4000 eligible graduates for software industry roles. The programme’s international quality curriculum, designed by IT companies, would ensure that trainees were prepared for successful careers in tech.\n“The program was started on May, 2022 and about 1800 IT Graduates successfully completed their Training session and awarded certificates on this occasion while the remaining 2200 Graduates will complete their training by June, 2023”, he noted.\nHaque said that this innovative programme aimed to accelerate the growth of Pakistan’s IT sector and keep pace with the rapid technological advancements worldwide.\nHe said the curriculum was tailored to meet the needs of the industry and designed by IT companies, focusing on emerging technologies to provide trainees with hands-on experience based on real-world scenarios and market needs.\nHe said the success of Pakistan’s economy was intricately tied to the growth of the tech industry, and “I firmly believe that these graduates will play a pivotal role in driving innovation and growth in the country.”",
  "retrievedAt": "2025-08-11T06:26:27.414Z"
}
