{
  "title": "Ghulam Gulzar demands probe into Chattisinghpora, all other IIOJK massacres by global body",
  "link": "https://www.app.com.pk/national/ghulam-gulzar-demands-probe-into-chattisinghpora-all-other-iiojk-massacres-by-global-body/",
  "date_published": "2023-03-20T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): Senior APHC leader Ghulam Ahmed Gulzar has said that Chattisinghpora massacre was a sinister conspiracy hatched by India to divide Kashmiris on religious lines and also to defame Kashmir’s legitimate freedom movement.\nGhulam Ahmed Gulzar in a statement issued in Srinagar on the 23rd anniversary of Sikh massacre by Indian agencies in Chattisinghpora said that the carnage was carried out to give an impression to the world that Sikhs were killed by Kashmiri mujahideen on the behest of Pakistan.\nHowever, the world did not buy the Indian malicious propaganda, Kashmir Media Service reported.\nOn 25 March, five days after the massacre, India army arrested six innocent Kashmiris and killed them in a fake encounter at Patribal and labeled them foreign militants who, the Indian army blamed, were responsible for the Sikh massacre. However, the investigation exposed the Indian drama and it was proved that the Indian army had killed the innocent villagers to hide its heinous crime.\nGhulam Ahmed Gulzar said that India’s history is replete with such dastardly acts and conspiracies, especially when it comes to New Delhi’s way of handling the freedom movement in occupied Jammu and Kashmir.\nHe said that the massacre was aimed at creating hatred and communal rift in the territory to malign the freedom movement. He hailed the Kashmiris for foiling Indian intrigues with unity.\nThe APHC leader said that minorities are a part and parcel of the Kashmiri society and they are being targeted by India for ulterior motives.\nGhulam Ahmed Gulzar demanded probes by international agencies into all massacres in Kashmir including the massacre of Chattisinghpora.\nThe APHC leader expressed gratitude to OIC for its consistent support to the Kashmir freedom movement . He also thanked Pakistan for playing the role of an ambassador of Kashmiri people.",
  "retrievedAt": "2025-08-11T06:26:35.795Z"
}
