{
  "article_id": "2025-01-22_018235adc4c5065e2020379b1767c7b3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-body-on-it-discusses-data-protection-bill/",
    "retrieved_at": "2025-08-27T11:55:50.365Z"
  },
  "metadata": {
    "title": "Senate body on IT discusses Data Protection Bill",
    "author": null,
    "date_published": "2025-01-22T16:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 362,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 22 (APP):The Senate Standing Committee on Information Technology and Telecommunication on Wednesday discussed the Personal Data Protection Bill, Starlink operations, and the telecom foundation's performance. Senator Palwasha Mohammad Zai Khan chaired the meeting. Additional Secretary, Information Technology and Telecommunication explained that the Personal Data Protection Bill, 2023 was approved by the Cabinet in 2022 before being sent to the Law Ministry. A subsequent change in government delayed its progress. A representative from the Law Ministry also added that no bill involving financial implications could be introduced without proper consideration. Senator Dr. Afnan Ullah Khan, the Bill's Mover, expressed dissatisfaction over the prolonged delays, emphasizing that consultations have taken too long, and the bill should be approved by now. He insisted the Bill does not contravene the Constitution and called for clear communication from the Law Ministry about its stance on the Bill. Senator Anusha Rahman Ahmad Khan also underscored the critical need for robust data protection measures. Following detailed deliberations, the Committee agreed to call one-point agenda session exclusively on the Personal Data Protection Bill along with representatives from the Law and Justice Division to further deliberate and finalise the matter. The Committee was briefed on the launch of Starlink operations in Pakistan. It was reported that any satellite service provider must obtain necessary licenses from all concerned departments. The Committee unanimously resolved to summon the already constituted regulatory body for a briefing in the next meeting. The Committee also reviewed revenues generated and taxes paid by telecom companies over the last decade, with a year-by-year comparison for each company. The Ministry committed to presenting detailed data in the next meeting. The Telecom Foundation's performance was discussed. It was said that it is a self-funded trust and currently 15 schools are being run by it alongside the provision of health services. The gross revenue of the trust is expected to reach 1 billion by the end of this year. Additional Secretary IT and Telecom informed the Committee that the government would not be part of the trust in future, and it would work independently. The Committee emphasized that the Telecom Foundation should focus on its core functions and work independently.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}