{
  "article_id": "2025-01-22_a14d7ac8367d2c5fc59dd1b6fca60a35",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-on-it-approves-digital-nation-pakistan-act-2024/",
    "retrieved_at": "2025-08-27T11:56:11.010Z"
  },
  "metadata": {
    "title": "NA body on IT approves ‘Digital Nation Pakistan Act 2024’",
    "author": null,
    "date_published": "2025-01-22T15:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 281,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 22 (APP):The National Assembly's Standing Committee on Information Technology and Telecommunications on Wednesday unanimously approved the Digital Nation Pakistan Act 2024. Chairman Committee Syed Aminul Haque said that the purpose of the Act is to transform Pakistan into a Digital Nation by providing timely opportunities to enable a Digital Society, Digital Economy, and Digital Governance, in accordance with technological requirements. Chairman Committee Syed Aminul Haque said that by leveraging the transformative power of Digital Technologies, responsible use of data, modern service delivery models, and strong digital public infrastructure, the people of Pakistan will be able to become a digital nation. This will further accelerate sustainable economic development, modernize the governance framework, improve citizen welfare, and provide effective public services, Amin ul Haque added. Syed Aminul Haque further said that the Act also aims to create a progressive digital society, promote a thriving digital economy, and establish a shared digital governance ecosystem, which includes secure, comprehensive, and collaborative digital public infrastructure. He said that this Act would prove to be an important milestone in effectively connecting Pakistan with the digital world, leading to clear and stable changes in the world of Information Technology. He said that many decisions and steps taken in the promotion of IT and telecommunication are hindered by departmental problems and red tape, but this Act will remove this significant obstacle. Minister of State Ms. Shaza Fatima Khawaja briefed the committee members, clarifying that the bill does not centralize data collection but will help streamline digital identity and improve cyber security. She explained that the rules framed under the new bill would reduce corruption and increase the delivery of public services by eliminating the need for paperwork.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}