{
  "article_id": "2025-01-22_f9f48bcf6a7838aff976dd4e4f13fea2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sc-seeks-erra-report-regarding-earthquake-rehabilitation-projects/",
    "retrieved_at": "2025-08-27T11:56:09.212Z"
  },
  "metadata": {
    "title": "SC seeks ERRA report regarding earthquake rehabilitation projects",
    "author": null,
    "date_published": "2025-01-22T15:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 238,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 22 (APP):A constitutional bench of the Supreme Court on Wednesday sought a report from the federal & provincial governments and Earthquake Reconstruction and Rehabilitation Authority (ERRA) regarding the rehabilitation of earthquake victims. The court also sought an audit report from the Auditor General of Pakistan (AGP) regarding the rehabilitation funds. A six-member constitutional bench headed by Justice Amin ud Din Khan heard the case regarding the rehabilitation work in earthquake affected areas. At the outset of hearing, Justice Hassan Azhar Rizvi remarked that it will be 20 years since the earthquake in October 2025. Is there a 50-year plan for the earthquake victims, he asked. Justice Jamal Khan Mandokhail remarked that if there are no resources, then why does the government announce such projects? Justice Muhammad Ali Mazhar asked how many houses were built for earthquake victims and how many victims were helped in business. The petitioner said that the government had announced the construction of New Balakot city and the Supreme Court had given 30 months for this, but nothing has happened regarding the project yet. The ERRA representative said that we had completed projects for more than 14,000 earthquake victims. Justice Muhammad Ali Mazhar asked where the projects that were completed. How much money came from donors, and where that money was spent, he asked.The court sought reports from the federal & provincial governments and the ERRA, and adjourned further hearing of the case.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}