{
  "article_id": "2025-01-22_bcf15532e7208c919196803453fca4f6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ministry-introducing-affordable-housing-through-advanced-construction-techniques-riaz-hussain-pirzada/",
    "retrieved_at": "2025-08-27T11:54:34.620Z"
  },
  "metadata": {
    "title": "Ministry introducing affordable housing through advanced construction techniques: Riaz Hussain Pirzada",
    "author": null,
    "date_published": "2025-01-22T12:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 285,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 22 (APP): Federal Minister for Housing and Works, Mian Riaz Hussain Pirzada, stated on Wednesday that his Ministry is developing a new vision for low-cost housing schemes by incorporating advanced construction techniques. The minister stated during a meeting that investing in smart and green housing techniques and research has become a key aspiration and goal. He commended the idea of exhibitions, emphasizing that such events are essential to move away from conventional construction methods that waste valuable non-renewable resources. He further said that such platforms are the need of the hour as this industry have a great potential that needs a right vision and impetus to grow and flourish. Minster asserted that conventional mode of construction and Theka (contract) system must be discouraged and become obsolete as they promote corrupt practices and illegal activities. He reiterated that as per the vision and directions of prime minister we are eager to learn new ideas and capture opportunities through these expos to introduce advance technologies like fiber construction for low cost housing schemes. The ministeras meeting with Saleem Khan Tanoli, CEO of Fakt Exhibitions (Pvt), a Karachi-based exhibition company, was also attended by the Secretary of Housing and Works, Dr. Shahzad Khan Bangash, and other senior officials from the ministry. Tanoli briefed the minster on the idea of aBuild Pakistana that is the first ever exhibition and conference on infrastructure and construction industry under the patronage of Ministry of Housing and Works. The exhibition will be held in August 2025 at Expo Centre, Lahore and its main objective is to foster networking; strategic promotion by attracting international companies and investors; to boost infrastructure industry, to highlighting success stories and to transfer construction techniques and technology.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}