{
  "article_id": "2025-01-22_6e3159e306f8e7750b053c3e2c4cdaff",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sc-adjourns-contempt-case-against-additional-registrar-till-tomorrow/",
    "retrieved_at": "2025-08-27T11:56:14.739Z"
  },
  "metadata": {
    "title": "SC adjourns contempt case against additional registrar till tomorrow",
    "author": null,
    "date_published": "2025-01-22T15:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 321,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 22 (APP):The Supreme Court of Pakistan on Wednesday adjourned hearing till January 23 on a contempt of court show-cause to additional registrar for not fixing of a case pertaining to the powers of constitutional and regular benches. The court directed the Additional Registrar Nazar Abbas to submit written response on contempt of court show-cause for not fixing this case for hearing. A division bench headed by Justice Mansoor Ali Shah and comprising Justice Aqeel Abbasi heard the case pertaining to show-cause notice. During the course of proceeding, Justice Mansoor Ali Shah read out the background of the case and remarked that the case is related to the powers of the Practice and Procedure Committee and not the 26th Constitutional Amendment. On the occasion, Attorney General of Pakistan Mansoor Usman Awan said that this matter is between the court and the offender. He said that the judicial assistants appointed in this case had been the lawyers of petitioners against 26th Constitutional Amendment. The AGP said that under the 26th Constitutional Amendment, the Constitutional Committee now has the authority to form benches. Justice Aqeel Abbasi said that your opinion is correct and we are also aware of this. Justice Shah said that the question is about Section 2 of the Practice and Procedure Act. If the bench wants to check its jurisdiction, can the case be withdrawn? The Attorney General said that the question raised by the court cannot be heard in a contempt of court case. He said that I can appear as a prosecutor in a contempt of court case, I can assist the court on legal questions under 27A, but my position as Attorney General in a contempt of court case is different. During hearing, amicus curiae including Hamid Khan, Munir A. Malik and Shahid Jameel Advocate also gave arguments on court directions. The court said that it would hear the other amicus-curiae tomorrow and adjourned further hearing.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}