{
  "title": "Illustrious elderly Jailed Kashmiri Hurriyat leader Ashraf Sehrai dies in occupied Jammu",
  "link": "https://www.app.com.pk/national/illustrious-elderly-jailed-kashmiri-hurriyat-leader-ashraf-sehrai-dies-in-occupied-jammu/",
  "date_published": "2021-05-05T10:38:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK):  May 05, (APP): Illustrious APHC (All Parties Hurriyat Conference) leader and Tehreek-e-Hurriyat Jammu and Kashmir Chairman Mohammad Ashraf Sehrai breathed his last, while in Indian custody in occupied Jammu after a brief illness on Wednesday, said a report from across the line of control (LoC).\nThe 80 years old elderly senior Kashmiri Hurriyat leader Mohammad Ashraf Sehrai was facing detention under the Public Safety Act (PSA) and passed away after a brief illness at GMC in occupied Jammu the report said.\nIt is widely amongst the local Kashmiris that the elderly Kashmir freedom struggle leader was poisoned by the occupational authorities in jail. Relatives of other Kashmiri detainees have also expressed apprehensions that they are being poisoned, the report revealed.\nHurriyat chairman Ashraf Sehrai who was admitted at GMC in Jammu on Tuesday after his health started deteriorating at Kot Bhalwal jail, where he was facing detention under Public Safety Act (PSA). He breathed his last this afternoon.\nIn July 2020 the illustrious Kashmir freedom struggle leader Ashraf Sehrai was arrested by Indian occupational forces from his residence in occupied Srinagar and was lodged at Udhampur Jail.\nAshraf Sehrai was elected as the Chairman of Tehreek-e-Hurriyat, a constituent of All Parties Hurriyat Conference, which was previously headed by the world-fame distinguished elderly Kashmir freedom struggle supremo  Syed Ali Shah Geelani.\nBooked under the draconian Public Safety Act, Muhammad Ashraf Sehrai was on July 12, 2020 shifted to Udhampur Jail in Jammu. His condition deteriorated in the jail and he was shifted, on Tuesday, to a hospital in Jammu where he died.\nMuhammad Ashraf Sehrai was suffering from multiple diseases and was not provided with any treatment during his incarceration. His family members were kept unaware of his health condition.\nNational Security Advisor Moeed Yusuf said he was “deeply saddened” by the death of Hurriyat leader Ashraf Sehrai.\n“He dedicated his life for Kashmir’s self-determination. Many more Kashmiri leaders are at risk in IIOJK. It is India’s responsibility to release all those detained on political grounds to create conducive environment.”\nDeeply saddened on the death of Hurriyat leader Ashraf Sehrai. He dedicated his life for Kashmir’s self-determination. Many more Kashmiri leaders are at risk in IIOJK. It is India’s responsibility to release all those detained on political grounds to create conducive environment.\n— Moeed W. Yusuf (@YusufMoeed) May 5, 2021\nHe all along his life worked as a lieutenant of Syed Ali Gilani, and was a member of Jamaat-e-Islami in Indian Illegally occupied Jammu Kashmir State.\nMuhammad Ashraf Sehrai was a hardcore freedom fighter and had allowed his son Junaid Sehrai to join the ranks of armed struggle. Junaid was martyred on May 19, 2020 in Srinagar.\nMehbooba Mufti, President Jammu and Kashmir People Democratic Party in her condolence message said “like him, countless political prisoners and other detainees from J&K continue to be jailed purely for their ideologies & thought process.”\n“In today’s India one pays a price with his life for dissent.”\n“The least GOI [Government of India] can do in such dangerous circumstances is to immediately release these detainees on parole so that they return home to their families.\nDeeply saddened to know about Ashraf Sehrai sahab’s sudden demise. Like him countless political prisoners & other detainees from J&K continue to be jailed purely for their ideologies & thought process. In today’s India one pays a price with his life for dissent.\n— Mehbooba Mufti (@MehboobaMufti) May 5, 2021\nJammu Kashmir National Conference (JKNF) here on Wednesday expressed its deep sense of shock and grief over the death of Muhammad Ashraf Sahraie.\nJKNF central vice chairman and senior Hurriyat leader Altaf Hussain Wani said in his condolence statement issued here on Wednesday that the distinguished seasoned Kashmiri Hurriyat leader Ashraf Sehrai was a visionary and ideologically strong political leader. “He never compromised on his principles”, he said and added that  his death has caused a tremendous loss of the  Kashmir freedom struggle”,\nWani said that his mission will be accomplished till the Kashmir freedom struggle reached its logical end.\nThe JKNF leader called for the early release of all Kashmiri political leaders languishing arbitrarily in different Indian as well as IIOJK jails and were being deprived of proper medical facilities.",
  "retrievedAt": "2025-08-11T20:42:00.671Z"
}
