{
  "title": "COVID-19 claims 119 lives, infects 4,113 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-119-lives-infects-4113-more-people/",
  "date_published": "2021-05-05T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 05 (APP):The national tally on Wednesday of total active COVID-19 cases recorded 84,480 with 4,113 more people tested positive for the deadly virus and 5,665 people recovered from the disease during the last 24 hours.\nOne hundred and nineteen corona patients have died during past 24 hours, 106 of whom were under treatment in hospital and 13 out of the hospital in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths have occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 119 deaths occurred in the last 24 hours 38 of them had died who were under treatment on ventilators.\nThe maximum ventilators were occupied in four major areas including Lahore 69 percent, Multan 77 percent, Mardan 59 percent and Bahawalpur 58 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Gujranwala 55 percent, Swabi 67 percent, Peshawar 62 percent and Swat 57 percent.\nAround 676 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan.\nSome 44,838 tests were conducted across the country on Tuesday, including 15,297 in Sindh, 16,844 in Punjab, 7,131 in Khyber Pakhtunkhwa (KP), 4,035 in Islamabad Capital Territory (ICT), 628 in Balochistan, 396 in GB, and 507 in AJK.\nAround 738,727 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 841,636 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 17,465, Balochistan 22,776, GB 5,341, ICT 76,696, KP 121,099, Punjab 310,616 and Sindh 287,643.\nAbout 18,429 deaths were recorded in country since the eruption of the contagion. Around 4,687 have perished in Sindh among six of them died in hospital and three out of the hospital on Tuesday.\n8,741 in Punjab had died with 58 deaths occured in past 24 hours. 48 of them in the hospital and 10 out of hospital. 3,466 in KP where 43 of them died in hospital on Tuesday, 698 in ICT among five of them died in the hospital on Tuesday, 239 in Balochistan, 107 in GB and 491 in AJK among four of them succumbed to the deadly virus in hospital on Tuesday.\nA total of 12,010,519 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 5,741 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:42:01.015Z"
}
