{
  "title": "Backward areas of Punjab to be brought at par with developed cities: Firdous Ashiq",
  "link": "https://www.app.com.pk/national/backward-areas-of-punjab-to-be-brought-at-par-with-developed-cities-firdous-ashiq/",
  "date_published": "2021-06-14T07:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): Special Assistant to Punjab Chief Minister for Information Dr Firdous Ashiq Awan on Monday said that the budget of Punjab would be in accordance with the aspiration of people of the province and which would bring backward areas of the province at a par with developed ones.\nThe sustainable development of every city of Punjab and human development were main targets to be achieved in the provincial budget, which would bring the backward areas at par with the developed ones, she said this while speaking to a private news channels.\nShe also hailed that federal government for presenting the people-friendly budget in which special relief has been provided to the deprived segment of the society.\nShe said Punjab government would follow the foot steps of federal government and would present a public-friendly budget, which would usher in an era of progress and development in the province.\nShe said government employees were also being provided relief and their salaries were being increased in provincial budget.\nShe said that the budget was a reflection of the party’s manifesto, which would open the doors of progress and prosperity in Punjab, adding that we have determined our priorities while remaining within our resources.\nReplying to a question, she said, “We would get opposition’s suggestions regarding issues of public, adding that priority would be given to education, infrastructure and transport sectors besides ensuring provision of clean drinking water as well as development of other social sectors.\nDr Firdous Awan said provision of Health Sahulat Cards would be issued to 100 percent of the population of the province by December this year as well.",
  "retrievedAt": "2025-08-11T20:50:44.408Z"
}
