{
  "title": "‘Strategic depth’ obsolete as Pakistan committed to APPAPS:  FM",
  "link": "https://www.app.com.pk/national/strategic-depth-obsolete-as-pakistan-committed-to-appaps-fm-2/",
  "date_published": "2021-06-14T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): Foreign Minister Shah Mehmood Qureshi on Monday said the concept of “strategic depth” was obsolete and Pakistan was instead committed to move together with Afghanistan to attain the goals of peace and economic prosperity.\n“Peace in Afghanistan is a shared responsibility and no failure or mistake should be blamed on Pakistan,” the foreign minister said at the inaugural session of the conference titled ‘Pakistan-Afghanistan Bilateral Dialogue’ organized by the Regional Peace Institute.\nThe foreign minister said Pakistan wanted to resolve the mutual issues with Afghanistan under the mechanism of APPAPS (Afghanistan-Pakistan Plan of Action for Peace and Solidarity).\nStressing upon the policy of geo-economics, he said, such stability was not possible without peace in the region. Peace was vital to promote trade and investment, he added.\nThe foreign minister said Pakistan was committed to helping the Afghans for rebuilding their country and was sincerely working with the international community to ensure peace.\nQureshi said the conflict of Afghanistan was political in nature and Pakistan was also advocating for a political solution through comprehensive dialogue.\nHe said violence and reconciliation could not go side by side and mentioned that Pakistan stressed upon moving towards a ceasefire by controlling the incidents of violence.\nHe expressed satisfaction that the Ambassador of Afghanistan recognized the usefulness of the APPAPS, adding that Pakistan always played a constructive and positive role in the Afghan peace process.\nHe recalled his recent interaction with members of the United States congress during the emergency session of the General Assembly in New York, which he termed as “a complete paradigm shift” compared to the past.\nHe quoted Senator Lindsay Graham as saying, “today we do not see Pakistan as part of the problem, but part of the solution”.\nThe foreign minister stressed that the Afghan leadership must seize this rare opportunity to pave the way for a comprehensive political solution. He said Prime Minister Imran Khan always emphasized that there was no military solution to the Afghan problem.\nQureshi said the biggest obstacle to peace was “mistrust”, adding that Pakistan and Afghanistan needed to “move beyond their past”.\n“We believe that a peaceful and stable Afghanistan is in Pakistan’s interest,” he said.\nThe foreign minister said peace in Afghanistan would enable Pakistan to benefit from projects such of regional connectivity including CASA-1000 and TAPI gas pipeline.\nHe said Pakistan had no intention of interfering in Afghanistan’s internal affairs.\n“No party is our favorite. We have invited people from every faction from Afghanistan to Pakistan,” he said.\nHe said Pakistan favoured a dignified repatriation of the Afghan refugees.\nHe said Pakistan was ready to partner with the United States, Afghanistan and other the countries of the region in the fight against terrorism. Pakistan wants a peaceful, prosperous and independent Afghanistan and continued to take all possible steps for peace in its neighbourhood, he added.\nQureshi expressed disappointment over the statement by Afghanistan’s National Security Adviser, saying that such gestures could sabotage peace efforts.\\932",
  "retrievedAt": "2025-08-11T20:50:44.431Z"
}
