{
  "title": "Relations with Russia, a key priority of Pakistan’s foreign policy: FM",
  "link": "https://www.app.com.pk/national/relations-with-russia-a-key-priority-of-pakistans-foreign-policy-fm/",
  "date_published": "2021-06-14T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 14 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Monday reaffirmed that relations with Russia were a key priority of Pakistan’s foreign policy.\nIn a telephonic conversation with Foreign Minister of Russia Sergey Lavrov, the foreign minister noted that Pakistan-Russia relations had made impressive progress over the past two decades and stressed upon continuation of this progress to capitalize on their cooperation.\nDuring the call, the two foreign ministers exchanged views on bilateral, regional and global issues of mutual interest.\nForeign minister Qureshi further said that an important development since foreign minister Lavrov’s visit was the signing of Protocol on amendments to Inter Governmental Agreement for the development of North-South Gas Pipeline Project (Pakistan Stream) and which would pave the way for an early commencement of the project.\nHe also reiterated Pakistan’s request for assistance in procuring 5 million doses of Sputnik V vaccines.\nFM @SMQureshiPTI held a telephonic conversation with Russian FM, Sergey Lavrov. Both exchanged views on bilateral, regional and global issues of mutual interest & reaffirmed committment to deepen long-term multidimensional partnership between -.@mfa_russia@PakinRussia\n— Spokesperson  MoFA (@ForeignOfficePk) June 14, 2021\nQureshi hoped that joint mechanisms such as political consultations, Pakistan-Russia IGC and various other joint working groups meetings would resume in-person once the Covid situation normalized.\nBoth sides agreed to work closely for an early negotiated political settlement of the Afghan issue.\nHe said that foreign minister Lavrov’s recent visit to Pakistan reflected keenness of both sides to deepen their long-term multidimensional partnership.\nThe two foreign ministers stressed the importance of follow-up action on the decisions made during the recent visits to transform these into tangible outcomes.\nThe two foreign ministers also agreed to remain in close contact.",
  "retrievedAt": "2025-08-11T20:50:42.237Z"
}
