{
  "title": "PM Imran Khan desires uplift of all federating units on equal basis: Farrukh",
  "link": "https://www.app.com.pk/national/pm-imran-khan-desires-uplift-of-all-federating-units-on-equal-basis-farrukh/",
  "date_published": "2021-06-14T09:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): Minister of State for Information and Broadcasting Farrukh Habib said on Monday that Prime Minister Imran Khan was taking practical measures to ensure sustainable development in the country by providing level-playing field to each federating unit.\n“Imran Khan desires all-encompassing development as he is prime minister of entire country including Sindh,” said Farrukh in a news statement while pointing out special allocations for socioeconomic uplift of different federating units in the federal budget for fiscal year 2021-22.\nHe said the federal government had earmarked Rs98 billion for Karachi Transmission Plan, Rs40 billion for development of Gilgit Baltistan, Rs 20 billion for South Balochistan and Rs19.5 billion for uplift of 14 districts of Sindh.\nThe special packages were meant to remove resources’ disparity among various areas of the country, he added.\nFarrukh regarded the prime minister’s special package of Rs446 billion for socioeconomic development of 14 underdeveloped districts of Sindh as a ‘gift’.\nHe said those districts are: Badin, Hyderabad, Larkana, Tandoyar, Dadu, Jacobabad, Mirpur Khas, Tando Muhammad Khan and Ghotki.\nThe completion of those socioeconomic projects would mark a new era of development in Khairpur, Naushahro Feroze, Sanghar, Shikarpur and Sukkur, he added.\nThe minister said the provincial share from the federal divisible pool would increase to Rs3.41 trillion in the next fiscal year with an increase of 25 per cent.\nHe decried bad governance in Sindh and said that the Pakistan People’s Party (PPP) had ruled the province for the last three consecutive terms, but completely failed to deliver in the province, especially during the last couple of years.\nFarrukh said the people of Sindh including Karachi were fed up with the PPP’s corruption, plundering and fake accounts.\nHe said all the records of increasingly spreading pauperdom and deadly diseases in the interior Sindh had been broken, but the ‘callous’ provincial government was not paying any heed to these issues.\nHe said that the people of Sindh had started now uprising against the provincial government.",
  "retrievedAt": "2025-08-11T20:50:43.771Z"
}
