{
  "title": "CJP expresses annoyance over encroachments in Karachi",
  "link": "https://www.app.com.pk/national/cjp-expresses-annoyance-over-encroachments-in-karachi/",
  "date_published": "2021-06-14T18:26:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 14 (APP): Chief Justice Supreme Court of Pakistan Justice Gulzar Ahmed on Monday expressed annoyance over illegal constructions and encroachments in Karachi and reprimanded the provincial government and relevant authorities for their inaction against these illegal practices.\nDuring the hearing of a case at the Karachi Registry regarding the construction of a tower at Shahrah-e-Faisal, the Chief Justice remarked that land grabbing activity is under way in the city incessantly. He noted that plazas are being built on amenity plots.\nThe chief justice questioned what plan the provincial government has? as the situation is getting from bad to worse. Justice Gulzar Ahmed remarked where the government is and who would take the responsibility?\nThe Chief Justice told Advocate General Sindh to ask the government what they want.  The Advocate General sought two days time due to provincial budget.\nChief Justice questioned Advocate General what the citizens got in these years from the government?\nJustice Gulzar remarked Karachi’s system is being run from Canada. Expressing his annoyance over lack of attention to Karachi’s civic issues, Chief Justice remarked is this parliamentary system of government, is this governance?\nHe asked if you cannot clean a nullah, how will you run the province?\nJustice Gulzar remarked that a nullah could not be cleaned and it has been passed two years.\nThe hearing of the tower case was adjourned till June 16.\nMeanwhile, Supreme Court declared the Pavilion End Club, which is adjacent to Aladin Park, as illegal, and ordered demolition of the club and an end to other commercial activities at the park. Court also sought a compliance report within a couple of days.",
  "retrievedAt": "2025-08-11T20:50:36.315Z"
}
