{
  "title": "Calling need for int’l engagement with Afghanistan, Pakistan set to host OIC CFM on Dec 19",
  "link": "https://www.app.com.pk/national/calling-need-for-intl-engagement-with-afghanistan-pakistan-set-to-host-oic-cfm-on-dec-19/",
  "date_published": "2021-12-17T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): As part of highlighting the need for engagement with Afghanistan, Pakistan is hosting the 17th Extraordinary Session of the Council of Foreign Ministers of the Organization of Islamic Cooperation (OIC) in Islamabad on December 19.\nThe Session is being convened at the initiative of the Kingdom of Saudi Arabia, as OIC Summit Chair. Pakistan had welcomed the call and offered to host the Session.\nBesides the Foreign Ministers from the OIC Member States and Observers, participants would also include special invitees from the United Nations system, International Financial Institutions and some non-member states including the United States, United Kingdom, France, China, Russia, Germany, Italy andJapan, as well as the EU. The Afghan Interim Government would also be represented at the CFM.\nThe meeting is being convened in the backdrop of the aggravating humanitarian situation in Afghanistan. Besides expressing solidarity with the Afghan people, the CFM is expected to explore avenues for containing and reversing the rapidly deteriorating humanitarian situation in Afghanistan, especially in terms of food shortages, displacement of people and a potential economic collapse.\n“Pakistan has always maintained that continued engagement of the international community with Afghanistan is imperative and hosting of the CFM is another manifestation of Pakistan’s intense diplomatic outreach to consolidate support for the people of Afghanistan,” the Foreign Office said in a statement.\nIt said that the 17th Extraordinary Session reflects Pakistan’s abiding commitment and consistent efforts to promote peace and stability in Afghanistan and the continued well-being of the Afghan people.\n“The Extraordinary session would provide an opportunity to consider practical and concrete steps to help address the humanitarian needs of the Afghan people,” it added.\nPakistan and Afghanistan are founding members of the OIC. Over the years, Pakistan and the OIC have extended consistent support to the people of Afghanistan. The first Extraordinary Session of the OIC Council of Foreign Ministers was also held in Islamabad, in January 1980, also to consider the situation in Afghanistan. The last CFM hosted by Pakistan was in 2007.\nThe Council of Foreign Ministers (CFM) will be preceded by the Senior Officials Meeting on December 18.",
  "retrievedAt": "2025-08-11T21:43:31.479Z"
}
