{
  "title": "MNAs suggest radical reforms in key sectors to achieve sustainable economic growth",
  "link": "https://www.app.com.pk/national/mnas-suggest-radical-reforms-in-key-sectors-to-achieve-sustainable-economic-growth/",
  "date_published": "2023-06-17T09:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): Lawmakers in the National Assembly on Saturday continued debate on the federal budget for fiscal year 2023-24, suggesting measures to improve key sectors including communication, water reservoirs, agriculture and energy on modern lines to achieve the required goals of macroeconomic stability and growth trajectory.\nParticipating in the debate for budget 2023-24, Riaz-ul-Haq of the Pakistan Muslim League-Nawaz (PML-N) said the allocated funds for NHA (National Highway Authority) and water resources including new reservoirs in the next fiscal year were insufficient.\nHe said the construction of major dams would take around 10 to 15 years to complete with the existing ratio of funds allocation, highlighting the water scarcity being faced in the country.\nThe lawmaker also highlighted the ever-increasing energy needs terming it a “crucial issue” for Pakistan, and recalled that during the last tenure of PML-N around 12,000 megawatts of electricity were added to the power system under the leadership of Quaid Muhammad Nawaz Sharif.\nHowever, in the past four years, he regretted that there had been no progress in this sector, which resulted in load shedding being witnessed in the country.\nHe emphasized the need to develop a comprehensive plan to eliminate circular debt in the energy sector.\nHe proposed reforms and accountability for the institutions like the Pakistan International Airlines, Pakistan Steel Mills and Khushhali Bank.\nHe mentioned that while the textile sector had been given significant incentives, similar incentives should be given to the energy and other sectors.\nPakistan Peoples Party Parliamentarians lawmaker Shagufta Jumani said the incumbent government presented the budget in difficult economic conditions as it inherited the sinking economy that had been stabilized to some extent and now putting on a consistent path of growth.\nShe voiced concern over the political temperature and the public frustration, adding had the democracy and politics been properly aligned, this situation would have not emerged. “When genuine constitutional, democratic, and political parties are suppressed, such situations arise.”\nShe regretted the May 9 incident and said political parties always loved their motherland and respected sacrifices of martyrs, and never thought of indulging in the anti-state activities.\nShe said it was unfortunate that a political party misled the youth for achieving its nefarious designs, adding there should be a strategy in the budget to bring them back on track and make them useful citizens of the society.\nSThe political parties in the country that are in decline love their land and do not ignite the country. She said that the budget should allocate funds to set the misled generation back on the right track.\nPML-N’s Nisar Ahmed Cheema said provision of budget session special honorarium to the National Assembly staff should be ensured in a judicious manner and before the Eid-ul-Azha.\nHe expressed serious concerns over the May 9 vandalism of military installations and memorials of martyrs by workers of a political party, suggesting stern action against the elements in accordance with law and the Constitution.\nThe lawmakers criticized the leadership of Pakistan Tehreek-i-Insaf (PTI) that in its three-and-a-half-year rule ruined the national economy and caused serious dent to state departments, besides smashing all moral and cultural norms.\nHe said the government prepared the budget for the next fiscal year amid severe financial constraints but it tried its best to give relief to the common man and achieve the required goals of growth trajectory.\nHe appreciated the government for giving incentives to the farming community and initiating solarization of tube wells to strengthen the agriculture sector, considered the backbone of the national economy.\nWhile participating in budget debate at the National Assembly on Saturday, the Pakistan People’s Party’s Zulfiqar Ali Behan praised the budget, emphasizing its farmer and investment-friendly nature.\nHe urged the government to provide subsidies on fertilizers for farmers and called for a special drive to plant more trees to address climate change. Behan also raised concerns about the development of his constituency and requested funds for its progress.\nIndependent member of the National Assembly, Mohsin Dawar, called on the government to create a favorable atmosphere for domestic and foreign investments.\nHe stressed the importance of adhering to the Charter of Democracy (CoD) and Charter of Economy for the country’s bright future. Dawar also urged the allocation of additional funds to support the people affected by the war against terrorism in his area.\nPakistan Tehreek-e-Insaf’s Sardar Riaz Mehmood Khan Mazari criticized the government for neglecting the development of remote areas in South Punjab. He demanded funds for the establishment of educational institutions such as schools, colleges and universities in his region.\nMazari also highlighted the delayed construction of the Shaikh Khalifa Bridge and called for funds to complete the project.\nJUI-F’s Shahida Akhtar Ali described May 9 as a dark day in the country’s history and demanded justice for those involved in the incident.\nShe condemned the disrespect shown towards martyrs’ memorials and criticized former Prime Minister Imran Khan for misleading the younger generation. She called for a special package for the families of motorway police martyrs and requested a welfare package for journalists.\nPakistan Muslim League Nawaz’s Dr. Darshan praised the budget as the best solution for the current economic crisis.\nHe credited Prime Minister Shahbaz Sharif’s leadership and the present government’s efforts to address the economic challenges. He also expressed concern over the May 9 incident, condemning those responsible and considering them enemies of the nation. He believed that former Prime Minister Muhammad Nawaz Sharif had been politically victimized.\nSikandar Ali Rahoupoto of the Pakistan People’s Party described the federal budget as balanced and people-friendly.\nHe called for increased allocations for health, education and road infrastructure.\nSaira Bano from the Grand Democratic Alliance criticized the ministers for their absence during the budget session.\nShe appreciated the raise in salaries for government employees and urged the government to ensure the implementation of maximum wages in the private sector. Bano emphasized the need to prioritize the development of impoverished communities.\nPML-N’s Ms. Farukh Khan congratulated the Prime Minister, Finance Minister and their team for presenting an outstanding budget. She commended the government’s adoption of effective economic policies and expressed the hope for their success in building a prosperous Pakistan. Ms. Khan emphasized the importance of each individual playing a positive role in advancing the country’s interests.\nPPPP lawmaker Nauman Islam Shaikh raised concerns regarding the low attendance of members in the House. He stressed the need to address the grievances of the less privileged class and lead the nation towards prosperity.",
  "retrievedAt": "2025-08-11T08:44:18.526Z"
}
