{
  "title": "Cross-party consensus backs CPEC, stronger China ties as Pakistan hosts 3rd JCM",
  "link": "https://www.app.com.pk/national/cross-party-consensus-backs-cpec-stronger-china-ties-as-pakistan-hosts-first-jcm/",
  "date_published": "2024-06-21T10:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP): All the mainstream political parties of Pakistan on Friday displayed exemplary consensus to back the China-Pakistan Economic Corridor (CPEC) with the leaders reiterating their unwavering commitment to further strengthen the bilateral relationship between Pakistan and China by thwarting all nefarious designs.\nThe political consensus was shown at the CPEC Pakistan-China Political Parties Forum and 3rd Meeting of CPEC Political Parties Joint Consultative Mechanism co-chaired by Deputy Prime Minister and Foreign Minister Ishaq Dar and Minister of the International Department of the Communist Party of China (IDCPC) and member of the Communist Party’s Central Committee Liu Jianchao who is on a three-day visit here.\nBesides Senate Chairman Syed Yousuf Raza Gilani and National Assembly Speaker Sardar Ayaz Sadiq, the senior leadership of all major political parties attended the event including Planning Minister Ahsan Iqbal, MQM’s Khalid Maqbool Siddiqui, Maulana Fazlur Rehman of JUI-F, Hina Rabbani Khar of PPP, Senator Syed Ali Zafar of Pakistan Tehreek-e-Insaf, Munazza Hassan of Istehkam Pakistan Party, National Party’s Senator Jan Muhammad, senior politicians Afrasiab Khattak and others.\nIn his opening remarks, Deputy Prime Minister Senator Ishaq Dar said the CPEC played a catalystic role in Pakistan’s socioeconomic development.\nHe said besides ridding the country of a chronic issue of load-shedding, the development projects under the CPEC helped create thousands of new employment opportunities for the Pakistani people which the people of Pakistan would never forget.\nRecalling the recent visit of Prime Minister Shehbaz Sharif to China, the deputy prime minister said both sides showed unanimity to execute the second phase of CPEC besides signing the modalities for third-party participation in the project.\nHe reiterated that Pakistan was committed to promoting people-to-people linkages as both countries stood with each other through thick and thin.\nDar said the CPEC constituted a vital pillar of the Pak-China economic and strategic partnership and that there was complete unanimity on its significance as it catalyzed Pakistan’s endeavors toward socioeconomic prosperity and regional connectivity.\nHe said as the two countries were witnessing a high-quality second phase of CPEC with both sides prioritizing the agriculture, information technology, industry and mining and mineral sectors.\nIn his remarks, Chinese Minister Liu Jianchao said the agreements signed during the “very successful” visit of Prime Minister Shehbaz SHarif provided an opportunity for the two countries to upgrade their ties to bring about desirable changes.\nHe said the determination of both countries’ leaderships sent a clear message to the world that the China-Pakistan friendship was unbreakable.\nHe said Pakistan’s government introduced 5Es to focus on five key areas presenting an important opportunity for two peoples to work together to promote the community of shared destiny.\nCalling party-to-party relations an integral part of bilateral relations, it was high time the parties contributed their wisdom to turn the blueprint into reality by understanding each other’s development philosophy.\nHe said the affinity between the two peoples was not commensurate with the iron-clad nature of friendship and announced that IDCPC would invite 300 Pakistani parliamentarians to China in three years besides providing scholarships and vocational training to Pakistani youth.\nHighlighting the adverse impacts of Western social media on the young generation regarding bilateral relationships, he said China would also invite people from media on a yearly basis to better understand each other.\nAddressing the JCM, Chairman Senate Syed Yousuf Raza Gilani said all the political parties were committed to CPEC as it promoted collaboration in health, education, information technology and other sectors besides its contribution to addressing the power woes of the country.\nHe urged both sides to work together for a green and resilient future besides strengthening partnership in education and tourism sectors.\nNational Assembly Speaker Ayaz Sadiq said the Parliamentary Committee on CPEC ensured vigilant oversight of the government and followed up on the progress of the projects under CPEC through regular reporting to the Parliament of Pakistan.\nHe reaffirmed the resolve of the parliament, government, and people of Pakistan to build on past successes and in ensuring that CPEC reaches its full potential.\nPlanning Minister Ahsan Iqbal said that despite political differences, all the political parties stood unanimous when it comes to China and CPEC, and were committed to revitalise the upgraded version.\nHe said China came to rescue Pakistan when it faced around 18 hours of load-shedding and no investor was ready to invest in the country.\nThe minister thanked China for the inclusion of new corridors in the CPEC which were aligned with the 5Es introduced by the incumbent government.\nJUI-Chief Maulana Fazlur Rehman expressed gratitude to the Chinese leadership for their unconditional support of the Kashmir cause and reiterated Pakistan’s support on the Taiwan issue. Similarly, both countries had unanimity of views on multiple regional and regional issues, he said, and also called for completion of delayed CPEC projects.\nMinister for Federal Education Khalid Maqbool Siddiqui and Munazza Hassan called for an enhanced focus on education, information technology and artificial intelligence to harness the youth’s potential.\nSyed Ali Zafar called for accelerating CPEC projects while Chairman of Pakistan-China Institute Mushahid Hussain Sayed reiterated the political parties’s commitment to take the CPEC-II forward. He also proposed the formation of rapid response information system to counter the fake news aimed at undermining the CPEC and Pak-China relationship.\nNational Party’s Senator Jan Muhammad called for technical training of Balochistan’s youth, while Afrasiab Khattak cautioned against the designs of the hegemonic forces in the region trying to disrupt peace.\nThis followed an interactive session marking the suggestions by the participating leaders with the majority emphasizing a greater focus on the parliamentary exchanges to boost people-to-people linkages.",
  "retrievedAt": "2025-08-11T03:22:49.150Z"
}
