{
  "title": "Pak-China friendship vital for peace, development of both countries & region: PM",
  "link": "https://www.app.com.pk/national/pak-china-friendship-vital-for-peace-development-of-both-countries-region-pm/",
  "date_published": "2024-06-21T17:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):Prime Minister Muhammad Shehbaz Sharif on Friday said that the Pakistan-China friendship was indispensable for peace and development of both the countries as well as the region and beyond.\nEmphasizing on historic and unique significance of bilateral relations between the two countries, the prime minister reaffirmed that the Pakistan-China friendship was time-tested and enduring.\nHe was talking to Minister of International Department of the Communist Party of China (IDCPC) Liu Jianchao who along with a delegation called on him at the PM House.\nWhile welcoming the Chinese dignitary and members of his delegation to Pakistan, the prime minister congratulated him as well as political leaders of Pakistan on the successful organization of Pakistan-China Political Parties Forum and the 3rd round of Joint Consultative Mechanism (JCM) of Political Parties on China Pakistan Economic Corridor (CPEC).\nHe said it was a matter of great satisfaction that there was complete political consensus in both countries on the China-Pakistan Economic Corridor.\nReflecting on his recent visit to China where he held fruitful and productive meetings with President Xi Jinping and Premier Li Qiang, the prime minister commended the vision of the Chinese leadership for the continued growth of Pakistan-China strategic relations and the shared desire of both countries to work together to ensure success of the CPEC and its upgradation to the next phase.\nHe underlined that early completion and implementation of all ongoing and new CPEC projects would contribute significantly towards Pakistan’s economic growth and inclusive development.\nAppreciating the role of IDCPC in the deepening of bilateral ties, he stressed the importance of enhanced exchanges between the political parties of two countries for experience-sharing, capacity building and people-centered governance.\nHe lauded the CPC for its full support to strengthening of China’s iron-clad brotherhood with Pakistan.\nLiu Jianchao, in his remarks, stressed that Pakistan and China were iron brothers, strategic partners and most-trusted friends.\nHe further emphasized that China accorded a special place to Pakistan in its foreign policy and would continue to support Pakistan’s economic development and jointly work for the upgraded version of CPEC.\nThe prime minister hosted a banquet in honour of Liu Jianchao and the accompanying Chinese delegation which was also attended by representatives of major political parties.\nThe prime minister also briefed the Chinese delegation about the Special Investment Facilitation Council (SIFC) which was established through a “Whole of the Government” approach with an objective to attract investment in key areas and has evolved into a useful forum offering one-window facility to domestic and foreign investors.\nDeputy Prime Minister and Foreign Minister Muhammad Ishaq Dar, Chief of the Army Staff General Syed Aim Munir, Federal Ministers for Finance, Interior, Planning, Petroleum, Power, Privatization, Information, MOS for IT, SAPM Tariq Fatemi and senior officials attended. Chinese Ambassador to Pakistan H.E. Mr. Jiang Zaidong and senior officials of the International Department of the Communist Party of China also attended the meeting.",
  "retrievedAt": "2025-08-11T03:22:23.069Z"
}
