{
  "title": "70 % approved schemes part of Balochistan PSDP: Bugti",
  "link": "https://www.app.com.pk/national/70-approved-schemes-part-of-balochistan-psdp-bugti/",
  "date_published": "2024-06-21T17:55:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jun 21 (APP): For the first time in Balochistan’s history, the provincial Public Sector Development Programme (PSDP) for the fiscal year 2024–2025 includes 70% of approved uplift schemes.\n“About 70% of approved schemes are included in the provincial PSDP in an effort to enhance good governance, and 100% of schemes will be included by the following year,” Chief Minister Balochistan stated on Friday,\n“Our goal this time is to spend 70 to 80% of the PSDP as the utilisation rate of development budget money has been relatively low in the past,” he said while talking to the media outside the Balochistan Assembly premises following the budget session.\nThe chief minister mentioned that the provincial coalition administration had set a target of 70 percent for spending money on PSDP projects as in the past, the ratio of money spent on PSDP had been extremely low.\nHe said, “There would be a healthy competition among lawmakers, the bureaucracy, and other parties concerned for the timely completion of the development schemes.”\nCM Bugti also issued a warning, stating that development funding would be transferred from those PSDP schemes that were not meeting expectations to those that were moving quickly.\n“The parliamentarians have been asked to remain in their respective constituencies and monitor the pace of uplift schemes,” he added.\nAbout the budget for the year 2024-25, the chief minister said after a long time, a Balochistan Government had presented its surplus budget, credit for which went to the coalition partners.\nHe emphasized the importance given to the sectors of health and education, with education being prioritized first, health second, and climate change third.\nHe pointed out that it was not just difficult but impossible to develop 43% of Pakistan’s area with a limited budget, and that the province’s development and prosperity could not occur without the support of the Federal Government.\nIn the battle against terrorism, Bugti emphasized that the police and Levies were fighting on the front lines, and attempts were being made to match their pay with the Punjab police.\nTo a question, Chief Minister Bugti said that the PPL owed over Rs 50 billion in gas development surcharge and that attempts would be made to contest the case politely.\nHe expressed gratitude to his team, the coalition partners, and the Department of Finance for their collaboration on the budget while also acknowledging the numerous problems and difficulties facing the province.",
  "retrievedAt": "2025-08-11T03:22:21.861Z"
}
