{
  "title": "Turkish doctor offers free consultation to patients in Lahore",
  "link": "https://www.app.com.pk/national/turkish-doctor-offers-free-consultation-to-patients-in-lahore/",
  "date_published": "2022-01-17T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):On a two-day visit to Lahore, Professor Dr Muge Gundogdu, a Turkish haematologist-oncologist, assessed thalassemia and cancer patients.\nDr Muge Gundogdu, a paediatric haematology and oncology specialist of Memorial Bahçelievler Hospital in Istanbul, has visited Lahore and examined patients with thalassemia, cancer, haemophilia and sickle cell anemia at a local hotel.\nThe Turkish specialist, conducted free medical checkups for patients suffering from severe diseases. She shared her medical experiences with the Pakistani doctors, who are treating children suffering from thalassemia and other blood disorders. Patients who reached there in the camp said that they were enabled with the best facilities of checkup throughout the camp duration.\nDr Gundogdu praised Pakistan as a friendly country and hailed the friendship between Pakistan and Turkey. After medical examination, she shared her experience that most of the patients need to undergo bone marrow transplantation and Pakistan needs to establish a bank for bone marrow transplantation for those patients who do not have donors. Due to cousin marriages, there are a large number of thalassemia major patients here and in Turkey. Pakistani government needs to formulate a policy for cousin marriages besides making it mandatory to undergo screening before marriage.\nProf. Müge Gündogdu is a renowned hematologist-oncologist, having 15 years of experience in the field. According to Royal Healthcare magazine she conducted more than 500 successful surgeries of paediatric bone marrow transplantation with a success rate of over 90 percent.\nAccording to Pakistan Bait-Ul-Mal official page, approximately 100,000 patients are suffering from Thalassemia in Pakistan and every year 5,000 babies are born with this deadly disease. These patients needs regular blood transfusion and iron chelation after consultation with a qualified Hematologist along with regular diagnostic investigations on monthly basis which is unaffordable by the poor families in Pakistan.",
  "retrievedAt": "2025-08-11T14:08:08.427Z"
}
