{
  "title": "PM stresses upon efforts to embody principles of Riyasat-i-Madina",
  "link": "https://www.app.com.pk/national/pm-stresses-upon-efforts-to-embody-principles-of-riyasat-i-madina/",
  "date_published": "2022-01-17T06:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): Prime Minister Imran Khan Monday stressed upon continuous struggle to embody as a nation and state the principles of Riyasat-i-Madina as laid by the Holy Prophet (Peace Be Upon Him).\nThe prime minister on his twitter handle posted his article published in English daily, the Express Tribune, titled “Spirit of Riyasat-i-Madina: transforming Pakistan”.\n“Explaining guiding principles of Riyasat-i-Madina as laid down by our Prophet PBUH creating the foundation of the greatest civilisation of all times. In Pak, to realize our potential today we have to struggle to embody these principles as a nation & state,” the prime minister tweeted.\nWhile elaborating his point of view on the guiding principles of state of Madina, the prime minister reiterated that the most urgent of all challenges facing the country right now was the struggle to establish the rule of law.\n“Over the last 75 years of Pakistan’s history, our country has suffered from elite capture, where powerful and crooked politicians, cartels and mafias have become accustomed to being above the law in order to protect their privileges gained through a corrupt system,” he added.\nThe prime minister said while protecting their privileges they had corrupted state institutions, especially those that were responsible for upholding the rule of law.\n“Such individuals, cartels and mafias are parasites that are not loyal to our country and defeating them is absolutely necessary in order to unleash the real potential of Pakistan,” he emphasized.\nAccording to prime minister’s views expressed in his piece of writing the core of every civilization was its spiritual principles; when they died, the civilization died.\n“In Islamic civilization, the manifestation of our spiritual principles happened in the Prophet’s (SAW) Madina. Besides many other important principles, there were five very important guiding principles upon which the state of Madina was built. These principles are unity, justice and rule of law leading to meritocracy, strong moral and ethical foundation, inclusion of all humans in progress and prosperity, and finally, the quest for knowledge,” he added.\nThe prime minister said to help revive the spirit of the covenant of Madina, National Rahmatul Lil ‘Alamin Authority (NRA) has been formed.\nThe first principle which laid the foundation for Riyasat-i-Madina was of unity.\n“Remember that our Prophet (SAW), who was mercy for all mankind, unified people of diverse ethnic and religious backgrounds into a single community. Besides Muslims, there were Christians, Jews, Sabeans and other groups who were all woven into a unitary communal whole under the state of Madina,” he added.\nHe said the second founding principle was rule of Law which resulted in justice and meritocracy.\nThe Prophet (SAW) made it clear that no one was above the law. The Prophet (PBUH) said that nations perished when two sets of laws existed, one for the rich and another for the poor, the prime minister added.\nIf one looked at the world today, the prime minister said one could easily witness that most successful states also had the most robust application of the rule of law.\n“Besides several Western nations, one witnesses that those East Asian economies that have recently prospered, strictly practised this principle. Japan, China and South Korea are good examples,” he said.\nWhereas those nations where rule of law was subverted, the prime minister said, seemed to be sinking into poverty and chaos.\n“In many countries of the Muslim world, despite the prevalence of tremendous resources, there is less progress, which is attributable to lack of rule of law,” he opined.\nThe prime minister further said that another good example was South Asia.\nIn today’s India, the apartheid rule of law has immediately brought about poverty and countless insurgencies that threaten the union of their country, he added.\nThe prime minister reiterated, “In Pakistan, not adhering to the rule of law has led to siphoning off of billions of US dollars which has imposed collective poverty on our public. The pattern of politics and development in many countries of Africa and Latin American suggest the same. The so-called banana republics are the way they are because of lack of rule of law. This cause and effect relationship between rule of law and socio-political harmony cannot be emphasized enough”.\nHe said the third founding principle of Riyasat-i-Madina was of an ethical and moral transformation of the people – the concept of Amr-bil-maroof-wa-nahi-anil-munkar (doing good, forbidding evil).\nNobody would dispute this principle, he said, but there were elements in the society that were of the opinion that ethical development of people should be left to the people, the state should remain neutral about good and evil as conceived by religion.\nThis approach is quite outmoded and problematic because it handcuffs the state from performing its ethical and moral duties and allowed adversaries of the country to come in with handfuls of money and subverted the values using the educational systems and channels of information, he observed.\nThe prime minister said the fourth founding principle was of inclusive development through creation of a welfare state where society took care of its poor and vulnerable and everyone was a stakeholder in the development of society and state.\nState of medina was the first recorded welfare state of mankind where the state took responsibility of its weak, he added.\n“Since we must emulate the example of our blessed Prophet (SAW), our citizens should learn to be strict with themselves and generous with others,” he added.\nThe prime minister further said a knowledge-based society that did not confound literacy with knowledge.\n“Literacy may lead to illuminative knowledge that may guide us to good behavior, but some of the highest crime zones of the world also have very high literacy rates. One must not lose sight of an important historical fact that nearly all scholars of early and medieval Islam had deep roots in spirituality,” he added.\nKnowledge with spiritual transformation from cradle to grave was important, he said, adding  all sources that impacted human behavior should disseminate knowledge which produces self-control, self-discipline, patience, forbearance, tolerance and a spirit of service and volunteerism.\nThe prime minister also enumerated the initiative launched by his government to embark on the road to the welfare state.\n“Despite tight financial means, we allocated unprecedented amount of money to our initiatives such as the Ehsaas Program which was launched back in 2019. Ehsaas Program is a social safety and poverty alleviation program necessary for the vulnerable groups in society.\nHe said it was one of their key initiatives towards building a state that cared about the welfare of the citizens.\nBy far, one of the greatest programs in history of Pakistan was the Sehat Sahulat Programme which offered the citizens universal health coverage, he added.\nThe Punjab government alone had allocated Rs400 billion for this.\n“The Sehat Sahulat Program was an important milestone towards our social welfare reforms. It makes sure that certain low-income groups in Pakistan may have access to their entitled medical health care quickly and honorably without accruing many financial obligations,” he noted.\nHe said “In the wake of global economic hardship brought about in the post-Covid era, we have not neglected the fast transforming educational arena.\nOur Ehsaas scholarship program would ensure that talented students within the underprivileged and poor strata of society would get a chance to pursue decent education that would augment their chances of getting better livelihoods.\nThis program combined with all our other scholarships amounts to six million scholarships worth Rs47 billion. This too is unprecedented in the educational history of Pakistan.”",
  "retrievedAt": "2025-08-11T14:08:13.701Z"
}
