{
  "title": "Investment in Tech sector vital for youth employment, national economy: PM",
  "link": "https://www.app.com.pk/national/investment-in-tech-sector-vital-for-youth-employment-national-economy-pm/",
  "date_published": "2022-01-17T12:25:00.000Z",
  "source": "APP",
  "content": "HARIPUR, Jan 17 (APP): Prime Minister Imran Khan Monday said that the investment in technology sector was vital to create employment for the youth as well as improve the national economy.\n“The future is technology. The Special Technology Zone is a complete ecosystem. The provincial government generated resources for the project which will have a positive impact on next generations,” the prime minister said addressing the groundbreaking ceremony of Pakistan Digital City Special Technology Zone here.\nThe flagship project of the Khyber Pakhtunkhwa government would be established on 86 kanals of land and would cost Rs 1.31 billion.\nA large number of IT and allied technologies including electronics, computers and mobile phones, software houses and technology incubators would largely benefit from the project that would would boost the allied industries and generate hundreds of thousands of jobs for the youths.\nThe prime minster, who earlier kicked off work on the project, lauded Dr Attaur Rehman and former KP Chief Minister Pervaiz Khattak for taking the initiatives which he said would have far reaching impact on the provincial development.\nHe said after coming into power in 2013, it was the KP government that had introduced health insurance facility for the low-income people of the province despite financial constraints.\nMoreover, it was also the PTI government that raised the issues of climate change, forestation, institution building and tourism.\nThe prime minister also appreciated Dr Attaur Rehman for his support to establish Pak-Austria Fachhochschule Institute of Applied Sciences and Technology in Haripur which would have positive impact on next generations.\nHe said in the past, England had established two top class universities which provided leadership to the world for long.\nThe prime minister said the previous governments never focused on education sector and instead brought about three-tier education system which promoted three cultures and left negative impact on the society.\nHe said for the first time, the incumbent government introduced core curriculum for up to class 5 which would be expanded to upper level to make the country a nation.\nCalling for exploitation of the potential of young population, the prime minister reiterated that investment in technology sector would benefit the country.\nHe said in the past, the highly educated youths remained unemployed as the institutions had no connection with the market; however the projects like the STZs would open up new avenues for employment.\nHe told the gathering that the government removed impediments in the technology sector which took the growth to 45% and was expected to touch 75% mark this year.\nHe said the promotion of technology never had been a priority of the previous governments and appreciated the far-sightedness of Dr Attaur Rehman for establishing a quality institute with the Austrian support. He hoped that the STZ and the university would feed each other.\nThe prime minister, who earlier distributed licenses among the representatives of the companies aspiring to do business at the STZ, said as the government was making record revenue collection, it would accordingly enhance its investment on education and health sectors.\nThe project would serve as hub of high technologies including IT and allied services by providing state-of-the art facilities to people, experts and investors under one roof and enable collaborations and innovation among academia, research, industry and planners from within the country and abroad.\nThe digital city would help ensure speedy economic growth, promote IT and allied technologies, enhances skills of youth and generate hundreds of thousands of employment opportunities for the people.\nFederal and provincial ministers, parliamentarians and officials attended the ceremony.",
  "retrievedAt": "2025-08-11T14:07:51.446Z"
}
