{
  "title": "PM assures govt’s support for safety, facilitation of int’l mountaineers",
  "author": null,
  "content": "ISLAMABAD, Jul 10 (APP): Prime Minister Shehbaz Sharif on Thursday highlighting Pakistan as a premier destination for mountaineers and adventure seekers, reaffirmed his government’s continued support for international mountaineers, assuring them of all necessary facilitation, safety, and hospitality.\nThe prime minister, in a meeting with Sheikha Asma Al Thani, the first Qatari woman to summit Nanga Parbat, said that Pakistan was immensely proud of being home to five of the world’s fourteen highest peaks.\nThe prime minister welcomed Sheikha Asma Al Thani, the pioneering Qatari mountaineer, and congratulated her on becoming the first woman in Gulf and Qatar to successfully summit Nanga Parbat, the formidable “Killer Mountain” of Pakistan.\nHe lauded Sheikha Asma’s remarkable courage, resilience, and determination in achieving this significant milestone and commended her for being a source of inspiration for women and young girls across the world, especially in promoting gender empowerment through adventure and high-altitude sports.\nIn recognition of her achievement and commitment to showcasing Pakistan’s natural beauty, Prime Minister Shehbaz formally appointed Sheikha Asma Al Thani as a Brand Ambassador for Pakistan’s Mountains and Tourism.\nHe also thanked the Qatari mountaineer for choosing Pakistan’s majestic mountains and for playing a valuable role in bringing international attention to their challenges and scenic grandeur.\nThe prime minister also acknowledged the vital contributions of Pakistani high-altitude porters and guides who assist climbers from around the world in their expeditions, noting that their skill and dedication were integral to such extraordinary accomplishments.\nUnderscoring the deep and friendly ties between Pakistan and Qatar, the prime minister stated that Sheikha Asma’s achievement was a reflection of the shared values of courage, ambition, and perseverance between the two nations.\nHe expressed interest in expanding bilateral cooperation in the fields of adventure tourism, sports, and youth engagement.\nPrime Minister Shehbaz also praised the active role the mountaineer has been playing as Vice President of Gender Equality Commission in the creation of equal opportunities.\nWishing her success in her ambition to climb all fourteen of the world’s 8,000-meter peaks, of which she has already climbed nine, the prime minister extended a heartfelt invitation to Sheikha Asma to return to Pakistan for future climbs and to further explore the country’s diverse and breathtaking landscapes.\nSheikha Asma Al Thani thanked the prime minister and the people of Pakistan for the warm hospitality extended to her during her visits.\nReminiscing about her recent climb of Nanga Parbat, she praised the support provided by the local porters and guides and also praised the beauty of the majestic mountain.\nShe regarded K2, another majestic peak that she has already scaled in the past, as the best mountain among the ones she had climbed and said that it was a “Complete Mountain” with its unparalleled beauty.\nThe prime minister conveyed his best wishes for Sheikha Asma Al Thani’s future endeavors and her ongoing efforts to inspire the global youth, especially women, to pursue their goals with determination.\nIshtiaq Ahmed, APP’s Foreign Editor, leads coverage of the Prime Minister, President and Foreign Office, bringing over 20 years of journalism experience from local and international publications – Reach out at 03335293238/ ishtiaqrao@gmail.com/ X: ishtiaqrao",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:26:54.899Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-assures-govts-support-for-safety-facilitation-of-intl-mountaineers/",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T08:15:00.000Z"
}
