{
  "title": "Chairman WAPDA reviews construction progress at Mohmand Dam Project",
  "author": null,
  "content": "ISLAMABAD, Jul 10 (APP): Chairman WAPDA Naveed Asghar Chaudhry on Thursday visited Mohmand Dam Hydropower Project being constructed across River Swat in Tribal District Mohmand of Khyber Pakhtunkhwa Province.\nMember Water Syed Ali Akhtar Shah also accompanied him. During the visit, the Chairman reviewed construction progress on various work fronts including spillway, powerhouse, main dam, diversion system and power intake, said a press release.\nThe Chairman noted it with satisfaction that WAPDA has started construction work on the main dam in May this year after completing several pre-requisites such as river diversion tunnels, upstream and downstream coffer dams, dam plinth and excavation of left and right abutments and dam foundations etc.\nThe GM/PD Mohmand Dam Hydropower Project, flanked by the Project Managers of the Consultants and the Contractors briefed the Chairman about progress on each work front. He was informed that construction work is being carried out simultaneously on 14 different sites. Construction of powerhouse building has also started; manufacturing of electro-mechanical equipment is at advanced stages, while construction work on the spillway is ahead of schedule. Mohmand Dam Hydropower Project is expected to commence electricity generation in 2027 following completion of the dam, the Chairman was briefed.\nHighlighting the importance of Mohmand Dam Hydropower Project for irrigated agriculture, flood mitigation and generation of affordable hydel electricity, the Chairman directed the Consultants and the Contractor to put in their maximum efforts for completion of the Project according to the schedule.\nIt is important to note that Mohmand Dam, with 213-meter height, is the 5th highest concrete faced-rock fill dam (CFRD) in the world. It has a gross water storage capacity of 1.29 MAF to irrigate 18,233 acres of new land in Mohmand and Charsadda, in addition to supplementing irrigation supplies to as many as 160,000 acres of existing command area of Lower Swat and Doaba Canals emanating from Munda Headworks. With installed power capacity of 800 MW, the Project will provide 2.86 billion units of green, clean and affordable hydel electricity to the National Grid every year. Mohmand Dam will not only mitigate the impact of floods for Peshawar, Charsadda and Nowshera but also provide 300 million gallons per day of drinking water to Peshawar.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:26:25.125Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chairman-wapda-reviews-construction-progress-at-mohmand-dam-project/",
  "dateList": "2025-07-10",
  "date_published": "2025-07-10T14:25:00.000Z"
}
