{
  "title": "USC automation to ease provision of subsidy on food essentials under Ehsaas Program: Khusro",
  "link": "https://www.app.com.pk/national/usc-automation-to-ease-provision-of-subsidy-on-food-essentials-under-ehsaas-program-khusro/",
  "date_published": "2021-11-08T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP):Federal Minister for Industries and Production Makhdum Khusro Bakhtyar, on Monday said the government would provide targeted subsidies at the Utility Stores for the Prime Minister Ehsaas program beneficiaries by linking their Ehsaas cards/CNIC with the sale points making them a targeted subsidy tool.\nHe said this while presided over the meeting on the progress of digitalization and automation program of Utility Store Cooperation (USC) under the Digital Pakistan Initiative, said a press release issued here.\nThe meeting was attended by Secretary Industries and Production, MD USC, senior officials of the Ministry and representative of PTCL and NRTC.\nManaging Director (MD) USC briefed the participants on digitalization program, encompassing it’s business process under ERP (enterprise resource planning), including supply chain, warehousing, financials, deployment of POS, human resources, and targeted subsidy which will be consummated by end of this month.\nHe also  informed the minister that USC had completed the automation of utility stores in Islamabad region, shifting 20 percent of total sales on automation which would be inaugurated in next week.\nThe minister appreciated the team of USC and remarked that the project would be the largest digitalization program of any public sector oriented company.\nHe informed that upon completion, the Prime Minister would inaugurate the automation program of USC, as Digital Pakistan’s vision was close to his heart.\nThe Minister also lauded the ongoing cooperation of Pakistan Tele Communication Limited and National Radio and Television Cooperation to work hand-in-hand with USC to carry out the automation program.",
  "retrievedAt": "2025-08-11T21:34:48.784Z"
}
