{
  "title": "Pakistan Navy’s first Type 054 A/P FRIGATE PNS TUGHRIL commissioned at China",
  "link": "https://www.app.com.pk/national/pakistan-navys-first-type-054-a-p-frigate-pns-tughril-commissioned-at-china/",
  "date_published": "2021-11-08T17:32:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 08 (APP):Pakistan Navy’s first Type 054A/P Frigate, PNS TUGHRIL has been commissioned at Hudong Zhonghua (HZ) Shipyard, China.\nAmbassador of Pakistan to China, Moin Ul Haq graced the occasion as Chief Guest, said a Pakistan Navy media release.   Speaking on the occasion, the Chief Guest underlined that commissioning of PNS TUGHRIL ushered a new chapter in Pak – China friendship that has matured through the tests of times and remained steadfast in all domains.\nHe added that in the context of overall security paradigm of the region, TUGHRIL Class Frigates would strengthen Pakistan Navy’s capabilities to respond to maritime challenges to ensure seaward defence, maintain peace, stability and balance of power in Indian Ocean Region.\nThe Ambassador also praised the concerted efforts made by CSSC, CSTC, CSDDC, HZ Shipyard and PLA (Navy) for the landmark achievement by timely delivery of the well-equipped and potent Frigate despite global pandemic.\nPNS TUGHRIL was first of four Type 054 Frigates being constructed for Pakistan Navy.   The Ship was a technologically advanced and highly capable Platform with enormous surface to surface, Surface to air and underwater fire power besides extensive surveillance potentials.\nThe Ship holds the capability to simultaneously execute number of naval warfare missions in a highly intense muliti-threat environment. PNS TUGHRIL is equipped with state-of-the-art Combat Management and Electronic Warfare system alongwith modern self-defence capabilities.\nThe Vice Party Secretary and Director of the Board CSSC Du Gang also applauded the timely construction of PNS TUGHRIL while emphasising that commissioning of ship is a major milestone and a testimony of Pak-China long–lived friendship; as both countries are bound by the affinity of trust, compassion and commonality.\nPresenting account of activities, the head of Pakistan Navy Mission while overseeing construction of 054A/P Frigate, Commodore Rashid Mehmood Sheikh highlighted that PNS TUGHRIL,  being a multi-mission capable Frigate, would form the mainstay of Pakistan Navy Fleet while bolstering Pakistan Navy’s maritime defence capabilities.\nThe ceremony was attended by high level dignitaries from BOMETEC, OIMC, SASTIND, PLA (N) and CSSC besides Chairman of CSTC & HZ Shipyard and Commander of PLA (N) Shanghai Naval Base alongwith prominent figures of Pakistan’s community in China",
  "retrievedAt": "2025-08-11T21:34:44.831Z"
}
