{
  "title": "More Occupation in the occupied Jammu and Kashmir – no let-up in Modi Frenzy",
  "link": "https://www.app.com.pk/national/more-occupation-in-the-occupied-jammu-and-kashmir-no-let-up-in-modi-frenzy/",
  "date_published": "2021-11-08T11:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): After the dismal failure of around a million fully-equipped military personnel who failed to bring ‘Normalcy and Vikas’ in Indian Illegally Occupied Jammu and Kashmir (IIOJK), the Indian government was forced to send more troops to crush the freedom struggle.\nBut this measure also means the occupation of more private lands and properties.\nThe Indian government had announced the deployment of additional 50 CRPF Companies in IIOJK, out of which 5 arrived in Srinagar last week. To accommodate the additional CRPF companies that arrived in the Indian occupied land last week, the authorities forcibly took over several private marriage and community halls, depriving the owners of these assets in violation of all norms and laws.\nWith the deployment of additional forces, the CRPF have occupied marriage halls in Shatrashahi, Illahi Bagh areas of Srinagar city and have also done recce in the Barbarshah, Nowshera and other areas, reported Weekly Magazine, the Kashmir Walla.\nThe occupation of these properties was made without consulting the local authorities.\n“The SMC [Srinagar Municipal Corporation] wasn’t consulted on this decision. These community halls are integral to social and community functions and are constructed in areas where people don’t have huge houses and lawns. They, hence, are a community necessity,” SMC Mayor Junaid Azim Mattu said as reported by Hindu.\nThe move, unimaginable in the civilized world, counters the self-proclamations of the existing Bhartiya Janata Party (BJP) about ‘normalcy, development and economic progress, which it had been repeatedly asserting after the unconstitutional abrogation of Article 370 and 35A on August 5, 2019.\nThis move has not only been criticized by the Hurriyat and Freedom-loving people of Kashmir, but the very people who have been supporting India to prolong its occupation have also criticized the move in strong terms.\nCPI (M) leader Muhammad Yousuf Tarigami, while addressing a press conference in Srinagar on Sunday said that taking over even marriage halls by the CRPF and coming up with new security bunkers across Kashmir has damaged the BJP government’s normalcy claims.\nPro-India National Conference (NC) Vice President Omar Abdullah said the security situation IIOJK had regressed to such an extent that community halls were being used as barracks for the ‘security forces’.\nLikewise, Peoples Democratic Party (PDP) President Mehbooba Mufti also lashed out at the government over the move and said every day more draconian laws were brought in with the sole purpose of suffocating people into silence.\nShe said, after constructing bunkers all across Srinagar city, the CRPF personnel have now occupied marriage halls, which was the only private space left for people here.\nThe occupation of marriage and community halls has also irked locals. “We live in a very congested area and to have a presence of CRPF in the locality will be uncomfortable for us to carry out our daily work,” Azi, a 50-year-old resident told local newspapers.",
  "retrievedAt": "2025-08-11T21:34:49.661Z"
}
