{
  "title": "Covid-19 claims 9 more lives, daily positive cases show declining: NCOC",
  "link": "https://www.app.com.pk/national/covid-19-claims-9-more-lives-daily-positive-cases-show-declining-ncoc/",
  "date_published": "2021-11-08T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP):The national tally of Covid-19 active cases on Monday was recorded 22,733 with 449 more people tested positive for the deadly virus and 517 people recovered from the disease during the last 24 hours.\nNine corona patients have died during the last 24 hours, all the deceased were under treatment in different hospitals, according to the latest update issued by the National Command and Operation Centre (NCOC).\nOut of the total nine deceased Covid-19 patients, two of them expired on ventilators. Most of the deaths occurred in Khyber Pakhtunkhwa (KP) followed by Punjab.\nThere were 1,235 Covid-19 infected patients under treatment in critical condition with three more admitted in past 24 hours in various Covid dedicated healthcare facilities of the country.\nThe national covid positivity ratio during the past 24 hours was recorded at 1.07 percent.\nThe maximum ventilators were occupied in four major cities including Islamabad 14 percent, Peshawar 17 percent, Lahore 15 percent, and Multan 17 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per the medical requirement of Covid patient) were also occupied in four major cities of Swabi 24 percent, Lahore19 percent, Sargodha 24 percent, and Multan 36 percent.\nAround 135 ventilators were occupied elsewhere in the country while no Covid affected person was on a ventilator in Azad Jammu and Kashmir (AJK), Balochistan, and Gilgit Baltistan (GB).\nSome 41,709 tests were conducted across the country on Sunday, including 14,001 in Sindh, 15,285 in Punjab, 9,487 in Khyber Pakhtunkhwa (KP), 2,297 in Islamabad Capital Territory (ICT), 272 in Balochistan, 244 Gilgit Baltistan (GB), and 123 in AJK.\nAround 1,225,880 people have recovered from the disease so far across the country making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,277,160 cases were detected that also included the perished, recovered, and under treatment Covid-19 patients so far, including AJK 34,495, Balochistan 33,338, GB 10,394, ICT 107,151, KP 178,643, Punjab 441,176 and Sindh 471,963.\nAbout 28,547 deaths were recorded in the country since the eruption of the contagion. Around 7,596 people perished in Sindh, one of them perished out of the hospital on Sunday.In Punjab, some 12,949 deaths occurred across the province due to Covid-19. Three of the infected people died out of the hospital in the past 24 hours.\nAs many as 5,774 people expired in KP, five of them died in hospitals on Sunday, 944 individuals died in ICT, 357 people died in Balochistan, 186 infected people perished in GB, and 741 people died in AJK.A total of 21,143,023 corona tests have been conducted so far, while 640 hospitals are equipped with Covid facilities across the country. Some 1,278 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:34:51.646Z"
}
