{
  "title": "Pakistan’s first eco-friendly plastic road to be open in F9 park Islamabad soon",
  "link": "https://www.app.com.pk/national/pakistans-first-eco-friendly-plastic-road-to-be-open-in-f9-park-islamabad-soon/",
  "date_published": "2021-11-08T07:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP):In an order to curb pollution, the Capital Development Authority in collaboration with private companies would soon complete the construction of Pakistan’s first-ever Eco-friendly one-kilometer plastic road in F-9 Park Islamabad, CDA Spokesperson Rana Shakeel Asghar said on Monday.\nTalking to a private news channel, he said the Plastic Road is one-kilo meters long and contains the recycled plastic equivalent of more than one million plastic cups.  It represents a significant step forward from traditional asphalt roads to future-proof plastic roads offering both performance and sustainability benefits, he added.\nHe said around 500 to 600 tonnes of municipal waste is collected in Islamabad on a daily basis, along with 150 to 200 tonnes of plastic waste.  By recycling the daily collected plastic in road build would significantly reduce the environmental pollution in the city, he added.\nHe further explained the project that after the trial project of F-9 the concept will not only be utilized in Islamabad but will also be replicated in other cities of the country and on major roads of the capital.\nReplying to a question, he said plastic utilization inroads will add to the longevity of roads by making them water-resistant and also increasing the resistance of roads to change in weather.\n“The same technology can also be used for construction of rural roads as it will enhance their quality as well as longevity, he said, adding, with this environment-friendly project, the roads will be a model project in durability, sustainability, and cost-effectiveness”.\nHe also hailed that the green Pakistan program is a great initiative of PTI govt and CDA has become part of this campaign where it was making its all-out efforts to contribute its part for planting more trees and initiating mega Eco-friendly projects.",
  "retrievedAt": "2025-08-11T21:34:53.203Z"
}
