{
  "title": "Foreign Secretary, OIC envoy discuss situation in Kashmir",
  "link": "https://www.app.com.pk/national/foreign-secretary-oic-envoy-discuss-situation-in-kashmir/",
  "date_published": "2021-11-08T14:57:00.000Z",
  "source": "APP",
  "content": "The OIC’s Assistant Secretary General (ASG) for Humanitarian Affairs Tarig Bakhit and other senior members of the OIC delegation were also present.\nWelcoming the special envoy, the foreign secretary underscored that the visit reaffirmed the OIC’s resolute support to the just struggle of the Kashmiri people for their inalienable right to self-determination. As a collective voice of the Islamic Ummah, this steadfast and principled position was a source of strength to the people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nOn the human rights situation in the IIOJK, the foreign secretary stressed that since its illegal and unilateral actions of 5 August 2019, India had denied all fundamental rights and freedoms to the Kashmiris, detained the legitimate Kashmiri leadership and killed, maimed and summarily executed and tortured Kashmiris on a mass scale. The COVID-19 pandemic had turned the dire situation into a grave humanitarian crisis.\nThe foreign secretary added that subsequent steps by India including the issuance of over 4.2 million domiciles to Indian citizens were meant to disenfranchise the Kashmiris and to turn the Muslim majority of the IIOJK into a Hindu dominated territory. These actions were in clear violation of the relevant UN Security Council resolutions and international law, including the 4th Geneva Convention.\nThe foreign secretary emphasized that the exclusionist policies being pursued by the RSS-BJP dispensation reflected their ideological agenda of establishing a Hindu Rashtra. This majoritarian outlook espoused suppressing all minority communities, especially the Muslims. It posed a serious threat to regional peace and stability, he added.\nThe foreign secretary stated that the Office of UN High Commissioner for Human Rights (OHCHR) had issued separate Kashmir reports in 2018 and 2019 and Pakistan had underlined that this reporting should continue. The foreign secretary handed over a copy of the dossier on the human rights violations by the Indian occupation forces in IIOJK unveiled by the Government of Pakistan on 12 September 2021.\nCommending the leading role of the OIC on the Jammu and Kashmir dispute, the foreign secretary noted that the OIC Contact Group on Jammu and Kashmir had convened four Ministerial meetings since the Indian actions of 5 August 2019. He welcomed the clear and unequivocal reaffirmation of the OIC’s principled stance on the Jammu and Kashmir dispute in the joint communique adopted by the Ministerial meeting of the OIC Contact Group on Jammu and Kashmir in New York, on 23 September 2021.\nThanking the foreign secretary for the detailed update of the situation in the IIOJK, the special envoy expressed OIC’s abiding solidarity and support to the legitimate Kashmiri struggle for their inalienable right to self-determination as enshrined in the relevant UN Security Council resolutions.\nThe OIC’s special envoy for Jammu and Kashmir is visiting Pakistan and the Azad Jammu and Kashmir from 7-12 November 2021 to undertake a first-hand assessment of the human rights and humanitarian situation in the IIOJK. He earlier visited the region in March 2020.",
  "retrievedAt": "2025-08-11T21:34:47.523Z"
}
