{
  "title": "President upholds Mohtasib’s decision against unjustifiable bills of IESCO",
  "link": "https://www.app.com.pk/national/president-upholds-mohtasibs-decision-against-unjustifiable-bills-of-iesco/",
  "date_published": "2021-11-08T15:46:00.000Z",
  "source": "APP",
  "content": "He rejected the appeal of IESCO on grounds of being incompetent and time barred along with the direction that the Agency (IESCO) had admitted itself that its staff and UBL Omni personnel were involved in the scam, severe punishment may be given when the scam is proved.\nAccording to the details of the case, the complainants Syed Ameer Hussain Shah, Waqar Hussain, Kousar Zaman Kiani, Muhammad Safdar Hayat, Sohail Ahmad and Mohammad Asghar Khan had contended that IESCO had served them unjust bills through arrears during the months of January and February of 2021 despite the fact that they had already paid the bills three years ago. Feeling aggrieved, the complainants approached the Wafaqi Mohtasib to seek redressal.\nAfter the perusal of record, it was revealed that the complainants paid the bills through UBL Omni and the payment transactions were also reflected as paid in the consumer data by the Power Information Technology Company (PITC).\nThe payment records of the concerned bank produced by IESCO showed that the complainants had already paid their bills but the bank had not sent the payments to the Agency. The Wafaqi Mohtasib in its original decision, dated 30.03.2021, had held that as the bank itself had failed to send the payments to IESCO, the complainants cannot be made liable since the matter of payments was between the concerned bank and IESCO.\nThe Ombudsman declared that it was not binding on the consumers to pay for the loss caused due to non-payment by the concerned bank nor could the consumers be held responsible for the omission/error/mistake and lapse on the part of the officials/staff of the IESCO. The Wafaqi Mohtasib, thus, ordered IESCO to withdraw the bills and take disciplinary action against the delinquent officers/officials under applicable laws and report compliance within 30 days.\nIESCO filed a review petition which was also rejected vide order dated 09.07.2021. While rejecting the review petition, the Federal Ombudsman noted that the agency’s arrangements were to receive bills through UBL Omni and as per Agency’s own stance, the staff of UBL Omni and IESCO were involved in embezzlement of the huge amount of electricity bills and the matter had been investigated by the FIA, besides being adjudicated by the Special Court.\nThe Ombudsman held IESCO responsible for maladministration and decided that the agency was not lawfully justified to recover the bills from the complainants which they had already paid three years ago.Subsequently, IESCO filed an instant representation with the President against the decision of the Wafaqi Mohtasib on 16.08.2021 i.e., beyond the statutory period of 30 days from the date of receipt of the original order dated 30.03.2021.\nPresident Dr Arif Alvi rejected the appeal on the grounds that the extant law does not empower the condonation of delay to entertain a representation which is time barred.\nHe also referred to the section 15 of the Federal Ombudsman Institutional Reforms Act, 2013 which provided that a case may be decided on the basis of the available record without giving the opportunity of personal hearing to the parties, and rejected the appeal as being incompetent and time barred.",
  "retrievedAt": "2025-08-11T21:34:46.634Z"
}
