{
  "title": "Sikh pilgrims await Modi govt to reopen Kartarpur Corridor ahead of Guru Nanak’s birthday",
  "link": "https://www.app.com.pk/national/sikh-pilgrims-await-modi-govt-to-reopen-kartarpur-corridor-ahead-of-guru-nanaks-birthday/",
  "date_published": "2021-11-08T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): As the birth anniversary of Sikhism founder Baba Guru Nanak is approaching, thousands of Sikhs pilgrims still await the reopening of Kartarpur Corridor by the Indian government as COVID-related restrictions have already been eased across the country.\nThe Corridor was inaugurated by Prime Minister Imran Khan on November 9, 2018 allowing visa-free access to Sikh pilgrims from India to visit their holy shrine.\nThe establishment of the Corridor reflected Pakistan’s continued commitment to facilitating Sikh pilgrims and was in line with the government’s efforts to promote religious tourism.\nThe Founder of Sikh Religion Baba Guru Nanak Dev Ji spent last 18 years of his life at Kartarpur. The Gurdwara is considered to be the most sacred shrine of Sikh religion.\nSince 1947, Sikh community of India and across the world was desirous of the access of the Gurdwara from India because it is just about 4-5 kilometers from Pakistan-India Border. Kartarpur Corridor is functioning under an MoU between Pakistan and India under which 5000 yatrees are allowed to enter from Indian side on daily basis\nHowever, the facility was closed down in March 2020 following the spread of COVID pandemic. With the improving COVID situation, the Sikh community, as well as the Government of Pakistan, have been repeatedly asking the Indian government to restore the facility.\n“On the visits for religious purposes, our position has been consistent, open and transparent. Despite a difficult relationship with India, Prime Minister Imran Khan went ahead with the opening of the Kartarpur Corridor, which reflected our continued commitment to facilitate Sikh pilgrims,” Foreign Office spokesperson said in a recent weekly press briefing.\nHe said Pakistan’s approach was also in line with the government’s efforts to promote religious tourism.\n“We expect India to reciprocate,” the spokesperson commented.\nHowever, as the birth anniversary of Sikhism founder closes, the perturbance of the Sikh pilgrims seems to be increasing who have been urging their government to restore the facility.\n“On Kartarpur, our policy has been very clear. We value the significance of this corridor and remain strongly committed to its functioning, and support its early reopening. We hope India would respond positively,” the spokesperson said.\nHowever, keeping up its gesture to facilitate the Sikh pilgrims, Pakistan is likely to allow around 3,000 Sikh pilgrims from across the world to participate in the birthday celebrations.\nA local media report quoted Sardar Amar Singh, Head of the Pakistan Sikh Gurdwara Prabandhak Committee, as saying “our government has reopened the corridor before as well but it seems like our Indian counterparts are bent on not letting us reunite with our families across the border.”\nAmar Singh is also overseeing the arrangements for the birth anniversary celebrations.\nThe media report also mentioned Sardar Jinderpal Singh, a resident of Amritsar, India, who had been trying for months to come to Pakistan to just get a glimpse of the Gurdwara but he has been consistently shunned.\n“I contact the Shiromani Committee and the immigration officials of Kartarpur Corridor regularly to inquire about the reopening. Not soon, is all I get in reply,” Jinderpal was quoted as saying.\nIn a recent briefing on Guru Nanak’s birthday celebrations, Deputy Secretary Shrines Imran Gondal said that on November 17, around 3,000 Sikh pilgrims would reach Pakistan through Wagha border. The main function will be held on November 19 at Nankana Sahib.\nAccording to the Indian daily, The Tribune, Deputy CM and Dera Baba Nanak MLA Sukhjinder Singh Randhawa had set up meetings with Home Ministry officials in Delhi where he intends to take up the “ill-conceived” rationale of keeping it closed when almost all religious places across the world have been thrown open to the public.”\nRecently sworn-in Indian Punjab Chief Minister Charanjit Singh Channi, in a meeting with Prime Minister Narendra Modi asked him to immediately reopen the corridor as there was now considerable improvement in the COVID situation. He said this step would go a long way to enable the devotees to pay their obeisance at Gurdwara Darbar Sahib in Kartarpur.\n“Government of India opens India for foreigners. Tourist visas from October 15 but #KartarpurCorridor remains closed from Indian side despite being already opened from Pakistan side and repeated calls for reopening by Sikh community from Punjab & India,” a senior Indian journalist Parmjeet Singh said on Twitter.\nAnother Twitter user Manpreet Singh, wrote on the social networking platform in Hindi that he had left 10 days left till the day of Guru Nanak’s entitlement. He also appealed the Indian Home Minister to at least allow the pilgrims travel to the shrine for at least three days.",
  "retrievedAt": "2025-08-11T21:34:47.617Z"
}
