{
  "title": "Women parliamentarians playing important role in legislation: PM",
  "link": "https://www.app.com.pk/national/women-parliamentarians-playing-important-role-in-legislation-pm/",
  "date_published": "2022-03-10T16:01:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 10 (APP): Prime Minister Imran Khan on Thursday said that women parliamentarians in the National and Provincial Assemblies were playing important role in legislation.\nHe said that contrary to the past practice of nepotism by the political parties, Pakistan Tehrik-e-Insaf (PTI) ensured meritocracy on reserved seats.\nThe Prime Minister expressed these views during his meetings here with the Members of Provincial Assembly (MPAs).\nThe meeting, besides, the women and minorities’ MPAs elected on reserved seats, was also attended by Federal Ministers Makhdoom Shah Mahmood Qureshi, Asad Umar, Shafqat Mehmood, Makhdoom Khusro Bakhtiar, Hammad Azhar, Minister of State Farrukh Habib, Chief Minister Punjab Sardar Usman Buzdar and Spokesman for CM Hassan Khawar.\nThe Prime Minister said that the government, which inherited a bankrupt economy, owing to its successful policies gave economic stabilization to the country, and the economy was now moving towards sustainable growth.\nHe further said that the government’s policies during the COVID-19 pandemic were also recognized by the whole world.\nParticipants of the meeting apprised the Prime Minister of people’s appreciation of the government’s measures in Punjab and progress of ongoing development projects in the province.\nMPAs belonging to minorities appreciated the Prime Minister and Chief Minister for taking measures to protect the rights of minorities in Punjab.\nWomen MPAs, who met the Prime Minister included Yasmeen Rashid, Sadiqa Sahibdad Khan, Shamsa Ali, Nasreen Tariq, Shawana Bashir, Shamim Aftab, Firdous Rana, Shahida Ahmad, Sumaira Ahmad, Aysha Iqbal, Neelum Hayat Malik, Umul Banin Ali, Musarrat Jamshed, Saadia Suhail Rana, Rasheeda Khanam, Farhat Farooq, Sania Kamran, Talat Fatima Naqvi, Shaheena Karim, Aasia Amjad, Seemabia Tahir, Momina Waheed, Aysha Nawaz, Zainab Umair, Farah Agha, Saeeda Farah Uzma, Sajida Begum, Sajida Naveed, Sabeen Gul Khan, Sabrina Javed and Abida Bibi.\nMPAs belonging to minorities included Haroon Imran Gul, Ejaz Alam Augustine, Mahinder Pall Singh and Youdester Chohan.",
  "retrievedAt": "2025-08-11T14:30:32.993Z"
}
