{
  "title": "Opposition to face embarrassing defeat in no confidence move: Murad Saeed",
  "link": "https://www.app.com.pk/national/opposition-to-face-embarrassing-defeat-in-no-confidence-move-murad-saeed/",
  "date_published": "2022-03-10T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP):Federal Minister for Communications and Postal Services Murad Saeed on Thursday said that Opposition parties would not only face an embarrassing defeat in no confidence move but their negativism would be exposed.\nAddressing a press conference, he said that Pakistan Tehreek-e-Insaf (PTI) has defeated negative politics of the Opposition on every front. He said that PTI government sailed through all tests in the parliament including legislation pertaining to Financial Action Task Force in the Parliament.\nPTI also defeated the Opposition parties in Gilgit-Baltistan and Azad Jammu Kashmir recent elections, he said while reacting to the Opposition leaders’ statements.\nThe minister said that government was pursuing an independent and dignified foreign policy by saying absolutely not to joining any war of others. He said that speeches of the Opposition leaders had also become “jokes”.\nHe said that the earlier relief package announced by government has put the Opposition in a fix as they have made a practice of criticizing the people friendly government for the sake of criticism. Now the Opposition’s narrative was changed and saying that why Prime Minister spoke for the sovereignty of the country.\nMurad Saeed said that they were criticizing the government on reduction in oil and electricity prices instead of commending the initiative. Now they are criticizing government for an independent and dignified foreign policy, he expressed and added, Pakistan will be a friend not a slave of any other country.\nHe said, PML (N) leader Shahbaz Sharif has to answer how an account was opened in his peon Maqsood’s name and 1,600 coror reached to the the accounts of Sharif family through his account.\nMurad Saeed said that the world witnessed the moment when the message of Islam resounded at the United Nations’ General Assembly session. He said that Prime Minister Imran Khan had informed the world about the pain of Muslims being inflicted in the name of freedom of expression.\nThe minister said that nation was asking why these politicians were silent when Islam was being linked to terrorism through an organized campaign.\nMurad Saeed said “We sacrificed 80,000 lives in war on terror but the blame was putted on our shoulders. Why are you silent? all the former rulers except Prime Minister Imran Khan remained silent on the blasphemous sketches”.\nHe said that those who beg for power from the outer world have bowed heads and could not fight the case of their nations at the international forums.\nHe said that former prime minister Nawaz Sharif had denied meeting with Hurriyat Conference leadership during his visit to India. He said that former president during his visit to USA agreed for more drone attacks in Pakistan.\nMurad Saeed said that eight Opposition members have agreed to support Prime Minister Imran Khan in no confidence motion. Thanking all the eight members, the minister said that they have decided to support Prime Minister Imran Khan due to his bold and independent foreign policies.\nHe said that after defeat in no confidence move, the Opposition parties would scatter and wind-up forever.",
  "retrievedAt": "2025-08-11T14:30:27.255Z"
}
