{
  "title": "Enhanced leadership conversation for climate action need of hour: SAPM Malik Amin",
  "link": "https://www.app.com.pk/national/enhanced-leadership-conversation-for-climate-action-need-of-hour-sapm-malik-amin/",
  "date_published": "2022-03-10T13:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): Special Assistant to Prime Minister on Climate Change Malik Amin Aslam on Thursday said at a time when the global community is faced with climate crisis, tapping potential  leadership conversation is key to sustainable production and consumption lifestyle for achieving environmental sustainability.\nHe highlighted that soaring climate-altering carbon emissions in rich nations over recent decades continue to exacerbate the situation of untamed climate crisis, leading to devastating impacts on socio-economic sectors, particularly water, agriculture, energy and health sectors.\n“For this boosting concept of leadership conversation roles regarding environmental sustainability and climate action is key.” “However, rich nations need to show robust climate leadership role through enhanced conversation on the climate issues, so as to protect the global community from fallouts of the climate crisis through evidence-based environmental conservation and protection measures,” the PM’s aide stressed while addressing a high-level Pakistan Leadership Conversation -2022 event.\nThe event was organised here at a local hotel in partnership with the climate change ministry by the Association of Chartered Certified Accountants, a global professional accounting body offering the Chartered Certified Accountant qualification worldwide.\nHe informed the participants from top key corporate and government sectors that the Prime Minister Imran Khan’s government has already launched efforts for boosting climate agenda through conversation at various forums and climate leadership role through various world-acclaimed green initiatives as a part of global climate action direly needed to protect lives and livelihoods of the people from adverse impacts of the climate crisis, particularly those living in climate-vulnerable areas.\n“To plug the climate action gaps in particularly our part of the world, which is extremely vulnerable climate change impacts, we need to produce leaders who converse out climate solutions by introducing courses for managers in various socio-economic sectors to promote environmental conversation concepts at their organizational levels,” This can be achieved through enhanced understanding among the youth about climate change impacts on lives and livelihoods of the communities, ecosystems and biodiversity that feed the world, Malik Amin suggested.\nEducating those with limited experience and engaging them with issues on climate change and its impacts on ecosystem services and biodiversity, enabling them with skills to assess the climate change related issues relevant to their work in various socio-economic sectors is of paramount importance for the future conservation and climate action.\nSo that, they would effectively identify needs and then evaluate-appropriate responses to the climate crisis and its impacts. Referring to global studies, he said that the UN’s Intergovernmental Panel on Climate Change (IPCC) in its reports had projected that the world has less than ten years to stave off locking in a future of catastrophic consequences.\nHowever, this signifies the need for producing and climate leaders at not only national and international levels but also local levels, Malik Amin maintained.   For instance, Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services (IPBES) projects the extinction of a million species in the next few decades, which will be accelerated by climate change, he added.\nHe warned that the next decade was critical if we are to change our current trajectory in relation to the climate and biodiversity crisis for the sake of the planet earth’s sustainability. The PM’s aide Malik Amin emphasised the role of business in boosting climate response through conservation policies and programs.\n“Adopting sustainable production means is central to the sustainability of the businesses itself, which can be achieved through tapping renewable energy and using production means in an environmental-friendly way,” he suggested.\nReferring to last year’s UN-supported annual global climate conference held in Glasgow, Malik Amin Aslam informed the participants that business leaders travelled to Glasgow in record numbers to ensure their voice and actions would be heard for their effective response to global climate crisis.\nMany of them also showed set science-based targets aligned with efforts to limit global temperature rise to 1.5ºC to slow down climate change, but others informed the session of the conference that they were starting their journey to net-zero as a part of the global conservation and climate actions.\nWhile sharing with the participants details of the green and clean Pakistan initiatives launched under the Prime Minister’s Imran Khan’s vision for Clean and Green Pakistan, Malik Amin Aslam said that the climate change ministry has kicked-off several flagship program and projects including the world’s largest afforestation program of 10 Billion Tree Tsunami Program, Clean Green Pakistan Program, Protected Areas Initiative, Plastic-Free Pakistan Initiative, Recharge Pakistan Initiative as a part of the country’s efforts to achieve environmental sustainability and climate resilience through conservation and protection of environment, forests and wildlife, wherein community and youth engagements are being assigned the top priority.\nTalking about the country’s net-zero approach, he said, “In Pakistan, we don’t believe in the net-zero concept at present.” Instead, we believe in the concept of a decisive decade in the next 10 years. If the world does not change in the next 10 years, then we’ll be too late for any net zeros in 2050, 2060 or 2070. I believe that net zero if it translates into real action in the next decade is good, but most of these announcements are just announcements, Malik Amin added.\nHe explained further that the country has done something otherwise, a very strong paradigm shift [is] unfolding in the next 10 years – going 60 percent zero carbon [in energy production] by 2030; clean transport, going 30 percent electric by 2030; and massively investing in nature protection through green initiatives. “We have the Ten Billion Tree Tsunami, which is already going on; 15 new national parks being declared in the last year alone; Recharge Pakistan program, using flood waters for restoring our wetlands and managing and adapting to climate change,” the PM’s aide highlighted.\n“In fact, we also aim to boost further the momentum for these nature protection and conservation initiatives in the coming ten years. He recalled that the last decade had been a decade of disappointment on climate change as far as global climate response is concerned, only exacerbating the adverse impacts of climate change. “However, the next decade must has to be the decade of climate action.\nIf that doesn’t happen, net zero doesn’t matter,” he clarified. For this, promoting leadership conversation concepts on ways and means of achieving environmental sustainability was of unprecedented importance, he reiterated.",
  "retrievedAt": "2025-08-11T14:30:38.612Z"
}
