{
  "title": "JUI-F’s militia creates scene in Capital by attacking Parliament Lodges",
  "link": "https://www.app.com.pk/national/jui-fs-militia-creates-scene-in-capital-by-attacking-parliament-lodges/",
  "date_published": "2022-03-10T18:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): Members of the Ansar-ul-Islam, a banned uniformed militia of Jamiat Ulema-e-Islam (JUI-F) on Thursday made a forced entry in the Parliament Lodges, brawling with the police personnel and other staffers deputed for the security of legislators and their families residing there.\nThe ICT Police came into action after failure of hours long negotiations with the JUI-F leaders, who tried to stop them from vacating the premises of the Parliament Lodges from the trespassers.\nDuring the operation, the police took several members of the JUI-F militia into custody with opposition parties parliamentarians attempted to create a drama by twisting the situation in the media. An Islamabad Capital Territory (ICT) Police, in a tweet, clarified that Members of the National Assembly (MNAs) Salahuddin Ayubi and Jamaluddin were not arrested.\nThe two MNAs had reached the police station on their own to manouevre the situation, Minister for Interior Sheikh Rasheed Ahmad said while rejecting the claims of opposition parties about their arrest at a press conference. He said only 19 members of the militia had been taken into custody.\nThe minister said the opposition parties had created the drama to get political mileage as they knew that their no-trust move against Prime Minister Imran Khan was destined to fail. Sheikh Rasheed warned of strict action if anybody tried to take the law into hand.\n“No one is allowed to have a private militia as this is not the Banana Republic, and the law will definitely take its course against the violators.” He assured the parliamentarians of all political parties of foolproof security during their stay in the Federal Capital. Earlier, talking to a private news channel, Sheikh Rasheed said the Ansar ul Islam’s members were hiding inside the Parliament Lodges.\nThe police tried to resolve the matter peacefully, but they attacked the personnel, he added.  Minister for Information and Broadcasting Chaudhry Fawad Hussain, in a tweet, viewed the incident as a “planned” conspiracy on the part of the JUI-F chief Fazlur Rehman.\n“The Nazim of JUI’s armed militia is making an announcement that one of its groups had reached Islamabad,” he said while sharing a video message from the head of Ansarul Islam for the militia’s members. Following the arrests, JUI-F Chief Fazl arrived at the Parliament Lodges and called upon his party workers to come to streets.\nMeanwhile, a JUI-F spokesman said the party workers had blocked roads in various parts of country. According to the area people, the roads blockade had created problems in their movement.",
  "retrievedAt": "2025-08-11T14:30:26.279Z"
}
