{
  "title": "Shibli for promoting local industry, import substitution",
  "link": "https://www.app.com.pk/national/shibli-for-promoting-local-industry-import-substitution/",
  "date_published": "2022-03-10T14:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): Federal Minister of Science and Technology, Senator Shibli Faraz Thursday emphasized on making Pakistan self-sufficient by promoting local industry and focusing on import substitution.\nThe minister was chairing a meeting on import of scientific instruments and raw materials.\nDuring the meeting, the federal minister said his ministry aims to work in line with the Science, Technology and Innovation Policy 2022 to achieve the Sustainable Development Goals as per the vision of Prime Minister Imran Khan.\nHe said that the country is currently relying on imported products and raw materials for its industrial needs and should follow in the footsteps of the fourth industrial revolution in the West.\nShibli Faraz stressed the need to promote local industry by promoting research and development and creating close liaison between industry and academia, following the Triple Helix concept.\nThe representatives of industries said that the present government needs to protect local manufacturing and make import substitution as a government priority.\nEfficient energy systems are being installed in the industry to achieve clean and sustainable industrial development, they said.\nMeanwhile, the representatives from Pakistan Science Foundation and National University of Science and Technology pointed out that there is a need to increase funding for research and development, which is the basis of every industrial revolution.\nIndustrial mapping will be done to identify three to four initial testing phase projects and then a comprehensive action plan will be developed based on their findings, they said.\nThree industrial sectors including Agriculture, Engineering, and Electronics will be the main focus at this stage, Shibli Faraz said.\nHe said that the industries will be identified in the next meeting and a roadmap of three to six months will be drawn up to move forward with the initial phase.\nThe minister stated that the new Small and Medium Enterprises policy is a great initiative and the government will ensure the protection of new industries.\nAll relevant stakeholders will be involved in this process to achieve these collective goals, Shibli Faraz said.",
  "retrievedAt": "2025-08-11T14:30:33.233Z"
}
