{
  "title": "Women playing pioneering role at NUMS by heading its many departments",
  "link": "https://www.app.com.pk/national/women-playing-pioneering-role-at-nums-by-heading-its-many-departments/",
  "date_published": "2022-03-10T08:41:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 10 (APP): National University of Medical Sciences (NUMS) has set an example in promoting gender equality by giving pioneering role to highly qualified women in at least four of its departments being run successfully by them.\nCommenting on the occasion of the International Women’s Day with the theme “Changing Climates: gender Equality today for a sustainable tomorrow” the Heads of NUMS four departments called for gender equality for ensuring equal rights for women and acknowledgment of their important role in every field of the society.\nThe International Women’s Day was celebrated across the globe last Tuesday to spotlight the importance of challenging the “biases and misconceptions” about women and create an environment for gender equality. The day highlighted the role being played by women to address climate change as well.\nDr. Aisha Mohyuddin, PhD, Dean, Faculty of  Multidisciplinary Studies said women were playing an significant role in the advancement of sciences at NUMS. All these Departments at NUMS, including Public Health, Psychology, Nutrition and Health Professions Education, headed by female faculty, are proving to trailblazers for others. Science is a vast field and it is encouraging to see many women participating meaningfully to progress in research and academics.”\n“The female faculty at NUMs is leading research projects related to molecular diagnostics and devices, cancer therapeutics, nanomedicine, human genetics and environmental sciences. Women, if given equal opportunity, have all the potential and skills to prove their mettle in their respective fields”, she added.\nHead of NUMS Nutrition and Dieticians department Dr. Sehar Iqbal, a PhD said, the gender equality meant that all have equal opportunities, respect and rights so it was time “to groom our daughters to be aware of gender equality and our sons to never think of degrading women just because of their dependence. Such awareness is necessary to avoid violence and discrimination against any gender”, she said.\nHead of NUMS Department of Health Professions Education Dr Ayesha Rauf said women were making substantial contributions in the society. “I think what is required is that their contribution be recognized, their challenges be acknowledged and their responsibilities at home be shared,” she said.\nProf Dr. Uzma Hassan who is heading the department of Public Health said it was an occasion to educate public on issues of concern, mobilize political will and resources to address problems, and celebrate and reinforce achievements. Women in Pakistan are vulnerable to climate change, because they are more dependent on the natural resources being threatened by the climate change.\n“Today serves as an important reminder that we must all ensure that action on climate change accounts for these inequities and seeks to address them,” she added.",
  "retrievedAt": "2025-08-11T14:30:46.499Z"
}
