{
  "title": "Regenerative Economics to revolutionize urban development in developing countries: Experts",
  "link": "https://www.app.com.pk/national/regenerative-economics-to-revolutionize-urban-development-in-developing-countries-experts/",
  "date_published": "2024-04-20T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): The experts at a webinar on doughnut economics expressed that the concept of regenerative economics intended to revive the human-nature relationship to co-exist in harmony would revolutionize urban development in the developing countries.\nThe Sustainable Development Policy Institute (SDPI) organized a special webinar on Doughnut Economics: From concept to practice, said a news release here Saturday.\nKate Raworth, UK on the occasion explained doughnut economics into action in its international, regional and local context.\nShe mentioned that human economy is embedded in society that can be redesigned and reshaped in very nation in its own local context, whereas being part of nature, humans are bound to ensure protected nature and biodiversity to make economies in harmony with ecology.\nShe noted that globally market and state conflict dominated the economist review throughout the century, whereas shared values and shared economies steward through common interests ensure regenerative economies to create systems that work with and within the cycles of the living worlds (nature).\nRaworth opined that regenerative nature and technical resources management through eco-construction, circular construction, resilient infrastructure development to ensure disaster risk reduction and adaptation to whooping impacts of climate events.\nShe added that regenerative economy also focused on rediscovering ancestral concepts of circular economy of indigenous communities that are distributive in nature to make it sharing opportunity and value with all who co-create it.\nDr Jemilah Mahmood from Malaysia presented the example of Ipoh which is the third largest in Malaysia and a doughnut city based on its innovative development, heritage preservation and smart city outlook. “It is the first city in Asia to adopt the Doughnut Model inspiring other cities towards sustainability. There are four dimensions of doughnut economics of social, ecological, peace and justice and forest management,” she added.\nShe said that it could be started from waste management, energy harvesting, preservation of heritage and disaster risk reduction.\nJemilah mentioned that regenerative economics had been achieved through capacity building and bottom-up approach to uplift communities to embrace the concept which was important to implement doughnut vision. The Ipoh model of regenerative economics have gained attention of the top leadership of the country that could be replicated across Malaysia, she said.\nResponding to queries, the speakers underscored the need to translate doughnut economy vision into local languages for the better comprehension of indigenous communities as it was equally beneficial to embrace regenerative economics for economic wellbeing of a nation.",
  "retrievedAt": "2025-08-11T01:58:55.470Z"
}
