{
  "title": "PM to pay official visit to China in May: Rana Mashhood",
  "link": "https://www.app.com.pk/national/pm-to-pay-official-visit-to-china-in-may-rana-mashhood/",
  "date_published": "2024-04-20T11:56:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 20 (APP): Chairman Prime Minister’s Youth Program, Rana Mashhood Ahmed Khan has said that the friendship between Pakistan and China was beyond any doubt, but during the last regime, not only the CPEC project was destroyed, but also an attempt was made to spoil the relations between the two brotherly countries.\nHe expressed these views while talking to the media during his visit to China Window, a Chinese cultural center established in Peshawar.\nAccording to a press release issued here on Saturday, Rana Mashhood Ahmad Khan visited different galleries of China Window, signed the friendship wall and recorded his comments in the visitor’s book.\nHe said that Prime Minister Muhammad Shahbaz Sharif wants to make Pakistan a partner in economic development and that is the reason why he is bringing investment from Pakistan’s friendly countries to Pakistan so that the country can stand on its own feet.\nFrom May 14, the Prime Minister will make an official visit to the People’s Republic of China, which will restore the confidence of the brotherly neighboring country and the CPEC project will move towards success quickly, he added.\nIn response to a question, Rana Mashhood Ahmed Khan said that the current federal government’s focus is on youth.\nAlong with higher education, Prime Minister Shehbaz Sharif has directed to increase the technical training of the youth so that the talented youth are not only sent abroad but their skills can also be fully utilized in Pakistan.\nRecognizing the importance of languages, including Chinese, Rana Mashhood disclosed that he had instructed relevant institutions to initiate language programs tailored to meet the diverse needs of different countries.\nHe specifically mentioned plans to include the Chinese language in the programs offered by the National Commission for Technical and Vocational Training.\nRana Mashhood expressed appreciation for the establishment of the Chinese Cultural Center in Peshawar, foreseeing it as a pivotal hub for further enhancing the bonds between Pakistan and China. He reiterated his commitment to providing all possible cooperation in strengthening this friendship.\nRana Mashhood Ahmed Khan further said that many countries including China and Saudi Arabia are planning to invest in Pakistan in various fields.\nThousands of talented people will also get an opportunity to perform services in the country and abroad.\nHe appreciated the establishment of the Chinese Cultural Center in Peshawar and said that it is commendable that the China Window will prove to be a center for further strengthening the friendship between Pakistan and China. He also assured of all possible cooperation.",
  "retrievedAt": "2025-08-11T01:58:57.065Z"
}
