{
  "title": "FO says listing of commercial entities on allegations takes place without sharing evidences",
  "link": "https://www.app.com.pk/global/fo-says-listing-of-commercial-entities-on-allegations-takes-place-without-sharing-evidences/",
  "date_published": "2024-04-20T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 20 (APP): Foreign Office Spokesperson on Saturday, commenting upon reports of United States’ decision to impose sanctions against commercial entities on allegations of links with Pakistan’s ballistic missile programme, said that such listings had taken place in the past without sharing any evidence whatsoever.\nResponding to media queries, the spokesperson, in a press statement, said while they were not aware of the specifics of the latest measures by the US.\nIn the past, they had come across many instances where listings had been made on mere suspicion or even when the involved items were not on any control lists but were deemed sensitive under catch-all provisions, it was added.\n“We have pointed out many times that such items have legitimate civil commercial uses. It is, therefore, important to avoid arbitrary application of export controls,” the spokesperson said.\nThere was need for discussions between concerned parties for an objective mechanism to ensure access to technology in pursuit of socio-economic development, it was stressed.\nThe spokesperson said Pakistan had always been ready to discuss end-use and end-user verification mechanisms so that legitimate commercial users are not hurt by discriminatory application of export controls.\n“Pakistan rejects political use of export controls. It is a reality that the same jurisdictions, which claim to exercise strict non-proliferation controls, have waived off licensing requirements for advanced military technologies for some countries,” it was added.\nThe spokesperson said this was leading to ‘arms build up; accentuating regional asymmetries, and undermining the objectives of non-proliferation and of regional and global peace and security’.",
  "retrievedAt": "2025-08-11T01:58:29.309Z"
}
