{
  "title": "Registration of pilgrims under private Hajj scheme in progress: Ashrafi",
  "link": "https://www.app.com.pk/national/registration-of-pilgrims-under-private-hajj-scheme-in-progress-ashrafi/",
  "date_published": "2024-04-20T16:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 20 (APP): Pakistan Ulema Council Chairman Hafiz Muhammad Tahir Mahmood Ashrafi has announced that the registration of pilgrims under the private Hajj scheme is in progress, with 24,000 pilgrims slated to participate in the Road to Makkah project this year.\nHe made these remarks during a press conference held at the Lahore Press Club, where he was joined by representatives from Hajj Organisers Association of Pakistan (HOAP), including Saeed Ahmed Malik, Chaudhry Ehsanullah, Malik Abdul Khaliq, Chaudhry Muhammad Adil, Khalid Mahmood Bhatti, Pir Shafaat Ahmed Boudla, and Zeeshan Qamar.\nAshrafi, who is also the patron-in-chief of HOAP, noted that this year, certain private tour operators were offering Hajj packages at a more affordable rate compared to pilgrims participating in the government Hajj scheme. He emphasized that due to enhanced self-accountability measures, private pilgrims would not encounter issues as they have in the past. “It is imperative to provide written documentation to pilgrims detailing all the facilities to be provided during the sacred journey,” he added.\nFurthermore, Ashrafi mentioned that the Saudi Ministry of Hajj and Umrah was dispatching high-level officials to train Pakistani pilgrims.\nWith the concerted efforts of Chief of Army Staff General Syed Asim Munir and Prime Minister Muhammad Shehbaz Sharif, he said high-level Saudi delegations had visited Pakistan. He remarked that Pakistan’s shift towards trade rather than aid signified a significant development, with Saudi Arabia and other Islamic nations poised to play pivotal roles in Pakistan’s future economic and financial advancement.\nHe commended the Ministry of Religious Affairs and Interfaith Harmony for implementing corruption-free measures, expressing praise for the current government and the minister for their efforts in this regard.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:58:52.998Z"
}
