{
  "title": "ECP directs by-elections security personnel to uphold neutrality, maintain peace",
  "link": "https://www.app.com.pk/national/ecp-directs-by-elections-security-personnel-to-uphold-neutrality-maintain-peace/",
  "date_published": "2024-04-20T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): The Election Commission of Pakistan (ECP) instructed security personnel, excluding armed forces, deployed in by-elections to maintain neutrality, assist officers, ensure peace, avoid conflicts, arrests, or interference, report irregularities, and uphold impartiality, particularly during the counting process.\nIn a code of conduct issued for law enforcement agencies deployed on election duty, the arrest of suspects is only permitted upon instruction from polling staff.\nLaw enforcement personnel deployed for the bye-elections in Punjab, Sindh, Khyber Pakhtunkhwa, and Balochistan must adhere to the code, ensuring they perform their duties lawfully to assist the Election Commission of Pakistan in conducting fair and peaceful bye-elections in 2024.\nAccording to the guidelines outlined by the Election Commission of Pakistan (ECP), security personnel are required to carry out their duties within the boundaries of their assigned mandate and in compliance with the law. This is to ensure the facilitation of free, fair, transparent, and peaceful bye-elections in 2024.\nEach gazetted law enforcement officer will exercise powers delegated by the Election Commission of Pakistan under Section 193 of the Elections Act, 2017, and cooperate with District Returning Officers, Returning Officers, and Presiding Officers as per Section 83(a) of the same Act.\nAssist the Presiding Officer in ensuring smooth and effective polling station operations, maintaining order, and removing any individuals who misbehave or disobey orders. Remain impartial and neutral throughout the electoral process, providing full cooperation to the Presiding Officer to ensure uninterrupted voting.\nAs per the code, exhibit courteous and impeccable conduct when interacting with voters and polling staff, while remaining resolute and fair in compliance with the law in all situations. Offer assistance and guidance to individuals outside the polling station in the event of confusion or disturbances, ensuring a calm and secure environment conducive to voting. Conduct thorough frisking/checking of each voter to prevent the entry of any weapons, explosives, or prohibited items, including mobile phones, which may pose a threat to the integrity of the polling process.\nEnsure voters are efficiently queued, with priority given to elderly, transgender individuals, pregnant women, women with infants, and voters with disabilities. Concentrate solely on maintaining a peaceful and transparent polling process outside the polling station, following the directions of the Presiding Officer. Note that only one polling agent per candidate is permitted at each polling booth, with only one agent allowed to observe the counting and tabulation of results, as per the code.\nPolling agents and observers are legally entitled to obtain copies of Form-45 and Form-46 from the Presiding Officer during the counting process. Additionally, ensure the security of the Returning Officer’s office premises until the result consolidation is complete, and safely store polling materials in the Commission’s strong room. Adhere to all election and relevant laws, aiming to build public trust by maintaining a secure environment and upholding law and order throughout the election process. Note that District Returning Officers/Returning Officers may visit polling stations at any time.\nAccredited observers and media personnel are permitted to enter polling stations. Media personnel, along with cameras, can film the voting and counting processes, excluding the screened-off compartment to maintain ballot secrecy. Security personnel, including police, must not ask voters to produce their “Perchees” or prove their identity, as this is the responsibility of the polling officer. No eligible voter should be denied entry to the polling station, as voting is their inviolable right.\nEnsure impartiality and avoid any actions that may suggest bias. Refrain from assuming the responsibilities of polling staff under any circumstances. Do not handle any election materials, including ballot papers, stamps, or electoral rolls. Only allow authorized polling staff to handle such materials. Avoid engaging in arguments or altercations with candidates, their agents, polling agents, observers, or media personnel. Refrain from interfering with the duties of the Presiding Officer, Assistant Presiding Officer, or Polling Officer. Report any irregularities observed outside the polling station to the Presiding Officer and follow their instructions.\nDo not object to the presence of candidates, their agents, or observers during the counting process. Only make arrests at the polling station if explicitly instructed to do so by the Presiding Officer. Refrain from interfering with the counting process and ensure a peaceful environment outside the polling station until the completion of the counting process, unless malpractice is identified, in which case inform the officer in charge immediately for further action.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:58:53.360Z"
}
