{
  "title": "Corona testing capacity being enhanced in KP, CM inaugurates testing lab at AMC",
  "link": "https://www.app.com.pk/national/corona-testing-capacity-being-enhanced-in-kp-cm-inaugurates-testing-lab-at-amc/",
  "date_published": "2020-04-22T01:27:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 22 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan said the testing capacity of coronavirus is being enhanced in the province.\nTalking to media after inaugurating COVID-19 testing laboratory at Ayub Medical Complex in Abbottabad on Wednesday, he stressed the need to adopt precautionary measures including social distancing to contain the corona pandemic.\nMahmood Khan said transparent provision of amount to the deserving families under Ehsas Cash Programme is among the priorities of the government.\nHe lauded the services of doctors, nurses and paramedics as frontline workers to contain the pandemic effectively.\nThe CM Chief Minister said collective efforts are being taken to cope with coronavirus outbreak across the province.\nHe said the government has devised a comprehensive strategy to meet the challenges of coronavirus for which all available resources are being utilized.\nOn this occasion, Commissioner Hazara Division briefed the Chief Minister about the updates of corona situation and steps being taken by district administer in this regard.\nHe said that 854 COVID-19 suspected cases were reported from Hazara division out of which 119 were found positive while seven people died of the disease and 25 got recovered.\nHe informed that 16 ventilators at Ayub Medical Complex are specified for corona patients.\nRegarding Ehsas Programme, he said so far over Rs 1 billion has been distributed among deserving people.\nRefering to availability of edible items, the commissioner said that stock of more than one month is available in Hazara division and there would be no shortage in the division.\nSpeaker Khyber Pakhtunkhwa assembly Mushtaq Ahmed Ghani, provincial ministers Akbar Ayub and Qalander Lodhi, Chief Secretary and KP IGP accompanied the Chief Minister.\nLater the CM inaugurated academic block of Police School of Intelligence and appreciated it’s performance adding that its importance would increase in coming days.\nOn the occasion, the CM was told that so far 4656 police officials of different ranks and different provinces were given training at the school.",
  "retrievedAt": "2025-08-11T19:08:12.328Z"
}
