{
  "title": "Govt to spends Rs 20 mln on awareness campaign about HR",
  "link": "https://www.app.com.pk/national/govt-to-spends-rs-20-mln-on-awareness-campaign-about-hr/",
  "date_published": "2020-04-22T01:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP):The Ministry of Human Rights would spend Rs 20 million for effective awareness programme about human rights across the country, said  DG Muhmmad Arshad said here on Tuesday.\nTalking to APP here on Wednesday, he said total allocations for the project was Rs 55 million. This project has been developed to create human rights awareness in targeted programme, through print and electronic media.\nThe main purpose of this campaign was to promote tolerance and respect for human rights and inter-faith harmony to combat religious intolerance for a peaceful society.\nTo sensitize rural and urban communities for behavioral change towards certain human rights issues particularly gender based violence; to develop communication strategy to address major human rights issues particularly violence against women, women’s inheritance rights, child abuse, transgender, minorities and PWDs etc,he added.\nTo disseminate information on human rights in schools, colleges, universities and public & private sector The awareness campaign are the regular phenomena of Ministry of Human Rights  department  which  had  national moral imperative affect of people.\nKeeping this tradition alive, every  year Human Rights and Minorities Affairs Department devises three fold plan of human rights day activities at provincial, district level in all districts of Punjab including print and electronic media campaign / coverage for celebrations of International Human Rights Day, 2020  to  raise the momentum of public awareness at the maximum level.\nHe also said the successful activity with deep rooted affects of all awareness activates conducted by public private partnership also.\nHe said that the Ministry of Human Rights always tried to promote peace  for the protection and promotion of Human Rights.",
  "retrievedAt": "2025-08-11T19:08:09.023Z"
}
