{
  "title": "2 dead, 11 injured as blast rips through market in Balochistan’s Qila Abdullah: officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two people were killed and at least 11 were injured after an explosion ripped through a market in Balochistan’s Qila Abdullah district on Sunday evening, officials said.\n\nDeputy Commissioner Qila Abdullah Riyaz Khan told Dawn.com, “Two people were killed while 11 were injured in the explosion.”\n\nAccording to the initial investigation, the explosives were planted in a vehicle, DC Khan said, adding that the bomb disposal squad and law enforcement officials were summoned and an investigation was launched.\n\n“An emergency was declared at the District Health Headquarters in Qila Abdullah, where medical assistance was being provided to the injured,” he said.\n\nIn a separate statement given to Dawn.com, Qila Abdullah Levies Risaldar Gulab Khan said, “The blast took place near the Abdul Jabbar Market in the Gulistan area of Qila Abdullah district, resulting in the death of two people and injuries to 11 others.\n\n“After the explosion, Levies personnel and people present at the scene immediately rescued the injured, who were then moved to the District Health Headquarters Chaman for treatment.”\n\nAccording to the official, officers began an investigation after collecting evidence from the scene.\n\nCondemning the blast, Balochistan Chief Minister Sarfraz Bugti said he shared the grief of the families of the deceased.\n\n“The war against terrorism is undoubtedly a war of national security,” CM Bugti said in a statement, adding war against terrorism will continue until the last terrorist is eliminated.\n\n“The elements involved in the Gulistan blast will be brought to an end soon,” he added.\n\nIn a separate statement, Balochistan government spokesperson Shahid Rind said security forces were present at the spot, the area was being cordoned off, and evidence was being collected.\n\n“The state is taking steps to protect the people by utilising all resources,” Rind said.\n\nThe security situation in Balochistan has worsened in recent months, as militants, long involved in a low-level insurgency, have stepped up the frequency and intensity of their attacks. The outlawed Balochistan Liberation Army, in particular, has adopted new tactics to inflict higher casualties and directly target Pakistani security forces.\n\nIn March, the Jaffar Express train was hijacked near Balochistan’s Sibi area, resulting in the deaths of 26 hostages, including 18 security personnel. Five more security personnel were martyred during the operation.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:17:13.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911806/2-dead-11-injured-as-blast-rips-through-market-in-balochistans-qila-abdullah-officials",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T17:20:05.000Z"
}
