{
  "title": "Pope Leo urges unity for divided Church, vows not to be ‘autocrat’ - World - DAWN.COM",
  "author": null,
  "content": "Pope Leo XIV formally began his reign on Sunday by reaching out to conservatives who felt orphaned under his predecessor, calling for unity, vowing to preserve the Catholic Church’s heritage and not rule like “an autocrat”.\n\nAfter a first ride in the popemobile before tens of thousands of people in St. Peter’s Square, Leo was formally installed as the 267th pontiff of the Roman Catholic Church and sovereign monarch of Vatican City at an outdoor Mass.\n\nWell-wishers in the crowd waved US and Peruvian flags, with people from both countries claiming him as the first pope from their nations.\n\nBorn in Chicago, the 69-year-old pontiff spent many years as a missionary in Peru and also has Peruvian citizenship.\n\nCrowds chanted “Viva il Papa” (Long Live the Pope) and “Papa Leone”, his name in Italian, as his distinctive, open-topped popemobile weaved around St. Peter’s Square.\n\nRobert Prevost, a relative unknown on the world stage who only became a cardinal two years ago, was elected pope on May 8 after a short conclave of cardinals that lasted barely 24 hours.\n\nHe succeeded Francis, an Argentine, who died on April 21 after leading the Church for 12 often turbulent years during which he battled with traditionalists and championed the poor and marginalised.\n\nUS Vice President JD Vance, a Catholic convert who clashed with Francis over the White House’s hardline immigration policies, led a US delegation alongside Secretary of State Marco Rubio, who is also Catholic.\n\nVance briefly shook hands with Ukrainian President Volodymyr Zelensky at the start of the ceremony. The two men last met in February in the White House, when they clashed fiercely in front of the world’s media.\n\nIn his sermon, read in fluent Italian, Leo said that as leader of the world’s 1.4 billion Roman Catholics, he would not shrink before modern challenges and that, at least on social issues such as combating poverty and protecting the environment, he would continue the legacy of Pope Francis.\n\nLeo said the cardinals who elected him had chosen someone “capable of preserving the rich heritage of the Christian faith and, at the same time, looking to the future, in order to confront the questions, concerns and challenges of today’s world”.\n\nFrancis’ papacy left a divided Church, with conservatives accusing him of sowing confusion, particularly with his extemporaneous remarks on issues of sexual morality such as same-sex unions.\n\nSaying he was taking up his mission “with fear and trembling”, Leo used the words “unity” or “united” seven times and the word “harmony” four times.\n\n“It is never a question of capturing others by force, by religious propaganda or by means of power. Instead, it is always and only a question of loving, as Jesus did,” he said, in an apparent reference to a war of words between Catholics who define themselves as conservative or progressive.\n\n“Brothers and sisters, I would like that our first great desire be for a united Church, a sign of unity and communion, which becomes a leaven for a reconciled world,” he said.\n\nConservatives also accused Francis of ruling in a heavy-handed way and lamented that he belittled their concerns and did not consult widely before making decisions.\n\nReferring to St. Peter, the 1st century Christian apostle from whom popes derive their authority, Leo said: “Peter must shepherd the flock without ever yielding to the temptation to be an autocrat, lording it over those entrusted to him. On the contrary, he is called to serve the faith of his brothers and sisters, and to walk alongside them.”\n\nUnderscoring the unbroken lineage of popes from St. Peter, the choir chanted the traditional hymn “Tu es Petrus”, Latin for “You are Peter”.\n\nMany world leaders attended the ceremony, including the presidents of Peru, Israel and Nigeria, the prime ministers of Italy, Canada and Australia, German Chancellor Friedrich Merz and European Commission President Ursula von der Leyen. European royals also took their place in the VIP seats near the main altar, including Spanish King Felipe and Queen Letizia.\n\nAs part of the ceremony, Leo received two symbolic items: a liturgical vestment known as a pallium, a sash of lambswool representing his role as a shepherd, and the “fisherman’s ring”, recalling the first pope, St. Peter, who was a fisherman.\n\nThe ceremonial gold signet ring is specially cast for each new pope and can be used by Leo to seal documents, although this purpose has fallen out of use in modern times. It shows St. Peter holding the keys to Heaven and will be broken after his death or resignation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/181526163421a56.jpg",
  "retrievedAt": "2025-08-23T14:17:15.705Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911785/pope-leo-urges-unity-for-divided-church-vows-not-to-be-autocrat",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T10:58:34.000Z"
}
