{
  "title": "Zardari credits military for professional excellence - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: President Asif Ali Zardari has credited the armed forces for their “professional excellence” in the armed conflict with India, saying they defended the motherland like an iron wall against the aggression of its arch-rival.\n\n“The exemplary conduct and professional excellence of the Pakistan armed forces have been witnessed in the successful execution of M’arka-i-Haq. It shows their resolute determination and unshakable courage in the face of unprovoked aggression,” Presi­dent Zardari said during a visit to the Gujranwala Cantonment on Saturday.\n\nHe was accompanied by Interior Minister Mohsin Naqvi. Upon arrival, the president was greeted by Army Chief Gen Asim Munir. Commanders of Mangla and Gujranwala Corps were also present, APP reported.\n\nMr Zardari paid solemn tribute to the military and civilian martyrs who laid down their lives in defence of the motherland, affirming that their sacrifice remains a sacred trust and a source of enduring national pride.\n\nHe underscored that the sons of the soil, fortified by the enduring spirit of the nation, stood with unwavering resolve to defend the motherland and thwarted hostile designs with exceptional valour and operational acumen.\n\nNawaz commends armed forces for standing strong against Indian threat\n\n“History will bear witness to how, within a matter of hours, the Pakistan armed forces repelled aggression with unmatched precision and resolve, sending an unequivocal message of Pakistan’s strength, resilience, and national unity,” he said.\n\nDuring his interaction with officers and troops, the president commended their exemplary combat readiness and devotion to duty.\n\nHe extended heartfelt congratulations on the successful culmination of Operation Bunyanum Marsoos, and expressed profound pride in the defenders of the nation, affirming that the people of Pakistan hold their brave soldiers in the highest esteem as the true custodians of national honour and sovereignty.\n\nIron wall\n\nMeanwhile, PML-N head Nawaz Sharif, in a meeting with Senator Irfan Siddiqui at his Jati Umra residence, showered praise on the armed forces, saying their professionalism and bravery defended Pakistan like an iron wall against Indian aggression.\n\n“We offer our deepest gratitude to Almighty Allah for granting us success,” he said and also lauded the role of the parliament.\n\n“Setting aside all political differences and speaking with one voice for the sake of national security is a welcome and commendable step. By reflecting the emotions of 240 million citizens, the people’s representatives boosted the spirit of the brave armed forces,” he said and underscored the importance of institutional collaboration, stating that Parliament’s unified stance had reinforced national resolve and showcased Pakistan’s democratic maturity in times of crisis.\n\nHe also commended the Pakistani media for presenting the truth and exposing the enemy’s falsehood during the armed conflict.\n\nIrfan Siddiqui briefed the PML-N president on the parliamentary party’s performance during the session.\n\nThe meeting underscored PML-N’s commitment to upholding state interests and its confidence in democratic institutions. Local media reported that Prime Minister Shehbaz Sharif also called on Nawaz Sharif at Jati Umra and discussed Pakistan’s victory over India and praised national unity. However, there was no official confirmation of this meeting.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/18103001e00d5ce.jpg",
  "retrievedAt": "2025-08-23T14:17:48.421Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911704/zardari-credits-military-for-professional-excellence",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T02:51:22.000Z"
}
