{
  "title": "Lahore ATC to indict over 260 in Jinnah House attack case - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: An anti-terrorism court on Saturday distributed the copies of charge-sheet among 267 suspects, including several senior PTI leaders, and summoned them for indictment in the Jinnah House attack case next week.\n\nWhile incarcerated PTI leaders including ex-ministers Dr Yasmin Rashid, Mian Mehmoodur Rashid, ex-governor Omar Sarfraz Cheema and Senator Ejaz Chaudhry were produced before Judge Manzer Ali Gill, who conducted the hearing inside the Kot Lakhpat jail, the latter was informed that ex-minister Shah Mehmood Qureshi was shifted to Punjab Institute of Cardiology for a cardiac complaint before the hearing commenced.\n\nAlso, PTI’s former lawmakers Aliya Hamza Malik and Rubina Jamil, social media activists Sanam Javed and Tayyaba Raja, fashion designer Khadija Shah and other suspects out on bail attended the hearing inside the jail.\n\nSenior lawyers Burhan Moazam Malik and Rana Mudassir Umar appeared on behalf of the suspects.\n\nAfter being provided with the copies of the charge-sheet, the suspects were informed that they would be indicted on May 24 in the case.\n\nJudge Gill of the ATC-1 later adjourned the proceedings.\n\nSarwar Road police had registered an FIR against the PTI leaders and workers on charges of attacking and vandalising the Jinnah House, which also serves as residence of corps commander, during the May 9 protests against the arrest of ex-premier Imran Khan in a graft case by National Accountability Bureau.\n\nTerrorism charge under Section 7 of the Anti-Terrorism Act 1997, and various other offences, including waging or attempting to wage war or abetting waging of war against Pakistan, abetting mutiny, or attempting to seduce a soldier from his duty and rioting were added to the FIR.\n\nMeanwhile, another ATC court extended the pre-arrest bail of former legislator Aliya Hamza Malik till May 26 and two sisters of Mr Khan in multiple cases of attacks on police till May 30.\n\nMs Malik appeared before the court on the expiry of her bail period while Aleema Khan and Uzma Khan sought one-time exemption from personal appearance.\n\nA lawyer informed the court that both sisters had to appear before a court of Rawalpindi.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:07:39.480Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911720/lahore-atc-to-indict-over-260-in-jinnah-house-attack-case",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T02:38:42.000Z"
}
