{
  "title": "Daughter of SC judge absolved of charges in hit-and-run case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After fighting his case for about three years, father of a victim of the high profile hit-and-run case finally withdrew appeal against the acquittal of the daughter of a Supreme Court judge.\n\nThe matter was pending before the Islamabad High Court (IHC).\n\nRafaqat Ali, father of Shakeel Tanoli, had lodged FIR with the Khanna Police Station, Islamabad on June 19, 2022.\n\nA local court of Islamabad had acquitted Shanzay Malik, the daughter of the Supreme Court judge Justice Malik Shahzad Ahmed Khan in February.\n\nAs per the FIR, a Sports Utility Vehicle (SUV) allegedly driven by the daughter of the Justice Malik Shahzad Ahmed Khan ran over two Savour Foods workers near the Sohan bridge on the Expressway at midnight and the investigation into the case had remained stalled.\n\nVictim’s father says he lodged FIR out of misunderstanding\n\nAs per the details available in the judicial record, on June 8, Shakeel Tanoli and his colleague Hasnain Ali were going home after the work when they were hit by an SUV allegedly driven by a woman.\n\nWhile the judge’s family reportedly reached a settlement with the family of Hasnain Ali, Rafaqat Ali vowed to pursue the case legally.\n\nRafaqat Ali has now changed his mind and stated in the affidavit that he nominated Shanzay Malik because of misunderstanding.\n\nHe further stated that he verified with different sources and found that neither Ms Malik nor anyone from his family was involved in the incident.\n\n“Subsequently, I am withdrawing the appeal in this case and have no objection over her acquittal in the case.”\n\nAccording to the details brought to the judicial record, the woman fled, leaving behind the vehicle.\n\nThe police took the vehicle into custody, which was later given to an official of the Lahore High Court on ‘superdari’ in July 2024 upon assurance that ‘he shall produce the vehicle in the court as and when required’.\n\nIn July 2024, Inspector General of Islamabad Police Ali Nasir Rizvi informed the Islamabad High Court (IHC) that the luxury vehicle of the Lahore High Court (LHC) involved in hit and run case in which two persons were killed was driven by a woman and was in the use of Justice Malik Shahzad Ahmed, who was elevated to the Supreme Court after the incident.\n\nIn February this year, judge’s daughter Shanzay Malik was acquitted by Judicial Magistrate Adnan Yousuf, who accepted the acquittal application filed by Malik’s legal team.\n\nAdvocate Siddique Awan, counsel for Ms Malik, argued before the court that police could not produce any substantial evidence as the entire story of prosecution was based on secondary facts.\n\nHe argued that the case was registered 11 days after the accident, and the police could not give any explanation for the delay. He contended that the police could not produce any video evidence, and the photos submitted in the court did not clearly identify his client.\n\nHe also pointed out that Shanzay Malik was nominated only after the plaintiff’s delayed statement in July 2024.\n\nEarlier, reports indicated that Ms Malik had been granted pre-arrest bail after being on the run for more than two years.\n\nLegal proceedings saw the deletion of Section 322 of the Pakistan Penal Code (causing death by rash or negligent driving), which is a non-bailable offence, and replacing it with Section 320 (causing death without intent), a bailable offence.\n\nRafaqat Ali has challenged the acquittal order before the Islamabad High Court.\n\nFollowing submission of the affidavit, IHC Justice Mohammad Asif dismissed the appeal against acquittal.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:17:31.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911660/daughter-of-sc-judge-absolved-of-charges-in-hit-and-run-case",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T02:52:07.000Z"
}
