{
  "title": "Punjab PMS officer calls chief secretary posting unconstitutional - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A senior Provincial Management Service (PMS) officer has objected to the posting of the chief secretary for being unconstitutional as well as keeping him an officer on special duty (OSD) for the past over two years. He has sought a posting as additional secretary at the Secretariat.\n\nIn a representation to the chief secretary, which he calls his fifth representation, PMS officer Tariq Mahmood Awan stated, “I reiterate, without ambiguity, that your posting as Chief Secretary stands unconstitutional under Article 240(b) of the Constitution of the Islamic Republic of Pakistan, read with the PCS Act, 1974”.\n\nIn countries like Pakistan, where possession is treated as nine-tenths of the law, he said, such occupation had been the norm, devoid of moral or legal legitimacy.\n\nMr Awan, who has also served as president of the PMS Association, claimed that he had stood as an unwavering advocate for the constitutional legitimacy of the PMS cadre and that he was always targeted by the PAS/DMG lobby. He adds that he had been kept as an OSD for over two years, without any lawful reason and in direct defiance of the orders of the Supreme Court – a clear contempt of court, for which he 9CS) was personally accountable.\n\nBound by the law and the Constitution, he urged the chief secretary to act in line with law and constitution. He demanded that he should be posted as additional secretary or equivalent as it was his legal right under the PMS Rules, read with the PCS Act, 1974.\n\nAt the end of his representation, the PMS officer urged the chief secretary to read Dr Faustus by Christopher Marlowe. “It is a mirror for those who chase power by immoral means. There is a message in it – for all those who act like Pharaohs.\n\nSpeaking to Dawn, PMS officer Mr Awan said the chief secretary was bound to give posting within four months to the OSDs and added there were several officers being kept OSD for longer periods.\n\nThis reporter shared Mr Awan’s representation with the chief secretary and sought his comments. He, however, did not respond to repeated messages.\n\nThe officer has also forwarded his representation to the Punjab governor and the chief minister too.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:06:58.072Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911687/punjab-pms-officer-calls-chief-secretary-posting-unconstitutional",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T02:52:00.000Z"
}
