{
  "title": "Bank advances drop by Rs1.6tr in January-April - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Bank advances sharply declined by Rs1.589 trillion during the January to April period of the current fiscal year, despite a notable reduction in interest rates, while bank investments in government securities have surged significantly over the same period.\n\nAccording to the latest data from the State Bank of Pakistan (SBP), total advances dropped from Rs14.727tr in January to Rs13.138tr by April 2025 — an 11 per cent fall amounting to Rs1.589tr.\n\nAdvances, which represent lending to the private sector, are typically considered a key indicator of economic activity, whereas investments, mostly in government papers, are viewed as less productive in terms of real economic output.\n\nThis decline is seen as a setback to the government’s stated goal of stimulating economic growth. However, economists are divided on the issue.\n\nInvestments in govt securities surge by Rs3.2 trillion\n\nOne school of thought suggests the government is deliberately keeping growth moderate to curb rising imports, which have previously eroded the country’s external position.\n\nIn March, Pakistan’s trade deficit widened to a record $3.5 billion, dragging the current account surplus down to just $12 million in April from a peak of $1.2bn in March.\n\nThe private sector is too cautious to borrow from banks despite a massive decline in the interest rate to 11pc from 22pc in June 2024.\n\nBank advances also declined because of political uncertainty despite some attractive positive macroeconomic indicators.\n\n“While the military secured airspace, the economy is quietly emerging from near-bankruptcy: a rare current account surplus, primary fiscal surplus, inflation at multi-decade lows, twin IMF programmes green-lit, a record-breaking KSE-100 Index and a stable rupee,” noted Faisal Mamsa, CEO of Tresmark, adding that there is renewed hope that this momentum will continue.\n\nIn the meantime, bank investments soared, rising by Rs3.18tr during January to April 2025.\n\nTotal investment reached Rs33.203tr in April, up from Rs30.022tr in January. This surge reflects increased government borrowing to meet fiscal requirements.\n\nAccording to the SBP data, deposits also showed modest growth, rising by Rs1.713tr to Rs32.326tr by April 2025 from Rs30.603tr in July 2024.\n\nHowever, bankers noted that the sector remained under pressure throughout the period due to uncertainty surrounding the imposition of the 15pc incremental tax.\n\nBankers anticipated that while advances may not increase, investments would go higher as the government has been borrowing heavily to meet its expenses.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:17:20.127Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911746/bank-advances-drop-by-rs16tr-in-january-april",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T03:14:05.000Z"
}
