{
  "title": "Dortmund complete escape act to snatch last CL spot - Sport - DAWN.COM",
  "author": null,
  "content": "DORTMUND: Borussia Dortmund cruised past relegated Holstein Kiel 3-0 on Saturday to finish fourth and snatch the last Champions League spot for next season, in the best comeback of the last seven matchdays in Bundesliga history.\n\nNiko Kovac’s Dortmund won six of their last seven matches to climb from 10th to fourth in the standings and finish on 57 points, two ahead of Freiburg who lost 3-1 at home to third-placed Eintracht Frankfurt.\n\nKovac had taken over in February with the team in 11th place after the departure of Nuri Sahin following a disappointing first half to the season.\n\n“We are all happy but there is no reason to celebrate,” Kovac told a press conference. “I am happy and we are all happy to have pushed this through, to have taken that last step which is sometime difficult to take.”\n\nDortmund, needing three goals to be guaranteed a top four finish irrespective of results in the other games, got off to a dream start when Serhou Guirassy converted a third­-m­inute penalty for the lead.\n\nKiel went down to 10 players when Carl Johansson was sent off with a straight red card but the hosts could not make the extra man count until the break.\n\nThey did, however, score two minutes after the restart with Marcel Sabitzer slotting in from the edge of the box to make it 2-0 and Felix Nmecha adding another in the 72nd minute to seal their Eur­opean spot.\n\nDortmund will be joined in the Champions League by Frankfurt, who came from a goal down to win at Freiburg, qualifying for Europe’s top competition through league placing for the first time.\n\nFreiburg, who started the weekend in fourth and needed to win to guarantee a debut Champions League spot, took the lead after 27 minutes when Ritsu Doan volleyed in.\n\nFrankfurt’s Ansgar Knauff did his former club Dortmund a favour when he levelled things up just before halftime.\n\nFrankfurt added two goals in three second-half minutes through Rasmus Kristensen and Ellyes Skhiri to grab hold of the match and their Cham­pions League fate.\n\nFreiburg fell to fifth and will play in the Europa League next season; they will be joined in the competition by the winner of the German Cup final between VfB Stuttgart and third-flight Arminia Bielefeld.\n\nElsewhere, champions Bayern Munich finished the season in style, farewelling departing veteran Thomas Mueller in a 4-0 win at Hoffenheim.\n\nHarry Kane scored his 26th league goal of the year, winning the top goalscorer gong for the second straight season, with Michael Olise, Joshua Kimmich and Serge Gnabry also getting on the scoresheet.\n\nBayer Leverkusen were held to a 2-2 draw at Mainz 05 in Xabi Alonso’s final match in the dugout.\n\n“For sure I’m going to miss it, I’ve learned a lot and I’ll take a lot from these three years for the future,” Alonso told reporters.\n\nRB Leipzig’s poor season continued, losing 3-2 at home to Stuttgart to miss out on European football completely for the first time since their debut promotion in 2016.\n\nHeidenheim will play in the relegation playoff after a 4-1 home loss against Werder Bremen.\n\nElsewhere, Union Berlin came from a goal down to win 2-1 at Augsburg. Bochum, who were relegated last week, bade farewell to the top flight with a 2-0 win at St Pauli, while VfL Wolfs­burg won 1-0 at Borussia Moen­cheng­ladbach.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6828fe7a617c6.jpg",
  "retrievedAt": "2025-08-23T14:17:45.054Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911666/dortmund-complete-escape-act-to-snatch-last-cl-spot",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T02:51:34.000Z"
}
