{
  "title": "Govt achieved economic revival under PM Shehbaz, will provide relief in next budget: Sanaullah - Pakistan - DAWN.COM",
  "author": null,
  "content": "Adviser to the Prime Minister on Political Affairs Rana Sanaullah said on Sunday that the country has achieved economic revival under the leadership of PM Shehaz Sharif, assuring the provision of relief to the public in the upcoming budget.\n\nThe government will present the federal budget for the fiscal year 2025-26 on June 2. PM Shehbaz has assured that providing relief to the common man in the upcoming budget was the government’s priority, and all-out resources will be utilised to reduce the financial difficulties of the poor and middle class.\n\nA delegation comprising the PML-N leader, Finance Minister Muhammad Aurangzeb, and Energy Minister Awais Leghari called on Governor Sindh Kamran Tessori in Karachi today, while MQM leaders Farooq Sattar, Khalid Maqbool Siddiqui, Faisal Sabwari, and Nasrin Jalil were also present on the occasion.\n\nAddressing the media after the meeting, Sanaullah said that Pakistan had emerged out of an economic crisis due to the untiring efforts of the economic team comprising the finance minister and PM Shehbaz.\n\n“The country achieved economic revival under the leadership of the prime minister, and now, in the upcoming budget, there will be good news for the common man,” Sanaullah said.\n\nHe added the recent conflict with India had shown the world that Pakistan was a responsible nation and that the armed forces and their chiefs deserved the nation’s gratitude for the victory.\n\nSanaullah also assured that the government will present a budget that will push the country towards economic prosperity.\n\nSpeaking on the occasion, MQM’s Sattar said that maximum relief should be given to the common man in the upcoming budget and the burden on the salaried class should be reduced.\n\n“During today’s meeting, we discussed the reforms suggested by the IMF (International Monetary Fund), including increasing agriculture tax on landlords,” he said, adding that if taxes could be imposed on the salaried class, direct taxes could be imposed to expand the tax base, too.\n\nSattar said the government should improve the urban packages for Karachi and Hyderabad, and expedite the completion of the K-IV water project, which the prime minister had assured will be completed by December 2026.\n\nHe added the funds allocated for road infrastructure in Karachi should not lapse and instead be increased for the next fiscal year so that the problems of sanitation and road repair affecting the city are resolved.\n\nGovernor Tessori pointed out how India attempted to stop the disbursement of the next tranche of IMF funds during the conflict, “but it was eventually approved due to the efforts of the finance minister.”\n\nHe said the MQM leaders briefed the delegation and business leaders on the urban projects in Karachi.\n\n“Pakistan will achieve economic and political stability within the next year, and we will give a message to India when we celebrate the first anniversary of our May 10 victory,” he said.\n\nThe PML-N delegation arrived in Karachi and earlier met with Sindh Chief Minister Murad Ali Shah and PPP’s Naveed Qamar at the CM House.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/1819152880b2787.jpg",
  "retrievedAt": "2025-08-23T14:17:13.718Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911793/govt-achieved-economic-revival-under-pm-shehbaz-will-provide-relief-in-next-budget-sanaullah",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T14:22:30.000Z"
}
