{
  "title": "Students, parents in Karachi face hardship over tough O/A-level exam schedule - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Candidates say they have to sit for two, sometimes even three, exams in one day\n• Clashes in exam schedules caused by numerous subjects offered by the board, claims Cambridge representative\n\nKARACHI: With several examples of clash of paper schedules in the current Cambridge exams, students and parents have been demanding a revision in their date sheets as it is putting extra pressure on the candidates who then have to sit for two exams, sometimes even three, in one day.\n\nBesides the mental stress, students have also been complaining of their hands getting tired while sitting for back-to-back exams. Their parents, too, are saying that they drop everything to be available for their children during exam time. They wait in the sitting areas outside exam centres during every paper and when there are two papers, they have to be there for the entire day.\n\n“We are paying lacs of rupees for the exams. The least that Cambridge can do for us is listen to us and see our plight and reschedule the exams where there are any such clashes of papers taking place on the same day,” said one parent.\n\nSome private school associations have also raised their voices over this matter in the hope that the Cambridge management in Pakistan would pay some heed.\n\nAcademic and activist Kashif Mirza, who is the president of All Pakistan Private Schools Federation (APPSF) was of the opinion that Pakistanis are paying billions to Cambridge as these are expensive exams. Cambridge should at least be considerate enough to not put so much stress on the candidates despite taking so much money from them.\n\n“You also have the poor parents sitting outside exam centres. And when the children are appearing in two or more papers in a day, it means double duty for the parents,” he pointed out.\n\n“Besides, two exams in one day means that a candidate cannot do justice to both the subjects he or she is appearing in,” he added.\n\n“My request to Cambridge under these circumstances is that since they are making so much money here at our expense, they should at least upgrade their infrastructure instead of stressing out the candidates just because they couldn’t come up with a better schedule.\n\n“They should keep a cushion of days in their exam schedules to address the clash of subjects,” he suggested, adding that such issues of paper clashes in exam schedules are usually seen happening in South Asian countries, not in Europe where Cambridge follows a different strategy.\n\n“Cambridge needs an overhaul here. They should design a software, maybe using AI, if they can’t do it themselves, to come up with better exam schedules. In this day and age, students are also sitting for their exams online. Such mechanisms should also be developed and introduced by Cambridge,” said the APPSF president.\n\nCambridge International’s Country Director Uzma Yusuf, meanwhile, said that they are the biggest exam board in the world, which comes with plenty of responsibility. “We are not deliberately putting undue pressure on students,” she said.\n\n“We are there in some 160 countries of the world. It is a huge responsibility. We are the Cambridge University’s exam board. The clashes in exam schedules happen due to there being so many subjects on offer by Cambridge,” she said.\n\n“Besides,” she said, “there is a general perception here in Pakistan that every paper is of a duration of three hours only but there are also Cambridge exams which may be of durations of 40 minutes or maybe one hour and 10 minutes.”\n\n“So a student is not sitting in the examination hall for three hours in the morning and coming back for another three hours in the afternoon,” she said.\n\n“Where there may be a clash between papers, a student may sit for his or her morning paper, take a break, rest, have something to eat or drink under centre supervision and then sit for the other paper,” she said.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:07:26.822Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911630/students-parents-in-karachi-face-hardship-over-tough-oa-level-exam-schedule",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T02:51:53.000Z"
}
