{
  "title": "Nine killed in Russian drone attack on Ukraine - World - DAWN.COM",
  "author": null,
  "content": "KYIV: A Russian drone attack on a minibus carrying civilians killed nine people on Saturday, authorities said, a day after Moscow and Kyiv agreed a large-scale prisoner swap at talks in Turkiye.\n\nAt the end of a tense week, Ukraine and Russia held their first direct talks in more than three years on Friday, but failed to agree to a truce.\n\nAnd despite the threat of new sanctions on Russia from Kyiv’s allies, there has been no let-up in fighting.\n\n“Unfortunately, as a result of a cynical attack by the Russians on a bus with civilians, there are dead,” the military administration in Ukraine’s northern Sumy region said in a Telegram post.\n\n“Unfortunately, the death toll has risen to nine,” it added later, alongside a photo of a mangled blue minibus that had apparently been torn apart by the blast. Four people were wounded in the attack. In the earlier post, the authorities had said that eight people were killed.\n\nThe bus, which was attacked near the city of Bilopillya while travelling towards Sumy, was “targeted by the Russians”, the military administration said.\n\nUkraine’s Sumy border region has come under increasingly deadly bombardments by Moscow since March, when Ukrainian forces were pushed out of Russia’s neighbouring Kursk region, which they had partially controlled since the last summer.\n\nThis latest attack came after three people were killed in Russian strikes on Friday on Ukraine’s eastern Donetsk and southeastern Kherson regions.\n\nLittle progress in talks\n\nThe first direct talks since the spring of 2022 — shortly after Moscow’s full-scale invasion that February — between Ukraine and Russia in Istanbul resulted in a concrete agreement to exchange 1,000 prisoners each.\n\nBut there were few signs of any progress towards halting the fighting that has dragged on for more than three years, destroyed large swathes of Ukraine and displaced millions of people.\n\nThe two sides said they would “present their vision of a possible future ceasefire”, according to Russia’s top negotiator, Vladimir Medinsky.\n\nUkraine’s top negotiator, Defence Minister Rustem Umerov, said the “next step” would be a meeting between Ukrainian President Volodymyr Zelensky and Russia’s Vladimir Putin. Russia said it took note of the request.\n\nPutin had declined to travel to Turkiye for the meeting, with Zelensky accusing him of being “afraid” and Russia of not taking the talks “seriously”.\n\nZelensky attended a European summit in Albania on Friday alongside the leaders of France, Germany, Britain and Poland, among others, where he urged a “strong reaction” from the world if the Istanbul talks failed, including new sanctions.\n\nFrench President Emmanuel Macron said European nations were coordinating with the United States on additional sanctions against Russia should Moscow continue to refuse an “unconditional ceasefire”.\n\nBoth Moscow and Washington have talked up the need for a meeting on the conflict between Putin and US President Donald Trump.\n\nTrump has said “nothing’s going to happen” on the conflict until he meets Putin face to face.\n\nDuring the Istanbul talks, a Ukrainian source said that Russia was advancing hardline territorial demands that Ukrainian foreign ministry spokesman Georgiy Tykhy called “unacceptable”.\n\nMoscow claims annexation of five Ukrainian regions — four since its 2022 invasion, and Crimea, which it annexed in 2014.\n\nPublished in Dawn, May 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682909809819b.jpg",
  "retrievedAt": "2025-08-23T14:17:43.322Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911717/nine-killed-in-russian-drone-attack-on-ukraine",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T02:51:46.000Z"
}
