{
  "title": "Marriyum felicitates nation on launch of 1000 KW Digital DRM medium wave transmitter project",
  "link": "https://www.app.com.pk/national/marriyum-felicitates-nation-on-launch-of-1000-kw-digital-drm-medium-wave-transmitter-project/",
  "date_published": "2023-07-30T07:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Sunday congratulated the entire nation especially Radio enthusiasts on launch of the 1000 KW Digital Radio Mondiale (DRM) medium wave transmitter project at Radio Pakistan, Rawat, Rawalpindi.\nA high-power transmitter would be installed in Rawat under the ambitious project, the minister said in a tweet.\nShe said the groundbreaking initiative, set to be completed within two years, marked a significant milestone in the Radio Pakistan’s history and would revolutionize broadcasting capabilities.\nMarriyum extended gratitude to Prime Minister Shehbaz Sharif, Finance Minister Ishaq Dar and Planning Minister Ahsan Iqbal for their unwavering support in this regard.\nShe lauded the efforts of Director General of Radio Pakistan Tahir Hassan and his team for their relentless efforts and dedication to the initiative.\nWith the implementation of the 1000 kilowatt digital DRM medium wave transmitter, she said Radio Pakistan’s reach would transcend borders, resonating in more than 52 countries.\nShe said apart from the subcontinent, audience in Central Asia, Middle East, Far East, Turkey and Greece would now be able to access the Radio Pakistan.\n“Radio Pakistan broadcasts will cover neighboring countries including Nepal, Bangladesh, India, Afghanistan, Iran, UAE, Qatar, Turkmenistan.”\nShe said the modern transmitter, based on DRM technology, had the ability to transmit up to four different signals simultaneously. As a result, the sound quality of Radio Pakistan’s broadcasts would be substantially enhanced, elevating the overall listening experience for audiences.\nMoreover, the cutting-edge technology incorporated in the transmitter would yield significant cost savings for Radio Pakistan, with an estimated 33 percent reduction in electricity consumption.\nShe said 14 out of 20 medium wave of Radio Pakistan had already completed physical age.\nThe minister said the new transmitter would enable timely dissemination of vital information to citizens during natural calamities.\nShe said the Government of Pakistan’s decision to digitalize Radio Pakistan after 75 years had been lauded by the international organization DRM Consortium (UK).",
  "retrievedAt": "2025-08-11T09:01:49.040Z"
}
