{
  "title": "Marriyum Aurangzeb reiterates govt commitment to upgrade PTV, Radio Pakistan",
  "link": "https://www.app.com.pk/national/marriyum-aurangzeb-reiterates-govt-commitment-to-upgrade-ptv-radio-pakistan/",
  "date_published": "2023-07-30T09:22:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 30 (APP): Federal Minister for Information and Broadcasting Marriyum Aurangzeb Sunday reiterated the government’s commitment to upgrade Pakistan Television (PTV) and Radio Pakistan which were indispensable to promoting national heritage and narrative at the global level.\n“The national broadcasting institutions are more than just structures as they hold a paramount position in representing the country’s identity to the entire world,” the minister said while talking to media men after laying the foundation of 1000 KW Digital DRM Medium Wave Transmitter Project at Radio Pakistan, Rawat.\nMarriyum regretted that the previous regime of Pakistan Tehreek-e-Insaf (PTI) was bent upon auctioning the national institutions including Radio Pakistan and others.\nHighlighting the pivotal role of these national broadcasters, she stressed that the government was determined to leverage PTV and Radio Pakistan to enhance Pakistan’s global presence and counter negative narratives about the country.\nAt the outset of the media talk, the minister said Radio Pakistan accomplished a milestone today as the first time in history a Digital Radio Mondiale (DRM) technology had been launched.\nShe said Radio Pakistan was based on analogue and short-wave technology since 1947 and most of its transmitters had already completed their life. The broadcaster was in dire need of DRM as analogue and short-wave technologies became obsolete a long ago, she added.\nMarriyum said Prime Minister Shehbaz Sharif directed Finance Minister Ishaq Dar to release funds for transforming Radio Pakistan on modern lines.\nThe minister extended gratitude to PM, Finance Minister Ishaq Dar, and Planning Minister Ahsan Iqbal for the initiative.\nWith the implementation of the 1000 kilowatt digital DRM medium wave transmitter, she said Radio Pakistan’s reach would transcend borders, resonating in more than 52 countries.\nShe said the initiative would help promote Pakistan’s narrative, news, heritage, and culture across the world. Out of 20 existing transmitters of Radio Pakistan, 14 had already become obsolete.\nThe cutting-edge technology incorporated in the 1000kw medium wave transmitter would yield significant cost savings for Radio Pakistan, with an estimated 33% reduction in electricity consumption, she added.\nMarriyum said the project which was launched today would complete in the next two years.\nShe recalled that a group of arsonists set the Radio Pakistan archive and building on fire in Peshawar on May 9. Similarly, the same people attacked the building of Pakistan Television in 2014.\nThe minister said the building of Radio Pakistan in Peshawar and Chaghi Studio had been restored. Meanwhile, the upgradation of Radio Pakistan was started today.\nIt was a historic initiative that would enable overseas Pakistanis to access the Radio Pakistan broadcast across the world, she maintained.\nThe minister said PTVflix had also been launched by digitalizing the entire archive of Pakistan Television.\nLikewise, the national archive of Radio Pakistan had been digitalized and would be inaugurated by PM Shehbaz Sharif this week.\nShe said apart from the subcontinent, audiences in Central Asia, the Middle East, the Far East, Turkey, and Greece would now be able to access Radio Pakistan.\n“This initiative translates the vision of Prime Minister Shehbaz Sharif regarding digitalization,” she said adding the 1000KW transmitter installation would create job opportunities for the youth by increasing their engagement with Radio Pakistan.She said the initiative would also improve efficiency of the Radio Pakistan.\nMarriyum congratulated Secretary Information Sohail Ali Khan, Director General of Radio Pakistan Tahir Hassan, and all the employees of the national broadcaster on the launch of the project.\nShe said the problems of the employees would be addressed by ensuring the efficient working of institutions and financial viability.\nThe minister said business models for the institutions of the Ministry of Information had been worked out in consultation with the finance ministry which would eventually address pension and salary-related issues of its employees once and for all.\nShe said a media city would be set up in Rawat soon after completion of its feasibility study which was underway.\n“Our vision and mission are aimed at increasing job opportunities and efficiency of Radio Pakistan,” she said, adding this was a reflection of the vision of the PM who wanted the same for other institutions through digitalization.\nMarriyum said, “The Special Investment Facilitation Council (SIFC) has been established with the aim of promoting the development of Pakistan’s institutions and youth.”\nThe country could get rid of its debts and ensure economic stability by attracting investment in various sectors.\nShe said in 2016, Nawaz Sharif charted the country on the path of progress and prosperity by completing the IMF programme for the first time in history. The country could ensure its sustainable development through the use of information technology, she added.\nThe minister said, “Radio Pakistan had been transformed on modern lines today, and our aim is to make such institutions the identity of Pakistan.”\nShe thanked all the ministries that contributed to the digitalization of all the institutions working under the Ministry of Information and Broadcasting.\nTo a query, she said the PM would announce the caretaker set-up after holding a consultation with the opposition leader.\nThe decision to dissolve the parliament would be taken by the coalition government and the prime minister.\nShe said the names of the caretaker prime minister would be made public once it was decided.",
  "retrievedAt": "2025-08-11T09:01:51.406Z"
}
