{
  "title": "Govt initiates ample opportunities for youth to move forwards in IT sectors: Shibli Faraz",
  "link": "https://www.app.com.pk/national/govt-initiates-ample-opportunities-for-youth-to-move-forwards-in-it-sectors-shibli-faraz/",
  "date_published": "2021-11-14T15:21:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 14 (APP):Federal Minister for Science and Technology Shibli Faraz Sunday said that the present government has given ample opportunities to the youth to move forward in the IT sector.\nThis he said during his visit to the two-day Digital Youth Summit organized by the government of Khyber Pakhtunkhwa. Khyber Pakhtunkhwa Minister for Science and Information Technology Muhammad Atif Khan was also accompanied the Federal Minister.\nShibli Faraz while talking to media men lauded the KP government for taking the initiative and involving the youth of Pakistan in such a key Digital Youth Summit.\nHe said”Through this way talented youth can give jobs to others in this field.Much attention is being paid to this sector at federal and provincial levels, and for this a complete eco-system has been created in the field of science and technology.”\nFederal Minister for Science and Technology Shibli Faraz said” Pakistan’s development sector is related to IT but in the past, this sector has been largely ignored.”\nHe said steps have been taken more to address the unemployment and for this the government has taken a key step in providing soft loans to the youth for which incubation centers were being set up and loans are being given to youth on easy installments.\n“We are in government because of the youth and such steps have been taken to address our youth,” Shibli Faraz said.He said”There is a price hike and the government is addressing it through the Ehsaas Rashan Program where the needy and poor people would get relief.”\n“The opposition is misleading the people but the people are well aware and rejected their call for any agitations,” Shibli Faraz said.\n“The opposition are trying to take advantage of the time but they cannot because there are serious differences between PDM ranks as every party either PPP in Sindh or PML (N) in Punjab have own interest,” he addedThe opposition, he said, has no options to talk, address or reduce inflation, however, the federal government through Ehsaas Program has introduced the best packages to control inflation.\n“The current era is of technology, any country thinks about progress, it should adopt and utilize the information technology sector and that is why the present government sensed the importance and kept the IT sector in government priorities,” Shibli Faraz said.\nAnswering a question, Federal Minister Shibli Faraz said EVM must be given space to make elections transparent as all elections have been controversial in the past.\n“Everyone is being briefed about the working of EVM and the Ministry of Science and Technology has worked hard to bring the youth of the province and the country forward through events such as the Digital Youth Summit,” Shibli Faraz said.\nHe said”Easy and fast employment opportunities for youth are possible through promotion of the digital industry in the province. Digital Khyber Pakhtunkhwa is the agenda of the provincial government, which is vital for national progress and we are appreciating such initiative of the provincial government.”He also lauded the provincial government working on connectivity and digital technology training.",
  "retrievedAt": "2025-08-11T21:36:07.708Z"
}
