{
  "title": "KP govt trains 1 lac youth in IT sector: Asad Umar",
  "link": "https://www.app.com.pk/national/kp-govt-trains-1-lac-youth-in-it-sector-asad-umar/",
  "date_published": "2021-11-14T15:13:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 14 (APP):Federal Minister for Planning, Development, Reforms and Special Initiatives Asad Umar said that Khyber Pakhtunkhwa government were trained 100,000 youth in IT sector which would further uplift  IT industry in country.\nHe said this while talking to media men during his visit to the concluding session of the two-day Digital Youth Summit held here at local hotel on Sunday.\nAccompanied by KP Minister for Science and Information Technology Atif Khan, Federal Minister, Asad Umar said that in the last two years the export in the IT sector has been three times increased due to investors’ friendly policies introduced by the government.\n“Pakistan is the 5th largest community in the world in the individual youth community, which is a clear indication of progress of Pakistan in the IT sector,” Asad Umar said.\nThe trust of the foreign investors have been further cemented and billions of dollars investment coming to Pakistan in the IT sector, he said while answering a question. Answering another question, he said, 2.3 million jobs increased in 2018.\n“There are a lot of development opportunities in agriculture in Pakistan and the government has given due attention that is why the crops of wheat, rice, sugarcane have come up in record,” Federal Minister Asad Umar said.\nThe government, he said, was focusing on the sectors which have opportunities for development like agriculture, IT and tourism sectors. He said record harvest of wheat, rice and sugarcane means the government is working on an appropriate line in the agriculture sector in the rural areas and the farmers were getting benefit from such progress.“However, in urban areas, there are opportunities in the construction sector and that is why a new boom is witnessed in the construction sector and all those areas related to construction industries,” said Federal Minister Asad Umar.The construction industry, he said, has grown exponentially due to the interest of the Prime Minister, who himself is looking and monitoring the construction industries.\nFederal Minister Asad Umar has the largest foreign exchange reserves in the history of Pakistan, meaning the country is on the path of development.\n“The Corona threat still exists and urged upon the people to get vaccinations to avert the threat. “If the people do not get vaccinations, there will be danger of corona coming back,” Asad Umar said.“PDM is like a seasonal disease, it will end as soon as the cold ends,” Asad Umar said this while answering a question in a laughing mood.\nWhile appreciating the government of KP, he said, the provincial government is working on connectivity and digital technology training. Training more than 100,000 in the Informational Technology sector in the next one and half years would cost the government Rs 8 billion.\n“There are many opportunities for national and international investors in the IT sector of Khyber Pakhtunkhwa, which is very encouraging,” Asad Umar said.\n” Certainly, the development of the IT sector will boost the digital economy of the province and events like the Digital Youth Summit are of utmost importance for innovative ideas in the digital world,” he added.\nThe youth of Khyber Pakhtunkhwa have the talent to grow in the IT sector and providing digital skills training to graduate and undergraduate youth would enable them to find employment, he said.\nFederal Minister Asad Umar and Shibli Faraz also paid visits to various sections and met with the youth in the Digital Youth Summit.\nThe event was attended by a large number of national and international stakeholders and students specializing in the IT sector",
  "retrievedAt": "2025-08-11T21:36:07.692Z"
}
