{
  "title": "Chairman J&K People’s Freedom League extends Eid greetings to Muslims",
  "link": "https://www.app.com.pk/national/chairman-jk-peoples-freedom-league-extends-eid-greetings-to-muslims/",
  "date_published": "2024-04-09T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 9 (APP):Muhammad Farooq Rehmani, Chairman of J&K People’s Freedom League and former Convener of All Parties Hurriyat Conference AJ&K Chapter, extends his heartfelt Eid greetings to all Muslims who fasted during Ramadan, the month of the Quran’s revelation on Prophet Muhammad (PBUH), offering guidance to humanity.\nTalking to APP, he called on Muslim leaders to reform their policies and mindset, and urged the UN to enforce its Charter and resolutions to prevent the devastating consequences of war perpetuated by inimical powers and their allies. He emphasized that Muslim governments should uphold the principles of Eid and adhere to the teachings of the Quran and Sunnah if they aim to lead the Muslim world.\nRehmani, warned of grave challenges facing Muslims in regions like Palestine, Jammu and Kashmir, and Myanmar. He cautioned against the horrors of racism and fascism, urging vigilance and solidarity.\nHighlighting the reasons behind modern imperialism’s aggression towards Muslims, he emphasized Islam’s global popularity despite organized propaganda by fanatics. This has unsettled imperialist forces, leading to aggressive measures aimed at hindering Islam’s progress and denying humanity its benefits.\nHe compared the tragedy in Jammu and Kashmir to that of Palestine, stating that India’s Modi regime, akin to the Zionist regime, has massacred around one hundred thousand Kashmiri Muslims over the last three decades before annexing Kashmir as a Union Territory.\nHe criticized the abrogation of State laws in Kashmir, including the Residence Law, which now allows non-state Indians to obtain Kashmiri domicile, violating UNSC resolutions and longstanding citizenship laws. Basic human rights and civil liberties are suppressed, turning the state into a concentration camp.\nMaharashtra is the first Indian state to acquire land near Srinagar airport for its own State Bhawan, with other states set to follow. The BJP-led government has established 1,250 schools in the Valley to indoctrinate Muslim children with Hindutva ideology, aiming to replace Islam with Hinduism in Jammu and Kashmir.\nHe stated that killings, both targeted and widespread, are common, with thousands of Kashmiris held in Indian jails for years. The existing laws violate fundamental rights and grant intelligence agencies unchecked authority to arrest Kashmiri youth or charge individuals with treason.\nHe accused India of seeking to destabilize the region through conflict with Pakistan, alongside ongoing oppression of Kashmiris and persecution of its Muslim minority through methods like lynching and the implementation of the newly adopted Citizens Amendment Act (CAA).",
  "retrievedAt": "2025-08-11T01:47:24.713Z"
}
