{
  "title": "NDMA’s advisory forecast rain-thunderstorm, heatwaves for April 2024",
  "link": "https://www.app.com.pk/national/ndmas-advisory-forecast-rain-thunderstorm-heatwaves-for-april-2024/",
  "date_published": "2024-04-09T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 9 (APP): The National Disaster Management Authority (NDMA) on Tuesday issued an advisory warning of rain, dust-storm, thunderstorm, hailstorm and heatwaves across the country due to the weather impact taking place during the month of April.\nIn light of Positive Phase of El Niño Southern Oscillation (ENSO), which is expected to make transition towards Neutral Phase along with the prevailing Neutral Phase of Indian Ocean Dipole (IOD), NDMA Tech Team and Pakistan Meteorological Department (PMD) have predicted that there would be an overall tendency in towards Near Normal Rainfall (against 30 years average from 1991 to 2020) in most parts of the country, a news release said.\nHowever, Northern Half of Pakistan including Khyber Pakhtunkhwa, Northern Punjab and State of Azad Jammu and Kashmir (AJK) are expected to receive slightly above Normal Rainfall during the month of April 2024.\n“Furthermore, it is expected that the Daytime Maximum Temperatures are expected to remain Normal to Slightly Above Normal (against 30 years average from 1991 to 2020) while, Warmer than Normal Minimum Temperatures are expected country-wide with the Maximum Positive Departure in temperature (minimum & maximum) is expected over Northern Parts of the Country especially Northern Khyber Pakhtunkhwa (Chitral, Dir, Kohistan, Shangla, Swat and Malakand), Gilgit Baltistan (all Districts) and State of AJ&K (Neelum),” the NDMA said.\nAgainst the predicted hydro-meteorological conditions which are expected to prevail across the country the following impacts are expected to affect respective parts of Pakistan during April 2024. Temperature gradients expected across the country may cause strong winds, dust-storms, thunderstorms, and hailstorms.\nIt is expected that increased temperatures may lead to heatwave conditions in plain areas of the country especially in Punjab and Interior Sindh. Furthermore, urban areas of the country may face heatwave conditions due to urban heat islands effect, whereas increased temperatures in Northern Pakistan especially in mountainous areas of Khyber Pakhtunkhwa, Gilgit Baltistan and State of AJ&K may lead to avalanches in at-risk / vulnerable snowbound valleys.\nIn light of the increased temperatures across the northern parts of the country, there is an increased risk of GLOF incidents vulnerable valleys of Northern Khyber Pakhtunkhwa, Gilgit Baltistan, and State of AJ&K. It is likely to increased rainfall in Northern Half of Pakistan, including all Districts of Khyber Pakhtunkhwa (with emphasis northern part), Northern Punjab, Gilgit Baltistan and State of AJ&K may lead to flash flooding and landsliding in vulnerable / at-risk mountainous and hilly areas.\nIrrigation water would be required at regular intervals for seasonal vegetables and newly sown Kharif crops and pollen season is expected to come to an end by mid-April 2024.",
  "retrievedAt": "2025-08-11T01:47:26.543Z"
}
