{
  "title": "Spiritually motivated youngsters benefit thousands of needy faithful by arranging iftari during Ramazan",
  "link": "https://www.app.com.pk/national/spiritually-motivated-youngsters-benefit-thousands-of-needy-faithful-by-arranging-iftari-during-ramazan/",
  "date_published": "2024-04-09T17:58:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 09 (APP):TIFL Foundation, a charity organization, formed by a group of youngsters from Peshawar in their novice attempt of gaining maximum spiritual benefits during the prevailing holy month of Ramazan, showed encouraging results of reaching out to thousands of needy faithful by arranging Iftar dinners and providing food packages to them.\n“The objective behind forming TIFL foundation was to do some practical work that reflect true spirit of Ramazan by extending helping hand to needy people in our society,” comments Malik Mohsin, a founding member of TIFL Foundation.\nThe foundation has very few members and all are in their teens, but their sentiments of helping the poor got practical shape with the support of family elders and relatives, Moshin told APP.\nWe started from scratch by accumulating few thousands rupees from our own pockets during initial days of Ramazan and within a few days, hundreds of thousands of rupees starting pouring in from within the country and abroad.\n“The response to our calls through whatsapp messages and a video documentary uploaded on social media was very encouraging, instilling renewed spirit of doing maximum for the support of poor people,” observed Adan Salim, another member of TIFL Foundation.\n“It was a first ever attempt and the result was very inspiring, providing us satisfaction and boosting our resolve of doing more with improved planning in the next Ramazan,” opined Muhammad Ahmad, a university student from Peshawar city.\nOther members in the group are Abudul Muqeet, Moiz Ahmad, Momin, Ali Ahmad Siddique, Abdul Rahim, Shaheer Ahmad, Abdul Mohaiman, Hamad, Musa, Abdullah, Shaheer, Sufiyan, Sanan.\nThe youngsters collected donations and arranged iftar dinners in different locations of Peshawar including at Hayatabad and Warsak Road. TIFL passed One million milestone on 26th Ramadan.\nLarge dastarkhawans were spread on roads in busy areas and passerby were provided eatable items including dates, samosas, pikoars, rice, kababs and sweet drink.\nThe beneficiaries were mostly poor passerby, laborers, drivers of taxies, rickshaws, donkey cart owners, child beggars etc.\nApart from TIFL, a large number of youngsters in Peshawar carried out such activities during Ramazan in different parts of Peshawar.\nBesides arranging iftar dinners, sehri meals were also arranged in different parts of the city providing facility to deserving people of having free food for holding fast.\n“This is the real spirit of Islam and real jihad — to serve the people especially when they need it,” remarked Prof Dr. Abdul Ghafoor, a noted religious scholar and former Director of Sheikh Zahid Islamic Center.\nDr. Ghafoor also appreciated those who extended financial support to these enthusiastic youngsters for doing this noble effort.\nParents and elders should support their youngsters to engage themselves in such activities aimed at extending help and support to needy people.\nThis is true message of Ramazan that everyone should become sensitive for those who cannot afford two time meals and provide them support.\nDr. Ghafoor commended the sentiments and efforts of volunteer members of TIFL who amateur attempt helped in provision of food to thousands of needy people and will have a very positive impact in character building of these youngsters.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:47:39.758Z"
}
