{
  "title": "Shawwal moon sighted, Eid on Wednesday",
  "link": "https://www.app.com.pk/national/shawwal-moon-sighted-eid-on-wednesday/",
  "date_published": "2024-04-09T16:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 9 (APP):The Central Ruet-e-Hilal Committee Chairman, Maulana Syed Muhammad Abdul Khabir Azad on Tuesday announced that the moon of Shawwal-ul-Mukarram has been sighted at various places of the country therefore, Eid-ul-Fitr would be celebrated with traditional fervor across the nation on Wednesday.\nAddressing a press conference along with his respective colleagues of both Central and Zonal Ruet-e-Hilal Committees, he informed that they have received a number of testimonies of moon sighting for Shawwal-ul-Mukarram from various areas of the country.\nAfter evaluating all testimonies in the parameters of Shariah regarding the Shawwal-ul-Mukarram’s moon sighting, Maulana Azad said the committee has reached a unanimous conclusion that the first Shawwal-ul-Mukarram, 1445 AH would fall on Wednesday, April 10, 2024.\nConcluding his remarks, he fervently prayed for the peace, progress, and prosperity of the nation. Additionally, he beseeched for divine intervention for the innocent people of Palestine and the Indian Illegally Occupied Jammu and Kashmir, who have been rendering numerous sacrifices in pursuit of their just resolutions.\nA pivotal meeting of the national moon sighting body was held to determine the sighting of Shawwal-ul-Mukarram moon at the Ministry of Religious Affairs and Interfaith Harmony. Headed by Maulana Azad, the meeting witnessed the participation of esteemed members from various institutions, including the Ministry of Science and Technology, the Pakistan Meteorological Department, and the Space and Upper Atmosphere Research Commission (SUPARCO).\nAmong the notable attendees were Religious Affairs Ministry Director General Syed Mushahid Hussain Khalid, along with prominent figures such as Allama Muhammad Dr. Hussain Akbar, Mufti Fazl Jamil Rizvi, and Maulana Muhammad Yasin Zafar, among others.\nZonal members from Islamabad, Lahore, Karachi, Quetta, and Peshawar also contributed to the deliberations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:47:41.094Z"
}
