{
  "title": "Baroness Warsi, SAPM Malik prioritize gender equality, poverty reduction",
  "link": "https://www.app.com.pk/national/baroness-warsi-sapm-malik-prioritize-gender-equality-poverty-reduction/",
  "date_published": "2023-04-25T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): Baroness Sayeeda Warsi, a current Member of the House of Lords and former co-Chairwoman of the UK’s Conservative Party, recently discussed with Special Assistant to the Prime Minister (SAPM) Muhammad Jawad Sohrab Malik the importance of serving the public interest and expanding the scope of charitable work for the betterment of humanity.\nAt a reception hosted by Special Assistant to the Prime Minister (SAPM) Muhammad Jawad Sohrab Malik at his residence in Islamabad, Baroness Sayeeda Warsi and SAPM Malik, exchanged ideas on how to enhance the impact of charitable initiatives and address the needs of the community more effectively.\nThey exchanged ideas, goals, and visions for providing equal opportunities to the masses at all levels.\nThe meeting was an opportunity for both dignitaries to discuss their shared commitment to promoting equality and serving the public interest.\nSAPM Malik, who comes from Gujar Khan – the ancestral home of both individuals – also runs a charity organization called the Sohrab Foundation. During the reception, he praised Baroness Warsi for her philanthropic work in the Gujar Khan district, where she has been working towards poverty alleviation and promoting girls’ education through the empowerment of women.\nThe two discussed the importance of such efforts and the need to continue supporting initiatives that uplift marginalized communities.\nThe British MP Sayeeda was in Pakistan on a philanthropic visit to Gujar Khan, while running a charity foundation based in village of Bewal in Gujar Khan which is focused on supporting various charitable initiatives aimed at promoting community development and social welfare.",
  "retrievedAt": "2025-08-11T08:22:34.757Z"
}
