{
  "title": "Roundtable on “Pahalgam Attack and Indus Waters Treaty Suspension” calls for legal, strategic reassessment",
  "author": null,
  "content": "ISLAMABAD, Apr 30 (APP): In the wake of the recent Pahalgam attack and rising tensions over the suspension of the Indus Waters Treaty (IWT), a high-level roundtable discussion was convened at the Institute of Regional Studies (IRS)to examine the legal, geopolitical, and humanitarian dimensions of the issue.\nThe event brought together prominent law, hydrology, international relations, and media experts to deliberate on the implications of India’s recent actions and explore strategic responses for Pakistan.\nAmbassador Jauhar Saleem, President of IRS, opened the session by strongly condemning the Pahalgam attack, a sentiment echoed by the international community, including Pakistan.\nHe emphasised the historical and geopolitical complexity of the IWT and underlined the potential dangers of escalating tensions in a nuclear-armed South Asia.\nDr. Hasan Abbas detailed the hydro-political history of the region, highlighting legal precedents, the Tennessee Valley Authority model, and violations of international norms since 1948.\nHe argued that the IWT disproportionately favoured India and that its suspension could offer Pakistan a chance to reassert its rights under international law. Dr. Serena Hussain, who represents the Kashmiri diaspora in the United Kingdom, explored the legal and media optics, drawing parallels to international cases like Gaza.\nShe stressed the importance of narrative control and the impact of AI-driven imagery in shaping global opinion, while noting Pakistan’s current disadvantage in the information war.\nMr. Jamal Aziz, Executive Director of the Research Society of International Law, advocated for pursuing legal avenues under the Vienna Convention and customary international law.\nHe emphasised seeking advisory opinions from the International Court of Justice and engaging global water-dispute observers to highlight environmental and humanitarian concerns.\nDr. Mobeen Shah, former president of Jammu and Kashmir Chamber of Commerce, living in exile, in Turkey, urged renewed international legal action, including reopening the Kashmir issue at the UN and securing rightful ownership of the western rivers for Kashmiris.\nDr. Ashraf Wani, a Kashmiri journalist, said that it was practically impossible to reach Pahalgam without ‘intentional’ security lapse.\n“India’s blame on Pakistan is a blatant lie.”\nHe criticised biased media portrayals and false flag operations, warning against shifting focus from critical internal matters like the Waqf Bill, emphasising the importance of pre-emptive over reactive policy.\nSheikh Waleed Rasul, professor from Ripah University, called for the formation of a Lower Riparian Alliance and stressed that Kashmir was the root cause behind water conflicts; it needs to be resolved to ensure peace in the future.\nMr. Altaf Hussain Wani warned of India’s regional ambitions, equating its actions to the Israeli model of occupation.\nHe expressed concerns over the future of Kashmir and emphasised the role of international pressure in reversing unilateral actions.\nThe roundtable concluded with a unified call for Pakistan to adopt a comprehensive legal, strategic, and narrative-driven approach in response to the evolving crisis.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:03:47.414Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/roundtable-on-pahalgam-attack-and-indus-waters-treaty-suspension-calls-for-legal-strategic-reassessment/",
  "dateList": "2025-04-30",
  "date_published": "2025-04-30T10:28:00.000Z"
}
