{
  "title": "Credible intelligence shows India intends military action against Pakistan in next 24-36 hours: Tarar",
  "author": null,
  "content": "ISLAMABAD, Apr 30 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on late Tuesday said the “credible intelligence” reports indicated to the Indian nefarious plans of conducting a military action against Pakistan in next 24 to 36 hours, which he said, would have “catastrophic consequences for the entire region and beyond”.\n“Pakistan has credible intelligence that India intends carrying out military action against Pakistan in the next 24-36 hours on the pretext of baseless and concocted allegations of involvement in the Pahalgam incident,” said the minister while speaking to the media.\nHe said Pakistan vehemently rejected “Indian self-assumed hubristic role of Judge, Jury and Executioner in the region” which is completely “reckless”.\n“Pakistan has been the victim of terrorism itself and truly understands the pain of this scourge,” he said, adding “We have always condemned it in all its forms and manifestations anywhere in the world.”\nBeing a responsible state, he said Pakistan open heartedly offered a credible, transparent and independent investigation by a neutral commission of experts to ascertain the truth.\n“Unfortunately, rather than pursuing the path of reason, India has apparently decided to tread the dangerous path of irrationality and confrontation, which will have catastrophic consequences for the complete region and beyond,” the minister stressed.\nHe said “evasion of credible investigations is in itself sufficient evidence exposing India’s real motives.” “Consciously making strategic decisions hostage to public sentiments, purposefully trumped up for securing political objectives, is unfortunate and deplorable,” the minister added.\nHe said Pakistan reiterated that any such military adventurism by India would be responded to assuredly and decisively.\n“The International community must remain alive to the reality that the onus of escalatory spiral and its ensuing consequences shall squarely lie with India,” Tarar emphasized.\nHe reiterated the nation’s resolve to defend the sovereignty and territorial integrity of Pakistan at all cost.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:04:35.455Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/credible-intelligence-shows-india-intends-military-action-against-pakistan-in-next-24-36-hours-tarar/",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T21:12:00.000Z"
}
