{
  "title": "Pakistan to enter new era of prosperity through digital transformation: Shaza",
  "author": null,
  "content": "ISLAMABAD, Apr 30 (APP):Federal Minister for Information Technology and Telecommunication Shaza Fatima Khawaja on Wednesday reaffirmed the government’s commitment to accelerating digital transformation in Pakistan, saying it will lead the country into a new era of progress, prosperity, investment, employment, and transparency.\nSpeaking at a press conference following the conclusion of the two-day Digital Direct Investment Forum (DDIF) along-with Secretary General of the Digital Cooperation Organization (DCO), Deemah AlYahya , she said prudent government policies have already resulted in a 25% increase in IT exports, and Pakistan is expected to reach $4 billion in IT exports during the current fiscal year (July 2024 to June 2025), up from $3.2 billion last year—a 27% growth.\nThe minister highlighted that the Ministry of IT is actively driving the national digital agenda under the leadership of Prime Minister Muhammad Shehbaz Sharif.\nThe minister said the government aims to generate $15 billion through direct IT exports and products, and an additional $10 billion in economic impact through the National Digitalisation Program.\nShaza Fatima said the DDIF served as an important platform for engaging international partners and attracting investments. “Participants at the forum have pledged nearly $700 million investments in Pakistan’s digital sector,” she reiterated.\nAlso speaking on the occasion, Secretary General of the Digital Cooperation Organization (DCO), Deemah AlYahya, expressed strong support for Pakistan’s digital journey.\nShe shared that more than 30 ministers and government delegations from different countries attended the forum, along with over 100 CEOs of IT companies, 400 local firms, and more than 70 national and international investors.\nShe thanked the Ministry of IT, the Pakistan Software Export Board (PSEB), and other partners for successfully organizing the forum. “We congratulate Pakistan on holding such an impactful event,” she said. “Pakistan is emerging as a leader in digital foreign direct investment, and its IT sector plays a key role in the country’s economic development.”\nShe said that the next edition of the DCO would be held in Islamabad next year, promising even greater engagement and collaboration.\nPraising the leadership of Prime Minister Shehbaz Sharif and Minister Shaza Fatima Khawaja, she emphasized that development must move forward and that Pakistan’s digital revolution is crucial.\nCalling Pakistan her “second home,” she pledged her continued commitment to supporting the development and prosperity of the Pakistani people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:03:45.156Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-to-enter-new-era-of-prosperity-through-digital-transformation-shaza/",
  "dateList": "2025-04-30",
  "date_published": "2025-04-30T12:39:00.000Z"
}
