{
  "title": "Aleem Khan & Türkiye envoy visit NUST, inaugurate ‘Anadolu Creator Lab’",
  "author": null,
  "content": "ISLAMABAD, Apr 30 (APP):Federal Minister for Communications Abdul Aleem Khan on Wednesday expressed his satisfaction over the international standard academic and research facilities provided at the National University of Sciences & Technology (NUST) and termed it a state-of-the-art educational institution and a source of national pride.\nHe said this while inaugurating the ‘Anadolu Creator Lab’ at NUST, established in collaboration with Türkiye. He was accompanied by Turkish Ambassador to Pakistan, H.E. Irfan Neziroglu, Director General NUST Projects, Major Gen. Dr. Saeed-ur-Rehman and Country Head Dr. Saliha, said a press release.\nHe further said that graduates from NUST have brought recognition to their alma mater at the global level and that such institutions are vital assets of the country.\nThe minister said that there is no doubt Pakistan must advance in the field of Science and Technology to stand on par with developed nations. He appreciated the role of both Pakistani and international students studying at NUST in preserving the country’s strong academic traditions.\nIn his address, Federal Minister Abdul Aleem Khan remarked that in terms of quality, Pakistani educational institutions are in no way behind. He praised the immense talent of the country’s youth, stating that NUST’s global recognition is a clear testament to Pakistan’s academic strength. He added that there is significant potential for public and private sectors to get benefit from this University’s capabilities and pledged to play an active role in facilitating such engagements.\nFederal Minister shared that his visit reaffirmed his belief in a bright and prosperous future for the nation. He expressed full confidence in the abilities of Pakistan’s educated and able youth to compete successfully on any platform.\nDuring his visit, Federal Minister Abdul Aleem Khan expressed keen interest in the operations of the National Center for Artificial Intelligence (NCAI) at NUST and commended the commitment of its dedicated staff.\nHe also visited the Turkish Aerospace Industries unit and the Green Tech Hub where he observed a variety of products made from recycled waste materials. At NUST, Director Emaad Ahsan, senior faculty members and heads of various departments briefed the Federal Minister on the University’s ongoing projects and international collaborations. It was highlighted that NUST not only serves the national domain but also delivers services and products to global markets. The University’s achievements have been acknowledged at multiple international forums. In addition, Dr. Syed Irtza Shah, Mrs. Dilshad Senoel and Dr. Usman Hassan also extended individual briefings on their respective departments and appreciated the Federal Minister’s visit, calling it a highly encouraging gesture.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:03:16.762Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aleem-khan-turkiye-envoy-visit-nust-inaugurate-anadolu-creator-lab/",
  "dateList": "2025-04-30",
  "date_published": "2025-04-30T14:00:00.000Z"
}
