{
  "title": "Awareness-raising seminar titled “Save Indus Delta” held at SU Jamshoro",
  "author": null,
  "content": "HYDERABAD, Apr 30 (APP):Awareness-raising seminar titled “Save the Indus Delta” was organized by the final year students of the Center for Rural Development Communication (CRDC), a subsidiary of the Department of Mass Communication, University of Sindh, Jamshoro, on Wednesday.\nThe objective of the event was to provide awareness about the environmental, historical and legal status of the Indus Delta and to create awareness among the students about water conservation.\nThe seminar was attended by teachers, students and relevant faculty members of CRDC and the Mass Communication Department.\nThe participants discussed the threats, environmental impacts and water scarcity issues facing the Indus Delta from various angles.\nThe special guests of the event included Dr. Mukhtiar Mahar, Rumisa Jami Chandio, Sanam Kaburo, Riaz Rajpar and Dr. Asghar Ali, who spoke eloquently on the main topic of the seminar.\nDr. Asghar Ali said in his address that if water is not used safely and systematically, the Indus Delta may suffer severe environmental destruction, which will have an impact not only on flora and fauna but also on human life.\nHe stressed that an effective message should be disseminated in the society through this academic platform of Sindh University, and that the relevant institutions should take concrete steps to protect the legal rights of the Indus Delta.\nIn the seminar, the students presented creative poems on the topic, highlighting the importance of water and the Indus River.\nThe audience highly appreciated the serious efforts of the students and the research-based material.\nIn their speeches, the speakers also shed light in detail on the challenges facing the Indus Delta such as the destruction of mangroves, land erosion and the effects of the continuous decline in water levels.\nThey said that the Indus Delta is an important center of the ecological balance not only of Sindh but also of the entire country, for the protection of which serious and effective measures are indispensable.\nIn the end, Director CRDC, Dr. Rashid Ali Khadro thanked the guests and participants and said that the participation of the esteemed guests not only highlighted the importance of the seminar but also provided valuable and informative material to the students, which would be helpful in further enhancing their educational and research skills.\nHe emphasized that the continuation of such educational events for environmental protection is the need of the hour.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:02:24.358Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/awareness-raising-seminar-titled-save-indus-delta-held-at-su-jamshoro/",
  "dateList": "2025-04-30",
  "date_published": "2025-04-30T17:31:00.000Z"
}
