{
  "title": "Additional funds to erstwhile FATA may be proceed once report of sub-committee finalized: Minister",
  "link": "https://www.app.com.pk/national/additional-funds-to-erstwhile-fata-may-be-proceed-once-report-of-sub-committee-finalized-minister/",
  "date_published": "2024-09-13T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): Minister of State for Finance and Revenue, Ali Pervaiz Malik, informed the National Assembly on Friday that the provision of additional funds to the erstwhile Federally Administered Tribal Areas (FATA) under the National Finance Commission (NFC) award may proceed once the report of the sub-committee is finalized.\nWhile responding to a calling attention notice in the House, the minister said that the Rs 118 billion allocated for the former FATA should undergo an audit.\nHe recalled that in 2015, then-Prime Minister Nawaz Sharif announced funds for Internally Displaced Persons (IDPs) in Khyber Pakhtunkhwa (KP), with the province receiving more than the initially pledged amount.\nAli Pervaiz explained that Rs 95 billion was initially earmarked for IDPs, but a total of Rs 118 billion was provided to KP. Following the FATA merger, an additional Rs 120 billion was disbursed to the province.\nThe minister further noted that both the caretaker government and the Senate Committee have recommended an audit to ensure the proper use of the funds.\nAt the time of FATA’s merger, it was decided that an additional 3 percent of funds would be allocated under the NFC award.\nA sub-committee, led by the Chief Minister of Khyber Pakhtunkhwa and guided by Sartaj Aziz, was established to oversee this process. However, the committee’s report has not yet been submitted, and actions will follow its completion.\nAli Pervaiz highlighted that, during their tenure, federal governments had provided more funds to Khyber Pakhtunkhwa than its own provincial government.\nIn 2018, the PTI-led federal government allocated Rs 88 billion to the province, followed by Rs 104 billion in both 2020 and 2022.\nHe further noted that the current Pakistan Muslim League-Nawaz government has disbursed Rs 110 billion to the province for ongoing expenses and needs.\nSince the 7th NFC award, Khyber Pakhtunkhwa has received over Rs 5,000 billion in total funds.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:04:19.590Z"
}
