{
  "title": "Applications open for Scotland-Pakistan scholarships for females",
  "link": "https://www.app.com.pk/national/applications-open-for-scotland-pakistan-scholarships-for-females/",
  "date_published": "2024-09-13T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP):The Higher Education Commission (HEC) has announced that the applications for the British Council administered Scotland Pakistan Scholarship for females are now open for 2024-25.\nAccording to the HEC, this scholarship funds Bachelor’s and Master’s/MPhil studies for Pakistani women in any HEC recognized university across Pakistan.\nFunded by the Scottish Government, these grants aim to make higher education more accessible to women, supporting them in achieving their potential and ambition.\nBritish Council administers the scheme in Pakistan and coordinates with selected scholars and universities either directly or through nominated university focal persons.\nThe Deputy Director British Council Pakistan, Maarya Rehman said, “The Scottish Scholarship Scheme is a vital part of our work in supporting the educational aspirations of young women and girls in Pakistan. We are supporting them to gain the skills, confidence, and connections that will help to transform their lives and shape a better and more prosperous Pakistan.”\nThe scholarship will cover a two-year master’s/MPhil or four-year bachelor’s degree at an HEC-recognised Pakistani university in one of the following subject areas only: Education, Sustainable Energy, Food Security and Agriculture, Health Sciences and STEM (Masters only).\nThese scholarships are open to female applicants only. In addition, applicants must be Pakistani nationals currently residing in Pakistan. The applicant must be pursuing a two-year master’s or four-year bachelor’s degree in the listed subject areas.\nThe candidates should hold a confirmed admission offer from an HEC recognised university in Pakistan. Young women with disabilities, from rural areas and/or minority groups are encouraged to apply.\nThe last date to apply is 30 September 2024.\nTo apply students can visit https://bit.ly/scopk2024 and fill in the online form and application.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:03:56.736Z"
}
