{
  "title": "FIA to probe posts from PTI founder’s social media accounts against national security: Tarar",
  "link": "https://www.app.com.pk/national/fia-to-probe-posts-from-pti-founders-social-media-accounts-against-national-security-tarar/",
  "date_published": "2024-09-13T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Friday said the Federal Investigation Agency would probe into the handling of the PTI founder’s social media accounts which were being used to create chaos and anarchy in the country, and undermining the national security.\n“He (the PTI founder) should be ashamed of undermining the national security, inciting people for anarchy and committing the sedition,” said the minister while talking to the media.\nTarar said the FIA had decided to investigate into the handling of the social media accounts of the jailed PTI founder. It would be ascertained that who is the handler of his social media accounts, and whether such posts were being made on his behest or it was done on directives of someone else, he added.\nHe said a botch attempt had been made to conspire against the sitting chief justice and heads of other institutions. Through these posts, he tried to mobilize the people against two major state institutions which is highly condemnable.\nThe minister said this conspiracy is destined to fail as his accusations against the interior minister and others had nothing to do with the reality.\nThe PTI founder had all the facilities like a presidential suit in the jail, but yet he still resorted to attack the state institutions, he said, adding nobody would be allowed to do so at any cost.\nHe said the FIA would inquire into this issue and the PTI founder would be investigated in this regard.\nThe minister said the message posted on the social media from the account of the PTI founder was tantamount to sedition, and creating an anarchy in the country.\nHe said the PTI founder, in the post, had once again related himself with Sheikh Mujeeb-ur-Rehman, but he seemed to be elusive about the current situation in Bangladesh where the latter’s statues were demolished by the people after realizing the truth about history.\nThe minister said the examples quoted by the PTI founder in his social media posts were condemnable. “There will be an investigation as to who is running the accounts of the PTI’s founder on social media,” he noted.\nThe PTI has always targeted journalists, attacked them, launched smear campaigns against them on social media, said the minister, adding this party had completely resisted and discouraged the difference of opinion during their government’s tenure.\nHe called the PTI as “Tehreek-e-Intishar” which always encouraged its workers to resort to accusations, attack and abuse if anybody disagreed to them in any case whatsoever.\nThe minister recalled the harassment of a female journalist by the PTI during one of its public gatherings in Lahore. Another journalist Sadaf which was hit by a container and got killed during one of the rallies of the PTI founder.\nThere are multiple instances which reflected their dirty mindset of harassing and assaulting the female journalists, he said, pointing out the most recent badmouthing by the Khyber Pakhtunkhwa Chief Minister in a public gathering.\n“Being the Information Minister, I believe this is very inappropriate and the entire PTI should apologize unconditionally for the slogans raised in the PTI’s recent public gathering, as well as the statements made by KPK CM Ali Amin Gandapur against the female journalists.\nHe asked whether the sitting chief minister of one province was supposed to use foul language against the CM of another province and the state institutions.\nTarar condemned the use of derogatory language by the CM KPK against an institution which has been rendering numerous sacrifices to protect the lives of the people and restore peace in the KPK.\nBrushing aside the notion that the PTI’s Parliamentarians were abducted outside of the Parliament by some face-covered people, he said it could be seen in the videos on social media that the police had arrested them.\nHe regretted that the PTI has been trying to drag the institutions in every other issue.\nThe minister recalled that the PTI used to celebrate the arrest of every opposition leader who were sent behind the bars on the basis of fake cases that were orchestrated by the PTI founder together with the former Spy Chief Faiz Hameed during their tenures.\nAs regards the IMF programme, the minister said the deal with the International Monetary Fund is in final process.\nHe said inflation has reached to single digit, exports were increasing and current account deficit is under control with all the economic indicators were on upward trajectory.",
  "retrievedAt": "2025-08-10T21:03:06.683Z"
}
