{
  "title": "Parliamentarians lauded govt for providing facilities at ICT schools",
  "link": "https://www.app.com.pk/national/parliamentarians-lauded-govt-for-providing-facilities-at-ict-schools/",
  "date_published": "2024-09-13T12:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP):Parliamentarians including MNAs Muhammad Javed Hanif Khan, and Syed Amin Ul Haque, on Friday visited schools in the Islamabad Capital Territory (ICT) and lauded government initiatives of providing missing facilities in educational institutions.\nThey commended the efforts of Secretary of Ministry of Federal Education and Professional Training, Mr. Mohyuddin Ahmed Wani, who played a key role in the project’s development, showed particular interest in the improvements made to the colleges and schools.\nThe extensive renovation includes a state-of-the-art computer lab equipped with 40 computers, a fully furnished library, a new gym with modern machines, a dispensary, smart classrooms, updated washroom facilities, and a refreshed exterior of the main building, Foreign language courses, Mind games and SMART classrooms, School meal programs, E-Rozgar schemes, Tech fellows program, and Football courts.\nDuring their visit, the delegation interacted with students and teachers, asking questions and receiving positive feedback.\nThey expressed satisfaction with the educational environment and praised the efforts to uplift educational standards in Islamabad’s public-sector schools.\nThe delegation appreciated Secretary education Mr. Wani for his dedication to improving the public education sector and making it more attractive to local residents.\nThe parliamentarians were impressed by the transformative work accomplished in ICT, particularly in public schools.\nThe delegation was overwhelmed by the progress and encouraged the “Minister of Education and Secretary Education” to continue their exemplary efforts.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:04:17.959Z"
}
