{
  "title": "Pakistan’s inclusion in top tiers of Global Cybersecurity Index good news for IT industry: Shaza Fatima",
  "link": "https://www.app.com.pk/national/pakistans-inclusion-in-top-tiers-of-global-cybersecurity-index-good-news-for-it-industry-shaza-fatima/",
  "date_published": "2024-09-13T13:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP):State Minister for Information Technology and Telecommunication, Shaza Fatima Khawaja said on Friday that Pakistan’s inclusion in the top tiers of the International Telecommunication Union (ITU) 2024 Global Cybersecurity Index (GCI) report is good news for the country’s IT industry.\nAddressing a press conference she said that Pakistan position in ITU-2021 Global Cyber security was at 79 while in the current report, Pakistan ranked among the Top-tier 46 countries.\nShe said that the report indicated that Pakistan’s legal, technical, capacity development, skill development and organizational advancement are role models.\n“The Global Cybersecurity Index 2024 shows significant improvements by countries that are implementing essential legal measures, plans, capacity building initiatives, and cooperation frameworks, especially in strengthening incident response capabilities,” the report said.\nThe report placed 46 countries in Tier 1, the highest of the five tiers, reserved for “role modelling” countries that demonstrate a strong commitment in all five cybersecurity pillars.\n“Pakistan has performed exceptionally well in the latest ranking and has been placed in Tier 1, alongside countries like the United States, Japan, Singapore, Australia, Saudi Arabia, and Malaysia,” she said.\nShe said, “It is an honor for the nation and the IT industry that Pakistan is now included in the top tiers of cybersecurity,”.\nShaza Fatima also acknowledged the collective efforts of various departments, including Pakistan Telecommunication, the Special Investment Facilitation Council (SIFC), the Ministry of Planning Commission, the Ministry of Defence, law enforcement agencies, and the Federal Investigation Agency (FIA), in achieving this milestone.\nShe expressed gratitude to the provinces and all stakeholders for their contributions and support in strengthening Pakistan’s cybersecurity infrastructure and promoting digital advancement across the country.\nShaza Fatima Khawaja expressed her gratitude to Prime Minister Shehbaz Sharif for his pivotal role in achieving the historic goal. She highlighted his unwavering support and keen interest in the IT sector, emphasizing that his leadership has been instrumental in advancing Pakistan’s position in the global cybersecurity landscape.\nShe also acknowledged his efforts in ensuring policy continuity, which played a crucial role in this remarkable achievement.\nShe noted that the continuity of policies during both the PDM and interim governments has paid off.\nShe also outlined measures taken by the Ministry of Information Technology that contributed to this achievement. She noted that young people are being trained in cybersecurity, which is now a leading field for global job opportunities.\nThe minister mentioned that for the first time, **Google has invested in Pakistan** and plans to manufacture Chromebooks in the country.\nShe said Islamabad is set to become a **”Model Digital City”**, aiming to integrate advanced technology for the benefit of residents. The project, which will serve as a pilot initiative, will enable citizens to access over 150 government services through a new App.\nThis app will offer various services from the Capital Development Authority (CDA), Islamabad Police, health services, and educational institutions. It will also feature an e-parking facility to improve parking management in the city.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:03:53.362Z"
}
