{
  "title": "Asif urges SIC to express regret over past action, misbehave to take a new start",
  "link": "https://www.app.com.pk/national/asif-urges-sic-to-express-regret-over-past-action-misbehave-to-take-a-new-start/",
  "date_published": "2024-09-13T13:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP):Minister for Defense Khawaja Muhammad Asif on Friday urged the Sunni Ittehad Council (SIC) lawmakers to express regret and tender an apology for their past actions and misbehave to take a new start.\nSpeaking in the National Assembly on a point of order, the minister categorically clarified that the committee formed by the Speaker is not merely to address the concerns or narrative of any political party but rather for upholding the sanctity of the House and strengthen its narrative.\nThe minister highlighted that the committee was set following a suggestion of Chairman Pakistan Peoples Party (PPP) Bilawal Bhutto Zardari.\nHowever, he expressed concern over the proceeding of the committee as it seemed that it was set up to address PTI’s concerns.\nReferring to the incident that occurred two days ago, Khawaja Asif said that everyone protested and expressed solidarity with PTI as no one supported an attack on the Parliament. The minister said that he recorded his protest during the committee meeting and recused himself from being a member of the committee besides suggesting his party to appoint someone else.\nReferring to such past incidents, he questioned whether anyone supported them, when Members National Assembly (MNAs) were taken into custody from the Parliament Lodges, or when Nawaz Sharif was not allowed to communicate with his ailing wife Kalsoom Nawaz despite numerous requests.\nKhawaja Asif also pointed out that derogatory remarks passed by Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur about a mother and daughter were largely condemned by his party members.\nHe questioned whether the National Accountability Bureau (NAB) had been misused by the then government.\nThe minister also recalled the siege of the Parliament House during 2013 and the attack on PTV.\nKhawaja Asif also referred to the cases filed against the former prime minister’s daughters and the seeds of enmity that were sown, stating that if a new beginning is to be made, there must be an expression of remorse for the past.\nThe minister also mentioned that before the dissolution of the assembly and no-confidence motion, dozens of bills were passed in just 20 minutes.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:03:55.349Z"
}
