{
  "title": "Arsenio Dominguez sees huge potential in Pakistan’s Maritime sector",
  "link": "https://www.app.com.pk/national/arsenio-dominguez-sees-huge-potential-in-pakistans-maritime-sector/",
  "date_published": "2024-09-13T17:15:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 13 (APP):The Secretary General of the International Maritime Organization Arsenio Dominguez arrived on his two-day visit to Karachi to attend the International Maritime Sustainability Exhibition and Conference (IMSEC).\nAfter the inaugural session of the conference, he paid a visit to the different departments of the Ministry of Maritime Affairs. The SG IMO visited the Oil Pipeline Terminal 2 and South Asia Pakistan Terminals Limited (SAPT) of Karachi Port Trust (KPT) where he was briefed about the port operations and digitization process of the port.\nArsenio also visited the KPT administered Hospital facility and reached Port House KPT where he planted mangroves saplings. The SG was accompanied by Federal Minister for Maritime Affairs Qaiser Ahmed Shaikh, Chairman KPT, and other officials.\nSpeaking at the venue, Arsenio Dominguez said that considering the vast coastal line, deep sea, strategic trade location, and magnanimous ports, Pakistan has huge potential in the maritime sector.  He said that Pakistan can contribute to the world seafaring industry in multiple ways and it can serve as a gateway for many other nations.\nSpeaking about Pakistan’s compliance with the global maritime protocols, specifically IMO regulations, he expressed satisfaction with Pakistan’s compliance with the IMO regulations. In addition to this, Pakistan has one of the biggest ship-breaking industries, the Secretary-General IMO showed satisfaction over Pakistan’s compliance with the Hong Kong Convention about Ship-breaking.\nAfter planting Mangrove saplings at the KPT Port House, Arsenio appreciated Pakistan’s efforts to contribute to the efforts against global warming and its investment in preserving one of the biggest mangrove forests in the world.\nHe urged all other nations to follow the trend and preserve our ecosystem. He thanked Pakistan for the warm welcome and hospitality and expressed that he looks forward to further visits to Pakistan.\nSpeaking to the media, Federal Minister for Maritime Affairs Qaiser Ahmed Shaikh said that Pakistan is slowly coming out of the financial woes as our exports are growing, remittances are increasing, and interest rates are being turned down. Government under Prime Minster Shahbaz Sharif was making all efforts to revive the economy but it was not a handed job as we all have to strive collectively, he added.\nSpeaking about Gawadar Port, the minister said that to boost trade activities and create job opportunities in Balochistan, the Federal Cabinet had decided to import 50 percent of the cargo via Gawadar Port.\nTalking about Pakistan’s contribution to the efforts in climate change, Qaiser Ahmed said that Pakistan contributes less to the emission of greenhouse gases yet it is one of those nations that were badly affected due to it. Plantation of trees shows Pakistan’s commitment to fighting climate change, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:03:05.812Z"
}
