{
  "title": "HEC, Pink Ribbon join hands to create breast cancer prevention awareness",
  "link": "https://www.app.com.pk/national/hec-pink-ribbon-join-hands-to-create-breast-cancer-prevention-awareness/",
  "date_published": "2024-09-13T13:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP):The Higher Education Commission (HEC), Pakistan and Pink Ribbon Pakistan have signed a Memorandum of Understanding (MoU) to collaborate on raising awareness about breast cancer in educational institutions across the country.\nPakistan has the highest prevalence of Breast Cancer in the whole of Asia with over 10 million women are at risk of Breast Cancer while more than 40,000 women die from this disease every year in Pakistan. The situation presents an alarming picture with a dire need to create mass awareness of breast cancer.\nHEC and Pink Ribbon Pakistan will celebrate the whole month of October marked as ‘PINKtober’ to create awareness on the prevention, early diagnosis and treatment of Breast Cancer across the country.\nAn awareness campaign will be launched to educate university students on Breast Cancer. A wide range of awareness activities will be conducted in educational institutes as part of the campaign to mobilize the youth and help them become the torchbearers to spread the word in society.\nHEC aspires to save every mother, sister, wife and daughter in Pakistan from the havoc of Breast Cancer and urges everyone to play their role in the fight against this deadly disease.\nThe signing ceremony was held at HEC Secretariat in Islamabad. Managing Director, National Academy of Higer Education (NAHE), Noor Amna Malik and CEO of Pink Ribbon Pakistan, Omer Aftab signed the agreement. Executive Director of HEC, Prof. Dr. Zia Ul-Qayyum graced the occasion as chief guest.\nSpeaking on the occasion, Dr. Zia Ul-Qayyum said, “We believe that by engaging educational institutions, we can significantly reduce the stigma associated with this disease and promote a culture of awareness and prevention.”\nNoor Amna Malik emphasized the importance of this partnership, stating that cases of breast cancer are increasing in the country and it is essential for our higher education sector to play an active role in promoting awareness. “Through this MoU, we aim to equip students, faculty, and communities with the knowledge needed to fight this disease”, she added.\nPink Ribbon Pakistan also agreed to provide breast cancer diagnostic and treatment support to the staff of HEC at both the head office and regional offices in their respective cities. All services will also be available to HEC staff at Pink Ribbon Hospital Lahore. Pink Ribbon will provide HEC staff with highly subsidized chemotherapy as and when required.\nThe initiative will include preventive awareness sessions for faculty members, awareness workshops for students, and the distribution of educational materials across universities nationwide.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:04:14.675Z"
}
