{
  "title": "First ever coordination meeting of UNESCO Chair Holders across Pakistan held",
  "link": "https://www.app.com.pk/national/first-ever-coordination-meeting-of-unesco-chair-holders-across-pakistan-held/",
  "date_published": "2024-09-13T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): The UNESCO Chair on Knowledge Systems for Integrated Water Resources Management (IWRM), COMSATS University Islamabad (CUI) Wah Campus hosted the first ever coordination meeting of all eight UNESCO Chair Holders across Pakistan and celebrated the International Literacy Day 2024.\nThe main objective of the event was to unify expertise and wisdom of all UNESCO Chairs across Pakistan working in various dimensions and multidisciplinary areas and how the same could address the global challenges faced by Pakistan in specific and global communities at large for sustainable development of the societies, a press release said.\nProf. Dr. Muhammad Abid, Director Campus/UNESCO Chair on Knowledge Systems for IWRM, welcomed Antony Kar Hung Tam, Officer-in-Charge in UNESCO Office Pakistan and his team, officers from Pakistan National Commission on UNESCO and all UNESCO Chair’s Holders across Pakistan.\nProf Dr Muhammad Abid, in his opening remarks, highlighted the importance of the UNESCO Chair Holders’ Meeting as a valuable platform for them to showcase their expertise and contributions.\nHe expressed confidence that effective collaboration between the chairs would strengthen relationships, achieve better results, and enhance the impact of their work both locally and globally in the areas of sustainable urban development, water resource management, agriculture, health, information and communication technology, culture and arts.\nHe added that the platform was also aligned with the theme of International Literacy Day 2024 which was focused on “promoting literacy for mutual understanding and peace”.\nIn his presentation, Antony Kar Hung Tam outlined the UNESCO’s key focus areas in Pakistan and discussed thematic areas for enhancing quality education, providing technical and vocational training, promoting cultural and creative industries, advancing science and improving media and information literacy.\nHe highlighted the UNESCO’s dedication to Greening Education, making education systems climate-resilient, and managing water resources effectively for the community of Pakistan.\nDuring the event, all the UNESCO Chair Holders across Pakistan shared their ongoing research, future collaborative projects, knowledge sharing, strategic partnership and future directions.\nA roundtable discussion was also part of the\nevent which was moderated by Syed Raza Shah, National Professional Officer, UNESCO Islamabad to address the question “How can UNESCO collaborate with the chairs to help them perform their activities, and how can chairs contribute to each other’s work?”",
  "retrievedAt": "2025-08-10T21:03:34.042Z"
}
