{
  "title": "JKNF condemns India’s nefarious attempt to change demography of  Muslim-majority IIOJK",
  "link": "https://www.app.com.pk/national/jknf-condemns-indias-nefarious-attempt-to-change-demography-of-muslim-majority-iiojk/",
  "date_published": "2022-08-25T19:21:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 25 (APP): Jammu Kashmir National Front [JKNF] working committee meeting held in occupied Srinagar late Wednesday night took serious notice of the Indian government’s designs aimed at changing the demography of the disputed territory of Jammu and Kashmir.\nAccording to a statement issued late Thursday, the working committee members, while terming the Indian move as a violation of the UNSC resolutions, urged the international community, in particular the UN, to take effective notice of the matter and hold the Indian government accountable.\nExpressing their grave concern over the continuous detention of the party chairman, Nayeem Khan, the participants of the meeting said that Khan was being punished for his unprecedented role in the freedom struggle. Terming his detention as a violation of basic human rights, they said, “ Nayeem Ahmed Khan is a strong proponent of Kashmiris’ right to self-determination has, he spent his whole life in advocating Kashmiris’ just cause and owing to his political beliefs he had to spent a major portion of his life in Indian jails”.\nTerming allegations leveled against him as a pack of lies, the front spokesman Shafiq-ur-Rehman said that despite the passage of five years Indian authorities have miserably failed to produce a single piece of evidence in the court of law. Appreciating the incarcerated party chairman’s perseverance and commitment to Kashmir cause, he said, “Despite falling health condition Nayeem Ahmed Khan stands firm on his principled political stance on Kashmir issue”.\nAccording to the spokesman, the working committee members acknowledged the valor and persistence of their incarcerated leader and said that Nayeem Khan remains a powerful guiding force even being behind the bars.\n“The working committee conferred ‘prisoner of conscience’ accolade to its jailed chairman”, the spokesman said.\nThe participants of the meeting also prayed for the safety and good health of Nayeem Khan and other Kashmiri prisoners who have been languishing in jails within and outside Kashmir.\nThe participants of the meeting also reiterated their pledge to uphold the martyrs’ mission and take the ongoing struggle to its logical conclusion.\nThe meeting also urged the world community to shun its policy of indifference towards Kashmiris and hold India accountable for the crimes its forces have been committing in the bleeding vale of Kashmir.",
  "retrievedAt": "2025-08-11T15:28:00.688Z"
}
