{
  "title": "Pakistan asks int’l community to hold India accountable for HR violations in IIOJK: FO",
  "link": "https://www.app.com.pk/national/pakistan-asks-intl-community-to-hold-india-accountable-for-hr-violations-in-iiojk-fo-2/",
  "date_published": "2022-08-26T18:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Pakistan on Friday expressed deep concern over the gravely disturbing developments and increasing intolerance in India and reiterated its call to the international community to hold India accountable for gross and systematic violations of international humanitarian law, especially in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nSpeaking at a weekly press briefing here, the Foreign Office Spokesperson said“Let me reiterate Pakistan’s strong condemnation of sacrilegious remarks against the Holy Prophet (PBUH) made by another BJP official. This is the second time in the last three months that a senior BJP leader has made disrespectful comments towards our beloved Prophet Muhammad (PBUH) denoting the worrying yet unmistakable slide of today’s India towards Islamophobia.”\nHe said we demanded of the Indian government to take immediate and decisive action against the BJP members habitually involved in attacking Islam and targeting the dignity of beloved Prophet (PBUH).\n“Pakistan also calls on the international community to take urgent cognizance of the aggravating situation of Islamophobia and overt espousal of anti-Muslim and anti-Islam agenda of the BJP-RSS combine.”\nHe drew attention to the recent spate of false terrorism-related assertions made by India in which some detached alleged incidents were being distorted and presented as a so-called ‘terror’ plot against India. “Pakistan firmly rejects such allegations,” he added.\n“Pakistan also urges the international community to take immediate cognizance of the fact that India is yet again resorting to classic ‘false flag’ methods to advance its sinister designs and that this could have serious implications for peace and security in the region. The international community must urge India to act responsibly.”The spokespersons said “We reiterate our demand for release of all illegally detained political prisoners and Hurriyat leaders, particularly Yasin Malik, who are languishing in different jails of IIOJK and India,”\nHe said Pakistan also condemned India’s continued detention of Hurriyat leader Mirwaiz Umar Farooq, who was not allowed to deliver Friday sermons today.\nPakistan also reiterated its call to the international community to hold India accountable for its gross and systematic violations of international humanitarian law and ensure that Pakistani and Kashmiri prisoners under Indian custody were not expended as cannon fodder in the execution of India’s nefarious designs in the IIOJK, he stressed.\n“Pakistan rejects Indian occupation authorities’ sinister move to grant voting rights to Indian citizens in Indian Illegally Occupied Jammu and Kashmir that reeks of the sinister designs of institutionalizing settler colonialism,” the spokesperson added.The realization of sustainable peace, stability and prosperity in South Asia remained contingent upon peaceful resolution of the long-standing Jammu and Kashmir dispute in accordance with the relevant UN Security Council resolutions and the wishes of the Kashmiri people, he noted.\nThe spokesperson said, “It is the responsibility of the international community to come together and demand India’s compliance with its international obligations within the agreed legal framework espoused by the comity of civilized nations and in keeping with numerous Security Council resolutions on Jammu and Kashmir.”",
  "retrievedAt": "2025-08-11T15:27:42.892Z"
}
