{
  "title": "Ahsan Iqbal chairs 66th NLB meeting",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-chairs-66th-nlb-meeting/",
  "date_published": "2022-08-26T14:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Minister for Planning Development & Special Initiatives, Professor Ahsan Iqbal chaired 66th meeting of the National Logistics Board (NLB) here on Friday.\nThe meeting was attended by Quartermaster General, Director General, NLC, Secretary Ministry of PD&SI and other board members. DG, NLC briefed the participants about the operational, administrative and financial matters of the organization with special reference to the accomplished tasks and future development plans of NLC.\nThe board was informed that an additional 150 vehicles have been booked enhancing the fleet size up to 900. Moreover, 200 additional vehicles are planned in FY-2022-23 that would increase the fleet size to 1100.\nSpeaking on the occasion, the minister emphasized the importance of public interest projects particularly Karachi Green Line and directed the concerned stakeholders to expedite the projects.\n“This is the public interest project which will cater thousands of commuters in Karachi and it must be expedited, ” said the minister.\nThe minister further added that all the bottlenecks in this regard will be removed immediately.\nHe hoped that NLC would continue to play its role in boosting economic activities in the country.\nThe NLB also approved the budget estimates presented by NLC management for financial year 2022/23.\nDuring the meeting, the minister also directed the concerned stakeholders to start cargo shuttle service to facilitate the public. “Cargo shuttle service is a dire need of hour to facilitate the public and it must be started from Lahore to Karachi and other parts of the city so people could send their goods from one city to another without any hassle, ” remarked the Minister.\nEarlier, it was also informed by the Board that the first commercial TIR was moved to Turkey and Azerbaijan through Iran in Oct 2021.\nIn addition, a road freight terminal is also being developed at Landin (Karachi) comprising all facilities of transport operations.\nSimilarly, it was informed that the logistic management system has been digitalized and it will be integrated with ERP.\nDuring the meeting, it was further informed that NLC has digitized the logistic management system and a state of the art data center has been established to cater the needs for the next ten years.",
  "retrievedAt": "2025-08-11T15:27:47.922Z"
}
