{
  "title": "President appeals to nation, int’l community to aid flood victims",
  "link": "https://www.app.com.pk/national/president-appeals-to-nation-intl-community-to-aid-flood-victims/",
  "date_published": "2022-08-26T07:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): President Dr Arif Alvi on Friday appealed to the entire nation, overseas Pakistanis and international community to support the flood victims who were in dire need of rescue, relief and rehabilitation as unprecedented rains and floods had destroyed the lives and livelihood of people across Pakistan.\nThe president, in a statement, expressed the hope that Pakistanis, who had already displayed remarkable philanthropic spirit in the past, would come forward once again and contribute generously in cash and kind to support the rescue and relief efforts of the government and other relevant organizations.\nHe called upon all governments and institutions, NGOs and volunteers to offer their expertise and leadership to rescue, evacuate, and rehabilitate the affected people by providing them shelter, food and medical facilities.\nPresident Alvi also called upon the media to motivate the nation to donate the essential items identified by the government through formal channels set up or endorsed by the government in an organized and disciplined manner, to the affected people to help them rebuild their lives.\nThe essential items may include readymade food packets, nutritious and warm food, rice, lentils, salt and oil and items of daily use, including matchboxes, candle packets, kerosene oil, solar lamps, polythene sheets, groundsheets, floor mats, tarpaulin, mosquito nets and blankets.\nThe president said that unprecedented rains and resultant floods had damaged standing crops, affected roads, bridges and embankments, and disrupted communication and transportation infrastructure, making rescue and relief efforts an uphill task.\nHe urged the international community to provide their expertise, technology, and required machinery to the relevant government institutions to help restore infrastructure and provide their logistic and humanitarian support to help relevant government agencies cope with the enormous task of aiding the flood victims across the country.\nHe expressed his confidence that just like the past, the nation would again come to the aid of the flood-affected people and would not rest till their complete rehabilitation.",
  "retrievedAt": "2025-08-11T15:27:56.816Z"
}
