{
  "title": "Prime Minister Imran Khan; wife test positive for COVID-19; Modi wishes recovery",
  "link": "https://www.app.com.pk/national/prime-minister-tests-positive-of-covid-19/",
  "date_published": "2021-03-20T09:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): Prime Minister Imran Khan and his wife Bushra Bibi Saturday tested positive for COVID-19 and isolated themselves at their home.\nInitially, the announcement of the Prime Minister’s test result came through his Special Assistant on Health Dr. Faisal Sultan;\n“PM Imran Khan has tested positive for Covid-19 and is self-isolating at home,” Faisal Sultan announced on Twitter.\nPM Imran Khan has tested positive for Covid-19 and is self isolating at home\n— Faisal Sultan (@fslsltn) March 20, 2021\nHowever later in the evening Syed Zulfi Bukhari, Special Assistant to the Prime Minister for Overseas Pakistanis in a tweet said that besides the prime minister, his wife too was tested positive.\n“Wishing our First Lady & PM Imran Khan a speedy recovery. May Allah give them both shifa [health].”\nHe said vaccines were safe and must be taken. He said the Prime Minister had his first shot just a day ago, but, he was already exposed.\nWishing our First Lady & PM @ImranKhanPTI a speedy recovery.May Allah give them both shifa.\nVaccines are safe & must be taken, #PMIK had his first shot just a day ago, before which he was exposed already.Please do get yourself & loved ones vaccinated and fight the fake news! pic.twitter.com/kh7HvD2Qv5\n— Sayed Z Bukhari (@sayedzbukhari) March 20, 2021\nOn Thursday, the prime minister had got his COVID jab and had appealed to the people to continue exercising precaution in view of the third wave of the pandemic.\nThe prime minister was having mild symptoms with a slight fever and cough. He also prayed for his early recovery, Special Assistant to PM Shahbaz Gill said on Twitter.\nFederal Planning Minister Asad Umar said the prime minister experienced some symptoms on the day of getting the vaccine.\n“Some people questioning the efficacy of vaccination since he was vaccinated Thursday evening. The symptoms take a few days before manifesting. Hence it is certain that PM had been infected PRIOR to vaccination. So please do vaccinate,” he said on Twitter.\nMay Allah protect him and give him shifa. Some people questioning the efficacy of vaccination since he was vaccinated thursday evening. The symptoms take a few days before manifesting. Hence it is certain that PM had been infected PRIOR to vaccination. So please do vaccinate https://t.co/0ZZBamNVlS\n— Asad Umar (@Asad_Umar) March 20, 2021\nThe Ministry of National Health and Services said that the prime minister was not fully vaccinated when he contracted the virus.\n“He only got the 1st dose and merely 2 days ago which is too soon for any vaccine to become effective. Anti-bodies develop 2-3 weeks after the 2nd dose of the 2-dose COVID vaccine,” the ministry spokesman in a tweet said.\nPrime Minister Imran Khan was not fully vaccinated when he contracted the virus. He only got the 1st dose and merely 2 days ago which is too soon for ANY vaccine to become effective. Anti-bodies develop 2-3 weeks after 2nd dose of 2-dose COVID vaccines. #VaccinesWork\n— Ministry of National Health Services, Pakistan (@nhsrcofficial) March 20, 2021\nSpecial Assistant to the Prime Minister on National Health Services Dr Faisal Sultan said prime minister Imran Khan had contracted coronavirus with mild symptoms and was in good health and good spirits.\nIn a video statement, he said “We are monitoring parameters of his health and at present, he does not need a direct intervention.”\nوزیر اعظم کے معاون خصوصی برائے صحت  ڈاکٹر فیصل سلطان کی میڈیا بریفنگ\nوزیر اعظم عمران خان کی کورونا کی علامات معمولی نوعیت کی ہیں اور وہ ہشاش بشاش ہیں۔\nویکسین کی افادیت دوسرا ٹیکا لگنے کے دو سے تین ہفتوں کے بعد ظاہر ہوتی ہے۔@fslsltn @GovtofPakistan pic.twitter.com/6MFnDLmmgR\n“We are monitoring parameters of his health and at present, he does not need a direct intervention.”\n“We will trace the people who came in contact and will ask them to isolate themselves at home. I myself will also isolate at home for a few days.”\n“We will trace the people who came in contact and will ask them to isolate themselves at home.”\nAs the news of the Prime Minister testing positive for COVID-19 broke, the social media pages flooded with posts conveying good wishes for the prime minister.\nForeign Minister Shah Mahmood Qureshi said, “Wishing my Prime Minister (Imran Khan) a quick recovery and good health.”\nSenator Shibli Faraz also prayed for the recovery of the prime minister and said in wake of the third wave, the government was taking effective measures to overcome the pathogen.\nInterior Minister Sheikh Rashid Ahmed prayed for the health of the prime minister and hoped that he would recuperate very soon.\nMinister for Science and Technology Fawad Chaudhry said the prayers of the people of Pakistan went to the prime minister for his good health.\nIndian Prime Minister Narendra Modi in a tweet wished him “speedy recovery from Covid-19”.\nBest wishes to Prime Minister @ImranKhanPTI for a speedy recovery from COVID-19.\n— Narendra Modi (@narendramodi) March 20, 2021\nChairman Pakistan Peoples Party Bilawal Bhutto Zardari also wished the Prime Minister a “speedy recovery.”\nWishing @ImranKhanPTI a speedy recovery from COVID.\n— BilawalBhuttoZardari (@BBhuttoZardari) March 20, 2021\nThe PML- N leader Ahsan Iqbal also wished the Prime Minister recovery, but did point out that ” We should as leaders take precautions & wear mask to be model of safety.”\nMay Allah Grant recovery to @ImranKhanPTI from Corona Ameen! We should as leaders take precautions & wear mask to be model of safety. Please wear mask, wash hands with soap, & keep safe distances.\n— Ahsan Iqbal (@betterpakistan) March 20, 2021\nWhile praying for the quick recovery of the prime minister, Punjab Chief Minister Usman Buzdar said the “recent spike in COVID-19 cases and positivity rate is alarming and we all need to be extra careful and strictly follow safety protocols.”\nBesides the cabinet members, the politicians from both ruling and opposition parties, his followers, celebrities, and netizens expressed their good wishes for the prime minister as #ImranKhan started to trend on Twitter.\nThe vaccine develops more than 80% immunity two weeks after the second injection.\nFurthermore, No cabinet minister, including the Prime-Minister, nor any of their relatives jumped the queue or violated the priority order to receive the vaccine.\n— Hammad Azhar (@Hammad_Azhar) March 20, 2021\nNational Assembly Speaker Asad Qaiser, Senate Chairman Sadiq Sanjrani, federal ministers Pir Nurul Haq Qadri, Hammad Azhar and Ali Haider Zaidi, governors of Punjab and KP, Cricket start Shahid Afridi and renowned actor Humanyun Saeed are among many who conveyed their good wishes for the prime minister.\nWishing my Prime Minister @ImranKhanPTI a quick recovery and good health.\n— Shah Mahmood Qureshi (@SMQureshiPTI) March 20, 2021\nIn its third wave, Pakistan was witnessing a sharp surge in COVID-19 cases and during the past 24 hours, 3,876 new cases have been reported from across the country against 40,946 tests taking the positivity ratio to an alarming 9.47 percent. 42 deaths were reported while another 58 patients were in critical condition.\nThe National Command Operation Centre (NCOC) has already shut down all educational institutions in major cities, restricted indoor dining, sporting, social religious activities, weddings and asked the people to strictly observe the SoPs. Smart lockdowns in several localities across the country were in effect and timings for the commercial activities have been curtailed, with Saturdays and Sundays declared as safe days, with only essential services allowed to operate.\nPakistan started vaccination on the 10th of this month, starting from the front line health workers. Thousands have so far been vaccinated.\nوزیراعظم عمران خان کی جلد صحت یابی کے لئے پوری قوم دعا گو ہے۔اللہ تعالی ان کو جلد شفا یاب فرما ئے۔کرونا کی تیسری لہر کے پیش نظر عوام سے اپیل ہے کہ ایس او پیز پر سختی سے عمل پیرا ہوں۔اس لہر سے نمٹنے کیلئے مزید موثر اقدامات اٹھائے جارہے ہیں۔\n— Senator Shibli Faraz (@shiblifaraz) March 20, 2021\nJehangir Khan Tareen prayed to Allah Almighty to grant Imran Khan a speedy recovery and urged all to ensure social distancing and wearing of masks.\nWishing Khan sb all the best in his fight against Covid-19. May Allah grant him a speedy recovery. Ameen.\nCurrent Covid wave is turning out to be more serious than the ones before . All of us must ensure social distancing & usage of masks at all costs.\n— Jahangir Khan Tareen (@JahangirKTareen) March 20, 2021\nA flurry of activity was also witnessed on the diplomatic front with messages pouring in from several world capitals and ambassadors wishing the prime minister a quick recovery.\nChinese Ambassador Nong Rong, Palestinian Ambassador Ahmed Ameen, the UK High Commissioner Christian Turner, High Commissioner of Australia Dr Geoffrey Shaw, Ambassador of the European Union Androulla Kaminara, German ambassador to Pakistan Bernhard Schlagheck, the US embassy, Dr Abdullah Abdullah Chairman of the High Council for National Reconciliation Afghanistan, and many more.\nMy best wishes & prayers to Prime Minister of the Islamic Republic of Pakistan HE @ImranKhanPTI for a full and speedy recovery from COVID-19. pic.twitter.com/tVeTnIvSIN\n— Dr. Abdullah Abdullah (@DrabdullahCE) March 20, 2021\nWishing a speedy recovery & shifa to PM @ImranKhanPTI #GetWellSoon #UKPakDosti https://t.co/HMZVIyeNEo\n— Christian Turner (@CTurnerFCDO) March 20, 2021\nPrayers for quick recovery of Prime Minister @ImranKhanPTI.\nRecent spike in #COVID19 cases and positivity rate is alarming and we all need to be extra careful and strictly follow safety protocols!! https://t.co/ip6ccCQQzR\n— Usman Buzdar (@UsmanAKBuzdar) March 20, 2021\nوَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ°\nAnd when I am ill, it is He Who cures me.\n(Qur’an 26:80)\nPrime Minister Imran Khan has tested positive for Covid-19 and is self isolating at home.\n— Prime Minister’s Office, Pakistan (@PakPMO) March 20, 2021\nThe Prime Minister adheres to a very heavy daily schedule of back to back meetings, besides visits to various places. On Thursday he handed over 1500 housing units amongst the labourers and on Friday, the prime minister visited Malakand University to inaugurate a newly constructed block and Swat Motorway to inaugurate three tunnels.\n-Reporting by Ishtiaq Ahmed & Shafek Koreshe",
  "retrievedAt": "2025-08-11T20:31:18.765Z"
}
