{
  "title": "ATC awards death to prime, co-accused in Motorway gang-rape case",
  "link": "https://www.app.com.pk/national/atc-awards-death-to-prime-co-accused-in-motorway-gang-rape-case/",
  "date_published": "2021-03-20T14:09:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 20 (APP): An anti-terrorism court (ATC) on Saturday convicted Abid Malhi and Shafqat Ali, prime accused and co-accused, in the Motorway gang-rape case after charges were proved against them.\nThe court handed down death sentence to both the accused under Section 376 of Pakistan Penal Code (PPC) for rape.\nThe court awarded life imprisonment to both accused under Section 365 A of PPC for kidnapping the victim and confiscating her property.\nBesides imposing Rs 200,000 fine each, the court also awarded 14 years imprisonment to both accused under Section 392 of PPC for robbery.\nThe court awarded five years imprisonment to both accused under Section 440 of PPC for mischief, besides imposing Rs 50,000 fine.\nThe accused were also ordered to pay Rs 100,000 each as compensation to the victim under Section 337-F1 and 337-L2 of the PPC for causing injury to the victim.\nATC Judge Arshad Hussain Bhutta announced the verdict at Camp Jail in the presence of the accused, their counsel, Deputy Prosecutor General Hafiz Asghar and Deputy Prosecutor General Waqar Bhatti.\nThe court had reserved the verdict on March 18 after hearing detailed arguments of parties.\nThe prosecutors argued that the accused gang-raped the victim woman at gunpoint and solid evidence was available against them.\nThey argued that the accused were arrested after their DNA matched with the samples collected from crime scene whereas the victim woman also identified them during identification parade held in the presence of the magistrate.\nThey also submitted that co-accused Shafqat admitted the crime before a judicial magistrate. They pleaded with the court for handing down strict punishment to the accused as they committed a heinous crime.\nHowever, the defence counsel opposed the plea, saying that the prosecution failed to prove presence of accused Shafqat on crime scene whereas the identification parade of Shafqat Ali was held after 22 days of his arrest.\nThey submitted the the statement of accused Shafqat was recorded after a delay of one month and eighteen days whereas he was forced to get record his statement. The defence also questioned the authenticity of the identification parade while raising various questions on process adopted during it.\nIt is pertinent to mention here that the prosecution presented 37 witnesses, including the victim woman, during the trial.\nThe Gujjarpura police had filed a challan against the accused, wherein they were declared guilty.The police had requested the court for awarding strict punishment to the accused as sufficient evidence was available against them.\nOn September 9, the accused- Abid Malhi and Shafqat Ali, allegedly raped a woman at gunpoint in Gujjarpura area while she was waiting for help on the motorway after her car ran out of fuel.\nAn FIR of the incident was lodged with the Gujjarpura police under various sections of the Pakistan Penal Code and the Anti-Terrorism Act (ATA).",
  "retrievedAt": "2025-08-11T20:31:11.882Z"
}
