{
  "title": "APHC expresses concern over Kashmiri detainees’ plight in jails",
  "link": "https://www.app.com.pk/national/aphc-expresses-concern-over-kashmiri-detainees-plight-in-jails/",
  "date_published": "2021-03-20T07:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): The All Parties Hurriyat Conference (APHC) has expressed its deep concern over the deteriorating health condition of illegally detained Hurriyat leaders languishing in different jails of the territory and India.\nAPHC Working Vice Chairman, Ghulam Ahmad Gulzar paid rich tribute to the unwavering commitment of the detainees towards the ongoing liberation struggle, Kashmir Media Service reported.\nHe said the Indian hegemony and fascism had, time and again, tested the patience and determination of the jailed leadership but had utterly failed to deter them from leading the freedom movement.\nCondemning the grave violations of prisoners’ rights at the hands of Indian jail authorities, Ghulam Ahmad Gulzar said that Hurriyat leaders and activists including Muhammad Ashraf Sehrai, Masarrat Aalam Butt, Muhammad Yasin Malik, Shabbir Ahmed Shah, Aasiya Andrabi, Dr Shafi Shariati, Dr Muhammad Qasim Fakhtoo, Dr Abdul Hameed Fayaz, Naheeda Nasreen, Fehmeeda Sofi,\nGhulam Quadir Butt, Muhammad Yousuf Mir, Showkat Ahmed Khan, Maqsood Ahmed Butt, Nazir Ahmed Sheikh, Muhammad Ayub Dar, Muhammad Ayub Mir, Ayaz Muhammad Akbar, Altaf Ahmed Shah, Pir Saifullah, Raja Merajuddin Kalwal, Shahid-ul-Islam, Farooq Towheedi, Shahid Yousuf, Shakil Yousuf, Zahoor Watali, Muzaffar Ahmed Dar, Advocate Ghulam Muhammad Butt, Gazanfar Iqbal, Hakeem Showkat,\nMuhammad Yousuf Falahi, Sheikh Muhammad Ramzan, Ameer Hamza, Molvi Nasir, Arif Wani, Aaqib Najar, Bashir Sehmat, Nazir Pathan, Mumtaz Ahmed and Tariq Pandit were being treated as dreaded criminals and denied medical and other basic facilities.\nThe Hurriyat leader urged the United Nations Human Rights Council, Amnesty International and Human Rights Watch to put pressure on India to release all illegally detained Hurriyat leaders and activists.",
  "retrievedAt": "2025-08-11T20:31:18.931Z"
}
