{
  "title": "Previous govt’s projects became white elephant: CM",
  "link": "https://www.app.com.pk/national/previous-govts-projects-became-white-elephant-cm/",
  "date_published": "2021-03-20T14:06:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 20 (APP): Punjab Chief Minister Sardar Usman Buzdar has said the pomp and show projects started by the previous government became “white elephant” and a burden on the national exchequer.\nTalking to various parliamentarians who called on him, he said utilizing all resources in specific cities could not be called development but usurping the rights of backward areas.\nHe said that the PTI government had taken the remote areas into the mainstream.\nThe former rulers started self-exhibitory projects by ignoring the priorities of the people as their hard-earned money was wasted on personal likes and dislikes.\nFormer rulers did not pay any attention to provide basic amenities to the people while the PTI government was implementing the agenda of composite development.\nProvincial Ministers and MPAs from different districts called on Punjab Chief Minister Sardar Usman Buzdar at CM office and apprised him about the problems of their respective constituencies as well as the progress on different ongoing development schemes.\nThe Chief Minister said that a separate development package for every district was being prepared. Development work in the constituencies of elected representatives will be completed on a priority basis.\nThe government will start development projects in their constituencies keeping in view the public needs and priorities, he said adding development work was being carried out in neglected areas with the consultation of MPAs.\n“I do not believe in the one man show but in teamwork, said Usman Buzdar. Serving people is real politics. I am visiting every area to resolve peoples’ problems,” he added.\nThose who met the Chief Minister include Provincial Ministers Jahanzaib Khan Khachi, Shaukat Lalika, MPAs Ali Raza Khan Khakwani, Ghazin Abbasi, Umm Al-Banin, Wasiq Qayyum Abbasi and Mamoon Tarar. Chief Whip Punjab Assembly MPA Syed Abbas Ali Shah and Secretary Good Governance Committee Ijaz Hussain Minhas were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:31:10.904Z"
}
