{
  "article_id": "2025-02-17_6d4e9ee1c02ae7b1b5ce8156379d66da",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/high-level-wb-delegation-visits-benazir-one-window-center-in-islamabad/",
    "retrieved_at": "2025-08-27T12:47:50.098Z"
  },
  "metadata": {
    "title": "High level WB delegation visits Benazir One Window Center in Islamabad",
    "author": null,
    "date_published": "2025-02-17T16:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 439,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 17 (APP): A high-profile delegation of 19 Executive Directors from the World Bank visited the Benazir One Window Center in Islamabad on Monday to assess the overall efficacy of the center. Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid, and Secretary Amer Ali Ahmad extended a warm welcome to the esteemed delegation. The purpose of the visit was to scrutinize the facilities provided to deserving women and assess the overall efficacy of the One Window operations. The delegation was briefed by DG NSER, Dr. Asim Ijaz, on the intricacies of BISP One Window Operations. The delegation, comprising Executive Directors , including Abdelhak BEDJAOUI, Zainab AHMED, Beatrice MASER, Robert Bruce NICHOLL, Teresa SOLBES, Paul BONMARTIN, Lonkhululeko MAGAGULA, Marlene Suzie NZENGOU, Tauqir SHAH, Mercy TEMBON, Shadiya ADAM, Karl BACH, and other key personalities, exhibited keen interest in the multifaceted initiatives of the BISP One Window Center. The delegation, accompanied by Senator Rubina Khalid and Secretary Amer Ali Ahmad, conducted a thorough inspection of the registry of deserving women at the NSER survey desk, enrollment of children in Taleemi Wazaif, Nashonuma awareness sessions for women, and the payment system. Senator Rubina Khalid informed the delegation that financial assistance is currently being provided to 9.3 million beneficiaries under BISP, with the number soon reaching 10 million. She credited President Asif Ali Zardari for making housewives eligible for BISP financial assistance, emphasizing that BISP is a revolutionary program that has empowered poor women in Pakistan with economic independence and recognition. Earlier, a World Bank delegation led by Amjad Zafar Khan visited BISP headquarters. The delegation is on a visit to BISP from February 17 to February 25 to review progress on the Crisis Resilient Social Protection (CRISP) Framework, Program Action Plan, and agreements between BISP and the World Bank. Chairperson Senator Rubina Khalid informed the delegation that, in collaboration with the State Bank of Pakistan, BISP will soon open bank accounts for deserving women, allowing them to receive relief funds directly and withdraw money from a bank of their choice for greater convenience. She also highlighted efforts under the Benazir Hunarmand Program to provide skill training and overseas employment opportunities for deserving individuals, in collaboration with NAVTTC and the Ministry of Overseas Pakistanis. Other important issues, including the Hybrid Social Protection Scheme, financial literacy, and training and monitoring of enumerators for surveys, were also discussed. Amjad Zafar Khan (Senior Social Protection Specialist/Task Team Leader) was accompanied by Ms. Melis U. Guven (Lead Economist/Co-Task Team Leader) and Zaineb Majoka (Economist). They briefed the Chairperson and Secretary BISP on the mission's objectives and expected outcomes and assured full support from the World Bank.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}