{
  "article_id": "2025-02-17_d1fd308eaeb6a97fa8e67fb2a3a6506a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rain-wind-thunderstorms-and-snowfall-expected-in-upper-parts-of-country-from-feb-19-21/",
    "retrieved_at": "2025-08-27T12:49:04.282Z"
  },
  "metadata": {
    "title": "Rain-wind/thunderstorms and snowfall expected in upper parts of country from Feb 19-21",
    "author": null,
    "date_published": "2025-02-17T14:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 379,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 17 (APP): The Pakistan Meteorological Department (PMD) has forecast rain-wind/thunderstorms and snowfall over the hills in the upper regions of the country from February 19 to 21, breaking a prolonged dry spell. According to the PMD, a frontal weather system is likely to enter the northern parts of the country on February 19 and persist until February 21. Rain-wind/thunderstorms with heavy snowfall are expected in Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Guanche, and Shigar, as well as Neelum Valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, and Mirpur from February 19-20. Similar weather conditions are anticipated in Chitral, Dir, Swat, Shangla, Kohistan, Mansehra, Abbottabad, Haripur, Buner, Bajaur, Mohmand, Khyber, Orakzai, Kurram, Waziristan, Peshawar, Charsadda, Nowshera, Swabi, Bannu, Karak, and Kohat on February 19-20. In Punjab and Islamabad, rain-wind/thunderstorms with snowfall in Murree and Galliyat are expected from February 19-21. Meanwhile, Islamabad, Potohar, Sargodha, Mianwali, Bhakkar, Khushab, Hafizabad, Gujranwala, Mandi Bahauddin, Gujrat, Sialkot, Narowal, Lahore, Sheikhupura, Faisalabad, Jhang, and Toba Tek Singh will experience rain on February 19-20. Light rain is also expected in Multan, Dera Ghazi Khan, Layyah, Muzaffargarh, Taunsa Sharif, Khanewal, Sahiwal, Pakpattan, Okara, and Bahawalnagar on February 19. In Balochistan, rain-wind/thunderstorms with snowfall over hills are likely in Quetta, Ziarat, Chaman, Pishin, Qilla Abdullah, Qilla Saifullah, Chagai, Nushki, Harnai, Zhob, and Musakhel on February 18-19. Most parts of Sindh will experience dry weather, though gusty winds are expected along the coastal areas. The Met Office has warned of possible disruptions due to heavy snowfall, which may cause road closures and slippery conditions in Murree, Galliyat, Naran, Kaghan, Dir, Swat, Kohistan, Mansehra, Abbottabad, Shangla, Astore, Hunza, Skardu, and Neelum Valley from February 19-21. Hailstorms may occur in isolated parts of upper Khyber Pakhtunkhwa, Punjab, and Kashmir on the night of February 19 and early February 20. There is also a risk of landslides and avalanches in hilly areas, including Khyber Pakhtunkhwa, Gilgit-Baltistan, Kashmir, Murree, and Galliyat. Tourists have been advised to exercise caution and avoid unnecessary travel in the affected regions. The rainfall is expected to be beneficial for standing crops, particularly in the Barani areas of Punjab and Khyber Pakhtunkhwa. The authorities have been urged to remain on high alert and take necessary precautions to prevent any untoward incidents, especially in the hilly areas.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}