{
  "article_id": "2025-02-17_b87602c96ebaf726a2f34f9a31cb05d9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-police-busts-illegal-kite-flying-network-24-nab/",
    "retrieved_at": "2025-08-27T12:49:06.118Z"
  },
  "metadata": {
    "title": "Islamabad Police busts illegal kite flying network, 24 nab",
    "author": null,
    "date_published": "2025-02-17T13:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 17 (APP):Islamabad Capital Police has launched a large-scale crackdown on kite flyers and sellers, arresting 24 individuals involved in the illegal activity over the last 24 hours. A public relations officer told APP on Monday that the Capital police have also seized 3,279 kites and 240 rolls of string during the operation. He said that the crackdown against kite sellers is being carried out across the district, with action taken without discrimination. Following the arrests, cases have been filed against the offenders. SSP Operations , Muhammad Shoaib Khan, emphasized that kite flying, a dangerous pastime, leads to the loss of innocent lives, and such activities will not be tolerated. SSP Shoaib urged parents to educate their children about the dangers and legal consequences of kite flying. \"Citizens must fulfill their social and legal responsibilities by contributing to the prevention of kite flying,\" said Shoaib. \"Announcements have been made in the mosques of all police stations regarding the hazards of kite flying and its ban.\" SSP Shoaib further stated that kite flying with metal-coated string poses a serious threat to human life, leading to potential injury or even death. The police will continue their robust actions against kite flying and its sale. \"The safety of citizens is our primary responsibility, and the loss of innocent lives due to this deadly game will not be tolerated,\" he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}