{
  "title": "Nazi type concentration camps in IOK for Kashmiri youth to torture",
  "link": "https://www.app.com.pk/national/nazi-type-concentration-camps-in-iok-for-kashmiri-youth-to-torture/",
  "date_published": "2020-01-17T05:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):India has planned to set up Nazi type concentration camps for the Kashmiri youth to starve torture and kill them.\nAccording to Kashmir Media Service, a clear indication of the plan has been given by warmonger former Indian Army Chief and incumbent Chief of Defence Staff, General Bipin Rawat, while addressing a conference in New Delhi.\nHe said that young Kashmiri children were being radicalized and they need to be identified and put in de-radicalization camps. Rawat also claimed that Indian forces could not be blamed for injuries caused by pellet guns and that radicalised stone-pelters were “more dangerous” than the pellet guns. By emphasizing the need to deal with heavy hand in occupied Kashmir, General Rawat has pointed towards the Indian design to step up state terrorism in the territory.\nAll Parties Hurriyat Conference and other liberation organizations in their statements have said that in the name of de-radicalization, the Kashmiri youth would be tortured in new camps. They said that General Bipin Rawat’s warning was a depiction of India’s militaristic approach towards the Kashmir dispute and was aimed at making the Kashmiri youth to shun their struggle.\nThe organizations said New Delhi was using all brutal methods including torture to crush the Kashmiris’ liberation movement and bully them into accepting its illegal occupation of Jammu and Kashmir. They maintained that the international human rights bodies including the UN Human Rights Council, Amnesty International and Human Rights Watch have documented thousands of cases of torture in the occupied territory.\nThey said that India was violating international humanitarian laws by using torture as a state policy in occupied Kashmir. They pointed out that despite killing over 95,000 innocent Kashmiris since 1989, Indian troops have failed to subdue the Kashmiri people’s resolve for securing freedom from the Indian yoke.\nThe organizations said the resistance against Indian occupation is in blood and soul of every Kashmiri. They said that New Delhi must remember that Kashmiris’ passion for freedom could not be suppressed through militaristic means and they would take their ongoing freedom movement to its logical conclusion, despite all odds.\nThey also appealed to the world human rights organizations to take cognizance of Indian atrocities on the people of occupied Kashmir and impress upon New Delhi to give the Kashmiris their right to self-determination.",
  "retrievedAt": "2025-08-11T18:38:30.445Z"
}
