{
  "title": "‘New Hajj Policy’ on the cards: Minister",
  "link": "https://www.app.com.pk/national/new-hajj-policy-on-the-cards-minister/",
  "date_published": "2020-01-17T06:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):Minister for Religious Affairs and Interfaith Harmony Pir Noor ul Haq Qadri Friday said the ministry was vigorously working on a ‘New Hajj Policy’ that would be unveiled soon.\nAddressing the oath taking ceremony of the newly elected body of the Hajj Organizers Association of Pakistan (HOAP) here, he said the government wanted to facilitate the pilgrims by providing them maximum facilities on lowest possible rates.\nThe minister said the government of Saudi Arabia was yet to impose further tax after the increase in Hajj package by the government.\nHe said the HOAP was also playing its role to run Hajj operation in a good manner despite of some minor issues which would be addressed on priority.\nHe appreciated the government of Saudi Arabia for making effective Hajj arrangements.\nHe said his ministry was facing increasing demand of Hajj quota under the government scheme, following the Indonesian model.\nThe minister assured full cooperation to the HOAP and stressed the need for making concerted efforts to facilitate the pilgrims.\nNewly elected Chairman of HOAP Shahid Rafiq urged the government to restore the quota of private companies which had been reduced in order to create harmony between the government and the companies.\nHe said besides allocating quota for the new companies, the ministry should also increase the quota for the existing companies.\nHe said last year, the private companies had faced immense loss in Hajj operation and requested the ministry for early announcement of the Hajj policy so that they could expedite their arrangements.\nOutgoing Chairman of HOAP Abdul Waheed Butt said the new policy should address the problems faced by the private tour operators including the matters related to Saudi Arabia and Pakistan.\nThe minister administered the oath to the newly elected body of the HOAP and also presented shield to the outgoing HOAP chairman.",
  "retrievedAt": "2025-08-11T18:38:24.068Z"
}
