{
  "title": "80% public awareness on ‘Climate Change’ reached in last 5 years: Adviser Amin",
  "link": "https://www.app.com.pk/national/80-public-awareness-on-climate-change-reached-in-last-5-years-adviser-amin/",
  "date_published": "2020-01-17T06:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):Adviser to the Prime Minister on Climate Change Malik Amin Aslam on Friday said the government and Ministry of Climate Change (MoCC) had intensified their efforts to create public awareness about ‘Climate Change’ from 30 percent to 80 percent in the last five years.\nHe made these remarks at the workshop organized by International Union for the Conservation of Nature (IUCN) on the Flagship Report under a project titled “Global Assessment of the State of Nature and Biodiversity Safeguarding actions in Northern Pakistan” funded by the Italian Cooperation, a press release said.\n“The government is driven by the passion of Prime Minister Imran Khan and has taken on the agenda of ‘Clean and Green Pakistan’ which revolves around 5 main areas that is, 10 Billion Tree Tsunami plantation project, Electric vehicle Policy, Recharge Pakistan, Clean Green Pakistan Index and Ecotourism,” Amin added.\nThe government, he said had also been successful in curbing the powers of Mafias including land, timber, water, waste etcetera, that were hindering environmental security and sustainable growth.\nIn her remarks IUCN Regional Director, Asia Aban Marker Kabraji emphasized on the importance of the workshop as it aims to elicit key inputs and views on environment security and migration situation in Pakistan.\nShe added that the issue of environment and security needs to be analyzed in a variety of contexts, including different natural resources, different regions, as well as environmental, institutional, socioeconomic, and political circumstances.\nFormer Director of Institute of Sustainable Development Mark Halle and an expert in environment and security and authoring the flagship report, explained that the degradation of natural resources and ecosystems was leading to a loss of livelihoods and increased competition for remaining resources.\nHe noted that competition over water resources was on the increase, and environment was a factor in growing internal migration, exacerbation social and communal tensions in the cities.\nHe cautioned that a serious worsening of threats could lead to breakdown of governance and overwhelming of state capacity to manage.\nHead of Italian Cooperation in Pakistan Emanuella Benini said the flagship report was an essential tool for paving the way for more robust strategies for addressing environment and security issues in Pakistan. She appreciated the role of the Ministry of Climate Change.\nDuring the welcome remarks Country Representative, IUCN Pakistan Mahmood Akhtar Cheema said IUCN had played a key role in environmental rehabilitation and sustainable development in Pakistan with several joint initiatives including holding dialogues on several environmental issues including water scarcity and environment and security.\nThe purpose of the workshop was to interact with the stakeholders on the links between environment and security. The workshop was attended by the IUCN Members, government officials and civil society representatives.",
  "retrievedAt": "2025-08-11T18:38:22.752Z"
}
