{
  "title": "Turkiye Interior Minister telephones Sanaullah, discusses flood situation in Pakistan",
  "link": "https://www.app.com.pk/national/turkiye-interior-minister-telephones-sanaullah-discusses-flood-situation-in-pakistan/",
  "date_published": "2022-08-28T16:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): Turkiye Interior Minister Suleyman Soylu had a telephone conversation with Federal Interior Minister Rana Sanaullah on Sunday and discussed flood situation in Pakistan and emergency humanitarian assistance from Turkey.\nThe Turkish Interior minister expressed grief and sorrow over the human and property loss due to the floods in Pakistan, said a press release. He expressed solidarity with Pakistan and assured all possible cooperation in relief assistance in all sectors.\nInterior Minister Rana Sanaullah, on behalf of Prime Minister Shehbaz Sharif, thanked the Turkish President and the people for providing emergency assistance to the flood victims. He also thanked the Turkish Interior Minister for his sympathy and concern over the flood situation.\nThe Turkish minister said relief goods have been dispatched to Pakistan through a special plane. The relief goods included tents, medicine and food items, he said.\nHe said some 10,000 tents, 3,000 food boxes and 1,000 baby food boxes have been sent to the flood victims.\nTurkiye has always generously helped Pakistan in difficult times and they were very grateful to the Turkish government for its generous help, Sanaullah said.\nHe said the flood situation in the country was very alarming due to the record rains in Pakistan this year. Flash floods and landslides had caused severe damage to human lives, property and infrastructure, he said.\nSanaullah said saving human lives was government first priority of the government. All resources were being used to provide relief to the flood victims, he said.\nHe said they would not sit down till complete rehabilitation of the flood victims and compensation for their losses. They were very grateful for the emergency assistance provided by the international community to the flood victims, he said.",
  "retrievedAt": "2025-08-11T15:28:34.353Z"
}
