{
  "title": "Kashmiris urged to pay homage to Ali Shah Geelani on his first martyrdom anniversary",
  "link": "https://www.app.com.pk/national/kashmiris-urged-to-pay-homage-to-ali-shah-geelani-on-his-first-martyrdom-anniversary/",
  "date_published": "2022-08-28T11:42:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 28 (APP): Senior leader of All Parties Hurriyat Conference Nayeem Ahmed Khan urged the people of Kashmir, to assemble at Hyderpora Srinagar on September 1st, to pay homage to Kashmir’s iconic liberation leader Syed Ali Shah Geelani on his first martyrdom anniversary.\nIn a message from Delhi’s infamous Tihar jail on Sunday, the incarcerated APHC leader, while highlighting the deceased leader’s matchless sacrifices and role in the Kashmiris’ ongoing struggle, said that Geelani was a fearless leader who championed the Kashmiris’ cause of right to self-determination with great conviction and consistency.\n“Syed Ali Geelani’s life long struggle for the Kashmir cause would be written in golden words in the annals of Kashmir’s recent history,” he said.\n“His lifelong unwavering struggle and sacrifice for the cause of Kashmir is indeed a proud legacy that will continue to inspire upcoming generations,” he said adding that his demise was a great loss for the freedom movement.\nRecalling his long association with the deceased leader, the APHC leader said: “We endured imprisonment together, worked together for many years to promote the national cause and shared a strong bond of affinity, mutual respect, and drew strength from shared vision to rid our nation from the shackles of Indian occupation.”\nUrging people of Kashmir to assemble at Hyderpora graveyard to pay homage to the great leader on his anniversary, Khan said that it was high time that the people should remember national heroes who had lived and died for the freedom of Kashmir.\nHe also urged religious scholars to pay tribute and offer special prayers in mosques for the deceased leader.",
  "retrievedAt": "2025-08-11T15:28:43.218Z"
}
