{
  "title": "Restructuring provincial system in country imperative: Fawad",
  "link": "https://www.app.com.pk/national/restructuring-provincial-system-in-country-imperative-fawad/",
  "date_published": "2020-12-20T13:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain on Sunday emphasized on restructuring of the provincial system in the country.\n“The chief ministers will have to share powers at district and council level, otherwise, the current system will be a complete failure”, the federal minister tweeted.\nصوبائ نظام کی تشکیل نو ضروری ہے، وزیر اعلیٰ کواختیارات اضلاع اور تحصیلوں کے ساتھ شئر کرنے ہوں گے ورنہ موجودہ نظآم مکمل طور پر ناکام ہے، پاکستان میں بڑی اصلاحات کی ضرورت ہے اور صوبائ حکومتیں مکمل ناکام ہیں https://t.co/E6NDlMQPBi\n— Ch Fawad Hussain (@fawadchaudhry) December 20, 2020\nChaudhry Fawad said provincial governments were a complete failure and major reforms were needed in the country.\nThe federal minister was responding to the statement of Sindh Education and Labour Minister, Saeed Ghani who said provinces run the country and provinces run Islamabad through their earnings.\nایسی ہی بے سروپا گفتگو سے آپ نے بھٹو اور بینظیر کی وفاقی جماعت کو اندرون سندہ کی قوم پرست جماعت میں تبدیل کر دیا ہے، 1940 میں صوبوں نے ہی وفاق کی تشکیل کا فیصلہ کیا تھا،صوبے کماتے اور وفاق کی ضرورت نہ ہوتی تو آپ کے بزرگ وفاق کی تشکیل کا فیصلہ نہ کرتے، عقل اور شعور کی بحث کریں pic.twitter.com/J0XNCT5D9B\nChaudhry Fawad responded to this, saying “You have turned the federal party of Zulfikar Ali Bhutto and Benazir Bhutto into a nationalist party of Interior Sindh.”\nIn 1940, the provinces decided to form a federation.” If the province had earned and the federation was not needed, your elders would not have decided to form a federation. Argue with intellect and consciousness,” Chaudhry Fawad asked the provincial minister.\nسندہ کو دو سال میں 1600 ارب روپیہ ٹرانسفر ہوا https://t.co/XXI558Zi11\nSindh has received Rs 1600 billion in the last two years from the federation while it received even more than this during the last ten years. Where and how was this money spent is the question?.",
  "retrievedAt": "2025-08-11T20:09:53.018Z"
}
