{
  "title": "Pakistan, UAE ties represent unique case in Arab-Asian relations: UAE FM",
  "link": "https://www.app.com.pk/national/pakistan-uae-ties-represent-unique-case-in-arab-asian-relations-uae-fm/",
  "date_published": "2020-12-20T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Foreign Minister of United Arab Emirates (UAE) Sheikh Abdullah bin Zayed Al Nahyan said Pakistan-UAE close ties continued to strengthen over the past decades representing a unique case in Arab-Asian relations in the region.\n“The close relations between the UAE and Pakistan have continued to strengthen over the past decades, and translated into multi-faceted cooperation, which represents a unique case in Arab-Asian relations in the region, as political relations between the UAE and Pakistan are based on a long history of joint action, trust, and respect,” the foreign minister said.\nThe mutual interests and visions of the two countries converged on issues of regional and international importance through the principles of tolerance, inclusiveness and an agenda based on development to ensure peace and stability in the region, he said.\nIn a statement issued on Saturday by the UAE foreign ministry following the conclusion of two-day visit of Foreign Minister Shah Mahmood Qureshi to the Emirates, the UAE foreign minister affirmed the depth of bilateral relations and recalled the keenness of the late Sheikh Zayed bin Sultan Al Nahyan on the relations during the early stages of establishment.\nThe discussion between the two foreign ministers encompassed ways to further enhance and strengthen joint cooperation in various fields, consistent with the directives of the leadership of the two countries.\nBoth sides discussed the challenges and repercussions of the COVID-19 pandemic, economic and investment issues of mutual interest, and prospects for further joint cooperation to achieve aspirations of the two friendly countries and people.\nThe two sides exchanged views on the latest developments in the region, and discussed regional and international issues of mutual concern and ways to coordinate responses on issues of interest.\nThe UAE foreign minister affirmed depth of the distinguished relations between the two countries and showed keenness to enhance and develop further aspects of joint cooperation across all fields.\nAppreciating Pakistani community in UAE, he said more than 1.5 million of the Pakistani diaspora enjoyed safety and stability there and praised their great role and active contribution towards growth and prosperity of the country.\nHe noted that this reflected the interconnectivity of people of the two friendly countries, stressing temporary nature of the recent restrictions imposed on the issuance of visas due to the outbreak of the COVID-19 pandemic.\nHe recalled that Pakistan was among the first countries to establish diplomatic relations with the UAE. The two friendly people and countries share strong historical ties that enhance prospects of their broad cooperation across all fields.\n“The UAE and Pakistan enjoy close relations and historical ties across political, economic, cultural and social domains, established on solid foundations of mutual friendship and respect,” he remarked.",
  "retrievedAt": "2025-08-11T20:09:58.197Z"
}
