{
  "title": "Concluding white collar mega corruption cases – a challenging task: Chairman",
  "link": "https://www.app.com.pk/national/concluding-white-collar-mega-corruption-cases-a-challenging-task-chairman/",
  "date_published": "2020-12-20T15:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):Chairaman National Accountability Bureau (NAB) Justice (Retd) Javed Iqbal on Sunday said logical conclusion of white collar mega corruption cases was a challenging task but the bureau was determined to accomplish the task by redoubling efforts.\nNAB’s faith was to work for corruption free Pakistan and it has chalked out anti-corruption strategy through awareness, prevention and enforcement which has started yielding excellent results, said a statement issued here.\nNAB was an apex national anti-corruption organization which has no affiliation with any party, group or individual, he said adding, NAB’s only affiliation was with the state of Pakistan.\nPakistan was considered as a role model for South Asian Association for Regional Cooperation countries for eradication of corruption due to NAB’s efforts. The World Economic Forum and Transparency International Pakistan have also appreciated NAB’s efforts against corruption.\nHe said NAB was the focal organization of Pakistan under United Nations Convention against Corruption (UNCAC) which has pride for Pakistan due to its efforts.\nNAB was the only organization in the world to which China has signed an Memorandum of Understanding (MoU) to oversee China Pakistan Economic Corridor projects in Pakistan.\nNAB has introduced a Combine Investigation Team (CIT) system to benefit from the collective wisdom of senior supervisory officers.\nThe system was lending quality. NAB has established its own forensic science laboratory in NAB Rawalpindi which help improve quality of investigations. NAB has received more complaints in 2019 as compared to the same period of 2018 which showed that people have shown trust upon NAB.\nNAB has established more than 50,000 character building societies in universities and colleges in collaboration with Higher Education Commissiin (HEC) to create awareness among students about the ill effects of corruption at an early age besides establishing prevention committees to identify and to plug loopholes.\nThe Chairman NAB directed all bureaus of NAB to utilize all available resources to nab corrupt and arrest of proclaimed offenders and absconders so that they could be brought to justice.",
  "retrievedAt": "2025-08-11T20:09:51.327Z"
}
