{
  "title": "Rented people can’t afford to stage sit-in in freezing cold nights of Islamabad: Noor-ul-Haq",
  "link": "https://www.app.com.pk/national/rented-people-cant-afford-to-stage-sit-in-in-freezing-cold-nights-of-islamabad-noor-ul-haq/",
  "date_published": "2020-12-20T15:50:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 20 (APP):Federal Minister for Religious Affairs and Interfaith Harmony Pir Noor-ul-Haq Qadri Sunday said that opposition leaders have announced to submit resignations on January 31st but they have not mentioned the year.\nTalking to media after attending a Hajj Conference with the representatives of Hajj Organisers Association Pakistan and Hajj Organisers Association Sindh at Haji Camp, he said “I don’t think they (opposition leaders) will submit any resignations before 2023”.\nThe minister said that staging sit-in was not an easy task. Prime Minister Imran Khan had an extensive experience in staging sit-ins.\nPir Noor-ul-Haq Qadri said that inflation was due to the corruption of previous rulers. The rented people can not stage sit-in in freezing cold nights of Islamabad.\nHe said that Saudi Arabia had not yet announced a clear policy for Hajj-2021. All the stakeholders would be consulted and their suggestions would be shared with the Saudi officials. Umrah was being performed with proper SOPs and the situation was gradually improving. For the Hajj-2021, all out efforts would be made to ensure maximum facilities for the pilgrims.\nThe Minister said that the government would make efforts for ensuring minimum cost of Hajj however if there would be SOPs, Hajj may be expensive.\nEarlier, presiding over the meeting Pir Noor-ul-Haq Qadri said it was the first consultative meeting for Hajj 2021 and no formal meeting had been held before this.\n“Last year the Hajj was not normal Hajj but now that the vaccine has been introduced, situation is gradually heading towards improvement. We can’t come to any conclusion until Saudi Arabia government makes any decision”.\nThe representatives of Hajj Organisers Associations suggested that maximum age limit for pilgrimage fixed by the Saudi government should be raised from 50 years to 65 years.\nThey also suggested that the intending pilgrims must be given priority with regard to COVID-19 vaccine.\nFederal Minister for Religious Affairs Pir Noor-ul-Haq Qadri assured the participants that their suggestions would be considered.",
  "retrievedAt": "2025-08-11T20:09:49.975Z"
}
