{
  "title": "UNICEF plans to transport up to 850 tonnes of COVID-19 vaccines per month",
  "link": "https://www.app.com.pk/national/unicef-plans-to-transport-up-to-850-tonnes-of-covid-19-vaccines-per-month/",
  "date_published": "2020-12-20T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP):United Nations International Children’s Emergency Fund (UNICEF) could potentially transport up to 850 tonnes of COVID-19 vaccines per month in 2021, should such quantities become available, according to a new assessment.\nThis is more than double the average weight of vaccines UNICEF transports every month. UNICEF in partnership with Gavi and WHO was also helping low and lower-middle-income countries prepare to receive COVID-19 vaccines in 2021, said a press release issued here.\nThe assessment is part of UNICEF’s work to lead on the procurement and delivery of COVID-19 vaccines for 92 low- and lower middle-income countries on behalf of the COVAX Facility, in collaboration with the Pan American Health Organization (PAHO).\n“This is a mammoth and historic undertaking,” said Henrietta Fore, UNICEF Executive Director. “The scale of the task is daunting, and the stakes have never been higher, but we are ready to take this on.\n” “With the imminent arrival of globally approved COVID-19 vaccines, we can begin to see signs of hope.\nBut hope will not be restored by the vaccine alone. Countries need urgent technical and financial support to strengthen their capacities for cold and supply chains, to train health workers, and to work with communities in combatting misinformation and building trust in vaccines. Without urgent funding and support, many of the poorest countries still risk being left behind, said Fore.\n” The UNICEF assessment looked at global airfreight capacity and transport routes to better understand the challenges of delivering COVID-19 vaccines in 2021. It found that commercial airlines will be able to deliver vaccines to almost all 92 low- and lower-middle-income countries, which are among the 190 economies participating in the COVAX Facility, at an estimated cost of up to US$70 million.\n“The day is not far when we start receiving COVID-19 vaccines in Pakistan,” said UNICEF Representative in Pakistan, Ms. Aida Girma.\n“As the Ministry of National Health Services, Regulations and Coordination leads the formation of a comprehensive and effective strategy for in-country supply and administering of the vaccine prioritizing frontline health workers and patients in urgent need, UNICEF will use its strengths in community engagement and vaccine supply to make sure that COVAX facility have safe, fast and equitable access to the vaccine.\n” “It is, however, important to realise that strict adherence to the preventive SoPs such as hand washing, physical distancing and mask wearing, is equally important besides having a safe and effective vaccine, diagnostics and treatments,” she added.\nComparing vaccine volume estimates against commercial and cargo routes across the globe, the assessment also found that current air cargo capacity would be sufficient to make deliveries covering 20 per cent of the population for most of the 92 countries.\nCOVID-19 vaccines are expected to be primarily shipped using existing passenger and cargo flight capacity, although charters or alternative transport options may still be needed for some small countries and others with access issues. UNICEF is working with airlines and the wider logistics industry to prioritise the delivery of COVID-19 vaccines around the world.\nOne major challenge in the COVID-19 vaccine operation is local cold chain capacity for vaccine storage within some low- and lower-middle-income countries. UNICEF, WHO and Gavi, the Vaccine Alliance, developed a guidance note on supply and logistics to help countries develop their supply chain strategies to receive, store, distribute and manage COVID-19 vaccines and related products. Given the range of storage temperatures required for COVID-19 vaccines, countries will continue to train logisticians and health workers on how to keep COVID-19 vaccines at the right temperatures.\nAs part of a programme that started in 2017, with support from Gavi, UNICEF continues to procure and support the installation of 70,000 cold-chain fridges in lower-income countries by the end of 2021, which will help in the roll-out of COVID-19 vaccines that need to be stored at 2 to 8 degrees Celsius.\nAlmost half of these will be solar powered. UNICEF, WHO and Gavi are also working to help countries prepare and develop national deployment and vaccination plans for the large-scale roll out of COVID-19 vaccines.\nCurrently, countries are continuing to monitor their readiness against key milestones, which include expediting regulatory approvals and putting in place ways to monitor vaccine safety.\nIn addition, a UNICEF meeting this week with more than 300 vaccine procurement experts globally, including government officials, looked at ways to procure and roll-out COVID-19 vaccines and strengthen regulatory systems and supply chains. Funding is critical.\nUNICEF has called for US$410 million to help countries with the delivery of vaccines, therapeutics and diagnostic tools in 2021. Further, UNICEF estimates a funding gap of US$133 million to cover in-country vaccine logistics and the required cold chain equipment for the poorest 92 countries.",
  "retrievedAt": "2025-08-11T20:09:49.994Z"
}
