{
  "title": "COP-29 in Baku to unveil debate on pressing climate issues including Adaptation Plans, BTR: Babayev",
  "link": "https://www.app.com.pk/national/cop-29-in-baku-to-unveil-debate-on-pressing-climate-issues-including-adaptation-plans-btr-babayev/",
  "date_published": "2024-05-11T15:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP): Azerbaijan, Minister for Ecology and Natural Resources, President-Designate COP-29, Mukhtar Babayev on Saturday said the COP-29 meeting to be held in Baku would unveil an all-inclusive forum for all the countries to debate on pressing climate issues including adaptation plans and biennial transparency report (BTR) for concerted mitigation efforts.\nHe was addressing the Sustainable Development Policy Institute (SDPI) seminar titled “Seminar on Building Climate Consensus for COP29: The Road to BAKU” held here.\nMukhtar Babayev informed that he had held discussions with members of the civil society, youth, private sector and political leadership of Pakistan as part of the effort to gather all parties to get common and consensus-based decision at COP-29 which was an uphill task.\nHe added that the critical matters to be raised at the forum were mobilization of loss and damage fund, article 6 of Paris Agreement, whereas the others aspects apart from climate finance would also be brought under discussion including land degradation, plastic waste, agriculture, food security, health issues, as each sector of our life was very integrated to climate.\nHe underlined that to hear the voices of vulnerable countries was Azerbaijan’s biggest priority. Babayev noted that only regional and international consolidation of actions could lead to appropriate measures and strategies to prevent climate extreme events.\nHe mentioned that the government of Azerbaijan was organizing training workshops for capacity building of the developing countries to prepare their national adaptation plan and it would be the first time that countries would be submitting biennial transparency reports to the UNFCCC.\nAzerbaijan, he said was also convening COP-29 participants in Baku to discuss ways to make the process efficient and achieve consensus on mobilization of the loss and damage fund.\nHe announced that there was need to develop strong civil society consultations with Pakistani civil society to discuss climate issues, and therefore, Azeri climate champions would hold a round of session with Pakistani counterparts to share smart and green skills’ initiative with Pakistan.\nHe added that renewable energy transition was a major part of the Azeri government’s work to provide implementation and dialogue on plans to shift over RE as countries have different capacities in terms of infrastructure, finance and expertise.\nPrime Minister’s Coordinator on Climate Change Romina Khurshid Alam in her opening remarks said Pakistan believed in collaboration for mutual economic interests and intended to further strengthen the cultural bonds between the friendly nations.\n“Despite geographically distant, we are united due to share commitment on climate change, whereas Pakistan has sent it’s complete support to Azerbaijan for hosting the COP-29 moot and wish success to the host country,” she added.\nClimate justice, she said was the fundamental principle guiding Pakistan’s policy on climate change, whereas Pakistan advocated for equality, justice and harmony in climate initiatives globally.\n“We urge developed countries to fulfill their commitment to transfer technologies and resources for developing countries to ensure just energy transition,” Romina said.\nPakistan believes that Pakistan and Azerbaijan can achieve climate resilience through cooperation in transfer of technology, knowledge sharing research and synergized efforts in multisectoral realms, the PM’s Coordinator said.\nDr Abid Qaiyum Suleri, Executive Director, SDPI in his opening remarks said the COP forum was an important global platform that provided the entire world to unite and discuss over ways to address environmental degradation.\n“COP is one of the processes that had been less beneficial at times but it’s absence would be extremely negative. However, the international gathering of nations at COP which is glass half full, is still a forum for countries like Pakistan to raise their plight and share opportunities to enhance collaborations,” he added.\nHe underscored that Pakistan had received very little in terms of climate finance whereas its internal climate financing of $30 billion was solely mobilized by the local communities, private and humanitarian agencies whereas 80% of the local communities restored life back to normal after 2022 floods.\nDr Suleri mentioned that there has been great energy among youth and intelligentsia of Pakistan to work in the areas related to climate change.\nAmbassador of Republic of Azerbaijan, Khazar Farhadov briefed the participants about the vision of the country on hosting COP-29 and highlighted the efforts being taken so far to spearhead efforts for an inclusive global climate conference.\nThe session eas Moderated by Zainab Naeem Associate Research Fellow, SDPI whereas Energy and Economy Expert, Research Fellow SDPI Dr Khalid Walid provided a brief presentation on on way forward for energy transition.\nHe mentioned that just energy transition was not possible sans revamping of existing financial infrastructure, whereas carbon markets and equitable development was another important topic for COP-29 forum’s debate.\nDr Shafqat Munir, Deputy Executive Director, extended a vote of thanks to the Azerbaijan Minister and President-Designate COP-29, Ambassador of Azerbaijan, SDPI Executive Director for organizing an inclusive seminar.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:27:08.762Z"
}
