{
  "title": "PUC applauds UN resolution granting Palestinians full membership status, Route to Makkah expansion",
  "link": "https://www.app.com.pk/national/puc-applauds-un-resolution-granting-palestinians-full-membership-status-route-to-makkah-expansion/",
  "date_published": "2024-05-11T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP): The Pakistan Ulama Council (PUC) has welcomed the resolution passed by the United Nations General Assembly on Friday, affirming the eligibility of Palestinians for full membership status at the United Nations.\nIn an exclusive interview with the media on Saturday, PUC Chairman Hafiz Muhammad Tahir Mehmood Ashrafi expressed his appreciation for this gigantic move, emphasizing that it underscored the global community’s unwavering support for the establishment of an independent Palestine and the right to self-determination of the Palestinian people.\nHe further urged world powers and all United Nations members to advocate for Palestine’s permanent membership and to take immediate and decisive action against Israel’s egregious acts, halting the senseless massacre of innocent civilians.\nHe conveyed gratitude to the nations instrumental in presenting the resolution, particularly highlighting the contributions of the Kingdom of Saudi Arabia, the United Arab Emirates, Qatar, Turkiye, Iran and other supportive countries.\nIn addition, Ashrafi appreciated the Route to Makkah facility launched at Jinnah International Airport Karachi this year, following its successful implementation at Islamabad International Airport. He said this expansion would prove a crucial step in facilitating pilgrims traveling to the Kingdom for Hajj.\nHe said the Route to Makkah initiative, a joint effort between the two nations, would streamline the immigration process for Pakistani pilgrims traveling to Saudi Arabia. By establishing dedicated immigration counters and facilities at the following airports, Ashrafi said the project would enhance the overall pilgrimage experience, reduce waiting times, and ensure a hassle-free journey for pilgrims.\nHe said the implementation of the Route to Makkah project at Jinnah International Airport Karachi was a good omen for thousands of pilgrims from Sindh and adjoining regions. With Karachi being one of the busiest airports in Pakistan, the availability of dedicated facilities for pilgrims expected to significantly alleviate congestion and enhance operational efficiency during peak travel seasons, he maintained.\nAshrafi said the expansion of the Route to Makkah project underscored the commitment of both the Saudi and Pakistani governments to enhancing bilateral ties and promoting religious tourism between the two countries. He said this initiative not only served as a testament to the strong friendship between Pakistan and Saudi Arabia but also demonstrated a shared vision for providing exceptional services to pilgrims undertaking the sacred journey to the holy land.\nAshrafi expressed hope that the Route to Makkah project would be expanded further to other airports across Pakistan as authorities are optimistic about its positive impact on the overall pilgrimage experience. By prioritizing the convenience and well-being of pilgrims, he said this initiative had reaffirmed the commitment of both nations to facilitating religious tourism and fostering closer ties between the people of Pakistan and Saudi Arabia.\nIn conclusion, Ashrafi underscored the efforts made by Prime Minister Muhammad Shehbaz Sharif during his government’s previous tenure to expand the Route to Makkah initiative. He also extended gratitude to the Saudi Crown Prince, Muhammad bin Salman, for issuing a directive to establish this facility at the Karachi airport.",
  "retrievedAt": "2025-08-11T02:26:46.867Z"
}
