{
  "title": "Pakistan strongly rejects spate of India’s false terrorism-related claims",
  "link": "https://www.app.com.pk/national/pakistan-strongly-rejects-spate-of-indias-false-terrorism-related-claims/",
  "date_published": "2022-08-21T08:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): Pakistan has firmly rejected the recent spate of false terrorism-related assertions made by India in which some detached alleged incidents were being distorted and presented as a so-called ‘terror’ plot, reminding it ‘not to make any mistake again’.\n“All this is nothing but continuation of the sinister Indian design to yet again raise the “terrorism” bogey to malign Pakistan. We reject these allegations and Indian machinations outrightly,” the Foreign Office Spokesperson said in a press release on Sunday\nWhile strongly denouncing the latest Indian insinuations and allegations, Pakistan called upon India not to make any mistake again.\n“Pakistan stands ready and resolute and is fully capable of effectively responding to any misadventure as was manifestly evident in response to India’s ill-advised and irresponsible action in February 2019,” the spokesperson said.\nIn order to build on this orchestrated ‘terrorism‘ narrative against Pakistan, a section of the Indian media reported that India had intercepted a message from a ‘Pakistani’ WhatsApp number as well as seized an ‘empty boat’ in Maharashtra along with some weapons.\nSegments of the Indian media deceitfully sought to link these to the preposterous claims about a so-called ‘Mumbai style’ attack being planned. Separately, the Indian media also reported that the Indian intelligence and border forces were on high alert for possible ‘cross-border infiltration’ attempts along Rajauri.\nThe spokesperson said that the mischievous Indian propaganda campaign and baseless allegations against Pakistan reflected its utter desperation emanating from its complete failure to break the will of the Kashmiri people in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe possibility of a choreographed ‘false flag activity’ to target Pakistan and negatively affect its political and economic interests could not be ruled out, as Indian propaganda was pointing in that direction, it was added.\n“India must recognise that no amount of its false propaganda can deter Pakistan from exposing India’s brutalisation of the Kashmiri people through an unabated military siege, indiscriminate use of force, extra-judicial killings, incarceration of Kashmiri leaders and youth, crackdown on the media and human rights activists, and denial of access to international human rights and humanitarian organisations to IIOJK,” the spokesperson said.\nThe spokesperson said Pakistan also urged the international community to take immediate cognizance of the fact that India was yet again resorting to classic ‘false flag’ methods to advance its sinister designs and that this could have serious implications for peace and security in the region. The international community must urge India to act responsibly.\nIndia should also be held accountable for its gross and systematic violations of human rights and international humanitarian law in IIOJK. The realisation of sustainable peace, stability and prosperity in South Asia remained contingent upon peaceful resolution of the long-standing Jammu and Kashmir dispute in accordance with the relevant UN Security Council resolutions and the wishes of the Kashmiri people, it was further added.",
  "retrievedAt": "2025-08-11T15:26:31.960Z"
}
