{
  "title": "Islamabad police registers FIR against Imran Khan",
  "link": "https://www.app.com.pk/national/islamabad-police-registers-fir-against-imran-khan/",
  "date_published": "2022-08-21T15:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): Islamabad police have registered First Information Report (FIR) against PTI Chairman Imran Khan for terrorizing police as well as judiciary in his speech at F-9 Park a day ago.\nPTI Chairman Imran Khan has been booked under Section 7 of the Anti-Terrorism Act (punishment for acts of terrorism) regarding his comments at his Islamabad rally where he threatened top police officials and a female additional and sessions judge in his address.\nAccording to the FIR registered at Islamabad’s Margalla police station at 10pm on Saturday, under the complaint of Magistrate Ali Javed, it has been stated that Imran Khan terrorized and threatened top police officials and a respected female additional and sessions judge in his address to a rally at F-9 park.\nThe FIR reproduced the comments of PTI chairman where he spoke about the female judge as well as Islamabad police officials and warned them not to be spared.\nIt is to mention that Additional District and Sessions Judge Zeba Chaudhry approved Gill’s two-day physical remand at the request of the capital police. Imran Khan threatened her by saying that she should prepare herself as action would be taken against her. He also warned IGP Islamabad and DIG that they both also would not be spared.\nThe FIR argued that Imran’s speech was meant to terrorize the top police officials and the judiciary so they could not perform their functions and abstain from pursuing any action against any PTI-related individual(s) if required to do so.\nThe magistrate argued that Imran’s speech had spread fear and uncertainty among the police, judges and the nation. It stated that country’s peace had been harmed and legal action should be pursued against accused and an exemplary punishment to be meted out.",
  "retrievedAt": "2025-08-11T15:26:27.591Z"
}
