{
  "title": "Mengal vows to continue sit-in despite attack - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan National Party-Mengal (BNP-M) chief Sardar Akhtar Mengal has vowed to continue the party’s long march and sit-in despite surviving a suicide bombing near the Lakpass area of Mastung district.\n\nSpeaking to the media after the attack, Mr Mengal called it a deliberate attempt to target the BNP-M protesters. He said such tactics would not intimidate the party into abandoning its protest as it would hold the sit-in until the release of all women prisoners.\n\n“The government has crossed a red line by arresting women,” he said, desrcibing it as a matter of dignity and honour.\n\nAccusing security forces of neglecting their duties, Mr Mengal alleged that no law enforcer arrived at the blast site and no evidence was collected. “Their job is not to extort money from oil tankers but to ensure public safety,” he said.\n\nHe said the attack occurred as soon as the rally began and party workers and security personnel noticed a suspicious individual. “When confronted from a distance, the suspect pulled out a pistol and started running. As security personnel pursued him, he detonated his explosives,” he said.\n\nBNP-M demands investigation, asks govt to ensure safety of party leaders, workers\n\nMr Mengal alleged that despite the attack, no security measures were taken by the authorities. He criticised the Frontier Corps, Levies, and Anti-Terrorism Force, questioning their role in ensuring public safety. “What is their job? Is security not their responsibility?” he asked.\n\nBNP-M seeks investigation\n\nThe party’s central information secretary, Agha Hassan Baloch, confirmed that two party workers sustained injuries in the attack.\n\nAddressing a press conference, Mr Baloch said two armed individuals were held, while an accomplice of the suicide bomber was still at large. “We had expressed concerns over the security of Mr Mengal and the sit-in last night. Today, a suicide bomber blew himself up near our rally,” he said.\n\nHe warned that the government would be responsible if any harm came to Mr Mengal or other party leaders.\n\nMr Baloch also condemned the use of force against BNP-M supporters at the Lakpass tunnel. He alleged that police used batons and tear gas against party workers, resulting in at least five injuries and the arrest of 40 individuals.\n\nHe said that Mr Mengal was supposed to announce the future course of action in a press conference in Mastung on Saturday, but authorities blocked journalists from covering the event.\n\nThe BNP-M leader demanded that the government launch a transparent investigation into the attack and ensure the safety of BNP-M leaders and workers. He reiterated that the party’s long march would continue until all detained women activists were released.\n\nThe Quetta district administration had already rejected BNP-M’s request for a rally, warning that any protests would face legal action.\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e8a1b3c3985.gif",
  "retrievedAt": "2025-10-12T02:16:25.611Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901230/mengal-vows-to-continue-sit-in-despite-attack",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T01:47:54.000Z"
}
