{
  "title": "Turkiye opposition presses protests as Swedish reporter jailed - World - DAWN.COM",
  "author": null,
  "content": "Turkiye’s opposition on Sunday worked to keep up the momentum of the protest movement triggered by the arrest of Istanbul’s mayor after a giant weekend rally, with a Swedish reporter the latest detained in a government crackdown.\n\nThe arrest on March 19 of Istanbul’s opposition mayor Ekrem Imamoglu, on corruption charges his supporters say are false, sparked the most significant anti-government protests in Turkiye in over a decade, in a major test for President Recep Tayyip Erdogan.\n\nAfter over a week of nighttime street protests, Imamoglu’s Republican People’s Party (CHP) on Saturday mobilised hundreds of thousands of people for a giant rally in Istanbul calling for the release of Imamoglu, seen as the candidate with the best chance of defeating Erdogan at the ballot box after almost a quarter of a century in power.\n\nWith Turkiye entering several days of public holiday marking the end of the Ramadan Muslim fasting month, the opposition has vowed to keep up the protest movement while switching tactics to more focused events.\n\nCHP party leader Ozgur Ozel, a former pharmacist who has stepped in as the party’s main public flagbearer as Imamoglu languishes in Silivri prison in Istanbul, on Saturday announced that protests would be held in a different one of Turkiye’s 81 provinces every weekend and a different district of Istanbul every Wednesday.\n\nOn Sunday, he launched a campaign to gather signatures for a petition calling for Imamoglu’s release and early elections, beginning the drive in the now-suspended mayor’s home Black Sea region in eastern Turkiye.\n\n“God is my witness that Ekrem Imamoglu’s crime is to be Tayyip Erdogan’s rival,” Ozel said.\n\n“The reason Imamoglu was thrown into jail is that he defeated Mr Tayyip in the past,” he said, referring to how Imamoglu thrashed ruling party candidates in 2019 and 2024 elections for the mayor of Istanbul, a post Erdogan himself once held.\n\n“And he (Imamoglu) has the strength and wisdom to defeat him (Erdogan) in the future,” Ozel added.\n\nThe government has responded to the protests with a crackdown that has troubled the NATO member’s allies and rights groups, with dozens of young people spending the holiday behind bars, journalists detained, and foreign reporters held or deported.\n\nSwedish journalist Joakim Medin, who works for the Dagens ETC newspaper, was arrested on his arrival in Turkiye to cover the protests Thursday. He is being held on terror-related charges and for “insulting the president”, the Turkish presidency said.\n\nHis newspaper’s editor in chief, Andreas Gustavsson, described the accusations as “absurd”, telling AFP that “practicing journalism should not be a crime”.\n\nTurkish authorities have also deported BBC journalist Mark Lowen, who had been covering the protests, after holding him for 17 hours on Wednesday, saying he posed “a threat to public order”, the broadcaster said.\n\nAFP photographer Yasin Akgul was arrested on Monday morning in a dawn raid.\n\nHe was released on Thursday.\n\nInterior Minister Ali Yerlikaya said on Thursday, 1,879 people had been detained in connection with the protests since March 19, with 260 of them remanded in custody pending trial.\n\n“You can’t prosper with oppression, stop oppressing the young children of this country,” said Ozel in a message to the authorities.\n\nFather Sinan Karahan said he would for the first time be spending the holiday without his 22-year-old son Sinan Can, a university student, who was sent to Silivri prison after being arrested in an Istanbul protest.\n\n“These children were born when this party was in power, and grew up under this government. They are not happy with its practices and they are rising up,” he told AFP, saying he had visited his son in prison on Friday and he was in good health.\n\nErdogan has previously branded the demonstrations “street terror”. Authorities have used tear gas, pepper spray and rubber bullets to disperse the protesters.\n\nMarta Kos, enlargement commissioner of the EU, which Turkiye still officially wants to join, said the arrests and deportations of journalists go against Turkiye’s “commitments and democratic tradition”.\n\n“Freedom of assembly is a fundamental right”, the Turkish authorities have committed to in their quest to join the bloc, she added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:33:45.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901312/turkiye-opposition-presses-protests-as-swedish-reporter-jailed",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T11:17:44.000Z"
}
