{
  "title": "Gadoon Industrial Estate workers complain about non-payment of salary - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: Over 30,000 workers in Gadoon Amazai Industrial Estate have not received their salary, spoiling their Eidul Fitrcelebrations, Dawn learnt here on Saturday.\n\nWhen contacted, various workers told Dawn on condition of anonymity because they could be fired if their identity was revealed, that their families, especially children, would suffer immensely on the auspicious occasion of Eid.\n\nThe dejected workers said they strived to get even half the salary before Eid, meeting officials, but to no avail. They said they had no option but to borrow from their relatives for Eid.\n\n“It is not easy to ask someone to lend money,” said a worker, adding they were in hot waters amid record-high inflation.\n\nMeanwhile, the owners of the industrial units have failed to implement the government’s minimum wage policy.\n\nThe government increased the minimum wage to Rs37,000 from Rs32,000 in the last budget, effective from July 1, 2024. However, the majority of industrial units have so far not implemented the government decision.\n\nThe workers recalled that it was not the first time and whenever the government increased the minimum wage, it was not implemented in the Gadoon Estate. They alleged that politicians and the ruling elite provided an opportunity to industrialists to exploit the workers.\n\nThe workers said they had appealed to the labour director for implementation of the minimum wage policy, but to no avail.\n\nBoth the industrialists and labour director could not be contacted for their version on the matter.\n\nHowever, an official in an industrial unit said that the business community was already hard pressed, and in such an environment they could not implement the minimum wage policy.\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:16:42.246Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901145/gadoon-industrial-estate-workers-complain-about-non-payment-of-salary",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T00:51:59.000Z"
}
