{
  "title": "Hard habits - Newspaper - DAWN.COM",
  "author": null,
  "content": "FEELING the heat, the ruling elite has rolled out some big guns for the fight against national fragility.\n\nThis week, the high-powered ‘Harden the State Committee’, which counts among its members two federal secretaries, the FBR chairman, and representatives of all the top civil and military intelligence agencies, convened to brainstorm, among other things, strategies to curb the export of beggars to the Gulf.\n\nJust a few days later, Prime Minister Shehbaz Sharif chaired another high-level meeting, this one attended by representatives of the information ministries of all four provinces and Azad Kashmir, to discuss how TV dramas and films may be used to enlighten the general public about the ills of terrorism and extremism.\n\nThat such issues are now on the agenda of these high-powered committees shows that the state is at least serious about achieving a more adequate level of hardness. But is all this necessary?\n\nCan ideas like state-produced TV dramas and films really contribute towards building national narratives in this day and age? Admittedly, our media industry has a few examples of state-sponsored productions attaining immense public popularity. Some of these dramas, in their heyday, were even able to evoke much patriotic fervour among ordinary citizens. However, the last of such nationally popular productions was released in the 1990s, when there were no smartphones and content-streaming platforms, and when the family television set was all there was for evening entertainment. These days, TV and film products compete in a globalised market, where production values often overshadow the script and where a massive variety of content is always available to distract audiences. Dramas and films cost a fortune to produce and are more often than not misses rather than hits. What, then, is the regime thinking? Can we really afford such undertakings given Pakistan’s present state of finances?\n\nOur energies would be better spent elsewhere. The fundamental ‘whys’ of our myriad problems are well known. The solutions to them are also obvious. The only thing required is for the state to acknowledge its mistakes and correct course.\n\nInstead, we continue to see individuals and institutions transgressing into unrelated domains, which creates bigger problems out of small ones. For example, a high-level committee comprising some of the top intelligence officials should have more important things on its agenda than curbing international begging. That is a job best left to the police. Likewise, politicians need not concern themselves with producing TV dramas. Their job is to ensure that social pressures do not build to the point where problems like militancy and terrorism become a national headache. It is routine interference like this that has not let our state harden sufficiently.\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:33:48.559Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901215",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T01:34:28.000Z"
}
