{
  "title": "Farhan Mallick’s plea against bail dismissal to be taken up after Eid - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A district court on Saturday issued notices to the Federal Investigation Agency (FIA) on a bail application of journalist Farhan Mallick in a case related to alleged anti-state content on his YouTube channel.\n\nThe suspect through his lawyer filed an application before the district and sessions judge east after a judicial magistrate had dismissed his post-arrest bail plea.\n\nThe applicant asked the court to overturn the order of magistrate and set him free on bail.\n\nRepresenting the applicant, advocate Abdul Moiz Jaferii argued that the impugned FIR lodged by the FIA was merely a fishing expedition to conjure up a case against the applicant in an abuse of Peca laws as the applicant had no nexus with illegalities detailed therein and the entire edifice of the allegations levelled against him was not supported by even a speck of evidence.\n\nJudge issues notice to FIA for April 3; FIR just a fishing expedition to fit up journalist under Peca laws, court told\n\nHe also asserted that it was an established law that bail was not to be withheld as a punishment especially in the instant case where there was absolutely no incriminating material against the applicant before the court.\n\nThe counsel further contended that protection against retrospective punishment was provided in Article 12 of the Constitution as no law shall authorise the punishment of a person for an act or omission that was not punishable by law at the time of the act or omission.\n\nHe submitted that the impugned FIR charges against the applicant under Section 26-A of Peca and the inquiry was initiated in November, 2024 when Section 26-A did not exist rendering its insertion in the impugned FIR legally void on the grounds of retrospectivity.\n\nThe district judge issued notice to the FIA with direction to come up and advance arguments on the bail application on April 3.\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:34:09.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901186/farhan-mallicks-plea-against-bail-dismissal-to-be-taken-up-after-eid",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T01:20:24.000Z"
}
