{
  "title": "Suicide bomber targets BNP-M sit-in near Mastung - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Akhtar Mengal, supporters remain unharmed\n• Party seeks Mahrang Baloch’s release\n\nQUETTA: Sardar Akhtar Mengal and other participants of the Balochistan National Party-Mengal (BNP-M) protest sit-in survived a suicide attack near the Lakpass area of Mastung district on Saturday.\n\nOfficials said the suicide bomber detonated the explosives strapped to his body away from the sit-in site after security guards intercepted him, preventing him from reaching the stage where the BNP-M leaders were present.\n\n“Sardar Akhtar Mengal, party workers and supporters remained unharmed in the attack,” police confirmed, adding that no casualties were reported. However, Mr Mengal claimed that at least four party members were injured in the blast.\n\nThe sit-in continued despite the attack. “Our protest will continue until the release of Dr Mahrang Baloch and other BYC (Baloch Yakjehti Comm­ittee) leaders and workers arrested last week after the police crackdown on the BYC sit-in in Quetta,” Mr Mengal vowed.\n\nLed by Mr Mengal, the BNP-M had launched its long march from Wadh on Friday morning. After covering some 300 kilometres, the march reached Lakpass late at night. However, Quetta’s administration blocked the marchers from crossing the Lakpass tunnel by placing trailers on the highway and deploying heavy security contingents, preventing them from entering the city.\n\nAfter being denied entry, BNP-M supporters converted their march into a sit-in at the intersection of the Quetta-Karachi and Quetta-Taftan highways near Lakpass.\n\nAccording to sources, security personnel spotted a suspicious individual heading towards the sit-in camp.\n\nMr Mengal’s security guards intercepted him and moved him away from the protest site, where he blew himself up.\n\nLevies officials stated that personnel deployed at the scene had initially attempted to push the suspect away from the sit-in area. The bomber reportedly fled before detonating himself at a distance from the protest camp.\n\n“The suicide bomber blew himself up around 400 yards from the sit-in site,” a BNP source said, confirming that no damage was caused to the camp or participants.\n\nPolice recovered body parts of the attacker from the blast site. An investigation was launched into the incident.\n\nSpeaking after the attack, Mr Mengal reiterated that his party faced no threats from any militant group. “If we have any threat, it is from the state,” he alleged, accusing authorities of attempting to escalate tensions. He maintained that his protest would remain peaceful despite the attack.\n\nBalochistan government spokesperson Shahid Rind confirmed the suicide attack, stating, “There has been no loss of life. Sardar Akhtar Mengal and the entire BNP-M leadership are safe.”\n\nMr Rind noted that the BNP-M’s sit-in remained ongoing near the site of the attack and that the government would inform the public after completing its inquiry into the incident.\n\nHe said the provincial government was in contact with the BNP-M leadership and was committed to ensuring the safety of the rally’s participants. A party delegation met the local administration on Friday night, following which it was agreed that a government delegation would meet Mr Mengal.\n\nA bomb disposal squad and Counter-Terrorism Department (CTD) officials have examined the site and collected evidence. Authorities have taken some suspects into custody for interrogation, while further investigation is in progress.\n\nNo group or individual immediately claimed responsibility for the attack.\n\nBilawal condemns attack\n\nMeanwhile, PPP Chairman Bilawal Bhutto-Zardari, whose party rules the province, condemned the suicide attack.\n\nHe said the attack targeting the BNP-M’s head was a matter of concern and asked Chief Minister Sarfraz Bugti to bring the planners of the blast to justice.\n\nM.B. Kalhoro in Larkana also contributed to this report\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e88eea58eb7.jpg",
  "retrievedAt": "2025-10-12T02:16:27.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901157/suicide-bomber-targets-bnp-m-sit-in-near-mastung",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T00:51:22.000Z"
}
