{
  "title": "HOW TO COUNTER THE INSURGENCIES - Newspaper - DAWN.COM",
  "author": null,
  "content": "“And worse I may be yet: the worst is not/ So long as we can say,\n‘This is the worst.’” — Edgar in King Lear, Act 4, Scene 1\n\nAESOP’S FABLE\n\nA gnat woke up one day in the savannah to a bright and sunny day. He felt good and boastful. “A great day to do some stinging,” he mused. Buzzing around, he spotted a lion and began circling him. The lion got annoyed. “What are you doing?” The cheeky gnat replied, “You may be king of the beasts but you don’t frighten me.” “I can destroy you with one swipe of my paw,” said the lion. “No, you can’t,” said the gnat and kept buzzing around the lion. The lion kept trying to swat the gnat but the infuriating insect would elude him.\n\nThe annoying gnat then audaciously lodged himself in the lion’s nose and began stinging him. Try as the lion might, he couldn’t dislodge the pesky insect. Finally, he said, “Okay, I concede.” Hearing that the gnat flew away, gleeful that he had defeated the mighty lion. “I deserve a home fit for a king,” the gnat said to himself. He sees a web draped over a bush. “Perfect place for me to rest.” That was his undoing. The moment the gnat got into the web, the spider laughed and said, “Ha, you are trapped!”\n\n“How dare you. I am king of the beasts. Even the lion ceded to me,” the gnat said. “No, you are not. You are a trapped little gnat and you can’t go anywhere unless I let you,” said the spider. The gnat kept trying to fly away but couldn’t. He finally conceded and said to the spider, “Please let me go. I won’t be boastful and I won’t annoy anyone.”\n\nAs we witness a spike in audacious terror attacks, the Jaffar Express one in Balochistan and the Bannu Cantonment attack in Khyber-Pakhtunkhwa (KP) being just two recent examples, the fable has a lesson for us.\n\nThe terrorist attack on the Jaffar Express train on March 11 in Balochistan was only the most high-profile one in recent days. In the wake of near daily attacks on security forces and civilians in Balochistan and Khyber-Pakhtunkhwa, it is evident that Pakistan needs to reassess its strategy vis-à-vis counterinsurgencies in both provinces. Ejaz Haider explains how to think about it…\n\nSETTING THE PREMISE\n\nElusive adversaries cannot be whacked with a lion’s paw. They need to be trapped in a spider’s web, a metaphor for a pack of strategies that include both kinetic and non-kinetic approaches.\n\nEasier said than done, as should be evident from the mountain-high literature on counterinsurgency (COIN) and counterterrorism (CT) operations. Studies — see, for instance, those done by RAND — show that of the 71 insurgencies since World War II, only 11 resulted in favour of COIN forces.\n\nA poor success rate by any measure; there are reasons for it and they have to do with trying to simplify multivariate problems during decision making. But before we get to that, let’s study the problems Pakistan is facing in KP and Balochistan. Both provinces have been simmering with low-intensity, high-cost violence since the early- to mid-noughties.\n\nBut while both cases are defined by violence, it is important to look at the two cases separately, because the groups fighting the state in the two provinces have different ideologies and motives and need to be treated differently.\n\nDuring his teaching years at the University of Chicago, German-American political scientist Hans Morgenthau once told his students that “appeasement is a legitimate strategy in dealing with autonomist movements — ie give them their own self-government within the established state — but the worst possible strategy when dealing with those who are bent on taking over the state.”\n\nThe parallel, according to Morgenthau, was with territorial aggressors: if their ambition is limited, then a border adjustment is possible (mediaeval European wars are a good example of that). But they may also have an insatiable appetite, in which case appeasement is a disaster (the appeasement of Hitler is a case in point).\n\nThe outcome of hundreds of small, medium and large-scale military operations has been mixed. There have been many tactical victories and losses but strategic success — ie disincentivising the groups fighting the state — has so far eluded the country. This fact has spawned a lot of criticism. Some justified; much of it based on selective facts and the desire to get to a final solution — a state of homeostasis where everything is in balance once again.\n\nSTRATEGIC FAILURE\n\nThe outcome of hundreds of small, medium and large-scale military operations has been mixed. There have been many tactical victories and losses but strategic success — ie disincentivising the groups fighting the state — has so far eluded the country. This fact has spawned a lot of criticism. Some justified; much of it based on selective facts and the desire to get to a final solution — a state of homeostasis where everything is in balance once again.\n\nThis is understandable but largely misinformed in the case of KP for two reasons: one, the trajectory of policies that has led to the current state of affairs did not unfold in a vacuum. In other words, Pakistan has reached the current dysbiotic state by both acting on and reacting to external stimuli. Balochistan, on the other hand, has moved from internal disharmony to a situation now being exploited by external actors.\n\nTwo, any action now in both provinces has to contend with the past. There’s no tabula rasa and the slate cannot be wiped clean. Events and inflection points have left their imprint, disturbing the ecosystem. As Professors Horst Rittel and Melvin Webber demonstrated in a 1973 paper for Policy Sciences, “The search for scientific bases for confronting problems of social policy is bound to fail.”\n\nThis is because “policies that respond to social problems cannot be meaningfully correct or false.” What’s worse is that “there are no ‘solutions’ in the sense of definitive and objective answers.” This is true of all policy. Rittel and Webber call them wicked problems.\n\nWhy? The answer is interactive complexity. Dealing with one part of complexity has potential effects on other sectors of the system. But before we proceed to the cognitive problems of decision-making and why we might be stuck with the ongoing problem, let’s present the two cases — KP and Balochistan — upfront.\n\nTHE CASE OF BALOCHISTAN\n\nIn dealing with Balochistan’s separatist problem, the federation has to first figure out the direction of causality: is Balochistan a political problem or a COIN/CT problem? What has begotten what?\n\nIf it is primarily a political problem gone bad, then the province must get a genuine political process. That won’t eradicate insurgency/terrorism but it is a necessary condition that must be met before we move to the sufficient. And yet, the federation remains totally tone-deaf to this.\n\nSuccessive governments have continued to deal with Balochistan primarily as a CT problem. This approach sans genuine political representation has given primacy to the security forces and multiple intelligence agencies. The security forces, by the very nature of their job, are the state’s sledgehammer. That results in a cognitive bias in favour of using force, what can be described as the Law of the Instrument: “If the only tool you have is a hammer, it is tempting to treat every problem as a nail.”\n\nTwo, Balochistan does have a terrorism problem, a tool used by the separatist groups. That won’t just go away and has to be dealt with. It is also now sponsored by external state actors such as India. The question is, how should the state deal with it?\n\nIf the idea is occupation and destruction, the state could continue to be unapologetically ruthless and argue that the Baloch just don’t have the numbers to succeed. But if the problem is political and terrorism a by-product of warped political and socio-economic choices made by the establishment, then kinetic operations in the absence of a credible political process would not only be orthogonal to a resolution, they could be plain harmful.\n\nThree, CT operations must be discriminatory and should rely on superior intelligence and highly disciplined field forces. The forces operating in the field should also be accountable to the political dispensation. Security forces don’t like getting their personnel killed. The desire for revenge runs high after such attacks. That’s understandable. But that is precisely the point at which leaders and commanders must summon patience and show restraint.\n\nFour, allied with three above, is the absolute and non-negotiable imperative of distinguishing between the Baloch demanding their rights peacefully and groups fighting the state. When violence is raging and emotions are running high, the chances of conflating peaceful protest with terrorism also run very high. That constitutes one of the most egregious blunders a CT/COIN force can commit.\n\nThe winning idea is not so much to make extremists moderate but to ensure that the moderates remain moderates and become a counterweight to the extremists. Treating peaceful protestors ham-fistedly and conflating them with those with the gun only serves to push the non-violent towards violence. That is COIN/CT 101.\n\nIn fact, terrorist groups often resort to increased violence through audacious attacks to draw a ruthless and indiscriminate response from the governments against ethnic populations to which the terrorist groups belong. The reprisals help the groups recruit from those populations. It creates a vicious cycle of violence.\n\nA pertinent example would be the Baloch Yakjehti Committee (BYC) led by Dr Mahrang Baloch. The BYC is a peaceful movement demanding rights, an end to enforced disappearances and equitable distribution of resources. These are perfectly legitimate and constitutional demands. The federation has already mishandled the movement, accusing it of being the political wing of the BLA.\n\nThat accusation, even if we were to accept it for the sake of the argument, still shows that, despite the violence by BLA et al, there’s still space for a political dialogue, given the public face of BYC. Also, history tells us that all such movements have moderate and hardline factions. If current anger leads to persecution of BYC activists, and I fear it could, the federation would play right into the hands of the BLA, the hardline face of Baloch resistance.\n\nHow to handle the BLA? I have so far argued for a discriminatory CT policy. Let me now add the element of ruthlessness to it . And by ruthlessness I mean the ruthless pursuit, through high-grade intelligence, of BLA sanctuaries, training camps, supply routes, ingress and egress routes, covert safe houses within their areas of operations and other related information that will help the forces to take out their leaders and cadres.\n\nThis is the other prong of the holistic approach. Just like it’s crucial for Balochistan to get authentic political representation — not the current spurious one — and for the federation to work towards addressing the demands of the Baloch, so it is important to go after the terrorist groups with dogged consistency.\n\nTHE CASE OF KP\n\nThe heart of the fitna al-khawarij (FaK) — the various Islamist terrorist outfits often lumped under the umbrella of the Tehreek-i-Taliban (TTP) — problem lies in Afghanistan (this is also true of Baloch terrorist groups). Since the fall of Afghanistan to the Tehreek-i-Taliban Afghanistan (TTA), the problem has exacerbated.\n\nKabul is providing sanctuaries to the khawarij and even supporting them militarily during border skirmishes. Dealing with FaK also requires dealing with Kabul. Recent overtures to find a diplomatic solution may be pursued but Pakistan also needs to be clear-eyed about TTA intentions.\n\nHow does one deter Afghanistan? This posits a problem. Afghanistan under the Taliban is not a state in any modern sense. To put it in perspective, Afghanistan is not India or Iran, both far more powerful states compared to Afghanistan but vulnerable precisely because a conflict would make them (as it would any state) lose much in economic, infrastructural and military terms.\n\nOther factors being constant, deterrence, therefore, works when states are configured in similar ways. It seeks to maintain the status quo between them. In that sense, deterrence is the absence of activity.\n\nThe process involves signalling resolve backed by demonstrable capability. A good example is Pakistan’s retaliatory action inside Iran last year after Iran attacked a target in Pakistani territory. By responding, Pakistan signalled its resolve to Iran and, implicitly, also to India. Equally, by indicating that it did not want any escalation, it gave an off-ramp to Tehran. A stick must therefore have a carrot with it.\n\nThat’s the combination of negative and positive inducements.\n\nIt is from this perspective that Afghanistan is different. This impacts any retaliatory policy which assumes that striking back will establish deterrence. It won’t, unless we can identify the pain points that can be targeted to raise the overall cost for the TTA leadership of housing FaK and using them as leverage against Pakistan.\n\nThe other allied point is with reference to the cost for Pakistan of a knee-jerk retaliatory policy. The scenario would run something like this: TTA remains mulish and continues to facilitate FaK; FaK mounts terrorist attacks; some get preempted, others go through. Pakistan retaliates. TTA responds across the border. There’s quiet for a while and then it begins anew. Instead of deterring Kabul, it will degenerate into dispiriting cycles of violence. Official statements that a particular target was/is struck and neutralised fails to achieve politico-strategic ends.\n\nThe cost — direct and opportunity — of such cycles will steadily rise for Pakistan: instability in the affected areas, casualties, preparing and monitoring defences, constant vigil, expending ammo (small arms to light weapons to mortars to howitzers and field artillery), the use of aerial platforms (calculated in per hour operational flight costs for fighter jets that runs into thousands of dollars) etc. Net result: failure to establish deterrence.\n\nAfghanistan is not a target-rich country. Both TTA and FaK cadres are expendable. There’s no dearth of recruits to replace the ones we kill. In any case, the kind of low-intensity conflict FaK is fighting doesn’t really require big numbers. It can attrit without big numbers. That’s how the psychology of bodies piling up incrementally works.\n\nWhat does matter then? Infrastructure? There’s hardly any to begin with, countless marriage halls from Kabul Airport to downtown Kabul notwithstanding. Strategic locations? Military cantonments? Command and control centres that can be degraded? Dams, power grids, power lines? There is some of that but not much. Poverty is a powerful bulwark against a more powerful state seeking deterrence through escalation dominance.\n\nAttack and capture? Easy-peasy, as the US found out. Twenty years down the line, you find yourself packing up and leaving, realising that only the creatures of hell can live in hell. Except, Pakistan can’t up and leave the neighbourhood. Corollary: it’s a wicked problem. Inaction is not an option; action requires more than reacting to attacks. So what’s the way out?\n\nFirst, let’s acknowledge that we have a problem, that we are in it for a long haul and these CT operations are a different kind of war. There’s no clear culminating point of victory. The best that can be achieved is to bring it to what I call the pre-diabetic level — a level of reduced violence that requires diligence and a healthy lifestyle — ie an inclusive democracy.\n\nSecond, this conflict requires the nation’s participation, because peoples’ sympathies is the contested site where the conflict is unfolding. That requires constitutional legitimacy for the governments and the system. The less said on that score for the current goings-on the better.\n\nThird, for the long haul, you need a long-term policy with a mix of overt and covert actions, whether kinetic or non-kinetic. Any such policy must have offensive and defensive prongs: act preemptively and proactively when and where required, while strengthening the defensive side of this equation.\n\nFourth, the policy must move from merely dealing with FaK and holding the TTA responsible for FaK’s actions. TTA’s direct action against Pakistani forces and its obvious strategy of using the FaK as leverage against Pakistan opens the space for any direct or indirect action against the TTA. To use the Clausewitzean term, the Schwerpunkt [focus of effort] must shift to the TTA.\n\nFifth, for this to work, the policy must identify and then target the TTA’s pain points. This can hardly be overemphasised, because it is central to any deterrence strategy whether through punishment or by denial. Policymakers who have the full picture can identify those points. The important thing is that pressing a pain point may not always require a kinetic approach.\n\nSixth, in this kind of irregular conflict, the primary requirement is first-rate intelligence. The type of platforms employed for kinetic action are important in relation to the nature of an operation but secondary to actionable intelligence identifying targets.\n\nSeventh, these approaches would need overt and covert action. While overt actions can be listed, there’s no reason to publicly state what covert actions can be taken. Veterans of intelligence work understand perfectly well how degradation and psychological pressure work through covert actions.\n\nEighth, since we are in this for the long haul, it would be advisable to develop, train and deploy a force specific to the task of border patrolling, monitoring and defence. Technically, the Frontier Corps (FC) is supposed to do this. They are good fighters, but the force needs to put more brain into its training, especially in the non-commissioned corps.\n\nAlso, so far, the FC doesn’t have the capability or the wherewithal to undertake offensive CT operations across the border. I mention FC because it provides the chassis for the force I am suggesting and because we are too quick to reinvent the wheel.\n\nTraining FC for this task and revisiting its operational terms of reference are also important because the regular army troops are already stretched. Just like cricket, war has different formats, different objectives, different strategies. FC should be the team for this particular format. This is also applicable to CT ops in KP.\n\nCentral to all of this, of course, is the imperative for policymakers to go beyond reactive and operationally inconsequential retaliatory strikes, to formulating a comprehensive, long-term policy to deal with this problem as an ecosystem with multi-subsystems.\n\nCAN WE DO IT?\n\nYes and no. Yes, if we can think “more complexly”; no, if we fail to “see a problem embedded in the context of other problems.” What does that mean?\n\nIn his 1989 book, The Logic of Failure (English edition 1996), Dietrich Dörner, Professor Emeritus of Psychology at the University of Bamberg, established through computer simulations and case studies that the human brain thinks linearly and fails, for the most part, to grasp that an ecosystem (natural or otherwise) is made up of innumerable interrelated subsystems. Change in one can impact other parts.\n\nAs Dörner puts it, “Failure does not strike like a bolt from the blue; it develops gradually according to its own logic. As we watch individuals attempt to solve problems, we will see that complicated situations seem to elicit habits of thought that set failure in motion from the beginning.”\n\nI call it the Tanaland problem, from the computer simulation done by Dörner, creating a fictitious\n\nvillage in Africa and getting 12 participants to improve life in the village. The participants were to have dictatorial powers and unlimited means to do that. It would seem that all of them should have succeeded.\n\nFact is, no one except one, did. After initial improvements in agricultural produce and life expectancy, Tanaland ended up with almost no water and a raging famine. Why?\n\nThe participants acted without a holistic analysis of the situation. That resulted in a failure to anticipate the side-effects and long-term repercussions of policy implementation according to their initial hypothesis. Since certain things improved and there were no immediate negative effects, they convinced themselves that their hypotheses were correct. That created a cognitive bias and blinded them to emerging needs and changes in the situation. Result: when Tanaland faced drought and famine, the participants became prone to cynical reactions.\n\nWHERE TO FROM HERE?\n\nIn a brilliant essay, ‘Politics and the English Language’, George Orwell wrote, “[A]n effect can become a cause, reinforcing the original cause and producing the same effect in an intensified form, and so on indefinitely. A man may take to drink because he feels himself to be a failure, and then fail all the more completely because he drinks.”\n\nLet’s put a variation on this. A state may resort to coercion because it thinks that it is being subjected to subversive attacks that can weaken it, and then become even weaker because it has no tools other than to coerce and oppress the very people from whom it must draw its strength. Studies have clearly shown that a ‘motive-based’ approach is better than an ‘iron-fist’ approach, because the former tries to tackle the motives behind insurgencies instead of merely relying on killing the insurgents.\n\nThis brings us to the issue of good governance, not just governance. The benchmarks are known: rule of law, transparency, participation, accountability, equity and inclusiveness. It should be evident that these benchmarks presuppose a democratic dispensation and if a state were to fulfil them, its ecosystem wouldn’t have gone out of joint. Such a state is also a strong, as opposed to a hard state.\n\nIn the 1995 book Over-stating the Arab State, the late Egyptian political scientist Nazih Ayubi distinguishes between ‘hard’ and ‘strong’ states. Ayubi argued that the authoritarian Arab states had little ability to control populations, trends and changes, which is why they could not enforce laws and break traditional structures. The hard state coerces; the strong state achieves its goals because it is accepted by its people. Or, as Ayubi put it, “The Arab state is therefore often violent because it is weak.”\n\nA strong state partners with its citizens. State-society relations complement and strengthen each side. The strength of the strong state lies in “its ability to work with and through other centres of power in society.” As economists Daron Acemoglu and James Robinson argue in The Narrow Corridor, the path to liberty must avoid the dangers of either tyranny or anarchy.\n\nCan we be a strong state instead of vowing to be a hard state? Your guess, dear reader, is as good as mine.\n\nThe writer is a journalist interested in security and foreign policies. X: @ejazhaider\n\nPublished in Dawn, EOS, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e80f3490aa9.jpg",
  "retrievedAt": "2025-08-25T15:33:47.684Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901109",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T00:50:53.000Z"
}
