{
  "title": "FBR misses collection target by Rs716bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) missed its collection target by nearly Rs716 billion in the first nine months of the current fiscal year, mainly due to a decline in import duty and lower-than-expected inflation impacting tax receipts.\n\nThe FBR collected Rs8.452 trillion in the July-March period of FY25 against the budgetary target of Rs9.168tr. However, the collection is 27pc higher than Rs6.665tr collected a year ago.\n\nMonth-wise, the FBR collected Rs1.114tr in March against the target of Rs1.219tr, a shortfall of Rs105bn. However, the collection is 32pc higher than Rs841bn collected a year ago, according to provisional data released on Saturday.\n\nA tax official said that revenue collection rec­ord­ed a year-on-year 32pc rise in March despite low inflation and an economic slowdown.\n\n32pc year-on-year growth recorded in July-March\n\nThis can be attributed to enhanced enforcement efforts, particularly within the sugar sector, which experienced a growth of 39pc in the last three months.\n\n“We anticipate further improvement in revenue collection during the final quarter,” the official stated, noting that the International Monetary Fund has already revised the FBR revenue collection target downward.\n\nThe IMF has revised the target to Rs12.333tr from Rs12.913tr for FY25, a reduction of Rs580bn. The IMF expressed readiness to adjust the revenue collection target further downward. However, the prime minister insists that the FBR intensify its efforts to meet the target.\n\nThe shortfall is primarily attributed to reduced collection from imports, sluggish manufacturing growth and unexpectedly low inflation, which has dropped to the lowest single digits in recent months.\n\nThe FBR paid Rs384bn in refunds to taxpayers in 9MFY25, up 1.58pc from Rs378bn in the same period last year. However, March saw an almost 52pc fall in refund payments to Rs34bn year-on-year.\n\nThe government had anticipated an additional Rs3.659tr in FY25 based on GDP growth of 3pc, Large-Scale Manufac­turing expanding at 3.5pc with inflation at 12.9pc, and imports growing at 16.9pc.\n\nIndependent economists, however, estimate that real revenue collection will be approximately Rs12tr in FY25.\n\nIn July-March, income tax collection totalled Rs4.127tr, exceeding the target of Rs3.841tr by Rs286bn. The collection soared 27pc compared to last year’s Rs3.238tr.\n\nThe sales tax collection fell short of Rs653bn in 9MFY25, totalling Rs2.860tr against the target of Rs3.513tr. The sales tax collection recorded a growth of 29pc compared with last year’s Rs2.225tr.\n\nThe customs collection fell short of the projection by Rs207bn to Rs927bn in 9MFY25. It grew 16pc over last year’s Rs801bn.The Federal Excise Duty (FED) collection fell short of the target by Rs143bn to Rs537bn in 9MFY25. The FED, however, grew 34pc over last year’s Rs401bn.\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:34:04.641Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901203/fbr-misses-collection-target-by-rs716bn",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T01:26:50.000Z"
}
