{
  "title": "11 killed in Mardan security action - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Locals claim shepherds were killed in ‘drone strike’\n• KP govt insists casualties were ‘collateral damage’ during intelligence op, calls it ‘painful’\n\nMARDAN: At least 11 people were killed in Mardan in what locals insisted was a drone strike, but officials said was an operation carried out against militants.\n\nThe incident took place in the Shamozai area of Katlang tehsil in Mardan district in the early hours of Saturday.\n\nAccording to locals, the deceased were civilians, including women and children, working as shepherds.\n\nA press note issued by the provincial government early on Saturday also acknowledged the death of civilians but called it collateral damage.\n\nThe statement said a counter-terrorism operation was conducted in the remote hilltop area of Katlang based on intelligence regarding the presence of armed militants using the location as a hideout and transit point.\n\nIt said the intelligence-based operation was against militants in which “non-combatants” also died.\n\nThe operation “successfully neutralised” several high-value targets allegedly involved in militant activities in the region, as per the official version.\n\n“Unfortunately, subsequent reports confirmed the presence of non-combatants, including women and children, at the periphery of the target zone, resulting in tragic civilian casualties,” added the press note.\n\nThe government blamed complex terrain and militants’ tactics to embed within civilian populations for the collateral damage.\n\nWhile calling the deaths “painful and regrettable”, the provincial government extended condolences to the affected families.\n\nIt said immediate steps were being taken to “investigate the circumstances surrounding civilian presence in the area, extend medical assistance to the injured [and] facilitate relief and compensation for the victims’ families”.\n\nProtests\n\nAfter the incident, victims’ relatives, along with the residents of Shamozai and adjacent areas, placed the victims’ dead bodies on the Swat Motorway and held a demonstration.\n\nThe demonstrators accused the security forces of carrying out the strike, which claimed the lives of shepherds who had temporarily settled in the Katlang area for winter before their annual migration back to Upper Swat in the summer with their livestock.\n\nThe deceased, all belonging to the Gujjar community, were identified as Hazrat Bilal, Noor Muhammad, Wazir, Amroz Khan and Shahazada alias Shah Da. The identities of the remaining victims were unknown.\n\nThe protesters blocked both lanes of the motorway as a heavy police contingent was deployed at the scene to maintain order.\n\nJannat Gul, a relative of the victims, said they were a “peaceful shepherd community” which migrates seasonally. “We move to lower regions in winter and return to Upper Swat in the summer to graze our animals. We carry only small sticks to tend to our livestock and sickles to cut grass.”\n\nJalat Khan, a leader of the Gujjar community in Swat, called for justice and urged the government to compensate the bereaved families.\n\nHe warned that if their demands were not met, the entire Gujjar community would take to the streets after Eidul Fitr.\n\nThe protesters also pressed the authorities to register a First Information Report, threatening further demonstrations including blocking the Swat Motorway, if their call for justice was ignored.\n\nMardan Deputy Commissioner Dr Azmatullah Wazir and DPO Zahoor Afridi held negotiations with the protesters to open the road.\n\nPTI MPA Zarshad Anjum, JUI-F leader Mufti Hamad Yousafzai and other politicians also participated in the talks. The district administration accepted the victims’ demands, after which the protesters dispersed. Swat Motorway was also reopened to traffic.\n\nDr Amjad Ali, the member of KP Assembly from Swat, denounced that attack as “an act of state terrorism against innocent civilians”.\n\nHe claimed that people were “not being allowed to enter the area” or collect the bodies”.\n\nOur Correspondent in Swat also contributed to this report\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:16:47.215Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901160/11-killed-in-mardan-security-action",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T00:51:22.000Z"
}
