{
  "title": "Nine Red Crescent workers go missing after Israeli attack - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY/CAIRO: The Palestine Red Crescent Society said on Saturday that the fate of nine crew members in the Gaza Strip remains unknown nearly a week after Israeli forces had hit ambulances.\n\nThe Israeli military said troops had opened fired on ambulances after identifying them as “suspicious vehicles”, in an incident on previous Sunday in southern Gaza that Hamas authorities condemned as a “war crime”, reporting at least one person killed.\n\nSeparately, the Israeli military said on Saturday it had begun “ground activity” in the Jneina neighbourhood of Rafah to expand what it described as the security zone in southern Gaza.\n\nOn March 18, Israel resumed bombing and ground operations in Hamas which it said were intended to increase pressure on the Palestinian group Hamas to free prisoners. The gunfire in Rafah city’s Tal al-Sultan neighbourhood came just days into a renewed Israeli offensive in the southern area, close to the Egyptian border.\n\nMilitary begins ‘ground activity’ in Gaza to extend ‘security zone’\n\nThe Red Crescent in a statement accused Israeli authorities of refusing to allow search operations to locate the missing workers. “For the seventh consecutive day, the fate of nine Palestine Red Crescent EMTs remains unknown after they were besieged and targeted by Israeli forces in Rafah,” it said.\n\n“We condemn Israel’s deliberate obstruction of search efforts and hold it fully responsible for the lives of our team members,” the statement added. Israeli military admits to shooting at ambulances\n\nThe day after the incident, Gaza’s civil defence agency said in a statement that it had not heard from a team of six rescuers from Tal al-Sulta who had been urgently dispatched to respond to deaths and injuries.\n\nOn Friday, it reported finding the body of the team leader and the rescue vehicles — an ambulance and a firefighting vehicle — and said a vehicle from the Palestine Red Crescent Society was also “reduced to a pile of scrap metal”.\n\nBasem Naim, a member of Hamas’s political bureau, accused Israel of carrying out “a deliberate and brutal massacre against Civil Defence and Palestinian Red Crescent teams in the city of Rafah”. “The targeted killing of rescue workers — who are protected under international humanitarian law — constitutes a flagrant violation of the Geneva Conven­tions and a war crime,” he said.\n\nTom Fletcher, head of the United Nations Office for the Coordination of Humanitarian Affairs, said that since March 18, “Israeli airstrikes in densely populated areas have killed hundreds of children and other civilians”.\n\n“Patients killed in their hospital beds. Ambulances shot at. First responders killed,” he said in a statement. “If the basic principles of humanitarian law still count, the international community must act while it can to uphold them. The emergency response service said that “initial reports from the crew at the time of the incident confirmed they came under heavy gunfire from Israeli forces, resulting in multiple injuries.”\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e89f0c62b19.gif",
  "retrievedAt": "2025-08-25T15:33:54.117Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901211/nine-red-crescent-workers-go-missing-after-israeli-attack",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T01:38:13.000Z"
}
