{
  "title": "Myanmar quake death toll passes 1,600 - World - DAWN.COM",
  "author": null,
  "content": "• 2,900 buildings, 30 roads, seven bridges damaged, says opposition\n• China, India send aid; Russia, Malaysia, US, Singapore, South Korea not far behind\n• Authorities in Bangkok struggle to find workers trapped under rubble\n\nBANGKOK: Myanmar’s military rulers let in hundreds of foreign rescue personnel on Saturday after an earthquake killed more than 1,600 people, the deadliest natural disaster to hit the impoverished, war-torn country in years.\n\nFriday’s 7.7 magnitude quake, among the biggest to jolt the Southeast Asian nation in the last century, crippled airports, bridges and highways amid a civil war that has wrecked the economy and displaced millions.\n\nThe death toll in Myanmar climbed to 1,644, the military government said on Saturday, according to BBC Burmese news service.\n\nIn neighbouring Thailand, where the quake rattled buildings and brought down a skyscraper under construction in the capital Bangkok, at least nine people were killed.\n\nSurvivors in Mandalay, Myanmar’s second-biggest city, dug with their bare hands on Friday in desperate attempts to save those still trapped, lacking heavy machinery and with authorities absent.\n\nIn Bangkok on Saturday, rescue operations continued at the site of the 33-story tower’s collapse, where 47 people were missing or trapped under the rubble — including workers from Myanmar.\n\nThe US Geological Service’s predictive modelling estimated Myanmar’s death toll could exceed 10,000 and losses could exceed the country’s annual economic output.\n\nA day after making a rare call for international assistance, Myanmar’s junta chief, Senior General Min Aung Hlaing, travelled to hard-hit Mandalay near the epicentre of the quake, which brought down buildings and triggered fires in some areas.\n\n“The Chairman of the State Administration Council instructed authorities to expedite search and rescue efforts and address any urgent needs,” the junta said in a statement on state media, referring to Min Aung Hlaing.\n\nAirports closed\n\nAn initial assessment by Myanmar’s opposition National Unity Government said at least 2,900 buildings, 30 roads and seven bridges had been damaged by the quake.\n\n“Due to significant damage, Naypyitaw and Mandalay international airports are temporarily closed,” said the NUG, which includes remnants of the elected civilian government ousted by the military in a 2021 coup that triggered the civil war.\n\nThe control tower at the airport in Naypyitaw, Myanmar’s purpose-built capital city, collapsed, rendering it inoperable, a person with knowledge of the situation told Reuters.\n\nA Myanmar junta spokesman did not respond to calls seeking comment.\n\nA Chinese rescue team arrived at the airport in Myanmar’s commercial capital of Yangon, hundreds of kilometres from Mandalay and Naypyitaw, and will travel upcountry by bus, state media said.\n\nChinese President Xi Jinping spoke by phone with the junta chief, China’s embassy in Myanmar said on Saturday. Beijing would provide $13.77 million worth of aid, including tents, blankets and emergency medical kits.\n\nThe United States, which has a testy relationship with the Myanmar military and has sanctioned its officials, including Min Aung Hlaing, has said it would provide some assistance.\n\nRelief supplies from India on a military aircraft also landed in Yangon, according to Myanmar state media, and India’s government said it was also dispatching ships with 40 tonnes of humanitarian aid.\n\nRussia, Malaysia and Singapore were also sending planeloads of relief supplies and personnel.\n\nThe Association of Southeast Asian Nations, a 10-country bloc that includes Myanmar, said that it recognised the urgent need for humanitarian assistance. “ASEAN stands ready to support relief and recovery efforts,” the group said a statement.\n\nSouth Korea said it would provide an initial $2m in humanitarian aid to Myanmar through international organisations.\n\nNo help coming\n\nResidents in the hardest-hit areas are desperate for the help.\n\nThe quake, which hit around lunchtime on Friday, affected wide swathes of Myanmar, from the central plains around Mandalay to the hills of Shan in the east, parts of which are not completely under the junta’s control.\n\nRescue operations in Mandalay could not match the scale of the disaster, one resident said by phone, asking not to be named because of security concerns.\n\n“Many people are trapped but there is no help coming just simply because there isn’t manpower or equipment or vehicles,” he said.\n\nIn Bangkok, 1,000km from the epicentre, authorities on Saturday pushed ahead with efforts to find construction workers trapped under the rubble of the collapsed tower, using excavators, drones and search-and-rescue dogs.\n\nThailand’s Deputy Prime Minister Anutin Charnvirakul said all possible resources had been deployed to search for survivors and to bring out bodies of the deceased.\n\n“We always have hope,” he told reporters. “We’re still working around the clock.”\n\nChanpen Kaewnoi, 39, said she rushed over on Friday afternoon after seeing news reports that the under-construction building where her mother and younger sister were working had collapsed.\n\n“I called my sister, but no matter how many times I tried to call her there was no connection,” she said after a sleepless night at the site.\n\n“I want to wait for my mother and sister,” said Chanpen, herself a construction worker, “I want to see their faces again.”\n\nAcross the sprawling metropolis, where such quakes are rare, there may be up to 5,000 damaged buildings, including residential towers, said Anek Siripanichgorn, a board member of Council of Engineers Thailand, which is helping municipal authorities.\n\n“We are going through hundreds of cases,” he said.\n\n“If we see cases where there is potential danger, we will immediately send engineers.”\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e88ef64b5a3.jpg",
  "retrievedAt": "2025-10-12T02:16:23.592Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901161/myanmar-quake-death-toll-passes-1600",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T00:51:22.000Z"
}
