{
  "title": "Trump says ‘there will be bombing’ if Iran does not make nuclear deal - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump on Sunday threatened Iran with bombings and secondary tariffs if Tehran did not come to an agreement with Washington over its nuclear programme.\n\nIn a telephone interview with NBC News, Trump said US and Iranian officials were talking but did not elaborate.\n\n“If they don’t make a deal, there will be bombing,” Trump said. “But there’s a chance that if they don’t make a deal, that I will do secondary tariffs on them like I did four years ago.”\n\nIn his first 2017-21 term, Trump withdrew the US from a 2015 deal between Iran and world powers that placed strict limits on Tehran’s disputed nuclear activities in exchange for sanctions relief.\n\nTrump also reimposed sweeping US sanctions. Since then the Islamic republic has far surpassed the agreed limits in its escalating programme of uranium enrichment.\n\nTehran has so far rebuffed Trump’s warning to make a deal or face military consequences.\n\nIran sent a response through Oman to Trump’s letter in which he urged Tehran to reach a new nuclear deal, Iranian Foreign Minister Abbas Araqchi was cited as saying by the official IRNA news agency on Thursday.\n\nWestern powers accuse Iran of having a clandestine agenda to develop nuclear weapons capability by enriching uranium to a high level of fissile purity, above what they say is justifiable for a civilian atomic energy programme.\n\nTehran says its nuclear programme is wholly for civilian energy purposes.\n\nThe US president said on Sunday he will impose secondary tariffs of 25 to 50 per cent on all Russian oil if he feels Moscow is blocking his efforts to end the war in Ukraine, and they could start within a month if there is no ceasefire.\n\nTrump told NBC News that he was “angry” when Russian President Vladimir Putin criticised the credibility of Ukrainian President Volodymyr Zelensky’s leadership, NBC reported.\n\nHe also told NBC News by phone that he planned to speak with Putin this week.\n\nDuring his 2024 presidential campaign, Trump promised repeatedly to end what he calls a “ridiculous” war in Ukraine, and he has focused heavily on the issue since taking office on January 20. Trump himself has called for new elections in Ukraine and falsely called Zelensky a dictator.\n\nPutin on Friday suggested Ukraine could be placed under a form of temporary administration to allow for new elections and the signature of key accords, which could effectively push out Zelensky.\n\n“If Russia and I are unable to make a deal on stopping the bloodshed in Ukraine, and if I think it was Russia’s fault … I am going to put secondary tariffs on oil, on all oil coming out of Russia,” Trump said.\n\n“That would be, that if you buy oil from Russia, you can’t do business in the United States,” Trump said. “There will be a 25pc tariff on all oil, a 25- to 50-point tariff on all oil.”\n\nHe said the tariffs on Russian oil would come within a month without a ceasefire deal.\n\nTrump said Putin knows he is angry with him, but said he had “a very good relationship with him” and “the anger dissipates quickly … if he does the right thing”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/30205503094be84.jpg",
  "retrievedAt": "2025-08-25T15:33:45.069Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901324/trump-says-there-will-be-bombing-if-iran-does-not-make-nuclear-deal",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T16:03:57.000Z"
}
