{
  "title": "JUI-F wants written assurances from PTI to address joint protest issue: party senator - Pakistan - DAWN.COM",
  "author": null,
  "content": "Jamiat Ulema-i-Islam-Fazl (JUI-F) Senator Kamran Murtaza on Saturday said that his party required written assurances from the PTI to address its reservations for participating in joint anti-government protests after Eidul Fitr.\n\nEarlier this week, after failing to get any concession for the party’s founding chairman, Imran Khan, the PTI announced that it would hold protests outside the Adiala Jail on all three days of Eidul Fitr.\n\nEarlier in the month, JUI-F chief Maulana Fazlur Rehman had also revealed plans to launch a nationwide protest campaign, along with the PTI, against the government after Eidul Fitr, citing rising corruption and deteriorating law and order in Balochistan and Khyber Pakhtunkhwa.\n\n“We’d like the agreements made between PTI and JUI-F to be documented in writing to eliminate any possibility of misunderstandings or blame in the future,” Murtaza said during an interview with DawnNews programme Doosra Rukh on Saturday.\n\nThe JUI-F senator added that the process for achieving a consensus could only be kicked off after Eid since he and others in the party had already left for their hometowns for the holidays.\n\nPTI Senator Mohammad Humayun Mohmand responded to Murtaza and, while agreeing with him, he said, “It was also Sunnah to pen down agreements in a written form.”\n\nBoth senators also agreed that there were “trust issues” between the two political parties because of their history, but agreed that they were now on the mend.\n\n“The venue of the protest could be D-Chowk or any other place that can be decided with consensus,” Senator Murtaza added.\n\n“The decision for the protest has been taken, but it’s still to be decided whether we will hold a joint protest with PTI or separately.”\n\nPTI Senator Mohmand responded that whether the protests happened separately or jointly, it had been decided that it would take place, and it could potentially be a “two-pronged approach” against the government.\n\nOn March 16, JUI-F chief Maulana Fazlur Rehman, while acknowledging that the PTI’s real leadership remained in jail, admitted that tensions between the two parties had subsided, paving the way for a possible alliance.\n\nThe Chairman of Public Accounts Committee and head of the PTI Khyber Pakht­unkhwa Chapter, Junaid Akbar, in a televised interview, had said that the party workers would hold protests on all three days of Eidul Fitr outside the Adiala jail where Imran is imprisoned.\n\nHe also said if the government wanted to hold talks with the main opposition party, it (the government) has to take the first step and show its seriousness in the talks.\n\nHe said that everything is not ideal in the opposition alliance, but efforts are being made to strengthen the alliance.\n\n“The parties in Tehreek-i-Tahaffuz-i-Ayeen-i-Pak­istan (TTAP) are supporting us. Now we have been trying to get the support of the political forces which are not part of the parliament. We have also contacted Jamaat-i-Islami leadership, and I am quite hopeful that the situation will improve,” he said.\n\nWhile admitting that there are some differences within parties, Akbar said that such small obstacles will not affect the alliance.\n\n“We will march towards Islamabad after Eidul Fitr, but it is also possible that we may hold a protest outside the Adiala jail on three Eidul Fitr days, he had said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:33:45.067Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901304/jui-f-wants-written-assurances-from-pti-to-address-joint-protest-issue-party-senator",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T12:55:53.000Z"
}
