{
  "title": "BNP’s Mengal remains unmoved even as Balochistan govt tries to placate him - Pakistan - DAWN.COM",
  "author": null,
  "content": "A sit-in of the Balochistan National Party-Mengal (BNP-M) demanding the release of arrested Baloch Yakjehti Committee (BYC) leaders continued on Sunday, after the provincial government’s talks with the party yesterday failed to reach a solution.\n\nBNP-M President Sardar Akhtar Mengal had announced a “long march” from Wadh to Quetta to protest the arrests of BYC chief organiser Dr Mahrang Baloch and other leaders as well as police crackdowns on a sit-in. However, the Quetta administration had denied the party permission for the rally.\n\nOn Saturday evening, a provincial government delegation comprising Zahoor Ahmed Buledi, Bakht Muhammad Kakar and Sardar Noor Ahmed Bangulzai met Mengal and other BNP-M leaders at the party’s sit-in site in Mastung.\n\nMengal, Nawab Muhammad Khan Shahwani, Sajid Tareen and other leaders participated in the talks on behalf of the sit-in participants.\n\nSpeaking to the media after the talk, Mengal said: “This sit-in will continue until our women are released.”\n\nIn a post on X today, Mengal reiterated his demand that Mahrang and Sammi Deen Baloch be freed. He also claimed that a BYC leader and his relatives were taken away from their house in the wee hours of Sunday.\n\nMengal alleged: “BYC’s Shahji Baloch, his brother Dr Sanaullah and nephews Dr Aftab and Shams were abducted after three separate raids on their residence. The first raid was conducted at 1:15am, the second one was for the arrest, and the third was to seize mobile phones and electronic [devices].\n\n“This isn’t law but abduction. We demand the immediate release of Shahji, Dr Sana, Dr Aftab and Shams, as well as of Dr Mahrang and Sammi Deen Baloch who were only imprisoned for raising their voice for human rights,” he added.\n\n“Till when will this war against Baloch voices continue?” the BNP-M president asked.\n\nMeanwhile, the party announced on X that Mengal would spend Eid with participants of the sit-in.\n\nAdditionally, the party also posted on X that a delegation from the Jamiat Ulema-i-Islam-Fazl (JUI-F) visited the sit-in on Sunday.\n\n“The delegation included prominent leaders Maulana Abdul Wasey, Senator Kamran Murtaza,” the post read.\n\nMarchers and motorists from different political parties had started their journey to Quetta from Mengal’s native town of Wadh at around 9am on Friday.\n\nOn Saturday, after the BNP-M claimed that over 250 of its activists were detained as its march was met with police action near Mastung, Mengal and other party workers also survived a suicide bombing.\n\nAddressing the sit-in yesterday, Mengal said: “The government delegation spoke to us about cooperation and finding a way.\n\n“We told them that they must find a way and let us go to Quetta.”\n\nMengal elaborated: “The government delegation asked us if we wanted to hold a rally, to which we said that if we wanted to hold a rally, we would have done it in Khuzdar.\n\n“We told the government our only demand is to release the women,” Mengal said. “We told them that we will march towards Quetta, demanding the release of our women.”\n\nMengal went on to say that if the government did not let them go to Quetta, they would hold a sit-in in Mastung.\n\nAlthough the delegation decided to meet with the BNP leadership again after Iftar, it did not.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/310052489b2c6e8.png",
  "retrievedAt": "2025-08-25T15:33:47.121Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901291/bnps-mengal-remains-unmoved-even-as-balochistan-govt-tries-to-placate-him",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T07:22:48.000Z"
}
