{
  "title": "Child killed, 17 injured in aerial firing across KP: rescue official - Pakistan - DAWN.COM",
  "author": null,
  "content": "A child was killed and 17 other people were injured in aerial firing across Khyber Pakthunkhwa to celebrate Chand Raat, a rescue official said on Sunday.\n\nPakistan would mark the first day of Eidul Fitr tomorrow, the Central Ruet-i-Hilal Committee said on Sunday, after sighting the moon for the Islamic month of Shawwal.\n\nSpeaking to Dawn.com, District Emergency Officer (DEO) Bakhtullah Wazir said, “We have shifted 15 injured to District Headquarters Hospital, Bannu so far. Children and women are among the injured.”\n\nDEO Wazir appealed to citizens to refrain from celebratory firing, as it “turns the joy of Eid into mourning”.\n\nIn an earlier statement, he confirmed that the casualties were reported in Bannu and that Section 144 was imposed for Eidul Fitr. “A child died and nine people were seriously injured in aerial firing in Bannu,” Wazir was quoted as saying.\n\nSimilarly, a man was injured by aerial firing in Dera Ismail Khan’s Galani town, according to a statement by DI Khan DEO Fasiullah.\n\nMeanwhile, Tank City Station House Officer (SHO) Sher Afzal told Dawn.com that a revenue officer, Mohammad Asif, was injured by celebratory gunfire.\n\n“There are no other injuries caused by aerial firing within City police limits,” he added.\n\nCelebratory gunfire ahead of Eid has led to deaths and injuries across KP in the past.\n\nLast April, police booked over 100 people over celebratory gunfire on Chand Raat and Eid days in KP’s Lakki Marwat district.\n\nAn official told Dawn.com that separate cases were registered with the relevant police stations. He added that the district administration had banned celebratory firing and the display of weapons and imposed other restrictions to observe Eid peacefully.\n\n“Despite restrictions and an awareness drive against the menace of festive firing, scores of people, mostly youth, indulged in the illegal activity,” he maintained.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/30224003ecb5b52.jpg",
  "retrievedAt": "2025-08-25T15:33:45.056Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901327/child-killed-17-injured-in-aerial-firing-across-kp-rescue-official",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T17:52:20.000Z"
}
