{
  "title": "Ex-governor of Balochistan slams ‘efforts to weaken’ Levies Force - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Former Balochistan governor and chief minister Nawab Zulfiqar Ali Magsi has expressed concern over criticism against the Levies Force and noted that efforts are being made to weaken this community-based policing force, which is crucial for Balochistan’s security and stability.\n\nHe noted that despite its effectiveness and sacrifices, the Levies Force faces attempts by powerful individuals to dismantle it, rather than recognising its contributions.\n\nIn a statement issued on Saturday, Nawab Magsi highlighted the Levies Force’s significant sacrifices for Balochistan’s stability, with many personnel martyred while on duty. He said the force operated in some of the most challenging and remote areas with a budget of Rs22 billion. In contrast, he added, the police force (excluding CTD) has a budget exceeding Rs52 billion.\n\nDespite having fewer resources and covering a larger area, the crime rate in Levies-controlled regions was lower than in police-controlled areas, the ex-CM said.\n\nMr Magsi criticised TV anchors who spoke without proper research, spreading misinformation about the province. He expressed concern that individuals without adequate understanding of the Levies Force’s budget, the police budget, and Balochistan’s complexities are sharing incorrect information on national TV.\n\nHe pointed out that the Levies Force operated with 31,279 personnel over 284,696kms, while the police with 47,039 personnel covered 62,494kms.\n\nHe was of the opinion that incidents of bribery, false FIRs, custodial deaths, and abuse of power were nearly nonexistent in the Levies areas.\n\nPublished in Dawn, March 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:33:50.089Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901229/ex-governor-of-balochistan-slams-efforts-to-weaken-levies-force",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T01:47:54.000Z"
}
