{
  "title": "ASWJ local leader shot dead, father hurt in ‘targeted attack’: Karachi police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A local leader of the outlawed religiopolitical group Ahle Sunnat Waljamaat (ASWJ) was shot dead while his father was injured in a suspected targeted attack in Karachi’s Landhi on Sunday evening, according to police and party officials.\n\nQuaidabad police SHO Rana Khushi Mohammed said, “The victims were at a shop in Sherpao Colony when armed suspects on a motorcycle arrived there.”\n\n“One of them disembarked from the bike and opened fire before fleeing the scene,” the SHO said, adding that the victims were critically injured and transported to Jinnah Postgraduate Medical Centre for treatment.\n\n“Qari Abdul Rehman was pronounced dead while his father Gul Rehman was admitted for treatment,” SHO Mohammed said.\n\nThe officer said it appeared to be a targeted killing incident.\n\nASWJ spokesperson Umar Muawia told Dawn.com that the deceased Qari Abdul Rehman was president of the party’s Sherpao faction. He termed the killing “an act of terrorism”.\n\nMeanwhile, the unidentified body of a man in his early 30s was recovered from an empty plot in Surjani Town’s Murad Goth area with a gunshot wound to his head on Sunday evening, according to police.\n\nThe body was moved to Abbasi Shaheed Hospital for legal formalities.\n\nEarlier this month, a local PPP leader was gunned down in a suspected targeted attack in Karachi’s Dalmia area, according to police.\n\nAziz Bhatti police SHO Saeed Ahmed Dharejo had told Dawn.com: “PPP leader Faiq Khan, 40, was standing outside his home in Shanti Nagar when unknown suspects shot and killed him.”\n\nThe officer said he suspected some personal enmity was behind the murder. However, PPP Sindh General Secretary Waqar Mehdi had told Dawn.com: “It was a targeted killing as the suspects shot the deceased in the head.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:33:42.393Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901322/aswj-local-leader-shot-dead-father-hurt-in-targeted-attack-karachi-police",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T15:24:18.000Z"
}
