{
  "article_id": "2025-02-02_13e56021c71a37c7d62210176ff55c4b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-launches-anti-polio-drive-for-year-2025-vows-to-eradicate-polio/",
    "retrieved_at": "2025-08-27T12:18:17.017Z"
  },
  "metadata": {
    "title": "PM launches anti-polio drive for year 2025; vows to eradicate polio",
    "author": null,
    "date_published": "2025-02-02T11:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 351,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 02 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday launched a nationwide anti-polio campaign for the year 2025 (Feb 3-9) by administering polio drops to children under the age of five. Addressing the launching ceremony, the prime minister reaffirmed his government's determination to eliminate the polio disease from Pakistan. He said that the national polio vaccination drive would target millions of children in the country to save their future and health. He hoped that the dedicated teams would work day and night to eradicate the disease, and would reach the far flung areas and villages, adding these teams would successfully meet the huge national responsibility by utilizing their complete energies. The prime minister said that unfortunately, during the last year, a total of 77 polio cases were reported in the country which emerged as a huge challenge, besides posing a setback. This year, only one case was reported, he said, and expressed the resolve to eradicate polio at all costs; with dedicated team work and support from the international partners. The prime minister also expressed the hope that with international coordination and support, the crippling disease in the neighbouring brotherly country Afghanistan would end. He appreciated all the international partners including WHO, UNICEF, Bill Gates Foundation and the brotherly country Kingdom of Saudi Arabia for their commitment and efforts to the government in its efforts to eliminate polio. Speaking on the occasion, PM' Coordinator on National Health Services Dr Mukhtar Bharat said that they had highlighted the number of polio cases which were reported last year and did not hide it from the international community. He said that positive outcome was being felt with concerted efforts by all the quarters and only one case was reported this year. He also appreciated the prime minister for his supervision without which they would not be able to get the desired results. PM's Focal Person on Polio Eradication Aysha Raza Farooq said that the polio vaccination was a public campaign in which all segments of society have to take part and urged the parents to coordinate and save their children from polio.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}