{
  "article_id": "2025-02-02_309bdf65603cd73529e4c25238742f89",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/electric-buses-win-accolades-from-civil-society-in-capital/",
    "retrieved_at": "2025-08-27T12:19:03.655Z"
  },
  "metadata": {
    "title": "Electric buses win accolades from civil society in capital",
    "author": null,
    "date_published": "2025-02-02T07:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 240,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 02 (APP):Civil society organizations and environmental activists have welcomed the government's decision to introduce electric buses in Islamabad, terming it a \"significant step\" towards reducing air pollution and promoting sustainable transportation. These electric busses have been operated on 13 routes including Faizabad to Nust Metro Station, Faizabad to Allama Iqbal Open University, Pak Secretariat to Kachhari Metro Station, National Library to Pims Metro Station. Similarly, other routes include Pims to Bari Imam, D12 from Nust Metro Station, Pims to Nust Metro Station, Pims to Golra Sharif, Abpara to Tiramari, Khanna Pul to Nellore, Faizabad to Peer Wadhai Mor, Golra Mor to Wah Cantt and routes from Golra Mor to I-16 are included. Environmental expert Muneer Ahmed said the electric buses will not only reduce greenhouse gas emissions but also contribute to a cleaner and healthier environment. \"We have been advocating for eco-friendly transportation solutions for years, and it's heartening to see the government taking concrete steps in this direction,\" he stated. A commuter Ameen Faheem said, \"The electric bus is a game-changer for me adding that I can finally enjoy a peaceful commute without the noise and pollution of traditional buses.\" Electric buses can significantly improve public health by reducing exposure to air pollutants and noise pollution. Civil society members, however, emphasized the need for a comprehensive plan to ensure the success of the initiative, including the establishment of a reliable charging infrastructure and the training of drivers.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}