{
  "title": "Peace in Afghanistan bonanza for Pakistani businessmen: President Alvi",
  "link": "https://www.app.com.pk/national/peace-in-afghanistan-bonanza-for-pakistani-businessmen-president-alvi/",
  "date_published": "2021-09-01T18:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): President Dr Arif Alvi Wednesday said that peace in Afghanistan would prove to be a bonanza for Pakistani businessmen and the Central Asian region would open up for trade and investment.\nSpeaking at the fourth Business Excellence Awards Ceremony of Islamabad Chamber of Commerce and Industry (ICCI), he said that Pakistan would immensely benefit from peace and stability in Afghanistan.\nGwadar port would be shortest route for the Central Asian states and trade of these countries would flourish, he added.\nThe regional stability would catapult Pakistan into a new era of progress as business opportunities would remarkably increase, he observed.\nHe said Pakistan endured terrorism and the burden of Afghan refugees during the four decades war of Afghanistan.\nPakistani leadership especially Prime Minister Imran Khan continued stressing on the world that the Afghan issue could only be settled through political means and use of force and war was not the way to resolve the conflict.\nIn the conflict, $ two trillion were spent and tens of thousands of lives were lost but the issue could not be resolved, he remarked.\nHe appreciated Pakistani military and security agencies for  pursuing a sensible policy on Afghanistan.\nThe President said that Pakistan was making progress in all fields which could be noted from the headway made by the business community of Islamabad.\nReferring to the mistakes made by the previous governments, he said the loot and corruption in the past dented the reputation of the country and the corrupt practices shook confidence of businessmen.\nDr Alvi appreciated the government for the way it handled the coronavirus pandemic and protected the poor from hunger and unemployment.\nIn India, the government behaved crassly and its economy was devastated by the ravages of coronavirus, he continued.\nPrime Minister Imran Khan made it clear that businesses could not be shut down during the pandemic because it would have created immense financial difficulties, he added.\nHe said brand Pakistan should be promoted and businessmen could do this as they were hard working, sincere and honest.\nThe President said the government would continue to facilitate the business community, adding nation could only move ahead if it keeps its moral values intact.\nThe businessmen should take benefit from the loan schemes offered by the banks. Especially women should be encouraged and entities like Islamabad Chamber of Commerce should set up a desk to help women and differently abled persons in getting loans from the banks, he added.\nThe President said the government led by Prime Minister Imran Khan launched the Ehsaas programme to take care of the basic needs of the vulnerable sections of society.\nHe said women should be given right to inheritance, adding the representatives of chambers of commerce should mentor women in becoming successful entrepreneurs.\nEarlier, the President gave away awards to businessmen of Islamabad who ran their businesses with distinction and success.\nPresident ICCI Yasir Ilyas Khan in his speech informed the audience about the achievements of the chamber and its steps in promoting business activities in the capital city.",
  "retrievedAt": "2025-08-11T21:09:27.575Z"
}
