{
  "title": "Biden, Ghani in last call before Taliban takeover discussed military aid: Report",
  "link": "https://www.app.com.pk/global/biden-ghani-in-last-call-before-taliban-takeover-discussed-mil-aid-report/",
  "date_published": "2021-09-01T17:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): US President Joe Biden and his Afghan counterpart Ashraf Ghani in their last telephone call on July 23, before the August 15 Taliban takeover of Kabul, discussed military aid, political strategy and messaging tactics, but neither Biden nor Ghani appeared aware of or prepared for the immediate danger of the entire country falling to Taliban.\n“The men spoke for roughly 14 minutes on July 23”, said a report of Reuters news agency, which reviewed a transcript of the presidential phone call and had listened to the audio to authenticate the conversation.\nIn the call, the report said, Biden offered aid if Ghani could publicly project he had a plan to control the spiraling situation in Afghanistan.\n“We will continue to provide close air support, if we know what the plan is,” Biden said.\nAccording to the report, the U.S. president also advised Ghani to get buy-in from powerful Afghans for a military strategy going forward, and then to put a “warrior” in charge of the effort, a reference to Defense Minister General Bismillah Khan Mohammadi.\nBiden lauded the Afghan armed forces, which were trained and funded by the U.S. government. “You clearly have the best military,” he told Ghani. “You have 300,000 well-armed forces versus 70-80,000 and they’re clearly capable of fighting well.”\nDays later, the Afghan military started folding across provincial capitals in the country with little fight against the Taliban, it added.\nIn much of the call, the report said, Biden focused on what he called the Afghan government’s “perception” problem. “I need not tell you the perception around the world and in parts of Afghanistan, I believe, is that things are not going well in terms of the fight against the Taliban,” Biden said. “And there is a need, whether it is true or not, there is a need to project a different picture.”\nBiden told Ghani that if Afghanistan’s prominent political figures were to give a press conference together, backing a new military strategy, “that will change perception, and that will change an awful lot I think.”\nThe American leader’s words indicated he didn’t anticipate the massive insurrection and collapse to come 23 days later. “We are going to continue to fight hard, diplomatically, politically, economically, to make sure your government not only survives, but is sustained and grows,” said Biden.\nAccording to the report, Ghani told Biden he believed there could be peace if he could “rebalance the military solution.” But he added, “We need to move with speed.” “We are facing a full-scale invasion……,…” Ghani said.\nReuters tried to reach Ghani’s staff for this story, in calls and texts, with no success. The last public statement from Ghani, who is believed to be in the United Arab Emirates, came on August 18. He said he fled Afghanistan to prevent bloodshed, the report remarked.\n“I’m not a military guy, so I’m not telling you what a plan should precisely look like, you’re going to get not only more help, but you’re going to get a perception that is going to change …,” Biden said.\nGhani, for his part, the report said, assured Biden that “your assurance of support goes a very long way to enable us, to really mobilize us in earnest”.\nAccording to the report, the Biden-Ghani call also underscored persistent political infighting that plagued the Afghan government.\nWhen Biden asked him to include former Afghan President Hamid Karzai in a press conference, Ghani pushed back. “Karzai would not be helpful,” he said. “He is contrary, and time is of the essence, we cannot bring every single individual … We have tried for months with President Karzai. Last time we met for 110 minutes; he was cursing me and he was accusing me of being a U.S. lackey.”\nBiden paused before responding: “I’m going to reserve judgment on that.”\nKarzai could not be reached for comment, despite calls and texts to one of his aides, the report said.\nAccording to the Reuters report, in a follow-up call later that day that did not include the U.S. president, Biden’s National Security Advisor Jake Sullivan, General Mark Milley and U.S. Central Command commander General Frank McKenzie spoke to Ghani.\nIn this call, too, the report said, an area of focus was the global perception of events on the ground in Afghanistan. Milley, chairman of the Joint Chiefs of Staff, told Ghani “the perception in the United States, in Europe and the media sort of thing is a narrative of Taliban momentum, and a narrative of Taliban victory. And we need to collectively demonstrate and try to turn that perception, that narrative around.”\n“I do not believe time is our friend here. We need to move quickly,” McKenzie added.",
  "retrievedAt": "2025-08-11T21:09:30.144Z"
}
