{
  "title": "Inclusive Govt. in Afghanistan- a panacea for all problems",
  "link": "https://www.app.com.pk/national/inclusive-govt-in-afghanistan-a-panacea-for-all-problems/",
  "date_published": "2021-09-01T15:06:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Sep 1 (APP):Following an overthrowing of the non-popular government of former President Ashraf Ghani in Afghanistan, the leadership of Afghan Taliban and other political-ethnic minorities are engaged in a constructive and meaningful dialogue for formation of a broad-based and inclusive government to bring lasting peace and stability to the war-torn country.\nFollowing US withdrawal from Afghanistan in haste, Afghan Taliban leadership unlike the past have engaged representatives of various political and ethnic populations of the country including Pakhtoons, Uzbeks, Tajiks, Persians and others to form an inclusive government to establish durable peace and resolve decades-old problems of the poor Afghans.\nBrigadier, (R) Mehmood Shah, former Security Law and Order of erstwhile Fata ( Now merged areas) told APP that “from now, the entire Afghanistan was under the command of Afghan Taliban after completion of the US withdrawal.”\nHe said Afghan Taliban leadership led by Mulla Abdul Ghani Baradar was making sincere efforts to form an inclusive government with appropriate representation of all key political, religious and ethnic groups including the Northern Alliance, which was a panacea for all problems faced by the Afghanis today, he said.\nBrigadier Mehmood Shah said Afghanistan was a multi ethnic country where moderate representatives of minorities including Uzbak, Tajik, Turkamanistani and Persian were likely to be preferred instead of war lords in formation of new setup with the strong will to deliver for socioeconomic emancipation of downtrodden and oppressed Afghans.\nHe said the world communities were looking towards Taliban and the approach of how to form the government in the country, adding if the Afghan government included representation of all stakeholders it would be surely accepted by the world. In case inclusive Government was not formed, Taliban would form its own government, which according to him would be least moderate for the world.\nBrigadier Mehmood Shah said this time Taliban leadership had shown great political maturity as compared to their past rule (1996-2001) and demonstrated\ngreat respect for human rights while allowing women to work and minorities to practice their belief without any fear.\nReacting to the recent statement of Afghan Taliban Spokesman Zabihullah Mujahid that defunct Tehrik e Taliban Pakistan (TTP) was an internal matter of Pakistan, Brigadier Mehmood Shah said, “it is not based on ground reality as the Afghans’ soil was used against Pakistan in the past that is evident from the recent attack on our security check post in Bajaur tribal district.”\nHe said TTP in Afghanistan was used by inimical forces against Pakistan in the past and it was the responsibility of Afghan Taliban leadership to take decisive action against them, adding that about 5,000 TTP terrorists were still present in Afghanistan.\nAccording to security officials, the situation along the 2,611 kilometers porous Pak-Afghan border was stable and effective security measures had been placed to control mobility and contain unwanted elements.\nPakistan has taken effective measures to protect its side of border and almost 90 percent fencing along Pak-Afghan border and 50pc on Pak-Iran has been completed besides initiation of around 1,030 development projects worth Rs 900 billion in Balochistan and tribal merged districts to expedite pace of economic development there.\nPakistan has also remained biggest victim of terrorism where over 86,000 innocent persons have lost their lives and suffered more than $102 billion economic losses during war on terror. The martyrs belonged to all walks of life including soldiers, journalists, politicians, artists, doctors, students, teachers etc.\nSyed Akhtar Ali Shah, former Additional Inspector General of Police and ex Secretary Home Khyber Pakhtunkhwa told APP that as per Doha Peace Agreement, Afghanistan’s soil could not be used against foreign countries and an intra-afghan dialogue would be made for formation of broad based and inclusive government in the war ravaged Afghanistan.\nHe said Afghanistan had a constitution, Supreme Court and Loya Jirga (parliament) and it was up-to Afghan Taliban either to use the national document and institutions for running of their government or go for alternative options.\nThe former Home Secretary suggested Afghan Taliban leadership to also engage former President Hamid Karzai, Abbullah Abdullah, Rashid Dostum, Atta Muhammad and Ismail and Ahmed Masood, Amrullah Saleh of Punjsher for formation of a broad based and inclusive government acceptable to all.\nHe said until now about 80 pc of the budget of Afghanistan was coming from foreign aid and it could only be continued by foreign communities if the Afghan government was acceptable to the international community.\n“Afghans need quality education, health, clean drinking water and better life and great responsibility would be on the new Afghan government to deliver for poor Afghans quickly before the humanitarian crisis develops there,’ he said.\nHe said, “Pakistan has not yet accepted the Taliban Govt politically. Govt of Taliban would be accepted by world community after evaluating situation of human rights, justice system, service delivery and governance.”\nTerming terrorism as an international issue, he said people of both Pakistan and Afghanistan were its worst victims.\nHe said countering terrorism was now an important part of foreign policies of almost every country including Pakistan, “Our people have paid a heavy price in war against terror as our children were brutally massacred at APS Peshawar, Marriott and PC hotels were blown up and Quaid e Azam Residency in Ziayrat were razed to ground.”\n“When terrorists cross the Afghan border and attack our security posts like the recent Bajaur incident or carry out subversive activities inside our country, then fingers would be definitely raised to terrorists’ outfits including TTP and Daesh operating in Afghanistan.”\nHe said maintaining security and bolstering law and order in Afghanistan would be big challenge for the new Afghan government as evident from the recent powerful suicide blasts in Kabul.\nHe said the Taliban needed a lot of work to consolidate their position from the security point of view in Afghanistan.\nAkhtar Ali Shah said various terrorists’ outfits such as Daesh were still operating in Afghanistan and their nefarious activities had been accelerated especially after the 9/11 aerial terrorist attack on the World Trade Centre in the USA.\nHe said the world knew who brought Arab fighters to Afghanistan to fight against Russian invaders after the latter occupied the Afghans territory in 1979.",
  "retrievedAt": "2025-08-11T21:09:29.103Z"
}
