{
  "title": "Long-lasting peace in Afghanistan prerequisite for stability in region, world: Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/long-lasting-peace-in-afghanistan-prerequisite-for-stability-in-region-world-sheikh-rasheed/",
  "date_published": "2021-09-01T17:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 01 (APP):Minister for Interior Sheikh Rasheed Ahmad Wednesday said long-lasting peace in Afghanistan was a prerequisite for stability in the region and world.\nHe was talking to Ambassador of Japan to Pakistan Kuninori MATSUDA who called on him and discussed matters of mutual interest between the two countries.\nSheikh Rasheed said peace in Afghanistan was a must for peace in Pakistan and that Pakistan wanted peace and stability in Afghanistan.\nHe said the Pakistan government was providing full assistance to those Afghan citizens and foreigners leaving Afghanistan.\nHe added a facilitation desk was set up in that regard at the ministry to provide support round-the-clock.\nHe said Pakistan was fulfilling its responsibilities and providing full assistance on humanitarian grounds. He said Pakistan was already serving four million Afghan refugees for the last 40 years.\nThe Japanese ambassador thanked Pakistan for timely assistance in the safe evacuation of Japanese citizens and members of development organizations from Afghanistan.\nHe appreciated the efforts of Pakistan in the evacuation of foreigners from Afghanistan.\nHe also hailed the role of Pakistan for its long-term support and accommodating a large number of Afghan refugees. He said the government of Japan had provided assistance of $164 million for Afghan refugees along with the United Nations.\nHe expressed the desire to evacuate those Afghan citizens working with Japanese government organizations from Afghanistan and sought support from Pakistan.\nOn which, the minister assured full cooperation in that regard at the request of the Japanese government.",
  "retrievedAt": "2025-08-11T21:09:27.579Z"
}
