{
  "title": "Citizens ask authorities to take notice of COVID SOPs violations in private schools",
  "link": "https://www.app.com.pk/national/citizens-ask-authorities-to-take-notice-of-covid-sops-violations-in-private-schools/",
  "date_published": "2021-09-01T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 01 (APP):Citizens of the federal capital Wednesday asked the district administration to take strict action against those private schools involved in clear violation of Standard Operating Procedures (SOPs) related to the COVID-19.\nAccording to them, “These SOPs issued by National Command and Operation Center (NCOC) were meant to protect the children from carrying the Coronavirus but there were chances of spread of virus in schools as no such protective measures were being adopted by the respective schools administrations”.\nAs per NCOC guidelines for schools, there is complete ban on any gathering in school or hosting or arranging any function. Similarly, the school administrations are bound to follow the class strength policy under which only 50 percent students are allowed to attend the class at a single time.\nThe school administrations are also responsible to make arrangements within school premises for ensuring protection of students against this deadly virus like regular spraying in classes, routine checking of temperatures, wearing of face masks, ensuring social distance in classroom, restricting morning assembly, monitoring of school staff and teachers and ensuring their vaccination.\n“Instead of following SOPs to protect children, unfortunately mostly school administrations are least interested to look after the children rather busy in minting money from the pockets of parents through different means at the start of new academic year”, Farhat Fatima, a mother of two children studying in the top notch school of sector G-13.\nTalking to this news agency, she added that “I was given complete assurance from the school administration about taking all protective measures against Corona but the ground reality is that they completely failed to fully comply with the a single aspect of NCOC’ directions”.\n“Off day functions and gatherings are still being arranged in the school premises regularly with maximum participation of students while interestingly mostly chief guests are invited from the school head office despite knowing the fact that all such activities are completely banned in the federal capital particularly especially where the small kids are studying”.\nNasir Abbas, another parent whose child is studying at a private school at F-11 said, “There is no need of holding such gatherings and engaging children in high risk Corona days when health experts are advising citizens to avoid unnecessary movements outside home”.\nHe urged the authorities concerned to take notice of this violation and strict action against those not obeying rules.\nNadia Irfan, whose daughter is studying at a school at F-7 said, “This is a matter of our children’ health and there can be no compromise over this issue. I don’t know why these schools administrations are playing havoc with the lives of children just to engage them in the name of school activities”.\n“I request the administration of these school chains to consider all Corona related SOPs and take extra care as children of different age groups are more vulnerable in these days when delta variant is prevailing in the capital”, she added.\nWhen contacted an official of the Ministry of National Health Services, Regulations and Coordination said, “The number of confirmed cases are increasing and keeping in view the situation, the ministry, NCOC and provinces have jointly chalked out a strategy to prevent citizens particularly school children in wake of high risk pandemic situation”.\nHe added that there is zero tolerance regarding violation of SOPs as the only way to prevent from the disease is strictly observing the guidelines otherwise there are more chances of spread of the disease.\nHe said that the government has allowed opening of schools with certain restrictions to follow like 50 percent class attendance, monitoring of temperatures, wearing face masks, maintaining social distance and ensuring school staff vaccination.",
  "retrievedAt": "2025-08-11T21:09:36.020Z"
}
