{
  "title": "Abu Dhabi Dialogue focuses on labour issues, enhancing women jobs",
  "link": "https://www.app.com.pk/national/abu-dhabi-dialogue-focuses-on-labour-issues-enhancing-women-jobs-2/",
  "date_published": "2024-02-11T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP): Pakistan’s Ambassador to the United Arab Emirates (UAE) Faisal Niaz Tirmizi on Sunday while highlighting the role of Abu Dubai Dialogue said that it was a unique event that brought 17 member states from the Gulf and Asia together with the core objective to address issues pertaining to labour mobility and women’s jobs.\nHe said that the platform had a key role in establishing the principle of protecting the rights of migrant workers which was the common responsibility of labour-sending and labour-receiving countries.\nThe ambassador addressed the 7th Ministerial Consultation of the Abu Dhabi Dialogue (ADD) here in Abu Dhabi. Pakistan is the current chair of the ADD, a press release said.\nThe envoy stressed that the technology was changing demands for various skills and they needed to be innovative in meeting the labour demands. There was dire need for diversifying skill sets and engagement aimed at developing skills mobility partnerships.\nHe also lauded the efforts of ADD for focusing on women in green jobs and said that women could fill critical skills gaps in industries including renewable energy.\n“Climate change and natural disasters including floods are the gravest challenges that have emphasized the significance of collective efforts to mitigate losses and build back better. The outcome of COP28 under the UAE’s presidency has reaffirmed the need to counter this challenge”, he added.\nFaisal Niaz Tirmizi further said that migration and future of work, relationship between migration and climate change, and the health of migrants –complement more established Abu Dhabi Dialogue priorities, adding these required raising standards of recruitment, addressing mutual recognition and certification of skills, leveraging technology to enhance labour dispute settlement mechanisms, and strengthening inter-regional and international cooperation.\nHe also expressed gratitude on behalf of the Government of Pakistan for the support extended by the ADD secretariat and the advisory committee during the current chair’s cycle.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:35:09.287Z"
}
