{
  "title": "Samjhauta Express tragedy staged to derail Pakistan, India peace process",
  "link": "https://www.app.com.pk/national/samjhauta-express-tragedy-staged-to-derail-pakistan-india-peace-process/",
  "date_published": "2022-02-18T13:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD , Feb 18 (APP): Samjhauta Express tragedy was a false flag operation of India staged by Hindu extremists to sabotage efforts of Pakistan for regional peace.\nThe incident made it evident that Rashtriya Swayamsewak Sangh (RSS) and Bharatiya Janta Party were patronizing Hindu extremists. Even after the passage of 15 years the families of the victims were not provided justice showing that the justice system of India was only protecting interests of Hindu fundamentalists.\nAccording to political analysts, Samjhauta Express tragedy was a farce staged by India and was perpetrated with the purpose to derail the peace process between Pakistan and India.\nThe attack was carried out one day before the planned visit of then Foreign Minister of Pakistan Khurshid Mehmood Kasuri.Kasuri was to arrive in New Delhi to restart the peace process between Pakistan and India.\nThe lack of justice for victims of Samjhauta Express terrorist attack was in total disregard to the clear evidence available.\nOn February 18, 2007, an improvised explosive device (IED) blast was carried out in the Samjhauta train, which ran between New Delhi and Lahore, at Panipat in Haryana. The incident had claimed 68 lives, including 43 Pakistani nationals, 10 Indian citizens, and 15 unidentified persons. About 12 others, including 10 Pakistanis and two Indians, were also injured in the attack.Initially a Muslim group was blamed for the incident, but later on the National Intelligence Agency (NIA) arrested Kamal Chauhan of the Hindu extremist organization Rashtriya Swayamsewak Sangh (RSS) in New Delhi. Chauhan was an explosives specialist, who had planted the bomb in that train.\nThe investigations revealed that the said Hindu activist and several other persons had been involved in the blasts at Ajmer Dargah, Hyderabad’s Makkah Masjid and Malegaon. The Hindu chauvinists also confessed their involvement in these acts of terror.\nThe Head of Maharashtra Police Inspector General Hemant Karkare and several political commentators had called it “Hindutva Terror” or the “Saffron Terror”. Later, Hemant Karkare was targeted and killed during the 2008 Mumbai operation.\nIt was also reported that Swami Aseemanand, an RSS leader, was found guilty before a judicial magistrate for his involvement in the attacks on Samjhauta Express, and mosques in Malegaon in Maharashtra state and Andhra Pradesh’s state capital Hyderabad, besides a Muslim shrine in Ajmer in Rajasthan.\nIndian Army Col Prohit himself had confessed to have trained Hindu terrorists to initiate an armed conflict between Pakistan and India.The opposition leader in the Indian parliament Rahul Gandhi truly confirmed that the growth of Hindu extremists presented a greater threat to India than the Muslims.\nPakistan had urged India to share findings of the investigation into the Samjhauta train blasts after it was disclosed that Hindu extremist outfits were behind the terrorist activities in February 2007.\nIndia had used 26/11 as a propaganda tool against Pakistan, which showed the historic anti-Pakistan posture of India in general and the Hindutva approach of the Bharatiya Janata Party (BJP) government in particular.“Despite the availability of clear evidence, India’s continuing failure to provide justice to the victims of this horrible incident is a reconfirmation of the culture of impunity that the perpetrators of terrorist attacks enjoy in India,” the Foreign Office spokesperson said in a statement.\nSpeaking to The Wire, Vikash Narain Rai, a former Haryana police officer who headed the Special Investigation Team (SIT) from 2007 to early 2010, said the police recovered an unexploded bomb from the train. It was found that all the parts of that ‘incendiary device’ were purchased by the people linked to the RSS and its associate groups.\nA special court on March 20, 2019 acquitted Swami Aseemanand and three others in the case. NIA special judge Jagdeep Singh also dismissed the plea of a Pakistani woman for examining eyewitnesses from her country.Pakistan was of the view that the systemic Indian decision to gradually exonerate and finally acquit the perpetrators was not just a reflection of India’s callousness towards the families of the deceased Pakistanis, but also reflective of the Indian state policy of promoting and protecting the Hindu terrorists.\nIn fact, India had been using similar incidents to lay a basis for the false flag operations against Pakistan, which had also been proved in many other instances to deceive its public about the culprits and perpetrators.\nThe incidents of airplane hijacking of 1971, Indian Airline Flight 814 Kabul Hijacking in 1999, Chittisinghpura Massacre of 2000, Indian Parliament Attack in 2001, IIOJK Legislative Assembly Car Bombing in 2001, Makkah Mosque Bombing, Malegaon Mosque Blast in 2006, Ahmedabad Bombing in 2008, Sri Lankan Cricket Team attack in Lahore in 2009, Pathankot Air Base Attack in 2016 and URI Attack in the Indian Illegally Occupied Jammu & Kashmir (IIOJK) in 2016 were the examples of the Indian false flag operations to malign Pakistan in which their own authorities denied Pakistan’s involvement.",
  "retrievedAt": "2025-08-11T14:22:03.203Z"
}
