{
  "title": "Ready to thwart opposition’s all ploys; will chase them for life: PM",
  "link": "https://www.app.com.pk/national/ready-to-thwart-oppositions-all-ploys-chase-them-for-life-pm/",
  "date_published": "2022-02-18T11:57:00.000Z",
  "source": "APP",
  "content": "MANDI BAHAUDDIN, Feb 18 (APP): Prime Minister Imran Khan Friday while challenging the opposition leaders to move a no-confidence motion against him, said all of their designs would fall flat rather would take them to jail.\n“We are ready for everything. Kaptaan (Captain) is ready to thwart all of your plans. Insha Allah, you will again face defeat rather go to jail,” the prime minister said addressing a public gathering here.\nReferring to the opposition leaders, he said all of the “thieves and dacoits” were in fact afraid of him and reiterated his stance of giving no NRO to them until they returned the looted public money.\nHe said not only he, rather they themselves had been labeling one another as dacoits for last 20 years.\nHe said Maulana Fazlur Rehman was worried about the PTI’s victory in the 2023 elections while Shahbaz Sharif was baffled after the Federal Investigation Agency disclosed around Rs 4 billion deposited in the bank account of Maqsood, a low-paid sugar mill employee.\nThe prime minister said not only Maqsood, rather Shahbaz Sharif’s son-in-law and Nawaz Sharif’s two sons and Ishaq Dar had also been sent abroad to evade corruption cases.\n“If you are innocent, why are you so frightened. Imran Khan will give you NRO. These cases are old. Why do u seek NRO from me…I commit with my nation that till my life, I will not leave them until they return nation’s money,” the prime minister remarked.\nReferring to Maryam Nawaz for having some tapes, the prime minister said gone were the days when the judges used to be blackmailed and courts attacked.\n“This is not the practice of a politician rather mafias. My nation will face this mafia. Leave them up to me. I will challenge them until I am alive,” he resolved.\nHe said the government had made a mistake of allowing Nawaz Sharif to go abroad on the pretext of medical treatment.\nHe said by electing the PTI twice with two-third majority, the people of Khyber Pakhtunkhwa disappointed Nawaz Sharif.\nAs the charged gathering chanted “diesel – diesel”, the prime minister said after three years the parliament was running without Maulana Fazlur Rehman, who every second day gathers the opposition leaders with a desire to remove the government.\nReferring to the United Nations Development Program report, he said the poverty had declined in KP province which manifested his party’s performance.\n“Why are you in a so hurry for no-confidence motion… Shahbaz Sharif is in trouble knowing that he will not survive in Maqsood case. If you are innocent, why don’t you ask for a day-to-day hearing,” he said.\nPrime Minister Imran Khan said while facing the case filed by Shahbaz Sharif, he never fled abroad rather requested the court for swift proceedings and proved himself a “Sadiq and Ameen.”\nHe said the inflation impacting the common man was also a worry for him and the government was trying to ebb away its pressure by reducing taxes and duties on petrol import.\nHowever, he said Pakistan had been put on right course with record exports, tax collection and remittances by the expatriates whom he always called a precious asset.\nHe said for the first time, the government also granted them voting right, enhanced farmers’ income, ensured the timely payment of sugarcane to farmers.\nThe prime minister told the gathering that for the first time in the country’s history, Pakistan had an independent foreign policy and the country was getting no dictation from any other country.\nHe said the previous rulers kept mum over the drone attacks just because they had their looted wealth abroad.\nHe said the government was bringing about an IT revolution in the country as 70% IT had increased. Moreover, the government was providing interest free loans to the youth and Rs 1 million health insurance to every family in Punjab.\n“This is just the beginning. We have to make Pakistan a welfare state with Sehat Card being the biggest step towards it. By March, it will be available across Punjab for which provincial government has allocated Rs 400 billion,” he said.\nImran Khan told the gathering that the Madina State was based on two principles of justice and rule of law, failing to do which no nation could become a great nation.\nCriticising some media persons for advocating to allow Nawaz Sharif to address public events in Pakistan, he said how a nation could progress when people call such looters a leader.\nIn his address, Minister for Information and Broadcasting Chaudhry Fawad Hussain said the crowd should be an eye-opener for the opposition which also manifested the government’s performance and the public trust.\nReferring to the opposition’s announcement for moving a no-confidence motion, the minister said who would believe such opposition leaders whom their own families did not trust.\nHe said through the no-confidence motion the opposition leader only wanted to evade corruption cases, which the government would never let happen.\nHe said it was only Prime Minister Imran Khan who could reform the country’s system and bring about a change.\nHe said the incumbent government allocated a record Rs 30 billion for development projects in Mandi Bahauddin.\nMember National Assembly Gulraiz Chan said it was Prime Minister Imran Khan who fulfilled his commitment for the development of his area as the promises by the previous rulers remained confined to words.\nHe thanked the prime minister and Punjab Chief Minister Usman Buzdar for establishing an engineering university in the city.",
  "retrievedAt": "2025-08-11T14:22:06.185Z"
}
