{
  "title": "Youth paint 100 peace hopes in meaningful images",
  "link": "https://www.app.com.pk/national/youth-paint-100-peace-hopes-in-meaningful-images/",
  "date_published": "2023-09-23T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): Over 100 posters depicting hope for world peace, social justice and equal human rights were put on display at the Government Polytechnic Institute for Women (GPIW), H-8, Islamabad on Saturday to mark International Peace Day.\nThemed ‘actions for peace’, the artworks are mostly designed, painted and prepared by the girl students from different schools and colleges of the twin cities of Rawalpindi-Islamabad.\nThe poster exhibition was organised by the Devcom-Pakistan (Development Communications Network) in collaboration with the Dazzler, Islamabad Crescent Lions Club (ICLC), Islamabad Devcom Centennial Leo Club (IDCLC) and Government Polytechnic Institute for Women H-8 Islamabad, a news release said.\nDevcom-Pakistan Executive Director Munir Ahmed while introducing the peace poster exhibition said: A competition was organised among the students to inculcate passion to understand the concepts of peace in society and globally. They have painted many meaningful images of hope through their creative expression in different mediums including oil on canvas, acrylics on canvas, charcoal, pastels, watercolours and sketching with colour pencils.\nMunir Ahmed said “We believe the emerging youth is the only future hope in maintaining peace and tolerance if educated and groomed on the actual philosophies of living and working together. Peace is not the absence of conflicts but the acceptance of differences of opinion, and diversity of ethnic and religious identities.\nThe older generation has segregated the society based on the conflicting thoughts of the so-called socio-religious leadership for their vested interests instead of integrating different factions on the common discourse. The youth need to understand the realities and connotations of the actual social and religious theories and practices.”\nWell-known artist and the senior teacher of Cambridge Art and Design at the Westminster Riffat Ara Baig was the chief jury. She said the students have shown their creative skills and thoughts in meaningful compositions. The strong visuals quite effectively communicate the message of peace and tolerance. The youth have successfully highlighted the peace-disrupting elements and forces that show their understanding level of the issues in depth.\nThe GPIW principal Kausar Parveen highlighted the initiatives that the government has taken to empower young girls to narrow down the economic disparity. Several steps have been taken to enhance vocational education and youth grooming through a variety of initiatives and programmes, she said.\nYouth cannot be engaged in peace-restoring activities until they are taught the actual meaning of peace that may be derived from our religion. The creative pursuits would certainly lead the youth to well-groomed citizens.\nThe president of ICLC Brig (retd) Muhmmad Aslam Khan said without ensuring the fundamental human rights to every citizen, peace cannot be restored and maintained in our society. He said our religion Islam has defined the rights of every citizen and the same is reflected in the universal charters, we only need to implement these charters and practice the actual Islamic teachings.\nSeparately, the ICLC and its partners organized a national peace conference the other day to mark International Peace Day. Caretaker Federal Minister Human Rights and Women Development Khalil George was the chief guest. The speakers included former MNA Asiya Nasir, CEO Economy Watch Dr. Murtaza Mughal, Pir Azmat Sultan, CEO Dazzler Adnan Saeed, ICLC Secretary Sibtain Raza Lodhi, Mahrukh Shaikh, chairman National Peace and Justice Council Mian Waheed and others.\nThe speakers urged for national interfaith harmony through developing understanding among the communities and promoting tolerance for diverse and conflicting opinions. Different interfaith harmony youth initiatives shall be launched in different parts of the country, especially at the hotspots. The clubs shall groom the young leadership and jointly engage them in community services and environmental management.\nThe first prize winner Amber Malik from Quaid-i-Azam University said that it was a big opportunity for the students to show their peace of mind for the peace in society. More such types of activities shall be given to the students across the board to groom them as positive-thinking active citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:46:56.685Z"
}
