{
  "title": "No impediment should hamper OEPs’ functions in maximizing hurdle-free manpower export: SAPM",
  "link": "https://www.app.com.pk/national/no-impediment-should-hamper-oeps-functions-in-maximizing-hurdle-free-manpower-export-sapm/",
  "date_published": "2023-09-23T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): Special Assistant to the Prime Minister (SAPM) for Overseas Pakistanis and Human Resource Development, Jawad Sohrab Malik on Saturday directed that no impediment should hamper the Overseas Employment Promotors (OEPs)’s functions in maximizing hurdle-free export of manpower in different countries of the world.\nThe SAPM made these remarks during a meeting convened in pursuance of his directives with Overseas Employments Promotors (OEPs) in the Ministry of Overseas Pakistanis and Human Resource Development here, a news release said.\nThe Meeting was attended by prominent OEPs who were invited on the basis of their highest performance in export of labour force.\nSAPM Jawad Sohrab Malik, in his opening remarks, underlined the importance of agenda of the meeting to increase manpower export and invited the participants to provide their valuable input in this regard.\nHe assured unflinching support of the Ministry in resolving issues being confronted by OEPs, representatives of Pakistan Overseas Employment Promoters Association (POEPA) and discussed means to enhance manpower export in accordance with the government instructions.\nOn the invitation of the SAPM, the Executive Director NAVTTC and DG Immigration and Passport Office, Islamabad along with senior officers also attended the meeting.\nDuring the meeting, the OEPs raised some technical issues which they had been facing while coordinating with the relevant offices during the process of issuance of visas and clearance of other formalities for the intending emigrants. The SAPM stressed upon a close coordination and cooperation among all the relevant departments so that export of highly skilled manpower could be maximised.\nIn this regard, special instructions were issued to National Vocational and Technical Training Commission (NAVTTC), Bureau of Emigration and Overseas Employment (BE&OE), Director General Immigration and Passports (DGI&P), Islamabad for assisting the job of OEPs in areas related to their respective jurisdictions and mandate.\nSAPM Jawad Sohrab Malik directed the OEPs to provide a detailed breakup of issues being faced by them along with a proposal for their possible solution thereof within the next three days so that those issues may be resolved immediately in accordance with law.\nFurthering the support of Ministry for the PEOPA Representatives, a Special Facilitation Cell for addressing the concerns highlighted by OEPs has been set up under the supervision of Jawad Sohrab Malik in the Ministry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:46:56.746Z"
}
