{
  "title": "President for educating 27 mln out of school children through traditional, nontraditional ways",
  "link": "https://www.app.com.pk/national/president-for-educating-27-mln-out-of-school-children-through-traditional-nontraditional-ways/",
  "date_published": "2023-09-23T08:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP):President Dr Arif Alvi on Saturday sought the government’s special attention to provide education to the 27 million out of school children through both traditional and nontraditional ways.\nDuring a meeting with Caretaker Minister for Federal Education and Professional Training, Madad Ali Sindhi who called on President Dr Arif Alvi here, the president also stressed for promotion of quality education and professional training in the country.\nHe said special arrangements should be made to provide education to the people living in remote areas of the country.\nPresident Alvi also proposed that online tools of education could also be utilized for the provision of education to the people living in remote areas.\nHe also suggested to utilize various platforms other than school buildings such as mosques to provision education to the people.\nHighlighting the importance of education for special persons, the president stressed that special arrangements should also be made for them to give education along with the normal children.\nWith respect to the girls education, he said the girls should be encouraged to continue their education in schools.\nHe said the universities should equip their students with skills according to the needs of the market.\nThe number of people enrolled in universities for higher education in Pakistan is very less compared to other countries in the region, he said adding special measures should be taken to increase the number of people with higher education in the country.\nHe proposed the universities to provide higher education to more students with the help of online education and different shifts, adding that besides the 4-year programs, the universities should also start 2-year degree programs.\nWith the help of online and distance education programs of Virtual University and Allama Iqbal Open University, the number of highly educated people can be increased, the president said.\nHe also stressed the universities to focus on artificial intelligence, machine learning, cyber security and cloud computing\nMatters related to the Federal Urdu University were also discussed in the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:47:20.357Z"
}
