{
  "title": "Protests rallies in front of Indian military posts held in Neelum.",
  "link": "https://www.app.com.pk/national/protests-rallies-in-front-of-indian-military-posts-held-in-neelum/",
  "date_published": "2020-10-27T14:22:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Oct 27 (APP): Protest processions and rallies observed across Jammu and Kashmir against invasion by Indian armed forces in Jammu and Kashmir on 27th October 1947.\nPeople of Neelum Valley staged a protest demonstration against Indian armed forces holding black flags in front of Indian military posts on Line of Control (LOC).\nAccording to details, a large number of people gathered in Neelum and Jehlum Valley to demonstrate protest against Indian armed forces under the aegis of Pasban-e-Hurriyat Jammu Kashmir.\nSpeakers on the occasion said that 27th October is the darkest day of history when Indian armed forces occupied the Jammu and Kashmir.\nThey said, “On this black day, Indian armed forces landed in Srinagar Airport and occupied the land of Jammu and Kashmir against the will of the people of Jammu and Kashmir, since then people of J&K are demanding freedom.”\nThey maintained that people of J&K never accepted Indian Occupation on their land,” people are living under suppression for the last 73 years, the heavenly symboled beautiful state has become hell for the people.”\nSpeakers lamented that many people have been martyred, thousands suffered imprisonments and women were raped, “even the political leadership was under house arrest for more than an year or in notorious Indian jails” they added.\nThey further said that Indian misadventures of 5th August 2019 has jeopardized the peace in the region which people of Jammu and Kashmir have already rejected.\nThey reiterated that UN failed to implement its resolutions on Kashmir as it has promised to conduct Plebiscite according to its 5th January 1949 resolutions.\nThey appealed the international organizations and peace loving nations to play their role on Kashmir issue and endeavor to resolve this issue for the stability of Peace in the region.\nChairman Pasban-e-Hurriyat Uzair Ahmed Ghazali, Deputy Commissioner Neelum Shahid Mehmood, District President Pasban-e-Hurriyat Malik Sharafat Hussain, President APML Javed Ahmed Mughal, Peerzada Sultan Mehmood, Shafqat Muzaffarabadi, Danyal Qureshi, Faisal Farooq, Aimal Farzam and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T19:56:46.036Z"
}
