{
  "title": "Pakistan to continue moral, diplomatic support to Kashmiris struggling for freedom: Shibli",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-moral-diplomatic-support-to-kashmiris-struggling-for-freedom-shibli/",
  "date_published": "2020-10-27T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Minister for Information and Broadcasting Senator Shibli Faraz Tuesday said Pakistan would continue to extend moral, political and diplomatic support to Kashmiris till they got their right to self- determination.\nSpeaking at an event here at Foreign Office to express solidarity with the Kashmiris on the occasion of Black Day observed on October 27 every year, he said the Kashmir issue was turned into a dispute at the time of partition of the Indian Sub-continent.\nKashmir was supposed to be part of Pakistan as a Muslim majority state, he added.\nShibli Faraz said the people of Pakistan were observing the Black Day by holding different events to recognize the bravery, courage and consistency of the Kashmiri people, who stood up against the Indian troops for their freedom.\nThe Kashmiri people, including old men, women and children, he said, offered sacrifices for their movement to achieve the right to self-determination while bearing the Indian brutalities.\nIndia changed the status of Kashmir by revoking provisions in its constitution on August 5, 2019, he observed, adding Pakistan and other friendly countries protested against the measures of India.\nThe minister said the United Nations had passed resolutions to resolve the Kashmir issue, which, unfortunately, were not implemented.\nHe said Prime Minister Imran Khan in his two speeches at the United Nations General Assembly warned the world about the consequences of not implementing the UN Security Council resolutions on Kashmir.\nThe minister said the hearts of Pakistani people beat with their Kashmiri brethren. They firmly believed that the people of Kashmir should be granted their inalienable right to self determination, he asserted.\nShibli said the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) had been braving hardships under the curfew imposed by India for the last 400 days .\nHe said the world community and the international human rights organizations should have to reconsider their double standards on the Kashmir issue.\nThey should develop consensus and stop the Rashtriya Swayamsevak Sangh (RSS) led extremist government of Narendra Modi from perpetrating atrocities in the IIOJK, he stressed.",
  "retrievedAt": "2025-08-11T19:56:45.274Z"
}
