{
  "title": "FM asks world to notice India’s illegal acts in Kashmir",
  "link": "https://www.app.com.pk/national/fm-asks-world-to-notice-indias-illegal-acts-in-kashmir/",
  "date_published": "2020-10-27T05:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Foreign Minister Shah Mehmood Qureshi on Tuesday asked the international community to pressurize India to reverse its illegal course in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and restore the Kashmiris’ fundamental human rights.\n“Through the deployment of additional troops and an unprecedented media and communication blackout, occupied Jammu & Kashmir has been turned into the largest open prison in the world,” the foreign minister said in his message on Kashmir Black Day.\nQureshi said on this day 73 years ago, Indian occupation forces entered Jammu and Kashmir in an attempt to subjugate the Kashmiri people.\n“To this day, the brave people of Indian Illegally Occupied Jammu & Kashmir (IIOJK) have remained steadfast in their resolve to defy India and stand firm in their quest for the right to self-determination,” he said.\nOn August 5, 2019, India took further illegal and unilateral steps to change the internationally recognized disputed status of IIOJK and alter the demographic structure of the occupied territory.\n“Pakistan and the Kashmiris have categorically rejected this blatant travesty of law and justice. For over one year, the scale and impunity of the Indian government’s human rights violations have increased manifold,” he said\nHe said the world community was calling India out on its tyranny and its façade as one of the world’s so-called largest ‘democracies’ has been undeniably exposed.\n“Pakistan calls for the urgent lifting of the military siege and media blackout, immediate stop to the violations of human rights of Kashmiri people, release of Kashmiri leaders and youth, and end to impunity granted to Indian occupation forces under draconian laws,” he said.\nQureshi said, “We express complete solidarity with the people of IIOJK and assure our Kashmiri brothers and sisters that the Government and people of Pakistan remain shoulder-to-shoulder with them.”\n“Pakistan will not relent in its support until the Kashmiris realize their legitimate right to self-determination in accordance with the United Nations Security Council resolutions,” he said.",
  "retrievedAt": "2025-08-11T19:56:50.609Z"
}
