{
  "title": "IBCC collaborates BISE Saidu Sharif Swat for online verification facility",
  "author": null,
  "content": "ISLAMABAD, Jan 28 (APP):In a significant step towards student facilitation and digital transformation, the Inter Boards Coordination Commission (IBCC) has achieved another milestone by signing a Memorandum of Understanding (MoU) with the Board of Intermediate and Secondary Education (BISE), Saidu Sharif Swat.\nThis collaboration aims to simplify the process of document verification required for attestation of certificates from IBCC.\nThe students will not be required to visit the BISE Saidu Sharif Swat to obtain verification in sealed envelopes, instead, their data will be accessible to IBCC once they apply to the board for verification.\nThe MoU was formally signed by Dr. Ghulam Ali Mallah, Executive Director IBCC, and Prof. Tasbih Ullah, Chairman BISE Saidu Sharif Swat.\nThrough this partnership, students can now apply for document verification to the BISE Swat, and once verified by the board, students can conveniently apply for IBCC attestation online via the IBCC Attestation Portal at www.ibcc.edu.pk. ensuring a seamless and efficient experience.\nSpeaking on the occasion, Dr. Ghulam Ali Mallah emphasized the IBCC’s commitment to facilitating students through innovative solutions and digital services.\n“This partnership reflects our dedication to simplifying processes for students, saving them time and resources, and promoting transparency in document verification and attestation,” he stated.\nProf. Tasbih Ullah, Chairman BISE Saidu Sharif Swat, lauded the initiative, highlighting its potential to revolutionize how students interact with education boards.\n“This step aligns with our shared vision of leveraging technology to improve accessibility and convenience for students across Pakistan,” he remarked.\nThis landmark collaboration is part of IBCC’s broader efforts to digitize services and ensure maximum ease for students nationwide. The online verification and attestation system will not only expedite the process but also reduce physical and logistical barriers for students, particularly those from remote areas.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:07:30.917Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ibcc-collaborates-bise-saidu-sharif-swat-for-online-verification-facility/",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T13:11:00.000Z"
}
