{
  "title": "US Charge D Affairs in Pakistan calls on federal minister for power Awais Leghari",
  "author": null,
  "content": "ISLAMABAD, Jan 28 (APP):US Charge D Affairs in Pakistan Ms Natalie A Baker called on Federal Minister for Energy (Power Division) Sardar Awais Ahmed Khan Leghari here on Tuesday.\nThe Federal Minister apprised the US Diplomat about the recent reforms undertaken in the Power Sector by the present Government, said a press release. He said that due to these reforms the Power Sector has shown improvement as compared to last year. He said that the Government is following a policy of non-interference and has appointed completely independent of BoDs of Power Sector State Owned Enterprises so that they can take their decisions on merit.\nThe US Charge D Affairs invited the Federal Minister for participation in Energy Security Dialogue that is being organized in Washington, stating that his participation will be highly valuable.\nThe Federal Minister while acknowledging close partnership of various US Agencies with Power Sector, said that it has gone a long way in building the strategic partnership and Pakistan values its relationship in this regard. He further said that team in Power Division has been working to further expend and explore new avenues of cooperation.\nRegarding privatization of DISCOs Sardar Awais Leghari informed that transparency and international standards are being followed which is bound to attract the investors. He invited the US investor to take part in the competitive bidding in this regard.\nThe Minister also informed about the efforts in reducing the Power Tariff for consumers in the country.\nMs Natalie A Baker while appreciating the efforts made by the Power Division said that it is now quite obivious that the Government is making serious efforts to reduce electricity tariff in the country. She also assured to working together to explore new vistas of cooperation in the energy sector.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:07:44.634Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/us-charge-d-affairs-in-pakistan-calls-on-federal-minister-for-power-awais-leghari/",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T12:47:00.000Z"
}
