{
  "article_id": "2025-02-06_4909b4a41de56cb13d8f675738a8615c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/scp-dismisses-petition-regarding-video-scandal/",
    "retrieved_at": "2025-08-27T12:26:57.923Z"
  },
  "metadata": {
    "title": "SCP dismisses petition regarding video scandal",
    "author": null,
    "date_published": "2025-02-06T09:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 314,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 06 (APP):The Supreme Court has dismissed a petition seeking an investigation into the Bahawalpur Islamia University video scandal and has advised the petitioner to contact Lahore High Court. The petition was filed by Advocate Zulfiqar Ahmad under Article 184 of the Constitution pleading the top court to direct police for taking measures to stop further dissemination of the objectionable videos relating to the University and the provincial government, without prior permission of the Supreme Court, should not suspend or transfer any officer conducting the investigation. The petition further pleaded that the Judicial Commission, constituted by the provincial government should let the police and the Federal Investigation Agency (FIA) complete its investigation and the concerned authorities should be directed not to share the videos and keep the secrecy of the matter at all cost. The seven-member Constitutional Bench of the Supreme Court of Pakistan, headed by Justice Amin ud Din Khan, Thursday heard the petitioner and asked him to contact a proper forum. The petitioner, Advocate Zulfiqar Ali, expressed his distrust over the Punjab Police and said that the student are still blackmailed. Section 354 deals with death penalty in such cases. Justice Muhammad Ali Mazhar remarked that Section 354 has nothing to do with this case. The Petitioner pleaded that the same section can be applied after a minor amendment but the court did not agree with him and observed that the parliament cannot be directed to legislate. Justice Jamal Mandokhail observed that how can we act in absence of the aggrieved party? Justice Muhammad Ali asked the petitioner if he had filed such a petition in the Lahore High Court under Article 199 of the Constitution. Justice Amin ud Din Khan remarked that a judge of the Lahore High Court had inquired into the matter and it was settled. The Court termed the petition not permissible and disposed of the case.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}