{
  "article_id": "2025-02-06_0b4eec6ee2a18a307b029aec584f71bd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/suparcos-indigenous-rover-ready-to-land-on-moons-surface-aboard-change-8-mission/",
    "retrieved_at": "2025-08-27T12:26:03.894Z"
  },
  "metadata": {
    "title": "SUPARCO’s Indigenous Rover ready to land on moon’s surface aboard Chang’e-8 mission",
    "author": null,
    "date_published": "2025-02-06T12:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 362,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 06 (APP): Pakistan has made a significant leap in deep space exploration with the signing of a historic Memorandum of Understanding (MoU) between the Space and Upper Atmosphere Research Commission (SUPARCO) and the China National Space Administration (CNSA). The agreement was signed in the presence of the Presidents of Pakistan, Mr. Asif Ali Zardari, and China, Mr. Xi Jinping on Thursday. According to the SUPARCO, the MoU paves the way for Pakistan's first indigenous lunar rover to be part of China's Chang'e-8 mission, set for launch in 2028. The Chang'e-8 mission, developed and implemented by CNSA, is designed to autonomously conduct in-situ scientific exploration, technology verification, lunar surface mapping, and resource utilization. Pakistan's participation in this mission marks a significant milestone in the country's space program and its contribution to the International Lunar Research Station (ILRS) initiative. SUPARCO's lunar rover will be deployed at the Moon's south pole, a region of immense scientific interest due to its unique environment and potential for future human exploration. The rover will carry advanced scientific payloads developed by SUPARCO. The Rover will also carry an internationally designed scientific payload created through collaboration between Chinese and European scientists. This combined effort will enhance the mission's capability to conduct in-depth analysis of the lunar surface. SUPARCO's scientists and engineers have independently designed, manufactured, assembled, integrated, and tested the rover, demonstrating Pakistan's growing expertise in space technology. Once deployed, Pakistani scientists will control and operate the rover from Earth, further enhancing the country's role in lunar exploration. Pakistan's lunar rover will contribute to several key scientific and technological objectives, including studying lunar soil composition and its potential for resource utilization and mapping the lunar surface to assist in future exploration missions. This would also help studying radiation levels and plasma properties on the lunar surface to assess potential impacts on future exploration and human presence and testing new technologies for long-term lunar operations and sustainable human presence. This collaboration between SUPARCO and CNSA highlights the strong bilateral relations between Pakistan and China and their shared vision for deep space exploration. It also reinforces Pakistan's commitment to advancing its national space program and contributing to global scientific research.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}