{
  "article_id": "2025-02-06_df3ccacf29aad6aaed47c9bc9f1b7485",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-on-energy-reviews-gas-procurement-agreements-with-qatar-and-azerbaijan/",
    "retrieved_at": "2025-08-27T12:26:02.381Z"
  },
  "metadata": {
    "title": "NA body on energy reviews gas procurement agreements with Qatar and Azerbaijan",
    "author": null,
    "date_published": "2025-02-06T13:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 208,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 06 (APP): The National Assembly Standing Committee on Energy (Petroleum Division) on Thursday discussed gas procurement agreements with Qatar and Azerbaijan, along with challenges faced by local gas distribution companies and the government's policy framework for private sector participation in natural gas exploration. The committee, chaired by Syed Mustafa Mehmood, deliberated on key energy sector issues. The Secretary of the Ministry of Energy provided a detailed briefing, highlighting a provision allowing private entities to retain and market 35% of future gas discoveries in Pakistan. He also outlined a two-pronged strategy to manage supply shortfalls, which includes engaging stakeholders for discoveries and ensuring prudent network operations. This approach aims to optimize reserves, promote competition, and reduce circular debt. The committee unanimously agreed to form a subcommittee, led by Syed Naveed Qamar, to draft new guidelines for efficiently utilising Corporate Social Responsibility (CSR) funds, production bonuses, and training allocations for capacity building. On fuel quality concerns, the Ministry informed the committee that refineries had been previously advised to assess the environmental and health impacts of fuel additives. Additionally, the government has introduced the Brownfield Refining Policy 2023 to upgrade refineries. The committee recommended that a comprehensive briefing on the new biofuel policy be presented in the next meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}