{
  "title": "Four land fraudsters sentenced to 96 years for defrauding British Pakistani family",
  "link": "https://www.app.com.pk/national/four-land-fraudsters-sentenced-to-96-years-for-defrauding-british-pakistani-family/",
  "date_published": "2024-06-19T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP): The District and Sessions Judge of the Anti-Corruption Rawalpindi Court has sentenced four individuals, including two revenue officials, to a total of 96 years of rigorous imprisonment and fines amounting to Rs 5.8 million for cheating, manipulation, and fraudulent forgery of ownership papers owned by a prominent British Pakistani family.\nSpecial Judge Ali Nawaz of the Anti-Corruption Court sentenced Aurangzeb Patwari, Malik Muhammad Safdar, Muhammad Almas Abbasi, Haq Nawaz Abbasi, and Raja Shahid Ahmed for unlawfully occupying lands through fraudulent forgery of documents belonging to British Pakistani businessman Nisar Ahmad Afzal. Previously out on bail, the convicted individuals have now been transferred to Central Jail Adiyala following the decisive verdict.\nThe complainants had filed an application before the director-general of anti-corruption in Lahore (Punjab). Anti-Corruption Lahore said in a forensic report prepared by the Punjab Forensic Science Agency (PFSA) that it investigated the accused and established that the record of the land registry was tampered with, signatures forged, and additional pages added to the original land record in order to defraud the British Pakistani family.\nThe court was told that the mutation of the land was not compared or verified by Girdawar, which is a prerequisite under the law, and that “names of Almas, Haq Nawaz, and Raja Shahid seem to have been inserted subsequently” and “this mutation has not been entered in Roznamcha Waqiati.”.\nRaja Shahid, Almas Abbasi, and Haq Nawaz initially denied being involved in the forgery scheme, but the forensic investigation by Anti-Corruption Lahore (Punjab) proved they were involved in tampering with papers, fraud, and manipulation in order to snatch the expensive piece of land worth around three billion rupees (approximately £10 million).\nAnti-Corruption Court Special Judge Ali Nawaz said it was proven beyond any doubt that the accused had manipulated and forged the papers to commit crime against overseas Pakistani Nisar Afzal and his family and sentenced all the accused for 96 years in total on several counts each of criminal misconduct, forgery, fraud, alteration, and using forged documents to make gains: Raja Shahid was sentenced for 17 years and fined 1.2 million rupees; Haq Nawaz Abbasi was sentenced for 17 years and fined 1.2 million rupees; Aurangzeb Patwari was sentenced for 31 years and fined 1.7 million rupees on five counts of criminal misconduct; and Muhammad Safdar Naib Tehseeldar was sentenced for 31 years and fined 1.7 million rupees. The main accused in the case, Almas Abbasi, died during the trial in December 2023.\nThe judgment noted that entries in the mutation were made in both black and red ink, but a sanction order dated May 16, 2005, allegedly attributed to Revenue Officer Ghulam Mujtaba Naib Tehsildar was written in blue ink with cuttings. This document, purportedly written by Naib Tehsildar Ghulam Mujtaba, was sent for verification of the handwriting against his\nadmitted signatures, and routine signatures confirmed that it was not authored by Ghulam Mujtaba Naib Tehsildar.\nSimilarly, in mutation no. 5442/1, the signatures of Ghulam Mujtaba and Naib Tehsildar were sent for comparison with his routine signature. The forensic report confirmed that the signatures did not match Ghulam Mujtaba’s, supporting his claim that he never sanctioned these mutations presented by accused Aurangzeb, the former circle Patwari.\nThe judgment noted that Nisar Afzal had the option to initiate criminal proceedings against the convicted and, at the same time, could claim damages under the relevant law in the civil court.\nThe judge ruled: “I am of the considered view that the accused persons had committed cheating, fraud, manipulation, and prepared fake documents with the purpose and intention to get wrongful loss to the complainant and unlawful gain for them.”\nLast year, Britain’s Serious Fraud Office (SFO) dropped a mortgage fraud case after failing to establish enough evidence to prosecute him. Nisar Afzal had left for Pakistan around 15 years ago after the case was charged. He had pleaded that he was being victimized in a case in which he had no role to play. The SFO later accepted that it didn’t have evidence and ended the case last year.\nNisar Afzal said in a statement, “I am relieved that finally justice has been done. This was a case of financial terrorism. At the trial, we established through a record of transactions that I owned the land through completely rightful means. The accused were proven to be cheaters, liars, and scammers during the investigation and the trial, but my time and resources were wasted for several years to expose the fraud.\n“I suffered so much that some of my family members left for the UK, faced with threats to kill by the accused. This was a case of daylight robbery. I am thankful to the court and the prosecution for giving me justice. Overseas Pakistanis are a great asset, and this should not happen to them or anyone else,” he said.",
  "retrievedAt": "2025-08-11T03:20:55.081Z"
}
