{
  "title": "Situation along Pak-Afghan border stable, measures placed to control mobility: ISPR DG",
  "link": "https://www.app.com.pk/national/situation-along-pak-afghan-border-stable-measures-placed-to-control-mobility-ispr-dg/",
  "date_published": "2021-08-27T16:47:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 27 (APP):Inter Services Public Relations (ISPR) Director General (DG) Major General Babar Iftikhar Friday said the situation along Pakistan-Afghanistan Border was stable and required measures were placed to control mobility and contain unwanted movement.\nHe was briefing media over evolving situation in Afghanistan and implied national security risks to be faced by the country.\nThe ISPR DG said the military situation in Afghanistan felled rather rapidly post United States forces withdrawal when the Ashraf Ghani regime knocked down on August 15.\nHe said Pakistan took appropriate measures to protect its side of the border which was stable and had controlled movement, adding, “It will have positive impact on the other side and will try to reciprocate it on the other side.”\nHe informed that the notified crossings along Pak-Afghan Border was closed due to fluctuating situation in Afghanistan whereas the Afghan National Army soldiers on two occasions sought refuge on Pakistani side.\n“Pakistan Army has responded to their request and provided them shelter, food and safe passage to their country,” he added.\nThe ISPR DG noted that there was chance of instability on Afghan Border, therefore, regular troops of Pakistan Army were deployed to ensure well-managed border security.\nHe said other than Afghanistan and its people Pakistanis were the biggest victim during the Russian War and Afghan conflict where the latter bore maximum brunt during the decades’ long conflicts.\n“Over 86,000 innocent lives have been lost in Pakistan during the war on terror and more than $102billion economic losses faced by the country that are still counting,” he added.\nPakistan Army, he said, was engaged on three different fronts including Western, Eastern Borders and internal security to combat the menace of terrorism.\nThere were three major escalations on the eastern border when the Pakistan Army was engaged on the Afghan Border during the past two decades, he added.\nMajor General Babar said since 2014 over 12,000 ceasefire violations occurred on the line of control (LoC) where the security forces conducted 2,237 major operations leading to area clearance of 46,000 square kilometers from the terrorists.\n“We have lost politicians, soldiers, artists, doctors, journalists, students, teachers and people from all strata of society that made the number of martyrs over 86,000,” he said, adding, “With the support of our great nation and the armed forces, we have turned the tide and brought normalcy to our nation.”\nWhile shedding light on the efforts of made by the highest military leadership to extend assistance to the Afghan National Army in capacity building and combating terrorism, he said the Pakistan Army engaged with the Afghan Army on military to military basis and developed several mechanisms including tripartite, bipartite, army working group and intelligence sharing effort since 2014 but none of it worked except the one that was\nestablished in 2018.\nHe added that there were five senior Pakistani military leadership’s visits to Afghanistan among four of them made by the army chief. During these visits, Afghans were offered intelligence sharing and training of Afghan soldiers whereas only six Afghan army cadets came to Pakistan for training where hundreds of them went to India for training.\nThe ISPR DG also informed the media about the massive security build up launched to secure the 2,611 kilometers long Pak-Afghan Border.\nHe said, “There has been a massive capacity enhancement initiative launched by the Army Chief General Qamar Javed Bajwa in 2018.”\nThe capacity beef up included induction of 60 new wings of Frontier Corps in Khyber Pakhtunkhwa and Balochistan who were responsible to guard the western border, upgraded technology and biometrics at border terminals with further enhancement, new forts raised along the border, he added.\nHe briefed that almost 90 percent fencing along Pak-Afghan border was completed where many soldiers rendered sacrifices of their lives to make it a success and 50 percent fencing along Pak-Iran Border was completed.\n“We fought this war with a whole of nation approach where operations Sherdil, Khyber-1 and Khyber-2, Zarb-e-Azb, Radd-ul-Fasaad etcetera are an epitome of insurmountable courage and resolve,” he added.\nGeneral Iftikhar confirmed that there were undeniable evidences of RAW involvement and its nexus with NDS (Afghan Intelligence Agency) in Dassu, Gwadar and Lahore terrorist attacks.\nHe told that some 1,030 development projects were initiated in Balochistan and Tribal districts at a cost of over Rs900 billion where the armed forces were assisting the provincial and federal governments in executing those projects.\nThe ISPR DG announced that this year ‘Defence Day’ on September would be marked with national zeal and fervour but with a new theme of “Watan Ki Matti Gawah Rehna” (the soil of the country be a witness—to our endeavours of nation building and protection).\nHe said the main ceremony would be held with strict Covid-19 protocols and safety measures to avoid disease spread.\n“The nation is urged to reach out to the families of the martyrs who spilled their blood for the motherland and pay their respects and salute to their valiant martyrs and their loved ones,” he requested.\nResponding to various media queries, he defied the assertions that the Taliban’s Islamic regime to have any impact on Pakistan’s setup. “Pakistan’s Constitution and laws are in line with Islamic principles and public aspirations and it will have no impact on us,” he said.\nDespite the fact the there was fluid situation in Afghanistan but there was no risk of civil war to break out in that region, he replied to another query.",
  "retrievedAt": "2025-08-11T21:08:25.473Z"
}
