{
  "title": "EU holds orientation session for Erasmus Mundus Joint Master Degree scholarships receiepnts",
  "link": "https://www.app.com.pk/national/eu-holds-orientation-session-for-erasmus-mundus-joint-master-degree-scholarships-receiepnts/",
  "date_published": "2021-08-27T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): A European Union delegation to Pakistan Friday held a pre-departure orientation session for the 141 Pakistani students including 77 men and 64 women who received Erasmus Mundus Joint Master Degree scholarships for 2021 to study in Europe, at the Higher Education Commission (HEC).\nThe session was organized in collaboration with the HEC for providing an opportunity for networking among peers and Erasmus Alumni.\nDuring his welcome remarks, the Head of Cooperation of the European Union Delegation, Ovidiu Mic said\n“today we congratulate the young men and women who will embark on an educational and cultural journey through the Erasmus+ programme over the coming months. I am sure that they will return with strong knowledge and rich experiences, and contribute to the development of Pakistan.”\nThis year 2,756 students from 142 countries were selected for the Erasmus Mundus Joint Master Degree scholarships. Pakistan was 3rd in the world for number of scholarships awarded and remained the top country in terms of scholarship applications.\nThe programme was launched with an aim to support education, training, youth and sports across the world. While the first Erasmus+ Programme was launched in 1987, initially for exchanges with Europe only. It was extended beyond Europe´s borders in 2004. It funds programmes, projects, scholarships and fosters cooperation both within the European Union and globally.\nThe new Erasmus+ programme was launched in March 2021 and brings over 26.2 billion EUR to support mobility and cooperation among Higher Education Institutions worldwide.\nAdviser of the Higher Education Commission, Awais Ahmad, representatives from EU member states and members of the Erasmus+ Alumni Association also attended the event.",
  "retrievedAt": "2025-08-11T21:08:28.571Z"
}
