{
  "title": "SUP leader says anti-canals struggle will now focus on corporate farming - Pakistan - DAWN.COM",
  "author": null,
  "content": "HYDERABAD: Sindh United Party (SUP) President Syed Zain Shah has said that the people of Sindh have already declared their decision against federal government’s six canals project.\n\nThe sustained campaign that forced it to shelve, though temporarily, the plan was a referendum against the project, he said.\n\nAddressing members of the Hyderabad District Bar Association (HDBA) here on Tuesday, Zain Shah said the people of Sindh had with one voice rejected the canals project and also another initiative that was aimed at usurping its lands. “There is a need for a similar vigorous movement against corporate farming,” he added.\n\nThe SUP leader said that nobody could deceive people of Sindh now. He believed that the establishment and rulers would have to shelve the canals project once and for all.\n\nThe lands doled out to private parties for corporate farming would also have to be taken back, he stressed.\n\nHe said that the SUP would continue its peaceful struggle against corporate farming in order to get this project scrapped. He said that this struggle would make headway with prudence and wisdom.\n\nShah demanded the Sindh government share figures of the lands given to different companies for corporate farming.\n\nHe said that corporate farming project was ‘anti-Sindh’ in nature, and claimed that PPP did not want it to be abandoned. “The PPP had misled people on the canals project, and now it’s misguiding people on the corporate farming project as well,” he deplored.\n\nHe stated that the entire Sindh understood that corporate farming was a plan to usurp lands. He said that people of Sindh had resisted the canal project because they were there to own their river. He added that if the corporate farming project was thrust upon Sindh, then everyone would regard it as an invasion on 70m people of the province.\n\nHe said that the SUP would not allow anyone to dole out a single acre of Sindh’s land to anyone under the corporate farming project or the Green Pakistan Initiative. He said his party would continue its public mobilisation campaign in Sindh against corporate farming and for the protection of the province’s coastal strip. “Our struggle has not come to an end yet,” he declared.\n\nZain Shah observed that the federal government had failed to represent provinces. “It believes in usurping resources of Sindh, instead of ensuring constitutional and legal rights of provinces. A dacoity is being committed on Sindh’s resources and rights in the garb of corporate farming and Green Pakistan Initiative which is bound to destroy the agriculture sector and economy of the province,” he said.\n\nAll such conspiracies would be foiled, he vowed, and noted with concern that attempts were being made in every district of Sindh to dispose of lands through government officers.\n\nHigh Court Bar Association (HCBA) General Secretary Israr Chang and senior members including K.B. Legahri and Naveed Jarwar also spoke.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:03:59.460Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910872/sup-leader-says-anti-canals-struggle-will-now-focus-on-corporate-farming",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:23:13.000Z"
}
