{
  "title": "Lawmakers slam Modi, caution against another misadventure - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PPP’s Khar says India has crossed red lines, misread Pakistan’s restraint as weakness\n• Insists ceasefire after face-off between nuclear powers should be celebrated\n\nISLAMABAD: Amid India’s dangerous war rhetoric, Pakistani lawmakers on Tuesday cautioned that New Delhi could again resort to military misadventure out of political desperation, warning of the grave consequences such an escalation could bring between two nuclear-armed neighbours.\n\nAddressing the National Assembly dur­­­ing a discussion on recent tensions with India, several members lambasted Indian Prime Minister Narendra Modi, calling him a “certified terrorist” and warning that he could go to any extent for political gains as his politics thrived on corpses.\n\nFormer foreign minister Hina Rabbani Khar said that India’s crushing defeat at the hands of Pakistan was nothing to celebrate. “We must all be unapologetic as a country that celebrates a ceasefire. Why not celebrate the ceasefire? Yes, we absolutely will,” she said.\n\nMs Khar warned that India had continuously crossed red lines, underestim­ating Pakistan’s capability and misreading its restraint as weakness. She said this miscalculation could have led to catastrophic consequences, insisting that Pakistan had proven its defensive and strategic capabilities under pressure.\n\nHighlighting the dangers of setting new precedents in international conflict resolution, she challenged India’s narrative of “self-defence” following the Pahal­­gam attack to justify cross-border strikes.\n\n“What are we supposed to do if a terrorism incident takes place in Pakistan?” she asked, questioning whether Pakistan would be equally justified in launching strikes in response to proven Indian involvement in incidents like the Jaffar Express attack. She criticised India for “weaponising terrorism” and flouting international law. “Have you all stepped outside the UN Charter and parameters of international law?” she asked. “Are we no longer signatories to Article 25, which obliges all nations to uphold UN Security Council resolutions?”\n\nShe criticised Indian Prime Minister Narendra Modi’s unilateral declarations regarding held Kashmir, asking whether the world was expected to “pay homage” and bow down to such claims. Citing US President Donald Trump’s acknowledgement of Kashmir as a disputed territory, Ms Khar argued that the Indian narrative had begun to unravel.\n\n“The illusion of India’s conventional warfare supremacy has been broken — not by Pakistan, but by Modi’s own extremist policies,” she remarked.\n\nShe noted that the belief that India could serve as a regional security provider has been undermined by its inability to secure its own borders during confrontations with Pakistan. “Pakistan proved its capabilities through both defensive and calibrated offensive responses,” she asserted.\n\nMs Khar noted that Pakistan’s military professionalism and operational competence had been underestimated.\n\n“What we all proved was that we don’t just buy high-tech toys; we train ourselves better to use them,” she stressed.\n\nShe argued that India’s attempts to detach itself diplomatically from Pakistan — a strategy pursued over the last 15 years — had failed. “By provoking Pakistan into conflict, they re-hyphenated themselves with us in the eyes of the world,” she said. She said that if India was serious in dealing with the problem of terrorism, it must not run away from the dialogue table.\n\nTwo bills passed\n\nThe House also passed two private me­­mbers’ bills — the International Exa­m­­­ination Board Bill, 2024, and the Ghur­­ki Institute of Science and Technology Bill, 2024 — with majority support. Both bills had previously been reviewed and clea­red by the relevant standing committees.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/14090837293abdf.jpg",
  "retrievedAt": "2025-10-12T03:03:38.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910922/lawmakers-slam-modi-caution-against-another-misadventure",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:40:55.000Z"
}
