{
  "title": "Pakistan pulled off a ‘macroeconomic miracle’: report - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan’s market has captured the attention of global investors amid its heightened tensions with India, US publication Barron’s reports.\n\nOver the past two years, the country has seen a “macroeconomic miracle”. While inflation was down from 40 per cent annually to near zero, Eurobonds maturing in 2031 rose from 40 cents on the dollar to 80 cents. The KSE-100 index has also tripled.\n\nThe government reached a “stabilisation agreement” with the International Monetary Fund last September with the lender approving a $7 billion Extended Fund Facility (EFF). Over $2bn has already been disbursed.\n\n“Pakistan is a good story,” Genna Lozovsky, a chief investment officer at Sandglass Capital Management, was quoted by Barron’s as saying. “So good it’s not risky enough for us anymore.”’\n\nThe media outlet further stated that the recent conflict with India “won’t likely knock Pakistan’s recovery off course” but the “country’s own shaky underpinnings might”.\n\n“Pakistan has been known for boom-and-bust cycles throughout its history,” according to Khaled Sellami, an emerging markets sovereign debt manager at Barings. He said there are some signs that this time could be different.\n\nPakistan’s period of stabilisation started with a near-default experience in 2022-23 following Imran Khan’s ouster. Alison Graham, chief investment officer at frontier markets specialist Voltan Capital Management stated, “Everyone thought Pakistan would default along with Sri Lanka in 2023.”\n\nInstead, the State Bank of Pakistan hiked interest rates from 10pc to 22pc, putting the country into recession but wringing out inflation.\n\nLast year, the country gained loans from sovereign creditors China, Saudi Arabia and the United Arab Emirates, while the GDP growth bounced back to 2.5pc. “The current account balance is positive, and they have a primary fiscal surplus [excluding interest payments],” Sellami said. “That’s something we haven’t seen in many years.”\n\nPakistan remains in “relative stagnation” with cotton, apparel and cereals accounting for two-thirds of exports compared to India’s development in advanced industries like IT and pharmaceuticals. Sellami said, “It is belatedly moving into IT outsourcing, foreign sales rising from near nothing to $3bn annually over the past few years,” adding that India was in the $200bn range.\n\nWithout a value-added ladder to climb, fate and free-spending election cycles may continue driving Pakistan’s boom and bust, according to Graham. She continued, “Pakistan remains extremely fragile to external shocks.\n\n“When there is a rally, you need to be in early.”\n\nSellami was more optimistic, being “constructive” on Pakistani Eurobonds. He said that the country’s foreign friends, China and the Gulf states, made it clear in 2022 that they were not writing blank cheques. “The government knows if they deviate from the tightrope they are walking, they won’t have external finance,” he added.\n\nOn Monday, the Pakistan Stock Exchange (PSX) gained a record 9pc — the restored calm in the market mirroring that in the region after the recent Pakistan-India ceasefire that boosted investor mood. “The market has reacted jubilantly to the ceasefire announcement after Pakistan established effective deterrence against India,” noted Yousuf M. Farooq, research director at Chase Securities.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:12:45.358Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910984/pakistan-pulled-off-a-macroeconomic-miracle-report",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T11:00:49.000Z"
}
