{
  "title": "If ceasefire is possible with India, why not with political rivals at home, asks PTI - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Imran leaves PAC chairmanship decision to Junaid\n• Party slams Modi’s warmongering\n\nISLAMABAD: PTI Chairman Barrister Gohar Ali Khan on Tuesday questioned the government’s unwillingness to initiate dialogue with political opponents, asking: “If a ceasefire is possible with India, why not with our own people?”\n\nSpeaking to the media, Mr Gohar also stres­sed that the international community should step in to facilitate negotiations betw­een Paki­stan and India, given the risks posed by tensions between the two nuclear-armed states.\n\n“Peace is essential for the region’s development,” he said, adding that PTI was ready to support any meaningful dialogue for the country’s betterment. He said that if an multi-party conference was convened by the government, the party’s political committee would consider participating.\n\nMr Gohar’s remarks came as PTI dealt with internal turmoil surrounding the resignation of Public Accounts Committee (PAC) Chairman Junaid Akbar. Although Mr Akbar had submitted his resignation, the party’s founding chairman Imran Khan, currently incarcerated in Adiala Jail, has left the final decision to him.\n\nThis was revealed by Imran Khan’s sister, Aleema Khan, following her meeting with Mr Khan on Tuesday. “Imran Khan suggested Junaid Akbar resign to focus on party matters in Khyber Pakhtunkhwa but said he could retain the PAC chairmanship if he could do justice to both roles,” she told reporters, stressing that Mr Khan had expressed confidence in Mr Akbar.\n\nOn the other hand, Mr Akb­ar confirmed that he had submitted his resignation to the party leadership but had also advised Barrister Gohar to consult Mr Khan for guidance before any final move. It could not be immediately confirmed if the resignation was received by the National Assembly Secretariat.\n\nMs Khan also criticised restrictions on PTI members seeking to visit Imran Khan in jail. “It is unfortunate that not all party members are being allowed to meet him,” she said.\n\nShe said the conflict with India was also discussed during her meeting with Mr Khan.\n\n“He told us that instant response was necessary on such occasions and at the time of war. He also suggested that the nation should remain alert as (Indian Prime Minister) Modi will definitely take revenge,” she said.\n\nPTI slams govt’s silence\n\nSeparately, PTI Central Infor­mation Secretary Sheikh Waqas Akram has condemned the continued aggressive, provocative and warmongering rhetoric of the Indian prime minister and called on the government to issue a loud and clear warning to the “supremacist Hindutva reg­ime” that any misadventure would be met with a response far more sev­ere and devastating than before.\n\nIn a statement, Mr Akram said PTI founder Imran Khan had stated that Pakistan’s armed forces’ befitting response not only boosted the morale of the nation but also uplifted the spirits of those behind bars.\n\nHowever, Mr Akram emphasised that Mr Khan had warned Pakistan to remain prepared for recurring episodes of aggression and potential conflict with India due to Modi’s deceitful and untrustworthy nature.\n\nHe pointed out that even after ceasefire agre­ements, Modi has continued to speak of a new normal that includes carrying out strikes inside Pakistan whenever an incident occurs in India. “This is not just rhetoric. It is a dangerous doctrine that threatens regional peace, and the silence of Pakistan’s current rulers on this issue is both irresponsible and disgraceful,” he added.\n\nHe asserted that Pakistan must convey in unequivocal terms that any dialogue with India is contingent upon the reversal of India’s illegal suspension of the Indus Waters Treaty and a firm commitment to resolving the Kashmir dispute in accordance with UN resolutions and the will of the Kashmiri people.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:03:13.206Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910919/if-ceasefire-is-possible-with-india-why-not-with-political-rivals-at-home-asks-pti",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:40:55.000Z"
}
