{
  "title": "Auto sales fall 5pc in April - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sales of cars, sports utility vehicles, pickups and vans clocked in at 10,596 units in April, reflecting a one per cent year-on-year (YoY) rise but a fall of 5pc month-on-month (MoM).\n\nThe decline was mainly due to the highway closure in Sindh, which delayed deliveries, while YoY rise was supported by a more stable macroeconomic environment, lower interest rates, easing inflation, and improving consumer sentiment. Additionally, new model launches and variant introductions were important in attracting demand.\n\nMyesha Sohail of Topline Securities said this takes 10MFY25 sales to 111,464 units, showing a 40pc YoY rise from 79,596 units.\n\nGiving company-wise breakup, she said Sazgar Engineering Works saw the highest MoM fall of 42pc while flattish YoY to sales of 549 units in April, which was due to the 10-day strike causing loss of production. Cumulatively, 10MFY25 sales were up 130pc YoY to 8,576 units from 3,723 in 10MFY24, thanks to the wide acceptance of the Haval brand in Pakistan.\n\nPak Suzuki Motor Company Ltd (PSMCL) posted a fall of 12pc MoM and 33pc YoY to 4,003 units in April 2025. A 30pc surge was recorded in PSMCL sales during 10MFY25 to 53,949 units compared to the same period last fiscal, she said.\n\nHonda Atlas Cars Ltd (HCAR) saw the highest MoM and YoY rise of 20pc and 70pc, respectively, reaching 1,707 units. Its 10MFY25 sales rose by 32pc to 14,383 units compared to the same period last fiscal.\n\nIndus Motor Company (IMC) recorded a 58pc YoY and 4pc MoM rise in sales followed by 58pc sales jump in July-April FY25 to 24,877 units.\n\nHyundai Nishat saw a 9pc YoY rise while a 5pc MoM drop to 900 units in April while its 10MFY25 sales went up by 18pc to 8,190 units.\n\nLaunched with much fanfare, the production and sales of Dewan’s Honri-VE (electric vehicle) remained nil during March and April 2025. The EV was launched in November 2024.\n\nThe two- and three-wheelers sales of PAMA members increased by 26pc YoY and 6pc MoM, totalling 135,721 units in April. Higher sales in this segment were attributed to the improved purchasing power amidst lower inflation. Myesha said this takes 10MFY25 sales to 1.2m units, a 30pc YoY rise.\n\nThe total tractor industry recorded sales of 1,602 units in April, showing a 48pc YoY fall and 4pc MoM. Tractor sales fell on a YoY basis due to weak farm economics. Total tractor sales fell by 36pc to 24,832 units in 10MFY25 compared to last fiscal year.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:03:12.112Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910904/auto-sales-fall-5pc-in-april",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:22:52.000Z"
}
