{
  "title": "Trump admin seeks immediate deportation of ‘dangerous’ migrants - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON/GENEVA: The Trump administration told the US Supreme Court on Monday that “dangerous behavior” from a group of Venezuelan migrants detained by the federal government in Texas justified lifting a court order blocking their immediate deportation.\n\nThe administration said in a court filing that 23 migrants at a Texas detention facility had “recently barricaded themselves in a housing unit for several hours and threatened to take hostages and harm ICE officers.” The Supreme Court last month temporarily blocked the government from deporting dozens of migrants after lawyers for the American Civil Liberties Union asked it to intervene on an emergency basis.\n\nThe administration’s filing said the 23 detainees behind the alleged disruption at the Bluebonnet Detention Facility in Anson, Texas, were moved to the Prairieland Detention Center in Alvarado, Texas, on May 4.\n\nPresident Donald Trump has invoked the 1798 Alien Enemies Act to swiftly deport accused members of Tren de Aragua, a criminal gang originating from Venezuelan prisons that his administration labels a terrorist group. The administration already has deported to a maximum-security prison in El Salvador more than 200 Venezuelan and Salvadoran men it claims are gang members.\n\nUN rights chief says expulsions raise ‘serious concerns’\n\nThe ACLU said the Alien Enemies Act historically has been employed only in wartime, and that the administration had not given the men a realistic opportunity to contest their removal.\n\nThe Supreme Court blocked the administration on April 19 from removing the detainees from the US until further notice from the court. Trump’s administration asked the high court to lift its order later that day.\n\nUS Solicitor General John Sauer told the justices in the administration’s Monday filing that the government should be allowed to deport at least some of the migrants immediately under other federal immigration laws. The government also said that moving the detainees to other US facilities “creates ongoing risks of prison recruitment and expansion of Tren de Aragua (TdA) gang activities within the United States.”\n\n‘Serious concerns’\n\nThe United Nations voiced alarm on Tuesday at the large numbers of non-nationals being deported from the United States, in particular the hundreds sent to a mega-prison in El Salvador.\n\n“This situation raises serious concerns regarding a wide array of rights that are fundamental to both US and international law,” UN High Commissioner for Human Rights Volker Turk said in a statement. His office pointed to US data showing that between January 20 and April 29, 142,000 individuals had been deported from the US.\n\nThe US Supreme Court and several lower courts have since temporarily halted deportations using the obscure law, citing the lack of due process. And yet, “the fate and whereabouts of at least 245 Venezuelans and some 30 Salvadorans removed to El Salvador remain unclear”, the UN rights office said.\n\nIt said it had received information from family members and lawyers regarding more than 100 Venezuelans believed to be held in CECOT, where it decried reports of very harsh conditions.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:13:15.576Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910913/trump-admin-seeks-immediate-deportation-of-dangerous-migrants",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:23:05.000Z"
}
