{
  "title": "Petrol prices expected to come down soon; relief for KE subscribers likely - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: With up to 14 per cent reduction in regasified liquefied natural gas (RLNG) prices notified for the current month, the electricity rates for Karachi and petroleum prices across the country are expected to come down in coming days.\n\nWith a reduction of Rs3 to Rs7 per litre in major oil products estimated for the next fortnight, the Oil and Gas Regulatory Authority (Ogra) on Tuesday notified a 14pc reduction in the price of RLNG on Tuesday for sales at the transmission stage by the two Sui gas companies for the current month.\n\nThe Karachi-based Sui Southern Gas Company Ltd (SSGCL), which serves consumers in Sindh and Balochistan, has seen its system losses at the distribution stage drop from 16.16pc to 10.6pc.\n\nOn the other hand, the Lahore-based SNGPL, which provides gas to consumers in Punjab and Khyber Pakhtunkhwa, saw its system losses at the distribution stage drop to 7.47pc from 8.6pc until February this year.\n\nAccording to a notification, the RLNG’s sale price for SNGPL at the transmission stage has been cut by 12.42pc to $11.026 per million British thermal unit (mmBtu) for May against $12.59 per mmBtu in April.\n\nOgra notifies 14pc cut in RLNG price\n\nThe sale price at distribution stage for SNGPL was reduced by 12.51pc to $11.79 per mmBtu for the current month, against $13.48 per mmBtu last month.\n\nOn the other side, the RLNG sale price for SSGCL has been decreased at transmission stage by 13.62pc to $9.74 per mmBtu for May, against $11.27 per mmBtu in April. The sale price at the distribution stage for the company was also reduced by 13.64pc to $10.87 per mmBtu instead of $12.59 per mmBtu last month.\n\nThe Ogra said the reduction in RLNG price was due to a decline in the delivered price on ship for both companies.\n\nThe overall decrease in absolute terms for SSGC’s transmission price amounted to $1.53 per mmBtu, while reduction at distribution stage was $1.72 per unit.\n\nThe reduction in RLNG price for SNGPL during transmission was reported at $1.56 per mmBtu and $1.69 per unit for distribution.\n\nIronically, the RLNG distribution prices for SSGCL $10.87 per mmBtu and $11.79 per mmBtu for SNGPL are almost $2.74 and $3.66 per mmBtu higher than the Pakistan State Oil’s $8.13 per mmBtu average delivered price ex-ship (DES), respectively.\n\nThis is mainly because of the fact that both LNG importers — PSO and Pakistan LNG Ltd (PLL) — and port authorities also charge profit margins on account of retainage and margins at the rate of 3.15pc and 3.1pc of DES price, respectively, on top of 7.4pc losses of SNGPL and 10.6pc losses of SSGCL.\n\nThe basket RLNG price was based on a total of 10 cargoes for May, all under two LNG contracts between PSO and Qatar Gas at an average of about $8.13 per mmBtu — six cargoes at $7.24 and four cargos at $9.48 per mmBtu. Pakistan LNG Ltd (PLL) did not import any cargo this month as it deferred cargos for the current month owing to demand crash.\n\nPetroleum prices\n\nOn the other hand, the prices of petrol and diesel are estimated to fall by about Rs3.5 and Rs7 per litre for the next fortnight ending May 31, owing to a decline in the international market and a slight ease in import premium on petrol. This relief is, however, subject to unchanged tax rates.\n\nBased on existing tax rates, informed sources said, the ex-depot price of petrol was estimated to go down by about Rs3.5, depending on final calculation on May 15, followed by a Rs7 per litre cut in high speed diesel (HSD).\n\nThe estimates for lower petrol price stem from about $1.5 per barrel decline in international price of petrol and about $3 per barrel in HSD over the past two weeks. The ex-depot petrol price currently stands at Rs252.63 per litre. Petrol is mostly used in private transport, small vehicles, rickshaws and two-wheelers and has a direct bearing on the budget of middle and lower-middle class.\n\nThe ex-depot price of high speed diesel (HSD) stands at Rs256.64 per litre.\n\nKE petition\n\nIn a formal petition, K-Electric has, however, requested the National Electric Power Regulatory Authority (Nepra) not to pass on entire benefit to consumers, and instead, set aside partial benefit to clear its past claims.\n\nThe company has already claimed Rs14.6bn past dues on account of partial load, startup costs, plant degradation and open cycle operations for the period between July 2023 and March 2025. Nepra has already set aside Rs9.4bn by disallowing full benefit of fuel cost reduction to consumers between November 2024 and January 2025.\n\nA public hearing is scheduled for May 22.\n\nMeanwhile, the electricity rates for consumers of K-Electric have also become entitled to Rs5.02 per unit refund next month on account of fuel cost adjustment for March, with a total financial benefit of Rs6.8bn.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/14111831373c902.gif",
  "retrievedAt": "2025-10-12T03:04:05.354Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910906/petrol-prices-expected-to-come-down-soon-relief-for-ke-subscribers-likely",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:22:52.000Z"
}
