{
  "title": "Students protest teachers’ shortage in Shangla school - Pakistan - DAWN.COM",
  "author": null,
  "content": "SHANGLA: Students of a government girls’ middle school in Larai area of Kana tehsil along with their parents staged a demonstration at the Alpuri Chowk here on Tuesday against the shortage of teachers.\n\nThe students carried placards and banners inscribed with their demands and chanted slogans demanding appointment of teachers to the school to save their future.\n\nThe students said that their education and future were at risk because the lone teacher was also not coming to the school.\n\n“We travel from remote village, and our only demand is for the government to send teachers to our school so that we can receive an education, which is our basic right,” said Laiba Khan, a 6th grader.\n\nShe said that they went to school every day, waited for the teacher all day, and then returned home without studying.\n\nHaji Mohammad Jan, father of a student, said they had repeatedly requested the education department’s local officials and the district administration to appoint teachers to the school, but the issue had not been taken seriously.\n\nHe noted that the school had been facing a shortage of teachers for several years, and now the only remaining teacher was also not attending, directly affecting the students’ time and education.\n\nPir Zada, another participant of the protest, claimed that the education department had neglected schools in rural areas and was focusing only on major parts of the district.\n\nHe emphasised that their children also had the right to education and should not be ignored by the authorities. He urged the department to ensure the provision of quality education for all children.\n\n“If there are no teachers at the school, who will teach our children. Certainly, their future will remain in the dark, and they will grow up without education,” he regretted.\n\nLater that day, the district administration officials held negotiations with the parents. Following the talks, district education officer Parveen Rehman issued orders for the appointment of two teachers to the girls’ school.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6823c7bf5fed0.jpg",
  "retrievedAt": "2025-08-23T14:13:01.214Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910810/students-protest-teachers-shortage-in-shangla-school",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:23:31.000Z"
}
