{
  "title": "President, premier salute martyred soldiers - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Presi­de­nt Asif Ali Zardari and Prime Minister Shehbaz Sharif on Tuesday saluted the brave sons of Pakistan Army and Pakistan Air Force who sacrificed their lives for the country’s security.\n\nPresident Asif Ali Zar­d­ari, in a statement, said India’s blatant aggression had further united and strengthened the Pakistani people, and that the entire nation and its armed forces were always ready to respond to India’s hostility.\n\nHe paid tribute to those martyred as a result of unp­r­ovoked Indian aggre­ssion against Pakistan and said that the entire nation salu­ted the brave sons of the Pakistan Army and Pak­i­stan Air Force (PAF) who sacrificed their lives for the country’s security. He expr­essed grief over the loss of precious lives, inclu­ding children and women, during the Indian attacks.\n\nHe also extended condolences to the families of those who lost their lives and prayed for their patie­nce and strength, and swift recovery of the injured.\n\n“We are proud of the sacrifices of our martyrs. Our brave forces have successfully defended the nation and the country’s integrity. Through Operation Bunya­num Marsoos, our brave forces shattered the enemy’s arrogance,” he added.\n\nIndia’s illusion\n\nMeanwhile, Prime Mini­ster Shehbaz Sharif, in a st­­atement, paid tribute to the martyrs, of what he had des­cribed as “Youm-i-Mar­ka-i-Haq” (Battle of Truth Day) and said thro­ugh the Ope­ration Bunya­num Mar­soos, Pakis­tan’s armed for­ces shattered In­­dia’s illusion of nume­rical strength and arrogance.\n\nThe prime minister saluted the families of those who sacrificed their lives for the nation.\n\nHe paid tribute to five officers and personnel of the PAF and six officers and soldiers of the Pakistan Army who were martyred while defending the homeland.\n\nExpressing grief over the martyrdom of 40 innocent civilians, including 15 children and seven women, as a result of Indian aggression, he said: “We have not forgotten the martyrs of the nation, nor will we do so, and their families will never be left alone.”\n\n“We not only defended the country with full force but also ensured that the sovereignty and integrity of Pakistan remained unscathed. The brave officers and soldiers of the Pakistan armed forces fulfilled their promise to the nation to protect the motherland,” he added.\n\nPM Shehbaz reiterated that a “Martyrs’ Package” had already been announ­ced and the state would fully support the martyrs’ families.\n\nHe prayed to the Allah Almighty for elevation of the martyrs’ ranks, patience for their families and early recovery of the injured.\n\nPublished in Dawn, May 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:04:00.494Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910918/president-premier-salute-martyred-soldiers",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T01:40:55.000Z"
}
