{
  "title": "Straining to hear Zardari speak, govt members ‘ignore’ PTI din - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The opposition on Monday — in keeping with tradition — did its best to drown out President Asif Ali Zardari’s address to a joint sitting of parliament on Monday.\n\nWhile television broadcasts of the speech kept the cameras pointed at the dignitaries on the dais or the treasury benches, the noisy protests and slogans could be heard during the president’s speech.\n\nIn the National Assembly chamber, members of the PTI kept hooting, shouting, desk-thumping and chanting slogans throughout the address. Many were holding posters of PTI’s jailed founder Imran Khan.\n\nThe PTI members’ din was so loud that it compelled government members — including Prime Minister Shehbaz Sharif, whose seat is right next to the opposition front bench — to use headphones to hear President Zardari speak.\n\nAlthough present in the house, Achakzai and JUI-F members did not join PTI’s noisy protest\n\nLeader of the Opposition Omar Ayub, who was sitting across the aisle from the prime minister, kept on banging his desk with a book throughout the speech.\n\nWith the treasury members straining to concentrate on his words, no one really reacted to the noisy protest by the opposition.\n\nThe occasion also offered a chance for leading state functionaries to interact. More than half of the members of both houses of parliament were present in the session, which was jointly presided by President Zardari, National Assembly Speaker Ayaz Sadiq and Senate Chairman Yousuf Raza Gilani.\n\nPunjab Chief Minister Maryam Nawaz, Sindh Chief Minister Murad Ali Shah, Balochistan Chief Minister Sarfraz Bugti, Azad Jammu and Kashmir Prime Minister Chaudhry Anwarul Haq were also in attendance, alongside a whole host of foreign diplomats.\n\nCM Maryam, seated in the visitors gallery that faces the opposition benches, seemed to become a target for their verbal attacks. Indeed, opposition lawmakers spared no chance to provoke her through their sloganeering.\n\nBut this didn’t seem to faze the Punjab CM, who was busy greeting the men and women who came to her seat to pay their regards.\n\nDespite the shouting by opposition mem­­bers, President Zardari remained steadfast and continued to deliver his speech till the end.\n\nAlthough Pashtoonkhwa Milli Awami Party (PkMAP) leader Mehmood Khan Achakzai and members of the Jamiat Ulema-i-Islam-Fazl (JUI-F) were also seated on the opposition benches, they did not join the PTI’s protest.\n\nPTI dissident and former Khyber Pakhtunkhwa (KP) chief minister Pervaiz Khattak, who recently became an adviser to the prime minister, seemed unwelcome among ruling party members, as he was seen sitting on quite far away from the frontline PML-N leadership.\n\nBefore the start of the presidential address, PM Shehbaz Sharif went over to PPP Chairman Bilawal Bhutto-Zardari to shake hands, and also paid his regards to Bilawal’s younger sister, Aseefa, who was seated nearby.\n\nSecurity arrangements for the address were quite strict, and a large number of sergeants-at-arms manned the entrances to the NA hall, ready to tackle any untoward situation.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cf7bf9a082a.gif",
  "retrievedAt": "2025-10-12T01:53:57.509Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897170/straining-to-hear-zardari-speak-govt-members-ignore-pti-din",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:56:34.000Z"
}
