{
  "title": "Sania Nishtar’s Senate seat finally declared vacant - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Se­­nate seat of former special assistant to the prime minister on poverty alleviation and social safety, Dr Sania Nishtar, was finally declared vacant after an inordinate delay of over five months.\n\nSenator Dr Sania Nish­tar has resigned from her seat by writing under her hand addressed to the Chair­man of Senate. Con­sequen­tly, her seat has become vacant in terms of Clause 1 of Article 64 of the Constitution with effect from March 10, a notification issued by the Senate Secretariat says.\n\nThe notification was iss­ued two days after Leader of the Opposition in the Senate, Syed Shibli Faraz, raised the issue of the de­­l­ay in accepting Dr Nish­­tar’s resignation during the House proceedings.\n\nAs he congratulated Asad Qasim on becoming Senator on a seat vacated by his father Qasim Roon­jho, Mr Faraz said that Roonjho’s resignation had instantly been ac­­cepted and the schedule to fill the va­­c­ancy was immediately announced.\n\n“Perhaps, we are the children of a lesser God,” he remarked, recalling that the resignation of PTI Senator Dr Sania Nishtar submitted on Sept 18 last year is yet to be accepted.\n\nA copy of the notification besides others has also been sent to Chief Election Commissioner for taking steps to fill the vacancy. Dr Nishtar had submitted her resignation after joining a Geneva-based international organisation.\n\nShe served as a special assistant to PM from May 2019 to April 2022, enjoying the status of a federal minister. During the time, she also rem­ained the chairperson of Ehsaas programme, the flagship social safety net and poverty alleviation programme of the PTI government.\n\nShe was elected to Senate from KP in the 2021 Senate elections. Dr Nishtar is the chief executive officer (CEO) of Gavi, a vaccine alliance. She is an internationally acclaimed public health and development expert having a degree in medicine.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/10/311020579e9b534.jpg?r=102358",
  "retrievedAt": "2025-08-25T15:06:42.942Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897167/sania-nishtars-senate-seat-finally-declared-vacant",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:56:34.000Z"
}
