{
  "title": "President’s address splits lawmakers along party lines - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Lawmakers were split along party lines after the address by President Asif Ali Zardari to a joint session of parliament, with opposition leaders claiming that the speech did not reflect his stature as the head of the state, while treasury members described the opposition party’s sloganeering during the speech as ‘unfortunate’.\n\nNational Assembly Opposition Leader Omar Ayub alleged that the president did not say a ‘single positive thing’ in his speech and claimed that President Zardari was selling the water of Sindh. The PTI leader was referring to a government plan to build canals in Cholistan despite PPP’s reluctance.\n\n“The fact is that the prices have increased compared to the Pakistan Tehreek-i-Insaf government. Exports have been reduced and the Special Investment Facilitation Council (SIFC) has failed to deliver,” he claimed.\n\nPTI interim chairman Barrister Gohar Ali Khan said that the speech “did not look like a speech of a person who was the head of the state”. He said the president did not bother interacting with the opposition lawmakers before his address and it did not behove him as the state head.\n\nPTI’s Gohar says Zardari did not even interact with them before address; treasury members term opposition’s attitude ‘unfortunate’\n\n“Senator Ejaz Chaudhry and MNA Mian Ghous were not produced even in joint session,” the PTI leader said. Senator Shibli Faraz, meanwhile, said that the house was incomplete and its legislation did not carry ‘legal sanctity’.\n\nThe government lawmakers, however, appreciated the address and called out the PTI for its unruly behaviour.\n\nPML-N leader Pervaiz Rashid said that it looked like the PTI was protesting against parliament.\n\n“Parliament has not punished Imran Khan. Even if parliament passes a resolution in favour of Imran Khan, only the judiciary can provide him relief,” he said about the incarceration of the PTI founder in the Adiala jail.\n\nPML-N minister Tallal Chaudhry suggested that the PTI should focus on peace rather than protests. “It is the responsibility of the provinces to maintain peace and ensure law and order situation in the provinces. Punjab has maintained peace, but Khyber Pakhtunkhwa has badly failed. Even the Counter Terrorism Department of KP is in a rented building,” he claimed.\n\nPML-N leader Dr Zulfiqar Bhatti said that the opposition should not have protested against the president of Pakistan. “President Zardari talked about the prosperity of Pakistan and it should be appreciated,” he said.\n\nPPP leader Agha Rafiullah said the PTI protest during the address was unfortunate. “They should have listened to the speech of the president and then given the response,” he said.\n\nPTI legislator Shandana Gulzar said that during the session, the PTI asked in the house why bullets were fired on its supporters at D-Chowk. “The country has been suffering because of the policies of the incumbent government,” she said.\n\nSenator Humayun Mohmand said that those who took the ‘wrong route’ to come to power, even their good policies, will be considered wrong.\n\nMeanwhile, MNA Zartaj Gul mentioned the absence of the army chief from the joint address, saying President Zardari should be asked why Gen Asim Munir did not attend the gathering. She said that the PTI was ready to launch a movement against the government and hoped that it would kick off after Eid.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/11104936a1c96fb.png",
  "retrievedAt": "2025-10-12T01:53:34.732Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897169/presidents-address-splits-lawmakers-along-party-lines",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:56:34.000Z"
}
