{
  "title": "150 shops gutted in Karachi fire triggered by gas cylinder explosion - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A huge fire triggered by a cylinder explosion in an eatery on Monday afternoon destroyed 150 shops of a timber market on Superhighway, officials said.\n\nThey said that the fire rapidly spread from the restaurant to the nearby timber shops and engulfed the whole market near Maymar Mor.\n\nNo one was hurt in the incident.\n\nRescue-1122 official Hassaan Khan told Dawn that a gas cylinder exploded in the kitchen of the ‘Chakar Hotel’, which erupted in flames that engulfed a nearby gas filling shop.\n\nThe blaze spread quickly to the bushes and woods stacked outside shops dealing in timber, and it engulfed the whole market in no time.\n\nThe official said that eight fire tenders reached the scene and managed to control the blaze after hectic efforts lasting for several hours.\n\nHe said they received information about the fire at around 12:20pm. He said initially they sent two fire tenders and one ambulance. Later, realising the gravity of the problem, four more fire tenders along with two water bousers and four ambulances reached the spot and took part in the fire-fighting efforts.\n\nThe official said the blaze was controlled at 5:15pm. However, cooling work continued till late in the evening.\n\nHe said that the exact financial losses could not be determined immediately, but estimated that they would run into millions of rupees. Meanwhile, the Edhi Foundation said that the family of six girls killed in a roof collapse incident in Afghan Camp collected their bodies for burial on Monday.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cf6e9674e17.gif",
  "retrievedAt": "2025-08-25T15:06:34.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897129/150-shops-gutted-in-karachi-fire-triggered-by-gas-cylinder-explosion",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:57:17.000Z"
}
