{
  "title": "Palestinian detained for leading anti-Israel rallies at US varsity - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: Immigration officers have arrested a leader of the protests at Columbia University against Israel’s conflict in Gaza, authorities said on Sunday, after US President Donald Trump vowed to deport foreign pro-Palestinian student demonstrators.\n\nMahmoud Khalil, one of the most prominent faces of the university’s protest movement that erupted in response to Israel’s conduct of the conflict, was arrested on Sunday, the Department of Homeland Security (DHS) said on X. The agency said the action was taken “in support of President Trump’s executive orders prohibiting anti-Semitism, and in coordination with the Department of State.”\n\nTrump said that the detention of Mahmoud Khalil is “the first arrest of many to come.” “We know there are more students at Columbia and other Universities across the Country who have engaged in pro-terrorist, anti-Semitic, anti-American activity, and the Trump Administration will not tolerate it,” Trump wrote on his Truth Social platform.Trump threatened in his post further action against other campus protesters, some of whom he alleged without evidence to be “paid agitators.” “We will find, apprehend, and deport these terrorist sympathisers from our country — never to return again,” he wrote.\n\nPresident Trump says Mahmoud Khalil’s arrest is a first, with ‘many more to come’\n\nThe Student Workers of Columbia Union said in a statement that Khalil had been detained on Saturday, describing him as “a Palestinian recent Columbia graduate and lead negotiator for last spring’s Gaza solidarity encampment.”\n\nUS campuses including Columbia’s in New York were rocked by student protests against Israel’s conflict in Gaza following the Oct 7, 2023 Hamas attack. The demonstrations ignited accusations of anti-Semitism. Protests, some of which turned violent and saw campus buildings occupied and lectures disrupted, pitted students protesting Israel’s conduct against pro-Israel campaigners, many of whom were Jewish.\n\nUS Secretary of State Marco Rubio wrote on X that “we will be revoking the visas and/or green cards of Hamas supporters in America so they can be deported.” Khalil, who remains in immigration enforcement detention, held permanent residency at the time of his arrest prompting thousands of people to sign a petition calling for his release, the union statement added.\n\n“We are also aware of multiple reports of Immigration and Customs Enforcement agents accessing or attempting to access Columbia campus buildings on Friday and Saturday, including undergraduate dorms,” the union said. Columbia did not directly address Khalil’s arrest in response to inquiries, but in a statement said “there have been reports of ICE in the streets around campus.”\n\n“Columbia has and will continue to follow the law. Consistent with our longstanding practice and the practice of cities and institutions throughout the country, law enforcement must have a judicial warrant to enter non-public University areas, including University buildings,” Columbia said. In its post on X, the DHS said Khalil “led activities aligned to Hamas, a designated terrorist organization,” without further details.\n\nTrump railed against the student protest movement linked to the conflict in Gaza, and vowed to deport foreign students who had demonstrated. He also threatened to cut off federal funding for institutions that he said were not doing enough to combat anti-Semitism.\n\nHis administration announced Friday it was cutting $400 million in federal grants to Columbia University, accusing it of failing to protect Jewish students from harassment.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/11101130550faf8.jpg",
  "retrievedAt": "2025-08-25T15:06:34.028Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897145/palestinian-detained-for-leading-anti-israel-rallies-at-us-varsity",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:57:03.000Z"
}
