{
  "title": "Pildat suggests reactivating National Security Committee role as premier civil-military forum - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan Ins­titute of Legislative Develop­ment and Transparency (Pildat) has called for reactivating and enhancing the role of National Security Committee (NSC) as a premier civil-military forum on security policy deliberations.\n\nThe annual performance evaluation of the National Security Committee (NSC) conducted by Pildat for the time frame from March 5, 2024, to March 4, 2025, highlights a disturbing trend in Pakistan’s governance structure.\n\nThe NSC, which was establis­h­­ed in 2013 as the primary for­u­­m for national security decision-making, did not convene a single meeting during the entire year. The 2024-25, therefore, be­­came the first year since the formation of the NSC when the co­­mmittee did not meet even once.\n\nWhile the federal cabinet regularly meets, there is no indication either that the Cabinet Committee on Defence which provided such a forum before the creation of NSC, has been re-operationalised.\n\nThink tank points out the committee has not met for a year\n\nHistorically, the NSC served as the country’s principal platform for civil-military consultations on security affairs. The committee’s effectiveness has varied under different administrations, with some governments convening regular meetings and others ignoring its role.\n\nFormer PM Nawaz Sharif, during his tenure from 2013-17, convened eight NSC meetings, while Shahid Khaqan Abbasi (during his tenure of August 2017-May 2018) significantly increased the frequency, averaging nearly 10 meetings per year.\n\nImran Khan, former prime minister (2018-22), averaged approximately three NSC meetings annually, whereas Shehbaz Sharif, in his previous tenure from 2022 to 2023, convened an average of five meetings per year.\n\nHowever, in the past year (2024) of the current PML-N-led coalition government, which took office in March 2024, the NSC has not met a single time. The absence of NSC meetings is also reflected in the government’s responses to security incidents.\n\nInstead of convening the NSC, the government seems to have relied on military-led for­ums such as the Corps Com­m­a­nders Conference and the Apex Committee of the National Act­ion Plan. This has further sidelined the NSC’s role in structured policymaking.\n\nPildat observed that Pakis­tan’s lack of an institutionalised national security approach wea­kens democratic oversight and limits the country’s ability to respond effectively to security threats through structured consultations.\n\nIt noted that neglect of the NSC and the rise of non-traditional forums may lead to a lack of coordination and coherence in national security policymaking and this, in turn, can exacerbate existing security challenges and create new ones.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:53:33.954Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897166/pildat-suggests-reactivating-national-security-committee-role-as-premier-civil-military-forum",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:56:34.000Z"
}
