{
  "title": "Supreme Court recognises women’s role in rule of law, access to justice - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chief Justice of Pakistan (CJP) Yahya Afridi on Monday said his institution recognises and rejoices the invaluable contributions made by women in law in general and women judges in particular in upholding the rule of law and ensuring access to justice.\n\nIn a statement in connection with the International Women’s Day, he said the increasing presence of women in the judicial profession marks not only gender equity but also exhibits that Pakistan was a progressive and liberal democracy acknowledging the potential of its citizens and endeavouring to harness the potential.\n\nIt strengthens public confidence in the legal system and fosters meaningful inclusivity, fairness and a broader perspective in decision making. Their resilience, integrity, and dedication to justice have not only enriched our jurisprudence but have also set inspiring precedents for future generations, the statement said.\n\n“As we mark this occasion, we proudly acknowledge the progress made in promoting gender equality within the justice sector while energising us to do still more. The judiciary remains steadfast in its resolve to create an enabling environment where women legal professionals can thrive, contribute, and lead without barriers.\n\nChief justice says increasing presence of women in judiciary shows gender equity and progressive, liberal democracy in Pakistan\n\n“Let us continue to work towards a justice system that reflects diversity and strength of our society, ensuring that access to justice is not just a promise but a stark reality for all,” the CJP said.\n\nMeanwhile, the Supreme Court on Monday signed MoUs with the Lahore University of Management Sciences (Lums) and Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (GIKI) to enhance judicial efficiency, transparency and technological advancement.\n\nThe MoUs were signed by SC Registrar Mohammad Salim Khan, Professor Dr Tariq Jadoon on behalf of Lums and Professor Dr Mohammad Hanif from GIKI in the presence the CJP at the Supreme Court.\n\nThis collaboration aims to develop a litigant-feedback scorecard to assess public satisfaction with court services and improve transparency. It also focuses on enhancing citizen engagement by adopting modern communication tools, ensuring greater accessibility for litigants and the general public.\n\nThe MoUs will also strengthen IT capacity within SC through specialised training programmes in collaboration with the Federal Judicial Academy, covering key areas such as Agile methodology, cybersecurity, data analytics and emerging technologies. A comprehensive assessment will identify existing skill gaps and targeted training programmes will equip SCP’s IT team to handle new technologies and infrastructure effectively.\n\nAdditionally, the partnership will establish a central repository of IT best practices, troubleshooting guides and standard operating procedures (SOPs) to streamline digital operations within the SCP.\n\nAnnual perception surveys will be conducted to evaluate public and stakeholder views on judicial efficiency and transparency with the findings serving as a foundation for judicial reforms.\n\nThe MoUs also include provisions for SCP to receive expert support in strategic hiring, including job announcements, shortlisting, and candidate evaluation to ensure the appointment of top-tier professionals.\n\nSpeaking on the occasion, the CJP emphasised the significance of the collaboration in modernising the judicial system and stated, “This partnership with Lums and GIKI marks a pivotal step toward integrating technology-driven solutions for an efficient, transparent and people-centric judiciary.”\n\nProfessor Jadoon and Professor Hanif reaffirmed their commitment to supporting the apex court in the transformative journey, highlighting the importance of academic collaboration in advancing judicial processes and governance.\n\nThe MoUs will remain in effect until 2027 with the possibility of extension based on mutual agreement.\n\nMeanwhile, a delegation comprising representatives from the High Court Bar Associations of Islamabad, Rawalpindi and Bahawalpur, along with the District Bar Association Sargodha met the CJP who emphasised the indispensable role of the bar in the judicial system.\n\nHe reiterated that the dispensation of justice was a collaborative effort, requiring the cooperation of the legal fraternity. He assured the delegation that legal practitioners had been actively engaged in decision-making processes, including representation on a provincial basis in the Law and Justice Commission of Pakistan. Additionally, a dedicated slot has been allocated for bar councils to contribute their insights and expertise.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/1111330037f79e5.jpg",
  "retrievedAt": "2025-10-12T01:53:49.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897101/supreme-court-recognises-womens-role-in-rule-of-law-access-to-justice",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:57:50.000Z"
}
