{
  "title": "When you leave, you want to leave Indian team in better place: Kohli - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: Star batter Virat Kohli said on Sunday his job is not just to win ICC trophies but also ensure that Indian cricket is at a better place when he walks into the sunset, as the team won a third Champions Trophy title with a four-wicket victory over New Zealand, the Press Trust of India news agency reported.\n\n“When you leave, you want to leave the team in a better place, I feel we’ve a squad that’s ready to take on the world for the next eight years,” an ecstatic Kohli said after the end of the final.\n\nWhile Kohli was out for one in the final, his match-winning hundred against Pakistan and a composed half-century against Australia in the semi-final went a long way in India’s title triumph.\n\n“It’s been amazing, we wanted to bounce back after a tough Australian tour, and wanted to win a big tournament, so to win the Champions Trophy is amazing,” Kohli told broadcasters.\n\nHe then explained that as one of the senior-most players in the team, he also has to focus on grooming the Next-Gen.\n\n“So much talent in the dressing room, they’re trying to take their game further and we’re just happy to be of help (role of the seniors), sharing our experience and that’s what makes this Indian team so strong.”\n\nHe loved that the final went the distance as India completed a chase of 252 with six balls to spare.\n\n“These are the things you want to play [for titles], playing under pressure and putting your hand up.”\n\nHe was happy that the title win was a fantastic team effort.\n\n“The whole team, everyone has put their hands up sometimes or other [during the course of the tournament], everyone has put up impactful performances, we’ve been part of an amazing team, the amount of work we’ve done in the practice sessions, it feels great [to win].\n\n“Shubman [Gill] has been outstanding, Shreyas [Iyer] has played some top knocks, KL [Rahul] has finished games and Hardik [Pandya] has been superb with the bat.”\n\nGraceful in triumph, Kohli didn’t forget to praise the New Zealand side for the fight that they have put up.\n\n“We’ve always been in awe with what they can do, the limited number of players in the talent pool, but they just execute plans so well, they keep playing the kind of cricket that keeps them very much in the game.\n\n“They’re always been attacking and supportive of the bowlers, Credit to them, easily the best fielding unit, sad to see a very good friend of mine to be on the losing side [on Kane Wiliamson].\n\n“But they’re always so good and they keep doing the basics well. That’s what makes them such a competitive unit,” Kohli concluded.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cf6f4f624f1.gif",
  "retrievedAt": "2025-10-12T01:53:21.589Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897131/when-you-leave-you-want-to-leave-indian-team-in-better-place-kohli",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T02:56:45.000Z"
}
