{
  "title": "PCB accuses ICC of sidelining it from Champions Trophy - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Cricket Board (PCB) has lodged a formal protest against the International Cricket Council’s (ICC) failure to include its representative in the post-match ceremony of the Champions Trophy final.\n\nDespite the presence of PCB’s Chief Operating Officer Sumair Ahmed Syed — who was also the director of the tournament — at the Dubai International Cricket Stadium during the decider between eventual winners India and New Zealand on Sunday, the official didn’t feature among the dignitaries featured in the ceremony.\n\nThe PCB has called out what it believes to be “blatant disregard for Pakistan’s role as the host nation” by the ICC.\n\n“A formal complaint has been lodged with the ICC, demanding an explanation and a public apology,” the board’s spokesperson told Dawn on Monday. “We are appalled by this blatant disregard for Pakistan’s role as the host nation.\n\nBoard formally complains to cricketing body over slew of ‘blunders, double standards’ and incidents of ‘selective governance’\n\n“The ICC’s decision to exc­lude Mr Syed — who was both the Tournament Director and the PCB Chair’s designated representative — violates its own standard operating procedure,” the board said.\n\n“This is a matter of principle, fairness, and respect for the game’s global stakeholders.”\n\nMr Syed had attended the final in place of PCB Chairman Mohsin Naqvi, who was initially invited by the ICC, but was unwell and couldn’t travel.\n\nWhile the ICC, in its responses to media queries argued that its “protocol is for the board’s president, vice president, chairman or CEO to be on the stage”, it seemed to have ignored the fact that the PCB didn’t have a CEO, and the COO is considered to have the same stature as second in command to the chairman.\n\nThe ICC’s argument also seems weak, given that the secretary of the Board of Control for Cricket in India (BCCI) Devajit Saikia was also on the stage along with his predecessor and incumbent ICC president Jay Shah and BCCI president Roger Binny.\n\nThe PCB views the incident as one of ICC’s “repeated blunders”, one of which was the absence of Pakistan’s name in the Champions Trophy’s official logo on the live feed of the group stage match between India and Bangladesh, as well as the Indian national anthem being played in the Gaddafi Stadium ahead of the Australia-England game.\n\n“The ICC’s repeated blunders, double standards, and selective governance have cast serious doubts over its credibility,” the PCB spokesperson said. “By sidelining the host nation at its own tournament, the governing body has once again shown a troubling lack of neutrality and fairness.\n\n“We have demanded a full public clarification and an assurance that such biased and unjust treatment will not happen again.\n\n“The PCB expects professionalism, transparency, and equal representation from cricket’s governing body.\n\n“The PCB has made its stance clear: This is not just about a presentation ceremony — it is about respect, integrity, and the fundamental principles of fair governance in international cricket.\n\n“The world is watching. Will the ICC finally uphold professionalism, or will it continue to cater to selective interests at the cost of cricket’s global integrity?”\n\nIndia played all their matches in Dubai — with hosts Pakistan forced to compromise a semi-final and the final — following the Indian government’s refusal to let its team travel across the border citing security concerns.\n\nThe decision led to scheduling problems while also allowing India to have one base while other teams had to adjust their travel itineraries accordingly.\n\nPublished in Dawn, March 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cfaa4f28101.jpg",
  "retrievedAt": "2025-08-25T15:06:16.495Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897181/pcb-accuses-icc-of-sidelining-it-from-champions-trophy",
  "dateList": "2025-03-11",
  "date_published": "2025-03-11T03:15:11.000Z"
}
