{
  "title": "Pakistan reschedules Khunjerab Pass opening in April after China’s Coronavirus outbreak",
  "link": "https://www.app.com.pk/national/pakistan-reschedules-khunjerab-pass-opening-in-april-after-chinas-coronavirus-outbreak/",
  "date_published": "2020-01-30T04:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):Pakistan on Thursday announced to open Khunjerab Pass with China in April, instead of its previous decision for an early opening, following outbreak of Novel Coronavirus.\nForeign Office Spokesperson Aisha Farooqui at a weekly press briefing, said the opening of the crossing point at Pak-China border would now take place according to routine plan.\nAs per agreement between Pakistan and China, the Khunjerab Pass is closed in November due to heavy snowfall and reopens in April.\nThe spokesperson said the change of decision for an early opening of border was part of health safety measures.\nShe said Pakistan was in constant touch with the Chinese authorities to ensure safety of its nationals and the contact persons of Pakistan embassy were available at hotline for any assistance.\nShe said Pakistan embassy in Beijing had contacted all students registered in its database, while those not registered, were appealed to approach dedicated telephone lines.\nOf stranded Pakistanis in Urumqi, the spokesperson said the reason was delay in flight, however the Chinese authorities had been requested to arrange accommodation till next available flight.\nShe said the government had set up a technical core committee with all stakeholders to regularly monitor the situation and make immediate plans to prevent the spread of Novel Coronavirus. The National Institute of Health has has already issued an advisory and alert on Novel Coronavirus to all provincial health departments and especially points of entry including airports and border crossings.\nAisha Farooqi mentioned the statement of Foreign Minister Shah Mehmood Qureshi, who extended every possible assistance to China to help deal with the aftermath of Coronavirus.\nThe foreign minister, she said, made monumental efforts to deal with Coronavirus and also providing assistance to all including Pakistani citizens.\nThe FO Spokesperson Aisha Farooqui said Pakistan condemned continuous human rights violations in Indian Occupied Jammu and Kashmir and expected from the international community to take cognizance of the situation.\nShe said India must lift curfew from the residents of the Valley and immediately restore internet and communication services.\nShe pointed out that India was indulged in a constant jingoism and war hysteria against Pakistan, adding that Bharatia Janta Party (BJP) in power made attempts to divert world’s attention from its racist approach.\n“No one should under-estimate the resolve of the people, government and armed forces to effectively thwart any aggression against Pakistan,” she said.\nShe termed as “media speculation” any plan for merger of Azad Kashmir and Gilgit Baltistan with Pakistan in response to India’s unilateral act of revoking special status of Kashmir on August 5, 2019.\n“The constitutional status of Kashmir remains the same,” she categorically said.\nAbout a protest by a group of people at a road leading to Pakistan embassy in Kabul, Afghanistan, she confirmed the incident, however said the consular section was working as per normal routine.\nOn U.S. President Donald Trump’s recently announced peace plan for Palestine and Israel, she said Pakistan reiterated its earlier stance of supporting a two-state formula as enshrined in the United Nations Security Council’s resolutions and stressed an independent State of Palestine with Al-Quds as its capital.",
  "retrievedAt": "2025-08-11T18:43:10.894Z"
}
