{
  "title": "PM launches ambitious ‘Ehsaas Kafaalat’ programme for socio-economic empowerment of poor women",
  "link": "https://www.app.com.pk/national/pm-launches-ambitious-ehsaas-kafaalat-programme-for-socio-economic-empowerment-of-poor-women/",
  "date_published": "2020-01-30T00:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):Prime Minister Imran Khan will formally launch the ambitious “Ehsaas Kafaalat” programme on Friday for socio-economic empowerment of the poor women.\nUnder the programme, Rs 2,000 per month stipend will be paid to the most deserving and poorest women across the country through a digital payment system based on transparent mechanism. All existing eligible beneficiaries of the Benazir Income Support Programme (BISP) will continue to be part of Kafaalat.\nAccording to a press release of the PM Office Media Wing issued here Thursday, total number of expected Kafaalat beneficiary women are around seven million . Enrolling of one million families in 70 districts have begun and these families will start receiving Kafaalat stipends from February to March 2020.\nComing under the umbrella of Ehsaas, the Kafaalat will realise the Prime Minister’s longstanding commitment to “Money for Rations” and ‘One Woman, One Bank Account’.\nAll beneficiaries will be able to access the payments at special ATMs and bank branches, and will also have to option to deposit funds into a savings account.\nThe Kafaalat programme, which will help in empowering the women economically, is also a financial inclusion initiative as each woman will get a bank account, under the Prime Minister’s “One Woman One Bank Account” initiative, which will pave the way for their formal interaction with the economy.\nThrough a parallel Ehsaas policy initiative, women will get better access to smartphones, as a step towards digital inclusion, the press release said.\nKafaalat is part of the wider Ehsaas programme, hence women will have better access to opportunities to graduate themselves out of poverty.\nMore beneficiary families will be added through desk registration over the course of the year while other districts will be covered by end of the year and\nBeneficiaries will be identified through a household survey and through Ehsaas NADRA Desk Registration Centers assisted by sms and Kafaalat web-service. At least one desk registration center has been established in each Tehsil, the press release added.",
  "retrievedAt": "2025-08-11T18:43:04.648Z"
}
