{
  "title": "Firdous stresses proper projection of PM’s initiatives by media",
  "link": "https://www.app.com.pk/national/firdous-stresses-proper-projection-of-pm-initiatives-by-media/",
  "date_published": "2020-01-30T04:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):Special Assistant to the Prime Minster on Information and Broadcasting Dr. Firdous Ashiq Awan on Thursday called upon the media to properly project the austerity initiatives of Prime Minister Imran Khan.\nTalking to media outside the Parliament House, she specifically pointed out a fake news about increase in PM’s remuneration and added Prime Minister Imran Khan took the initiative to reduce expenditures of PM House with its strict implementation.\nShe said the Prime Minister was spearheading an extensive campaign to drastically reduce expenditures and added fake news was misleading one and an attempt to distract the attention from his actions in the best national interest.\n“Prime Minister Imran has set a new precedent of curtailing extravagant expenditure and ensuring simplicity” said Firdous Ashiq Awan adding the Prime Minister took concrete steps to save discretionary funds.\nShe said in the past Prime Ministers used to take cronies on their official foreign tours whereas PM Imran Khan boarded commercial flights to extensively reduce the cost.\nShe said Prime Minster Imran Khan opted to stay at his own house instead of using official residence in PM House, adding some anchors indulged in misinforming and misguiding\nthe people.\nShe advised them to refrain from misguiding the people and apprise them of PM’s initiatives in the national interest.\nAbout PM Imran Khan’s recent trip to Davos, the SAPM said Ikram Sehgal was associated\nwith a think-tank which had sponsored the prime ministers and ministers in the past to project Pakistan at international forums and added the issue was blown out of proportion.\nShe said Ikram Sehgal had organized specific meetings in the past and once former Prime\nMinister Nawaz Sharif was barred from addressing international economic forum because of\ncorruption charges against him.\n“We don’t want to involve international Pakistani diaspora in our local politics” said Firdous\nAshiq Awan.\nShe said Governor State Bank of Pakistan had announced the increase in export support fund and added it was portrayed out of context.\nShe said State Bank of Pakistan had given relaxation in the loans by June 2020 to the\nexporters which was part of PM’s vision of ‘ease of doing business.’\nShe said that a comprehensive legislation was under discussion with different media\norganizations to provide relief to the working journalists.",
  "retrievedAt": "2025-08-11T18:43:10.763Z"
}
