{
  "title": "Maryam got Rs 560 mln kickbacks from New Islamabad Airport contractor: Shahzad Akbar",
  "link": "https://www.app.com.pk/national/maryam-got-rs-560-mln-kickbacks-from-new-islamabad-airport-contractor-shahzad-akbar/",
  "date_published": "2020-01-30T03:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):Special Assistant to the Prime Minister (SAPM) on Accountability Barrister Shahzad Akbar Thursday said Mian Munir, father-in-law of Maryam Nawaz’s daughter and a contractor of New Islamabad Airport, transferred kickbacks of Rs 560 million in to the bank accounts of Maryam’s Chaudhry Sugar Mills.\nMian Munir’s Technical Associates, which was among the three contractors of New Islamabad Airport, also transferred Rs 50 million in the account of Shujaat Azeem, advisor to then prime minister Nawaz Sharif, in June 2015, he said while addressing a press conference.\nThe Chaudhry Sugar Mills, whose 45 percent shares were owned by Maryam Nawaz, he said, was further benefitted in May 2017, when Technical Associates transferred Rs 310 million more into its accounts using various bank accounts.\nLikewise in December 2017, Rs 250 million was transferred into its account, he added.\nThe SAPM said interestingly Nawaz Sharif, who had declared assets of Rs 1.3 million, established the Chaudhry Sugar Mills having over Rs 5.6 billion assets in 1991. He questioned as to how he had set up the mill with meager assets.\nShahzad Akbar said former finance minister Ishaq Dar had established offshore company Chadron Jersey Limited in 1991 in the United Kingdom and France, which obtained loan of $15 million from the Faysal Investment Bank for importing plants and machinery for the Chaudhary Sugar Mill. However, the machinery manufactured by the Ittefaq Foundary was installed, for which Rs 398 million was loaned again by the Faysal Investment Bank. He said special permission was obtained from the State Bank of Pakistan to transfer $20 million abroad into the accounts of Chadron Jersey. According to the investigation agencies, transactions to the effect were made to the United Kingdom from 1995 to 1999.\nThe Chaudhry Sugar Mill apparently had no resources to pay such huge loans, while that amount was stashed abroad, he added.\nAccording to the website of World Bank’s Star Programme, Nawaz Sharif was the real owner of Chadron Jersey Limited, which had the same address like his nine offshore companies involved in money laundering, surfaced in the Panama Papers, the SAPM said.\nHe said Ishaq Dar got opened six fake accounts in Bank of America, now Standard Chartered Bank, by using the passports of Qazi family and deposited $ 15.37 million (of Nawaz Sharif ) in them. Those accounts were in 1994 were shifted to Faysal Bank and on their collateral, Rs 80 million loan was obtained for the Chaudhry Sugar Mills. Ishaq Dar also got loan of Rs 35 million loan from the same bank, which also financed Rs 70 million to the Hamza Board Mills Limited.\nHe said Ishaq Dar had confessed in 2000 that the Qazi family had no links with the accounts opened in their names.\nShahzad Akbar said Khawaja Zubair Ahmed of Pak Punjab Carpets obtained Rs 65 million loan from the National Bank of Pakistan and the Mehran Bank, which was transferred into the accounts of Chaudhary Sugar Mills. The loan swelled to Rs105 million due to mark-up and was written off by the State Bank of Pakistan in 1998, he added.\nHe said $15.37 million deposited in the Qazi family’s fake accounts were laundered to Dubai. Former National Bank of Pakistan president Saeed Ahmed had also laundered $3.75 million to Dubai, he added.\nA fake foreign telegraphic transfer (TT) of $19 million in the name of Siddiqua Syed, he said, was credited to the accounts of the Chaudhary Sugar Mills in 1998. Likewise in 2001, another TT of $1.25 million in the name of Saudi national Hani Ahmed was also transferred to accounts of Chaudhary Sugar Mills.\nSimilarly, he said, a TT of $1.25 million in the name of Nasir Abdullah Lootha was credited to the accounts of Ramzan Sugar Mills in 2001, which was transferred into the accounts of Chaudhary Sugar Mills in 2008.\nAnother TT of Rs 33 million using the name of Makhdoom Umer Shehryar (Lahore), he added, was also transferred into the account of Chaudhary Sugar Mills in 2011. The TT was sent in the name of Umer from Dubai.\nHe said the investigators had detected that the proceeds of three fake loans were transferred into the accounts of the Director Chaudhary Sugar Mills in 2010.\nThe SAPM said in 2010, Hassan Nawaz, younger son of Nawaz Sharif, got $ 1 million loan from the Chaudhary Sugar Mills, for which he was not qualified as he had tendered resignation as its director in 1995.\nHe said despite having no resources, Yousaf Abbas Sharif transferred Rs 1 billion from 2010 to 2018, and Abdul Aziz Abbas Sharif Rs 30 million in 2013 into the accounts of Chaudhary Sugar Mills as loans.\nLater the investigations revealed that the amounts were transferred into their accounts through TTs from Dubai, he added.",
  "retrievedAt": "2025-08-11T18:43:00.370Z"
}
