{
  "title": "FM meets Kenya counterpart in Nairobi; signs MoU for cooperation in training of diplomats",
  "link": "https://www.app.com.pk/national/fm-meets-kenya-counterpart-in-nairobi-signs-mou-for-cooperation-in-training-of-diplomats/",
  "date_published": "2020-01-29T23:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):The Ministries of Foreign Affairs of Pakistan and Kenya on Thursday signed a Memorandum of Understanding (MoU) for cooperation in training of diplomats.\nThe MoU pertaining to the two countries’ Foreign Service Academies was signed by Foreign Minister Shah Mehmood Qureshi and his Kenyan counterpart Ambssador Ray Chellea Omamo in Nairobi.\nThe MoU will enable diplomats from the two countries to benefit from each other’s experiences regarding modern training.\nA number of diplomats from African countries have already got training from Pakistan’s Foreign Service Academy.\nThe two foreign ministers described the signing of MoU as an important step towards further promotion of bilateral ties.\nEarlier, Foreign Minister Shah Mehmood Qureshi and Foreign Minister of Kenya Ambassador Ray Chellea Omamo also had a bilateral meeting in Nairobi during which they discussed bilateral ties, promotion of political and economic cooperation as well as other matters of mutual interest.\nForeign Minister Qureshi congratulated Ambassador Ray Chellea Omamo on the assumption of the office of Foreign Minister of Kenya.\nHe said Pakistan valued its relations with African countries including Kenya, which was the gateway to eastern Africa.\nThe Foreign Minister briefed his Kenyan counterpart about the salient features of Pakistan’s “Engage Africa” vision.\nHe said that after China, Kenya was the biggest market for Pakistani products, adding, Pakistan’s white rice was liked in Kenya while tea imported from Kenya was very famous in Pakistan.\nThe Foreign Minister said that the holding of Trade Conference in Nairobi was reflective of Kenya’s importance for Pakistan in particular and that of Africa in general.\nHe told the Kenya Foreign Minister said that Speaker National Assembly of Pakistan was intending to visit Kenya, Rwanda and Uganda in March 2020.",
  "retrievedAt": "2025-08-11T18:43:04.877Z"
}
