{
  "title": "AJK PM for increase in defense budget following Indian PM, Army Chief’s provocative statements",
  "link": "https://www.app.com.pk/national/ajk-pm-for-increase-in-defense-budget-following-indian-pm-army-chiefs-provocative-statements/",
  "date_published": "2020-01-29T23:58:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jan 30 (APP):Azad Jammu Kashmir Prime Minister Raja Farooq Haider Khan on Thursday called for immediate increase in the defense budget of the country following Indian prime minister and Army Chief’s provocative statements and threats to Pakistan and liberated territory of AJK.\nSharing his views on different resolutions moved by the members on the floor of the AJK legislative assembly session held in the State’s metropolis on Thursday, Raja Farooq Haider said Indian Prime Minister Narendra Modi and Army Chief Manoj Mukund Naravane’s recent threats to attack Azad Kashmir are highly condemnable and should not be taken lightly.\n“It could be possible that such threats were being used as a tool to win upcoming elections in Delhi and another state in India. However, Narendra Modi in his election manifesto had pledged to revoke the special status of the Occupied Jammu and Kashmir (IOJ&K) and revenge of Pulwama incident. He fulfilled his both commitment made with his people, although there was no human loss in the Indian airstrike”, he commented.\nThe Prime Minister warned that India is consistently enhancing its military might and tried to exert pressure on the neighboring countries particularly Pakistan by its armed exercise on January 26. “Pakistan is the only hurdle in Indian expansionist designs and her access to the central and eastern region”, he added.\nRaja Farooq Haider asked the members of the House to pass a special resolution regarding Indian provocative statements and threats. “It would be sent to the government of Pakistan”, he directed.\nReferring to the ongoing relief and rehabilitation operations in the calamity hit areas of the state; he told the House that government has increased the compensatory amount for the family of the deceased in the tragedy from Rs 150,000 to Rs 400,000.\nHe lauded the role of Pak Army, NDMA, SDMA, police, civil administration, local volunteers for effectively responding the recent natural calamity.\nThe prime minister said,”We couldn’t stop the occurrence of natural disasters. However, we can mitigate the vulnerabilities of affected population through rapid response.”\nHe also expressed profound gratitude to national and international humanitarian organizations, donor agencies including WHO, WFP and others for extending their support in rescue, relief and rehabilitation efforts.\nReferring to the IOJ&K situation, Raja Farooq Haider said that his heart was aching while seeing the Indian atrocities and barbarism in the held valley.\nHe said it was high time to adopt a unanimous narrative over Kashmir to appraise the world about the sensitivity of the issue.",
  "retrievedAt": "2025-08-11T18:43:05.157Z"
}
