{
  "title": "Pak, Saudi FMs discuss Israeli attacks, grave HR violations in Gaza",
  "link": "https://www.app.com.pk/national/pak-saudi-fms-discuss-israeli-attacks-grave-hr-violations-in-gaza/",
  "date_published": "2021-05-14T16:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Foreign Minister Shah Mahmood Qureshi Friday contacted Saudi counterpart Prince Faisal bin Farhan Al Saud and expressed Pakistan’s serious concerns on the situation in Palestine, storming of the Al-Aqsa Mosque and grave human rights violations.\nHe condemned the continued attacks by the Israeli Defence Forces against the Palestinians, in particular innocent civilians and children. He viewed that the Israeli acts defied all norms of humanity and international law.\nForeign Minister Qureshi recalled the Pakistan-Saudi Arabia Joint Statement issued during the recent visit of the Prime Minister to the Kingdom, on May 8, 2021, which, inter alia, included the two countries’ shared perspective on the Palestinian issue.\nThe foreign minister reaffirmed Pakistan’s full support for the legitimate rights of the Palestinian people, especially their right to self-determination and establishment of their independent state with pre-1967 borders and East Jerusalem as its capital, in accordance with the Arab Peace Initiative and relevant UN resolutions.\nFM @SMQureshiPTI contacted Saudi FM @FaisalbinFarhan to discuss the grave situation in Palestine, expressed Pakistan’s serious concerns on storming of Al-Aqsa Mosque & grave human rights violations, & condemned continued attacks by Israeli Defence Forces against Palestinians. 1/3\n— Spokesperson  MoFA (@ForeignOfficePk) May 14, 2021\nThe Saudi foreign minister expressed concerns at the serious developments in Palestine and briefed Foreign Minister Qureshi regarding the initiatives being taken to address the situation.\nForeign Minister Qureshi welcomed the initiative of the Kingdom of Saudi Arabia to convene an Emergency Meeting of the OIC’s Executive Committee at Foreign Ministers level on May 16, 2021.\nThe foreign minister assured the Saudi counterpart of Pakistan’s unequivocal support for the just cause of Palestine.\nExpressing gratitude for the warm Saudi hospitality during the prime minister’s recently concluded visit, Foreign Minister Qureshi apprised his counterpart of the post-visit telephone call between Imran Khan and the Saudi King Salman bin Abdul Aziz, during which the two leaders also conferred on the serious situation in Palestine and the need for urgent steps to address it.\nThe two foreign ministers agreed to continue close consultations and coordination on the evolving situation in Palestine.",
  "retrievedAt": "2025-08-11T20:43:38.401Z"
}
