{
  "title": "Qureshi urges Afghan parties for efforts to achieve permanent ceasefire",
  "link": "https://www.app.com.pk/national/qureshi-urges-afghan-parties-for-efforts-to-achieve-permanent-ceasefire/",
  "date_published": "2021-05-14T15:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Foreign Minister Shah Mahmood Qureshi Friday welcomed the recently announced Eid ceasefire by the Afghan parties and emphasized the continuous efforts for a permanent truce.\nThe foreign minister received a telephone call from Afghan counterpart Mohammad Haneef Atmar wherein they exchanged greetings on the auspicious occasion of Eid-ul-Fitr.\nForeign Minister Qureshi conveyed wishes for a happy and joyous Eid-ul-Fitr for the brotherly people of Afghanistan.\nHe underscored that the Intra-Afghan Negotiations provided a historic opportunity to achieve an inclusive, broad-based and comprehensive political settlement in Afghanistan for ending the 40-years long conflict.\nHe also reaffirmed Pakistan’s support to the Afghan Peace Process.\nForeign Minister @SMQureshiPTI received a telephone call from the Afghan FM @MHaneefAtmar. The two FMs exchanged greetings on the auspicious occasion of #EidUlFitr . 1/3@mfa_afghanistan @PakinAfg\n— Spokesperson  MoFA (@ForeignOfficePk) May 14, 2021\nThe two foreign ministers exchanged views about the current situation in Palestine and agreed to remain in contact on the issue.\nForeign Minister Qureshi condemned the indiscriminate use of force and attacks by Israeli forces in Al-Aqsa and Gaza and called for protection of civilians. He underscored the need for the international community to take urgent steps to address the grave situation in the occupied territories.\nThe foreign minister reaffirmed Pakistan’s support and solidarity with the Palestinian people and for a just and lasting solution of the issue in accordance with relevant UNSC resolutions and international legitimacy.\nThey also agreed to maintain high-level bilateral exchanges and work together for further consolidation of Pakistan-Afghanistan relations.",
  "retrievedAt": "2025-08-11T20:43:39.789Z"
}
