{
  "title": "Over 7 mln needy population being assisted under ‘Ehsaas Kafalat Program’: Sania Nishtar",
  "link": "https://www.app.com.pk/national/over-7-mln-needy-population-being-assisted-under-ehsaas-kafalat-program-sania-nishtar/",
  "date_published": "2021-05-14T08:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation Dr Sania Nishtar on Friday said that currently over 7 million needy population of Pakistan are being looked after under ‘Ehsaas Kafalat Program’ and ‘Ehsaas payment system’ to be fully digitalization till the month of September 2021.\n“Opening biometric ATMs and bank branches for the Ehsaas beneficiaries would be a major feature of the new Ehsaas digital payment system”, she said while talking to a private news channel.\nShe said Ehsaas is focusing on accountability and impact which laid the foundations for becoming a globally leading exemplar on how to tackle poverty.\nShe said Ehsaas team, under the strong leadership of Prime Minister Imran Khan has made huge progress in delivering a multi-dimensional poverty alleviation program within recent years, she added.\nSania further mentioned that the federal government is also introducing targeted subsidies for Ehsaas beneficiaries in Utility Stores Corporation of Pakistan (USC) and karyan stores from next month under Ehsaas program.\nShe said needy people would now get subsidize rate items from USC outlets which is another milestone step to facilitate needy segment of society.\nNishtar said the process of IT integration is now seamlessly working, and this will enable USC to identify Ehsaas beneficiaries giving them targeted subsidies on certain food items.\n“Targeted subsidies would only be given on selected essential commodities”, she said, adding, targeted subsidization is more beneficial for pro-poor economic welfare.\nReplying to a question, she said Ehsaas Langar scheme would be further expanded to the rest of country for ensuring that no one goes to bed hungry, adding, Ehsaas Langar program was launched in accordance with the wishes of PM Imran Khan.\nShe said that government is affording all expenses of Langar Khanas, adding, Ehsaas Langar Scheme is one of the projects of the federal government’s Ehsaas Program that aims to combat hunger throughout the country.\nShe said government is currently taking all those practical measures to narrow the gap between the rich and the poor to develop social harmony in the country.\nShe said the Prime Minister has strictly directed the department to ensure provision of free food and shelter to every needy person in the country.",
  "retrievedAt": "2025-08-11T20:43:42.397Z"
}
