{
  "title": "NCOC shows serious concern on rising COVID-19 positivity ratio",
  "link": "https://www.app.com.pk/national/ncoc-shows-serious-concern-on-rising-covid-19-positivity-ratio/",
  "date_published": "2021-03-13T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP): The National Command and Operation Center (NCOC) on Saturday showed serious concern over sharp rise in national positivity of COVID-19 which was visible, and hovering around 5-6 percent.\nThe special NCOC morning session was held to take a review of rising disease trends here, chaired by Federal Minister for Planning, Development and Special Initiatives Asad Umar.\nThe Forum noted that the rising disease trend was a matter of serious concern where the major contributors were Punjab, Islamabad Capital Territory (ICT) and few cities of KP and AJK.\nThe Forum was briefed that all federating units were asked to take immediate actions for strict implementation of Standard Operating Procedures (SOPs).\nThe Forum also lauded the steps taken by Punjab for disease control.\nHowever, further steps for disease control including expanded lock downs in various cities of Punjab including Islamabad and certain cities of KP were also under consideration.\nThe Forum also discussed spread of new virus strains in the country.\nThe Forum also considered further restrictions on international travel from certain countries with high prevalence of South African and Brazilian virus.\nThe Forum said the decision would be taken after consultation with all stake holders.\n“SOPs implementation week will be implemented across the country from today onwards,” the Forum underscored.\nThe Forum said the citizen were requested to once again display good example of social behavior and follow COVID related SOPs for collective wellbeing.\nThe Forum mentioned that vaccination drive for elderly population was going on since March 10.\n“Senior Citizen are encouraged to get themselves vaccinated from designated vaccination centers,” it added.\nThe Forum requested the provinces to ensure smooth continuation of vaccination drive for health care workers and elderly citizen.",
  "retrievedAt": "2025-08-11T20:29:09.308Z"
}
