{
  "title": "Begum Samina Alvi highlights importance of gender equality for national development",
  "link": "https://www.app.com.pk/national/first-lady-highlights-importance-of-gender-equality-for-national-development/",
  "date_published": "2021-03-13T11:07:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 13 (APP): Begum Samina Alvi, here on Saturday called for meaningful engagement of women, constituting more than 50 percent of the country’s population, to give a boost to national development including economic activities.\nAddressing a seminar titled “Status of Gender Equality in Pakistan” organized in connection with International Day by Women by All Pakistan Women’s Association (APWA), she said prosperity could only be attained by ensuring equal rights to women and addressing their issues related with social status and financial security.\n“To help materialize the dream of forming a model Islamic Welfare state and development of Pakistan , it is vital to guarantee equal rights to women”, she said adding that development goals could not be achieved when over 100 million women of the country were kept out of economic activity and lack of basic facilities.\nNo state could develop without indispensable contribution of entire work force in economic activities proactively, she said adding, it was imperative that all segments of society work harmoniously.\nShe urged on creating opportunities for inclusion of women and differently abled persons in education, health and various sectors of economy and said joint and coordinated efforts would help establish an inclusive society.\nShe further informed that a project for street children was under consideration.\nShe appreciated State Bank’s measures and policies aimed at women empowerment and suggested that such policies must be widely publicized so that women could be facilitated through them at grass root level.\nShe urged upon media and opinion makers to impart awareness about women rights\namong people enabling the women folk to get their rights.\n“Any form of violence against women either inside or outside of home should be discouraged for providing the female a safe and protective environment”, Samina Alvi said and stressed upon male to support their women.\nBegum Samina Alvi said lack of proper health care and hygiene awareness was the major cause of high mortality rate due to breast cancer in Pakistan.\nShe appreciated APWA for its services in education, health, rights and empowerment of women saying Pakistan women had always worked shoulder to shoulder with male and were eager to play their due role for progress of the country",
  "retrievedAt": "2025-08-11T20:29:12.252Z"
}
