{
  "title": "Opposition’s seven votes “beauty of democracy” boomeranged in Chairman election: Murad Saeed",
  "link": "https://www.app.com.pk/national/oppositions-seven-votes-beauty-of-democracy-boomeranged-in-chairman-election-murad-saeed/",
  "date_published": "2021-03-13T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP): Federal Minister for Communications and Postal Services Murad Saeed on Saturday said that opposition termed the rejection of seven votes in the National Assembly a beauty of democracy but now they started hue and cry on the rejection of seven votes in the Senate.\nAddressing a press conference here, he congratulated the nation and PTI workers on winning the Senate Chairman and Deputy Chairman elections. He said once again it had been proved that PTI was the only party which represented all federating units while opposition parties including PML-N and PPP had became regional parties.\nThe minister said that opposition was exposed during Senate elections as they opposed open balloting , adding that the Charter of Democracy was, in fact, the “Charter of Robbery.” He said that opposition parties had come into politics for making money.\nMurad Saeed said that the government introduced amendments in the relevant laws in the Parliament and also approached the apex court for open balloting, but the opposition parties opposed it.\nThe minister said that instead of following the constitution and the court directives,  Gilani preferred the protection of Zardari and his plunder.\n“Yousuf Raza Gilani also stole the necklace of the Turkish president’s wife donated for the flood victims”, he said. He said that Gilani’s son was caught doing what was his ancestral profession, adding that Gilani’s children had also been involved in big scandals.\nHe said that opposition formed Pakistan Democratic Movement (PDM) for seeking National Reconciliation Ordinance (NRO) but they failed to get it.\nThe minister strongly condemned the statement of PML-N during a press conference after Senate Chairman elections. He said that nation was hurt with the statement.\nHe said that Prime Minister Imran Khan desired the country to move towards progress and prosperity, by eliminating the old system which had ruined the economy, ethics and democratic norms.\nThe minister said that earlier people had rejected PDM in each city of the country and now they were also rejected in the elections of Chairman Senate and Deputy Chairman Senate.\nHe said that Bilawal Bhutto Zardari became the chairman on a “Parchi” and Maryam Nawaz was the daughter of Nawaz Sharif who was disqualified from the courts, adding that the opposition were not in politics to protect national interest but to protect their corruption.\nMurad Saeed  said that transparency in the system was the only way forward to put the country on the right track.\nHe said that Prime Minister Imran Khan had always propagated transparency in the system throughout his 22-year long struggle and we were committed to implement his vision.\nThe minister said opposition parties in the name of PDM, staging a drama in the country and were on the roads after they failed to get an NRO.\nHe urged the opposition not to destabilize the country at the cost of protecting their illegal assets. The minister also urged them to make constructive criticism on real issues instead of doing blame game against the national institutions.\nCounting on PTI’s concrete steps to facilitate the less privileged segments of the society, he said apart from health insurance scheme in Khyber Pakhtunkhwa and Punjab,  Ehsaas program had been launched to protect the vulnerable segments of the society.\nHe said first time in the history, our government provided landmark stimulus package during the pandemic. He said “We will continue our struggle for safeguarding the interests of common man through legislative and administrative measures.”",
  "retrievedAt": "2025-08-11T20:29:09.842Z"
}
