{
  "title": "Media professionals to realize impact of their contribution on masses: President",
  "link": "https://www.app.com.pk/national/media-professionals-to-realize-impact-of-their-contribution-on-masses-president/",
  "date_published": "2021-03-13T15:32:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 13 (APP):President Arif Alvi here on Saturday said media with the capacity to shape public perception, for good or bad, about range of issues must be fully cognizant of the impact they create on the world in general and their targeted communities in particular.\nTalking to a delegation of Karachi Editors Club (KEC) in a meeting held at Sindh Governor House, he said media could actually change global scenario.\nIn particular context of Pakistan, he agreed that proper training in the field of journalism was a crucial requirement but emphasized that concepts of morality and accountability must also be inculcated among the professionals as well as students of journalism.\nIt is of the high value in a situation where print media (news paper industry) was fast losing its space while importance of NEWS and information was ever growing with electronic and social media meeting the public requirement.\nPresident Alvi iterated need for social media regulations in the country with due consideration towards media ethics, adding that collective responsibility lies upon all concerned stakeholders to bring about the much cherished social change.\nHe urged KEC members to make use of their experience and help improve skills\nof students and young journalists on professional lines with equal consideration towards moral values.\nThe President also suggested that Karachi Council of Editors, said to be also playing a think tank role, might contribute towards addressing the issue of women empowerment and other social challenges country was being faced with.\nThe KCE delegation led by its President Mubashir Mir included Manzar Naqvi, Habib Khan Ghauri, Mukhtar A Butt, Mujahid Barelvi, Agha Masood Hussain, Fizza Shakil, Hameeda Bhutto, Alveena Agha, Khursheed Hyder, Mubashir Zaidi, Naeemuddin, Abrar Bakhtiar, Javed Shamsi, Muhammad Arifeen and other senior professionals associated with the media industry.\nMubashir Mir suggested reactivation of Pakistan Press Council with the hope that it might address a number of issues related to false reporting, ethics, morality and professionalism in the field.\nThe delegation sought government support to help KCE stream line the online media\nworkshops it had introduced during first phase of COVID 19.\nOpportunities for senior journalists as visiting faculty at different public sector was also recommended.\nThe delegation also suggested nomination of senior journalist Agha Masood Hussain for national award by the federal government.",
  "retrievedAt": "2025-08-11T20:29:05.895Z"
}
