{
  "title": "PM Advisor meets Punjab CM, discusses political situation",
  "link": "https://www.app.com.pk/national/pm-advisor-meets-punjab-cm-discusses-political-situation/",
  "date_published": "2021-03-13T15:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 13 (APP):Advisor to the Prime Minister on Accountability and Interior Barrister Shehzad Akbar met Punjab Chief Minister Sardar Usman Buzdar on Saturday and discussed with him matters of mutual interest, political and other important issues.\nThe duo congratulated the recently elected chairman and deputy chairman Senate on their victory. Usman Buzdar and Shehzad Akbar also congratulated Prime Minister Imran Khan on the success of the government candidates in the Senate elections.\nBoth the leaders strongly condemned the attempts of the Pakistan Democratic Movement (PDM) to make the institutions controversial. Usman Buzdar pledged that no one would be allowed to malign the national institutions and those who were involved in the attempt were not the well-wisher of the country.\n“We are standing with our national institutions and will always support them. The corrupt gang humiliates itself by trying to do politics on non-issues,” he said.\n“This gang has faced disgrace earlier and it will meet the same fate in future as well,” he said adding that every nefarious design of the gang would be foiled.\nUsman Buzdar said that the elimination of corrupt elements and qabza mafia from Punjab wad his mission and added that the state land worth billions of rupees had been vacated during the last two years besides taking indiscriminate action against the Qabza Mafia, and the crackdown would continue.\nThe process of public service would be further expedited, he promised.\nShehzad Akbar said that giving respect to the institutions was mandatory for all and targeting the institutions under a specific agenda was a deplorable act.\nThe corrupt politicians had no future and frustrated opposition could not hoodwink the people, he added.",
  "retrievedAt": "2025-08-11T20:29:08.905Z"
}
