{
  "title": "Senate passes “Torture and Custodial Death (Prevention and Punishment) Bill, 2021",
  "link": "https://www.app.com.pk/national/senate-passes-torture-and-custodial-death-prevention-and-punishment-bill-2021/",
  "date_published": "2021-07-12T14:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): The Senate on Monday passed “The Torture and Custodial Death (Prevention and Punishment) Bill, 2021” to define ‘torture, custody and custodial deaths’ inflicted by any person, police or law enforcement agency, under the Pakistan Penal Code (PPC).\nThe bill, moved by Senator Sherry Rehman, was also supported by Minister for Human Rights Dr Shireen Mazari.\nLeader of the House Dr Shahzad Waseem said that the government always supported the opposition in legislation in favor of public.\nAccording to the statement of objects and reason of the bill “Custodial torture and deaths” was a world-wide phenomenon inflicted upon individuals irrespective of gender, religion, financial status, or health conditions.\nThe statement said this type of violation of human rights was alarming in Pakistan where brutal atrocities were perpetuated by police and other law enforcement agencies.\nIt said Pakistan needed to make torture and custodial deaths criminal as an important step in stemming widespread abuse and exploitation.\nThe existing provisions of Pakistan Penal Code stipulated penalties for certain acts of torture under related offenses such as ”causing hurt to extort confession or to compel restoration of property”, “ Wrongful confinement to extort confession or compel restoration of property”, or provisions governing “criminal force and assault.”\nHowever, these provisions were either vague or not comprehensive enough to be used for criminalizing torture, or custodial deaths.\nThis amendment in the PPC provided definition for “torture”, “Custody”, and “custodial deaths” inflicted by any person, police, or law enforcement agency.\nMoreover, the custodial deaths were proposed to be dealt under the offense of Qatl e amd (Section 300 of PPC.\nThe House also referred the four bills to concerned committees for further deliberation.\nThe bills included the Prevention of Corruption Act, 1947 [The Prevention of Corruption (Amendment) Bill, 2021], the Establishment of Ibadat International University, Islamabad [The Ibadat International University Islamabad Bill, 2021].\nThe Bill to provide for the regulation of employment of domestic workers in Islamabad Capital Territory [The Islamabad Capital Territory Domestic Workers Bill, 2021] and a Bill further to amend the National Commission on the Status of Women Act, 2012 [The National Commission on the Status of Women (Amendment) Bill, 2020] were also referred to concerned committee.\nThe Senate of Pakistan also referred a bill to make amendments in Rule 9 and insertion of Fourth Schedule in the Rules of Procedure and Conduct of Business in the Senate. The bill was moved by Mian Raza Rabbani.",
  "retrievedAt": "2025-08-11T20:57:44.029Z"
}
