{
  "title": "A Pakistani in Japan reaching out to homeless, detained foreigners",
  "link": "https://www.app.com.pk/national/a-pakistani-in-japan-reaching-out-to-homeless-detained-foreigners/",
  "date_published": "2021-07-12T18:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 12 (APP): Haroon Qureshi, a Pakistani, who had arrived in Japan as a student some 30 years ago, is reaching out to those living on the margins of society.\nAccording to a report published in Mainichi, the national daily of Japan, Qureshi, a businessman hailing from Pakistan, helped homeless as well as those foreigners who have been detained by immigration authorities after failing to win refugee status.\nBesides, he is also deeply involved in the running of a mosque in Tokyo, Otsuka Masjid.\nAccording to Japanese daily, Qureshi’s efforts began as soon as he arrived in Tokyo to study computer programming in 1991, when he began giving away food to the homeless in his neighbourhood in the capital’s Kita Ward.\n“Now, three decades on, he has enlisted Japanese university students in his goodwill endeavors, seeing their involvement as a vital part of raising society’s awareness of the plight of the less fortunate,” it said.\nCalling the public’s attitude to the homeless “cold,” Qureshi, 55, said he believed there was a lack of understanding in Japan of why people ended up on the streets.\n“The reality is that many times the homeless suffer from mental health issues and cannot fit into society,” the daily quoted him as saying.\nSo far, Qureshi had involved students from Tokyo-based Keio and Toyo universities in his activities, which included serving meals to the needy.\nIn collaboration with Tenohasi in Tokyo’s Ikebukuro area, students and volunteers from the mosque recently helped in providing food to over 360 people.\n“Today I witnessed a stark difference between normal people who were walking on the streets all dressed up, and those who had come to get food here,” the daily quoted Satoru Soejima, 18, who is studying Arabic at Keio University.\nQureshi, meanwhile, also leads another project called Food Bank to help the students themselves, some of whom have gone hungry after losing part-time work because of the coronavirus pandemic.\nQureshi, a soft-spoken man, has also been helping those detained after their failed asylum bids since around 2000.\nIn one month, Qureshi received around 30 letters on average seeking help from detainees, mostly from countries in Africa or elsewhere in Asia.\n“We may have different religions, colour or race. But I request everyone to try and feel the pain of other members of this huge (human) family, and do what they can,” Qureshi opined.",
  "retrievedAt": "2025-08-11T20:57:38.433Z"
}
