{
  "title": "PM for third-party vigilance in completion of Punjab development projects",
  "link": "https://www.app.com.pk/national/pm-for-third-party-vigilance-in-completion-of-punjab-development-projects/",
  "date_published": "2021-07-12T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 12 (APP): Prime Minister Imran Khan on Monday directed to adopt scientific means and the third-party vigilance to monitor the completion of development projects in Punjab.\nChairing a meeting through video-link here on Punjab Development Package, the prime minister said the officials of all district and relevant departments would be held responsible for timely completion of the projects.\nThe prime minister stressed to put special focus on the development package at district level to ensure provision of facilities to general public.\nOn implementation of Universal Healthcare insurance in Punjab, he emphasized on inclusion of common man in the system to help him fully avail the facility.\nHe said creation of playgrounds for the youth in each district was important to help them explore opportunities of healthy activities.\nHe directed that the Prime Minister’s Office should be kept informed of the quarterly review and progress report of the Punjab Development Package.\nThe virtual meeting from Lahore was attended by Punjab Chief Minister Sardar Usman Buzdar, Provincial Finance Minister Hashim Jawan Bakht, Adviser to Punjab CM Dr Salman Shah, Special Assistant to CM Dr Firdous Ashiq Awan, the Chief Secretary Punjab and other senior officials. Minister of State for Information Farrukh Habib joined from Islamabad.\nChief Minister Buzdar said the budget of development projects for fiscal year 22-2021 had been increased by 66 percent while the rate of utilization of last year’s budget was 97 percent, which is a record in the last 10 years. A total of 5,889 schemes were completed in previous year, he added.\nThe Secretary Planning Board Punjab informed the meeting that the budget targets for this year were formulated keeping in view the Punjab Growth Strategy 2023.\nHe mentioned that special focus was laid on economic growth, comprehensive and unified development, agricultural and human development, Sustainable Development Goals, District Development Package, environmental protection and public-private partnership.\nIt was mentioned that the total volume of the province’s development budget of the current year was Rs. 560 billion which included 7,116 projects, of which 90 percent were new schemes.\nThe meeting was informed that funds had been allocated for various sectors including Rs 54 billion for education, Rs 99 billion for health, Rs 100 billion for District Development Package, Rs 36.5 billion for agriculture, Rs 11.3 billion for social security, Rs 12.2 billion for industry and Rs five billion for information technology sector. The development budget is expected to create 350,000 jobs.\nIt was highlighted that special attention had been paid to the promotion of agriculture and industries with their budget increased by almost 300 times.",
  "retrievedAt": "2025-08-11T20:57:43.837Z"
}
