{
  "title": "Corrupt mafia made to cough up over Rs 1,000 bln in last 3 years: Shahzad Akbar",
  "link": "https://www.app.com.pk/national/corrupt-mafia-made-to-cough-up-over-rs-1000-bln-in-last-3-years-shahzad-akbar/",
  "date_published": "2021-07-12T16:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): Advisor to the Prime Minister on Accountability and Interior Shahzad Akbar on Monday said various agencies and entities had made the corrupt elements to cough up over Rs 1,000 billion in the last three years.\nFlanked by Minister for Information and Broadcasting Chaudhry Fawad Hussain and Minister for Energies Hammad Azhar, he said told a news conference that Rs 33 billion was recovered by the National Accountability Bureau (NAB) in the fake accounts case.\nHe said the corrupt elements were resourceful persons, who were deeply entrenched in the system. However, Leader of Opposition in the National Assembly Shehbaz Sharif would not be allowed to flee abroad, and would have to answer for his misdeeds and ‘whopping’ corruption committed while in the government, he added.\nHe said the Federal Investigation Agency (FIA) was conducting investigations against Shehbaz Sharif in the Rs 25 billion money laundering case.\nHe said the assets of Shahbaz Sharif and his family members had increased by Rs 7 billion in a short span of time. About 96 percent transactions in that regard were carried out through telegraphic transfers (TTs) mostly through their lower level staff.\nEven a deceased staffer was not spared, whose account was used after his death. The accounts of Ramzan and Al Arabia sugar mills were also used for the purpose, he added.\nShahzad Akbar said no investigator had not harassed Shehbaz Sharif. Rather his son Hamza Shehbaz, Leader of Opposition in the Punjab Assembly, who did not answer even a single question about his corruption, had threatened the FIA officers during the course investigations saying,”The time keeps changing…”, he added.\nShehbaz, he said, had in fact become ‘sentimental’ as he was not allowed to go abroad. He got angry whenever the investigators asked questions about his corruption. He had adopted a ‘strategy’ of counter attacking the institutions as his party already had the history of invading Supreme Court of Pakistan.\nShehbaz was summoned by the FIA for investigations on June 22 and he levelled harassment charges in July, which was quite surprising, he added.\nHe said there was no possibility of ‘harassment’ as the FIA had a transparent investigation system.\nThe Agency issued a written call up notice to an accused along with a questionnaire, and it also kept the video recording of investigations, he added.",
  "retrievedAt": "2025-08-11T20:57:40.557Z"
}
