{
  "title": "Police to add more sections in FIR in couple torture case: DIG",
  "link": "https://www.app.com.pk/national/police-to-add-more-sections-in-fir-in-couple-torture-case-dig/",
  "date_published": "2021-07-12T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP):Islamabad police have announced to add more sections in the First Information Report (FIR) in the couple assault case after few new facts came to light during the investigation.\nDeputy-Inspector General (DIG) (Operations) Afzaal Ahmed Kousar told the media here on Monday that in the light of new facts emerged during the investigation, the police have decided to add more sections including 375A/375D PPC, 384 PPC, 342 PPC, 114 PPC, 395 PPC, 496A and 377B in the FIR 442/2021 registered at police station Golra Sharif, Islamabad besides those pertaining to the crime as dacoity and extortion.\nKausar said that the accused could get a death sentence or life imprisonment for the crime they committed against the couple.\nHe said the mobile phones of the main accused in the case, Usman Mirza have been recovered and were being sent for forensic test.\nHe said the statement of the couple has also been recorded. Senior Superintendent of Police (SSP) (Investigation) Atta ur Rehman and SSP (Operations) Dr. Syed Mustafa Tanveer were also present during the press conference at the Police Lines Headquarters.\nThe DIG told the media that six persons including the main accused have been arrested in the case including Muhammad Usman Mirza, Farhan Khan, Atta ur Rehman, Adaras Butt, Umar Bilal and Mohib Khan.\nHe said that with the addition of new sections in the FIR, the case against the accused has become stronger.\nHe added that a case was also registered against Usman Mirza at Sihala police station. He also asked people that any person aggrieved by any act of the accused in this case might approach the police high ups for action against the abettors.\nThe official said according to the couple, Usman Mirza also extorted money from them, adding, the police were also investigating who uploaded the video on social media.\nHe said the brother of Usman Mirza was also involved in the crime and the police were trying to locate him. He informed that any one supporting the accused would not be spared.\nHe further said on the directions of Inspector General Islamabad, Qazi Jamil ur Rehman, the investigation was being carried out by a special investigation team led by a SSP level officer as he showed his commitment to bring the culprits to justice.",
  "retrievedAt": "2025-08-11T20:57:41.306Z"
}
