{
  "title": "Imran used KP minerals for personal gains, minted billions: Amir Muqam",
  "link": "https://www.app.com.pk/national/imran-used-kp-minerals-for-personal-gains-minted-billions-amir-muqam/",
  "date_published": "2023-03-06T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 06 (APP): Adviser to the Prime Minister on Political and Public Affairs Engineer Amir Muqam on Monday alleged that during the nine and a half years rule of the Pakistan Tehreek-e-Insaf (PTI) in Khyber Pakhtunkhwa, party chief Imran Khan had used the minerals sector for his personal gains.\nHe minted billions of rupees as a bribe on account of leasing out mines, Amir Muqam said while addressing the closing ceremony of the 24th Pakistan Gems, Jewelery and Mineral Show 2023, organized by the All Pakistan Commercial Exporters Association (APCEA).\nHe said that compared to the previous years, the exports had decreased badly during the PTI government.\nHe said he would consider the recommendations of the organizers for the promotion of the minerals sector.\n“We need exports and this is the best opportunity to bring in dollars through gems and precious stones, and steer the country out of economic crisis under the leadership of Prime Minister Shehbaz Sharif and PML-N Quaid Muhammad Nawaz Sharif.”\nHe recalled it was Nawaz Sharif who as prime minister had built motorways, but no other leader had launched such mega projects. The Pakistan Muslim League-Nawaz (PML-N) led government would again put the country on the right track, he added.\nAmir Muqam said that Pakistan was rich in natural resources and the coalition government was promoting non-conventional sectors, like gems and jewellery as they had the potential to attract foreign investment.\nPraising the organizers, the advisor said that such exhibitions provided a platform to the business community to showcase the best gemstones, diamonds, jewellery, and mineral specimens to the world.\nAPCEA Chairman Minhajuddin Shah said the main purpose of the show was to search new buyers and make permanent contracts with them for booking export orders.\nThe exhibition over the years had proved very useful in expanding the export business of gemstone.\nAPCEA Patron-in-Chief Haji Mansoor Khan said that they would provide all possible support to the minerals industry as it had tremendous potential to increase the country’s overall exports along with creating job opportunities.\nHe said that the APCEA had the plans to support the All Pakistan Commercial Exporters Association Of Rough & Un-Polished,Precious & Semi Precious Stones in stimulating the production and development rough and un-polished precious semi-precious stones.\nAmir Muqam also took a round of various stalls and distributed certificates among the participants of the exhibition.",
  "retrievedAt": "2025-08-11T06:17:14.931Z"
}
