{
  "title": "Senate subcommittee for addressing PBC employees, pensioners’ issues",
  "link": "https://www.app.com.pk/national/senate-subcommittee-for-addressing-pbc-employees-pensioners-issues/",
  "date_published": "2023-03-06T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 6 (APP):The Senate Sub-committee on Information and Broadcasting  Monday underlined the need for addressing issues faced by the employees and pensioners of the Pakistan Broadcasting Corporation.\nThe committee met here with Senator Irfan Ul Haq Siddiqi in the chair extended its full support to resolve the employees and pensioners’ issues especially those which were related to outstanding medical bills.\nThe DG radio informed the committee that the total expenses of the department were Rs 6.5 billion per annum, whereas total income generation stood at only Rs 4.5 billion.\nThe committee discussed various options for revenue generation and also directed the PBC to come up with a business and utilization plan in order to meet the future expenses of the institute.\n“We will reach out to the Prime Minister if needs be for the sustainability of our National asset in the form of radio Pakistan,” Irfan Siddique said, adding all possible steps would be taken to ensure its development and progress.\nThe committee proposed a radio fee amounting to Rs 500 from all vehicles excluding bikes at the time of registration to generate additional revenue for the Pakistan Broadcasting Corporation projects and its further development.\n“The proposal is expected to generate an additional Rs 15 Billion rupees per annum, as every year more than 30 million vehicles are registered,” the committee told.\nThe committee directed that any sort of activity regarding privatization, renting or leasing out of the building of Radio Pakistan might also be stopped with immediate effect.\nThe committee also sought a list of all the employees, including pensioners, and their financial issues to address them effectively. Additionally, the committee directed the restoration of Bukhari Auditorium back to its original state with immediate effect.\nThe committee meeting was attended by Senator Fawzia Arshad, Senator Syed Waqar Mehdi, Secretary Informtaion and Broadcasting, DG Pakistan Broadcasting Corporation and other relevant officials.",
  "retrievedAt": "2025-08-11T06:17:21.373Z"
}
