{
  "title": "NA body for PCAA to decide about max height of high-rise buildings in airports vicinity",
  "link": "https://www.app.com.pk/national/na-body-for-pcaa-to-decide-about-max-height-of-high-rise-buildings-in-airports-vicinity/",
  "date_published": "2023-03-06T16:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 6 (APP): The National Assembly’s Standing Committee on Aviation on Monday recommended that the Pakistan Civil Aviation Authority (CAA) should be given the authority to declare the maximum height for the construction of high-rise buildings around airports.\nChairing the committee meeting, MNA Syed Mobeen Ahmed said hindrances to flight operations still persisted despite the relocation of airports away from residential areas.\nThe construction of housing societies around airports had created a hazardous environment that put the safety of passengers and crew at risk, he added.\nThe committee was told that this responsibility was previously given to development authorities of the concerned areas under the policy of a “one window operation”.\nThe body believed that re-establishing CAA’s authority would help to prevent future hazards and ensure the safety of all those involved in flight operations. It called for a formal report from CAA on the illegalities occurring at funnel zones.\nThe areas around airports were critical to flight operations, and any illegal activities taking place there could pose a significant risk to safety, the members said, adding the forum was committed to improving flight operations in Pakistan and ensuring the safety of all those involved.\n“We urge all relevant authorities to take swift action on these recommendations to address the hazards around airports,” they said.\nThe committee members raised concerns about alleged misbehavior of PIA officials towards respected Parliamentarians at the airports, emphasizing that if Parliamentarians were not given due respect, then how was it possible that ordinary citizens would be treated with dignity.\nUpon inquiring by the committee on issues faced by Pakistan International Airlines (PIA) planes, the committee received concerning reports from citizens about the safety of its planes.\nIn response, the Deputy Director General (Regulations), CAA briefed the committee on recent developments, including the grounding of four aircraft due to PIA’s alleged failure to obtain the Certificate of Airworthiness.\nThe members said the committee was deeply concerned about air crashes in Pakistan and was actively investigating to determine responsibility for these tragic incidents.\nThe chairman committee acknowledged that people at large were not satisfied with the crash reports and demanded more transparency in accountability.\nThe committee believed that safety was paramount and urged all relevant authorities to take swift action to ensure the safety of all air passengers in Pakistan. “We will continue to work diligently to address these concerns and demand accountability for any negligence that may have resulted in these tragedies,” the members noted.\nThe CAA has requested the committee to revive pending legislation that laid before the parliament, aimed to separate these two roles.\nThe CAA has informed the committee about a surplus of Rs 41 Billion for the financial year 2021-2022, the highest ever recorded by the authority. However, the Deputy DG CAA expressed concerns regarding the addition of Rs 50 Billion in income tax on non-receivables from PIA, which accumulated to Rs 150 billion.\nThe committee expressed serious concerns regarding the under-employment of pilots in the airline. It was briefed by the CAA about its engagement with the European Union (EU) and the United Kingdom (UK) to revive PIA flights for European destinations.",
  "retrievedAt": "2025-08-11T06:17:15.183Z"
}
