{
  "title": "Dar appreciates NDMA for relief work in quake-hit Turkiye, Syria",
  "link": "https://www.app.com.pk/national/dar-appreciates-ndma-for-relief-work-in-quake-hit-turkiye-syria/",
  "date_published": "2023-03-06T14:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 06 (APP): Federal Minister for Finance and Revenue Senator Mohammad Ishaq Dar here on Monday appreciated National Disaster Management Authority (NDMA) for its immediate response and relief work for distressed people affected in the devastating earthquake in Turkey and Syria.\nChaired a meeting on Pakistan’s assistance to Turkiye and Syria earthquake victims and remodeling of NDMA, the minister also appreciated the disaster preparedness responses and NDMA’s remodeling of disaster response to mitigate losses from future natural calamities.\nThe meeting among others was attended by Federal Minister for Climate Change, Ms. Sherry Rehman; SAPM on Finance, Tariq Bajwa; SAPM on Revenue, Tariq Mehmood Pasha; SAPM on Government Effectiveness, Dr. Muhammad Jehanzeb Khan; Chairman NDMA, Lt. Gen. Inam Haider Malik HI(M); Chairman FBR, Special Secretary Finance and senior officers from Finance and NDMA.\nEarlier, Chairman NDMA briefed the meeting through a presentation on the quantum of casualties in Turkiye and Syria due to the deadly earthquake and immediate relief provided by Pakistan government to support brothers and sisters in these countries.\nChairman NDMA also highlighted a comprehensive and timely relief plan consisting of cargos through air, road and sea routes for possible help from Pakistan government for Turkiye and Syria during this time of need.\nThe meeting was apprised on the readiness of NDMA for quick support of their Turkish and Syrian brothers and sisters in the shortest time.\nThe Chairman NDMA also briefed the meeting on remodeling of NDMA on modern technological lines for quick and immediate response to disasters transforming NDMA from a reactive to a proactive organization in order to minimize the damages caused by the natural disasters in future.",
  "retrievedAt": "2025-08-11T06:17:21.427Z"
}
