{
  "title": "IK using ‘human shield’ to avoid arrest in Toshakhana case: Musadik",
  "link": "https://www.app.com.pk/national/ik-using-human-shield-to-avoid-arrest-in-toshakhana-case-musadik/",
  "date_published": "2023-03-06T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 6 (APP): Minister of State for Petroleum Dr Musadik Malik on Monday said PTI chairman Imran Khan was using a ‘human shield’ to avoid his arrest, creating a hurdle in the smooth implementation of court summons in the Toshakhana case.\nAddressing a news conference here, the minister said Imran Khan during his three-and-a-half-year rule had been making tall claims of transforming the country into a true welfare state on the pattern of Madina state, but now contrary to it, he showed a feudal mindset under which any influential personality was considered above the law.\n“…there was no difference between the mighty and weak in the Riasat-e-Madina. But Imran Khan, when police officials reached to implement the court order, used a human shield to avoid his arrest,” he said.\nHe said it was unfortunate that a person, who remained prime minister of Pakistan, was not abiding by the country’s laws and court orders, adding Imran Khan’s this act was tantamount to challenging the writ of the state.\nMusadik Malik said the PTI chief was hurling threats to state institutions to protect his corrupt practices and wanted interference of institutions in each other’s work.\nHe said Imran Khan was constantly skipping court proceedings and making provocative statements to create disturbance in the working of the state institutions.\nThe minister recalled that Pakistan Muslim League-Nawaz (PML-N) leader Muhammad Nawaz Sharif had been disqualified and removed from the party’s top slot for not getting salary from his son’s company even though it [salary] was justified.\nHe said Imran Khan remained in corrupt practices which were evident from the fact he handed over a ‘gift’ amounting to $ 250 million to Malik Riaz of Bahria Town, the laundered money recovered by the British authorities, and in return got 450-kanal land.\nSimilarly, he said, the PTI chairman gave a ‘gift’ of $1 billion (Rs 270 billion) to Karachi Electricity Supply Company because Imran Khan received £2-3 million from Arif Naqvi’s cricket club.\nHe said the incumbent coalition government, under the leadership of Prime Minister Shehbaz Sharif, believed in the charter of democracy and take along all political parties for the progress and prosperity of the country, but it would not protect the corrupt practices committed by Imran Khan.\nAnswering a question about getting petroleum products from Russia at a discounted rate, the minister said Pakistani teams were in “constant engagement” with Russian authorities, adding shipment of petroleum products and insurance modalities had been finalized. “All commercial details are in their final stages…hopefully we will meet our deadline. All things are on schedule, which means all matters will be finalized by March-end, and the first order will be placed in April, following which Pakistan will continue getting cheap oil from Russia.”\nResponding to another question, Musadik Malik said a sufficient quantity of gas would be diverted to the fertilizer sector to facilitate the farming community for better production of upcoming seasonal crops, assuring smooth gas supply to domestic consumers, especially during meal times as per the earlier announcement.",
  "retrievedAt": "2025-08-11T06:17:31.005Z"
}
