{
  "title": "NA Speaker proposes single-day elections owing to economic crisis",
  "link": "https://www.app.com.pk/national/na-speaker-proposes-single-day-elections-owing-to-economic-crisis/",
  "date_published": "2023-03-05T19:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP): Speaker National Assembly Raja Pervaiz Ashraf on Sunday emphasized the need for a swift resolution to the economic crisis currently facing the country and suggested that holding general elections on single-day could be a step towards achieving this goal.\nSpeaking to a gathering at village Lodhe of Tehsil Karnab Ilyas of Gujjar Khan, he said that political parties need to think beyond politics for the survival of the country and suggested holding general elections in the country on a single day in view of the economic situation of the country.\nThe speaker said the Pakistan People’s Party (PPP) emphasized the need for coordination among politicians to address the ongoing crises in the country.\n“The PPP has always believed in the power of dialogue and collaboration to solve the problems facing our country,” he said. “We urge all political parties to come together and work towards a common goal of improving the lives of the people of Pakistan.”\nRaja Pervaiz Ashraf said, “the doors of dialogue are always open in politics, and we should take advantage of that to bring all parties to the table and work towards a common goal.”\nHe expressed the hope that the present government would be able to get the country out of the crisis very soon.\nHe spoke about his party’s commitment to solving public problems and praised the efforts of the present coalition government in addressing the country’s challenges.\nOn the occasion, the leaders of Pakistan Tehreek-e-Insaf, from village Lodhe of Gujjar Khan’s Union Council Karnab Ilyas, Liaquat Gujjar and Rafafat Gujjar along with their communities joined the Pakistan People’s Party. The former PTI leaders expressed their confidence in Speaker National Assembly Raja Pervaiz Ashraf.\nWelcoming the new entrants, the Speaker said the inclusion of new leaders into their party, is a source of pride for him.\n“We are proud to welcome these new leaders into our party.”\nHe said that the people who joined the People’s Party would live up to their trust. The Pakistan People’s Party has pledged to prioritize resolving the issues faced by the people of Gujjar Khan, he added.",
  "retrievedAt": "2025-08-11T06:17:14.989Z"
}
