{
  "title": "SAPM assures to address genuine grievances of doctors treating coronavirus patients in Pakistan",
  "link": "https://www.app.com.pk/national/sapm-assures-to-address-genuine-grievances-of-doctors-treating-coronavirus-patients-in-pakistan/",
  "date_published": "2020-04-26T03:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP):Special Assistant to Prime Minister (SAPM), on National Health Services Dr Zafar Mirza has assured full support of the government for addressing genuine grievances of doctors community treating patients of coronavirus.\nThe incumbent government was well aware of problems of the paramedical staff including nurses, technicians, and doctors, he stated while talking to a private TV channel.\nDemand of doctors addressing press conferences to coerce the government for complete lockdown was not a feasible option, he said adding that a complete shutter down would add miseries of the daily wagers and labor community. However, he said social distance and other precautionary measures besides a strict lockdown in the areas where coronavirus patients have been detected, could be possible for protection of the community living there.\nTo a question about political motives behind such conferences being held by doctors community, he rejected the perception of some elements in that regard.\nHe appreciated the paramedical staff, doctors and nurses for playing front line role in treating the patients of this spreading virus around the world.\nTo another question, he said government in consultation with religious scholars and Ulemas had permitted the administration in the mosques to follow standard operating procedure besides other precautionary steps given to them for safety and security of people visiting mosques to offer prayers.\nHe further stated that Pakistan was a poor country and a complete lockdown would open new challenges for poor segment of society.\nMeanwhile, Dr Abdul Bari of Indus Hospital and other prominent health experts had demanded of the government strict implementation of the lockdown in the country.\nHe said Pakistan’s health system could not afford a large number of coronavirus patients that might rise in days to come due to opening of the mosques and other outlets for public.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:08:59.741Z"
}
