{
  "title": "Netherlands thrash Malta, Poland stumble in World Cup qualifying - Sport - DAWN.COM",
  "author": null,
  "content": "PARIS: Netherlands maintained their winning start to European 2026 World Cup qualifying by dismissing Malta 8-0 on Tuesday, while their group rivals Poland lost to Finland in a match interrupted due to a medical emergency in the crowd.\n\nThe results leave Finland top of Group ‘G’ on seven points after four games, one ahead of the Dutch who have played two matches less. Poland are third, also on six points with three games played.\n\nIn Groningen, the Dutch raced into a three-goal lead against their overawed opponents inside the opening 20 minutes.\n\nMemphis Depay converted from the spot on nine minutes, before doubling the lead with a rifled finish from the edge of the box seven minutes later.\n\nDepay’s brace brought the 31-year-old to 50 international goals -- level with former Manchester United and Arsenal striker Robin van Persie as the Nether­lands’ all-time leading goalscorer.\n\nCaptain Virgil van Dijk killed the match off as a tie when he stepped onto the ball and arrowed a right-footed finish into the bottom corner from 20 yards.\n\nAfter they had squandered a plethora of chances, the Oranje turned on the afterburners inside the final half-hour as Xavi Simons, Donyell Malen, who got two, Noa Lang and Micky van de Ven all netted.\n\nSimons slid home the ball from an acute angle for the fourth in the 61st minute and they plundered four goals in the last 16 minutes as substitute Malen took over the running of the game.\n\nThe Aston Villa attacker netted the fifth after Van de Ven pulled the ball back for him in the 74th minute before setting up Lang for the sixth four minutes later with a clever square pass that was perfectly timed.\n\nMalen then netted his second in the 80th minute before Van de Ven, who had been marauding on the left flank most of the game, put the seal on the result in stoppage time with a volleyed strike as Malta failed to clear.\n\nPoland began life without leading goalscorer Robert Lewandowski in miserable fashion as they went down 2-1 in Helsinki.\n\nThe 36-year-old played 158 times for Poland, scoring 85 goals, but announced Sunday he was no longer available for selection so long as coach Michal Probierz remained in charge.\n\nThe Poles fell behind to Joel Pohjanpalo’s 31st-minute penalty, before Benjamin Kallman added a second nine minutes after the break.\n\nJakub Kiwior pulled one back in the 69th minute, shortly before the match was interrupted when a spectator fell ill.\n\nAfter a lengthy stoppage, the final 10 minutes of play resumed but Poland were unable to find an equaliser despite applying relentless pressure on the hosts’ goal.\n\nElsewhere, Serbia eased past Andorra 3-0 to move to third in Group ‘K’ on four points courtesy of an Aleksandar Mitrovic hat-trick.\n\nThey trail Albania in second by one point and sit level with Latvia after those sides played out a 1-1 draw in Riga.\n\nAustria beat San Marino 4-0 to go second in Group ‘H’, three points behind leaders Bosnia and Hercegovina who have played an extra match.\n\nMarko Arnautovic scored a brace ins­ide the opening quarter-hour, as Michael Gregoritsch and Christoph Baumgartner completed the scoring in Serravalle.\n\nRomania defeated Cyprus 2-0, but dropped to third in the group after Austria’s second win from two outings.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6849feb3f3cff.jpg",
  "retrievedAt": "2025-10-12T03:32:59.880Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916625/netherlands-thrash-malta-poland-stumble-in-world-cup-qualifying",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T02:44:24.000Z"
}
