{
  "title": "Harvey Weinstein jury resumes deliberations after partial conviction, infighting - World - DAWN.COM",
  "author": null,
  "content": "Jurors will reconvene on Thursday in Harvey Weinsteins sex crimes retrial, a day after they handed down a partial conviction against the former movie mogul but hit an impasse on a rape count as deliberations spiralled into angry infighting.\n\nWeinstein, once one of the most powerful figures in Hollywood, faced a retrial that began on April 23 after a state appeals court last year overturned his 2020 conviction.\n\nHe was accused by prosecutors in the case of raping an aspiring actress and assaulting two other women.\n\nWeinstein, 73, pleaded not guilty and has denied assaulting anyone or having non-consensual sex.\n\nThe jury found Weinstein guilty on one of the three counts he faced, which stemmed from his alleged assault of former production assistant Miriam Haley in 2006. The jury found Weinstein not guilty of a charge stemming from his alleged assault of Kaja Sokola in 2002 when she was a 16-year-old aspiring actress.\n\nThe jury has not yet reached a verdict on a third count, which charges him with raping aspiring actress Jessica Mann in 2013.\n\nIn a startling development on Wednesday, the jury foreperson told presiding Supreme Court Justice Curtis Farber that other members of the panel were shouting at him and threatening him for refusing to change his vote on the rape count.\n\nFarber sent jurors home for the day to give them time to cool down and instructed the foreperson to arrive in court separately on Thursday.\n\nWeinstein’s lawyers unsuccessfully moved for a mistrial, arguing that the breakdown in the jury room would taint any verdict.\n\nRegardless of the eventual verdict on the rape charge, Weinstein faces up to 25 years in prison when he is sentenced. He has separately been sentenced to 16 years in prison following a rape conviction in California.\n\nIn closing arguments on June 3, the prosecution told the 12 jurors that the evidence showed how Weinstein used his power and influence to trap and abuse women.\n\nThe defence countered that the accusers lied on the witness stand out of spite after their consensual sexual encounters with the Oscar-winning producer failed to result in Hollywood stardom.\n\nA jury found Weinstein guilty in February 2020 of raping Mann and sexually assaulting Haley. Sokola’s allegation was not part of that case.\n\nThe conviction was a milestone for the #MeToo movement, which encouraged women to come forward with allegations of sexual misconduct by powerful men.\n\nBut the New York Court of Appeals, the state’s highest court, threw out that conviction in April 2024. It said the trial judge erred by letting women testify that Weinstein had assaulted them, though their accusations were not the basis of the criminal charges.\n\nThough the conviction was thrown out, Weinstein, who has had a litany of health problems in recent years and attended the retrial in a wheelchair, has remained behind bars because of his California conviction. He is appealing that verdict.\n\nMore than 100 women, including famous actresses, have accused Weinstein of misconduct.\n\nHe co-founded the Miramax studio, whose hit movies included such Academy Award winners as “Shakespeare in Love” and “Pulp Fiction.” Weinsteins own eponymous film studio filed for bankruptcy in March 2018, five months after sexual misconduct accusations against him became widely publicised.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:54:01.428Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916752/harvey-weinstein-jury-resumes-deliberations-after-partial-conviction-infighting",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T15:33:27.000Z"
}
