{
  "title": "Pakistan gets robust inflow of $3.7bn in May - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Pakistan looks set to exceed its annual remittances target of $38 billion with $3.7bn inflows in May.\n\nSo far in the 11 months of the fiscal year 2025 — July to May — Pakistan received $35bn in remittances.\n\nWith the addition of June inflows, the total remittances are expected to exceed the revised target of $38bn for the current financial year.\n\nThe latest data issued by the State Bank on Wednesday showed remittances increased by 16 per cent month-on-month in May. The year-on-year increase compared to May 2024 was 13.7pc.\n\nTotal influx in FY25 set to exceed revised target of $38bm\n\nTotal inflows from July to May were $34.9 billion, 29pc higher than $27bn collected in the same period last year. Earlier, the government estimated annual remittances for FY25 to be $35bn. However, record inflows forced an upward target revision of around $3bn.\n\nAccording to the SBP data, inflows from Saudi Arabia constituted 24.3pc of the total inflows of $34.9bn during July-May FY25.\n\nThe inflows from the Middle Eastern nation grew 29pc compared to the last year, reflecting higher labour exports.\n\nThe remittances from the UAE registered the highest growth in 11 months of the current fiscal year — up by 45.7pc to $7.11bn.\n\nIn a sign of Pakistanis emigrating to Europe, the inflows from EU countries have exceeded those from the Gulf Cooperation Council (GCC) countries.\n\nDuring the last 11 months, Pakistan received $4.1bn from EU countries, while inflows from GCC countries were $3.41bn, a growth of 18.4pc.\n\nThe inflows from the UK were — $5.37bn, up by 33pc during the first 11 months of this fiscal year compared to the last year. This was also the third-largest inflow from a single destination into Pakistan.\n\nThe remittances from the US also increased by $7.2pc to $3.44bn.\n\nAccording to financial experts, higher remittances were also due to exchange rate stability during FY25. The government and the State Bank ma­­naged the exchange rate mainly by controlling imports.\n\nLower imports reduced dollar outflows, helping the State Bank buy the US currency from the interbank market and improve its foreign exchange reserves.\n\nHowever, the decision to cut imports was a major factor in low economic growth, which is expected to be around 2.6pc in FY25.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:54:06.947Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916681/pakistan-gets-robust-inflow-of-37bn-in-may",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T03:17:27.000Z"
}
