{
  "title": "‘I can solve anything’: Trump once again offers to be arbitrator in Kashmir dispute - Pakistan - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump on Thursday once again offered to arbitrate the Kashmir dispute between Pakistan and India, echoing comments made by the US State Department a day prior.\n\nTrump had offered to work on the Kashmir issue after he brokered a ceasefire between the two nuclear powers following their most intense military confrontation in decades. In a message lauding the countries’ leaders for achieving peace, he remarked, “I will work with both of you to see if, after a ‘thousand years’, a solution can be arrived at concerning Kashmir.”\n\nResponding to a question on the steps the US plans to take in the wake of Trump’s offer, State Department spokesperson Tammy Bruce noted, “[Trump] has been the only one to bring certain people to the table to have conversations that nobody thought was possible,” remaining hopeful that the Kashmir issue can also get resolved.\n\nFielding questions after a bill-signing ceremony on Thursday, the US president said that he “stopped a war” between Pakistan and India.\n\n“Eventually they were gonna go nuclear … and I stopped it, I called each leader … and I spoke to them and talked about trade,” Trump said. “I said, ‘You’re not trading with us if you go to war … if you’re going to start throwing nuclear weapons around.\n\n“They were both unbelievable. They understood it exactly, they stopped. I stopped that war with phone calls and trade,” Trump added.\n\nHe further said that India is negotiating a trade deal in Washington, and a Pakistani delegation would arrive “I think next week”.\n\nIn response to another question, Trump said, “We’re going to get them together. I told them, India and Pakistan … they have a longtime rivalry over Kashmir. I told them ‘I can solve anything.’\n\n“I will be your arbitrator. I will be your arbitrator. I can solve anything.”\n\nPakistan and India have been at odds since the Pahalgam attack in occupied Kashmir, which saw the killing of 26 tourists. New Delhi, without any evidence, blamed Islamabad for the attack, while the latter strongly denied the claims and offered a neutral probe. The two nations then fought a four-day conflict before the US brokered a ceasefire on May 10.\n\nEarlier this month, Pakis­tan launched a broad-based engagement campaign in the United States to present its perspective on the recent conflict with India, and counter New Delhi’s growing lobbying presence there. As part of its global outreach, the team visited London and will also visit Brussels.\n\nThe delegation comprises former foreign ministers Bilawal Bhutto-Zardari, Hina Rabbani Khar and Khurram Dastgir; Senators Sherry Rehman, Musadik Malik, Faisal Subzwari and Bushra Anjum Butt; along with senior envoys Jalil Abbas Jilani and Teh­mina Janjua.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/1222515711c8a2f.jpg",
  "retrievedAt": "2025-08-20T03:54:02.961Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916758/i-can-solve-anything-trump-once-again-offers-to-be-arbitrator-in-kashmir-dispute",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T18:10:35.000Z"
}
