{
  "title": "President, PM call for joint efforts from employers, parents to end child labour, exploitation - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari and Prime Minister Shehbaz Sharif on Thursday urged parents and employers to make joint efforts to eliminate child labour, as the country observed World Day Against Child Labour.\n\nOver 12.5 million children in Pakistan are involved in child labour, according to the Child Rights Movement (CRM) National Secretariat. One in four households in Pakistan employed a child for domestic work, often in hazardous conditions, as per the International Labour Organisation (ILO). According to a provincial survey, working children accounted for 11.1 per cent of Khyber Pakhtunkhwa’s child population.\n\nAccording to a statement from the President’s House, President Zardari, in his message, called for efforts to protect children from exploitation, expressing hope for a future where children could “learn, play, and grow in a safe and dignified environment”.\n\nStressing the need for collective action by governments, the president urged employers to “strictly follow child labour laws and ensure that their workplaces are free from exploitation.”\n\nHe also called on parents and guardians to prioritise their children’s education over “short-term gains”.\n\n“I urge schools and teachers to identify children at risk of dropping out and keep them in classrooms,” he was quoted as saying in his message.\n\nDetailing Pakistan’s efforts towards ending child labour, he added: “Pakistan has enacted the National Commission on Rights of Child Act (2017), the ICT Child Protection Act (2018), the Juvenile Justice System Act (2018), the Employment of Children’s Act (1991), and the Domestic Workers Act (2002).”\n\n“Pakistan has also established effective mechanisms and service units for the prevention of child exploitation, child labour, and providing care and rehabilitation to the affected children.\n\n“Pakistan, as a signatory to various international conventions aimed at eliminating child labour, is fully committed to ending the exploitation of children.”\n\nHe called on the media to raise awareness on the matter of child labour and appealed to philanthropists to “support vulnerable families so that no child is forced into Labour due to poverty.”\n\nHe further urged the international community to “pay urgent attention to the children in Gaza”.\n\n“Thousands of innocent children in these areas have been displaced, injured, or orphaned due to violence and aggression by the occupation forces,” he stated.\n\nNoting that children in such vulnerable states were at a heightened risk of being pushed into child labour, he emphasised the need for “immediate global support, protection, and justice.”\n\n“Together, we can dismantle the systems that exploit children and create a Pakistan and a world where every child is free to dream, learn, and build a brighter future.”\n\nMeanwhile, PM Shehbaz, while reaffirming the government’s commitment to ending child labour, highlighted the role of “the federal and provincial governments, the private sector, educational institutions, media, and civil society” in preventing child labour, the Associated Press of Pakistan (APP) reported.\n\n“Children subjected to child labour not only face sexual and psychological abuse but they are also deprived of their fundamental right to education. They are robbed of their childhood,” he said.\n\nPM Shehbaz also noted that children from “developing countries are the most affected by the scourge of child labour.”\n\n“Pakistan stands shoulder to shoulder with the global community in its fight against child labour,” he added.\n\nHe said that this year’s theme, “Progress is clear, but there’s more to do: let’s speed up efforts!” highlights that while progress has been made, much more remains to be done.\n\n“On this occasion, the International Labour Organisation (ILO) and UNICEF are launching the 2025 Global Estimates and Trends Report on Child Labour, which will help assess the effectiveness of the steps taken so far,” the PM’s statement read.\n\nReiterating Pakistan’s commitment to ILO conventions on child labour, he noted that Article 11 of the Constitution of Pakistan prohibits all forms of forced labour and child labour.\n\nAppealing to all stakeholders to help the government in its effort to promote education, he pointed out the Danish School system as an initiative by the government to provide access to quality education to underprivileged children.\n\nPakistan’s last Child Labour Survey, conducted in 1996, determined that agriculture involved the greatest proportion of children engaged in child labour (66pc), followed by manufacturing (11pc), hotels and restaurants (9pc), domestic work, social and personal services (8pc), transport (4pc) and construction (2pc), as per an ILO report.\n\nEvery year on June 12, the ILO, along with its constituents and partners around the world, commemorates the World Day Against Child Labour. This year’s theme reflects both the progress achieved and the urgency to intensify action to meet global targets.\n\nThe 2025 World Day focuses on a key milestone: the release of the 2025 global estimates and trends of child labour. This ILO and UNICEF joint report will provide a comprehensive overview of where we stand in our global commitments to eliminate child labour.\n\nAlthough the detailed data are not yet available, the estimates and trends identified will guide policy debates and calls for renewed commitment and investment.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:54:04.481Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916729/president-pm-call-for-joint-efforts-from-employers-parents-to-end-child-labour-exploitation",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T12:45:18.000Z"
}
