{
  "title": "KE seeks partial fuel cost benefit to consumers - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: K-Electric has requested the National Electric Power Regulatory Authority (Nepra) not to pass on the full impact of a Rs4.69 per unit negative fuel cost adjustment (FCA) benefit to consumers, as it had overcharged them in April.\n\nIn a petition, it instead requested retention of approximately Rs800 million in its accounts on the same pattern as the regulator had allowed fuel cost savings worth Rs15.2 billion in past claims. KE reported that its fuel cost came out to be Rs4.69 per unit lower than it had charged consumers in April, resulting in a fiscal impact of Rs7.2bn.\n\nKE submitted that pursuant to the determination of the generation tariff for its power plants for the period post-June 2023, it had submitted the required partial load, open cycle and degradation curves along with startup cost for approval and an amount of Rs16bn for the period July 2023 to April 2025 was accordingly pending for adjustment.\n\nAdditionally, the heat rate adjustments for its two plants at Korangi and Port Qasim, for the previous multi-year tariff amounting to Rs600m and Rs200m, were also pending.\n\nRegulator fixes public hearing on 19th to decide retention plea\n\nOut of this, the regulator has already set aside Rs15.2bn in KE’s fuel cost decisions for November 2024 to March 2025. KE has requested the regulator “to also consider aforementioned adjustment of accumulated actualisation of fuel cost so that the recovery can be made from the negative fuel cost variation of March 2025 and April 2025 to ensure consumers are not burdened at a later stage”.\n\nNepra has scheduled June 19 for the public hearing to examine whether the requested FCA was justified and KE followed the merit order when despatching to its power plants, as well as when purchasing power from external sources, including the cheaper national grid.\n\nWhile Nepra has already settled through its five monthly determinations by allowing Rs15.2bn out of Rs16bn, just to complete the formality, it has also raised the question of the KE’s request for adjustment of accumulated actualisation of fuel cost on account of partial load, open cycle and degradation curves along with startup cost from July 2023 to April 2025, from the negative fuel cost variation was justified.\n\nThe FCA is reviewed monthly, in accordance with the tariff regime applicable nationwide.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:54:07.949Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916678/ke-seeks-partial-fuel-cost-benefit-to-consumers",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T03:14:21.000Z"
}
