{
  "title": "Ginners in shock as 18pc GST retained - Business - DAWN.COM",
  "author": null,
  "content": "LAHORE: The cotton ginning and oil mill industries across Pakistan are reeling from profound disappointment and concern following the federal budget’s failure to abolish the sales tax on cotton and its by-products and to remove the sales tax exemption on imported cotton.\n\nThis decision comes despite strong recommendations from two committees established by Prime Minister Shehbaz Sharif, raising fears of further factory closures, a significant reduction in cotton cultivation, and a sharp decline in cotton prices. Reports indicate a staggering drop of Rs1,000 per maund in cotton prices post-budget.\n\nGinners say a ‘flawed’ Export Facilitation Scheme (EFS) introduced several years ago allowed sales tax-free import of cotton, cotton yarn, and grey, while domestic purchases of these very items remained subject to 18 per cent sales tax.\n\n“This scheme led to the import of millions of cotton bales and cotton yarn, severely impacting the country’s foreign exchange reserves,” says Ihsan-ul-Haq, Chairman of the Cotton Ginners Forum.\n\nLint prices tumble by Rs1,000 per maund\n\n“Simultaneously, textile mills ceased purchasing cotton domestically, causing a drastic fall in cotton and phutti (seed-cotton) prices. Consequently, Pakistan’s total cotton production in 2024-25 plummeted to a historic low of just 5.5 million bales, the second lowest ever, with over 200,000 bales still unsold.”\n\nThe decline in cotton cultivation also forced Pakistan to import edible oil worth billions of dollars, bemoans Junaid Iqbal, another ginner from Punjab. He says that the EFS has plunged the cotton ginning sector into its worst economic crisis, leading to the closure of over 800 ginning units and several hundred oil mills nationwide.\n\nHaq notes that the exclusion of these recommendations has led to a record decline of Rs1,000 per maund in cotton prices within two days, bringing them down to Rs16,000-16,200 per maund, with fears of further reductions.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:32:26.580Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916677/ginners-in-shock-as-18pc-gst-retained",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T03:12:47.000Z"
}
