{
  "title": "Thrashing around - Newspaper - DAWN.COM",
  "author": null,
  "content": "WE are now in the advanced stages of a fiscal malfunction that is causing the state in Pakistan to sink deeper into financial and economic non-viability. There is no point sugar-coating this harsh reality.\n\nFor too many years now, we have been repeating what is now a familiar ritual, where the budget is announced accompanied with pious-sounding intentions, well-meaning rhetoric, and pointed reminders about the state’s constraints. And yet the only thing that changes is the increase in the burden on those who are registered, compliant taxpayers.\n\nThe budget announced on Tuesday follows this well-trodden path. This was the year to make something big happen. Rarely have conditions been more favourable for a government to undertake far-reaching change.\n\nThe powerful establishment stands behind them. There is no opposition worth the name in parliament. The economy has stabilised. The raging inferno of inflation has been doused. The runaway fiscal and external sector deficits have been either converted into surpluses or at least brought within manageable bounds. There is political and economic stability in the country. Never mind for now the blood, sweat and tears through which this brief moment of respite has been procured.\n\nThe question to ask is what are they doing with this hard-earned moment of opportunity?\n\nWe now have our answer. There is not a single reform measure in this budget. No strategic change of direction is indicated anywhere. They claim to be trying to boost exports through wide-ranging reduction in custom duties across thousands of tariff lines but one is hard-pressed to find an exporter who is keen on this proposal. The most significant area one looks for in a budget are measures designed to broaden the base of taxation. And all we find is steps designed to bring online marketplaces, incomes and transactions of the digital economy into the net and ramp up the powers of tax commissioners to penalise those refusing compliance.\n\nThere are revenue measures to make you cry. Last year, they taxed stationery and children’s school supplies. This year they have dropped a bombshell of a tax on teachers by abruptly withdrawing a tax rebate that they had only a few days ago committed they would keep. And then they sat in their ritual ‘post-budget press conference’ and told us how much they value the work of educated Pakistani youth, who have brought $400 million into the country as freelancers, adding that they would like to see these same code writers make $90 to $100 per hour or something like that in the years to come.\n\nThere is not a single reform measure in this budget. No strategic change of direction is indicated anywhere.\n\nThis is vintage budget theatre. Put the tax burden on teachers and professors, tax students’ school supplies, then sing paeans to the productive energies of the youth. Wag a finger at those who pay no taxes in this country. And with the other hand pick the pockets of those who do. Salaried individuals got relief sufficient maybe to pay for a pizza delivery per month.\n\nThe finance minister justified this by saying the “direction of travel” is correct, even if the distance covered is not satisfactory, adding that things that go up rarely ever come down where taxes are concerned. This is a polite way of saying ‘count your blessings, others would have given you even less than what I did’.\n\nBut let’s talk about the “direction of travel” for a moment. The last major tax reform that was attempted in Pakistan was the so-called Reformed General Sales Tax, or RGST, bill back in 2009. It died a loud and messy death in parliament as even the government’s coalition partners at the time refused to vote for it. Since then, we have been reduced to clever little gimmicks to squeeze more and more revenue out of those foolish enough to be registered and complying with the tax laws of the country.\n\nAlong the way, we have invented whole new categories of taxpayers, and whole new income streams. Somewhere around the middle of the 2010s we had a new category of taxpayer called ‘non-filer of tax returns’. In 2022, the government invented the category of ‘deemed income’. Along the way, we had amnesty schemes, incentives and penalties to try and get recalcitrant non-filers to register, and pay their taxes.\n\nIt began in 2014 with an amnesty scheme and a withholding tax on bank transactions of non-filers. It continued through 2019 when the FBR was prodded into serving tens of thousands of notices to non-filers in the services sector. It continued in 2021 when we were supposed to collect tens of billions of rupees from ‘point of sale machines’ that were going to be mainstreamed across the retail sector.\n\nIt raced passed 2022 when incomes were deemed to have come from otherwise dormant assets on the wealth statements of the rich, and taxes were to be collected from shopkeepers based on power consumed and the square footage of their outlets. In 2024 we had the ‘Tajir Dost scheme’, announced by the same finance minister who gave us the latest budget.\n\nAnd what do we have to show for this decade-long effort? Vast databases of non-compliant individuals and businesses?\n\nAll these schemes and gimmicks show us a state thrashing around within the shrinking confines of its resource envelope. Meanwhile, every year the same ritual plays out. A new scheme is announced, and the burden on those who pay is increased further, while we are all reminded that times are hard and the fiscal space is limited. This stasis, this inability to drive any change, is taking the state deeper and deeper into non-viability as it is forced to squeeze more from less and borrow the remainder. This was the year when that could have changed.\n\nInstead, we got this elephantine mediocrity they’re calling a budget. Another year of treading water. Another year of limping from one IMF review to the next, with no end in sight.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684a42a64debb.jpg",
  "retrievedAt": "2025-08-20T03:54:07.028Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916673",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T03:00:46.000Z"
}
