{
  "title": "Traders, politicians in KP reject budget as ‘anti-poor’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Traders, consumers and politicians have rejected the federal budget, and warned that imposition of new taxes will further push the downtrodden below the poverty line.\n\nIn a statement issued here on Wednesday, Qaumi Watan Party provincial chairman Sikandar Hayat Khan Sherpao said the federal budget failed to reflect the aspirations of the people and offered no relief to the public, business community as well as the agriculture sector.\n\nHe said the budget lacked any measures aimed at economic growth, agricultural revival, or public welfare. He warned that the imposition of massive taxes was likely to have severe negative impacts, particularly on agriculture, which was already facing unprecedented decline.\n\nHe pointed out that inflation was at its highest level and agricultural degradation was pushing nearly half of the country’s population below the poverty line. “Instead of curbing its extravagant expenditures, the government has increased them by 17 per cent, and this burden will ultimately fall on the poor,” he remarked.\n\nAsk govt to withdraw decision on new taxes\n\nSikandar Sherpao said around 42 per cent of the country’s population now lived below the poverty line — a number that had surged to 48 per cent in Khyber Pakhtunkhwa and nearly 70 per cent in Balochistan.\n\nSikandar Sherpao also criticised the government for once again failing to allocate promised funds for the merged tribal districts.\n\nSarhad Chamber of Commerce and Industry president Fazal Moqeem Khan said the Federal Budget 2025-26 didn’t come up to its expectations of people. He said a growth-oriented, progressive and business-friendly budget was impossible under the current harsh conditions of IMF.\n\nHe said the business community expected a pro-business budget for next fiscal year, but it was not as per their expectations.\n\nMoqeem said the government should revisit the proposals that had been sent by SCCI for incorporation in the budget.\n\n“No relief measures have been proposed for revival of war-hit businesses and industry in Khyber Pakhtunkhwa,” Moqeem remarked.\n\nHaji Mohammad Afzal, regional chairman of Federation of Pakistan Chambers of Commerce and Industry, said small traders would strongly protest against imposition of Point-of-Sale and other ‘anti-trader’ measures.\n\nSimilarly, Tajir Ittehad provincial president Mujeebur Rehman also criticised the budget, calling it a ‘budget of numbers’ that fails to address the real issues faced by traders and the general public.\n\nHe said the implementation of new taxes worth Rs2,000 billion would make it impossible for businesses to operate.\n\nHe emphasised that the tax target of Rs14,000 billion was unrealistic and will further shrink the economy.\n\nRehman questioned how the government plans to service debts exceeding Rs8,500 billion without a viable strategy.\n\n“Increasing the petroleum levy from Rs78 to Rs100 per litre will be detrimental to the economy,” he warned.\n\nThe Consumers Association Khyber Pakhtunkhwa president Mahmood Khan Khattak strongly condemned the government’s decision to impose tax on solar panels, calling the decision anti-consumer and unwise, especially when the country is facing an energy crisis and electricity prices are skyrocketing.\n\nHe said solar energy was a sustainable solution for the poor and middle class, but now the government is trying to limit it by imposing a tax.\n\nHe questioned whether the government’s interests are tied to the energy mafia.\n\nMeanwhile, Bajaur Chamber of Commerce and Industry on Wednesday rejected the federal budget, alleging it contains nothing for the welfare of people and trading community of both the former Federally Administered Tribal Areas and Provincially Administered Tribal Areas (Pata).\n\nTalking to reporters, chamber president Haji Lali Shah called the budget as the IMF-designed.\n\nExpressing concerns over the increased taxes on various commodities such as solar panels and small vehicles, and the introduction of taxes on ATM cash withdrawals and online purchases, Mr Shah described the budget as entirely anti-people.\n\nHe noted that the federal government had ignored suggestions from various chambers, and traders’ organisations aimed at boosting business activities in the country.\n\nHe urged the federal government to revise the measures in the budget.\n\nThe Bajaur chamber chief also slammed the federal government for allocating only Rs80 billion for the tribal districts, stating this amount was insufficient for the development of these areas, which have the poorest infrastructure in the country.\n\nHe called for allocating development funds for the tribal districts as per the 25th Constitutional Amendment.\n\nIn Khyber district, the Fata Loya Jirga (FLJ), an anti-merger body, rejected the imposition of taxes in the federal budget and asked for an immediate reversal of all the taxes from the militancy-hit regions.\n\nIn a statement, FLJ president Haji Bismillah Khan argued that the imposition of taxes over the people of merged districts was tantamount to imposing additional financial burden on them.\n\nHe said the people of the merged districts were still reeling from the devastating effects of nearly 15 years of militancy and military operations and could not afford paying these ‘unjust’ taxes.\n\nHe was of the view that the federal government shall instead focus on the rebuilding the damaged infrastructure of these areas.\n\n“We have never accepted the illegal and unconstitutional merger of Fata with the Khyber Pakhtunkhwa and will continue to oppose it as it has destroyed the centuries-old traditional tribal system of the region,” he argued.\n\nMeanwhile, labour leaders in Swabi on Wednesday resented that working class was totally ignored in the federal budget as it didn’t enhance the minimum wage.\n\nThey said they would launch a joint struggle against the budget.\n\nCentral president of Pakistan Workers Federation Shaukat Ali Anjum told Dawn that they had convened an emergency meeting of the general council in Islamabad on Thursday (today) in which the workers’ leaders from across the country would participate to adopt a new line of action because neither the workers’ wage nor employees old age benefit pension was increased by the federal government.\n\nHe elaborated that various other labour leaders and unions had contacted them, declaring that they were ready to launch a joint movement against the failure of the government to give due importance to the workers.\n\nSher Azam Jadoon, central general secretary of Gadoon Labour Federation, told Dawn that in the previous budget, the federal government had set the monthly wage at Rs37,000, but the provincial government slashed it to Rs36,000. He regretted that in Gadoon Amazai Industrial Estate workers were forced to work for 12 hours but they were not even paid Rs36,000.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:54:07.915Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916585/traders-politicians-in-kp-reject-budget-as-anti-poor",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T02:47:19.000Z"
}
