{
  "title": "Pakistan hits rock bottom in WEF’s global gender gap report out of 148 countries - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan was bottom-ranked among 148 countries in the World Economic Forum’s (WEF) Global Gender Gap Report 2025 — with 56.7 per cent gender parity — the highest since 2006, it emerged on Thursday.\n\nThe annual report benchmarked the current state and evolution of gender parity across four key dimensions: economic participation and opportunity, educational attainment, health and survival, and political empowerment.\n\nIn the latest report, Pakistan has been ranked below Sudan, (57pc, 147th), Chad (57.1pc, 146th), Iran (58.3pc,145th), Guinea (59.5pc, 144th), Democratic Republic of the Congo (60.1pc, 143rd), Niger (61.3pc,142nd), Algeria (61.4pc, 141st), and Mali (61.7pc, 140th).\n\nOccupying the bottom rank of the index, Pakistan saw its overall parity score decline from last year’s edition, from 57pc to 56.7pc, the report said. Overall Pakistan has closed +2.3 of its gender gap since 2006.\n\nHowever, this year’s results were a second consecutive drop from the economy’s best score of 57.7pc, achieved in 2023. Pakistan’s parity in economic participation and opportunity has declined by 1.3 percentage points, the report said.\n\nWhile economic representation indicators have remained unchanged, income disparity in Pakistan has slightly increased since the last edition (0.02 points), as has perceived wage inequality (4 percentage points).\n\nThe sole sub-index advance registered by Pakistan in this year’s edition was “Educational Attainment”, bumping educational parity upwards by 1.5 percentage points to reach 85.1pc.\n\nThe shift was partly driven by an increase in female literacy rates (from 46.5pc to 48.5pc). However, parity has also risen because male enrolment shares have dropped in tertiary education, increasing the relative balance between men and women but lowering educational reach overall.\n\nThe report said Pakistan’s economy had seen political parity drop from 12.2pc in 2024 to 11pc in 2025.\n\nWhile parity in parliament increased by 1.2 percentage points, women’s ministerial representation dropped from 5.9pc in 2024 to zero in 2025 and with it the overall sub-index score, the report added.\n\nPakistan was listed among countries including Azerbaijan, Hungary, Saudi Arabia, and Vanuatu that have all-male ministerial cabinets.\n\nCommenting on the 2025 edition of the report, Managing Director of the World Economic Forum, Saadia Zahidi, said the report “arrives at a decisive moment, with the world in flux as technological breakthroughs, geopolitical conflict and economic uncertainty are creating unprecedented challenges as well as bringing new opportunities.\n\n“Amid such change, gender parity is both a principle and a strategy,’’ she said, adding that “economies that tap into the full spectrum of their talent and human capital are best positioned to navigate an era of transformation and accelerate productivity and prosperity.”\n\nZahidi said most economies were not fully leveraging this pathway for growth.\n\nThe report found that there was still a combined global average gender gap of over 30pc across four areas: economic participation and opportunity, political empowerment, educational attainment and health and survival, she added.\n\nThe global gender gap score in 2025 for all 148 economies included in this edition of the index stands at 68.8pc. The global gender gap closed by 0.3 percentage points in 2025, from 68.4pc in 2024 to 68.8pct in 2025.\n\nBased on the collective speed of progress of those 100 economies, it will take 123 years to reach full parity globally, the report said.\n\nThe 2025 Global Gender Gap Index shows that no economy has yet achieved full gender parity. Iceland (92.6pc) continues to lead the Global Gender Gap Index, holding the top position for 16 consecutive years, and remains the only economy to have closed more than 90pc of its gender gap since 2022.\n\nEach of the top 10 ranked economies have closed at least 80pc of their gender gaps, the only economies to do so. Globally, gender parity has increased by 4.8 percentage points since 2006.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/12181458d761bde.jpg",
  "retrievedAt": "2025-08-20T03:54:01.001Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916743/pakistan-hits-rock-bottom-in-wefs-global-gender-gap-report-out-of-148-countries",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T13:50:14.000Z"
}
