{
  "title": "PTI rallies farmers for decisive protest to fix agri sector - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Party won’t tolerate exploitation of growers, vows Gohar\n• Sheikh Waqqas says Imran can give call for protest at any time\n\nISLAMABAD: The PTI has criticised the government for “destroying” the agriculture sector and called upon farmers to prepare for a “decisive” protest movement for their rights.\n\nThese remarks were made by PTI leaders at a farmers’ convention held on Wednesday, a day after the federal budget was announced.\n\nThe government announced several measures in the budget to support the farming sector, including the decision not to impose a general sales tax (GST) on fertilisers and pesticides to reduce the cost of input for farmers.\n\nHowever, farmers have called the measures — which came on the back of the sector’s poor performance last year — inadequate.\n\nIn the outgoing financial year, the output of major crops reduced by 13.5pc, which restricted the overall GDP growth rate by 0.6pc.\n\nDuring the event on Wednesday, the PTI leadership lambasted the government for the sector’s poor performance and said the time has arrived for a decisive battle to “liberate” the country from “exploitative forces” imposed upon it.\n\nPTI Chairman Barrister Gohar Khan, Secretary General Salman Akram Raja, Central Information Secretary Sheikh Waqas Akram, along with other PTI lawmakers and farmers’ representatives, addressed the event in Khyber Pakhtunkhwa House on Wednesday.\n\nMr Gohar said a significant portion of the population relied directly or indirectly on the agriculture sector for their livelihood.\n\nHowever, successive governments “had consistently neglected the vital sector” which served as the backbone of the national economy. He stressed the need to modernise the agriculture sector to ensure food security, stressing that practical measures must be taken on a war footing.\n\nMr Gohar vowed that PTI would not tolerate the exploitation of farmers and assured that the party’s elected representatives “would leave no stone unturned in ensuring that farmers’ recommendations are incorporated into the budgets”.\n\nIn his address, Mr Akram accused the Punjab government of “deliberately targeting and punishing farmers for supporting Imran Khan and PTI in last year’s general elections”.\n\nHe recalled that Mr Khan always raised his voice for farmers’ welfare, “which was why farmers stood by him”. He urged the farmers to be ready to take to the streets, not only for Mr Khan’s release but also for the protection of their own rights.\n\nAccording to the PTI leader, Mr Khan will give the call for a protest movement at any time.\n\nOn the federal budget, Mr Akram said the nation has “rejected” the document as it “offered nothing for public welfare”.\n\nMr Raja said there was a “class conflict” in Pakistan, but PTI would raise its voice for poor. He said the party was striving to transform the country into a genuine welfare state.\n\nMr Raja highlighted that a large number of children were out of school, over 40pc of children under five suffer from stunting, and poverty was rampant.\n\nHe said corporate farming and the construction of new canals at the expense of poor farmers were unacceptable and intolerable.\n\nAccording to Mr Raja, the powerful elite class has done nothing for the welfare or interests of the working class and underprivileged people and has focused solely on “promoting their own vested agendas”.\n\nThe opposition leader in Punjab Assembly, Malik Ahmad Khan Bhachar, said farmers were facing tyranny in Punjab, as the government was “suppressing” them to benefit other sectors.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:54:33.992Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916648/pti-rallies-farmers-for-decisive-protest-to-fix-agri-sector",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T02:43:18.000Z"
}
