{
  "title": "Motorway cop allegedly killed by wife in Mardan: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A woman on Thursday allegedly gunned down her husband, a motorway cop, in the Mian Khan area of Khyber Pakhtunkhwa’s Mardan district, according to police.\n\nMardan police spokesperson Faheem Khan told Dawn.com, “The suspect has been arrested and a first information report (FIR) has been registered at the Baizai police station.”\n\nThe FIR, registered under Section 302 (murder) of the Pakistan Penal Code (PPC) and seen by Dawn.com, states that the complainant, the slain police official’s elder brother, alleged that he was asleep in his room when gunshots were heard in the house.\n\n“When my wife and I went inside, we found my brother’s wife with a pistol in her hand, while he was lying in a pool of blood,” the complainant alleged, adding that the victim succumbed to his injuries while being transported to a hospital in Katlang.\n\n“There have been domestic disputes between them since they got married and they used to fight regularly,” the complainant added in the FIR.\n\nIncidents of homicides are frequently reported in various parts of the country. According to the Free and Fair Election Network (Fafen), Punjab, KP, and Sindh are among the regions with a higher number of murder FIRs.\n\nA day ago, Punjab police said they arrested a suspect in Okara for the alleged murder of his wife last month.\n\nThe FIR of the incident was registered at Okara’s Renala Khurd Saddar Police Station at the complaint of the woman’s father under Section 302 of the PPC on May 19. According to the FIR, the complainant found his daughter murdered with her throat slit when he reached his son-in-law’s home with the latter lying unconscious on the ground in an injured state as well.\n\nLast month, a man and his two sons were shot dead in Mardan district, police and rescue officials said, adding that the five suspects had fled the scene.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:54:01.411Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916751/motorway-cop-allegedly-killed-by-wife-in-mardan-police",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T15:54:34.000Z"
}
