{
  "title": "CAIE to share findings of inquiry report on O/A level paper leaks with NA panel - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A parliamentary panel was assured on Wednesday that findings of the inquiry report over the issue of alleged paper leaks of O/A level will be shared after June 16.\n\nThis assurance was given by Country Director of Cambridge Assessment International Education Uzma Yousuf to the subcommittee of the National Assembly Standing Committee on Education, which met at the education ministry with MNA Sabheen Ghoury in the chair. She said everything will be clearer during the inquiry.\n\nOn the other hand, during the meeting, MNA Mohammad Ali Sarfraz, who attended the meeting as special invitee, pointed out that several papers were leaked. He also presented paper codes and video evidence to the subcommittee. The committee also stated that in case papers are leaked, the committee will ensure no loss to students, and if paper/s are retaken, they should be retaken immediately so that students can get their results in August this year.\n\nThe committee also decided to hear school heads, who, besides British Council, also conduct O/A level exams, in the next meeting.\n\nSubcommittee to probe cost, frequency of CAIE exams held in Pakistan\n\nRecently, the subcommittee was formed to look into the issues relating to A level papers leaked in examinations conducted by Cambridge Assessment International Education (CAIE) in Pakistan during 2025.\n\nThe subcommittee is also supposed to look into the authority and legal cover under which CAIE is conducting examinations in Pakistan, the number of examinations per year, the number of students per year, and cost of each examination. Whereas, it will also look at any remedies and measures taken by CAIE in the past on such incidents of leakage of question papers.\n\nThe terms of reference of the subcommittee stated that after hearing all sides, actions will be finalised to safeguard students and get assurance from the CAIE that befitting measures will be taken to compensate students and avert such incidents in future.\n\n“Since today was the first meeting, we got an important briefing, in the next meeting, the CAIE will provide findings of its inquiry report,” said a participant of the meeting.\n\nIt is relevant to note here that the main committee, which formed the said sub-committee, in its last meeting had raised alarm over the alleged leaking of Cambridge University’s Advanced Level (A-Level) examination papers in Pakistan, stating that the issue of leaked paper has put the academic future of bright students in jeopardy.\n\nHeaded by MNA Dr Azimuddin Zahid Lakhvi, the main committee had shown its grave concerns over report of leaked papers. The committee had pointed out an alleged incident of leaked paper had raised questions on the integrity of the examination process of Cambridge University in Pakistan. The committee had urged relevant authorities to address these critical concerns promptly.\n\nWhereas, recently, a press release shared by the Country Director of Cambridge Assessment International Education with Dawn stated: “We are aware of alleged leaks of specific exam questions and we fully understand the concerns and frustration these claims cause students and their families. We would like to reassure you that our legal compliance teams will urgently investigate all evidence thoroughly so that results are fair.”\n\nIt also claimed, “We have seen a significant amount of fake information, including scam circulation on social media, and we don’t comment on specific allegations during exam series, we don’t want to distract students at an important time.”\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:33:03.058Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916604/caie-to-share-findings-of-inquiry-report-on-oa-level-paper-leaks-with-na-panel",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T02:47:10.000Z"
}
