{
  "title": "Budget 2025-26: After sugar, FBR sets its sights on tobacco sector - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Langrial says new 15pc tax rate on passive income aims to address disparity with active business earnings\n• Political leadership and intel agencies’ help enlisted to ensure compliance, root out corruption\n\nKARACHI: Federal Board of Revenue (FBR) Chairman Rashid Mahmood Langrial on Wednesday detailed a sweeping overhaul of the country’s tax compliance system, vowing to crack down on non-compliant sectors, expand digital monitoring, and address longstanding loopholes in the tobacco, retail and passive income tax regimes.\n\nSpeaking to Geo News, Mr Lan­g­rial said that the government’s re­­cent enforcement drive in the sugar sector had resulted in a 39 per cent increase in tax collection without any change in tax rates, and that si­­milar measures are now being rol­led out across other key industries.\n\n“The story of non-compliance in the tobacco sector will fundamentally change, just as it did in sugar,” he said.\n\nHe acknowledged that raising tax rates on the formal sector often led to market erosion by the informal sector, but said the government’s solution is to target non-compliant businesses directly.\n\n“Sugar mills that were non-compliant have gone out of business due to our monitoring. We are now achieving almost 100 per cent compliance in most parts of the country,” Mr Langrial said.\n\nHe also revealed that the Intelligence Bureau was tasked with monitoring FBR teams to prevent collusion and corruption. “Thanks to the IB, we took several actions against black sheep within our own ranks,” he said.\n\nMr Langrial said similar monitoring has begun in the poultry sector, where initial checks revealed significant under-reporting of production and tax evasion. “One month of monitoring revealed millions of rupees in income tax evasion,” he said.\n\nOn the issue of passive income, Mr Langrial said a new 15pc tax rate on passive income, compared to 29pc on active income, in an effort to address the bias against business investment and encourage investment.\n\nMr Langrial also addressed comparisons between the salaried and construction sectors, noting that such comparisons are misleading.\n\n“There exists a salaried sector inside construction, and sectors can’t be compared with types of income,” he said, emphasising the complexity of tax policy across different industries.\n\n“We are saying that a person who has Rs50 million in the bank will be taxed at 15pc. This is an attempt to address the discrimination between active and passive income,” he said.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/12105748ae68d52.jpg",
  "retrievedAt": "2025-08-20T03:54:06.331Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916650",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T02:43:17.000Z"
}
