{
  "title": "Israeli strikes kill 60 in Gaza - World - DAWN.COM",
  "author": null,
  "content": "• Most casualties occur near GHF aid distribution centre\n• France-based charity accuses Tel Aviv of deadly strike on its office building\n\nCAIRO: Israeli gunfire and airstrikes killed at least 60 Palestinians in Gaza on Wednesday, most of them near an aid site operated by the US- and Israeli-backed Gaza Humanitarian Foundation in the centre of the enclave, local health officials said.\n\nMedical officials at Shifa and Al-Quds hospitals said at least 25 people were killed and dozens wounded as they approached a food distribution centre near the former Jewish settlement of Netzarim before dawn.\n\nIsrael’s military said its forces fired warning shots overnight towards a group of suspects as they posed a threat to troops in the area of the Netzarim Corridor.\n\n“This is despite warnings that the area is an active combat zone. The IDF is aware of reports regarding individuals injured; the details are under review,” it said.\n\nLater on Wednesday, health officials at Nasser Hospital in Khan Younis in the southern Gaza Strip said at least 14 people had been killed by Israeli gunfire as they approached another GHF site in Rafah.\n\nThe foundation said it was unaware of Wednesday’s incidents but added that it was working closely with Israeli authorities to ensure safe passage routes are maintained, and that it was essential for Palestinians to closely follow instructions.\n\n“Ultimately, the solution is more aid, which will create more certainty and less urgency among the population,” it said by email in response to Reuters questions.\n\n“There is not yet enough food to feed everyone in need in Gaza. Our current focus is to feed as many people as is safely possible within the constraints of a highly volatile environment.” In a statement, GHF said it distributed 2.5 million meals on Wednesday, the largest single-day delivery since it began operations, bringing to more than 16 million the number of meals provided since its operations started in late May.\n\nGaza’s health ministry says that since then, 163 Palestinians had been killed and over 1,000 wounded trying to obtain the food boxes.\n\nThe United Nations has condemned the killings and has refused to supply aid via the foundation, which uses private contractors with Israeli military backup in what they say is a breach of humanitarian standards.\n\nElsewhere in Gaza on Wednesday, its health ministry said at least 11 other people were killed by separate Israeli gunfire and strikes across the coastal enclave.\n\nIsraeli Prime Minister Benjamin Netanyahu said on Tuesday there had been “significant progress” in efforts to secure the release of the remaining hostages in Gaza, but that it was “too soon” to raise hopes that a deal would be reached.\n\nTwo Hamas sources told Reuters that they did not know about any breakthrough in negotiations.\n\nViolation of international law\n\nMedical charity Medecins du Monde on Wednesday accused Israel of violating international law with drone strikes on a building housing one of its offices in war-torn Gaza that killed eight people, none of them staff.\n\nThe France-based aid group said in a statement the attack on Tuesday “constitutes a serious violation of international humanitarian law, which protects both civilian populations and humanitarian organisations operating in conflict zones”.\n\nThe Israeli military did not immediately respond to a request for comment.\n\n“Yesterday morning, at around 11am local time, a building in Deir el-Balah housing a Medecins du Monde office was attacked by drones,” the aid group said.\n\nIts staff had not been present as they had been off as part of the Eid al-Adha holiday, it added.\n\n“At least eight people were killed in the bombardment. All were on the last floor of the building,” it said, without providing more details on those killed.\n\n“Medecins du Monde had informed the Israeli military of the presence of its office, which had officially been declared ‘deconflicted’, or shielded from Israeli military attacks under humanitarian coordination agreements,” it said.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/12081616c9fdd62.jpg",
  "retrievedAt": "2025-08-20T03:54:35.814Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916656/israeli-strikes-kill-60-in-gaza",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T02:43:07.000Z"
}
