{
  "title": "Importers hastily raise prices of solar power systems - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Shopkeepers have raised the prices of solar panels, even though the government’s decision to impose an 18 per cent sales tax on solar panel imports will take effect on July 1, pending the formal approval of the budget before the end of the year.\n\nTraders at Regal Chowk in the Saddar area blamed importers for raising prices. They said many consumers appeared upset over the sudden price shock after the budgetary measure, while some customers made the purchases amid uncertainty in prices.\n\nThey said many families who came to buy solar panels left after learning about an abrupt price jump.\n\nOne of the traders has quoted the price of a 5kW set (including inverter, water-based battery, iron frames, electric wiring and installation charges) at Rs600,000-700,000 followed by Rs400,000-500,000 for 3kW and Rs700,000-800,000 for 6kW system.\n\nSurge in equipment costs shocks buyers\n\n“We are forced to raise prices for buyers after importers increased costs due to the 18pc GST imposed on solar panel imports, and we are not responsible for these price increases,” the trader stated.\n\nAnother trader at Regal Chowk said that the price of a 5kW system is Rs800,000-850,000 with a lithium battery. Before the unveiling of the FY26 budget, this system was available at Rs700,000-750,000.\n\nA 3kW system with a lithium battery is priced at Rs750,000, while the same with a water battery can be purchased for Rs350,000-400,000.\n\n“Prices vary depending on the branded battery, inverters and solar panels, which also carry a warranty of two to three years,” he said, adding that many shopkeepers sell comparatively low-quality items without any warranty compared to branded gadgets.\n\nTraders stated that the market is flooded with Chinese brands, as there were no locally assembled panels available, adding that higher prices may supress demand for solar panels.\n\nEncouraging local manufacturing\n\nOffering a different view, Inverex Solar Energy Chief Executive Officer M. Zakir Ali welcomed the government’s proposal to impose an 18pc sales tax on imported solar panels, calling it a positive move towards encouraging local manufacturing.\n\nHowever, he emphasised that tax alone is not enough and warned of potential negative consequences without broader policy reforms.\n\n“While we appreciate the government’s intention, the real game-changer would be introducing tax-free initiatives for local manufacturers,” Mr Ali remarked, stressing the need to eliminate or significantly reduce duties on imported raw materials, machinery, and equipment to ensure cost-effective and competitive local production.\n\nHe also proposed a 5pc protective duty on finished imported panels and urged the government to facilitate access to technology, skilled labour development, and simplified financing for investors.\n\n“Without supportive measures like tax-free zones, the 18pc tax could trigger a rise in smuggling through grey channels, destabilising the market,” he cautioned.\n\nHe was of the view that some two to three solar panel manufacturers have emerged, but their volume is insufficient to cater to the huge demand.\n\n“It will take one or two years more for the set up of local assembly of solar panels. Once the local assembly starts, it will also help in solar panel exports,” Zakir said.\n\nPublished in Dawn, June 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684a46f56f4ca.jpg",
  "retrievedAt": "2025-08-20T03:54:06.490Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916680/importers-hastily-raise-prices-of-solar-power-systems",
  "dateList": "2025-06-12",
  "date_published": "2025-06-12T03:16:29.000Z"
}
