{
  "title": "PMD advises authorities to remain alert during monsoon rains starting from June 30",
  "link": "https://www.app.com.pk/national/pmd-advises-authorities-to-remain-alert-during-monsoon-rains-starting-from-june-30/",
  "date_published": "2022-06-28T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP): Pakistan Meteorological Department (PMD) has advised all the concerned authorities to remain alert in wake of monsoon rains starting from June 30 in most parts of the country.\nThe moist currents from Arabian Sea and Bay of Bengal are likely to enter the upper parts of the country from June 29 (Wednesday) which may intensify and expand to southern parts of the country by the end of this week.\nUnder the influence of this, rain-windstorm/thundershower is expected in Islamabad, Kashmir, Gilgit Baltistan, Swat, Mansehra, Kohistan, Abbottabad, Haripur, Peshawar, Mardan, Swabi, Nowshera, Rawalpindi, Murree, Attock, Chakwal, Jhelum, Sargodha, Hafizabad, Mandi Bahuddin, Sialkot, Narowal, Lahore, Gujranwala, Gujrat, Sheikhupura, Faisalabad, Jhang, Toba Tek Singh, Okara, Sahiwal and Bahawalnagar from June 30 to July 4. Isolated heavy falls are also expected during the period.\nRain-windstorm/thundershower with isolated heavy falls are expected in Karachi, Hyderabad, Thatta, Badin, Dadu, Zhob, Ziarat, Barkhan, Loralai, Kohlu, Quetta, Kalat, Khuzdar, Lasbela, Naseerabad and Sibbi from July 01-05.\nAbout the possible impact of rain, the met office warned that heavy falls may generate urban flooding in Islamabad, Rawalpindi, Lahore, Gujranwala, Sialkot, Faisalabad from July 02-04 while in Karachi and Hyderabad from July 03-05.\nFishermen are advised to remain careful due to rough sea conditions from July 03-05.\nFlash flooding is also expected in local nullahs of Kashmir, Khuzdar, Lasbela, Naseerabad, Awaran, Barkhan and Kohlu during the forecast period.\nHeavy rainfall may trigger landslides in Kashmir, Galiyat and Murree. The rising temperatures are likely to subside during the forecast period. Windstorms may damage loose structures at vulnerable locations.\nRainwater will be beneficial for the sowing of rice crops.\nTravelers and tourists are advised to remain extra cautious during the forecast period.",
  "retrievedAt": "2025-08-11T15:09:58.471Z"
}
