{
  "title": "Global rights bodies call for immediate release of Mohammad Zubair, end to harassment",
  "link": "https://www.app.com.pk/global/global-rights-bodies-call-for-immediate-release-of-mohammad-zubair-end-to-harassment/",
  "date_published": "2022-06-28T17:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 28 (APP): Amnesty International and Committee to Protect Journalists (CPJ) on Tuesday called upon the Indian government to immediately and unconditionally release Mohammed Zubair, co-founder of ALT News, and end their relentless harassment of journalists, human rights defenders, and activists.\n“His arrest is a clear violation of the right to freedom of expression, abuse of power by the authorities and sends a message that dissent is not tolerated in the country,” Aakar Patel, chair of board for Amnesty International India, said in a press statement.\nMohammed Zubair, co-founder of ALT News, an independent fact-checking website was arrested by the Delhi Police late on Monday night for allegedly ‘hurting religious sentiments’ and  ‘promoting enmity’ with his satirical tweets criticizing the rising censorship and calling out discrimination against minorities during the tenure of Prime Minister Narendra Modi.\nPratik Sinha, another co-founder of ALT News who was present at the police station with him tweeted that they had not been given a copy of the FIR and the Delhi police was taking Mohammed Zubair to an undisclosed location.\nPresident of the Committee to Protect Journalists (CPJ) Jodie Ginsberg, on her Twitter handle, said that the arrest of journalist Mohammad Zubair marked another low for press freedom in India, where the government had created a hostile and unsafe environment for members of the press reporting on sectarian issues.”\n“The Indian authorities are targeting Mohammed Zubair for his crucial work combatting the rise in fake news and disinformation and calling out discrimination against minorities. The arrest of Mohammed Zubair shows the danger facing human rights defenders in India has reached a crisis point,” she posted a tweet.",
  "retrievedAt": "2025-08-11T15:09:53.933Z"
}
