{
  "title": "Wani calls for world’s cognizance of India’s apartheid regime’s onslaught against Pak Army Chief’s statement on Kashmir",
  "link": "https://www.app.com.pk/national/wani-calls-for-worlds-cognizance-of-indias-apartheid-regimes-onslaught-against-pak-army-chiefs-statement-on-kashmir/",
  "date_published": "2023-04-08T09:13:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Apr 08 (APP): Senior leader of All Parties Hurriyat Conference (APHC) Altaf Hussain Wani, while voicing his serious concerns over the worsening situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), urged the world community to take effective cognizance of India’s apartheid regime’s double-edged onslaught against Kashmiri people.\nTalking to this APP Correspondent on Saturday, Wani, while referring to the ongoing witch hunt and victimization of political activists at the hands of the occupation authorities, said that the Modi government had let loose its forces and secret agencies to harass and humiliate Kashmiri political activists.\nHe said that on the one hand, the Indian forces and secret agencies were raiding the houses of the Hurriyat leaders and activists, while on the other hand, the worst violations of human rights by the Indian occupation authorities continue unabated.\nHe said that under the garb of encroachment, Kashmiris were being forced out of their homes and deprived of their rightful possessions.\nThe sale of Kashmir’s land to non-state residents, he said, has reduced Kashmiris as second-class citizens in their own homeland. Denouncing the illegal detention of the Hurriyat leadership, the APHC leader said that ruthless suppression of democratic dissent and a massive crackdown against Hurriyat leaders had created a climate of fear in the region.\nExpressing his anguish over the continued bloodshed and mayhem in the occupied territory, he said that it was high time that the international community should take effective notice of the worsening political and human rights situation in the region and play its much needed role to help resolve the lingering dispute, which he said was the main cause and consequence of the rights violations in the region.\nHe, however, maintained that such colonial-era tactics by India cannot deter Kashmiris from pursing the collective cause for which they have rendered matchless sacrifices. He said that the valiant Kashmiri people were fully determined to take the ongoing freedom movement to its logical conclusion at all costs.\nMeanwhile, the APHC leader Altaf Hussain Wani appreciated the Chief of Army Staff General Asim Munir’s recent statement on Kashmir, saying that the army chief’s categorical stance on the issue has sent a positive message across the line of control.\nHe said that reiteration of solidarity and support for the cause of Kashmir has generated a wave of optimism in occupied Kashmir besides boosting the morale of the freedom-loving people in the region.",
  "retrievedAt": "2025-08-11T08:14:54.677Z"
}
