{
  "title": "Undertaking massive uplift programs legacy of PML-N: Interior Minister",
  "link": "https://www.app.com.pk/national/undertaking-massive-uplift-programs-legacy-of-pml-n-interior-minister/",
  "date_published": "2023-04-08T18:53:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Apr 08 (APP): Federal Interior Minister Rana Sana Ullah Khan has said that steering Pakistan out of crisis and undertaking massive uplift programs is the legacy of the Pakistan Muslim League-Nawaz (PML-N) and its would once again play its role and put Pakistan on the road of progress and prosperity.\nHe was addressing a public gathering at Aminpur Bungalow while inaugurating construction of a road from Aminpur to Mazara Bridge here on Saturday. This project would be completed with an estimated cost of Rs.121.629 million.\nHe said that PML-N had very limited time. In Punjab, it had only 2 to 2.5 months but despite of the time constrained, the party had tried its best to undertake maximum development and welfare projects.\nHe added that Bypass Road from Sargodha Road to Sammundri Road via Jhang Road had been completed with an estimated cost of Rs.2500 million. Similarly, our focus remained on important roads and Aminpur Road was also completed within this short tenure.\nThe minister said that gas supply to 22 villages of this constituency had been approved and work to lay pipeline had also been started. Each village in this constituency would get gas facility, he claimed.\nHe said that Chief Executive Officer (CEO) Faisalabad Electric Supply Company (FESCO) and Chairman Board of Directors (BoD) FESCO were present in this meeting and he had been directed to accomplish all electricity-related development projects within a period of one month. “I am going to establish my office on Bypass and very soon I will invite you to visit this office”, he said and added that voters of this constituency could also visit and inform me about lack of facilities in their villages.\nContinuing, the Interior Minister said that PML-N came into power in most critical situation and now it was trying to drag out Pakistan from the crisis.\nHe said that PML-N had track record of delivering to the nation. “In 2013, we eliminated the menace of load shedding and flushed out terrorists.” The country was progressing at the rate of 6.2 percent, but our government was eliminated through an undemocratic conspiracy.\nHe said that Pakistan was a democratic country and democratic forces gave equal respect to the individuals who had not voted them but Imran Khan instigated his followers to subject his political opponents to oppression and political victimization.\nHe (Imran) also used undemocratic attitude and during his four-year rule, he never had a meeting with the opposition leaders. On the contrary, he subjected his opponents to false cases. “I was also implicated in a false case and even my opponents were not justifying such type of case against me”, he added.\nRana Sana Ullah said that Imran daily registered an FIR of his murder. “I asked him to give up from such attitude as anyone could kill him and put its onus on the political opponents.\nHe further said that Imran Khan failed to give any tangible policy whereas we have a number of development projects at our credit. PML-N constructed motorways, established universities and hospitals to facilitate the masses but Imran only claimed to offer 10 million jobs and 5 million houses but actually his thirst was on politics of victimization.\nImran was the person who had claimed that he would not go to International Monetary Fund (IMF) but prefer to die but he did the same and due to his commitments with IMF, the whole country is suffering from its ill-impacts, the minister said. He said that oil and dollar were touching the threshold of Rs.300. The current inflation was only due to the conditionalities imposed by the IMF.\nHe said that history was witness that PML-N boldly faced the challenges during atomic explosion, load shedding and terrorism but overcame this situation. People had full faith in PML-N as it had always dragged out the country from crisis and would once again put it on the road to progress and prosperity, he added.\nHe also urged the people to repose confidence in PML-N so that we could regain our lost glory.  “For this purpose, the people should also eliminate Imran Khan with the power of their vote”, he added.",
  "retrievedAt": "2025-08-11T08:14:50.293Z"
}
