{
  "title": "Haqqani calls for united platform to bring Pakistan out of political, economic crisis",
  "link": "https://www.app.com.pk/national/haqqani-calls-for-united-platform-to-bring-pakistan-out-of-political-economic-crisis/",
  "date_published": "2023-04-08T17:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 8 (APP): Jamiat Ulema-e-Islam (Sami) and Difa-e-Pakistan Council Chairman Maulana Hamid Ul Haq Haqqani on Saturday proposed a united platform to bring Pakistan out of the prevailing political and economic crisis with mutual understanding and efforts.\nAddressing a conference titled ‘Stability of Pakistan And Our Responsibilities’ here at a local hotel, he said an inclusive body should be constituted across the board in a bid to save Pakistan from internal and external conspiracies being hatched to destabilize it socially, politically and economically through all possible means.\nHe was of the view that we should be on one page to deal with enemies nefarious designs making it clear that Pakistan had no threats from Afghanistan as it was a brotherly country but there were certain foreign agents who disguised themselves as Muslims attack on national security institutions and religious places to misbalance the social, political and religious cohesion in the country.\nHe said there was a representation of all faiths including Christian, Hindu and Sikh communities in Difa-e-Pakistan to express solidarity with the country to make the world that they were equal citizens of the state and their rights were completely enshrined in the Constitution.\nMeanwhile, Mashaykh and Ulema Council Chairman Maulana Fazl-ur-Rehman Khalil said the aim of this conference was to unite all the religious and political parties at one platform and take practical steps to improve the country’s political and economic conditions.\nHe said since the day Pakistan had become an atomic power, it was not being digested by some international powers and they were playing their part to destabilize it through political instability, economic meltdown and creating division between public and national security institutions.\nHe said an organized campaign was going on against our defense institutions and its leadership which they would not let it succeed at all costs under the umbrella of Difa-e-Pakistan Council.\nMember of Legislative Assembly, Azad Jammu and Kashmir Maulana Peer Mazhar Saeed Shah said after Islamic values, Pakistan and its security institutions were their redline, and they would defend them through thick and thin.\nHe announced that after Eid-ul-Fitr, they were going to launch a massive campaign for peace and prosperity in the country.\nEarlier, Former Prime Minister of Azad Jammu and Kashmir Sardar Attique Ahmed Khan said it was crucial to adopt a pragmatic approach to resolve Pakistan’s current crisis.\nHe said by dragging Pakistan into a political and economic crisis, non-state actors were trying to impose their policies and leadership in the country.\nHe proposed the government to adopt austerity measures to bring the country out of prevailing political and economic crisis.\nTehrik Jawanan Pakistan Chairman Abdullah Hamid Gul said the Pakistan’s economy was damaged on the day when the Governor of State Bank was appointed on the whims of the International Monetary Fund.\nHe invited the Pakistan Tehreek-e-Insaf’s leadership to come forward and lend a helping hand to legislate against the interest-based economic system in the country.\nAllama Muhammad Ahmad Ludhyanvi said Pakistan was passing through a crucial phase of life and at this moment of trials and tribulations, they were bringing a message of hope for the disappointed and dejected people of the country.\nHe said if someone plots against our security institutions and motherland, the Difa-e-Pakistan Council would leave no stone unturned to give a befitting response.\nHe categorically stated that Pakistan was created in the name of religion and religious parties would save it from all evil eyes.",
  "retrievedAt": "2025-08-11T08:14:50.222Z"
}
