{
  "title": "Payment process under Ehsaas Emergency Cash Program begins",
  "link": "https://www.app.com.pk/national/payments-started-under-ehsaas-emergency-cash-program-dr-nishtar/",
  "date_published": "2020-04-08T22:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 09 (APP):The payment process under Ehsaas Emergency Cash Program on Thursday started to support the deserving families affected by the lockdown, strictly following the precautionary measures.\nSufficient measures have been taken to ensure the safety and security of the Ehsaas Emergency Cash beneficiaries arriving to collect cash assistance.\nThe biometrically enabled payment operation commenced at 17,000 digital payment points countrywide across all provinces including Gilgit Baltistan, Azad Jammu and Kashmir and Islamabad Capital Territory.\nAll these cash transfers are being made after biometric verification of each beneficiary through National Database Registration Authority (NADRA).\nUnder the Ehsaas Emergency Cash framework, an immediate cash relief of Rs 12,000 will be extended each to families of daily wage earners, whose livelihood has been badly affected by the corona-induced economic downturn.\nOverall, Rs 144 billion will be disbursed among 12 million families during the next two and a half weeks, said a news release issued here.\nFor now, as many as 46.38 million people have sent SMS requesting to become beneficiaries of Ehsaas Emergency Cash Program.\nTo ensure Corona protective measures across payment operations, special disbursement arrangements have been put in place in close coordination with provincial governments.\nThe social distancing measures stringently implemented include opening of payment points at open public spaces with multiple cash counters along with security for these spaces, permission to keep retail point of sale agents open, management of crowds at cash disbursement points and ensuring preventive measures like facility of hand washing etc.\nPeople are collecting cash from biometrically enabled payment points of Habib Bank in Punjab, Sindh and Balochistan and Bank Al Falah across Khyber Pakhtunkhwa, Gilgit Baltistan and Azad Jammu and Kashmir.\nTo monitor the payment operations, Dr. Sania Nishtar, Prime Minister’s Special Assistant on Social Protection and Poverty Alleviation visited HBL Konnect outlets in Bari Imam area of Islamabad and met spouses of piece rate workers who had gathered to collect cash handouts under the Ehsaas Emergency Cash Program.\nInteracting with deserving women, Dr. Nishtar said, “Ehsaas has initiated the cash stipend payments to provide instant provide relief to the daily wagers whose livelihoods have been badly affected. This assistance is meant to help them buy rations so that they do not go hungry. We have advised partnering banks to ensure sanitization at all touch points serving payments.”\nFor registration in Ehsaas Emergency Cash, the deserving families can send SMS to 8171 service or can visit web-portal: ehsaas.nadra.gov.pk to check eligibility.\nFollowing registration, there are three types of messages in response of people’s SMS like eligible, ineligible, or case under scrutiny.\nCorona Tiger Relief Force will also facilitate to register daily wagers, piece-rate workers and labourers who are unable to register through SMS for Ehsaas cash disbursement program.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:04:28.684Z"
}
