{
  "title": "Govt policies focused on providing relief to general public, especially poor : Firdous",
  "link": "https://www.app.com.pk/national/govt-policies-focused-on-providing-relief-to-general-public-especially-poor-firdous/",
  "date_published": "2020-04-09T03:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 09 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Thursday said focus of government policies was to provide relief to general public, especially poor and deserving segments of the society.\nAddressing joint press conference along with Managing Director Utility\nStores Corporation Umar Lodhi, she said present government would\nstand by the masses during this difficult juncture.\nShe said the government was taking maximum steps to control spread\nof coronavirus in the country with the assistance of provincial governments\nand other stakeholders.\nThe SAPM said Cash Emergency Transfer Scheme of Ehsas programme,\nhad been inaugurated by the Prime Minister and Rs.12,000 cash-grant was\nbeing provided to the 12 million deserving families across the country.\nShe said under the cash programme, Rs. 144 billion will be distributed\namong the deserving families and added supply of essential commodities\nto the public will be ensured at the chain of Utility Stores Corporation which\nwas playing an important role in this regard.\nShe said the government has extended the relief package at Utility\nStores till Eid-ul-Fitr.\nShe said earlier subsidy was being given on five items but now 19 items will be available at discounted prices. She said that Rs 2.5 billion package has been approved for Utility Stores which could be enhanced to Rs 7 billion as per requirement.\nDr Firdous said under the Prime Minister’s relief package, Rs 10 billion have been allocated for USC to ensure availability of daily-use items at affordable prices.\nReplying to a question of media persons, she said that Corona Welfare Fund of the Prime Minister was being launched to look after the vulnerable segments of the society.\nTo another question, she said that policies of the government were being reviewed regularly at the meetings of National Coordination Committee, headed by the Prime Minister, and strategy for relief could be modified when deemed necessary.\nShe appreciated the role of philanthropists in fight against coronavirus.",
  "retrievedAt": "2025-08-11T19:04:22.131Z"
}
