{
  "title": "Pakistani nation to confront unprecedented situation of COVID-19 with unity: PM",
  "link": "https://www.app.com.pk/national/pakistani-nation-to-confront-unprecedented-situation-of-covid-19-with-unity-pm/",
  "date_published": "2020-04-09T07:55:00.000Z",
  "source": "APP",
  "content": "QUETTA, Apr 9 (APP):Prime Minister Imran Khan Thursday said the whole world was confronted with an unprecedented situation after the outbreak of COVID-19 and Pakistani nation would fight coronavirus with unity.\nTalkig to the Balochistan Cabinet and members of the Parliament during his day-long visit to Quetta, he said, “It is an unprecedented situation and as a nation we will confront it.”\nHe said as coronavirus cases were being increased worldwide and expressed fear that the number of such cases in Pakistan would be increased at the end of April which would put more pressure on hospitals.\nHe said the government was fully focusing on providing personal protection equipments (PPEs) and other related tools to doctors and paramedical staff at the hospitals, adding that such equipments had been provided to all those working at the intensive care units.\nHe said there was shortage of ventilators and testing kits worldwide but the government was utilizing all its resources to import them on emergency basis.\nThe prime minister said the National Command and Control Centre for Covid-19 was in constant touch with all the chief ministers for effective coordination to control the spread of the virus.\nHe expressed his pleasure that there was no patient of coronavirus in Balochistan in the intensive care units. The prime minister said the coronavirus would have less impact in Balochistan except Quetta as the province had scattered population.\nContrary to it, he said, the Covid-19 would have greater impact in big cities like Karachi, Lahore and Faisalabad and so on.\nThe prime minister reiterated that the complete lockdown was badly affecting the low-income and laborer community particularly in Balochistan as majority of the people here were already living below the poverty line.\nHe said the provincial governments themselves would decide about the lockdown according to their situation on April 14.\nHe said the federal and provincial governments were in coordination to tackle the pandemic as no single government could tackle it alone.\nEarlier, during his day-long visit, the prime minister visited quarantine centre at Bolan Medical College Hospital Quetta.\nThe prime minister was accompanied by Balochistan Chief Minister Jam Kamal Khan, Deputy Speaker National Assembly Qasim Khan Soori and Sardar Yar Muhammad Rindh.\nBalochistan Chief Secretary briefed the prime minister about the isolation ward and quarantine centre. The prime minister was also given a briefing on Covid-19 situation in Balochistan and the steps being taken to contain the spread of virus.\nBalochistan Governor Justice (retd) Aman Ullah Khan and Chief Minister Jam Kamal Khan called on Prime Minister Imran Khan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:04:17.597Z"
}
