{
  "title": "Additional gas being provided to K-Electric for curtailing load-shedding: Senate told",
  "link": "https://www.app.com.pk/national/additional-gas-being-provided-to-k-electric-for-curtailing-load-shedding-senate-told/",
  "date_published": "2020-07-16T23:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP):Minister for Power Division Omar Ayub Khan on Friday informed the Senate that the government was providing 290 Million Cubic Feet per day (MMCFD) against 190 MMCFD quota besides provision of 80 per cent Residual Fuel Oil (RFO) of total production to K-Electric to curtail power load-shedding in Karachi.\nResponding to various supplementary questions during Question Hour, the minister said the K-Electric was a private company and its total power demand stood at 3400 MW. The government was ready to provide additional power to K-Electric from the national grid station but no investment was made in distribution system of the company during the past 10 years, he said.\nThe minister said K-Electric and NTDC were also being pressed to set up 500 kV grid station and distribution points.\nHe said at present, there was no shortfall of electricity as sufficient generation was available to meet with demand of electricity in the country.\nHence, no load shedding was being carried out in the country due to generation shortfall at present. However, the minister said load management was being carried out by distribution companies (DISCOS) on the basis of Aggregate Technical & Commercial losses recorded on each feeder in compliance to directives of the Federal Cabinet. Shut downs were being carried out on 11kV feeders for annual/scheduled maintenance which were duly publicized in electronic / print media.\nHe said for load management monitoring an automatic metering system had been installed on all Grids/Feeders of the country.\nThe hourly schedule of load management was being fed into the system and all feeders are monitored 24/7 using this system, he added. The minister said any consumer could check its load management schedule and actual loadshedding status by using Roshanpakistan.pk website or Roshan Pakistan Mobile App.\nTo another question, Omar Ayub said some posts of linemen and assistant linemen were lying vacant in various DISCOs and process had already been started to fill the vacant posts.\nHe said record over 23,000 MW was being transmitted through distribution companies. Some 80 per cent feeders had been cleared from power pilferage and efforts were being made to clear remaining 20 per cent feeders, he added.\nTo a question the minister said that government has intention to hand over Quetta Electric Supply Company to Balochistan government. Renewable Energy Projects including solar and wind having over 8,000 MW capacity were planned to set up in Balochistan, he added.\nTo a separate question, the minister said the Arbitral Tribunal of the International Centre for Settlement of Investment Disputes (ICSID) issued an award against Pakistan and in favour of Tethyan Copper Company Limited (TCC) in the Reko-Diq Case for an amount of $ 4.087 billion as compensation along with legal costs and interest (to the sum of US$ 5.912 Billion).\nPakistan has submitted an application for Annulment of this Award and the ICSID Secretariat has provisionally stayed the enforcement of the Award while registering this application on 18 November 2019, he added.\nSince the legal recourse against the ICSID Arbitral Tribunal’s Award and ICC proceedings were yet to follow and being a sensitive issue, open/public discussion on the case does not seem appropriate/advisable, he added.\nHe said TCC had initiated enforcement proceedings in several jurisdictions, however, as the Award stands suspended because of the provisional stay on its enforcement, the risk of Pakistan’s vulnerable assets abroad has been safeguarded.\nPakistan’s legal team, headed by the office of the Attorney-General was contesting enforcement proceedings and considering further legal remedies to permanently safeguard Pakistan’s interests, he added.\nTo a separate question, Omar Ayub the work for construction of 220 kV Double Circuit Transmission Line Dera Ismail Khan – Zhob has been commenced on May 31, and the tentative date for the completion of the project was November 16, 2021.\nThe PC-I for construction of 132 KV Grid Station at Kan Mehtarzai with allied 132 kV Double Circuit transmission line had not yet been approved from CDWP (Central Development Working Party). As and when the project got approved from competent forum and funds made available the construction of the said grid station would be executed by QESCO.\nHe said work for construction of 220 kV grid station Zhob had been awarded to M/s China Energy Engineering Group Jiangsu Power Design Institute Co. Ltd. under ADB Loan. However, work could not be commenced due to non-acquisition/handing-over of land which was pending with Deputy Commissioner / Collector Zhob although the payment amounting to Rs.80 Million had been made.",
  "retrievedAt": "2025-08-11T19:30:41.708Z"
}
