{
  "title": "Experts see Covid-19 as opportunity for adapting to virtual learning",
  "link": "https://www.app.com.pk/national/experts-see-covid-19-as-opportunity-for-adapting-to-virtual-learning/",
  "date_published": "2020-07-17T01:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP):Experts see Covid-19 as an opportunity and emphasized for adapting to change and pay immediate attention on improving our technological infrastructure accordingly to avail the opportunities that After-Covid19 world offers in the field of learning and development.\nThe experts on learning and development from various national and international institutions said this while sharing their views with the participants at online dialogue ‘Learning and Development in a Virtual World beyond COVID19’ organized by the Sustainable Development Policy Institute (SDPI) here on Friday.\nRegional Head Europe, Institute of International Education (IIE), USA, Dr Cheryl Francisconi, while terming the pandemic time as an incredible opportunity for the learning in the virtual space said that the learning and training now need to be aligned with this newly created space, said a statement .\n“We need to adapt to new reality with the best use of technology.” Dr Francisconi said.\nShe added further that a culture of learning from each other needs to be created. Besides, making virtual learning more participatory and interactive and redressing the connectivity issues would be some of the important steps towards this adaptation, she added.\nQaiser A. Raja, from Skills Enhancement Academy, UK, was of view that adaptation to virtual learning would be more challenging to trainers rather than the trainees that always show a better ability to get transformed with the new change.\nHe said that the technological shift towards the virtual learning was started much before the occurrence of the Covid19. However, the pandemic has just accelerated this process and now it’s time to embrace the change to get fully benefitted from it.\n“Pakistan needs to pay immediate attention to remove the connectivity barrier for the t communities.” Faisal Shafiq; Social, Technology, Business Program and Project Expert, Canada, opined and added further that Pakistan has huge potential to make inroads in virtual learning.\nHowever, besides improving infrastructure, the need assessment of the participants would play critical role in the success of virtual learning.\nBrig. (R) Mohammad Yasin; Senior Advisor Capacity Building, SDPI, Pakistan, on the occasion shared the overall learning and development context with the participants and said certain steps are now required to make virtual learning really meaningful including finding ways to make such learning more interactive.\nHe added further that we must prepare ourselves for the technological transformation as the pandemic has become part of the life now.\nEarlier, Shahid Minhas, Head CLD, SDPI, presented an overall context of the issue and said that the pandemic has posed challenges to every walk of life globally and same is true when we talk about learning and development.\nHe said that the real question today is how much we are ready to adapt to a complete paradigm shift, especially in the context of virtual learning.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:30:41.690Z"
}
