{
  "title": "Trump refuses security guarantees, Nato membership for Ukraine - World - DAWN.COM",
  "author": null,
  "content": "• Avoids answering question about potential Chinese ‘takeover’ of Taiwan\n• Calls Putin ‘very smart’ and ‘cunning person’\n• Elon Musk reveals plans to cut spending by $1 trillion\n\nWASHINGTON: President Donald Trump on Wednesday ruled out offering US security guarantees or Nato membership for Ukraine, while his adviser Elon Musk revealed plans to cut the $6.7 trillion budget by $1 trillion this year.\n\nAddressing reporters at a cabinet meeting, Trump said Zelensky would visit Friday and sign on handing over natural resources, after intense US pressure to hand over rare minerals used in aerospace and other technology.\n\n“It’s a great deal for Ukraine, too, because they get us over there,” Trump said.\n\n“We’ll be on the land and, you know, in that way, it’s this sort of automatic security, because nobody’s going to be messing around with our people when we’re there,” Trump said.\n\nBut Trump ruled out the United States providing more formal security guarantees, as sought by Kyiv.\n\n“We’re going to have Europe do that,” Trump said. “Europe is their next-door neighbor, but we’re going to make sure everything goes well.” Asked what concessions would need to be made to end the war, he ruled out Ukrainian membership in Nato, again repeating Russia’s stance that the issue was behind its invasion.\n\n“Nato — you can forget about,” Trump said. “I think that’s probably the reason the whole thing started.” Former president Joe Biden backed Ukraine’s eventual membership in Nato without offering a concrete timeframe.\n\nEarlier this week, the US sided with Russia at the UN, and against nearly all its European allies, with a resolution that called for an end to the war without stressing the territorial integrity of Ukraine.\n\n“We’re going to do the best we can to make the best deal we can for both sides,” Trump said on Wednesday.\n\nTrump insisted that his diplomacy was bringing a new spirit of compromise from Russian President Vladimir Putin, who earlier “wanted the whole thing” in Ukraine.\n\n“He’s a very smart guy. He’s a very cunning person,” Trump said of Putin.\n\n“I think we’re going to have a deal. If I didn’t get elected, I believe he would have just continued to go through Ukraine.”\n\nMeanwhile, Trump also declined to comment when asked whether the United States would ever allow China to take control of Taiwan by force.\n\n“I never comment on that,” Trump said at the White House. “I don’t want to ever put myself in that position.” He said he intended to have good relations with China, including cross-border investment, despite his imposition of tariffs on goods from the country.\n\nLayoffs\n\nThe Trump administration also laid the groundwork for more large-scale layoffs, but reiterated his promise to refrain from cutting popular health and retirement benefits that account for nearly half of that total.\n\nThe new administration’s unprecedented government overhaul has so far fired more than 20,000 workers, frozen foreign aid, and disrupted construction projects and scientific research.\n\nBut it has not slowed spending so far. According to a Reuters analysis, the government spent 13pc more during Trump’s first month in office than during the same time last year, largely due to higher interest payments on the debt and rising health and retirement costs incurred by an aging population.\n\nThe layoffs so far have focused on probationary workers who lack full employment protections. Trump’s administration is preparing for deeper cuts targeting career employees.\n\nA memo released ahead of the cabinet meeting called for a “significant reduction” but did not specify how many workers should be laid off, beyond the 100,000 of the nation’s 2.3 million civilian federal workers who have already taken a buyout or been fired.\n\nAgencies would have to submit plans by March 13, a day before current government funding is due to expire, according to the memo signed by Russell Vought, the White House budget director, and Charles Ezell, acting head of the Office of Personnel Management.\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67bf8782d028c.jpg",
  "retrievedAt": "2025-08-25T20:03:37.762Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894537/trump-refuses-security-guarantees-nato-membership-for-ukraine",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T02:06:28.000Z"
}
