{
  "title": "‘Need to move away from desire to control everything,’ Bilawal says on social media curbs - Pakistan - DAWN.COM",
  "author": null,
  "content": "PPP Chairman Bilawal Bhutto Zardari has said that Pakistan needs to avoid urges to control the media, stressing the need for rights-based approaches.\n\nBilawal has previously opposed government stances on internet regulation, floating the idea of a “bill of rights” for the digital age and criticising government restrictions on the use of virtual private networks (VPNs).\n\n“I believe access to the internet should be declared a fundamental right, like [the right to a clean] environment was declared a fundamental right in the 26th amendment. Affordable, equitable access to high-speed internet should be a fundamental right,” he said at an event in December 2024.\n\nThe PPP chairman had delivered a wide-ranging speech at the Oxford Union, a pre­stigious debating society that invites world leaders to speak on key issues before students and academics, last week. After his lecture, Oxford Union President Israr Khan hosted a Q&A session with the PPP scion, the video of which was posted a day ago on the society’s YouTube channel.\n\nQuestioned about the state of press and media freedom in Pakistan, Bilawal said: “There is this urge to control, not just the formal media but the informal media, which is getting a little bit draconian and claustrophobic.”\n\nHe said there was a “generational disconnect” at play where the “boomers in Islamabad don’t quite get social media or how the digital age works”.\n\nBilawal said that 65 per cent of the population was under the age of 35. “If you suddenly take 65pc of the population’s WhatsApp away, or slow down their Netflix streaming … you are suddenly antagonising 65pc of the population. It stifles creativity and economic activity.”\n\nBilawal then mentioned the Digital Bill of Rights which he has been campaigning for that would ensure internet access, data protection and a rights-based approach.\n\n“Is it going to fix everything? I don’t think so, but we need to move away from the current ‘I have a problem, how do I control it’ approach through a more rights-based approach,” he said.\n\n“Ultimately we just have to move away from this desire to control everything, everyone’s opinion, everyone’s tweet, every headline. You can’t conquer the media, you certainly can’t conquer the digital media,” the PPP chairman said, calling it the “software update” needed in Islamabad.\n\nAsked if he would be in favour of a parliamentary commission investigating state-backed intimidation and media suppression, he replied in the affirmative.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/26230255a9f207a.jpg",
  "retrievedAt": "2025-10-12T01:40:28.926Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894474/need-to-move-away-from-desire-to-control-everything-bilawal-says-on-social-media-curbs",
  "dateList": "2025-02-27",
  "date_published": "2025-02-26T19:16:49.000Z"
}
