{
  "title": "KP IGP asks police to perform duties efficiently to defeat terrorists, criminals - Pakistan - DAWN.COM",
  "author": null,
  "content": "ABBOTTABAD/HARIPUR: Khyber Pakhtunkhwa inspector general of police Zulfiqar Hameed on Tuesday urged the police personnel to perform their duties efficiently, keeping in mind the expectations of the people, in order to defeat terrorists and outlaws.\n\nAddressing a police darbar at the police lines during his first visit to Hazara Division, the IGP asked police officials to work hard to deliver the goods.\n\n“Public cooperation is crucial for realising the dream of a peaceful society, while the police should take steps to establish peace in collaboration with the people,” he said.\n\nPersonnel from all units of the Hazara region, including Elite, CTD, FRP, traffic, and Special Branch officers, along with personnel and children of martyred officials, participated in the event.\n\nSays officials should promote public policing\n\nRPO Hazara Region Nasir Mehmood Satti, along with DPOs from Abbottabad, Haripur, Mansehra, Battagram, Torghar and Lower and Upper Kohistan, as well as other senior police officials, were also present on the occasion.\n\nThe IGP said the province’s police had not only fought against terrorists despite limited resources and modern weapons but had also defeated them.\n\nHe urged them to remain vigilant against the high-handed tactics of miscreants and defeat them once again.\n\nMr Hameed said making the province a cradle of peace was his mission.\n\nHe urged officials to win public confidence by combating terrorists and criminals while promoting public policing.\n\nThe police chief said all available resources were being utilised to enhance the capacity of the police and improve the overall security situation.\n\nHe listened to the officials’ problems and issued orders for their resolution. He also sought reports on the other matters.\n\nMeanwhile, Inspector General of Prisons Usman Mehsud on Tuesday said the positive changes in the correctional environment of prisons in the province would lead to significant improvements in both prison management and the rehabilitation of inmates.\n\nSpeaking to journalists after attending the passing-out parade of 42 assistant superintendents of prisons in Haripur, the IG said that newly-inducted prison officers had been trained to uphold international human rights laws.\n\nThese ASPs received training at the Prisons Staff Academy in Haripur.\n\nThe IG said the provincial government was committed to protecting the rights of prisoners in accordance with the Mandela Rules, Beijing Rules, and Bangkok Rules.\n\nHe said the young officers had been trained in line with those regulations, human rights treaties and the country’s criminal justice system to ensure the humane treatment and proper management of inmates.\n\n“This training will bring positive changes to the overall prison system by improving correctional and rehabilitation programs and helping to reduce crime rates in society,” he said.\n\nHe said improvements in prison industries had allowed inmates to receive vocational training, which would not only help them earn a better living during incarceration but also provide them with skills for a stable post-detention life.\n\nThe IG announced that the Prison Staff Training Academy was being established in the province.\n\nHe revealed that drug addicts made up 40 per cent of the prison population, so the prison department had started setting up drug rehabilitation centres in all prisons.\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:03:13.478Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894497/kp-igp-asks-police-to-perform-duties-efficiently-to-defeat-terrorists-criminals",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T02:09:44.000Z"
}
