{
  "title": "Ultimatum to US federal workers raises tensions between Musk, White House staff - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump’s top aides are struggling to contain disputes at the White House and across the administration following billionaire Elon Musk’s ultimatum to federal workers to list their accomplishments or lose their jobs, said three government officials familiar with the tensions.\n\nBefore the weekend, the White House felt confident that coordination had been improving between senior staffers and Musk, two of those people said.\n\nIn the first weeks of Trump’s new administration, some White House officials had expressed concerns over the tactics of Musk’s Department of Government Efficiency (DOGE), as Reuters previously reported.\n\nChief of Staff Susie Wiles had pulled Musk aside to ask him to loop her in on his plans instead of surprising her team with major decisions, according to two separate sources with knowledge of the conversation who spoke on the condition of anonymity because of the sensitivity of the discussions.\n\nAfter that conversation, Musk had begun keeping Wiles informed of DOGE’s activities on a daily basis, said one of the officials with direct knowledge of the matter.\n\nThe White House believed it had Musk’s agreement that he would seek approval from cabinet secretaries before he used the government’s human resources agency, the Office of Personnel Management (OPM), to send emails directly to federal workers, two of the officials said.\n\nBut the plan appears to have quickly fallen apart. After Trump urged Musk to get more aggressive with DOGE in a post on his Truth Social site on Saturday, OPM ordered the nation’s 2.3 million civil-service workers in an email to detail their accomplishments at work.\n\nThe email landed shortly after Musk posted on his social media site X that not responding to the request would be viewed as a resignation, an ultimatum that sent shockwaves through Washington.\n\nIt was not just workers and some Trump administration officials who said they were blindsided. The White House was again caught off guard, this time on one of Musk’s most disruptive and potentially consequential moves, according to the three officials.\n\nTrump and Wiles did not sign off on the email, those three people said, speaking on the condition of anonymity because they were not authorised to talk to the media.\n\nMusk, however, told a cabinet meeting on Wednesday that he had asked Trump if his team could send out an email to everyone, just saying: “What did you get done last week? The president said yes. So, I did that.”\n\nMusk and a DOGE representative did not respond to requests for comment on their communications with the White House before the email went out.\n\nIn response to questions from Reuters, White House press secretary Karoline Leavitt said in a statement that the sources were “wrong” and that the “White House was not caught off guard”.\n\n“Trump signed off on Musk’s email idea, and DOGE and the OPM gave the White House a heads up,” she said.\n\nShe called the media’s “obsession” with Trump, Musk and DOGE “pathetic” and said it proved the media was still out of touch with American voters.\n\n“If the media spent the same amount of time uncovering waste, fraud and abuse in our federal government as they do writing fake stories trying to drive a wedge between Elon Musk and President Trump, maybe the American people would actually respect them,” Leavitt said.\n\nThe productivity email appears to have exposed the deepest fault lines to date between the Tesla CEO and senior White House staffers since Musk and his associates began dismantling programmes and cutting the workforce.\n\nIt also suggests an unprecedented degree of autonomy for Musk, the world’s richest person, in his role as a “special government employee”.\n\nAfter spending a quarter of a billion dollars on Trump’s election campaign, Musk became an important member of the transition, walking into meetings uninvited and lobbying for his preferred picks for cabinet positions, according to a half-dozen sources close to the transition.\n\nSince Trump took office on January 20, Musk has sought to slash the US government in an operation shrouded in secrecy. It is unclear exactly who DOGE employs, how the group operates and what actions it is taking inside government agencies.\n\nIn a February 17 court filing in a case trying to block DOGE’s access to the US Treasury Department systems, the White House said Musk is not the outfit’s administrator or even a DOGE employee, describing him as a White House employee and senior adviser to Trump. But he is clearly DOGE’s driving force, something Trump has said repeatedly when answering questions from reporters.\n\nAmong White House staffers, frustration appears to be growing towards Musk and his small, insular DOGE team, many of them software engineers who have worked for Musk’s companies.\n\nTrump, himself, however, continues to stand by Musk both publicly and privately, according to two of the officials aware of Trumps comments, as well as Trumps own public statements.\n\nWhen asked on Tuesday about the email instructing federal workers to list their accomplishments, Trump said, “It’s somewhat voluntary. But it’s also, if you don’t answer, I guess you get fired.”\n\nOne of the officials said that while Trump didnt sign off on the email, “he likes letting Elon be Elon.”\n\nLeavitt on Tuesday said Musk had come up with the idea for the email, and worked with OPM to implement it. “And let me be very clear, the president and Elon and his entire cabinet are working as one unified team,” Leavitt said.\n\nSigns of pushback against Musk’s power are increasing, however.\n\nSome agencies have already told workers to ignore the email. Musk on Tuesday gave federal workers “another chance” to respond to his ultimatum after the original Monday deadline had elapsed, suggesting some leeway. Worried cabinet heads have been calling Wiles, who co-led Trump’s 2024 presidential campaign, about the email, one of the officials said.\n\nThe Trump administration on Wednesday directed federal agencies to prepare for more large-scale layoffs. Already, about 100,000 workers have taken buyouts or been fired after DOGE was dispatched to gut federal staffing and spending.\n\nQuestions about Musk’s role and DOGE are at the heart of multiple lawsuits seeking to block them from accessing government systems and cut programmes. Many suits allege that Musk and DOGE are violating the constitution by wielding the kind of vast power that only comes from agencies created through the US Congress or appointments made with confirmation by the Senate.\n\nAt least two cabinet members have privately expressed frustration with DOGE’s cuts because they fear losing too many employees and control over their departments, according to one Republican source who spoke directly with the two members.\n\nOne of those cabinet members privately complained to the White House about Saturday’s ultimatum email, said the source.\n\nThat person, along with a Republican consultant with ties to the Trump administration, said they had recently spoken to a total of six members of Congress who expressed concern to them about DOGE overreaching.\n\n“But they’re all taking their cues from Trump,” the Republican consultant said. “Until he throws Musk off the cliff, they won’t do it.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/27182834d67ed93.jpg",
  "retrievedAt": "2025-08-25T20:02:53.812Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894691/ultimatum-to-us-federal-workers-raises-tensions-between-musk-white-house-staff",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T13:40:33.000Z"
}
