{
  "title": "Rain washes out Pakistan-Bangladesh match, hosts end Champions Trophy winless - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan’s last Champions Trophy group match with Bangladesh on Thursday was abandoned without a ball being bowled in Rawalpindi because of rain, ensuring the host country’s title defence ended with a wet whimper.\n\nPakistan, who won the 50-over tournament in 2017, lost to New Zealand and arch-rivals India to finish bottom of the four sides in Group A.\n\nTheir last match had only pride at stake for both teams, with Bangladesh similarly out of the running for the semi-finals.\n\nPakistan’s failure to advance beyond the group phase or even win a game was a huge letdown for a country hosting its first major cricket tournament in three decades.\n\n“The expectations were very high but we didn’t perform well and it is disappointing for us,” Pakistan skipper Mohammad Rizwan said.\n\n“We are upset and we are accepting that we didn’t do well. Hopefully we will do more hard work and come back.”\n\nLike his counterpart, Bangladesh skipper Najmul Hossain Shanto was disappointed they did not get to go out on a high.\n\n“We really wanted to play this match but can’t do anything about the weather,” he said.\n\nPakistan finished fourth and last with one point, a position below Bangladesh, who also have one point but a better net run-rate.\n\nOvernight rain in Rawalpindi continued on and off and despite several inspections by the umpires, no play was possible.\n\nIndia and New Zealand progressed to the semi-finals from Group A.\n\nIn Group B, South Africa, Australia and Afghanistan compete for the other two semi-final spots. England are out of contention.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/271645431c81a00.jpg",
  "retrievedAt": "2025-08-25T20:02:58.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894640/rain-washes-out-pakistan-bangladesh-match-hosts-end-champions-trophy-winless",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T08:25:43.000Z"
}
