{
  "title": "PTA raids telecom franchise during crackdown on illegal SIMs - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistan Telecommunications Authority (PTA) and the Federal Investigation Agency (FIA) conducted a raid on a private telecom franchise in Sahiwal and arrested two individuals involved in illegally issuing SIMs, according to a press release issued on Thursday.\n\nEarlier in the month, the PTA and the FIA had arrested eight people and seized over 7,000 illegal SIM cards during a crackdown, according to a press release issued last week.\n\n“The PTA Lahore Zonal Office, in collaboration with the FIA Cyber Crime Circle, conducted a successful raid on a Ufone franchise in Arifwala, Sahiwal, found involved in the illegal issuance of SIMs,” the statement said.\n\n“The FIA team confiscated the items, arresting the franchise owner on the spot. Another individual was apprehended in Bahawalnagar for supplying fingerprints. The case is under further FIA investigation, and an FIR has been registered,” the statement continued.\n\n“During the raid, 650 paper fingerprints (6,500 impressions), 1,500 digital fingerprints (15,000 impressions), 12 silicon thumb/finger sets, 105 active SIMs, three Biometric Verification System (BVS) devices, a scanner, and a laptop were recovered,” the statement elaborated.\n\n“This crackdown is part of PTA’s continued efforts to prevent the misuse of the Multi-Finger Biometric Verification System (MBVS). The Authority remains committed to eliminating the illegal issuance of SIMs and ensuring strict enforcement against violations, “ the statement by PTA concluded.\n\nEarlier in the month, the FIA had stated that illegal international SIMs, particularly those from the United Kingdom, are being widely used in Pakistan for serious crimes, including child pornography, kidnapping for ransom and online financial fraud.\n\nAddressing a press conference, Additional Director General of the FIA Cybercrime Wing Waqaruddin Syed said that the cybercrime wing launched, for the first time, a crackdown on the unauthorised trade of illegal SIMs and as many as 44 suspects were arrested from Rawalpindi, Gujranwala, Peshawar, Sukkur and Abbottabad.\n\nHe said that a total of 8,363 international SIMs from the UK were recovered, adding that 21 cases were registered nationwide.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:02:51.192Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894663/pta-raids-telecom-franchise-during-crackdown-on-illegal-sims",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T13:59:46.000Z"
}
