{
  "title": "Nvidia’s growth forecast signals booming demand for AI - Business - DAWN.COM",
  "author": null,
  "content": "Nvidia’s strong growth forecast for the first quarter on Wednesday signalled that booming demand for its artificial intelligence (AI) chips was intact, and the company said orders for its new Blackwell semiconductors were “amazing”.\n\nThe company’s forecast helps allay doubts around a slowdown in spending on its hardware that emerged last month, following Chinese AI startup DeepSeek’s claims that it had developed AI models rivaling Western counterparts at a fraction of their cost.\n\nIts shares rose, before declining slightly in choppy extended trading, after closing up 3.7 per cent in regular trading. Nvidia is the biggest beneficiary of a rally in AI-linked stocks, with its shares up more than 400pc over the last two years.\n\nCEO Jensen Huang struck an optimistic note saying, “AI is advancing at light speed,” and that “demand for Blackwell is amazing,” in commentary that should bode well for AI-related stocks that have taken a hit in the past week.\n\n“Weve successfully ramped up the massive-scale production of Blackwell AI supercomputers, achieving billions of dollars in sales in its first quarter,” he said.\n\nNvidia is undergoing a critical product transition as it moves to a new chip architecture called Blackwell, shifting from selling individual chips to full AI computing systems that integrate graphic chips, processors and networking equipment.\n\nThe Santa Clara, California-based company generated $11 billion of revenue from Blackwell-related products in the fourth quarter, roughly 50pc of the company’s overall data centre revenue.\n\nThe company expects total revenue of $43bn, plus or minus 2pc for the first quarter, compared with analysts’ average estimate of $41.78bn, according to LSEG.\n\n“Unlike previous quarters, there was heightened skepticism going into this report due to concerns about DeepSeek’s efficient model and questions surrounding the Blackwell rollout,” said eMarketer analyst Jacob Bourne. “But the results have removed the doubts.”\n\nThe Blackwell ramp-up has been complicated and costly, weighing on the company’s margins, however.\n\nNvidia on Wednesday forecast first-quarter gross margin slightly below expectations — it will sink to 71pc, below the 72.2pc forecast by Wall Street, according to data compiled by LSEG.\n\nStill, Nvidia’s Chief Financial Officer Colette Kress said on a conference call that Nvidia would return to the mid-70pc gross margin range later in the fiscal year as it further increased production of its Blackwell chips, lowering costs.\n\nThe AI rally lost some of its steam last month after DeepSeek’s sudden rise, resulting in Nvidia losing $593bn in market value, the largest one-day loss for any US company.\n\nInvestors questioned whether demand for AI chips was sustainable and the enormous capital expenses promised by large US tech companies including Microsoft. Microsoft has earmarked $80bn for AI in its current fiscal year, while Meta Platforms has pledged as much as $65bn.\n\nA recent brokerage report suggested that Microsoft has scrapped leases for sizable US data centre capacity, suggesting potential oversupply. But Reuters reported on Monday that Chinese companies are ramping up orders for Nvidia’s H20 AI chip due to booming demand for DeepSeek’s low-cost AI model.\n\n“Despite the breakthroughs from DeepSeek, Nvidia’s momentum with Hyperscalers seems to continue,” Third Bridge analyst Lucas Keh said, referring to large cloud-computing companies.\n\nIn more positive news for Nvidia, CFO Kress said the Stargate data centre project announced last month by US President Donald Trump will use Nvidia’s Spectrum X ethernet for networking. The ethernet products are included in the company’s data centre segment.\n\nNvidia reported adjusted per-share profit of 89 cents, compared with estimates of 84 cents a share. Revenue for the fourth quarter grew 78pc to $39.3bn, beating estimates of $38.04bn.\n\nSales in the data-centre segment, which accounts for most of Nvidia’s revenue, grew 93pc to $35.6bn in the quarter ended January 26, above estimates of $33.59bn. The segment had recorded growth of 112pc in the prior quarter.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/271242238ab0975.jpg",
  "retrievedAt": "2025-10-12T01:39:44.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894638/nvidias-growth-forecast-signals-booming-demand-for-ai",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T08:01:00.000Z"
}
