{
  "title": "Global stability threatened by declining cooperation: G20 - World - DAWN.COM",
  "author": null,
  "content": "CAPE TOWN: The erosion of multilateralism threatens global growth and stability, President Cyril Ramaphosa warned on Wednesday at a G20 finance meeting in South Africa marked by the absence of the US treasury secretary.\n\nTwo days of talks by finance ministers and central bank governors from the world’s leading economies opened a week after a meeting of G20 foreign ministers was snubbed by US Secretary of State Marco Rubio, who complained of its “anti-Americanism”.\n\n“The erosion of multilateralism presents a threat to global growth and stability,” Ramaphosa said in his opening address. “At this time of heightened geopolitical contestation, a rules-based order is particularly important as a mechanism for managing disputes and resolving conflict,” he said.\n\nThe G20, a grouping of 19 countries as well as the European Union and the African Union, is divided on key issues, from Russia’s war in Ukraine to climate change, with world leaders scrambling to respond to drastic policy shifts from Washington since the return of US President Donald Trump.\n\n“Multilateral cooperation is our only hope of overcoming unprecedented challenges, including slow and uneven growth, rising debt burdens, persistent poverty and inequality, and the existential threat of climate change,” Ramaphosa said.\n\nItalian Foreign Minister Giancarlo Giorgetti echoed the call, warning that geopolitical tensions risked further slowing global economy, especially in poorer nations. “Protectionism, trade barriers and political uncertainty threaten growth and global value chains, increasing production costs and inflation and weakening economic resilience,” he said.\n\nSouth Africa holds the rotating G20 presidency this year and has chosen the theme “Solidarity, Equality, Sustainability”. US Treasury Secretary Scott Bessent said on Feb 20 he would not attend the Cape Town meeting because he was too busy.\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67bf8a11f381c.jpg",
  "retrievedAt": "2025-10-12T01:40:17.872Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894549/global-stability-threatened-by-declining-cooperation-g20",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T02:08:58.000Z"
}
