{
  "title": "Ahsan Bhoon joins JCP as new PBC rep - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Senior lawyer Muhammad Ahsan Bhoon replaced Akhtar Hussain as representative of the Pakistan Bar Council (PBC) in the Judicial Commission of Pakistan (JCP) on Wednesday.\n\nThe JCP is to meet on Friday to consider the elevation of district and sessions judges to the Lahore High Court.\n\nAhsan Bhoon was elected the Pakistan Bar Council representative during its 245th meeting, which was presided over by Attorney General for Pakistan (AGP) Mansoor Usman Awan, who is the PBC chairman.\n\nAhsan Bhoon belongs to the Independent Group, popularly known as the Asma Group.\n\nHe has also served as the PBC vice chairman and president of the Supreme Court Bar Association (SCBA).\n\nCommission to meet tomorrow to consider elevation of district and sessions judges to Lahore High Court\n\nAhsan Bhoon will represent PBC in JCP for the next two years. He is considered close to Law Minister Azam Nazeer Tarar.\n\nDuring the election, the AGP invited proposals for the nomination of JCP member under Article 175-A(2)(vi) of the Constitution. The AGP acts as returning officer for the council’s election.\n\nMembers Khush Dil Khan and Muhammad Yaseen Azad proposed the name of Muhammad Ahsan Bhoon, which was seconded by Hassan Raza Pasha.\n\nPir Muhammad suggested the name of Masood Chishti as nominee for member of JCP.\n\nShafqat Mehmood Chauhan proposed Tahir Faraz Abbasi for the slot and was seconded by Abid Shahid Zuberi.\n\nFourteen members cast their votes in favour of Muhammad Ahsan Bhoon and four in favour of Tahir Faraz Abbasi. Munir Kakar abstained from the vote. Votes were cast by a show of hands.\n\nThe AGP declared Ahsan Bhoon elected as member of the JCP for two years with effect from Feb 26, 2025, to Feb 25, 2027.\n\nThe election of Ahsan\n\nBhoon was held after Akhtar Hussain tendered his resignation on Monday in the wake of controversies over judicial appointments.\n\nIn his resignation letter, Akhtar Hussain stated since he was unable to continue under the present circumstances, he had decided to tender his resignation as a JCP member. The resignation letter was addres­sed to the JCP chair­man, who happens to be the Chief Justice of Pakistan (CJP) Yahya Afridi.\n\nAkhtar Hussain had atten­ded a number of meetings of the JCP convened to elevate 36 judges to high courts and seven judges to the Supreme Court under the 26th Amendment to the Constitution.\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:39:59.917Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894557/ahsan-bhoon-joins-jcp-as-new-pbc-rep",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T02:07:52.000Z"
}
