{
  "title": "Abducted PPP leader returns home as lawyers observe strike - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: PPP divisional president and noted lawyer Sardar Qaizar Khan Miankhel returned home safe late on Tuesday night after his abduction a day earlier (Monday).\n\nAccording to family sources, Miankhel was successfully rescued along with his companions. Local elders played a key role in securing his safe release, they said.\n\nHis elder brother, MNA Fatahullah Miankhel, confirmed that the rescue was carried out unconditionally.\n\nTalking to Dawn, he further revealed that local elders had been negotiating with kidnappers since his abduction.\n\nQaizar Miankhel, a well-known political figure, has previously served as tehsil nazim, president of the district bar, and a candidate for provincial assembly. His safe return has brought relief to his family and political circles of Dera Ismail Khan.\n\nMeanwhile, on the call of KP Bar Council, the legal fraternity observed a strike across the province on Tuesday against the abduction of the lawyer.\n\nKP Bar Council vice-chairman Ahmed Farooq Khattak, chairman executive committee Akbar Khan Kohistani, Aminur Rehman Yusufzai, Yasar Khattak, Ishaq Ali Qazi, Babar Khan Yousafzai, Syed Mubashir Shah and others condemned the kidnapping of Qaizar Miankhel and his associates.\n\nThey said that kidnapping of a senior lawyer and prominent political figure in daylight placed a question mark on the performance of the law enforcement and security agencies. The lawyers stayed away from proceedings in all the courts, including the Peshawar High Court, and its circuit benches and subordinate courts.\n\nThe PHC Bar Association also condemned the kidnapping of Qaizar Miankhel.\n\nEarlier, the lawyers in DI Khan also boycotted court proceedings on Tuesday. They took out a protest rally, which after passing through various routes, reached the residence of the PPP lawyer, where it turned into a demonstration.\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:03:14.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894506/abducted-ppp-leader-returns-home-as-lawyers-observe-strike",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T02:09:44.000Z"
}
