{
  "title": "Advancing uncertainty - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE scale is now awe-inspiring. The speed with which the world is changing is overtaking many analytical abilities.\n\nA single warning now needs to be played on repeat until it seeps into the minds of Pakistan’s power elites: the world you relied on to underwrite your dysfunctions and bailouts is now ending, and it is ending very fast indeed.\n\nWho among us can say with total confidence that the IMF and its affiliated institutions such as the World Bank will even exist after five years? These are the institutions, along with the larger group of multilateral bodies and concessional trade regimes that have kept Pakistan afloat for the better part of the last 50 years.\n\nWithout them, Pakistan will not be able to pay the bills for its overdeveloped state apparatus and its consumption-driven economy built on outmoded technology. In short, without these entities, the country sinks into financial and economic non-viability.\n\nThis is not a minor point. Its external sector dysfunction is the biggest stone in Pakistan’s shoes. And there is now massive uncertainty whether the country will continue receiving the bailouts and receiverships it has been getting almost non-stop for more than a quarter century. Minus these bailouts and close monitoring of its economic decisions, the country sinks into non-viability.\n\nToday, many employees of the UN, IMF, the World Bank and all other bodies that were part of the architecture of the US-led global order that emerged after World War II are themselves wondering whether their employment is as safe for the long term as they thought it would be when they joined these organisations. The US-led global order is rapidly being dismantled and it is no longer possible to say how much of it will exist in five years.\n\nWho can say with total confidence that the IMF and its affiliated institutions will even exist after five years?\n\nIt now sounds like pious incantations to talk about structural reforms. Let’s model our assessments on the assumption that these are never going to happen.\n\nBarring a privatisation or two in the near future, there is not going to be anything that resembles broadening of the tax base or the export base in the near future, nor are government expenditures going to be reduced sharply. Let’s assume we have to navigate the choppy waters ahead without these reforms. What does that effort look like?\n\nTechnology provides some answers. Digitisation of payments can be a promising way to promote formalisation of the economy. This avenue was not available until recent years but it is now.\n\nIn India, some research suggests the size of the informal economy shrank from 52 per cent of the total economy in 2016, the year they adopted the Universal Payment Interface, to less than 40pc by 2022, driven in large part by growing formalisation as small business and retail transactions moved to digital payments instead. It is hard to isolate the precise role that digitisation of payments played in reducing informality, but it clearly played some role.\n\nSimilar results can be obtained here too. This is especially the case given that much of the architecture for digital payments has already been built with the Raast gateway. With much of the technical work done, the hard part now is to increase offtake. And the best way to push that is to get as many government payments going through digital channels as possible.\n\nRenewable energy is another frontier shaping up before us and Pakistan is taking it in nicely. The solar revolution has the potential to change everything about how the power sector is organised, and as it progresses, the whole idea of a national grid with large power plants and grid stations and transmission lines and massive power utilities increasingly becomes outdated. Just like mobile telecommunications changed not only how we connect with each other, but how we make payments and how we run a business, the solar revolution will also change our relationship with energy.\n\nTechnologies like these have the potential to help a country leapfrog out of its chronic dysfunctions and potentially open new vistas for growth. It was very difficult to see a way forward for Pakistan during the power crisis of 2008, and the years that followed.\n\nMassive loadshedding, rising power bills, depleting natural gas reservoirs, protests around the country, and wrangling between industry sectors over who should bear the burden of adjusting to market-based energy pricing was the norm back in those years.\n\nBut the revolution in renewable energy changed all that. Now it is possible to see what the future of energy provision in Pakistan might look like. In fact, much of it is already happening around us. With the arrival of electric vehicles and large battery storage, along with indigenous industry around battery recycling, the revolution is set to undergo another evolution. Along with the grid, petrol- and diesel-based motorised transport is also set to disappear. The first locally assembled electric vehicles hit the market next month. By the time this calendar year ends, they will be ubiquitous.\n\nSo as uncertainty mounts, solutions are also taking shape before us. With renewable energy comes a lessening requirement on imported oil, hopefully to the point where energy import will no longer dominate Pakistan’s external account the way it has for all preceding decades so far. That is a bit of a long shot, but within the realm of possibility.\n\nWhat is required is serious thinking far outside the box to push the limits on both these frontiers. The old model of searching for geopolitical rents, or extracting bailouts from multilateral lenders, of carrying forward with outdated industries using outdated technology, is all finished. Let’s look at the future with a brand new pair of eyes.\n\nThe writer is a business and economy journalist.\n\nkhurram.husain@gmail.com\n\nX: @khurramhusain\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67bfd6e4723fb.jpg",
  "retrievedAt": "2025-10-12T01:40:14.735Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894573",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T03:09:23.000Z"
}
