{
  "title": "Zadran-inspired Afghanistan oust England to keep semis hopes alive - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The day truly belonged to Ibrahim Zadran. The youngster launched the action with the willow and then ended the England innings with a catch at long-on to dismiss Adil Rashid.\n\nAfghanistan cricket is alive and kicking, it was proven yet again here at the Gaddafi Stadium on Wednesday night where the Hashmatullah Shahidi and his men edged Jos Buttler’s brigade in a high-scoring action-packed encounter.\n\nIt was a memorable day for budding Afghanistan players to showcase their skills. If the 23-year-old Zadran dazzled with a career-best 177, fast bowler Azmatullah Omrazai, 24, shone with his first five-wicket haul.\n\nThe eight-run victory in the cliffhanger kept Afghanistan’s hope of reaching semi-finals alive with their last group match against Australia scheduled for Friday at the same venue.\n\nThe triumph revived the memories of Afghanistan’s stu­n­ning triumph against England in the 2023 ODI World Cup.\n\nEngland, on the other hand, suffered another ODI flop and exited the eight-nation event. They now face South Africa in the last group game in Karachi on Saturday. The result of this game will have no bearing on England but a victory for South Africa will send Temba Bavu­ma’s squad into the last four.\n\nThe turnaround came in the 46th over with England needing 39 runs off 26 balls. Just at this moment centurion Joe Root — facing cramps — fell to a short-of-length delivery by Omarzai, with the right-handed veteran trying to play it through third man but only gloved it to wicket-keeper Rah­m­anullah Gurbaz. Engl­and’s hope of a victory diminished as they descended to 287-7.\n\nRequiring 17 off 14, England got another jolt when Jamie Overton (32 off 28 with three fours) was deceived by a slower Omarzai ball only to be caught by Mohammad Nabi at long-on as the Afghanistan players rejoiced.\n\nArcher kept the chase going before he mistimed a slower delivery from paceman Faza­lhaq Farooqi to be caught by Nabi who ran in from long-on.\n\nEngland’s innings revolved around veteran Root who struck a fighting 120 off 111 but that was not enough.\n\nChasing 326, England lost their opener Phil Salt (12) who was cleaned up by Omarzai in the fourth over. Jamie Smith (nine) tried to attack Nabi off his very first ball but was caught by Omarzai at backward point as England were restricted to 30-2 in the seventh over.\n\nBen Duckett (38) and Root added 68 before the former was trapped by leg-spinner Rashid Khan in the 17th over. Harry Brook started off with a 21-ball 25 before falling to Nabi who caught the right-hander off his own bowling.\n\nAt 133-4, Buttler joined Root and both added an invaluable 83 off 91 balls before the former was undone by Omarzai as the English skipper was caught by Rahmat Shah at deep square leg. Liam Livingstone’s (10) dismissal brought England down to 233-6 in the 39th over.\n\nKeeping his cool, Root at the other end made sure England fight till the very last moment. He struck 11 fours and a six during his masterpiece which was the 34-year-old’s 16th ODI century.\n\nRight-armer Omarzai picked up five for 58 — his best ODI figures — while Nabi took 2-57 in eight overs.\n\nEarlier, Zadran’s scintillating knock steered Afghanistan to a decent total after they elected to bat first.\n\nAfghanistan had a disastrous start to the innings losing three wickets — all to speedster Archer — inside the first powerplay for 37.\n\nArcher in the fifth over cleaned up Rahmanullah Gurbaz (six) — the pacer’s 50th ODI wicket — as the batter edged the ball onto the stumps before trapping Gurbaz’s opening partner Sediqullah Atal (four) in front in the same over. Atal reviewed the decision which upheld.\n\nRahmat was next to go as he tried to pull Archer but top-edged the ball only to be caught by Rashid at long leg. Afghanistan were now reeling at 37-3 and ended the first powerplay at 39-3.\n\nAs Shahidi joined Zadran, the duo resurrected the innings slowly and gradually and helped Afghanistan touch the 50 mark in 13.5 overs.\n\nRight-handed Zadran reached his half-century off 65 balls with three fours and a brace of sixes as Afghanistan reached 100 in the 25th over.\n\nAt 140-3 in the 30th over, Shahidi, who made a sedate 67-ball 40 with the aid of three fours, was bowled by Rashid as the batter missed the length wh­i­le attempting a reverse sweep.\n\nZadran in the meantime kept playing belligerent strokes as he recorded the best innings of his life with positive intent and aggression. He and Omarzai (41 off 31) added 72 for the fifth wicket off 63 balls.\n\nZadran completed the century, his sixth in ODIs and first against England, from 106 balls as Afghanistan looking to lift the scoring rate reached 200 in the 38th over.\n\nOmarzai, who cracked three sixes and a four during his belligerent cameo, was caught at long-on by substitute Tom Banton off pacer Overton as Afghanistan score read 212-5 in 40 overs.\n\nOmarzai’s departure brou­ght Nabi to the field as Afghanistan accelerated their run-rate adding a whopping 113 runs in the final powerplay.\n\nZadran, who struck 12 fours and six sixes during his hurricane innings to reach the 150 mark off 134 balls, added 111 off 55 balls with Nabi who accumulated 24-ball 40 laced with three sixes and two fours.\n\nZadran was dismissed in the final over, caught at deep square-leg by Archer off occasional spinner Livingstone. He also dismissed Nabi.\n\nAll England bowlers except for Livingstone (2-28 in five overs) conceded too many runs. Archer picked up three but gave away 64 runs while Overton (1-72), Rashid (1-60) and Wood (0-50 in eight overs) also proved expensive.\n\nScoreboard\n\nAFGHANISTAN:\n\nRahmanullah Gurbaz b Archer 6\n\nIbrahim Zadran c Archer b Livingstone 177\n\nSediqullah Atal lbw Archer 4\n\nRahmat Shah c Rashid b Archer 4\n\nHashmatullah Shahidi b Rashid 40\n\nAzmatullah Omarzai c sub b Overton 41\n\nMohammad Nabi c Root b Livingstone 40\n\nGulbadin Naib not out 1\n\nRashid Khan not out 1\n\nEXTRAS (LB-4, W-7) 11\n\nTOTAL (for seven wickets, 50 overs) 325\n\nFALL OF WICKETS: 1-11 (Gurbaz), 2-15 (Atal), 3-37 (Rahmat), 4-140 (Shahidi), 5-212 (Omarzai), 6-323 (Zadran), 7-324 (Nabi)\n\nDID NOT BAT: Noor Ahmed, Fazalhaq Farooqi\n\nBOWLING: Archer 10-0-64-3 (4w), Wood 8-0-50-0, Overton 10-0-72-1 (2w), Rashid 10-0-60-1 (1w), Root 7-0-47-0, Livingstone 5-0-28-2\n\nENGLAND:\n\nP. Salt b Omarzai 12\n\nB. Duckett lbw Rashid 38\n\nJ. Smith c Omarzai b Nabi 9\n\nJ. Root c Gurbaz b Omarzai 120\n\nH. Brook c&b Nabi 25\n\nJ. Buttler c Rahmat b Omarzai 38\n\nL. Livingstone c Gurbaz b Naib 10\n\nJ. Overton c Nabi b Omarzai 32\n\nJ. Archer c Nabi b Farooqi 14\n\nA. Rashid c Ibrahim b Omarzai 5\n\nM. Wood not out 2\n\nEXTRAS (B-4, LB-3, W-5) 12\n\nTOTAL (all out, 49.5 overs) 317\n\nFALL OF WICKETS: 1-19 (Salt), 2-30 (Smith), 3-98 (Duckett), 4-133 (Brook), 5-216 (Buttler), 6-233 (Livingstone), 7-287 (Root), 8-309 (Overton), 9-313 (Archer)\n\nBOWLING: Farooqi 10-0-62-1 (1w), Omarzai 9.5-0-58-5 (2w), Nabi 8-0-57-2, Rashid 10-0-66-1, Noor 10-0-51-0 (1w), Gulbadin 2-0-16-1 (1w)\n\nRESULT: Afghanistan won by eight runs.\n\nPLAYER-OF-THE-MATCH: Ibrahim Zadran\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/27110307cec67c8.jpg",
  "retrievedAt": "2025-10-12T01:40:59.976Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894532/zadran-inspired-afghanistan-oust-england-to-keep-semis-hopes-alive",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T02:09:20.000Z"
}
