{
  "title": "Punjab govt to revisit Cholistan land transfer, LHC told - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: The Punjab government has held in abeyance two agreements — made by the caretaker government — transferring vast swathes of land in Cholistan to two entities associated with the Pakistan Army, officials told the Lahore High Court on Wednesday.\n\nAccording to an order issued by Justice Asim Hafeez of the LHC’s Bahawalpur bench on Wednesday, Punjab government officials infor­med the court that the provincial cabinet had initiated a fresh review of the land transfer agreements and subsequent notifications, issued by the Board of Revenue under the caretaker set-up.\n\nThe order came after the bench disposed of a petition, filed by over 100 residents of Chak No.176/DB — a remote settlement in Cholistan — who claimed they were being forced to hand over their land to make way for a state-sponsored project.\n\nThe court observed that the caretaker government had exceeded its mandate when it executed joint venture agreements with M/s Green Corporate Initiatives and the Military Family Rehabi­litation Organisation (MFRO) for transfer of thousands of acres of land in Cholistan.\n\nThe court appreciated that the government, “instead of defending an illegality committed by the caretaker cabinet”, was desirous of re-examining the matter.\n\nThe order noted that a summary aimed at revisiting the earlier notifications and agreements had been placed before the provincial cabinet, which was expected to make a decision within eight weeks.\n\nWhen asked about the petitioners’ apprehensions that they would be deprived of their land, the court was assured by representatives of the provincial government that no adverse action would be taken against them until the cabinet makes a fresh decision.\n\nThe order observed that the cabinet should also consider the 11 questions, earlier framed by the court, regarding the scope of a caretaker government’s powers and the legality of the agreements it had made with a private limited company to lease out a large chunk of land.\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/67b10fd850e61.jpg",
  "retrievedAt": "2025-08-25T20:03:41.376Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894561/punjab-govt-to-revisit-cholistan-land-transfer-lhc-told",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T02:05:47.000Z"
}
