{
  "title": "Wholesale sugar price continues to increase - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: As the federal government and millers plan to provide sugar at Rs130 per kg nationwide, the wholesale price of the sweetener continues to rise ahead of Ramazan.\n\nRetailers in Karachi are already charging Rs160 per kg, saying that they could not sustain frequent hikes in wholesale rates as the 50 kg bag price has continuously risen by Rs150-200 per bag for the last few days.\n\nKarachi Wholesalers Grocers Association (KWGA) Chairman Rauf Ibrahim said the wholesale rate has risen by Rs13 to Rs154 per kg in the last three to four days as speculators and investors have become active to make windfall during Ramazan when demand for sugar surges to 1.1m tonnes from 550,000 tonnes.\n\n“The federal and provincial governments need to wake up and intensify crackdown on sugar mafia, middlemen and the hoarders to recover huge stocks of sweetener piled up in godowns,” he said, fearing that sugar price may crawl up to Rs 200 per kg during Ramazan in case the government takes the issue very lightly.\n\nGovt, millers plan discounted rates for Ramazan\n\nHe urged the government to collect cost of production and sales data from mills.\n\nHe said there were reports of a crackdown in Bhens Colony, where 11,000 sugar bags of 50kg each were recovered from a godown on Wednesday. He also urged the government to check the godowns of millers.\n\nAs per the Sensitive Price Index (SPI), sugar rates have swelled to Rs150-165 per kg from Rs145-160 per kg in one month. The rate was Rs130-150 in the first week of January.\n\nMr Rauf expressed surprise that the federal government and millers finally woke up to provide sugar at Rs130 per kg during the holy month through hundreds of stalls at the municipal level across the country.\n\nIn the third week of this month, a Pakistan Sugar Mills Association (Punjab Zone) spokesman said the industry would ensure the availability of discounted sugar through sale points to be established throughout the country.\n\nThe PSMA spokesman stated that the market forces of supply and demand primarily govern prices. However, the sensitivities of the sugar market are affected by speculators who spread false and exaggerated information to profit at the expense of consumers, cane growers and the sugar industry.\n\n“Such rumour-mongering is sponsored by speculators who emerge as its sole beneficiary. The sugar industry strongly appeals to the government to uproot these elements and take action against speculators,” the PSMA demanded.\n\nPublished in Dawn, February 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:40:15.813Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894584/wholesale-sugar-price-continues-to-increase",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T03:26:36.000Z"
}
