{
  "title": "Citizens welcome ATC conviction to accused who justifies Priyantha Kumar’s murder on social media",
  "link": "https://www.app.com.pk/national/citizens-welcome-atc-conviction-to-accused-who-justifies-priyantha-kumars-murder-on-social-media/",
  "date_published": "2022-01-21T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): The citizens on Friday hailed a decision of the Anti-Terrorism Court (ATC) regarding conviction of a person who justified the murder of Sri Lankan citizen Priyantha Kumara on social media.\nThey termed the verdict as a clear demonstration of rule of law in the country.The suspect identified as Adnan justified the lynching of Priyantha Kumara at the Sialkot factory on social media and later confessed his crime before the court. A case was registered against him at Rang Pura police station in Sialkot under charges of collaboration in the crime.\nATC judge Natasha Naseem Sipra awarded Adnan one year imprisonment and imposed a fine of Rs 10,000.\nPriyantha Kumara, who worked as an export manager at a garment factory in Sialkot, was killed and his body set on fire by a mob on December 3, 2021 for allegedly desecrating religious posters.\nThis decision of the anti-terrorism court was being highly appreciated by the social circles of the country.\nHussain, a resident of Islamabad, said that the anti-terrorism court had honored both Islam and justice by punishing the culprits for misusing the religion and law of blasphemy.\nNaveed Aslam, a resident of Gujranwala, lauded the court’s decision, saying it was clear evidence of the rule of law in the country. He said that rule of law would solve problems in Pakistan.\nMuhammad Anjum, a social worker in the federal capital, said that those who made the killers of Sri Lankan citizen heroes really deserve punishment and the killers, oppressors and their facilitators should be punished.\nPakistani and Sri Lankan officials had strongly condemned the Sialkot incident while Priyantha’s wife had demanded justice from Prime Minister Imran Khan.\nThe police also arrested more than 100 people seen in the videos during the operation, of whom 13 were named as the main accused, and court proceedings were continued against them.A case was registered against the accused Adnan on December 5, 2021, a few days after the Sialkot incident, at Ringpura Police Station Sialkot.\nAccording to the FIR, the accused went viral by uploading a video from the YouTube channel “Adnan Iftikhar Basri”. The video, provoking the crowd, claimed that the Sri Lankan citizen had committed blasphemy, after which an angry mob beat him to death and set his body on fire.",
  "retrievedAt": "2025-08-11T14:09:54.014Z"
}
