{
  "title": "Prime minister felicitates govt on achieving 5.37% GDP growth in three years",
  "link": "https://www.app.com.pk/national/prime-minister-felicitates-govt-on-achieving-5-37-gdp-growth-in-three-years/",
  "date_published": "2022-01-21T07:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 21 (APP): Prime Minister Imran Khan Friday congratulated his government on achieving the GDP growth of 5.3% which led to substantial jobs creation and also raised per capita income.\nThe prime minister wrote on Twitter that the success of the government’s economic reforms was also recognized globally.\nHe also cited a report of Bloomberg which predicted that Pakistan would sustain high growth trajectory and employment levels.\nMoreover, the prime minister also said that since the outbreak of the COVID-19 pandemic, Pakistan had been ranked amongst the top three countries on the normalcy index.\nHe said the Economist magazine, in its latest normalcy index also indicated that during the pandemic, Pakistan simultaneously saved jobs as well as lives.\nAccording to Bloomberg, Pakistan’s GDP grew 3.9% in the fiscal year ended June 2021, swinging from a 0.5% contraction in fiscal 2020 but leaving a slight negative output gap of -0.8%.\n“We see the output gap turning positive for the next few years before it converges to zero,” it added.\nBloomberg also projected a gradual decline in the unemployment rate through 2030 to its long-term historical average of 5.5%. It also projected a gradual rise in the participation rate through 2050.\nThe government has launched a comprehensive youth employment program with a focus on imparting market-oriented skills.\nThe investment growth is expected to pick up in the current decade, spurred by inflows related to CPEC projects. Meanwhile, the tax reforms, driven by the outcome of negotiations with the International Monetary Fund, are also being implemented.\nThis should increase tax revenues, making space for higher public investment.",
  "retrievedAt": "2025-08-11T14:10:02.393Z"
}
