{
  "title": "COVID-19 claims 21 more lives, total active cases records 39,644",
  "link": "https://www.app.com.pk/national/covid-19-claims-21-more-lives-total-active-cases-records-39644/",
  "date_published": "2021-07-13T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):The national tally on Tuesday of total active COVID-19 cases recorded 39,644 with 1,590 more people tested positive for the deadly virus during the last 24 hours.\n21 corona patients have died during past 24 hours, 18 of whom were under treatment in hospital and three out of the hospital in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Punjab followed by the Sindh. Out of the total 21 deaths occurred during last 24 hours, 08 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 16 percent, Islamabad Capital Territory (ICT) 18 percent, Peshawar 12 percent and Lahore 16 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Skardu 42 percent, Gilgit 41percent, Rawalpindi 23 percent and Karachi 35 percent.\nAround 215 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit-Baltistan (GB) and Balochistan.\nSome 43,790 tests were conducted across the country on Monday, including 15,342 in Sindh, 16,470 in Punjab, 7,062 in Khyber Pakhtunkhwa (KP), 1,866 in Islamabad Capital Territory (ICT), 1657 in Balochistan, 670 in GB, and 723 in AJK.\nAround 914,605 people have recovered from the disease so far across Pakistan making it a significant count.\nSince the pandemic outbreak, a total of 976,867 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 21,256, Balochistan 28,321, GB 6,972, ICT 83,831, KP 139,593, Punjab 348,509 and Sindh 348,385.\nAbout 22,618 deaths were recorded in country since the eruption of the contagion. Around 5,613 have perished in Sindh, out of which 5 died in hospital and 1 died out of hospital on 12 July. 10,832 in Punjab out of which 08 deaths occured in hospital and two out of hospital during past 24 hours.\n4,365 in KP where 03 of them died in hospital on Monday, 785 in ICT among one deaths in hospital during past 24 hours, 317 in Balochistan, 111 in GB and 595 in AJK succumbed to the deadly virus in hospital on Monday.\nA total of 15,152, 403 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 2,447 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:57:52.446Z"
}
