{
  "title": "Kashmir martyrs day observed in AJK with firm resolve to continue struggle",
  "link": "https://www.app.com.pk/national/kashmir-martyrs-day-observed-in-ajk-with-firm-resolve-to-continue-struggle/",
  "date_published": "2021-07-13T14:07:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Jul 13 (APP):Kashmiri people living on both sides of the Line of Control (LOC) and across the world over observed the Kashmir Martyrs’ Day on Tuesday and paid homage to the martyrs of July 13,1931.\nThe protest rallies and demonstrations were held all over Azad Jammu and Kashmir (AJK) to invite the world’s attention towards the unresolved Kashmir dispute and gruesome human rights violations by the Indian forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe peoples on this occasion reaffirmed their determination to continue the struggle till the achievement of their right to self determination in accordance with the United Nations agreed resolutions.\nOn July 13,1931, the troops of Dogra Maharaja had killed 22 Kashmiris one after the other, outside the Central Jail in Srinagar during court proceedings against Abdul Qadeer, who had asked the Kashmiri people to defy the Dogra Rule. Thus, 22 youth sacrificed their lives till the completion of Azaan (call for prayer).\nTalking to media persons here, AJK Prime Minister Raja Muhammad Farooq Haider Khan paid glowing tributes to the Kashmiri martyrs and renewed the pledge to continue the struggle of Kashmir liberation till the complete liberation of IIOJK from Indian clutches.\nHe said the supreme sacrifice rendered by the Kashmiri martyrs on July 13,1931 had infused spirit among the Kashmiri people and had added a new chapter in the history of resistance and sacrifice.\nHe said the sacrifices of July 13,1931 martyrs had served a beacon light for the Kashmiri struggling for their right to self determination and added that this indomitable spirit of sacrifices will remain alive in the freedom history of Kashmir.\nThe prime minister said the objective, for which the Kashmiri martyrs had offered their sacrifices, would continue and expressed the hope that the long night of terror and repressions would soon be ended and the dawn of freedom would rise and Kashmiris would ultimately get their fundamental right to self determination.\nHe said the month of July has a significant importance in the freedom history of Kashmir and added that during the month of July the historical accession to Pakistan resolution was passed while the sacrifice of Burhan Wani has also given new dimension to the Kashmir liberation movement.",
  "retrievedAt": "2025-08-11T20:57:51.081Z"
}
