{
  "title": "Govt takes steps to increase FDI: Senate informed",
  "link": "https://www.app.com.pk/national/govt-takes-steps-to-increase-fdi-senate-informed/",
  "date_published": "2021-07-13T16:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):Minister of State for Parliamentary Affairs Ali Muhammad Khan on Tuesday said that number of steps had been taken by the government to increase Foreign Direct Investment (FDI) to gross domestic products (GDP) ratio.\nIn reply to a question in Senate, he said that steps were taken to improve business atmosphere through Pakistan regulatory modernization initiative and use special economic zones (SEZs) for promoting industrialization in the country.\nThe minister said that the government was devising a comprehensive investment law and online investment facilitation services like issuance of work visa, Branch/ liaison office, security clearance and issuance of airport entry passes and integration of investor’s grievances cell with citizen portal.\nIn addition, he said that policies had been introduced by the present government to attract FDI including electric vehicle policy, mobile development manufacturer’s policy, national SME policy, strategic Trade policy framework and national textile policy.\nTo another question, the minister said the federal government had accorded priority to water sector projects of Balochistan, which was witnessed by the fact that in financial year 2020-21, 45 water sector projects costing Rs 91.666 billion were executed in Balochistan by irrigation department and PHE department, government of Balochistan with federal financing.\nHe said that four other projects costing Rs 142.542 billion were also being executed by WAPDA in the province. He said that many water schemes were completed in Khyber Pakhtunkhwa, adding that work was also underway on the Mohmand Dam.\nHe said that government was working on the one window policy to facilitate the people.",
  "retrievedAt": "2025-08-11T20:57:48.595Z"
}
