{
  "title": "FM Qureshi, Kamilov discuss Afghan, IIOJK situation",
  "link": "https://www.app.com.pk/national/fm-qureshi-kamilov-discuss-afghan-iiojk-situation/",
  "date_published": "2021-07-13T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 13 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi and his Uzbek counterpart Abdulaziz Kamilov Tuesday discussed the regional security including Afghanistan and human rights situation in Indian Illegally Occupied Jammu and Kashmir.\nDuring a bilateral meeting on the sidelines of SCO Council of Foreign Ministers meeting in Dushanbe, Tajikistan foreign minister Qureshi briefed his counterpart of the rapidly transforming situation in Afghanistan and highlighted importance of consistent support to Afghan peace process as shared responsibility.\nHe underlined that the region could not afford repeat of civil war, leading to instability and fresh influx of refugees.\nThe foreign minister expressed the hope that Afghan leaders, recognising the importance of international support for the Afghan peace process, would achieve a negotiated political settlement.\nForeign minister Qureshi is in Dushanbe, at the invitation of Tajikistan, to lead Pakistan delegation at the SCO Council of Foreign Ministers meeting.\nThe two foreign ministers also exchanged views on ways and means to enhance bilateral ties as well as discussed, the regional situation.\nPleased to meet FM #AbdulazizKamilov on sidelines  of #SCOCFM & to discuss greater bilateral cooperation, including finalisation of projects for rail & air links between Pakistan & Uzbekistan. Exchanged views on developments in  & I shared  efforts towards peace & stability. pic.twitter.com/TecG3pmrQ4\n— Shah Mahmood Qureshi (@SMQureshiPTI) July 13, 2021\nThe two foreign ministers discussed the forthcoming visit of the Prime Minister to Tashkent in the bilateral context and for participation in the international conference on connectivity. It was agreed that close consultations was necessary for successful visit.\nRecalling Uzbek foreign minister’s visit to Pakistan and the virtual summit at the leadership level, foreign minister Qureshi remarked that the continued interaction has injected new dynamism into the bilateral relations.\nThe Uzbek foreign minister appreciated Pakistan’s policy to pursue geo-economic goals which was aligned with Uzbekistan’s foreign policy goals.",
  "retrievedAt": "2025-08-11T20:57:49.535Z"
}
