{
  "title": "FM briefs Kazakh counterpart about GoP’s focus on geo-economics",
  "link": "https://www.app.com.pk/national/fm-briefs-kazakh-counterpart-about-gops-focus-on-geo-economics/",
  "date_published": "2021-07-13T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 13 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Tuesday briefed his Kazakh counterpart Mukhtar Tileuberdi about Government of Pakistan’s focus from geo-strategic to geo-economic approach.\nDuring a meeting on the margins of the SCO Council of Foreign Ministers meeting in Dushanbe, the two foreign ministers reviewed entire gamut of bilateral relations.\nForeign minister Qureshi emphasised regular convening of various institutional mechanisms to tap true potential of bilateral ties.\nHe also highlighted importance of working together on regional connectivity projects which would give a boost to bilateral as well as regional trade.\nThe foreign minister also emphasised the need to facilitate trade through harmonising customs procedures.\nThe foreign minister of Kazakhstan concurred with foreign minister Qureshi on the need to convene regularly institutional mechanisms to advance bilateral relations.\nThe two sides appreciated close cooperation at multilateral fora including SCO and CICA Summit.\nGood to meet FM #MukhtarTileuberdi of Kazakhstan & to share our  belief in the Shanghai spirit of cooperation. We also discussed bilateral matters and agreed to further enhance cooperation in areas of mutual interest, regionally and globally.   pic.twitter.com/eIcwBOjfXD\n— Shah Mahmood Qureshi (@SMQureshiPTI) July 13, 2021\nDiscussing the evolving situation in Afghanistan, foreign minister Qureshi briefed the Kazakh minister on Pakistan’s perspective and its consistent support to the Afghan peace process.\nThe two foreign ministers shared the view that the situation in Afghanistan was critical.\nIt was extremely important to continue support to the Afghan peace process to avoid another cycle of civil war which would impact the region negatively.",
  "retrievedAt": "2025-08-11T20:57:50.407Z"
}
