{
  "title": "Global cocaine market hit new record highs: UNODC - World - DAWN.COM",
  "author": null,
  "content": "Cocaine production, seizures and use all hit record highs in 2023, the UN drug agency said on Thursday, with the illicit drug’s market the world’s fastest-growing.\n\nIllegal production jumped to 3,708 tons, nearly 34 per cent more than in 2022, and more than four times higher than 10 years earlier, when it was at a low, the Vienna-based UN Office on Drugs and Crime (UNODC) said in its annual report.\n\nThe current surge is mainly due to an increase in the size of the area under illicit coca bush cultivation in Colombia and updated yield data, it added.\n\nGlobal cocaine seizures, too, recorded a high of 2,275 tons, marking a 68pc rise in the four years to 2023. The number of cocaine users also grew to 25 million in 2023, up from 17 million ten years earlier.\n\n“Cocaine has become fashionable for the more affluent society,” UNODC chief researcher Angela Me said, noting a “vicious cycle” of increased use and production.\n\nWhile Colombia remains the key producer, cocaine traffickers are breaking into new markets across Asia and Africa, according to the report, with organised crime groups from the Western Balkans increasing their influence.\n\n“A new era of global instability has intensified challenges in addressing the world drug problem, empowering organised crime groups and pushing drug use to historically high levels,” UNODC noted.\n\nIn 2023, 6pc of the population aged between 15 and 64 are estimated to have used a drug, compared to 5.2pc of the population in 2013.\n\nCannabis remains the most widely used drug.\n\nSeizures of amphetamine-type stimulants also reached a record high in 2023, making up almost half of all global seizures of synthetic drugs, followed by synthetic opioids, including fentanyl, UNODC said.\n\nThe fall of ruler Bashar al-Assad in Syria last December has “created uncertainty around the future of the captagon trade”, UNODC added.\n\nEarlier this month, Syria said authorities had seized all production facilities of the illicit stimulant, which became Syria’s largest export under Assad.\n\n“The latest seizure data from 2024 and 2025 confirm that captagon is continuing to flow — primarily to countries of the Arabian peninsula — possibly indicating the release of previously-accumulated stockpiles or continued production in different locations,” UNODC said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:27:59.779Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920291/global-cocaine-market-hit-new-record-highs-unodc",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T14:14:03.000Z"
}
