{
  "title": "Microfinance scheme for merged districts launched - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa government has launched a Rs 2.07 billion long-term interest-free microfinance scheme for entrepreneurs to support small businesses and enhance livelihoods in the merged districts.\n\nA statement issued in this regard said that the initiative, which spans 13 years (2021–2034), has already made substantial progress, with 66,557 individuals benefitting from the programme so far, while another 22,152 more are currently receiving financial support under the scheme.\n\nThe programme provides interest-free loans ranging from Rs25, 000 to Rs75, 000, with a flexible repayment period of up to 36 months. This structure has been designed to ensure that recipients can repay the loan in easy installments without the burden of interest, making it especially accessible for low-income and deserving people. The project is being implemented by the Khyber Pakhtunkhwa Small Industries Development Board (SIDB).\n\nOperational execution is being carried out in partnership with Akhuwat Foundation Pakistan, one of the country’s most trusted microfinance institutions. Currently, 36 branches of Akhuwat are functioning in various merged districts, enabling local residents to apply for loans close to home.\n\nThe scheme caters to a wide range of economic sectors. Beneficiaries have used the funds to start new businesses, expand existing enterprises, purchase necessary equipment and machinery, and invest in agriculture and livestock development.\n\nThis multi-sectoral approach ensures that people from all walks of life, particularly those from rural and economically marginalised backgrounds can benefit from financial inclusion.\n\nSikandar Shah, Monitoring and Evaluation Officer of the SIDB, recently conducted an official visit to the Akhuwat branch offices located in Bajaur, DI Khan and Lakki Marwat, saw the implementation and progress of the scheme and acknowledged its impact on the socio-economic uplift of the region.\n\nThe initiative not only promotes economic participation at the grassroots level but also reflects the provincial government’s broader vision of fostering self-reliance, employment generation, and sustainable economic growth.\n\nThis scheme, through its support to small businesses, agriculture, and livestock sectors, is paving the way for long-term prosperity and financial independence in the region. Local beneficiaries have expressed appreciation for the initiative, noting that the scheme has not only provided them with financial support but also the confidence and the tools needed to build a better future for their families and communities.\n\nThe scheme is expected to transform thousands of lives and contribute to the socio-economic uplift of the merged districts in the coming years.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:45:39.797Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920092/microfinance-scheme-for-merged-districts-launched",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T02:47:26.000Z"
}
