{
  "title": "7 killed, 39 injured in multiple incidents as rain lashes Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least seven people were killed and 39 others were injured in multiple rain-related incidents as Punjab was battered by heavy monsoon showers on Thursday, according to the Provincial Disaster Management Authority (PDMA) and Rescue 1122.\n\nMonsoon rains fall across the region from June to September, offering respite from the summer heat and are crucial to replenishing water supplies. They are also vital for agriculture, and therefore the livelihoods of millions of farmers and food security for South Asia’s nearly two billion people.\n\nEarlier today, the PDMA said that four people died and 19 were injured in rain-related incidents.\n\nAccording to the data, 13 incidents were reported across Punjab, with the majority of them in the Okara district. Two children are among the four deceased.\n\nThe majority of incidents were roof collapses caused by rain.\n\n“Two citizens were killed by the collapse of dilapidated and decaying buildings in Okara and Bahawalnagar,” a PDMA handout read. “Two citizens drowned in Jhelum … 13 dilapidated and mud houses were affected by monsoon rains.”\n\nAccording to the data, one child was killed in Okara, one in Bahawalnagar and two men in Jhelum.\n\nPunjab rescue spokesperson Farooq Ahmed said that the deceased child in Okara was a five-year-old girl.\n\n“[The girl] drowned in a storm drain in Basti Riazabad in Okara,” Ahmed was quoted as saying in a statement. “Another person drowned in a storm drain in Jhelum, while two people were injured in Sohawa. A search operation is underway.”\n\nThe spokesperson added that a person in Okara was injured in a lightning strike.\n\n“The public should avoid electric poles, hoarding boards and low-lying areas,” the spokesperson warned, urging them to call 1122 in case of emergencies.\n\nA statement by the Rescue 1122 also confirmed the deaths of one each in Okara, Bahawalnagar, and two in Jhelum.\n\nIt further said that two people died when a wall collapsed in Muzaffargarh, while one person died and another was injured after lightning struck in Khanewal.\n\nRescue 1122 said that emergency rescue services were provided to a total of 46 people in the last 24 hours, including 39 of those who were injured and taken to the hospital.\n\nThe statement said, “In Multan, three people were injured when a wall collapsed in Basti Rata,” adding that three others were injured when a roof collapsed in Latifabad.\n\nAnother roof collapse incident in Faisalabad injured one person, while two people were injured in more roof collapse incidents each in Shorkot and Sahiwal, according to Rescue 1122.\n\nIn Mandi Bahauddin, two children were injured by electrocution, the statement added.\n\nPDMA Director General Irfan Ali Kathia issued instructions to provide the best available medical assistance to the injured.\n\n“As per the instructions of the Punjab Chief Minister, losses incurred by citizens will be compensated,” Kathia said. “Assistance will also be ensured to the families of the deceased under the government policy.”\n\nDG PDMA also directed citizens to take precautionary measures, stating that this spell of monsoon rains will continue until July 1.\n\nSeparately, the Pakistan Meteorological Department (PMD) had earlier predicted rainfall and thunderstorms across the country, warning of the risk of flash floods and urban flooding.\n\nIn a weather forecast, the Met Office said, “moist currents from [the] Arabian Sea and Bay of Bengal are penetrating in most parts of the country. A westerly wave is also affecting the upper parts of the country.”\n\nThe weather agency forecast widespread rainfall and thundershowers on Thursday in Azad Kashmir, Khyber Pakhtunkhwa, Punjab and the federal capital Islamabad.\n\nIt added that rain thundershowers with gusty winds may also occur at isolated places in southeast Sindh and northeast/south Balochistan during the period.\n\n“On Friday, widespread rain and thundershowers with isolated heavy rainfall is expected in Azad Kashmir, KP, Islamabad, and upper and central Punjab. Rain thundershowers with gusty winds are likely in south Punjab, Sindh and northeast and south Balochistan,” it added.\n\nIn the previous 24 hours, the weather agency reported rain and thundershowers in Upper KP, Upper Punjab, Islamabad, Azad Kashmir and northeast Balochistan. Hot and very humid weather prevailed over other parts of the country, it added.\n\nKP’s Malam Jabba recorded the highest 70mm rainfall, Saidu Sharif 34mm, Parachinar 23mm, Lower Dir 8 mm, Mardan 6mm, Cherat 4mm, and Kakul 3mm.\n\nIn Punjab, Kasur recorded 63mm rainfall, Sheikhupura 50mm, Joharabad 48mm, Sargodha 45mm, Islamabad (Bokra 34mm, Airport 29mm, Zero point 22mm, Saidpur 21mm, Golra 20mm), Okara 30mm, Rawalpindi (Pirwidahi 30mm, Shamsabad 18mm), Chakwal 28mm, Lahore (Airport 20mm, City 11mm), Hafizabad 17mm, Attock 12mm, Gujrat 10mm, Faisalabad 8mm, Noorpur Thal 5mm, Narowal 3mm, Mangla and Sialkot 2mm each, Jhang and Toba Tek Singh 1mm each.\n\nIn Azad Kashmir, Muzaffarabad recorded 7mm at airport and 5mm in the city, Rawalakot 1mm, while Barkhan in Balochistan received 2mm rainfall.\n\nThe maximum temperatures recorded yesterday (Wednesday) were Dalbandin 46°C, while Sibbi, Jacobabad, Bhakkar, Bahawalpur, Dadu, and Nokkundi recorded 45°C.\n\nThe Met Office warned that heavy rainfall may generate flash floods in local streams of Murree, Galliyat, Mansehra, Kohistan, Dir, Swat, Shangla, Nowshera, Swabi, Islamabad/Rawalpindi, DG Khan, and parts of northeast Punjab and Azad Kashmir.\n\nIt further warned that heavy downpour may cause urban flooding in low lying areas of Islamabad, Rawalpindi, Gujranwala, Lahore, Sialkot, Sargodha, Faisalabad, Nowshera, Charsadda and Peshawar, and in Karachi and Hyderabad on June 27.\n\n“Landslides may cause road closures in the vulnerable hilly areas of KP, Murree, Galliyat, Azad Kashmir during the wet spell,” it added.\n\nIt warned that heavy downpour, windstorm and lightning may affect daily routines, and may damage weak structures of houses, electric poles, billboards, vehicles and solar panels during the forecast period.\n\nIn light of the forecast, the Punjab government intensified emergency measures following the prediction to receive 25 per cent more monsoon rains this year in the province.\n\nMonsoon rains have commenced in Punjab and the first spell will continue till July 1. Rainfall with strong winds and thunderstorms are predicted in most districts of the province.\n\nThe PMD had earlier issued a weather forecast for Karachi division, according to which isolated rains and thunderstorms are expected on Friday evening.\n\nThe weather in the city today has been forecast as partly cloudy and humid, with chances of isolated light rain and drizzle. The maximum temperature will remain between 35-37 °C and humidity levels of 70-80pc.\n\nThe maximum temperature will remain between 35-37°C with humidity level between 70-80pc with southwesterly winds blowing.\n\nIt added that westerly wave is moving toward the upper parts of the country and resultantly dust storm and rainfall with thundershower is expected in Tharparker, Umerkot, Mirpurkhas, Badin, Thatta and Dadu districts.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/261758184432f42.jpg",
  "retrievedAt": "2025-08-20T04:28:02.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920247/7-killed-39-injured-in-multiple-incidents-as-rain-lashes-punjab",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T08:14:36.000Z"
}
