{
  "title": "Powell urges caution on rate cuts - Business - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The Trump administration’s tariff plans may well just cause a one-time jump in prices, but the risk it could cause more persistent inflation is large enough for the central bank to be careful in considering further rate cuts, Federal Reserve Chair Jerome Powell told a US Senate panel on Wednesday.\n\nThough economic theory may point to tariffs as a one-off shock to prices, “that is not a law of nature,” said Powell, detailing why the central bank wants more information about the ultimate level of tariffs and the way they impact pricing and public expectations about inflation before lowering borrowing costs any further.\n\n“If it comes in quickly and it is over and done then yes, very likely it is a one-time thing,” that won’t lead to more persistent inflation, Powell said. But “it is a risk we feel. As the people who are supposed to keep stable prices, we need to manage that risk. That’s all we’re doing,” through holding rates steady for now.\n\nThe effects of tariffs “could be large or small. It is just something you want to approach carefully. If we make a mistake people will pay the cost for a long time.”\n\nTrump considering three to four candidates for next Federal Reserve chair\n\nFed officials still expect to cut interest rates this year, but the timing is uncertain as officials wait on coming trade deadlines and hope for more certainty about the scope of the tariffs that will be imposed and the ways that rising import levies influence prices and economic growth.\n\nTwo days of hearings did little to shift expectations around Fed policy, with investors still anticipating two rate cuts this year. But it did highlight the persistent rift between the Fed chair and President Donald Trump, who wants the Fed to cut rates immediately.\n\nRepublican lawmakers in the House on Tuesday and in the Senate Banking Committee on Wednesday pressed the Fed chair on why he seems reluctant to do so even though recent inflation data has been more moderate than expected.\n\nWhile Powell was completing what was likely his second-to-last set of semiannual appearances on Capitol Hill, Trump said he had narrowed “to within three or four people” who he intends to nominate as a successor for when Powell’s term as chair ends in May.\n\nThe president’s dismay with Powell is rooted in the central bank’s refusal to cut interest rates as Trump’s tariff plans have, in the view of a broad set of analysts and economists, raised the risk of higher inflation.\n\nPowell noted the Fed has no modern example of tariff increases of the size Trump is considering, with the tariffs Trump imposed in his first term far smaller than what seems likely now and enacted at a time when inflation was low.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/685cc1925b4e0.jpg",
  "retrievedAt": "2025-08-20T04:28:16.516Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920166/powell-urges-caution-on-rate-cuts",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T03:41:35.000Z"
}
