{
  "title": "Rainwater leaves newly-built Jinnah Square underpass in Islamabad impassable - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The first heavy rainfall of the season caused water to accumulate beneath the newly-built Jinnah Square underpass on Srinagar Highway, disrupting traffic flow, besides raising concerns about the drainage system.\n\nThe heavy rain that lashed the capital city early in the morning also damaged two small portions of the road which were immediately repaired by a contractor hired by the Capital Development Authority (CDA).\n\nThe Jinnah Square project, constructed at a cost of over Rs4 billion had been inaugurated by Prime Minister Shehbaz Sharif on Feb 4 this year with much funfair.\n\nHowever, the first heavy rain since its inauguration exposed the CDA’s arrangements to handle such a situation.\n\nThe traffic police rushed to the venue to divert the vehicles from and to Murree to alternate routes as accumulated water made it almost impossible for the vehicles to travel through the underpass.\n\nThe motorists heading towards Murree used a newly-built link road near Globe Chowk whereas those coming from Murree used the Kashmir Chowk as alternate routes.\n\nAs soon as the pictures and videos of vehicles passing through the underpass went viral on social media, the CDA and the federal government came under general criticism with people questioning the efficiency of the drainage system despite spending billions on the project.\n\n“Almost three feet of water accumulated here,” said Abububakar Khan, a resident of Bhara Kahu.\n\nHowever, the situation was brought under control in less than an hour time when the CDA moved its staff to clear the underpass.\n\nAccording to CDA official, the first heavy rainfall after the project’s completion brought garbage and broken branches of trees that clogged the drainage system.\n\n“We have a best drainage system with 54-inch pipes on both sides,” said the official, adding that a special team had been deployed for cleanliness purposes to prevent such issues in the future.\n\nClaiming that there was no fault in the drainage system, he said, it seemed proper precautionary cleanliness was not carried out before the rain.\n\nHe was of the view that first rainfall always caused problems for newly-constructed projects.\n\nDuring a visit of the site in the evening, Dawn noticed that repair work of small patches had been done and traffic was moving smoothly.\n\nWhen contacted, a CDA’s spokesperson, in his written statement, said the CDA had immediately streamlined the traffic flow after clearing the water.\n\n“The CDA has made ample arrangements for ensuring smooth flow of traffic in order to ease out commuters. Islamabad has one of the best drainage system,” he said.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:45:55.627Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920111/rainwater-leaves-newly-built-jinnah-square-underpass-in-islamabad-impassable",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T02:47:34.000Z"
}
