{
  "title": "Interior ministry vows to take strict action against religious hate online during Muharram - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Ministry of Interior on Thursday announced that it planned to take strict action against elements spreading religious hate on social media as part of a security plan ahead of the month of Muharram.\n\nThe government has ramped up security efforts in the past few weeks as the first month of the Islamic calendar inches closer. KP and the Punjab government have planned to impose Section 144 across the province from Muharram 1 to 10, barring public gatherings, protests, or other actions that might disrupt peace.\n\nThe central Ruet-e-Hilal committee is set to meet today for the sighting of the moon for Muharram.\n\nAccording to a statement from the ministry today, Interior Minister Mohsin Naqvi chaired a meeting aimed at reviewing the security plan for the month.\n\n“It was decided that action will be taken against elements inciting religious hatred on social media in light of Muharram,” it said.\n\n“In this regard, PEMRA (Pakistan Electronic Media Regulatory Authority) has been instructed to monitor hateful content on electronic and social media.”\n\nThe meeting reviewed the security plan for Muharram in all provinces, including Azad Kashmir, Gilgit-Baltistan, and Islamabad, in detail, planning to take necessary administrative measures to ensure a peaceful Muharram across the country.\n\nNaqvi promised to cooperate on all possible fronts to ensure peace, particularly in AJK, Gilgit-Baltistan and Islamabad.\n\nOn the matter of internet and mobile phone service being suspended during processions, the meeting detailed that the decision will be taken in consultation with each province, keeping in view the security situation of each respective province.\n\n“All the necessary steps and decisions will be taken with the mutual consultation,” the minister said, warning that no one would be allowed to incite religious hatred or provocation.\n\nDetailing further security measures, he shared that Muharram processions will be monitored via modern technology.\n\nInspector general (IG) of police and Secretaries from all provinces, including Punjab, Khyber Pakhtunkhwa, Sindh, Balochistan, Azad Kashmir, Gilgit-Baltistan, as well as the capital, gave a briefing on the security plan at the meeting.\n\nMinister of State for Interior Talal Chaudhry, federal secretary interior, acting chairman CDA, commandant Frontier Constabulary, deputy commissioner Islamabad, deputy inspector general of police Islamabad, ministry of interior and senior officials of law enforcement agencies were also present at the meeting.\n\nMeanwhile, other senior officials of law enforcement agencies attended the meeting via video link.\n\nMuharram is a month of mourning, observed in particular by Shia Muslims worldwide.\n\nIt commemorates the Battle of Karbala in 680 AD, where, amongst many, the grandson of Prophet Muhammad (Peace Be Upon Him), Imam Husain, was martyred, and other family members were martyred or subjected to humiliation.\n\nKeeping in view the need for extra security due to the spike in religious activity during the first 10 days of Muharram, authorities make arrangements accordingly.\n\nLast week, the Punjab home department took additional security measures, including the deployment of armed forces where required, to ensure peace in the province during Muharram.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/261446234e377d9.jpg",
  "retrievedAt": "2025-08-20T04:28:01.126Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920266/interior-ministry-vows-to-take-strict-action-against-religious-hate-online-during-muharram",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T10:36:55.000Z"
}
