{
  "title": "Finance Bill sails through parliament to greenlight Rs17.57tr budget - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Finance Bill, 2025, was approved by parliament on Thursday, meaning that the Rs17.57 trillion budget for the coming fiscal year has been greenlit.\n\nThe PPP on Wednesday voiced strong reservations over a set of politically unpopular provisions in the federal budget for the next fiscal year, urging the government to amend “contentious” clauses ahead of its expected approval in the National Assembly today (Thursday).\n\nFinance Minister Muhammad Aurangzeb’s amendments to various legislation, including the Income Tax Ordnance, 2001, were all approved, while opposition amendments were rejected, according to a Dawn.com correspondent.\n\nThe bill was read out in the assembly and approved clause by clause. The session has been adjourned until 11am tomorrow.\n\nAddressing the House, PPP Chairman Bilawal Bhutto Zardari said his party would “happily support the budget,” since the government had accepted the party’s proposals.\n\n“We appreciate the government’s efforts as BISP’s (Benazir Income Support Programme) budget has been increased,” he said. “Moreover, the salaried class will not be taxed if their income equals to Rs1.2m per year and the solar tax has been reduced by 50 per cent.”\n\nBilawal added that after the PPP’s initial rejection, their recommendations regarding the Federal Board of Revenue (FBR) were accepted.\n\n“We are grateful to the government and the prime minister for accepting our proposals,” Bilawal said.\n\nMeanwhile, amendments to the Sales Tax Act, 1990, presented by Aurangzeb were approved by a majority vote in the House.\n\nThe amendment granted the finance committee powers to arrest traders involved in tax fraud exceeding Rs50 million. The federal government had earlier proposed an amendment to give the powers of arrest to the tax commissioner.\n\n“The FBR will not have the power of arrest during the investigation stage,” the amendment added.\n\nAll amendments introduced by the opposition in the Sales Tax Act were rejected by majority vote.\n\nSimilarly, an amendment to the Salaries and Allowances Act was presented with the support of the finance minister, according to which ministers and ministers of state will receive the same salary as members of parliament.\n\nThe amendment was approved by a majority vote.\n\nDuring the session, 107 entities— including lawyers’ bodies, hospitals and government projects — were granted tax-exempt status as part of amendments to the Income Tax Ordinance, 2001.\n\nThe finance minister’s amendments were all approved, while those presented by the opposition were rejected.\n\nAccording to the amendments, the following institutions and organisations are exempt from tax:\n\nUnder the amended ordinance, the pensions of former presidents and their widows will also be tax-exempt.\n\nEarlier this month, Aurangzeb unveiled Pakistan’s annual federal budget in a charged National Assembly session, outlining ambitious proposals to drive 4.2 per cent economic growth in the coming fiscal year while cutting back on overall spending and tightening tax measures.\n\nThe federal budget for fiscal year 2026 has a total outlay — the sum of expenditures and net lending of funds — of Rs17.573 trillion, representing a 6.9 per cent decrease from the previous year’s budget.\n\nThe government has proposed Rs16,286bn for current expenditure in the FY26 budget, a 5.33pc decrease from the previous year.\n\nMore to follow",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:27:59.328Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920303/finance-bill-sails-through-parliament-to-greenlight-rs1757tr-budget",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T14:01:46.000Z"
}
