{
  "title": "After success in the Middle East, US looks to secure Gaza truce - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: After getting Iran and Israel to end hostilities, US Pres­ident Donald Trump said on Wednesday that progress was being made to end Israel’s war on Gaza, as a new ceasefire push began more than 20 months since the start of the conflict.\n\n“I think great progress is being made on Gaza,” Trump told reporters ahead of a Nato summit in the Netherlands, adding that his special envoy Steve Witkoff had told him: “Gaza is very close.”\n\nKey mediator Qatar announced on Tuesday that it would launch a new push for a ceasefire, with Hamas on Wednesday saying talks had stepped up.\n\n“Our communications with the brother mediators in Egypt and Qatar have not stopped and have inten­sified in recent hours,” Hamas official Taher al-Nunu told AFP.\n\nHe cautioned, however, that the group had “not yet received any new proposals” to end the war.\n\nThe Israeli government declined to comment on any new ceasefire talks beyond saying that efforts to return Israeli prisoners in Gaza were ongoing “on the battlefield and via negotiations”.\n\nTrump’s comments came a day after a US intelligence assessment revealed that US strikes had only set back Iran’s nuclear programme by just a few months. But on Wednesday, Trump compared the attacks to the end of World War II, arguing that the damage was severe even though available intelligence was inconclusive.\n\n“The intelligence was … very inconclusive,” Trump told reporters while meeting with Nato Secretary General Mark Rutte ahead of a summit in The Hague.\n\nTrump said the US strikes were responsible for ending the war between Israel and Iran and compared them to the United States’ use of atomic bombs on Hiroshima and Nagasaki in Japan, which brought an end to World War Two in 1945.\n\n“I don’t want to use an example of Hiroshima, I don’t want to use an example of Nagasaki, but that was essentially the same thing. That ended that war. This ended the war,” Trump said.\n\nTrump argued that Iran’s nuclear deal had been set back “basically decades, because I don’t think they’ll ever do it again” and he turned to top advisers to reinforce that message.\n\nTeases nuclear talks\n\nTrump also said the US would hold nuclear talks with Iran next week, teasing the possibility of a deal even after boasting that recent US strikes had crippled Tehran’s atomic programme.\n\nInsisting on the “total obliteration” of Iran’s nuclear capabilities, contrary to leaked US intelligence, Trump said, “They’re not going to be building bombs for a long time,”\n\nHe added that the strikes had set back the programme by “decades” and that the ceasefire that he declared was going “very well”.\n\nTrump later told reporters that Israel and Iran were “both tired, exhausted”, going on to say that talks were planned with Iran “next week”.\n\n“We may sign an agreement. I don’t know,” he added.\n\nIran’s death toll\n\nThe spokesperson for Iran’s Health Ministry has released an updated death toll from Israel’s attacks on Iranian territory, Al Jazeera reported.\n\nIn a post on X, Hossein Kermanpour said at least 627 people were killed and 4,870 wounded in Israeli strikes.\n\nTehran recorded the highest number of casualties, followed by Kermanshah, with Khuzestan, Lorestan, and Isfahan reporting significant losses, he said.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:45:57.229Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920140/after-success-in-the-middle-east-us-looks-to-secure-gaza-truce",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T03:07:17.000Z"
}
