{
  "title": "PM reaffirms commitment to agriculture and power sector reforms - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Calls for reducing tax burden on agriculture and introducing reforms to enhance productivity\n• Welcomes provincial funding for agricultural projects, terming them key to sectoral growth\n• Instructs fast-tracking of second and third phases of Genco privatisation\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Wednesday reaffirmed the government’s commitment to revitalising the agriculture sector, urging relevant authorities to reduce tax burden on the sector. He also called for introducing sustainable reforms to boost the sector.\n\nDescribing the agriculture sector as the backbone of the national economy, the prime minister emphasised that the introduction of sustainable reforms in agriculture will not only boost the country’s economic development but also significantly enhance per-acre yield and reduce production costs.\n\nPresiding over a high-level meeting on agricultural sector reforms, the prime minister directed the relevant authorities to gradually reduce taxes on agricultural machinery and tools in order to encourage farm mechanisation across the country. He also instructed to expedite efforts aimed at increasing the storage capacity for agricultural produce.\n\nPM Shehbaz welcomed the provision of funds by the provincial governments for new agricultural projects, stating these initiatives would play a key role in accelerating sectoral growth. He expressed optimism that the agriculture students and scientists currently pursuing scholarships in China would contribute to the sector’s development as entrepreneurs upon their return.\n\nHe said no new taxes were being imposed on fertilisers or agricultural pesticides in the upcoming fiscal year, reaffirming the government’s commitment to support farmers and keep input costs manageable.\n\nHe noted that the development of the agriculture sector would directly benefit farmers and uplift rural communities across the country. He stressed that increasing agricultural productivity, modernising infrastructure, and facilitating access to affordable credit were all crucial pillars of the reform agenda.\n\nDuring the meeting, the prime minister was briefed on key recommendations focused on increasing agricultural output, improving infrastructure, and expanding farmers’ access to easy agri-loans.\n\nThe briefing highlighted the National Agriculture Innovation and Growth Action Plan, which aimed to raise farmers’ incomes, boost production, and steer reforms in the right direction. It was also shared that increasing exports of value-added agricultural products would further enhance farmers’ earnings. Under the National Technology Fund’s project Ignite, a total of 129 agricultural start-ups have been launched to date, aimed at fostering innovation and entrepreneurship in the sector.\n\nThe meeting was attended by Federal Minister for National Food Security Rana Tanveer Hussain, Minister for Climate Change Dr. Musadik Malik, PM’s Chief Coordinator Musharraf Zaidi, Chief Coordinator for Agriculture Sector Ahmad Umair, as well as private sector entrepreneurs and senior government officials.\n\nPower sector reforms\n\nPrime Minister Shehbaz also chaired a high-level meeting on power sector reforms in Islamabad today, where he emphasised that ensuring public relief and uninterrupted electricity supply to industries remain among the government’s top priorities.\n\nHe reviewed progress on reforms, including privatisation of loss-making generation companies (Gencos), installation of smart meters, and promotion of renewable energy and electric vehicles.\n\nThe PM directed authorities to expedite the second and third phases of the privatisation of loss-making Gencos and to broadcast the process live to ensure transparency. He also called for rapid completion of smart meter installations and urged swift execution of proposed projects to improve the electricity transmission and distribution system.\n\nHe announced that the federal government has successfully completed the solarisation of tube wells in Balochistan, which is expected to enhance agricultural productivity in the province. He also ordered acceleration of the privatisation process of electricity distribution companies and the nationwide establishment of electric vehicle charging stations.\n\nThe prime minister noted that, by the grace of God, electricity tariffs were kept stable for consumers during the recent winter. He further stated that completing low-cost and eco-friendly renewable energy projects remains a top priority to provide sustainable relief to the public.\n\nThe meeting was briefed that the first phase of Gencos privatisation has been completed, generating Rs9.05 billion in revenue. Negotiations with 36 Independent Power Producers (IPPs) on tariff reductions are expected to save the national treasury Rs3.69 trillion.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/26080401b3f4896.jpg",
  "retrievedAt": "2025-08-20T04:28:30.415Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920130/pm-reaffirms-commitment-to-agriculture-and-power-sector-reforms",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T02:52:06.000Z"
}
