{
  "title": "PTI demands action against sugar barons for tax evasion - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The PTI on Wednesday criticised the government, alleging it has brought the country’s economic wheel to a “grinding halt, turning the lives of the rank and file miserable” and demanded accountability for sugar mill owners evading taxes.\n\nAlleging billions of rupees in tax evasion, PTI Central Information Secretary Sheikh Waqas Akram, in a statement, urged swift action against eight sugar mills owned by politically influential individuals and their ‘abettors and facilitators’.\n\nMr Akram noted the government exported nearly 750,000 metric tons “only to announce the import of the same quantity within the same fiscal year — a move that has led to a sharp spike in domestic prices, directly benefiting sugar mill owners”.\n\nDescribing such decisions as “criminal”, he demanded a full-scale investigation.\n\nCriticises govt for ‘economic meltdown’\n\n“This gimmick has pushed the price of sugar to Rs190 per kilogram — a staggering Rs50 increase compared to the pre-export rate,” Mr Akram added.\n\nMr Akram said that development spending has to be slashed in the coming budget due to severe fiscal constraints, which he warned “would further deepen the cycles of poverty and unemployment”.\n\n“Like the rest of the ruling elite, the finance minister has no concern for public welfare, as he was brought in from abroad with a specific agenda and will leave the country on the first available flight after losing his position — just as his predecessors did,” Akram said.\n\nHe warned these worsening socioeconomic conditions could fuel extremism and terrorism.\n\nMr Akram highlighted the “significant hike in salaries and privileges for the Speaker, Senate Chairman, and MPs”, while asserting the “elite-serving regime has worsened hardships by taxing online private jobs, further burdening the already struggling youth”.\n\nThe PTI CIS pointed out that “42 per cent of Pakistanis were surviving on less than $3.65, or just over Rs1,000, a day”.\n\nHe questioned the delay in initiating criminal proceedings against sug­ar mills, vowing the PTI wo­uld hold those involved accountable.\n\nMr Akram also said that PTI Patron-in-Chief Imran Khan condemned recent drone strikes in tribal districts, asserting they were “always counterproductive” and fuelled militancy, recalling that no such strikes occurred during PTI’s tenure.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:46:22.427Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920145/pti-demands-action-against-sugar-barons-for-tax-evasion",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T03:15:22.000Z"
}
