{
  "title": "IHC suspends life ban on former Pakistan Boxing Federation chief - Sport - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court on Wednesday suspended the Pakistan Sports Board’s lifetime ban and Rs1million fine imposed on former Pakistan Boxing Federation president Khalid Mahmood and secretary Retired Colonel Nasir Ijaz Tung over an alleged theft incident during a boxing tour in Italy.\n\nJustice Arbab Muha­mmad Tahir, while announcing the decision, ruled that the PSB’s punitive measures would remain suspended until the adjudication panel of the Board hears the case afresh and delivers a final verdict.\n\nThe court directed the panel to conduct transparent proceedings and ensure decisions are made strictly in accordance with the law, uninfluenced by prior findings.\n\nThe case stems from a March 3, 2024 incident in Italy, where British-born Pakistani boxer Laura Akr­am and her coach reported the theft of money and passports. According to the petitioners, boxer Zohaib Rasheed allegedly took the hotel key and absconded with the valuables. Italian police are currently investigating the matter.\n\nFollowing the incident, the PSB conducted an internal inquiry and found PBF officials responsible, subsequently banning them from holding any official positions in sports federations and imposing financial penalties. The Board of Governors also instructed the PSB to refer the matter to the Federal Investigation Agency, suggesting possible elements of human trafficking.\n\nThe BoG further appro­ved the recovery of a Rs 1 million surety bond and recommended a permanent ban on Zohaib Rash­eed from representing Pakistan internationally. It also urged the implementation of barcoded, verifiable No Objection Certificates for athletes.\n\nHowever, the sanctioned PBF officials challenged the PSB’s decision, claiming it lacked due process and was based on unverified allegations.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:28:03.199Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920213/ihc-suspends-life-ban-on-former-pakistan-boxing-federation-chief",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T04:49:45.000Z"
}
