{
  "title": "Nato chief likens Trump to a ‘daddy’ in Israel-Iran conflict - World - DAWN.COM",
  "author": null,
  "content": "THE HAGUE: Nato Secretary General Mark Rutte on Wednesday likened President Donald Trump to a “daddy” intervening in a schoolyard brawl after the US leader repeatedly berated Middle East foes Israel and Iran this week including with a profanity.\n\nTalking to reporters alongside Rutte at a Nato alliance summit, Trump again berated Israel and Iran.\n\n“They’ve had a big fight, like two kids in a schoolyard. You know, they fight like hell, you can’t stop them. Let them fight for about 2-3 minutes, then it’s easy to stop them,” he said. In response, Rutte laughed and said: “And then daddy has to sometimes use strong language to get (them to) stop.”\n\nOn Tuesday, after a ceasefire deal, Trump had raised eyebrows by saying Israel and Iran had been fighting “so long and so hard that they don’t know what the f*** they’re doing”.\n\nWith the 32-member Nato alliance endeavouring to placate Trump after complaints that it was over-reliant on US financial and military muscle, Rutte was asked if he might be over-flattering the US president.\n\n“No, I don’t think so. I think it’s a bit of a question of taste,” he said, calling Trump a “good friend” for more than a decade and praising his role in “finally” persuading Europe to boost military spending.\n\n“So doesn’t he deserve some praise?” Rutte asked, also noting Trump’s decision to bomb Iran’s nuclear sites.\n\n“And when it comes to Iran, the fact that he took this decisive action, very targeted, to make sure that Iran would not be able to get his hands on a nuclear capability — I think he deserves all the praise.”\n\nIran branded Nato Secretary General Mark Rutte’s gushing note to President Donald Trump on US strikes targeting key nuclear sites as “disgraceful, despicable and irresponsible”.\n\nIranian foreign ministry spokesman Esmaeil Baqaei hit back, saying it was “disgraceful, despicable and irresponsible for Nato’s SG to congratulate a `truly extraordinary’ criminal act of aggression against a sovereign state”. Whoever supports a crime is regarded as complicit“, Baqaei said in a post on\nX.\n\nPublished in Dawn, June 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2611235440dba4d.jpg",
  "retrievedAt": "2025-08-20T04:28:05.606Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920172/nato-chief-likens-trump-to-a-daddy-in-israel-iran-conflict",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T03:54:38.000Z"
}
