{
  "title": "Pakistan Railways suspends 42 trains amid corona virus outbreak",
  "link": "https://www.app.com.pk/national/pakistan-railways-suspends-42-trains-amid-corona-virus-outbreak/",
  "date_published": "2020-03-21T05:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP):Federal Minster for Railways Sheikh Rasheed Ahmed Saturday announced to suspend 42 trains by April 1 as preventive measure to restrict the transmission of pandemic COVID-19 corona virus.\nAddressing media in a press conference, the minister said that 12 trains (6-up+down) will be suspend from Sunday evening whereas 22 trains (11-up+down) will be suspended from the Tuesday morning and other 8 trains (4-up+down) will be suspended on April 1.\nKhushhal express, Akber express, Sindh express, Ravi express, Shah Latif and Rohi Express, (6-up+6 down) will be closed from Sunday evening whereas Jinnah express, Bolan express, Moinjo daro express, Thal express, Marvi express, Samman Shakir express, Faisalabad express, Mosa Pak express and Channab express will be suspended on March 25, said the minster.\nThe decision of phasewise suspension of trains have been taken to facilitate the passengers, the minister said adding that Pakistan Railway has refunded Rs. 800 million to the passengers so far however the passengers have been given an option to either take a refund or avail the ticket in another train in the same class.\nHe said that 700 million passengers annually travel through Pakistan Railway and average two hundred thousand passengers per day travel through these trains but due to current situation the number has declined to 1,65,000 passengers per day.\nSheikh Rasheed said that National Disaster Management Authority (NDMA) has promised to provide scanners and protective gears for better scanning of passengers traveling through railways.\nPakistan Railways operates 142 trains on 1885 kilometer long track said the minister adding the government has decided to suspend only 42 trains out of 142 because railways is out of cash to pay refunds at once to all the passengers.\nHe said, he agrees with the Prime Minister Imran Khan’s decision of not to lockdown the country but therefore the suspended trains will be restored soon the situation improves.\nHe said the notification for suspension of trains will remain effective till 15 Ramzan however the notification will either be revoked or renewed keeping in view the situation.\nHe appealed the passengers to avoid unnecessary traveling and stay home.\nThe minister said that Pakistan Railways will have no problem in payment of salaries to the staff however regarding payment of pension he has spoken with the Prime Minister to bear the burden replacing it with a subsidy, the government pay to Pakistan Railways.\nWith the suspension of 42 trains, Pakistan Railways will have financial loss of Rs. 2.3538 billion the minister said adding that no daily wages employee of railway will be sent home in this emergency situation.\nIf the government take responsibility of payment of pension to Railway employees, the deficit of Pakistan railway will be zero and it will become a profit making entity, said the minster.",
  "retrievedAt": "2025-08-11T18:58:45.898Z"
}
