{
  "title": "CM announces closure of malls, markets, parks till Tuesday",
  "link": "https://www.app.com.pk/national/cm-announces-closure-of-malls-markets-parks-till-tuesday/",
  "date_published": "2020-03-21T01:55:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 21 (APP):Punjab Chief Minister Sardar Usman Buzdar has decided to close down shopping malls, markets, parks and public gathering places from Saturday March 21 (today) 9 pm, till Tuesday morning,9 am, as precautionary measure\nagainst coronavirus.\nHowever,the shops selling milk, yogurt, general stores, meat, petrol pumps, pharmacy, bakeries, naan shops, tandoors, fruits and vegetables markets will remain open.The decision was taken in cabinet committee meeting chaired by the Chief Minister at his Office here on Saturday.\nTake away service from hotels and restaurants will also remain available, while public transport will not be closed in Punjab. However, masses should avoid unnecessary travel, said the chief minister.\nUsman Buzdar, while directing concerned departments, said that no shopkeeper should be unduly disturbed.\nThere were a total of 137 corona patients across Punjab so far out of whom 106 were in DG Khan quarantine, 20 in Lahore, 4 in Gujranwala, 3 in Gujrat, 2 in Jhelum and one each in Rawalpindi and Multan.\nThe meeting was also apprised that there were more than 24,000 gowns available for the doctors and paramedical staff whereas 760000 gloves, 944000 surgical masks, 9,2000 N95 masks\nwere available across Punjab. A stock of 5,000 goggles, 44,000 show covers and 40,000 sanitizers were available for the medical staff.\nThe chief minister said the government was not taking steps of lockdown but urged the masses to practice social distancing and stay at home,saying these steps were vital to prevent spreading of coronavirus .He said\nSOPs were being formulated in this regard. Consultation with the federal government for making quarantine at residences was also underway.\nHe directed the industries department to ensure provision of essential edibles in the province. Corona Emergency Ordinance will be presented before the cabinet meeting for approval on Tuesday, he said adding that Chief Secretary Punjab will present provincial contingency plan to the cabinet on Tuesday while Finance Minister will also present social protection contingency plan.\nUsman Buzdar said that for well off and rich patients, isolation/quarantine facility will be provided in private hospitals. Provincial Law Minister Raja Basharat and Secretary Health will hold video link meeting with the doctors so that their reservations could be timely redressed.\nLater,the chief minister briefing the media through video link said that Chinese doctors will also visit Pakistan to provide assistance in treatment to corona patients. Consultations were underway with the private institutions to reduce corona virus test fee, he added.\nA thousand bed hospital will be set up in Lahore, while five hospitals were completely earmarked for coronavirus patients across the province, added Usman Buzdar.\nProvincial Ministers Dr Yasmin Rashid, Hashim Jawan Bakht, Mian Aslam Iqbal, Chief Secretary also attended the meeting while Provincial Energy Minister Akhtar Malik attended the meeting from Commissioner Office Multan, Provincial Secretaries from the Civil Secretariat Committee Room and IG Police, Chairman PITB and other officials attended the meeting via video link.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:58:48.030Z"
}
