{
  "title": "Social distancing prevents pandemic COVID-19 coronavirus: Zafar Mirza",
  "link": "https://www.app.com.pk/national/social-distancing-prevents-pandemic-covid-19-coronavirus-zafar-mirza/",
  "date_published": "2020-03-21T03:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP):Special Assistant to Prime Minister on Health Dr. Zafar Mirza Saturday appealed the nation to practice social distancing on a long weekend to avoid transmission of Pandemic COVID-19 coronavirus.\n”I am very hopeful, If we practice social distancing, we will be able to control Pandemic COVID-19 coronavirus” said Mirza in a news conference from National Institute of Health (NIH) to brief media on government’s efforts.\nHe said National Coordination Committee (NCC) was constituted to collect data and brief the nation about the national emergency.\nSecondly, the NCC will deliver the messages though media on awareness and government’s action to prevent the transmission of virus as well as to strengthen coordination between the provinces and the federal government, said SAPM.\nThird purpose of constituting a committee was regarding procurement of masks, ventilators, protective gears to enhance the capacity to fight the virus, he said.\nProtection of our front line doctors treating infected people was government’s foremost priority, said Zafar Mirza adding NCC would deliver univocal message to the nation using information technology.\nHe said coronavirus reached in 186 countries and affected 0.27 million people whereas, 11,431 people have died because of the infection but 92,000 were completely recovered which was hopeful.\nIn Pakistan, 4,046 cases were suspected and 534 out of these were coronavirus positive, said SAPM adding out of 534, Punjab has 104, Sindh has 264, KPK has 27, Balochistan has 103, Gilgit Baltistan has 30, AJK has 1 and Islamabad has 10 confirmed cases.\nHe said, 3 people died because of the virus and so far 5 people have completely recovered and many more would recover in coming days and also be discharged from the hospitals.\nDr. Zafar Mirza said that 13,991 people at all entry points were scanned in last 24 hours and 1.4 million people have been screened so far at entry points.\nHe said, in between February 28 to March 17, 6,304 people entered in Pakistan from Iran out which 2,421 arrived in Balochistan, 176 people arrived in KPK, 2,012 arrived in Punjab, 1,059 arrived in Sindh, 14 arrived in AJK and 523 arrived in GB.\nIt was decided to quarantine all returning from Iran at Taftan and now the provinces were doing it again said SAPM adding 3,378 people spending time in Quarantine facilities in different provinces.\nHe said government of Pakistan has established 14 labs so far in all four provinces testing coronavirus and more labs would be established soon.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:58:48.031Z"
}
