{
  "title": "Pak-Afghan trade businessmen assured for expediting goods clearance",
  "link": "https://www.app.com.pk/national/pak-afghan-trade-businessmen-assured-for-expediting-goods-clearance/",
  "date_published": "2023-02-01T12:04:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 01 (APP): Collector Customs Appraisement Peshawar, Ashfaq Ahmad has assured the businessmen involved in Pak-Afghan Transit Trade about taking measures to resolve the problems being faced by them and expediting the clearance of goods at border posts.\nHe said this while speaking at the stakeholders’ meeting arranged by Pak-Afghan Joint Chamber of Commerce and Industry (PAJCCI) held here on Wednesday.\nThe meeting was attended by businessmen from both the countries wherein marathon discussions were held on issues causing hindrances in smooth sailing of trade between the two neighboring countries.\nThe delegation of businessmen from Pakistan was headed by Director PAJCCI, Zia-ul-Haq Sarhadi and Kahlid Shahzad, Senior Vice President PAJCCI. While the Afghan businessmen delegation was headed by Dr. Muklis Younas.Collector Custom was accompanied by Additional Collector Headquarters, Afnan Khan and Assistant Collector Custom Station Torkem, Yawar Hayat.\nAshfaq Ahmad said Custom Department officials will do their best for resolution of all the problems faced by the business community. However, he continued, if an issue does not come into their purview, they will take it up with relevant authorities in different departments including State Bank of Pakistan, Federal Board of Revenue, Commerce Ministry, NLC, Railways etc.\nThe trade between Pakistan and Afghanistan is centuries old and is benefiting thousands of people in both sides of the border, Ashfaq observed, adding that our endeavor was the continuity of this ancient practice and for bringing improvement in it for tapping its full potential of bringing economic prosperity in the region.\nThe Collector Customs said he is also concentrating on other border posts including in South Waziristan’s Angoor Ada for providing facilities to the trading community.\nHe said at Angoor Ada, there are issues in facilities including internet, electricity, scanning of goods, infrastructure and communication which needs to the resolved at early basis.\nIn reply to a point raised by an Afghan businessmen about delay in clearance of goods, Ashfaq Ahmad informed the participants that purchase of a modern scanner is in process and soon physical checking will stop at Torkhem causing delay in clearance of goods.\nHe also asked businessmen from both the countries to approach them freely for raising of any issue and said the doors of his office are always open for them for any time.\nEarlier both sides shared the issues and potential of economic relationship between the two countries. The problems raised included high labour charges, mishandling of cargo while loading and unloading issues on Afghan Side including tax on transit goods, slow clearance rate of empty containers, restricted hours at border crossing for clearance and movement, delay & high rejection of visa processing for Afghan businessmen, pendency of 47000 TI forms by Afghan side since a year despite several reminders and communication.\nAnother significant issue was of slow processing at Karachi for goods which previously took a day or 2 but now 5-6 days on minimum, leading to increased time and cost of doing business as delayed returns are affected by detention and demurrage charged further aggravated by rising fuel prices and dollar parity.\nAfghan businessmen showed concern on high level visa rejection despite providing all relevant documents, they mentioned that from traders, investment documents are sought which is uncalled for.\nIn response to recent complaint raised by PAJCCI of slow cross border clearance of empty containers, Assistant Director DTT informed that in last couple of days, it has been tackled and all congestion or back log is cleared.\nThe house jointly agreed that bilateral efforts are required including visa facilitation, 24 hours border operations, mutually agreed future procedures & rules to ensure trade continues.\nIn the welcome address, Director PAJCCI, Zia-ul-Haq Sarhadi apprised participants that the objective of the gathering is to hold discussion on issues faced by them in doing business.\nHe said the stakeholders’ meetings being held under the platform of PJACCI have helped a lot in resolution of different issues and provided ease to people involved in Pak-Afghan commerce and trade.\nHe also thanked Chairman PAJCCI, Zubair Motiwala for supervising these whole activities and taking up the issues with relevant departments and officials for resolution.",
  "retrievedAt": "2025-08-11T05:53:19.364Z"
}
