{
  "title": "Capitals’ hospitals take special measures to manage any untoward situation",
  "link": "https://www.app.com.pk/national/capitals-hospitals-take-special-measures-to-manage-any-untoward-situation/",
  "date_published": "2023-02-01T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP): The administrations of two major hospitals of the federal capital have started taking special measures to keep the emergency departments on high alert in case of any untoward situation.\nAccording to hospitals sources at Pakistan Institute of Medical Sciences (PIMS) and the Federal Government Polyclinic (FGPC), the shift duty staff and emergency staff will perform their duties as usual while the heads of clinical departments have been asked to ensure their presence.\nThey have also been asked not to leave the station and make sure the presence of on-call doctors according to the duty roster prepared with the coordination of the Medical Director’s Office in departments including General Surgery, Neurosurgery, Orthopedic, OMFS, ENT, Eye, General Medicine, Paeds Surgery and Burn Care Centre.\nSimilarly, all hospitals staff including doctors, nurses, paramedics, and ancillary staff have been directed to remain alert and vigilant as and when required for any untoward adverse situation.\nThey said that all vehicles or ambulances will be on standby in the premises of the hospitals to cater to any emergency situation besides making other necessary arrangements to meet any untoward situation. All the officers or officials working in the emergency department will remain physically present in their respective shifts.\nThe administration of both hospitals have made it clear that no any leave application will be entertained during the current situation.\nIt is pertinent to mention here that on the direction of Minister for National Health Services Abdul Qadir Patel, heads of PIMS and FGPC hospitals were directed to ensure the availability of medical and para-medical staff as well as essential services in their respective hospitals around the clock.\nThe instructions were issued keeping in view the prevailing situation after a bomb blast in Peshawar and taking into consideration the referring of blast patients to federal capital hospitals.",
  "retrievedAt": "2025-08-11T05:53:16.369Z"
}
