{
  "title": "Envoys reaffirm resolve to take Pak-Ethiopia bilateral ties to new heights",
  "link": "https://www.app.com.pk/national/envoys-reaffirm-resolve-to-take-pak-ethiopia-bilateral-ties-to-new-heights/",
  "date_published": "2023-02-01T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP):Ambassador of the Federal Democratic Republic of Ethiopia to the Islamic Republic of Pakistan Jemal Beker Abdula and his counterpart in Addis Ababa Shozab Abbas on Wednesday reaffirmed their resolve to take the already flourishing ties between the two countries to new heights by enhancing bilateral, regional and multilateral cooperation.\nThey expressed their resolve during a meeting held here at the Embassy of the Federal Democratic Republic of Ethiopia (FDRE).Both discussed regional and global issues of mutual interests during the meeting which reviewed the entire gamut of bilateral relations between the two countries. They agreed to establish contact between the top leadership of Pakistan and Ethiopia.\nAmbassador Jemal Beker Abdula said that Ethiopia accorded utmost importance to its ties with the Islamic Republic of Pakistan as both countries had a long history of working together for global peace and preservation of the rule-based world order.\nAs regards of bilateral trade, the Ambassador of Ethiopia said that the prospect of trade between the two countries was b’right as the business community from both Pakistan and Ethiopia were eager to penetrate in each others’ markets.\nHe briefed his counterpart on the progress so far made on the Pakistani business delegation flying to Ethiopia on March 5-10 to explore business, trade and investment opportunities in the land of origin.\nJemal Beker said that a high-level delegation from Ethiopia was also expected to arrive in Pakistan in April to formally inaugurate the FDRE Embassy in Islamabad and for signing the agreements in various fields including trade, science and technology, aviation and others.\nHe also discussed the matters related to the flight operation of Ethiopian Airlines in Pakistan with his counterpart Shozab Abbas who assured him of his full support in this regard.\nPakistan’s Ambassador to Ethiopia Shozab Abbas said that there was need to encourage the business fraternity from both sides to interact regularly to boost bilateral trade relations further. Moreover, he said that Ethiopia was a gateway to Africa, HQ for Africa Union and strong partner for Pakistan’s ‘Look Africa Initiative.’\nHe, however, emphasized promoting educational cooperation between the two countries which was crucial to enhance people-to-people contact between the two countries.",
  "retrievedAt": "2025-08-11T05:53:24.591Z"
}
