{
  "title": "BCCI denies reports of withdrawal from Asia Cup amid tensions with Pakistan: Indian media - Sport - DAWN.COM",
  "author": null,
  "content": "The Board of Control for Cricket in India (BCCI) has denied reports of withdrawal from all Asian Cricket Council (ACC) events amid recent tensions with Pakistan, according to Indian media.\n\nEarlier, The Indian Express, citing sources, reported that the BCCI had informed the ACC about its decision to pull out from the Women’s Emerging Teams Asia Cup in Sri Lanka next month and from the biennial Men’s Asia Cup in September in a bid to “isolate Pakistan cricket.”\n\n“The Indian team can’t play in a tournament that is organised by the ACC whose chief is a Pakistan minister”, the source said, referring to Pakistan Cricket Board (PCB) Chairman, Interior Minister Mohsin Naqvi, who was appointed as the new president of the ACC last month. The outlet further quoted the source as saying that the BCCI was aware that an Asia Cup without India was not a feasible option as many of the sponsors of international cricket events were from India.\n\nThe International Cricket Council (ICC), the global governing body for cricket, did not comment on the matter.\n\nLater in the day, however, BCCI Secretary Devajit Saikia refuted the news, telling Indian outlet ANI, “Such news [is] devoid of any truth as till now. BCCI has not even discussed or taken any such steps regarding the ensuing ACC events, let alone writing anything to the ACC.\n\n“At this stage, our prime focus is on the ongoing IPL and subsequent England series, both men’s and women’s.”\n\nHe continued: “The Asia Cup matter or any other ACC event issue has not come up for discussion at any level, hence any news or report on that is purely speculative and imaginary. It may be said that BCCI, as and when any discussion on any ACC events takes place and any important decision is reached, same will be announced through media.”\n\nIndia has not played bilateral cricket against Pakistan since 2007 due to tense relations between the countries. Both countries only play each other in international tournaments on neutral grounds.\n\nThe political relations between Pakistan and India have led to similar issues in the past. In 2023, a hybrid-model solution was proposed by official Asia Cup host Pakistan after the BCCI refused to tour the neighbouring country to play the tournament.\n\nDuring the ICC Champions Trophy, India played their matches in Dubai after the country’s government had refused to send its team to Pakistan, the original hosts of the tournament.\n\nEarlier this month, India head coach Gautam Gambhir called for a complete halt to cricketing engagements with Pakistan at any forum, including the Asia Cup and ICC events.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:18:22.125Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911964/bcci-denies-reports-of-withdrawal-from-asia-cup-amid-tensions-with-pakistan-indian-media",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T07:18:35.000Z"
}
