{
  "title": "Minister promises public relief after military success - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Key federal ministers hold consultations in Karachi to get allies on board\n• Sanaullah hints at ‘good news for common man’ in upcoming budget\n• Tessori calls for efforts to steer country out of debt trap\n• Aurangzeb says next fiscal year’s budget to prioritise development spending, reduce inflationary pressures\n\nKARACHI: In the wake of the country’s recent military success against Indian aggression, the federal government has claimed to have turned its focus to economic recovery and public relief, with high-level consultations underway ahead of the national budget.\n\nOn Sunday, key federal ministers met separately with the Sindh governor and chief minister in Karachi, aiming to build consensus among major coalition partners — the Pakistan Peoples Party (PPP) and Muttahida Qaumi Movement-Pakistan (MQM-P) — to shape the upcoming fiscal agenda.\n\nFinance Minister Muhammad Aurangzeb, Special Assistant to the Prime Minister on Political Affairs Rana Sanaullah, Minister for Energy Awais Leghari, and Petroleum Minister Ali Pervaiz led the delegation from Islamabad to hold meetings at the Governor House and Chief Minister House, where they addressed both regional challenges and broader national economic objectives.\n\nAt the Governor House, Sindh Governor Kamran Khan Tessori received the delegation, joined by senior MQM-P leaders including Dr Khalid Maqbool Siddiqui, Dr Farooq Sattar, Nasreen Jalil, Aminul Haque, Javed Hanif, and others. The discussions also focused on Karachi’s governance issues and socio-economic challenges in the interior of Sindh.\n\nA significant takeaway from the meeting came from Rana Sanaullah, who offered a glimpse into the government’s budget vision. “There is good news for the common man in the upcoming budget. Thanks to the collective efforts of our coalition partners, a people-friendly budget is in the pipeline that would bring relief to the salaried class,” he said in a brief address to the media after the meeting, without going into the details.\n\nHe said that the salaried class — one of the hardest-hit segments by inflation — would receive much-needed relief. The government is determined to ensure that economic reforms translate into tangible benefits for ordinary citizens, he vowed.\n\nIn his remarks to the media, Governor Tessori expressed gratitude to the leaders of both coalition partners for attending the meeting, emphasising national unity and collective responsibility.\n\n“Pakistan’s defence has been proven to be in strong hands, thanks to the valour of our armed forces,” he said, referring to the recent military triumph. He stressed the need to turn that unity inward towards economic resilience.\n\n“Now it’s time that by next year, we must try our best to steer Pakistan out of the debt trap,” he said, praising the finance minister for conducting successful IMF negotiations during a time of conflict.\n\n“India tried to block our financial tranche, but our finance team defended Pakistan’s case with clarity and conviction,” he added.\n\nSenior MQM-P leader Dr Farooq Sattar pleaded the case of urban Sindh with a main focus on Karachi and welcomed Prime Minister Shehbaz Sharif’s initiative to bring all coalition partners on board before the budget.\n\n“It shows renewed commitment to inclusive governance. Given the fragile economic conditions and the looming challenges of inflation, unemployment, and external debt, forging such unity is not just symbolic but essential,” he said.\n\nWith the military front momentarily secure, he said, the battleground has now shifted to markets, livelihoods, and public trust.\n\nEarlier, the delegation met Sindh Chief Minister Syed Murad Ali Shah at the CM House. Senior PPP leader and MNA Syed Naveed Qamar also attended the meeting.\n\nA statement issued by the CM House said that the meeting focused on pre-budget consultation, with both sides exchanging views on inflation control, agricultural and economic development, and fiscal coordination between the federal and provincial governments.\n\n“It is commendable that the new budget is being prepared through consultation. This inclusive approach can ensure real relief for the people,” the statement quoted CM Shah as saying.\n\nThe chief minister highlighted the importance of discipline in financial management and urged continued collaboration for better governance in Sindh.\n\nAccording to the statement, Finance Minister Aurangzeb assured participants that the economy is stabilising, and the upcoming budget would prioritise development spending and ease inflationary pressure. “The country is now heading towards economic progress,” he said.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/1910331249d6fd1.jpg",
  "retrievedAt": "2025-08-23T14:18:23.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911935",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:41:43.000Z"
}
