{
  "title": "Cotton sector faces potential crisis amid tax-free imports - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Despite the early commencement of the new cotton ginning season in the second week of May — a first in the country’s history — concerns are mounting that the cotton industry could face its worst economic crisis ever.\n\nThis apprehension stems from the tax-free import of raw cotton and yarn, which threatens the viability of the local industry.\n\nIndustry insiders fear that during the crop year 2025-26, cotton ginning and textile sectors may operate at less than 50 per cent of their total production capacity. This drastic reduction could force Pakistan to once again import cotton worth billions of dollars, alongside billions of dollars of edible oil.\n\nSo far three ginning factories have become operational in the Punjab cities of Khanewal and Burewala. There are reports that one or two ginning factories in Tando Adam, Sindh, are expected to become active from May 25.\n\nInitial deals for the new cotton are being finalised between Rs17,000 and Rs17,500 per maund, while new Phutti (seed cotton) is being traded between Rs8,300 and Rs8,500 per 40kg.\n\nThe federal government has permitted the import of cotton seeds for the first time in nearly 50 years. However, reportedly some high-ranking officials and private seed companies had already conducted unsuccessful trial cultivation of cotton seeds from China, Australia, the US, and Brazil in various parts of the country.\n\nThis failure is largely attributed to the lack of implementation of crop zoning laws, leading to environmental pollution that hinders successful cotton cultivation.\n\nCotton Ginners Forum Chairman Ihsanul Haq emphasises that the primary issue currently facing Pakistan is not cotton production but its consumption. Despite the country’s second-lowest cotton harvest of only 5.5 million bales during crop year 2024-25, approximately 200,000 to 250,000 bales of unsold cotton remain lying with ginning factories. Also, the ginners are still awaiting payments worth millions of rupees from some textile mills for the cotton sold on deferred\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:18:25.452Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911929/cotton-sector-faces-potential-crisis-amid-tax-free-imports",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:41:43.000Z"
}
