{
  "title": "KP Health Foundation awaits Rs3 billion funds to outsource seven hospitals - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Health Foundation is awaiting approval from finance department for availability of budget to award contract to private organisations for outsourcing seven hospitals.\n\nHealth Foundation (HF), a public sector entity established under Khyber Pakhtunkhwa Health Foundation Act, 2016, has been outsourcing those hospitals that are not performing well because doctors, nurses and paramedics don’t want to be posted there. Under the agreements, private organisations get funds and recruit doctors and other staff as per need to facilitate patients in the respective areas.\n\nSo far, it has contracted out 19 hospitals to private organisations, mostly in merged districts to improve services. Of these, the contracts of seven hospitals with HF expired in June 2023. The contracts were extended temporarily after the approval of provincial cabinet. The Board of Governors (BoG) of HF has already approved selection of private organisations to run these seven hospitals but is awaiting approval of finance department to release about Rs3 billion to sign contracts with the organisations, according to sources.\n\nAccording to them, the seven hospitals located in merged districts have been facing financial issues due to which they have restricted services and want the government to hand over the hospitals to the newly-selected organizations so they could be run at a desired level.\n\nProcess for selection of new partners already completed\n\nThey said that law department already vetted the contracts with new organisations but HF could not process it owing to lack of budgetary approval. “HF has been reminding health department to expedite the process, but so far there is no progress on budget allocation,” they added.\n\nSources in health department confirmed to have received requests from HF wherein it had stated that the tendering process for outsourcing seven hospitals had already been completed as per the recommendation of Cabinet Supervisory Committee according to law. “The process of selection of new organisations for seven hospitals has also been approved by the BoG of HF,” they said.\n\nNow, HF is in position to award contracts to selected organisations but the process is on hold owing to non-confirmation of availability of budget. The health department has been requested to take prompt action and ensure allocation of budget so that the hospitals can be handed over to the organisations that have been selected after a long process.\n\nSources said that previously, the process faced delay due to incomplete BoG but the government notified new BoG of HF in first week of April that rekindled hopes that the selected partners would be given charge of those hospitals where the older partners were facing financial issues and were not willing to run the health facilities anymore.\n\n“The new BoG has approved the selection of organisations for seven hospitals but without funds, HF cannot proceed further,” they said. They added that HF had requested allocation of the desired funds because the people, who were dependent on the seven hospitals for their treatment, would further suffer if the contracts delayed.\n\nAlready, the staffers of those hospitals had been protesting against lack of salaries as contracts of the old organisations had expired and they were not getting money from the government anymore. “HF is seeking funds to give these hospitals to the new organisations and ensure patients’ care,” said sources.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:08:56.074Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911825/kp-health-foundation-awaits-rs3-billion-funds-to-outsource-seven-hospitals",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:32:23.000Z"
}
