{
  "title": "Lahore General Hospital giving patients ‘unnecessary’ antibiotics against prescriptions - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore General Hospital (LGH) is embroiled in a controversy as it has been found dispensing irregular and unnecessary medicines, mostly antibiotics, to the patients, putting the health and lives of many of them at stake.\n\nThe new scam surfaced when the Punjab health department detected several ‘faulty entries’ of the dispensation of medicines to the patients in order to show to the chief minister that the hospital was following her order to provide free medicines/care to the poor patients.\n\nAn official privy to the development said that the medicines were officially dispensed to the outpatient department (OPD) patients from the hospital’s pharmacy reportedly in violation of the standard healthcare protocols.\n\nHe said the consultants at the hospital OPD used to update the prescribed slips on the official portal that was linked to the relevant departments, including the official pharmacy of the teaching institute, from where the free medicine was given to the poor/needy patients.\n\nProtocols violated to ‘show CM that patients were being provided with free medicines’; health dept seeks probe\n\nAccording to some official documents, the health authorities brought the matter to the knowledge of the LGH senior management while dispatching several individual cases, showing the grave negligence in dispensation of the medicines to the patients, contrary to those prescribed by the consultants.\n\nIt mentioned a case of one Muhammad Shakeel who visited the OPD on April 9. As per the documents, he was prescribed antihypertensives, antidiabetics and antihyperlipidimics by the consultant keeping in view the diagnoses of the disease and uploaded the same on the official portal. However, he was later dispensed three antibiotics (ciprofloxacin, co-amoxiclav and clarithromycin), 30 tablet each.\n\nIt was declared as a blatant violation of the standard healthcare standards as the medicines prescribed and those dispensed didn’t match each other, forcing the patient to take ‘irrelevant/unnecessary drugs’ which had nothing to do with the disease or the medicines advised by the consultant.\n\nSimilarly, a patient, Allah Dita, was advised medication for dysphagia and abdominal pain at the OPD of the LGH.\n\nCommitting the same blunder, the hospital dispensed three antibiotics (ciprofloxacin, coamoxiclav and clarithromycin), 20 tablets each against the given prescription.\n\nThe health authorities pointed out another case of a patient, Muhammad Shahbaz, who was provided by the hospital pharmacy 30 tablets each of four antibiotics (ciprofloxacin, co-amoxiclav, Cefixime and Moxifloxacin). Interestingly, his consultant had advised him the drugs, including tamsulosin (used to improve urination in men with an enlarged prostate), tramadol/paracetamol etc.\n\nA patient, Naseem, was prescribed, on April 17, velosef and Danzen DS while the hospital dispensed additionally cefixime (antibiotic), amlodipine, allopurinol and co-amoxiclave (antibiotic), showing how the patients were forced to take unnecessary medicines in ignorance.\n\n“I am directed to inform you that several instances of irregular dispensation of medicines at your hospital have been reported to this department, wherein medications are being dispensed in a manner that does not align with the prescriptions issued by the authorised medical attendant,” reads the official letter of a health department officer sent to the LGH.\n\nHe declared that these irregularities had posed a grave and a direct risk to patient safety and effectiveness of treatment. He asked the hospital to conduct an inquiry into the matter and submit detailed report and comments along with the fixation of responsibility upon the delinquents, to the health department. The hospital was given three days deadline in this respect.\n\nThe health department further issued instructions to the LGH to ensure that all medicine dispensation strictly adhered to prescriptions through the Hospital Management Information System (HMIS), without any alterations.\n\n“Any staff found involved in such practices must be held accountable, and corrective measures must be implemented to prevent recurrence/any untoward event,” reads the official letter.\n\nThe official source said that the hospital would have to expand the scope of investigations to find out the exact number of the affected patients and the period as it was feared that the violation was being committed since the last many months.\n\nLGH Medical Superintendent Prof Dr Faryad Hussain confirmed to Dawn about the serious complaints of irregular dispensation of drugs to the patients visiting its OPD, saying that matter had been put on priority in the larger interests of the poor patients.\n\n“We have constituted a high level committee to launch impartial probes to dig out facts with a prime objective of fixing those who committed blatant violations of the standard healthcare protocols,” he said.\n\nProf Hussain added that OPD Director Dr Adnan Masood would head the committee with strict directions to submit a report during the stipulated time period.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:09:14.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911888/lahore-general-hospital-giving-patients-unnecessary-antibiotics-against-prescriptions",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:32:07.000Z"
}
