{
  "title": "FBI identifies suspect in California fertility clinic bombing - World - DAWN.COM",
  "author": null,
  "content": "PALM SPRINGS: An FBI official said on Sunday investigators believe they have identified the suspect connected to a bombing near a fertility clinic in Palm Springs, California, as 25-year-old Guy Edward Bartkus, and that he held “nihilistic ideations.”\n\n“We are fairly confident that Mr Bartkus is our primary suspect,” said Akil Davis, assistant director at the FBI’s Los Angeles field office, speaking to reporters at a press conference.\n\n“The subject had nihilistic ideations, and this was a targeted attack against the IVF facility. Make no mistake. We are treating this… as an intentional act of terrorism.”\n\nA bomb detonated shortly before 11am local time on Saturday in or near a car parked outside the clinic, which was operated by American Reproductive Centre. One person was killed and at least four were injured in the blast. Officials said on Sunday that no embryos stored inside the clinic were harmed by the blast.\n\nDavis said the FBI believes that Bartkus died in the blast, and that he had been trying to live-stream the attack.\n\nThe blast tore through downtown Palm Springs, ripping a hole in the clinic and blowing out the windows and doors of nearby buildings, a journalist on the scene reported.\n\n“This is probably one of the largest bombing investigations that we’ve had in southern California,” FBI said.\n\nDebris for ‘several blocks’\n\nThe charred remnants of a vehicle lay in a parking lot, some distance from the apparent epicenter of the explosion. Debris was blown straight through the building and scattered across the road, while the roofs of a number of nearby buildings had been damaged, indicating the intense force of the blast.\n\nDavis of the FBI described the explosion as “significant” and said debris had been thrown more than two hundred yards (180 metres) from the scene, but declined to comment further on the characteristics of the bomb.\n\nThe local ABC affiliate, which cited an unnamed law enforcement source, said the person who died was a suspect in the blast. Davis told reporters that though the FBI was working to identify the deceased, “we are keeping that close hold in order to protect the integrity of the investigation.”\n\nA statement posted on social media by the clinic said no staff had been hurt, and that its lab — “including all eggs, embryos, and reproductive materials — remains fully secure and undamaged.” It said that “a vehicle exploded in the parking lot near our building.” Reproductive care, including abortion and fertility services, remains controversial in the United States, where some conservatives believe the procedures should be outlawed for religious reasons. Violence against clinics providing such services is rare, but not unheard of.\n\nPresident Donald Trump’s Attorney General Pam Bondi said federal agents were working to determine exactly what had happened.\n\n“But let me be clear: the Trump administration understands that women and mothers are the heartbeat of America. Violence against a fertility clinic is unforgivable,” she said in a statement on social media.\n\nPeople living near the clinic reported feeling the shaking from the blast throughout the city.\n\nMatt Spencer, who lives in a nearby apartment complex, told the Palm Springs Post he ran outside as soon as he heard the blast, and was confronted with the sight of the burned out car and what appeared to be a body in the middle of the road.\n\n“In front of the building [the car] was blown clear across four lanes into the parking lot of [Desert Regional Medical Centre],” he told the paper.\n\n“I could see the back of the car still on fire and the rims, that was the only thing that distinguished it as a car.” The Center for Reproductive Rights, a global advocacy group, described the bombing as “horrific” and “unconscionable.”\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:09:14.386Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911894/fbi-identifies-suspect-in-california-fertility-clinic-bombing",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:31:54.000Z"
}
