{
  "title": "12 terrorists of ‘Indian proxy’ outfits killed in KP, Balochistan engagements: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Twelve terrorists of “Indian proxy” outfits were killed by security forces while two personnel were martyred in separate engagements in Khyber Pakhtunkhwa and Balochistan, the military’s media wing said on Monday.\n\nThe Inter-Services Public Relations (ISPR) said the intelligence-based operations (IBOs) were conducted on Saturday and Sunday against the banned militant Tehreek-i-Taliban Pakistan group in KP and the proscribed Balochistan Liberation Front in Balochistan.\n\nIt said an IBO was conducted in Lakki Marwat district during which troops engaged the enemy at its location and sent “five Indian sponsored” terrorists to “hell”.\n\nIn a second IBO in Bannu district, two “Indian sponsored” terrorists were “successfully neutralised” by the security forces.\n\nIt added that terrorists ambushed a security forces convoy in another incident in North Waziristan district’s general area of Mir Ali, adding that two “Indian sponsored” terrorists were “sent to hell” after the effective response of troops.\n\n“However, during the intense fire exchange, two brave sons of soil, Sepoy Farhad Ali Turi (age: 29 years, resident of Kurram district) and Lance Naik Sabir Afridi (age: 32 years, resident of Kohat district) having fought gallantly, paid the ultimate sacrifice and embraced martyrdom.”\n\nThe ISPR said sanitisation operations were being conducted to eliminate any other terrorists found in the areas. “Security forces of Pakistan are determined to wipe out the menace of Indian abetted and prosecuted terrorism perpetrated through their proxies, and such sacrifices of our brave soldiers further strengthen our resolve,” it concluded.\n\nIn the first Balochistan encounter, troops engaged the terrorists at their location in Awaran district’s general area of Gishkur and killed “Indian-sponsored terrorist Younas” in an intense fire exchange, while two more were injured.\n\n“In another engagement in Turbat City, Kech district, security forces successfully neutralised two Indian-sponsored terrorists; terrorist ring leader Sabr Ullah and terrorist Amjad alias Bichoo,” the ISPR said.\n\nIt added that weapons, ammunition and explosives were recovered from the terrorists, who were actively involved in multiple activities against law enforcement agencies and target killing of innocent civilians.\n\n“Sanitisation operations are being conducted to eliminate any terrorist present in the area, as security forces of Pakistan, in step with the nation, remain determined to thwart attempts by Indian proxies at sabotaging peace, stability and progress of Balochistan.”\n\nPresident Asif Ali Zardari lauded the security forces for the successful operations, terming it a positive step and saying they would continue until the complete elimination of terrorism from the country.\n\n“Our resolve to eliminate terrorist elements and defend the country will remain unwavering,” he was quoted as saying in a statement from the presidency.\n\nThe Associated Press of Pakistan reported that Prime Minister Shehbaz Sharif also paid tribute to security forces for the operations and commended them for their professional expertise and for taking timely action against the “Indian agenda”.\n\n“The Indian conspiracy of putting in danger the life and property of innocent and unarmed citizens in Balochistan by perpetrating terrorism had been exposed,” he added.\n\nPM Shehbaz further said, “We will foil the nefarious designs of India to undermine peace and security in Pakistan.”\n\nEarlier this month, seven soldiers were martyred in a blast from an improvised explosive device planted by the “Indian proxy” terrorist group Balochistan Liberation Army in Kacchi district.\n\n“Nefarious designs of India and its proxies operating on Pakistani soil will be defeated by the valiant security forces, law enforcement agencies and the brave nation of Pakistan,” the ISPR had said.\n\nLast month, ISPR Director General Lt Gen Ahmed Sharif Chaudhry accused India of activating its “assets” to inte­nsify terrorist attacks in Pakistan, presenting “irr­e­futable evidence” of Ind­ian state-sponsored terrorism, directed by the Ind­ian military personnel.\n\n“Post-Pahalgam, because of the designs of terrorism that they have, they tasked all their assets, the terrorists operating in Balochistan, and we have credible intelligence for that, the Fitna-al-Khawarij and the independent terrorist cells … to increase their activity,” he had said, using the state-designated term for the banned TTP.\n\nPakistan has witnessed an uptick in terror activities, especially in Khyber Pakhtunkhwa and Balochistan, after the TTP ended its ceasefire with the government in November 2022.\n\nMilitant violence and security operations intensified in March, with the number of militant attacks surpassing 100 for the first time since November 2014, according to a report by the Pakistan Institute for Conflict and Security Studies.\n\nPakistan ranked second in the Global Terrorism Index 2025, with the number of deaths in terrorist attacks rising by 45 per cent over the past year to 1,081.\n\nAdditional reporting by Nadir Guramani.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:18:18.291Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912005/12-terrorists-of-indian-proxy-outfits-killed-in-kp-balochistan-engagements-ispr",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T14:58:28.000Z"
}
