{
  "title": "IT exports increase to $3.5bn in 10 months, says Shaza - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Minister of State for Information Technology and Telecom Shaza Fatima Khawaja said on Sunday that IT exports, including earnings from freelancers and IT companies, reached over $3.5 billion during July-April, with IT services alone accounting for $3.14bn.\n\nShe said the country is moving “steadily towards the vision of a Digital Pakistan, where technology supports the economy and ensures inclusive growth. Our IT sector’s trade surplus is the highest among all service sectors, at around $2.3bn”.\n\nSpeaking to the media, Ms Khawaja said Pakistan transitioned “from the brink of economic collapse to a trajectory of sustainable growth and digital transformation” under the leadership of Prime Minister Shehbaz Sharif.\n\nJust over two years ago, she said, Pakistan faced serious economic challenges, including fears of default, falling exports, and low investment. However, she added, strong government efforts helped improve the overall economic condition.\n\nDespite global challenges like reduced demand and trade barriers, Pakistan’s IT sector has remained strong and growing, the minister said. She credited this to a better economic environment and the prime minister’s coordinated policies.\n\nShe also announced that Pakistan has crossed 200 million mobile subscribers, which she said “shows strong progress toward digital inclusion”.\n\nMs Khawaja highlighted that eight million women started using mobile internet for the first time in 2024, contributing to 13 million new users overall. She attributed this success to the government’s Gender Digital Divide Policy, which she said helped reduce the gap in mobile internet usage between men and women from 38pc to 25pc.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:18:35.249Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911936/it-exports-increase-to-35bn-in-10-months-says-shaza",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:41:43.000Z"
}
