{
  "title": "PSL 2025: Fakhar, Salman shine as Qalandars seal playoff spot at Zalmi’s expense - Sport - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Fakhar Zaman and Salman Mirza starred with the bat and ball, respectively, as Lahore Qalandars secured their place in the HBL Pakistan Super League playoffs at the expense of Peshawar Zalmi at the Rawalpindi Cricket Stadium on Sunday, winning by 26 runs in a rain-affected match.\n\nWith the contest cut down to 13 overs per side due to a downpour, Qalandars put up 149-8, thanks to Fakhar’s 60 off 36 (seven fours and three sixes) before Salman’s (4-31) restricted Zalmi to 123-8 as they failed to replace fourth-placed Qalandars in the PSL standings with only one point separating the sides before they had locked horns.\n\nPut into bat, Qalandars raced to 58-1 in the four-over powerplay. Mohammad Naeem hit 22 off 10 balls before Daniel Sams dismissed him. Abdullah Shafique fell to pacer Ali Raza.\n\nFakhar, who had bludgeoned five fours and three sixes for 46 off 27 by the start of the eighth over, was handed a reprieve by Saim Ayub off Sams at deep square-leg — the ball slipping through the fielder’s hands to trickle across the boundary as Fakhar reached his half century. However, he lost his partner Kusal Perera to a run out soon after the Sri Lankan had added an eight-ball 17 (two fours and a six).\n\nThe incoming Asif Ali used brute power to clear cow corner off Ali Raza before slashing the pacer over third man for sixes on consecutive deliveries as Qalandars reached 127-4 by the 10th over.\n\nThe next over, however, saw Ahmed Daniyal’s medium pace get the better off Asif and Shakib Al Hasan. Sams then returned to clean Fakhar up with a searing yorker before Shaheen’s powerful hit over the onside added six more to the total.\n\nIn their chase, Zalmi struggled to 35-3 in the powerplay. Salman jolted Zalmi by removing Mohammad Haris and Max Bryant on the last two balls of the powerplay after Saim Ayub’s early departure.\n\nZalmi’s hopes dimmed further when in-form captain Babar Azam was caught off spinner Sikandar Raza, pushing the required run-rate above 14 per over. The pressure mounted, and Zalmi slumped to 63-7. Late hitting from Ahmed (24 off 14, two fours and two sixes) and Sams (26 off 14, two fours and two sixes) only narrowed the margin of defeat.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682a6472cc11a.jpg",
  "retrievedAt": "2025-10-12T03:08:18.784Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911853/psl-2025-fakhar-salman-shine-as-qalandars-seal-playoff-spot-at-zalmis-expense",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:31:32.000Z"
}
