{
  "title": "CORPORATE WINDOW: Two-wheelers’ rising popularity - Business - DAWN.COM",
  "author": null,
  "content": "Barring a downward sales trend in Yamaha motorcycles, the entire two-wheeler segment has shown impressive sales growth, thus negating the market impression of unaffordable bike prices and consumers’ eroding purchasing power owing to high cost of living.\n\nThe consumer price index (CPI) has dropped to a historic low at 0.3 per cent on a year-on-year basis in April 2025. After hitting a record high of 38pc in May 2023, CPI has been on a downward trajectory, thus luring consumers towards purchasing of some other necessities.\n\nA major decline in prices was recorded in food items, especially in wheat flour varieties, onion, tomato, potato, petroleum products and power tariff, but the prices of other items like ghee/cooking oil, meat products, milk products and sugar have remained high. Inflated gas bills still haunt the end users.\n\nFalling food inflation has improved the purchasing power of consumers, but market people give multiple reasons like improving consumers’ sentiments and stable macroeconomic environment towards purchasing two wheelers.\n\nAs per data of the large scale manufacturing sector, the overall two wheeler production during July-March FY25 rose by 33pc to 1.21 million units from 908,698 units in the same period last fiscal.\n\nWhen it comes to transportation, consumers prefer bikes over outdated and decades-old public transport options amid rising costs of living\n\nA senior two-wheeler market expert at Akbar Road, Mohammad Sabir Sheikh believes that lack of any improvement in the public transportation system and dearth of required buses are pushing the buyers towards purchasing new bikes.\n\nIn July-April FY25, Atlas Honda Limited bike sales soared to 1.03m units from 819,752 units in the same period last fiscal followed by Suzuki bikes sales of 20,557 units versus 13,610 units.\n\nWhile every assembler has been enjoying a field day, Yamaha bikes struggled with sales of 4,558 units as compared to 5,824 units in the above period as market people believe that the prices of Yamaha bikes are much higher than its peers despite offering a variety of models.\n\nThe second largest bike assembler, United Auto Motorcycle, achieved sales of 118,885 units in 10MFY25 as against 69,480, while Road Prince bike sales surged to 17,835 from 13,511 units.\n\nMr Sheikh said consumers have realised that bikes are a better option than moving in the outdated and decades-old public transport. However, Punjab and Sindh governments are running imported buses (hybrid and electric vehicles) but their numbers are still insufficient to cope with the huge population in cities of two big provinces.\n\nIn Karachi, ride hailing services have emerged but consumers appear unsatisfied as the majority of the drivers take the consumers on very old models with broken mudguards and uncomfortable seats.\n\n“Instead of travelling in old buses and availing ride hailing service on decades-old two wheelers, consumers feel that is better to have their own new or a two to three years old bike,” Mr Sheikh said, adding that high fares of rickshaws and ride hailing service also encourage buyers to own their own bikes.\n\nHowever, the prices of 70-150cc petrol driven bikes range between Rs110,000-550,000, thus still proving highly unaffordable for many low-income group people.\n\nHe said the trend among car owners over the last two to three years has been to keep a bike at home to visit nearby markets and drop children to schools instead of using costly cars in a bid to save petrol/diesel and time.\n\nStable prices of new bikes for the last over one year as a result of stable rupee-dollar parity also encourages buyers to purchase new bikes.\n\nProduction of some cash crops like cotton, wheat, sugar and rice also plays a big role in bike sales as the country’s sizable population lives in rural areas. However, decline in tractor sales (Massey Ferguson and Fiat) to 24,832 units in 10MFY25 from 38,699 units in the same period last fiscal year signals alarming agriculture indicators.\n\nDespite reviving bike sales, the number of Chinese bike assemblers has shrunk in the last few years either failing to compete with Japanese assembled Honda bikes in terms of quality or could not maintain their own quality.\n\nOut of 20-25 Chinese bike assemblers, there are less than 10 active assemblers whose bikes can be seen on the roads, Mr Sheikh said.\n\nAs the world is shifting towards electric bikes, Karachi lags behind Punjab in this segment. Mr Sheikh is of the view that Karachi’s poor road conditions do not allow buyers to take the risk owing to the small tyres of electric bikes. Besides, the suspension system of e-bikes is made based on the smooth roads in China and other countries and not well-suited to Karachi’s dilapidated roads. As a result, the suspension of e-bikes starts making noises and become damaged sooner.\n\nElectric bike sales are more impressive in the cities of Punjab than Karachi. A sizable number of people live in apartments in the port city where no safe charging is available. Only those buyers, living in residential areas, are purchasing Chinese EV bikes.\n\nOn the contrary, apartment culture in Punjab is still missing and it is easy for the consumers living in residential areas to purchase electric bikes.\n\nEV bikes are currently priced between Rs150,000-350,000 depending on the motor power. Around 30 assemblers are rolling out electric bikes after importing 100pc of the parts and accessories from China.\n\nApart from bikes, three-wheeler segment sales (two seater and eight seater rickshaws) has also improved following the arrival of new locally made rickshaws in Karachi, indicating that the public bus transport system is still in a shambles, forcing sizable commuters towards three wheeler rickshaws.\n\nFor example, Sazgar Engineering sold 21,486 units of three wheelers in 10MFY25 as compared to 11,234 units in the same period last fiscal. Road Prince and Qingqi three wheeler sales also improved to 2,049 and 8,666 units from 4,740 and 1,099 units in the above period.\n\nSome assemblers are enjoying robust sales of three wheelers (loaders) as these vehicles are being used in Punjab and Sindh for solid waste disposal.\n\nPublished in Dawn, The Business and Finance Weekly, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682a81699b97c.gif",
  "retrievedAt": "2025-10-12T03:08:16.779Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911946/corporate-window-two-wheelers-rising-popularity",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:58:15.000Z"
}
