{
  "title": "Concerns raised over move to shift Sindh’s captive power plants to national grid - Pakistan - DAWN.COM",
  "author": null,
  "content": "• CM Murad hosts federal govt-industrialists meeting to resolve contentious issue\n• Declares gas reserved for CPPs must remain in Sindh\n• It is not feasible to shut down the plants as grid supply is often unstable, industrialists tell federal ministers\n• All proposals and reservations will be brought to PM’s attention for taking final decision\n\nKARACHI: Sindh Chief Minister Syed Murad Ali Shah on Sunday hosted a forum to bring together representatives of the federal government and industrialists to discuss the contentious issue of shift of the gas-based captive power plants (CPPs) to the national grid.\n\nThe meeting served as a platform for brainstorming sessions between industrialists and federal government representatives to establish a timeline for the transition from their CPPs to Discos, said a press statement issued from the CM House.\n\nAfter long deliberations, the meeting decided that all proposals and reservations expressed by the industrialists would be submitted to the prime minister for his final decision.\n\nIn the meeting, the federal government was represented by Finance Minister Muhammad Aurangzeb, Petroleum Minister Ali Pervaiz Malik, Power Minister Awais Leghari, Adviser to PM Rana Sanaullah.\n\nZubair Motiwala, Shabir Diwan, Jawed Balwani and others represented the industrialist community while Pakistan Peoples Party MNAs Syed Naveed Qamar, Asad Alam and Mirza Ikhtiar Baig, Chief Secretary Asif Hyder Shah, federal and provincial secretaries concerned, chief of Sui Southern Gas Company and K-Electric were also present.\n\nThe chief minister stated that the gas withdrawn from the captive power plants after the transfer of industrial units to the national grid must remain within the province.\n\nThe meeting focused on in-depth discussions regarding the proposed increase in the captive power tariff.\n\n“There are approximately 660 captive power plants in Sindh. Industrialists have raised concerns over the proposed tariff hike. We have dedicated this Sunday to listening to them,” said the CM, according to the statement.\n\nHe expressed gratitude to the federal ministers for agreeing to hear the concerns of industrialists and urged them to gather input directly from industry stakeholders before making any decisions.\n\nThe industrialists voiced objections, stating that additional charges had been imposed on industries under the “De-Grid (Captive Power Plants) Levy Ordinance 2025” and any further taxes on captive power plants could become unbearable for industries.\n\nIt is not feasible for industries to shut down captive power plants and rely solely on electricity from the national grid as the grid supply is often unstable, the industrialist said.\n\nAt this, Finance Minister Aurangzeb said: “We are here today at the invitation of the Sindh government to listen to the concerns of industrialists. The country’s economy is growing, and this progress includes the efforts of all stakeholders. The prime minister has directed us to introduce policies that ensure industrial growth.”\n\nPetroleum Minister Ali Malik highlighted that President Asif Ali Zardari and PPP Chairman Bilawal Bhutto-Zardari also emphasised the importance of resolving industrial issues in Sindh.\n\nHe acknowledged the CM’s efforts and commitment during a previous Zoom meeting with industrialists.\n\nPower Minister Leghari informed the meeting that a 30 per cent reduction in industrial tariff had already been implemented. He said Discos are improving their operations and a feasibility plan for 7,000 MW is ready.\n\nMr Leghari said that industrialists will eventually need to shift from CPP to Discos. /distribution networks. So far, 583 captive power plants had already transitioned to the national grid, he added.\n\nCM Shah reiterated the ultimate goal of shifting all captive power plants to the national grid, but stressed that this transition should not overburden consumers.\n\n“If gas is cut off from captive power plants, it should remain within Sindh and not be diverted elsewhere,” he asserted.\n\nRana Sanaullah described the meeting as ‘highly productive’ and assured that all suggestions made by the CM and industrialists would be conveyed to Prime Minister Shehbaz Sharif.\n\nHe said that a committee would be formed to review whether a tax should be imposed during the transition period from captive power to the national grid. The final decision on taxation will be made by the PM.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:18:37.754Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911859/concerns-raised-over-move-to-shift-sindhs-captive-power-plants-to-national-grid",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:32:01.000Z"
}
