{
  "title": "Committee misses deadline in Punjab Revenue Authority director’s appointment probe - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A fact-finding committee constituted to inquire into the ‘unlawful’ appointment of the Punjab Revenue Authority (PRA) director (IT) seems to be delaying the submission of its report to the quarters concerned due to pressure allegedly mounted by someone in the authority.\n\nThe committee formed on Feb 6 was supposed to submit its report within 14 days, Dawn has learnt.\n\n“This is a unique case in Punjab wherein an ineligible candidate was surprisingly appointed as director (IT) by the PRA in 2016 after the post was advertised in 2015. The requirement for the eligible candidates for the job was masters degree in computer science or any discipline related to IT from a reputed institution. But those, who conducted the interview surprisingly selected one Salman Zafar having BS (electrical engineering) degree for the job on a contract basis for a period of three years,” said an official source in the PRA.\n\n“Later, his contract was also extended for another three years and onward time to time and the last renewal expiry date is May 31,” he maintained, adding that the issue came to limelight after someone pointed it out.\n\nAccording to documents available with Dawn, despite knowing all this, the authority forwarded the case of IT director for regularisation to a high-level committee, which after going through all facts reached a consensus and stated: “While discussing the case of regularisation of Mr Salman Zafar, the participants observed that his initial appointment as director IT on contract basis needs to be scrutinised first.\n\nPanel seems to be ‘pressurised’\n\nAs per record, his appointment was proposed in the backdrop of the establishment of Punjab government revenue automation private limited which was never established. The advertisement published in 2015 stated that the organisation (PRA) requires to fill a post of director IT for a period of three years for its scheme titled “Restaurant Invoice Management System” and the RIMS has been replaced since long meaning thereby that the services for which he was hired are no longer required by PRA. Without prejudice to the above, he didn’t fulfil the qualification criteria as published in the advertisement.\n\nThe recruitment was merely interview-based and the committee members were of the view that prior to considering his case for regularisation, the legality of his initial appointment should be scrutinised first.\n\n“The administrative department may also finalise the case of of Mr Salman Zafar regarding his employment status strictly in accordance with the rules in the light of the observations,” read minutes of a meeting of the scrutiny committee on regularisation.\n\nFollowing the observations, the authority constituted a committee in January headed by PRA Commissioner (Gujranwala) Zaigham Abbas. But, later he withdrew from the assignment on the pretext of his extensive business.\n\n“The undersigned is currently entrusted with dual responsibilities as commissioner appeals-1 and commissioner Gujranwala (PRA) both of which require undivided attention. It is, therefore, requested that the undersigned may kindly be relieved of the assigned committee duties,” reads a letter Mr Abbas wrote to PRA chairman on Jan 9. However, the sources claim that he refused in anticipation of ‘pressure’.\n\nAfter refusal, the PRA constituted another committee on Feb 6 and it was supposed to submit its report to the competent authority within 14 days.\n\nThe committee, headed by PRA Director (policy) Ms Ayesha Ranjha, comprised Multan PRA Commissioner Amjad Bashir and Additional Commissioner (HQ) Muhammad Arif.\n\nThe sources said though the committee was assigned the task to submit its report within 14 days, it failed to do so to date despite passing almost three months.\n\nWhen contacted, PR Chairman Mr Nauman Yousaf said he had not yet received the inquiry report from the committee. “In fact Ayesha Ranjha has remained very busy and as soon as she sends the report, we will look into it,” he said.\n\nMr Salman Zafar was not available for comments despite calls made by this reporter for his version.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/191037425c61422.jpg",
  "retrievedAt": "2025-10-12T03:07:57.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911893/committee-misses-deadline-in-punjab-revenue-authority-directors-appointment-probe",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:32:07.000Z"
}
