{
  "title": "Rain, gusty winds break heatwave in twin cities - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Heavy rain and gusty winds in the twin cities of Rawalpindi and Islamabad on Sunday evening broke the four-day-long heatwave, bringing the temperature down from 41 degrees Celsius to 32 degrees.\n\nThe blazing sun and humidity had made the weather unbearable on Sunday, forcing people to stay indoors. The temperature had been on the rise since May 14.\n\nYoungsters mostly opted to visit Rawal, Khanpur and Simly dams, Chattar Park as well as nearby water reservoirs to beat the heat. Because of the scorching heat, scores of people also fell sick and reached hospitals.\n\nHowever, clouds covered the sky after 5pm followed by gusty winds and rain that brought the temperature down.\n\nA Met Office official told Dawn: “55 knots (110 kilometres per hour) wind was recorded at Islamabad airport and 35 knots (70 km per hour) at Pakistan Metrological Department head offices at Zero Point on Sunday evening.”\n\nHe said the Met Office had recorded the maximum temperature at 41 degrees Celsius on Sunday afternoon in the two cities while after the rain the temperature decreased to 32 degrees at 8pm.\n\nThe official said that a shallow trough of westerly wave was affecting upper parts of the country. A high pressure at upper atmospheric level is prevailing over central/southern parts of the country and likely to persist during next three days.\n\n“Mainly hot and dry weather is expected in most parts of the country and very hot in plain areas during daytime. However, rain windstorm/thunderstorm is likely at isolated places in Gilgit-Baltistan, ppper Khyber Pakhtunkhwa, Kashmir, upper Punjab and Islamabad. Hailstorm/heavy shower is also likely at isolated places during this period,” he said.\n\nPublished in Dawn, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682a5ecdd999b.jpg",
  "retrievedAt": "2025-08-23T14:18:36.834Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911837/rain-gusty-winds-break-heatwave-in-twin-cities",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:32:15.000Z"
}
