{
  "title": "Banking sector’s problem child - Business - DAWN.COM",
  "author": null,
  "content": "For the most part, Pakistan’s financial services industry is quite boring, at least when it comes to designing products that customers need. But for anyone who cares to look, their books are a treasure trove. The recent episode of taxes is a great reminder, showing how banks engaged in window dressing at a scale that was unimaginable not long ago.\n\nWhile that story became mainstream, thanks to the underlying magnitude and some lobbying, others usually get buried in the countless data tables of official documents. Particularly those of the sector’s problem child, ie microfinance banks (MFBs). For years, the industry’s been consistently deepening its rot but manages to avoid public or media scrutiny.\n\nThe outgoing year was another stark reminder of just how awful things are and continue to deteriorate, as the microfinance banking capital adequacy ratio further slipped to 2.6 per cent by December 2024, down five percentage points compared to the end of 2023. Remember that the State Bank mandates a minimum of 15pc — a level that hasn’t been seen since June 2022. Tier 1, in particular, has all but evaporated and stands at 0.1pc of all risk-weighted assets.\n\nIn its last Article IV, the International Monetary Fund had raised alarm bells over the health of the sector and called for institutional reforms. But at least for now, it doesn’t seem to be bearing much fruit in the aggregate numbers. That’s despite the entry of new sponsors to take over troublesome MFBs and subsequent capital injections, including MNT-Halan as well as Abhi and TPL.\n\nThe IMF has raised alarm bells over the health of the microfinance sector and called for institutional reforms\n\nNevertheless, it hasn’t done much to deter losses, as the aggregate microfinance banking net income clocked in at negative Rs16.2 billion in 2024, doubling from last year’s Rs8.1bn and continuing the tradition that started in 2019. According to the Financial Stability Review, the number of loss-making institutions rose to eight (out of 12) during 2024, up from six (out of 11) in CY23.\n\nUnsurprisingly, such an awful bottomline comes from what is now a consistent bad debt crisis. By the end of 2024, the industry’s gross non-performing loans had reached Rs44.9bn, up from Rs27.2bn the year before. Around 95pc of it was accounted for through provisioning, slightly down compared to December 2023 levels.\n\nGiven all the underlying troubles in the industry, one would expect the size of the book to probably decline or, at the very least, increase in moderation. Yet, the exact opposite is happening: aggregate assets of microfinance banking reached almost Rs1.1 trillion in December 2024, reaching 10 digits for the first time ever. This was both the steepest quarterly and annual jump, at Rs0.24tr and Rs0.29tr respectively, in at least seven years, if not more.\n\nHow do you reconcile these two conflicting facts? It’s quite simple, as it always is with most of the big changes in the financial services industry. To understand what really triggered the surge in asset base, let’s look at the liabilities side. Broadly, banks — microfinance, Islamic, conventional, etc — have two main sources of capital: deposits and borrowings, with most prioritising the former and only scantily dependent on the latter.\n\nThe aggregate microfinance banking net income clocked in at negative Rs16.2bn in 2024, and yet the aggregate assets of the industry hit almost Rs1.1tr in December 2024, reaching 10 digits for the first time ever\n\nMFBs have been no different in this regard. In the last five years, deposits have averaged 79.2pc of all liabilities compared to 11.1pc for borrowings. By the end of 2024, their respective shares stood at 71pc and 20pc — the lowest and highest they have been since at least 2017. During just the last quarter of the year, the borrowings rose by almost Rs156bn, ie more than four times compared to September’s Rs48.3bn.\n\nFor an industry with an illustrious record of bad books, why would any lender extend their good money to them? What could possibly be the motivation? Faced with an impending tax on advances-to-deposits ratios below a certain threshold (which most banks had), the boys on Chundrigar started “underwriting” loans to their less privileged buddies. It was a win-win for both: one could avoid the eventually repealed tax, and the other makes some extra money.\n\nNeedless to say, most of these borrowings found themselves parked in government securities by the MFBs. In fact, the industry’s investment base surged by more than Rs200bn in Q4 to stand at Rs387.3bn by December. Put another way, the increase in three months was higher than September’s outstanding levels.\n\nConsequently, the investments-to-deposits witnessed a jump of 24.38 percentage points in one quarter — comfortably the steepest on record — to reach 52.8pc by December. The only other time in the past this ratio had crossed 40pc was at the end of 2022, which also happened to be another quarter of window dressing on steroids by the banks.\n\nKeep this in mind the next time you hear a banker or regulator talking about risk management practices. Here you have an industry with practically no Tier 1 capital or profits, but time and again, it willingly engages in financial alchemy. Only if they had spent more time on trying to turn things around instead of playing the same game that has backfired for some in the past.\n\nThe writer is co-founder of Data Darbar and works for the Karachi School of Business and Leadership\n\nPublished in Dawn, The Business and Finance Weekly, May 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:18:50.659Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911917/banking-sectors-problem-child",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T00:31:39.000Z"
}
