{
  "title": "26 outlaws netted, drugs, weapons recovered",
  "link": "https://www.app.com.pk/national/26-outlaws-netted-drugs-weapons-recovered/",
  "date_published": "2024-02-06T08:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 6 (APP): Islamabad Capital Police (ICP) apprehended 26 outlaws including twelve professional beggars from different areas of the city during the last 24 hours and recovered drugs and weapons from their possession.\nAccording to an ICP spokesperson, following the special directions of Islamabad Capital City Police Officer (ICCPO) Dr. Akbar Nasir Khan, the Islamabad Capital Police has intensified its crackdown against the criminal elements to eliminate crime from the city.\nMeanwhile, the Karachi Company police team arrested an accused namely Sagar and recovered 50 liquor bottles from his possession. The Golra police team arrested an accused namely Nasir Ali and recovered one 30 bore pistol with ammunition from his possession.\nLikewise, the Sangjani Police team arrested two accused namely Wali Muhammad and Muhammad Irfan and recovered 875 gram of heroin from their possession.\nLikewise, the Shams Colony police team arrested an accused namely Nnamokoejike and recovered 15 bottles of liquor from his possession. The Khanna police team arrested an accused namely Rehman Ullah and recovered one 30-bore pistol from his possession.\nSimilarly, the Koral police team arrested two accused namely Sher Khan and Dilbar Khan and recovered 1320 grams of heroin and one 30-bore pistol from their possession. The Sihala police team arrested an accused Yameen Talib and recovered one 30-bore pistol from his possession, while the police team also arrested an accused namely Razaq involved in illegally selling diesel.\nMoreover, the Shahzad town police team arrested four accused namely Shan, Mehboob, Muhammad Haroon and Shahzad Ali and recovered 2320 gram hashish and two pistols from their possession.\nThe separate cases have been registered against the nabbed accused and further investigation is underway. During the ongoing crackdown against professional beggars, the police teams have arrested 12 professional beggars from various areas of the city.\nThe citizens are requested to dial“Pucar-15″ or report via the “ICT-15 App” regarding any suspicious person or activity. The protection of life and property of citizens is among the top priorities of the Islamabad Capital Police.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:18:10.392Z"
}
