{
  "title": "275 women to contest upcoming elections on general seats",
  "link": "https://www.app.com.pk/national/275-women-to-contest-upcoming-elections-on-general-seats/",
  "date_published": "2024-02-06T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 6 (APP):In the upcoming general elections, 275 women from various political parties will be contesting on the general seats.\n“111 political parties have nominated 275 women candidates to contest the upcoming elections on general seats, making up for 4.6 percent of the total of 6,037 candidates they have fielded”,  Free and Fair Election Network (FAFEN) said in a statement.\nAccording to Section 206 of the Elections Act, 2017 (Selection for Elective Offices), each political party is required to ensure at least five percent representation of women candidates while selecting candidates for general seats for elective offices, including membership of the Majlis-e-Shoora (Parliament) and Provincial Assemblies, through a transparent and democratic procedure.\nFAFEN analysis is based on the List of Contesting Candidates (Form-33) for National and Provincial Assemblies.\nOut of 111 political parties, 30 parties have fielded five or more than five percent women on general seats, while four political parties have fielded between 4.50 and 4.99 percent of women candidates on general seats (that is statistically rounded-up to five percent), and the remaining 77 have fielded up to 4.50 percent women candidates on general seats.\nThe parties fielding less than 4.50 percent women candidates on general seats is higher since the applicability of this provision is technically effective only on political parties which field at least 20 candidates on general seats (as the five percent provision requires them to allocate ticket to at least one woman candidate).\nOnly 35 political parties have fielded more than 20 candidates on general seats.\nAccording to FAFEN, the level of adherence to the five-percent provision varies across the elective houses.\nFor the National Assembly, 94 parties have allocated tickets for general seats to a total of 1,872 candidates, that included 92 women, making up 4.91 percent of women out of the total candidates fielded.\nFor the Punjab Assembly, 70 parties have allocated tickets to a total of 1,878 candidates, including 58 women (3.09 percent of the total). For the Sindh Assembly, 50 parties have allocated tickets to a total of 948 candidates, out of which 59 are women (6.22 percent of the total).\nFor the Balochistan Assembly, 37 parties have allocated tickets to a total of 533 candidates, out of which 19 are women (3.56 percent of the total). For the Khyber Pakhtunkhwa Assembly, 44 parties have allocated tickets to 806 candidates, out of which 47 are women (5.83 percent of the total.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:17:36.857Z"
}
