{
  "title": "Scientists declare Hindu Kush Himalaya, a biosphere on the brink",
  "link": "https://www.app.com.pk/national/scientists-declare-hindu-kush-himalaya-a-biosphere-on-the-brink/",
  "date_published": "2024-02-06T12:20:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 06 (APP):Scientists have declared the Hindu Kush Himalaya, one of the most biodiverse regions on Earth, a ‘biosphere on the brink’.\nAccording to a press release issued here on Tuesday by The International Centre for Integrated Mountain Development (ICIMOD), the call by scientists was made during a major global meeting of biodiversity experts in the Nepalese capital, Kathmandu.\nICIMOD has called over 130 global experts for the Third Lead Authors meeting of the IPBES nexus assessment, which examines the linkages between food and water security, health, biodiversity, and climate change.\nThe Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services (IPBES) is an independent intergovernmental body, with 143 member states, established to strengthen the science-policy interface for biodiversity and ecosystem services, adds the press release.\nDuring the meeting, ICIMOD experts call for bold action and urgent finance to prevent the collapse of nature in High Mountain Asia.\nScientists sound alarm as experts meet to finalise crucial report on nature, human health, food, and climate change at ICIMOD’s headquarters in Kathmandu Researchers urge special focus and investment to reverse ecological losses in the world’s mountains, which hold 85% of earth’s species of amphibians, birds, and mammals.\nHalting and reversing biodiversity loss is deemed critical for the survival of hundreds of millions of people in Asia’s mountains.\n“The declines in nature across this region,” says IPBES author and ICIMOD Ecosystems Specialist Sunita Chaudhary, “are so advanced and accelerating so fast they now pose a threat to the lives of not just animal and plant life, but also human societies.”\n241 million people live in the Hindu Kush Himalaya region: 31% of whom are food insecure and half of whom face some form of malnutrition.\n“This is a region that must be urgently prioritised for investment – to fund the fight to reverse nature loss and species extinction.\nWorldwide we’re seeing a huge uptick in investments in ecosystem restoration and a growing recognition of the role that nature plays in human survival. We must ensure that funding to the Hindu Kush Himalaya rises at an exponential rate before these fragile and crucial ecosystems collapse, by building nature into all investment and action. And we must accelerate policy, institutional and market reforms to make this happen.\n“We are honoured that IPBES has chosen ICIMOD as the host for its first lead authors meeting in South Asia,” commented Izabella Koziell, Deputy Director General.\n“We see this as recognition of the organisation’s sustained commitment to science diplomacy about this extraordinarily rich and fragile zone over the past 40 years.\nBut more importantly, of the outsized contribution mountains in general and the Hindu Kush Himalaya in particular play as refuges of biodiversity, and the unprecedented risks now posed to these places and species.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:17:45.672Z"
}
