{
  "title": "President Alvi directs Postal Life to pay Rs 5 mln to heirs of insurance policyholder",
  "link": "https://www.app.com.pk/national/president-alvi-directs-postal-life-to-pay-rs-5-mln-to-heirs-of-insurance-policyholder/",
  "date_published": "2024-02-06T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 6 (APP): President Dr Arif Alvi has directed Postal Life Insurance to pay the death insurance claim of Rs 5 million to the legal heirs of the deceased policyholder within 30 days.\nHe gave these directions while deciding upon a representation filed by the Postal Life Insurance (PLI) against the decision of Wafaqi Mohtasib directing it to pay the death insurance claim, a President Secretariat press release said on Tuesday.\nAs per details, complainant Abdul Aziz’s deceased father had obtained an insurance policy from PLI for the sum assured of Rs 5 million against an annual premium of Rs 448,600 in 2010.\nAfter his father died in 2015, PLI refused to pay the death insurance claim on the pretext that the deceased had concealed material facts about his date of birth and the pre-insurance ailment of diabetes at the time of obtaining the insurance policy.\nFeeling aggrieved, the son (complainant) filed a complaint with the Wafaqi Mohtasib to seek relief. Wafaqi Mohtasib held that the deceased had purchased the insurance policy as per his date of birth mentioned on CNIC and that PLI had issued the insurance policy after accepting the requisite information.\nThe Mohtasib held that the denial by the insurance agency to honour the claim of the complainant amounted to maladministration.\nAfterward, PLI filed a representation against this decision with the president.\nPresident Dr Arif Alvi, in his decision, observed that as per Section 80 of the Insurance Ordinance, 2000 no policy of life insurance effected after the commencement date shall, after the expiry of two years from the date on which it was affected, be called in question by an insurer on the ground that a statement made in the proposal for insurance or in any report of a medical officer was inaccurate or false.\nHe also referred to Lahore High Court’s decision wherein it had been held that concealment of ailments, such as diabetes and hypertension, could not be termed as done fraudulently as most people having such ailments, by remaining more careful in their lifetime, lived either for decades or longer than people not having such diseases.\nKeeping in view the facts, the President directed Postal Life Insurance to pay the death insurance to the heirs of the deceased within 30 days in compliance with the earlier decision of the Wafaqi Mohtasib.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:17:37.800Z"
}
