{
  "title": "Election campaigns to end late night ahead of voting day",
  "link": "https://www.app.com.pk/national/election-campaigns-to-end-late-night-ahead-of-voting-day/",
  "date_published": "2024-02-06T12:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 6 (APP):Tuesday night marks the end of election campaigns nationwide, providing voters with the opportunity to thoroughly contemplate their choices before voting for their favored candidates in both the national and provincial assemblies.\nAccording to election regulations, campaigning will cease precisely at midnight on the night between February 6 and 7. The ECP cautions that candidates engaging in political activities after the deadline will face legal consequences. Additionally, the ECP appeals to the media and the public to collaborate for a free, fair, and transparent election process.\nCandidates have begun door-to-door canvassing, seeking votes, and arranging logistics for election day. The distribution of 260 million ballot papers and election materials has been finalized.\nThe candidates have arranged final rallies and events on Tuesday evening in a last-minute attempt to appeal to voters. The election campaign has been characterized by fierce political competition, passionate debates, impassioned speeches, and large-scale rallies. Candidates have sought to win over voters with their pledges, slogans, and platforms.\nThe Election Commission has set up a control room to receive complaints via WhatsApp. The Election Management System (EMS) is superior to the last elections’ (RTS) as it operates both online and offline.\nMajor political parties are gearing up for a final day of rallies nationwide, featuring top leaders including Nawaz Sharif, Maryam Nawaz, Shehbaz Sharif, Bilawal Bhutto Zardari, Asif Ali Zardari, and Maulana Fazlur Rehman, who will address gatherings in various cities.\nPunjab has the highest number of registered voters at 73,207,896, followed by Sindh with 26,994,769, Khyber-Pakhtunkhwa (K-P) with 21,928,119, Balochistan with 5,371,947, and Islamabad with 1,083,029 registered voters, totalling 128,585,760 nationwide.\nThe participating parties include the Pakistan Muslim League-Nawaz (PML-N), the Pakistan Peoples Party (PPP), the Muttahida Qaumi Movement-Pakistan (MQM-P), the Jamiat Ulema-e-Islam-Fazl (JUI-F), the Pakistan Muslim League-Quaid (PML-Q), and various other regional and religious parties.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:17:45.590Z"
}
