{
  "article_id": "2025-02-09_e691954ca4eccd4ad8bc8242d2e46165",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-saudi-arabia-to-further-strengthen-digital-economic-partnership-shaza-fatima/",
    "retrieved_at": "2025-08-27T12:31:12.559Z"
  },
  "metadata": {
    "title": "Pakistan-Saudi Arabia to further strengthen digital, economic partnership: Shaza Fatima",
    "author": null,
    "date_published": "2025-02-09T14:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 378,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 09 (APP):Pakistan and Saudi Arabia are expanding their digital and economic partnership, aiming to foster innovation and investment in key technology sectors said, State Minister for Information Technology and Telecommunication Shaza Fatima Khawaja at the LEAP 2025 technology event in Riyadh. Under the theme \"Into New Worlds,\" LEAP 2025 aims to expand business networking and investment opportunities in the tech sector. Highlighting the deepening collaboration between the two nations, she highlighted Pakistan's commitment to leveraging technology for economic growth, said a news release received here on Sunday. She said Pakistan's IT exports have surged by 28%, reaching $1.86 billion, underscoring the sector's robust expansion. She also described the Digital Nation Act 2025 as a transformative initiative set to reshape Pakistan's digital economy. The minister revealed that Islamabad will soon host the Digital Foreign Direct Investment (DFDI) Forum, inviting global investors to explore Pakistan's expanding digital landscape. She stressed that Pakistan seeks a strong tech partnership under Saudi Vision 2030, urging Saudi investors to explore opportunities in fintech, cybersecurity, and cloud computing. \"This is a golden opportunity for digital investment and technological collaboration between Pakistan and Saudi Arabia,\" she said, adding that Pakistan offers world-class digital services with lucrative investment prospects. Highlighting Pakistan's largest-ever participation in LEAP 2025, the minister shared that over 100 tech companies and 1,000 participants from Pakistan are attending the event. \"We are not just signing MoUs; we are securing real economic growth through strategic agreements,\" she asserted. She acknowledged the Digital Cooperation Organization (DCO) as a key partner in Pakistan's digital progress. She also praised Prime Minister Shehbaz Sharif's leadership, stating that his vision is fostering a conducive environment for digital growth and foreign investments. Shaza credited the Special Investment Facilitation Council (SIFC) for its pivotal role in enhancing Pakistan's investment landscape. She emphasized that SIFC's initiatives have improved the ease of doing business and attracted international investors. The Pakistan-Saudi Business Forum at LEAP 2025 witnessed the participation of DCO Secretary General Deemah AlYahya, alongside top Saudi government and business officials, as well as a large number of Pakistani and Saudi delegates. With Pakistan positioning itself as a key player in the global digital economy, the minister reaffirmed the country's commitment to fostering innovation, expanding its IT sector, and strengthening international partnerships.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}