{
  "article_id": "2025-03-21_fd5c516ba2dc4e418937ba8aaf953f14",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/navruz-festival-brings-together-millions-of-people-across-different-countries-ambassador-tukhtaev/",
    "retrieved_at": "2025-08-27T13:54:17.651Z"
  },
  "metadata": {
    "title": "Navruz festival brings together millions of people across different countries: Ambassador Tukhtaev",
    "author": null,
    "date_published": "2025-03-21T17:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 584,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 21 (APP): Ambassador Republic of Uzbekistan to Pakistan, Alisher Tukhtaev on Friday said that Navruz festival brings together millions of people across different countries, regardless of borders, languages or ethnic backgrounds. From the vast steppes of Central Asia to the vibrant cities of the Middle East, from the mountains of the Caucasus to the heart of South Asia, Navruz reminds us that \"we are all connected\" the Ambassador said on the occasion of Navruz festivity celebration organized by the Uzbekistan Embassy here. He said, \"We are truly honored to welcome all of you today. Thank you for being with us on this special evening to celebrate Navruz - a festival that symbolizes new beginnings, renewal, and the beauty of nature.\" The Ambassador said that this year, Navruz comes at the same time as the holy month of Ramazan - a time of reflection, unity, and generosity. This special moment allows us to celebrate both the renewal of nature and the blessings of Ramazan, he added. Today, he said, we are gathered with our friends to share not only the joy of Navruz but also the tradition of Ramazan Iftar and it is a wonderful reminder of the values we all cherish - kindness, togetherness, and gratitude. He said that today, as \"We come together, not only welcome spring but also honor the deep religious and cultural traditions that unite our brotherly nations and the entire Muslim Ummah. Navruz, which means \"New Day\", has been celebrated for more than 3,000 years by different cultures and civilizations and this ancient festival represents the renewal of nature, harmony between people and the environment, and the victory of light over darkness, he said. Uzbek envoy said that Navruz is not just a national festival; it is a shared cultural heritage of the peoples of the East. He said that Navruz represents the universal values of peace, unity, and gratitude for the blessings of nature-values that have been passed down for generations. He said that it is a time of joy, hope, and new beginnings, when families and friends come together to share festive meals, enjoy traditional dances, and show kindness to one another. For Uzbekistan, Navruz has a special place in our culture and society. It is more than just a celebration - it reflects our core values of peace, friendship, generosity, and respect for our ancestors' traditions, he said. The Ambassador said that during this time, people help those in need, strengthen community ties, and express gratitude for nature's blessings. The envoy said that one of the most beloved traditional dishes of Navruz is sumalak, a symbol of prosperity and patience, prepared with love and shared among families and neighbors. Today, our Embassy is honored to share sumalak with you as a symbol of our friendship, brotherhood, and unity, he said. Alisher the celebration of Navruz is also deeply connected to the values of Pakistan. Our two nations share a rich historical and cultural heritage, strong brotherly ties, and a commitment to regional cooperation. Both Uzbekistan and Pakistan believe in preserving traditions while embracing progress. \"Today, we celebrate Navruz together, we reaffirm our dedication to strengthening people-to-people connections and enhancing cooperation between our countries,\" he said. In a world facing many challenges, Navruz reminds us of the importance of harmony, renewal, and mutual respect, he said. \"Let us use this occasion to promote peace, understanding, and friendship across the world, may this Navruz bring prosperity, good health, and happiness to all of us,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}