{
  "article_id": "2025-03-21_8af51f52fe49372535b6a533161648a3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/starlinks-registration-ensured-on-pms-directives-shaza-fatima/",
    "retrieved_at": "2025-08-27T13:55:09.390Z"
  },
  "metadata": {
    "title": "Starlink’s registration ensured on PM’s directives: Shaza Fatima",
    "author": null,
    "date_published": "2025-03-21T12:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 223,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 21 (APP): Federal Minister for Information Technology and Telecommunication Shaza Fatima Khawaja Friday said that Starlink has been granted temporary registration in Pakistan following the directives of Prime Minister Shehbaz Sharif. In a statement, the minister said, \"With the consensus of all security and regulatory bodies, Starlink has been issued a temporary No Objection Certificate (NOC).\" She added that the Pakistan Telecommunication Authority (PTA) would oversee compliance with fee payments and other licensing requirements by the company. Shaza Fatima said that, under Prime Minister Shehbaz Sharif's leadership, Pakistan is making significant strides towards digital transformation. \"The Prime Minister has directed comprehensive reforms to enhance Pakistan's internet infrastructure, and Starlink's registration is a major step forward in this journey,\" she added. Calling the approval for satellite-based internet services a milestone, the minister said, \"Modern solutions like satellite internet will greatly enhance connectivity, particularly in underserved and remote areas of the country.\" She highlighted that the government adopted a \"whole-of-government\" approach, working in close collaboration with all relevant institutions to facilitate Starlink's registration process. In this regard, she acknowledged the pivotal roles played by cybercrime and security agencies, the PTA, and the Space Authority. Shaza Fatima expressed optimism that Starlink's entry into Pakistan would formally launch satellite internet services, marking a new era in the country's digital connectivity and bridging the digital divide.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}