{
  "article_id": "2025-03-21_5640a8eb2b461e5ca230b9840d82ac12",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-calls-for-steps-to-protect-glaciers/",
    "retrieved_at": "2025-08-27T13:56:01.224Z"
  },
  "metadata": {
    "title": "PM calls for steps to protect glaciers",
    "author": null,
    "date_published": "2025-03-20T19:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 370,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 21 (APP): PM calls for steps to protect glaciers ISLAMABAD, Mar 20 (APP):Prime Minister Muhammad Shehbaz Sharif underlined the need for practical steps to protect glaciers to safeguard livelihoods, agriculture and environment. In a message on the World Day for Glaciers observed on March 21, he said glaciers were a guarantee of life on earth as these maintain the environmental system in its natural form and ensure the supply of important natural resources especially clean water. He said, \"In 2025, we are celebrating for the first time the World Day for Glaciers.\" \"Today we recognize the need for immediate steps to protect the important reservoirs of clean water,\" he said adding, \"Pakistan has more than 13,000 glaciers. This number is more than the glaciers present anywhere except in the polar regions of the earth,\" he added. The prime minister said Pakistan was among the top countries affected by climate change. Due to climate change, the weather was changing and the average temperature was rising, resulting in rapid melting of more than 10,000 glaciers, he noted. Resultantly, he said because of floods and drought, rivers, agriculture and millions of people working in the sector were facing dangers. He said due to melting of glaciers, thousands of new lakes were formed, increasing the danger of devastating floods. He said the floods of 2022 had made it clear that Pakistan was facing severe dangers of climate change. These floods caused devastation among the population living along streams and rivers and in the plains resulting in overall economic losses of $30 billion dollars, he added. As one of the most affected countries, the prime minister said Pakistan needed further cooperation in different areas including the programme to monitor glaciers, early forecasting system, for adoption of agricultural practices to protect against the ill effects of climate change and to attract investment for alternative solutions to store water. He said, \"We need to promote environmental tourism at the international level according to set guidelines in order to stop destruction of precious tourist assets from poisonous substances and pollution.\" He said everyone needed to take practical steps for protection of glaciers because in case glaciers disappeared then livelihoods connected to them would also be destroyed.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}