{
  "article_id": "2025-03-21_ae7faab396ae746516b2c3fdd1a3fd51",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/paa-piacl-joint-committee-conducts-feasibility-study-at-parachinar-airport/",
    "retrieved_at": "2025-08-27T13:55:28.851Z"
  },
  "metadata": {
    "title": "PAA-PIACL Joint Committee Conducts Feasibility Study at Parachinar Airport",
    "author": null,
    "date_published": "2025-03-21T11:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 202,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 21 (APP):A Joint Board of Officers (BOO) comprising officials from the Pakistan Airports Authority (PAA) and Pakistan International Airlines Corporation Limited (PIACL) recently visited Parachinar Airport to assess its operational feasibility for commercial and humanitarian flights. The visit was conducted in line with directives from the Ministry of Defence. The eight-member committee included six officers from PAA and two from PIACL, led by Mr. Younas Lugman Qazi, Additional Director Operations (IIAP). Other notable members included Mr Mohsin Ahmad Ghouri, Deputy APM (BKIAP), and Engr. Shah Jahan, Senior JTO CNS (BKIAP). During the visit, the committee carried out a thorough inspection of the airport's infrastructure, examining key facilities such as the terminal building, runway, fire garages, PAA accommodation, generator room, and other operational areas. Following the inspection, the BOO members met with the Deputy Commissioner (DC) of Parachinar to discuss matters related to the potential resumption of airport operations. The findings from this assessment will be compiled into a comprehensive feasibility report, which will guide future decisions regarding the reactivation of Parachinar Airport for both commercial and humanitarian purposes. The Pakistan Airports Authority (PAA) remains dedicated to enhancing air connectivity across the country, ensuring improved access to remote regions like Parachinar.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}