{
  "title": "Only security measures not enough to counter violent extremism: Saif - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The adviser to chief minister on information, Barrister Mohammad Ali Saif, said here on Thursday that growing threat of violent extremism was not merely an ideological issue but a consequence of various social, historical, economic and psychological factors.\n\nHe said that countering extremism required more than just security measures. He said that a long-term and comprehensive strategy was required, developed with the coordination of all relevant institutions and stakeholders, to counter extremism.\n\nHe was addressing a consultative workshop organised by Khyber Pakhtunkhwa Centre of Excellence for Countering Violent Extremism (KPCVE) in collaboration with United Nations Office on Drugs and Crime (UNODC), said a statement.\n\nCM’s adviser says long-term and comprehensive strategy is required for the purpose\n\nThe workshop was meant to promote effective, integrated and sustainable policymaking for preventing violent extremism.\n\nMr Saif underscored importance of understanding violent extremism through a sociological and anthropological lens. He said that extremism did not simply emerge based on ideological beliefs but was rather a product of social complexities, historical contexts and differing value systems.\n\n“While religious extremism is currently the most visible form, environmental, linguistic and political extremism are also rapidly growing in different parts of the world and require equal attention,” he said.\n\nMr Saif said that root causes of violent extremism were social injustice, political instability, economic deprivation and ideological exploitation. He said that religion was often used as a tool to propagate extremism, at its core extremism was a human behaviour that could manifest under any ideological framework.\n\nIdentifying institutional weaknesses as a major challenge, he said that weak state and social institutions played a significant role in fostering extremist ideologies.\n\n“When state institutions fail to deliver their responsibilities effectively, it leads to injustice, instability and public distrust, providing fertile ground for extremist narratives to thrive,” he said. He added that strong institutions were crucial in preventing the spread of such ideologies and keeping people away from radicalisation.\n\nRefuting the notion that extremism is an issue exclusive to the East or Islamic world, Mr Saif pointed out that Western societies also experienced extremism in various forms. He said that Western powers had also resorted to violence based on ideological justifications as ideological violence had been a global phenomenon.\n\nHe stressed the need for focusing on long-term policies rather than immediate and superficial responses and suggested integrating critical thinking and tolerance into education system to safeguard young minds from extremist influences.\n\n“Violent extremism could not be eradicated through force alone. Instead, a balanced and effective approach is required at ideological, social, economic and educational levels,” he said.\n\nThe secretary of higher education, Kamran Ahmed Afridi, KPCVE chief coordination officer Dr Ayaz Khan, KPCVE director general Dr Mohammad Qasim, UNODC senior adviser Syed Hussain Haider and others also spoke on the occasion.\n\nThey highlighted the importance of developing a comprehensive and integrated strategy to combat violent extremism and strengthening collaboration between governmental and non-governmental organisations.\n\nThey particularly highlighted the role of educational institutions in fostering intellectual development and instilling positive ideologies in young minds as a key approach to counter extremism.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:05:16.259Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899253/only-security-measures-not-enough-to-counter-violent-extremism-saif",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T01:54:21.000Z"
}
