{
  "title": "FIA books social media user in Islamabad over charges of leaking sensitive govt data - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Federal Investigation Agency (FIA) on Friday booked a suspect in Islamabad over his alleged “anti-state campaign” and leaking “sensitive government data” on social media.\n\nThe suspect, named Asad Nawaz, was arrested in a raid in Bani Gala, on the outskirts of Islamabad. The FIA’s cybercrime wing filed a case against him under the Prevention of Electronic Crimes Act (Peca) Act 2016, accusing him of illegally accessing passport and immigration database.\n\nAccording to the FIA, Nawaz shared personal passports of citizens and photos of high-ranking government officials on social media,\n\nThe accused tried to spread fear and panic among the public by sharing sensitive information through an X account.\n\nProsecutor Sheikh Aamir and Sub-Inspector Hayat Mir Khattak presented the suspect in an Islamabad district court today. The prosecutor sought a five-day physical remand in order to interrogate the suspect.\n\nHowever, Judicial Magistrate Muhammad Abbas Shah granted a four-day physical remand.\n\nThis incident resembles a series of arrests in recent days where social media users were taken into police custody under an intensifying crackdown against cybercrime.\n\nEarlier this week, the FIA arrested a suspect in Islamabad who was involved in an alleged “anti-state campaign” on social media over the Jaffar Express train attack.\n\nOn Thursday, journalist Farhan Mallick was arrested in Karachi over the content of his YouTube platform’s videos. Regarding specific charges, an FIA official said that Mallick had run “several programmes against the security establishment”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:20:28.318Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899373/fia-books-social-media-user-in-islamabad-over-charges-of-leaking-sensitive-govt-data",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T11:37:45.000Z"
}
