{
  "title": "IHC judge softens tone on colleagues over Imran case transfer - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The transfer of a case regarding ex-PM Imran Khan’s jail rights, which triggered a controversy a day earlier, toned down on Thursday when Justice Sardar Ejaz Ishaq Khan of the Islamabad High Court (IHC) ruled out any collision with the fellow judges and adjourned the hearing in contempt proceeding until after the Eid vacations.\n\nJustice Ishaq Khan resumed hearing in the contempt case that had star­ted following the sudden transfer of PTI lawyer Mashal Yousafazi’s petition to the larger bench without his consent.\n\nThe three-member larger bench, headed by Acting Chief Justice Sardar Mohammad Sarfraz Dogar, on the other hand, took up Jail Superintendent Abdul Ghafoor Anjum’s petition related to Mr Khan’s jail facilities and issued notices to all the relevant petitioners for March 24.\n\nJustice Ishaq Khan raised the white flag with remarks that he doesn’t want to embarrass anyone, but said he would put the record straight. He directed Deputy Registrar Judicial (DRJ) Sultan Mehmood to present the High Court Rules that allow the chief justice to pass an order on an application without removing objections.\n\nJustice Khan adjourns hearing, says he doesn’t want to embarrass anyone; questions if procedures followed in moving ex-PM’s case\n\nDuring the hearing, several legal representatives were present, including Advocate General for Islamabad (AGI) Ayaz Shaukat and spokesman for Imran Khan and Bushra Bibi, Niazullah Khan Niazi, PTI lawyers Chaudhry Zaheer Abbas, Usman Riaz Gul, Ali Bukhari, Shoaib Shaheen and Mashal Yousafzai.\n\nJustice Ishaq Khan questioned whe­ther proper legal procedures were followed in transferring the case. He em­­phasised that any case transfer must be done through a legal process, requi­ring notices to be sent to all the relevant parties. He noted that the registrar’s office had initially objected to the application, but later overruled it, raising concerns about judicial protocol.\n\n“This action is not meant to embarrass the high court but to ensure judicial accountability,” remarked the judge. He stated that if a judge of the high court had not handled the case, it could have amounted to criminal contempt of court.\n\nThe AGI acknowledged that no notice had been given to other parties before the transfer of case, supporting the court’s concerns over procedural lapses.\n\nMeanwhile, former advocate general Jahangir Jadoon argued that the AGI’s office could not legally represent the deputy registrar, further complicating the case.\n\nJustice Ishaq Khan stressed the need for clarity in judicial procedures, stating that “the accountability of judges should be public” and emphasising the importance of legal education for both lawyers and the public.\n\nHe announced plans to write a detailed judgement on the matter to clarify legal ambiguities.\n\nThe hearing was adjourned until after Eid, with the deputy registrar being instructed to present the high court rules regarding the chief justice’s authority over case objections and withdrawals.\n\nLarger bench hearing\n\nIn a related development, IHC’s larger bench comprising Acting Chief Justice Sardar Mohammad Sarfraz Dogar, Justice Arbab Mohammad Tahir and Justice Mohammad Azam Khan sought a report from the Adiala Jail authorities regarding meetings of PTI’s incarcerated founder.\n\nAdiala Jail Superintendent Anjum informed the court that the PTI leader was holding meetings outside the approved schedule, prompting the bench to demand a complete record of visitors and procedural guidelines for prison meetings.\n\nThe hearing was adjourned until March 24.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:20:48.302Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899306/ihc-judge-softens-tone-on-colleagues-over-imran-case-transfer",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T02:03:55.000Z"
}
