{
  "title": "Opposition in Balochistan Assembly concerned over rising enforced disappearance cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Opposition members of the Balochistan Assembly expressed grave concern on Thursday over the increase in the number of cases of enforced disappearances of Baloch people and the alleged “secret” burial of 13 bodies at midnight.\n\nThey said that the Baloch people were seeking their constitutional rights, and the situation would not improve with such a mindset being adopted by the rulers in Islamabad.\n\nFormer chief minister and National Party president, Dr Malik Baloch, stood up on a point of order soon after the assembly session began and said that earlier, relatives of the missing persons used to be taken to hospitals for identification of the bodies, but in this case the bodies were buried at midnight at a local graveyard without informing their relatives.\n\nReferring to another incident the other day, Dr Baloch said that when people went to the Civil Hospital to check bodies for identification, the police baton-charged them.\n\nBalochistan CM says referring to terrorists as fidayeen should be condemned\n\nHe said that last night, the renowned psychiatrist Prof Ilyas Baloch, his son and son-in-law were taken into custody by security forces.\n\n“With such steps, the situation in Balochistan will not improve and the chief minister should look into the matter,” the National Party president said.\n\nMPA Mir Asad Baloch, president of the Balochistan National Party-Awami (BNP-A), said that Baloch people were seeking their legal rights, but the mindset adopted by Islamabad rules would not help in bringing peace and order in Balochistan.\n\nHe said that when Baloch people had no control over their own resources, including Saindak and Reko Diq, they would come out of their homes to demand their rights and block roads.\n\n“The solution to the Balochistan issue is possible only through dialogue. All stakeholders should sit together and come to a consensus on the solution,” he said.\n\n‘Guns can’t lead to independence’\n\nSardar Abdul Rehman expressed concern over the killing of workers from Punjab, who he said were earning their livelihood by working as labourers in Balochistan.\n\n“They are being killed after being offloaded from buses and trains. Which Islam and Baloch traditions allow such killings?” Mr Rehman asked.\n\nNoting that opposition members rep­eatedly talk about negotiations, he said, “Those who want to talk should come forward and hold talks with the state rulers. Independence could not be achieved through guns,” Mr Rehman said.\n\nBalochistan Chief Minister Sarfraz Bugti said that terrorists should be referred to as terrorists and any mention of them as fidayeen (those who are willing to sacrifice themselves) in the assembly should be condemned.\n\nHe said that terrorists who attacked the train in Bolan were divided into two groups. Some stayed behind while the rest fled to their hideouts.\n\nThere was an exchange of fire between security forces and fleeing terrorists, which resulted in the deaths of 23 terrorists. Their bodies were transferred to Quetta for DNA and identification.\n\nThe chief minister said that many terrorists killed in the encounter with security forces were included in the list of missing persons.\n\nHe said the government buried the bodies with the help of the Edhi Foundation.\n\nHe said the Baloch Yakjehti Committee members attacked the morgue and forcibly took away some bodies. Their main goal, he said, was to politicise the issue of bodies.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67dcc83dad03d.gif",
  "retrievedAt": "2025-08-25T15:20:48.363Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899305/opposition-in-balochistan-assembly-concerned-over-rising-enforced-disappearance-cases",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T02:03:55.000Z"
}
