{
  "title": "Trump awards next-generation F-47 fighter jet contract to Boeing - World - DAWN.COM",
  "author": null,
  "content": "Donald Trump announced on Friday that Boeing has been awarded the contract for the Air Force’s next-generation stealth fighter plane, which the 47th US president said would be named the F-47.\n\n“Nothing in the world comes even close to it, and it’ll be known as the F-47. The generals picked a title, and it’s a beautiful number, F-47,” said Trump at the White House.\n\nThe contract aims to develop the replacement for the F-22 jet — which has been in operation for some two decades — with a new, more advanced aircraft able to operate alongside uncrewed drones.\n\n“After a rigorous and thorough competition between some of America’s top aerospace companies, the Air Force is going to be awarding the contract for the Next Generation Air Dominance (NGAD) platform to Boeing,” Trump said in televised remarks in the Oval Office.\n\nHe said the price of the contract could not be revealed for security reasons.\n\nDefence Secretary Pete Hegseth, speaking alongside Trump, said the new aircraft “sends a very direct, clear message to our allies that we’re not going anywhere, and to our enemies that … we will be able to project power around the globe unimpeded for generations to come”.\n\nThe announcement is a boon for Boeing, which faced a difficult last year in which it struggled with a lengthy labour strike and safety problems on its civilian airliners.\n\nAt around 16:25 GMT on Friday, Boeing’s shares were trading higher on the New York Stock Exchange, gaining 4.78 per cent to reach $181.09.\n\nThe NGAD effort was paused in 2024 over cost concerns — a major focus of the Trump administration, which has tasked billionaire donor Elon Musk with slashing government spending through the Department of Government Efficiency.\n\nThe Congressional Budget Office estimated in 2018 that the NGAD airframe could cost up to $300 million apiece — significantly more than various other aircraft currently in the US inventory.\n\nIn 2024, “officials cast doubt on whether the Air Force could afford to develop the NGAD alongside programmes including the B-21 Raider bomber and the Minuteman III ICBM replacement”, the Congressional Research Service said in a report earlier this year.\n\nA senior Air Force officer said earlier this month that the service conducted a study following the pause, which concluded that “not only in the past, not only in the present but in the future, air superiority matters.”\n\n“What this study told us is we tried a whole bunch of different options and there is no more viable option than NGAD to achieve air superiority in this highly contested environment,” Major General Joseph Kunkel told the AFA Warfare Symposium in Colorado.\n\nThe F-47 will replace the F-22 Raptor, which features stealth technology, a high degree of manoeuvrability and the ability to supercruise, or maintain supersonic flight without afterburners.\n\nLittle is known about the capabilities of the F-47, but Trump said the new jet will be “virtually unseeable” with unmatched manoeuvrability and power, and the ability to fly “with many drones, as many as we want, and that’s something that no other plane can do”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/212236451aa18e9.jpg",
  "retrievedAt": "2025-08-25T15:20:27.956Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899418/trump-awards-next-generation-f-47-fighter-jet-contract-to-boeing",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T17:45:28.000Z"
}
