{
  "title": "Parsis in Karachi celebrate Nauroz with traditional zeal - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: On Thurs­day at 2:01pm exactly, the time of the spring equinox, the Parsi community was happily giving thanks to Almighty God for everything that He blessed them with during the whole year along with offering an advance thank you for everything that He would give them in the new year.\n\nThat is what the celebration of Nauroz is all about basically, ushering in the new year according to the Zoroastrian calendar.\n\nIt is also well known that the Parsi community sets a very special table on the occasion with wheat sprouts to signify rebirth, apples for beauty, coins for prosperity, sweets and dried fruit for strength, garlic for good health, vinegar for patience, eggs for fertility, a goldfish for life, a mirror for reflection, etc.\n\n“This table is set for 13 days from the start of the equinox,” according to well-known off-road rally driver Tushna Patel.\n\n“The last of the 13 days is the ‘seezda’, when everyone leaves their homes to go on a picnic. That’s when all the vegetation that was on the table is thrown in flowing water,” Tushna tells Dawn.\n\nBut throughout those 13 days, friends and family visit each other’s homes as it is an open house, and a great time to bond. If the offerings on the table get low, there is replenishment.\n\nNot all Parsi homes set the Nauroz table. It is an Iranian tradition followed by some Parsi families. The rest usher in the new year in their own way.\n\nDinshaw B. Avari told Dawn that his family spends the auspicious day by going to prayers and then celebrating with family and close friends. “We meet up for lunch, hosted by my mother Goshpi,” he said via WhatsApp from Dubai. But he preparing to return the same day for the celebration.\n\nAsked if he had not missed it, he said that his family celebrates on March 21, which is the official start of spring.\n\nTushna also said that March 21 may be the day, but this year the actual moment of the spring equinox was on Thursday afternoon at 2:01pm. “The ones who set the table celebrate the start of Nauroz at the particular time of the spring equinox,” she explained.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:20:53.778Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899258/parsis-in-karachi-celebrate-nauroz-with-traditional-zeal",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T01:54:00.000Z"
}
