{
  "title": "91 killed in Gaza Strip as Israel abandons ceasefire - World - DAWN.COM",
  "author": null,
  "content": "• Hamas calls aggression ‘dangerous violation’ of agreement\n• Aircraft drop leaflets ordering evacuation\n• Trump ‘fully supports’ deadly resumption of operations\n\nCAIRO: At least 91 Palestinians were killed and dozens wounded in air strikes across Gaza on Thursday after Israel resumed bombing and ground operations, the enclave’s health ministry said, effectively ditching a two-month-old ceasefire.\n\nAfter two months of relative calm, Gazans were again fleeing for their lives after Israel effectively abandoned a ceasefire, launching a new all-out air and ground campaign against Hamas.\n\nUS President Donald Trump on Thursday fully supported the deadly operations in the Palestinian enclave.\n\nIsraeli aircraft dropped leaflets on residential neighbourhoods, ordering people out of Beit Lahiya and Beit Hanoun towns in the north, the Shejaia district in Gaza City and towns on the eastern outskirts of Khan Yunis in the south. “War is back, displacement and death are back, will we survive this round?” said Samed Sami, 29, who fled Shejaia to put up a tent for his family in a camp on open ground.\n\nA day after sending tanks into central Gaza, the Israeli military said on Thursday it had also begun conducting ground operations in the north of the densely populated enclave, along the coastal route in Beit Lahiya. Hamas, which had not retaliated during the first 48 hours of the renewed Israeli assault, said its fighters fired rockets into Israel. The Israeli military said sirens sounded in the centre of the country after projectiles were launched from Gaza.\n\nPalestinian medics said Israeli strikes targeted several houses in northern and southern sections of the Gaza Strip.\n\nWith talks having failed to bridge differences over terms to extend the ceasefire, the military said on Thursday that its forces had been engaged for the past 24 hours in what it described as an operation to expand a buffer zone separating the northern and southern halves of Gaza, known as the Netzarim corridor.\n\nIsrael ordered residents to stay away from the Salahuddin road, Gaza’s main north-south route, and said they should travel along the coast instead.\n\nTrump supports IDF actions\n\nWhite House Press Secretary Karoline Leavitt said President Trump “fully supports” Israel’s deadly resumption of air and ground operations in Gaza, blaming Hamas for the violence.\n\n“He fully supports Israel and the IDF and the actions that they’ve taken in recent days,” Leavitt told reporters when asked if Trump was trying to get a Gaza ceasefire back on track.\n\n“The president made it very clear to Hamas that if they did not release all of the hostages there would be all hell to pay, and unfortunately, Hamas chose to play games in the media with lives,” Leavitt said, adding that Trump wants all prisoners released.\n\nTuesday’s first day of resumed airstrikes killed more than 400 Palestinians, one of the deadliest days of the 17-month-old conflict, with scant let-up since.\n\nThis week’s strikes have killed some of Hamas top figures, including the de facto Hamas-appointed head of the Gaza government, the chief of security services, his aide, and the deputy head of the justice ministry.\n\nHamas said the Israeli ground operation and the incursion into the Netzarim corridor were a “new and dangerous violation” of the ceasefire agreement. In a statement, it reaffirmed its commitment to the deal and called on mediators to “assume their responsibilities”.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/211051109d5f15c.jpg",
  "retrievedAt": "2025-10-12T02:06:25.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899314/91-killed-in-gaza-strip-as-israel-abandons-ceasefire",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T02:12:50.000Z"
}
