{
  "title": "State-run news agency APP moves court seeking registration of FIR in Rs1.24 billion scam - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Associated Press of Pakistan (APP) filed a petition before the sessions court seeking registration of a case against several suspects in a Rs1.24 billion fraud case.\n\nAPP’s counsel Nazir Sultan Maken filed the petition before the sessions court and Additional District and Sessions Judge Sheikh Sohail issued a notice to the FIA for April 7.\n\nThe court record revealed a shocking scandal at the APP involving over Rs1.24 billion. A fact-finding committee constituted by the APP management revealed widespread financial irregularities, including the misappropriation of funds from Employees Related Expenses (ERE) and Provident Fund (PF) accounts.\n\nThe committee, formed on June 24, 2024, submitted its report to the Ministry of Information and Broadcasting, recommending that the case be forwarded to the National Accountability Bureau (NAB) or the Federal Investigation Agency (FIA) for further legal action.\n\nReport reveals widespread financial irregularities, including funds misappropriation\n\nThe committee found that Rs1.24 billion had been embezzled from the ERE and PF accounts of the state-run news agency. The embezzlement was carried out through unauthorised transactions, misuse of authority, and violation of financial rules.\n\nThe committee discovered that crucial financial documents, including cash books, salary/pension credit sheets, and master ledgers for the years 2021-2023, were missing. The destruction of these records was allegedly orchestrated by former officials. The report revealed that millions of rupees were illegally transferred to personal bank accounts of APP officials.\n\nFor instance, one official was found to have transferred Rs4.7 million into his personal account, while another was accused of transferring Rs15.4 million from the ERE account to his personal account.\n\nThe committee also uncovered illegal transfers of PF funds into personal accounts. A total of Rs910.4 million was embezzled from the PF account, with funds being diverted to various personal accounts without authorisation. The committee identified 16 prime accused, including former executives, managers, and clerks, who were involved in the scam. The list includes ex-executive director, ex-cashier, and ex-manager accounts.\n\nThe fact-finding committee urged the authorities to forward the case to NAB or the FIA for a thorough investigation and legal action against the accused. It also called for a detailed examination of the accused’s bank accounts and assets to recover the stolen funds. The report recommended stricter financial controls and proper handover procedures for key positions, like executive director and manager accounts, to prevent future fraud.\n\nMeanwhile, the information minister has verbally directed the APP managing director to forward the case to the FIA for investigation. The ministry is also considering referring the case to NAB under the National Accountability (Second Amendment) Act 2022, given the magnitude of the embezzlement, the report added.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/211144524349717.png",
  "retrievedAt": "2025-08-25T15:20:50.827Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899207/state-run-news-agency-app-moves-court-seeking-registration-of-fir-in-rs124-billion-scam",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T01:54:15.000Z"
}
