{
  "title": "Govt rules out fresh military offensive amid terror wave - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Tallal Chaudhry says existing counter-terror frameworks, including Azm-i-Istehkam and NAP, to be utilised\n• State minister for interior says around nine attacks occur daily; over 1,000 casualties in this year alone\n• Urges provinces to rise to the challenge; alleges PTI, Gandapur consider militants their ‘constituency’\n\nISLAMABAD: Days after a high-level security moot decided to root out terrorism through the implementation of existing counter-terrorism frameworks, Minis­ter of State for Interior Tallal Chaudhry has ruled out a fresh military offensive to rein in the surge in terrorism.\n\nIn a press conference held on Thursday, the minister said the option of a new military operation was not even discussed during the parliamentary security moot, which was attended by the prime minister and the army chief among others.\n\nAccording to the minister, Azm-i-Istehkam and the National Action Plan (NAP) will be enforced to root out terrorism from the country.\n\nThe PML-N leader’s statement seemingly came in response to the remarks made by Khyber Pakhtun­khwa Chief Minister Ali Amin Gandapur — who had also attended the huddle — in which the CM reportedly said that the KP government would not allow a new offensive.\n\nHe slammed Khyber Pakhtunkhwa (KP) Chief Minister Ali Amin Gandapur for allegedly creating ambiguity and stirring controversy about decisions taken in the security meeting held earlier this week in the wake of the attack on Peshawar-bound Jaffar Express. Mr Chaudhry said the statement made by the KP CM was “deeply concerning” and alleged that its purpose was to undermine the war on terror.\n\nHe asked CM Gandapur not to stand with the terrorists, even if he could not stand against them. He accused the CM of telling some police officers not to act against terrorists as the ANP and PPP had ‘destroyed themselves’ fighting against them. The minister challenged CM Gandapur to deny these remarks on oath.\n\nThe PML-N leader blamed the PTI government for the recent surge in terrorism, saying the militants were resettled here during its tenure. He noted that PTI did not attend the key meeting despite a spike in terrorist threats across the country. The minister dubbed the incarcerated PTI founder ‘patron-in-chief of terrorists’ and claimed that the latter took almost a week to condemn the Jaffar Express hijacking.\n\nThe minister also took exception to the PTI founder’s statement in which he said that the Jaffar Express incident was the result of the failure of intelligence and security agencies. Mr Chaudhry, however, contested this claim and said that the security agencies do issue alerts but institutions in KP and Balochistan “were not efficient enough” to act on the intelligence provided by the agencies.\n\nHe said the PTI had been ruling KP for the past 13 years but spent ‘very little money’ on the provincial police and the Counter-Terrorism Department out of a total of Rs800 billion it received from the federation under the National Finance Commission Award. He said the CTD operates from a rented building. “Where has that money gone,” he asked. The minister further also criticised Levies. He said 80 per cent of Balochistan falls under the ‘B’ area managed by Levies and pointed out that the attendance of Levies was merely 45pc.\n\n‘Nine attacks daily’\n\nIn his presser, the state minister for interior also shared statistics about terrorism. He said Pakistan was witnessing nine terrorist attacks daily, adding that three law enforcers and two civilians were losing their lives due to these attacks, while seven troops and four civilians were sustaining injuries.\n\nHe said from Jan 1 to March 16, 1,141 people either lost their lives or sustained injuries in these attacks, adding that 1,127 such victims were from KP and Balochistan. The minister said there was a 30 per cent rise in terrorism in February compared to the same month in 2024, and 95 per cent of the attacks occurred in Balochistan and KP. “If KP and Balochistan are not ready to fight, how can we end the menace of terrorism,” he asked.\n\n“The provinces will have to fight this war in the same way the army and the federal government are fighting it,” he said, underscoring that every province would have to perform its duty in this connection, but the state has decided that this war would be fought without waiting for anyone. “Our security forces are alert, and they are conducting around 180 intelligence-based operations daily and they are arresting suspects,” he said.\n\nAbout Imran Khan’s idea of peace through talks, he said, “We are ready to talk only with those who have not taken up arms.”\n\nHe alleged that the PTI and the party’s chief minister in KP did not openly talk against militants because both leaders ‘thought of them as their constituency’. Asked as to why Interior Minister Mohsin Naqvi was not in the limelight, he said Mr Naqvi was performing his duties efficiently and could not attend the security moot due to bad health.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/21073615145636a.png",
  "retrievedAt": "2025-10-12T02:05:32.845Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899295/govt-rules-out-fresh-military-offensive-amid-terror-wave",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T01:53:13.000Z"
}
