{
  "title": "Starlink granted temporary NOC to operate in Pakistan: IT ministry - Business - DAWN.COM",
  "author": null,
  "content": "Satellite-based internet provider Starlink on Friday was granted a temporary No Objection Certificate (NOC) to operate in Pakistan, according to a statement from the IT ministry.\n\nStarlink Services, owned by tech billionaire Elon Musk, is one of the most technologically advanced companies globally among those providing internet via Low Earth Orbit (LEO) satellites.\n\nMusk confirmed in January that Starlink applied to launch internet services in Pakistan but was “waiting for approval from the government”. A user on X — also owned by Musk — confirmed that Pakistan had “approved Starlink”.\n\nAccording to today’s statement, IT Minister Shaza Fatima said that Starlink was granted temporary registration on the instructions of Prime Minister Shehbaz Sharif.\n\n“Starlink has been issued a temporary NOC with the consensus of all security and regulatory agencies,” Fatima was quoted as saying. “Starlink’s arrival in Pakistan will mark the formal launch of satellite internet services”.\n\nThe minister said that registering Starlink was “a big step” to improve the country’s internet services and IT infrastructure in line with the PM’s instructions. She added that Pakistan is “moving towards digital development” under PM Shebaz’s leadership.\n\n“The Prime Minister had directed that the internet system in Pakistan should be improved,” Fatima said. “Modern solutions like satellite internet will improve connectivity in the country.”\n\nThe minister added that Starlink’s registration was a “whole of government” approach and that the IT ministry consulted with the Cybercrime Agency, security agencies, PTA and Pakistan Space Activities Regulatory Board.\n\n“PTA will complete Starlink’s fee payment and other licensing requirements,” Fatima was quoted as saying.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/21182108e8739fc.jpg",
  "retrievedAt": "2025-08-25T15:20:26.087Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899407/starlink-granted-temporary-noc-to-operate-in-pakistan-it-ministry",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T13:39:03.000Z"
}
