{
  "title": "Cabinet ministers review development, security issues in Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Discuss issues covering various federal departments\n• Decide to curb illegal trawling by installing tracking systems\n• CM hopes resolution of pending issues to help counter anti-state narratives\n\nQUETTA: A high-profile federal delegation, including key ministers, secretaries and heads of federal departments, met in Quetta on Thursday to discuss pending federal matters concerning Balochistan.\n\nThe meeting, chaired by Chief Minister Sarfraz Bugti, focused on economic development, security and infrastructure projects.\n\nThe delegation reviewed a 47-point agenda covering various federal ministries and departments, including ministries of petroleum, energy, railways, info­rmation, communications, fina­nce, foreign affairs, and Planning Commission and Pakistan Telecom­munication Authority.\n\nOne of the key proposals discussed was the one-time amnesty for registering around 6,000 fishing boats operating in Balochistan’s waters. Both federal and provincial governments agreed to curb illegal trawling by installing tracking systems and setting up a central monitoring control room.\n\nThe Ministry of Petroleum assured that outstanding dues of Pakistan Petroleum Ltd (PPL) spanning the past three years would be paid to Balochistan. The authorities also pledged to intensify anti-smuggling operations in the province.\n\nThe Ministries of Finance and Energy pledged to release the remaining funds for solar-powered agricultural tube wells by the second week of April. Federal Minister for Energy Awais Leghari assured swift completion of the project to prevent farmers from incurring financial losses.\n\nRailway security and development were also key agenda points. IG Railway Police Rai Tahir briefed the meeting on measures to enhance security, equip police with modern weapons and improve railway safety.\n\nThe Ministry of Communi­ca­tions presented progress updates on major infrastructure projects, including the Mashkel-Panjgur Road, Gwadar Port, Reko Diq and Saindak.\n\nThe Planning Commis­sion confirmed that, as per Prime Minister Shehbaz Sharif’s directive, each division in Balochistan would receive Rs1 billion to tac­kle socio-economic challenges.\n\nThe Ministry of Foreign Affairs briefed the committee on diplomatic actions against countries supporting terrorism in Balochistan. Additio­nally, the Ministry of Information and Broadcasting pledged to restore Bol TV and GNN bureau offices in Quetta and activate all national media offices in the province.\n\nTo combat anti-state activities on social media, Federal Minister for IT Shaza Fatima Khawaja announced that regional heads of social media companies would visit Quetta soon to address accounts linked to terrorism and subversion.\n\nThe FIA was also tasked with countering white-collar crimes, financial fraud and cybercrimes in the province.\n\nIt was decided that the Pakistan Coast Guards would receive additional resources to enhance operations against illegal trawling.\n\nThe federal government, in collaboration with the Counter-Terrorism Department (CTD), will strengthen anti-terrorism efforts and promote a national narrative against extremism.\n\nA committee led by the Secre­tary of Law was also established to draft provincial legislation on missing persons.\n\nAction on delayed projects\n\nSpeaking at the meeting, CM Bugti welcomed the federal delegation and thanked PM Shehbaz for prioritising Balochistan’s concerns. He stressed that resolving federal issues would strengthen the province’s stance and help counter anti-state narratives. He also urged faster execution of the solar tube well project to prevent financial losses to farmers.\n\nHe reiterated the provincial government’s commitment to cooperating with customs authorities in anti-smuggling drive.\n\nHighlighting the lack of motorways in Balochistan, he requested the Ministry of Communications to construct a motorway segment as a symbolic gesture of federal support.\n\nHe also called for educational opportunities for Balochistan’s youth at top global institutions like Harvard to help them transition away from illegal trade and smuggling.\n\nThe chief minister also expressed concern over the 24-year delay in the Kachhi Canal project, demanding a 100 per cent allocation of annual resources to complete it. He expressed optimism that the decisions made at the meeting would bring substantial benefits to Balochistan.\n\nThe meeting was attended by several federal ministers, including Minister for Energy Awais Leghari, Finance Minister Muhammad Aurangzeb, Petrol­eum Minister Ali Pervez Malik, IT Minister Shaza Khawaja, and Maritime Affairs Minister Junaid Anwar Chaudhry.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67dcc8eed7be9.gif",
  "retrievedAt": "2025-10-12T02:05:51.253Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899309/cabinet-ministers-review-development-security-issues-in-balochistan",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T02:03:55.000Z"
}
