{
  "title": "Punjab prosecutor general orders arrest of suspects behind rape, attempted murder of teenager in Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "Punjab Prosecutor General Syed Farhad Ali Shah on Friday took stern notice of the alleged gang-rape and near-fatal torture of a 14-year-old labourer in Lahore’s Hadiyara area, ordering the immediate arrest of the suspects.\n\nAccording to a first information report (FIR) filed at Hadiyara police station on February 2 — a copy of which has been seen by Dawn.com — the victim went to work on February 1 but did not return home. The next morning, he was found by local residents near a graveyard in a pool of blood.\n\n“Unknown suspects for unknown reasons injured my nephew … with a sharp instrument with the intention of killing him,” the complainant wrote in the FIR, which was filed under Section 324 (attempted murder) of the Pakistan Penal Code (PPC).\n\nHowever, according to a press release issued by the prosecutor general’s office on March 20 (Thursday), the victim approached Shah and alleged that he was also gang-raped in the assault.\n\n“The victim personally approached the prosecutor general and told him the details of the heinous incident,” the press release read, adding that Shah declared the case “high-profile”.\n\nAccording to the statement, Shah summoned the investigating officer to review the progress of the investigation and issue a line of inquiry. The officer delivered a briefing, upon which the prosecutor general reprimanded him for “poor investigation” and “not including the relevant provisions” in the case.\n\n“The Prosecutor General of Punjab issued a line of inquiry under Section 376 (iii) (punishment for rape of a minor) of the PPC and issued instructions to hand over the case to the SSOIU (Special Sexual Offences Investigation Unit) under the Anti-Rape Act 2022,” the press release read.\n\n“As per the vision of Chief Minister Punjab Maryam Nawaz, the protection of children will be ensured,” Shah was quoted as saying. “There will be no compromise on the rights of women and children.”\n\nSpeaking to Dawn.com, Shah said he demanded the immediate arrest of the suspects and reiterated that rape provisions will be included in the case.\n\n“Deficiencies in the investigation of child rape cases will not be tolerated under any circumstances,” he said. “This case will be an example … the police will complete the investigation on merit and submit a report.”\n\nDespite the presence of strict anti-rape laws in the country, which could result in the death penalty or imprisonment lasting from ten to twenty-five years, incidents of sexual assault continue across the country.\n\nData collected by the non-governmental organisation Sahil revealed that a total of 1,630 cases of child abuse were reported from across the country in the first six months of 2024.\n\nThe statistics included 862 cases of child sexual abuse, 668 cases of abduction, 82 cases of missing children and 18 cases of child marriages. In the six-month period, 48 cases of pornography after sexual abuse were also recorded.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:20:27.994Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899415/punjab-prosecutor-general-orders-arrest-of-suspects-behind-rape-attempted-murder-of-teenager-in-lahore",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T17:19:01.000Z"
}
