{
  "title": "Illegal detention action ordered against SHO as bailiff rescues starved man - Pakistan - DAWN.COM",
  "author": null,
  "content": "SARGODHA: After a bailiff rescued a man found tied with ropes, allegedly without food and water for over a week, in a police station on Thursday, the court ordered legal action against the station house officer (SHO), seeking a report within seven days.\n\nOn the application of one Iftikhar of Tanguwali village in Sargodha district about illegal detention of an innocent man, Additional Sessions Judge Shahbaz Iqbal Tarar sent a bailiff, Irfan Ghafoor, to conduct a raid on Saddar police station. In the raid, the bailiff recovered one Allah Bakhsh (50), who was found tied with ropes at the police station, and presented him in the court.\n\nThe recovered man told the court that the police had kept him in illegal detention without registration of any case against him.\n\nHe also claimed that he had been denied food and water by the police for nine days, and was subjected to brutal torture as the SHO wanted to implicate him in a false case.\n\nAt this, the court ordered legal action against SHO Iqbal Gondal, seeking a report to be submitted within seven days.\n\nOn Wednesday, the district police officer had conducted a raid on the City police station, and suspended the SHO after three persons were found illegally detained there.\n\nFATHER SHOT BY SON: A young man allegedly shot at and critically injured his father over a land dispute and fled away, at Chak Dora Wala on Thursday.\n\nAccording to police sources, the suspect, Aamir, allegedly opened fire on his father Mumtaz (55) over a land dispute.\n\nThe father, who received eight bullets, was shifted to hospital in critical condition, while the son manged to escape, they said.\n\nIn other incidents, a man was injured by his rivals during a fight between two groups, while a woman was left injured by his brother-in-law over a domestic dispute.\n\nSimilarly, a man was injured by during a fight between two brothers, and a another suffered a bullet injury at the hands of his brother-in-law.\n\nPolice are investigating the incidents.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:05:18.561Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899223/illegal-detention-action-ordered-against-sho-as-bailiff-rescues-starved-man",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T01:54:06.000Z"
}
