{
  "title": "Personal priorities - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT has been a pattern. Ever since it returned to power in 2022, the ruling PML-N has allocated tens of billions from public funds each year to the Sustainable Development Goals Achievement Programme, ostensibly to shore up its own and allied parties’ sagging political fortunes.\n\nSAP, as the programme is referred to, is the cover given to political development schemes sanctioned and overseen by parliamentarians in their respective constituencies. Such schemes have a long and controversial history and have been criticised as misuse of public resources by lawmakers, who often seek to use them to advance personal aims. Pet projects launched by them have often been found to be poorly conceived, ripe for exploitation and misaligned with the country’s overall development priorities.\n\nDespite these concerns, the budget for such projects has been jacked up considerably in recent years. It has also been observed that SAP funds have been utilised to the greatest extent possible even when ministry-run development projects have faced sharp cutbacks.\n\nAt a time when the country’s economy is sagging, the climate wreaking havoc, and its people doing demonstrably worse each year on social indicators, whatever fiscal space there is for development spending should be utilised wisely and carefully. Regrettably, the government has been acting contrary to these principles. Instead of requiring all development projects to be requisitioned with detailed proposals and feasibility reports, as projects executed at the state level should be, it recently relaxed the rules to ensure that SAP funds are released without too many questions asked of lawmakers. It has now come to light that almost 96pc of SAP funds had been released by end February, within a few weeks of the SAP allocation being doubled from what was originally budgeted for the ongoing fiscal year. The logic of doing so deserves to be probed.\n\nWhat makes it doubly problematic is that these disbursements have been made at a time when the country is facing a massive budgetary shortfall and has sharply curtailed spending under various important heads to remain within its means. Seen along with the eye-watering, almost 300pc increase in parliamentarians’ salaries approved around the same time, it raises valid concerns about the government’s priorities and whether it is managing Pakistan’s finances in the best interests of its citizens.\n\nFactor in that legislators’ schemes, like much else, are being financed with expensive debt, and one gets an alarming picture of fiscal mismanagement at the highest levels of decision-making. One wonders how this helps the country’s case before the various institutions and friendly countries our government keeps turning to for handouts and loans. There was a time when the ruling class would at least worry about the optics of their decisions. Not anymore, it seems.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:05:50.534Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899337/personal-priorities",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T02:29:18.000Z"
}
