{
  "title": "Nasirabad police foil sabotage plan, seize explosives - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA MURAD JAMALI: Nasirabad police claimed to have foiled a sabotage attempt ahead of the Pakistan Day celebrations and seized explosives.\n\nNasirabad SSP Ghulam Sarwar Bheo disclosed this during a press conference on Thursday, alongside other senior police officers. He said that based on intelligence reports, a special team comprising DSP City Muhammad Yasin Jamali and SHO Inspector Zulfiqar Ali Pandrani conducted an operation in the Chhakra Mohalla area.\n\nDuring the raid, police discovered 8kg high explosives and other materials hidden in the bushes, intended for terrorist attacks during the Pakistan Day celebrations on March 23.\n\n“Terrorists had planned to carry out attacks on Pakistan Day, but police successfully foiled their attempt in time,” the SSP said, adding that investigations were underway and the perpetrators would soon be brought to justice.\n\nHe said stringent security measures would be in place to ensure smooth and uninterrupted Pakistan Day celebrations.\n\n“No one will be allowed to disrupt peace and order,” he asserted, urging the public to remain vigilant and cooperate with law enforcement agencies in curbing crime.\n\nRescue operation\n\nMeanwhile, police successfully rescued a kidnapped man, Mahmood Akbar, a resident of Sibi, from Langah Mohalla. The suspects, Khan Muhammad and Naseer Ahmed were arrested, and further investigations were in progress.\n\nAdditionally, police arrested two individuals allegedly involved in child abuse.\n\nThe suspects were identified as Shafi Muhammad and Azizullah.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:20:44.500Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899303/nasirabad-police-foil-sabotage-plan-seize-explosives",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T02:03:55.000Z"
}
