{
  "title": "Govt, foreign donors reaffirm commitment to end polio - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Global donors and partners have reaffirmed their commitment to fully eradicate poliovirus from Pakistan.\n\nThe government, alongside international donors and development partners, gathered in Islamabad to reaffirm their commitment to collaborative efforts to ensure a polio-free future for children.\n\nOrganised by the Pakistan Polio Eradication Initiative, the review meeting updated stakeholders on the progress, ongoing challenges and strategic interventions to eliminate the virus.\n\nPrime Minister’s Focal Person for Polio Eradication Ayesha Raza Far­ooq thanked the donor for their support.\n\nHealth minister thanks Bill Gates for support in eradication efforts\n\n“Your steadfast commitment and continued engagement have been instrumental in driving Pakistan’s progress toward polio eradication,” she said.\n\n“This year presents a critical opportunity to interrupt virus transmission and with your support, we are implementing a robust and targeted strategy to close immunity gaps and protect every child.”\n\nShe added that the government was working with local influencers to enhance vaccine acceptance through community engagement along with digital media initiatives to combat misinformation and strengthen public trust.\n\nThe World Health Organisation representative in Pakistan, Dr Dapeng Luo, said that for over three decades, the global health body has partnered with Pakistan to reduce the number of polio cases by more than 99pc.\n\nMelissa Corkum, the Unicef chief of polio in Pakistan, emphasised the importance of integrating virus eradication with broader child health initiatives.\n\n“Polio eradication is not just about delivering vaccines; it is about ensuring every child has access to the healthcare they need to thrive,” she remarked.\n\nMinister’s meeting\n\nSeparately, Federal Minister for Health Syed Mustafa Kamal met Michael Galway, the deputy director for polio at the Gates Foundation, to discuss polio eradication efforts.\n\nAn official statement said they discussed polio eradication strategies and future action plans.\n\nThe health minister praised Bill Gates and his team for their support in polio eradication efforts.\n\n“Polio eradication is a national priority,” Mr Kamal stated.\n\nHe added that Prime Minister Shehbaz Sharif was “personally overseeing the progress” through regular review meetings.\n\n“My first meeting with the prime minister was also focused on polio, which reflects our unwavering commitment to eliminating this disease.”\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/210903112e521bf.png",
  "retrievedAt": "2025-10-12T02:05:48.804Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899294/govt-foreign-donors-reaffirm-commitment-to-end-polio",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T01:53:31.000Z"
}
