{
  "title": "Deputy speaker wraps up NA sitting over truancy of ministers - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In a rare move to protest the absence of ministers from the National Assembly, Deputy Speaker Ghulam Mustafa Shah adjourned house proceedings on Thursday without taking up any agenda items.\n\nPresiding over one of the briefest sittings of the lower house of parliament, the deputy speaker said it was unacceptable that ministers failed to attend the session, despite clear instructions from the prime minister.\n\nHe noted that the ministers were not taking their responsibilities seriously, terming their attitude unfortunate. Recalling the recent expansion of the federal cabinet, Mr Shah regretted that collective responsibility was being collectively ignored.\n\nHe said that a letter had also been written to the prime minister conveying the displeasure of the house over the absence of ministers.\n\nThe house was supposed to take up questions related to the ministries of energy and commun­ications, but Deputy Speaker Shah regretted that both concerned ministers — Sardar Awais Leghari and Abdul Aleem Khan — were not present in the house. Besides this, he said, no other minister was ready to respond in their stead.\n\nAn angry deputy speaker said that proceedings could not continue without the ministers’ participation and adjourned the house to meet again on Friday (today).\n\nThis was not the first time that Deputy Speaker Shah had voiced his displeasure over the absence of ministers from the house.\n\nEarlier, on Dec 12, 2024, he had warned the government on the issue. Back then, the session had started with PTI lawmaker Asad Qaiser pointing to the empty seats on the treasury benches, particularly those of federal ministers.\n\nAttempting to give the government a chance, the deputy speaker had adjourned the session for 15 minutes to allow time to the ministers to arrive in the house.\n\nHowever, when the session resumed, the cabinet members were still missing, further escalating tensions in the house.\n\nAt the outset of Thursday’s sitting, the house offered fateha for the departed soul of JUI-F leader and seasoned politician Hafiz Hussain Ahmed, who remained a member of both houses of parliament in the past.\n\nPublished in Dawn, March 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/21082638bd40188.jpg",
  "retrievedAt": "2025-08-25T15:21:09.902Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899299/deputy-speaker-wraps-up-na-sitting-over-truancy-of-ministers",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T01:53:13.000Z"
}
