{
  "article_id": "2025-10-25_13bd5c4a96c5ff17eb430bc9a1ba5b2c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/domestic/senator-taj-haider-bridge-under-yellow-line-brt-completed-in-short-time-sharjeel/",
    "retrieved_at": "2025-10-25T20:48:32.239Z"
  },
  "metadata": {
    "title": "Senator Taj Haider bridge under Yellow Line BRT completed in short time: Sharjeel",
    "author": null,
    "date_published": "2025-10-25T17:29:28.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/04/Sindh-Senior-Minister-for-Transport-Sharjeel-Inam-Memon-768x430-1.png",
    "categories": [
      "National"
    ],
    "word_count": 226,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI, Oct 25 (APP):Sindh Senior Minister and Provincial Minister for Information, Transport, and Mass Transit Sharjeel Inam Memon on Saturday said that the Senator Taj Haider Bridge is a major project of the Pakistan Peoples Party's Sindh government for the citizens of Karachi. This bridge is part of the Yellow Line BRT line, which has been completed in a short time. In a video statement, Senior Minister Sharjeel Inam Memon said that another bridge is also being constructed alongside the Senator Taj Haider Bridge, after which a total of eight lanes will be completed. A separate track has also been built for cyclists under the Senator Taj Haider Bridge project so they can travel safely without disrupting traffic. He said that the Pakistan Peoples Party's Sindh government was actively working on various BRT projects. This project will provide great convenience to the citizens of Korangi and surrounding areas. He added that the government is committed to providing state-of-the-art transport and modern road systems in Karachi to ease the city's traffic problems. Under the leadership of the Pakistan Peoples Party, the Sindh government is rapidly improving the city's connectivity so that citizens can travel comfortably in air-conditioned buses at affordable fares. Senior Minister Sharjeel Memon further said that EV buses are being introduced under the Yellow Line project, which will greatly enhance environmental quality and travel facilities.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}