{
  "title": "PM directs all stakeholders to pursue SIFC initiatives to reap dividends",
  "link": "https://www.app.com.pk/national/pm-directs-all-stakeholders-to-pursue-sifc-initiatives-to-reap-dividends/",
  "date_published": "2023-11-16T13:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday directed all the stakeholders to vigorously pursue the Special Investment Facilitation Council’s (SIFC) initiatives through a collaborative approach to reap the dividend in short to medium terms, besides initiating processes for long term endeavours in the larger national interest.\nThe prime minister said this while chairing the 7th meeting of the Apex Committee of SIFC that was attended by the Chief of Army Staff, members of the federal cabinet, provincial chief ministers and high level government officials.\nThe meeting was held to review various initiatives being led through the SIFC forum, a PM Office press release said.\nIn the meeting, the ministries presented progress on projects identified in key sectors and gave plans to further improve the ecosystem for realizing the envisaged investments in a timely manner.\nThe committee showed extreme satisfaction on overall progress under the umbrella of SIFC, appreciated the enhancing level of engagements with friendly countries, both public and private entities, and the outreach strategy to proactively engage investors’ community, which was translating in enhanced traction and approvals at domestic and global stages.\nIt reviewed progress on various measures undertaken to improve investment climate and approved policy level interventions to further improve investors’ confidence including repatriation of profits, strengthening domestic dispute resolution mechanism, infrastructural and human resource development, and speedy operationalization of EXIM Bank.\nThe committee also directed to make a comprehensive strategy to address oil and gas issues in a sustainable manner by investing in relevant industries.\nThe apex body reviewed and appreciated the progress on privatization of State-Owned-Enterprises and directed to keep the process at fast pace.\nThe Chief of Army Staff reassured undaunted resolve of the Pakistan Army to backstop government initiatives in various domains for sustainable recovery of the economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:32:55.081Z"
}
