{
  "title": "PTDC’s remarkable achievements highlighted in promoting country’s tourism",
  "link": "https://www.app.com.pk/national/ptdcs-remarkable-achievements-highlighted-in-promoting-countrys-tourism/",
  "date_published": "2023-11-16T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): The Pakistan Tourism Development Corporation (PTDC) has made remarkable achievements in the tourism industry and its promotion by marketing country’s natural landscape, history, culture and archeological sites being providing facilities to tourists.\nTaking to APP, the PTDC official said that the corporation was working effectively according the vision to develop the tourism sector as a national priority in a sustainable and acceptable manner, taking full advantage of regional and international trends and developments.\nHe said the PTDC is projecting the country as a tourist friendly destination in bringing Pakistan amongst top five tourist destinations of Asia and marketing of tourist places at home and abroad through tourism show and exhibitions to generate revenue. Tourism sector is contributing a lot to national exchequer as well, he added.\nThe official said that the tourism organization is to act as a catalyst in encouraging the private sector to play active role in tourism promotion and development. It was developing infrastructure and services within the country to facilitate the tourists.\nHe said it has already established Tourist Information Centers (TIC) at various airports to provide accurate information to foreign and local tourists.\nHe said that Minister of State for Tourism, Special Assistant to Prime Minister on Youth Affairs Wasi Shah had unveiled that TIC would set up at Gawdar International Airport to facilitate the tourists about their destination.\nHe said that PTDC with collaboration of the Capital Development Authority (CDA) has kicked off an effective cleanliness campaign at various parks of the federal capital to ensure neat and clean environment to attract large number of tourists in a healthy ambience.\nOfficial said the campaign launched aimed at ensuring clean environment to urge the tourists to maintain cleanliness at tourist spots of the capital city as a number people from various parts of the country throng to the twin cities of Islamabad and Rawalpindi for recreation and tourism purposes",
  "retrievedAt": "2025-08-11T10:32:53.902Z"
}
