{
  "title": "Improved diplomacy seen as way out of Pakistan’s daunting regional challenges",
  "link": "https://www.app.com.pk/national/improved-diplomacy-seen-as-way-out-of-pakistans-daunting-regional-challenges/",
  "date_published": "2023-11-16T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): The speakers at the second day of Margalla Dialogue on Thursday underscored pressing issues faced by the country in the region due to fluctuating ties with its neighboring countries and termed improved diplomacy as a way out to capitalize on the opportunities underlying within the crises.\nThe annual “Margalla Dialogue: Evolving World Environment: Chartering the Course for Our Future” organized by the country’s premier think tank, Islamabad Policy Research Institute (IPRI), was addressed on its second day by policymakers, leading local and international personalities, as well as media professionals.\nThe session titled “Mapping internal and regional threats,” was moderated by Prof Dr. Huma Baqai Rector MITE, and was participated by Ambassador Asif Ali Durrani, Pakistan’s Special Representative on Afghanistan; Former Prime Minister Shahid Khaqan Abbasi; former finance minister Miftah Ismail; Dr Daniel Markey, senior advisor USIP; and Lieutenant General (R) Aamer Riaz, former DG Military Operations.\nDr Huma Baqai flagged five propositions by saying: “We are in a bad place as concerned with the region; we know the challenges facing us; we know what needs to be done, but we are not doing it, and that we cannot sustain any longer if the present predicament continues.\nAmbassador Durrani talked eloquently about the region and the four neighbours Pakistan has and said that with India in the East, Pakistan historically has had tense relations owing to the dispute on Kashmir.\nHe said that Afghanistan in the West has never seen peace except for the four decades of Zahir Shah. “With Iran, we have good relations and the common denominator is that Tehran has been under direct sanctions whereas Islamabad had faced indirect sanctions,” Durrani observed.\nHe said that China is the only hope line for Pakistan. He went on to elucidate that the occupation of Kashmir by India was not Pakistan’s choice, and so was the case with the Soviet invasion of Afghanistan and the Iranian Revolution in 1979. He said that Pakistan has faced all these upheavals and has survived, and is a nuclear power which proves its resilience and power of resources.\nTo the perception of Indian Prime Minister Narendra Modi that “Pakistan is irrelevant,” Durrani said Islamabad has an uphill task to face the Hindutva surge on the eve of elections in India, and it has to keep in mind the Pulwama too.\nFormer PM Shahid Khaqan Abbasi said that we don’t have a choice with neighbours, and Pakistan must strike cordiality and a working relationship with all of them. “Pakistan needs to introspect its policies and find solutions with the neighbours,” he added.\nHe emphasised trade relations with neighbours, including India and regretted that there is no trucking between India and Pakistan, and whatever is traded is through the long and tedious sea route via third countries.\nHe said that India and Afghanistan are top 10 trade partners with Pakistan, and this potential must be tapped. “Diplomacy is all about trade and we are lacking in it.”\nFormer finance minister Miftah Ismail said that the federal government has huge deficits, and it is an enigma that provinces end up with surplus budgets.“We are in a debt trap and end up paying for debt-servicing. We borrow to pay local and foreign debts,” he observed.\nDaniel Markey said that Tehrik-e-Taliban Pakistan (TTP) is emerging as the biggest security threat to Pakistan. The fact that it is regrouping and getting assertive poses new existential challenges, and of late is a bone of contention between Kabul and Islamabad.\nHe said that the United States supports peace, and is willing to work with Pakistan. He also hinted at India and Pakistan ties and said that a bogged-down India with China is also a security concern for the region.\n“We hope India will prefer a stable Pakistan.\n“The most immediate threat comes from within Pakistan, and this needs to be addressed,” Daniel remarked. Pakistan must insulate itself from regional conflicts, and that is the way to go, he added.\nLt Gen (r) Aamer Riaz said that USA and China confrontation is taking place at all levels, and that it is impacting the region too.\n“Absence of politico-diplomatic dialogue with India makes equation more complicated, especially as elections are round the corner in India,” he added. He also noted that there is unfortunately no dialogue with India on climate change, and it should commence so that the menace of climate is addressed amicably.\nThe forum on “Media in an age of technology,” was addressed by Mir Ibrahim Rehman, CEO of Geo Network; Aamer Ghauri, editor of The News International, eminent journalist Steve Coll and Anna Choi, Director Future Consensus Institute South Korea.\nIt was noted that the rise of social media and conflictual paradigm of print and electronic media has made the mosaic contentious. There are ethical challenges involved in this new age of journalism, and Artificial Intelligence has made it too difficult to make a distinction.",
  "retrievedAt": "2025-08-11T10:32:28.939Z"
}
