{
  "title": "UK announces AI system for Pakistan designed to detect, track early forest fires: Jane Marriott",
  "link": "https://www.app.com.pk/national/uk-announces-ai-system-for-pakistan-designed-to-detect-track-early-forest-fires-jane-marriott/",
  "date_published": "2023-11-16T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 16 (APP): In a bold move to address environmental challenges in Pakistan, the British High Commissioner in Pakistan, Jane Marriott OBE, has announced a groundbreaking artificial intelligence (AI) system for Pakistan designed to detect and track early forest fires.\n“By spotting early forest fires, we’ll be able to help protect communities and save livelihoods,” said the High Commissioner in an interview with APP.\nThe initiative, part of a comprehensive climate financing effort, was aimed to safeguard communities and protect livelihoods, particularly in the Khyber Pakhtunkhwa region and around the Margalla Hills in Islamabad.\nThe High Commissioner said that the UK would also provide financial assistance to support climate initiatives in Pakistan. “This includes the development of an innovative AI system dedicated to the early detection of forest fires, a technology set to revolutionize the way communities respond to environmental threats,” she added.\nThe High Commissioner highlighted the ongoing collaboration between the UK and Pakistan under the Financial Accelerator program. “The UK is supporting eight different projects, eight innovative Pakistani enterprises in a climate-friendly way,” she explained.\nResponding to a question about the financial components of support for the floods, she said two significant aspects including immediate humanitarian assistance, with millions of pounds contributed for urgent humanitarian needs. For the longer term, she said the focus was on health care and education.\nShe further said, “We know that three and a half million children’s schooling was disrupted by those floods and there’s a worry that at least a million of those kids won’t go back to school.”\n“The work that we’ve been doing, it’s not going to solve everything, but we’re in the process of getting 85,000 of those children back in school by December and learning  that they wouldn’t otherwise ordinarily be doing” she added\nDiscussing King Charles III’s involvement  in the United Nations Climate Change Conference (COP28), she said that King will make one of the opening speeches at the COP28 because as “we have said, it’s a matter that’s very, very dear to his heart.”\nShe said, the UK will be focusing on three main areas including the efforts to keep the increase in global temperature at 1.5%. It’s a difficult, task, but we have to do it she added.\n“We’ll be looking to build resilience with our partners across the globe, including here in Pakistan. And we’ll also be trying to halt and reverse the biodiversity loss.  Both the UK and Kenya are members of 30 by 30, trying to protect 30% of our land and our oceans by 2030” she added.\nTo a question, she said, “Pakistan has such tremendous economic potential and I think some of the reforms that we’re starting to see now are taking us in that direction.”\n“What I’d really like to see here is space and the right sort of regulations and environment for the private sector because I think a private sector-led growth for a Pakistan will be incredibly successful” she added.\nShe highlighted the historical success of export-led growth, suggesting it could bring 7-9 per cent per annum growth to the economy. The UK is actively collaborating with the government to support these efforts, benefiting both British businesses and British-Pakistani trade.\nResponding to a question about the Pakistani Diaspora in the UK, she acknowledged their integral role in the UK, praising their cultural and economic contributions.  She said that many Diasporas still hold their heritage in their hearts, seeing an opportunity to promote relations between countries through cultural and business exchanges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:32:51.954Z"
}
