{
  "title": "PM’s Successful Youth Program to help youth grow further: Governor",
  "link": "https://www.app.com.pk/national/pms-successful-youth-program-to-help-youth-grow-further-governor/",
  "date_published": "2020-02-22T04:17:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 22 (APP):Governor of Sindh Imran Ismail Saturday said that around 60 per cent of the total population of Pakistan was youth, which was an asset and future of the country.It was imperative to encourage the students, while, Kamyab Naujawan Program of Prime Minister would help them in their growth.\nHe expressed these views while addressing on the occasion of the National Project Competition at Dawood University of Engineering and Technology (DUET) here.\nVice-Chancellor DUET Prof. Faizullah Abbasi, Dawood Foundation’s Chief Executive Officer Sabrina Dawood, faculty members, alumni and a large number of students attended the event.\nAround 120 projects prepared by 35 universities and educational institutions participated in the national competition.\nThe governor said that a large number of pass-outs professionals were eager to go abroad and tried their luck as they had misconception about non-availability of opportunities in Pakistan.\nImran Ismail said that impression about lack of opportunities in Pakistan was not true, especially since Prime Minister Imran Khan had assumed the government.\nThe youths were being provided opportunities to exhibit their potential and move forward in the field of their choice, he added.\nThe federal government’s successful youth program was a testament of this fact through which youth were being given loans from Rs 1 million to 5 million, he added.\nHe asked the participants of the National Project Competition to further polish their ideas and make progress professionally by taking maximum benefits from Prime Minister’s Successful Youth Program.\nThe governor said that the DUET university was emerging as a prominent educational institution due to valuable contribution of Vice Chancellor Faizullah Abbasi, faculty and students.\nHe added that the country could achieve the new destinations of progress and prosperity only through promotion of technical education.\nHe said that the pass-outs from Dawood Engineering University had been performing admirably in many fields and their presence in the event and the contribution for the university was highly commendable.\nSpeaking on the occasion, Vice Chancellor Prof Faizullah Abbasi said that all the credit went to the students who had worked hard day and night for six months to make this event successful.\nHe said that the university had undergone significant changes in the last seven years.\nLater, the governor formally inaugurated the National Project Competition and visited different stalls of various universities to find out about their projects.\nMeanwhile, talking to media on the occasion, the governor said that the Chief Justice’s orders regarding Karachi Circular Railway would be complied with every possible way.\nThe governor told a questioner that the projects of Karachi Metropolitan Corporation (KMC) were being finalized which, would be inaugurated soon.",
  "retrievedAt": "2025-08-11T18:50:33.174Z"
}
