{
  "title": "Pakistan defeating India on every front: governor",
  "link": "https://www.app.com.pk/national/pakistan-defeating-india-on-every-front-governor/",
  "date_published": "2020-02-22T02:24:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 22 (APP):Punjab Governor Chaudhry Mohammad Sarwar said on Saturday that Pakistan was defeating India on every front including diplomatic.\nIndian conspiracies against Pakistan at the FATF (Financial Action Task Force) had failed, and the FATF appreciation for Pakistan was not being absorbed by it, he added.\nAddressing the 17th Convocation of Lahore School of Economics (LSE); a conference organised by Pakistan Academy of Family Physician, and later talking to the media here, he termed indiscriminate firing at the Line of Control (LoC) terrorism, adding that Indian premier Narendra Modi had not only become danger for peace but also for his own country.\nThe governor said that RSS [Rashtriya Swayamsevak Sangh] rogues were killers of minorities in India. He said, “220 million Pakistanis stand by the Pakistan Army. Entire world community is acknowledging Pakistan’s role in elimination of terrorism and establishment of peace.\n“Today Pakistan is becoming cradle of peace in real terms, while America and Britain have declared Pakistan as a safer country for their citizens and people from across the world are coming to Pakistan.”\nChaudhry Mohammad Sarwar said that Prime Minister Imran Khan was taking all possible measures to solve public problems, and Ehsaas programme was an ample proof of his poor-friendly policies.\nHe said that agreements made by the past rulers proved devastating for country’s economy, and the nation and history would not forgive those who signed anti-people agreements, and people would hold them accountable for such agreements. He said that compared with various countries including India, minorities were more independent in Pakistan, and Kartarpur Corridor project was a gift by Prime Minister Imran Khan for the Sikh community the world over.\nThe Punjab governor said that the government, under the leadership of Prime Minister Imran Khan, was taking revolutionary steps in the health sector. “Poor families are being provided free medical facilities worth more than Rs 700,000 each through Sehat Insaf Card, while reforms are being ensured speedily at the public sector hospitals,” he added.\nHe said that transparency and merit were being ensured at every level in education sector, citing that for the first time in Punjab history, the PTI government made appointments of all vice chancellors and other officials on merit, and a reforms committee had also been constituted to resolve the issues of private universities. He was confident that Pakistani universities would soon be among top 500 best universities of the world.",
  "retrievedAt": "2025-08-11T18:50:36.172Z"
}
