{
  "title": "Qureshi terms 2020 year of economic prosperity in country",
  "link": "https://www.app.com.pk/national/qureshi-terms-2020-year-of-economic-prosperity-in-country/",
  "date_published": "2020-02-22T02:43:00.000Z",
  "source": "APP",
  "content": "MULTAN, Feb 22 (APP):Foreign Minister Makhdoom Shah Mehmood Qureshi Saturday said 2020 would be the year of economic prosperity in the country.\nThe country’s economy was improving gradually and the government would provide some good news to the nation very soon, Foreign Minister Makhdoom Shah Mehmood Qureshi expressed these views while talking to people of his constituency at different locations.\nHe said the government was taking concrete steps to control inflation and the hoarders were being dealt with iron hands. It was the first time in country’s history that influentials had undergone accountability process and the incumbent government was committed to retrieve looted money from corrupt mafia, Qureshi claimed.\nThe foreign minister said corrupt mafia was making undue hue and cry in order to keep themselves away from the accountability process.\n“The PTI government will complete its tenure as per people’s mandate. The PTI has emerged as one of the most popular political party in elections 2018,” he said.\nSome people wished mid-term polls or dislodging government but it would remain their wish only. The masses had rejected such people in last general elections, he said.\nHe said India faced humiliation in the meeting of Financial Action Task Force (FATF) as its (India) conspiracies to put Pakistan into blacklist failed. He, however, hoped that Pakistan would be out of grey list soon.\n“Regional peace was the top priority of Pakistan. The peace agreement between America and Afghan Taliban was a big diplomatic victory of Pakistan,” he said adding, “The agreement will not only bring peace in Afghanistan but in whole the region. Pakistan will also continue to play an important role in uplift of Afghanistan. Similarly, trade ties between Pakistan and Afghanistan will also improve.”\nPakistan always voiced that Afghanistan issue could only be resolved through dialogue instead of any use of force.\nDue to certain issues in Afghanistan, Pakistan government had focused on its western border and however, the situation on eastern border was also a bit sensitive, he said and added, no one was expecting that Pakistan could play a vital role for peace between America and Afghan Taliban amid conspiracies by the enemies of the peace process.\nForeign Minister Qureshi said some elements were pointing fingers at Pakistan, now, Pakistan’s role was being acknowledged at international level. He said Pakistan made sincere efforts for peace in the region.\n“Now, it is upto people of Afghanistan and its leadership, how did they move forward towards peace. Pakistan successfully performed its role of facilitator for peace”, he maintained.\nHe said the incumbent government was taking all possible steps to bring revolution in lives of the masses. The government initiated, “Ehsas Programme” to address problems of the poor.\nHe hoped that the masses would find positive results soon.\nOn this occasion, advisor to the chief minister Haji Javed Akhtar Ansari, PTI leader Khalid Javed Warriach, Rana Abdul Jabbar, Syed Babar Shah, Rao Amjid and many others were also present.",
  "retrievedAt": "2025-08-11T18:50:31.871Z"
}
