{
  "title": "Country needs smart solutions to combat current challenges: Education Minister",
  "link": "https://www.app.com.pk/national/country-needs-smart-solutions-to-combat-current-challenges-education-minister/",
  "date_published": "2024-01-15T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):Federal Minister for Education and Professional Training, Madad Ali Sindhi Monday emphasized on adopting smart solutions for addressing the current challenges being faced by the country, matching the pace of the developed countries.\nHe was speaking at the launching ceremony of “Global Education Monitoring Report 2023” arranged by the Ministry of Federal Education and Professional Training in collaboration with UNESCO, EdTech Hub, and ITA.\nMadad Ali said that the current challenges being faced by the country require smart solutions and it is high time that Pakistan matches the pace of the developed countries of the world.\nChairing the event, the minister said that it is heartening to see that Pakistan has recently given high importance to the use of technology in imparting education. “Evaluating technology’s role in imparting education is need of the hour”, he added.\nHe said that the role of technology in reducing the number of out-of-school children in the country is of great significance, which he termed as his top priority.\nHe said that quality of education is another challenge that has been given the highest priority under his command.\nHe said that he has placed special emphasis in ensuring that the schools in the federal area have the basic necessities available to provide a safe, secure and enabling environment to students.\nMadad Ali said that the Ministry of Education was adept in making sure that technology’s benefits can be passed on to the masses in the COVID 19 era.\nHe highlighted the development and launch of teleschool and educational radio channels in the COVID era by the education ministry.\nMadad Ali highlighted the findings of the report which pointed out that technology can also leave behind under privileged students.\nHe said that his ministry will ensure that the use of technology is adapted in such a way that no child is left behind irrespective of his/her background.\nHe said that his ministry will ensure that our learning outcomes and educational programmes will be aligned with technology in such a way that the negative aspects of technology are completely curbed.\nMadad Ali said that he hoped that the fundamental right to education of all children of Pakistan would be guaranteed through the smart use of technology.\nAbout the GEM report, the minister said that this year’s GEM report topic is of utmost importance.\nThe event addressed key questions about technology in education including appropriateness, equity, scalability, and sustainability.\nThe report emphasized evidence-backed technology use, the impact of COVID-19 on education, the digital divide, and the importance of teacher involvement. It commends Pakistan’s efforts but highlights infrastructure gaps and the need for responsible technology integration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:38:18.764Z"
}
