{
  "title": "BISP registration process continues smoothly",
  "link": "https://www.app.com.pk/national/bisp-registration-process-continues-smoothly/",
  "date_published": "2024-01-15T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):The registration process in the National Socio-Economic registry (NSER) Survey of the Benazir Income Support Programme (BISP) is successfully continued across the country through the registration centers established by the Tehsil offices of the programme.\nThis was stated by the Director General, National Socio-Economic Registry (NSER), BISP, Naveed Akbar in a video message released through a social media platform.\nThe DG stated that the citizens, belonging to the low-income groups, can register with the Benazir Income Support Programme through visiting the registration centers opened from Monday till Saturday.\nThey are required to bring Computerized National Identity Cards, B-Forms of children for registration purpose.\nThe citizens are required to bring electricity or gas bills, if have connections, so that we can enter these bills in the database to give any subsidy, if announced by the government in the future, he said.\nThe DG NSER has urged the citizens to provide their accurate data at the time of registration while those who will provide false information will never be allowed to become part of this programme.\nThe citizens having any complaint about the programme can contact the toll-free number 0800-26477 and official social media accounts of BISP. “We are ready to resolve the complaints of the citizens in a shortest possible time”.\nThe DG said, “We encourage not only the poor segments to participate in the survey but also middle class, lower and upper middle class for compilation of their data”.\n“The compilation of their data will help the government provide them any subsidy or facility in the time of any emergency situation in future on the basis of their socio- economic data”, he added.\nThe objective behind this data compilation is not only to provide quarterly cash transfer of BISP but also accommodating the vulnerable population in other subsidy initiatives of the government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:38:18.765Z"
}
