{
  "title": "Anti-Rape Crisis cell established at PIMS",
  "link": "https://www.app.com.pk/national/anti-rape-crisis-cell-established-at-pims/",
  "date_published": "2024-01-15T15:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP): The Ministry of Law and Justice on Monday inaugurated the model Anti-Rape Crisis Cell (ARCC) at the Pakistan Institute of Medical Sciences (PIMS).\nThe cell was established in collaboration with UK Aid, United Nations Populations Find (UNFPA) and Legal Aid Society (LAS).\nThe event was attended by British High Commissioner to Pakistan Ms. Jane Marriot, along with UNFPA Country Director Dr. Luay Shabaneh, Federal Law Secretary Raja Naeem Akbar, Federal Health Secretary Iftikhar Ali Shallwani, Chairperson of the Special Committee on Anti-Rape (Trial and Investigation) Act, 2021 Ms. Ayesha Raza Farooq, PIMS Executive Director Prof. Dr. Rana Imran Sikandar, several senior government officials and members of the civil society.\nThe launch of a model facility such as this signifies the government’s commitment to improve access to justice for survivors of sexual violence under the Anti-Rape (Trial and Investigation) Act 2021 through a coordinated and targeted response mechanism.\nRaja Naeem Akbar thanked the civil society and the British High Commission for collaborating to establish the pilot ARCC in Islamabad.\nHe mentioned that the establishment of this crisis cell is a testament to the dedication of the state and the collaboration of various stakeholders in our ongoing battle against sexual violence.\nMs Ayesha Raza Farooq said, “In essence, the establishment of the Anti-Rape Crisis Cells is not just a legal initiative, it is a comprehensive and unwavering commitment to creating a society free from the shackles of sexual violence where survivors are supported, and justice prevails.”\nProf. Dr. Rana Imran Sikandar committed that the Hospital will provide specialized training sessions for all relevant healthcare officials, such as doctors and nurses on trauma-informed care and the specific needs of sexual violence survivors.\nIftikhar Ali Shallwani stated that the social evils of sexual violence exist in any country around the globe and urged to handle this issue.\nDr. Luay Shabaneh said that rape is a crisis in all facets, be it health, legal or social, which needs to have a collective response.\nHe mentioned that UNFPA has dedicated many of its efforts to prevention. The response has to be coordinated and multi-sectoral, which the ARCC hopes to achieve.\nMs Jane Marriot remarked, “This new anti-rape crisis facility is a strategic innovation that ensures GBV survivors are provided accelerated response services under one roof, and we are proud to have partnered with Pakistan in advancing such an important innovation in tackling violence.”\nThrough this collaborative effort between the federal government and members of civil society, the newly launched ‘Anti-Rape Crisis Cell’ at PIMS is all set to provide well-rounded medical, legal and social services to survivors of sexual and gender-based violence.",
  "retrievedAt": "2025-08-10T23:37:42.524Z"
}
