{
  "title": "Opposition should call off long march due to critical situation of coronavirus: Dr Yasmin",
  "link": "https://www.app.com.pk/national/opposition-should-call-off-long-march-due-to-critical-situation-of-coronavirus-dr-yasmin/",
  "date_published": "2021-03-11T16:24:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 11 (APP):Punjab Health Minister Dr Yasmin Rashid on Thursday said the nation was unable to face any long or short march due to the critical situation of coronavirus and the third wave of COVID-19 was a big challenge for the country.\nAddressing a press conference here, the minister said the government had to impose some restrictions due to the new dangerous wave of the Coronavirus in the country.\nShe said the long march organisers should realise that the nation was already in trouble, adding that the opposition should avoid gathering and SOPs should be followed.\nTo a question, she said that the entire world was facing price hike and food shortage due to the pandemic.\nTo another question, the minister said there were no side effects of the coronavirus vaccine and the citizens could be protected from the pandemic by getting vaccinated.\nShe said that all senior citizens of age 60 or above should be registered themselves by sending their CNIC number to 1166 for vaccination.\nThe minister informed that as soon as the vaccine was injected, antibodies started to generate in the body and the human got protected from the Coronavirus pandemic.\nShe said that the next phase vaccination would be injected to the citizens of age 55 and above.\nShe said that rules and regulations for import of the vaccine by the private sector had been finalised in the meeting of National Command Operation Centre (NCOC) held on Wednesday.\nShe said that vaccination process was ongoing at all vaccination centres established by the government without any discrimination.\nTo another question, the minister said that so far only the government had imported vaccine.\nShe said that the private sector played a prominent role in the peak period of coronavirus.\nThe minister said that as many as 2109 new cases of coronavirus were reported during the last 24 hours in the province and total 180,944 cases of COVID-19 had been reported in the province.\nShe said that the ratio of new cases of coronavirus had been increased to 6 per cent in Punjab so the NCOC had to decide additional restrictions including closure of schools in 7 more effected cities.\nShe informed that ratio of the coronavirus cases in Gujranwala had reached 9 per cent, Lahore 8, Rawalpindi 4, Multan 8 and 6 per cent in Faisalabad.\n“After the second wave of the corona pandemic, 1,045,484 contact tracing were made and average 20 persons in the circle of each positive case have been tested,” she added.\nThe minister said that 70 per cent cases in Lahore, Gujrat and Rawalpindi were found affected with the new British form of the virus which was more dangerous than Wuhan virus.\nShe urged the public to strictly follow the SOPs to avoid the third wave of the pandemic.\nP&SHD Secretary Captain (retired) M Usman Younis also addressed the media and gave the details about the vaccine.",
  "retrievedAt": "2025-08-11T20:28:25.107Z"
}
