{
  "title": "Expansion of education stipends for secondary schools on the cards",
  "link": "https://www.app.com.pk/national/expansion-of-education-stipends-for-secondary-schools-on-the-cards/",
  "date_published": "2021-03-11T12:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):Special Assistant to the Prime Minister on Social Protection (SAPM) Dr. Sania Nishtar on Thursday said that the government is considering to expand EHSAS education stipend for secondary school students.\nPrimarily, because of the issue of 18.7 million out of school children in the country coupled with high rate of dropouts at the secondary school level, extension of primary education conditional cash transfer (CCT) programme, Waseela-e-Taleem Digital to the secondary level is strongly needed, said Dr. Sania.\nAccording to the Press Release, she said, there is a high probability that income losses due to COVID-19 may have caused a substantial increase in dropouts, said a news release.\nFor the purpose of tackling this issue, a pilot will be rolled out in federally administered areas to serve the un served area of secondary education. Further, to expand it nationwide, an integrated mechanism will be devised in coordination with provincial education departments to co-finance the secondary education CCT with provinces to avoid duplications, she added.\n“Ehsaas secondary education CCT will help disadvantaged families to overcome financial barriers to access secondary education. The programme will be structured in line with Ehsaas Stipends policy which allows doling out higher stipend amount for girls as compared to boys. The prime objective is to encourage parents to send their daughters to schools and support them to achieve secondary education”, said SAPM Dr. Sania Nishtar.\nTo catalyze action in the right direction, the design will be finalized in consultation with Ehsaas Education CCT Steering Committee. Following that, it will be taken to the board for necessary approvals and pilot roll out.\nEducation Conditional Cash Transfers (CCTs) are an important element of Ehsaas and are included in the Ehsaas strategy as Policy #73 ‘Education CCTs’. Education CCTs not only socially assist vulnerable households but also reduce the number of out of school children.\nAccording to Household Income and Expenditure Survey (1990-2018), the enrollment trends in primary and secondary education for both boys and girls indicate that girls are heavily disadvantaged in initial enrollment levels for poorest quintile, and they drop out faster from grades 5-8.\nUnder Ehsaas framework, the massively reformed Waseela-e-Taleem Digital programme benefits children of poorest families with conditional cash grants amounting Rs. 1,500 for boy child and Rs. 2,000 per quarter for girl child on fulfillment of 70% attendance in primary schooling. The Rs. 80 billion programme will bring 5 million deserving primary school children into its fold from across all 154 districts of Pakistan over a 4- year duration.\nHowever, the opportunity costs of schooling continue to rise with age and are much higher after 10 years of age. In rural areas declining trend increases after grade 5 and in urban areas dropout rises after grade 10 but with different reasons.\nIt is envisaged that the secondary education CCT, once launched under the umbrella of Ehsaas will reduce disparities in educational opportunities by raising secondary school attendance, enrollment, and the school progression among out of school children particularly girls.",
  "retrievedAt": "2025-08-11T20:28:26.584Z"
}
