{
  "title": "Senate to elect chairman, deputy chairman in a close contest on Friday",
  "link": "https://www.app.com.pk/national/senate-to-elect-chairman-deputy-chairman-in-a-close-contest-on-friday-2/",
  "date_published": "2021-03-11T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):  The Senate would elect its new chairman and deputy chairman in a close contest on Friday as there was a narrow margin in the numerical strength of Senators belonging to the government and its allies and the opposition parties.\nCandidates for two of the highest constitutional posts will be elected through secret ballot after oath-taking of 48 new members of the Upper House of Parliament elected on March 3.\nIn the election for Senators in the National Assembly and provincial assemblies, Pakistan Tehreek-e-Insaf (PTI) emerged as the single largest party in Senate with 26 members.\nPakistan People’s Party Parliamentarians (PPPP) at present has 20 seats while 18 Senators belong to Pakistan Muslim League Nawaz (PML-N), Balochistan Awami Party (BAP) has 12 Senators, Independents 6 and Jamiat Ulema-e-Islam Fazal (JUI-F) and Muttahida Qaumi Movement Pakistan (MQM) had three Senators each.\nThe government and opposition candidates on Thursday obtained nomination papers from the Senate Secretariat for the elections of Chairman and Deputy Chairman.\nAccording to officials, leader of the House in Senate Dr Shahzad Waseem received the nomination papers on behalf of Sadiq Sanjrani and Mirza Muhammad Afridi.\nSenator Sherry Rehman received the papers on behalf of Yousaf Raza Gillani, while Maulana Abdul Ghafoor Haideri, who would be contesting for the slot of Deputy Chairman, obtained the papers on his own.\nSadiq Sanjrani and Yousaf Raza Gillani will contest for the slot of Chairman Senate. Maulana Abdul Ghafoor Haideri and Muhammad Afridi would challenge each other for the post of Deputy Chairman.\nMinister for Information and Broadcasting Senator Shibli Faraz informed in a tweet that Prime Minister Imran Khan had nominated Senator Mirza Muhammad Afridi for the post of Deputy Chairman Senate, giving representation to erstwhile Federally Administered Tribal Areas.\nAccording to the Senate Secretariat, the session would start in the morning for oath-taking of the newly elected senators after which the session will be adjourned.\nAfter the adjournment of the session, nomination papers for the chairman and deputy chairman would be submitted.\nLater, the session would resume in the evening the same day to elect the chairman and deputy chairman. Names of the candidates would be announced during the session and later a secret ballot will be held.\nAfter announcement of the winners, new Chairman Senate and Deputy Chairman will take the oath.",
  "retrievedAt": "2025-08-11T20:28:25.171Z"
}
