{
  "title": "Advance technological equipment, capacity building of departments imperative to contain GLOF risk: CM GB",
  "link": "https://www.app.com.pk/national/advance-technological-equipment-capacity-building-of-departments-imperative-to-contain-glof-risk-cm-gb/",
  "date_published": "2021-03-11T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):Chief Minister Gilgit Baltistan (GB) Muhammad Khalid Khurshid Khan Thursday said it was imperative to provide advanced technological paraphernalia and capacity building to public departments for containing glacial lake outburst flood (GLOF) and other disasters.\nThe country despite its negligible contributions to global green house gas emissions (GHGs) was bearing the brunt of environmental degradation and was also amongst top 10 vulnerable countries due to climate change, he said addressing the 4-day workshop on Disaster Risk Management under the auspices of GLOF-II project in collaboration with the UNDP and Ministry of Climate Change.\nThe Chief Minister said there was no industry in GB whereas it was facing the worst impacts of environmental degradation in the form of temperature rise and GLOF.\n“The number of glacial lakes has rapidly increased due to visible environmental degradation which is alarming. GB is home to the largest glaciers after North and South Poles whereas fast melting of its glaciers will wipe out the entire region as our lush green pastures rely on this snow,” he added.\nKhan said threat identification was the core of disaster risk management and its impact mitigation endeavours. “We are mitigating climate change and temperature rise through plantation under the Prime Minister’s vision of 10 Billion Tree Tsunami. It is the only natural course for mitigation.”\nHe emphasised that there was need to improve technology for early warning of GLOF, in time preparedness and response measures.\nAdditional Secretary Ministry of Climate Change Jodat Ayaz said the training workshop was a joint step to develop resilience among the public partners involved in disaster management and local communities against impending GLOF and other calamities.\nThe shift in global temperature had caused a half degree rise in Pakistan’s indigenous temperature incurring shift in weather pattern resulting GLOF and other associated natural disasters, he added.\nAyaz said the stakeholder team was fully on board and swift implementation of GLOF-II project would be ensured.\n“A complete module of Disaster Risk Management has been prepared and will also help in guiding all partners for better response and preparedness against disasters,” the Additional Secretary said.\nThe GLOF-II project funding of US$36 million was difficultly achieved through the United Nations Green Climate Fund owing to huge resistance of India which was a great accomplishment of the country’s representatives in the UN, he added.\nHe also lauded the role of Pakistan Meteorological Department (PMD) team constantly monitoring the glacial lake formed at the Shisper glacier. He lauded their efforts for successful installation of automated weather monitoring station at the Shisper Glacial site where a recent glacial lake was found.\nThe Ministry of Climate Change and United Nations Development Programme (UNDP) collaborated exercise imparted training to 150 individuals from various public departments of GB and Khyber Pakhtunhkwa (KP) also including some community members.\nThe participants appreciated the training module and termed the workshop a great platform for experience sharing and grasping best practices augmenting response capability to any disaster.\nThe participants were presented appreciation certificates whereas the Chief Ministers and other dignitaries were presented mementoes at the end of the workshop.",
  "retrievedAt": "2025-08-11T20:28:32.697Z"
}
