{
  "title": "Health experts for timely diagnosis of kidney diseases",
  "link": "https://www.app.com.pk/national/health-experts-for-timely-diagnosis-of-kidney-diseases/",
  "date_published": "2021-03-11T09:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):Health experts Thursday said that persons at high risk for kidney diseases should consult their doctors to protect them from further medical complications, advising them for timely diagnosis.\n“People with early-stage kidney disease usually have no symptoms and any delay in kidney test can lead to severe medical complications,” they said on the occasion of World Kidney Day.\nThey claimed that Chronic Kidney Disease (CKD) is rapidly growing in Pakistan due to late diagnosis, kidney stone disease and an increasing number of patients suffering from diabetes and high blood pressure.\nThey said that Pakistan ranks at number eight in the list of countries with a high rate of kidney diseases, with 17 million people suffering from such diseases.\nDr Syed Farhat Abbas, Consultant Nephrologist at Shifa International Hospital (SIH) said on Thursday that kidney patients should keep their blood pressure on the lower side and manage blood sugar levels, also they should reduce salt intake and moderate protein consumption.\nDr Syed Nayer Mahmud, Consultant Nephrologist at SIH said that to protect kidney health, people should know their risks. If one has diabetes or high blood pressure, or a family history of kidney failure, they are at higher risk of kidney problems.\nDr Danyal Hassan, Consultant Nephrologist at SIH said that kidneys serve a vital role by filtering waste and excess fluid from the blood and maintaining a healthy balance of water, salts, and minerals.\nHe said that stone disease is a common cause of chronic kidney disease and drinking 2-3 liters of boiled or filtered water is the key to prevent stone formation.\nDr Kiran Khurshid and Dr Momena Manzoor, Consultant Nephrologists at SIH said that those who are suffering from end-stage kidney disease should be careful about the risk of acquiring hepatitis and other blood-borne infections from dialysis machines and advised them to choose dialysis unit where proper sanitation is done.\nDr Fareeha Khalil, Associate Consultant Nephrologist at SIH advised that normal people should take care of their kidneys by exercising, weight control and balanced diet, stay hydrated, cholesterol levels maintenance, avoid painkillers, get annual physical checkups, and know their family medical history.",
  "retrievedAt": "2025-08-11T20:28:34.227Z"
}
