{
  "title": "FM urges int’l community to hold India accountable for human rights violations in IIOJK",
  "link": "https://www.app.com.pk/national/fm-urges-intl-community-to-hold-india-accountable-for-human-rights-violations-in-iiojk/",
  "date_published": "2020-12-10T08:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):Foreign Minister Makhdoom Shah Mehmood Qureshi on Thursday called on the international community to take note of the atrocities being committed by Indian occupation forces in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), hold India to account and review engagement with it.\nHe was speaking at a panel discussion held here at the Ministry of Foreign Affairs here on the plight of women in the IIOJK, to mark the International Human Rights Day.\nThe foreign minister highlighted the human rights and humanitarian dimension of the Kashmir issue in the context of the Universal Declaration of Human Rights and underlined the need to project the plight of the Kashmiri people.\nHe said India should be urged to fulfill its human rights obligations, a press release issued by the Ministry of Foreign Affairs said. Foreign Minister Qureshi also reaffirmed Pakistan’s unwavering solidarity with the people of IIOJK, including the women.\nBesides the foreign minister, the talk was attended by Foreign Secretary Sohail Mahmood, parliamentarians, members of the diplomatic corps, representatives of non-governmental organizations and the think tank community.\nPanelists included human rights activist Mushaal Hussein Mullick; former Minister for Social Welfare and Women Development of Azad Jammu & Kashmir Farzana Yaqoob; Parliamentary Secretary for Foreign Affairs Andaleeb Abbas as well as Parliamentary Secretary for Law and Justice Barrister Maleeka Bukhari.\nDirector General Kashmir Cell Sadia Altaf Qazi hosted the event.\nDiscussions focused on the atrocities being committed against women in the IIOJK by the Indian occupation forces and the physical, psychological, social and economic ramifications of these actions. Psychiatrist Dr Asma Humayun dilated upon the mental health aspect of the situation.\nDuring the event, participants were shown documentaries and first-hand accounts of human rights abuses being perpetrated against the women of the IIOJK.",
  "retrievedAt": "2025-08-11T20:07:36.356Z"
}
