{
  "title": "Asad Umar steps down as PTI’s Secretary General, Core Committee member",
  "link": "https://www.app.com.pk/national/asad-umar-steps-down-as-ptis-secretary-general-core-committee-member/",
  "date_published": "2023-05-24T18:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):Pakistan Tehreek-e-Insaaf (PTI) Secretary General Asad Umar on Wednesday, while strongly condemning the May 9 riots, announced his resignation from the party position and membership of the Core Committee.\nAddressing a press conference, he said after the tragic events of May 9, it was not possible for him to keep the leadership positions in the party.\n“I am quitting as the party’s Secretary General as well as members of its Core Committee,” he added.\nAsad Umar said what happened on May 9, was a matter of concern, and all parties should play their role to get the country out of the current situation.\nHe said there was no pressure on him and its was his personal decision to tender resignation from the post of Secretary General and the membership of the Core Committee.\nHe said everyone condemned the attacks on the state institutions on May 9. Such attacks on sensitive installations were very dangerous acts, he added.\nHe said the strong army was the guarantor of the country’s defence and security. If the Pakistan Army were not strong, Pakistan’s situation would not have been different from Iraq, Palestine, Lebanon and Syria.\nAsad Umer said the May 9 incidents should be investigated transparently and those found involved in them should be prosecuted. He called for immediate release of the innocent people arrested in the wake of rioting and arson on the tragic day.\nHe said there were five major stakeholders of Pakistan, including judiciary, army, PTI, PDM (Pakistan Democratic Movement) and the people.\nHe urged all parties to sit together and find an amicable solution of financial and political crises through negotiations, so that the people who had been facing inflation and unemployment for the last 13 months, could be provided some relief.",
  "retrievedAt": "2025-08-11T08:32:53.747Z"
}
