{
  "title": "Experts highlights significance of Youm-e-Takbeer",
  "link": "https://www.app.com.pk/national/experts-highlights-significance-of-youm-e-takbeer/",
  "date_published": "2023-05-24T18:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): A number of former renowned diplomats and experts on Wednesday highlighted the significance of Youm-e-Takbeer and paid tribute to the political leadership, scientists, engineers and others for achieving the historic milestone in the nuclear capability and technology.\nThe Arms Control & Disarmament Centre (ACDC) at the Institute of Strategic Studies Islamabad (ISSI) organized a seminar on “25 Years of Youm-e-Takbeer: Promoting Peace, Stability, and Development,” a press release said.\nDirector General ISSI, Sohail Mahmood said that Youm-e-Takbeer was always an occasion for national pride as well as thanksgiving.\nHe paid rich tributes to the leaders, scientists, engineers, technicians, security personnel, strategists and diplomats who had made invaluable contributions over the decades in Pakistan’s nuclear journey.\nHe said Pakistan’s nuclear programme, supported by complete national consensus, remained the bedrock of their impregnable national security and an invaluable source for accelerated socio-economic progress.\nIn the 25 years since crossing the Rubicon, Pakistan had maintained a robust operationalized deterrent capability accompanied by an impeccable nuclear safety and security regime.\n“Pakistan’s credentials as a responsible nuclear state has been reinforced internationally,” he added.\nMalik Qasim Mustafa, Director ACDC-ISSI, said Pakistani nation commemorated “Youm-e-Takbeer” as a day when it conducted nuclear tests and restored the balance of power in South Asia.\nPakistan’s nuclear capability has not only augmented national security but had ensured survival against aggression by a large and more powerful adversary, India, he said, adding Pakistan had pursued peace, stability and development through its nuclear programme.\nLt. Gen. (Retd) Khalid Kidwai, Advisor, National Command Authority, and former DG, Strategic Plans Division (SPD), in a special message paid tribute to the founding fathers of Pakistan’s nuclear programme in the political, scientific, strategic and diplomatic fields.\nHe said Pakistan’s deterrence capabilities were well-balanced and comprised of a triad of land, air and sea forces, which operated under the umbrella of a strong command and control system.\nHe said Pakistan’s nuclear project had delivered in all areas of national endeavour.\nDr Ansar Parvaiz, former Chairman Pakistan Atomic Energy Commission (PAEC), speaking on “Peaceful Applications of Nuclear Technology in Pakistan” highlighted the technological strides that Pakistan’s peaceful nuclear programme had made.\nHe also talked about the tremendous contributions of nuclear technology in the fields of health, agriculture, energy and industry.\nFour centers in the agriculture sector helped improve crops yield, crops resistant to drought and pests, efficient management of water resources, and food preservation.\nHe said that 19 cancer hospitals operated by PAEC were working on the diagnostic and treatment of cancer across the country.\nMuhammad Kamran Akhtar, Additional Secretary, ACDIS and PP/PD, MOFA, highlighted Pakistani scientists and the contribution of engineers to socio-economic development through peaceful uses of nuclear technology.\nHe said that the focus of Pakistan’s nuclear diplomacy was manifold.\nThe seminar was followed by a question and answer session. The seminar was attended by a large number of eminent former diplomats and servicemen, member of diplomatic corps, academics, area study experts, practitioners, and university students.",
  "retrievedAt": "2025-08-11T08:32:54.868Z"
}
