{
  "title": "Saudi ambassador commends ‘Road to Makkah’ project for easing pilgrims’ journey",
  "link": "https://www.app.com.pk/national/saudi-ambassador-commends-road-to-makkah-project-for-easing-pilgrims-journey/",
  "date_published": "2023-05-24T15:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): Saudi Ambassador Nawaf bin Said Al-Malki, in a significant development, praised the ‘Road to Makkah’ project as a remarkable initiative that has brought immense relief to the intending pilgrims.\nSpeaking exclusively to APP, the ambassador expressed his gratitude to King Salman bin Abdulaziz and Crown Prince Muhammad bin Salman for launching this highly efficient facility.\nThe project aimed at enhancing the ease and comfort of intending pilgrims from seven countries, namely Pakistan, Morocco, Bangladesh, Malaysia, Indonesia, Turkey, and Ivory Coast, he added.\nHighlighting the meticulous management of the project, the ambassador revealed that it was closely supervised by Saudi Minister for Interior Prince Abdulaziz bin Saud.\nHe further announced that this year alone, 26,000 pilgrims would benefit from the service provided at the Islamabad International Airport. Notably, the immigration process would be completed in Islamabad, saving valuable waiting time at the Saudi airports, he maintained.\nExpressing optimism, Ambassador Al-Malki also shared his hopes for the expansion of this exceptional facility to other major cities in Pakistan, including Lahore and Karachi, by next year adding that such an expansion would further streamline the journey of intending pilgrims and contribute to their overall experience.\nPraying for the stability and prosperity of Pakistan, the ambassador conveyed his belief that the nation would rise to become a global leader in the coming years as these words of encouragement further solidify the strong bond between Saudi Arabia and Pakistan.\nIn a related development, Saudi Press Attaché Dr. Naif Al-Otaibi took to Twitter to share a video clip showcasing the dedicated staff members of the ‘Road to Makkah’ project from Saudi Arabia.\nہمارے پاکستانی بھائیوں کے لیے حج کے طریقہ کار کو آسان بنانے کے لیے اسلام آباد ایئرپورٹ سے (مکہ روڈ) اقدام کا آغاز\nاللہ کے فضل وکرم سے #طريق_مكة #Makkah pic.twitter.com/ddI4qAoXDP\n— Dr. Naif Alotaibi (@Dr_Naif777) May 22, 2023\nThe clip highlighted the team leader’s instructions to greet intending pilgrims with warm smiles and gentle hospitality.\nStressing the importance of performing their duties with honesty and devotion, the team leader emphasized that their selfless service to the intending pilgrims would be rewarded by the Almighty.\nThe arrival of intending pilgrims at the Islamabad International Airport has been marked by a heartwarming gesture: a warm welcome and the presentation of garlands. This kind and affectionate reception from the Saudi staff members have multiplied the love and admiration for Saudi Arabia in the hearts of the pilgrims embarking on their spiritual journey.\nThe ‘Road to Makkah’ project has undoubtedly emerged as a game-changer, offering a streamlined and comfortable experience to the intending pilgrims. With its successful implementation and plans for future expansion, it stands as a testament to the strong commitment of Saudi Arabia to facilitate and support the spiritual journey of Muslims worldwide.",
  "retrievedAt": "2025-08-11T08:33:01.438Z"
}
