{
  "title": "RFI releases documentary on urgency of Int’l finances for damages of Climate Change",
  "link": "https://www.app.com.pk/national/rfi-releases-documentary-on-urgency-of-intl-finances-for-damages-of-climate-change/",
  "date_published": "2023-05-24T18:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): As the second international meeting on finance mechanism to address loss and damages of climate change starts in Bonn, Germany (25-27 May 2023), thousands of Pakistan flood victims are still struggling to rehabilitate their lives and livelihoods.\nAt this crucial juncture, Resilient Future International and Sujag Sansaar Organization have launched a documentary, ‘Voices for Climate Justice: Loss and Damage Fund Now ‘  on YouTube to remind the participants of the Bonn meeting and the wider world about the urgency of finances for the loss and damage of climate change.\nDetails of the Bonn meeting are available at the UN website Second meeting of the Transitional Committee (TC2) | UNFCCC, a news release said.\nThe finance mechanism (called Loss and Damage Fund) was a major outcome of the last international UN Conference on Climate Change (COP27) at Sharm El Sheikh, Egypt Nov 6-Nov 18, 2022.\nIt has already taken 31 years for this demand to find a place in the UN climate negotiations as the climate-vulnerable countries have been demanding the Loss and Damage Fund since 1991.\nAftab Alam Khan, CEO of Resilient Future International stated, “ Every passing day increases the agonies of climate change victims. The documentary shows how young girl students, heart patients, pregnant mothers, smallholder farmers and local merchants are still facing the impact of the 2022 floods.\nThe Loss and Damage Fund was a welcome step at COP27 but its success would depend upon how soon the Fund becomes operational and its finances reach the victims of climate change”.\nThe documentary is available onYouTube: https://www.youtube.com/@resilientfutureinternation1273",
  "retrievedAt": "2025-08-11T08:32:55.383Z"
}
