{
  "title": "Legislators call PTI non-democratic party losing fabricated political mandate",
  "link": "https://www.app.com.pk/national/legislators-call-pti-non-democratic-party-losing-fabricated-political-mandate/",
  "date_published": "2023-05-24T16:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):The members of the Parliament on Wednesday termed the Pakistan Tehreek-e-Insaf (PTI) a non-democratic party being established on the personal whims of the few chosen which was losing its fabricated political mandate.\nMember National Assembly (MNA), Salahuddin of Muttahida Qaumi Movement-Pakistan (MQM-P) said the incidents that took place on May 9th in Lahore, Rawalpindi, and the rest of the country were highly condemnable and tantamount to 9/11 attacks that occurred in the US.\nHe said the US and UK were much more democratic than us and they took to task such events and established such courts for a brief period of time.He added that it was also important for this government to establish these courts to trial these elements that attacked state and public installations.\nThe PTI workers and MNAs who were quitting their party were doing so as it was not a democratic and political party and was created on the personal whims of a few. He alleged that the PTI was created by turncoats of different parties.\nSalahuddin said that was why they (PTI runaways) could not bear the hardships of jails and detentions. “I have 40 years of political career and my party leaders and workers and their families faced many problems and bore the losses of their loved ones. Politics is not a bed of roses and one has to bear all that it gives for one’s cause and ideology.”\nMNA, Nisar Ahmed Cheema of PML-N said the misguided people of PTI who have no role in the May 9th violence should separate themselves from PTI and those who have separated themselves should be allowed to work to promote democracy.\nCheema said the party leaders who have no role in the violence should exhibit courage and bravery and should not shy away from hardships as the political parties face rainy days.“PTI is not a democratic party and had no attitude like that of democratic parties. PML-N witnessed detentions and difficult times but none of its leaders left the party but rather stood firm like a rock,” he added.\nMNA, Shakila Luqman of PML-N said the PTI leaders were leaving the party on their own will and no one was forcing them. “The state installations and public buildings were vandalized, and metro buses were set ablaze. There is no precedent to such violence in our history and such events are very rare and those involved in these accidents should be terminated and taken to task strictly as per their violation according to the law,” he said.\n“Shireen Mazari and Fayyaz Ul Hassan Chouhan who were important leaders of PTI and also its ministers have exposed the party and their leadership for perpetrating those attacks. There is no doubt left about it,” she added.The country has strong institutions and the PTI attacks on defense institutions needed to be probed, she said.\nSenator, Haji Hedayatullah of Awami National Party (ANP) said the PTI leaders leaving their party were the opportunists who drifted away from their party after facing problems and threats.“Imran Khan resented that his workers were leaving but his party members have left in the same way as the party was created. Our party ANP is the only party who had a history and created such workers and leaders who set great examples. When Bacha Khan used to go to jail then thousands of people used to go along with him,” he said.\nHedayatullah said if the leader sets the example and goes to jail then it motivates the workers, adding, “Many of the people of our party have faced detentions like Bacha Khan went to jail for 37 years, Wali Khan 15 years, and similarly Asif Zardari of PPP faced detentions. We burnt ourselves but did not burn the country.”\nHe added that his party opposed the harassment of party leaders as in 2018 what PTI did after carrying MPs in Jehangir Tareen’s Plane to join PTI.“Our delegation under the leadership of the Chairman Senate visited Jinnah House, it gave a very dark and gloomy picture, the clothes of children had been burnt even which was unfortunate,” he said.\nMNA, Naz Baloch of Pakistan Peoples Party Parliamentarians (PPPP) said the PTI created an environment of terror and attacked the military installations and there was no precedent of such violence by any political party.The PTI has been exposed as their audios got leaked exposing their dangerous designs stating the directions of party leaders to workers to attack state installations, she said.\n“Imran Khan is not the red line but rather Pakistan and its security whosoever attacks Pakistan and its security, he will be taken to task with iron hands.”MNA, Maulana Abdul Akbar Chitrali of Muttahida Majlis e Amal Pakistan (MMAP) said the PTI turncoats were the venom of the system and these people caused the failure of all governments.\n“These people sit in the cabinet of those governments and their loyalty to the state was suspicious as they used to switch parties to achieve their personal motives,” he added.MNA, Ahmed Hassan Dehar of Pakistan Tehreek-e-Insaf said when a political leader realizes that he was standing with a country’s enemy party that had connections with inimical forces then was not suitable to stay with such leadership who was also responsible for the financial crunch in the country.\n“We cannot be traitors of the country and continue to stand with the poor masses and fight for their rights,” he added.He queried Imran Khan, “Is it just in a democracy that you take a U-turn on cipher controversy, post bureaucracy by taking bribes, make false claims of health reforms, education reforms, and Police reforms, and start victimizing opposition?\nHe said the Defence Minister’s suggestion to ban PTI was very less and it should be trialed under Article 6. He said PTI attacked the state installations which was equal to enmity with the country.",
  "retrievedAt": "2025-08-11T08:32:57.294Z"
}
