{
  "title": "Analytical thinking, enhanced school enrollment a must for Pakistan to join highly competitive world: President",
  "link": "https://www.app.com.pk/national/analytical-thinking-enhanced-school-enrollment-a-must-for-pakistan-to-join-highly-competitive-world-president/",
  "date_published": "2023-05-24T09:15:00.000Z",
  "source": "APP",
  "content": "TAXILA, May 24 (APP): President Dr Arif Alvi on Wednesday emphasising the promotion of analytical thinking, said that the highly competitive world necessitated Pakistan to enhance access to education and enrollment in schools.\nThe president, addressing the first convocation of HITEC Institute of Medical Sciences, said Pakistan was faced with a crisis of 27 million out school children. He said comparatively, the ratio of children’s school enrollment in India and Bangladesh stood at 98-100 percent.\nHe told the gathering that through a dedicated focus on education and health sectors, Pakistan could excel within eight years, citing the case study of China.\nThe president, who earlier distributed medals and degrees among the graduates of medicine and dentistry, said the country could not afford the women giving up the career after getting higher education and called it a “tremendous wastage”.\nHowever, he said it was incumbent upon the state to provide the women a safe working atmosphere as the institutions like Federal Mohtasib were already functioning for the purpose.\nHe said in Pakistan, only nine percent youngsters enroll for higher education which needed to be increased by introducing modern education tools like online education.\nCiting nine percent prevalence of hepatitis and 40 percent stunting, the president said the country direly needed workforce to cope with the challenge.\nHe urged the new graduates to focus more on preventive care as Pakistan could not afford the curative treatment. Pakistan has already acheieved remarkable success during the COVID pandemic by promoting preventive methods, he recalled.\nCalling it a beautiful culture of Pakistan, President Alvi advised the youngsters to always remain thankful to their teachers and patents for their efforts to brighten their future.\nHe said obtaining the degree was just an opening of the door to knowledge as the new trends and innovations were being introduced in the medical field particularly after the artificial intelligence.\nHe predicted that within a span of ten years, the AI would enable the display of human thought within no time as tremendous knowledge already existed in the cloud technology.\nHe also adviaed the new graduates to never let greed overpower their humanity and that they should always be compassionate to their patients in accordance with Islamic as well as the cultural values.\nEarlier, Principal of HITEC Institute of Medical Sciences Professor Major General (retd) Hamid Shafiq congratulated the students and their parents over the graduation.\nHe said that starting in 2016, the Instutute was counted among the A Grade medical colleges of the country.\nHe said the Institute had also obtained the ISO certification, providing high standard education to the students as well as the house job facility to them after the graduation.\nPrincipal HITEC Dental College Dr Irfan Shah said that with the convocation, the seven years long efforts have come to the fruition.\nHe said the college was now a well established institute with certain distinctions including the top ranking by Pakistan Medical and Dental Council.\nHe said besides studies, the college was also actively engaged in the social welfare works by providing dentistry services to the people living in the suburbs.",
  "retrievedAt": "2025-08-11T08:33:06.171Z"
}
