{
  "title": "Pakistan calls for end to “inhumane” blockade of Gaza; UN’s role for ceasefire",
  "link": "https://www.app.com.pk/national/pakistan-calls-for-end-to-inhumane-blockade-of-gaza-uns-role-for-ceasefire/",
  "date_published": "2023-10-12T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): Pakistan on Thursday strongly condemning the indiscriminate use of force by Israeli authorities in Gaza, called for an end to the “inhumane” blockade causing the humanitarian situation, besides urging the United Nations’ proactive role in facilitating a ceasefire.\n“We are deeply concerned about the fast-deteriorating and dire humanitarian situation in Gaza due to the inhumane blockade and collective punishment by Israeli forces. The decision to cut off electricity, fuel and water supplies is unjust and should be reversed, as it would severely impact the lives of the Palestinians residing in the enclave,” Foreign Office spokesperson Mumtaz Zahra Baloch said in her weekly press briefing.\nShe said the unprecedented gravity of the situation demanded urgent intervention by the international community.\n“We urge the United Nations to play a proactive role in facilitating a ceasefire to alleviate the deteriorating humanitarian situation in Gaza,” she said.\nShe called upon Israel to bring an immediate end to its campaign of indiscriminate bombing against the people of Gaza.\n“It should fulfill its obligations as an occupying power under international law, lift the blockade and allow unhindered access to humanitarian aid to the Palestinian people,” the spokesperson remarked.\nShe said the current cycle of aggression and violence was a sad reminder and a direct consequence of over seven decades of illegal foreign occupation, aggression, and disrespect for international law, including UNSC resolutions that recognized the inalienable right to self-determination of the Palestinian people.\nPakistan has been constantly warning against serious consequences of Israel’s escalatory and provocative actions in recent months, she added.\nSpokesperson Baloch called for the international community’s role for a just, comprehensive, and lasting two-state solution with a viable, sovereign and contiguous State of Palestine on the basis of pre-1967 borders, with Al Quds Al-Sharif as its capital.\nShe told the media that Pakistan’s Permanent Mission to the OIC in Jeddah was in consultation with other member countries of the OIC and discussions are ongoing with respect to a special meeting of the OIC with regards to the current situation in occupied Palestinian territories.\nApprising the media men of the diplomatic engagements during the last week, the spokesperson mentioned\nForeign Minister Jalil Abbas Jilani’s participation in the 27th Meeting of the Council of Foreign Ministers of the Economic Cooperation Organization (ECO) in Azerbaijan.\nBesides addressing the event, he also held bilateral meetings on the sidelines with foreign ministers of Azerbaijan, Türkiye and Uzbekistan as well as the Secretary-General of ECO, Khusrav Noziri.\nMoreover, she said OIC’s Assistant Secretary General (Political) and the Special Envoy for Jammu and Kashmir Yousef Aldobeay was on an official visit to Pakistan and called on Foreign Secretary Muhammad Syrus Sajjad Qazi and held detailed discussions with Additional Foreign Secretary (United Nations) Ambassador Syed Haider Shah.\nThe meeting with Prime Minister Anwaar-ul-Haq Kakar, the foreign minister and Senate Standing Committee on Foreign Affairs were also on his agenda besides undertaking a visit to Azad Jammu and Kashmir.\nHighlighting the situation in the Indian Illegally Occupied Jammu and Kashmir, the spokesperson told the media that on October 5, 2023, the Indian occupation authorities banned the Jammu & Kashmir Democratic Freedom Party (JKDFP) for a period of five years. The JKDFP is the fourth Kashmiri party banned under the Unlawful Activities (Prevention) Act (UAPA) after the Jammu & Kashmir Liberation Front, ‘Jamaat-e-Islami Jammu and Kashmir’, and ‘Dukhtaraan-e-Millat.’ The party is led by Shabir Shah, who remains imprisoned since 2017. Shah has spent more than half of his 70-year life in detention.\nThe spokesperson also informed the media men of the prime minister’s upcoming visit to China to participate in the ‘Third Belt and Road Forum (BRF) for International Cooperation’, being held in Beijing from October 17-18, 2023.\nHe will hold bilateral meetings with President Xi Jinping and senior Chinese leaders and with a number of leaders attending the Forum, besides interacting with leading Chinese entrepreneurs.\nTo a question, the spokesperson said India as the host of the World Cup had the responsibility to provide seamless security for Pakistan’s cricket team and officials who were in India for the World Cup. Regrettably, she said Pakistani sports presenter Zainab was intimidated through the registration of an FIR against her on the basis of some attributed tweets made several years ago.\nWith regards to visas, Pakistan has remained in contact with the Indian authorities and had impressed on them to issue visas to all Pakistani journalists who have been accredited by the ICC and to Pakistani spectators who are in possession of valid tickets for these cricket matches.\nRegarding the earthquake in Afghanistan, she said Pakistan stood in solidarity with its Afghan brothers and sisters and remained in contact with the Interim Afghan Government to meet any needs that they may have during the relief and recovery efforts.",
  "retrievedAt": "2025-08-11T10:03:18.216Z"
}
