{
  "title": "Winter to set in formally after rain and snow from October 14-17",
  "link": "https://www.app.com.pk/national/winter-to-set-in-formally-after-rain-and-snow-from-october-14-17/",
  "date_published": "2023-10-12T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): Pakistan Meteorological Department (PMD) has forecast rain-wind/thunderstorm for various parts of the country with occasional gaps from October 14-17, indicating signs of formal arrival of Winter season.\nThe temperatures will be significantly dropped due to the rain compelling citizens to take out the warm clothes.\nA westerly system will enter upper parts of the country on October 13 (evening/night) and likely to spread to upper/central parts on October 14 (night).\nIn Khyber Pakhtunkhwa, rain-wind/thunderstorm (moderate to isolated heavy falls) is expected in Chitral, Dir, Swat,\nMalakand, Shangla, Buner, Mansehra, Kohistan, Abbottabad, Swabi, Khyber, Mohmand, Bajaur, Peshawar, Mardan,\nNowshera, Charsadda, Kurram, Kohat, Hangu, Orakzai, Bannu, Karak, Lakki Marwat, Tank, Waziristan and Dera Ismail Khan from October 13 (evening/night) to October 17 with occasional gaps.\nThe PMD has forecast snowfall over the high mountains and isolated hailstorm in plains of Khyber Pakhtunkhwa during the forecast period.\nIn Kashmir/Gilgit-Baltistan, rain-wind/thunderstorm (moderate to isolated heavy falls) is expected in Kashmir,\n(Neelum valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur), Gilgit Baltistan\n(Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, Shigar) from October 13 (night) to October 17.\nSnowfall over the high mountains is expected in Kashmir and Gilgit-Baltistan during the forecast period.\nIn Punjab and Islamabad, rain-wind/thunderstorm (moderate to isolated heavy falls) with isolated hailstorm is expected\nin Islamabad, Potohar region, Murree, Galiyat, Sialkot, Narowal, Lahore, Sheikhupura, Okara, Gujranwala, Gujrat, Mandi Bahauddin, Hafizabad, Sargodha, Khushab, Noorpurthal, Faisalabad, Toba Tek Singh, Jhang and Kasur from October 13 (night) to October 17.\nRain-wind/thunderstorm is also expected in Layyah, Bhakkar, Kot Addu, Sahiwal, Multan, Dera Ghazi Khan, Rajanpur, Bahawalpur, Bahawalnagar and Rahim Yar Khan on October 16 (evening/night) to October 18 with\noccasional gaps.\nIn Sindh, rain/wind-thunderstorm is also expected in Jacobabad, Kashmore, Shikarpur, Sukkur, Ghotki, Khairpur, Sanghar and Umerkot on October 17 (evening/night) and October 18.\nIn Balochistan, rain/wind-thunderstorm is also expected in Sherani, Musa Khel, Zhob, Qilla Saifullah, Loralai, Barkhan, Kohlu, Sibbi, Bolan, Kalat, Harnai, Naseerabad, Dera Bugti, Jaffarabad, Qila Abdullah, Pishin, Quetta and\nZiarat on October 17 and 18.\nAbout the impacts of rain spell, the PMD has warned that moderate to heavy falls may increase water flows in local Nullahs/streams and may trigger landslides in the vulnerable areas of Murree, Galliyat, Kashmir, Gilgit Baltistan, Chitral, Dir, Swat, Kohistan, Shangla, Buner, Mansehra and Abbottabad during the spell.\nHeavy rain may generate urban flooding in Rawalpindi and Lahore on October 15 (evening/night) October 16.\nTemperatures are likely to drop significantly as a result of the rain.\nThe farmers are advised to manage their crop activities accordingly while the tourists and travelers are advised to remain cautious during the forecast period.\nAll concerned authorities are advised to remain alert and take necessary precaution measures during the forecast period.",
  "retrievedAt": "2025-08-11T10:02:53.070Z"
}
