{
  "title": "Ethiopian ambassador calls on Education Minister",
  "link": "https://www.app.com.pk/national/ethiopian-ambassador-calls-on-education-minister/",
  "date_published": "2023-10-12T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): Ethiopian Ambassador to Pakistan Mr. Jemal Beker called on the Federal Minister for Education and Professional Training Minister Mr. Madad Ali Sindhi here on Thursday.\nMadad Ali Sindhi welcomed the Ethiopian Ambassador to Pakistan Jemal Beker and said that the two countries have religious, cultural and historical people to people who love each other.\nMadad Ali Sindhi discussed the exchange of expertise and knowledge regarding Vocational and Technical Training. He said that the two countries can benefit from the experience of each other.\nThe Federal Minister also welcomed the exchange of teachers and students to further mutual cooperation, especially for Skilled Vocational Training.\nHe said that there is significant potential for cooperation between the two countries. The Minister said that a Joint Working Group will be formulated which can pave the way for the signing of an MoU between the two countries.\nEthiopian Ambassador to Pakistan Mr. Jemal Beker said that the People of Ethiopia have a deep affiliation with Pakistan.\nHe said that university-to-university cooperation and Technical institution-to-technical Technical Institution collaboration is the way forward.\nHe said that Ethiopian doctors who have studied in Pakistan volunteered to provide free service to Pakistan during the floods of 2022. He further invited the minister to visit Ethiopia and sign the planned MoU there.\nMadad Ali Sindhi said that the future is in Vocational Training of the population of Pakistan. He said that it provides the best opportunity for people to find jobs.\nThe Federal Minister thanked the Ambassador and highlighted the cordial and friendly relations between the two countries. The minister said that the two countries have a shared history.\nHe said that there was a bonhomie between the two people. He stated that the two countries should further enhance their mutual relationship.",
  "retrievedAt": "2025-08-11T10:02:52.116Z"
}
