{
  "title": "PM rules out deal in Nawaz Sharif’s decision to return",
  "link": "https://www.app.com.pk/national/pm-rules-out-deal-in-nawaz-sharifs-decision-to-return/",
  "date_published": "2023-10-12T08:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday dismissed the impression that the decision of Pakistan Muslim League leader Nawaz Sharif to return to Pakistan was part of any deal with the interim government.\n“The caretaker government has ‘no soft corner’ for PML-N or any other political party…How can a caretaker government strike such a deal,” he said in an interview with digital media platform, WE (World Echo) News.\nThe prime minister was responding to a question relating to the PML-N chief’s homecoming who flew from London to Saudi Arabia yesterday with his announcement to land in Pakistan on October 21.\nKakar pointed out that Nawaz Sharif left the country as per the court decision “under the nose of Imran Khan’s government, and not the caretaker setup”.\nHowever, he said that if Nawaz Sharif returns and takes part in politics, he will have to face some legal obstacles. “The answers to these legal questions lie in legal remedies,” he said.\nKakar said any leader be it Imran Khan, Asif Ali Zardari, or Nawaz Sharif, everyone would have to seek their legal remedy as per their case scenario.\nHe said Pakistan was facing the formation of “regimental camps” and the country had been turned into a fighting ground for political positions.\nHe rejected the notion that the caretaker setup could be likened to the 90s ‘Kakar formula’ where both Prime Minister Nawaz Sharif and President Ghulam Ishaq Khan were forced to quit on the proposal of then army chief General Waheed Kakar to make way for fresh election.\n“This comparison is apples and oranges. It is out of context because in our case, the stint of the normal parliament led to its retirement and we are part of the constitutional continuation where leaders of the House and the Opposition agreed upon my name,” he said.\nThere has been no interference from any institution in our case, he said.\nOn general polls, he said necessary security and administrative arrangements were in place.\nHe said the caretaker government in collaboration with the Election Commission was in the process of the finalization of the required measures.\nOn the expulsion of Afghan refugees, the prime minister said the action was being taken only against unregistered foreign nationals and over one million illegal aliens.\nThe government’s objective, he said, was to regulate the movement of unregistered foreign nationals through proper process.\nOn relations with India, he said the radicalized RSS (Rashtriya Swayamsevak Sangh) mindset of the ruling Indian party and the Kashmir dispute were the main hurdles in the maintenance of good ties.\n“The situation between Pakistan and India needs to be improved, however, realistically at present, there is no such possibility,” he said.\nPM Kakar said the hegemonic designs of India needed to be curtailed as the country was turning into hell for its minorities, including Muslims, Sikhs, and others.\nAsked about any possibility of recognition of Israel, he said, “There are no such deliberations going on.”\nPakistan considers Israel an “oppressor” and stands with the rights of Palestinians to their existence and return to their land, he said.\nOn Pakistan’s economic stability, he said the country for the first time witnessed a reversal of the value of the dollar with a consistent descent of about Rs 40-45.\nHe said the continuation of the Special Investment Facilitation Council (SFIC) would lead to sustainability.\nHe dismissed the impression that the army had taken over the mining sector on the SFIC platform.\n“The army’s role is a stop-gap arrangement to run the matters and at SFIC, it is providing impetus in the facilitation process,” he said.\nHe emphasized the need for capacity-building of civil institutions as a pathway for a viable state economically.\nIn Balochistan, he termed security, governance, scarcity of resources, and mismanagement as the main challenges.\nHe recalled that during the meeting of the apex committee held in Quetta, it was revealed that hundreds of ghost schools and health units existed in the province. “Such mismanagement has led to making a few billionaires but leaving the rest of the population deprived including the common Balochs, Pashtuns, and Hazaras,” he said.",
  "retrievedAt": "2025-08-11T10:03:00.123Z"
}
