{
  "title": "Winners of photography competition on BRI projects announced",
  "link": "https://www.app.com.pk/national/winners-of-photography-competition-on-bri-projects-announced/",
  "date_published": "2023-10-12T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):The Ministry of Information and Broadcasting and Pakistan-China Institute (PCI) on Thursday announced the winners of the nationwide photography competition on projects related to the Road and Belt Initiative.\nThe announcement was made in a ceremony that held here at the PTV News Headquarters to honor the exceptional winners of the ‘Nationwide Best BRI Projects Photography Competition.’\nDistinguished guests including Executive Director of the Pakistan China Institute Mustafa Hyder Sayed, former Dean of Tsinghua International Center for Communication Studies Professor Li Xiguang, and Director-General of Radio Pakistan  Tahir Hussain attended the ceremony.\nThe competition received over 1500 entries for showcasing the progress of the China Pakistan Economic Corridor (CPEC), a prominent project within China’s Belt and Road Initiative (BRI).\nThe last date for submitting photographs for the ‘Nationwide Best Belt and Road Initiative Projects Photography Competition,’ organized by the Ministry of Information and Broadcasting in collaboration with PCI was October 7.\nThe competition meant to capture the essence and impact of CPEC and other BRI projects in Pakistan, received submissions in three categories: ‘Infrastructure and Development,’ ‘People and Stories’, and ‘Environmental Impact.’\nA panel of renowned photographers, artists and relevant government authorities judged the entries.\nSpeaking on the occasion, Director General, Radio Pakistan, Muhammad Tahir Hassan appreciated the role of media in promoting people-to-people contacts among the nations.\nHe said that CPEC was a game-changer project and when the historian of future would write history, it would be written as the topmost initiative in Pakistan’s infrastructure development projects.\nTahir Hassan said that Pakistan’s people, especially youth should see the CPEC as a project of paradigm shift and one of the biggest projects in the nation building process.\nHe said that CPEC had over 3000 km road infrastructure projects,  over 2.5 million job opportunities and when completed it would contribute to over 2 percent of GDP growth. He lauded the Pakistan-China Institute for highlighting the soft side of the CPEC by the photographic competition.\nPCI Executive Director Mustafa Hyder Sayed highlighted the significance of this ceremony as the lead event, leading up to the upcoming Belt and Road Forum scheduled to take place in Beijing next week.\nHe emphasized that media in both Pakistan and China has predominantly focused on the tangible aspects of CPEC projects, such as energy and infrastructure, with limited attention given to the softer aspects, including people-to-people connectivity and cultural exchanges.\nSayed pointed out that the competition was designed to instill a sense of ownership among Pakistan’s youth, as they will play a pivotal role in perpetuating the enduring friendship between Pakistan and China.\nProfessor Li Xiguang, an eminent Chinese scholar said that his love for Pakistan had started almost 50 years ago when in 1970 he read a story about China supplying defence equipment to Pakistan in a newspaper.\nHe said after completing his studies he had started work as a journalist and had visited Pakistan many times.\nHe said he had been doing his doctorate in Gandhara art from a university in Pakistan and Professor Ahmed Hassan Dani was one of his beloved teachers.\nHe said that Senator Mushahid Hussain Syed was a close friend of his who helped him befriend many well-known Pakistani personalities.\nHe congratulated the winners of the competition and expressed the hope that the exhibition of the entries in the competition would also be held in China.\n“The objective of this competition is to highlight the importance of CPEC and encourage our youth in healthy activities. Very glad to see that People from all over Pakistan have participated in this competition”  Executive Director PCI, Mustafa Hyder  Sayed said.\nHe said that the think-tank dedicated to fostering people-to-people ties between Pakistan and China has planned to organize a trip to China for the award winners.\nThe first prize with Rs 100,000 cash was won by Aqsa Zahoor, second prize winners included M. Sarmad, Anwarul Haq Saeed, Osama Amin and the third prize winners were Azm Asghar, Miss Sania, Bilal Farooq Khan, Emmanuel Guddu and Rimsha Saboor.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:03:12.844Z"
}
