{
  "title": "OIC delegation meets Mushaal Mullick",
  "link": "https://www.app.com.pk/national/oic-delegation-meets-mushaal-mullick/",
  "date_published": "2023-10-12T17:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): The OIC Secretary General’s Special Envoy for Jammu and Kashmir, H.E. Yousef M. Al Dobeay, along with a high-level delegation, met Special Assistant to the Prime Minister on Human Rights and Women Empowerments, Mushaal Hussain Mullick, on Thursday.\nWelcoming the OIC delegation for its visit to Pakistan and Azad Jammu and Kashmir, Mushaal Mullick thanked the Special Envoy for the OIC’s consistent and unequivocal support to the oppressed people of Jammu and Kashmir, particularly since India’s illegal actions on August 5, 2019. She expressed her deep appreciation for OIC’s sustained advocacy in their just cause for the realization of the right to self-determination.\nShe briefed the OIC Special Envoy on aggravating human rights violations in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), particularly the incarceration of the entire political leadership, including Yasin Malik.\nShe urged the OIC to rally the international community for the protection of the fundamental human rights of the Kashmiri people. Ambassador Yousef M. Al Dobeay reaffirmed the OIC’s principled position on the Jammu and Kashmir dispute.\nHe stated that the OIC was fully committed to the Kashmir cause, and his visit to Pakistan and Azad Jammu and Kashmir in his capacity as OIC Special Envoy on Jammu and Kashmir was an expression of that commitment.\nHe reassured the Kashmiri people of the OIC’s full support for the protection of their rights, including the right to self-determination, in accordance with the UN Security Council Resolutions.\nHe further underlined that all OIC bodies, including the Independent Permanent Human Rights Commission, would continue actively playing their part to extend all possible support and assistance to the Kashmiri people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:03:37.902Z"
}
