{
  "title": "Israeli military chief told to toe the line after opposing reoccupation - World - DAWN.COM",
  "author": null,
  "content": "• Army cautions against full takeover of Gaza Strip since it already controls 75pc of the territory\n• Opposition leader Yair Lapid says public not interested in continuing conflict\n\nJERUSALEM: Israel’s military chief has pushed back against Benjamin Netanyahu’s plans to seize areas of Gaza it doesn’t already control, three Israeli officials said, as the prime minister faces increasing pressure over the war both at home and abroad.\n\nDuring a tense, three-hour meeting on Tuesday, Eyal Zamir, the military chief of staff, warned the prime minister that taking the rest of Gaza could trap the military in the territory, which it withdrew from two decades ago, and could lead to harm to the prisoners being held there, the sources briefed on the meeting said.\n\nThe Israeli military says it already controls 75pc of Gaza after nearly two years of war. It has repeatedly opposed imposing military rule, annexing the territory, and rebuilding Jewish settlements there — policies advocated by some government members. Netanyahu is under intense international pressure to reach a ceasefire in the coastal enclave, which has been reduced to rubble in the fighting. Most of the population of about two million has been displaced multiple times and aid groups say residents are on the verge of famine.\n\nThe UN has called reports about a possible expansion of Israel’s military operations in Gaza “deeply alarming” if true. The military, which accuses Hamas of operating amongst civilians, has at times avoided areas where intelligence suggested prisoners were held and former captives have said their captors threatened to kill them if Israeli forces approached.\n\nNetanyahu told Zamir that so far the military had failed to bring about the release of the prisoners, the officials said. Most of those freed so far came about as a result of diplomatic negotiations.\n\nThe prime minister’s office confirmed the meeting with Zamir on Tuesday but declined to comment further and the military did not respond to a request for comment.\n\nThe prime minister is scheduled to discuss military plans for Gaza with other ministers on Thursday. A fourth source said Netanyahu wants to expand military operations in Gaza to put pressure on Hamas.\n\nNetanyahu, who in May said that Israel would control all of Gaza, leads the most right-wing coalition government in Israel’s history and some of his key partners have in the past threatened to quit if the government ended the war.\n\nDisagreements\n\nDefence Minister Israel Katz wrote on X that the military chief has both the right and the duty to voice his opinion, but said that the military would carry out the governments decisions until all war objectives are achieved.\n\nFollowing a 40-minute meeting with the PM on Wednesday, opposition leader Yair Lapid told reporters he had advised Netanyahu that the public was not interested in continuing the war and that a full military takeover would be a very bad idea. A public poll last month by Israel’s Channel 12 also showed support for a diplomatic deal that would end the war and secure the release of the hostages.\n\nIsrael’s military will have to execute any government decisions on Gaza, the defence minister said on Wednesday after reported disagreements over the prospect of a full occupation of the Palestinian territory.\n\nAs the war nears its 23rd month, signs of a rift over Israel’s strategy have emerged with Prime Minister Benjamin Netanyahu preparing to announce a new plan. He has said Israel must “complete” the defeat of Hamas in order to secure the release of prisoners still held in Gaza.\n\nThe Israeli press, citing officials has predicted an escalation of operations, including in densely populated areas where hostages are believed to be held, such as Gaza City and refugee camps.\n\nOn Wednesday, the military issued a fresh evacuation call for parts of Gaza City, in the north, and Khan Yunis in the south, where a spokesman said ground troops were preparing to “expand the scope of combat operations”.\n\nTrump says ‘up to Israel’\n\nNetanyahu is expected to convene his security cabinet on Thursday to finalise a decision on the expansion of the offensive, Israeli media reported.\n\nOpposition leader Yair Lapid said he told Netanyahu in a Wednesday meeting that “occupying Gaza is a very bad idea… operationally, morally and economically”.\n\nUS President Donald Trump told reporters on Tuesday he was not aware of plans to occupy the entire Gaza Strip, but said that such a decision would be “up to Israel”.\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:12:43.378Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929206/israeli-military-chief-told-to-toe-the-line-after-opposing-reoccupation",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:11:24.000Z"
}
