{
  "title": "Pakistan squash players to make World Games debut - Sport - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: For the first time, Pakistan will be represented by its senior squash players at the 12th edition of the World Games to be held in Chengdu, China, with Nasir Iqbal and Noor Zaman set to compete in the championship.\n\nThe duo, led by head coach Fahim Gul, marks Pakistan’s inaugural participation in the squash event at these global championships.\n\nThe Pakistan Squash Federation (PSF) highlighted the significance of the World Games, describing it as a major international gathering of top athletes.\n\n“It is an honour to have Pakistan’s squash team participating in this mega event,” stated a PSF press release. “Let’s wish our players the best of luck and show our support as they make their mark on the world stage.”\n\nThe men’s singles squash competition begins Friday with 32 players competing.\n\nThe World Games — which runs from Aug 7-17 — is a premier international multi-sport event for non-Olympic disciplines.\n\nThis edition of the Games features 34 sports, 60 disciplines and 256 events with approximately 5,000 athletes from around 110 countries and regions competing.\n\nInternational World Games Association (IWGA) president Jose Perurena Lopez declared Chengdu’s preparations have exceeded all expectations, positioning the event to make history.\n\n“My expectation two years ago was high, but I think it’s covered all my expectation,” Perurena told Chinese news agency Xinhua on Tuesday.\n\n“We guarantee Chengdu will organise the best World Games in our life, because the quality of the venue, the quality of the volunteers, the quality of the organising committee are higher professional.”\n\nPerurena also underscored the World Games’ role in promoting sports outside the Olympic program.\n\n“We represent the sports that are recognised by the International Olympic Committee (IOC) but are not in the Olympic Games. They need our Games to show they are ready.”\n\nPerurena also commented on the event’s appeal: “The new generation likes the new sport. Integrated and different sports. This is the mentality of the new generation. And we support this idea,” he said.\n\n“Some games might be niche but can be a really big sport in some parts of the globe. And I think this is the beauty and an opportunity to get to know what sports people are playing in different parts of the world.”\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/071424279242897.png",
  "retrievedAt": "2025-08-16T07:12:56.857Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929201/pakistan-squash-players-to-make-world-games-debut",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:11:17.000Z"
}
