{
  "title": "Why is Trump playing hardball with India? - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: US President Donald Trump’s decision to raise India’s tariff rate to 50 per cent risks reversing what Washington once described as the “partnership of the 21st century,” according to a report released by the Atlantic Council.\n\nThe report attributes the recent downturn in bilateral ties to India’s increasingly restrictive trade policies, including quality control regulations, which it says have complicated trade relations and frustrated US exporters.\n\nIn contrast, a separate analysis by the BBC highlights the Trump administration’s renewed efforts to improve relations with Pakistan as another factor straining India-US ties.\n\nThe report notes that New Delhi views this shift with suspicion, given the region’s complex geopolitical dynamics.\n\nAdding to the tensions, a separate report by the Stimson Centre in Washington points to India’s growing leadership role within the BRICS alliance as a source of irritation for the US administration. It recalls that President Trump has long been antagonistic toward BRICS members, and, in November 2024, even threatened to impose 100pc tariffs on the group’s members.\n\nIn response, both Brazil’s President Lula and India’s Prime Minister Narendra Modi publicly condemned the threat, describing it as inappropriate and disrespectful to the sovereignty of independent nations.\n\n“Today, he (Trump) followed through on his threats by hiking India’s tariff rate to 50 percent. These measures and the rhetoric … risk reversing decades of progress in the ‘partnership of the twenty-first century,’” says the Atlantic Council report.\n\nWhile noting that New Delhi and Washington are still working on a trade deal “that could help restore a measure of calm,” the report adds that the Indian government is examining additional tariff concessions. India is also likely to put US LNG, defence, and “other purchase offers on the negotiating table” to make the deal more attractive.\n\nIdentifying a key stumbling block, the report notes that President Trump views New Delhi’s quality control orders (QCOs) as “strenuous and obnoxious.”\n\nSpeculating on possible Indian efforts to reduce tensions, the report adds: “India could decide that imports that are ‘Made in USA’ … are exempt from QCO requirements.”\n\nThe Stimson Centre’s analysis notes that Washington’s narrative about BRICS frames the group as vulnerable to collapse, “owing to the diversity of its membership, lack of a practical strategy to advance reform, and concerns about an anti-U.S. and anti-Global North” agenda.\n\nMeanwhile, the BBC report identifies “Trump repeatedly putting India and its rival Pakistan on an equal footing” as one of the main causes of current tensions. According to the BBC, another “constant irritant for Delhi is Trump’s repeated assertion that the US brokered a ceasefire between India and Pakistan.”\n\nThe report notes that India views its dispute with Pakistan over Kashmir as an internal matter and has consistently rejected third-party mediation.\n\nYet, the US president “has doubled down on his claim” even after Modi told India’s parliament that “no country had mediated in the ceasefire.”\n\nWashington-based South Asia analyst Michael Kugelman told the BBC that some of the anger in Delhi might “be Cold War-era baggage coming to the fore,” but added, “this time around it’s intensified by real-time developments as well.”\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/071044572443682.jpg",
  "retrievedAt": "2025-08-16T07:12:41.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929208/why-is-trump-playing-hardball-with-india",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:11:24.000Z"
}
