{
  "title": "Senate body seeks detail of cases registered against journalists under Peca - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Senate Standing Committee on Information and Broadcasting on Wednesday showed its concern over registration of cases against journalists under the controversial Prevention of Electronic Crimes Act (Peca) and called for urgent action to address growing concerns of media persons regarding FIRs and arrests of journalists.\n\nThe Senate committee headed by ruling PTI’s Ali Zafar issued the directives after it was informed by the Ministry of Interior that 689 cases had been registered under the Peca law throughout the country, including nine FIRs [First Information Report] registered against journalists.\n\nAccording to an official handout, the committee received a detailed briefing from officials of the information and interior ministries regarding the number and nature of cases registered under Peca since its passage from the parliament in January, with a special focus on journalists, media professionals, digital content creators, and social media activists.\n\nThe committee was further informed that only one journalist had been arrested while seven were out of the country.\n\nThe committee directed the interior ministry to provide details of the FIRs lodged against the journalists and their complete reason in the next meeting. The committee also discussed the long-standing issue of delayed salaries and pensions of Pakistan Television (PTV) employees.\n\nNine journalists among 689 booked under controversial law so far\n\nThe committee’s chairman expressed serious concern over the situation and directed the concerned officials to provide detail and rationale for recruiting the employees during last five years in the ministry, considering the financial position of it.\n\nMeanwhile, Information Minister Attaullah Tarar assured the committee that he would personally follow up on allegations of Rs1.24 billion embezzlement in the state-run Associated Press of Pakistan (APP).\n\nResponding to a query raised by Senator Sarmad Ali, who asked why an FIR had not been lodged despite the passage of over ten months since the misappropriation was unearthed.\n\nThe minister told the committee that the scam, involving misappropriation of Rs1.24bn in provident fund and employee-related expenses, was uncovered by the APP managing director.\n\nHe assured the committee that he would pursue the case himself for registration of an FIR against those responsible.\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/07121450c2cc103.png",
  "retrievedAt": "2025-08-16T07:12:30.232Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929175/senate-body-seeks-detail-of-cases-registered-against-journalists-under-peca",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:11:41.000Z"
}
