{
  "title": "Trump’s higher tariffs hit major US trading partners, sparking defiance and concern - World - DAWN.COM",
  "author": null,
  "content": "United States trade partners such as Switzerland, Brazil and India were still scrambling to get a better deal on Thursday as President Donald Trump’s higher tariff rates on imports from dozens of countries kicked in, raising the average US import duty to its highest in a century.\n\nThe US Customs and Border Protection agency began collecting the higher tariffs of 10 per cent to 50pc at 12:01am EDT (09:01am PKT) after weeks of suspense over Trump’s final tariff rates and frantic negotiations with major trading partners that sought to lower them.\n\nThe leaders of Brazil and India vowed not to be cowed by Trump’s hardline bargaining position, even while their negotiators sought a reprieve from the highest tariff levels.\n\nThe new rates will test Trump’s strategy for shrinking US trade deficits without causing massive disruptions to global supply chains or provoking higher inflation and stiff retaliation from trading partners.\n\nAfter unveiling his “Liberation Day” tariffs in April, Trump has frequently modified his plan, slapping much higher rates on imports from some countries, including 50pc for goods from Brazil, 39pc from Switzerland, 35pc from Canada and 25pc from India.\n\nHe announced on Wednesday a separate, 25pc tariff on Indian goods, to be imposed in 21 days, over India’s purchases of Russian oil.\n\n“Reciprocal tariffs take effect at midnight tonight!” Trump said on Truth Social just ahead of the deadline.\n\n“Billions of dollars, largely from countries that have taken advantage of the United States for many years, laughing all the way, will start flowing into the USA. The only thing that can stop America’s greatness would be a radical left court that wants to see our country fail!”\n\nTariffs are ultimately paid by companies importing the goods and consumers of the end products.\n\nEight major trading partners accounting for about 40pc of US trade flows have reached framework deals for trade and investment concessions to Trump, including the European Union, Japan and South Korea, reducing their base tariff rates to 15pc.\n\nBritain won a 10pc rate, while Vietnam, Indonesia, Pakistan and the Philippines secured rate reductions to 19pc or 20pc.\n\n“For those countries, it’s less-bad news,” said William Reinsch, a senior fellow and trade expert at the Centre for Strategic and International Studies in Washington.\n\n“There’ll be some supply chain rearrangement. There’ll be a new equilibrium. Prices here will go up, but it’ll take a while for that to show up in a major way,” Reinsch said.\n\nCountries with punishingly high duties, such as India and Canada, “will continue to scramble around trying to fix this”, he added.\n\nSwitzerland’s government will hold an emergency meeting on Thursday to decide its next move after President Karin Keller-Sutter returned home empty-handed from an 11th-hour trip to Washington aimed at averting the crippling US import tariff on Swiss goods.\n\nA last-minute attempt by South Africa to improve its offer in exchange for a lower tariff rate also failed.\n\nSouth African President Cyril Ramaphosa held a telephone call with Trump on Wednesday and the two countries’ trade negotiating teams will have more talks, Ramaphosa’s office said.\n\nMeanwhile, Brazil’s President Luiz Inacio Lula da Silva told Reuters on Wednesday he wouldn’t humiliate himself by seeking a phone call with Trump even as he said his government would continue cabinet-level talks to lower a 50pc tariff rate on Brazilian exports to the US.\n\nIndian Prime Minister Narendra Modi was similarly defiant, saying he would not compromise the interests of the country’s farmers after Trump introduced a 50pc tariff on Indian goods.\n\nTrump’s order has specified that any goods determined to have been transshipped from a third country to evade higher US tariffs will be subject to an additional 40pc import duty, but his administration has released few details on how these goods would be identified or the provision enforced.\n\nUS import taxes are one part of a multilayered tariff strategy that includes national security-based sectoral tariffs on semiconductors, pharmaceuticals, autos, steel, aluminium, copper, lumber and other goods.\n\nTrump said on Wednesday the microchip duties could reach 100pc.\n\nChina is on a separate tariff track and will face a potential tariff increase on August 12 unless Trump approves an extension of a prior truce after talks last week in Sweden.\n\nHe has said he may impose additional tariffs over China’s purchases of Russian oil as he seeks to pressure Moscow into ending its war in Ukraine.\n\nTrump has touted a vast increase in federal revenues from his import tax collections, with US Treasury Secretary Scott Bessent saying tariff revenues could top $300 billion a year.\n\nThe move will drive average US tariff rates to around 20pc, the highest in a century and up from 2.5pc when Trump took office in January, the Atlantic Institute estimates.\n\nCommerce Department data released last week showed more evidence that tariffs began driving up US prices in June, including for home furnishings and durable household equipment, recreational goods and motor vehicles.\n\nCosts from Trump’s tariff war are mounting for a wide swath of companies, including bellwethers Caterpillar, Marriott, Molson Coors and Yum Brands.\n\nToyota on Thursday said it expected a hit of nearly $10bn from tariffs on cars imported into the US as it cut its full-year profit forecast by 16pc.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/07163308f557437.png",
  "retrievedAt": "2025-08-16T07:11:28.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929325/trumps-higher-tariffs-hit-major-us-trading-partners-sparking-defiance-and-concern",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T11:46:58.000Z"
}
