{
  "title": "11 martyred in terror attacks across KP, Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT/SOUTH WAZIRISTAN/QUETTA: Eight security personnel and three civilians embraced martyrdom in different terror attacks in Khyber Pakhtunkhwa and Balochistan, officials said on Wednesday.\n\nIn Balochistan’s Mastung district, three security personnel, including a senior officer, were martyred and three others sustained injuries in an improvised explosive device attack in Kirdgab area of the district.\n\nISPR said the incident took place on Tuesday evening in the Killi Pasand Khan area when a convoy of security for­ces was targeted by terrorists linked to Fitna al Hindustan (the state’s term for banned BLA) with an IED.\n\n“A vehicle was targeted with an IED, which was planted at the roadside and detonated with a remote control device,” a senior official of the local administration said. The injured were shifted to the Combined Military Hospital in Quetta for treatment.\n\nFC vehicle ambushed\n\nIn Karak district, a vehicle of the Federal Frontier Constabulary was ambu­shed by militants in Amankot in the jurisdiction of the Gurgari police station. Sources said terrorists from the banned Tehreek-i-Taliban Pakistan had taken up position on a mountaintop and opened fire at the pick-up truck carrying FC men.\n\nAs a result, one Lance Naik, two sepoys and their civilian driver lost their lives. The slain troops were deployed at an oil and gas facility in the Gurgari area. The rescuers reached the spot soon after the attack and shifted the bodies to a hospital in Terri.\n\nSeparately, an off-duty soldier of the Frontier Corps was killed in a gun attack in the Railway Station area of the Lakki Marwat district. A police official identified the victim as a resident of Zangikhel, saying he had recently settled in the Railway Station locality. He said that the deceased had come to his hometown on leave.\n\nThe body was moved to the Government City Hospital for medico-legal formalities. “After the attack, the police started combing the area in search of the assailants,” the official said, adding that the slain FC man was laid to rest in a local graveyard with state honours.\n\nThree killed in Peshawar\n\nA police official and two civilians died when unidentified armed motorcyclists opened fire at them within the jurisdiction of Michni Gate police station on Tuesday night, police said.\n\nA statement issued by the city police read that Inspector Ali Hussain, who was serving as the in-charge of the investigation cell at Mechni Gate police station, was travelling with his friends when their car came under attack.\n\nSSP Operations Peshawar Masood Bangash said that four unknown persons, riding on two motorcycles, targeted the vehicle, adding that some 65 empty bullet shells were recovered from the spot. The motorcyclists went towards the Mathra area on the outskirts of the provincial capital following the attack, he added.\n\nDC convoy attacked\n\nIn another incident, Deputy Commissioner Asmatullah Wazir and Additional Deputy Commissioner Zahid Younis survived an attack in the Habib Kot area of the Ladha tehsil, Upper South Waziristan. According to ADC Fazal Wadood, the assailants started indiscriminate firing at two vehicles in the official convoy, shattering their windows.\n\nTwo policemen sustained minor injuries from the broken glass and were shifted to a local hospital in Ladha.\n\nSpeaking to Dawn over the phone, DC Asmatullah Wazir said that he along with his colleagues had reached the Ladha headquarters safely. He added that the attackers managed to flee after the incident, while the police had collected evidence from the scene and launched an investigation.\n\nMeanwhile, a soldier of the Pakistan Navy was injured in an attack near the Bachkan Ahmadzai area in Lakki Marwat district on Wednesday. Police said that the 22-year-old navy commando, was attacked by two motorcyclists when he was going to his village on a motorcycle. They said that the attackers fled the area after the incident within the limits of the Serai Gambila police station.\n\nThe victim told the police in a preliminary report that he was posted at PNS Iqbal in Karachi and had come to his village on leave over two weeks ago.\n\n“On the day of the incident, I left Gambila Adda for Bachkan Ahmadzai and when I reached Kheera Adda near my village, two motorcyclists in masks appeared from behind and one of them tried to aim his pistol at me,” he claimed. He said that when he resisted, the armed suspect opened fire and injured him. A case was registered against the suspects.\n\nUmer Farooq in Peshawar also contributed to this report\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/06135025886b909.jpg?r=140717",
  "retrievedAt": "2025-08-16T07:13:23.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929228/11-martyred-in-terror-attacks-across-kp-balochistan",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:10:53.000Z"
}
