{
  "title": "Veteran’s T20 World Cup rescheduled to Nov 21-Dec 1 - Sport - DAWN.COM",
  "author": null,
  "content": "The International Masters Cricket (IMC) Over 40s T20 Cricket World Cup has been rescheduled to November to avoid a clash with the National Games slated for December in Karachi, the Pakistan Veterans Cricket Association (PVCA) said on Thursday.\n\nThe veteran’s cricket tournament was scheduled from Dec 1-13 and was being organised by PVCA. Last month, the Pakistan Cricket Board (PCB) had approved the use of Karachi’s National Stadium for 19 out of 56 matches.\n\nMeanwhile, Sindh Chief Minister Murad Ali Shah announced in May that Karachi would host the 35th National Games from December 6-13 after it was postponed from its initial dates in May. Over 7,000 athletes, officials, and technical staff are expected to participate in the Games.\n\nA press release issued by the PVCA today said the veterans’ cricket tournament will now take place from November 21 to Dec 1 in Karachi.\n\nPVCA Chairman Fawad Ijaz Khan said: “Our tournament was initially planned from Dec 1-13, but holding two mega-events at the same time would pose significant challenges for security and logistics for government of Sindh.\n\n“To avoid this clash, and in light of the desire of Sindh CM Murad, who has taken ownership of the National Games, as well as on the advice of the PCB, we have decided to reschedule the IMC Over 40s T20 World Cup.”\n\nA meeting to discuss details of the world cup were discussed in a meeting in Karachi earlier this week between Khan and Minister for Sports and Youth Affairs Sardar Muhammad Bux Khan Mahar, along with Sindh Sports Secretary Munawar Ali Mahesar.\n\nThe PVCA chairman said: “We have taken all 12 participating nations, including Australia, South Africa, West Indies, Sri Lanka, Hong Kong, Zimbabwe, Canada, Saudi Arabia, UAE, US and rest of the World team, into confidence.\n\n“We are extremely grateful to all the teams for their cooperation and acceptance of our request for the new schedule.”\n\nA total of 42 matches will be played during the tournament across different venues in Karachi. All matches involving the Pakistan team will be held under floodlights and will be televised live and streamed on multiple digital platforms, the press release said.\n\nThe PVCA said the rescheduled event promises to showcase thrilling cricket, promote sports tourism, and highlight Pakistan’s hospitality.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/08130104f63e375.png?r=130120",
  "retrievedAt": "2025-08-16T07:11:27.030Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929302/veterans-t20-world-cup-rescheduled-to-nov-21-dec-1",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T11:38:57.000Z"
}
