{
  "title": "Second chances - Newspaper - DAWN.COM",
  "author": null,
  "content": "FACING the ignominy of the state auctioning off its assets, Bahria Town has appealed for another chance to settle its debts. Few could have imagined that the controversial real estate developer would one day be humbled thus. It was, after all, considered untouchable for a large part of its history.\n\nYet on Tuesday, as its chairman issued a lengthy statement beseeching the state for “serious dialogue and a dignified solution”, it seemed that Bahria Town might finally be feeling the heat. “[…] We assure you that we will participate in any arbitration and implement its decision 100 per cent. […] If the arbitration decision requires payment of money from our side, we will ensure its payment, God willing,” the statement read. It was prefaced with a long account of Bahria Town’s ‘contributions’ to Pakistan, as well as a lament on the dire straits the company now finds itself in.\n\nOne wonders if the many citizens dispossessed by Bahria Town’s aggressively expansionist real estate projects have felt schadenfreude over its predicament. As part of several investigations into the developer’s activities, this publication came across scores of accounts of citizens who had been rendered helpless by Bahria Town’s immense clout and heft. Even the Supreme Court had struggled, during its examination of the developer’s BTK project, to account for the impunity it enjoyed during its expansion, which was aided by unprecedented levels of government corruption and state connivance.\n\nBut though the settlement Bahria Town eventually agreed with the apex court to atone for its misdoings had seemed relatively modest at the time, it seems it continued to haunt it. For some reason, Bahria Town never made good on its commitments and began defaulting very early on against scheduled payments. Why this did not invite the court’s scrutiny sooner has never truly been explained.\n\nThe state now wants Bahria Town to pay, and is willing to exercise all options at its disposal. The Bahria Town chairman suggested in the past that the developer was being targeted due to his refusal to become party to the Al Qadir Trust case against former prime minister Imran Khan. That case revolved around assets worth £190m seized from Malik Riaz by the UK government and repatriated to Pakistan, which the present government believes were misappropriated to ‘benefit’ Bahria Town by adjusting them against its dues to the Supreme Court. The authorities are now even seizing Bahria Town properties tied to other cases.\n\nBut if the present regime at some point offers some ‘benefit’ to Bahria Town in return for Mr Riaz’s ‘cooperation’, it would be considered guilty of the same malfeasance it accuses Mr Khan of. Justice demands that Bahria Town be prosecuted fairly and fully by the authorities — independent of all other considerations.\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/06185831612de49.png?r=195122",
  "retrievedAt": "2025-08-16T07:12:03.993Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929235",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T02:12:46.000Z"
}
