{
  "title": "‘Human actions’ led to 15pc heavier rains this year - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Experts, scientists say even moderate rains are causing high death tolls\n• Pakistan is 152nd in list of countries least ready for climate impact\n• Report says issue ‘taken seriously’ in Pakistan, but financing is absent\n\nISLAMABAD: Pakistan, one of the countries least prepared to deal with the impact of climate change, was hit particularly hard this year as it received 15 per cent more rainfall than average.\n\nThis anomaly was a result of human actions that exacerbated the crisis of climate change, said a group of 18 scientists and researchers who were part of the World Weather Attribution group at Imperial College’s Grantham Institute in the UK.\n\nThe group, which included experts from universities and meteorological agencies in Pakistan, the UK, France and the Netherlands, said the recent floods were triggered by heavier-than-normal rainfall and blamed human actions for the weather anomaly.\n\nPakistan’s monsoon season starts in late June and ends in September. It brings 70 to 80pc of the country’s annual rainfall, but frequently causes flooding.\n\nWhile monsoon rains are crucial for replenishing water sources, they have become more intense recently.\n\n“Pakistan’s monsoon has intensified to the point that even months with moderately heavy rain are leading to high death tolls,” said Dr Mariam Zachariah, a researcher at the Centre for Environmental Policy at Imperial College London.\n\nShe said the downpours analysed in the report were “not record-breaking” but point to a broader trend: climate change is making floods “increasingly dangerous”.\n\nThe floods, which followed relentless bouts of heavy monsoon rain, badly hit the northern half of Pakistan.\n\nStates of emergency had been declared in several districts, with floodwaters submerging roads, destroying homes and wiping out crops.\n\nFrom June 26 to August 3, 300 people were killed across the country, with 242 deaths in a region of northern Pakistan, the study analysed.\n\nHistorical rainfall data showed recent downpours in northern Pakistan were not particularly extreme compared to other years.\n\nIn today’s climate, with 1.3°C of warming, similar 30-day spells of heavy monsoon rain can be expected about once every five years.\n\nHowever, the rainfall would have been much less intense if humans hadn’t warmed the climate by burning fossil fuels, the report added.\n\n“After combining weather data with climate models, the researchers found that climate change made the heavy monsoon rainfall about 15pc more intense”, the report said.\n\nTransition from fossils\n\nPakistan, which is responsible for about 0.5pc of historic carbon emissions, has been ranked as the 152nd country least ready for climate impacts. This makes the impact of heatwaves, drought and floods more pronounced.\n\nThe report has called for urgent steps to strengthen flood resilience to save communities from the impact of climate-induced disasters.\n\nIt warned that “monsoon downpours will continue to intensify in Pakistan until the world transitions from fossil fuels to renewable energy”.\n\n“Every tenth of a degree of warming will lead to heavier monsoon rainfall, highlighting why a rapid transition from fossil fuels to renewable energy is so urgent,” said Dr Zachariah.\n\nThe report noted that international adaptation finance was urgently nee­ded for Pakistan, which required an estimated $40 to 50 billion annually to cope with extreme weather.\n\nWithout large-scale transformative adaptation, extreme weather could cost Pakistan an estimated $1.2 trillion by 2050, according to an earlier UN report.\n\nAt COP29, rich countries, responsible for most emissions, agreed to raise climate finance for developing nations to $300 billion by 2035.\n\nHowever, there remains a significant gap between the climate finance currently provided by developed countries and the amount needed, it said.\n\nThe report quoted the UN that developed countries were only providing about $28 billion in adaptation finance annually, which is $187 to $359bn short of what is required.\n\nIt said floods in 2022 killed more than 1,700 people, underscoring how vulnerable Pakistan was to climate change but three years later, monsoon floods were still resulting in shocking loss of life.\n\n“Climate change is taken more seriously in Pakistan, but internatio­nal finance and long-term planning are lacking”, it said, adding a record-breaking 48.5°C in northern Pakistan, followed by deadly rains in July, was yet another stark reminder of what the country was enduring at just 1.3°C of global warming above pre-industrial levels.\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:13:23.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929227/human-actions-led-to-15pc-heavier-rains-this-year",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:10:53.000Z"
}
