{
  "title": "Insurers face soaring payouts as disasters intensify - World - DAWN.COM",
  "author": null,
  "content": "ZURICH: Natural disasters caused $135bn in economic losses globally in the first half of 2025, fuelled by the Los Angeles wildfires, reinsurer Swiss Re said on Wednesday.\n\nSwiss Re, which serves as an insurer of insurance companies, said first half losses were up from the $123bn in the first half of 2024.\n\nThe Zurich-based reinsurance giant estimated that of this year’s first half losses, $80bn had been insured — almost double the 10-year average, in 2025 prices.\n\nThe Los Angeles blazes in January constitute the largest-ever insured wildfire loss event by far, reaching an estimated $40bn, said Swiss Re.\n\nIt said the “exceptional loss severity” of the fires was down to prolonged winds, a lack of rainfall and “some of the densest concentration of high-value single-family residential property in the US”.\n\nLos Angeles wildfires fuel record $135bn global disaster losses\n\nSwiss Re said losses from wildfires had risen sharply over the past decade due to rising temperatures, more frequent droughts and changing rainfall patterns — plus greater suburban spra­­wl and high-value asset concentration.\n\n“Most fire losses originate in the US and particularly in California, where expansion in hazardous regions has been high,” it said.\n\nBefore 2015, wildfire-related insured losses made up around one percent of all natural catastrophe claims, but now account for seven percent.\n\nHurricane season approaching\n\nInsured losses from severe thunderstorms amounted to $31bn in the first half of 2025. The second half of the year is usually more costly for insurers due to damage during the North Atlantic hurricane season.\n\nIf current loss trends continue, glo­bal insured losses from natural catastrophes in 2025 could exceed the Swiss Re Institute’s projections of $150bn.\n\n“The strongest lever to increase the resilience and safety of communities is to double down on mitigation and adaptation. It’s here that everyone can help reduce losses before they occur,” said Swiss Re’s group chief economist Jerome Haegeli.\n\n“While mitigation and adaptation measures come at a price, our research shows that, for example, flood protection measures such as dykes, dams and flood gates are up to 10 times more cost-effective than rebuilding.” The March earthquake in Myanmar figured among the major natural disasters in the first six months of the year, with the tremors felt in neighbouring Thailand, India, and China.\n\nIn Thailand alone, insured losses reached $1.5bn.\n\nOverall, while natural disasters caused $135bn in economic losses in the first half of 2025, man-made disasters — which include industrial accidents — caused another $8bn in losses, of which $7bn were insured losses.\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68941153d6464.jpg",
  "retrievedAt": "2025-08-16T07:12:09.612Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929250/insurers-face-soaring-payouts-as-disasters-intensify",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T02:38:32.000Z"
}
