{
  "title": "Govt ‘unprepared’ to deal with severe earthquake in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Experts say $50bn worth of infrastructure, lives of thousands at risk in face of powerful seismic hazard\n• Call for early warning systems, emergency drills to protect metropolis\n\nKARACHI: Sharing concern over the city’s high vulnerability to a major earthquake, which is supported by historical data, experts at a seminar held at Karachi University (KU) on Wednesday regretted that there are no government measures in place to protect Karachi, the country’s economic and business hub feeding over 20 million people, from the grave seismic threat.\n\nThe cost of this persistent official apathy, they warned, could be very high in terms of both human and property loss. Therefore, they called for strict enforcement of building codes, creating public awareness of the seismic hazard and making emergency drills part of all institutional frameworks.\n\nThe event, titled “Recent Earthquakes in Karachi: Causes, Impacts and Mitigations”, was jointly organised by KU’s geology department and the Society of Economic Geologists and Mineral Technologists (SEGMITE) at the university’s auditorium.\n\nAccording to speakers, the city of Karachi requires immediate special attention, given its close proximity to several seismic fault lines, the junction of three tectonic plates, the Makran subduction zone, the large size of its population and massive unregulated urbanisation.\n\n“Given the historical evidence, including the 8.1 magnitude tsunami of 1945 (that also hit Karachi), resulting in over 4,000 deaths, there is a high vulnerability for a major earthquake,” said Chief Meteorologist Ameer Hyder Leghari, in response to a question.\n\nHe also emphasised the need for inter-provincial coordination, considering the fact that a significant part of the country is exposed to high to moderate seismic threat.\n\n“Unfortunately, the role of disaster management is missing. We need to create awareness of seismic hazards as well as carry out emergency drills to prepare the public for natural disasters,” he said.\n\nGiving his presentation on Karachi’s seismic hazard, Moin Raza Khan, former chief executive officer of Pakistan Petroleum Limited, said that the recent 60-plus low-intensity tremors of 1.5 to 3.8 magnitude, caused by fault creep and groundwater-linked stress, were concentrated in the eastern and southeastern areas of the city.\n\n“While they were a blessing in disguise (as they helped release tectonic stress without causing human and property loss), they should serve as a wake-up call,” he said, adding that the Landhi-Korangi fault’s reactivation led to the seismic activity.\n\nThe interaction of the Arabian, Eurasian, and Indian plates, he said, originated high-intensity earthquakes. Some of them were very destructive, including the earthquakes which occurred in 1935 (Quetta), 1945 (Makran coast), 2005 (Balakot) and 2013 (Awaran).\n\nAccording to him, land subsidence in the city, caused by over-extraction of groundwater, deltaic compaction, unregulated mining and high urban load on soft marine sediment, is also inducing seismic activity.\n\n“The total value of the city’s infrastructure at risk of seismic hazard is estimated to be $50bn. Karachi must prepare for a local rupture of magnitude 5 on the Landhi fault and Makran megathrust of magnitude 8. All scenarios demand strong early warning systems and measures for retrofitting,” he said, adding that Karachi is tectonically active, geotechnically fragile and unregulated in key domains.\n\nGeotechnical engineer Hasan S. Akhtar talked about enhanced structural resistance against seismic forces. He suggested the use of cost-efficient polypropylene fibre, stating that it enhanced seismic resilience in buildings and bridges by improving crack resistance, energy absorption, and structural integrity during earthquakes.\n\nThe experts stressed the need to learn from countries like Japan that have successfully minimised building damage during earthquakes, with the help of using the latest technology in construction practices as well as strictly enforcing its building codes.\n\nOn this occasion, KU Vice Chancellor Prof Khalid Mahmood Iraqi emphasised that identifying problems alone was not enough as practical steps and policies grounded in local realities were essential.\n\nSenior geophysicist Riaz Hussain Rajpar and Prof Viqar Hussain also spoke.\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/6865bf1ff0e76.jpg",
  "retrievedAt": "2025-08-16T07:12:36.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929153/govt-unprepared-to-deal-with-severe-earthquake-in-karachi",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:11:30.000Z"
}
