{
  "title": "Army chief heads to US, again - Pakistan - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Chief of the Army Staff Field Marshal Asim Munir is expected in the US this week for consultations with his American counterparts, official sources told Dawn.\n\nSources said this would be a return visit, following a trip to Pakistan by Gen. Michael Erik Kurilla, head of the US Central Command (CENTCOM), in late July.\n\nIn a press statement issued on Aug 4, CENTCOM recalled Gen Kurilla’s recent visit to Pakistan and other countries in the region.\n\nDuring the visit, Gen Kurilla was also conferred the Nishan-i-Imtiaz (Milit­ary) by the Pakistani government.\n\nField Marshal Munir previously visited Washin­gton in June, when he was hosted by President Don­ald Trump for lunch at the White House — an unprecedented gesture typically reserved for visiting heads of state or government.\n\nThere was no official word on the visit from Inter- Services Public Relations or Pakistan’s embassy in Washington, but during his previous, the army chief had hinted that he expected to return to the US again later in the year.\n\nThe development comes just over a month after the US general described Pakistan as a “phenomenal partner” in counterterrorism efforts during a congressional hearing, where he also praised Pakistan’s role “in promoting peace and stability” in the region.\n\nNo designs on Presidency\n\nSeparately, the ISPR chief has rubbished rumours of Chief of Army Staff (COAS) Field Marshal Asim Munir becoming the president, Dawn.com reported.\n\nHis statement follows a similar rebuttal by Interior Minister Mohsin Naqvi early in July, when he clarified that no idea existed “about the president being asked to resign or the COAS aspiring to assume the presidency”.\n\nLt Gen Ahmed Sharif Chaudhry told The Econo­mist in a recent interview that talk of his boss becoming president is ‘nonsense’.\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:13:11.129Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929224/army-chief-heads-to-us-again",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T00:11:06.000Z"
}
