{
  "title": "Currency crunch as govt pushes dollar down - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The government’s efforts to artificially bring down the dollar rate are faltering, with market forces pushing back against a Rs250 exchange rate target and foreign currencies reportedly vanishing from the open market.\n\nA crackdown on dollar smuggling launched on July 23 has led to a minor depreciation of around Rs3 in both the open and interbank markets. However, this has done little to bridge the gap between market sentiment and official expectations. The dollar continues to trade above Rs280, and a noticeable shortage has emerged.\n\nIn recent meetings held in Islamabad with banks, currency dealers, and jewellers, authorities reportedly reiterated their desire to bring the dollar down to Rs250. However, participants in the meetings described the target as unrealistic. Some bankers estimate the real market parity to be closer to Rs281.\n\nCurrency dealers say major foreign currencies — including the US dollar, British pound, and euro — are largely unavailable. “You might find a few hundred dollars at some counters, but most dealers are facing acute shortages,” said a senior dealer from an ‘A’ category exchange company.\n\nMarket pushback thwarts govt’s bid to bring greenback down to Rs250\n\nWhile Malik Bostan, President of the Forex Association of Pakistan, recently dismissed reports of a currency shortage and claimed readiness to meet demand, most dealers disagree.\n\nMany suspect that an illegal parallel market has resurfaced, where the dollar is selling at higher rates than those quoted by the Exchange Companies Association of Pakistan (ECAP).\n\nOn Wednesday, ECAP quoted the dollar at Rs285.15 in the open market and Rs282.87 in the interbank.\n\n“There is no real shortage — the resistance to price controls is fuelling the perception of one,” said a senior interbank market analyst.\n\nAtif Ahmed, a dealer operating in the interbank market, explained that banks with State Bank approval to sell dollars to importers are prioritising their own clients and setting higher rates acceptable to buyers. “Opening a letter of credit (LC) for $0.5 million has become a tough task for importers,” he added.\n\nAlthough imports in FY25 have increased, indicating a relatively easier import regime than last year, analysts believe the current forex dynamics will make it difficult to achieve the Rs250 target. While the rupee may briefly strengthen into the 270s, sustained appreciation appears unlikely.\n\n“The economy does not support a stronger rupee at this stage,” said a senior banker. “We remain dependent on the US dollar’s performance in global markets — and even though it has weakened slightly in 2025, that won’t be enough to pull the rupee to Rs250.”\n\nPublished in Dawn, August 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:12:01.751Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929253/currency-crunch-as-govt-pushes-dollar-down",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T02:42:35.000Z"
}
