{
  "title": "All 4 workers rescued after emerald mine collapse in Swat: rescue officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four workers trapped 900 feet underground in a Swat emerald mine were rescued during an operation, Rescue 1122 said on Thursday.\n\nOn Wednesday evening, a major rescue operation was launched after a section of the emerald mine collapsed, trapping multiple workers underground. According to initial reports by Rescue 1122 Swat, the mine caved in suddenly during extraction activity.\n\n“Rescue 1122 medical teams are providing immediate medical assistance to the rescued workers,” Rescue 1122 spokesperson Bilal Ahmed Faizi told Dawn.com. “The operation continued for several hours after the mine collapsed, in which more than 40 personnel participated.”\n\nThe rescue operation was led by District Emergency Officer Swat Rafiullah Marwat, as per Faizi.\n\n“The trained personnel and modern equipment of Rescue 1122 made the operation successful,” Faizi said.\n\nMeanwhile, the army was also involved in the rescue operation, according to state-run Radio Pakistan.\n\n“As soon as the incident was reported, Pakistan Army teams were immediately dispatched to the site,” it said. “After relentless efforts, all the trapped workers were safely rescued,” the report added.\n\nMining in Swat’s lush mountains, particularly for emeralds, has long been criticised for poor regulation and inadequate oversight, often putting the lives of workers at serious risk.\n\nThe current incident has once again brought attention to the pressing need for standardised safety frameworks and proper training for mine workers in the region.\n\nOver the last decade, the mining industry in Swat has seen a boom, with around 350 crush plants established along the path of the 240km-long river, from Kalam to downstream Kanju.\n\nIn November, two workers were killed after elevator in an emerald mine collapsed. The tragic incident occurred when an elevator rope snapped, causing two workers to fall to their death.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/071113310d2a749.png",
  "retrievedAt": "2025-08-16T07:11:49.562Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929287/all-4-workers-rescued-after-emerald-mine-collapse-in-swat-rescue-officials",
  "dateList": "2025-08-07",
  "date_published": "2025-08-07T06:24:20.000Z"
}
