{
  "title": "Patel pays tribute to 370,000 polio workers on World Polio Day",
  "link": "https://www.app.com.pk/national/patel-pays-tribute-to-370000-polio-workers-on-world-polio-day/",
  "date_published": "2022-10-24T13:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): Minister for Health Abdul Qadir Patel said on Monday that polio workers have supported Pakistan through the most difficult times and in the most challenging circumstances, from COVID-19 vaccinations to flood relief efforts.\nHe expressed thee views while addressing a ceremony to pay tribute to over 370,000 workers protecting millions of Pakistani children from polio. the ceremony was held to mark the World Polio Day 2022 with the theme ‘A healthier future for mothers and children’, the Pakistan Polio Programme honoured ten outstanding Polio Front Line Health Workers for excellence in performance.\nThe minister said, “The women health workers who lead eradication efforts for polio were protecting children in Pakistan and children all over the world from preventable, lifelong paralysis.”\nHe said Pakistan has made great strides in the fight against polio with virus circulation reduced to only one small part of the country. “If we can eliminate the polio virus from southern KP, we will succeed in eliminating polio from Pakistan altogether.\nWe are actually quite close to the finish line and we are determined to get there as soon as possible.”\nThe minister thanked the international community, donors and Global Polio Eradication Partners for their support in the fight against polio as well as parents and caregivers for recognizing the importance of protecting their children from the virus. He particularly mentioned Rotary for their stalwart support over many years.\nHe also launched a sub-national polio campaign by administering polio drops to children. During this five-day campaign, over 25 million children under five years of age will be vaccinated in 83 districts of Pakistan, including southern KP where the current outbreak was reported.\nSince the Polio Eradication Programme was launched in 1994, there has been a massive decline in polio cases in Pakistan, where approximately 20,000 children were paralyzed every year in the early 1990s.\n“It is rare to see the level of dedication anywhere else as we see in polio teams. Polio workers were affected by the floods, many had their homes damaged and destroyed but they still reached children with the life-saving vaccine,” said National Emergency Operations Centre (NEOC) Coordinator Dr Shahzad Baig.\n“With continued support from our health workers, parents and the community, I am certain that we can make this disease history,” Dr Baig added.",
  "retrievedAt": "2025-08-11T15:47:11.787Z"
}
