{
  "title": "Conference on ‘Applications of Nuclear Techniques for Sustainable Socio-economic Development’ kicks off",
  "link": "https://www.app.com.pk/national/conference-on-applications-of-nuclear-techniques-for-sustainable-socio-economic-development-kicks-off/",
  "date_published": "2022-10-24T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): Three-day International Conference on the ‘Applications of Nuclear Techniques for Sustainable Socio-economic Development’ being arranged by Pakistan Nuclear Society (PNS) kicked off here on Monday at a local hotel.\nThe conference was aimed at highlighting the peaceful use of nuclear technology in different disciplines of science to attain sustainable socioeconomic development.\nThe conference was attended by intellectuals from different backgrounds including national and international scientists, people from academia and government officials.\nThe welcome address was delivered by Conference Secretary, Waqar Ahmad Butt while President PNS, Dr. Muhammad Tahir Khaleeq gave introductory remarks regarding the conference and introduced the PNS to the audience.\nTwo lifetime achievement awards were given to Muhammad Naeem, N.I, H.I, S.I, former Chairman Pakistan Atomic Energy Commission (PAEC) and to Ghulam Nabi, N.I, H.I, S.I, former Member Technical PAEC.\nChairman Senate Standing Committee on Defence, Senator Mushahid Hussain Syed was the chief guest in the inaugural session.\nIn his speech, Mushahid Syed appreciated the initiative taken by the PNS for holding a conference on a subject of vital importance.\nIn his remarks, Mushahid Syed pointed out how nuclear technology can be a very constructive and an extremely destructive tool, however, he reassured Pakistan’s commitment to the peaceful use of nuclear technology. Mushahid Syed also pointed out several sectors where Pakistan is using nuclear technology to improve the livelihood of people and support different sectors of industry with great emphasis on the energy, agricultural and medical sectors.\nThe chief guest appreciated PNS work for promotion of nuclear research that is eventually going to benefit millions of people in Pakistan and globally.\nThe conference will include a thematic session, and seven presentation sessions including a Women in Nuclear (WIN) session dedicated to women specifically covering around 40 presentations highlighting several advancements in the peaceful use of nuclear technology for achieving sustainable development.\nThe conference also includes a first of its kind session from the PNS platform dedicated to students who are interested in nuclear science.\nPakistan Nuclear Society (PNS) is a non-commercial non-government professional body of nuclear scientists in Pakistan and was formed in 1990 with the objective to promote peaceful uses of nuclear technology in various sectors including power generation, health, agriculture, industries and so on.\nEach year PNS holds several events in different centers, public sector organizations and other departments and forums including social gatherings and scientific events alike. PNS may act as a bridge between the public, industry and nuclear related public sector organizations.\nBased on this idea, PNS has recently launched a chapter to establish a student wing that in terms will help build a bridge between young students and nuclear technology.PNS already holds a women’s wing namely Women in Nuclear (WIN) aimed to promote women’s activities in the nuclear sector.",
  "retrievedAt": "2025-08-11T15:47:08.801Z"
}
