{
  "title": "Child education imperative for progress of country: Begum Samina",
  "link": "https://www.app.com.pk/national/child-education-imperative-for-progress-of-country-begum-samina/",
  "date_published": "2022-10-24T14:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): First Lady Begum Samina Alvi Monday said education of young generation was imperative for progress of the country.\nSpeaking at an event here for the children of schools organized by Lift Welfare Foundation, she said education and training of the new generation was guarantee for development of a country.\nShe underlined the need for encouraging informal education.\nShe said she was happy to see smiling children before her in the audience.\nThe first lady said out of school children should be enrolled so that they could better earn their livelihoods in future and play their role in the progress of the country.\nAccording to a report of the UNICEF, 22.8 million children aged 5 to 16 were out of schools which was a matter of concern, she added.\nDespite our limited resources, ways should be found to provide education to these out of school children, she asserted.\nShe emphasized that girls education should be given priority, adding she always encouraged steps for education for out of school children.\nShe called for measures to increase literacy rate in the country.\nShe said children should be taught positive values of the society and saved from the menace of drugs.\nShe assured of her support for education of out of school children.\nPresident of the Lift Welfare Foundation Arooj Malik, Chief Executive Officer Asma Malik and Uzma Toufeeq also spoke on the occasion and informed about the aims and objectives of their foundation.\nThey urged the government to patronize the organizations which were contributing to the cause of education for the out of school children.\nTheir foundation was imparting education to hundreds of children who were out of school, they added.\nThey told about the efforts made by them to not only provide education to children but also make them responsible members of the society by engaging in different activities.\nAt the end, Begum Samina Alvi awarded shields and certificates to different personalities and school children.",
  "retrievedAt": "2025-08-11T15:47:09.248Z"
}
