{
  "title": "President for effective steps to enroll out-of-school children in schools",
  "link": "https://www.app.com.pk/national/president-for-effective-steps-to-enroll-out-of-school-children-in-schools/",
  "date_published": "2022-10-24T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): President Dr. Arif Alvi on Monday urging the need to take effective steps for enrolling out-of-school children (OSCs) in schools, said that human resource development was the lynchpin to the socioeconomic development of any country.\nHe underlined the need to improve human development indicators, especially those related to literacy and primary education, besides adopting innovative Information & Communication Technology (ICT) tools for enhancing the skill set of youth in the country.\nThe President expressed these views while talking to Chairman of the National Commission for Human Development (NCHD), Col. (R) Dr. Amirullah Marwat, who called on him here at Aiwan-e-Sadr, a press release issued here by the President’s Media Wing said.\nTalking to the Chairman NCHD, he emphasized the need to ensure the provision of education to out-of-school children, particularly female students, to enhance the country’s literacy rate. He added that the number of OSCs in Pakistan was estimated to be around 20 million.\nThe President also urged the Chairman NCHD to work on adult education and nonformal basic education to increase the country’s literacy rate. He added that the mosques could be used for adult literacy programmes between Fajr and Zuhr prayers with the help of Ulema.\nChairman NCHD briefed the President that the Commission was working to promote human development by supporting the government’s line departments and different non-governmental organizations working in the social sector.\nHe said that NCHD had launched a mega project of 3000 adult literacy centres with the financial support of the Pakistan Human Development Fund (PHDF) in addition to 100 Madrasa schools based on the Accelerated Learning Programme (ALP) syllabus.\nHe also informed the President about NCHD’s agreement with Benazir Income Support Programme (BISP) to enrol 3 million OSCs in the country. He added that under the initiative, NCHD had enrolled over 1.4 million OSCs so far.\nEarlier, the Chairman NCHD also presented the Commission’s Annual Report for the year 2021 to the President.",
  "retrievedAt": "2025-08-11T15:47:08.520Z"
}
