{
  "title": "ECP issues detailed judgment of Toshakhana reference",
  "link": "https://www.app.com.pk/national/ecp-issues-detailed-judgment-of-toshakhana-reference/",
  "date_published": "2022-10-24T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): The Election Commission of Pakistan (ECP) on Monday issued its detailed judgment in Toshakhana reference that led to the disqualification of PTI Chairman Imran Khan.\nThe detailed order carrying the signatures of all five members of the bench comes after PTI had raised objections over the delay in its release. The ECP’s five-member bench headed by the Chief Election Commissioner Sikandar Sultan Raja unanimously ruled against the former prime minister.\n“As per the statement of Imran Khan, he had purchased the gifts from Toshakhana paying Rs 21.564 million while the Cabinet Division has declared that the gifts had a value of Rs 107.943 million,” according to ECP judgment. The commission, in its judgment, stated that the PTI chief was no more a member of the National Assembly and deemed his response “not correct”.\nThe 36-page order noted that the petitioners submitted that the respondent did not disclose gifts and precious items which he acquired from foreign dignitaries in the statement of assets and liabilities filed before the ECP from the year 2017-2021.\n“The amount allegedly received in his bank account does not commensurate with the assessed value of the gift items. Hence, the respondent has filed false statement and incorrect declaration in material particular for the financial year 2018-19,” reads the detailed judgment.\nThe list attached with the reference clearly shows the nature of gift items which included flower vases, watches, cufflinks, and decoration pieces. According to the rules 6(i) the gift items can be retained if the price of the item is less than Rs30,000/- and where the valued amount is more than Rs30,000 can be retained subject to deposit of 50% of the value amount of gift received.\nIt was also mentioned that it was the obligation of the respondent to declare complete details of the assets whether in the shape of gifts or amounts including the transfer of any assets to any during the financial year in the annual statement of assets and liabilities along with details and its cost value in a column in column number 2 and 3 of Form-B (remarks).\n“The commission has the jurisdiction to inquire into any matter or objection raised by any person including a reference from Speaker against any member of the Parliament or an assembly regarding concealment, false or mis-declaration in the statement of assets and liabilities after 120 days,” the verdict reads.\nThe document mentioned that the disqualification of the members may be made under any law for the time being in force.“In the instant case Elections Act, 2017 is the relevant law, and the violation or non-compliance or mis-declaration made by any Member of Majlis-e-Shoora (Parliament) comes under the ambit of disqualification and the commission has the jurisdiction to adjudicate upon the question of disqualification on any of the grounds mentioned in Article 63(1).\nThe commission is also competent to direct filing of a criminal complaint under Section 190 for the violation of sections 137,167 and 173 of the Elections Act, 2017 which is a criminal liability while mis-declaration, false declaration, and concealment of assets also bear civil liabilities,” it reads.",
  "retrievedAt": "2025-08-11T15:47:11.631Z"
}
