{
  "title": "SAPM Malik visits leading Saudi company to explore prospects for Pakistani workers",
  "link": "https://www.app.com.pk/national/sapm-malik-visits-leading-saudi-company-to-explore-prospects-for-pakistani-workers/",
  "date_published": "2023-11-18T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): Special Assistant to the Prime Minister on Overseas Pakistanis and Human Resource Development, Jawad Sohrab Malik, has met with the leadership of Alfanar, a leading power and construction company in Saudi Arabia, to explore opportunities to increase employment for Pakistani professionals in the company’s upcoming projects.\nThe Chief Executive Officer (CEO), Sabah Al-Mutlaq, and Deputy CEO, Muhammad Al-Mutlaq, warmly welcomed the Special Assistant to the Prime Minister (SAPM). Alfanar, a leading power and construction company in Saudi Arabia with a workforce comprising 20 percent Pakistanis, aims to further strengthen the hiring of Pakistani professionals for upcoming projects.\nPakistan boasts a significant pool of skilled and experienced individuals across various sectors, including engineering, IT, healthcare, and hospitality.\nAccompanied by the Ambassador of Pakistan to Saudi Arabia, Ahmad Farooq, and Community Welfare Attachés, SAPM Malik emphasized the Pakistani government’s dedication to strengthening economic relations with Saudi Arabia. They are striving to create opportunities that are mutually advantageous for both nations.\nPakistan possesses a considerable pool of proficient and seasoned professionals spanning fields such as engineering, IT, healthcare, and hospitality. “I hold the belief that Pakistani workers have the potential to make noteworthy contributions to the realization of Saudi Arabia’s Vision 2030 development objectives.”\nCEO Sabah Al Mutlaq expressed admiration for the exceptional quality of Pakistani manpower and their valuable contributions to the Saudi economy. Anticipating future projects, the company looks forward to hiring more Pakistani workers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:34:15.871Z"
}
