{
  "title": "13th Pakistan Mountain Festival from Dec 2",
  "link": "https://www.app.com.pk/national/13th-pakistan-mountain-festival-from-dec-2/",
  "date_published": "2023-11-18T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP):All set to kick off a 10-day long 13th edition of Pakistan Mountain Festival to mark the International Mountain Day with the Margalla Hills Trail-3 hiking, cleanup, and mountain biodiversity talk here on December 2.\nIt would be followed by a live painting competition on the theme “Mountain Ecosystem” at the Fatima Jinnah Women University (FJWU) Rawalpindi on December 4. Other events will include an exhibition of paintings, Pakistan Mountain Youth Forum, screening of documentaries, and mountain products and cultural showcasing, a news release said.\nDevcom-Pakistan Executive Director Munir Ahmed who is the founder of Pakistan Mountain Festival, briefing about the series of events said: The festival will conclude with a grand combo of events including a conference on mountain conservation, sustainable tourism and cultural Heritage in the Changing Climate. Other attractions of the grand event will be mountain food stalls, handicrafts, folklore, and cultural and musical performances by the troupes from Gilgit, Baltistan, Hunza, Chitral, and Swat.\nMunir Ahmed said as many as twenty best professionals will be given away the 4th Pakistan Mountains Pride Awards (PAMPA) while some will receive Friends of Mountains Awards (FOMA). National Rural Support Programme (NRSP) and Pakistan Poverty Alleviation Fund (PPAF) have consented to support the grand ceremony of awards. The Pakistan Mountains Pride Awards (PAMPA) are dedicated to the five living legends in their fields and given to the best professionals who have devoted their lives to the mountains and its natives.\nThe Pakistan Mountains Pride Awards include one Agostino Da Polenza Mountain Conservation Award, four Shoaib Sultan Khan Mountain Community Development Awards, two Nazir Sabir Mountaineering Awards, one Ashraf Aman Sustainable Mountain Tourism Award, two Ustad Jan Ali Mountain Music Awards. PPAF launched four Small and Medium Enterprises (SMEs) awards last year. From this year onward, we are including the Raja Changez Sultan Himalayan Odyssey Award for the artist who has been passionately painting mountains over the years, Munir Ahmed said.\nSpeaking about the objectives of the Pakistan Mountain Festival (PMF) and Pakistan Mountains Pride Awards (PAMPA) Munir Ahmed said: Usually, we don’t see the gradual impact of climate change on life, livelihood and as stress on the ecosystems and natural resources until any big disaster happens. Only then, the mountains and its people get due attention. On the other hand, the mountain landscape and culture are changing too while the folklore and heritage also remain neglected. Not much is done to consistently mainstream the mountains downstream where the actual decision-makers are sitting. People living downstream play a key role for the mountain inhabitants. So, they shall constantly be reminded of the mountain issues, and the mountain culture and heritage conservation.\n“We are living in the era of climate change, evidently supported by science. Even those nations and sectors of industry who were in a state of denial have now accepted that climate change is happening very fast. Pakistan is one of the most climate-vulnerable countries, and in Pakistan, mountains and its women are the most neglected and vulnerable,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:34:40.882Z"
}
