{
  "title": "Maldives President Muizzu, Solangi discuss expansion of cooperation in various fields",
  "link": "https://www.app.com.pk/national/maldives-president-muizzu-solangi-discuss-expansion-of-cooperation-in-various-fields/",
  "date_published": "2023-11-18T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Saturday met with the newly-elected President of Maldives Muhammad Muizzu.\nIn the meeting, important issues of mutual interest including bilateral relations, economic cooperation and appointment of Ambassador of Maldives to Pakistan were discussed.\nOn behalf of Prime Minister Anwaarul Haq Kakar, the Government of Pakistan and the people of Pakistan, the information minister congratulated Muhammed Muizzu on his election as President and expressed his best wishes for him.\nDuring the meeting, both the leaders reiterated commitment to work together to promote regional cooperation.\nThey also expressed commitment to further strengthen mutual relations between the two countries\nThe caretaker federal minister of information extended invitation to President Muizzu to visit Pakistan which he accepted.\nThe President of Maldives thanked Murtaza Solangi for representing the Government of Pakistan at his swing in ceremony.\nPresident Muizzu said that Maldives would soon appoint its ambassador to Pakistan. He said that his country was desirous of further strengthening diplomatic relations with Pakistan.\nMinister for Information Murtaza Solangi said that Pakistan valued its relationship with Maldives. The two countries are linked by an unbreakable brotherly bond of devotion, he added.\nHe said that bilateral diplomatic relations between Pakistan and Maldives would further be strengthened in future.\nAs a member country of SAARC, he said Pakistan was committed to further strengthen bilateral cooperation with Maldives in all fields.\nForeign Minister of Maldives, senior officials of Maldives and High Commissioner of Pakistan Mohammad Fayyaz Gilani and senior officers were also present in the meeting.",
  "retrievedAt": "2025-08-11T10:34:16.859Z"
}
