{
  "title": "AWS outage, cable damage leave net users high and dry",
  "author": "Kalbe Ali",
  "content": "ISLAMABAD: As people around the world struggled with several popular apps due to a massive outage at Amazon Web Services (AWS) on Monday, users in Pakistan expressed frustration after another alleged ‘cable fault’ degraded internet speeds on certain internet service providers (ISPs) in Karachi and across the country.\n\nThe widespread outage of Amazon’s cloud services unit took down many popular internet services, impacting streaming platforms, messaging services such as Reddit and Snapchat, and some banks and businesses.\n\nAlso affected were Amazon’s Shopping, Prime Video service and Disney+, as well as Perplexity AI, the Fortnite game, Airbnb, Duolingo, cryptocurrency exchange Coinbase and trading app Robinhood.Advertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\nMobile telephone services and messaging apps Signal and Whatsapp were also affected in Europe, according to Downdetector, a website monitoring internet problems. Some UK banks, such as Lloyd’s were also impacted, and pointed to Amazon Web Services (AWS) as the problem.\n\nAfter few hours of disruptions, systems were gradually coming back online, with AWS saying it was seeing “significant signs of recovery” for some impacted services. AWS’s maintenance site said its engineers scrambled to fix the underlying DNS issue once they became aware of “increased error rates” hitting multiple services. More than four hours later, though some problems persisted, AWS said it was on the path “towards full recovery” and most of its operations were “succeeding normally”.\n\nThe DNS issue identified has to do with the Domain Name System protocol used on the internet to associate information with various domain names.\n\nAlthough the DNS problem was “fully mitigated”, it caused a huge backlog of stymied requests that had to be worked through, AWS said.\n\nMeanwhile, internet users in Pakistan complained of service degradation and slow browsing speeds on certain ISPs, which was once again attributed to a fault in the submarine cable.\n\nThere was no statement or acknowledgement from the ISPs in question, the IT ministry, or the regulator, Pakistan Telecommunications Authority.\n\nWhen approached for comment, IT Minister Shaza Fatima Khawaja attributed it to the global shutdown of Amazon cloud services. “Snapchat and other major apps [are] down due to Amazon web service outage worldwide,” she told Dawn.\n\nHowever, many internet users claimed they had been informed by their ISP that services were suffering due to cable damage. Taking to X, digital expert Habibullah Khan claimed that the disruption was due to a fault in the PEACE cable.\n\n“It’s a cable cut on the core system. They are running tests to localise the fault location,” he posted.\n\nThe PEACE cable system originates in China and connects to Pakistan.\n\nAccording to the Pakistan Telecommunication Authority (PTA), the cables landing in the country are operated by PTCL, Cybernet and TransWorld Associates.\n\nThree undersea cable networks operated by the PTCL are AAE-1 (Africa, Asia and Europe), SMW4 (South-East Asia-Middle East-Western Europe) and the IMEWE (India-Middle East-Western Europe).\n\nWith input from AFP, Reuters\n\nPublished in Dawn, October 21st, 2025\n\nCorrection: The text has been updated to rectify some facts pertaining to Pakistan’s cable networks.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/21074808f9a1034.webp",
  "retrievedAt": "2025-10-25T01:55:18.128Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950292/aws-outage-cable-damage-leave-net-users-high-and-dry",
  "dateList": "2025-10-25",
  "date_published": "2025-10-21T01:57:48.000Z"
}
