{
  "title": "NBA chief Silver ‘deeply disturbed’ by illegal betting scandal",
  "author": "AFP",
  "content": "NBA commissioner Adam Silver said Friday he was “deeply disturbed” by the illegal betting and gambling that has rocked basketball.\n\nIn his first public comments since the scandal erupted Thursday, Silver said the news struck him hard — “I had a pit in my stomach. It was very upsetting.”\n\n“My initial reaction was I was deeply disturbed,” Silver said in an interview with Amazon Prime during their coverage of the New York Knicks’ home game against the Boston Celtics on Friday.\n\n“There’s nothing more important for the league and its fans than the integrity of the competition.”\n\nUS authorities on Thursday arrested Miami Heat player Terry Rozier and Portland Trail Blazers coach Chauncey Billups as part of a nationwide investigation into sports betting and gambling.\n\nBoth were placed on indefinite leave by the NBA following the indictments.\n\nRozier and former NBA player Damon Jones were arrested for their alleged involvement in a betting scheme that prosecutors say provided inside information on injuries and game absences to bettors between December 2022 and March 2024.\n\nRozier was involved in a 2023 game when he was playing for the Charlotte Hornets where he left the game early due to a foot injury. He allegedly advised partners he would exit early, allowing them to wager heavily on him finishing below expected statistical levels in the game.\n\nThe NBA had said in January that it found no evidence Rozier violated league rules.\n\n“We then looked into that situation,” Silver said. “And while there was that aberrational betting, we frankly couldn’t find anything.\n\n“Terry at the time cooperated. He gave the league office his phone. He sat down for an interview and we ultimately concluded there was insufficient evidence, despite that aberrational behavior, moving forward.”\n\nWhile the NBA’s probe came up empty, federal prosecutors found enough evidence for charges.\n\n“We worked with law enforcement,” Silver said. “The league has been cooperating. That was over two years ago.\n\n“The federal government has subpoena power. They can threaten to put people in jail. They can do all kinds of things that a league office can’t do, so we’ve been working with them since then.”\n\nSilver noted that Rozier has not been proven guilty of anything.\n\n“What they announced yesterday was an indictment, so 2.5 years later, he still hasn’t been convicted of anything,” Silver said.\n\n“Obviously it doesn’t look good, but he has now been put on administrative leave and so you know there’s a balance here of protecting people’s rights and investigating.”\n\nBillups was not named in the sports betting indictment, but was charged with conspiracy to commit wire fraud and money laundering over his alleged involvement in what prosecutors called rigged poker games linked to the Mafia.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/25123940ba51685.webp",
  "retrievedAt": "2025-10-25T11:08:30.573Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951156/nba-chief-silver-deeply-disturbed-by-illegal-betting-scandal",
  "dateList": "2025-10-25",
  "date_published": "2025-10-25T07:40:05.000Z"
}
