{
  "title": "PTI announces ‘massive public rally’ in Karachi to kick off nationwide public engagement campaign",
  "author": "Imtiaz Ali",
  "content": "The PTI announced on Wednesday that a “massive public rally” would be held in Karachi during the month of November to kick off a nationwide public engagement campaign.\n\nA press release issued today said the decision was taken during PTI Secretary General Barrister Salman Akram Raja’s visit to Karachi. During his visit, he met party leaders, including PTI Sindh President Haleem Adil Sheikh, PTI Parliamentary Leader Shabbir Qureshi and Jamal Siddiqui.\n\nRaja held detailed discussions on the prevailing political situation, strategy for party founder Imran Khan’s release and organisational matters.\n\nAddressing the media after the meetings, Raja announced that a “massive public rally will be held in Karachi” in November, followed by similar gatherings in Hyderabad and other major cities as part of a nationwide public engagement campaign.\n\nThe senior PTI leader added that the party was united and mobilised for Imran’s release.\n\nHe informed those present that Mahmood Khan Achakzai had been nominated as opposition leader in the National Assembly and Raja Nasir Abbas in the Senate, while Sohail Afridi had been appointed the Khyber Pakhtunkhwa chief minister, terming the recent moves as symbolising “a wave of political renewal within PTI”.\n\n“We stand firm for the supremacy of the Constitution and the rule of law,” Barrister Raja said. “Truth and justice will prevail. All cases fabricated against Imran Khan are proving false in the courts. However, delaying tactics are being used to hinder justice, but these baseless cases will soon be over.”\n\nReiterating Imran’s message to the nation, Raja said: “Patron in Chief Imran Khan has urged the people to keep faith in Allah Almighty; victory always belongs to truth. He has directed the party to reach out to the public through rallies across the country to raise awareness against oppression and injustice.”\n\nExpressing grave concern over the situation in Sindh, Raja said that the PPP had “in the last 17 years … turned Sindh into ruins”.\n\nHe noted that from Karachi to the interior of the province, cities were in a state of decay, adding that lawlessness and insecurity had made life miserable for citizens.\n\nRaja said he had personally visited several cities of Sindh and found a “scene of desolation and hopelessness everywhere“.\n\n“Rampant corruption by the PPP has plundered Sindh’s public resources,” he asserted. “But the people of Sindh are now awake. Wherever we went, we witnessed overwhelming support for Imran Khan. The people of Sindh want change; they want a leader like Imran Khan: honest, brave, and dedicated to the nation.”\n\nImran, imprisoned since August 2023, is serving a sentence at Adiala Jail in a £190 million corruption case and also faces pending trials under the Anti-Terrorism Act related to the May 9 protests. The PTI has regularly raised concerns about the lack of access to the party founder and how family, friends and party leaders are hindered from meeting him.\n\nThe party said last week that Imran has offered to resolve the recent hostilities between Pakistan and Afghanistan and other issues if he is released on parole.\n\nThe party had also aired concerns earlier this month about Imran being transferred from Adiala Jail to some unknown location to prevent his access to his family and legal team.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/22172131cbb3503.webp",
  "retrievedAt": "2025-10-25T01:55:11.327Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950577/pti-announces-massive-public-rally-in-karachi-to-kick-off-nationwide-public-engagement-campaign",
  "dateList": "2025-10-25",
  "date_published": "2025-10-22T12:51:48.000Z"
}
