{
  "title": "No religious group backs TLP as ban takes effect",
  "author": "Kalbe Ali",
  "content": "• Interior ministry notifies fresh ban on group\n• First Barelvi group to be declared proscribed\n• Rana Sana claims TLP was created to ‘steal PML-N votes’, rules out negotiations\n• Tanzeemat Ahl-i-Sunnat raises concerns over mosque takeovers\n• SIC chief rejects ‘politics of violence’ under Barelvi banner\n\nISLAMABAD: With the government’s ban on Tehreek-i-Labbaik Pakistan (TLP) now in force, the once-influential religio-political group finds itself increasingly isolated as, unlike after the previous ban in 2021, no major religious or political party has come forward in its defence this time around.\n\nThe Ministry of Interior on Friday formally notified the ban on TLP, a day after the Punjab government’s proposal was ratified by the federal cabinet.Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%0:00Remaining Time -0:00MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nThe notification, SRO 2011(1) of 2025, highlighted that the TLP has been declared a proscribed organisation under Section 11B(1)(a) of the Anti-Terrorism Act (ATA) 1997 and placed on the Act’s First Schedule.\n\nThe party may appeal to a review committee comprising officers of the Ministry of Law and Justice and the Ministry of Interior within 30 days.\n\nThe National Counter Terrorism Authority (Nacta) has issued an advisory to all provinces, law enforcement agencies, the banking sector, the Election Commission and other stakeholders regarding restrictions applicable to entities listed on Schedule I.\n\nThese include sealing party offices; curbs on promotional material (literature, posters, banners, printed and digital content); a bar on press statements and press conferences; financial sanctions and prohibitions on financial support; and limits on political and social activity.\n\nMeanwhile, Adviser to the Prime Minister on Political Affairs Rana Sanaullah claimed on Friday that the TLP was “created in a bid to cut into PML-N’s vote bank”, Dawn.com reported.\n\nSpeaking to Geo News, Mr Sanaullah, in response to a question regarding TLP’s future as a political party and whether it was being kept as an option to be used against rival political parties, agreed that TLP had been used in the past for that purpose. The group “was created to steal votes from the PML-N’s vote bank”, he said.\n\nHowever, he denied that TLP’s current fate had anything to do with its previous use as a proxy group, stating that “it was up to the federal cabinet to decide on any dissolution plans”.\n\nThe TLP has become the third religio-political party, and the first from the Barelvi school of thought, to be declared proscribed. It’s also the first political party to be proscribed twice, as it was briefly banned in 2021 by the PTI-led government. That ban was lifted after the party reportedly pledged to renounce violence.\n\nAsked if the government was open to negotiating with the now-banned group if it provided any assurances, Mr Sanaullah said, “I think there can be no reassurance after you have already violated reassurances that were made previously”.\n\nOn a question on whether TLP can still contest elections as a political party, the PM’s aide said: “It is very difficult for a party to function while they are banned under the ATA” and maintained that “the party cannot take part in any elections”.\n\nEarlier bans under the ATA have targeted groups across the spectrum. Sipah-i-Sahaba Pakistan (SSP) and Tehreek-i-Jafria Pakistan (TJP) were banned in 2002. Both had sympathisers in political and religious circles.\n\nTJP remained part of the Muttahida Majlis-i-Amal (MMA) as well as the Milli Yakjehti Council (MYC). The SSP, with support largely within Deobandi networks and some former militant groups, later saw one of its leaders elected to the National Assembly.\n\nBy contrast, no major religious group from any of the country’s four main sects, nor any political party, has publicly extended support to the TLP following the latest decision.\n\nOne reason no group is backing the TLP is that most political and non-political organisations seem hopeful that the leaders and workers of the banned group would now join their original parties that they belonged to before 2015.\n\nFollowing the announcement, the Punjab government moved to seal and take over mosques linked to TLP supporters.\n\nHafiz Tahir Mehmood Ashrafi, member of the Council of Islamic Ideology (CII) and part of the first official negotiating team in 2021, opposed any move that would obstruct prayers.\n\nSocial media speculation suggested that mosques linked to Barelvi adherents might be handed over to Deobandi administrators. However, Mr Ashrafi later clarified that no such transfer would take place.\n\nThe Tanzeemat Ahl-i-Sunnat Pakistan — an umbrella body of almost all political and non-political groups of the Barelvi sect, but which the TLP never joined — raised concerns over mosque takeovers. Senior leader Mufti Gulzar Naeemi said they suspected the Punjab Auqaf Department’s actions.\n\n“After negotiations with the Islamabad administration and other districts of Punjab, all sealed mosques have been reopened for prayers, and where prayer leaders had gone into hiding, replacement clerics have been appointed by the Auqaf Department in consultation with Tanzeemat,” Mufti Naeemi said.\n\nTLP’s leadership originally belonged to the Sunni Ittehad Council (SIC). The late Allama Khadim Hussain Rizvi founded TLP in 2015, primarily focusing on issues related to the honour of the finality of Prophethood.\n\nSIC chief Sahibzada Hamid Raza said, “We have always objected to the politics of violence from any platform belonging to the Barelvi school of thought because it will be more harmful for the whole nation compared to the benefits achieved out of that struggle.”\n\nIn 2021, prominent figures Mufti Muneebur Rehman, businessman Aqeel Karim Dhedhi (AKD) and Saylani Welfare Trust Chairman Bashir Qureshi acted as guarantors for the TLP in talks that led to the lifting of the earlier ban.\n\nHowever, Mufti Muneeb has remained silent after the latest ban. Sources said Interior Minister Mohsin Naqvi recently met Mufti Muneeb and reminded him of the October 2021 undertaking that TLP would not take the law into its own hands or challenge the writ of the state.\n\nMr Ashrafi told Dawn that the TLP had “constantly violated its own commitments” and alienated senior clerics by “harassing or misbehaving” with them.\n\n“They ridiculed everyone who tried to pacify them; that is why nobody wants to speak on their behalf now,” he said.\n\nPublished in Dawn, October 25th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/25072820703838d.webp",
  "retrievedAt": "2025-10-25T11:11:18.286Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951097/no-religious-group-backs-tlp-as-ban-takes-effect",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T23:55:06.000Z"
}
