{
  "title": "Fact check: Viral video of Indian deputy COAS criticising politicisation of military is doctored",
  "author": "Fact Check By iVerify",
  "content": "Posts from pro-Pakistani accounts on social media platform X on Thursday circulated a video claiming to show Indian Deputy Chief of Army Staff (Strategy) Lt Gen Rajiv Ghai publicly denouncing the ruling Bharatiya Janata Party (BJP) and warning against the politicisation of the Indian Armed Forces. However, the video is doctored.\n\nA day ago, an X account, that appears to be anti-Indian based upon its previous posts and is known for repeatedly sharing AI-altered videos, posted a clip with the following caption: “Breaking News: Indian Lt Gen Rajiv Ghai comes out openly against BJP politics of Narendra Modi. Any politicisation or saffronisation of the armed forces will lead to a defeat in the morale of Indian Armed Forces. We will resist against all attempts to make Indian army subservient to Hindutva.”\n\nThe post gained over 45,000 views.\n\nThe transcript of the video is provided below:\n\n“As a senior officer who has devoted decades to the service of this uniform, I say this with deep concern. The growing influence of saffron politics is corroding the core values of the Indian Army. Our strength has always been rooted in discipline, unity, and constitutional duty, not in religious polarisation.\n\nWhen ideology starts dictating loyalty, it fractures morale, fuels internal distrust and weakens combat effectiveness. If this trend continues, we will not be defeated by an external enemy, but by the political poison spreading within our own ranks.“\n\nA post by another anti-Indian account gained over 35,000 views.\n\nThe same post was also reshared by other pro-military and Pakistani users on X, as can be seen here, here, here, here and here\n\nA fact-check was initiated to determine the veracity of the claim due to its virality and keen public interest in the purported political statement attributed to a senior Indian military officer.\n\nObserving the video showed visible and auditory inconsistencies, including unnatural facial movements, distortion around the head, mismatched lip-syncing and abrupt changes in background tone during the segment in which the Indian army official is allegedly criticising the BJP.\n\nAnalysing the audio of the video using the forensic tool DeepFake-Total, which detects potential manipulation throughout the audio spectrum, showed a Fake-O-Meter score of 89.1 per cent.\n\nThe score indicates a very high probability of AI-generated or synthetically altered content.\n\nA keyword and reverse-image search was subsequently conducted to trace the original footage, yielding a YouTube video uploaded on October 18, 2025, by Indian news channel Republic World with the following title: “Lt Gen Rajiv Ghai calls out Pakistan’s bluff, reveals details of Op Sindoor | Forces First Conclave.”\n\nIn the video, the Indian army official delivered an address about defence preparedness, counter-terror operations and technological modernisation. At no point did he discuss Indian domestic politics or make any remarks about the politicisation of the army.\n\nA news report by the outlet on the same date also reported the same and did not mention any criticism of the Indian army’s alleged politicisation.\n\nTherefore, the fact-check determined that the claim that a video shows Indian Deputy Chief of Army Staff (Strategy) Lt Gen Rajiv Ghai publicly denouncing the BJP and warning against the politicisation of the military is false. The clip is doctored and has been dubbed over through AI-generated audio.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/241843119b8bfb1.webp",
  "retrievedAt": "2025-10-25T01:54:21.260Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950971/fact-check-viral-video-of-indian-deputy-coas-criticising-politicisation-of-military-is-doctored",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T13:54:28.000Z"
}
