{
  "title": "Britain urges allies to bolster Ukraine’s  missile capability",
  "author": "AFP",
  "content": "LONDON: British Prime Minister Keir Starmer told Ukraine’s President Volodymyr Zelensky during a meeting in London on Friday that there was more that Western allies could do to bolster Kyiv’s long-range missile capability.\n\nStarmer hosted Zelensky at his Downing Street residence ahead of an in-person and virtual get-together of Ukraine’s key backers in the UK capital.\n\n“I think there’s further we can do on capability, particularly… long-range capability, and of course, the vital work for coalition of the willing when it comes to the security guarantees that are necessary,” the British leader said.Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%Remaining Time -UnmuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nKyiv’s Western allies have raised pressure on Moscow as the war enters its fourth winter, with the United States and European Union both announcing new sanctions this week on Russian energy aimed at crippling its war economy.\n\nThe EU leaders also took steps towards funding Ukraine’s defence for another two years, although they stopped short of greenlighting a mammoth “reparations loan” backed by frozen Russian assets.\n\nStarmer hugged Zelensky as the Ukrainian president arrived in Downing Street for initial one-to-one discussions ahead of the “coalition of the willing” meeting, telling him this week had seen “huge steps forward”.\n\nNato Secretary General Mark Rutte, Denmark’s Prime Minister Mette Frederiksen and the Netherlands’ Dick Schoof were set to attend the London summit, with other leaders, including French President Emmanuel Macron, joining virtually.\n\nZelensky held another meeting with Britain’s King Charles III — their third this year — on Friday.\n\nThe Ukrainian national anthem played at the almost 1,000-year-old Windsor Castle, west of London, before he had an audience with the king.\n\nThe latest diplomatic activity followed Zelensky’s visit to Washington last week, when President Donald Trump rebuffed his pleas for long-range Tomahawks to hit targets deep inside Russia.\n\nThe nearly four-year war continues to grind on despite US and European efforts to force Russian President Vladimir Putin to the negotiating table, with Moscow battering Ukraine’s energy grid this week in deadly drone and missile attacks.\n\nStarmer also urged European leaders to “finish the job on Russian sovereign assets to unlock billions of pounds to fund Ukraine’s defences”, Downing Street said in a statement.\n\nIt came a day after EU leaders asked the European Commission to move ahead with options for funding Ukraine for two more years, leaving the door open for a 140-billion-euro ($162bn) “reparations loan”.\n\nThe EU froze around 200bn euros of Russian central bank assets after Moscow’s tanks rolled into Ukraine, and the European Commission has proposed using the funds to provide a huge loan to Kyiv — without seizing them outright.\n\nBut the plan has faced strong objections from Belgium, where the bulk of the frozen Russian assets are held, over the legal consequences.\n\nPublished in Dawn, October 25th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/250846498363c51.webp",
  "retrievedAt": "2025-10-25T11:11:01.739Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951086/britain-urges-allies-to-bolster-ukraines-missile-capability",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T23:57:35.000Z"
}
