{
  "title": "Govt moves to dissolve 2 state firms",
  "author": "Mubarak Zeb Khan",
  "content": "ISLAMABAD: The Cabinet Committee on State-Owned Enterprises (CCoSOEs) has approved the closure of two state-owned entities and ratified the appointment of boards of directors for several other government departments, as part of ongoing institutional reforms and restructuring efforts.\n\nThe meeting, chaired by Finance Minister Muhammad Aurangzeb, approved a summary from the Ministry of Housing and Works on the transition plan for the dissolution of National Construction Ltd and Pakistan Environmental Planning and Architectural Consultants (Private) Limited (PEPAC).\n\nAn official announcement from the Ministry of Finance issued on Friday said that the plan provides a comprehensive framework for the efficient winding-up of both entities and the management of their residual functions.\n\nThe committee also reviewed and approved several key summaries submitted by various ministries and divisions, focusing on governance reforms, board appointments, and the classification of state-owned enterprises (SOEs) in accordance with the SOEs (Ownership and Management) Policy 2023.\n\nCabinet panel ratifies new boards for PTV, State Life and PIM\n\nThe committee approved a summary from the Ministry of National Health Services, Regulations and Coordination for the appointment of independent directors to the Board of Jinnah Medical Complex and Research Centre Company Ltd, aimed at improving governance and oversight.\n\nThe committee also endorsed a summary from the Ministry of Commerce for the reconstitution of the board of directors of the State Life Insurance Corporation of Pakistan to strengthen corporate governance and support effective management in line with the broader privatisation roadmap for the organisation.\n\nThe meeting approved a summary submitted by the Ministry of Industries and Production for the reconstitution of the board of governors of the Pakistan Institute of Management (PIM), Karachi, to enhance professional and managerial training standards.\n\nAdditionally, a summary from the Ministry of Information and Broadcasting for the reconstitution of the Board of Pakistan Television Corporation (PTVC) received approval.\n\nThe move aims to strengthen corporate governance and foster greater transparency in the state broadcaster’s operations.\n\nThe committee reviewed and approved two key summaries submitted by the Petroleum Division.  The first summary addressed the nomination of directors and appointments to fill casual vacancies on the Boards of Inter-State Gas Systems Ltd, Pakistan State Oil Company Ltd and the reconstitution of the board of directors of Sui Southern Gas Company Ltd.\n\nThe committee directed that all government-nominated directors on SOE boards must complete mandatory corporate governance training within six months before assuming their roles.\n\nThe second summary concerned the classification of petroleum-sector state-owned enterprises as strategic and essential. Following detailed discussion, the committee formed a sub-committee — chaired by the Minister for Petroleum and comprising the Prime Minister’s Advisor on Privatisation and Secretaries of Petroleum, Finance, and Privatisation — to examine the proposals and report back with recommendations.\n\nPublished in Dawn, October 25th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2507513331af91b.webp",
  "retrievedAt": "2025-10-25T11:10:23.309Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951115/govt-moves-to-dissolve-2-state-firms",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T23:58:32.000Z"
}
