{
  "title": "US aircraft carrier in South America amid Venezuela tensions",
  "author": "Reuters",
  "content": "WASHINGTON: President Donald Trump dramatically escalated a US military buildup in the Caribbean on Friday by deploying the Gerald Ford aircraft carrier group to South America, a show of force that far exceeds any past counter-narcotics need and represents Was­hington’s most muscular move yet in the South America region.\n\n“The enhanced force presence will bolster US capacity to detect, monitor, and disrupt illicit actors and activities that compromise the safety and prosperity of the United States homeland and our security in the Western Hemis­phere,” Pentagon spokesperson Sean Parnell posted on X.\n\nHe did not specify when the carrier would be moving to the region, but as of a few days ago, the carrier was travelling via the Strait of Gibraltar and in Europe.\n\nThe deployment is part of Trump’s military buildup in the Caribbean, which includes eight additional warships, a nuclear submarine, and F-35 aircraft. It is likely to raise concern in the region about the Trump administration’s intent.\n\nThe US military has carried out 10 strikes against alleged drug vessels, mostly in the Caribbean, since early September, killing about 40 people. While the Pentagon has not given much information, it has said some of those killed are Venezuelan.\n\nVenezuelan President Nicolas Maduro has repeatedly alleged that the US is hoping to drive him from power.\n\nWashington in August doubled its reward for information leading to Maduro’s arrest to $50 million, accusing him of links to drug trafficking and criminal groups that Maduro denies.\n\nThe assembly of military firepower far outstrips any imaginable requirement by the US military to strike individual drug targets on land or at sea.\n\nThe Ford, which was commissioned in 2017, is the United States’ newest aircraft carrier and the world’s largest, with more than 5,000 sailors aboard.\n\nPublished in Dawn, October 25th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2509124555914e6.webp",
  "retrievedAt": "2025-10-25T11:11:04.645Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951083/us-aircraft-carrier-in-south-america-amid-venezuela-tensions",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T23:57:35.000Z"
}
