{
  "title": "Teaching as profession",
  "author": "Faisal Bari",
  "content": "SHEHLA completed her Master’s degree in economics last year and started teaching at a private school in her neighbourhood. She feels she will not be staying in the job for long. Her salary is only Rs20,000 per month. She thinks she will be married soon and might not work afterwards. Or if she has to work, she will look for a job that pays better. Low- to medium-fee private schools, which constitute the overwhelming majority of private schools operating across Pakistan, mostly pay teachers around Rs18,000 to Rs24,000 per month. Keep in mind that the minimum wage for unskilled work in Pakistan is now around Rs40,000 per month.\n\nDurdana is a teacher at a high-fee private school. Her salary is around Rs60,000. She feels this is not enough. But both her children are enrolled in the same school at half the tuition fee (employee discount). She is likely to stay in teaching till her children have moved beyond school level.\n\nSalaries for teachers in the public sector are better than they are in the private sector. Primary school teachers make more than the minimum wage, and those in grade 17 or above take home over Rs100,000 a month. But, for a teacher to treat teaching as a long-term prospect, even this amount may not be enticing for a lot of young people. Though teachers are covered under the minimum wage legislation across almost all provinces, or should be, most of the private sector does not pay them the requisite minimum. Punjab’s education minister has said a number of times that teachers in the private sector are paid in accordance with the law. His interpretation is that since teachers work fewer hours than other workers, their salaries are determined accordingly. Clearly, the minister is just covering for the fact that the government does not want to or is unable to ensure the minimum wage for teachers.\n\nSchool timings are from 8am to 2.30pm these days. Schools require teachers to be present at school from 7.30am to 3pm. This makes it a 7.5-hour workday. The regular workday is eight hours. How is teachers’ worktime shorter? In addition, most teachers take grading and class preparation home. They have to as they do not have time to do it during their teaching hours. In fact, most school teachers I know, put in 10-odd hours. The minister is plainly wrong or is just pretending.\n\nWhy would the best minds in the country want to turn to teaching?\n\nBut leaving the hours issue aside, if teachers are to be paid so little, what should they do to supplement their income? Clearly Rs20,000 to Rs40,000 is not enough for a household. Should teachers take on another job in the many ‘free’ hours, à la the minister, that they have on their hands. Teachers know how to teach, but if they start coaching or giving tuitions in the evening, people aren’t happy with that either. They don’t want the ‘coaching’ or ‘tuition’ culture for their children.\n\nEven the government discourages that for public sector teachers. So, what should teachers do? Get a non-teaching job in the evenings? We have about two million teachers working in Pakistan currently. What sort of evening jobs should they look for? Youth unemployment for Pakistan is at its highest level historically. The economy is not and has not been growing by much in recent years. Are there enough (second) job opportunities out there?\n\nThere is a strong gender angle to this discussion as well. Women are, probably, a majority in the teaching profession in Pakistan. It is, likely, the only profession that has a female majority. Pakistan has one of the lowest female labour force participation rates internationally and even in the region. Teaching is one profession a lot of women are able to join and which is more ‘acceptable’ in our context. How do women who work as teachers — and it is one of the few professions that is acceptable for women to work in — find jobs in sectors other than teaching to make a decent level of income? This cannot and will not happen.\n\nCurrently, it seems, the state, the governments in power and the people, are quite comfortable ‘exploiting’ the labour of educated women in Pakistan for the education sector. We have (created) a context in which most women are not able to work, by design or default, in many other sectors. Teaching seems to be an acceptable option for many females and their families. This creates a supply level that allows the private sector to pay market clearing wages but these wages are below the minimum wage level. We do not allow this to happen in other areas irrespective of the conditions of supply and demand. But here we are happy to do that and some even try to justify it.\n\nWhat is not thought through is that if teaching does not even give minimum wage returns, why would the best minds want to become teachers. They do not. But if we do not get the best minds to be teachers, how will we prepare the next generation of Pakistanis? How will teaching become a profession if returns are so low? On the one hand, governments do not want to ensure even minimum wages, while on the other, some provinces are talking about licensing teachers. Licensing is supposed to control and improve quality, but if teachers cannot even get the minimum wage, how can licensing help create quality?\n\nMonetary returns in teaching are low. Most private sector teachers do not make the minimum wage level and the government seems to be happy with it, not wanting to disturb the current equilibrium in the market. The equilibrium works for schools and the government but does not work for teachers, for improving the quality of education or making teaching an attractive profession. But governments seem to be happy trading off short-term calm at the cost of medium- to long-term benefits of decent opportunities in teaching. The teachers, mostly women, are the ones paying the cost and will continue to be ‘exploited’, it seems, for the foreseeable future.\n\nThe writer is a senior research fellow at the Institute of Development and Economic Alternatives and an associate professor of economics at Lums.\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68fae69d0d222.jpg",
  "retrievedAt": "2025-10-25T11:11:29.783Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950919/teaching-as-profession",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T02:41:04.000Z"
}
