{
  "title": "Court clears Turkiye opposition leader",
  "author": "AFP",
  "content": "ANKARA: Turkiye’s emb­a­ttled main opposition CHP, which faces a string of legal challenges, won some respite on Friday when an Ankara court threw out a lawsuit that could have ousted its leadership.\n\nThe case, which centred on alleged vote buying at its 2023 leadership primary, is one of a growing number of prosecutions targeting the Republican People’s Party (CHP) that critics say are politically motivated.\n\nThe lawsuit sought to overturn the result of the primary that elected Ozgur Ozel and could have ousted him as party leader.Advertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\nIt was thrown out by the court on the grounds that one of the complainants was ineligible to file the lawsuit and that the basis for the case had become moot since the CHP had since held a fresh vote, re-electing its leadership.\n\nThe verdict triggered applause from spectators, among them a Ummu Gulsun Seyfi, 75, a party stalwart since 1977, who accused the government of political meddling “instead of dealing with people’s problems”.\n\nOnur Yusuf Uregen, a lawyer for the plaintiffs, said the result was a “surprise” and vowed to appeal.\n\nAlthough the full decision has not been released, CHP lawyer Ali Yigit Koca told AFP that the judge understood that subsequent party leadership elections meant there was no basis for the case.\n\n“The fact the CHP held an extraordinary congress in April must have convinced the judge to declare the procedure moot,” he said. The CHP held another leadership congress in September.\n\nOzel, who was reelected at both meetings, hailed the decision. “On one side, there is the government targeting democracy and seeking to eliminate the ballot box, on the other, the democrats who fight against it,” he said at CHP’s headquarters.\n\nPublished in Dawn, October 25th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2508085195d9f94.webp",
  "retrievedAt": "2025-10-25T11:09:05.172Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951101",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T23:56:35.000Z"
}
