{
  "title": "ECC flags food inflation, defers decision on used car imports",
  "author": "Mubarak Zeb Khan",
  "content": "ISLAMABAD: The Economic Coordination Committee (ECC) of the Cabinet on Friday reviewed rising prices of essential food items and approved technical supplementary grants totalling Rs3.089 billion for multiple ministries, including allocations for holding local government elections in 2025-26.\n\nThe ECC meeting, chaired by Finance Minister Muhammad Aurangzeb, also postponed a decision on allowing the import of used vehicles under three schemes designated for overseas Pakistanis. Additionally, the committee endorsed tighter oversight of the existing framework governing the import and export of precious metals and jewellery.\n\nAt the outset, Ministry of Planning Chief Economist Dr Imtiaz Ahmad made a presentation on inflation trends and price movements in the country, including the findings and recommendations of the National Price Monitoring Committee (NPMC).\n\nDr Imtiaz said inflation remained subdued prior to the recent floods, but surged to 5.6 per cent in September, driven by extensive damage to agricultural land and livestock. The disruption in supply chains led to a sharp uptick in food inflation, with the Sensitive Price Index continuing its upward trajectory through October.\n\nApproves Rs3.1bn in grants for elections, defence and security projects\n\nReferencing Pakistan Bureau of Statistics (PBS) data, he noted that while prices of select essentials — such as chicken, rice, and LPG — registered a decline, key staples including sugar, beef, cooking oil, and ghee saw notable increases.\n\nThe chief economist outlined a series of policy interventions under discussion by the NPMC to curb inflationary pressures. These included a sensitivity analysis of global price trends, strengthened coordination between federal and provincial authorities to address supply shortfalls, and targeted agricultural credit for farmers in flood-affected regions. He added that the Competition Commission of Pakistan had been directed to investigate potential cartelisation in the edible oil and ghee markets.\n\nHe further informed the committee that preparations were underway for a Ramazan price stabilisation initiative, with provincial governments being urged to leverage the PBS Decision Support System for enhanced market surveillance and price control.\n\nMr Aurangzeb emphasised the importance of sustained monitoring, enhanced coordination among relevant agencies, and timely interventions to safeguard the purchasing power of the public and ensure overall price stability.\n\nHe directed all ministries and provincial authorities to ensure the effective implementation of the recommended measures for price stabilisation and inflation control.\n\nSupplementary grants\n\nThe ECC approved measures to allow accredited and registered Pre-Shipment Inspection (PSI) agencies to conduct inspections in line with the framework under the Import Policy Order 2022. The committee deferred a summary of the commerce ministry regarding proposed amendments to the procedure for import of vehicles under the Personal Baggage, Transfer of Residence, and Gift Schemes.\n\nAfter detailed deliberations on various aspects of the proposal, the committee directed the Commerce Division to undertake further consultations with relevant stakeholders and resubmit the proposal. The committee approved continuation of the existing framework with enhanced transparency and automation measures to improve efficiency and traceability on the import and export policy for precious metals and jewellery.\n\nThe ECC approved two proposals submitted by the Defence Division, including a technical supplementary grant of Rs2.5bn for the establishment of the Pakistan Maritime Science and Technology Park under the Pakistan Navy. It also endorsed another grant equivalent to AED 45 million — available in rupee cover — for the Frontier Works Organisation (FWO) to settle an overdraft facility incurred during its overseas construction activities in the United Arab Emirates.\n\nThe Election Commission of Pakistan (ECP) sought a Technical Supplementary Grant of Rs455.984 million from the ECC to cover expenses associated with the conduct of Local Government Elections in 2025-26.\n\nThe committee approved the request. In a similar decision, the ECC endorsed the Finance Division’s proposal for a TSG of Rs112.118m to facilitate the installation of individual electricity meters in the Pakistan Mint Residential Colony.\n\nThe ECC approved a summary from the Ministry of Interior and Narcotics Control seeking a TSG of Rs21.5m for the procurement of spare parts for helicopter maintenance by Headquarters Pakistan Rangers (Punjab) during the current fiscal year.\n\nPublished in Dawn, October 25th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2508332193059a2.webp",
  "retrievedAt": "2025-10-25T11:10:15.402Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951114/ecc-flags-food-inflation-defers-decision-on-used-car-imports",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T23:58:32.000Z"
}
