{
  "title": "ENVIRONMENT: A SILENT MASSACRE IN JAND",
  "author": "Amjad Iqbal",
  "content": "In the early hours of an August morning, when mist still clings to the ground, the sound of axes and chainsaws echoes from village thickets across the south-western tehsil of Jand in Punjab’s northern Attock district.\n\n“By the time the sun is fully up, truckloads of timber have already left for markets far away,” says Muhammad Ramzan, a 62-year-old farmer from Kanni village, pointing toward a barren patch where a small forest once stood. “These trees took decades to grow, but only hours to fell,” he tells Eos.\n\nThis is a pattern across villages in Jand and adjoining areas in Attock, where an entrenched network of illegal loggers, transporters and middlemen — called the ‘timber mafia’ — is stripping the hillsides at a pace the land cannot recover from.\n\nWhile data remains limited, the Punjab State of Environment Report 2024 notes that forest cover accounts for only about three percent of the land, amounting to approximately 0.5 million hectares. The Global Forest Watch, an online platform that provides data and tools for monitoring forests, noted that in 2020 that Punjab had 107,0000 [107,000?] hectares of natural forest, extending over 0.52 percent of its land area, which was down by 125 hectares in 2024.\n\nA powerful timber mafia, protected by official collusion and lubricated with bribes, is denuding the landscape in the northern reaches of Punjab…\n\nFor Jand’s residents, this isn’t just environmental degradation — it’s an existential threat.\n\nWHY THESE TREES MATTER\n\nJand lies on the southwestern edge of Attock district, where the Salt Range gives way to semi-arid plains. The tehsil borders Mianwali to the south and Kohat to the west, with the Indus River flowing nearby.\n\nHere, trees are not ornamental — they are infrastructure. Their roots bind fragile soil, preventing landslides during monsoons. Their shade creates microclimates that allow small farms to survive harsh summers. Without them, the already difficult climate grows hotter and drier.\n\nThe consequences of the deforestation are already visible. Rainwater from seasonal rains, once absorbed by the forest floor, now rushes unchecked across bare slopes, causing soil erosion and washing away farmland. Wells that once sustained entire hamlets are running dry. Wildlife — jackals, porcupines, migratory birds — is vanishing as habitat disappears.\n\nFor women in poorer households, deforestation has meant longer, more dangerous walks to gather firewood. Naseem Bibi, a schoolteacher from a hamlet in Jand, says her students are missing morning classes. “Some of our girls help their mothers collect wood because the nearest stand of trees is now a two-hour walk away,” she tells Eos. “They return tired before school even begins.”\n\nShopkeepers in Jand’s small bazaars report business impacts. Summers are hotter, dust storms more frequent. “Our produce spoils faster now,” says a fruit vendor in Jand city. Others point out that customers complain that the quality of melons and peaches has gone down.\n\nOPERATIONS IN THE DARK\n\nThe timber mafia operates with brazen confidence. Under cover of darkness, trucks loaded with freshly felled wood rumble down unpaved tracks toward markets in Kohat, Swabi, Peshawar and beyond.\n\n“They come at night, always in groups, and they have people in the system who warn them about raids,” says Abdul Majeed, a farmer from a nearby village. “When I was young, this whole area was covered in trees,” he continues. “Now it’s just barren slopes and stones,” he tells Eos.\n\nInterviews with those involved reveal a sophisticated, cross-border operation. Sakhi Muhammad, a local labourer who works for Rs1,500 per day as a tree cutter, confirms that “most of the activities are carried out after sunset to save our skins from police, local administration and the forest department.” He outlines the supply chain: small logs are sold to local tobacco processing units mushrooming recently in the area, while big logs are transported to the neighbouring Khyber Pakhtunkhwa (KP) province.\n\nSamar Shah, a truck driver involved in the trade, tells Eos the network is largely run by outsiders. “All of the people in this business from chopping to transportation belong to KP,” he says, explaining that individuals from bordering districts such as Kohat have settled in the area to manage the illicit trade.\n\nTHE SCEPTRE OF COLLUSION\n\nLocal activists allege the timber mafia is able to operate because of corruption and political patronage. Bribes to avoid checkpoints, selective enforcement of forest laws, and underreporting of tree losses have become routine.\n\nWhen asked how trucks travel unchecked across provinces, Shah smiles and takes out a Rs1,000 currency note. “This piece of permit opens all roads from Motorway to GT road,” he tells Eos.\n\n“Everyone knows who is behind this,” says environmental campaigner Farhan Gul, “but when vested interests benefit, no one dares to stop them.”\n\nMalik Shabbir, a community elder from Jand, puts it more bluntly: “They know who is cutting the trees, they know when the trucks leave, but they pretend nothing is happening.”\n\nIjaz Khan, a forest department official in Jand, contests the claim, saying trees are properly numbered in official forest areas such as Jalwal. He tells Eos that timber transported between cities requires permits and permit fees are deposited in the national treasury. “Anyone found illegally chopping trees or transporting timber faces fines,” he adds. However, he acknowledges that neither the permit fees nor fines are high enough to discourage the practice.\n\nComplicating the enforcement picture is the trade in trees from private land. A local timber merchant, Asif Khattak, offers a glimpse into a potential loophole. He claims to only purchase, chop and sell “legal” timber from “personal jungles established by local landlords on their lands or farmhouses.” He points out there is no restriction on cutting down private property trees. Khattak identifies the local community and tobacco processing plants as his main buyers, with larger logs used for coal making[??] in nearby districts. This legal loophole allows vast quantities of wood to be cleared with little oversight, often providing a veil for illegally sourced timber.\n\nThe gravity of the situation is now drawing concern from higher authorities. Dr Rabia Noureen, the deputy director of the Environment Protection Agency (EPA) in Attock, terms the large-scale chopping of trees a “threat” to the environment and ecosystem of the area. She tells Eos that the EPA is collaborating with sister organisations, especially the forest department, local stakeholders and donors, to carry out large-scale tree-plantation drives to combat deforestation.\n\nEchoing this alarm at the national level is Malik Amin Aslam, a Pakistani environmentalist and former federal minister for climate change, who also hails from Attock. He tells Eos that the ongoing floods are a wake-up call to the government on the costs of unchecked deforestation. “Trees, especially old standing forests, are a lifeline for our resilience in this age of climate fury,” he says. “The government must take urgent notice of this ongoing massacre in Jand and apprehend the timber mafias active over there,” he adds.\n\nIn July this year, the Jand Bar Association passed a resolution condemning the “ruthless chopping of trees” and calling on authorities to halt illegal cutting. The association’s president, Advocate Nighat Shamim, also dismissed the forest department’s claim that timber is being cut to meet local fuel demand in nearby areas without natural gas supply.\n\nLocals are beginning to organise community watch groups and grassroots plantation drives but, without official backing, their efforts face long odds.\n\nIn the meantime, the people of Jand watch their horizon grow emptier with each passing year. The hilltops, once dotted with hardy crowns of acacia and keekar, now stand exposed — bare monuments to what was lost and what may never return.\n\n*The writer is Dawn’s correspondent in Attock. He can be contacted at \t\t\t*\n\nPublished in Dawn, EOS, October 19th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68f2f44e72406.jpg",
  "retrievedAt": "2025-10-25T01:54:17.146Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1949536/environment-a-silent-massacre-in-jand",
  "dateList": "2025-10-25",
  "date_published": "2025-10-19T03:14:08.000Z"
}
