{
  "title": "Pakistan, Afghanistan seek to firm up truce in Istanbul talks",
  "author": "Dawn.com | Reuters",
  "content": "A second round of talks between Pakistan and Afghanistan kicked off in Istanbul on Saturday, with Islamabad eyeing a “concrete” mechanism to monitor Afghan Taliban actions aimed at preventing cross-border terrorist attacks.\n\nToday’s meeting follows the first round of Pakistan-Afghanistan talks mediated jointly by Qatar and Turkiye in Doha on October 18-19.\n\nThe Qatar talks had come after days of fighting along the Pak-Afghan border — where trade is still closed — and strikes by Islamabad on Gul Bahadur group camps in Afghanistan. The agreement reached in Doha extended an initial 48-hour truce and resulted in a permanent ceasefire, as well as a commitment to reconvene in Istanbul to work on mechanisms for lasting peace and stability between the two countries.Advertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\nAccording to Afghan interim administration spokesman Zabihullah Mujahid, the Afghan delegation was to be led by Mawlawi Rahmatullah Najeeb, deputy minister at Ministry of Interior, Turkish news agency Anadolu reported.\n\nIslamabad has not said who it has sent to the talks. It was also not clear where exactly the negotiators were meeting in Turkey’s largest city, nor how long the talks would continue.\n\n“The remaining issues [with Pakistan] will be discussed in the meeting,” Mujahid said in a post on X last night, adding that the Afghan delegation had left Kabul for Istanbul.\n\n“Pakistan looks forward to the establishment of a concrete and verifiable monitoring mechanism in the next meeting to be hosted by Turkiye in Istanbul on Oct 25, 2025, to address the menace of terrorism emanating from Afghan soil towards Pakistan and prevent any further loss of life of Pakistanis,” the new Foreign Office (FO) spokesperson, Tahir Hussain Andrabi, said at his maiden weekly media briefing yesterday.\n\nIn essence, Doha produced the political breakthrough, while Istanbul is expected to operationalise it by defining what constitutes cross-border terrorism, how violations will be verified and how disputes will be resolved.\n\nThe Istanbul round offers an opportunity to move from temporary calm towards a structured, verifiable peace framework with mechanisms for monitoring, verification and sustained dialogue through technical committees.\n\nTurkish officials have indicated that a technical committee in Istanbul will review details of the ceasefire, inc­l­uding terrorism, migration and border security.\n\nAt the talks today, Pakistan is expected to seek concrete and verifiable commitments from the Afghan side to eliminate the threat of the banned Tehreek-i-Taliban Pakistan (TTP) from its territory, which Pakistan says uses Afghan soil to launch attacks across the border.\n\nThe agenda includes dismantling known TTP sanctuaries, arresting or expelling key figures and defining clear timelines and benchmarks for measurable action such as raids, arrests and destruction of safe houses.\n\nTo ensure implementation, Islamabad plans to propose mechanisms for intelligence-sharing, cross-border coordination and real-time monitoring of militant movements and financing.\n\nPakistan also supports establishing a third-party oversight structure, potentially co-chaired by Turkiye and Qatar, to verify progress and address non-compliance.\n\nAdditional priorities will include securing Afghan assurances against providing safe havens to hostile groups, strengthening border control, ensuring financial transparency on militant funding and holding regular review meetings to assess compliance.\n\nThe truce agreed in Doha has largely held, with no major terrorist attacks reported since, according to the FO.\n\n“We are taking part in the second round of talks in Istanbul with the same sincerity of purpose, with the same sincerity of intent with which we participated in Doha,” Andrabi said yesterday.\n\n“During the Doha talks, the basic focus was to stop the terrorist attacks from Afghan soil into Pakistan.\n\n“And in order to do that, we should have a verifiable, empirical mechanism to ascertain that the Afghan Taliban regime in Kabul is taking concrete actions to stop such attacks,” the FO spokesperson said.\n\nHe said the continuation of the ceasefire demonstrated the progress achieved in Doha.\n\n“In effect, the Doha talks and outcomes were fruitful. We would like the trend to continue in Istanbul and post-Istanbul,” Andrabi added.\n\nMeanwhile, Defence Minister Khawaja Asif said he believes Afghanistan wants peace but that failure to reach an agreement during talks in Istanbul would mean “open war”.\n\nAsif said there had been no incidents in the four to five days since the ceasefire was agreed, and both sides were complying with the truce.\n\n“We have the option, if no agreement takes place, we have an open war with them,” he said, adding: “But I saw that they want peace.”\n\nTurkiye’s deep counterterrorism experience against the Kurdistan Workers’ Party (PKK) and its familiarity with insurgent challenges along porous borders give Ankara both diplomatic credibility and practical insight into Pakistan’s difficulties with TTP sanctuaries inside Afghanistan.\n\nIts role is further strengthened by the longstanding Pakistan-Turkiye counterterrorism cooperation, including consultations held earlier this year.\n\nFor Pakistan, Turkiye represents a trusted partner capable of designing a mechanism that both sides can rely on, shifting the peace process from ad hoc diplomacy to institutionalised peace-building.\n\nIbraheem Bahiss, an International Crisis Group analyst in Afghanistan, termed the meeting “quite essential”. He told AFP that monitoring “mechanisms” could involve intelligence sharing on armed groups.\n\n“For example, Pakistan would give coordinates of where they suspect TTP fighters or commanders are, and instead of carrying out strikes, Afghanistan would be expected to carry out action against them,” Bahiss said.\n\nBut it was unclear if that would end the problem. “I’m not so hopeful that a technical mechanism will really address the fundamental drivers of this escalatory cycle,” he said.\n\nAdditional input from AFP",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/251058041b1a071.webp",
  "retrievedAt": "2025-10-25T20:47:03.564Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951149/pakistan-afghanistan-seek-to-firm-up-truce-in-istanbul-talks",
  "dateList": "2025-10-25",
  "date_published": "2025-10-25T06:25:07.000Z"
}
