{
  "title": "Pakistan’s Women’s World Cup campaign was doomed from the start",
  "author": "Abyan Amir",
  "content": "THE monsoon rains in Colombo, along with the incessant batting collapses, might have decided Pakistan’s fate at the Women’s World Cup, but the issues that underwrote their struggles on the field lie deeper.\n\nSkipper Fatima Sana had made no secret of her side’s lack of the 50-over experience after they lost to Australia midway through their campaign in a game they were on top for the first 20 overs. “We need to improve. If you are on top in the first ten overs, you need to be on top till the last ball,”  she said.\n\nA damning statistic that comes to mind is that before the World Cup Qualifiers in Lahore in April, Fatima’s side had not played a single One-day International since April of 2024 — 12 months of no ODI cricket in the lead-up to a World Cup year.\n\nThat, however, does not absolve the players of their individual responsibilities, especially since other South Asian teams also face similar challenges but still see tangible improvements in their on-field performances.\n\nBangladesh, for example, to whom the Green Shirts lost in their opening encounter comprehensively by seven wickets, had not seen any international cricket at all for the previous five months in the lead-up to the marquee tournament.\n\nTheir last encounter was against this very Pakistan side in the Qualifiers in April, where they had lost by the same margin to Fatima’s charges. However, come the World Cup, the Tigers brought their A-game and got a winning start.\n\nWhen it comes to individual responsibility, in cricket, the buck stops with the captain.\n\nAlthough Fatima led from the front with the ball, currently the fifth-highest wicket-taker of the tournament with 10 crucial scalps to her name — her form with the bat was more than found wanting.\n\nIn a young batting line-up where the team needed crucial contributions from their captain down the order, Fatima could not perform with the bat in a manner that her side required.\n\nComing into bat with her side in all sorts of trouble throughout the tournament, Fatima could only muster 39 runs throughout the tournament at a paltry average of 7.8 — a microcosm of the troubles plaguing her batting line-up.\n\n“When it comes to the batting performance, apart from a couple of players, there were no significant contributions,” former Pakistan Cricket Board Women’s Wing GM Shamsa Hashmi told Dawn.\n\nShe said that the intent was lacking in the team’s batting performance, adding that the coaching set-up should focus on developing more well-rounded batters.\n\nThe difference in priorities of the cricket board can also be judged from the fact that a month-long skills and fitness camp was held in Karachi in the lead-up to the World Cup did not involve a single nets session under lights.\n\nThe lights were turned on at the National Stadium in Karachi during the duration of the camp — albeit for the men’s team as they prepared for a T20I tour of Bangladesh.\n\nAlthough a series was arranged in Lahore in the lead-up to the marquee event against South Africa — the lack of preparation was evident once the ball started to jag around under the Colombo lights.\n\nThe lack of hard yards under lights worked in tandem with the decision after the opening match’s batting debacle to persist with the decision to bowl first — exposing a volatile batting order to extravagant movement upfront in more often than not overcast conditions in the Sri Lankan capital.\n\nTo add to the ignominy, most of the decisions off the field that led to this underpar performance will not receive the same level of attention as the decisions made on it.\n\nAs has been repeated ad-naseum after nearly every World Cup campaign — whether the men’s side or the women’s — there will be knee-jerk reactions and calls for the sacking of the captain and team management.\n\nHowever, although fixing individual responsibility is important — in the grander scheme of things — nothing will improve unless structural issues affecting cricket in general and women’s cricket in particular are taken up by the PCB.\n\nPublished in Dawn, October 25th, 2025\n\nThe author is a member of staff and has a concentration in political economy. They cover issues on the intersection of politics, economics and society and can be contacted on Bluesky: @abyanairwaveskhi.bsky.social\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/25125954dc5c52d.webp",
  "retrievedAt": "2025-10-25T11:08:15.860Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951066/pakistans-campaign-was-doomed-from-the-start",
  "dateList": "2025-10-25",
  "date_published": "2025-10-24T23:59:19.000Z"
}
