{
  "title": "Rising investments in Pakistan’s technology sector reflect influx of skilled entrepreneurs: Shibli Faraz",
  "link": "https://www.app.com.pk/national/rising-investments-in-pakistans-technology-sector-reflect-influx-of-skilled-entrepreneurs-shibli-faraz/",
  "date_published": "2021-10-26T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):Federal Minister for Science and Technology, Syed Shibli Faraz Tuesday said Pakistani start-ups had raised around $300 million so far this year which reflected influx of skilled entrepreneurs in the country.\nHe was addressing the Pakistan Tech Summit held in Istanbul, through a video link, a web portal related to Science and Technology reported.\nOver 200 entrepreneurs, technology experts and sector leaders are participating in the two-day event at the Istanbul Sabahattin Zaim University in the Turkish metropolis.\nFaraz said the Pakistan’s government was working to provide an environment for “start-ups to grow and compete.”\n“Start-ups do not exist in a vacuum and our efforts need to cover all the aspects if we want to realize our development journey,” he said.\nUnderlining the “immense opportunity” that Pakistan presents for growth in the technology sector, he said the country had worked to make doing business easier in a bid to “invite investments in the sector.”\nHe also noted that the way to growth for the sector would be to “forge collaborations,” with summit to “showcase Pakistani talent and to nurture the tech ecosystem.”\nAlso speaking at the event, the senior provincial science official from the northern Khyber Pakhtunkhwa province, said: “Technology is the present … maybe we are lagging behind. It is not the future.”\nOn his fifth trip to Turkey in five years, Atif Khan told participants that the two countries needed to focus on the technology sector.\n“Tech gives you the opportunity to get out of geographical boundaries and limitations,” he said. “It allows you to become a global citizen and compete in the international scenarios,” he said, underlining the need for “proper training.”\nPakistani exports in the information technology sector rose by 47% last year, noted Khan, while adding that with 60% of Pakistan’s population under 29 years old, the country must properly channel and utilize the skills of its people.\nHe invited Turkish investments in Pakistan’s IT sector and said: “Pakistan and Turkey have to collaborate. It is not an option for us … we have to collaborate.”Mehmet Fatih Kacir, Turkey’s deputy minister of information and technology, said such collaboration between the two countries was “a must for us to create a better world which is a mission for us.”\nShedding light on Turkey’s information technology and start-up sectors, as well as its National Technology Initiative, he said in his presentation that the country aimed to reach $1 billion worth in start-ups by 2023.\nMehmet Bulut, the rector of Istanbul Sabahattin Zaim University, said the university was set to open its on-campus techno park next month.\nBulut said that the technology sector was a big advantage for the two countries’ younger generation and large populations.\n“If we can prepare them (young people) with good education, good values, and with modern technologies, the future belongs to our geographies,” he told the participants.\nMuhammad Syrus Sajjad Qazi, Pakistan’s ambassador to Turkey, said the event was to help “build synergies” between the Pakistani and Turkish technology sectors, academia, and businesses.\nRepresenting the Islamabad-based tech firm SevenSol, Numan Ali Shah told Anadolu Agency that Pakistan and Turkey needed to develop a “proper tech community.”\n“It will help us in exchange of resources and expertise, which is a must,” he said.Shah said the government in Pakistan needed to intervene and push forward the information technology sector.\n“We have to meet the demands of the people,” he said, calling authorities to provide “critical support” for the entrepreneurship.\nZain-ul-Abideen, from Pakistan’s financial hub Karachi, said he was attending the summit to meet “passionate people” from the information technology field.\n“I’m here to meet passionate people from the (IT) field who have already done something big and such events motivate us,” said Zain-ul-Abideen, who represents the Geeks of Kolachi, a Pakistani mobile and web application developer.",
  "retrievedAt": "2025-08-11T21:31:39.627Z"
}
