{
  "title": "Pakistan, Saudi businessmen declare visit of PM beneficial for investment, trade",
  "link": "https://www.app.com.pk/national/pakistan-saudi-businessmen-declare-visit-of-pm-beneficial-for-investment-trade/",
  "date_published": "2021-10-25T19:38:00.000Z",
  "source": "APP",
  "content": "While talking to APP, they said the investors of Pakistan and Saudi Arabia were very interested in investment in each other’s countries.\nA businessman Khalid Raja while declaring visit of the prime minister as very significant, said holding of Pakistan Saudi investment forum was an important step.\nHe said countries gained confidence due to their trading relations as trade was of immense benefit and improved relations.\nEngineer Ghulam Safdar said the forum would create opportunities for investment for businessmen of both countries.\nThe efforts of the prime minister had opened opportunities and the investors were taking interest in the proposals of the government, he added.\nKhalid Gujjar said the PM had formulated farsighted policies for the traders who could now register their companies through one window operations\nThe concerns of the businessmen would reach the prime minister and his team through this forum.\nHe supported the idea of holding meetings of such forums where businessmen interact and get to know about the available opportunities for investment.\nSaudi businessman Sultan Saleh Alsudais said a lot of opportunities existed under the vision 2030 of Saudi Arabia especially in the sectors of construction, chemical and industrial production.\nHe said, “we are providing facilities to those who come for investment in Saudi Arabia. We provide information to investors and play the role of a bridge between the two countries.”\n“We invite Pakistani businessmen to invest in Saudi Arabia under the vision 2030.”\nHe expressed hope that Pakistani businessmen would invest in Saudi Arabia.“We have made it easy to acquire licenses for businesses and we also ask the Pakistan government to give similar facilities so that expatriate Pakistanis could invest in Pakistan.\nThe Saudi businessmen said Pakistan and Saudi Arabia had longstanding relations.The visit of prime minister Imran Khan would provide more possibilities for businessmen to make investments. Pakistan and Saudi Arabia were very close and had cooperated with each other in the progress and development of each other, he added.",
  "retrievedAt": "2025-08-11T21:31:45.082Z"
}
