{
  "title": "Gov’t making all-out-efforts to mitigate, impact of increased prices on common people: CM-Buzdar",
  "link": "https://www.app.com.pk/national/govt-making-all-out-efforts-to-mitigate-impact-of-increased-prices-on-common-people-cm-buzdar/",
  "date_published": "2021-10-26T12:22:00.000Z",
  "source": "APP",
  "content": "MULTAN, Oct 26 (APP):Chief Minister Sardar Usman Buzdar has said that government would soon unveil an incentive package to mitigate the impact of increased prices of commodities on  common persons’ life with a view to provide relief to them.\nHe said that the pandemic affected the economy of the whole world but Pakistan countered it by employing the best strategy.\nThe chief minister expressed these views during a visit to coronavirus vaccination center at the tank Chowk where he witnessed the vaccination process and reviewed arrangements for the ongoing Reach Every Door (RED) vaccination drive under execution in Multan like elsewhere in Punjab.\nTalking to media persons after visiting the corona-vaccination center, the chief minister Buzdar said that opposition was making unnecessary hue and cry and added that the government was strong and would continue to serve the people.\nHe said that south Punjab secretariat would be fully authorized to take decisions independently adding that all the departments would be shifted to south Punjab secretariat phase-wise.\nHe said that Punjab would achieve the target of vaccinating over 80 million people till December 2021 under the RED vaccination drive at an average of a million people per day. He said that the pandemic affected the economy of the whole world but Pakistan countered it by employing the best strategy.\nSardar Usman Buzdar said that the vaccination was the only way to rid the world of the novel coronavirus and added that Punjab had launched campaign to vaccinate people at their door step.\nHe said that 18000 mobile teams had been deployed for vaccinations to be done at their doorsteps by moving to door to door while another 4000 centers had been set up to enhance maximum vaccination coverage.\nThe Chief Minister Sardar Usman Buzdar has appealed the people to get themselves and their family members vaccinated against the coronavirus and cooperate with the teams operational for the purpose under the RED vaccination drive.\nThe chief minister was briefed by officials that 54 per cent vaccination target had been achieved and 100 per cent target would be achieved by Dec 2021.",
  "retrievedAt": "2025-08-11T21:31:39.589Z"
}
