{
  "title": "Situation alarming with new breast cancer patient every 13 minutes in Pakistan: Begum Alvi",
  "link": "https://www.app.com.pk/national/alarming-situation-with-new-breast-cancer-patient-every-13-minutes-in-pakistan-begum-alvi/",
  "date_published": "2021-10-26T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): Begum Samina Alvi, wife of President Dr Arif Alvi on Tuesday said every 13 minutes, a woman in Pakistan was being diagnosed with breast cancer with an alarming 45 percent mortality rate.\nSpeaking at an awareness seminar on breast cancer here at Islamabad Chamber of Commerce and Industries (ICCI), she said 90 percent of such women patients could recover from the disease with help of early screening and diagnosis.\nBegum Alvi said raising awareness among women about self-diagnosis could save thousands of precious lives as 0.1 million breast cancer patients were recorded annually in the country.\nNot only the women patients, she said, the painful disease with expensive treatment also affected their close ones in form of psychological and financial trauma.\nShe expressed satisfaction that her awareness drive about breast cancer was going on successfully across the country and urged the women to spread the word to at least their 10  women.\nShe mentioned that the President of Pakistan had written a letter to members of national and provincial assemblies to create awareness about breast cancer in their respective constituencies.\nSamina Alvi said the awareness campaign would not only limit to the month of October but would continue throughout the year.\nPresident ICCI Muhammad Shakeel Munir said breast cancer was spreading rapidly in Pakistan due to which 40,000 women died of the disease every year.\nHe urged the government to set up a national cancer registry to collect data for better prevention of the disease.\nOncologist, Shifa International Hospital Dr. Muhammad Farrukh, and Oncologist, Maroof Hospital, Dr. Yasser Rehman gave detailed presentations on the causes, symptoms, preventive measures, and treatment of breast cancer.\nSenior Board Member of Pink Ribbon Pakistan Sonia Qaiser briefed the participants about her organization’s efforts to create awareness about breast cancer.\nFormer Senior Vice President ICCI Fatima Azeem highlighted the efforts of the Chamber for the advancement of women.\nSenior Vice President ICCI Jamshed Akhtar Sheikh, Vice President ICCI Muhammad Faheem Khan, Chairman Founder Group Mian Akram Farid, and a large number of businesswomen attended the event.",
  "retrievedAt": "2025-08-11T21:31:39.472Z"
}
