{
  "title": "Youth Parliament in collaboration with MoFA to present song on Kashmir Black Day",
  "link": "https://www.app.com.pk/national/youth-parliament-in-collaboration-of-mofa-to-present-a-documentary-song-on-kashmir-black-day/",
  "date_published": "2021-10-26T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):Youth Parliament of Pakistan is going to present a documentary song in collaboration with the Ministry of Foreign Affairs (MoFA), which is based on the human right violations of past seven decades in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe song “Haan Main Kashmir Hoon” will be released on the occasion of Kashmir Black Day October 27, 2021.\nPresident Youth Parliament of Pakistan (YPP) Ubaid Qureshi said “Haan Main Kashmir Hoon” is a visual representation of human rights violations of seven decades to the world.\nThe Urdu lyrics of the anthem narrate the story of every Kashmir and are sung by the Executive Member of Youth Parliament Zohaib Zaman who is a Kashmiri patriot singer and he also released the Kashmiri language cultural song “NIGAROO” on the occasion of Kashmir Solidarity Day.\nVisuals of the documentary are recorded with the support of a partner bridge studio. All financial aspects are covered on a voluntary basis without any personality or brand support.\nIt is also a non-commercial and non-profitable song but it is a voluntary attempt of the Youth Parliament to express the spirit of patriotism for Kashmir. The purpose of this song is to rememorize the international community about their commitment to the right to self-determination and the vision is to highlight the human rights violations and the struggle of Kashmiris, under brutal administration by the Indian government in the past seven decades.\nUbaid added Anthem “Haan Main Kashmir Hoon” visuals consist of two parts. Initially, it presents the Human Rights violation while others present the struggle of Kashmiris for the sake of the right of freedom. He further said the song will represent the feeling of patriotism and express solidarity with the Kashmiri people, by narrating every Pakistani is Kashmiri.\nFurthermore, this anthem will be released by the Ministry of Foreign Affairs (MoFA) worldwide with English subtitles on the occasion of “Kashmir Black Day” to be observed by the Pakistanis on October 27.\nThe day would be observed as Kashmir Black Day, in commemorating the forced occupation by Indian security forces of the Jammu and Kashmir valley.\nYouth Parliament of Pakistan and Ministry of Foreign Affairs are trying their best to promote the volunteer initiative of Kashmiri youngsters.\nIt is the responsibility of every person to support and highlight the unsaid stories of Kashmiris.",
  "retrievedAt": "2025-08-11T21:31:39.571Z"
}
