{
  "title": "President stresses national cultural narrative to transform ‘diversity into unity’",
  "link": "https://www.app.com.pk/national/president-stresses-national-cultural-narrative-to-transform-diversity-into-unity/",
  "date_published": "2021-10-26T09:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): President Dr Arif Alvi on Tuesday said a cultural narrative of Pakistan defined by the ethos of tolerance and peace was need of the hour to bring the nation together and transform its cultural diversity into unity.\nAddressing at a conference themed ‘National Integration and Cultural Assimilation’ here at the Pakistan National Council of Arts, the president said Pakistan’s culture was a beautiful blend of customs and traditions from all provinces contoured by various ethnicities.\nThe two-day conference organized by the National Heritage & Culture Division under the Ministry of Education and Professional Training was joined by scholars from across the country to deliberate on the subject of national cultural integration.\nThe president said Pakistan’s culture was rooted in the notion of co-existence and harmony and emphasized giving a guideline to the nation to exhibit a culture of social acceptance.\nHe said an interplay of religion and desires could sometimes deviate oneself from the path of tolerance, adding that misery and conflict emerged whenever a certain belief was imposed on others.\nHe said the culture of Islam could anchor the social fabric of the country that emphasized harmony.\nHowever, he urged the nation to be mindful of those promoting terrorism and extremism in the garb of the same religion, thus fanning social conflicts.\nHe also called for promoting the message of Sufi saints that focused on tolerance to connect the hearts.\nPresident Alvi said Two-Nation Theory was the ideological basis of Pakistan that focused on the separate religious, cultural, and traditional identity of a nation.\nIn today’s India, he said, the Hindu extremist RSS was taking steps to erase the cultural identity of Muslims and warned that the situation could land the country into a cultural catastrophe.\nTo bring positivity to society, the president urged adopting a responsible approach by shunning the trend of fake news aimed at creating rifts among the nation.\nFederal Minister for Education Shafqat Mehmood said Pakistan’s cultural kaleidoscope comprised different customs, languages, and traditions with their unique beauty and colours.\nHe stressed the need for a shared narrative on culture, history, and stories deriving from all units of the country to promote national unity and harmony.\nHe pointed out that the heritage of the colonial era led to distortion in the culture of the land, however, said while promoting unity, it was important to also welcome diversity.\nVice Chancellor Quaid-e-Azam University Professor Dr Muhammad Ali said the aim of the academic conference was to find ways to develop a national narrative on culture to ensure harmony among the people of all provinces.\nHe emphasized highlighting the Sufi character of the land and promoting the message of Baba Bulleh Shah, Khawaja Farid, Mian Muhammad Bakhsh, Rehman Baba, Pir Mehr Ali Shah and several other saints to develop a society based on selflessness, patience and harmony.\nA group of students from Quaid-e-Azam University presented a mélange of songs depicting the colours of all provinces, Gilgit Baltistan and Kashmir.\nClad in traditional dresses, a group of performing artists from PNCA presented cultural dances to the tunes of folk songs.",
  "retrievedAt": "2025-08-11T21:31:43.163Z"
}
