{
  "article_id": "2025-04-09_b601d60f5ba8f34e450d4c7e4ad0f978",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-pushes-forward-with-privatization-of-non-strategic-soes-aasia-ishaque/",
    "retrieved_at": "2025-08-27T14:18:09.311Z"
  },
  "metadata": {
    "title": "Govt pushes forward with privatization of non-strategic SOEs: Aasia Ishaque",
    "author": null,
    "date_published": "2025-04-09T17:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 447,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 9 (APP):Parliamentary Secretary for Privatization Aasia Ishaque Siddiqui on Wednesday informed the National Assembly that the government is moving ahead with its plan to privatize non-strategic state-owned enterprises (SOEs) as part of a broader effort to reduce its involvement in the commercial sector and ease the financial burden on public resources. Responding to a question during the question hour, she said the government was working on the privatization of several major entities in a step-by-step manner. The first phase includes high-profile entities such as Pakistan International Airlines (PIA), Roosevelt Hotel, First Women Bank, and various electric supply companies like Islamabad Electric Supply Corporation (IESCO) and Faisalabad Electric Supply Company (FESCO). In addition, Zari Tarqiati Bank is also part of this initial wave, with work expected to be completed within the next year. Siddiqui outlined the current status of two key SOEs, Pakistan International Airlines (PIA) and Pakistan Steel Mills (PSM). She shared that PSM, currently under the Ministry of Industries rather than the Privatization Commission, has been struggling with poor financial performance. Despite these challenges, the government has devised a revitalization plan, known as the Steel Core Project, aimed at addressing some of these issues. The plan focuses on a core operating asset, including land and infrastructure, to improve PSM's efficiency. However, the total land area of the mill is much larger than what is being focused on for revitalization. Siddiqui also addressed the complicated history of privatizing PSM, which has faced numerous setbacks. She mentioned that in 2006, a deal was nearly finalized with four pre-qualified companies, including Bao Steel and Mansha Steel, which are backed by the Chinese government. The deal was valued at over $467 million, but it fell through due to legal interventions by the then Chief Justice of Pakistan Iftikhar Ahmed Chaudhary. As a result, PSM, which lost a significant amount of money over the years, remains a significant burden on the government's finances. In addition to PSM, Siddiqui spoke about the challenges faced in the privatization of PIA, another high-profile SOE. She pointed out that PIA's monthly losses were substantial, primarily due to interest payments on accumulated debts. However, the Privatization Commission has restructured PIA's finances, including taking over its liabilities. This restructuring has helped PIA avoid the negative equity situation it had been in, improving its financial standing. The government is also addressing concerns about the privatization process, particularly regarding transparency and accountability, she added. She reassured the Assembly that the government is committed to improving the efficiency of these entities and generating revenue from their privatization. Through careful planning and ongoing reforms, the government aims to resolve the financial issues these state-owned companies have faced for years.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}