{
  "article_id": "2025-04-09_888d999ea1a2ce8196e8d3aa0dba1e07",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-send-high-level-delegation-to-negotiate-tariffs-with-us-pm/",
    "retrieved_at": "2025-08-27T14:18:40.494Z"
  },
  "metadata": {
    "title": "Pakistan to send high-level delegation to negotiate tariffs with US: PM",
    "author": null,
    "date_published": "2025-04-09T14:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 593,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 9 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday said that Pakistan will send a high-level delegation to the United States for negotiations aimed at addressing tariffs and further strengthening bilateral trade relations. The delegation will include prominent business figures and exporters from Pakistan, the prime minister said while chairing a meeting of the Economic Advisory Council (EAC) here. Praising the government economic team, the prime minister said the team successfully negotiated with International Monetary Fund (IMF) to convince it to reduce the electricity prices. \"With the reduction in power tariffs, the production cost of the industrial sector would also reduce, and as a result the exports of the country will go up.\" The prime minster pointed out that with reduction in the production cost of the local industries, the competition of the Pakistani products in the world market will improve. He said industrial development was one of the top priority of the government that will help producing new employment opportunities. \"Due to the comprehensive advisory process, the sustainable development goals will become possible soon,\" he said adding that the government was easing the process of investment and business by introducing reform measures in the taxation system and through information technology,\" he remarked. The prime minister further added that the stability of the economy, reduction in inflation, significant decrease in interest rates, increased trust from global institutions, and investment from friendly countries are the results of the hard work of the government's economic team. He emphasized that experts from various sectors included in the Economic Advisory Council will play an important role in national development through their valuable suggestions. The meeting was attended by members of the Economic Advisory Council, including Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, Federal Ministers Ahmad Khan Cheema, Muhammad Aurangzeb, Attaullah Tarar, Shaza Fatima Khawaja, Ali Pervez Malik, Sardar Awais Khan Laghari, Advisors Muhammad Ali, Syed Taqir Shah, Minister of State Bilal Azhar Kayani, Special Assistant Haroon Akhtar, Governor State Bank Jameel Ahmad, and other relevant senior officials. The participants presented their recommendations on the future course of action, particularly regarding the growth of Pakistan's economy and the increase in exports. They also appreciated the government's efforts in reducing the electricity prices provided to industries. The participants lauded the special attention given to the recent Mineral Investment Forum and considered it an important milestone for the development of Pakistan's mineral and mining sector. The participants recommended focusing on the export of value-added products rather than raw materials in government policy making. They also suggested strengthening the communication infrastructure for the transportation of goods from industries to ports, aligning the skills of the domestic workforce with international standards, improving the promotion of Pakistani goods through foreign embassies, establishing export promotional councils, and further improving facilities in special economic zones and industrial areas. The participants also recommended comprehensive research on the production stages of exportable products and their raw material sources, which would help Pakistani manufacturers compete in the global market and increase exports. Furthermore, the participants proposed reforms in Pakistan's banking sector to facilitate exports. They also appreciated the decision to send a high-level delegation to negotiate on the recent tariff imposition by the United States. They also commended the representation and inclusiveness of all sectors in the council. The prime minister directed the government's economic team to prepare a practical action plan based on the suggestions of the council members. He also instructed the formation of separate sub-committees under the Economic Advisory Council for different sectors, which will propose actionable suggestions regarding those sectors.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}