{
  "article_id": "2025-04-09_89c633d74030d5f177fdc9304bf581fe",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ahkncrd-aardos-intl-training-workshop-inaugural-ceremony-held-at-ncrd/",
    "retrieved_at": "2025-08-27T14:20:08.070Z"
  },
  "metadata": {
    "title": "AHKNCRD-AARDO’s Int’l training workshop inaugural ceremony held at NCRD to improve irrigation system, water management",
    "author": null,
    "date_published": "2025-04-09T11:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 624,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 09 (APP):Akhtar Hameed Khan National Centre for Rural Development (AHKNCRD), in collaboration with the African-Asian Rural Development Organization (AARDO) held an inaugural ceremony for an international training workshop at the NCRD on Wednesday. The aim of the workshop was to improve irrigation system and water management. The title of inaugural event was 'Irrigation System and Water Management'. Around 13 Asian and African member countries including Pakistan were attending this ten-day extensive training workshop commenced from April 8. The inaugural ceremony was virtually attended by Secretary General AARDO, Dr. Manoj Nardeosingh, Assistant Secretary General of AARDO Rami Mahmoud Abdel Halim Qtaishat and other officials from AARDO. The session was also attended by members of diplomatic corps, including Md. Aminul Islam Khan, Deputy High Commissioner, High Commission for the People's Republic of Bangladesh, Islamabad; Amb. Daniel Mumina Nganda, Deputy Head of Mission, Kenya High Commission, Islamabad; Auwala Garba, Third Secretary, Nigeria High Commission, Islamabad; and Abdulraheem Y. Hasan, Deputy Head of Mission & Counsellor, Embassy of the Hashemite Kingdom of Jordan, as well as distinguished guests belonging to various government departments and nation-building organizations including Dr. Zafar Iqbal Qadir, Former Director General, NCRD; Dr. Robina Wahaj, Senior Land and Water Officer, Food and Agriculture Organization (FAO), Islamabad; Malik Fateh Khan, Regional Head, National Rural Support Programme (NRSP); Abdul Ahad, Deputy Secretary, Establishment Division; Dr. Shabbir Hussain, CEO ORECON Consulting & Former Chief of Party USAID, Islamabad; Brig. (R) Aslam Khan, President, Rural Development Foundation, Islamabad; Dr. M. Azeem Khan, Chief Agriculture Advisor, Lackson Group of Companies, Islamabad & Former Chairman, Pakistan Agricultural Research Council; Tariq Nazir, District Program Officer ICT, National Rural Support Programme; and Ms. Samia Rashid, CEO & Founder, E-PROHUB and Skill Trainer. Welcoming the AARDO Officials, delegates of the diplomatic corps and the training participants, Israr Mohammad Khan, Director General NCRD, appraised the participants about the performance and contribution of NCRD for the cause of rural development and poverty alleviation in Pakistan and other AARDO member countries through collaboration with AARDO. He vowed that NCRD would continue its efforts for bringing improvement in irrigation system and water management, also would ensure conducive learning environment and comfortable stay for the participants of the training workshop. In his virtual address, Dr. Manoj Nardeosingh, Secretary General, AARDO, expressed his appreciation for the strong partnership between AARDO and NCRD, terming it a model of South-South cooperation. He applauded the tireless efforts of the NCRD team under the dynamic leadership of DG NCRD, for successfully organizing this timely and relevant international training workshop. Dr. Nardeosingh emphasized its significance in achieving sustainable agricultural practices and ensuring food security amidst increasing climate-related challenges. He lauded Pakistan's continued engagement with AARDO and reaffirmed the Organization's commitment to supporting member countries through knowledge-sharing and capacity building. In his address, Dr. Zafar Iqbal Qadir, Former Director General expressed great honor at the inaugural ceremony of this training workshop. He welcomed the participants from AARDO member countries and commended the efforts of AARDO officials, especially Dr. Manoj Nardeosingh, for organizing the event in Pakistan. He mentioned that with agriculture at our core, Pakistan faced water stress aggravated by climate change. \"Government initiatives, including major dam projects like Diamer-Bhasha and Dasu, aim to bolster irrigation systems,\" he added. He expressed his views that the collaboration promises valuable exchanges of experiences and best practices from across the AARDO countries. Dr. Zafar expressed a strong presumption that the training workshop, complemented by in-house sessions and field visits, would provide profound insights to the participants and experts from the AARDO member countries. He expressed gratitude to AARDO for its support and extended appreciation to the participants from member countries, hoping that they embark on the journey to deepen their understanding of irrigation system and water management.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}