{
  "article_id": "2025-04-09_1c00632ab0e97daca201bb97f3870de1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/peshawar-zalmi-unhcr-call-for-greater-compassion-towards-afghan-refugees-in-pakistan/",
    "retrieved_at": "2025-08-27T14:19:28.392Z"
  },
  "metadata": {
    "title": "Peshawar Zalmi, UNHCR call for greater compassion towards Afghan refugees in Pakistan",
    "author": null,
    "date_published": "2025-04-09T13:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 307,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 09 (APP):UNHCR, the UN Refugee Agency, and Peshawar Zalmi have entered a strategic partnership and have called for greater compassion towards Afghan refugees residing in Pakistan, urging that the situation of Afghan refugees be seen through a humanitarian lens. Peshawar Zalmi is the leading franchise of Pakistan Super League (PSL) cricket championship, which has been taking place since 2015, said a press release. \"Refugees have stories, hopes and dreams - just like anyone else. Their plight should be understood through the lens of human rights,\" said Javed Afridi, Chairman of Peshawar Zalmi/ Zalmi Foundation at an event on Wednesday where Peshawar Zalmi and UNHCR renewed their partnership. \"Sport is a unifying force, and through our continued partnership with UNHCR, we aim to bring attention to the strength and stories of refugees, we are proud to stand alongside UNHCR and to use our platform to inspire empathy and support for displaced communities,\" Afridi continued. As the Pakistan Super League Season 10 starts, UNHCR and Peshawar Zalmi reaffirmed their commitment to missing awareness and support for refugees and displaced communities through the powerful medium of sports. Peshawar Zami features UNHCR's emblem on their official jerseys, showcasing their continued dedication to standing in solidarity with refugees. The extended agreement was formally announced by Mian Abbas Layaq, Chief Operating Officer, Peshawar Zalmi and Ms. Fumiko Kashiwa, Deputy Representative of UNHCR, in the presence of Zalmi star cricketers Mr. Hussain Talat and Najibullah Zadran in Serena Hotel Islamabad. Speaking on the occasion, Ms. Kashiwa said that sports play a powerful role in fostering awareness, inclusion, and solidarity. \"By joining hands with Peshawar Zalmi, we aim to create a platform where refugees are seen and heard, and where their dreams and aspirations are recognized. Through these collaborations, we can inspire communities to embrace refugees as valuable members of society,\" she said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}