{
  "article_id": "2025-04-09_6e1afc484db2b0844dfceaf52e79a936",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-decides-to-send-delegation-to-us-to-discuss-new-trade-tariff/",
    "retrieved_at": "2025-08-27T14:20:35.130Z"
  },
  "metadata": {
    "title": "PM decides to send delegation to US to discuss new trade tariff",
    "author": null,
    "date_published": "2025-04-09T09:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 250,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, April 09 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday decided to send a high-level delegation to hold negotiations with the relevant authorities in the United States of America (USA) regarding promotion of bilateral trade relations and to discuss new trade tariff. Upon the instruction of the prime minister, the delegation would include prominent business personalities and exporters, PM Office Media Wing, said in a press release. The delegation was tasked to formulate a mutually beneficial mechanism in future after holding negotiations with the US authorities over imposition of new tariff. The prime minister chaired a meeting on enhancing country's exports and to review the new tariff by the US. The meeting was attended by Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, federal ministers including Ahad Khan Cheema, Muhammad Aurangzeb, Ali Pervaiz Malik, PM's Adviser Syed Touqeer Shah, PM's Assistants Tariq Fatemi, Haroon Akhtar, PM's Coordinator Rana Ahsan Afzal and other relevant senior officials. The prime minister observed that Pak-US trade ties dated back to decades and the government was keen to further strengthening of trade partnership with the US. A report and future mechanism furnished by the steering committee and the working group with regard to the new tariff by the US was presented while different alternative strategies were also discussed. The meeting was told that Pakistan Embassy was in constant contact with the US administration. The prime minister directed for constitution of delegation in this regard and ensuring inclusion of notable business personalities and exporters.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}