{
  "article_id": "2025-04-09_82fe5cef2ebb3d18f46d7601318cc60f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ecp-launches-13-week-intensive-training-for-new-election-officers/",
    "retrieved_at": "2025-08-27T14:19:30.084Z"
  },
  "metadata": {
    "title": "ECP launches 13-week intensive training for new election officers",
    "author": null,
    "date_published": "2025-04-09T12:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 207,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 09 (APP): The Election Commission of Pakistan (ECP) on Tuesday initiated a 13-week training session for its 23 newly hired BS-17 Election Officers at its academy, with the program set to end on July 4, 2025. Chief Election Commissioner Sikandar Sultan Raja officially inaugurated the training program at ECP Academy, designed to provide election officers with essential competencies for effective electoral management. Chief Election Commissioner Raja welcomed the newly appointed Election Officers to the ECP, commending their merit-based selection. He underscored that election management is a multifaceted responsibility demanding thorough understanding of constitutional provisions, legal frameworks, procedural regulations, and ethical guidelines-along with hands-on experience. The CEC also emphasized that during this period, officers will receive training on modern technology to enhance its application in both their professional duties and daily lives. Officers will also undergo training on election laws, constituency delimitation, voter registration, polling procedures, and office tasks, supported by practical exercises. They will also learn how to effectively utilize modern technology for professional and personal applications. Chief Election Commissioner urged newly appointed Election Officers to prioritize serving the nation, adhering to the Constitution and laws, and treating the public with courtesy. He emphasized the importance of focusing on their training to effectively manage elections.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}