{
  "article_id": "2025-04-09_66526ca898c75878b226f9948afd7690",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-vows-continued-support-for-palestinians-energy-sector-reforms-amid-ji-delegation-meeting/",
    "retrieved_at": "2025-08-27T14:20:11.302Z"
  },
  "metadata": {
    "title": "PM Shehbaz vows continued support for Palestinians, energy sector reforms amid JI delegation meeting",
    "author": null,
    "date_published": "2025-04-09T11:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 212,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 09 (APP):Prime Minister Muhammad Shehbaz Sharif Wednesday met with a three-member delegation of Jamaat-e-Islami (JI) led by Ameer Hafiz Naeem ur Rehman, where both sides expressed deep concern over Israel's continued aggression against innocent Palestinians in Gaza and the silence of international powers on the issue. In a statement here, the Prime Minister reaffirmed the unwavering support of Pakistan for Palestinians and pledged to continue raising a strong voice against Israeli atrocities on every international forum. \"Pakistan's stance is clear-we stand firmly with our oppressed Palestinian brothers and sisters,\" he stated. During the meeting, Hafiz Naeem ur Rehman thanked the Prime Minister for the recent reduction in electricity prices. PM Shehbaz responded by highlighting his government's ongoing efforts to bring long-term reforms to the energy sector, saying, \"Our team is working day and night to ensure sustainable solutions.\" He added that future reforms would be designed with the common citizen in mind to ease everyday life. \"Despite challenges, public relief remains our top priority, and we will continue this mission,\" he affirmed. \"The journey of Pakistan's development will continue, InshaAllah,\" the Prime Minister concluded. Deputy Prime Minister and Foreign Minister Ishaq Dar, Federal Information Minister Attaullah Tarar, and Jamaat-e-Islami leaders Liaqat Baloch and Asif Luqman Qazi also attended the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}