{
  "article_id": "2025-04-09_0c6b93b3a5e9726624ddd579936c44e5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pmif-25-concludes-with-commitment-to-return-next-year/",
    "retrieved_at": "2025-08-27T14:20:21.958Z"
  },
  "metadata": {
    "title": "PMIF-25 concludes with commitment to return next year",
    "author": null,
    "date_published": "2025-04-09T11:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 764,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 09 (APP):The two-day Pakistan Mineral Investment Forum 2025 (PMIF-25) successfully concluded on Wednesday with a pledge to return for next year's edition in the same month. Around 300 foreign delegates participated in the event, which was aimed at boosting investment in Pakistan's mineral sector and supporting long-term economic development. The forum's success reflects a growing international interest in Pakistan's mineral wealth and the government's commitment to making the country an attractive and competitive destination for mining investment. Delegates from Saudi Arabia, China, the United States, Canada, Azerbaijan, Uzbekistan, Kazakhstan, Turkmenistan, the Czech Republic, Finland, the United Kingdom, Indonesia, and Denmark attended the forum. In his closing remarks, OGDCL's Managing Director and CEO, Ahmed Hayat Lak, expressed pride in Pakistan's efforts to reshape its future through partnerships and strategic investments in the mineral sector. \"These past two days have been more than just a forum - they've marked a declaration that Pakistan is not only rich in minerals but also ready for investment,\" he said. He described PMIF-25 as starting a new chapter for responsible, sustainable, and inclusive mining in Pakistan. He praised both the public and private sectors for driving innovation and breaking down barriers. He invited global investors to see Pakistan as a transparent, secure, and supportive environment for capital, technology, and expertise. He also emphasized the importance of building local capacity and involving youth and academia. \"This mining revolution must be rooted in local knowledge and leadership,\" he said, urging stakeholders to develop a purposeful and profitable mining industry. He thanked the organizing team and acknowledged the support of key partners such as the Special Investment Facilitation Council (SIFC), Ministry of Energy, Government Holdings, Pakistan Petroleum Limited, Mari Petroleum Company Limited, and other collaborators. Looking ahead, he said preparations for PMIF-2026 are already in progress, inviting all stakeholders to return next year to build on the momentum. Earlier at the closing session, Russell Howard Owen, Mineral Resources Manager at Reko Diq Mining Company, presented technical insights from the updated feasibility study of the Reko Diq project. He highlighted its potential to become one of the world's largest copper-gold mines. Located in the Chagai district of Balochistan, the project is a joint venture between Barrick Gold, the Government of Balochistan, and the Government of Pakistan. He stressed Barrick's focus on technical excellence and data integrity. The company has reviewed 286 kilometers of historical drilling data and conducted an additional 22 kilometers of new drilling using advanced geological modeling software. He explained that modern techniques such as ambient noise tomography and satellite imaging were used for the first time in the region to guide future exploration. The Western Porphyry zone, which holds 95% of the metal, will have an open-pit operation stretching 4.5 kilometers long and 840 meters deep. On water sourcing, he said the project will use saline groundwater located 70 kilometers away. Barrick has patented technology to utilize this resource sustainably, supported by environmental and hydrogeological studies. Future options, including the Moshgal Basin and desalination, are also being explored. On the occasion, Daniel Nel, Engineering Manager at Reko Diq, highlighted that the plant design meets modern standards for efficiency and sustainability. He said High High-Pressure Grinding Rolls (HPGR) technology has been adopted to reduce energy use and lower emissions. Rail connectivity will also play a key role in reducing the project's environmental footprint. The site's proximity to Pakistan's Main Line-3 (ML3) offers a cost-effective route to Port Qasim, where copper concentrate will be transported in sealed containers to the Pakistan International Bulk Terminal (PIBT) for export. Nel emphasized that safety has been embedded into every part of the project's design. Operational teams have actively worked to identify and mitigate potential risks. The project has now entered the bankable feasibility study phase, with detailed engineering and early procurement underway. The forum featured several high-level panel discussions. One panel focused on building a skilled workforce through stronger collaboration between academia and industry. Moderated by Aamir Malik from Wood Mackenzie, it included representatives from Barrick Gold, NAVTTC, BUITEMS, and GIKI. Another panel discussed the importance of financing in meeting the global demand for minerals. It was moderated by Bloomberg's Faseeh Mangi and included experts from the IFC, ADB, and the Government of Pakistan. A third panel, moderated by Rebecca Campbell of White & Case, explored responsible mining, sustainability, and climate leadership. Speakers included sustainability heads from Reko Diq, DMT Group, and Planetive. On the first day of the forum, the Geological Survey of Pakistan (GSP) signed several Memorandums of Understanding (MoUs) with international partners to promote cooperation in mineral exploration, research, and technology.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}