{
  "title": "One Window Ehsaas Policy to ensure services delivery through a single window: Dr. Sania",
  "link": "https://www.app.com.pk/national/one-window-ehsaas-policy-to-ensure-services-delivery-through-a-single-window-dr-sania/",
  "date_published": "2021-07-31T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP):Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar Saturday said, One Window Ehsaas Policy, approved by Prime Minister Imran Khan, will ensure delivery of services to marginalized segments of society through a single window, a one-stop shop.\nThe overarching Ehsaas Strategy stipulated the creation of “One-Window Ehsaas” (Policy # 4) to enable delivery of the multiple Ehsaas programs through a single window, and to address issues in social protection programs.\nThe policy entails six sets of actions: firstly, a One Stop Shop, the Ehsaas Physical Center; secondly, back office digital interface; thirdly, a public facing digital information and services platform; the fourth component is a mobile app; the fifth component is the integrated database; and finally, the Ehsaas One-Window Beneficiary Selection and Targeting Policy.\nAccording to an official statement, collectively, the six pillars of One Window policy will increase cohesiveness and coordination across the different programmes offered by different implementing organizations and will improve beneficiary experience.\nWhile physical one window centers, e-portal and app will enable beneficiaries to better access welfare services, cross-organizational data sharing, and a standard beneficiary identification methodology will allow for better visibility, and efficient and transparent targeting. Lastly, removing program overlaps will allow to expand access to services through re-allocation of resources to previously non targeted populations.\nPart of the policy, the One Window Physical Ehsaas Centers will be a one-stop-shop to integrate all Ehsaas programs under one roof. The Centers will allow beneficiaries to get information on all Ehsaas benefits and services available to them in one space.\nThe first prototype has recently been opened in Sitara market, Islamabad. One Window Physical Centers of Ehsaas will be opened in all 154 districts.\nThe second part is the integrated back office digital interface, which will facilitate access of all those working in the Ehsaas ecosystem to appropriate links and resources.\nThirdly, Ehsaas One Window Digital has been launched. It is a one-stop-shop that provides links to all Ehsaas-related information and services.\nThe e-portal is accessible to everyone and has information in Urdu, enabling easy navigation for beneficiaries.\nThe fourth part of Ehsaas One Window is an app which mirrors information on the digital portal but in addition the app, it also marks locations of service sites: Langars, Panagahs and payment sites. The limited version of Ehsaas App is available on Google Play Store. It is being expanded to reflect the entire ecosystem of Ehsaas digital.\nThe Cognitive API architecture for Ehsaas’ National Socio-economic Registry 2021 is the fifth pillar of ‘One Window Ehsaas’.\nWith the survey, which is building the registry currently 97.7% complete countrywide, Ehsaas is firming up its plans to open data sharing and data access services for all executing agencies under the Poverty Alleviation and Social Safety Division (PASSD).\nData sharing will be done through the Cognitive API Architecture approach.\nThe integrated database will facilitate adoption of the Ehsaas One Window targeting Policy, which will make targeting predictable, evidence based, transparent and effective in the Ehsaas ecosystem.\nGoing forward, all socio-economic targeting under Ehsaas will use the Proxy Means Test (PMT).",
  "retrievedAt": "2025-08-11T21:01:28.033Z"
}
