{
  "title": "President urges young generation to take part in reversing global warming",
  "link": "https://www.app.com.pk/national/presidents-urges-young-generation-to-take-part-in-reversing-global-warming/",
  "date_published": "2021-07-31T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 31 (APP): President Dr Arif Alvi Saturday urged the young generation to play their dynamic role in the government’s ongoing massive Ten Billion Tree Tsunami campaign and reverse the degenerating effects of the global warming and environmental pollution.\nAddressing a ceremony of monsoon tree plantation drive held here at the green area adjacent to Aiwan e Sadr, the president the onus to keep the environment clean and green now vested with the young generations and expressed the confidence that they would carry this burden and secure the country’s future.\nHe stressed upon adoption of environment friendly habits at the country’s scenic and tourists’ spots by properly disposing trash and garbage.\nOn the occasion, the president along with Begum Samina Alvi also planted saplings of Chir pine (Pinus Roxburghii) in the monsoon season under Ten Billion Tree Tsunami programme.\nMinister of State for Climate Change Zartaj Gul, Special Assistant to PM on Climate Change Malik Amin Aslam, a large number of citizens and young students also attended the ceremony.\nThe president observed that young generations had to play real role in the tree plantation drive as it had always been the young people that changed future course of different nations.\nSharing his past experiences prior to becoming the president, he said that they had distributed 100,000 saplings among different households of Karachi, besides, they also gave away 100,000 seeds laden pencils among the younger students asking them to plant them in pots, so that plants could sprout out as part of their activities to create motivation.\nThe president noted that human footprints had proved heavy on nature as the indiscriminate use of pesticides and insecticides had already eliminated a large number of insects which played vital role in the pollination process.\nHe also lauded efforts of the both ministers in spearheading the tree plantation drive.\nThe president said the government’s efforts and strategy over Covid 19 and tree plantation drive had proved very successful and acknowledged by the world.\nHe also underlined the need of keeping tourists spots in Khyber Pakhtunkhwa and Gilgit Baltistan clean and green as recently, these places had attracted millions of tourists.\nPresident Dr. Arif Alvi to shortly inaugurate Monsoon Plantation 2021 at the Aiwan-e-Sadr. pic.twitter.com/798i7mQ4Zf\n— The President of Pakistan (@PresOfPakistan) July 31, 2021\nEarlier, SAPM Malik Amin Aslam briefed the president about the ongoing monsoon tree plantation drive under Ten Billion Tree Tsunami.\nHe said that about 500 million saplings would be planted across Pakistan as a target set for monsoon plantation under 10BTT.\nIn order to support government’s tree plantation drive, students from various educational institutions volunteered to plant almost 10,000 saplings inside presidency’s premises to increase the forest cover of the country.",
  "retrievedAt": "2025-08-11T21:01:30.987Z"
}
