{
  "title": "Afghanistan on “historic crossroads”, its people should be incentivized: PM",
  "link": "https://www.app.com.pk/global/afghanistan-on-historic-crossroads-its-people-should-be-incentivized-pm/",
  "date_published": "2021-09-15T16:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): Prime Minister Imran Khan on Wednesday said that as Afghanistan was at historic crossroads, there was a need for the international community to incentivize its people to achieve peace and stability.\n“There is another fallacy that Afghanistan can be controlled from outside. There is a history. No puppet government in Afghanistan is supported by the people. It gets discredit amongst the people. So rather than sitting here and sort of thinking that we can control them we should incentivize them,” Imran Khan said in an interview with Cable News Network (CNN).To a question, the Prime Minister described the situation in Afghanistan as “worrying”.\n“Afghanistan is on historic crossroads: One if it goes well and we pray that it works in the direction of peace after 40 years in Afghanistan. Taliban hold whole of Afghanistan. And if they can serve now and work for the inclusive government, get all the factions together Afghanistan could have peace after 40 years.”\n“But if it goes wrong and which is what we are really worried about it could go to chaos, the biggest humanitarian crisis, the huge refugee problem, unstable Afghanistan,  and the reason why the US came in was to fight terrorism or the international terrorists – so unstable Afghanistan, refugee crisis, and the possibility of again terrorism from Afghanistan soil,”, he remarked.\nThe Prime Minister, in response to another question, said no one could predict the future of Afghanistan. “We can hope and pray that there is peace after 40 years; the Taliban what they have said that they want an inclusive government, they want women rights in their own context. They want human rights, they have been given amnesty. So far they clearly want international acceptability.”\nImran Khan said that the current government in Afghanistan clearly felt that without international air and help, they would not be able to stop this crisis.\n“We should incentivize them and push them in the right direction.”\nTo another question, the Prime Minister viewed, it was a mistake to think that someone from outside will give rights to Afghan women.\n“Afghan women are strong, give them time. They will get their rights,” he maintained. The Prime Minister replying to another query said women should have the ability in society to fulfil their potential in life. “You cannot impose women rights from abroad,” he remarked.\nThe Prime Minister said the Americans did not understand who the Haqqanis were, adding there was complete ignorance as Haqqani was a Pashtun tribe living in Afghanistan.\nForty years ago, when the Afghan Jihad took place there were five million refugees in Pakistan and amongst them were the Haqqanis who were fighting the Soviets, he observed.\nThe Haqqani leadership was born in the Afghan refugee camps in Pakistan, he recalled.\n“We were supposed to check which were of the people living in refugees camps were Taliban or not.”\nTo a question, he said the total budget of Pakistan was $ 50 billion for 220 million people while Americans were spending $ 300 million dollars a day and in total, they spent $ two trillion on the Afghan war, PM told CNN.\nResponding to another question, Imran said it was a job of the intelligence agencies to meet everyone.\nThe United States Central Intelligence Agency (CIA) would be speaking to the Taliban as it was their job, he remarked.\nHe said the question was whether in the past Pakistan was in a position to take military action against the Taliban, adding Pakistani Taliban were attacking the state of Pakistan at one time.\nThere were two suicide attacks on General Pervez Musharraf as there were sympathies with the Taliban within Pakistan, he narrated.\nHe said Benazir Bhutto was assassinated by the Pakistani Taliban because she was considered a collaborator of the United States.\n“Our heads of state in the past should have told the United States what they could do and what they could not do. We lost the argument when Pakistan had corrupt weak heads of state and they did not stand up to the United States.”\nThe Prime Minister said Pakistan’s relationship with the United States during the occupation of Afghanistan was terrible. “The US said we were paying Pakistan and they paid us $ nine billion for civilian aid and $ 11 billion as military aid and we were like a hired gun.”\n“In Pakistan the people felt that after joining the US we had bombs going everywhere. Benazir Bhutto was killed because of that and our economy tanked. Our economy lost $ 150 billion.”\n“At present, we want a relationship with the United States like the relationship it has with India. We do not want one-dimensional relationship where they are paying us to fight. We want a normal relationship.”\n“The biggest concern is the Afghan refugees as we already have three million refugees in Pakistan. Our country cannot afford more refugees. We have come out of a very difficult economic situation and we cannot take more refugees,” he added.\n“The second worry is terrorism. We have three sets of terrorists in Afghanistan using their soil to attack us; ISIS, Pakistani Taliban and Baloch terrorists,” he continued.\nImran said if there was chaos in Afghanistan and if there was no stability “there will be two major problems looming before us. We are the country that is going to suffer the most”.\nWhile talking about formation of the recent government in Afghanistan, he said, “My party came to power after 22 years. For 22 years we stayed in opposition before we came into power. When we got into power there was so much pressure on us to include those people who had struggled for 22 years.”\n“They almost felt that they had the right that they should be included. I can see the problems they (Taliban) are facing. But I don’t think that there would be real peace in Afghanistan unless there is an inclusive government because Afghanistan is a society composed of different ethnic groups.”\nThe Pashtuns were only 45 to 50 percent, there were Tajiks, Hazaras and Uzbeks, he said adding so unless it was an inclusive government, the worry was that there will be instability later on.\nHe said, “for the first time in 74 years history of Pakistan we are trying to get rid of the colonial education system. In the colonial era, elite education system created classes in society.”\nHe said people of Afghanistan had got freedom from Britain, then Soviet Union and now from the United States and they never accepted a puppet government.\nHe pointed to the withdrawal of the Soviets in 1989, which resulted in a “bloodbath.” He said he was fearing a similar bloodbath to happen after the US forces left.\n“Our intelligence agencies told us that the Taliban would not be able to take over all of Afghanistan, and if they tried to take Afghanistan militarily, there would be a protracted civil war, which is what we were scared of because we are the ones who would suffer the most,” he said. Now, he said, the world should give Taliban time to form a legitimate government and make good on their promises.\nTo a question, he said, “Women should have the ability in a society to fulfill their potential in life,” “In Pakistan, what we have done is we have actually paid stipends to poor families to get the girls to study in school because we feel that if the girls, if the girl child studies, if they have education, they will get their own rights,” he added.\nThe PM said he repeatedly warned US officials that their country could not achieve its objectives militarily, and would “be stuck there.” He said the US should have attempted a political settlement with the Taliban from a “position of strength,” at the height of its presence in Afghanistan, not as it was withdrawing.\nHe said thousands of Pakistanis lost their lives in terrorist attacks by militant groups owing to his country’s support for the US. “Just because we sided with the US, we became an ally of the US after 9/11 and the war in Afghanistan. The suffering this country went through with at one point there were 50 militant groups attacking our government… on top of it, they must also know there were 480 drone attacks by the US in Pakistan,” he added.\n“Only time a country has been attacked by its ally,” he said of the US strikes.\nHe said General Pervez Musharraf should never have got Pakistan involved in the US war in Afghanistan.\n“I cannot destroy my country to fight someone else’s war.”\n“The Afghan Taliban weren’t attacking us. I wish if I was in government. I would have told the US that we are not going to take them on militarily because first, we have to serve the people. My responsibility would have been to the people of my country,” the PM said. He said 80,000 Pakistanis lost their lives in the terrorist attacks.\nTo a question about safe havens, He said, “the area of Pakistan along the border of Afghanistan had the heaviest surveillance by the United States drones … surely they would have known if there were any safe havens.”\nHe said his government was the first one which fenced the border with Afghanistan.\nHe hoped that Taliban government would evolve in time and an inclusive government would be formed in Afghanistan.\nHe said Pakistan had no favourites in Afghanistan and in the past it was a mistake to support a faction.\nImran Khan said President Biden was being blamed for exit of Afghanistan but what else he could have done.He said Pakistan’s relationship with China went back 70 years and Pakistan facilitated start of ties between China and the United States.\nPakistan had a very strong relationship with China and people of Pakistan had deep affection for China as it always stood with\nPakistan in difficult times, he noted.\nHe said India was supporting terrorists who carried out attacks in Pakistan which had a border of 2600 kilometers with Afghanistan. A pro-India government in Afghanistan would create problems for Pakistan, he added.\nTo a question about the murder case of Nur Muqaddam, he said he was personally looking into the case and the state would ensure that the criminal in the case was punished.\nHe said the previous Afghan government kept blaming Pakistan for its failures.\nHe recalled that he told former President Ashraf Ghani that Pakistan would try its best for formation of an inclusive government in Afghanistan.\nHe held the Afghan government responsible for the mess in Afghanistan and said Afghan people did not accept the previous government because of its corruption and misgovernance.",
  "retrievedAt": "2025-08-11T21:14:33.471Z"
}
