{
  "title": "BJP govt uses illegal means for demographic changes in Kashmir",
  "link": "https://www.app.com.pk/national/bjp-govt-uses-illegal-means-for-demographic-changes-in-kashmir/",
  "date_published": "2021-09-15T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD Sep 16 (APP): The autocratic regime of Bharatiya Janata Party (BJP) in India had laid the foundation for fulfillment of longstanding dream of absorption of Kashmir into Indian Union through illegal maneuvers.\nAccording to a dossier issued by the government of Pakistan, Indian maneuvers were primarily designed to negate the disputed character of Indian Illegally Occupied Jammu and Kashmir (IIOJK) by propagating it as her internal matter in contravention to United Nations Security Council resolutions, which unequivocally pronounce Kashmir as a disputed territory.\nThese resolutions uphold fundamental right of self-determination of Kashmiris and final settlement of dispute through free and impartial plebiscite. Post August 5 unilateralism, Indian state was engaged in demographic apartheid against Kashmiris due to differences in culture, religion, ethnicity and political views.\nKashmir was a disputed territory designated by United Nations whose final status had to be decided through grant of right of self-determination to the Kashmiris.\nAs many as 18 United Nations Security Council resolutions validated the disputed character of Kashmir, while many of them repeatedly enunciate its final settlement through plebiscite.\nThe Security Council resolutions explicitly reject India’s claim that Kashmir was an integral part of India and confirmed its status as a disputed territory.\nThe grand design of India was to alter disputed character of Kashmir, while illegally depicting Azad Jammu and Kashmir and Gilgit Baltistan as parts of Indian state.\nThe Indian plan paved way for marginalization of Kashmiris and their identity through excessive use of power.\nIndia promulgated an act commonly known as Domicile law on May 18, 2020 and it was in clear violation of article 49 of the 4th Geneva Convention that prohibited an occupying power from relocating its population to the occupied territory.\nThe act and actions, after its implementation clearly depicted mal-intentions of government of India to use it as a tool for rapidly changing demography of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAccording to law, anyone who had lived in Indian Illegally Occupied Jammu and Kashmir for 15 years or children who had studied in Kashmir for seven years were eligible to get the domicile. This clause will benefit mainly non-Kashmiri security forces personnel and government officials.\nModi government had made special amendments in laws to facilitate settlement of Hindus in IIOJK. All Indian nationals were now entitled to purchase land in IIOJK. The restriction on outsiders to purchase land was lifted by scrapping section 139 and 140 of J&K Transfer of Property Act, 1977, section 20A of J&K Big Landed Estates Abolition Act, 1950 and section 4 of J&K Alienation of Land Act 1938.\nTo practically implement demographic changes, government of India had opened a new Land Transaction Department and had proposed raising of two new administrative divisions in J&K. Land transaction will be directly controlled by Centre and local Kashmiri officials will have no role to play in the administration of state land.\nThe change was aimed at enhancing control of Centre on IIOJK administration and land transactions, while promoting Hindu domination in IIOJK through Hindu officials on important portfolios in IIOJK government.\nLand will be grabbed officially under law from locals and will be allotted to industrialists and allocated for government projects.",
  "retrievedAt": "2025-08-11T21:14:32.401Z"
}
