{
  "title": "Former top envoy cautions world against repeating mistakes on Afghanistan",
  "link": "https://www.app.com.pk/national/former-top-envoy-cautions-world-against-repeating-mistakes-on-afghanistan/",
  "date_published": "2021-09-15T14:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): Former foreign secretary Jalil Abbas Jillani on Wednesday cautioned the world community against repeating past mistakes of 1990s over Afghanistan as these could lead to financial crises and chaos.\nAddressing a webinar on Afghanistan situation, arranged by Pakistan High Commission Singapore in collaboration with the National University of Singapore, Institute of South Asian Studies (ISAS), he stressed that international community must ensure a sustained strategy to support Taliban’s set up in Afghanistan to achieve a political and financial stability.\nHe reiterated that Pakistan had always been consistently advocating for a stable and peaceful Afghanistan and supported all the efforts in this regard.\nThe former foreign secretary said Afghan issue had been very significant for the entire world, and this decade-long conflict had affected Pakistan as an immediate neighbour.\nHe called upon the international community to focus on the current situation in Afghanistan.\nThe former ambassador of Pakistan opined that Taliban had undergone huge change and they wanted to project their legitimate image at the international level.\nThey had resolved not to allow Afghan soil for any terrorist activities, he said, adding besides, the caretaker Afghan government had also promised to ensure protection of human and women’s rights. They were also ready to address concerns of the world in this regard, he said.\nJillani further underlined that the world must respond positively to these gestures and take steps for immediate relief and support to the Afghan people to avert economic crises and chaos.\nHe mentioned that freezing of Afghan government’s assets and financial aid would add to the financial woes of the Afghan people.\nPakistan High Commission to Singapore Rukhsana Afzaal also attended the webinar.",
  "retrievedAt": "2025-08-11T21:14:33.625Z"
}
