{
  "title": "FBR, FMU to enhance coordination to combat illicit finance",
  "link": "https://www.app.com.pk/national/fbr-fmu-to-enhance-coordination-to-combat-illicit-finance/",
  "date_published": "2024-01-28T17:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP):Chairman Federal Board of Revenue (FBR) Malik Amjed Zubair Tiwana emphasised the need for sustained collaboration between FBR and Financial Monitoring Unit (FMU) for the development of quality financial intelligence on tax evasion and its optimal utilization in investigations.\nThe Chairman said this while addressing the concluding ceremony of the FBR-FMU Joint Workshop on Financial Intelligence for Tax Evasion organized with the assistance of FCDO’s UPSCALE Programme in FBR headquarters on 27-28 January, 2024, said a news release here on Sunday.\nThe Chairman FBR congratulated the Directorate General of Intelligence and Investigation-Inland Revenue and the FMU for organising the event and desired for further enhancement of this partnership to achieve the unanimous goal of combating illicit finance.\nHe also thanked Lewis Evans of British High Commission, present at the occasion, for assisting in organising the event.\nMs. Lubna Farooq, Director General of FMU, thanked FBR and FCDO and underscored the need for sustained coordination between FBR and FMU to enhance the knowledge base and promoting mutual understanding for combating tax fraud and tax evasion.\nThis collaborative approach, she said, will enhance the effectiveness of investigations and contribute to a more robust and interconnected framework for combating financial crimes.\nThe workshop was also attended by the analysts of FMU and investigating officers of the Directorate General of Intelligence and Investigation-Inland Revenue.\nThe workshop focused on identifying and understanding risk areas for financial intelligence on tax crimes.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:59:41.046Z"
}
