{
  "title": "HEC invites applications for DAAD Master’s scholarship from female Afghan refugees",
  "link": "https://www.app.com.pk/national/hec-invites-applications-for-daad-masters-scholarship-from-female-afghan-refugees/",
  "date_published": "2024-01-28T09:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP):Higher Education Commission (HEC) of Pakistan has invited applications for the German Academic Exchange Service (DAAD) fully funded Master’s scholarships for the academic year 2024 from the female Afghan refugees to pursue two years Master’s study in HEC recognized universities in Pakistan.\nAccording to the HEC, this scholarship programme is open for all disciplines and is funded by the DAAD, with funds from the Federal Ministry for Economic Cooperation and Development, Germany. The award of scholarships will be subject to the provision of funds.\nAbout the eligibility criteria, the HEC said that female Afghan refugees residing in Pakistan, with valid Proof of Registration (POR) Card from Ministry of States and Frontier Regions (SAFRON).\nThe candidates must have completed an HEC recognized undergraduate degree (16 years of education) with atleast 2.5 CGPA. The result awaiting students cannot apply.\nThe candidates must have successfully completed undergraduate degree (16 years of education) and HEC Pakistan will facilitate in admission or the candidate must be currently enrolled in first semester in HEC recognized university, pursuing two-year Master’s degree.\nThe candidate must not be receiving any other academic scholarship or support while availing this scholarship programme. About the selection process, the HEC conveyed that the selection will be merit-based and factor-in academic credentials and selection interview.\nTo apply for this opportunity, the required documents are copy of valid Proof of Registration (POR) from Ministry of States and Frontier Regions (SAFRON), copy of Matriculation and Intermediate certificates with DMCs, copy of undergraduate degree and final transcript, two letters of recommendation from teachers, Letter of Motivation/Personal Statement and Proof of enrollment in institute like Admission letter (In case of enrollment in institute).\nThe applicants are advised to check their email and HEC website https://www.hec.gov.pk/english/HECAnnouncements/Pages/Announcements.aspx regularly for updates and apply well before the closing date to get assistance in case of any inconvenience. The closing date for submitting application is February 05.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:00:21.131Z"
}
