{
  "title": "Muslims targeted in India amid rising religious intolerance",
  "link": "https://www.app.com.pk/national/muslims-targeted-in-india-amid-rising-religious-intolerance/",
  "date_published": "2024-01-28T07:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP): India is facing a troubling increase in hatred and violence directed towards religious minorities, notably Muslims, Christians and Dalits. This has raised significant concerns regarding religious tolerance and communal harmony in the country.\nThe recent events across different regions of India, as reported by the Kashmir Media Service on Sunday, underscore the pressing need to address this issue.\nThe escalating situation is challenging India’s self-proclaimed secular and democratic identity, causing deep concern among peace-loving and law-abiding citizens, especially after the BJP government ideologically named it Bharat with a focus on Hindutva principles.\nA noticeable increase in hate attacks on Muslims has been seen in the run up to and post inauguration of the disputed Ram Temple in Ayodhya on January 22.\nIn several cases, Muslims have found themselves to be at the receiving end as the state machinery either connived with the mobs or looked the other way at the violence.\nA Muslim teenager was assaulted and paraded naked by a mob chanting Hindutva religious slogan for “disrespecting” a Hindutva saffron flag in Sangareddy district of Telangana state in India.\nThe Hindutva mobs include RSS, BJP, VHP and Bajrang Dal put fire on the 19-year-old Muslim victim’s private part and put out its video on various social media platforms.\nThe terror Hindutva mob’s ghastly act occurred as Narendra Modi was inaugurating the temple built on the ruins of the Babri Masjid.\nIn Mumbai city, the Hindutva mobs ransacked shops, damaged vehicles of Muslims and assaulted several people, days after violence broke out in the city’s Mira Road suburb on the eve of the disputed Ram temple inauguration.\nClashes erupted between Muslims and Hindutva groups after the latter insisted that their procession be allowed to pass through a Muslim neighbourhood despite police objections.\nSeveral Muslims were injured during the clashes and Muslim individuals were arrested. The Hindutva authorities’ bulldozed Muslim shops in Muslim-dominated area of Mira Road’s Naya Nagar of Mumbai city.\nEarlier, a Muslim shop manager faced harassment by a group of Hindutvas over a poster of Hindu deity Ram at a store in Dehradun, Uttarakhand state.\nThe police have initiated legal action following the incident wherein a mob objected to the poster of the Hindu deity at Aman General Store, owned by Rakesh Borai, and misbehaved with the Muslim manager.\nThe Hindutva mob hurled communal slurs and also attacked two Muslim employees, Mohammad Ayub Khan and Girish.\nIn Lucknow, a catering contractor, Pradeep Kumar Gupta, filed a police complaint against one of his customers, Madan Lal Vajpayee. The customer refused to pay the agreed dues of Rs 70,550 after getting to know that Yash Caterers had employed some Muslim waitress at his daughter’s wedding party.\nGupta took legal action when Vajpayee failed to pay the remaining amount, highlighting issues of discrimination and non-payment.\nOn the day of the inauguration of the temple, a Hindutva mob hoisted a saffron flag carrying a picture of Ayodhya’s Ram temple on a church in the Jhabua city of Madhya Pradesh state. The incident gained widespread attention after a video surfaced on social media platforms capturing Hindutva terrorists placing the flags atop the church amidst chants of “Jai Shri Ram.”\nWhile a Muslim youth, Mehdi Hasan, was brutally attacked and killed in the Uttar Pradesh city of Noida on the same day.\nThese incidents underscore the pressing need for authorities and society to address rising religious intolerance, discrimination, and violence, reaffirming the values of religious acceptance and communal harmony.",
  "retrievedAt": "2025-08-11T00:00:17.374Z"
}
