{
  "title": "Hamayun Khan orders reforms at District Jail Timergara after surprise visit",
  "link": "https://www.app.com.pk/national/hamayun-khan-orders-reforms-at-district-jail-timergara-after-surprise-visit/",
  "date_published": "2024-11-09T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD/TIMERGARA, Nov 9 (APP):Special Assistant to the Chief Minister for Prisons, Humayun Khan on Saturday, has ordered the suspension and removal of the Superintendent and Deputy Superintendent of District Jail Timergara.\nAfter a surprise visit to District Jail Timergara, Humayun Khan directed immediate corrective measures to address the poor administrative conditions at the facility, in line with the vision of Ali Amin Gandapur, the Chief Minister of Khyber Pakhtunkhwa. Humayun Khan has ordered the arrival of the best managing officials to implement the necessary reforms, said a press release here\nDuring his visit, Humayun Khan observed several critical issues, including substandard cleanliness, poor food quality and numerous complaints from inmates about mistreatment, said a press release here.\nAs a result, the Special Assistant issued directives for the immediate removal of Jail Superintendent Muhammad Riaz, Deputy Superintendent Bakht Rawan, and Assistant Superintendent Raj Wali. All senior staff members have been instructed to report directly to the Directorate of Prisons for further action.\nThe Special Assistant also inspected the jail’s food supply, cleanliness arrangements in the prison kitchen, and the health care facilities in the jail hospital. His findings were alarming, prompting him to order a full review of the management and an immediate transfer of prison staff.\nAddressing the situation, Humayun Khan stated, “The conditions at District Jail Timergara are unacceptable, and we will ensure that no one, including prisoners, is subjected to inhumane treatment. I am committed to implementing reforms that reflect the vision of our leadership.”\nHe further assured that similar surprise inspections would be conducted across all prisons in the province, stating, “Those failing to perform their duties responsibly will face strict consequences.”\nAccompanying Humayun Khan during the visit was Feroz Shah, Chairman of the Tehsil, who expressed his full support for the measures being taken to address the issues at the jail.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:09:57.040Z"
}
