{
  "title": "Putin extends condolences to Pakistan following Quetta terror attack",
  "link": "https://www.app.com.pk/national/putin-extends-condolences-to-pakistan-following-quetta-terror-attack/",
  "date_published": "2024-11-09T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 09 (APP): Russian President Vladimir Putin on Saturday conveyed his condolences to President Asif Ali Zardari and Prime Minister Shehbaz Sharif following a devastating terrorist attack at the Quetta Railway Station.\nIn a letter, President Putin expressed deep sorrow over the tragedy, which claimed the lives of several civilians, including women and children, and left many others injured.\nHe strongly condemned the “barbaric crime,” calling for justice for those responsible. He underscored Russia’s solidarity with Pakistan in the fight against terrorism, reaffirming Russia’s commitment to close cooperation with Pakistani authorities in combatting extremism and protecting citizens from violent acts.\n“We are determined to continue close cooperation with our Pakistani partners against all forms and manifestations of terrorism,” Putin wrote.\nHe expressed Russia’s determination to assist in the fight against such heinous crimes and hoped that the masterminds behind the attack would be appropriately punished.\nMeanwhile, Prime Minister of Malaysia Anwar Ibrahim conveyed his heartfelt condolence and sympathies over the incident.\n“On behalf of Malaysia, I extend our deepest condolences to the people of Pakistan, who mourn this senseless and devastating loss,” the Malaysian PM wrote on X.\nHe emphasized these acts of utter ruthlessness and violence, targeting both civilians and security personnel, were stark reminders of the relentless threats posed by extremism and ideological rigidity-forces that undermine progress and peace in Muslim societies.\n“Malaysia stands firmly in solidarity with the government of Pakistan in its steadfast fight against terrorism,” he added.\nThe government of Turkiye, condemning the terrorist attack in strongest words, extended condolences to the people of Pakistan and wished a speedy recovery to those injured.\n“We will continue to support Pakistan in its fight against terrorism,” the Turkish ministry of foreign minister said in a letter.",
  "retrievedAt": "2025-08-10T15:09:41.882Z"
}
