{
  "title": "PNCA’s National Performing Arts Group shines at Pakistan Day celebration in Dhaka",
  "author": null,
  "content": "ISLAMABAD, Apr 15 (APP):The National Performing Arts Group (NPAG) of the Pakistan National Council of the Arts (PNCA) captivated audiences with a mesmerizing performance at the Evening of Unity, Diplomacy, and Cultural Exchange held in Dhaka, Bangladesh, in celebration of Pakistan Day.\nOrganized by the Pakistan High Commission in Dhaka, Bangladesh, the prestigious event brought together dignitaries, diplomats, and members of the international and cultural communities, said a news release received here.\nThe evening was a tribute to the enduring spirit of Pakistan, reflecting the richness of its cultural heritage and the strength of its diplomatic relations.\nHigh Commissioner Syed Ahmed Maroof commended NPAG for their outstanding performance and presented a shield to  Inayat Ur Rahman, the group leader and conducting officer, in recognition of his exceptional leadership and supervision.\nThe High Commissioner also extended his appreciation to the entire NPAG team for their dedication, professionalism, and artistic excellence.\nDeputy High Commissioner Wasif also warmly acknowledged the contributions of the NPAG artists, offering heartfelt thanks for their role in promoting Pakistan’s cultural identity abroad.\nHe praised the group’s efforts in strengthening cultural diplomacy through the universal language of art and performance.\nSpeaking on the occasion, Inayat Ur Rahman expressed his gratitude to the High Commission for their generous hospitality, honor, and support. “It was a great privilege to lead such a talented team and represent PNCA and Pakistan at this esteemed platform. We are thankful for the opportunity and encouragement extended to us,” he stated.\nThe event concluded with an atmosphere of celebration, harmony, and pride, leaving a lasting impression on all attendees.\nPNCA and NPAG continue to serve as cultural ambassadors of Pakistan, fostering unity and showcasing the nation’s artistic legacy on international platforms.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:29:53.714Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pncas-national-performing-arts-group-shines-at-pakistan-day-celebration-in-dhaka/",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T16:42:00.000Z"
}
