{
  "title": "Senate pays tribute to Prof. Khurshid Ahmad",
  "author": null,
  "content": "ISLAMABAD, Apr 15 (APP):The Senate on Tuesday unanimously passed a resolution expressing deep sorrow over the passing of former Senator Professor Khurshid Ahmad, who died on April 12, 2025.\nThe resolution, moved by Federal Minister for Law and Justice Azam Nazeer Tarar, honoured Professor Khurshid as a distinguished economist, renowned Islamic scholar, and devoted statesman whose intellectual and public contributions left a lasting mark on Pakistan.\nThe minister highlighted that Professor Khurshid was the founder of the Institute of Policy Studies in Islamabad, a co-founder of the Islamic Foundation in the UK, and a founding trustee of the Punjab School. His scholarly work on Islamic economics and ideology earned national and international recognition.\nIn acknowledgment of his academic and social contributions, he was awarded the Nishan-e-Imtiaz, one of Pakistan’s highest civilian honors.\nProfessor Khurshid remained affiliated with Jamaat-e-Islami and served in the Senate across four terms: 1985–1991, 1991–1997, 2003–2006, and 2006–2012. He played a key role in shaping parliamentary debates on economic, constitutional, and ideological matters. As Chairman of the Senate Standing Committee on Economic Affairs and Planning, he provided crucial oversight on development policies and reforms.\nHe also actively participated in various committees, contributing to discussions on education, energy, national security, and Islamic jurisprudence.\nKnown for his intellectual clarity and principled stance, Professor Khurshid bridged academic insight with legislative action. His thoughtful input enriched Senate proceedings and helped shape national policy.\nBeyond the legislature, he also held executive roles, including Federal Minister for Planning and Development, Federal Minister for Energy, and Deputy Chairman of the Planning Commission, where he was instrumental in drafting and executing national development strategies.\nThe resolution conveyed heartfelt condolences to his family and friends and prayed for his eternal peace. A copy of the resolution passed by the Senate will be sent to the bereaved family.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:30:17.605Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-pays-tribute-to-prof-khurshid-ahmad/",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T16:25:00.000Z"
}
