{
  "title": "UK and Pakistan join hands to support safe return and reintegration of migrants",
  "author": null,
  "content": "ISLAMABAD, Apr 15(APP):In a powerful reaffirmation of the longstanding UK-Pakistan partnership, Deputy British High Commissioner Matt Cannell has emphasized the importance of tackling irregular migration while ensuring that returnees are treated with dignity, respect, and support upon their return.\nSpeaking at a key event , Cannell lauded the collaboration with Pakistani organization *WELDO*, which is spearheading reintegration efforts under the UK’s *Home Office Returns and Reintegration Plan (HORRP)*.\nHighlighting the deep-rooted ties between the two nations—anchored in a diaspora of 1.6 million people of Pakistani heritage and bilateral trade worth £4.8 billion—Cannell noted, “Our partnership is unique, built on shared values, economic cooperation, and mutual interest in areas like climate change and gender equality. Migration, too, is a part of that story—bringing both opportunities and challenges.”\nThe UK government has partnered with **WELDO**, a leading NGO, to ensure that returnees who have not stayed in the UK through legal means are supported in a safe and dignified transition back to their communities. *WELDO’s CEO Irum Masud* described the initiative as “a second chance delivered with honour and respect,” stressing that integration is “a respectable right, not a privilege.”\nSince 2010, WELDO has supported over *15,000 returnees*, providing services including business startup assistance, medical and legal support, accommodation, psychosocial help, and technical training. WELDO also operates at all major airports across Pakistan to ensure immediate and humane handling of returnees.\n*David Barlow*, Returns and Reintegration Manager at the British High Commission, echoed this sentiment in his keynote address, stating that the UK’s position is clear: “Returns must be respectful and dignified. Reintegration is not just about going home—it’s about rebuilding lives.”\nA short documentary screened at the event showcased moving stories of returnees, including *Raja Khizar Hayat*, a former tractor mechanic who was duped by an agent and lost his livelihood trying to go abroad illegally. With WELDO’s help, he now runs a small but growing cattle business with his wife. “This support gave me back my dignity,” he said.\nAnother returnee cautioned others against illegal immigration, calling it a “painful mistake” and urging people to choose legal routes.\n*FIA Deputy Director Qamar Zaman* concluded the event by reaffirming FIA’s role in managing legal border crossings and tackling human smuggling, while also praising the cooperation with WELDO: “Managing dignified returns is not just a policy—it is a profound human service.”\nThe UK’s HORRP, active in 12 countries, represents a humanitarian approach to migration management. With further plans for collaboration in the coming years, both the UK and Pakistan appear committed to not just managing migration—but doing so with humanity at its core.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:31:09.342Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/uk-and-pakistan-join-hands-to-support-safe-return-and-reintegration-of-migrants/",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T11:29:00.000Z"
}
