{
  "title": "Islamabad Police dismiss 15 officers for misconduct and dereliction of duty",
  "author": null,
  "content": "ISLAMABAD, Apr 15 (APP): Fifteen personnel of Islamabad Capital Police, including five Head Constables and seven Constables, have been dismissed from service over negligence in duty and misuse of authority.\nAn official told APP on Tuesday that departmental inquiries were conducted under the supervision of a Superintendent of Police (SP), which found the personnel guilty of misconduct and failure to perform their duties effectively.\nHe said the dismissed officers include Sub-Inspector Qasim Zia, Sub-Inspector Talat Mehmood, and Assistant Sub-Inspector Zaheer Ahmed.\nHe said Head Constables Almas Haider, Muhammad Ishaq, Waqas Idrees, Naveed Butter, and Sajid Mehmood are also among those dismissed.\nHe added that Constables Muhammad Nadeem, Muhammad Imran, Nazim Abbas, Zahid Khan, Ahsan Farooq, Imran Ahmed, and Qazi Azhar have also been removed from service following the inquiry.\nHe said the officials were penalized for exceeding their authority, failing to serve the public, and not taking effective action against criminal elements.\nHe said there is no place in the police force for those who fail to uphold the principles of public service, misuse their powers, or neglect their duties.\nHe added that strict departmental punishments would be handed down in cases of poor performance, corruption, abuse of power, and failure to protect the lives and property of citizens.\nHe said personnel demonstrating good performance would be rewarded.\n“All officers and personnel must perform their duties with full honesty, considering their service a form of worship,” he said.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:31:36.775Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/islamabad-police-dismiss-15-officers-for-misconduct-and-dereliction-of-duty/",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T04:15:00.000Z"
}
