{
  "title": "Lt Gen (Retd) Nigar Johar appointed as Brand Ambassador for Women Empowerment",
  "author": null,
  "content": "RAWALPINDI, Apr 15 (APP):In a historic move for gender equality and women’s leadership, the Rawalpindi Chamber of Commerce and Industry (RCCI) has appointed Lt Gen (Retd) Nigar Johar Khan as its official ‘Brand Ambassador’ for Women Empowerment and Women’s Initiatives.\nThe announcement was made during an event, “SHE Leads – A Tribute to Women,” which was held at the Chamber House the previous day. The ceremony celebrated the resilience, strength, and remarkable contributions of women across Pakistan, with Lt Gen (Retd) Nigar Johar Khan, the first and only female three-star general in Pakistan as the chief guest.\nRCCI President Usman Shahkat, in his welcome address termed her professional rendering as one of courage, dedication, and breaking barriers.\n“She has redefined what is possible for women in Pakistan and stands as a beacon of hope and aspiration”, he added.\nGroup Leader Sohail Altaf reiterated the Chamber’s unwavering commitment to inclusive development.\n“Events like these reinforce the message that women are key architects of Pakistan’s progress while honoring our national icons”, he said.\nDelivering keynote address, Lt Gen (Retd) Nigar Johar praised RCCI’s proactive stance on gender equality. “Creating spaces for women to lead, grow, and shape the future is essential”, she said and also commented on RCCI’s vision and dedication in empowering women.\nShe also highlighted the importance of unity and solidarity, endorsing RCCI’s upcoming solidarity walk in support of Palestine alongside the Palestinian ambassador.\nThe event was attended by Senior Vice President Khalid Farooq Qazi, Vice President Fahad Barlas, former presidents, executive committee members, Director AIC Ijaz Qamar Kayani, and a large number of women members.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:31:37.184Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/lt-gen-retd-nigar-johar-appointed-as-brand-ambassador-for-women-empowerment/",
  "dateList": "2025-04-15",
  "date_published": "2025-04-15T07:39:00.000Z"
}
