{
  "title": "NA standing committees elect their chairmen",
  "link": "https://www.app.com.pk/national/na-standing-committees-elect-their-chairmen/",
  "date_published": "2024-06-29T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): The National Assembly Standing Committees on Information Technology and Telecommunication, Commerce, Privatization and Industries and Production unanimously elected their chairmen in their maiden meetings held here on Saturday.\nThe meetings were attended by members of the respective Standing Committees and Chief Whips of the PML(N), PPPP and MQM, said a press release.\nThe elections were conducted by Muhammad Mushtaq, Advisor (Legislation), Syed Jawad Murtaza Naqvi Additional Secretary (Committees) and Syed Haseen Raza Zaidi, Joint Secretary (Committees).\nThe Standing Committee on Information Technology and Telecommunication unanimously elected Syed Amin ul Haq, MNA as its Chairman. His name was proposed by MNA Syed Mustafa Kamal and seconded by all the members of the committee, whereas the Standing Committee on Commerce unanimously elected Muhammad Jawed Hanif Khan as its chairman. His candidature was proposed by MNA Dr. Mirza Ikhtiar Baig and supported by all the members of the committee.\nThe Standing Committees on Privatization and Industries and Production unanimously elected MNAs Dr. Muhammad Farooq Sattar and Syed Hafeezuddin as chairmen, respectively in their separate meetings. Their names were proposed respectively by MNAs Pir Aftab Hussain Shah Jilani and Dr. Mahesh Kumar Malani and seconded by all the members of the committees.\nAfter conducting the elections, Advisor (Legislation) felicitated the newly elected chairmen on behalf of NA Speaker, Deputy Speaker and the Secretary General and assured their all-out support in discharge of their official responsibilities.\nAfter the elections, the newly elected chairmen assumed their seats and thanked their party leadership and fellow colleagues for reposing confidence in them by electing them as the Chairmen of the Standing Committees. They expressed the hope that with the concerted efforts of the Committee Members, the Committees would aptly play their role of parliamentary oversight on Executive.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:33:28.900Z"
}
