{
  "title": "Criminals taking advantage of face masks to hide identity",
  "link": "https://www.app.com.pk/national/criminals-taking-advantage-of-face-masks-to-hide-identity/",
  "date_published": "2020-10-11T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): As wearing face mask at public places has become a new normal in pandemic era, the criminals are misusing this precaution to conceal their identity.\nBefore the COVID-19, the people at shops or bank counters used to be on alert seeing a person with covered face, but in current scenario, it has become a troubling reality for the people as well as the law enforcement agencies.\nThe criminals easily blend in with the typical customers at the malls or banks and also easily hide their identity in CCTV footage after the crime.\n“If it were a pre-COVID time, I could have averted the happening by finding veiled people chasing me. But now it is normal. They looted me and sped away. One had face mask while other wore a helmet,” said APP senior reporter Ishtiaq Ahmed who was robbed of Rs 800,000 in I-8/1 on September 23 in broad daylight.\nHe said the mask provided a perfect cover to the robbers. They can hold up any bank or shop with their covered faces and escape unhindered as the police seldom bother to impound the bikes carrying no or non-standard number plates.\nIn another robbery of Rs 1.5 million in I-8 Markaz on September 30, a masked man was seen inside a bank who apparently intimated his accomplices on phone having witnessed a man leaving the bank with cash bag.\n“Earlier the bandanna or mask was a dicey proposition for criminals. Now a day it is normal but scary too. We can’t distinguish between customers and criminals.” said a bank employee anonymously for being unauthorized to speak to media.\nTalking to APP, a senior police officer, who did not want to be named, said though the crime increase had nothing to do with face mask however, it made it easier for the criminals to blend in.\nHe agreed that under anti-COVID SOPs, a provision could be created to allow security staff outside the banks or malls to ask the visitors remove face mask at entrance to allow the cameras capture the face.\nHe also opined that other than face coverings, the criminals or suspected people could also be singled out through their body language, movement or confidence when questioned.\nNot only in Pakistan, the criminals’ donning surgical masks is an issue getting global attention with some countries also pondering to revise SOPs or making specialized security arrangements to keep the criminals from entering the establishments.\nThe installation of vestibules, use of high quality cameras and identification softwares are being used to recognize the face behind mask. In America, police have guided people, in case of any crime, to note some specificity of the masked criminals like shoes or jacket brand, belt, socks color, face scars or tattoos to make the identification easier.",
  "retrievedAt": "2025-08-11T19:53:22.234Z"
}
