{
  "title": "No scientific evidence to support death penalty: Ambassador Androulla",
  "link": "https://www.app.com.pk/national/no-scientific-evidence-to-support-death-penalty-ambassador-androulla/",
  "date_published": "2020-10-11T07:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP):European Union (EU) Ambassador Androulla Kaminara said the European Union (EU) had a principled position against the death penalty in all the circumstances and for all the cases that it was unnecessary.\nAddressing an event on the eve of world day against the death penalty, she said, “There is no valid scientific evidence to support that the death penalty deters crime more effectively than other punishments. Instead, it is the certainty of being caught and punished that serves as a deterrent and of course actions to prevent such crimes from happening in the first place.\nThe EU ambassador said,“The call for the death penalty might come from an impulse in reaction to a horrific crime. But as a society, we need to reflect deeper on what justice really means and what needs to be done for such crimes not to happen again. The performance that premiered today invites us to enter this discussion.”\nMeanwhile, Federal Minister for Law and Justice Barrister Dr Muhammad Farogh Naseem said implementing the law regarding criminal justice system in Pakistan was a complicated issue due to some cultural and social taboos and needed improvement.\nThe people in general were not satisfied and had expectations from the Pakistan Tehreek-e-Insaf government to bring changes in the law so that the accused should not get scot-free, he said while speaking as a chief guest.\nFarogh Naseem briefed the audience in detail about the reforms measures taken by the present government in the justice system, like early adjudication of civil cases, transfer of inheritance, ensuring rights of women in inherited properties, and provision of legal assistance from the state to the weaker and poorer segments.\nOn the occasion, an art performance titled ‘Before The Sun Comes Up’ was screened to highlight the miseries of a death row prisoner and his sentiments.\nAmbassadors from the EU countries, representatives of civil society and government officials attended the function.",
  "retrievedAt": "2025-08-11T19:53:24.560Z"
}
