{
  "title": "Nausheen urges public to take part in 3rd phase Covid-19 vaccine trials",
  "link": "https://www.app.com.pk/national/nausheen-urges-public-to-take-part-in-3rd-phase-covid-19-vaccine-trials/",
  "date_published": "2020-10-11T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP):Parliamentary Secretary, National Health Services Regulations and Coordination Nausheen Hamid Sunday said over 10,000 people would be volunteered to take part in COVID-19 vaccine trials in country thus helping to speed up efforts to discover a safe and effective vaccine.\nTalking to PTV news channel, she urged the general public to take part in third phase Covid-19 vaccine clinical trials which is continued in Shifa International Hospital in Islamabad.\nShe said getting 100,000 volunteers on board is a great start but we need many more people from many different backgrounds that we can call on for future studies if we are to find a vaccine quickly to protect those who need it against coronavirus.\nThe third phase vaccine trials are free of charge for any citizen living in country, she added.\nShe further explained that the Pakistan has already started stage three clinical trials of a China-made vaccine for COVID-19 with the assistance of China and this vaccine will be administered to 8,000 to 10,000 volunteers across the country and its final results are expected to come out in about six months.\nShe said the trial of the vaccine is a vital step for Pakistan because it will help in the capacity building of the country to prepare vaccines against other viral diseases, adding, within few days these clinical trails will further expand to other cities.\nReplying to a question, she urged the nation to wear face masks in public to avoid a spike in coronavirus infections, saying there were concerns that “onset of winter” could result in a second wave.\nShe said the number of active Covid-19 cases has been increasing in the country, adding, public cooperation is imperative to stop the spread of coronavirus and people will have to be more cautious because they can remain safe from this virus by following the necessary precautions.\nShe said that the administration would be left with no option but to seal more localities if the violations of standard operating procedures (SOPs) devised to control the pandemic were not stopped.\nAnswering another question, she said Pakistan is rapidly increasing its capacity to strengthen the health sector to cope with coronavirus pandemic by setting up 150 new labs, manufacturing local ventilators, testing kits and protective kits.\nShe said it is appreciable that now we are making our own personal protective equipment (PPE) in Pakistan.\nShe also appreciated the help of Chinese government that the Chinese support reaffirms that being Iron brothers and all-weather friends, Pakistan and China have always helped each other in times of need.\nShe expressed disappointment over people’s ignoring protective measures after the government eased restrictions, and once again urged them to follow the SOPs to curb rising Covid-19 cases, because failure to do so would prompt the government to reimpose lockdown.",
  "retrievedAt": "2025-08-11T19:53:24.542Z"
}
