{
  "title": "Religious Ministry seeks scholarship applications from minority students",
  "link": "https://www.app.com.pk/national/religious-ministry-seeks-scholarship-applications-from-minority-students/",
  "date_published": "2020-10-11T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): The Ministry of Religious Affairs and Interfaith Harmony has asked the deserving minority students to submit applications for scholarship before October 19.\nOrphans, destitute, needy, handicapped and poor minority students, having good educational record were eligible for scholarships for the financial year 2020-21, a ministry official said.\nThe primary to professional level minority students of various government institutions can submit their applications to the ministry’s office located at Green Trust Tower, Eighth Storey, Blue Area, Islamabad.\nAccording to the criteria, the regular students of Hindu, Sikh, Christian, Buddhists, and other communities, of government institutions, having at least 50 percent marks in their last annual examination were eligible for the scholarships.\nAlso, the monthly income of parent/guardian of school level applicants must not exceed from Rs 35,000 per month.\nStudents of private institutes were not eligible.\nThe heads of the educational institutions of the applicants have been directed to forward the applications after checking the veracity of documents of the guardian/parent of the student.\nThe attested marks sheet, progress report must be attached with the application form. In case of semester system attested copies of marks sheet for last two semesters and father/guardian’s parent original income certificate.\nMark sheet on plain paper would be rejected.\nThe applications must be submitted on new prescribed performa, duly supported with attested copies of last examination\nAn attested copy of the school progress report, last two annual marks sheets and original income certificate of the father or guardian of the applicant must be submitted along with the application.\nThe heads have been directed to make a list of the applicants after appending the covering letter. Only the applications received\nthrough educational institutions concerned shall be considered.\nThe students already getting scholarship from any other source would not be eligible for submitting application.\nThe students must attach attested copies of Computerised National Identity Cards (CNIC) or form B, email address, phone number.\nStudents on the application forms could be downloaded from www.mora.org.pk.\nStudents, parents and guardians have been directed to submit their contact numbers or email address alongwith the application for future correspondence. The application forms received before advertisement and after closing date shall not be considered.",
  "retrievedAt": "2025-08-11T19:53:21.362Z"
}
