{
  "title": "Fizza Hasan awarded France’s Ordre des Arts et des Lettres for promoting theatre and Francophonie in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Oct 03 (APP): The French government has honoured Pakistani theatre director and educator Fizza Hasan with the insignia of Chevalier de l’Ordre des Arts et des Lettres in recognition of her contribution to arts, literature, and Francophonie.\nThe award was conferred at a reception held here at the French Residency, attended by diplomats, artists, academics, and cultural figures.\nThe Ordre des Arts et des Lettres (Order of Arts and Letters), established in 1957, is one of France’s most prestigious distinctions awarded by the Ministry of Culture to individuals who have made outstanding contributions to the enrichment of arts and literature.\nFrench Ambassador Nicolas Galey highlighted Fizza’s efforts to strengthen cultural exchange between Pakistan and France through theatre and education.\nIn his remarks, they noted her diverse upbringing, having been born in London and raised in Pakistan as well as in African countries like Tanzania and Ghana. It was during her stay in Accra, Ghana, that she first studied the French language at the Alliance Française, an unusual step in two non-Francophone countries.\nFizza Hasan pursued higher education in French, earning master’s degrees from the National University of Modern Languages (NUML) in Islamabad and Université Stendhal in Grenoble. She later worked at Alliance Française Islamabad, first as a French language instructor and later as Director of Studies, playing an important role in building the Francophone community in the capital.\nIn 2004, Fizza co-founded the Theatre Wallay group, which soon became an active platform for staging both local productions and adaptations of international classics. Under her direction, the group introduced Pakistani audiences to notable works of French theatre, including Molière’s Tartuffe and L’École des Femmes, Eugène Ionesco’s La Leçon, Jean Anouilh’s Antigone, and Jean-Paul Sartre’s Huis Clos. Many of these were performed in English or Urdu translations, allowing a wider audience to engage with French literary traditions.\nThrough these productions, Fizza and her team encouraged reflection on universal themes present in French theatre while also exploring social debates relevant to Pakistan. The French Embassy described Theatre Wallay as more than a performing arts group, noting its role as a space for creativity, critical thought, and dialogue values central to France’s cultural diplomacy.\nSpeakers at the ceremony emphasised that theatre is not only an art form but also a medium for confronting the past, debating present challenges, and imagining the future.\nFizza Hasan’s contribution, they said, has enabled thousands of Pakistanis to connect with these ideas through French plays while also providing opportunities for local writers, directors, and actors to develop their own work.\nPresenting the award on behalf of the French Minister of Culture, officials praised Fizza Hasan’s dedication to theatre and language, expressing hope that her work will continue to inspire dialogue and cultural understanding in Pakistan.\nThe ceremony concluded with the formal presentation of the insignia, pinned on the recipient’s left side, followed by the traditional embrace marking the conferral of the honour.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:47:29.260Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fizza-hasan-awarded-frances-ordre-des-arts-et-des-lettres-for-promoting-theatre-and-francophonie-in-pakistan/",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T16:48:00.000Z"
}
