{
  "title": "Biometric verification made mandatory for power connections under IESCO-NADRA agreement",
  "author": null,
  "content": "ISLAMABAD, Oct 03 (APP):In a move to enhance transparency and consumer protection in the power sector, Islamabad Electric Supply Company (IESCO) and NADRA Technologies Limited have signed an agreement to introduce mandatory biometric verification for all new electricity connections and reconnections.\nThe agreement, signed at IESCO’s Head Office by Engineer Chaudhry Khalid Mehmood, CEO IESCO, and Umar Khan Azad, CEO NADRA Technologies, marks a significant step toward digitizing utility services in line with the Government of Pakistan and Ministry of Energy’s consumer-friendly and digitalization policies.\nUnder the new system, biometric verification will be required to authenticate the identity of applicants, ensuring secure and fraud-free access to electricity services.\nThe initiative is expected to streamline service delivery, eliminate bogus connections, and enhance accountability across the distribution network.\nSpeaking at the signing ceremony, Engineer Chaudhry Khalid Mehmood emphasized the importance of modernizing infrastructure to meet evolving consumer needs. “This partnership with NADRA Technologies will not only improve operational efficiency but also reinforce public trust in our services,” he stated.\nUmar Khan Azad echoed the sentiment, highlighting NADRA’s commitment to leveraging technology for public good. “Secure identity verification is the cornerstone of transparent governance, and we’re proud to support IESCO in this transformative journey,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:47:49.971Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/biometric-verification-made-mandatory-for-power-connections-under-iesco-nadra-agreement/",
  "dateList": "2025-10-03",
  "date_published": "2025-10-03T18:48:00.000Z"
}
