{
  "title": "Modi’s govt fails to achieve any result of Aug 5, illegal actions: P Chidambaram",
  "link": "https://www.app.com.pk/national/modis-govt-fails-to-achieve-any-result-of-aug-5-illegal-actions-p-chidambaram/",
  "date_published": "2020-08-02T04:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP):Indian politician and former Indian minister, P Chidambaram, who is currently Member of Rajya Sabha, has said that Indian Illegal Occupied Jammu and Kashmir (IIOJK) is a big jail adding that Modi government has failed to achieve any result of August 5, 2019 illegal actions.\nAccording to the Kashmir Media Service, P Chidambaram in an article published on Sunday referred to the abrogation of Article 370 of the Indian constitution to strip IIOJK of its special status said, “Project IIOJK was intended to break up the state, reduce its status to Union territories, bring the territories under the direct rule of New Delhi, suppress political activities, intimidate 7.5 million people of the IIOJK into submission, and quell” freedom struggle. “While the means have been employed, none of the ends has been achieved and, in my view, will never be achieved under the current dispensation’s policy,” he added.\n“All major fundamental rights are effectively suspended. The Public Safety Act and the Unlawful Activities (Prevention) Act are invoked indiscriminately. Cordon and Search Operations (CASO) are conducted widely and daily to curb movement. All statutory commissions to uphold rights have been wound up. The new media policy is a candid admission that a free media has no place in IIOJK and it sanctifies censorship,” the article said.\nThe Indian politician pointed out that the cases of Mubeen Shah, Miyan Abdul Qayoom, Gowher Geelani, Masarrat Zahra and Safoora Zafgar illustrate the abuse of law and the difficulties in getting justice. “The Kashmir Chamber of Commerce and Industry has estimated that the loss of production in IIOJK alone since August 2019 is about `40,000 crore and loss of jobs is 4,97,000. Tourist arrivals fell from 6,11,534 (2017) to 3,16,424 (2018) to 43,059 (2019). The fruit, garment, carpet, IT, communications and transport industries have been badly hit.”\nThe Supreme Court has yet to hear finally and decide the cases on constitutionality of the IIOJK Reorganisation Act, restoration of 4G services and the amendments to the Unlawful Activities (Prevention) Act, besides the numerous petitions challenging the denial of different human rights.\nAt the end of the article he says, “It will be a year on August 5, yet our vaunted Constitutional institutions—Parliament, courts and plural political system—have found no answers to the new Kashmir issue created on August 5, 2019. That is a sad failure, and the sadness is compounded by the fact that there is no Abraham Lincoln on the horizon. Nor can we hear the soul-stirring words “that this nation shall have a new birth of freedom; and that government of the people, by the people, for the people shall not perish from the earth”.",
  "retrievedAt": "2025-08-11T19:35:25.144Z"
}
