{
  "title": "Eid-ul-Azha being celebrated in country amid Covid-19 SOPs",
  "link": "https://www.app.com.pk/national/eid-ul-azha-being-celebrated-in-country-amid-covid-19-sops/",
  "date_published": "2020-08-02T02:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP):Eid-ul-Azha celebrations are continued for second day of Eid on Sunday across the country with religious fervor, enthusiasm in commemoration of the supreme sacrifice offered by Hazrat Ibrahim (AS) and his son Hazrat Ismail (AS) in the fulfillment of the divine order, by strictly following precautionary measures against Covid-19.\nThe Muslims across the country continued slaughtering animals on the second day to draw inspiration from the unique example of sacrifice set by Hazrat Ibrahim (AS). Some faithful sacrifice the animals on even third day as prices of animals registered a slight decline on second and third day.\nCivic authorities of almost all cities and towns have already cancelled the leaves of their sanitary staff for prompt disposal of offal and other solid waste during the Eid days.\nThe government has already issued standard operating procedures (SOPs) and guidelines for avoiding the COVID-19 pandemic while performing the ritual of sacrificing animals. Meanwhile, the first day of Eid-ul-Adha was celebrated with simplicity. The day dawned with special prayers in mosques for well-being of the Ummah and progress, prosperity and security of the country.\nEid congregations were held at mosques, Eidgahs and open places in all cities, towns and villages across the country. Ulema in their Khutbah of Eid highlighted the significance of the philosophy of great sacrifice offered by Hazrat Ibrahim and Hazrat Isamel (AS). Policemen in plain clothes as well as in uniform had performed duties at Eid congregations for the security of the faithful.\nSpecial prayers were also held for the oppressed people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) who are facing unprecedented Indian brutalities.\nPresident Dr Arif Alvi offered Eid-ul-Azha prayer at the Aiwan e Sadr. President and Prime Minister Imran Khan in their Eid messages urged the nation to strictly follow precautionary measures on the occasion of Eid ul Azha and perform the obligatory rituals of Qurbani, taking care of the poor and needy people.\nPrime Minister Imran Khan in his message said the whole world is facing a critical situation right now due to coronavirus as the pandemic has become a challenge for all humanity.\nThe biggest Eid congregation in the Federal Capital was held at Faisal Mosque where thousands faithful prayed for blessing of the Almighty Allah. Dr Tahir Hakeem led the prayers.  Islamabad Capital Territory (ICT) administration had deputed hundreds of policemen and several teams of anti terrorism force (ATF) commandoes to perform security duty in mosques and imambargahs across the capital.\nIn Rawalpindi, Railways Minister Sheikh Rashid Ahmed offered Eid prayers at Liaquat Bagh. The Eid congregations held at various places including Shamsabad Park Murree Road, Rawalpindi Medical College Ground, Jamia Masjid-al-Azim Quaid-e-Azam Colony, Jamia Masjid Wapda Colony Mareer Hassan, Jamia Masjid Farooq-e-Azam Girja Road, Jamia Masjid Khulfa-e-Rashdeen Khayaban-e-Sir Syed, Jamia Masjid Umer bin Khatab Dhoke Mustaqeem, Jamia Masjid Siddiquia Pathano Wali Mareer Hassan, Jamia Masjid Talha Dhoke Mustqeem and Jamia Masjid Sufi Roshan Mohala Mohanpura.\nOver 4500 policemen were deployed here under a comprehensive security plan chalked out for peaceful observance of Eid ul Azha. Elite Force, Mohafiz Squad, Special Branch personnel along with ladies police and police national volunteers performed security duties during Eid prayers.\nIn Lahore main Eid congregation was held at Badshahi Mosque where Maulana Abdul Khabeer Azad led the prayer. Punjab Chief Minister Sardar Usman Buzdar and Punjab Governor Chaudhry Mohammad Sarwar offered Eid prayer at Governor’s House.\nIn Sindh, the Eid congregations under Standard Operating Procedures devised by the government held at Moaques, Eiggahs, and open places in all the small and big cities in the province to avoid COVID- 19.\nIn Peshawar, the main Eid congregations was held at Eidgah Charsadda Road, Mohabat Khan Mosque, Sonheri Mosque and Zarghoni mosque Hayatabad besides others mosques where people sought mercy and forgiveness.\nChief Minister Mahmood Khan, Minister for Labour Shaukat Yousafzai and Special Assistant Kamran Bangash offered Eid prayer at Governor House in Peshawar.\nIn Quetta Eid prayer were offered at more than 200 places including Masajids, Eidgahs, open places and Imambargahs. Governor Balochistan Amanullah Khan Yasinzai, offered Eid prayer at Governor House in Quetta  while Chief Minister Mir Jam Kamal Khan is celebrating Eid in Lesbella.\nIn Gilgit, Eid prayers were offered  in thirty places, including Imamia Eid-Gah,  Lalik Jan stadium, Konodas Eidgah and Shah Karim Hostel  at morning.\nEid-ul-Azha also celebrated all over Azad Jammu and Kashmir with religious fervor to commemorate the supreme sacrifice offered by of Hazrat Ibrahim (A.S) of his son Hazrat Ismail Zabiullah.\nThe biggest Eid congregation in the AJK capital was held at Markazi Eidgah where large number of people offered eid prayers under the set SOPs to avert threat of the spread of novel coronavirus.\nFollowing the deteriorating human rights situation in the Occupied Jammu and Kashmir and Corona pandemic, Prime Minister Raja Farooq Haider Khan had appealed masses to celebrate the Eid with simplicity expressing complete solidarity with the brethren Kashmiris through demonstrations, processions and rallies after Namaz-e-Eid with all recommended precautionary measures.\nChief Of Army Staff General Qamar Javed Bajwa spent Eid day with troops at Line of Control (LoC) in Khuiratta Sector.",
  "retrievedAt": "2025-08-11T19:35:25.044Z"
}
