{
  "article_id": "2025-05-23_a96ba43a3173d4d1cb6d1e90261e7e17",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-quota-fully-utilized-private-pilgrims-left-behind-amid-payment-failures-sardar-yousaf/",
    "retrieved_at": "2025-08-27T15:49:19.108Z"
  },
  "metadata": {
    "title": "Govt quota fully utilized, private pilgrims left behind amid payment failures: Sardar Yousaf",
    "author": null,
    "date_published": "2025-05-23T16:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 592,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 23 (APP): Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Friday addressed the recent controversy over Pakistan's private Hajj quota, attributing the issue to private tour operators' failure to meet deadlines and comply with Saudi government regulations. Speaking at a press conference at PTV headquarters, the minister clarified the developments surrounding this year's Hajj arrangements. He noted that the Hajj policy had been approved in November, months before he took charge of the ministry in March. According to Sardar Yousaf, he personally visited Saudi Arabia twice to oversee the arrangements. He said Pakistan's total Hajj quota was equally divided between the government and private schemes, with the entire government quota now utilized. However, the private sector failed to remit funds on time and did not adhere to instructions issued by Saudi authorities, resulting in a significant portion of the private Hajj quota going unused. \"Tour operators showed negligence in meeting deadlines, and as per Saudi directives, only companies with a minimum of 2,000 quota allocations were eligible,\" he added. The Hajj Organizers Association of Pakistan (HOAP) had formed 41 clusters and was required to deposit 25 percent of the payment by February 14. \"Very little amount was deposited by that date,\" the minister noted. Even after a 48-hour extension, only funds for 10,000 pilgrims were secured. Following diplomatic efforts led by Pakistan's Foreign Minister, an additional quota of 10,000 pilgrims was allocated not only to Pakistan but also to other Muslim countries. \"This year, 25,698 pilgrims will perform Hajj under the private scheme,\" he confirmed. Responding to claims from some tour operators that they were unaware of deadlines, the minister maintained that all communications were made in a timely manner. \"We provided the relevant lists to the qualifying companies well in advance,\" he said. Prime Minister Shehbaz Sharif has constituted a high-level inquiry committee to investigate the matter. \"Those found responsible will be held accountable once the inquiry report is submitted,\" the minister assured. Minister Yousaf said he had personally checked on pilgrims under the government scheme during his visits to Saudi Arabia and found the arrangements - transportation, food, and accommodation - satisfactory. \"The government scheme follows a single-tier system. Any pilgrim facing difficulties should contact our staff on the ground,\" he added. When asked by a journalist about complaints regarding food and missing support staff, the minister responded that all complaints were being addressed promptly. \"Companies that failed to provide proper meals will be blacklisted,\" he said. He also confirmed that a one-time transport issue had already been resolved. Secretary for Religious Affairs Dr. Atta-ur-Rehman, who also spoke during the press conference, said a probe was underway to determine how a blacklisted Saudi company managed to secure a contract this year. He added that pilgrims were allowed to opt out of pre-arranged meals and receive 34 Saudi Riyals per day instead. \"So far, no pilgrim has availed this option,\" he said. Responding to media queries, Dr. Rehman acknowledged that some tour operators transferred funds into incorrect accounts, causing delays in booking accommodations. \"The DG Hajj account received only 50 million riyals, whereas 700 million were required. Though 50 million were initially misrouted, they were returned between December and January,\" he said. Despite the setback, Dr. Rehman noted that plots could have been booked with the available funds if managed properly. Concluding the press conference, Minister Yousaf stated unequivocally: \"The Saudi government is not providing any more Hajj quota. Those private scheme pilgrims who missed out this year, will unfortunately now have to remain so.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}