{
  "title": "Like other parts of Pakistan, PTI to break ‘political idols’ in AJK too: Fawad",
  "link": "https://www.app.com.pk/national/after-breaking-political-idols-in-pakistan-gb-pti-to-win-ajk-polls-too-fawad/",
  "date_published": "2021-07-10T16:04:00.000Z",
  "source": "APP",
  "content": "ABBOTABAD, Jul 10 (APP): Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain on Saturday said the Pakistan Tehreek-e-Insaf (PTI), under the dynamic leadership of Prime Minister Imran Khan, would break “political idols” in the AJK Legislative Assembly elections like it had already done in other parts of Pakistan.\nAddressing party workers here, he said both the political novices Bilawal Bhutto Zardari and Maryam Safdar had campaigned for their respective party candidates in the GB. However, they got frustrated when they realized that their parties had failed to field candidates for many GB Legislative Assembly seats.\nThey were facing the same situation in the Azad Jammu and Kashmir (AJK), where the Pakistan Muslim League-Nawaz (PML-N) and the Pakistan Peoples Party (PPP) could not find candidates in many constituencies, he added.\nFawad said both the parties in fact had no political culture as they were being run by two royal families.One had a “Maharani”’ and the other a “Maharaja” at the helm of their affairs, who had no respect for their party leaders and even treated their parties’ former prime ministers like “slaves”.\nHe said both Bilawal and Maryam, who were in fact busy in their “Abbu Bachao” (save father) campaigns, knew nothing about the relationship of Pakistanis and Kashmiris as evident from their speeches.\nHe reminded the AJK people that it was Maryam Safdar that at her daughter’s marriage ceremony Indian Prime Minister Narendra Modi was the special guest.\nLikewise, he said, Bilawal did not know that Pakistan had fought three wars with India on the Kashmir dispute.\nPakistanis and Kashmiris, he said, were one nation and no one could separate them. There was no graveyard in Jhelum, Abbottabad and Mansehra where the army personnel martyred (at the Line of Control) were not buried, he added.\nHe said when the Federal Government came to know that an Indian firm had gotten rights of live coverage of Pakistan team cricket matches, it immediately revoked the same representing the sentiments of the nation.\nThe government decided that no business would be done with any Indian entity, he added.\nHe said both Bilawal and Maryam knew nothing as to how to run the national economy, as they had practically done nothing to earn even a single rupee.\nThey were born with golden spoons in their mouths as their fathers Asif Zardari and Nawaz Sharif had built empires abroad and purchased palaces for them in major world cities.\nFor that both Zardari and Nawaz, while in power, had looted and plundered the national wealth and now they were facing cases and were unable to take part in election campaign, he added. Even one of them had absconded abroad, the minister said.\nHe said Maryam and Bilawal knew nothing about the problems of the poor as they had never traveled by public transport.\nFawad vowed that the PTI government would bring back the looted national wealth stashed by the plunderers abroad.\nThe PTI, he said, came into being as a reaction to the ‘loot and plunder’ of the former ruling parties. The party in fact represented the lower and lower middle classes, who were totally neglected by the past rulers.\nThe minister said when the PTI came to power in 2018, Pakistan was on the verge of default and it had to take emergency assistance from friendly countries like China, Saudi Arabia and the United Arab Emirates to keep the economy afloat.\nHe said today economy was stable due to the prudent policies of present government, as record funds had been allocated for development programmes in the current fiscal year.\nPrime Minister Imran Khan was bringing a revolution and Pakistan was destined to become a developed country, he added.\nKhyber Pakhtunkhwa Assembly Speaker Mushtaq Ahmed Ghani, PTI Member of the National Assembly Ali Khan Jadoon, KP Minister for Revenue Qalandar Lodhi and PTI candidate for LA-45 Abdul Majid Khan also addressed the gathering.",
  "retrievedAt": "2025-08-11T20:57:19.391Z"
}
