{
  "title": "Quality education vital for country’s inclusive growth: EU Envoy",
  "link": "https://www.app.com.pk/national/quality-education-vital-for-countrys-inclusive-growth-eu-envoy/",
  "date_published": "2021-07-10T11:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP): EU Ambassador to Pakistan Androulla Kaminara on Saturday said the European Union continued to support Pakistan in its efforts to strengthen education and good governance for pursuing a path of inclusive growth and development in the country.\nTo materialize the concept of good governance and strengthening education system here, particularly in far flung areas of Balochistan and other provinces, the EU would fund to the Balochistan Education Support (BES) II, a five-year education development programme amounting to Euros 7.4 million (PKR 3.27 Billion).\nWhile talking to APP, Androulla Kaminara said, “ An educated young generation is more imperative for Pakistan to pursue a path of inclusive growth and development.”\nTerming the education as a basic human right and key to ensuring that people do not fall behind in society and in life, she said ” the EU is committed to ensuring access to quality education for all boys and girls in Balochistan, which will enable them to follow their dreams and contribute to a better future for Pakistan.”\nReplying to a question about about Coronavirus and its worst impacts on education system, the envoy said the pandemic had shaken the world economy and leaving the people in a difficult situation, however, the main focus of the EU to address COVID-19 challenges and taking steps to reduce its significant impacts on education and others sectors.\nAndroulla Kaminara said ” the EU will continue to work closely with its partners including the Government of Balochistan and UNICEF to support and strengthen Pakistan’s education system.”\nTo another qurey, she said ” The EU’s support on primary and secondary education is a priority area under the EU-Pakistan Strategic Engagement Plan, which serves as guide for bilateral relations between the two sides and aims to further enhance engagement and work towards addressing emerging global challenges.”\nWhile, she said that substantial progress was being made under the BBEP as the European Union (EU) and the United Nations Children’s Fund (UNICEF) have formally signed an agreement to launch the Balochistan Education Support (BES) II.\n” The overall cost of this project is Euro 22.2 million and UNICEF co-financing is Euro 4.8 million (PKR 0.92 billion). The new programme aims to contribute to supporting the Government of Balochistan to build high- quality performance and management education systems in the province.”\nShe said that the project would contribute to the overall objective of improving literacy, numeracy, skills and qualifications for the people in the province. It will do so through improving access to quality primary and middle-level education and by increasing accountability, reporting and transparency of the Secondary Education Department.\nUNICEF Representative in Pakistan Aida Girma, in a statement said, “The setback to educational activities due to COVID19 must not deter us from trying to provide a better and brighter future for the children and young people of Balochistan.”\nShe hope that under leadership and vision of the Education department, supported by generous funding from the EU and encouraged by the resilience and determination of the people, UNICEF would endeavor to translate children’s right to education into outcomes.\nShe said ” The BES II will go a long way to help achieve the long-term targets set in BBEP and the new initiatives reflected in the programme.”\nAida Girma said ” To make up for the academic time lost due to COVID19, additional activities have been included in BES II. These include training of teachers on Standard Operative Procedures (SoPs) for school health and safety, tailoring enrollment drives to ensure that children return to education and providing alternatives for children who drop out due to economic impact of the crises.”\nShe informed that the EU provided Pakistan with about €100 million annually in grants in its efforts to tackle poverty, increase education, promote good governance, human rights, rule of law and ensure sustainable management of natural resources. EU-funded projects cover all of Pakistan with a special focus on Sindh and Balochistan.\nReported By Shabbir Hussain\nAPP, Digital News Service.",
  "retrievedAt": "2025-08-11T20:57:21.277Z"
}
