{
  "article_id": "2025-08-18_2dc65f873051b07170907a780ae11e29",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/planning-ministry-launches-uraan-ai-techathon-1-0-to-ignite-innovation/",
    "retrieved_at": "2025-08-20T04:49:27.413Z"
  },
  "metadata": {
    "title": "Planning Ministry launches ‘URAAN AI Techathon-1.0’ to ignite innovation",
    "author": null,
    "date_published": "2025-08-19T03:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 452,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 18 (APP): The Ministry of Planning, Development and Special Initiatives on Monday officially launched the 'URAAN AI Techathon-1.0' - a national innovation competition aimed at mobilizing the country's top talent to craft AI-driven solutions for high-priority sectors. This decisive push toward harnessing artificial intelligence for national development is part of the government's broader URAAN Pakistan - National Innovation Mission, designed to align AI innovation with national policy goals across key areas. Registration for the Techathon is now open via a dedicated online portal, which would serve as the central hub for registrations, communications, updates, resources and event coordination. Speaking at the launch ceremony, Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal said the Techathon 1.0 marked the beginning of national-level artificial intelligence competitions in Pakistan, calling it \"a milestone in Pakistan's digital history.\" He said this was not just a competition but a movement to activate youth participation in AI, highlighting that AI was no longer the future, but the present, as sectors such as health, education, agriculture, industry and governance continued to be transformed. \"Today,\" Ahsan Iqbal said, \"decisions are no longer made solely in economies, but in algorithms.\" He stressed the urgent need for Pakistan to actively engage in the global AI revolution to avoid technological dependence on others. \"Pakistan will not be a spectator in the AI revolution; it will become an emerging leader,\" he vowed, expressing confidence that Techathon 1.0 would unlock new avenues for national development through youth innovation. He highlighted that the secret to national progress lies in stability, policy continuity and reforms, reiterating the government's commitment to bringing innovative AI solutions to the fields of health, education, agriculture and climate change. In line with this vision, Ahsan Iqbal noted that local startups, universities, and technology parks would receive full support, as the Techathon reflectd the URAAN Pakistan vision - a roadmap steering the country toward becoming a trillion-dollar economy by 2035. URAAN Pakistan, he explained, was built on five pillars, with the Techathon closely tied to e-Pakistan and youth empowerment. He said Artificial Intelligence was being integrated into academic curricula, and national capacity was being mobilized through this initiative. Expressing full confidence in Pakistan's youth, he said: \"Our youth have the same enthusiasm that powered the world's leading tech hubs. Their thinking, ideas and vision are Pakistan's greatest assets.\" He pointed out that AI could predict diseases in crops, assist doctors in diagnosis and bring quality education to every child in the country. The minister also announced the government's efforts to establish a national AI policy, task force, funding mechanisms and centers of excellence, urging young Pakistanis to experiment, innovate, and prove they are second to none on the global stage.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}