{
  "article_id": "2025-08-18_2b1d8c757d5c5014aff74219cc86b141",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-leas-unite-to-expel-illegal-immigrants-from-capital-region/",
    "retrieved_at": "2025-08-20T04:49:48.065Z"
  },
  "metadata": {
    "title": "CDA, LEAs unite to expel illegal immigrants from Capital region",
    "author": null,
    "date_published": "2025-08-19T03:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 277,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 18 (APP):The Capital Development Authority (CDA) and Islamabad administration have launched a coordinated crackdown on foreign nationals residing illegally in the federal capital and surrounding districts. CDA chief following a high-level task force meeting directed the formulation of a comprehensive plan to prevent the resettlement of undocumented foreigners and called for an integrated database containing complete records, including residential details. \"Seamless data synchronization among all relevant institutions is essential. Only foreigners with valid visas will be allowed to stay, and strict legal action will be taken against violators,\" he said. The task force decided to declare Islamabad, Rawalpindi, Attock, Murree, and Haripur as \"safe zones\" by ensuring no undocumented foreign nationals could settle there. Authorities will monitor adjoining areas, enforce action against unregistered foreign tenants, and strengthen coordination through the appointment of focal persons in each district. In addition, it was agreed that stamp papers will no longer be issued for property transactions involving undocumented foreigners, while the Pakistan Telecommunication Authority (PTA) will block mobile SIM issuance to those without valid visas. The Tenancy Act will also be strictly enforced. Randhawa underscored that district administrations will immediately begin data collection on foreign nationals residing without legal documents. He stressed that the government is committed to national security and stability by permanently resolving the issue of illegal immigrants. \"All relevant institutions are working together to implement robust measures against illegal immigration,\" he added. The meeting, held at CDA Headquarters, brought together senior officials from Islamabad, Rawalpindi, Attock, Murree, and Haripur, along with representatives from the Ministry of Interior, National Database and Registration Authority (NADRA), Federal Investigation Agency (FIA), Counter-Terrorism Department (CTD), and other law enforcement bodies.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}