{
  "title": "President advises youth to play productive role in exponential growth of country",
  "link": "https://www.app.com.pk/national/president-advises-youth-to-play-productive-role-in-exponential-growth-of-country/",
  "date_published": "2023-11-02T09:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP):President Dr Arif Alvi on Thursday called upon the youth and fresh graduates who were about to enter their professional lives, to play their productive role in the country’s exponential growth.\nHe said the country at this stage, badly needed the exponential growth rather than linear growth as it was already far behind the region in many sectors including education.\nAddressing the 26th Convocation ceremony of the COMSATS University here, the president believed that if the students in their professional lives, ensure justice in the society, contribute productively in the country’s development, and learn to share their resources with the poor, the country would see new heights of prosperity and development.\nToday, he said Artificial Intelligence or Computer Science was the second leg of every profession.\n“The world is running very fast so we must have to run with same pace as the world do.” Otherwise, he said the country would lag further behind the region and the world.\nThe president said the world was growing exponentially, however Pakistan’s growth pace was relatively slower in the region.\nHe said 9% of total intermediate students manage to get admissions in the higher education while in the region, the ratio was over 25%.\nThe universities should increase enrollments of the students to achieve exponential growth in the country, he added.\nHe maintained lack of timely decision was one of the major reason behind slow growth.\nWe lacked vision for example, he said, adding we could not foresee the electricity requirement before time and when the time came, we took emergency decision to install power plants that cost much higher.\nThe said the neighboring country India announced the data policy in 2012 while Pakistan announced it after a decade in 2022 and that too due to his personal efforts.\nDuring the ceremony, the president gave away medals to the top position holders and conferred degrees to the successful students in various departments of the university.\nPresident Alvi said the Holy Prophet Muhammad (SA) always taught for seeking knowledge, good training and love for humankind.\nCongratulating the successful candidates on getting degrees, he said they had now become elites of the country as around 28 million or 40% children were still out of schools in the country.\nHe said some 55000 school buildings were required to accommodate all the out of school children in the country which was extremely difficult.\nTherefore, he said some out of the box solutions were required on emergency basis as these uneducated children at later stage would become a huge burden on the country’s economy which would not be able to contribute anything productive for the country.\nIn this context, the president advised the girl students to fully utilize their degrees and work diligently for the development of the country.\nHe said usually, as soon as the girls get married, they quit their professional life due to multiple reasons including fear of harassment at workplace.\nHe said this was the state’s responsibility to stop harassment of women.\nFurthermore, he also asked the education as well as other departments to give the women more leverage if they have a gap during service or education. “They should be welcomed when they re-join duties,” he added.\nThe president said the most beautiful culture of this country was the joint family system that symbolized love in the society.\nThe only thing that the overseas Pakistanis miss during their stay abroad was the love and family culture of their homeland, he added.",
  "retrievedAt": "2025-08-11T10:20:50.173Z"
}
