{
  "title": "BISP, World Bank affirm ongoing partnership for relief in marginalized sectors",
  "link": "https://www.app.com.pk/national/bisp-world-bank-affirm-ongoing-partnership-for-relief-in-marginalized-sectors/",
  "date_published": "2023-11-02T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP): Benazir Income Support Programme (BISP)) and World Bank (WB) have reiterated their commitment to continue working together to strengthen the marginalized segments of society and ensure relief to the poorest of the poor.\nThis was expressed in a meeting between Chairperson BISP and a high-level delegation of the World Bank, held here, said a news release on Thursday.\nWorld Bank delegation was led by Ms. Kicole Klingen, South Asia Regional Director (Human Development), accompanied by Ms. Hnin Hnin Payne, Program Leader (Human Development), Amjad Zafar Khan, Senior Social Protection Specialist, Gul Najam Jamy, Senior Consultant, Sohail Saeed Abbasi, and Amna Khan, while Chairperson BISP, Dr Muhammad Amjad Saqib was accompanied by DG NSER Naveed Akbar and Director IC&C Rashid Imtiaz.\nOn the occasion, Dr Saqib provided the World Bank delegation with a comprehensive overview of BISP’s initiatives including Kafaalat, Taleemi Wazaif, Nashonuma, National Socio-Economic Registry (NSER) and shared insights into the achievements of the programme over the past 15 years.\nDiscussing the challenges faced by BISP, Dr Saqib outlined his vision for new initiatives to be adopted by the program.\nHe emphasized the importance of ensuring transparency and reassuring needy women that no amount would be deducted from their stipend.\nDr Saqib also proposed the utilization of the services of more banks to enhance ease during payment disbursement and suggested an increase in the stipend amount.\nFurthermore, Dr Saqib discussed the induction of new poverty graduation programs focusing on self-reliance of these families, technical education for children, programs for orphans and widows, and the creation of endowment funds for needy families.\nHe highlighted BISP’s commitment to building a positive image of support, emphasizing that it is not a charity but a program rooted in solidarity and an expression of love for those in need.\nDr Saqib suggested using religious places like mosques, churches, and temples as community centers to further the welfare of the needy.\nIn the meeting, Kicole Klingen commended the concept of BISP and described it as a great initiative aimed at providing support to marginalized segments of society, particularly women and children.\nShe also praised BISP for its impressive 10-day response time during crises such as the floods and Covid-19. Kicole Klingen recognized BISP as one of the exemplary models in the field of social protection, urging others to learn from BISP’s valuable experiences.\nKicole Klingen expressed the World Bank’s commitment to providing continued support to BISP in the future.\nLater on, the World Bank delegation also visited the One Window Facilitation Center in G-7 Islamabad and appreciated the registration process and payment mechanism of BISP for the needy women benefiting from the programme.",
  "retrievedAt": "2025-08-11T10:20:40.816Z"
}
