{
  "title": "Senate extends National Accountability (Amendment) Ordinance 2023 for 120 days",
  "link": "https://www.app.com.pk/national/senate-extends-national-accountability-amendment-ordinance-2023-for-120-days/",
  "date_published": "2023-11-02T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP): The Senate on Thursday extended the National Accountability (Amendment) Ordinance 2023 for a further period of 120 days.\nCaretaker Minister for Law Ahmad Irfan Aslam moved the resolution, which was adopted by the House. The extension will take effect from October 31, 2023.\nThe resolution says,“ That the Senate resolves to extend the National Accountability (Amendment) Ordinance, 2023 (I of 2023), for further period of one hundred and twenty days with effect from 31st October, 2023 under proviso to sub-paragraph (ii) of paragraph (a) of clause (2) of Article 89 of the Constitution of the Islamic Republic of Pakistan.”\nEarlier, the minister laid in the Senate the National Accountability (Amendment) Ordinance, 2023 (Ordinance No. I of 2023), as required by clause (2) of Article 89 of the Constitution.\nThe amended law allows custody of the arrested suspects to the National Accountability Bureau (NAB) for up to 30 days instead of 14 days. It also\nempowers the NAB chairman to issue a warrant of arrest during the course of inquiry if an accused is not joining inquiry despite notices or willfully does not cooperate in such inquiry.\nSpeaking in the House, Senator Ali Zafar while questioning the legality of the NAB law said that three-member bench of the Supreme Court had already rejected the NAB law.\nSenator Azam Nazeer Tarar said that the law was not person specific. He said the SC had not rejected the NAB law in toto and maintained its 70 per cent sections. The ordinance would help reorganize NAB, he observed.\nKamran Murtaza viewed that it would not be appropriate to extend the ordinance in the presence of SC judgment.\nSadia Abbasi termed the NAB black law which was imposed by a dictator. She regretted that even successive democratic governments could not set aside the black law.\nTahir Bizinjo said that the NAB law was misused to target political opponents in last over five years.\nIrfan Saddique, Mushahid Hussain Sayed and Manzoor Kakar also voiced their concerns regarding the role played by NAB in the country’s politics.\nThe senators also questioned the transparency, efficiency, and overall effectiveness of NAB’s investigations and prosecutions.",
  "retrievedAt": "2025-08-11T10:20:41.174Z"
}
