{
  "title": "Islamabad police arrest two suspects involved in murder case",
  "link": "https://www.app.com.pk/national/islamabad-police-arrest-two-suspects-involved-in-murder-case/",
  "date_published": "2023-11-02T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP):Islamabad Capital Police Sumbal police station, in conjunction with the Homicide unit police teams, successfully apprehended two individuals linked to a heinous murder case, police said.\nThe incident unfolded on October 31 when the Sumbal police station received an application from a distressed citizen, reporting a tragic incident.\nAccording to the applicant, the accused, identified as Deen Muhammad (husband) and Noor Hassan (father-in-law), allegedly set fire to his daughter, Nazia Bibi, leading to her untimely demise upon arrival at the hospital.\nIn response to the grievous crime, the Sumbal police team promptly registered FIR no. 412/23 and established a specialized investigation team.\nLeveraging all available resources and employing technical and scientific methodologies, the police teams successfully arrested the two accused, Deen Muhammad and Noor Hassan. The investigation into the matter remains ongoing.\nIn light of this incident, ICCPO Dr Akbar Nasir Khan has issued directives to all senior officials to intensify efforts in cracking down on criminal activities, prioritizing the safety of citizens and their property.\nThe Islamabad Capital Police maintains a zero-tolerance policy towards violence and injustice, with a commitment to ensuring that perpetrators of such crimes face the full extent of the law.\nCommending the diligent efforts of the police teams, he further urged all officers to continue their rigorous efforts in combating criminal elements.\nHe emphasized that the safety and security of citizens remain the foremost priority, underscoring a steadfast commitment to maintaining vigilance and taking decisive action against any form of criminality.",
  "retrievedAt": "2025-08-11T10:20:55.414Z"
}
