{
  "title": "WAPDA awards consultancy services contract for Naulong dam",
  "link": "https://www.app.com.pk/national/wapda-awards-consultancy-services-contract-for-naulong-dam/",
  "date_published": "2023-11-02T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP): Water and Power Development Authority (WAPDA) on Thursday signed an agreement amounting to Rs. 705 million for consultancy services of Naulong Dam project with a joint venture comprised of two firms – Dolsar of Turkey and Mott Mcdonald of Pakistan.\nGeneral Manager (Projects) South Muhammad Masood Ahmed Soomro and International Projects Coordinator of Dolsar Cem Aker signed the agreement on behalf of WAPDA and the joint venture respectively.\nThe consultancy contract relates to review and update the detailed design, prepare procurement documents, and update the safeguard documents of the project, said a statement issued.\nAs per the contract, these tasks will be completed in 28 months. The Asian Development Bank is providing financial assistance for consultancy services of Naulong Dam Project.\nThe ceremony was attended by Member (Water) WAPDA Javed Akhtar Latif, Chief Engineer and Project Director Naulong Dam Project Muhammad Yousaf Magsi, WAPDA officers and representatives of the consulting firms.\nNaulong Dam Project is proposed to be constructed on Mula River in Balochistan, about 30 Km from Gandava and 24 Km from Jhal Magsi. The Project will have a gross water storage capacity of 242,163 acre feet to irrigate 47000 acres of land. A small hydel power station, with installed generation capacity of 4.4 MW, will also be constructed under the project.\nNaulong Dam Project will play a significant role in development of the far flung and backward areas of Balochistan.\nMain objectives of the projects include development of irrigated agriculture, flood mitigation, provision of drinking water and low-cost hydel electricity to the locals, employment opportunities and poverty alleviation in the area.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:21:08.845Z"
}
