{
  "title": "Strengthening Track and Trace System tobacco product can save 30 to 40 billion for exchequer",
  "link": "https://www.app.com.pk/national/strengthening-track-and-trace-system-tobacco-product-can-save-30-to-40-billion-for-exchequer/",
  "date_published": "2023-11-02T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP):The health activists have urged the government and relevant authorities to strengthen the Track and Trace System for tobacco products.\nThis is a crucial step in not only curbing illicit trade but also in ensuring the protection of the children from the harms of tobacco products and recovering the much-needed tax revenue to invest in essential public services.\nMalik Imran Ahmed, Country Head, Campaign for Tobacco Free Kids, highlighted the significance of reinforcing the Track and Trace System, underscoring that it served a dual purpose: combating illicit tobacco trade and safeguarding public health, particularly among children.\nHe drew attention to the substantial impact of the tobacco industry on Pakistan’s national revenue, shedding light on the industry’s underreporting and manipulation of production data, resulting in a staggering loss of 615 billion to the national treasury.\nImran explained that this loss severely affects the country’s ability to invest in crucial services such as healthcare, education, and infrastructure, which are fundamental for the well-being of our citizens, particularly children.\nDr. Khalil Ahmed, Program Manager, SPARC, pointed out that the tobacco industry’s claims regarding the prevalence of smuggled products in the market did not align with reality.\nIn truth, the percentage of smuggled items was significantly lower than claimed.\nMuch of what is labeled as illicit trade is, in reality, a consequence of the industry’s practice of saturating the market with its own products to circumvent taxation. This practice not only harms the country’s economy but also poses a direct threat to the well-being of children by making tobacco products more accessible.\nDr. Khalil stressed the necessity of expanding the Track and Trace System to encompass all tobacco companies, asserting that it is a fundamental step toward protecting children’s rights and well-being.",
  "retrievedAt": "2025-08-11T10:20:48.021Z"
}
