{
  "title": "Pakistani Diaspora’s role in progress of country,  an irrefutable reality: Raja Pervez",
  "link": "https://www.app.com.pk/national/pakistani-diasporas-role-in-progress-of-country-an-irrefutable-reality-raja-pervez/",
  "date_published": "2023-11-02T12:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP): Speaker National Assembly Raja Pervez Ashraf on Thursday said that Pakistani Diaspora around the world had always played pivotal and substantiated role for progress and development of country.\nHe expressed these views during meeting with the delegation of Pakistani Diaspora under leadership of Mayor of the London Borough of Hounslow Councilor Afzal Kiani, said a press release issued here.\nHe also said that ensuring participation of Pakistani Diaspora in development and progress of country had been principle stance of Pakistan People’s Party (PPP).\n“The proactive role played by Pakistani Diaspora in Pakistani development and progress of the country is an undeniable reality,” he added.\nWhile underscoring the significance of highlighting positive image of Pakistan across the world, he said, “Pakistani Diaspora must be committed to ensure highlighting positive image of country.”\nThe speaker also emphasized the need to encourage and enhance the positive and proactive role offered by Pakistani Diaspora for their inclusion in progress of every socioeconomic segment of country.\nFurther, Raja Pervez said that Pakistan people had always proven their talent and potential in diverse fields.\nHe stressed to resolve challenges faced by Pakistani Diaspora on priority.\n“Highlighting positive image of Pakistan is the prime responsibility of Pakistani media and media can play positive image of country as Pakistan is enriched in every aspect”, he added.\nAfzal Kiyani expressed its gratitude to Speaker National Assembly for his encouragement and support for Pakistani Diaspora.\nThe delegation participants also stressed on the need to have close liaison with Pakistani High commissioners abroad.\nThe delegation members emphasized the need to promote cultural diversity especially at abroad.",
  "retrievedAt": "2025-08-11T10:20:44.178Z"
}
