{
  "title": "Solangi for collective efforts to protect planet earth from negative impacts of climate change",
  "link": "https://www.app.com.pk/national/solangi-for-collective-efforts-to-protect-planet-earth-from-negative-impacts-of-climate-change/",
  "date_published": "2023-11-02T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP): Caretaker Federal Minister for Information and Broadcasting Murtaza Solangi  on Thursday called for collective revolutionary measures to avoid the damages caused climate change.\nDelivering his speech at the “Pre COP28: Paris to Dubai ” seminar here the minister said that the future of the coming generations must be secured.\nThe minister urged the international community to play its role in the countries being badly affected by climate change.\nThe planet, he added faced the dangers of climate change and the government, or any department alone could not solve this problem.\n“We need a strategic vision to tackle the challenge of climate change,” Murtaza Solangi maintained.\nThe whole society has to realize about climate change issue, Murtaza Solangi said adding:\n“We are facing many social problems to deal with climate change”.\nSolangi said without bringing about change in society, the dangers of climate change could not be addressed.\nParents, teachers, film, television drama writers, poets, elders in the society must discuss the harms of climate change and there was a need  to change the whole culture system.\nHe also said that media must play its role in highlighting climate change issue.\nFor combating climate change, every body will have to actively participate in plantation campaigns as climate change was a threat to the  human existence.\nHe said that  Pakistan was one of the most affected countries by climate change although it had very small  role in causing climate change.\nThe minister said that the present generation had a responsibility to take urgent steps to protect the planet from the negative impacts of climate change for the sake for future generations.\n“Do we want to be known in human history as the generation that was so selfish and self-centered that we want to deplete and destroy planet earth and leave nothing for our future generations”, he remarked. He said that protecting the planet for the negative effects of climate change was an existential question for humanity.\nStressing the need for media role in the creation of awareness among the masses over environmental issues, he said that Pakistan Television would establish a special desk for climate change with dedicated staff filing reports on environmental issues. He urged all media houses to come forward and play a proactive role in highlighting environmental issues on their screens and newspapers.\nHe said that the resolution of disputes between the countries of the world and peaceful coexistence was also vital as wars played havoc with the environment and pushed the entire region into chaos and destruction.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:21:11.376Z"
}
