{
  "title": "Rs432.2m fine imposed on 3,435 power pilferers",
  "link": "https://www.app.com.pk/national/rs432-2m-fine-imposed-on-3435-power-pilferers/",
  "date_published": "2023-11-02T11:05:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Nov 02 (APP):The Faisalabad Electric Supply Company (FESCO) caught 3,435 power pilferers during the last 55 days and imposed a fine of over Rs.432.2 million for stealing electricity in various areas of the company during the ongoing special anti-power theft drive.\nSpokesman Tahir Sheikh said here on Thursday that over 9.3 million detection units were charged. A sum of over Rs.250 million was also recovered from the defaulters.\nHe said that 3269 cases were registered against power theft in various police stations whereas the police also arrested 2777 pilferers so far.\nHe further said that the FESCO teams detected electricity theft at 1115 points in Faisalabad district and imposed a fine of Rs.138.8 million on them under the head of 2.989 million detection units.\nIn Jhang district, the FESCO teams caught 357 electricity thieves and imposed a fine of Rs.53.1 million under 1266,000 detection units.\nSimilarly, 364 cases of electricity theft were detected in Bhakkar district and the company handed down the power pilferers with a fine of Rs.47.2 million under 919,000 detection units.\nHe further said that 369 electricity thieves were caught from Chiniot district and they were imposed a fine of Rs.52.9 million under 1153,000 detection units.\nIn Khushab district, 118 consumers were found involved in electricity theft and they were handed down with a fine of Rs.18.4 million for 381,000 detection units.\nThe FESCO teams also caught 438 power pilferers from Mianwali and they were fined with Rs.44 million for 981,000 detection units.\nIn Sargodha district, 368 cases of electricity theft were detected. Hence, a fine of Rs.41.4 million was imposed on the electricity thieves under 881,000 detection units.\nThe FESCO teams also caught 271 electricity thieves from Toba Tek Singh district. Therefore, the company imposed a fine of Rs.33.1 million for 642,000 detection units, spokesman added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:20:48.776Z"
}
