{
  "title": "Peshawar Workshop Inspires Young Minds to Get Involved in the Electoral Process",
  "link": "https://www.app.com.pk/national/peshawar-workshop-inspires-young-minds-to-get-involved-in-the-electoral-process/",
  "date_published": "2023-11-02T08:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP):The Election Commission of Pakistan (ECP) organized a student awareness workshop at Shaheed Benazir Bhutto Women University in Peshawar, Khyber Pakhtunkhwa, with the aim of involving young people in the electoral process.\nAccording to an ECP spokesperson, another workshop with a similar objective was held at the University of Gujrat. The event featured Abdul Hafeez, who serves as the Joint Provincial Election Commissioner, representing the ECP. During this workshop, Abdul Hafeez motivated the youth to actively engage in the electoral process by exercising their right to vote.\nThese workshops were being held in collaboration with Pakistan Institute of Legislative Development and Transparency (PILDAT) and United Nations Development Programme Pakistan (UNDP).\nThe series of workshops, initiated in November 2021, has been ongoing with the aim of engaging the youth and boosting their participation in both local government elections and the upcoming general elections nationwide.\nThus far, the Media Coordination and Outreach Wing.(MCO) has hosted 34 media workshops in partnership with leading civil society organizations. These workshops have encompassed a diverse range of participants, including women, minorities, transgender individuals, people with disabilities, academia, the Women Commission KP, bloggers, volunteer students, and local print and electronic media reporters. The workshops were conducted with a focus on the LG elections in Khyber Pakhtunkhwa, Balochistan, and Sindh.\nApproximately 26,000 voter education brochures were sent to Balochistan, 100,000 to Sindh, and 30,000 to Khyber Pakhtunkhwa, intended for distribution among the general public in preparation for the LG elections.",
  "retrievedAt": "2025-08-11T10:20:52.091Z"
}
