{
  "article_id": "2025-01-01_4d6cf522c3fc614ff1f7431f4e52f851",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ict-admin-cracks-down-on-illegal-petrol-agencies-price-violations/",
    "retrieved_at": "2025-08-27T11:14:30.167Z"
  },
  "metadata": {
    "title": "ICT admin cracks down on illegal petrol agencies, price violations",
    "author": null,
    "date_published": "2025-01-01T09:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 175,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 1 (APP):The Islamabad Capital Territory (ICT) administration has intensified its crackdown on violators of official price lists and illegal petrol agencies operating in residential areas in the Federal Capital. According to the spokesman of ICT administration, a targeted operation was carried out by the Assistant Commissioner (Nilore) against the violators of official price lists and illegal petrol agencies in Ghori Town and Khanna areas late night. During the operation, five individuals were arrested for breaching the official price lists. One person was arrested for running an illegal petrol agency in a residential area. Additionally, two petrol dispensing machines from illegal agencies operating within the jurisdictions of Khanna and Karpa police stations were also seized, he added. This action is part of the administrationas broader efforts to regulate fuel distribution and enforce compliance with official pricing policies. Deputy Commissioner (DC) Islamabad Irfan Nawaz Memon urged the residents to report such agencies and avoid buying petrol from them. aCommunity cooperation is essential to eliminating such illegal activities and ensuring safety and compliance,a the DC emphasized.",
    "summary": "The Islamabad Capital Territory (ICT) administration conducted a crackdown on illegal petrol agencies and price violators in Islamabad. Several individuals were arrested, and petrol dispensing machines were seized during the operation. The Deputy Commissioner (DC) of Islamabad urged residents to report illegal activities.",
    "keywords": [
      "Islamabad",
      "petrol agencies",
      "price violations",
      "ICT administration",
      "illegal activities",
      "Deputy Commissioner"
    ]
  },
  "entities": [
    {
      "text": "Islamabad",
      "label": "LOCATION",
      "wikidata_id": "Q1166"
    },
    {
      "text": "ICT",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Ghori Town",
      "label": "LOCATION",
      "wikidata_id": "null"
    },
    {
      "text": "Khanna",
      "label": "LOCATION",
      "wikidata_id": "null"
    },
    {
      "text": "Karpa",
      "label": "LOCATION",
      "wikidata_id": "null"
    },
    {
      "text": "Deputy Commissioner (DC) Islamabad Irfan Nawaz Memon",
      "label": "PERSON",
      "wikidata_id": "null"
    }
  ]
}