{
  "article_id": "2025-01-01_68abf0f23f9f5c5b3211b950f0bfd337",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-expresses-satisfaction-over-inflation-rate-plummeting-to-81-month-low/",
    "retrieved_at": "2025-08-27T11:14:34.866Z"
  },
  "metadata": {
    "title": "PM expresses satisfaction over inflation rate plummeting to 81-month low",
    "author": null,
    "date_published": "2025-01-01T15:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 193,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 01 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday expressed satisfaction over inflation rate falling to 4.1% which is 81-month low. He said in a statement issued from the Prime Ministeras Office, macroeconomic stability was achieved but this was just the beginning. PM Shehbaz Sharif said it was a welcoming progress that inflation rate came to 4.1% in December 2024. He said the government had launched a project like Uraan PakistanaPakistanas Takeoff that would put Pakistan among the leading countries of the world. aGovernment is pursuing a policy of economic reforms. The current account has gained surplus after 24 years. Inflation has come down from 38% to 4.1%, stock market has become the second-best market in the world,a the PM added. PM Shehbaz Sharif added that the policy rate has come down from 22% to 13% and with the hard work of the governmentas economic and financial team, the economy was moving towards stability. aWe [the government] are aware of the peopleas difficulties, and therefore worked day and night to solve the problems of the masses. Insha Allah [God willing], the lives of the people will improve further,a the PM said.",
    "summary": "Prime Minister Muhammad Shehbaz Sharif expressed satisfaction with the inflation rate dropping to a 81-month low of 4.1% in December 2024. He highlighted the government's efforts in achieving macroeconomic stability and economic reforms, including projects like Uraan Pakistan. The Prime Minister noted improvements in the current account, stock market, and policy rates, and expressed optimism for further improvements in the lives of the people.",
    "keywords": [
      "inflation rate",
      "Muhammad Shehbaz Sharif",
      "macroeconomic stability",
      "economic reforms",
      "Uraan Pakistan",
      "policy rate",
      "stock market"
    ]
  },
  "entities": [
    {
      "text": "Muhammad Shehbaz Sharif",
      "label": "PERSON",
      "wikidata_id": "Q106880998"
    },
    {
      "text": "Prime Ministeras Office",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Pakistan",
      "label": "LOCATION",
      "wikidata_id": "Q1000"
    }
  ]
}