{
  "title": "Call to break away with patriarchal mindset  for gender parity",
  "link": "https://www.app.com.pk/national/call-to-break-away-with-patriarchal-mindset-for-gender-parity/",
  "date_published": "2023-12-05T15:10:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 05 (APP):Punjab Women Development Department (WDD) Secretary Sumaira Samad has said that there was need to break away with the patriarchal mindset and treat women equally in order to ensure balance in society.\nOutlining the initiatives during the 16 days of activism to combat gender-based violence (GBV) against women and girls at her office here on Tuesday, she said male-dominated social structures were the cause behind the rampant exploitation and violence against women in our society and it was collective responsibility to stand against discrimination on gender lines.\nShe said women were a victim of different forms of violence in almost all sectors of society whether it be workplace harassment, domestic violence, physical abuse, psychological abuse, forced marriage, rape,  gender-based discrimination or economic abuse, adding that the WDD closely monitors the status of women in all provincial departments and submits its recommendation to the government for rectification through legislation.\nThe senior bureaucrat, to a query, regretted the fact that social media platforms and some mainstream media outlets encouraged pseudo scholars who promoted vain gender-based views lacking fluidity, adding that there was need to promote gender parity for a balanced and prosperous society. ‘Women make up half of the world and a society can not move forward if they are persecuted and exploited,’ she remarked.\n‘Victim-blaming was one of the worst forms of exploitation against women in our society, adding that the onus of proof is on the perpetrator of violence and not the victim. She said Punjab Protection of Women Against Violence Act 2016 and other laws have been framed to protect women violence and exploitation.\nOn WDD’s efforts for creating awareness on the social blight of violence against women, Ms. Samad said the department had launched a comprehensive campaign to sensitise the masses on the issue while the main ceremony was held at the iconic Minar-e-Pakistan to celebrated the International Day for Elimination of Violence against Women in the provincial metropolis. She said seminars and awareness walks are also being held at colleges and universities to create awareness.\nSumaira Samad further said the colour orange represents the International Day for Elimination of Violence against Women as it symbolises a brighter future, free of violence, adding that Minar-e-Pakistan and historical Punjab Assembly buildings have been lit in orange for the 16 days of activism which provide a sharp reminder to the masses to invest in eliminating the nuisance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:52:00.193Z"
}
