{
  "title": "Minister for incorporating teachings of Khutba e Hajjatul Wida in educational institutions",
  "link": "https://www.app.com.pk/national/minister-for-incorporating-teachings-of-khutba-e-hajjatul-wida-in-educational-institutions/",
  "date_published": "2023-12-05T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 05 (APP): Federal Minister for National Heritage and Culture, Syed Jamal Shah has emphasized incorporating the teachings of Khutba e Hajjatul Wida of Prophet Muhammad (peace be upon him) in all educational institutions.\nHe was addressing the inaugural ceremony of an international conference on Sirah, civic sense and tolerance organized with a joint venture of Pak-Saudi Governments by the International Centre of Excellence for Sirah Studies, Islamic Research Institute, IRI of International Islamic University Islamabad (IIUI) at the Quaid-e-Azam Auditorium, Faisal Masjid Campus.\nAddressing the opening ceremony of the conference, Minister Syed Jamal Shah said that Prophet Muhammad (peace be upon him) served as the epitome of civic responsibility.\nHe was of the view that the teachings of Prophet Muhammad (PBUH) consistently highlighted the significance of treating others with kindness and consideration.\nSyed Jamal Shah added that one of the Prophet’s (PBUH) well-known sayings encapsulates this spirit.\n“The best among you are those who have the best manners and character.” He said this timeless wisdom underscores the importance of civic sense in the daily lives of Muslims.\nEarlier, the minister inaugurated the International Sirah Exhibition held in connection with the conference.\nSpeakers of national and international repute unveiled timeless wisdom for success in this world and the hereafter highlighting the Sirah of Prophet Muhammad (PBUH) in this 2-day international conference.\nDuring the conference, more than 100 research papers will be presented by researchers and scholars of international repute.\nThe conference will identify the historical roots of civilized social living, the causes of the lack of good manners in our society, and the reasons for cultural ignorance such as mistrust, misconceptions, conflicts, hatred and the lack of mutual understanding among various segments of Muslim societies, particularly Pakistani society.\nDr. Samina Malik, Rector, IIUI congratulated the efforts of both the Pak-Saudi governments for organizing this significant international conference in the present era as such conferences are vital for youth studying at educational institutions.\nShe said that Sirah is a great source of guidance to learn civic sense in human’s lives, she furthered that being teachers at educational institutions, we have a huge responsibility to guide our students.\nDr. Abdul Quddus Suhaib, Director, BZU, Multan also highlighted the Sirah of Prophet Muhammad (PBUH) during the inaugural ceremony and shared incidents with the audience on this occasion.\nOn this occasion, guest of honour, Dr. Azzedine Benzighiba, Director General, Juma Al-Majid, Centre for Culture and Heritage, Dubai, UAE also addressed the conference participants and highlighted various aspects of the life of Prophet Muhammad.\nDr. Muhammad Zia ul Haq, Director General, IRI, gave a comprehensive introduction to the conference and shared the significance of the conduct of Prophet Muhammad (PBUH) for Islamic theology, law, culture, Muslim society and overall Islamic tradition has never been contested.\nHe said Civic sense reflects the social ethics of a society. He opined that these characteristics of civic sense are always found in the Sirah of Prophet Muhammad (peace be upon him).\n“The conference is a humble effort to study the Prophet’s life and teachings relevant to present-day situations that can be drawn from various historical situations,” he said.\nThe conference shall conclude on December 6, at Quaid-e-Azam Auditorium, Faisal Masjid Campus of the university. Aneeq Ahmed, Minister for Religious Affairs and Interfaith Harmony would be the Chief Guest on the occasion.",
  "retrievedAt": "2025-08-11T10:51:43.273Z"
}
