{
  "title": "4% rise in crimes against women in India in 2022: NCRB",
  "link": "https://www.app.com.pk/national/4-rise-in-crimes-against-women-in-india-in-2022-ncrb/",
  "date_published": "2023-12-05T07:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 5 (APP):The latest comprehensive data released by the National Crime Records Bureau (NCRB) for 2022 has brought to light a surge in various crime categories across the country, particularly in crimes against women, children, Schedule Caste and Tribes (SC/ST), and cybercrimes.\nIn the realm of cybercrimes, the statistics are alarming, with a total of 65,893 cases reported in 2022, reflecting a significant 24.4 percent increase from the previous year’s 52,974 cases, KMS reported.\nFraud emerged as the primary motivator in 64.8 percent of these cases, amounting to 42,710 instances. Extortion followed at 5.5 percent (3,648 cases), and sexual exploitation constituted 5.2 percent (3,434 cases). This stark rise underscores the critical need for heightened cyber security measures and increased public awareness.\nSimultaneously, crimes against women witnessed an uptick in 2022, with a total of 4,45,256 cases registered, marking a 4.0 percent increase from the previous year’s 4,28,278 cases.\nNotably, the majority of these cases fell under ‘Cruelty by Husband or His Relatives’ (31.4pc), followed by ‘Kidnapping & Abduction of Women’ (19.2pc), ‘Assault on Women with Intent to Outrage her Modesty’ (18.7pc), and ‘Rape’ (7.1pc).\nThe crime rate per lakh women population increased from 64.5 in 2021 to 66.4 in 2022, emphasizing the urgency of addressing gender-based violence.\nKidnapping and abduction cases across the country saw a 5.8 percent increase in 2022, totaling 1,07,588 cases. Disturbingly, 76,069 victims were children, highlighting the vulnerability of the younger population. Out of the total victims, 1,17,083 were recovered, with 974 found dead. Crimes affecting the human body constituted 32.5 percent of total IPC crimes in 2022.\nFurthermore, crimes against children witnessed a disturbing rise, with 1,62,449 cases reported, marking an 8.7 percent increase from 2021. Kidnapping and abduction accounted for 45.7 percent of these cases, while the Protection of Children from Sexual Offences Act (POCSO), 2012, contributed 39.7 percent.",
  "retrievedAt": "2025-08-11T10:52:09.771Z"
}
