{
  "title": "SMOKERS’ CORNER: WESTERN BLIND SPOTS - Newspaper - DAWN.COM",
  "author": null,
  "content": "In early 2024, an American academic sent me a collection of studies and essays on the global decline/ backsliding/ degradation of democracy. After spending months going through them, I noticed that most Western political scholars were continuing to somewhat undermine the dilemma that democracy was facing in their own countries.\n\nIndeed, in the last decade or so, much has been said and written in the so-called ‘Global North’ about the creeping rise of far-right politics in the US and in Europe. Yet, the gaze of most Western political scholars is still largely fixed on countries in Asia, Africa and Central/ South America. It is only now that some Western political scientists are realising that, when most of them were focused on studying ‘fragile democracies’ elsewhere, democracy in their own countries was mutating in a most corrosive manner.\n\nIt wasn’t until Donald Trump’s election as president in 2016, the success of the ‘leave vote’ during the same year’s ‘Brexit’ referendum in the UK, and the manifold increase in the electoral popularity of far-right groups in Europe, that those preoccupied with the problematic nature of democracy in countries outside Europe and North America, suddenly realised that not all was well with their own democracies, which — especially after the Second World War — had been touted as the ‘best’ that the world had ever seen.\n\nTrump’s dramatic rebound victory in November 2024’s presidential election, and the continuing upsurge in the popularity of far-right groups in multiple European countries, just might alter the rather apologetic manner in which the contemporary state of democracy in the ‘Global North’ is being studied. I use the word ‘apologetic’ because more effort is being put on explaining the rise of far-right politics in the West as a temporary problem which democracy itself will resolve through a self-correcting mechanism.\n\nAs the far-right gains momentum across the West, Western academics long fixated on ‘fragile democracies’ in the Global South are now grappling with the cracks emerging within their own democracies\n\nBut I believe that Western academics in this regard have been in denial. They couldn’t see the electoral rise of the far-right in the Global North until it began breaching mainstream politics from the early/ mid-2010s onwards.\n\nThis strand of politics did not drop in from some alien realm. It emerged from within Western societies. It then organised itself around loud, charismatic figures, and eventually saw its followers enter parliaments and, in some cases, come to power.\n\nAccording to the Turkish journalist and author Ece Temelkuran, intellectuals and politicians who were convinced that far-right sentiments (in the West) had been exorcised after the defeat of fascist regimes in the Second World War, were being over-optimistic.\n\nIn her 2019 book How To Lose A Country, Temelkuran wrote that fascism never went away. It was just sidelined and then buried underneath the weight of a narrative that explained the victory of the ‘anti-fascist’ forces in the war as the victory of democracy over fascism. Temelkuran wrote that, after the war, the word ‘fascism’ was expunged from political discourse because, apparently, it had been eliminated in the West.\n\nThe original title of Temelkuran’s book was How To Lose A Country: 7 Steps— From Democracy To Fascism. But her publishers in Europe requested her to replace the word ‘fascism’ with ‘dictatorship’ in the title. According to Temelkuran, Western academics refused to even contemplate the possibility that fascism may still be quite alive in their societies and that the electoral rise of the far-right there cannot simply be seen as a case of ‘populism’ or a temporary bump.\n\nTemelkuran sees this bump as a warning. She fears that Western societies may once again be slipping into fascism. A fascism with enough clout and energy to come to power again, as it did in Germany, Italy, Portugal and Spain in the 1920s and 1930s.\n\nNevertheless, with the far-right refusing to recede and, in fact, gaining even more electoral momentum, some Western academics are now willing to at least explore the notion that Western democracy is in serious trouble. Even though the far-right is entering mainstream politics through legitimate electoral means, it is attacking the very foundations on which Western democracy is built.\n\nNo wonder then, in 2024, when Temelkuran set out to publish an updated version of her book, she was able to use the word ‘fascism’ in the title. This time no one requested her to replace it. In an interview, she summed up the reaction of those who are now more open to explore what she was suggesting: “How can it happen here? It’s supposed to be happening in crazy countries.”\n\nThe ‘crazy countries’ are the ones that are situated outside Europe and North America. Countries that are studied to understand authoritarianism. Yet, there is no denying the fact that, now more than ever, those studying these ‘crazy’ places have started to worry about the possibility of the same happening in their own countries.\n\nAfter the Second World War, democracy was romanticised and peddled as an ideal political system compared to authoritarianism, especially left-wing authoritarianism. However, when communism collapsed in 1991, democracy’s warts and all became a lot more visible. What the world has been witnessing, for well over a decade now, is the withering away of the idealistic perception of democracy. It is democracy’s less pleasant sides that have become more prominent.\n\nAccording to the Dutch political scientist Cas Mudde, authoritarian or illiberal forces that come to power through a democratic process are the result of a contradiction in democracy. Indeed, liberal democracy celebrates the protection of various rights, but it also encourages the rule of the majority. The problem arises when this majority consents to undo the rights that democracy provides.  This is when democracy starts to devour its own tail.\n\nPakistan is one of the many ‘crazy countries’ that Western academics study. Yet, it is also a country where the ‘democracy-loving’ intellectuals, journalists and activists still view democracy in the overtly idealistic and romanticised manner that it began to be painted by the West after 1945.\n\nBut that painting is now smudged. In the Global North, as well as in the Global South, times are now demanding a less idealistic analysis of democracy. Democracy needs to be regulated in ways that may raise eyebrows among the purists and the idealists, but this has to be done if democracy is to be protected — protected from its own idealised image, its contradictions and, of course, from authoritarian forces who are trying to use these contradictions to come to power and actually dismantle democratic institutions.\n\nIt is naive to continue idealising democracy without critiquing it from some awkward angles.\n\nPublished in Dawn, EOS, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679543d53dfe3.jpg",
  "retrievedAt": "2025-08-26T07:57:23.192Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887627",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:55:57.000Z"
}
