{
  "title": "Over Rs32 billion being spent on 134 uplift projects in Attock - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: Over Rs32 billion is being spent on around 134 development projects during the current fiscal year in the Attock district.\n\nThese figures were disclosed during a meeting presided over by Rawalpindi Commissioner Aamir Khattak at the Attock deputy commissioner’s office on Saturday.\n\nDepartments concerned told the top official that a sum of Rs17.35 billion was being spent on 28 highway schemes, Rs4.2 billion on 21 building schemes, Rs1.31 billion on 15public health schemes, Rs1.47 billion on 58 schemes of local government and Rs1.52 billion on two schemes of small dams.\n\nAdditionally, Rs574.905 million was being spent on five schemes of sports facilities, Rs5.32 billion on irrigation development, Rs48.200 million on a project related to mines and minerals development, Rs251.242 million on a forest scheme and Rs200 million was being spent on twelve school education initiatives.\n\nCommissioner Khattak reviewed the execution of the development projects and urged that they be completed within the stipulated timeframe.\n\nThe commissioner instructed the departments concerned to share progress details of all ongoing schemes so that their timely completion could be ensured.\n\nBriefing the participants, Attcock Deputy Commissioner Rao Atif Raza said ongoing development projects would be completed according to the stipulated timeline and the quality of the projects would also be ensured so that the project proved to be sustainable.\n\nHe vowed that necessary steps would be taken to remove hurdles in the way of development.\n\n“Timely completion of these projects would ensure the provision of high-quality services at residents’ doorsteps”, he said.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67954af4774d8.jpg",
  "retrievedAt": "2025-10-12T01:01:22.291Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887663/over-rs32-billion-being-spent-on-134-uplift-projects-in-attock",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:55:01.000Z"
}
