{
  "title": "KP asks Centre to withdraw committee on ex-Fata uplift programme - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa government on Saturday urged the federal government to withdraw a committee formed to manage the Accelerated Implementation Programme (AIP) for merged tribal districts, declaring the move “ill-conceived political adventurism.”\n\nOn Jan 16, the planning ministry notified the establishment of a nine-member steering committee to “channel 80 per cent of AIP funds, identify development needs and recommend development schemes to be executed by the federal agencies.”\n\nRest of the funds will be channelled for inclusive development through the Sustainable Development Goals in the less developed areas, according to the committee’s terms of reference.\n\nThe notification said the steering committee was headed by the deputy chairman of the Planning Commission as chairman and comprised the provincial governor as well as four MNAs and two MPAs from tribal districts.\n\nDeclares move ‘ill-conceived political adventurism’\n\nOn Saturday, KP Chief Minister Ali Amin Khan Gandapur wrote a letter to Prime Minister Shehbaz Sharif, insisting that the planning ministry’s notification would not only jeopardise the development of merged areas but would create a sense of lack of ownership, which would “create a law and order situation and help the cause of actors engaged in the reversing of KP-Fata merger.”\n\nHe said that the Supreme Court had declared in the Raja Pervaiz Ashraf case that government funds could only be allocated and spent in accordance with the mechanism provided in the Constitution.\n\n“No public functionaries including the ministers [DCPC in this case], the governor, and MNA/MPA have any say or role in allocating or spending public money,” the chief minister’s letter read.\n\nIt added that the disputed arrangement of introducing the so-called steering committee clearly fell foul of the spirit of the Constitution and seems to be ill-conceived political adventurism.\n\n“The notification should be withdrawn immediately in the greater interest of the merged districts development and the federation,” it said, adding that the provincial government also reserved its right to approach the superior judiciary in this regard.\n\nIn the letter, the chief minister noted that a steering committee at the federal level to identify development needs for part of the province was like reversing its special status and compromising the spirit of the 25th Constitutional Amendment.\n\nHe added that it would only negate the Fata-KP merger but also hampered and compromised the development portfolio of Rs349.5 billion, which was in its sixth years of implementation.\n\nMr Gandapur said for high-impact mega projects, a special forum, headed by the corps commander of XI Corps as the chairman and engineer in chief of the Pakistan Army, director general of the Frontier Works Organisation, general officer commanding of the 45 Engineering Division, GOC resident formations, secretaries of the planning, finance and rehabilitation departments, and chief engineer communication and works department as members, had also been constituted whereby the identification and approval of mega projects was carried, while they’re executed by 45th Engineering Division.\n\nHe added that the said notification not only compromised the role of the provincial development working party to the extent of merged areas but would also completely abolish the role of special forum in the development of merged tribal districts.\n\nThe chief minister also pointed out that progress on the special forum approved projects, costing Rs42 billion, in various phases of implementation, would be affected, leading to more unrest in the already precarious security situation in the merged tribal districts.\n\nHe noted that the erstwhile Fata was into sixth years of its merger with KP, the ongoing portfolio of AIP-funded 277 projects stood at Rs349.5 billion, with those projects being at different stages of execution by the respective provincial agencies.\n\n“Bringing federal executing agencies at this stage does not seem rational and effective. Moreover, the federal executing agencies cannot reach out to the whole of merged districts, looking into human resources, they have a place in merged districts,” he said.\n\nRegarding allocation of 20pc of AIP for SDGs, the chief minister argued that the federal government had launched the SDG Achievement Programme wherein funds were released to provinces on the advice of the respective MNAs.\n\n“These funds are over and above the funds on the provincial side as well as other PSDP programmes and therefore, allocation of AIP’s 20 percent funds to SDGs achievement programme is another unfair treatment with the merged areas, which is unacceptable,” it said.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:00:53.157Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887683/kp-asks-centre-to-withdraw-committee-on-ex-fata-uplift-programme",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:55:09.000Z"
}
