{
  "title": "Pakistani immigrants return after months-long ordeal - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: The repatriation of Pakistani immigrants taken by human traffickers to Morocco and Mauritania for onward journey to Europe has started after they remained stuck in the West African countries for months, the Foreign Office has said.\n\nFour migrants, who were stuck in Mauritania for months, arrived at Sialkot International Airport, while the return of 22 Pakistanis, who survived the tragedy near Morocco earlier this month, would begin on Monday.\n\nOver 40 Pakistanis were reportedly murdered by African human traffickers on a boat in the Atlantic Ocean while attempting to enter Europe earlier this month.\n\nThe Foreign Office said on Saturday it was coordinating with Moroccan authorities to bring back the survivors in batches.\n\nFO says repatriation of Morocco boat tragedy survivors to begin tomorrow; four return from Mauritania\n\n“The Pakistan Embassy in Rabat has been working closely with Moroccan authorities to oversee the relief efforts and finalise the complex repatriation procedure.”\n\nMost of the repatriated Pak­is­tanis were expected to arrive in Lahore, but details of flight schedules were yet to be issued.\n\nThe FO statement added that the ministry was also “fac­i­l­itating” the return of 11 Pak­istani nationals from Mauri­tania. “These individuals have voluntarily chosen to return home and will be part of a separate repatriation process.”\n\nThe four men who arrived at Sialkot airport had voluntarily returned from Mauritania.\n\nThe repatriation of the bodies of the deceased was expected in the coming week.\n\nThe Moroccan authorities were yet to retrieve the fingerprints of three to five bodies for identification.\n\nExtortion\n\nThe four Pakistanis, who arr­ived at the Sialkot Inter­na­ti­o­nal Airport, had paid hefty sums of money to human traffickers for travel to Europe by air.\n\nHowever, they were taken to Mauritania, where they rema­i­ned stuck for months, awaiting their turn to travel to Spain.\n\nTwo of them, who returned via flydubai flight FZ337, were identified as Muhammad Aftab, son of Muhammad Nawaz, and Mohsin Ali, a senior FIA official told Dawn, adding that both were residents of Sialkot.\n\nDuring the scrutiny of documents, it was found that they had departed from Lahore to Senegal, where Pakistanis are granted visas on arrival.\n\nTheir families had paid human traffickers Zamar Ash­faq and Sajid Shah Rs4.7million each to take them to Spain by air, the FIA official said.\n\nHowever, the agents sent them to Senegal and then illegally to Mauritania. During their illegal stay in Mauritania, the agents extorted another Rs2.7m from their families.\n\nAnother passenger, Muhammad Imran of Sialkot, returned from Senegal via Emirates flight EK620.\n\nHis family paid a human trafficker, identified as Ali Sabir, Rs3.5m for the journey to Spain by air. He departed from Sialkot for Ethiopia, from where he was taken to Senegal by human traffickers.\n\nThese men were sent to FIA’s anti-human trafficking cell in Gujranwala after their arrival.\n\nCrackdown on traffickers\n\nThe FIA has claimed to have arrested more traffickers, allegedly involved in the boat accidents near Morocco and Greece.\n\nThe agency’s Gujranwala office has arrested four suspects during crackdowns across Gujranwala and Muzaffargarh.\n\nOne of the suspects, Adeel Ahmed of Muzaffargarh, ext­o­rted Rs1m from the family of a deceased emigrant, Rehan Aslam, son of Muhammad Aslam. The victim, hailing from Jaura Karnana tehsil of Kharian district in Gujrat, was lured with a prospective job in Spain.\n\nHowever, he was sent to Africa. He was killed in the boat tragedy earlier this month.\n\nThe other alleged traffickers arrested during the raids are Ashiq Hussain of Mandi Bahauddin, Zahid Iqbal of Kharian and Rashid Mehmood of Sara-i-Alamgir.\n\nThey were wanted by the FIA for their alleged involvement in different cases of human trafficking.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:57:59.035Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887691/pakistani-immigrants-return-after-months-long-ordeal",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:54:13.000Z"
}
