{
  "title": "North Korea fires strategic cruise missiles, vows tough stance on US - World - DAWN.COM",
  "author": null,
  "content": "North Korea conducted a strategic cruise missile test on Saturday, state media KCNA reported on Sunday.\n\nAccording to the report, the country’s leader Kim Jong Un oversaw the test, which described it as a test-fire of an “important weapon system”.\n\nThe underwater-to-surface strategic cruise missiles travelled 1,500 kilometres and flew between 7,507 and 7,511 seconds before hitting their targets, KCNA reported.\n\nIn a separate KCNA report on Sunday, North Korea’s foreign ministry vowed the “toughest counteraction” against the United States as long as Washington “refuses” Pyongyang’s sovereignty.\n\nThe military alliance and joint drills between South Korea and the US were to blame for the growing tensions in the region, the ministry said in a statement carried by KCNA.\n\nThe statement came as US President Donald Trump said during an interview on Thursday that he would reach out to Kim again after the two developed a working relationship in Trump’s first term.\n\nNorth Korea’s war deterrence means were being “perfected more thoroughly”, Kim was quoted as saying, while the leader also vowed to continue efforts to strengthen the military.\n\n“Kim Jong Un affirmed that the DPRK (the Democratic People’s Republic of Korea) will always make strenuous efforts … to perform its important mission and duty for defending sustainable and lasting peace and stability on the basis of more powerfully developed military muscle in the future,” the statement read.\n\nIn a statement later in the day, South Korea’s Joint Chiefs of Staff said North Korea fired multiple cruise missiles from inland areas towards waters off the west coast at around 4pm on Saturday.\n\nThe report said the missile test was part of plans to build national defence capabilities against potential enemies in line with changing regional safety circumstances.\n\nEarlier this month, North Korean state media also reported that Kim oversaw a successful test of a new intermediate-range hypersonic ballistic missile.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/261730040dba3a0.jpg",
  "retrievedAt": "2025-08-26T07:57:21.778Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887832/north-korea-fires-strategic-cruise-missiles-vows-tough-stance-on-us",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T12:35:57.000Z"
}
