{
  "title": "CIA says Covid ‘more likely’ to have leaked from lab - World - DAWN.COM",
  "author": null,
  "content": "The Central Intelligence Agency (CIA) has shifted its official stance on the origin of Covid-19, saying on Saturday that the virus was “more likely” leaked from a Chinese lab than transmitted by animals.\n\nThe new assessment came after John Ratcliffe was confirmed on Thursday as the CIA director under the second White House administration of Donald Trump.\n\nRatcliffe, who served as the director of national intelligence from 2020-2021 during Trump’s first term, said in an interview published on Friday that a “day-one” priority would be making an assessment on Covid’s origins.\n\n“The agency is going to get off the sidelines,” Ratcliffe — who believes Covid-19 leaked from the Wuhan Institute of Virology — told right-wing outlet Breitbart.\n\n“CIA assesses with low confidence that a research-related origin of the Covid-19 pandemic is more likely than a natural origin based on the available body of reporting,” a CIA spokesperson said in a statement on Saturday.\n\nThe agency had not previously made any determination on whether Covid had been unleashed by a laboratory mishap or spilled over from animals.\n\n“CIA continues to assess that both research-related and natural origin scenarios of the Covid-19 pandemic remain plausible,” the spokesperson noted.\n\nA US official told AFP the shift was based on a new analysis of existing intelligence ordered by previous CIA director William Burns, which was completed before Ratcliffe’s arrival this week.\n\nSome US agencies, like the Federal Bureau of Investigation and the Department of Energy, support the lab-leak theory, albeit with varying levels of confidence, while most elements of the intelligence community lean toward natural origins.\n\nProponents of the lab-leak hypothesis highlight that the earliest known Covid-19 cases emerged in Wuhan, China — a major coronavirus research hub — roughly 1,600 kilometers from the nearest bat populations carrying similar Sars-like viruses.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/26141854e94ab05.jpg",
  "retrievedAt": "2025-08-26T07:57:21.263Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887818/cia-says-covid-more-likely-to-have-leaked-from-lab",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T09:21:01.000Z"
}
