{
  "title": "Trump border czar defends school, church raids - World - DAWN.COM",
  "author": null,
  "content": "Donald Trump’s border czar on Sunday defended raiding churches and schools as part of a crackdown on illegal immigration while acknowledging that deporting all undocumented people in the United States was not “realistic.”\n\nTrump began his second term on Monday with a flurry of executive actions aimed at overhauling US immigration. His administration quickly moved to ramp up deportations, including by relaxing rules governing enforcement actions at “sensitive” locations such as schools, churches and workplaces.\n\nAsked about the rule change, Tom Homan, a former head of US Immigration and Customs Enforcement (ICE) tapped to oversee Trump’s hard-line immigration agenda, said on Sunday that it sends a clear message.\n\n“There’s consequences of entering the country illegally. If we don’t show there’s consequences, you’re never going to fix the border problem,” he told ABC News’ ‘This Week’ programme.\n\nSuch actions would nonetheless be made on a “case by case” basis, he said, noting that “many” members of gangs such as MS-13 are teenagers. If there’s a “national security threat or a public safety threat that’s in one of these facilities, then it should be an option,” he said.\n\nOn Thursday, leaders of three Catholic organisations blasted the rule change, saying in a joint statement that “turning places of care, healing and solace into places of fear and uncertainty for those in need… will not make our communities safer.”\n\nWhen pressed on the Catholic opposition, Homan stood firm. “We’re enforcing laws Congress enacted and the president signed. If they don’t like it, change the law.”\n\nVice President JD Vance, who was also asked about the Catholic pushback in an interview broadcast on Sunday, accused one group of being worried about losing funds in the immigration crackdown.\n\n“I think that the US Conference of Catholic Bishops needs to actually look in the mirror a little bit and recognise that when they receive over $100 million to help resettle illegal immigrants, are they worried about humanitarian concerns? Or are they actually worried about their bottom line?” he told CBS’ ‘Face the Nation’ programme.\n\nAll eyes during Trump’s first week in office have been on immigration enforcement and deportations, though it was unclear to what extent actions have increased from predecessor Joe Biden.\n\nICE said in posts on X that it had made 593 arrests on Friday and 286 arrests on Saturday.\n\nIn the 2024 federal fiscal year, agency data shows ICE made 113,431 arrests, or around 310 per day.\n\nHoman called on Congress to pass additional funding for dealing with those arrested.\n\n“We’re gonna need more ICE beds, a minimum of 100,000. Congress needs to come to the table quick and give us the money we need to secure that border,” he told ABC News. “We’re going to try to be efficient. But with more money we have, the more we can accomplish. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2622582112aa02c.jpg",
  "retrievedAt": "2025-08-26T07:57:17.025Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887857/trump-border-czar-defends-school-church-raids",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T17:59:42.000Z"
}
