{
  "title": "BYC vows to ‘safeguard rights and resources’ of Baloch people - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The “struggle for safeguarding the rights” of the Baloch will continue despite enforced disappearances, leaders of the BYC said in their spee­ches at a public meeting in Dalbandin on Saturday.\n\n“We will no longer tolerate the plunder of Balochistan’s resources,” one of the spe­­akers said at the event, which was org­anised by the Baloch Yekjehti Committee to mark what it called the ‘Baloch genocide day’.\n\nThe speakers said Jan 25 was ‘a grievous day’ for the Baloch as it recalls the alleged discovery of graves containing as many as 12 bodies in Khuzdar’s Totak area in 2014. The identities of those buried in these graves remain unknown to this day, they added.\n\nDr Mahrang Baloch, the BYC’s central organiser, was the main speaker at the public meeting.\n\nSpeakers at a public meeting allege Balochistan’s resources are being plundered with impunity\n\nOthers who spoke on the occasion included Sam­­mi Deen Mohammad, Shahji Sibghatullah, Lala Wahab Baloch and Dr Sabiha Baloch.\n\nThe speakers alleged Balochistan’s resources were being exploited with impunity and whenever the Baloch spoke of their rights, they faced enforced disappearances and received “mutilated bodies” of their loved ones.\n\n“The BYC will become a voice of the oppressed across Balochistan and will make every effort to secure their rights,” Dr Mahrang said.\n\nShe said it was wrong to think that the BYC was struggling only for recovery of the missing. “It is a platform for the protection of each and every Baloch’s rights.”\n\nThe BYC leader said Baloch people “face humiliation at check-posts”, “death squads terrorise them at every turn” and they lack educational facilities.\n\nDr Mahrang said the Reko Diq project was handed over to Barrick Gold Com­p­a­­ny without taking the people of Chagai into confidence. “The locals are getting no­­thing from the Saindak project as well.”\n\nThe BYC leaders alleged that on one hand the gold from Chagai was used to build a metro in Lahore, but on the other, the people of Balochistan did not even have access to basic healthcare.\n\nThey called upon the Baloch to “wake up for defending their rights”, land and culture. “The Baloch will not remain silent anymore as we have become a strong nation,” one speaker said.\n\nA large number of people, including women and children, attended the public meeting. They flocked to Dalbandin from far-flung areas of the province.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6795943299694.gif",
  "retrievedAt": "2025-08-26T07:57:50.767Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887758/byc-vows-to-safeguard-rights-and-resources-of-baloch-people",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:54:27.000Z"
}
