{
  "title": "Biggest loss will be PML-N’s if PPP leaves coalition: Senator Saleem Mandviwalla - Pakistan - DAWN.COM",
  "author": null,
  "content": "Senator Saleem Mandviwalla, highlighting numerous reservations of the PPP, has warned that the ruling PML-N would face the “biggest loss” if his party breaks off its alliance with the government.\n\nThe differences between the PML-N-led coalition government and its key ally PPP have been simmering for a while. A meeting last month between Prime Minister Shehbaz Sharif and President Asif Ali Zardari to revive trust seemingly failed to put an end to these disagreements.\n\nDuring an interview with DawnNewsTV programme ‘Doosra Rukh’, aired on Saturday, Senator Mandviwalla claimed that Deputy Prime Minister Ishaq Dar has realised if the coalition breaks, PML-N will suffer the greatest loss.\n\nHighlighting Deputy PM Dar’s efforts to find solutions to the issues between the two coalition allies, the senator said Dar was the “only one making efforts to bring the parties to a table. No one else does this.”\n\nMandviwalla highlighted that the Prime Minister’s Office was not implementing directives issued by the President House.\n\nWhen asked if President Zardari was unhappy with the situation, he responded: “Of course, of course.\n\n“If a directive is sent by the president of Pakistan […] and it’s not implemented, then what will happen at lower levels?” he asked.\n\nThe PPP lawmaker’s statements come days after a meeting of PPP’s Central Executive Committee (CEC) was held, amid the party’s reservations that the government did not take it on board in decision-making and backed out of its promises made to the party.\n\nAt the meeting, the PPP had demanded that the federal government hold local government polls in Punjab and Islamabad as per the agreement between the PPP and the government.\n\nA resolution passed by the CEC voiced concern over the construction of controversial canals, demanded the immediate convening of the Council of Common Interests (CCI) me­­­­eting, which has been pen­ding for 11 months, and called for the controversial canal issue to be urgently raised in the CCI.\n\n“If you are not implementing the things you agreed to, the coalition will break one day,” Mandviwalla warned, adding that he could “sense” during the CEC meeting that the alliance would not work.\n\nHe recalled, “In the CEC meeting, people were very unhappy with the PML-N. Even the Punjab [representatives] were very unhappy with the Punjab government. The general recommendation from [leaders of] all provinces was that we should not remain their ally anymore.”\n\nThe PPP senator said it was a “great challenge” for the party leadership with its leaders calling for breaking off the alliance with the PML-N.\n\n“They have fulfilled none of the agreements that we had reached.”\n\nMandviwalla added that in his view, the PPP leadership would now convey it to the PML-N to “either find a solution or we part ways”.\n\nResponding to a question whether the PPP would continue negotiating with the PML-N on their differences, the lawmaker said, “We do not believe in stopping negotiations.”\n\nWhen asked about the reason for the deferment of four bills during a joint session of the parliament, Mandviwalla claimed that a consensus had not yet been reached between the PPP and PML-N on the proposed legislation.\n\n“When we tell them we will oppose [these bills], they defer it,” the PPP senator quipped.\n\n“If you’re creating this situation where we have to oppose your bills — the government’s — then what’s the use?\n\n“It was a principle issue. Negotiations were still ongoing […] so let those be finalised but you table [the bills] on your own.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2614052485b16e1.png",
  "retrievedAt": "2025-08-26T07:57:23.432Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887816/biggest-loss-will-be-pml-ns-if-ppp-leaves-coalition-senator-saleem-mandviwalla",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T12:11:48.000Z"
}
