{
  "title": "Govt run by establishment instead of public representatives, claims Fazl - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: Jamiat Ulema-i-Islam-Fazl chief Maulana Fazlur Rehman has claimed that the government is essentially run by the establishment and public representatives are not the true rulers.\n\nHe made the remarks while speaking to mediapersons at his residence after attending a tribal jirga here on Saturday.\n\nMr Rehman called the government’s decision to merge the erstwhile tribal areas with Khyber Pakhtunkhwa a mistake. He said that the promised allocation of Rs100 billion to merged districts had not been fulfilled for over nine years as the region had received only Rs75 billion so far.\n\nHe expressed his concern about a potential geopolitical conspiracy, warning that the region might be subjected to territorial changes. Drawing parallels with the past, he suggested that the current situation resembled the attitude adopted towards Bangladesh before its separation. “I fear that geographical changes are being orchestrated in this region,” he said.\n\nJUI-F chief says military operations not a viable solution to militancy\n\nReferring to numerous military operations in the tribal districts, Mr Rehman argued that these efforts had not resulted in lasting peace. He noted that tribal areas, which enjoyed exemplary peace for decades, were now plagued with unrest and insecurity.\n\nThe JUI-F chief also raised alarm about the deteriorating law and order situation in districts adjacent to the tribal region, such as Dera Ismail Khan, Lakki Marwat and Bannu, where people were being forced to migrate due to worsening conditions. He lamented that neither daily life nor educational institutions could function normally in these areas.\n\n“Government and state representatives often engage in discussions with tribal elders, but there has been no progress,” he said, adding that even settled areas are no longer safe. “We advocate for policies that promote sustainable peace in these regions.”\n\nReflecting on the past, he said, “Since 2010, I have seen that military operations are not a viable solution. It pains me to witness the anguish of tribal elders. Their voices should be heard, and their concerns must be addressed. For how long will people remain content with empty promises of resilience and perseverance?”\n\nHe urged the government and relevant institutions to listen to the grievances of the affected people, emphasising that the elders had come to him with their issues, and he hoped their voices would reach those in power.\n\nMr Rehman criticised the provincial government’s decision to send a jirga to Afghanistan, calling it an ill-advised move by politically inexperienced individuals. He clarified that matters between states should be handled by national-level authorities, not provincial governments. “If they want to go sightseeing, they may, but negotiating interstate issues is neither their role nor responsibility,” he remarked.\n\nHe also called for the establishment of a national forum where all political parties could convene to deliberate on and resolve national issues. “Pakistan and Afghanistan are vital to each other, and we do not believe in fostering prejudice or animosity,” he said.\n\nResponding to a question, he called for clarity from the state regarding global powers’ policies and Pakistan’s stance on them. “We do not believe in using force as a solution. I fear that a conspiracy to alter geographical boundaries is underway.”\n\nHe concluded by asserting that there was no peace in Khyber Pakhtunkhwa and that the region was being pushed into chaos. He also noted that whether the US government was led by Democrats or Republicans, it made no significant difference to Pakistan’s foreign policy.\n\nA tribal jirga was held in Shorkot at the residence of Maulana Fazlur Rehman on Saturday. Tribal elders from North and South Waziristan attended the jirga.\n\nThe jirga discussed instability in the region, displacement of people and security issues.\n\nDuring the jirga, the JUI-F chief demanded of state to clarify its policy. He questioned whether Pakistan’s geographical status was being altered under an international agenda or the country was being handed over to the United States.\n\nHe criticised those politicians, who were supporting military operations in the region. He said that the funds promised for development of tribal districts were not released fully.\n\nThe tribal elders said that state was responsible for ensuring peace in the region. They demanded restoration of peace. The JUI-F chief assured them that he would continue to advocate for their rights.\n\nHe criticised the presence of armed groups and impact of military operations on civilians.\n\nThe jirga condemned insecurity in Waziristan.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67954e55d3c62.jpg",
  "retrievedAt": "2025-10-12T01:14:31.074Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887678/govt-run-by-establishment-instead-of-public-representatives-claims-fazl",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:55:09.000Z"
}
