{
  "title": "South Korea President Yoon indicted for insurrection over martial law decree - World - DAWN.COM",
  "author": null,
  "content": "South Korea’s prosecutors indicted impeached President Yoon Suk Yeol on Sunday on charges of leading an insurrection with his short-lived imposition of martial law on December 3, Yoon’s lawyers and the main opposition party said.\n\nYoon’s lawyers criticised the indictment as the “worst choice” made by the prosecution service, while the main opposition party welcomed the decision.\n\nThe charges are unprecedented for a South Korean president, and if convicted, Yoon could face years in prison for his shock martial law decree, which sought to ban political and parliamentary activity and control the media.\n\nHis move set off a wave of political upheaval in Asia’s fourth-largest economy and a top US ally, with the prime minister also impeached and suspended from power and a number of top military officials indicted for their roles in the alleged insurrection.\n\n“[The] president’s declaration of emergency martial law was a desperate plea to the public over a national crisis caused by the opposition getting out of control,” Yoon’s lawyers said in a statement.\n\nThe prosecutor’s office did not immediately respond to requests for comment. The indictment was also reported by South Korean media.\n\nAnti-corruption investigators last week recommended charging the jailed Yoon, who was impeached by parliament and suspended from his duties on December 14.\n\nA former top prosecutor himself, Yoon has been in solitary confinement since becoming the first sitting president to be arrested on January 15 after days of defiant, armed standoff between his security detail and arresting officials.\n\nOver the weekend a court twice refused the prosecutor’s request to extend his detention while they conducted further investigation, but with the charges, they have again requested that he be kept in custody, media reports said.\n\nInsurrection is one of the few criminal charges from which a South Korean president does not have immunity. It is punishable by life imprisonment or death, although South Korea has not executed anyone in decades.\n\n“The prosecution has decided to indict Yoon Suk Yeol, who is facing charges of being a ringleader of insurrection,” Democratic Party spokesman Han Min-soo told a press conference. “The punishment of the ringleader of insurrection now begins finally.”\n\nYoon and his lawyers argued at a Constitutional Court hearing last week in his impeachment trial that he never intended to fully impose martial law but had only meant the measures as a warning to break a political deadlock.\n\nIn parallel with the criminal process, the top court will determine whether to remove Yoon from office or reinstate his presidential powers. It has 180 days to decide on that.\n\nSouth Korea’s opposition-led parliament impeached Yoon on December 14, making him the second conservative president to be impeached in the country. Yoon rescinded his martial law declaration within about six hours after lawmakers, confronting soldiers in parliament, voted down the decree.\n\nDuring the dramatic confrontation, soldiers with rifles, body armour and night-vision equipment were seen entering the parliament building through smashed windows.\n\nIf Yoon is removed from office, a presidential election will be held within 60 days.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/26190029bc26eac.jpg",
  "retrievedAt": "2025-08-26T07:57:16.334Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887838/south-korea-president-yoon-indicted-for-insurrection-over-martial-law-decree",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T14:05:18.000Z"
}
