{
  "title": "PTI files plea against 26th Amendment - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As an eight-judge constitutional bench, headed by Justice Aminuddin Khan, is set to commence hearing of challenges to the 26th Amendment from Monday, the PTI also instituted a petition seeking court declaration that the amendment violates salient features of the Constitution and affects the judiciary’s independence.\n\nSeveral petitioners, including high court bar associations, requested the Supreme Court to constitute a full court to hear the matter instead of the constitutional bench established under the 26th Amendment.\n\nIn it petition filed through Advocate Sameer Khosa, the PTI has pleaded that the process by which the amendment was enacted contravenes Articles 63A, 238 and 239 particularly due to the absence of a fully constituted parliament, illegal inclusion of votes of defecting members of parliament and procedural irregularities that undermined the legitimacy of its passage.\n\nThe court was requested to declare specifically Sections 7, 9 10, 12, 14, 17, 21 and 27 of the 26th Amendment unconstitutional and in direct conflict with salient features of the Constitution and therefore void ab initio.\n\nJustice Shah objects to larger bench for hearing appeal by additional registrar\n\nBesides, the apex court was asked to declare both SC (Practice and Procedure) Act 2024 and SC (Number of Judges) (Am­­endment) Act 2024 unconstitutional, void ab initio and of no legal effect, as they originate from the unconstitutional tweak to achieve unconstitutional designs.\n\nLikewise, the court was also asked to restrain the Judicial Commission of Pakistan (JCP) as reconstituted under the purportedly amended Article 175-A through the 26th Amendment from convening, undertaking any actions making appointments or exercising any authority conferred by the amendment.\n\nObjections to larger bench\n\nSeparately, senior puisine judge Justice Syed Mansoor Ali Shah has written a two-page letter to express his objection to the formation of a six-judge larger bench for an intra-court appeal of Additional Registrar (Judicial) Nazar Abbas who sought to quash contempt proceedings against him by a two-judge bench comprising Justice Shah and Justice Aqeel Ahmed Abbasi.\n\nThe six-judge bench, headed by Justice Jamal Khan Mandokhail and also comprising justices Muhammad Ali Mazhar, Athar Minallah, Syed Hasan Azhar Rizvi, Shahid Waheed and Musarrat Hilali, will take up the application.\n\nJustice Shah objected to the hurriedly constituted larger bench saying that judges having conflict of interest in the matter cannot sit on the bench. Justice Mandokhail and Mazhar are members of the committee constituted under clause (4) of Article 191A.\n\nThe committee fixed the matter before the constitutional bench on Monday, hence, they cannot be the bench members as the decisions of both the committees were in question in the contempt proceedings, Justice Shah said.\n\n“I did not get a chance to record my opinion on the file as the actual file was never sent to my office and the majority itself decided the matter and issued the roster,” Justice Shah said in his letter.\n\nHe explained that on receiving the court roster for Monday, he communicated his objection through WhatsApp for onward transmission to the officials concerned.\n\nJustice Shah he was recording his objections for record along with the background regarding the constitution of the larger bench.\n\nAfter the Jan 23 meeting of JCP, Chief Justice of Pakistan (CJP) Yahya Afridi called an informal meeting of the regular committee in his chambers. It was agreed that a larger bench be constituted to hear ICA in the contempt matter.\n\nThe letter recalled that Justice Shah during the committee meeting recommended for the constitution of a larger bench comprising five judges in order of seniority, excluding those who cannot hear the intra-court appeal due to conflict of interest.\n\nBut the CJP said he would like a four-member bench in the matter and the meeting ended there. Later at 9:33pm, he received a WhatsApp message from his secretary seeking his approval as as a committee member for the proposed six-member bench.\n\nThe secretary was informed that Justice Shah would attend to it the next day, as he had some objections. However, at 10:28pm, the secretary informed him that the bench stood constituted and the roster had been issued by the majority decision of the committee.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:01:20.605Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887757/pti-files-plea-against-26th-amendment",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:54:27.000Z"
}
