{
  "title": "State Department confirms end of Donald Lu’s term - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The US State Department has quietly confirmed the departure of Donald Lu, Assis­tant Secretary of State for South and Central Asian Affairs, as his term concluded on January 17, 2025.\n\nThe announcement makes it clear that Mr Lu is leaving because he completed his tenure, and is not being sacked. This move, however, is likely to be interpreted as a victory by the PTI and dismissed by the government as a routine transition.\n\nLu’s time in office has been tumultuous for Pakistan, marked by a political storm, with the former US diplomat becoming the proverbial eye of a political storm involving former prime minister Imran Khan, the country’s military establishment, and the current political set-up in Islamabad.\n\nA brief announcement posted on the department’s official website revealed that “Mr Lu’s term ended on January 17, 2025”.\n\nHis tenure was marked by tensions surrounding a dispatch, known as the ‘cipher affair’\n\nHe had led the Bureau, which oversees US relations with Pakistan, since his appointment on September 15, 2021. Prior to this role, Mr Lu served as US Ambassador to the Kyrgyz Republic from 2018 to 2021 and Ambassador to Albania from 2015 to 2018.\n\nThe storm surrounding Mr Lu intensified in March 2022 when Imran Khan accused the US of orchestrating a ‘foreign conspiracy“ to remove him from power. Mr Khan specifically pointed to Lu, alleging that he was involved in efforts to destabilize his government, citing a conversation between Lu and Pakistan’s then-ambassador to the US, Asad Majeed Khan, as evidence of US interference.\n\nThis conversation, known as the “Cipher” talk, was reportedly detailed in a diplomatic cable sent by Ambassador Majeed to Islamabad, and it became central to Mr Khan’s broader narrative of foreign involvement in Pakistan’s politics. The cable reportedly described the meeting between Lu and Majeed, with Mr Khan alleging that it revealed US efforts to orchestrate his ouster.\n\nReacting on Mr Khan’s claims, PTI activists in the US began demanding Mr Lu’s resignation, accusing him of leading the controversy aimed at ousting the former prime minister. The demand was reiterated at PTI rallies across the United States, amplifying the political pressure on the US government.\n\nThe controversy became a central issue, even though the US government vehemently denied the allegations, dismissing them as baseless.\n\nWhile the PTI may view his departure as a symbolic win, reports from US media suggest that the new Trump administration has requested the departure of all senior State Department officials, including deputy and assistant secretaries. This request signals that the administration is poised to bring in officials aligned with President Trump’s political mission, ready to implement it.\n\nThe episode surrounding Mr Lu’s tenure will likely be remembered as a significant chapter in the ongoing political drama, which the Pakistani media has dubbed “Cipher Gate,” referring to the controversial cable that allegedly documented US interference in Pakistan’s politics.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67955a2ccbbe5.jpg",
  "retrievedAt": "2025-10-12T01:14:29.989Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887685/state-department-confirms-end-of-donald-lus-term",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:54:19.000Z"
}
