{
  "title": "Punjab set for lifetime ban on theatre actors, dancers involved in obscenity - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government has decided to impose a lifetime ban on the actors, especially women dancers, involved in promoting vulgarity, immorality and indecency during theatre performances and cancel the license of theatres having such performances.\n\nThe government has been long contemplating such an extreme action, especially against women dancers, on complaints of vulgar performances in theatres in the main cities of the province.\n\n“We have decided to impose a lifetime ban on the actors in promoting vulgarity and indecency in theatres in the province. All theatres have also been instructed to comply with the rules. Violations will lead to show-cause notices followed by fines and eventually license cancellations,” Punjab Information and Culture Minister Azma Bokhari said in a meeting with theatre owners here on Saturday.\n\nShe expressed her displeasure at the owners’ complicity in allowing vulgarity in their theatres.\n\nGovt plans new lawfor theatres to support those producing family-oriented plays\n\nShe also directed the Punjab Arts Council to obtain undertakings from all theatre owners that they would not allow ‘obscene or immoral’ performances at their theatres any more.\n\n“Under the leadership of Chief Minister Maryam Nawaz, no permission will be given for vulgarity and indecency in theatres. Theatres in Punjab should produce dramas that are family-friendly and attract families.”\n\nMs Bokhari suggested that theatre plays should focus on social themes to guide and inspire the public.\n\n“Punjab’s theatres were once renowned globally for their unique identity and quality. The government is planning new legislation for theatres soon. It will fully support the theatre owners if they produce family-oriented plays,” she added.\n\nA couple of months ago, the Punjab government, under Maryam Nawaz, had launched an anti-obscenity drive forming a seven-member advisory committee to make commercial theater plays ‘civilized and family-friendly’.\n\nLast year, in an attempt to curtail obscenity in the commercial theatre, the Punjab government had approved amendments to the 150-year-old Dramatic Performances Act 1876, transferring the administrative affairs of the dramatic performances from the home department to the Information and Culture Department.\n\nThe caretaker government of Mohsin Naqvi had also launched an anti-obscenity drive in Punjab and banned a number of actresses from the commercial theatre. His administration had sealed more than 10 mega commercial theatres of Lahore, Sheikhupura and Kasur for violating the Drama Act (Dramatic Performances Act 1876) and promoting obscenity through women dancers. Later, the theatres were unsealed by the Lahore High Court. Under the new Punjab Theatrical Performance Ordinance 2023, powers have been transferred from the home department to the culture department in a bid to regulate theatres.\n\nThe PAC will make its rules of business regarding commercial theatres in which all the mandate from script to monitoring and disciplinary action will be the subject of the PCA under the Information & Culture Department.\n\nPublished in Dawn, January 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:57:36.483Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887702/punjab-set-for-lifetime-ban-on-theatre-actors-dancers-involved-in-obscenity",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T01:54:55.000Z"
}
