{
  "title": "US may put ‘very big bounty’ on Taliban leaders, Secretary of State Rubio says - World - DAWN.COM",
  "author": null,
  "content": "The US may place a “very big bounty” on the top leaders of the Taliban, Secretary of State Marco Rubio said on Saturday, adding he was hearing that the Taliban held more American hostages than previously reported.\n\n“Just hearing the Taliban is holding more American hostages than has been reported,” Rubio said in a post on social media platform X.\n\n“If this is true, we will have to immediately place a very big bounty on their top leaders, maybe even bigger than the one we had on Bin Laden,” he added.\n\nThe post did not give further details or specify the number of Americans held by the Taliban.\n\nAuthorities in Kabul said in the past week that the United States freed an Afghan convicted by an American court on charges of drug smuggling and extremism in exchange for two US citizens held in Afghanistan.\n\nAfghan officials said on Tuesday the man, Khan Mohammad, had landed in Kabul after being released. A spokesman for the Taliban administration confirmed that two Americans were released in the exchange.\n\nOne of the Americans released was Ryan Corbett, according to a statement by his family. Corbett had been in Taliban detention since 2022, according to the family. US media outlets said the other American released was named William McKenty.\n\nThe Taliban took over Afghanistan in 2021 following a chaotic US withdrawal from the country after 20 years of war.\n\nThe International Criminal Court prosecutor said on Thursday he had applied for arrest warrants for two Taliban leaders in Afghanistan including supreme spiritual leader Haibatullah Akhundzada, accusing them of the persecution of women and girls.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2612115750ddf44.png",
  "retrievedAt": "2025-08-26T07:57:23.203Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887808/us-may-put-very-big-bounty-on-taliban-leaders-secretary-of-state-rubio-says",
  "dateList": "2025-01-26",
  "date_published": "2025-01-26T07:15:09.000Z"
}
