{
  "title": "Bahraini interior minister arrives on three-day visit - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: On an invitation of Interior Minister Mohsin Naqvi, his Bahraini counterpart Lt-Gen Rashid bin Abdullah Al Khalifa arrived here on Tuesday on a three-day official visit.\n\nUpon his arrival in the federal capital, the Bahraini dignitary was received by Minister of State for Interior Talal Chaudhry, according to a statement issued by the ministry.\n\nA smartly turned-out contingent of Islamabad Police presented a salute to the visiting minister.\n\nMinister Rashid bin Abdullah Al Khalifa also visited the Pakistan Monument, where he paid tribute to the martyrs. He laid a floral wreath at the Martyrs’ Memorial and offered Fateha.\n\nThe Bahraini interior minister will hold high-level meetings with Pakistan’s top leadership. The visit is aimed at strengthening bilateral cooperation in key areas, including human trafficking, counter-narcotics, security, and counter-terrorism.\n\nMr Naqvi visited Bahrain earlier in July when the two sides had agreed to deepen security cooperation, making the Pakistan-Bahrain Joint Security Committee more effective.\n\nThey agreed that enhancing cooperation between the Bahraini and Pakistani interior ministries in combating narcotics and human trafficking was the need of the hour.\n\nIn February, Prime Minister Shehbaz Sharif had expressed the desire to increase the trade volume between the two countries in a meeting with a parliamentary delegation from Bahrain.\n\nLater in March, army chief Field Marshal Asim Munir had met Commander of the National Guard Gen Shaikh Mohamed bin Isa bin Salman Al-Khalifa.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:04:16.887Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940835/bahraini-interior-minister-arrives-on-three-day-visit",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:07.000Z"
}
