{
  "title": "Ethiopia inaugurates Africa’s biggest dam - World - DAWN.COM",
  "author": null,
  "content": "GUBA/CAIRO: Ethiopia inaugurated the continent’s largest hydroelectric project on Tuesday in what Prime Minister Abiy Ahmed called a “great achievement for all black people”, but it drew a protest to the United Nations from downstream nation Egypt.\n\nThe Grand Ethiopian Renaissance Dam (GERD), straddling a tributary of the River Nile, is a national project of historic scale and a rare unifying symbol in a country torn apart by ongoing internal conflicts.\n\nTowering 170 metres (550 feet) and stretching nearly two kilometres across the Blue Nile near the Sudanese border, construction on the dam began in 2011.\n\nThe $4-billion megastructure is designed to hold 74 billion cubic metres of water and generate 5,150 megawatts of electricity — more than double Ethiopia’s current capacity. That makes it the largest dam by power capacity in Africa, though still outside the top 10 globally.\n\n“GERD will be remembered as a great achievement not only for Ethiopia, but for all black people,” Abiy said at the opening ceremony, attended by regional leaders including Kenyan President William Ruto and Somalia’s President Hassan Sheikh Mohamud.\n\nEgypt protests move in letter to UN Security Council\n\n“I invite all black people to visit the dam. It demonstrates that we, as black people, can achieve anything we plan,” said Abiy, who has made the project a cornerstone of his rule.\n\nEgypt protest\n\nEgypt, dependent on the Nile for 97 percent of its water, has long decried the project, with President Abdel Fattah al-Sisi calling it an “existential threat” to its water security.\n\nIn a letter to the United Nations Security Council on Tuesday, Egypt described the inauguration as a “unilateral measure that violates international law” and vowed to defend “the existential interests of its people”. Abiy again insisted the dam is not a threat.\n\n“For downstream countries, Ethiopia has accomplished GERD as a shining example for black people. It will not affect your development at all,” he said at the ceremony.\n\nIn the letter, Egypt accused Ethiopia of attempting to give “a false cover of acceptance and legitimacy” to the dam, the foreign ministry said in a statement. It added that Cairo reserves the right to take “all measures permitted under international law and the UN Charter” to defend “the existential interests of its people”.\n\nThe Blue Nile provides up to 85pc of the water that forms the River Nile, combining with the White Nile before heading through Sudan and Egypt. But Salini dismissed concerns from the downstream nations.\n\n“The hydroelectric project releases water to produce energy. They are not irrigation schemes that consume water. There’s no change in the flow,” said Salini.\n\nMediation efforts by the United States, World Bank, Russia, the UAE and the African Union have all faltered over the past decade.\n\n“For the Egyptian leadership, GERD is not just about water, it is about national security. A major drop in water supply threatens Egypt’s internal stability. The stakes are economic, political and deeply social,” said Mohamed Mohey el-Deen, formerly part of Egypt’s team assessing GERD’s impact. The tensions have not been all bad for Ethiopia’s government.\n\n‘No longer a dream’\n\nThe festivities began the night before with a dazzling display of lanterns, lasers and drones writing slogans like “geopolitical rise” and “a leap into the future”. Analysts say the dam can boost Ethiopia’s industrial production, enable a shift towards electric vehicles and supply the region through power lines that stretch as far as Tanzania.\n\nSome 45pc of Ethiopia’s 130 million people lack electricity, according to World Bank data, and frequent blackouts in the capital Addis Ababa force businesses and households to rely on generators. “It is no longer a dream but a fact,” Pietro Salini, CEO of Italian firm Webuild, the dam’s main construction contractor, said.\n\nHe said the project had to overcome huge manpower and financing challenges, as well as the brutal civil war of 2020-2022 between the government and rebels from the Tigray region. But now, “this country that was dark in the evening when I first arrived here… is selling energy to neighbouring countries,” said Salini.\n\n“Ethiopia is located in a rough neighbourhood and with growing domestic political fragility, the government seeks to use the dam and confrontation with neighbours as a unifying strategy,” said Alex Vines, of the European Council on Foreign Relations.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c0ad9a93a07.gif",
  "retrievedAt": "2025-09-19T14:33:20.715Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940869/ethiopia-inaugurates-africas-biggest-dam",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:30.000Z"
}
