{
  "title": "Kamala Harris slams Biden US presidential re-election bid as ‘recklessness’ - World - DAWN.COM",
  "author": null,
  "content": "Former US vice president Kamala Harris said it was “recklessness” to let Joe Biden run for a second term as president, in an excerpt released on Wednesday from her upcoming memoir.\n\nHarris — who replaced Biden as the 2024 Democratic presidential candidate but lost to Donald Trump — admitted that the then-81-year-old got “tired” and was prone to stumbles that showed his age.\n\nShe also lashed out at White House staff, whom she accused of failing to support her — and sometimes actively hindering her — while she was Biden’s deputy.\n\n“‘It’s Joe and Jill’s decision.’ We all said that, like a mantra, as if we’d all been hypnotised. Was it grace, or was it recklessness? In retrospect, I think it was recklessness,” Harris said in the first extract from “107 Days”, published by The Atlantic magazine.\n\n“The stakes were simply too high. This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition. It should have been more than a personal decision.”\n\nBiden stunned the world by dropping out of the race in July 2024 after a disastrous debate with Trump, sparking questions about his age and mental acuity.\n\nHarris denied that there had been any conspiracy to hide Biden’s condition but said it was clear there were issues with his age.\n\n“On his worst day, he was more deeply knowledgeable, more capable of exercising judgement, and far more compassionate than Donald Trump on his best,” she wrote.\n\n“But at 81, Joe got tired. That’s when his age showed in physical and verbal stumbles.”\n\nHarris also lashed out at White House staff, whom she said failed to support her when she was vice president, saying that Biden’s team did not want her to outshine her boss.\n\n“When the stories were unfair or inaccurate, the president’s inner circle seemed fine with it. Indeed, it seemed as if they decided I should be knocked down a little bit more,” Harris wrote.\n\nShe added that she had “shouldered the blame” for Biden’s border policy, which Trump capitalised on in the election.\n\nHarris lost comprehensively to Republican Trump after the shortest presidential campaign in modern US history, lasting just over three months — the 107 days in the title of her memoir.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:33:05.316Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940998/kamala-harris-slams-biden-us-presidential-re-election-bid-as-recklessness",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T13:47:14.000Z"
}
