{
  "title": "IHC’s Justice Babar Sattar orders removal of PTA chairman over ‘illegal’ appointment to office - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Islamabad High Court on Tuesday ordered the removal of the Pakistan Telecommunication Authority Chairman retired Major General Hafeezur Rehman due to his “illegal” appointment to the position.\n\nThe decision came in a verdict by IHC’s Justice Babar Sattar in a case pertaining to the appointment of the PTA’s member (administration) filed by digital rights activist Usama Khilji in 2023.\n\nRehman later filed an urgent intra-court appeal against the verdict.\n\nThe order said the court had admitted the petition for hearing and directed the government not to proceed with the hiring, following which the government had filed an appeal for a stay of the court injunction, which was partially accepted, as the court had subsequently allowed the recruitment process to continue while warning that any appointment would be subject to the final determination in the case.\n\nIt added that the court was subsequently informed in later hearings that Hafeezur Rehman, a retired major general, was appointed as the member (administration) and then the PTA chairman.\n\nIn his verdict, Justice Sattar remarked: “The entire process of creation of the post of member (administration), prescription of qualifications and criteria for such post and the manner in which the recruitment process was carried out lacked integrity and suffered from mala fide in law. The recommendation by the selection committee of a panel of three individuals for the appointment to the post of nember (administration) was not in conformance with the requirements of Rule 4(4) of the PTA Appointment Rules, which required that only one candidate could be recommended.\n\n“The decision of the federal government to pick the candidate listed at the bottom of panel recommended by the selection committee on the basis of merit was devoid of any reasoning or objective basis and fell afoul the obligation of the federal government under Section 24A of the General Clauses Act, 1897, to act in a just, fair and reasonable manner.”\n\nThe verdict further read: “Similarly, the appointment of respondent No.4 as chairman PTA, after being appointed as member (administration), without any objective or transparent process and without the federal government recording any reasons as to why he was so selected from amongst the members of PTA, was illegal, irrational and unsustainable in the eyes of law.”\n\nHe said the petition was allowed on the above grounds and remarked that the subsequent steps taken by the federal government in filling the post of member (administration) were not sustainable in the eyes of the law and were of no legal effect.\n\n“The entire edifice of processes and decisions built on an illegal foundation must crumble upon such illegal foundation. As the impugned advertisement and the process of recruitment undertaken thereunder suffered from malice in law, all subsequent decisions in pursuit of such process, including the appointment of respondent No.4 as member (administration) and chairman PTA, are illegal, ultra vires the law and of no legal effect.”\n\nConcluding his verdict, the judge said that since the entire process of Rehman’s appointment as the member (administration) and as the PTA chairman was found to “suffer from malice in law being the product of an unconstitutional and illegal recruitment process, he shall cease to hold such appointments and shall immediately relinquish charge for such offices”.\n\nThe judge ordered that the senior-most serving PTA member would temporarily assume the charge of the office of PTA chairman till the time that the federal government appointed a regular chairman.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:05:15.144Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942431/ihcs-justice-babar-sattar-orders-removal-of-pta-chairman-over-illegal-appointment-to-office",
  "dateList": "2025-09-10",
  "date_published": "2025-09-16T12:27:19.000Z"
}
