{
  "title": "Power outages hit most parts of Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: People woke to pleasant weather on Tuesday morning due to moderate showers, but their day took an inconvenient turn as the rain triggered widespread power outages in the city, particularly affecting low-lying neighbourhoods.\n\nEven upmarket areas like Defence Housing Authority and Clifton weren’t spared, with residents experiencing prolonged power outages lasting several hours.\n\nHowever, KE spokesperson Imran Rana claimed that the power transmission system was stable, and uninterrupted power supply was being provided through over 1,910 feeders out of 2,100 in the city.\n\nKE admits tripping of around 200 feeders, claims supply disconnected in low-lying areas as safety measure\n\n“At the peak of the rainfall, less than 200 feeders saw temporary outages. As per safety protocols, supply has been disconnected in low-lying areas, and power is being restored as soon as rainwater is drained and safety clearance is received from ground teams,” he added.\n\nHe stressed on the importance of adhering to safety protocols. “We strongly urge citizens to maintain safe distance from electrical infrastructure during rains including poles, electricity meters, service brackets, broken and tangled internet/cable wires. Internal wiring and water motors should not be operated with wet hands or in standing water. Only certified electricians should be engaged in case of electrical faults within households,” he added.\n\nResidents in DHA Phase I without power for three days\n\nSeveral houses falling on a main road in DHA Phase 1, who have been experiencing voltage fluctuations and extended power outages for some four months, now were left without power for 72 hours by Tuesday evening.\n\nBesides losing electricity for extended hours during the night, the residents of 7th East Street in DHA Phase 1 have also had to endure voltage fluctuations, which have resulted in ruining their electrical appliances. They described their plight as a “nightmare, which is affecting children, adults, working professionals and the elderly”.\n\nThe residents also informed that their power supply is cut after midnight (mostly around 2:30am) for four hours every night. These blackouts started as phase fluctuations during May and June but from July onwards have upgraded to complete blackouts.\n\nThe residents said that they have been complaining every day to K-Electric about the issue to which the standard response is that they are experiencing a “technical fault”.\n\n“Each day KE dispatches its team to solve the issue but the problem persists,” said a resident.\n\n“We have been reliably informed that the root of the problem are kundas that have been installed by residents from Azam Basti with help of locals. It is also rumoured that KE insiders are complicit in this disruption and we sincerely hope that is not the case but these thoughts are the result of selective outages at unreasonable hours daily for the so many months,” another resident added.\n\nReminding that they are loadshedding exempt areas where people pay all their bills in time without fail every month, the residents urged the KE to investigate the problem and resolve the matter urgently.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:04:52.598Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940812/power-outages-hit-most-parts-of-karachi",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:39.000Z"
}
