{
  "title": "Islamabad court issues arrest warrant for KP CM Gandapur in arms and liquor case - Pakistan - DAWN.COM",
  "author": null,
  "content": "A district and sessions court in Islamabad on Wednesday reissued an arrest warrant for Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur in an illegal arms and liquor case after he failed to appear before the court.\n\nThe case, which dates back to October 2016, accuses the PTI leader of possessing illegal arms and liquor after Islamabad police claimed they recovered five Kalashnikov rifles, a pistol, six magazines, a bulletproof vest, alcohol, and three tear gas shells from his car outside Bani Gala.\n\nGandapur has denied the police allegations, asserting that he was travelling with two licensed Kalashnikov rifles and that the vehicle contained a valid arms licence. He further claimed that the liquor bottle in question actually contained honey.\n\nAccording to the court order — a copy of which is available with Dawn.com — Judicial Magistrate Mubashir Hassan Chishti directed that the KP CM be arrested and presented in the court on September 17.\n\nThe judge issued the order after no representative appeared on behalf of the KP chief minister.\n\nLater, however, Gandapur’s lawyer, Raja Zahoor-ul-Hassan, appeared before the court and sought the suspension of the arrest warrant.\n\nTo this, the judge said, “If you present the accused, I will withdraw the warrant,” and rejected the request.\n\nThe arrest warrant was issued under Sections 143 (punishment for joining unlawful assembly), 144 (joining unlawful assembly armed with deadly weapon), 145 (joining or continuing in unlawful assembly, knowing it has been commanded to disperse) and 440 (mischief committed after preparation made causing death or hurt) of the Pakistan Penal Code, read with Sections 13 (penalty for breaching sections 4, 5, 8 and 11), 20 (power to confiscate) and Section 65 of the Arms Ordinance, 1965.\n\nSections 4, 5, 8 and 11 of the ordinance deal with the prohibition of the unlicensed sale and repair of firearms, the prohibition of transporting them, the prohibition of being armed without a licence and the power to make rules as to licences.\n\nOn July 19, the court issued an arrest warrant for the KP CM in relation to the same case, after he failed to appear in front of the judge. However, on July 29, after the KP CM made an appearance at the court, the arrest warrant was withdrawn.\n\nThe court acknowledged that his official responsibilities as the chief minister had hindered attendance.\n\nOn the same day, outside the courtroom, Gandapur, while talking to the media, dismissed the case as “politically motivated.”\n\n“There is nothing in this case. I wasn’t even present when it was filed, and the vehicle in question wasn’t mine,” he claimed.\n\n“These are false, fabricated cases meant to pressure us. But we are not afraid and have always respected the law.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/10133711279af59.webp",
  "retrievedAt": "2025-10-12T04:04:21.770Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940956/islamabad-court-issues-arrest-warrant-for-kp-cm-gandapur-in-arms-and-liquor-case",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T08:37:38.000Z"
}
