{
  "title": "US, Kazakhstan eye investment in Pakistan’s ports - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s strategic ports are attracting increasing international attention, with both the United States and Kazakhstan expressing keen interest in investing and enhancing regional connectivity.\n\nFollowing a recent agreement to harness natural resources, a US delegation visited the Ministry of Maritime Affairs on Tuesday. Federal Secretary Syed Zafar Ali Shah briefed the delegation on Pakistan’s port facilities, operational capacities, and investment opportunities.\n\nThe delegation was informed that Karachi Port handles 54pc of Pakistan’s trade, with an annual capacity of 125 million tonnes. The port’s infrastructure includes three private container terminals, bulk and liquid cargo facilities, and dry cargo berths. It has recently improved its global ranking to 61st among 405 container ports, and successfully managed the country’s largest vessel, measuring 400 metres.\n\nDiscussions also centred on investment prospects at Port Qasim, particularly in bulk, break-bulk, containerised cargo handling, and off-dock terminals. The Port Qasim Authority (PQA) chairman highlighted ongoing projects such as dredging navigation channels, the development of a coastal economic zone, and plans for LNG terminals and multipurpose cargo terminals.\n\nThe delegation showed particular interest in LNG terminals and bulk cargo handling, recognising Pakistan’s ports as critical assets for economic development.\n\nMeanwhile, Kazakhstan’s interest in Pakistan’s ports was underscored in a meeting between a Kazakh delegation, led by Transport Minister Nurlan Sauranbayev, and Pakistani officials at the Ministry of Maritime Affairs.\n\nThe delegation discussed expanding maritime cooperation and enhancing multimodal transport corridors connecting Central Asia to the Arabian Sea. Pakistan’s ports, including Karachi, Port Qasim, and Gwadar, were identified as key facilitators for Central Asian trade.\n\nFederal Secretary Shah emphasised the strategic position of Pakistan’s ports, offering access to South Asia, Central Asia, and the Gulf. Kazakhstan could benefit from container handling, logistics, and off-dock terminals under the China-Pakistan Economic Corri­dor, he noted. KPT and PQA officials also highlighted spare capacity to handle Central Asian cargo.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c0a48a9f7a3.gif",
  "retrievedAt": "2025-09-19T14:33:32.828Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940827/us-kazakhstan-eye-investment-in-pakistans-ports",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:14.000Z"
}
