{
  "title": "Yamaha discontinues bike assembly - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: In a significant development for Pakistan’s organised auto sector, Yamaha Motor Pakistan Ltd (YMPL) has announced the discontinuation of its motorcycle assembly operations. The decision comes as part of a change in the company’s business strategy.\n\nAccording to a letter posted on the company’s website and sent to its authorised dealers, Yamaha will continue to supply spare parts through its authorised network, ensuring adequate stock to meet dealer requirements. The company also reiterated its commitment to providing warranty services and customer support under the existing warranty scheme.\n\nYMPL had been producing four models with prices ranging from Rs429,500 to Rs493,500. The Yamaha YBR125, initially launched at Rs129,400, saw its price rise to Rs471,500 due to the devaluation of the rupee and escalating production costs.\n\nIn 2012, Yamaha announced plans to invest $150 million in a new assembly plant at Bin Qasim Industrial Park in Karachi. The plant was initially expected to produce 45,000 units annually and achieve an 85pc localisation target within 10 years.\n\nAt the time, the company began with 25pc localisation and hired around 200 people for assembly and office work in the first phase.\n\nThe FY16 marked the assembly of two-wheelers and the company assembled and sold 20,100 units and 16,109 units, respectively. The company’s production and sales peaked in FY19, with Yamaha assembling 24,811 units and selling 23,610 — the highest figures in its nine-year journey in Pakistan. However, production and sales began to decline, and by FY25, Yamaha’s output and sales hit a record low, with only 4,300 units produced and 5,709 sold.\n\nDespite some improvement in the first half of FY25, with 500 units assembled and 586 units sold in July (compared to just 100 and 302 units, respectively, in July 2024), Yamaha faced increasing competition from dominant players like Honda, Suzuki, and Chinese assemblers. Mohammad Sabir Sheikh, an authorised Yamaha dealer on Akbar Road, attributed the slowdown to falling consumer incomes and a shift in demand towards lower-priced bikes, typically in the Rs100,000-150,000 range. Yamaha’s focus on higher-end models limited its appeal to the mass market.\n\n“The closure of an organised Japanese assembly plant is troubling news for vendors and dealers across the country,” said Sheikh.\n\nHe noted that many Chinese bike assemblers, unable to compete with Honda’s popular CDI70cc bike in terms of quality and reliability, had already shut down.\n\nCurrently, only 10-12 of the 70 licensed bike assemblers in Pakistan are active, with many others pivoting towards electric bikes (EVs). “The future is EV, and it may take two to three years to transition from petrol-powered to electric bikes,” said Sheikh, highlighting that even Atlas Honda, the leader in the petrol bike market, had ventured into electric vehicles.\n\nA vendor, who wished to remain anonymous, pointed out that Yamaha’s localisation levels were low, which kept prices high as the company relied heavily on imported parts.\n\nAdditionally, the preference for larger bikes, capable of carrying multiple passengers, worked against Yamaha, whose models were seen as less practical for local consumers.\n\nDespite these challenges, Pakistan’s motorcycle production rose to 1.692 million units in FY25, up from 1.234 million in FY24, reflecting the growing demand in the sector.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:33:06.922Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940829",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:14.000Z"
}
