{
  "title": "Extreme heat a rising threat to 2026 FIFA World Cup venues - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: The 2026 World Cup could be North America’s last without urgent climate adaptation, according to a new study highlighting extreme weather threats.\n\nThe “Pitches in Peril” report found that 10 of the 16 venues are at very high risk of experiencing extreme heat stress conditions.\n\nBy 2050, nearly 90% of North America’s host stadiums will require adaptation to extreme heat while one third will face water demand equalling or exceeding supply.\n\nThe report also highlighted risks to 2030 and 2034 World Cup venues and examined the impact of a warming climate on grassroots football pitches once used by 18 iconic players.\n\n“As someone from Spain, I can’t ignore the climate crisis,” said Spain’s World Cup-winner Juan Mata, referencing last year’s devastating Valencia floods. “Football has always brought people together, but now it’s also a reminder of what we stand to lose.”\n\nThis year’s Club World Cup in the US offered a troubling preview, with conditions described as impossible by players.\n\nThe tournament saw extreme heat and thunderstorms force world football’s governing body FIFA to adapt protocols — adding cooling and water breaks, shaded benches and air fans.\n\nAccording to the report, 14 of the 16 World Cup stadiums in the US, Canada and Mexico exceeded safe-play thresholds in 2025 for at least three major climate hazards — extreme heat, unplayable rainfall and flooding.\n\nThirteen already experience at least one day each summer exceeding FIFA’s threshold for drinks breaks of 32C Wet-Bulb Globe Temperature (WGBT) — an internationally recognised index used to measure human heat stress in direct sunlight.\n\nTemperatures in Atlanta, Dallas, Houston, Kansas City, Miami and Monterrey exceeded that mark for two months or more.\n\nTen experience at least one day each summer with a WBGT of 35 degrees — identified by climate scientists as the limit of human adaptability to extreme heat, with Dallas (31 days) and Houston (51) worst hit.\n\nWhile Dallas and Houston stadiums will mitigate heat with roofs, climate risks extend beyond elite venues.\n\nThe report says forward Mo Salah’s Egyptian home ground could face more than a month of unplayable heat annually, while Nigeria captain William Troost-Ekong’s childhood pitch could see 338 days of extreme heat by 2050.\n\n“As we move further into the decade, risks will continue growing unless we take drastic measures, such as moving competitions to winter months or cooler regions,” said Piers Forster, director of the Priestley Centre for Climate Futures in Leeds.\n\nThe 96-page report urges the football industry to commit to net-zero by 2040 and publish credible decarbonisation plans and calls on tournament organisers to create adaptation funds.\n\nIt also said 91% of 3,600 fans polled across the three hosts want the 2026 World Cup to be a sustainability role model.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:33:31.477Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940799/extreme-heat-a-rising-threat-to-2026-fifa-world-cup-venues",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:21.000Z"
}
