{
  "title": "Afghanistan beat Hong Kong by 94 runs in Asia Cup opener - Sport - DAWN.COM",
  "author": null,
  "content": "Azmatullah Omarzai hammered a 20-ball fifty as Afghanistan thrashed Hong Kong by 94 runs in the opening match of the men’s T20 Asia Cup on Tuesday.\n\nThe 17th edition of the Asia Cup kicked off with the Group ‘B’ match between the two teams which have six-time Asia Cup champions Sri Lanka and Bangladesh as the other teams in their group\n\nAfghanistan elected to bat first in Abu Dhabi and posted 188-6 with opener Sediqullah Atal playing the anchor role with an unbeaten 73.\n\nHis fifth-wicket partnership of 82 with Omarzai, who hit 53 off 21 balls, including two fours and five sixes, proved key for Afghanistan in the Group B fixture.\n\nAfghanistan’s bowlers then combined to keep Hong Kong down to 94-9.\n\nTemperatures early on touched 40 degrees Celsius, but it was the humidity in the evening that tested the fitness of the players who took regular drinks breaks.\n\nHong Kong bowlers struck two early blows, but Atal stood firm to put on 51 runs with veteran Mohammad Nabi, who made 33, as the two counter-attacked.\n\nOff-spinner Kinchit Shah broke the stand to dismiss Nabi but Atal raised the run-rate with Omarzai, who raised his first T20I fifty — the fastest by an Afghan batter — with three sixes and a four before his departure.\n\nHong Kong, whose fielders dropped five catches, were never in the chase after they slipped to 22-4 inside five overs, including two run-outs.\n\nAfghanistan came into the match after being routed by Pakistan by 75 runs in a tri-series final at the Sharjah Cricket Stadium on Sunday.\n\nIndia begin their campaign in Group A on Wednesday when they face hosts United Arab Emirates in Dubai.\n\nPakistan and India meet on September 14 in the most-awaited match of the T20 tournament, which serves as a build-up for next year’s T20 World Cup in India and Sri Lanka.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/100005475c93b11.webp",
  "retrievedAt": "2025-10-12T04:04:47.825Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940775/afghanistan-beat-hong-kong-by-94-runs-in-asia-cup-opener",
  "dateList": "2025-09-10",
  "date_published": "2025-09-09T19:11:03.000Z"
}
