{
  "title": "Russian air strike kills 24 Ukrainians in pension queue - World - DAWN.COM",
  "author": null,
  "content": "KYIV: A Russian strike on Tuesday killed 24 people waiting for pension payments in a front-line town of eastern Ukraine where Russian forces are massing forces for a large-scale offensive, officials said.\n\nPresident Volodymyr Zelensky posted video showing several corpses strewn on the ground by a burned-out minivan and playground.\n\n“A brutally savage Russian airstrike with an aerial bomb on the rural settlement of Yarova in the Donetsk region. Directly on people. Ordinary civilians. At the very moment when pensions were being disbursed,” Zelensky wrote online.\n\nMoscow has claimed the industrial region as part of Russia despite not having full control over it. Kyiv says the Kremlin has massed 100,000 troops at a key part of the front line for a fresh offensive.\n\nThe interior ministry said 24 people were killed, while the army said Moscow had dropped a glide bomb — weapons fixed with wings to help them fly over dozens of kilometres.\n\nZelensky urges allies to come up with ‘response’ to the attack\n\nThey are part of an arsenal developed by Russia to hit deeper into Ukrainian territory and stretch the front line. Yarova is about eight kilometres (five miles) from the front line and had a pre-war population of around 1,900 people.\n\nJournalists in eastern Ukraine saw mourners weeping outside a morgue where staff had laid out at least 13 corpses in black body bags. Zelensky urged Ukraine’s allies to issue a response to the attack.\n\n“A response is needed from the United States. A response is needed from Europe. A response is needed from the G20,” he said.\n\n‘Strong actions’\n\n“Strong actions are needed to make Russia stop bringing death,” Zelensky added, while the prosecutor general said it had opened a war crime investigation.\n\nA spokesman for the Ukrainian postal network, Ukrposhta, confirmed that one of its vehicles was damaged in the attack and that its department head, identified as Yulia, had been hospitalised.\n\nUkrposhta, which delivers public services in front-line regions, said it would change how it distributes pensions and basic services there.\n\nRussia has been steadily advancing in the eastern Donetsk region for months, concentrating its firepower on the territory and deploying troops from other parts of the front line, Kyiv has said.\n\nAuthorities in Donetsk have been appealing to civilians to flee the fighting since the early days of Russia’s invasion in February 2022.\n\nUkrainian commander-in-chief Oleksandr Syrsky said this week that Russian forces outnumbered Ukrainian troops threefold in some areas of the front, and by six times in regions where Moscow has concentrated its forces.\n\nUS President Donald Trump has said he has tried to find a way to end the war in recent weeks but has little to show for his efforts. The strike comes just days after a Russian missile crashed into the Ukrainian government headquarters in central Kyiv, the first time the complex had been hit in the three-and-a-half-year war.\n\nTens of thousands of people have been killed and millions forced from their homes in Europe’s bloodiest conflict since World War II.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/10120836edf8cbc.webp",
  "retrievedAt": "2025-10-12T04:04:51.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940872/russian-air-strike-kills-24-ukrainians-in-pension-queue",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:30.000Z"
}
