{
  "title": "Arshad in good shape, eyes glory in Tokyo - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: Olympic javelin throw champion Arshad Nadeem on Tuesday said that he was looking to produce his best as the star athlete gets ready for a top-level competition at the World Athletics Championships in Tokyo.\n\nThe 28-year-old Arshad, who stunned the athletics world by throwing the javelin at an Olympic record 92.97 metres distance to achieve glory for Pakistan at the 2024 Paris Olympics, was seen preparing for the Sept 13-21 global spectacle at the Punjab Stadium in Lahore just a few hours before leaving for Tokyo via Bangkok.\n\nAnd the celebrated player during practice attempted throws at distances above 85 metres, showing he is in good shape for the challenge in Tokyo.\n\n“I always target to do my best in every event and I am going to Tokyo with the same mission with high hopes. And rest is on my God; He will do better,” Arshad told reporters after completing his final practice session.\n\nAnswering a volley of questions about his competition against India’s Neeraj Chopra, Arshad said: “My competition is always against Arshad Nadeem, I have my competitions against myself.\n\n“I am in a good shape and well prepared for the contest in Tokyo,” the Mian Channu-born prodigy who earned an Olympic gold for Pakistan after 40 years, added.\n\n“Most of the other main rivals in Tokyo [javelin throw event] are same who were at the Paris Olympics, so it will be good contest.”\n\nArshad will feature in the qualifying round of the javelin throw event on Sept 17 while the final round is scheduled for Sept 18.\n\nAfter the Paris Olympics, Arshad missed two Diamond League meetings — in Silesia, Poland and Zurich, Switzerland — last month due to fitness problems after he had clinched gold at the Asian Athletics Championship held in Gumi, South Korea in May this year with an 86.40-metre throw. In August, he was undergoing rehabilitation in England under the supervision of Dr Ali Sher Bajwa.\n\n“I am thankful to the nation and media for supporting me every time. I need more prayers from them to again lift the Pakistan flag with a gold medal in the coming competition [in Tokyo],” he said.\n\n“I regret that I could not feature in the last two Diamond Leagues but the decision was taken just not to take any risk before the World Championships,” he added.\n\nMeanwhile, Dr Asad Abbas Shah, one of Arshad’s doctors, said that the 1.92-metre athlete was in best physical shape.\n\n“Yesterday, Arshad passed all the fitness tests; that is a good news that he has recovered from his calf injury,” Dr Asad said while talking to reporters.\n\nMeanwhile, Arshad’s coach Salman Butt avoided talking to the media. When he was asked about the estimated distance of Arshad’s throws he made during practice at the Punjab Stadium on Tuesday, the coach said that they were not measured.\n\nPOA SCHOLARSHIP\n\nArshad, on the occasion, also received an Olympic scholarship from Pakistan Olympic Association (POA) president Arif Saeed who visited the Punjab Stadium to personally give the scholarship to Arshad while witnessing him practise.\n\nUnder the scholarship, Arif said, Arshad would get $1,125 per month for 36 months till the 2028 Los Angles Olympics.\n\nAccording to Arif, the POA had got similar scholarships for six other athletes of shooting, table tennis and taekwondo.\n\nArshad thanked the POA president and hoped the scholarship would help him prepare better for the Los Angles Olympics.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:33:06.713Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940794/arshad-in-good-shape-eyes-glory-in-tokyo",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:21.000Z"
}
