{
  "title": "Karachi rain deaths rise to 8; over 300 relocated as heavy showers swell Lyari, Malir rivers - Pakistan - DAWN.COM",
  "author": null,
  "content": "The death toll from rain-related incidents in Karachi rose to eight on Wednesday, while over 300 people were relocated to safety after heavy monsoon showers swelled the Malir and Lyari rivers.\n\nLyari and Malir rivers serve as Karachi’s main storm drains, channelling rainwater through a network of nullahs into the Arabian Sea. Once natural seasonal streams, they are now heavily constricted by urban sprawl, encroachments, and solid waste, turning many drains into open sewers. This blockage reduces their capacity to carry stormwater, causing frequent urban flooding during monsoon downpours.\n\nFour more people died in rain-related incidents in the metropolis today, raising the death toll since yesterday to eight, while three were missing, according to rescue services.\n\nEdhi rescuers recovered the bodies of three men and a woman after a van carrying four people fell into the rain-filled Konkar Nadi in Gadap Town, a statement issued by the Edhi Foundation said.\n\nThe rescue operation to find the other missing people was underway, the spokesperson added.\n\nSeparately, police surgeon Dr Summaiya Syed told Dawn.com that the body of an 18-year-old man, identified as Ahmed Qadir, was brought to Abbasi Shaheed Hospital from North Nazimabad’s Block-C after he “died of an electric shock”.\n\nA man was saved alive and the search for another was underway after the two went missing in the Malir river, a statement issued by Rescue 1122 said.\n\nThe man rescued was identified as Mustafa Ali Gul, while Farhan Akram remained missing. Deputy Mayor Salman Abdullah Murad and the Malir deputy commissioner were present on the site, Rescue 1122 added.\n\nTwo others were rescued alive after they were trapped in the Lyari river, Rescue 1122 said in a statement, shared by the Sindh Information Department.\n\nMeanwhile, Sindh Chief Minister Murad Ali Shah refuted rumours of the operational section of Shahrah-i-Bhutto Expressway (Malir Expressway) caving in or being breached to divert waters.\n\nAsked about a video being shared on social media that showed a paved section caving in during a media talk in Karachi, CM Shah explained: “Malir Expressway is under construction at that place. A bund is being built properly on the river, so when water from the river comes and it (the bund) is incomplete, then the water will pass through some location or another.\n\n“That is it. There is no issue,” he added, advising people to “use their energy” for a better cause.\n\nThe CM’s spokesperson, Abdul Rasheed Channa, also issued a statement refuting reports of Shahrah-i-Bhutto caving in, saying: “It is not [a] real picture.”\n\nA further statement from the chief minister’s spokesperson said there was “no truth” to the news of an operational part of the highway being washed away.\n\n“The unpaved part of Shahrah-i-Bhutto has sunk down in the rainwater, and work is still ongoing. This is the part of Shahrah-i-Bhutto that has collapsed and neither a retaining wall has been built nor stone pitching has been done. This is part of the Malir section, which is under construction and is not yet open to traffic,” the statement said.\n\nIt added that sections of the road that were open for traffic were still being used by the public.\n\nAccording to Pakistan Meteorological Department (PMD) data as of 8pm, Karachi received the highest amount of rainfall in Defence Housing Authority’s Phase 7 (32.6 millimetres).\n\nPAF Masoor Base recorded 20mm, Keamari 19mm, Korangi 18.9mm, Gulshan-i-Maymar 16.9mm, Surjani Town 13.8mm, North Karachi 12.8mm, University Road and Orangi Town 11.8mm, Airport Old Area 11.5mm, PAF Faisal Base 11mm, Gulshan-i-Hadeed 8mm, Saadi Town 7.7mm, Jinnah Terminal 5.2mm, Nazimabad 5mm and Bahria Town 3.4mm.\n\nSeparately, CM Shah visited various locations across Karachi — including the Lyari river, Jinnah Avenue, Saadi Town and Shahrah-i-Bhutto Expressway — to review water drainage following the rains.\n\nFootage from DawnNewsTV showed that the road linking Superhighway to Thado Dam was inundated, with water gushing into a stream and people gathered near the spot.\n\nThe Sindh CM, accompanied by Local Government Minister Saeed Ghani, visited the flooded Saadi Town through the Malir Cantonment route, the provincial Information Department said on X.\n\n“The water entered Saadi Town due to overflow of the Lath and Thado Dams,” the chief minister was informed. He met with the local residents and directed authorities to carry out speedy water drainage.\n\nDuring his visit to Jinnah Avenue, CM Shah “inspected the drainage of water from the dams via Mehran Nala and reviewed the machinery deployed for dewatering”, the Information Department said.\n\nIn a statement detailing his visit to the Lyari river, the chief minister was quoted as saying that the flow of water in the Lyari river was “high, but the flows are running smoothly”.\n\nHe explained that the river began from the mountains of Manghopir and Gadap, gathering rainwater from those areas. “The Lyari river passes through Orangi Town, SITE area, Nazimabad, Liaquatabad, Gulbahar, Lyari Town, Kharadar, Meethadar and West Wharf, and then reaches the port.”\n\nCM Shah, Ghani and Senior Minister Sharjeel Inam Memon also visited the Shahrah-i-Bhutto Expressway, which is expected to be completed by the year’s end, and the Qayyumabad Chowk near Korangi Causeway.\n\nSeparately, Karachi Mayor Murtaza Wahab, in a post on X earlier today, said that so far, 318 people have been “rescued [and] moved to safe [places] from around the [areas] close to Lyari Naddi and teams are still present on ground”.\n\n“All major arteries of the city as well as underpasses are clear and open for traffic,” he asserted.\n\nIn Saadi Town, joint efforts by Rescue 1122 and the Pakistan Army resulted in the rescue of 10 people, Rescue 1122 Spokesperson Hassaanul Haseeb Khan said in a statement.\n\n“Near Saima Society, two men, three women and six children were safely moved,” Khan told Dawn.com. “Eight people were trapped in Nashr Basti and Isa Nagri due to waterlogging,” he added.\n\nMemon said large-scale rescue and relief operations were underway in view of the recent rains and rising water in the rivers. “The situation in Karachi after the rains is gradually improving. Due to the filling of the dam and heavy rains, the Lyari and Malir rivers overflowed,” he said.\n\nMeanwhile, the Sindh government has ordered the closure of all educational institutions across the Karachi Division following heavy monsoon rains and a forecast of further showers.\n\n“All the educational institutions (public/private) will remain closed within the territorial jurisdiction of Karachi Division,” said a notification by the Karachi commissioner, dated September 9.\n\nThe PMD said in its weather forecast for today that yesterday’s depression over southwest Sindh moved nearly westwards and was now lying 60 kilometres west of Karachi.\n\n“It is likely to move further westwards and gradually weaken into a well-marked low-pressure area in next couple of hours. Under its influence: light to moderate rainfalls are expected in Karachi division, Jamshoro, Thatta and Sujawal districts today,” the PMD said, adding that hot and humid weather was expected in most parts of the province.\n\nIt said the weather forecast for Karachi division for Thursday was partly cloudy and humid with chances of drizzle/light rain and partly cloudy and humid on Friday.\n\nMemon said a new spell of rain was predicted in 24-48 hours, adding that the Sindh government was on full alert. “If there is no more rain, the situation will return to normal in a few hours,” he said.\n\nSeveral hundred straw-mud houses in the rural areas of Tharparkar and Dadu districts were swept away as the two districts had been receiving intermittent heavy, moderate and light spells of monsoon rains for the last six and four days, respectively.\n\nTaking notice of the flood situation in Karachi and other areas of Sindh, Prime Minister Shehbaz Sharif directed the National Disaster Management Authority (NDMA) to fully cooperate with the provincial government and Sindh Disaster Management Authority (SDMA) in relief operations.\n\nThe prime minister also appreciated the active rescue operations being carried out by Rescue 1122, the Pakistan Army and Rangers in Karachi.\n\nAccording to a press statement issued by the PM Office, the prime minister also expressed sorrow over the drowning of citizens in the Gadap stream.\n\nThe prime minister instructed relevant authorities to locate the missing persons in the floods as soon as possible.\n\n“The awareness campaign should be further activated to inform the public about the flood situation to protect as many citizens as possible,” he added.\n\nThe premier also directed authorities to take immediate steps to restore the flood-affected communication infrastructure.\n\n“The federal and Sindh governments are fully mobilised to deal with the flood situation,” he said, emphasising that the relief and rehabilitation of families affected by the floods in Karachi must be prioritised.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/101742292651fa1.webp",
  "retrievedAt": "2025-09-19T14:33:09.282Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940928/karachi-rain-deaths-rise-to-8-over-300-relocated-as-heavy-showers-swell-lyari-malir-rivers",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T05:58:48.000Z"
}
