{
  "title": "Pakistan forms committee on narrative building to counter terrorism - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan on Wednesday formed the ‘National Committee on Narrative Building’ as part of the country’s efforts to combat terrorism and extremism.\n\nAccording to a notification from the Ministry of Information and Broadcasting, available with Dawn.com, the committee has been constituted based on the Apex Committee’s meeting minutes on revising the National Action Plan from June 2024.\n\n“The ‘National Committee on Narrative Building’ is hereby constituted on points related to information operation, formulation, dissemination, propagation and evaluation of [the] national narrative against the spread of terrorism [or] extremism through media, communication and cyber networks for smooth implementation of Revised National Action Plan 2021,” the notification read.\n\nThe 20-member body will be led by Information Minister Attaullah Tarar and will be composed of the information and broadcasting secretary, information ministers from all provinces and territories, the chairman of the Pakistan Telecommunications Authority and representatives from both the Inter-Services Intelligence (ISI) and Inter-Services Public Relations (ISPR).\n\nIn March, Adviser to the Khyber Pakhtunkhwa Chief Minister on Information, Barrister Mohammad Ali Saif, said that the growing threat of violent extremism was not merely an ideological issue; countering extremism required more than just security measures and a long-term and comprehensive strategy developed with the coordination of all relevant institutions and stakeholders was required.\n\nPakistan has assumed the chair of the Shanghai Cooperation Organisation’s (SCO) Regional Anti-Terrorist Structure (SCO-RATS), a press release from the Foreign Office (FO) read on Wednesday.\n\nThis development comes on the heels of the SCO Council of Heads of State Summit in Tianjin, China, earlier this month. During the summit, Prime Minister Shehbaz Sharif raised the Indus Waters Treaty (IWT) issue, while the summit released a joint declaration condemning terrorist attacks on the Jaffar Express and Khuzdar in Balochistan.\n\nThe FO’s press release highlighted that Pakistan chairing SCO-RATS was a “reflection of the SCO’s confidence in Pakistan as a contributor to regional peace and security, particularly in combating terrorism”.\n\n“In its capacity as the Chair of SCO-RATS, Pakistan will work towards fostering regional cooperation against terrorism, in line with shared priorities, guided by the Shanghai Spirit of mutual trust, equality, and shared responsibility,” the FO stated.\n\n“It will also host events and activities across key domains — including cyber counter-terrorism, information operations, border security, countering terrorist financing, and capacity-building — to deepen collaboration.”\n\nThe FO added that as a frontline state in combating terrorism, Pakistan continues to make sacrifices to ensure the safety and security not only of its own people but also of the region and beyond.\n\n“As a non-permanent member of the United Nations Security Council (UNSC) for the 2025–26 term, Pakistan has also been entrusted with key responsibilities in the counter-terrorism domain, among others,” the press release read.\n\nIn June this year, Pakistan was appointed vice chair of the UN Security Council’s (UNSC) Counter-Terrorism Committee, which is tasked with monitoring implementation of UNSC Resolution 1373 (2001), which requested countries to implement several measures intended to enhance their legal and institutional ability to counter terrorist activities at home, in their regions and around the world.\n\nPakistan’s mission to the UN called the appointment a “significant diplomatic development”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:33:04.458Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940991/pakistan-forms-committee-on-narrative-building-to-counter-terrorism",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T12:55:41.000Z"
}
