{
  "title": "Pakistan fall to narrow loss against Oman at 2026 AFC Under-23 Asian Cup qualifiers - Sport - DAWN.COM",
  "author": null,
  "content": "PHNOM PENH: Pakistan’s 2026 AFC Under-23 Asian Cup qualifying campaign came to an end with a third straight loss when the suffered a 1-0 reverse against Oman at the Olympic Stadium on Tuesday.\n\nAfter Iraq, who finished top of Group ‘G’ and secured a berth at next year’s finals, had thumped Pakistan 8-1 in the opener, Nolberto Solano’s men lost their second game 1-0 to hosts Cambodia before Turki Abdullah’s first-half goal proved decisive in their match against Oman.\n\nOman got into their rhythm quickly with Nasser Alsaqri’s pace seeing him break through on the right, beat a defender and bear down on goal but was closed down well by Pakistan custodian Hassan Ali.\n\nThey got the lead in the 16th minute when Turki beat the offside trap to turn in Said Alghanboosi’s perfectly-floated set-piece into the net.\n\nChances were spurned by both sides in the closing minutes of the first half with Pakistan’s Syed Ali Raza smacking one effort against the bar while Oman’s Sameer Alhatmi headed over from close range unchallenged.\n\nA heavy downpour at half-time saw both teams taking time to adapt to the slick surface.\n\nPakistan eventually created a chance in the 75th minute but Mckeal Abdullah’s effort was thwarted by Oman goalkeeper Abdullah Aljabri before the West Asians went up the other end and saw Osama Sameer’s attempt hit the post but eventually saw out the win.\n\nIraq played a goalless draw with Cambodia later in the other group game to secure top spot with seven points. Cambodia ended with five points, one ahead of Oman.\n\nPublished in Dawn, September 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:33:32.393Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940802/pakistan-fall-to-narrow-loss-against-oman-at-2026-afc-under-23-asian-cup-qualifiers",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T02:15:21.000Z"
}
