{
  "title": "Holly Prophet (PBUH) is role model for all mankind: Dr Firdous",
  "link": "https://www.app.com.pk/national/holly-prophet-pbuh-is-role-model-for-all-mankind-dr-firdous/",
  "date_published": "2020-11-21T15:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 21 (APP):Special Assistant to Chief Minister Punjab on Information Dr Firdous Ashiq Awanhas said that the Prophet Muhammad Peace Be Upon Him (PBUH) is a role modelfor mankind and specially in caring for children as He taught how to treat with them.\nShe said Holy Prophet (PBUH) was always very kind and affectionate to children\nand loved them and treated them with immense kindness and gentleness.\nThese views were expressed by Special Assistant to CM while addressing the\nceremony organized for the destitute and helpless children of Child Protection & Welfare\nBureau at Governor’s House on Saturday in connection with ‘Shan-e-Rehmat-ul-Lil Alameen\n(PBUH)’ week.\nShe said that Punjab Governor Chaudhry Mohammad Sarwar had followed the blissful\nway of life of the Holy Prophet (PBUH) by hosting the destitute children from Child Protection\n& Welfare Bureau. She said the services of the Punjab Governor for the disenfranchised stratawere commendable.\nShe said that under the leadership of Punjab Chief Minister Usman Buzdar, the government wastaking every possible measure to provide safe heaven to destitute, neglected, abused and run away children.\nBesides providing shelter, the government was also focusing to make\nthem as useful and productive members of the society, she added.\nDr Firdous said that the Pakistan Tehreek-e-Insaf (PTI) government was following the guidingprinciples of the state of Madinah and endeavoring to bring improvement in the socio-economicsystem of Pakistan.\nShe mentioned the government wanted to establish a state where the rights of the poor, destitute,orphans and widows etc were safeguarded.\nShe maintained that on the directions of Punjab Chief Minister,a number of welfare-oriented projects had been launched for the betterment and welfare of people of the province.\nResponding to a question, she said that coronavirus was a reality which was affecting human health everywhere.\nThe precautionary measures were being taken all over the world to protect and prevent the masses from the virus.\nThe government had already issued a plan in NCOC meeting to deal with the situation.\nAll the provincial governments were bound to strictly implement the SOPs of the coronavirus.\nShe said that opposition was doing politics only for face-saving despite the fact that the secondwave of the coronavirus was lethal. “Your life is more important than politics”, she stressed.\nShe said that the implementation on SOPs would not be possible in public gatherings of opposition.\nThe lives of the people were more important than anything else. If people’s lives would be at stake, then the government would take strict legal action.\nIn the end, the Special Assistant to CM along with the Governor distributed gift hampers among the children and also played cricket with them.",
  "retrievedAt": "2025-08-11T20:02:32.067Z"
}
