{
  "title": "NSER campaign to determine socio-economic conditions of people for future strategy: Dr. Sania",
  "link": "https://www.app.com.pk/national/nser-campaign-to-determine-socio-economic-conditions-of-people-for-future-strategy-dr-sania/",
  "date_published": "2020-11-21T11:11:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 21 (APP): Special Assistant to Prime Minister (SAPM) on Poverty Alleviation and Social Protection, Dr. Sania Nishtar on Saturday said ongoing campaign of National Socio-Economic Registry (NSER) is of supreme importance would help government identifying strata of society that needs help and assistance.\nPM’s aide said this after visiting a house situated in Sikandar Town locality of provincial metropolis where she collected data of a family. She said expert and qualified teams were being constituted to compile data of families in a systematic way.\nShe said compilation of data during ongoing campaign would also ensure clear and transparent disbursement of funds among deserving people. She said survey teams were given tablets for securing data properly, adding, there is no chance that data of families is misused or leaked.\nDr. Sania said deserving families are being provided assistance and help throughout the country under Ehsas Program. She said the government has started various programs including Ehsas Nisonuma, Ehsas Teleem, Ehsas Kifalat aiming facilitation of people at grass root level.\nStudents, entrepreneurs, women, daily wagers and children were being given regular help under various Ehsas program, she told and added that deserving families would also be provided one-time instalment of Rs. 12000 under Ehsas Kifalat.\nSAPM said the government is also launching a program in December that would help people in getting medical assistance through an SMS. She said NSER survey would be completed by April.\nShe also urged media to create awareness among people regarding NSER survey and help government in its efforts to help out needy and deserving.",
  "retrievedAt": "2025-08-11T20:02:35.482Z"
}
