{
  "title": "Asad Umar advises Sindh Govt to utilize Rs 700b allocated in the budget for Karachi",
  "link": "https://www.app.com.pk/national/asad-umar-advises-sindh-govt-to-utilize-rs-700b-allocated-in-the-budget-for-karachi/",
  "date_published": "2020-11-21T10:31:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 21 (APP):Federal Minister for Planning, Development, Reforms and Special Initiatives, Asad Umar on Saturday said that the Sindh Government should utilize Rs 700 billion that have been allocated in the provincial budget for the projects in Karachi.\nHe said this while talking to the media after unveiling the plaque to commemorate the ground breaking of BRT Common Corridor from Taj Medical Complex to Municipal Park along M.A.Jinnah Road here.\nThe Federal Minister along with the Governor of Sindh Imran Ismail also unveiled the plaque to commemorate the opening of Grade Works of BRT Common Corridor Underground facilities at Naumaish M.A.Jinnah Road.\nThe Federal Minister said that the Green Line project would be a milestone for a modern transport system in Karachi and the Green Line project was expected to be completed by the middle of the next year. Asad Umar said that the people would be witnessing the Green Line on the roads in the middle of 2021.\nHe also appreciated Sindh Infrastructure Development Company Limited (SIDCL) and Planning Development and Special Initiatives Division for the hard work and dedication in execution of the Green Line project.\nSpeaking about the Karachi Transformation Plan, Asad Umar said that good progress is made on all the projects in Karachi for which the federal government was responsible and fast-pace work was underway on the K-4 project, two projects of railways, KCR and Freight Corridor from Karachi Port to Pippri. The Green Line project was in the last phase of its implementation, he added.\nHe said that work was also underway on the cleaning of drains in Karachi to permanently settle the problem of de-watering after rain. The encroachments were being removed in the initial phase of cleaning of nullahs for which the Sindh Government has started work from Mehmoodabad area, he said.\nAs soon as the encroachments were removed from the nullahs, the Federal government would launch work on it, Asad Umar added.\nSpeaking on the occasion, Sindh Governor Imran Ismail said that the inauguration of the first mass transit project of Sindh would be performed between July to September 2021 and Prime Minister Imran Khan, as per his promise was expected to perform its inauguration in Karachi.\nSpeaking about the projects, he said that he along with Asad Umar performed the opening of Grade Works of BRT Common Corridor Underground facilities at Naumaish M.A Jinnah Road and groundbreaking of BRT Common Corridor from Taj Medical Complex to Municipal Park along M.A.Jinnah Road here today.\nThese projects were part of PM Imran Khan’s envisaged Rs 1.1 trillion Karachi Transformation Plan, he noted.\nHe said that fast pace work was being carried out on all the projects which have to be executed by the Federal Government in Karachi.\nThe K-4 Water project was handed over to WAPDA. WAPDA would soon present its report to the Prime Minister in this regard, he added.\nImran Ismail said that the process to hire a consultant on the K-4 project has been completed and the K-4 would be a big water supply project that would help to a greater extent, cater the water requirement of Karachi.\nImran Ismail said that the Green Line project was a long-awaited project and after its completion, the Orange Line and Blue Line projects would be also launched.\nHe said that he wanted to inform the people of Karachi on behalf of PM Imran Khan that the Premier was worried about the people of the port city and he was taking a keen interest in the development works of Karachi to facilitate the masses.\nPM Imran Khan regularly sent Federal Minister Asad Umar to Karachi to review the progress of ongoing development works, he added.\nHe also congratulated the SIDCL for the dedication,untiring efforts and devotion shown in the execution of the development works.\nThe element of transparency which he said was a dream of Prime Minister Imran Khan, is especially maintained in the execution of the projects.\nHe said that he was very thankful to PM Imran Khan and Federal Minster Asad Umar for taking a personal interest in the development projects of Karachi.\nTo a question, Asad Umar said that no practical development work was done in Karachi in the past but now work was underway on K-4, KCR, cleaning of nullahs, and other projects.\nHe told another questioner that the Karachi Circular Railway (KCR), was a Modern Transport Project of Rs 300 billion.\nThe Federal Minister told a questioner that around Rs 200 including Rs 65 billion in Sindh were distributed among the needy, poor and deserving people through Ehsaas Program.\nSpeaking about the development of the two Islands, Bundoo and Bundal, he said the matter was being discussed with the Sindh Government and development works would be done in Sindh and the people out there would get fruit from it.\nIt might be noted here that the Grade Road Works of BRT Common Corridor Underground facilities at Naumaish M.A.Jinnah Road having three lanes in each direction, 1.3 kilometers length and 30 meters width including service and links roads, footpaths, light poles, decorative poles, median fence and horticulture belts was completed at the cost of Rs 425 million in around two years.\nThe groundbreaking of BRT Common Corridor from Taj Medical Complex to Municipal Park along M.A.Jinnah Road here was also performed on the occasion for the execution of the work on 1.8 kilometers long corridor having five meters width and 200 meters length which was scheduled to be completed by March 2022 at the cost of Rs 2.26 billion.",
  "retrievedAt": "2025-08-11T20:02:35.698Z"
}
