{
  "title": "PM reviews progress of Ravi City, Central Business District projects",
  "link": "https://www.app.com.pk/national/pm-reviews-progress-of-ravi-city-central-business-district-projects-2/",
  "date_published": "2021-07-14T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 14 (APP): Prime Minister Imran Khan on Wednesday said that Ravi City and Central Business District being the government’s major development projects will alleviate population pressure on Lahore city and provide housing to the citizens with world class facilities.\nHe was chairing a review meeting about Ravi City and Lahore Central Business District projects.\nThe meeting was attended by Federal Ministers Shaukat Tarin, Fawad Chaudhry, Ghulam Sarwar Khan, Special Assistant to PM Dr Shahbaz Gill, Chairman Naya Pakistan Housing Authority Lt. Gen. ®  Anwar Ali Haider and concerned senior officers.\nIn addition, Punjab Minister for Housing Mian Mahmood Ur Rasheed, Advisor to Chief Minister Punjab Dr. Salman Shah, Special Assistant to CM Dr. Firdous Ashiq Awan, Chief Executive Officer (CEO) Ravi Urban Development Authority Imran Amin and concerned officials participated through video link.\nThe meeting was briefed in detail about the progress made on Ravi City and was informed that forests would be planted in Jhok, Rakh Munir and Rakh Shaheed according to the policy to prioritize environmental protection in the project.\nCovering an area of ​​30,000 kanals, based on the theme of biodiversity, this urban forest will not only help protect endangered wildlife, but will also serve as a wildlife sanctuary.\nIn addition, a 100-acre knowledge park was being set up where renowned universities will set up their campuses which will not only make the park a center of knowledge and research but will also generate revenue, to  be utilized to sustain the forests.\nThe meeting was further informed that forests would be established and maintained through the latest technology of Bio-carbon Engineering.\nThe Prime Minister directed to ensure the completion of plantation drive during the current monsoon season as it was the most suitable time for growth of the trees.\nThe meeting was also briefed on the establishment of Pakistan’s first Renewable Energy Industrial Estate under the project which, after completion, would help in creating about 5,000 opportunities for small and large scale industries and millions of jobs.\nMoreover, for the first time in the project, waste water treatment plants will be installed at the municipal level.\nThe meeting was also apprised of the progress made in Lahore Central Business District project.\nThe Prime Minister directed to resolve all legal issues related to the project and ensure implementation of all measures within the stipulated time.",
  "retrievedAt": "2025-08-11T20:58:13.549Z"
}
