{
  "title": "Stranded Pakistanis to be brought back, Senate told",
  "link": "https://www.app.com.pk/national/stranded-pakistanis-to-be-brought-back-senate-told/",
  "date_published": "2021-07-14T08:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP): Minster for Aviation, Ghulam Sarwar Khan Wednesday informed the Senate that the government had increased its flights operation for repatriation of stranded Pakistanis from various countries.\nHe was replying to the calling attention notice of Senator Nuzhat Sadiq to draw attention of the Minister for Aviation, towards the difficulties being faced by Pakistanis due to over booking and cancellation of flights of various airlines.\nThe minister said that the flight operation for the repatriation of stranded Pakistanis in different countries was running successfully and assured that action would be taken against the airlines involved in overbooking.\nHe said that any decision about flights at National Command and Operation Centre (NCOC) was made keeping in view the COVID-19 situation in consultation with the Civil Aviation Authority.\nHe said that due to COVID-19 situation, whole tourism sector in the world was under great stress. He added NCOC meets daily to discuss COVID-19 situation and to make important decisions.\nHe said that although flights had to reduce due to Corona situation, but proper arrangements were made for return of all Pakistanis and decision was made to arrange chartered flights particularly in wake of coming Eid.\nHe said that there was a comprehensive flights schedule from July 1st to July 22 and added that 55 flights from Dubai had managed to bring back 11,400 passengers while 14 flights were arranged for Kabul, besides four flights from London and two from Paris for returning back stranded Pakistanis.\nHe said that the process of repatriation of stranded Pakistanis would be carried out through various flights to ensure bringing back stranded Pakistanis in Europe and the Middle East.\nHe said that so far 54,116 stranded Pakistanis had been brought back to the country in a dignified manner from 290 flights. He said those in Europe and the UK were also being transported to the country through chartered flights.\nReplying to a calling attention notice of Senator Mohsin Aziz on poor condition of Burhan-Shah Maqsood Section of Hazara Motorway, Minister of State for Parliamentary Affairs, Ali Muhammad Khan said that 14 new road projects had been started including eight projects in public-private partnership.\nHe said that some major projects including Sialkot-Kharian project, Hyderabad-Sukkur, 129 km Balkasar, Mianwali road project, Kharian-Rawalpindi road, dualization of Mianwali-Muzaffargarh road, Chitral road project- Gilgit-Shandur road, Lodhran-Multan section, Awaran road, Khushab-Awaran road, Rajanpur- D G Khan 122 km road project and dualization of Zhob road.\nHe assured the House that National Highway Authority (NHA) will resolve all issues related with the construction of new roads or up-gradation and directions have been issued to the quarters concerned, he added.\nHe said that an amount of Rs 4,595 million had been recovered with regard to land retrieve. He added present government had collected an amount of Rs139.53 million in its early two and half years against Rs 67.92 million during 2015-18 of Pakistan Muslim League (PML-N) tenure from this sector.",
  "retrievedAt": "2025-08-11T20:58:19.457Z"
}
