{
  "title": "Pakistan needs more trained youth to neutralize hybrid warfare threat: Dr Moeed",
  "link": "https://www.app.com.pk/national/pakistan-needs-more-trained-youth-to-neutralize-hybrid-warfare-threat-dr-moeed/",
  "date_published": "2021-07-14T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP): National Security Advisor (NSA) Dr Moeed Yusuf Wednesday said Pakistan was facing the grave threat of hybrid warfare and needed trained young professionals to neutralize all the negativity against it on different online platforms.\nThe government had successfully executed a number of development projects that needed effective projection through media, he said while addressing a seminar titled “Lawfare Doctrine for Pakistan”, organized here by the Centre for Law and Security (CALS).\nDr Moeed highlighted the important role of universities and colleges in producing a skilled human resource in that field so that it could meet the state’s demand, when arose.\n“If I say that the challenge of hybrid warfare would over soon, it is crazy on my part,” he said while describing ‘lawfare’ its additional part which needed due attention for neutralizing this threat in an effective way.\nHe said the lawfare was a long-term capacity that needed to be produced in the system. Pakistan’s future policy would be based on economic diplomacy, cyber security and public lawfare.\nHe stressed the need to produce 1500-2000 professionals, who should be well-versed in the field; otherwise the country would lag behind in human resource development.\nHe said in the past, there was a reliance on foreign lawyers as far as different components of the lawfare was concerned such as thinking, litigation and intellect. “What else you should do if you do not develop your capacity,” he added.\nHe said there was a lot of effort being made to coordinate the system as regards the lawfare. When there was a new phenomenon, it, obviously, lacked a mechanism for coordination of its system.\n“Because this (lawfare) is a new field, not everybody is clear how they link up lawfare,” he added.\nHowever, he said there was need to coordinate the system of lawfare at one place. A lot of excellent people were doing the work and producing desired results.\nMoeed said there were multiple links to the field, including provincial governments, Foreign Office, National Security Office and others. “How all of this will come together, this is a critical question, and we have done a lot of work on it and we are moving forward,” he added.\nHe stressed that the education system had to take responsibility and develop human resource in that regard.\nIn the recent past, the NSA pointed out that there were litigations and arbitrations, which remained highly successful but were not projected by some elements as they talked of negatives.",
  "retrievedAt": "2025-08-11T20:58:10.913Z"
}
