{
  "title": "Faisal urges to raise awareness on population growth problems",
  "link": "https://www.app.com.pk/national/faisal-urges-to-raise-awareness-on-population-growth-problems/",
  "date_published": "2021-07-14T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP): Special Assistant to the Prime Minister on National Health Services Dr Faisal Sultan on Wednesday urged citizens to take a pledge for making themselves and society aware of the problems arising from the increasing population.\nAddressing a seminar on Population, Dr Faisal Sultan said that it is high time to raise the awareness level of citizens to consider the burden on the country’s resources due to heavy population growth.\nHe said that besides the government it is the responsibility of the society to pass on useful information on family planning so that parents can play their role in the sustainable development of the country while making decisions for adopting a gap in family expansion.\nHe said that desire of having children is the right of every parent but this is also important to consider the resources while planning to expand the family.\nIt is necessary for parents to think over how to manage within available resources to provide basic needs of life including education, food, and shelter to their children for their better grooming and growing, he added.\nFaisal said in order to make a balanced approach and to make their children useful citizens of this country while ensuring the provision of better necessities of life to their children, parents must realize how much resources they have to require for them.\nHe said, “For better grooming and shelter of our children, we should consider this important aspect.” He added adopting a balanced approach to population growth is the best way for ensuring better capabilities in children.\nFaisal said that this increase in population resulted in poor health of mother and child besides facing other issues like a heavy burden on water usage, environment, and all other resources of the country.\nHe said that the increasing population is the root cause of major problems and that population control is the primary condition for the establishment of an organized and progressive society.",
  "retrievedAt": "2025-08-11T20:58:16.721Z"
}
