{
  "title": "Issuance of Succession Certificates from NADRA to reduce 25 to 30 percent pressure on courts",
  "link": "https://www.app.com.pk/national/issuance-of-succession-certificates-from-nadra-to-reduce-25-to-30-percent-pressure-on-courts/",
  "date_published": "2021-07-14T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP): Federal Minister for Law and Justice Barrister Dr Farogh Naseem on Wednesday said that the issuance of Succession Certificate was a state of the art project which would reduce the pressure on the courts by 25 to 30 percent.\nAddressing a ceremony of (National Database and Registration Authority’s (NADRA’s) succession certificate distribution for Punjab, Dr Farogh said that the issuance of succession certificate was a big achievement of the government and it would had far-reaching implications. “People will remember us for launching this system,” he added.\nIt is to mention here that upon death of any family member, legal heir languish in courts for years before they were able to obtain Letters of Administration (for immovable properties) and Succession Certificates (for movable properties).\nNow, under the new law, without going to the court the legal heir could obtain Letters of Administration or Succession Certificates, as the case may be, through a quick five stage process facilitated by Succession Facilitation Units, was operated by the National Database Registration Authority.\nThe Minister paid rich tributes to Prime Minister Imran Khan and said that the credit for this project went to the Prime Minister.\nHe said the scheme was launched in Islamabad two to three months ago, and so far about 350 applications were received whereas 317 legal heirs were issued inheritance certificates.\nDr Farogh said despite the concerns of the legal fraternity, the government launched this scheme and it’s effectiveness would be proved in Punjab which had above 110 million population. He said that the Khyber Pakhtunkhwa provincial assembly had also passed this law.\nHe said that in future, after online verification, succession certificates could be obtained at home.\nBarrister Farough Naseem also paid tributes to Punjab Chief Minister Usman Bazdar, Interior Minister Sheikh Rashid Ahmed, Punjab Law Minister Raja Basharat and NADRA Chairman Tariq Malik for the remarkable work.\nHe said that issuance of inheritance certificates would reduce the pressure of cases on the courts by 25 to 30 percent. Pakistani embassies and missions abroad have teamed up with NADRA to launch it, for which the Foreign Minister and Foreign Secretary deserve acknowledgment, he concluded.",
  "retrievedAt": "2025-08-11T20:58:12.822Z"
}
