{
  "title": "President for enhanced ties with Tajikistan in diverse fields",
  "link": "https://www.app.com.pk/national/president-for-enhanced-ties-with-tajikistan-in-diverse-fields/",
  "date_published": "2021-07-14T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 14 (APP): President Dr Arif Alvi Wednesday underlined the need for enhanced engagements with the Republic of Tajikistan in the areas of trade, defence, energy, tourism and culture.\nHe said Pakistan attached great importance to its relations with Tajikistan which were based on strong historical, religious and cultural links.\nThe president was talking to visiting Defence Minister of Tajikistan, Colonel General Sherali Mirzo, who called on him, at the Aiwan-e-Sadr.\nThe president said Gwadar port and China Pakistan Economic Corridor (CPEC) offered enormous opportunities to regional countries and Tajikistan, in this regard, could benefit of the emerging opportunities by exporting its goods to foreign countries through the Gwadar port.\nHe expressed the hope that the continued interactions between military and defence leadership of the two countries at the higher levels would further expand military cooperation.\nWelcoming the Tajik defence minister, the president emphasised the need for exchanging economic and cultural delegations to expand the volume of bilateral trade as well as cement cultural linkages between the two sides.\nThe president also highlighted the brutalities being committed against the Muslims of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe said that India was involved in hybrid war against Pakistan by using the soil of Afghanistan and supporting militants to carry out terrorist activities in Pakistan.\nRegarding Afghanistan, the president said that Pakistan was making sincere efforts to promote peace and reconciliation in Afghanistan as a peaceful and prosperous Afghanistan was not only in the interest of Pakistan but also of the entire region.\nHe expressed the hope that the visit of Tajik defence minister would further strengthen defence cooperation between the two brotherly countries.\nColonel General Sherali Mirzo emphasized the need for further promoting military and defence relations for the mutual benefit of the two countries.\nHe thanked the government of Pakistan for extending a warm welcome and hospitality during his stay in the country.",
  "retrievedAt": "2025-08-11T20:58:15.688Z"
}
