{
  "title": "Lahore continues to be most polluted city of the world",
  "author": "Imran Gabol",
  "content": "LAHORE: Lahore was enveloped in a thick, hazardous blanket of smog on Monday with real-time data confirming the city had the distinction of being the most polluted city in the world.\n\nAccording to IQAir on Monday evening, Lahore’s air quality index (AQI) soared to a hazardous level of 312, with its concentration of PM2.5 — the most harmful particulate matter — reaching a staggering 190.5 micrograms per cubic meter (56?g/m³). This level is over 25 times the World Health Organisation’s annual air quality guideline.\n\nThe severity of the crisis was not uniform across the city. The real-time station ranking for Lahore painted an even more alarming picture, with several areas crossing into the ‘hazardous’ threshold. The air quality at the City School, Allama Iqbal Town, was catastrophic, recording an AQI of 505, a level considered an emergency health warning. Fauji Fertilizer Pakistan and The City School Shalimar Campus were not far behind, with AQIs of 525 and 366, respectively, indicating that millions of residents in these areas were breathing air of life-threatening quality.\n\nThe smog emergency has effectively placed the entire Punjab on high alert. The national city ranking revealed a grim picture with Pakistani cities, predominantly from Punjab, occupying all top spots. Following Lahore, the cities of Faisalabad (AQI 439), and Multan (AQI 438) at different times of the day, rounded out the top five, all registering air quality classified as hazardous. Other major urban centers like Gujranwala, Bahawalpur, and Sialkot featured prominently on the list, indicating a widespread public health crisis across Punjab’s most populous region.\n\nThe 2024 air quality report, as illustrated by the global ranking, cemented Pakistan’s severe pollution problem. On Monday at 10pm, Lahore (AQI 272) topped the global chart of major cities, surpassing other perennial pollution hotspots like Delhi, India (AQI 220) and Kolkata, India (AQI 170).\n\nThe authorities urged the citizens, especially children, elderly and those with respiratory conditions, to avoid outdoor activities. The combination of calm winds (recorded at 0 km/h in Lahore) and high humidity (50%) has trapped pollutants close to the ground, exacerbating the smog and reducing visibility to near zero in some areas.\n\nThe persistent smog, a toxic mix of vehicle emissions, industrial pollution, and seasonal agricultural burning, has become an annual catastrophe for Lahore, with this year’s data indicating a particularly severe start to the pollution season.\n\nPublished in Dawn, October 28th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68ffe744d1ae7.jpg",
  "retrievedAt": "2025-10-28T18:18:12.397Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951629/lahore-continues-to-be-most-polluted-city-of-the-world",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T00:25:13.000Z"
}
