{
  "title": "At least 6 suspects killed in separate ‘encounters’ in Lahore: CCD",
  "author": "Imran Gabol",
  "content": "At least six suspects were killed in four separate encounters with the Crime Control Department (CCD) in different locations of Lahore late on Monday, the CCD said on Tuesday.\n\nEarlier this year, the Punjab government launched the CCD with a mandate to tackle organised crime, terrorism, and high-profile criminal gangs. Recently, the body has carried out a range of encounters. Officials have publicly praised the department for its successes, claiming it has “significantly reduced street crime and targeted major criminal figures.”\n\nAs per a statement issued by the department’s spokesperson today, “CCD teams conducted four different encounters in Lahore’s Nishtar Colony, Green Town, Harbanspura, and Ring Road, where six suspects were killed.”\n\nIn the first instance, in Nishtar Colony, the CCD team came under attack while they were out to arrest the suspects, the statement said.\n\n“An exchange of fire ensued, leaving two suspects dead by their associates’ fire,” the CCD said, adding that the “deceased had been involved in theft, previous encounters with the police, murder, and attempted murder.”\n\nIn a separate incident that took place in Green Town, a detained suspect was killed by his own associates, it said, adding that two suspects were killed in an encounter on Ring Road as they were attempting to rob citizens, it added.\n\nThe CCD spokesperson said, “The suspects opened fire on the police team. Two were killed while another two managed to escape.”\n\nIn the fourth encounter that took place in the Harbasnpura area, one of the suspects died after sustaining severe injuries during an exchange of fire with the police, the statement said.\n\n“The injured suspect was taken to the hospital, but he succumbed to his injuries,” the CCD added.\n\nThe mounting death toll during the encounters has sparked concerns among legal experts and civil society.\n\nOn October 14, the Human Rights Commission of Pakistan (HRCP) expressed deep alarm at the “growing normalisation” of police encounters, a pattern it says has become entrenched since the establishment of CCD as a special wing of the Punjab Police in February 2025.\n\nThe rights body highlighted that the “trend undermines the rule of law and constitutional guarantees of due process.”\n\nAccording to data compiled by the HRCP, the province has witnessed more than 500 alleged encounters since January 2025, resulting in over 670 fatalities — a figure higher than in any other province.\n\nHuman rights monitors allege that extrajudicial killings are being used as a substitute for the criminal justice system.\n\nCritics argue that the encounters often follow a similar narrative: a suspect is located, they open fire on police, and are subsequently killed in the ensuing shootout, leaving no possibility for arrest, investigation, or trial.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/28183125f3b84f0.webp",
  "retrievedAt": "2025-10-28T18:15:17.404Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951784/at-least-6-suspects-killed-in-separate-encounters-in-lahore-ccd",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T13:41:28.000Z"
}
