{
  "title": "Indian national charged with assault of 2 teens on flight from Chicago: US justice dept",
  "author": "Dawn.com",
  "content": "An Indian national was charged with an assault on a flight travelling from Chicago to Germany, according to a press release issued by the United States Department of Justice (DoJ) on Monday.\n\nThe DoJ stated that Praneeth Kumar Usiripalli, 28, stabbed two teenagers with a metal fork and was arrested on October 25 after the flight was diverted to Boston. He was charged in the US District Court with one count of assault with a dangerous weapon with intent to do bodily harm.\n\n“According to the charging documents, on October 25, 2025, while on board Lufthansa flight 431 en route from Chicago to Frankfurt, Germany, Usiripalli allegedly stabbed a 17-year-old male passenger (Minor A) in the shoulder area with a metal fork,” the statement read. “Usiripalli then allegedly stabbed a second 17-year-old male passenger (Minor B) in the back of the head with the same metal fork.”\n\nThe DoJ said that when flight crew members attempted to subdue Usiripalli, he reportedly raised his hand, formed a gun with his fingers, put it in his mouth and pulled an imaginary trigger.\n\n“Immediately afterwards, Usiripalli allegedly turned toward a female passenger to his left and slapped her with his hand. Usiripalli also allegedly attempted to slap a flight crew member,” the statement read.\n\n“As a result of the disturbance, the flight was diverted to Boston Logan International Airport, where Usiripalli was immediately taken into custody.”\n\nThe department added that while Usiripalli was admitted to the US on a student visa, it added that he presently does not have any legal status in the country.\n\n“The charge of assault with a dangerous weapon with intent to do bodily harm while travelling on an aircraft in the special aircraft jurisdiction of the United States provides for a sentence of up to 10 years in prison, up to three years of supervised release, and a fine of up to $250,000,” the statement read.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/281931528503e14.webp",
  "retrievedAt": "2025-10-28T18:15:50.116Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951789/indian-national-charged-with-assault-of-2-teens-on-flight-from-chicago-us-justice-dept",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T14:36:39.000Z"
}
