{
  "title": "Israel’s Netanyahu orders immediate ‘powerful strikes’ on Gaza: PM’s office",
  "author": "AFP",
  "content": "Israeli Prime Minister Benjamin Netanyahu on Tuesday ordered the military to carry out intense strikes on the Gaza Strip, after accusing Hamas of violating the US-brokered ceasefire.\n\n“Following security consultations, Prime Minister Netanyahu instructed the military to immediately carry out powerful strikes in the Gaza Strip,” a statement from his office said.\n\nThis development came after the Israeli military accused Hamas of staging its search for the remains of a Gaza captive’s body, one of 28 the group had agreed to hand over under a ceasefire deal.\n\n“Yesterday (Monday) Hamas operatives were documented removing body remains from a structure that had been prepared in advance and burying them nearby,” the military said in a statement, attaching drone footage which it said showed the act.\n\nThe aerial footage shows three individuals exiting a damaged Gaza building holding what could be a body wrapped in a white sheet. The individuals then bury the body moments before a bulldozer parked nearby uncovers it again.\n\n“The Hamas terrorist organisation summoned representatives of the Red Cross and staged a false display of discovering a deceased hostage’s body,” the military statement said.\n\nThree people wearing red vests appear in the video, which AFP was unable to independently verify. The military did not specify the location of the footage, which was filmed on Monday.\n\n“This footage clearly shows that the Hamas terrorist organisation is attempting to create a false impression of efforts to locate the bodies, while in fact holding deceased hostages whose remains it refuses to release as required by the agreement,” the statement said.\n\nThe statement came as Israel accused Hamas of breaking the terms of the US-brokered ceasefire.\n\nHamas handed over what it said was the body of a 16th captive on Monday, but Israeli forensic examination determined Hamas had in fact handed over partial remains of Ofir Tzarfati — whose body had already been brought back to Israel around two years ago, according to a statement from Prime Minister Benjamin Netanyahu’s office.\n\n“I can confirm to you today that Hamas dug a hole in the ground yesterday, placed the partial remains of Ofir inside of it, covered it back up with dirt, and handed it over to the Red Cross,” government spokeswoman Shosh Bedrosian told journalists Tuesday.\n\nHamas says it is committed to the ceasefire terms, but lacks the equipment needed to locate and excavate captives’ bodies, potentially buried under buildings collapsed by air strikes.\n\nThe military’s Tuesday statement said the equipment Hamas asked for was “clearly unnecessary for the transfer of remains, and therefore these claims do not constitute an obstacle to the return of the remaining deceased hostages”.\n\nHamas said it was Israel who prevented it from carrying out its search for bodies, and accused it of fabricating “false pretexts in preparation for taking new aggressive steps against our people”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2822055726645f5.webp",
  "retrievedAt": "2025-10-28T18:27:18.596Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951802/israels-netanyahu-orders-immediate-powerful-strikes-on-gaza-pms-office",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T17:29:18.000Z"
}
