{
  "title": "Mother of slain journalist Arshad Sharif passes away",
  "author": "Dawn.com",
  "content": "Riffat Ara Alvi, the mother of slain journalist Arshad Sharif, passed away on Sunday, according to her family.\n\nArshad, a prominent journalist who was awarded the Pride of Performance in 2019 by then-President Arif Alvi, was shot dead in Kenya on October 24, 2022. Politicians and media bodies demanded a probe into his death, but the lack of progress in the investigation has been decried by the Supreme Court and media.\n\n“Arshad Sharif’s mother, who was demanding justice for her son, has passed away,” the deceased journalist’s wife, Javeria Siddique, posted on X today.\n\nIn a subsequent post, she said Riffat’s funeral prayers would be held today at the “H-11 graveyard [in] Islamabad at 9pm”.\n\nSiddique, herself a journalist, in 2023 published a piece for Dawn.com on her husband’s death in which she called for an “independent, impartial, and immediate investigation” to ensure justice for Sharif.\n\n“Everyone is watching, and yet, justice only seems to become more and more elusive,” she said in the article.\n\nPPP Chairman Bilawal Bhutto-Zardari expressed grief over the passing of Alvi.\n\n“I am saddened by the passing of Arshad Sharif’s mother and pray for the forgiveness of the deceased,” a post on PPP Media Cell’s X account quoted Bilawal as saying.\n\nFormer human rights minister Shireen Mazari rued that Riffat “kept asking for justice till the very end but to no avail”.\n\n“Cruel apathy of the judiciary,” she commented in a post on X.\n\nCorrection: This story previously incorrectly stated that Arshad Sharif was awarded the Pride of Performance in 2022. However, he was given the award in 2019. The error is regretted and has been corrected.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26150104e68c1c5.webp",
  "retrievedAt": "2025-10-28T18:19:19.538Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951357/mother-of-slain-journalist-arshad-sharif-passes-away",
  "dateList": "2025-10-28",
  "date_published": "2025-10-26T10:06:12.000Z"
}
