{
  "title": "Messi eyes 2026 World Cup despite age and fitness concerns",
  "author": "Reuters",
  "content": "Lionel Messi, still chasing international glory nearly two decades into his career, says he hopes to play at the 2026 World Cup in North America, acknowledging his age and fitness will dictate his role in defending Argentina’s 2022 title.\n\nThe Argentine great recently extended his contract with Major League Soccer side Inter Miami through 2028, signalling he is not yet considering retirement despite turning 39 next June.\n\nSpeaking to NBC News, the eight-time Ballon d’Or winner said he will take time next year to assess his physical condition before deciding whether to play in the tournament across the United States, Mexico, and Canada.\n\n“It’s something extraordinary to be able to be in a World Cup, and I would love to,” the Argentine captain said in the interview released on Monday.\n\n“I would like to be there, to be well and be an important part of helping my team, if I am there. I’m going to assess that on a day-to-day basis when I start preseason next year with Inter (and see if I can really be 100 per cent, if I can be useful and then make a decision.\n\n“I’m really eager because it’s a World Cup. We’re coming off winning the last one, and being able to defend it on the field again is spectacular because its always a dream to play with the national team.”\n\nMessi has enjoyed a professional career spanning more than 20 years, debuting for Barcelona at just 17 in 2004 before playing for Paris St Germain and joining Inter Miami in 2023. He sparked fresh interest in the American league in a critical moment for the sport in North America ahead of hosting next year’s World Cup.\n\nWhile Messi has amassed countless club and individual accolades, international success had eluded him until claiming the 2021 Copa America before beating France 4-2 on penalties to win the 2022 World Cup in Qatar.\n\n“It was the dream of my life,” Messi said of the victory.\n\n“It was also true that it was the only thing missing at a professional level because I had been lucky enough to have achieved everything at an individual level, at a team level with Barcelona, and I think that’s every player’s dream.\nWhen you ask a player what their dream is, its to be world champion.”\n\nMessi has played in 195 matches and scored a record 114 goals for his country. A return for the 2026 World Cup would mark his sixth appearance in the tournament.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/28120851899cfbb.webp",
  "retrievedAt": "2025-10-28T18:16:48.380Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951755/messi-eyes-2026-world-cup-despite-age-and-fitness-concerns",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T07:12:12.000Z"
}
