{
  "title": "Dengue claims lives of girl, man in Karachi",
  "author": "Faiza Ilyas",
  "content": "KARACHI: Two more lives have recently been lost to dengue, raising the total number of officially declared deaths from the mosquito-borne viral infection in the province to three, it emerged on Monday.\n\nSources said that the victims — a four-year-old girl who died at the Sindh Institute of Child Health and Neonatology (SICHN) and a man in his 50s — were residents of Karachi.\n\nThe girl, the sources said, was brought in critical condition from Korangi to the hospital on October 17 and immediately admitted to the paediatric intensive care unit. She died of capillary leak syndrome, a hallmark of severe dengue.\n\nSpeaking to Dawn, Deputy Director General Vector-borne Diseases, Sindh, Dr Mushtaq Ali Shah confirmed the deaths.\n\n“We are investigating the reported deaths. Often, patients have medical conditions that coexist alongside a primary diagnosis (and are the actual cause of death),” he said.\n\nExplaining it further, he referred to the first death recorded from dengue in Hyderabad this year in July. “Now, we know that the [pregnant] woman actually died of postpartum haemorrhage [severe bleeding after childbirth],” Dr Shah said, adding that investigations into her case indicated that her haemoglobin level was too low.\n\n“But, she was dengue positive as well. Unfortunately, there is a dearth of public awareness on vector-borne infections that could be easily prevented through effective vector control measures at the household and community level,” he added.\n\nThere has been an alarming increase in dengue cases, especially in Karachi and Hyderabad, in recent weeks.\n\nWhile the provincial health department puts the total number of dengue cases in Sindh this year at 1,083, figures obtained by three major Karachi hospitals and one public sector laboratory and its branches in Hyderabad suggest that the actual number exceeds 12,000 in a short span of just six weeks.\n\nDengue, a mosquito-borne viral infection transmitted by the Aedes aegypti mosquito, remains a recurring health concern in Sindh — particularly during the monsoon season when stagnant water and poor sanitation accelerate its spread. The illness causes high fever and, in severe cases, can lead to life-threatening complications.\n\nPublished in Dawn, October 28th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/28092823c5f9bb7.webp",
  "retrievedAt": "2025-10-28T18:18:12.083Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951664/dengue-claims-lives-of-girl-man-in-karachi",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T00:25:08.000Z"
}
