{
  "title": "A false binary",
  "author": "Umair Javed",
  "content": "PUBLIC debate on key issues related to politics, law and order, and national security seems to be stuck in a perpetual loop. In the last 10 or so years, we’ve had pretty much the same conversation on what to do with the TLP, what to do with ethnic secessionism, what to do with religious fundamentalism, what to do with the TTP, and what to do with a restive western border. In fact, some of these issues have been debated for much longer than a decade.\n\nThe repetitiveness also demonstrates the protracted nature of these problems. Multiethnic societies of all types, especially in the developing world, have struggled with questions of political stability.\n\nSimilarly, there is hardly any country where tradition, in name or content, hasn’t been repurposed in modernity for the sake of fundamentalist ideology that explicitly tries to change the nature of culture, law, society and the state, usually in the name of religion. In fact, in nearly every Middle Eastern country for much of the past half a century, the principle opposition to the state was from religious forces, which in some cases even won out (Iran, Syria being prominent examples of the latter).\n\nAll of this is to say that the political problems Pakistan faces are simultaneously complex as well as common. Categorical and straightforward solutions are hard to find. Anyone suggesting a quick fix is likely oversimplifying the problem.\n\nBut this is not to say that reasoned debate and analysis are not possible. The starting point for any question that (famously) asks ‘what is to be done?’ has to be ‘why does it need to be done?’. Answering this too is not straightforward but at least it gives us a framework that sets a clear target, destination or aspiration.\n\nThe debate on what to do with the TLP and TTP is currently caught in a bizarre binary.\n\nFor the modern state, legitimate aspirations are usually enshrined in its constitution. Whether or not the state adheres to it is a separate matter, but in the absence of any other categorical answer, there is no other starting point.\n\nThe Pakistani Constitution lays out a vision of what the state looks like and what capabilities and rights it wishes to grant its citizens. While it frequently fails at fulfilling this vision, there is a basic republican ideal enshrined within, which recognises citizen equality and the right to life and liberty. The conversation around any political problem needs to use this as its starting premise.\n\nAmong the many problems the country is currently dealing with, the TLP and TTP offer two varying dimensions of the same one. The debate on what to do with them is currently caught in a bizarre binary of ‘operations/ violence’ vs ‘talks/ negotiations’. This binary is both meaningless and unproductive.\n\nThe ideological vision of both organisations represent a sharp divergence from the ideals put forward by the state itself (through its Constitution). The Taliban seek to disenfranchise half the population and confine them to a heavily regulated private sphere, while the TLP leans on religious ideals to ‘purify’ society from minority and heterodox faith. Both rely on privatised violence and neither is compatible with the constitutional terms laid out by the mainstream political process.\n\nAny negotiation with these organisations shou­­ld never concede on these two basic points — citizenship rights of women and minorities. Granting territorial autonomy in the newly merged districts of ex-Fata, or allowing hate-speech and violence against religious minorities to proceed unencumbered are non-starters. If preventing these require violence, the state will have no option but to rely on it.\n\nBut many proponents of the state’s ad hoc strategy seem to stop here. Territorial integrity and the use of violence is put forward as the sole solution, even when the problem emerges from more than just a failure of law and order (in the case of TLP) or a failure of the state to retain its monopoly on legitimate violence (in the case of TTP).\n\nBoth organisations are outputs of deeper social and political processes. They exercise a degree of legitimacy, at least among their members, and are connected to wider issues, including but not limited to geopolitical conflicts, globalisation and urb­­anisation, and economic and social inequality.\n\nThe conditions that lead to the creation of violent actors cannot be undone merely through violence. But neither can it be undone through sporadic ‘talks’ or ‘negotiations’, which some believe is a ‘political solution’ to the problem. Such a proposal is akin to relegating the entire issue to the domain of conversation; that somehow the other side can be convinced of the futility or error of their violent ways.\n\nInstead, any solution that is sustainable and lasting has to be one that challenges their societal foundations and legitimacy. This is what would be a truly political solution to the problem. And this is precisely where the state has failed, either through its expediency or through its actions serving other ends.\n\nIn merged districts, the state has undermined its own legitimacy by frequently intervening in and suspending the political process. It has quelled alternative and even mainstream popular movements for representation and rights in favour of cultivating strategic assets (that have now proven to be non-strategic liabilities). It has forgone the process of effective state-building and development, choosing instead to see the area from a geopolitical and border-management perspective.\n\nIn its ongoing conflict with the popularly elected representatives of KP, the state has created a situation where justifiable use of force is being widely called into question. The entire debate has thus predictably devolved back to the false binary of operation versus negotiation, when neither offers a viable, stand-alone answer to the problem. The real path out of the quagmire is one that restores legitimacy to the state and the political process, but it seems there are no takers for this solution.\n\nThe writer teaches politics and sociology at Lums.\n\nPublished in Dawn, October 27th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68fec0a87e56b.png",
  "retrievedAt": "2025-10-28T18:20:12.681Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951526/a-false-binary",
  "dateList": "2025-10-28",
  "date_published": "2025-10-27T00:52:32.000Z"
}
