{
  "title": "Libyan boat capsize tragedy: Two human traffickers handed down 20-year rigorous imprisonment, Rs1.4m fine each",
  "author": "Waseem Ashraf Butt",
  "content": "GUJRAT:  A special court of Gujranwala on Monday awarded 20-year rigorous imprisonment, along with Rs1.4 million fine each to two  human traffickers who had illegally sent a youth to Libya who later went missing in 2023 boat capsize tragedy.\n\nThe third accused in the case has already been convicted.\n\nAccording  to the prosecution, case number 203/23 was lodged on June 2, 2023 with the Federal Investigation Agency  (FIA) under sections 3, 6 of the Prevention of Smuggling of Migrants of Act (PSMA) 2018, and 17/22 of Emigration Ordinance (EO) 1979, against the three convicts — Nadim Aslam, Muhammad Aslam (also placed on Red Book 2023) and  Muhammad Mumtaaz.\n\nThe convicts extorted Rs2.3 million from the complainant  to send his nephew to Italy for employment via Libya, who later went missing in a boat capsizing incident in 2023.\n\nThe FIA’s Gujranwala circle had lodged the case and arrested them and submitted the case challan in the court.\n\nOn the conclusion of case proceedings, the court handed down 20-year rigorous imprisonment, along withRs1.4m fine, each to the convicts Nadeem Aslam and Muhammad Aslam after charges were proved against them. The third suspect, Mumtaz, has already been convicted in the same case.\n\nOFFLOADED: FIA Immigration authorities offloaded at least three Tajikistan-bound passengers from a flight at the Sialkot International Airport as they allegedly intended to ultimately reach Italy via Libya through an agent.\n\nAn FIA  official says the passengers — Sulman Zulfiqar, Naeem Khan and  Niaz Wali — intended to travel to Tajikistan on tourist visas by flight No FZ315.\n\nDuring immigration clearance, the three passengers could not justify the purpose of their travel.\n\nOn being quizzed by the immigration officials, they revealed that they paid a total sum of Rs10m to an agent to reach Italy through Libya.\n\nThe official says that on scrutiny of their WhatsApp data, their intention to ultimately reach Italy via Libya was evident. Hence, the passengers were offloaded and handed over to the FIA’s Gujranwala circle for further legal action.\n\nFOUND HANGED: The body of a sweeper, who had gone missing four days ago, was found hanging with a rope in a storeroom on the roof of the Gujranwala district courts building.\n\nReports say that Sufian, who was employed as a sweeper in the Gujranwala district courts, had gone missing on Thursday the last.\n\nHis family lodged a kidnapping complaint with the area police.\n\nHowever, on Monday, Sufian’s body was found hanging with a rope from the ceiling of a storeroom located on the roof of the court building.\n\nOn being called, A team of Civil Lines police reached the spot and shifted  the body to the district headquarters hospital, where doctors later conducted autopsy.\n\nThe body was then handed over the family of the deceased.\n\nA team of Punjab Forensic Science Agency (PFSA) also collected evidence from the scene.\n\nA police team has been constituted to probe the matter.\n\nPublished in Dawn, October 28th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2809515966bcea4.webp",
  "retrievedAt": "2025-10-28T18:18:11.671Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951634/libyan-boat-capsize-tragedy-two-human-traffickers-handed-down-20-year-rigorous-imprisonment-rs14m-fine-each",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T00:25:13.000Z"
}
