{
  "title": "9 NCCIA officials booked for ‘extorting money’ from Ducky Bhai’s family; 6 remanded in FIA custody",
  "author": "Rana Bilal",
  "content": "A Lahore court on Tuesday granted the Federal Investigation Agency (FIA) a three-day physical remand of six National Cyber Crime Investigation Agency (NCCIA) officials in a case registered against them for allegedly misusing their authority, extorting money and taking bribes.\n\nThe first information report (FIR) of the case has been registered with the FIA Anti-Corruption Circle Lahore on the complaint of Aroob Jatoi, the wife of YouTuber Saadur Rehman alias Ducky Bhai, who has been arrested in a case pertaining to promoting gambling apps on social media.\n\nThe FIR, a copy of which is available with Dawn.com, was registered a total of nine individuals, including eight NCCIA officials, at 7:35pm yesterday. Among them, the six remanded in the FIA custody were said to be missing for several days before the FIA announced their arrest yesterday.\n\nMeanwhile, the whereabouts of another official nominated in the case — Muhammad Usman, the NCCIA deputy director of operations in Islamabad — have also been unknown for several days.\n\nLahore NCCIA’s Additional Director Sarfraz Chaudhry, Lahore NCCIA Deputy Director (acting in-charge) Zawar Ahmad, Lahore NCCIA Sub-Inspector Ali Raza, Lahore NCCIA Assistant Director Shoaib Riaz, Lahore NCCIA Sub-Inspector Yasir Ramzan and Lahore NCCIA Assistant Director Mujtaba Zafar are the six officials about whom it emerged yesterday that they had been arrested by the FIA.\n\nThey were presented before a district court in Lahore today.\n\nThe officials were brought to the court in handcuffs.\n\nAt the hearing, the FIA sought their physical remand from Judicial Magistrate Naeem Wattoo for further investigation.\n\n“The suspects have to be interrogated,” the FIA’s lawyer contended.\n\n“Till now, what have you found during the probe, on the basis of which you arrested the officials?” Justice Wattoo enquired.\n\nThe FIA’s lawyer replied that the probe was still under way.\n\nFor his part, the officials’ lawyer, Mian Ali Ashfaq, said details should be shared about the number of FIRs registered against the suspects.\n\nAt that, the FIA informed the court that the officials were nominated in just one FIR.\n\nFollowing that, Ashfaq contended as per NCCIA rules, any action against an 18-grade officer was to be initiated after the director general’s permission. “Sarfraz is an officer, and permission has not been sought from the NCCIA for action against him.”\n\nHe further argued that when Aroob Jatoi had “given a bribe”, why did the FIA not register a case against him. On the other hand, a case against the NCCIA officials was registered within 20 minutes, he said.\n\nAccording to the FIA’s application submitted in the court, a copy of which was seen by Dawn.com, the officials were arrested on October 27.\n\nThe agency sought a 14-day physical remand of the officials, as per the document. However, after arguments by lawyers from both sides and reserving its verdict, the court granted the FIA physical custody of the officials for three days.\n\nJudge Wattoo ordered the FIA to present the NCCIA officials before the court on October 31 (Friday).\n\n“There is material at this stage against accused Shoaib Riaz Muhammad Sarfaraz Chaudhary in the shape of a private person’s complaint, statement and detail of cheques, amount etc, which shows that further remand should be given for recovery and completion of investigation of first group of accused,” the order read.\n\nReferring to the FIA’s request regarding the “second group of accused Zawar Ahmad, Ali Raza, Yasir Ramzan and Mujtaba Zaffar”, the judge noted: “Statements are on record in which detail is mentioned that how much amount and when it was collected and how it was paid as illegal gratification to high-ups.\n\n“Said entitles at this stage to give remand to probe further. It looks [like a] deep-rooted matter,” the order said, adding that the investigation officer’s contentions to the extent of the second group of suspects were also plausible.\n\nBefore the hearing, another lawyer representing the six NCCIA officials, Barrister Mian Ali Ashfaq, had submitted an application to the judicial magistrate, seeking his clients’ production before the court.\n\nThe application, a copy of which is available with Dawn.com, stated that the officials had been formally arrested by the FIA’s Lahore Anti-Corruption Circle.\n\n“Since their arrest, neither the family nor the legal counsels are allowed to meet with the suspects; so much so, FIA officials have also refused to issue [a] copy of [the] first information report (FIR) in which the aforementioned suspects’ arrest has been caused, which is a glaring violation of all the settled norms and principles of fair investigation and fair trial as guaranteed under Article 10A of the Constitution of Islamic Republic of Pakistan, 1973 and also the violation of Police Rules, 1934 and Police Order, 2002; as well as different standard operating procedures (SOPs) issued by the department,” the application read.\n\nIt highlighted that the relevant investigating officer or investigation agency was bound to produce arrested individuals before the competent court within the first 24 hours of detention.\n\n“However, in a design, and manner, the suspects are arrested, kept and not being allowed to meet with family members as well as their legal counsels, it is seriously apprehended that the suspects may not be produced before this honorable court which equates to illegal confinement for a longer period and such action on part of [the] investigation officer is a sheer violation of Section 167 of the Criminal Procedure Code, 1898 and Articles 10 and 10A of the Constitution of Islamic Republic of Pakistan, 1973 as well as Police Rules, 1934 and Police Order, 2002.\n\n“That the above highlighted unlawful actions, on part of the police, are not only violative of Articles 4, 9, 10, 10A, 13 and 14 of the Constitution of Islamic Republic of Pakistan, 1973 with respect to right of individuals to be dealt in accordance with law etc., security/ liberty of person, safeguards [against] arrest and detention, right to fair trial, protection against self-incrimination and inviolability of dignity of man etc., but also very inhuman as being against the basic human rights,” the application stated.\n\nIt added that courts were the “guardian[s] of liberty of citizens and the abuse of power to rope innocent people in order to humiliate them should equally be kept under scrutiny and such unlawful actions should be curbed”. The application further mentioned that the right of liberty was one of the “most precious rights”, which had been guarded by the Constitution and courts.\n\nIn the application, the lawyer sought the court’s directives for the FIA Anti-Corruption Circle Lahore deputy director and the FIA director for Lahore to produce the NCCIA officers before it at the earliest in the “supreme interest of justice, equity and fairplay”.\n\nMeanwhile, it emerged late last night that the NCCIA officials had been nominated in an FIR registered on the complaint of Aroob Jatoi.\n\nApart from the six officials in the FIA custody and Islamabad NCCIA’s Muhammad Usman, Islamabad NCCIA Deputy Director Ayaz Khan and a person named Salman Aziz have also been nominated in the case.\n\nThe FIR has been registered under Sections 109 (punishment for abetment if the act abetted is committed in consequence and where no express provision is made for its punishment) and 161 (public servant taking gratification other than legal remuneration in respect to an official act) of the Pakistan Penal Code, read with Section 5(2)47 of the Prevention of Corruption Act, which deals with criminal misconduct by public servants.\n\nIt stated that the NCCIA had arrested Rehman alias Ducky Bhai, and the inquiry into his case was assigned to Lahore NCCIA Assistant Director Shoaib Riaz.\n\nThe FIR said it was found during the inquiry that Riaz “misused his authority” to “extort Rs9m” through his frontmen from Rehman’s family. It was further alleged in the FIR that Riaz also colluded with Rehman’s lawyer, Chaudhry Usman, for this purpose.\n\nAccording to the FIR, Riaz extorted Rs6m on the pretext of “providing relief to Aroob Jatoi” and another Rs3m for Rehman’s judicial remand, who had been on physical remand.\n\nIn August 2025, Riaz extorted Rs6m in cash through his frontman, Salman Aziz, in Sheikhapura, while the remaining Rs3m was obtained via three cheques of Rs1m each through another frontman identified as Shehbaz, the FIR alleged.\n\nIt added that Riaz gave Rs5m to a friend of Lahore NCCIA Deputy Director (acting in-charge) Zawar Ahmed’s for safekeeping while Rs500,000 was given to Salman Aziz, lawyer Chaudhry Usman and Additional Director Sarfaraz each.\n\nRiaz himself kept Rs2m, the FIR said, adding that it was also found during the inquiry that he had transferred $326,420 from Rehman’s account to his own via Binance.\n\n“During the inquiry, the suspects were found guilty of deceiving detained Saadur Rehman’s family about providing him relief and misusing their authority,” the FIR stated. “It was also found during the inquiry that the suspects were operating as a network and misusing their authorities, taking bribes in cash monthly for facilitating call centres, aggregate companies and individuals involved in online fraud. After keeping their shares, they would give the rest of the amount to the higher-ups.”\n\nOfficers at the NCCIA headquarters were sent these amounts via Muhammad Usman, the NCCIA deputy director operations in Islamabad, and Islamabad NCCIA Deputy Director Ayaz Khan, according to the FIR. Sarfaraz and Zawar in Lahore would hand over Rs 1m to the two officials in Islamabad almost every month, and the latter would then transfer it to the higher-ups, the FIR said.\n\nIt added that FIA’s Lahore Anti-Corruption Circle Assistant Director Syed Zainul Abideen had been assigned the investigation of the case.\n\nAmong the six NCCIA arrested officers, Additional Director Sarfraz was reportedly removed over different controversies last month and asked to report to the NCCIA headquarters, Islamabad. He said he was transferred to the headquarters and he had sought a six-month leave.\n\nThe three controversies were about laying hands on a number of YouTubers/social media influencers, including Saadur Rehman, popularly known as Ducky Bhai and Rajab Butt, for their alleged involvement in unregulated online trading and online gambling apps.\n\nThe other was the registration of a case against some lawyers who allegedly tried to get a suspect released from the NCCIA. The third controversy related to a tiff between a group of Lahore’s journalists and a serving deputy inspector general of police and some other police officials, as the former moved the NCCIA to act against the latter. According to an official, Chaudhry was transferred in light of different complaints against him.\n\nWhen approached for comment previously, an NCCIA spokesperson had declined to comment on the missing officers, terming it a “serious matter”.\n\nHowever, sources had told Dawn that the officers’ disappearance was linked to their investigations into social media influencers and their financial crimes.\n\nOn Friday, the Islamabad High Court had granted the police one more week to trace missing NCCIA Deputy Director Muhammad Usman, who has been missing for several days. The development came during the hearing of a petition filed by Rozina Usman for the recovery of her husband. She alleged that four armed individuals abducted her husband on October 14.\n\nThe court was also informed that the petitioner had herself gone missing after initiating the case. The development had prompted the court to seek an updated report from the police on both disappearances.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/281122278c2c4c3.webp",
  "retrievedAt": "2025-10-28T18:17:13.076Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951752/9-nccia-officials-booked-for-extorting-money-from-ducky-bhais-family-6-remanded-in-fia-custody",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T06:34:17.000Z"
}
