{
  "title": "AJK PM’s ‘days numbered’ as allies close ranks",
  "author": "Iftikhar A. Khan",
  "content": "• PML-N to support PPP in potential no-trust vote against AJK premier, but won’t join govt\n• Insiders say Haq likely to resign seeking ‘honourable exit’, sit on opposition benches\n\nISLAMABAD: Azad Jammu Kashmir Prime Minister Anwarul Haq’s days seem to be numbered, as the coalition partners in the federal government — the PPP and the PML-N — ratchet up pressure on the embattled premier to step down from the post, or face a no-confidence motion in the assembly.\n\nThe coalition partners met at the Presidency on Monday to discuss possible options for the formation of the AJK government to be led by the PPP. The PML-N panel, led by Ahsan Iqbal and comprising Rana Sanaullah and Amir Muqam, called on President Zardari to discuss the AJK affairs with the PPP in light of the current situation.\n\nTalking to reporters after the meeting, PML-N leader Ahsan Iqbal said his party would support the no-trust motion against the AJK PM but would not become part of the government. He said the PPP will form the government after the success of the no-confidence motion, while they would sit on the opposition benches.\n\nPM’s aide Rana Sanaullah said the PML-N’s parliamentary party has expressed distrust over the incumbent AJK government. He said the current AJK government failed to perform its duties, adding that free and fair elections would be held in the region after completion of the AJK assembly’s term next year.\n\n“The incumbent government has become a problem itself instead of a problem-solver,” PPP’s Qamar Zaman Kaira said. Mr Kaira slammed PM Haq’s administration and said political stability in AJK was the need of the hour.\n\nHe also welcomed the PML-N’s decision, which further strengthened the PPP’s position to oust the sitting premier. Mr Kaira said that both sides respected each other’s decisions as they aimed to bring political stability to the region.\n\nThe PPP has 27 members in the AJK Legislative Assembly after 10 lawmakers joined the party on Sunday, and with the PML-N’s backing, it has garnered the support of at least 36 lawmakers to oust the incumbent premier. The PPP also claims Sardar Atiq of the Muslim Conference and Sardar Hasan Ibrahim of the Jammu Kashmir Peoples Party will also support it.\n\nThe AJK Legislative Assembly has 52 members and to achieve a simple majority, a party requires the support of 27 members. In light of this situation, sources said the incumbent PM was advised to opt for an “honourable exit” as he had lost the support of the majority.\n\nWith the PPP having 27 members in the house, he has three options: dissolve the assembly to prevent the party from coming to power, step down, or face a no-trust vote.\n\nThe final decision, however, will be taken today (Tuesday), but the premier is likely to step down, the source added. He also dispelled the impression that the PM was waiting for the announcement of a nominee for the coveted slot in the hope that such a decision would polarise the alliance against him.\n\nThe source further said that PM Haq and his six associates would sit on the opposition benches after he quits.\n\nPublished in Dawn, October 28th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/28075033669c8f7.webp",
  "retrievedAt": "2025-10-28T18:17:29.585Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951719",
  "dateList": "2025-10-28",
  "date_published": "2025-10-28T02:40:53.000Z"
}
