{
  "title": "Trump dismisses 2028 VP run as ‘too cute,’ leaves door open to third term",
  "author": "Reuters",
  "content": "United States President Donald Trump on Monday ruled out running for vice president in the 2028 election but declined to definitively say he would not seek a third term, keeping alive speculation about how he might seek to extend his time in office.\n\nTrump has repeatedly flirted with the idea of serving beyond the constitutionally mandated two terms, joking about it at rallies and teasing supporters with “Trump 2028” hats. Some allies have taken those signals seriously, suggesting that they are exploring legal or political pathways to make it happen — a possibility dismissed by most constitutional scholars.\n\nThe 22nd amendment to the US constitution bars anyone from being elected to the presidency a third time.Advertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\nSome supporters have suggested that one way around the prohibition would be for Trump to run as vice president, while another candidate stood for election as president and resigned, letting Trump again assume the presidency.\n\n“I’d be allowed to do that,” Trump said today in an exchange with reporters aboard Air Force One as he flew from Malaysia to Tokyo.\n\nBut he added: “I wouldn’t do that. I think it’s too cute. Yeah, I would rule that out because it’s too cute. I think the people wouldn’t like that. It’s too cute. It’s not — it wouldn’t be right.”\n\nScholars say Trump is barred from running for vice president because he is not eligible to be president.\n\nThe 12th amendment to the US constitution reads, “No person constitutionally ineligible to the office of president shall be eligible to that of vice-president of the United States.”\n\nReferring to the possibility of a third term, Trump said: “I would love to do it. I have my best numbers ever.”\n\nWhen pressed by a reporter whether he was not ruling out a third term, he said, “Am I not ruling it out? I mean you’ll have to tell me.”\n\nAsked about whether he would be willing to fight in court over the legality of another presidential bid, Trump responded, “I haven’t really thought about it.”\n\nTrump, 79, would be 82 in 2028 if he sought another term, which would make him the oldest US president in history. Despite his age, he has maintained a rigorous public schedule, frequently engaging with reporters even during long international trips, underscoring his stamina and active involvement in daily presidential duties.\n\nThroughout the 2024 campaign, Trump made former president Joe Biden’s advanced age a focal point, often highlighting verbal and physical missteps as evidence that his Democratic rival was too old to effectively lead the country.\n\nTrump also said Vice President JD Vance and Secretary of State Marco Rubio were “great people” who could seek the presidency in 2028.\n\n“I think if they ever formed a group, it’d be unstoppable,” he said. “I really do. I believe that.”\n\nRubio, standing behind Trump in the plane cabin, chuckled and bowed his head sheepishly as Trump predicted a bright political future for him and nodded when Trump brought up Vance.\n\nTrump’s statements about a third term have muddied the Republican Party’s future, with jockeying already under way among potential Republican successors even as some Trump allies back the idea of him remaining in office.\n\nIn an interview last week with The Economist, Steve Bannon, the pro-Trump podcaster who briefly served as Trump’s White House chief strategist in his first term, said there was a plan to circumvent the 22nd amendment and suggested he was involved in developing it.\n\n“Trump is going to be president in ’28, and people ought to just get accommodated with that,” Bannon said. “At the appropriate time, we’ll lay out what the plan is. But there is a plan.”\n\nHe added that Trump was an “instrument of divine will”, echoing language Trump himself has occasionally used.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/271655107432e9f.webp",
  "retrievedAt": "2025-10-28T18:19:26.597Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951573/trump-dismisses-2028-vp-run-as-too-cute-leaves-door-open-to-third-term",
  "dateList": "2025-10-28",
  "date_published": "2025-10-27T11:55:41.000Z"
}
