{
  "title": "Hope with restraint",
  "author": "Editorial",
  "content": "PAKISTAN’S ongoing economic engagement with Saudi Arabia marks a radical shift in a relationship traditionally defined by remittances, financial help and deferred oil facilities. The launch of the Economic Cooperation Framework shows an interest in moving beyond aid to a lasting partnership rooted in trade and investment. The new framework should enable Pakistan to expand its exports, attract investment and integrate itself into regional value chains. If this materialises, it could help anchor long-term economic stability for Pakistan. However, going by the ineffectiveness of statements, MoUs and ministerial delegations in the recent past, there is reason to doubt a major Saudi investment push in Pakistan. Yet, we must keep our fingers crossed. The advent of the framework coincides with the release of an OICCI survey, claiming that the sentiment among foreign investors is finally improving. It means that foreign companies are gaining trust in our economic stability and business potential. Nearly three quarters of investors now view Pakistan as a viable investment destination compared to two-thirds a couple of years ago. Improved macroeconomic indicators seem to have been a factor in this change of sentiment. The World Bank’s upward revision of its growth forecast from 2.6 to 3pc and the reduction in its poverty estimate to 22.5pc from 25.3pc could not have come at a better time either.\n\nThat said, both the OICCI and World Bank have also flagged structural risks. For instance, the OICCI points out that weaknesses such as poor federal-provincial coordination, excessive energy and wage costs, delays in tax refunds, distorted taxation, policy inconsistency, etc, could undermine improvements in the investment momentum. The bank has warned that growth remains too modest to lift living standards meaningfully, especially amid recurring climate shocks. The floods of 2022 and 2025 show how quickly disasters can undo fragile progress and increase dependence on emergency foreign aid. The issues highlighted are structural bottlenecks that erode competitiveness and investor trust — as evident from the recent exit of several foreign firms. The prime minister’s ‘investment, not aid’ approach at an investment moot in Saudi Arabia underscores a shift in the economic development narrative. But, unless backed by deeper productivity and governance reforms, this means little to the foreign investors he is attempting to woo through what our policymakers often call ‘game-changing’ deals. Therefore, optimism must remain within bounds.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://www.dawn.com/_img/social-default.jpg",
  "retrievedAt": "2025-11-01T14:05:48.961Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952124/hope-with-restraint",
  "dateList": "2025-10-28",
  "date_published": "2025-10-30T00:00:37.000Z"
}
