{
  "title": "IHC to take up contempt plea against sitting judge today",
  "author": "Malik Asad",
  "content": "ISLAMABAD: The Islamabad High Court (IHC) will hear a conte­mpt of court petition filed by Advo­cate Kulsum Khaliq seeking proce­edings against a sitting judge of the same court on Thursday (today).\n\nA single-member bench comprising Justice Khadim Hussain Soomro will take up the matter to decide on objections raised by the registrar’s office regarding the maintainability of the petition, according to the cause list issued by the IHC registrar office.\n\nThe registrar has questioned how contempt proceedings can be entertained against an order dated June 23, 2025, how the petitioner claims to be aggrieved by that order, and how other respondents are connected to the alleged contempt. The office also pointed out that several respondents appear irrelevant and noted that the petitioner has alternative legal remedies available. The petition was termed “totally misconceived”.\n\nThe contempt petition, filed un­­der Article 204 of the Constitution and sections 3 and 4 of the Conte­m­­pt of Court Act, 1976, names more than 40 respondents, including the chief of army staff, the president of Pakistan, the chief justices of all four provincial high courts, senior IHC officers, and bar representatives. The primary allegation, however, is directed against Justice Saman Raffat Imtiaz, who has been cited as “respondent No. 2”.\n\nRegistrar termed petition against Justice Saman ‘totally misconceived’\n\nIn her petition, Advocate Kulsum Khaliq accuses the judge of misconduct, misuse of administrative powers, and passing adverse and unlawful orders against her in a pending appeal. The petitioner claims that the judge violated the IHC order dated June 23, 2025, and therefore committed contempt of court. She has sought cancellation of the judge’s appointment notification, initiation of contempt proceedings, and an order restraining her from performing judicial functions.\n\nThe petition also calls for an inquiry into the respondent judge’s conduct and assets, the suspension of the Islamabad Bar Council elections scheduled for November, and the registration of an FIR under Article 6 of the Constitution — a provision relating to treason. The petitioner has demanded compensation of Rs1 billion for alleged professional loss and defamation.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/3008485844754af.webp",
  "retrievedAt": "2025-11-01T14:05:12.268Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952065/ihc-to-take-up-contempt-plea-against-sitting-judge-today",
  "dateList": "2025-10-28",
  "date_published": "2025-10-29T23:59:26.000Z"
}
