{
  "article_id": "2025-03-08_ac9368eb31cffbc3015b5069110a61a2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dpm-fm-dar-reaffirms-commitment-to-womens-empowerment/",
    "retrieved_at": "2025-08-27T13:27:20.786Z"
  },
  "metadata": {
    "title": "DPM/FM Dar reaffirms commitment to women’s empowerment",
    "author": null,
    "date_published": "2025-03-08T11:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 239,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, March 08 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Saturday said the Government of Pakistan remained firmly committed to empowering women through equitable access to education, expanded economic opportunities and progressive policies. \"We deeply value the pivotal role of women in diverse fields-including diplomacy, governance, business, and beyond-and recognize their immense contributions to our nation's development. By fostering an inclusive and supportive environment, we strive to ensure that every woman has the opportunity to realize her full potential and participate meaningfully in our collective progress, the DPM/FM said in a message on observance of International Women's Day. He said on this day, they celebrated and honour the remarkable contributions of women across all spheres of life. The DPM/FM observed that the women in Pakistan and around the world played an indispensable role in shaping societies, driving progress and inspiring future generations. \"Their resilience, dedication, and extraordinary achievements stand as a testament to their strength and remain a profound source of pride for our nation,\" Foreign Office Spokesperson, in a press release, quoted him as saying. The DPM/FM Dar called for unwavering commitment to gender equality and the advancement of women's rights. \"A society that uplifts and empowers its women is one that thrives. Together, we must continue to break barriers, challenge outdated stereotypes, and build a future where women and men stand as equal partners in the journey toward prosperity and progress,\" he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}