{
  "article_id": "2025-03-08_6a0e745f33c61a02333d61e0348168d6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/womens-day-ig-rizvi-pays-tribute-to-female-police-officers/",
    "retrieved_at": "2025-08-27T13:28:11.273Z"
  },
  "metadata": {
    "title": "Women’s Day: IG Rizvi pays tribute to female police officers",
    "author": null,
    "date_published": "2025-03-08T09:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 205,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 08 (APP):Inspector General of Police (IGP) Syed Ali Nasir Rizvi, on Saturday, issued a special message on the occasion of International Women's Day, commending the dedication and contributions of female police officers. A public relations officer told APP that IG Rizvi described the women serving in Islamabad Police as a source of pride and a valuable asset to the department. He also saluted the brave mothers, sisters, and daughters of martyrs and veterans, acknowledging their sacrifices. Rizvi highlighted that both the Women Police Station and the Digital Women Police Station in Islamabad are functioning efficiently, providing immediate solutions to women's concerns. \"The role of women in Islamabad Police is no less than that of their male counterparts,\" he emphasized. The IGP reiterated the department's commitment to ensuring a better working environment for female officers, enabling them to perform their duties effectively. Underlining the importance of gender equality, he stressed that providing women with equal opportunities and a secure environment is essential for societal progress. \"Female police officers are demonstrating remarkable abilities in all fields, working shoulder to shoulder with male officers,\" he noted. Rizvi further emphasized that women officers play a vital role in maintaining law and order, crime control, and community policing.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}