{
  "title": "Cambridge exams starts under SOPs",
  "link": "https://www.app.com.pk/national/cambridge-exams-starts-under-sops/",
  "date_published": "2021-04-26T10:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Cambridge Assessment International Education (CAIE) has started A & O Level examinations in the country which have been allowed under strict Standards Operating Procedures (SOPs).\nIn a statement, Cambridge said that they had provided various options for schools and students to support them through the pandemic.\nIn some syllabuses, candidates could take the component in a way that is easier to manage. For example, AS & A Level, Art & Design candidates can produce one piece of course work instead of three.\nSchools could apply for exemptions where they feel candidates were not able to complete the syllabus due to any reason, it added.\nThe statement further said the candidates can choose not to take a component but can still receive an overall syllabus grade.\nStudents can receive a grade, when for any reason they miss some exams. Cambridge will give result to all students who have taken at least one component of a subject in May/June 2021 exam series.\nStudents can defer to a future exam series with the same fee they paid for May/June 2021. The decision is theirs and and Cambridge will not investigate They can do this for one or more subjects. They have till 17 June to make this decision.\nPopular subjects in Pakistan will be offered in October /November 2021 exam series to facilitate students who decide to defer their entries from May/June 2021 to October /November 2021.\nMinister for Federal Education and Professional Training Shafqat Mehmood has wished all students taking exams starting from today(Monday) , the very best.\nIn a Tweet, Shafqat Mahmood said these are tough times and difficult decisions have been made keeping the students best interest in view.\n“British Council is committed to strict implementation of SOPs and we will monitor them closely” he said in a Ttweet.\nThose students and parents still not comfortable can switch to Oct/Nov cycle without any extra charge, he mentioned.\nMoreover, he said, as regards as students I have asked Cambridge to reconsider the 13 month condition for taking remaining papers considering the extra ordinary situation. “I am very hopeful that a positive decision will come soon” he added.",
  "retrievedAt": "2025-08-11T20:39:48.466Z"
}
