{
  "title": "Pakistani workforce recruitment in Japan underway: Zulfi Bukhari",
  "link": "https://www.app.com.pk/national/pakistani-workforce-recruitment-in-japan-underway-zulfi-bukhari/",
  "date_published": "2021-04-26T09:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development Sayed Zulfikar Abbas Bukhari said on Monday that the country would soon start sending its skilled workforce to Japan under a government-to-government Memorandum of Understanding (MoU) as a recruitment process of many young workers in final stages.\nHe revealed this while addressing the signing ceremony of a Memorandum of Cooperation (MoC) between the Overseas Employment Corporation (OEC) and Inter-SES.\nThe partnership was meant to explore employment opportunities for Pakistani manpower in Japan by reaching out to major Information Technology (IT) companies.\nThe MoC was signed by OEC Managing Director Kashif Noor and Inter-SES Chief Executive Officer Zafar Mahmood in presence of SAMP Zulfikar Bukhari and Ambassador of Japan to Pakistan Kuninori Matsuda.\nHe said after signing of this MoC, the Inter-SES and OEC would make joint efforts to find new and lucrative job opportunities in Japan for qualified youth of Pakistan. Recruitment of 120 skilled workers, who had been imparted Japanese language by the ministry, was underway, he added.\nThe SAPM said the chief aim of MoC was to boost footprint of Pakistani workforce in Japan through extensive marketing of the jobs’ demand, emanating from Japanese companies, in Pakistan.\nUnfortunately, both the countries were devoid of linkages for human resource in the past, but now there was a Memorandum of Understanding between the two states for manpower export, he added.\nHe said all-out efforts would be made to ensure presence of the Pakistani diaspora in Japan at par with the gulf countries as it had immense potential to meet the growing employment needs of Pakistan.\n“Since Japan is an aging population and will be needing around 5,00,000 of workforce in future, it is our priority to fetch maximum quota for Pakistan out of this,” Zulfikar Bukhari maintained.\nThe SAPM said the ministry’s prime focus for export of manpower to Japan was on IT sector as Pakistan had the best block chain developers in the world. The IT sector was not given due attention in the past which was ‘very unfortunate’, he added.\nHe said the ministry was exploring new markets to create maximum job opportunities for Pakistani workforce in other than gulf countries. “We want to digress as a country and ministry and do not want to be heavily populated in one region.”\nRegarding the Japanese ambassador as the biggest supporter in Pakistan-Japan relationship, he extended his gratitude to ambassador for always being at forefront between this relationship and particularly in Pakistani manpower export to Japan.\nJapanese Ambassador Kuninori Matsuda said as of today, above 30,000 Pakistanis were living and working in Japan. Pakistanis were among the most constructive and\nlaw-abiding members of society in Japan, he commented.\nHe said Japan had high trust in capabilities of Pakistani youth, particularly in IT sector.\n“Spread good words about Japan and Pakistan relations, particularly in human resource,” he remarked while addressing to the media.",
  "retrievedAt": "2025-08-11T20:39:50.228Z"
}
