{
  "title": "PDM’s failure haunts Maryam, causes psychological issues: Zulfi Bukhari",
  "link": "https://www.app.com.pk/national/pdms-failure-haunts-maryam-causes-psychological-issues-zulfi-bukhari/",
  "date_published": "2021-04-26T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP):SAPM Sayed Zulfikar Abbas Bukhari on Monday said Pakistan Muslim League-Nawaz (PML-N) Vice President Maryam Nawaz seemed to be grappling with some psychological issues caused by the complete failure of Pakistan Democratic Movement (PDM) to achieve its objectives.\n“The PDM’s failure has deeply saddened Maryam Nawaz. She is in a state of psychological confusion,as evident from her statement that ‘the government’s days are numbered’. She likes to get mental satisfaction by making such assumptions,” Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development Zulfi Bukhari said in a statement.\nHe made the remarks in reaction the PML-N leader’s recent statement in which she claimed that the multi-party opposition alliance had inflicted considerable damage on the government.\nZulfi Bulhari said the Pakistan Tehreek-e-Insaf would not only complete its five-year government term, but would also win the next general elections with a thumbing majority based on its mega development and public welfare projects.\nThe SAPM said the government was fully focused on the country’s development and economic stability. “The PML-N’s dream of toppling the government will remain a dream and the present government will complete its tenure under the leadership of Prime Minister Imran Khan,” he added.\nAs regards the National Assembly-249 by-poll, he said the people of Karachi would defeat them [opposition] with the power of vote as both the PML-N and Pakistan Peoples Party had plundered the national wealth ruthlessly while in power.\nKarachities would never forgive them for looting their money, he added.\nForeseeing the PTI candidate’s victory in the NA-249 by-election, Zulfikar Bukhari said defeat was the PML-N’s fate as the people of the constituency had completely rejected their narrative. They were doomed for humiliation and disgrace, he added.",
  "retrievedAt": "2025-08-11T20:39:46.939Z"
}
