{
  "title": "2020 to be year of prosperity, development: Sh Rashid",
  "link": "https://www.app.com.pk/national/2020-to-be-year-of-prosperity-development-sh-rashid/",
  "date_published": "2020-01-25T01:58:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 25 (APP):Railways Minister Sheikh Rashid Ahmad said on Saturday that 2020 would be the year of prosperity and development for the country.\nTalking to media after the inaugural ceremony of freight train from newly restored dry port here to Karachi on Saturday, he said corruption rate had been reduced during the current regime and termed the Transparency International report as fake.\nTo a question, he said corruption or commission in wheat management was out of question, adding mismanagement and miscalculations in data could be the reason of shortage of flour in the country.\nHe said price control committees should be formed to monitor the prices of commodities, adding prices of sugar would be discussed in the cabinet meeting.\nThe minister said Prime Minister Imran Khan was an honest politician and he did not tolerate corruption at any cost.\nHe said the prime minister was voice of poor and wanted to give more employment, adding he (Imran) was working to uplift the country’s economy as strong economy meant more employment.\nTo another question about any deal with PMLN leader Marryum Nawaz, Sh Rashid said no deal was under way, adding why the government would make any deal when opposition was already inactive and there was no threat to the government from the opposition.\nTo a question, he said the national exchequer had been badly plundered before Imran took over charge of his office, adding the prime minister worked hard for the economy during the last 17 – 18 months.\nResponding to a question about Kashmir, he said February 5 would be observed as not only the solidarity with Kashmir day but the Pakistani Nation would also express its solidarity with the people of India who were protesting against the controversial citizenship law.\nTo a question about International Monetary Fund (IMF), the minister said the IMF was Pakistan’s need, adding there would be no need to go to the IMF, if someone else gave 6 billion dollars to Pakistan.\nHe cleared that China was always standing with Pakistan in every problem.\nTo a question about the instability in the provincial setups, he said there was no need to listen to rumours as nothing was going to change in provinces, adding that the prime minister was happy with Punjab Chief Minister Usman Buzdar.\n“So rumours about 2020 as election year are wrong,” he said.\nHe hoped that premier Imran Khan would overcome every challenge in the country.",
  "retrievedAt": "2025-08-11T18:41:13.716Z"
}
