{
  "title": "Five dry ports to be restored soon: Railways minister",
  "link": "https://www.app.com.pk/national/five-dry-ports-to-be-restored-soon-railways-minister/",
  "date_published": "2020-01-24T21:50:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 25 (APP):Railways Minister Sheikh Rashid Ahmad Saturday said that five closed dry ports would be restored by March 1 to facilitate traders and businessmen.\nAddressing the inaugural ceremony of a freight train at newly restored dry port here, he said that Chishtian, Kundian, Sheikhupura, Jiabagga and Mughulpura dry ports would be made operational by March 1, which would increase economic activities in the country.\nHe asked importers and exporters to help run dry ports and promised that railway officers would cooperate with them in their business. He said that railways development was important for any country’s economic progress.\nSheikh Rahid said that the Main Line 1 (ML-1) project would play vital role in the country’s progress as its share in the economy would be $9 billion, which was more than the IMF support of $6 billion.\nHe said that China-Pakistan Economic Corridor (CPEC) was a game-changer and no conspiracy or hurdle in the way of the project would be tolerated and 1,875-km railways track would be upgraded under the initiative.\nHe thanked the country chief executive officer (CEO) of DP World, a terminal operator, over his promise to provide 5,000 trackers for freight coaches which would be helpful to track freight wagons after their installation.\nThe minister said that the ML-1 was his dream and mission, which would ensure 160 km\\hour speed of trains, adding that after completion of the ML-1, he would retire from politics. He said that under the ML-1 project, all curves in the track would be straightened and bridges would be upgraded.\nHe expressed his hope that Federal Minister Asad Umar would ensure early tenders for the ML-1 project. The minister said that 154-km long track between Peshawar and Jalalbad in Afghanistan would also be included in CPEC.\nHe said that Prime Minister Imran Khan would soon visit the PR headquarters to inaugurate modernised Command and Control system of the railways.\nPR Chairman Habibur Rehman Gilani, newly appointed PR Chief Executive Officer\\Senior General Manager Dost Ali Leghari and PR Police IG Mushtaq Mehar were also present on the occasion.",
  "retrievedAt": "2025-08-11T18:41:08.676Z"
}
