{
  "title": "UN aid body calls Gaza ‘hungriest place on Earth’ - World - DAWN.COM",
  "author": null,
  "content": "• Warns entire population in the enclave now at risk of famine\n• Macron says abandoning Gaza ‘will kill’ West’s credibility\n\nGENEVA: Gaza is “the hungriest place on Earth”, the United Nations said on Friday, warning that the Palestinian territory’s entire population was now at risk of famine.\n\nNegotiations to end nearly 20 months of war have so far failed to achieve a breakthrough, with Israel resuming operations in Gaza in March, ending a six-week truce.\n\n“Gaza is the hungriest place on Earth,” said Jens Laerke, a spokesman for the UN humanitarian agency OCHA.\n\n“It’s the only defined area — a country or defined territory within a country — where you have the entire population at risk of famine. 100 per cent of the population at risk of famine,” he said, rejecting claims to the contrary by Israeli authorities. In recent days, Israel has partially eased a total aid blockade on the Palestinian territory that it imposed on March 2, leading to severe shortages of food and medicine.\n\nDaniel Meron, Israel’s ambassador in Geneva, rejected the claim, saying UN agencies “cherry-pick the facts to paint an alternative version of reality and demonise Israel”.\n\n“In a desperate effort to remain relevant, they lambast the best efforts of Israel and its partners to facilitate delivery of humanitarian aid to the civilian population. UN feeds Hamas, we make sure aid gets to those in need,” he wrote on X.\n\n‘Catastrophic hunger’\n\nAt a press briefing in Geneva, Laerke detailed the difficulties faced by the United Nations in delivering humanitarian aid into the Gaza Strip.\n\nLaerke said 900 trucks of humanitarian aid had been authorised by Israel to enter the Gaza Strip since the blockade was partially lifted.\n\nBut so far only 600 trucks have been offloaded on the Gaza side of the border, and a smaller number of truckloads have then been picked up, due to multiple security considerations.\n\nOnce truckloads enter Gaza, they are often “swarmed by desperate people”, Laerke said. “I don’t blame them, for one second, for taking the aid that essentially is already theirs — but it’s not distributed in the way we want.”\n\n‘Desperate and tragic’\n\nThe Gaza Humanitarian Foundation — a new organisation backed by Israel and the US that emerged in early May — has been distributing aid at several sites across the Strip this week.\n\nAsked about the foundation’s operations, Laerke said: “It’s not working. It does not meet the needs of people. It creates chaos.”\n\nThousands of Palestinians rus­hed into a GHF centre on Tuesday, AFP journalists reported, as Israel implemented a new distribution system that bypasses the UN.\n\nLaerke said that by having people collect aid rather than delivering it to them where they are, they become a target for looters once they leave the site.\n\n‘Free pass’\n\nMeanwhile, French President Emmanuel Macron said on Friday that abandoning war-torn Gaza to its fate and giving Israel a “free pass” would kill the West’s credibility with the world.\n\n“If we abandon Gaza, if we consider there is a free pass for Israel, even if we do condemn the terrorist attacks, we will kill our credibility,” Macron told a top defence forum in Singapore, adding: “And this is why we do reject double standard.”\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683a54b78852f.jpg",
  "retrievedAt": "2025-08-23T14:36:10.609Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914432/un-aid-body-calls-gaza-hungriest-place-on-earth",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:51:40.000Z"
}
