{
  "title": "UN honours two Pakistani peacekeepers posthumously - Pakistan - DAWN.COM",
  "author": null,
  "content": "UNITED NATIONS: The United Nations on Thursday honoured 57 military, police, and civilian peacekeepers from 32 countries, including two from Pakistan, who died serving in missions last year, at a ceremony marking the annual ‘International Day of UN Peacekeepers’.\n\nAmong the posthumous recipients of Dag Hammarskjold medals were Sepoy Muhammad Tarique and Havildar Ahsanullah Khan from Pakistan, both of whom served with the UN Interim Security Force for Abyei (UNISFA).\n\nUN Secretary-General Antonio Guterres, who presided over the ceremony in the Trusteeship Council Chamber at UN Headquarters, presented the awards for the fallen peacekeepers. These were received by the ambassadors of their respective countries.\n\nAwards for civilians were received on behalf of their families by UN Under-Secretary-General for Operational Support Atul Khare.\n\n57 peacekeepers from 32 countries also honoured\n\nPakistan’s UN Ambassador Asim Iftikhar Ahmad, accompanied by the Mission’s Military Adviser Col Umar Shafique, accepted the awards for his countrymen.\n\nMr Guterres also presented the 2024 Military Gender Advocate of the Year award to Squadron Leader Sharon Mwinsote Syme from Ghana, and the UN Woman Police Officer of the Year award to Superintendent Zainab Gbla of Sierra Leone. Both also serve with UNISFA.\n\nThis year’s theme focused on the future of peacekeeping. Mr Guterres said, “peacekeepers face increasingly complex situations in an increasingly complex world,” citing growing polarisation, terrorism, misinformation, climate change, and transnational crime.\n\n“Now more than ever, the world needs the United Nations and the United Nations needs peacekeeping that is fully equipped for today’s realities and tomorrow’s challenges,” he said.\n\nThe secretary-general stressed that “it is essential that peacekeepers have what they need to do their jobs,” calling it “the shared responsibility of the United Nations and Member States”.\n\nUN Under-Secretary-General for Peace Operations Jean-Pierre Lacroix said, “Our personnel are our most important capability. The sacrifices made by our peacekeepers call for more than remembrance; they demand action.”\n\nHe added, “The future of peacekeeping hinges on our collective commitment to continue to adapt and invest so we can continue delivering hope and protection where it’s needed most.”\n\nThe first UN peacekeeping operation was established in 1948. Today, more than 68,000 personnel serve in 11 missions.\n\nPakistan is the fifth-largest contributor of uniformed personnel, currently deploying over 2,800 military and police personnel to UN operations in Abyei, the Central African Republic, the Democratic Republic of the Congo, Cyprus, Somalia, South Sudan, and Western Sahara.\n\nInternational Day of UN Peacekeepers, established in 2002, honours the more than 4,400 peacekeepers who have died in the line of duty over the past 77 years, with 57 fatalities recorded in 2024 alone.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/3110162635cd693.jpg",
  "retrievedAt": "2025-10-12T03:23:25.990Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914422/un-honours-two-pakistani-peacekeepers-posthumously",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:51:46.000Z"
}
