{
  "title": "KP wants to engage with Kabul on its issues only: Barrister Saif - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Adviser to the Khyber Pakhtunkhwa chief minister on information Barrister Mohammad Ali Saif on Friday said the provincial government didn’t seek to engage in international diplomacy or discuss matters of national security with Afghanistan, but it simply wanted to engage Kabul on the issues that had a direct impact on the province.\n\nDuring a visit to the Peshawar Press Club, Mr Saif told reporters that the provincial government formally and informally requested the federal government many times for permission to send a delegation to Kabul to engage directly with Afghan authorities on matters that affected KP.\n\nHe criticised the centre’s “political incompetence and diplomatic inaction for hampering provincial efforts and preventing meaningful engagement with Afghanistan.”\n\nThe aide to the CM said developments in Afghanistan had a direct impact on KP due to geographical proximity, according to an official statement.\n\nCM aide says PTI set to launch protest drive on Imran’s instructions\n\nHe said the foreign minister had traveled across the world but failed to visit the neighbouring Afghanistan, which was a major foreign policy failure.\n\nMr Saif said the provincial government disagreed with the federal government’s policy about the extradition of Afghan refugees.\n\nHe said that Afghan refugees were seen as brothers, so treating them with compassion and fraternity was both a humanitarian and religious obligation.\n\n“Our chief minister has repeatedly stated that the provincial government does not endorse the federal government’s approach toward Afghan refugee’s repatriation. We believe Afghans share our language, culture, religion and faith,” he said.\n\nThe chief minister’s adviser said that if any Afghan national completed legal documentation and wished to re-enter Pakistan, the provincial government had no objections.\n\nHe rejected “narratives blaming Afghan citizens for the province’s problems, and declared such claims unfair and disconnected from reality.”\n\nIn response to a question regarding the release of former prime minister and PTI founder Imran Khan, Mr Saif said that his party made sincere efforts for political dialogue.\n\n“At one point, a formal negotiation committee was established that engaged in talks with the government but the process stalled and the committee was eventually dissolved,” he said.\n\nThe aide to the PM said that the PTI continued to make efforts on political, constitutional and legal fronts to secure the release of the former prime minister.\n\nHe said that economic recovery and effective implementation of national security policies were not possible without political stability.\n\n“The only way to achieve stability is to ensure swift judicial decisions on the baseless, politically motivated cases filed against Imran Khan and PTI leaders, and to release innocent political prisoners so they can rejoin the mainstream political process,” he said.\n\nMr Saif said the former prime minister had been behind bars for two years but he didn’t seek pardon or relief and bore all hardships with patience.\n\n“Anyone who believes that keeping Imran Khan behind bars will change the political landscape is delusional. The interest of the state, the nation, and the government lies in finding a peaceful resolution to this mockery,” he said.\n\nThe chief minister’s adviser said that a new protest campaign was being launched and the KP chief minister had been instructed by Imran Khan accordingly.\n\nMr Saif rejected the PPP’s anti-corruption protest as the “height of political hypocrisy and mockery.”\n\n“The world knows that if any party is most associated with corruption, it is the Pakistan Peoples Party,” he said.\n\nThe aide to the CM said the people complaining about being hit with batons were those who opened fire on unarmed PTI protesters in Islamabad, Rawalpindi and D-Chowk, resulting in over 18 deaths.\n\nDuring the visit, Mr Saif presented a cheque of Rs50 million financial assistance on behalf of the provincial government to the press club.\n\nOn the occasion, information secretary Mohammad Khalid, additional secretary (information) Hayat Shah, office-bearers of the press club, senior journalists and other relevant individuals were present.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:35:42.681Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914337/kp-wants-to-engage-with-kabul-on-its-issues-only-barrister-saif",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:52:33.000Z"
}
