{
  "title": "Drug claims overshadow Musk’s Oval Office farewell - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Elon Musk faced accusations on Friday that he used so much ketamine on the 2024 campaign trail that he developed bladder problems, as the billionaire prepared to give a farewell press conference with Donald Trump.\n\nA New York Times report that Musk’s drug use had caused concerns was published just hours before he was to appear with Trump in the White House on his last day as the US government’s cost cutter-in-chief. The newspaper said the world’s richest man also took ecstasy and mushrooms and traveled with a pill box last year, adding that it was not known whether Musk also took drugs while heading the so-called Department of Govern­ment Efficiency (DOGE).\n\nThe South African-born tech tycoon, the biggest donor to Trump’s 2024 election campaign, told people that ketamine, an anesthetic that can cause dissociation, had affected his bladder, the NYT added, noting that it was a known effect of long-term use.\n\nSpace X and Tesla boss Musk did not immediately comment, but the White House played down the report. Asked if he was concerned about alleged drug use by Musk, Trump’s Deputy Chief of Staff Stephen Miller told reporters: “The drugs that we’re concerned about are the drugs running across the southern border.” Trump’s administration has pledged to crack down on migration and the flow of the opiate fentanyl from Mexico.\n\nMiller separately told CNN when asked if Musk had been drug tested while working for the White House: “You’ll have the opportunity to ask Elon all the questions you want today yourself.” Musk has previously admitted to taking ketamine, saying he was prescribed it to treat a “negative frame of mind” and suggesting his use of drugs benefited his work.\n\nMusk to remain ‘friend and adviser’ to Trump\n\nThe newspaper report overshadowed the farewell hosted at the Oval Office on Friday by President Trump for the man who led his turbulent cost-cutting drive.\n\nBillionaire Elon Musk said he would remain a “friend and adviser” to Trump.\n\n“I look forward to continuing to be a friend and adviser to the president,” Musk told reporters after Trump handed a golden key as a gift to the departing leader of the Department of Government Efficiency (DOGE).\n\nMusk, clad in a black T-shirt and jacket and wearing a baseball cap as he stood next to the seated Trump, said he would keep supporting the team that is “relentlessly pursuing a trillion dollars in waste” in reductions that will “benefit the American taxpayer”.\n\nHe complained about how he has been portrayed, saying: “We became, like, essentially the DOGE bogeyman, where any cut anywhere would be ascribed to DOGE.” Musk, the world’s richest person, has said he is stepping back from his role at the White House to focus on his companies, which include Tesla, SpaceX and social media platform X.\n\nUnder Musk’s guidance, DOGE has slashed billions of dollars in government spending, much of it already approved by Congress, including eviscerating the main US agency delivering foreign aid.\n\nA Boston University study said that tens of thousands of people have already died because of the freeze in funding, a finding earlier denied by Secretary of State Marco Rubio.\n\n“We’re totally committed to making the DOGE cuts permanent and stopping much more of the waste in the months that come,” Trump said.\n\nHe said that Musk “is really not leaving” as DOGE is working on further priorities such as “modernisation” of the tax-collecting Internal Revenue Service, whose ranks have been slashed.\n\nThe right-wing magnate’s DOGE led an ideologically-driven rampage through the federal government, with its young “tech bros” slashing tens of thousands of jobs. It has also shuttered whole departments including the US Agency for International Development, leading to huge cuts in foreign aid that critics say will hit some of the world’s poorest people and help US rivals.\n\nBut DOGE’s achievements fell far short of Musk’s boasts when he blazed into Washington.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683a5a78f2c4b.jpg",
  "retrievedAt": "2025-08-23T14:35:55.412Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914408/drug-claims-overshadow-musks-oval-office-farewell",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:52:06.000Z"
}
