{
  "title": "Kabul also levels up its Pakistan diplomat to ambassador as ties see ‘normalisation’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Hours after Pakistan decided to enhance ties with Afghanistan yesterday, the Afghan foreign ministry welcomed the decision and announced upgrading the status of its chargé d’affaires in Islamabad to ambassador.\n\nPakistan and Afghanistan agreed to upgrade their diplomatic relations by exchanging envoys earlier this month — a key step towards normalising ties after years of strained relations due to terrorism concerns repeatedly voiced by Islamabad.\n\n“The Ministry of Foreign Affairs of the Islamic Emirate of Afghanistan welcomes the decision of the Government of Pakistan to upgrade the level of its diplomatic mission in Kabul to that of an ambassador,” the Afghan foreign ministry said on its X account late on Friday.\n\n“In reciprocity, the Islamic Emirate of Afghanistan will elevate the status of its mission in Islamabad from chargé d’affaires to ambassador,” the ministry added.\n\nZakir Jalaly, an Afghan foreign ministry official, wrote on X that the current chargé d’affaires in Islamabad, Sardar Ahmad Shakeeb, will assume responsibilities as the country’s ambassador to Pakistan.\n\nKabul’s Foreign Minister Amir Khan Muttaqi is due to visit Pakistan “in the coming days”, ministry spokesman Zia Ahmad Takal told AFP.\n\nFollowing Pakistan’s decision from yesterday, its chargé d’affaires Ubaidur Rehman Nizamani will be levelled up to an ambassador.\n\nThis elevation in diplomatic representation between the two countries paves the way for enhanced bilateral cooperation in multiple domains.\n\nPakistan and Afghanistan made the announcements days after Chinese Foreign Minister Wang Yi said the two nations “expressed clear willingness to elevate diplomatic relations and agreed in principle to exchange ambassadors as soon as possible”.\n\nWang, who hosted an informal Afghanistan-China-Pakistan trilateral meeting in Beijing, had welcomed that development and said China would continue to provide assistance for the improvement of Pak-Afghan relations.\n\nPakistani experts have acknowledged the role of China, which pressed Pakistan and Taliban-ruled Afghanistan to normalise relations.\n\n“China, as a bridge builder, is playing a historic role in bringing together Muslim countries,” Senator Mushahid Hussain, chairman of the Pakistan-China Institute, told Dawn.com today.\n\n“They presided over the rapprochement between Iran and Saudi Arabia in 2023, then brought 14 Palestinian factions together in Beijing in 2024, and now they have helped in normalising ties between Islamabad and Kabul,” detailed Mushahid, who has served as the chairman of the Senate foreign affairs and defence committees.\n\nHe recalled that at the tripartite meeting hosted by FM Wang, all three countries agreed to expand the China-Pakistan Economic Corridor (CPEC) to include Afghanistan as well. Then they politely prodded both sides to restore their level of representation to ambassador level, he added.\n\nThe senator termed the decision as a good sign that both Pakistan and Afghanistan were willing, ready and able to move forward on the path of normalisation with China’s “excellent” facilitation.\n\n“China as a South Asian power also has the highest stakes for peace, security and stability in the region,” Mushahid highlighted.\n\nAfghan experts also view the decision as very important for engagement in the current environment in Pakistan and Afghanistan.\n\nDr Ubaidullah Burhani, an American academic writer of Afghan origin and a researcher in political strategy, noted that the levelling up of diplomatic ties represented a significant political development, adding it arrives belatedly within a context marked by complex geopolitical rivalries.\n\n“It is imperative, however, that both sides seize this opportunity to engage in direct, constructive dialogue — independent of regional pressures — in order to lay the groundwork for policies that build mutual trust and deliver concrete outcomes,” Dr Burhani told Dawn.com.\n\nThe international affairs specialist stressed that priority should be given to advancing cooperation in critical areas such as trade, healthcare, and education, to ensure that diplomatic gestures are matched by practical steps that serve the interests of both nations and their people.\n\nAmbassador Nizamani, who joined the Foreign Service exactly three decades ago, was sent as charge d’affaires in November 2022, months after Ambassador Mansoor Khan completed his tenure.\n\nAccording to a profile of Ambassador Nizamani shared by the embassy with Dawn.com, he has served as the deputy chief of mission at the Embassy of Pakistan in Washington, DC from November 2019 to February 2021.\n\nOther roles he has been posted at include deputy high commissioner at the High Commission for Pakistan in New Delhi, political counsellor at the High Commission for Pakistan in Dhaka as well as at Pakistan’s embassy in Berlin, and vice consul at the Consulate General of Pakistan in Jeddah.\n\nIn Islamabad, Nizamani has served as the director for the US, as well as director general for Europe and South Asia.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/31140331db642f0.png",
  "retrievedAt": "2025-08-23T14:35:39.467Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914506/kabul-also-levels-up-its-pakistan-diplomat-to-ambassador-as-ties-see-normalisation",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T09:44:40.000Z"
}
