{
  "title": "Govt mulls tax break to avert cotton sector collapse - Business - DAWN.COM",
  "author": null,
  "content": "LAHORE: Pakistan’s cotton sector is facing its gravest financial crisis in decades, prompting swift government attention after urgent appeals from the Pakis­tan Cotton Ginners Association (PCGA) and the All Pakistan Tex­­tile Mills Association (Aptma).\n\nBoth associations have launched a high-profile lobbying campaign, writing to Prime Minister Shehbaz Sharif and initiating a nationwide media blitz, demanding the immediate abolition of the Export Facilitation Scheme (EFS) or the removal of sales tax on domestically produced cotton and its byproducts.\n\nThe premier subsequently sou­­ght policy recommendations from the Ministry of National Food Security and Research (MNFSR).\n\nIn response, the ministry has formally endorsed the industry’s proposals.\n\nIn a letter to PCGA President Dr Jassu Mal, Cotton Commis­sioner Dr Khadim Hussain stated that the government has recommended that the 18pc sales tax on domestic cotton, cottonseed, oilcake, and cottonseed oil be lifted immediately, or that imports of cotton, yarn, and grey cloth be taxed at the same rate.\n\nThe ministry’s recommendations, forwarded to safeguard farmers’ incomes, revive local production, and stem Pakistan’s soaring dependence on costly cotton imports, it says.\n\nThe communiqué notes that Punjab has implemented targeted subsidies for farmers to increase their incomes and reduce production costs for various crops.\n\nIndustry data reveals that textile mills have imported over 300 million kgs of cotton yarn and two million bales of cotton during the first nine months of 2024-25, draining billions of dollars in foreign exchange.\n\nDespite this, domestic production has fallen to a historic low of just 5.5m bales. Meanwhile, more than 200,000 bales of unsold cotton and vast stocks of yarn remain idle in factories, with demand at a standstill.\n\nCotton Ginners Forum Chairman Ihsanul Haq says the fallout has been devastating as over 800 ginning units and 120 spinning mills have ceased to function, while hundreds more textile units are barely functioning.\n\n“If the current policy persists, the sector risks total collapse,” he warns, adding that Pakistan may soon be forced to import not only cotton but also edible oil, compounding the country’s financial woes.\n\nThe MNFSR’s recommendations underscore the urgency, recommending immediate tax relief for domestic producers or the imposition of equal taxes on imports to restore a level playing field. All eyes are now on the federal government, as the fate of Pakistan’s cotton and textile industry hangs in the balance.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683a56d942630.jpg",
  "retrievedAt": "2025-08-23T14:35:57.024Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914436/govt-mulls-tax-break-to-avert-cotton-sector-collapse",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:51:52.000Z"
}
