{
  "title": "Iran says received ‘elements’ of US proposal for nuclear deal amid IAEA report on Tehran’s past activites - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Foreign Minister Abbas Araghchi on Saturday said he had received “elements” of a US proposal for a potential nuclear deal following five rounds of talks mediated by Oman, making the remarks the same day a report by the International Atomic Energy agency (IAEA) exposed Tehran’s nuclear activity.\n\nTensions between Iran and the UN nuclear watchdog have repeatedly flared since a 2015 deal curbing Tehran’s nuclear programme in exchange for sanctions relief fell apart.\n\nOmani Foreign Minister Badr al-Busaidi “paid a short visit to Tehran today to present elements of a US proposal which will be appropriately responded to in line with the principles, national interests and rights of the people of Iran,” Araghchi said on X.\n\nIran stepped up its production of highly enriched uranium in recent months, said a confidential report by the watchdog, seen by AFP earlier on Saturday.\n\nIt said in its quarterly report that it is of “serious concern” that Iran has an estimated amount of 408.6 kilogrammes enriched to up to 60 per cent as of May 17, up by 133.8kg since the last report in February.\n\nUranium enriched to up to 60pc fissile purity is close to the roughly 90pc level needed for atomic weapons. According to the IAEA, Tehran is the only non-nuclear weapon state to enrich uranium to 60pc.\n\nIran has always denied seeking a nuclear weapon.\n\nIn a separate in-depth report, the IAEA criticised “less than satisfactory” cooperation from Tehran over its scrutiny of Iran’s nuclear programme.\n\n“While Iran continues to cooperate with the agency on matters of routine safeguards implementation, in a number of respects […] its cooperation with the agency has been less than satisfactory,” the report said.\n\nIt specifically notes Tehran’s lack of progress in explaining nuclear material found at undeclared sites.\n\n“In particular, Iran has repeatedly either not answered, or not provided technically credible answers to, the agency’s questions and has sanitised locations as listed in this report, which has impeded agency verification activities.”\n\nIran’s foreign ministry accused Israel of providing “unreliable and misleading information” to the UN nuclear watchdog to be used in the report.\n\n“Relying on unreliable and misleading information sources provided by the Israeli regime … is contrary to the IAEA’s principles of professional verification,” the ministry said in a statement.\n\nDonald Trump unilaterally withdrew the United States from a landmark 2015 deal with Tehran during his first term as president. The deal had exchanged sanctions relief for limits on Iran’s nuclear programme.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:35:35.813Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914527/iran-says-received-elements-of-us-proposal-for-nuclear-deal-amid-iaea-report-on-tehrans-past-activites",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T13:18:18.000Z"
}
