{
  "title": "Trump says Pakistani representatives coming to US next week for trade talks - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump said on Friday that representatives from Pakistan are coming to the United States next week as Islamabad seeks to make a deal on tariffs.\n\nPakistan faces a potential 29 per cent tariff on its exports to the US due to a $3 billion trade surplus with the world’s biggest economy, under tariffs announced by Washington last month on countries around the world.\n\nPakistan’s formal negotiations with the United States on reciprocal tariffs started earlier in the day with a phone call between Finance Minister Muhammad Aurangzeb and US Trade Representative Jamieson Greer, a press release from the finance ministry said.\n\n“Pakistan representatives are coming in next week,” Trump told reporters at Joint Base Andrews after departing Air Force One.\n\n“And India, as you know, we’re very close to making a deal with India. And I wouldn’t have any interest in making a deal with either (Pakistan and India) if they were going to be at war with each other. I went that and I let them know,” the US president stressed.\n\nThe developments follow a recent military confrontation between Pakistan and India over New Delhi’s allegations against Islamabad, without evidence, about a deadly attack in occupied Kashmir’s Pahalgam.\n\nNew Delhi, based on the allegations, launched a series of air strikes in Pakistan in early May, killing civilians. Islamabad responded by downing five Indian jets. After intercepting drones sent by India on May 8 and tit-for-tat strikes on each other’s airbases, it took American intervention on May 10 for both sides to finally reach a ceasefire.\n\nIndian Trade Minister Piyush Goyal visited Washington recently to advance trade talks, with both sides aiming to sign an interim agreement by early July.\n\nIndia faces 26pc tariffs on shipments to the US.\n\nReuters reported last week that India is likely to allow US firms to bid for contracts worth over $50 billion, mainly from federal entities, as it negotiates a trade deal with Washington.\n\nThe increase in trade tariffs on Pakistani products, amongst a global tariff announcement by US President Donald Trump, which were paused, could have a devastating impact on Pakistan’s important exports and serve as a wake-up call for diversification, according to a state-owned think tank.\n\nThe Pakistan Institute of Development Economics warned that these tariffs could have a “devastating impact” on the country’s export sector, translating into an annual loss of $1.1-1.4 billion.\n\nTrump’s tariffs, implemented on April 2, introduced a 10 per cent baseline tariff for every country the US trades with, and additional reciprocal tariffs on rivals and allies alike.\n\nPresident Donald Trump also reaffirmed his claim of having brokered the May 2025 Pakistan-India ceasefire — a statement that continues to irk New Delhi but is quietly welcomed in Islamabad.\n\nSpeaking at a White House press conference on Friday, President Trump said his intervention “stopped India and Pakistan from fighting”, adding that the conflict could have “turned out into a nuclear disaster”.\n\n“We talk trade and we said we can’t trade with people that are shooting at each other and potentially using nuclear weapons,” he said. “They’re great leaders in those countries. And they understood and they agreed and that all stopped.”\n\nThis marks the fifth time President Trump has publicly cited his role in halting the conflict. He underscored America’s power to both wage and prevent wars, stating, “Ultimately, we can fight better than anybody,” but added, “we’re stopping others from fighting also.”\n\nHe also expressed gratitude to the leaders of both South Asian nations, as well as his own diplomatic team. “I want to thank the leaders of India, the leaders of Pakistan, and I want to thank my people also,” he said.\n\nA Pakistani delegation, led by PPP chairman and former foreign minister Bilawal Bhutto-Zardari, will arrive in New York on Sunday. It is expected to meet UN Secretary-General António Guterres, the current president of the UN General Assembly, and ambassadors of the five permanent members of the UN Security Council. The delegation will also address a joint session of OIC envoys during its two-day stay in New York.\n\nThe group will travel to Washington on June 3, where it hopes to meet Secretary of State Marco Rubio and other senior US officials. The visit also includes meetings with congressional lawmakers, policy experts from major think tanks, and US media representatives.\n\nWhile Pakistani officials have been cautious in public, they privately acknowledge that President Trump played a significant role in defusing the recent conflict. In contrast, India has repeatedly rejected the notion of outside involvement, claiming that the ceasefire was initiated by Pakistan and achieved without US mediation.\n\nCuriously, Islamabad denies making such a request and instead credits President Trump — creating an unusual diplomatic convergence between Pakistani officials and the current US president.\n\nTrump’s latest comments are seen in Islamabad as a timely morale booster for the visiting delegation. Pakistani diplomats say they not only endorse his claim but would welcome a broader US role in South Asia, particularly in resolving the Kashmir dispute. Trump had earlier underscored the need to resolve this issue, calling it a “festering wound” that must be addressed to ensure lasting peace in the region.\n\nPresident Trump’s remarks were part of a broader narrative positioning his second term as one focused on restoring global stability. “When I left, we had no wars, we had no problems. We defeated ISIS, we rebuilt our military, and we had no inflation,” he said. “And when I came back, we had a lot of inflation. We had wars all over the place.”\n\nListing current global crises — including the war in Ukraine, the Israeli invasion of Gaza, and tensions in the Indo-Pacific — President Trump cited South Asia as another region where US leadership has made a difference. “And now we have something where we’re really healing a lot of that,” he said, casting himself as a stabilising force in a turbulent world.\n\nHis assertion of having averted a “nuclear disaster” is likely to prompt strong reactions in diplomatic circles, particularly in New Delhi, which has consistently rejected third-party involvement in its disputes with Pakistan.\n\nYet, the timing of his remarks is significant. The Pakistani delegation’s visit to Washington aims to focus on trade, regional security, and reshaping US-Pakistan ties amid shifting global alliances and domestic political transitions. President Trump’s comments may complicate the diplomatic tone — or, for Islamabad, provide an opening to highlight its international relevance and US engagement.\n\nAnalysts say even if the president’s role in the ceasefire is exaggerated, the fact that hostilities ceased suggests that diplomatic pressure — including from Washington — was a factor. Given President Trump’s preference for direct engagement and bold claims, his involvement cannot be ruled out.\n\nFor Pakistan, the ceasefire remains a rare instance where a US president publicly acknowledged playing a role in reducing South Asian tensions — something successive governments in Islamabad have long sought.\n\nAs one Pakistani official noted privately: “It doesn’t matter who claims the credit, as long as the firing stops.”\n\nMeanwhile, Christine Fair, a US scholar once seen as aligned with pro-Indian perspectives, challenged New Delhi’s narrative of success in the recent Pakistan-India conflict.\n\n“Indians who fail to see the victories that Pakistan snatched from the latest skirmish will fail to understand just why India has not and will not deter Pakistan,” she wrote in a post on X.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/310830514a4f517.jpg",
  "retrievedAt": "2025-08-23T14:35:42.061Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914481/trump-says-pakistani-representatives-coming-to-us-next-week-for-trade-talks",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T03:26:07.000Z"
}
