{
  "title": "Wily Inter aim to stop PSG juggernaut in Champions League final - Sport - DAWN.COM",
  "author": null,
  "content": "MUNICH: Paris St Germain are on the brink of a maiden Champions League title, chasing European glory in their first campaign since the departure of France striker Kylian Mbappe, but street-wise and battle-hardened Inter Milan stand bet­ween them and history in Saturday’s final.\n\nThe climax to the European season has thrown up a mouthwatering clash of opposing styles and ideas of how to build a team. It is a contest between one of the continent’s old guard and one of the state-owned modern superclubs.\n\nLuis Enrique’s Ligue 1 champions, backed by owners Qatar Sports Investments, have been impressive in Europe with a cohesive brand of football that marks a clear departure from the star-driven, sometimes disjointed squads of PSG’s recent past.\n\nDespite enormous spending, PSG have never won the most glamorous prize in European club football and this is just their second final since the transformative Qatari takeover of the team from the French capital in 2011.\n\nIn 2020, during the pandemic, they lost the final to Bayern Munich behind closed doors in Lisbon, despite the presence of Mbappe and Neymar up front.\n\nAdding an ageing and unmotivated Lionel Messi to that front line took them further away from European glory than at any point in the last decade and their thrilling run to Munich has come in the season after Mbappe followed the South American superstar duo out of the exit door.\n\nMbappe thought a move to last year’s Champions League winners Real Madrid would improve his chances of getting his hands on the trophy. Instead Luis Enrique’s thrilling young Paris side — average age under 24 — has taken Europe by storm. The focus on unity, tactical discipline and collective effort has drawn widespread plaudits ahead of their showdown with Inter, who eliminated Barcelona after a thrilling semi-final, in European club football’s biggest match of the season.\n\nWhen they last came to Munich in November and lost 1-0 to Bayern, PSG were in danger of being knocked out during the league phase in the first season since the competition’s new format was introduced.\n\nA brilliant comeback win in January against 2023 champions Manchester City was the catalyst for a superb run as PSG eliminated three more Premier League sides — Liverpool, Aston Villa and Arsenal — en route to the final.\n\nOusmane Dembele has been the standout with 33 goals in all competitions, ably assisted by fellow forwards Desire Doue, Bradley Barcola and January signing Khvicha Kvaratskhelia.\n\nOthers like Achraf Hakimi, formerly of Inter and perhaps the world’s best full-back, and Italy goalkeeper Gianluigi Donn­arumma have also been superb for the French league and cup double winners.\n\n“We know what kind of football we want to play and now we just need to go out and do it to our full potential,” said their Spanish coach, who is looking to win his second Champions League title, a decade after leading Messi’s Barcelona to glory in Berlin.\n\n“We’ve been preparing for 11 months. There’s nothing special to adjust because the team is used to playing this way. It’s about managing the pressure and excitement of such a special moment.\n\n“We’ve been thinking about this final for a very long time because its the objective we all share — and we want to make history with our supporters.”\n\nThat, remarkably, would make them just the second French club to win the competition — if they are looking for an omen then Olympique de Marseille’s 1993 triumph also came in Munich, across the city at the old Olympic Stadium, and against Inter’s city rivals AC Milan.\n\nKEEPERS’ FINAL\n\nPSG enter the final with no injury concerns, while Inter fullback Benjamin Pav­a­rd and striker Lautaro Martinez are expe­cted to be fit for the Serie A runners-up.\n\nInter are bidding to win a fourth European Cup to add to back-to-back triumphs under Helenio Herrera in the 1960s, and the 2010 victory against Bayern in Madrid, under Jose Mourinho.\n\nCoach Simone Inzaghi was already in charge when the Nerazzurri got to the fin­al two years ago and lost narrowly to City.\n\nAs many as eight of the team that started that night in Istanbul could do so again here, where Inter have also already played this season.\n\nInzaghi’s side beat Bayern in the quarter-finals before getting the better of Barca in the last four in one of the all-time great Champions League ties, especially the epic second leg in the rain at San Siro.\n\n“To really make history we have to win on Saturday,” said Inzaghi, whose likely starting line-up will feature three players aged 36 or over.\n\nInter will set up in a 3-5-2 formation that contrasts sharply with the 4-3-3 of PSG, and it will be fascinating to see how they respond to losing out to Napoli for the Serie A title on the last day of the season.\n\n“We know that it will be difficult, we know that we’re facing a super team just like Barcelona and Bayern Munich but they will come up against a team which has the same goal as PSG. All we can do is try put in a great performance in the final,” he added.\n\nWhile this year’s finalists have displayed attacking brilliance, the match could be decided by the goalkeepers — PSG’s Gianluigi Donnarumma and Inter’s Yann Sommer.\n\n“If you look at the Champions League winners over the last 10 or 15 years, practically, it’s always the teams with strong goalkeepers who win,” former Italy keeper Gianluigi Buffon told La Gazzetta dello Sport.\n\n“And if we look at the season, Donnarumma and Sommer have been the top goalkeepers in Europe. Maybe Gigio [Donnarumma] was the absolute best, but Sommer showed an impressive consistency in maintaining his very high level of performance. It will also be a final of goalkeepers.”\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683a4be89e599.jpg",
  "retrievedAt": "2025-10-12T03:23:43.066Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914402/wily-inter-aim-to-stop-psg-juggernaut-in-champions-league-final",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:51:59.000Z"
}
