{
  "title": "Infrastructure decay takes life of Pakistan Railways official in Khanewal; passenger injured - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A railway official died after a concrete slab of a 100-year-old decaying passenger bridge caved in from 30-foot height at the Khanewal Railway Station on Friday morning.\n\nA woman passenger received multiple injuries after she fell down along with the slab that killed special ticket examiner (STE) Muhammad Ikram.\n\nMinister for Railways Hanif Abbasi suspended three employees posted in Multan and Khanewal for their negligence in timely maintenance of the bridge. The Rescue 1122 teams rushed to the spot and retrieved the body of the STE after cutting the heavy slab weighing around one tonne. The rescuers also shifted the injured passenger to the Khanewal DHQ Hospital emergency.\n\nA team of senior officials from Railways Multan division led by the divisional superintendent also reached the station.“It happened due to the negligence of the staff concerned who never bothered to examine its structure,” deplored an official. “Inquiry should be initiated immediately against the officials concerned.”\n\nConcrete slab of Khanewal railway station bridge caves in; three suspended\n\nThe minister also sought a report from the PR chief executive officer.The officers suspended from service included Abid Razzaq, Divisional Engineer-1 (BS-18), Raja Yousuf, Assistant Executive Engineer (BS-17) and Muhammad Adil, Bridge Inspector (BS-16).\n\n“The officers are hereby placed under suspension with immediate effect until further orders in accordance with rule-5 of the government servants (efficiency & discipline) rules, 2020 in connection with the collapse of foot-over bridge at Khanewal railway station in Multan Division on May 30, 2025,” reads a notification issued after approval of the railways chairman.\n\nAn inquiry committee comprising the railways CEO Amir Ali Baloch, IG (railways police) Rai Tahir and DS (Lahore) Tariq Latif has been constituted to probe into the case and recommend appropriate action.\n\nTalking to Dawn, Abbasi expressed grief over death of the railway official and injuries to a passenger. “It was a 100-year-old bridge that should have been examined and maintained regularly. This outlived bridge, I think, should have been reconstructed,” the minister said. He criticised PR officers, saying they use to work on papers and do not visit spots physically.\n\n“They never bother even to inspect such outlived infrastructures.”\n\nAccording to the railways CEO Mr Amir Ali Baloch, the family of the deceased was given Rs200,000 immediately for burial arrangements.\n\n“I also rushed to the spot and met with the heirs of the deceased official. We gave them Rs200,000 for burial arrangement. A handsome compensation would also be given to the family soon under the insurance cover and the railways fund,” he told Dawn.\n\nTo a question, he said Rs100,000 was also given to the son of the injured woman passenger. On his request, her mother was shifted to Faisalabad for treatment there.\n\nHe said the woman would also get insurance cover.\n\nThe Khanewal railway station has always been an important junction on main Lahore-Karachi line serving passengers of both up and down destinations.\n\nTariq Saeed from Toba Tek Singh and Majeed Gill from Bahawalpur also contributed to this report\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683a1b32eef2e.jpg",
  "retrievedAt": "2025-10-12T03:23:03.992Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914371/infrastructure-decay-takes-life-of-pakistan-railways-official-in-khanewal-passenger-injured",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:52:20.000Z"
}
