{
  "title": "Police officials’ statements fail to pinpoint triggers behind Moro violence - Pakistan - DAWN.COM",
  "author": null,
  "content": "HYDERABAD: Naushahro Feroze police officials, including deputy superintendents of police (DSPs) have submitted mostly stereotypical written statements to police inquiry committee in Karachi, revealing little to pinpoint actual triggers behind Moro violence on May 20.\n\nSome of the statements claimed that the May 20 protest on a section of National Highway was announced and planned by banned Jeay Sindh Muttahida Mahaz.\n\nMembers of the inquiry committee were scheduled to visit Moro on Saturday for on-ground investigation and meeting more people, including heirs of the deceased Irfan Leghari and Zahid Leghari, connected with the case.\n\nThe heirs had reportedly requested to visit deputy commissioner Naushahro Feroze’s office, according to information shared by police sources.\n\nShaheed Benazirabad DIG Yaqoob Chandio was yet to record his statement and according to one police source he might be able to give a fair idea of what led to incidents of violence in Moro on May 20 and subsequent deaths of the two activists.\n\nStatements of filling station staff would also be recorded in addition to those who pertained to the two trailers that were torched by miscreants, said the sources.\n\nDost Mohammad Solangi, caretaker of Lanjar House, who appeared to be armed with a weapon and resorting to firing in viral footages, would be asked to depose before the inquiry officer, they said.\n\nThey told Dawn that the inquiry team was informed that 13 policemen were present at Lanjar House out of 32 who were deputed there and nobody knew where the rest had gone.\n\n“Most of the policemen have given stereotypical statements. Inquiries on ground are likely to reveal [more] facts,” said a source privy to the inquiry committee.\n\nDSP Mohsin Raza, who was posted in headquarters, said that the banned JSMM had announced protest for which a contingency plan was devised by Naushahro Feroze SSP.\n\nHe said that they proceeded to check all deployments of police when they received information that miscreants of the banned JSMM were reaching the highway to block it.\n\nHe said that he and Moro SHO Mujeeb Narejo rushed to the spot where DSP Qalandar Bux Soomro was making some announcement on a megaphone but soon miscreants pelted his vehicle with stones and then started firing.\n\nThe two DSPs said that they had then reached Lanjar House after receiving information about disturbances. Police dispersed the intruders, said Raza.\n\nThen SHO Mujeeb Narejo said that when he reached National Highway he received report that 50 to 60 activists of JSMM were reaching Moro bypass. DSP Qalandar Bux was asking activists over megaphone to avoid blocking the highway, but they did not listen and instead attacked police party and vehicles with stones, he said.\n\nThen DIB in-charge Inspector Shahid Ali Dahraj said that on social media platform the banned JSMM had announced blocking Moro bypass near National Highway. At around 3pm about 100-150 protesters began violence, he said, adding that he had also reached Lanjar House, which had been ransacked and torched by the mob.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:35:43.652Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914381/police-officials-statements-fail-to-pinpoint-triggers-behind-moro-violence",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:52:13.000Z"
}
