{
  "title": "At Balochistan grand jirga, PM stresses need to win back ‘misled’ people - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Saturday said that people who were “misled” by terrorists in Balochistan must be brought back on board, stressing the need for resolving issues through dialogue.\n\nThe security situation in Balochistan has worsened in recent months, as militants, long involved in a low-level insurgency, have stepped up the frequency and intensity of their attacks. The outlawed Balochistan Liberation Army, in particular, has adopted new tactics to inflict higher casualties and directly target Pakistani security forces.\n\nLast month, ISPR Director General Lt Gen Ahmed Sharif Chaudhry accused India of activating its “assets” to inte­nsify terrorist attacks in Pakistan, presenting “irr­e­futable evidence” of Ind­ian state-sponsored terrorism, directed by the Ind­ian military personnel.\n\nSpeaking at the Balochistan Grand Jirga in Quetta, PM Shehbaz said, “The terrorists [in Balochistan] must not be tolerated by the public, government or armed forces.\n\n“We must make efforts to bring back the people who were misled [by the terrorists] onto the wrong track.”\n\nHe added that economic or social injustices cannot happen in Balochistan during his rule and stressed collectively solving the issues through talks.\n\n“If there are any concerns, brothers need to sit together to solve those issues,” he emphasised. “The blood-thirsty terrorists who are against Pakistan’s success and welfare must be stopped. I want to ask what the gaps [there] are that we can fill with your suggestions [to solve problems].”\n\nThe government has designated all terrorist organisations in Balochistan as Fitna al Hindu­stan, state media PTV News reported.\n\nThe term ‘Fitna al Hindu­stan’ is a new phrase coined by Pakistan’s military, aimed at framing India’s alleged role in terrorism as a deliberate destabilisation strategy, potentially to galvanise domestic support.\n\nA notification from the Ministry of Interior said, “… All terrorist groups and organisations operating in Balochistan will be referred to as ‘Fitna al Hindu­stan’.”\n\n“The change aims reflect the true nature and ideology of these terrorist organisations and groups, and nefarious designs of India against the people of Pakistan.”\n\nThe premier also announced that Balochistan will receive Rs250 billion in development funds from the federal budget.\n\nHe said, “In the upcoming budget, the federal-funded Public Sector Development Programme (PSDP) for provinces and [the] federation will be Rs1 trillion in total. Balochistan will get Rs250bn, which is 25 per cent of the total PSDP.”\n\nHe added, “To me, even that seems like a small amount.\n\n“Whether it is Gwadar, Pasni, Chaman, Qila Saifullah, Quetta, Jhal Magsi or any other place, every penny of these resources must be honestly utilised for the public’s welfare.”\n\nThe premier also highlighted past development projects in the province, such as the Rs70bn solar initiative for farmers and the N-25 Highway.\n\nLast month, PM Shehbaz announced that instead of passing on the relief of reduced oil prices in the international market to consumers, the government would use the saved money for the reconstruction of the N-25 Highway and completion of Phase-II of the Kachhi Canal project in Balochistan.\n\nAddressing the event today, he further said, “In 2010, Punjab gave Rs11bn in NFC to Balochistan [and] that would be around Rs155-160bn today. But for the sake of national unity, even Rs1600 billion would not be too much.”\n\n“The vastness of Balochistan demands greater investment,” he added.\n\nEarlier on Saturday, the PM said that Pakistan was “flying high” off the back of its victory in a military conflict against India and economic progress made since he took office as prime minister.\n\nThe comments, made during an address at the Quetta Command and Staff College, followed a recent military confrontation between India and Pakistan over New Delhi’s allegations against Islamabad, without evidence, about a deadly attack in occupied Kashmir’s Pahalgam.\n\nNew Delhi, based on the allegations, launched a series of air strikes in Pakistan in early May, killing civilians. Islamabad retaliated by downing five Indian jets. It took American intervention on May 10 for both sides to finally reach a ceasefire.\n\nIndia, however, is still weaponising the Indus Waters Treaty (IWT) — a water distribution deal between the two countries — saying that it will no longer abide by the treaty, placing the agreement in “abeyance”.\n\nIn his address today, PM Shehbaz congratulated the military personnel in attendance on their counter-operations against India. He said these operations had left New Delhi “completely baffled and shell-shocked”.\n\n“We won a war against an enemy, which in the eyes of our detractors was unthinkable, but we have converted this unthinkable into a reality, and I think that is our finest hour in history,” he stated. “Pakistan at this point in time is flying high.”\n\nPM Shehbaz noted that the conflict with India was not only victorious, but illustrated that the threats Pakistan faces are no longer restricted to conventional battlefields.\n\n“They [threats] are multifaceted, ranging from kinetic warfare to cyber attacks, economic coercion, disinformation campaigns and hybrid threats that challenge both our borders and ideological frontiers,” he elaborated.\n\n“The recent Indian aggression … was not only countered successfully, but we turned the tables on those who tried to establish a new normal,” he added. “Indian leaders had no option but to concoct a patently false explanation for their losses. Operation Bunyanum Marsoos destroyed the enemy’s defences and shattered the myth of their military might.”\n\nThe PM highlighted that Pakistan “established a new norm” in its relations with India, warning that the country will never let its neighbour “behave in an arrogant and haughty manner”. He also reiterated that Pakistan would not allow India to continue weaponising the IWT, calling it a “red line”.\n\n“We need to convert this moment into something this nation has been longing for — that Pakistan’s progress … would not only be witnessed [and] enjoyed by [the people], but that the world at large would respect Pakistan’s hard work,” he added.\n\nNoting Pakistan’s victory on the battlefield, the prime minister said that the country “faces major challenges” on the economic front.\n\nHighlighting economic difficulties during his tenure in 2022, Shehbaz said, “International banks were refusing our letters of credit for vital imports like energy … linked to Pakistan’s wellbeing”, and the country faced the threat of international lending agencies walking away.\n\n“As a result of that meeting in Paris in July 2023, we were able to sign a standby agreement with the IMF, which averted an impending economic meltdown,” the PM said.\n\nHe added that upon assuming office in 2024, his administration “wasted no time” implementing major reforms and making “cast-iron guarantees to lending agencies”.\n\n“We would not shy away from undertaking difficult, tough, but very relevant, deep-rooted changes in our system,” he said. “We undertook those very difficult decisions and we were able to calm those fears of our lending partners. Today, we are witnessing the fruits of those sacrifices made by the common man in Pakistan.”\n\nAccording to the PM, inflation plummeted from 38 per cent to 0.3pc, while interest rates were halved from 22.5pc in 2022 to 11pc.\n\n“Our rupee stands stable [and] forex reserves have crossed over a billion dollars,” he said.\n\n“These achievements, significant as they are, represent only the beginning of a very arduous, difficult, thorny journey towards progress and prosperity. On the way, we will meet huge challenges like mountains, rivers — we will have to surmount them [and] cross those rivers through unwavering commitment to our nation and our people, and that will require sacrifices, sweat and blood,” he emphasised.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/31202431cf51ea0.png",
  "retrievedAt": "2025-08-23T14:35:35.565Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914525/at-balochistan-grand-jirga-pm-stresses-need-to-win-back-misled-people",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T13:15:15.000Z"
}
