{
  "title": "NA panel urges review of Utility Stores Corporation divestment - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Following the National Assembly’s Standing Committee’s advice to review the government’s decision regarding the divestment of the Utility Stores Corporation (USC), the Privatisation Commission promised to present the recommendation to the Cabinet Committee.\n\nSecretary of Privatisation Usman Akhtar Bajwa informed the standing committee on Friday that the Cabinet Committee and the Federal Cabinet are the appropriate fora for including state-owned enterprises in the privatisation programme.\n\nHowever, he assured that the recommendations from the standing committee would be presented to both the Cabinet Committee on Privatisation (CCoP) and the Federal Cabinet.\n\nA senior official from the Ministry of Finance briefed the committee on the status of Rs48 billion promissory note and the interest accrued thereon. He informed the committee that in 2021-22, Rs14bn was provided to Postal Life Insurance Company Ltd (PLICL), and the government stands committed to paying the remaining amount.\n\nOn the other hand, the representative of PLICL informed the committee that the finance ministry is not paying sufficient amounts to meet the claims, which is why the number of clients has dropped to half.\n\nAfter thorough deliberation on the issue, the committee observed that the PLICL stance is justified and recommended that an amount of Rs8bn must be provided by September. The committee also recommended that PLICL must ensure that it protects the policyholders’ rights.\n\nThe representatives of Peshawar Electric Supply Company and Hyderabad Electric Supply Company briefed the committee on the progress of the privatisation process.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:23:18.904Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914437/na-panel-urges-review-of-utility-stores-corporation-divestment",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:51:52.000Z"
}
