{
  "title": "Law ministry slammed over inaction on reforms - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Lahore High Court, Rawalpindi bench, has expressed displeasure over the failure of the Ministry of Law and Justice to respond to its earlier directives regarding legislative reforms on matrimonial property rights and warned summoning of federal minister for law and justice if the matter remains unresolved.\n\nThe court, presided over by Justice Jawad Hassan, is hearing a writ petition filed by Saima Shafi, which raises constitutional questions surrounding maintenance allowances for women beyond the iddat period.\n\nDuring the hearing on May 29, the LHC reiterated the importance of consulting experts and the general public on the proposed Muslim Family Law (Amendment) Act 2024 presented by Senator Barrister Syed Ali Zafar.\n\nThe bill proposes major amendments to the Muslim Family Laws Ordinance 1961 introducing concepts such as “Husband’s Asset,” “Matrimonial Asset,” and “Wife Asset” to recognise women’s rights in marital property.\n\nThe court emphasised that the legislative proposal must be reviewed in the context of Islamic teachings, the Constitution of Pakistan, and comparative global practices.\n\nJustice Jawad Hassan expressed his concern that despite clear directions issued in earlier hearings, the ministry had failed to appear or provide any input. He ordered that Secretary Law and Justice Raja Naeem Akbar must appear in person at the next hearing scheduled for June 18, along with a detailed report on the formation of a consultative committee.\n\n“In light of the public importance of this case, separate notice under Order XXVII-A of the Code of Civil Procedure shall also be issued to the Attorney General for Pakistan,” the order stated.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:36:08.415Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914424/law-ministry-slammed-over-inaction-on-reforms",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:51:46.000Z"
}
