{
  "title": "‘Cold Start’ for collaboration - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE Indus Waters Treaty (IWT) is the subject of many ongoing discussions these days. A variety of opinions are being shared by people looking at the treaty through different lens.\n\nHowever, the most important question remains whether India has the capacity to use water as a weapon of war against Pakistan. This at once gives a new dimension to the treaty, requiring a perspective that is not merely legal but also political, with many layers of complexities.\n\nThe IWT is not merely a treaty between an upper and lower riparian country. It is a treaty between two states that have gone to war many times previously, with no sign of any long-term cessation in hostilities. The IWT can be re-examined, taking into account the changes that have taken place since 1960 when it was signed. This includes both climatic factors and changes in the political landscape.\n\nClimate change has already reduced the snow mass by 30 per cent in the upper Indus basin lar­g­e­­ly due to the depletion of wetlands, urbanisation, and glacier melt. This trend is likely to increase, ca­­using a reduction in flow and a decrease in water availability as well as making water more contentious.\n\nThe political landscape has undergone a massive change after Indian Prime Minister Narendra Modi’s 2016 statement that water and blood cannot flow together.\n\nAny discussion on the IWT will remain incomplete and unrealistic if it does not factor the above-mentioned points into the calculus. This also means that if both are not addressed simultaneously, water will remain a live threat looming over the fate of the region. The nuclear red line offers retaliatory action but is not a solution to the problem.\n\nIndia’s plans for the Chenab are a matter of deep concern for Pakistan.\n\nWhile accelerated melting and concomitant reductions in flows due to global warming are not within the management capacity of the two countries, both can, in the interest of peace, collaborate on issues related to water and security.\n\nOn the political front, the currently volatile situation is unsustainable, making water a source of continued regional tension. Having a single basin, a single river and being a lower riparian to a hostile upper riparian, Pakistan has reservations about discussing the treaty as it might derail the current arrangement without adding additional safeguards.\n\nWhile the concern is legitimate, the country can propose a conversation that is built on the principles of ensuring sustainable flows and equitable water-sharing.\n\nSupplementary protocols within the existing treaty and under the jurisdictional purview of the IWT commissioners can address issues like the permissible cumulative capacity for live storage, environmental flows, demographic changes, telemetric information-sharing, and most importantly, the environmental impact assessment (EIA) of planned infrastructure as part of the discussion agenda.\n\nAfter 2019, India has given an EIA exemption to all infrastructure being built within 100 kilometres of the LoC. While technical studies rule out the possibility of earthquakes getting triggered by the construction of dams in this highly seismic geography, it does not exclude the possibility of dams collapsing and causing massive losses to downstream communities.\n\nPakistan does not face any serious threat on the Jhelum River from India. Most people in India-occupied Kashmir have shifted from agriculture to horticulture which does not require large quantities of water. Moreover, diverting water in a mountainous territory for the construction of canals and tunnels is not easy. With its current capacity, India could delay the release of water by 16 to 24 hours at best. Beyond that, it risks flooding the whole area including big towns like Jammu.\n\nHowever, India’s plans for the Chenab are a matter of deep concern for Pakistan. India started plans in 2016 to develop the capacity to weaponise water. This is being done by building capacity purely for storage to withhold water. These projects on the Chenab are not designed as hydroelectric projects but as military structures to use water as a weapon of war.\n\nA discussion on the treaty will allow Pakistan to address issues that were not a concern in 1960 but which now pose an existential threat to the country. However, none of this will be possible without lowering tensions and improving the overall environment for a conducive conversation.\n\nThe 2022 Pakistan National Security Policy made a statement of intent to prioritise geo-economics, but circumstantial roadblocks prevented the agenda from moving forward.\n\nRegional water security will hang in the balance till we untie the Gordian knot. This can be done by decoupling politics from other issues or reaching a collaborative arrangement on climate. Both nations need to take a cue from countries that are separating politics from the economy and moving forward with a new paradigm.\n\nAfter 78 years of conflict, Pakistan and India need to realise that climate change is a bigger enemy and poses a greater threat to their survival. All contentious issues will become irrelevant in the face of the existential threat that confronts us.\n\nWe have a ‘Cold Start’ for conflict, but what we need is a ‘Cold Start’ for collaboration to be better prepared for a rapid response to combat the forces of nature.\n\nThe IWT will come under increasing pressure if political issues are not addressed. The treaty stood the test of time for 65 years because climate imp­acts had not become so threatening and political tensions had not mounted to the current incendiary levels. It is time for both countries to shift from a ‘Mutually Assured Destruction’ (MAD) to a ’Mu­­tually Assured Survival Strategy (MASS). Passion in politics is a poisonous recipe for South Asia and its two billion inhabitants. It is time to pause, reflect and think about the future pragmatically.\n\nThe writer is the chief executive of Civil Society Coalition for Climate Change.\naisha@csccc.org.pk\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683a5fd1056e1.jpg",
  "retrievedAt": "2025-08-23T14:35:40.717Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914460/cold-start-for-collaboration",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:52:39.000Z"
}
