{
  "title": "Pakistan won’t let India weaponise water, says PM Shehbaz - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Suspension of Indus Waters Treaty a ‘red line’, Shehbaz tells Dushanbe glacier summit\n• Says millions of lives must not be held hostage to ‘narrow political gains’\n• Terms 2022 floods a consequence of glacial melt\n• Tajik president wants global plan to save melting glaciers\n\nDUSHANBE: Rejecting the “weaponisation of water”, Prime Minister Shehbaz Sharif on Friday warned that Pakistan would not allow India to cross the “red line” by suspending the Indus Waters Treaty, describing any such move as a reckless act that would jeopardise millions of lives for narrow political gain.\n\n“India’s unilateral and illegal decision to hold in abeyance the Indus Water Treaty, which governs the sharing of the Indus Basin’s water, is deeply regrettable,” the prime mi­n­ister said while addr­essing the High-Level Int­e­rnational Conference on Glaciers Preservation. “Millions of lives must not be held hostage to narrow political gains, and Pakistan will not allow this. We will never allow the red line to be crossed.”\n\nThe three-day conference, held in Tajikistan’s capital Dushanbe from May 29-31, brought toge­ther over 2,500 delegates from 80 UN member states and 70 international orga­ni­sations, including prime ministers, vice presidents, ministers, and UN assistant secretaries-general.\n\nHosted by the government of Tajikistan in collaboration with the United Nations, Unesco, World Meteorological Organisa­tion (WMO), and the Asian Development Bank, the summit aimed to push forward the agenda for glacier protection and international climate cooperation.\n\nIn his address, Prime Minister Shehbaz touched all the relevant issues, including glacial preservation, Pakistan’s climate vulnerability, the 2022 floods in Pakistan, global climate action and responsibility, scientific projections on glacial melt, weaponisation of water, and a call to protect nature and humanity’s shared destiny.\n\n“The world today bears fresh scars from the use of conventional weapons in Gaza that have left deep wounds. As if that were not enough, we are now witnessing an alarming new low — the weaponisation of water,” he told participants.\n\nThe 77th session of the United Nations General Assembly, through a resolution, declared 2025 as the International Year of Glaciers Preservation, designated 21 March as the annual World Day for Glaciers beginning in 2025, and assigned the government of Tajikistan to host the inaugural international conference on the subject that year.\n\nPrime Minister Shehbaz reminded the international audience that Pakistan, with over 13,000 glaciers, was among the countries most vulnerable to climate change. These glaciers contribute nearly half of the annual flows in the Indus River system, which sustains Pakistan’s civilisation, culture and economy.\n\n“The five great rivers that shape our geographical landscape — Indus, Jhelum, Chenab, Ravi and Sutlej — all depend on the stability of glacial systems. This makes Pakistan one of the most vulnerable countries to any climatic changes that impact glaciers,” he added.\n\nHe told the international gathering that Pakistan had faced the peril of glacial melt in the form of devastating floods in 2022, which destroyed millions of acres of standing crops and hundreds of thousands of houses and infrastructure, despite Pakistan’s only less than half a per cent contribution to the total world emissions.\n\nReferring to the “sobering” scientific projections, he highlighted that glacial melt in our region was expected to accelerate flooding in the coming decades, followed by a drastic decline in river flows as glaciers recede further.\n\n“These changes threaten our fragile ecosystem. As we inch closer to these grim new realities, we must heed the alarm bells, deflection signs of haunting consequences — lost livelihoods, displaced families and deep chaos,” he warned.\n\nHighlighting Pakistan’s commitment to shared responsibility and collective action, he called for enhanced global climate action to mitigate the negative impacts of climate change.\n\n“The developed countries must meet their climate financial commitments without any delay and with a balanced focus on adaptation and mitigation as well as loss and damage,” the prime minister said.\n\n“Adequate funding for climate resilience, infrastructure and overcoming financing gaps remains critical for climate-vulnerable countries. Investment must be made in early warning systems and disaster preparedness and management,” he added.\n\nMeasures to protect glaciers\n\nPresident Emomali Rahmon of Tajikistan, co-hosting the international conference, called on the world to take urgent and coordinated action to safeguard glaciers, warning that their rapid melting poses a global crisis.\n\n“I want to note clearly that glaciers preservation is not just a problem of countries with glaciers but rather a global crisis that deserves the immediate attention of the international community,” President Rahmon said.\n\nHe urged comprehensive monitoring and scientific research to better understand glacier dynamics, their role in ecosystems and their socio-economic impacts.\n\nHe suggested that countries with the ability to collect accurate data on the state of glaciers, particularly through satellites, should establish a regular exchange of information with countries that lack such capabilities.\n\nThe president called for implementing collective actions to address the socio-economic consequences of glacier melting, including its impact on accessing water, ensuring food security, producing electricity, and protecting cultural and natural heritage.\n\n“We must make every effort to ensure the implementation of the Paris Agreement on Climate Change and take the necessary measures to prevent an increase in global temperature,” he said.\n\nTajikistan, with 93 per cent of its territory covered by mountains, is home to the largest glaciers in Central Asia. “So far, 1,300 out of 14,000 glaciers have completely melted. These glaciers supply 60pc of the region’s drinking water,” he said.\n\nPresident Rahmon stressed that climate change had already caused the loss of about a third of mountain glaciers around the world and this process is not just an environmental problem but is closely related to many aspects of human life. “Tajikistan’s glaciers are vital not just for regional rivers, but for climate stability worldwide,” he said.\n\nCiting the Fedchenko Glacier, one of the world’s largest continental glaciers, President Rahmon said it could yield thousands of years of climate data crucial for future strategies. He called on all countries to support Tajikistan’s proposal to develop a global preservation framework under the United Nations.\n\nPublished in Dawn, May 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:23:04.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914446/pakistan-wont-let-india-weaponise-water-says-pm-shehbaz",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T01:51:32.000Z"
}
