{
  "title": "Families of India’s plane crash victims call for release of flight recorders - World - DAWN.COM",
  "author": null,
  "content": "AHMEDABAD: Families of the victims of June’s deadly Air India crash demanded on Friday the immediate release of the aircraft’s two flight recorders, saying delays were eroding their trust in the investigation.\n\nA total of 241 people on board the London-bound Boeing 787 Dreamliner were killed when the plane crashed shortly after takeoff from Ahmedabad, in western India, on June 12. Another 19 people were killed on the ground.\n\nA preliminary investigation report by India’s aircraft accident investigation bureau said fuel to the jet’s engines was cut off moments before impact.\n\nThe report did not offer any conclusions or apportion blame for the disaster, but indicated, based on the cockpit voice recording, that one pilot asked the other why he cut off fuel. The second pilot responded that he had not.\n\n“We are formally demanding the immediate release of the cockpit voice recorder and flight data recorder — the black box,” said Imtiaz Ali Sayed, a relative of several victims.\n\n“These devices contain vital information that can reveal the truth behind this horrific tragedy,” he said in a media statement.\n\nSayed, whose younger brother, his wife and their two children were killed in the crash, said he was speaking on behalf of 60 families “who share the same pain and unanswered questions”.\n\n“Every day without answers deepens the pain of our loss and erodes public trust in aviation safety,” he said.\n\nSome of the families are exploring legal action against Air India and Boeing, the plane’s US manufacturer, their lawyer said. Mike Andrews of the US-based Beasley Allen Law Firm, representing 65 families from India and Britain, met relatives in Vadodara, south of Ahmedabad, on Friday after visiting the crash site.\n\n“Suppose the flight data recorder and cockpit voice recorder indicate that there is a defect with the aircraft … in that case, the options are to bring a defective product or a product liability claim in the United States for those claims,” he told reporters.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:19:16.473Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929665/families-of-indias-plane-crash-victims-call-for-release-of-flight-recorders",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:51.000Z"
}
