{
  "title": "Noor storms into World Games last 16, Nasir exits - Sport - DAWN.COM",
  "author": null,
  "content": "CHENGDU: Pakistan’s squash players suffered contrasting fortunes on Friday as rising star Noor Zaman advanced while veteran Nasir Iqbal fell during the World Games in Chengdu, China.\n\nThe 21-year-old Noor demolished China’s Chen Haisong in straight games 11-2, 11-2, 11-0 during their round-of 32-clash, announcing his title ambitions emphatically.\n\nDisplaying ruthless precision and a devastating mix of attacking shots and flawless court coverage, Noor — who won the Under-23 World Squash Championship in April — overwhelmed his opponent, the home favorite, in just 18 minutes.\n\nA visibly pleased Coach Fahim Gul lauded Noor’s focus and execution.\n\n“Noor came in with a clear game plan and executed it perfectly,” Fahim told APP. “He didn’t let the occasion or the home crowd affect him. This is the mindset we’ve been working on.”\n\nFahim added, signaling bigger goals, “This is just the start; we’re aiming for something big here.”\n\nPakistan’s day, however, was bittersweet. Compatriot Nasir was ousted from the championship but put up a spirited fight in his own round-of-32 match.\n\nNasir, 31, pushed the higher-ranked Swiss player competitively throughout each game but ultimately lost 8-11, 8-11, 7-11 to world No 16 Dimitri Steinmann of Switzerland.\n\nReflecting on Nasir’s performance, coach Fahim acknowledged the effort: “Nasir fought hard against a top opponent, and there are positives to take. He matched Steinmann in rallies but lacked finishing at key moments.”\n\nEarlier on Friday, Switzerland’s Riccardo Rancan won the first gold medal of the Games, finishing the men’s middle distance orienteering event in 45 minutes and 22 seconds.\n\nOrienteering, a sport that originated in Sweden over a century ago, requires athletes to navigate unfamiliar terrain using only a map and compass. Competitors race against the clock to reach a series of control points in order. The fastest finisher wins.\n\nGerman karateka Mia Bitsch won the women’s kumite 55kg gold medal match against Ukraine’s Anzhelika while Turkiye’s Eray Samdan took the men’s kumite 60kg gold after downing Japan’s Hiromu Hashimoto in the final.\n\nIran’s Sara Bahmanyar won the women’s kumite 50kg competition, beating Kazakhstan’s Moldir Zhangbyrbay in the gold medal match, and Morocco’s Said Oubaya clinched the men’s 67kg kumite gold.\n\nHosts China’s first gold of the Games was delivered by Lu Zhuoling, who won the women’s Wushu Taijiquan-Taijijian.\n\nThe 21-year-old scored a total of 19.522 points, finishing ahead of Singapore’s Zeanne Law (19.430) and Chin Sy Xuan Sydney of Malaysia (19.410).\n\nIn the Taijiquan and Taijijian combined routines, athletes demonstrate a variety of techniques, and the winner is determined by the highest score awarded by judges after completion.\n\nGermany’s Marius-Andrei Balan and Khrystyna Moshenska claimed gold in the Latin Dance, one of the centerpiece disciplines of dancesport at the World Games, which gather elite athletes from non-Olympic sports across the globe.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/6896889274983.gif",
  "retrievedAt": "2025-08-16T07:19:30.448Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929638/noor-storms-into-world-games-last-16-nasir-exits",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:47.000Z"
}
