{
  "title": "Pakistan Medical and Dental Council refutes claims of 80pc fee increase for MDCAT 2025 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistan Medical and Dental Council (PMDC) on Saturday refuted claims of a fee increase of 80 per cent for their colleges admission test, announcing that the test is scheduled for October 5 this year.\n\nThe PMDC is the national statutory organisation responsible for regulating the standards of medical and dental education throughout the country.\n\nIn a press release today, PMDC announced that the Medical and Dental Colleges Admission Test (MDCAT) was scheduled to be held on Sunday October 5, while addressing the concerns regarding the fee.\n\n“It has come to the notice of the Pakistan Medical and Dental Council (PMDC) that there has been a misunderstanding regarding the MDCAT examination fee, which claims that it has increased by 80pc,” it said.\n\n“PMDC would like to clarify that the fee for the MDCAT has increased modestly and gradually over the past years,” it added, noting that it was Rs8,000 in 2024 and is set at Rs9,000 for 2025 — the Rs1,000 increase marking an increment of only 12.5pc, not 80pc as had been circulated on social media.\n\nIt also said that the exam would be conducted by universities nominated by federal and provincial authorities, rather than by PMDC.\n\n“However, PMDC as a regulator has developed a uniform syllabus for the MDCAT in consultation with all stakeholders,” it said, adding that it had also “invested heavily” in developing a question bank based on a common syllabus agreed upon by the provinces.\n\nAccording to the statement, the council’s decision to revise the fee upon the request of the examination-conducting universities was due to the rising costs of paper printing, enhanced security protocols and logistical arrangements, as well as payments for examiners, invigilators, and administrative staff and to ensure adequate seating and facilities for candidates.\n\n“Despite significant inflation and increasing operational costs, PMDC remains steadfast to affordability and fairness,” PMDC said, stressing that the council had taken a “balanced approach to ensure that the exam remains accessible to all candidates while maintaining quality and integrity in the testing process”.\n\nIt reaffirmed its commitment to “transparent, responsible, and merit-based admissions” to ensure equal opportunities for all aspiring medical and dental students.\n\nThe MDCAT will be conducted through the following universities: University of Health Sciences, Lahore for Punjab; Sukkur IBA University, Sukkur for Sindh; Khyber Medical University, Peshawar for Khyber Pakhtunkhwa; Bolan University of Medical and Health Sciences, Quetta for Balochistan; and Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad for Islamabad Capital Territory, Azad Jammu and Kashmir, Gilgit-Baltistan as well as PMDC’s international venue in Riyadh, Saudi Arabia.\n\nOnline registration for both local and international MDCAT candidates began yesterday and will close on August 25, 2025. After this date, late fees will be required for registration until the cutoff on September 1, 2025.\n\nPMDC warned that candidates would have to “carefully select one city/centre for the MDCAT and fill out the application with all necessary requirements” otherwise the application would be rejected by the online system.\n\nThe statement added that the test would be a paper-based exam conducted in English, comprising 180 multiple choice questions with no negative marking. Of the 180 questions, 81 will be about biology, 45 chemistry, 36 physics, nine English, and nine logical reasoning.\n\nIt directed candidates to the exam’s syllabus available on their website, advising that candidates must complete their registration through mdcat.pmdc.pk. It warned that incomplete applications would not be accepted.\n\nIn June, the PMDC issued a decision to restrict MDCAT candidates to their respective provinces, sparking controversy as parents feared the decision could compromise the safety and well-being of students, many of whom had seldom traveled to their native areas.\n\nThe Pakistan Medical Association (PMA), the representative body of doctors, rejected the decision, demanding that the notification be withdrawn. The PMA argued that the policy would disproportionately disadvantage students from less developed areas and limit accessibility to medical education.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:18:19.460Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929746/pakistan-medical-and-dental-council-refutes-claims-of-80pc-fee-increase-for-mdcat-2025",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T10:33:01.000Z"
}
