{
  "title": "Four astronauts home from space station after successful splashdown - World - DAWN.COM",
  "author": null,
  "content": "An international crew of four astronauts returned home on Earth on Saturday after nearly five months aboard the International Space Station, returning safely in a SpaceX capsule.\n\nThe spacecraft carrying US astronauts Anne McClain and Nichole Ayers, Japan’s Takuya Onishi and Russian cosmonaut Kirill Peskov splashed down off California’s coast at 8:44am local time (8:34pm PKT).\n\nTheir return marks the end of the 10th crew rotation mission to the space station under Nasa’s Commercial Crew Program, which was created to succeed the Space Shuttle era by partnering with private industry.\n\nThe Dragon capsule of billionaire Elon Musk’s SpaceX company detached from the International Space Station (ISS) at 2215 GMT (3:15am PKT) on Friday.\n\nThe capsule’s dizzying, 17-hour drop back down to Earth was slowed when it re-entered the atmosphere, then further reined in by the deployment of huge parachutes.\n\nAfter the capsule splashed down, it was recovered by a SpaceX ship and hoisted aboard. Only then were the astronauts able to breathe Earth’s air again, for the first time in months.\n\nThe astronaut team, known as Crew-10, conducted numerous scientific experiments during their time on the space station, including studying plant growth and how cells react to gravity.\n\nTheir launch into space in March allowed two US astronauts to return home after being unexpectedly stuck on board the space station for nine months.\n\nWhen they launched in June 2024, Butch Wilmore and Suni Williams were only supposed to spend eight days in space on a test of the Boeing Starliner’s first crewed flight.\n\nHowever, the spaceship developed propulsion problems and was deemed unfit to fly back, leaving them stranded in space.\n\nNasa announced this week that Wilmore has decided to retire after 25 years of service at the US space agency.\n\nLast week, US astronauts Zena Cardman and Mike Fincke, Japan’s Kimiya Yui and Russian cosmonaut Oleg Platonov boarded the ISS for a six-month mission.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/092232559859ffe.jpg",
  "retrievedAt": "2025-08-16T07:17:57.094Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929778/four-astronauts-home-from-space-station-after-successful-splashdown",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T17:30:42.000Z"
}
