{
  "title": "Opposition ‘leadership crisis’ will test PTI’s political acumen - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PTI announces intention not to field new names, fight the decision in courts after both houses declare opposition leader slots ‘vacant’\n• Observers say others may take advantage if largest opposition party chooses to ‘sit out’ race for coveted offices\n\nTHE announcement by the custodians of both houses of the parliament — declaring the offices of opposition leaders vacant — and the PTI’s apparent decision to not nominate any other party member for the two coveted parliamentary posts, could lead to another political crisis.\n\nPolitical observers believe that it will be another “strategic and political mistake” by the PTI if it doesn’t nominate new opposition leaders in the Senate and the National Assembly, even if on a temporary basis.\n\nThey believe that a failure to fill these posts will not only provide the government an opportunity to establish a complete hold over parliament, but would also allow them carte blanche when it comes to appointments to key constitutional offices.\n\nHours after an official announcement from the Senate Secretariat declared the seat of Opposition Leader Shibli Faraz “vacant”, and a similar pronouncement regarding the disqualification of Omar Ayub Khan from the National Assembly, the PTI declared it would not nominate new opposition leaders and would challenge the decision in a court of law.\n\nFollowing the move, Omar Ayub Khan told Dawn he would file a contempt application, as declaring his seat vacant was a clear violation of a recent Peshawar High Court (PHC) order, which had restrained the ECP from proceeding with his disqualification.\n\n“They cannot invite names for the leaders of the opposition in both houses because the PHC has clearly ordered that such a step cannot be taken. Moreover, other opposition parties do not have [the] strength to get an opposition leader elected. As the PTI is the largest opposition party in both houses, it cannot be deprived of [the right to have its] opposition leaders,” he explained.\n\nSimilarly, former NA speaker Asad Qaiser termed the development “disappointing”, saying that it betrayed haste on the government’s part.\n\n“Currently, there is a sham democracy in the country… the government can do anything,” Mr Qaiser said sarcastically when asked what the party would do if the speaker nominated someone from, say, the JUI-F — the second largest opposition party in both houses.\n\nAccording to Ahmed Bilal Mehboob, who heads the Pakistan Institute for Legislative Development and Transparency (Pildat), there is no timeframe specified for the election of the opposition leader, but the assembly rules suggested that he/she should be nominated as soon as possible, as they are assigned certain key constitutional functions, including consultation over the names of the next chief election commissioner, and members of the ECP.\n\n“A vacancy in the office will impair parliamentary work as the leader of opposition has to represent the opposition in the Business Advisory Committee, which decides daily priorities and schedule of parliamentary business,” he said.\n\n“A lack of the opposition representation in this important committee will negatively impact the quality of parliamentary proceedings,” Mr Mehboob noted.\n\nAccording to the rules, the speaker is supposed to fix a date by which members of the opposition have to submit the name of the leader of the opposition along with their signatures.\n\nThe speaker, after verifying the signatures, will declare the member who has the greatest numerical strength as opposition leader, he said.\n\n“Irrespective of the validity of the conviction and disqualification of the leaders of opposition, their offices should be filled as soon as possible,” he said.\n\nThe PTI, he said, should join this exercise, because even “if it doesn’t join, the remaining opposition members will submit the name and someone will be appointed as opposition leader.”\n\nHe said the PTI should not forget how the government had previously managed to appoint a friendly opposition leader Raja Riaz.\n\nTalking to Dawn, Mudassar Rizvi of the Free and Fair Election Network (Fafen) recalled that during the 2014 sit-in outside parliament, PTI MNAs had resigned en masse — a decision that put them at a disadvantage.\n\nEven after the disqualification of its legislators, the PTI was still the largest party in both houses, he said, and should therefore keep the opposition leader offices to maintain its strength.\n\nAnything else would be a “political blunder”, and some other party could get its hand on all the important positions, despite having less representation than the PTI.\n\nSenior journalist MB Soomro, who has been covering parliamentary proceedings for over two decades, also termed the present situation “alarming”, and pointed out that the country’s largest legislature, the Punjab Assembly, was also without an opposition leader after the disqualification of Malik Ahmad Khan Bhachar.\n\nHe recalled how Maulana Fazlur Rehman was nominated opposition leader in the NA during the Mushar­raf regime, even though the combi­ned strength of the PPP and PML-N — who were part of the Alliance for Restoration of Demo­cracy at the time — was greater than the Muttahida Majlis-i-Amal alliance.\n\nAt the time, he said, the speaker had used his discretionary power to nominate the opposition leader.\n\nSince then, however, the rules have changed, and if such a situation arises again, it would be an “unethical move”, even if it is constitutionally valid.\n\nGiven the party position in the assemblies, Mr Soomro said the PTI could easily retain these offices in both houses of the parliament, provided it joined the race. The JUI-F only has 10 MNAs and seven senators, so there seems to be no justification to hand the party these key offices in the present scenario.\n\nIn his view, the PTI should put forward nominations for these offices. If the grapevine is to be believed, he said, the name of PkMAP chief Mehmood Khan Achakzai was already being whispered as a potential replacement for Omar Ayub in the National Assembly.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689699d8e3a7b.gif",
  "retrievedAt": "2025-08-16T07:20:28.813Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929686/opposition-leadership-crisis-will-test-ptis-political-acumen",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:24.000Z"
}
