{
  "title": "Defence minister rubbishes Indian air chief’s ‘comical’ claims of downing 6 Pakistani aircraft in May conflict - World - DAWN.COM",
  "author": null,
  "content": "Defence Minister Khawaja Asif on Saturday rubbished what he said were “implausible” and “comical” claims by the Indian Air Force chief that the country had shot down five Pakistani fighter jets and one other military aircraft during clashes in May.\n\nThe comments are the first such statement by the Indian side three months after its worst military conflict in decades with its neighbour. During the conflict, Pakistan said it downed five Indian planes in air-to-air combat on May 7, later stating that figure as six. India’s highest-ranking general has also acknowledged that its forces suffered losses in the air, but denied losing six aircraft.\n\nSpeaking at an event in the southern city of Bengaluru, Indian Air Chief Marshal Amar Preet Singh claimed: “We have at least five fighters confirmed killed, and one large aircraft,” adding that the large aircraft, which could be a surveillance plane, was shot down at a distance of 300 kilometres.\n\nHe alleged that most of the Pakistani aircraft were downed by India’s Russian-made S-400 surface-to-air missile system. He cited electronic tracking data as confirmation of the strikes.\n\nSingh did not mention the type of fighter jets that were downed, but claimed that airstrikes also hit an additional surveillance plane and “a few F16” fighters that were parked in hangars at two air bases in Sindh and Punjab. “This is actually the largest ever recorded surface-to-air kill,” he insisted.\n\nResponding to the claims in a post on X, the defence minister said: “The belated assertions made by the Indian Air Force chief regarding alleged destruction of Pakistani aircraft during Operation Sindoor are as implausible as they are ill-timed.\n\n“It is also ironic how senior Indian military officers are being used as the faces of monumental failure caused by strategic shortsightedness of Indian politicians. For three months, no such claims were voiced — while Pakistan, in the immediate aftermath, presented detailed technical briefings to the international media, and independent observers recorded widespread acknowledgment of the loss of multiple Indian aircraft, including Rafales, by sources ranging from world leaders, senior Indian politicians to foreign intelligence assessments.”\n\nAsif said that “not a single Pakistani aircraft was hit or destroyed” by India, adding that Pakistan took out six Indian jets, S400 air defence batteries and unmanned aircraft of India while “swiftly putting several Indian airbases out of action”.\n\nHe added that the losses on the Line of Control for Indian armed forces were “disproportionately heavier” as well.\n\n“If the truth is in question, let both sides open their aircraft inventories to independent verification — though we suspect this would lay bare the reality India seeks to obscure. Wars are not won by falsehoods but by moral authority, national resolve and professional competence.\n\n“Such comical narratives, crafted for domestic political expediency, increase the grave risks of strategic miscalculation in a nuclearised environment,” he warned.\n\nThe defence minister iterated that every violation of Pakistan’s sovereignty and territorial integrity would invite “swift, surefire and proportionate response, and responsibility for any ensuing escalation will rest entirely with strategically blind leaders who gamble with South Asia’s peace for fleeting political gains”.\n\nFormer envoy Dr Maleeha Lodhi said the Indian air chief’s claim was “laughable”, noting that it took him “several months to count the planes to make this ridiculous assertion!”\n\nMeanwhile, Indian Congress spokesperson Pawan Khera said when questioned about the matter: “The question we have after today’s information … when we had such a strong army and we were advancing then under whose pressure did you stop Operation Sindoor?”\n\nAmerican South Asia expert Michael Kugelman opined that “regardless of whether true or not, the timing of these claims, with US-India ties in crisis, is easy to understand.”\n\nPakistan, with the Pakistan Air Force (PAF) primarily operating Chinese-made jets and US F-16s, has previously denied that India downed any aircraft during the May 7-10 fighting between the nuclear-armed neighbours.\n\nUS officials have told Reuters previously that they were not aware that any F-16 planes inside Pakistan had been hit.\n\nNew Delhi had previously claimed it had downed “a few planes”. United States President Donald Trump has echoed the figure of “five jets” shot down during the military confrontation, albeit without specifying which side’s craft he was referring to.\n\nIndian Prime Minister Narendra Modi’s government has faced scathing criticism from opposition parties for its lack of “political will to fight” during the May clashes and “failures” to prevent the Pahalgam attack.\n\nThe May conflict was sparked by New Delhi’s allegations against Islamabad, which were without evidence and strongly refuted by Pakistan, about a deadly attack in occupied Kashmir’s Pahalgam. After the May 7 combat and tit-for-tat strikes on each other’s airbases, it took American intervention on May 10 for both sides to finally reach a ceasefire.\n\nFrance’s air chief, General Jerome Bellanger, has previously said that he has seen evidence of the loss of three Indian fighters, including a Rafale. The Indian Air Force has not commented on those claims.\n\nDays after the air combat, The Washington Post, based on visual evidence analysed by experts, reported that at least two French-made Indian fighter aircraft were shot down by the Pakistan Air Force.\n\nAccording to The Wire, India’s defence attache to Indonesia, Indian Navy Captain Shiv Kumar, while speaking at a seminar in June, acknowledged that the PAF downed the Indian fighters.\n\nDuring his presentation at the event, Kumar had acknowledged the loss of Indian planes. According to Kumar, Indian fighter jets were “operating under strict political orders from the Modi government not to target Pakistani military installations or air defence systems”, The Wire reported.\n\n“This self-imposed limitation by the government was intended to prevent escalation of conflict in a nuclear environment,” the outlet added, quoting the Indian officer.\n\nIndia’s intelligence failure was central to the hour-long air battle between Pakistan and India, which led to the downing of Rafale aircraft by the Pakistan Air Force’s J-10 fighters using PL-15s missiles, according to a report.\n\nReuters interviews with two Indian officials and three of their Pakistani counterparts found that the performance of the Rafale wasn’t the key problem: central to its downing was an Indian intelligence failure concerning the range of the China-made PL-15 missile fired by the J-10 fighter. China and Pakistan are the only countries to operate both J-10s, known as Vigorous Dragons, and PL-15s.\n\nThe faulty intelligence gave the Rafale pilots a false sense of confidence that they were out of Pakistani firing distance, which they believed was only around 150km, the Indian officials said, referring to the widely cited range of PL-15’s export variant.\n\n“We ambushed them,” the PAF official said, adding that Islamabad conducted an electronic warfare assault on Delhi’s systems in an attempt to confuse Indian pilots. Indian officials dispute the effectiveness of those efforts.\n\n“The Indians were not expecting to be shot at,” said Justin Bronk, air warfare expert at London’s Royal United Services Institute think-tank. “And the PL-15 is clearly very capable at long range.” The PL-15 that hit the Rafale was fired from around 200km away, according to Pakistani officials, and even farther according to Indian officials. That would make it among the longest-range air-to-air strikes recorded.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/091809267c52864.jpg",
  "retrievedAt": "2025-08-16T07:18:04.489Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929745/defence-minister-rubbishes-indian-air-chiefs-comical-claims-of-downing-6-pakistani-aircraft-in-may-conflict",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T13:09:41.000Z"
}
