{
  "title": "Hasan Nawaz sparks Pakistan to 5-wicket ODI win over West Indies - Sport - DAWN.COM",
  "author": null,
  "content": "Hasan Nawaz made a triumphant one-day international (ODI) debut, going 63 not out on Friday to power Pakistan over the West Indies by five wickets in their ODI series opener.\n\nNawaz and Hussain Talat formed a sixth-wicket partnership of 104 not out to rally the visitors in the day-night affair, with game two on Sunday and the final ODI on Tuesday.\n\nWest Indies went 280 all out with Evin Lewis leading the way on 60 from 62 balls with three sixes and five fours, while Shai Hope added 55 and Roston Chase contributed 53.\n\nNeeding 281 to win, Pakistan got 53 runs from Mohammad Rizwan before he was bowled lbw by Shamar Joseph in the 38th over with the visitors still 101 runs shy of victory, setting the stage for heroics by Nawaz and Talat.\n\nNawaz struck for six on the second ball of the 49th over and blasted the winning shot to the boundary off the final delivery by Joseph, giving Pakistan the victory with seven balls to spare.\n\nIn all, Nawaz reached 63 on 54 balls with three sixes and five fours while Talat finished on 41 from 37 balls with one six and four fours.\n\nPakistan won the toss and sent the hosts in to bat first, a choice that paid quick dividends when Brandon King was taken for four on the fifth ball of the opening over, bowled by Shaheen Shah Afridi — his first of four wickets — and caught by Babar Azam.\n\nLewis exited on the last ball of the 19th over, bowled by Saim Ayub and caught by Afridi.\n\nWest Indies captain Hope got out to a delivery by Afridi and was caught by Rizwan on the second ball of the 41st over, leaving the hosts on 200 for five.\n\nRomario Shepherd was sent off on four on the last ball of the 43rd over.\n\nChase made the third half-century for the West Indies with a boundary but went out on the next ball, caught by Babar and bowled by Naseem Shah, who also bowled out Gudakesh Motie and Jediah Blades on the last two Pakistan deliveries.\n\nPakistan: Abdullah Shafique, Saim Ayub, Babar Azam, Mohammad Rizwan (captain/wicket-keeper), Salman Ali Agha, Hasan Nawaz, Hussain Talat, Faheem Ashraf, Shaheen Shah Afridi, Naseem Shah, Sufiyan Muqeem.\n\nWest Indies: Brandon King, Evin Lewis, Keacy Carty, Shai Hope (captain/wicket-keeper), Sherfane Rutherford, Roston Chase, Romario Shepherd, Gudakesh Motie, Shamar Joseph, Jayden Seales, Jediah Blades.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/09091235eeccb69.png",
  "retrievedAt": "2025-08-16T07:18:26.402Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929727/hasan-nawaz-sparks-pakistan-to-5-wicket-odi-win-over-west-indies",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T04:08:23.000Z"
}
