{
  "title": "SHC extends stay against ombudsman’s order to remove KE chief Alvi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court on Friday extended till Sept 12 its interim order granted on a petition filed by K-Electric Chief Executive Officer Moonis Alvi against the provincial ombudsman’s decision regarding his removal from the post over workplace harassment.\n\nOn July 31, the provincial ombudsman for protection against harassment of women at workplaces had ordered removal of Mr Alvi for causing harassment to a former chief marketing and communication officer of the KE and also directed him to pay Rs2.5 million to the complainant as compensation.\n\nOn the following day, Mr Alvi had filed a petition before the SHC, which suspended the ombudsman’s order and issued notices to the respondents for Aug 8.\n\nWhen the matter came up for hearing before a two-judge bench, headed by Justice Mohammad Iqbal Kalhoro, comments were filed on behalf of the ombudsman registrar.\n\nThe complainant also filed a reply, as well as an application, asking the SHC to set aside its ad-interim order passed on Aug 1.\n\nMr Alvi’s lawyer, however, sought time to go through the documents to file a rejoinder and counter-affidavit.\n\nThe bench adjourned the hearing till Sept 12 and extended its earlier interim order about suspension of the ombudsman’s order till the next date of hearing.\n\nEarlier, the office of the provincial ombudsman, through its registrar, filed the comments and stated that under the Protection Against Harassment of Women at the Workplace Act, 2010 an appeal against the ombudsman’s order can be filed before the Sindh governor and the petitioner had already availed such remedy.\n\nIt stated that the impugned order was based on the material available on record and on merits while the same was appealable under Section 9 (representation to president or governor) of the Act.\n\nThe registrar stated that the issue of trans-provincial establishment / entity raised before the SHC by the petitioner’s counsel had already been decided as the high court had dismissed an identical petition filed by KE officials in 2021. It said that the KE had challenged the SHC order before the apex court and the matter was still pending there. Therefore, the reply said that the petition was not maintainable under Article 199 of the Constitution.\n\nIn her reply, complainant Mahreen Aziz Khan stated that the petition was not maintainable since the petitioner had already availed the efficacious remedy and a petition under Article 199 can only be maintained if the high court was satisfied that no other adequate remedy was provided by law.\n\nShe also filed a separate application pleading to set aside the interim order passed by the SHC on Aug 1.\n\nThe KE chief in his petition had argued that KE was a trans-provincial entity and the provincial ombudsman had no jurisdiction to adjudicate upon such complaints as the federal ombudsman was competent to look into such complaints.\n\nThe petitioner also contended that the complainant was unable to adjust to her senior position due to performance issues and was eventually terminated after which she had filed the harassment complaint as an act of retaliation.\n\nHe further maintained that the complaint was motivated by ulterior designs aimed at pressurising and humiliating power utility head and alleged that the impugned order of ombudsman was not only illegal and without jurisdiction, but also amounted to an abuse of the process of law.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/3116561674f7005.jpg?r=170912",
  "retrievedAt": "2025-08-16T07:19:00.467Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929629/shc-extends-stay-against-ombudsmans-order-to-remove-ke-chief-alvi",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:58.000Z"
}
