{
  "title": "US appeals court dismisses contempt finding against Trump govt - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: A US federal appeals court on Friday dismissed a contempt finding against President Donald Trump’s administration over its summary deportation of alleged Venezuelan gang members to El Salvador.\n\nThe 2-1 decision by the US Court of Appeals for the District of Columbia Circuit overturns a ruling by a federal district judge that there was probable cause to find officials in contempt of court over the deportation flights.\n\nThe case stems from Trump’s use in March of the obscure 1798 Alien Enemies Act (AEA) to deport more than 200 alleged Tren de Aragua gang members to a notorious prison in El Salvador.\n\nDistrict Judge James Boasberg verbally ordered a halt to the deportation flights and for the planes to be turned around but it did not happen, leading to his criminal contempt inquiry.\n\nThe two Trump appointees on the appeals court panel ruled that Boasberg had overstepped his authority while the third judge, an appointee of former Democratic president Barack Obama, dissented.\n\nJudge Neomi Rao, one of the Trump appointees, said Boasberg’s finding was an “abuse of the contempt power” and an “intrusion on the President’s foreign affairs authority.”\n\n“The order forces a coequal branch to choose between capitulating to an unlawful judicial order and subjecting its officials to a dubious prosecution,” Rao wrote.\n\nIn her dissent, Judge Nina Pillard, the Obama appointee, said “the rule of law depends on obedience to judicial orders.”\n\n“Our system of courts cannot long endure if disappointed litigants defy court orders with impunity rather than legally challenge them,” Pillard said. “That is why willful disobedience of a court order is punishable as criminal contempt.”\n\nAttorney General Pam Bondi welcomed the decision as a “major victory” for the Trump administration and its use of the AEA “to deport illegal alien terrorists.”\n\n“The DC Circuit Court of Appeals affirmed what we’ve argued for months: Judge Boasberg’s attempt to sanction the government for deporting criminal-alien terrorists was a ‘clear abuse of discretion’ — failed judicial overreach at its worst,” Bondi said.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/151026028b9f2d4.jpg?r=103424",
  "retrievedAt": "2025-08-16T07:19:08.906Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929658/us-appeals-court-dismisses-contempt-finding-against-trump-govt",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:51.000Z"
}
