{
  "title": "Traders continue sit-in, halting travel, trade on KKH for 20th day - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: The ongoing protest sit-in on Karakoram Highway (KKH) has disrupted travel and trade between Pakistan and China via Khunjerab Pass for the 20th consecutive day on Friday.\n\nPeople are protesting against taxation policies and the suspension of customs clearance at Sost dry port.\n\nOrganisers plan to escalate their movement, accusing the government of lacking seriousness despite Prime Minister Shehbaz Sharif’s recent promise to resolve the issue and grant a one-time amnesty for stuck consignments. Traders criticised authorities for their inaction.\n\nSpeaking at a press conference in Sost town near Khunjerab Pass, members of the Tajir Etihad Action Committee condemned the government for its delaying tactics.\n\nProtesters stated that the peaceful protest defends the constitutional and legal rights of Gilgit-Baltistan (GB) residents. They highlighted regional support from political, religious, trade, and youth organisations.\n\nA demonstrator, Abbas Mir, asserted that collecting income tax, sales tax, and other federal taxes from GB residents is illegal, arguing that as a disputed territory, GB makes FBR’s operations unconstitutional. “Taxes cannot be collected from the people of GB until representation in the Parliament of Pakistan is provided,” he added.\n\nThe traders claimed that 280 consignments imported from GB have been held at Sost dry port for over a year, with billions of rupees’ worth of items expired or damaged by recent rains.\n\nTraders’ demands are exemption from income tax, sales tax, and other taxes on Chinese imports for GB residents; clearance of the stuck consignments; and compensation for damaged goods.\n\nOpposition member Jawed Ali Manwa of the GB Assembly declared that tax imposition in GB is illegal, emphasising that free trade with China is a right for local people. He also warned that unfair FBR policies could deepen alienation and weaken the federation.\n\nA protester added that thousands of people have faced billions of rupees in losses and unemployment over the past year due to illegal taxation. The organisers reiterated that they would only end their sit-in once their legal demands are met.\n\nThey warned of further escalation if grievances remain unaddressed, and noted that the protest has stranded many tourists in Sost.\n\nMeanwhile, GB Chief Minister Haji Gulbar Khan formed a 20-member committee, including GB Home Minister Shams Lone, Assembly member Amjad Hussain Advocate, Ayub Waziri, stakeholders, and Federal Government officials, to resolve border trade tax issues.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/0911464869cabee.png",
  "retrievedAt": "2025-08-16T07:18:47.606Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929586/traders-continue-sit-in-halting-travel-trade-on-kkh-for-20th-day",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:19:09.000Z"
}
