{
  "title": "China welcomes Indian PM Modi’s planned visit for SCO - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: Indian Prime Minister Narendra Modi’s plan to visit China for the first time in seven years to participate in the Aug 31-Sept 1 summit of the Shanghai Cooperation Organisation (SCO) would strengthen the gathering’s friendship with the promise of great results, said the hosts on Friday.\n\nSeveral Indian media outlets quoted official sources on Wednesday as saying that Mr Modi would visit China for the summit, which was planned ahead of the rising tensions with the US.\n\nIn response to Indian media reports, Chinese foreign ministry spokesperson Guo Jiakun said on Friday that China welcomed Indian Prime Minister Modi to the SCO summit at Tianjin.\n\n“We believe that with the concerted effort of all parties, the Tianjin summit will be a gathering of solidarity, friendship and fruitful results, and the SCO will enter a new stage of high-quality development featuring greater solidarity, coordination, dynamism and productiveness.”\n\nGuo was quoted by the Global Times, a Chinese newspaper seen as close to the Communist Party, as saying that leaders of over 20 countries, including all member states of the SCO and heads of 10 international organisations, would attend “relevant events”.\n\nThe SCO summit will be the largest gathering in scale since the establishment of the SCO, he added.\n\nOn Wednesday, India Today and several other media outlets reported that Mr Modi plans to attend the SCO summit in Tianjin.\n\n“If the visit materialises, it will mark the Indian prime minister’s first trip to China in seven years. Although the news has not yet been confirmed by the official authorities of China and India, it has drawn widespread attention from the international community as soon as it was released,” Global Times said in a commentary.\n\nIt quoted US magazine The Diplomat as commenting that “the trend in the past decade has seen the two neighbours embracing each other and then falling out … the time has come again for them to explore yet another round of engagement”.\n\nTogether, China and India account for over one-third of the world’s population, and both economies and their global influence are on the rise.\n\n“At this crucial juncture, the trajectory of China-India relations carries even more reasons to capture global attention,” the Global Times said.\n\n“Observers have noted that despite lingering differences and disputes between China and India, there have been signs of warming in their bilateral relations.”\n\nFollowing the 2020 border clash, China-India relations went through a long period of frostiness, severely impacting political trust, economic ties and people-to-people exchanges.\n\nFresh restart\n\nIn October last year, the successful meeting between the Chinese and Indian leaders in Kazan set the tone for a fresh restart in bilateral relations. At all levels, both countries have been upholding the important consensus reached by the two leaders — namely, that “China and India are each other’s development opportunity rather than threat, and cooperation partner rather than competitor”.\n\nAnchoring on development as the greatest “common denominator”, the two sides have continued to meet half way and maintain the momentum of progress.\n\nSince June, India’s National Security Adviser Ajit Doval, Defence Minister Rajnath Singh and External Affairs Minister Subrahmanyam Jaishankar have visited China.\n\nCurrently, various previously suspended bilateral mechanisms are being resumed or are in the process of restarting, the Chinese newspaper said.\n\n“Both sides have also vowed to not let the border issue become an obstacle to overall bilateral relations. In the area of people-to-people exchanges, the resumption of Indian pilgrimages to Mount Gang Rinpoche and Lake Mapam Yun Tso, in south-west China’s Xizang autonomous region, as well as the reinstatement of tourist visa issuance for Chinese citizens travelling to India, have all sent out positive signals.\n\n“Both sides also hope to seize the opportunity of the 75th anniversary of the establishment of diplomatic ties to achieve greater progress in China-India relations.\n\n“If Modi visits China this time, it will present another favourable opportunity to consolidate the positive momentum in China-India relations,” the newspaper said.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/06173941f5d5469.jpg?r=174912",
  "retrievedAt": "2025-08-16T07:19:16.970Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929662/china-welcomes-indian-pm-modis-planned-visit-for-sco",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:51.000Z"
}
