{
  "title": "Karachi man sentenced to two years in prison for marrying underage girl - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A sessions court on Friday sentenced a man to two years in prison for marrying an underage girl.\n\nAfter hearing complainant counsel Daniyal Muhammad Hussain and the defence side, Judicial Magistrate (East) Noor Ahmed Chandio, found Azhar Ali guilty of marrying the teenage girl under Section 3 of the Sindh Child Marriages Restraint Act, 2013.\n\nThe court observed that during the trial no substantial evidence was brought on record to exonerate the accused and the absconding suspects from the charge of contracting and solemnising a child marriage under the Sindh Child Marriages Restraint Act.\n\nThe medico-legal officer also testified before the court that the girl was about 15 to 16 years old at the time of the marriage, it added.\n\nThe court also imposed a fine of Rs50,000, while on default the convict would serve additional imprisonment.\n\nJudge rules nikah khawan is required to sign affidavit about age of bride and groom not being less than 18 years\n\nRegarding the charge against the convict under Section 363 (punishment for kidnapping) of the Pakistan Penal Code, the court observed that the complainant’s counsel had attempted to establish the accused’s guilt under this section during arguments.\n\nHowever, it noted that neither the state prosecutor nor the complainant’s counsel had sufficiently explained under what circumstances the accused could be convicted under Section 363 of the PPC.\n\n“I would remark that in cases of Sindh Child Marriages Restraint Act the mens rea and actus rea of male contracting marriage, nikah khuwan and marriage witnesses are already proved, when all parties are knowing that with their ulterior motives child marriage is to be solemnised. In accordance with Rule 3 of the Child Marriages Restraint Rules, 2016 nikhakhuwan for conduct / solemnising child marriage was required to sign affidavit stating that he has satisfied himself about the age of contracting parties as not being less than 18 years. Such affidavit shall be attached with the nikahnama,” the judge remarked.\n\nBut in this case, he added the nikah khawan (marriage registrar) — absconding accused — did not assure and satisfy himself regarding the age of the girl.\n\nHowever, the complainant counsel said he would “file appeal against verdict to the extent of acquittal of the offence of kidnapping under Section 363 PPC as the learned court has failed to record any reasoning for such acquittal and has failed to apply the law correctly”.\n\nAccording to the prosecution, the mother of the teenage girl stated that on Jan 16, the accused, Azhar Ali — who worked as a security guard in their neighbourhood — enticed her daughter, who was 16 years old at the time. Three days later she went missing, and the accused married the teenage girl. He was later apprehended by police during a raid, and the girl was recovered.\n\nHowever, the teenage girl testified before the court that on the night of Jan 16, she went with the accused to Naushahro Feroze in a rented car, where they stayed for three days and “contracted a love marriage”.\n\nThe court noted that she also recounted details of the raid conducted at the accused’s house, the contents of her statement recorded under Section 164 of the criminal procedure code, and her expressed desire to return to her parents.\n\nDuring the trial, the defence counsel contended that the girl’s age was mentioned as 17 years in the FIR and alleged that discrepancies had surfaced in the school and NADRA records to suggest otherwise.\n\nHe further argued that the girl had willingly gone with the accused to contract the marriage and that no force or coercion was used.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/684266053e611.jpg",
  "retrievedAt": "2025-08-16T07:19:09.979Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929631/karachi-man-sentenced-to-two-years-in-prison-for-marrying-underage-girl",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:58.000Z"
}
