{
  "title": "Factories drive 58pc surge in demand as captive users switch back to grid - Business - DAWN.COM",
  "author": null,
  "content": "• Grid revival could ease burden of rising electricity tariffs\n• Approximately 128,000 new connections still pending\n\nISLAMABAD: After two years of contraction, electricity consumption surged between 35 per cent and 58pc in the final quarter of FY25, driven by increased industrial demand. The Power Division on Friday attributed this recovery to the return of captive power users to the national grid, improvements in macroeconomic indicators, and recent reforms in the power sector.\n\nThe division expressed optimism that this trend would help break the cycle of rising electricity tariffs by widening the consumer base and distributing fixed capacity charges more effectively. Officials noted that declining industrial consumption in previous years had narrowed the demand base, raising the average cost per unit and worsening tariff pressures.\n\nRecent figures show industrial consumption increased by 58.8pc in April, 47.4pc in May, and 35pc in June compared to the same months of FY24. The Power Division said this growth, largely due to captive power users shifting back to the grid, would help reduce average electricity tariffs over time by enhancing economies of scale.\n\nThe government’s recent negotiations with power producers and a gradual shift away from inefficient captive generation have contributed to the turnaround. The Power Division reported that around 280 captive users had returned to the grid during the April-June quarter, with more expected to follow.\n\nAccording to Faisalabad Electric Supply Company (Fesco), B4 category industrial sales surged by 183pc following the integration of about 200MW of captive generation. Gujranwala Electric reported a 35pc rise in industrial sales, with 20pc growth seen in the final quarter alone. Hyderabad Electric also saw a 75pc increase in industrial sales compared to the same period last year.\n\nLahore Electric (Lesco) said B3/B4 industrial sales jumped from 996 million units to 1,600m units. Lesco also recorded a 9pc rise in residential consumption, credited to anti-theft operations. Multan Electric (Mepco) reported the return of 152MW of captive load, while Peshawar Electric saw improved sales due to both captive power return and the Rs7.7 per unit tariff cut announced by the prime minister in March.\n\nTribal Electric cited court-mandated reconnections of industrial consumers for its sales growth. However, Qesco reported a decline in agricultural sales, mainly due to increased solarisation. Sukkur Electric experienced a 22pc drop in industrial sales and noted it has only 11 captive connections, limiting sales growth.\n\nOverall, the Power Division said that out of 583 captive power users (with a cumulative load of 2,034MW), 281 had rejoined the national grid, contributing around 700–750MW of load. This transition helped raise industrial sales from 336 million units to over 600m units in the last quarter of FY25.\n\nIn parallel, the division informed the National Electric Power Regulatory Authority (Nepra) that power purchases by distribution companies (Discos) rose by only 0.35pc compared to reference tariff projections, while industrial sales increased by around 46pc.\n\nDespite the improved performance, the Power Division revealed that approximately 128,000 new connections are pending across Discos — including 500 industrial connections — representing a total load of 1,070MW. Most of these pending cases are in Fesco, Mepco, Gepco, and Iesco jurisdictions.\n\nAddressing concerns over rising debt servicing costs, the division clarified that no new surcharges have been imposed. Lifeline consumers remain exempt, while protected consumers pay only Rs0.43 per unit. A Rs3.23 per unit surcharge applies to other consumer categories. The government will continue this debt servicing surcharge for the next three years to repay Rs1.275tr in fresh loans taken to clear outstanding dues to power producers. Total circular debt stood at Rs2.393tr at the end of FY25.\n\nPublished in Dawn, August 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/0809560936eaa2a.jpg?r=095616",
  "retrievedAt": "2025-08-16T07:19:36.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929647/factories-drive-58pc-surge-in-demand-as-captive-users-switch-back-to-grid",
  "dateList": "2025-08-09",
  "date_published": "2025-08-09T01:18:41.000Z"
}
