{
  "title": "Parliaments represent aspirations of any country’s people: Sanjrani",
  "link": "https://www.app.com.pk/national/parliaments-represent-aspirations-of-any-countrys-people-sanjrani/",
  "date_published": "2021-06-29T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): Chairman Senate Muhammad Sadiq Sanjrani has said Parliaments of the world represent aspirations of the people of any country and were the biggest contributers in terms of development, prosperity and security of the country.\nIn a message, on the occasion of World Parliament Day, he said that the respect and sanctity of Parliament must be upheld by everyone.\nParliament is the representative of the people and acts as the spokesperson of the nation. It ensures the survival of the country by taking effective decisions in the national interest, he added.\nThe chairman said that Parliament Day is being observed all over the world on June 30 with the theme of youth empowerment organized by the United Nations.\nSadiq Sanjrani said that important legislation has been done by Parliament of Pakistan for resolving important national issues and problems faced by the people, so that the people can feel the benefit of true democracy.\nHe said that the opposition is the beauty of the Parliament and the role of the opposition along with the government is very important in keeping the environment of the parliament conducive and performing other parliamentary matters.\nHe said that in order to strengthen democratic institutions and stability of the country, the government and the opposition should forget their differences and play their role for the integrity of the country.\nThe Chairman Senate said that Pakistan’s Parliament is an active member of important forums of the world including International Parliamentary Union (IPU), Organization of Islamic Conference (OIC), SAARC and others.\nSanjrani said the present Parliament is taking effective steps to empower the youth and bring them into the national mainstream and the present government had also taken steps to involve the youth in politics.\nFortunately, 60% of Pakistan’s population comprises of youth who are a valuable asset to the country.",
  "retrievedAt": "2025-08-11T20:54:20.053Z"
}
