{
  "title": "Bilawal seems embarrassed over smooth sailing of finance bill : Farrukh",
  "link": "https://www.app.com.pk/national/bilawal-seems-embarrassed-over-smooth-sailing-of-finance-bill-farrukh/",
  "date_published": "2021-06-29T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): Minister of State for Information and Broadcasting, Farrukh Habib on Tuesday said the Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto Zardari was embarrassed over smooth sailing of finance bill 2021-22 from the National Assembly.\nOut of his sheer embarrassment and desperation, Bilawal should not give lectures on law and Parliamentary norms, the minister said while responding to a press conference.\nThe entire budget discussion was on record and no any unconstitutional act was performed, he said, adding the debate on the finance bill continued for five hours and 10 minutes. Every law maker took part in the discussion, cut motions were moved, he added.\n“If any provincial assembly, which passed the budget unconstitutionally and illegally, it is Sindh government,” he said and asked the PPP chairman to tell the people about\nhis party sailing through the budget in the provincial assembly without recording the speech of opposition leader.\nIt was a constitutional right of every member to participate in the budget debate, but Sindh Assembly Speaker barred eight Pakistan Tahreek-e Insaf (PTI) Members of the provincial assembly from entering into the assembly, he said.\nPTI would continue to expose unconstitutional measures of PPP for passing the budget in Sindh Assembly, Farrukh said.\nHe said Bilawal should investigate everything before leveling allegations against others as it was both his party and grandfather Zulfiqar Ali Bhutto, who approached the International Monetary Fund (IMF) three times while Pakistan Muslim League Nawaz (PML-N) did the same three times in its tenure.\nThe minister said government and its alliance deserved appreciation over the passage of the finance bill 2021-22 with majority.\nHe said the allegations made by Bilawal against the opposition leader was serious, and the opposition leader (Shehbaz Sharif) himself or his party should give clarification on it.\nFarrukh said the federal government had given share of Rs 1900 billion under National Finance Commission (NFC) award to Sindh.\nThe PPP had nothing to do with the budget, public issues and relief to the masses as its leadership was only worried about its kickbacks and commission, he added.",
  "retrievedAt": "2025-08-11T20:54:20.295Z"
}
