{
  "title": "Maryam Nawaz seeking NRO to enjoy luxurious life abroad: Farrukh",
  "link": "https://www.app.com.pk/national/maryam-nawaz-seeking-nro-to-enjoy-luxurious-life-abroad-farrukh/",
  "date_published": "2021-06-29T18:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): Minister of State for Information and Broadcasting Farrukh Habib Tuesday said Pakistan Muslim League-Nawaz (PML-N) vice president Maryam Nawaz was seeking national reconciliation ordinance (NRO) since the day one to enjoy a luxurious life abroad.\nBoth Maryam and her father Nawaz Sharif were indulged in the politics of blame game and they were criticizing the country’s institutions to meet their ulterior motives and political gains, he said while talking to a private news channel.\nThe minister said Nawaz Sharif, being an absconder, had deceived whole the nation by fleeing abroad in the wake of health facilities.\nHe said Pakistan Democratic Movement (PDM) was no more as it was rejected by the people.\nThe opposition parties were perturbed from the economic turnaround as Pakistan’s export, agriculture and industry had improved to a great extent under the prudent policies of the incumbent government.\nFarrukh accused both the previous governments of Pakistan Peoples Party (PPP) and PML-N for leaving the economy in fragile condition besides bringing the national institutions at the brink of destruction through corrupt practices.The Pakistan Tehreek-e-Insaf (PTI) government was revamping and restructuring them since the day one it entered in the corridors of power.\nReplying to a question, he congratulated the entire nation on the passage of fiscal budget 2021-22 from the Parliament. The performance of PTI government was much better as compared to the previous governments, he added.\nCommenting on the Sindh government, the minister said the provincial government had done nothing for the welfare and uplift of the masses and province so far.\nHe said there was no democracy in Sindh as its affairs were being handled like dictators.",
  "retrievedAt": "2025-08-11T20:54:18.830Z"
}
