{
  "title": "Senate body asks NAB to probe Ghouri Town case",
  "link": "https://www.app.com.pk/national/senate-body-asks-nab-to-probe-ghouri-town-case/",
  "date_published": "2021-06-29T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): Senate Standing Committee on Interior Tuesday asked the National Accountability Bureau (NAB) to probe Ghouri Town case to address grievances of the locals.\nA public petition against the management of Ghouri Town, Ghouri Greens was referred by Senate Chairman Sadiq Sanjrani to the committee.\nThe committee that met here with Mohsin Aziz also summoned the Capital Development Authority (CDA) chairman in the next meeting to discus the issue in detail.\nThe CDA officials apprised the meeting that Ghouri Town was an illegal housing scheme as it was launched without obtaining No-Objection Certificate from the authority.\nThe interior secretary asked the CDA officials to look into rules that how such cases could be regularized to provide relief to the residents.\nDeputy Commissioner Islamabad, Hamza Shafqaat apprised the committee members that the scheme was owned by four or five people, adding that one of them was died while rest of them flee from the country.\nHe said the civil administration had registered some 24 first information reports against the scheme owners for fraudulently selling plots to the common men.\nSenator Fauzia Arshad reprimanded the federal apex agency for showing slackness into the matter, putting millions of rupees of people at stake.\nSenator Azam Nazir Tarar said the number of such cases were increasing in the country, adding that such issues should be dealt by the NAB to provide relief to the victims.\nConsidering the issue regarding money laundering investigation against JS Bank, the The Federal Investigation Agency (FIA) director told the committee that a parallel inquiry was underway in the NAB after its completion a report would be submitted to the committee. The committee deferred the agenda till next meeting.\nThe committee also received a detailed briefing on the nature, work and functioning of the ministry and its sub-ordinate departments, including Metropolitan Corporation Islamabad, National Counter Terrorism Authority, Pakistan Rangers, National Police Foundation, Frontier Corps, Pakistan Coast Guards, National Database and Registration Authority, Immigration and Passport and others.\nAmong others the meeting was attended by Yousaf Raza Gillani, Rana Maqbool, Moula Bux Chandio, Faisal Saleem Rehman, Shahadat Awan, Faisal Sabzwari, Dilawar Khan and other senior officials of the interior ministry and its attached departments.",
  "retrievedAt": "2025-08-11T20:54:20.262Z"
}
