{
  "title": "Expo 2020 Dubai site to provide rapid COVID-19 testing",
  "link": "https://www.app.com.pk/national/expo-2020-dubai-site-to-provide-rapid-covid-19-testing/",
  "date_published": "2021-06-29T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): Expo 2020 Dubai has introduced a number of precautionary measures across the site including rapid COVID-19 testing to prevent the spread of coronavirus at the world’s largest exhibition, said the organizers.\nThe organizers said they have acted responsibly to meet the challenges of COVID-19, developing protocols, guidelines and precautionary measures that are science-based and data-driven.\n“The health, safety and well-being of everyone working at Expo 2020 is our number one priority and the pandemic has put our commitment to the health, safety and well-being of our staff, participants and visitors even more sharply into focus,” Gulf news reported .\nThe organizers said that quick actions were taken to meet the challenges posed by the pandemic.\n“We have acted quickly and responsibly to meet the challenges of COVID-19 introducing a number of precautionary measures across the site, in line with the latest information and guidance from local and international authorities, including Dubai Health Authority, the UAE Ministry of Health and Prevention and the World Health Organization.\nThis includes the installation of sanitization stations, mandatory mask wearing and social distancing, as well as increased deep cleaning and specialized medical facilities, including provisions for rapid COVID testing”, they told.\nExpo 2020 Dubai has also brought to the fore “the use of applied technology to assist with visitor-facing interactions such as ticketing, queue and crowd management.”\nVisitors are currently not required to provide proof of vaccination to enter the Expo site, it was clarified.\n“However, vaccination is strongly encouraged and vaccinated individuals will still be required to comply with precautionary measures, including wearing of masks, social distancing and regular washing and sanitisation of hands”, the organizers said and added, “In addition, all Expo staff will be vaccinated and we have also provided free vaccinations to all our international participants and their staff.”\nIn April, Sheikh Hamdan bin Mohammed Al Maktoum, Crown Prince of Dubai and Chairman of the Executive Council of Dubai, had issued instructions to offer free vaccinations to all official participants and their staff.\nThe organizers said they will continue to monitor and adjust the precautionary measures as necessary, as the opening date of October 1 approaches and the situation continues to evolve.\n“We look forward to bringing together people, communities, and nations to build bridges, inspire action and deliver real-life solutions to real-life challenges.”\n“We strongly encourage all visitors to keep up to date with information from official UAE authorities on guidelines for entering the UAE,” the statement added.\nExpo 2020 Dubai will run from October 1, 2021 to March 31, 2022 under the slogan “Connecting Minds, Creating the Future.” The mega event gains exceptional significance amid the Covid-19 outbreak as the call for collaboration and knowledge exchange has never been more urgent to drive action and develop practical solutions to pressing challenges. It will galvanize the global community under the vision that true prosperity for people stem from collaboration.",
  "retrievedAt": "2025-08-11T20:54:16.607Z"
}
