{
  "title": "Opposition suggests to make budget more people-friendly, reduce indirect taxes",
  "link": "https://www.app.com.pk/national/opposition-suggests-to-make-budget-more-people-friendly-reduce-indirect-taxes/",
  "date_published": "2021-06-29T05:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): The opposition lawmakers in National Assembly on Tuesday suggested various proposals during debate on Finance Bill, 2021 in the National Assembly to make the budget more people-friendly facilitating every segment of the society.\nParticipating in the debate on Finance Bill, 2021, Syed Naveed Qamar of Pakistan Peoples Party Parliamentarian (PPPP) said the government should go for direct taxes rather than indirect taxes.\nHe said the new taxes would further cause inflation which would multiple miseries of the common man. Nawab Muhammad Yousaf Talpur of PPPP said imposing levy on petroleum product would further increase inflation.\nHe said inflation and poverty were big issues of the country. He said Rs 12 billion was not sufficient for the promotion of agriculture sector and called for giving more incentives for getting self-sufficiency in agri production.\nAli Pervaiz of Pakistan Muslim League – Nawaz (PML-N) was also in the favor of direct taxes instead of indirect taxes. He was of the views that the taxes would further increase prices of sugar and other essential commodities.\nHe said unprecedented reduction was witnessed in cotton crop this year, adding that 17 per cent sale tax on setting of new machinery would discourage industrialization in the country.\nMuhammad Hashim Notezai of Balochistan National Party Mangal (BNP-M) said excessive power load-shedding was being carried out in Balochistan. In such circumstances, how the people would operate their tube-well for agriculture, he questioned.\nHe said the government should give special focus to the development of Balochistan province. Syed Khursheed Ahmed Shah of PPPP said he always talked about the supremacy of the parliament and called for giving more respect to the parliament.\nHe claimed that they allocated 2.5 percent of total GDP for education in 1997 during their tenure which was only 1.9 percent of GDP this year showing a downwards trend.\nHe said Pakistan was a agri-based country and no special package was announced in the budget for this key sector, adding that farmers could not buy expensive urea, fertilizer and potash which would effect production of various crops negatively.\nQaisar Ahmed Sheikh of PML-N claimed the opposition had offered charter of the economy to the government but unfortunately response was still awaited. He said the budget always framed by non-elected people and bureaucracy, adding that the elected people have nothing to do with it.\nHe demanded that the suggestions of members of this august house should be incorporated in the budget. Sheikh suggested that Information Technology based education should be promoted in the country as well as increasing IT related exports.\nAn Independent Member National Assembly Ali Wazir said promises made with erstwhile FATA were not fulfilled yet. He said steps should be taken to give more relief to the poor segment of society. Dr. Nafeesa Shah from PPPP said more focus should be paid on promotion of agriculture sector, added that there should be clear policy to uplift poor.\nKhurram Dastgeer from PML-N, Ayesha Baksh Ghous of Pakistan Muslim League (PML-N) and Shahida Akhtar Ali of MMAP also participated in the debate and suggested various development plans for progress of the country.muk-raz-yaw\\9326/29/2021 3:18:11 PM",
  "retrievedAt": "2025-08-11T20:54:18.651Z"
}
