{
  "title": "Dr. Nishtar talks about the “Invisible Scaffold” at the World Bank-IMF spring meetings 2021",
  "link": "https://www.app.com.pk/national/dr-nishtar-talks-about-the-invisible-scaffold-at-the-world-bank-imf-spring-meetings-2021/",
  "date_published": "2021-04-06T12:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 06 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Tuesday presented Pakistan’s perspective on bolstering social safety nets during a webinar held at the World Bank-International Monetary Fund annual spring meetings 2021.\nDuring the webinar titled ‘the IMF’s Engagement on Social Protection’, she highlighted Pakistan’s social protection policy initiatives- the aspiration and challenges and how the government of Pakistan demonstrated commitment to addressing them.\nThe event aimed to showcase the IMF, development partners, the WBG and member countries’ efforts to implement more effective social protection programs, strengthen social safety nets, and protect the most vulnerable from economic shocks and the potential adverse effects of reforms.\nAlong with Dr. Nishtar, Roger Nord, Deputy Director Institute for Capacity Development, IMF; Antoinette Sayeh, Deputy Managing Director, IMF; Fernanda Brollo, Senior Economist, IMF; Brooks Evans, Economist, IMF; and Tanja Goodwin, Senior Country Economist, World Bank Group came to the table to launch a Capacity Development Talk on the IMF’s engagement on social protection, with a particular focus on Pakistan and Ecuador.\nAt the webinar, Dr. Nishtar spoke about the invisible scaffold that is needed to execute programs well.\nShe said that almost for a year after the launching of Ehsaas, an extensive effort was made to build the infrastructure of integrity and transparency.\nAccording to statutory requirement— board meetings, conflict of interest policy, whistleblowing policy, and error, fraud and corruption frameworks and risk registers were institutionalized.\nShe then explained how financial, audit and accounting systems were strengthened and more broadly, she described how critical was implementation of the Ehsaas Governance and Integrity Policy.\nShe also mentioned about the creation of Ehsaas Governance Observatory to track risks and governance practices.\nFurther, she explained the importance of building the digital backbone for execution of many Ehsaas programs. An SMS request seeking mechanism and data analytics system were integral to the execution of many programs.\nContinuing, Dr. Nishtar stated that in 2019, a new biometric payment system was installed after a competitive process, to make sure that all payments were biometrically verified.\nFurther, she said that the IT infrastructure had undergone a major overhaul—and across applications, networks, and the data systems, many reforms had been implemented.\nInequality around the world has been growing in recent years, and the pandemic has only made matters worse.\nAs a result, more and more of the IMF’s policy advice and capacity development collaborations have focused on the issues of social spending and social protection.\nIMF is an organization of 190 countries, working to foster global monetary cooperation, secure financial stability, facilitate international trade, promote high employment and sustainable economic growth, and reduce poverty around the world.",
  "retrievedAt": "2025-08-11T20:35:40.119Z"
}
