{
  "title": "COVID-19 claims 103 lives, infects 3,953 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-103-lives-infects-3953-more-people/",
  "date_published": "2021-04-06T08:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 06 (APP): The national tally on Tuesday of total active COVID-19 cases recorded 63,102 with 3,953 more people tested positive for the deadly virus and 2,198 people recovered from the disease during the last 24 hours.\nOne hundred and three corona patients have died during past 24 hours, 93 of whom were under treatment in hospital and 10 out of the hospital in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 103 deaths occurred during last 24 hours, 44 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 70 percent, Islamabad Capital Territory (ICT) 57 percent, Gujranwala 60 percent and Lahore 67 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Swat 64 percent, Gujranwala 85 percent, Peshawar 77 percent and Gujrat 78 percent.\nAround 432 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan.\nSome 46,665 tests were conducted across the country on Monday, including 10,300 in Sindh, 19,304 in Punjab, 7,198 in Khyber Pakhtunkhwa (KP), 7,500 in Islamabad Capital Territory (ICT), 1,148 in Balochistan, 396 in GB, and 819 in AJK.\nAround 618,158 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 696,184 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 13,529, Balochistan 19,855, GB 5,061, ICT 62,211, KP 93,033, Punjab 235,569 and Sindh 266,926.\nAbout 14,924 deaths were recorded in country since the eruption of the contagion. Around 4,510 have perished in Sindh among one of them died in hospital in past 24 hours.\n6,675 in Punjab had died with 88 deaths occurred in past 24 hours. 78 of them in the hospital and 10 out of hospital. 2,469 in KP where 12 of them died in hospital on Monday, 584 in ICT among one of them died in hospital on Monday, 211 in Balochistan, 103 in GB and 372 in AJK among one of them succumbed to the deadly virus in hospital on Monday.\nA total of 10,493,362 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 4,387 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:35:45.844Z"
}
