{
  "title": "NAB reviews progress of Zardari, Nawaz, others cases",
  "link": "https://www.app.com.pk/national/nab-reviews-progress-of-zardari-nawaz-others-cases/",
  "date_published": "2021-04-06T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 06 (APP): The National Accountability Bureau (NAB) on Tuesday reviewed the headway in the corruption cases against former president Asif Ali Zardari and five prime ministers including Nawaz Sharif during a meeting chaired by NAB Chairman Justice (retd) Javed Iqbal.\nAccording to NAB spokesperson, the meeting also reviewed overall performance of the bureau.\nThe forum reviewed the progress in the investigation of ongoing corruption cases against former prime ministers Nawaz Sharif, Shahid Khaqan Abbasi, Shaukat Aziz, Raja Pervaiz Ashraf, Syed Yusuf Raza Gilani, former president Asif Zardari, former chief ministers Shehbaz Sharif, Qaim Ali Shah, Aslam Raisani, Sanaullah Zehri, Sindh chief minister Murad Ali Shah, former ministers Ishaq Dar, Khawaja Saad Rafique, Dr Asim Hussain, Ahsan Iqbal, Tariq Fazal Chaudhry, Noorul Haq Qadri, Babar Khan Ghauri,Dr Zafar Mirza, Manzoor Wasan, Agha Siraj Durrani, Syed Khursheed Shah, Sohail Anwar Sial, Saleem Mandviwala,Sharjeel Inam Memon,Jam Khan Shoro,Adil Siddique,Waseem Akhtar, Sardar Ashiq Gopang, Barjees Tahir, Ejaz Jakhrani, Rana Sanaullah, Sabtain Khan, Aleem Khan, Sahibzada Mehmood Zaib, Sher Azam Khan, Engineer Amir Muqam,Captain Safdar, Sardar Mehtab Abbasi,Usman Saifullah, Anwar Saifullah, Asfandyar Kakar, Asim Kurd, Saadat Anwar, Rehmat Baloch,Hamza Shehbaz, Salman Shahbaz, Hassan Nawaz, Hussain Nawaz, Ahad Cheema, Fawad Hassan Fawad, Amjad Ali Khan, Siddique Memon, Manzoor Kaka,\nShahidul Islam, Uzma Adil,Saeed Ahmed Khan,Tahir Basharat Cheema,Abdul Ghani Majeed, Anwar Majeed, Hussain Lawai, Ghulam Mustafa Phal, Farkhand Iqbal, Akhtar Nawaz Ganjera and Kamran Shafi.\nThe meeting also reviewed progress in the ongoing investigation against Mufti Ehsan, Ghulam Rasool Ayubi and others Modarba/ Musharka case accused, Bank of Khyber, K Electric, NTS, closure of Roosevelt hotel, Sindh festival case, NICVD, Karachi, 56 Public Limited Companies, Flour, sugar subsides scams.\nThe meeting decided to take cases against fake housing societies to logical conclusion and utilising all available resources to nab proclaimed offenders.\nSpeaking on the occasion, the NAB chairman said, “The anti-graft watchdog firmly believes in pursuing the policy of accountability for all. NAB does not have affiliation with any group, political party or individual.\nThe only affiliation of the bureau is with the state of Pakistan. The NAB is duty bound to recover the looted amount from the culprits, besides taking mega corruption cases to logical conclusion.”\nJustice Javed Iqbal said the top most priority of bureau was to eliminate corruption from the country and recovery of the looted money.",
  "retrievedAt": "2025-08-11T20:35:40.129Z"
}
