{
  "title": "MD APP felicitates IRNA chief for 90th anniversary",
  "author": null,
  "content": "ISLAMABAD, Feb 22 (APP): Managing Director, Associated Press of Pakistan (APP), Muhammad Asim Khichi on Saturday felicitated Dr Hossain Jaberi Ansari, Managing Director of the Islamic Republic News Agency (IRNA) and his team on achieving the incredible milestone of 90 years of dedicated service in journalism.\n“Your unwavering commitment to truth, awareness, and progress has played a vital role in shaping public discourse and strengthening the foundations of your nation”, said MD APP in his felicitation message to MD IRNA.\nHe said that over the past 90 years, the Islamic Republic News Agency (IRNA) has been a beacon of reliable information, empowering citizens with knowledge and upholding the principles of free and responsible journalism.\n“This remarkable achievement is a testament to your hard work, integrity, and dedication to the greater good,” he added.\n“As you celebrate this historic moment, we extend our best wishes for continued success and innovation in the years ahead. May you keep inspiring, informing, and guiding generations to come,” MD APP added.\nHe said that APP and IRNA have had a news exchange agreement since 1981 and sharing news of mutual interests and regional and international development.\nAsim Khichi said the world has now become a global city in which media play a very important role, adding that news collaboration among regional news agencies is a must to give first-hand and reliable information to its people.\nHe said official news agencies of Pakistan and Iran –APP and IRNA are disseminating accurate, rapid information and providing a true image of events to their subscribers and audience.\nHe said the news exchange agreement between APP and IRNA would be further strengthened for benefit of the people of brotherly countries.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:59:44.490Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/md-app-felicitates-irna-chief-for-90th-anniversary/",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T08:21:00.000Z"
}
