{
  "title": "Heavy rain, thunderstorms, and snowfall expected across Pakistan",
  "author": null,
  "content": "ISLAMABAD, Feb 22 (APP): The Pakistan Meteorological Department (PMD) has forecasted widespread rain-wind/thunderstorms with snowfall over the hills across various regions of the country during the upcoming week.\nA strong westerly weather system is expected to enter the western parts of Pakistan on the evening or night of February 24 and will extend to the upper parts by February 25, persisting in northern areas until March 02.\nWidespread rain-wind/thunderstorms with intermittent heavy snowfall are predicted in Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Guanche, and Shigar in Gilgit-Baltistan, as well as Neelum Valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, and Mirpur in Kashmir from February 25 to March 02.\nHeavy rainfall and snowfall are expected in Chitral, Dir, Swat, Shangla, Kohistan, Mansehra, Abbottabad, Haripur, Buner, Bajaur, Mohmand, Khyber, Orakzai, Kurram, Peshawar, Charsadda, Nowshera, Swabi, Waziristan, Kohat, Karak, Bannu, and Dera Ismail Khan from the night of February 24 to March 01.\nModerate to heavy snowfall is expected in Murree, Galliyat, and surrounding areas from February 25 to March 01. Rain-wind/thunderstorms are also forecasted for Islamabad, Rawalpindi, Attock, Chakwal, and Jhelum during the same period.\nRain-wind/thunderstorms is also expected in Hafizabad, Gujranwala, Mandi Bahauddin, Sargodha, Mianwali, Khushab, Gujrat, Sialkot, Narowal, Lahore, Sheikhupura, Faisalabad, and Toba Tek Singh from February 25 (evening/night) to February 28.\nAdditional districts such as Jhang, Bhakkar, Multan, Dera Ghazi Khan, Layyah, Muzaffargarh, Taunsa Sharif, Khanewal, Sahiwal, Pakpattan, Okara, Bahawalnagar, and Bahawalpur will experience rainfall from February 25 to February 27.\nRain-wind/thunderstorms with snowfall over hills are anticipated in Quetta, Ziarat, Chaman, Mastung, Pishin, Qilla Abdullah, Qilla Saifullah, Chagai, Nushki, Kalat, Khuzdar, Barkhan, Harnai, Zhob, and Musakhel from February 24 (evening/night) to February 26.\nLight rain-wind/thunderstorms are expected in Larkana, Qambar Shahdadkot, Jacobabad, and Sukkur on February 25-26.\nHeavy snow may disrupt travel in Murree, Galliyat, Naran, Kaghan, Dir, Swat, Kohistan, Mansehra, Abbottabad, Shangla, Astore, Hunza, Skardu, Neelum Valley, Bagh, and Poonch.\nHeavy rain could trigger flash floods in vulnerable areas of Khyber Pakhtunkhwa and Kashmir between February 25 and March 01.\nMountainous regions of Khyber Pakhtunkhwa, Gilgit-Baltistan, Kashmir, Murree, and Galliyat may experience landslides.\nSome plain areas of Khyber Pakhtunkhwa, Punjab, and Islamabad may witness hailstorms.\nTourists are urged to exercise caution and avoid unnecessary travel during heavy snowfall and rainfall periods.\nRainfall is expected to benefit standing crops, particularly in the Barani areas of Punjab and Khyber Pakhtunkhwa.\nThe PMD has advised all relevant authorities to remain on high alert and take necessary precautionary measures to prevent any untoward incidents, especially in hilly areas.\nThe National Disaster Management Authority (NDMA), Provincial Disaster Management Authorities (PDMA), and State Disaster Management Authorities (SDMA) have been urged to implement safety protocols accordingly.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:00:17.995Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/heavy-rain-thunderstorms-and-snowfall-expected-across-pakistan/",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T14:58:00.000Z"
}
