{
  "title": "International Mother Language Day celebrated with calligraphy, cultural painting exhibition",
  "author": null,
  "content": "ISLAMABAD, Feb 22 (APP):International Mother Language Day was observed with an exhibition of Pakistani languages’ scripts and cultural paintings at Quaid-i-Azam University, Islamabad, under the auspices of the Human Rights Council of Pakistan.\nThe event commenced with a national poetry symposium and a welcome address by Kashif Kamal.\nAfter the recitation of the Holy Quran, a Naat, and the national anthem, the session was hosted by Allah Razi Rajput. Shields were distributed among the guests, along with a special gift presented by the chief guest.\nThe event featured prominent guest speakers, including Professor Dr. Aneela Kamal, Vice-Chancellor of Rawalpindi Women University, who emphasized the significance of linguistic diversity. A national poetry symposium was also held in connection with International Mother Language Day, presided over by renowned poet Anjum Saleemi, with Professor Dr. Aneela Kamal as the chief guest.\nHe said distinguished poets recited their poetry in various Pakistani languages, including: Professor Dr. Hanif Khalil (Pashto), Hameed Kamran (Kashmiri), Dr. Mehnaz Anjum (Urdu/Punjabi), Saleem Shehzad (Saraiki), Muhammad Waseem Faqeer (Hindko), Ittifaq Butt (Punjabi), Azeem Kashmiri (Gojri), Maria Naqvi (Urdu), Farzand Ali Hashmi (Pothwari), Rukhsana Sehar (Punjabi), Afifa Khan Sunozai (Urdu), Rashida Kanwal (Urdu), Nida Mehr (Punjabi), Kashif Kamal (Urdu/Punjabi), Dr. Faisal Shehzad (Urdu), Manzoor Ahmed Manzoor (Pahari), Tahir Baloch (Urdu), Mujtaba Haider Shirazi (Urdu), Badar Siamyab (Punjabi – Kuwait), Martyr Dr. Akash Ansari (Urdu), Wali-ur-Rehman (Shina – Gilgit-Baltistan), The event also featured honorary guests, including Barrister Bina Faraz.\nThe session was presided over by Anjum Saleemi, while Allah Razi Rajput served as the event host.\nHe said the celebration highlighted the richness of Pakistan’s linguistic heritage, emphasizing the importance of preserving and promoting mother languages through literary and cultural activities.\nIt is worth mentioning that the United Nations Educational, Scientific and Cultural Organization (UNESCO) declared February 21 as “International Mother Language Day” in 1999, with the aim of promoting linguistic and cultural diversity worldwide.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:00:49.980Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/international-mother-language-day-celebrated-with-calligraphy-cultural-painting-exhibition/",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T09:51:00.000Z"
}
