{
  "title": "Rs1.35 million cash prize, awards presented to literary figures at Perveen Shakir festival",
  "author": null,
  "content": "ISLAMABAD, Feb 22 (APP):Former Chairman of the Senate and leader of the Pakistan People’s Party (PPP) Raza Rabbani has called for reviving the vital link that exists between the reader and the book and commended the efforts of the Perveen Shakir Trust (PST) for working in that direction and promoting a culture of reading and writing in society.\nAddressing as Chief Guest the PST literature festival and award-giving ceremony here on Saturday at a local hotel, Raza Rabbani paid tributes to the trust’s Chairperson Parveen Qadir Agha, Secretary General Raana Seerat, short story writer Mazharul Islam and other organizers of the event.\nSenator Raza Rabbani said it was quite heartening to see the PST making endeavours not only to keep alive the memory of the great poet Perveen Shakir but also promoting a culture of book-reading in the country which otherwise is fast diminishing.\nA large number of art and literature lovers attended the festivals. Literary luminaries like Asghar Nadeem Syed, Prof Fateh Muhammad Malik, Dr Najiba Arif, Muhammad Hameed Shahid, Nasir Ali Syed, Muhammad Asim Butt, Naheed Qamar, Rafaqat Javed, Muhammad Saleem Sethi, Tahir Sherazi, Sabin Younas and others also participated in various sessions of the day-long festival that was creatively designed by Mazharul Islam.\nA marathon reading of Perveen Shakir’s poetry, lively debates on ‘Kitabain Udaas Hain: Kitab ka Mustaqbil’ were also among the highlights of the festival.\nProf Fateh Muhammad Malik presenting Nayyer Adbi Award along with Rs200,000 cash prize to Mazharul Islam for his 2023 novel Sarus Cranes Apnay Khawbon Say Ur kar Ja Chukay Hain.\nBesides, discussion on the books written on Perveen Shakir and her poetry ‘Perveen Shakir: Nay Zawiay, nay Mutaliaat’ ‘Perveen Shakir Alamatiat kay Tanazir Main’ and ‘Tragedy and Defiance: The Lives and Poetry of Sylvia Plath, Forugh Farrokhzad, and Perveen Shakir’ by Mahmood Ali Ayub also warmed the audience’s hearts.\nRaza Rabbani congratulated the PST on opening its chapter last year in Canada. Now Perveen’s poetry will find audience overseas also, he said.\nChairperson of PST, Mrs Parveen Qadir Agha earlier in her welcome address briefed the Chief Guest and the audience about the primary job of the trust i.e. to keep Perveen Shakir’s memory and heritage alive over the past 30 years (Perveen Shakir died on Dec 26, 1994 in a fatal road accident in Islamabad).\nThis year’s festival is being held after a period of four years because of COVID-19 and other reasons but now we shall try to hold on an annual basis, she assured the audience.\nShe also paid rich compliments to the members of the PST for their unwavering support for last 30 years. Their effort in keeping the legacy of Perveen Shakir’s legacy is truly commendable, she said.\nA number of awards were also given on the occasion along with cash prizes of total amount Rs1.35 million. Mazharul Islam was given Nayyer Adbi Award for his 2023 novel ‘Sarus Cranes Have Flown out of their Dreams’ along with Rs200,000/-.\nWell-known fiction writer, Mustansar Hussain Tarar received (in absentia) ‘Husn-e-Funn’ award along with Rs100,000/.\nLikewise, Amjad Islam Amjad Adbi award was presented to Hameeda Shaheen (in absentia) for ‘Zinda Hoon’ along with Rs100,000. Another literary stalwart Prof Fateh Muhammad Malik received Mian Atta Rabbani Award along with a cash prize of Rs 100,000/- for his book ‘Ashyana-e-Ghurbat say Ashiaan dar Ashiaan.’\nChairperson of the PAL, Dr Najiba Arif received Aks-e-Khushbu Award 2022 along with Rs50,000 cash prize for her book of short stories ‘Meethay Nalkay.’\nMuhammad Hameed Shahid (Iqbal Fareed Adbi Award 2023 along with Rs50,000 for his autobiography Khushbu ki Diwar Kay Peechay), Khurshid Rabbani (Sultan Mahmood Qazi Adbi Award 2021 with Rs50,000 for his book Ghubaar-e-Ayna), Asim Butt (Begum Sarfraz Iqbal Award 2024 with Rs50,000 for Kafka Kahanyan), Saleem Sethi (Begrum Sarfaraz Iqbal Adbi Award 2021 with Rs50,000 for his translation of Attar’s Mantaqul Tairand) others also received various awards including PST’s Aks-e-Khushbu Awards.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:00:06.344Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rs1-35-million-cash-prizes-literary-awards-presented-to-writers-poets-critics/",
  "dateList": "2025-02-22",
  "date_published": "2025-02-22T16:38:00.000Z"
}
