{
  "article_id": "2025-10-07_73424d4c497379db8a983032a195386d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pr-goes-cashless-in-partnership-with-npf/",
    "retrieved_at": "2025-10-11T23:55:08.438Z"
  },
  "metadata": {
    "title": "PR goes cashless in partnership with NPF",
    "author": null,
    "date_published": "2025-10-07T20:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 203,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 07 (APP): Pakistan Railways has signed a landmark agreement with the National Police Foundation (NPF) to fully digitize its revenue system, ushering in a new era of cashless transactions. The signing ceremony was graced by Minister for Railways Muhammad Hanif Abbasi, alongside senior officials from Pakistan Railways and representatives of the National Police Foundation (NPF). Under the new system, passengers can conveniently purchase tickets using ATMs, mobile apps, internet banking, bank branches, NADRA e-Sahulat centers, debit cards, and QR codes. The State Bank of Pakistan and 1LINK will transfer collected revenue to the national treasury three times daily. As a consortium of 40 banks, 1LINK will integrate the payment network to enhance transparency and operational efficiency. Calling the initiative a milestone in Pakistan Railways' history and a testament to the prime minister's vision for a cashless future, Hanif Abbasi stated that the initiative will streamline the payment process, enhancing speed, transparency, and efficiency. The newly introduced cashless system is designed to deliver a faster, more transparent, and efficient ticketing experience. Abbasi emphasised that this shift will provide passengers nationwide with a smoother and more convenient ticketing experience. Railways Chairman described the project as a significant step toward modernizing the railway system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}