{
  "article_id": "2025-10-07_ae561f237e1bb6614ed8f88c869fde76",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/teachers-soar-to-new-heights-at-suparcos-water-rocket-training-workshop/",
    "retrieved_at": "2025-10-11T23:55:58.064Z"
  },
  "metadata": {
    "title": "Teachers soar to new heights at SUPARCOâs Water Rocket Training workshop",
    "author": null,
    "date_published": "2025-10-07T16:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 261,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 07 (APP):As part of the ongoing World Space Week 2025 celebrations, the Space and Upper Atmosphere Research Commission (SUPARCO) organized a dynamic Teachersa Training and Workshop on Water Rocket Making and Launching in Islamabad. The interactive session aimed to promote hands-on learning in space science and inspire educators to engage students in scientific exploration. Around 50 teachers from public and private schools participated with great enthusiasm. The event began with an engaging presentation on the Fundamentals of Rocket Science, introducing key principles such as thrust, pressure, trajectory, and stability. Participants then took part in a practical session, where they learned to design and assemble their own rockets using PET bottles and simple, low-cost materials. The highlight of the workshop was the rocket launching activity, where teachers proudly launched the rockets they had built, witnessing the real-time application of physics in action. The excitement and joy of watching their creations soar high into the sky turned abstract scientific concepts into a memorable learning experience. The Islamabad workshop is part of a nationwide series organized by SUPARCO in Karachi, Lahore, Peshawar, and Gilgit, reflecting Pakistanas active engagement in global space education initiatives. World Space Week (October 4a10) is celebrated annually in more than 90 countries to mark humankindas achievements in space science and technology. The 2025 theme, aSustaining Space for Sustainability on Earth,a highlights how innovations in space exploration contribute to solving global challenges. Through activities like the Water Rocket Workshop, SUPARCO continues to nurture scientific curiosity among youth and educators, aligning with its mission to promote STEM education across Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}