{
  "article_id": "2025-10-07_437261f68e6b3915552d8d2f2639a869",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-issues-notices-on-acquittal-pleas-of-pti-founder-bushra-bibi-in-toshakhana-ii-case/",
    "retrieved_at": "2025-10-11T23:55:57.951Z"
  },
  "metadata": {
    "title": "IHC issues notices on acquittal pleas of PTI founder, Bushra Bibi in toshakhana-II case",
    "author": null,
    "date_published": "2025-10-07T17:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 318,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 07 (APP):The Islamabad High Court (IHC) on Tuesday issued notices and sought responses on the acquittal petitions of PTI founder and Bushra Bibi in the Toshakhana II case. Lawyer Salman Safdar requested the court to stop the trial court from giving the final verdict in the case, to which the court remarked that we will look into it. Justice Inaam Ameen Minhas heard the acquittal petitions of PTI founder and Bushra Bibi in the Toshakhana II case. PTI founder's lawyer Salman Safdar, while giving arguments, said that Toshakhana cases were filed earlier as well. The trial of Toshakhana II is now in its final stages. First, one case was filed and then another. After the conviction in Toshakhana I, the division bench of the High Court suspended the conviction, he argued. The lawyer said that the Bulgarian jewellery set on which Toshakhana II case was filed, if it exists, please tell us. The court inquired as to what charges have been made against the petitioner. The lawyer said that the petitioner is accused of accepting gifts including a jewellery set. The lawyer said that along with the cipher case, my client is sentenced in the Tosha Khana I case. Bushra Bibi was re-arrested from Gate No. 5 of Adiala Jail after being acquitted in the Iddat Nikah case. The court ordered Salman Safdar to submit the court decisions, noting that he could retain them if necessary for the bail case, and would need to return to discuss them further. Salman Safdar said that nineteen witnesses have recorded their statements in this case. On the court's inquiry, he said that there are fifty-five witnesses in total. Salman Safdar requested the court to stop the final decision of the case. The court adjourned the hearing of the case and said that we will look into it. A written order for the hearing of the case will be issued.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}