{
  "article_id": "2025-10-07_f771c8334b28c6764632148ce8d4f319",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ccp-moves-against-false-marketing-by-real-estate-developers/",
    "retrieved_at": "2025-10-11T23:56:45.503Z"
  },
  "metadata": {
    "title": "CCP moves against false marketing by real estate developers",
    "author": null,
    "date_published": "2025-10-07T13:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 319,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 7 (APP):The Competition Commission of Pakistan (CCP) is in process of initiating an inquiry into deceptive marketing practices in the real estate sector. The decision is based on extensive data and intelligence gathered by CCPas Market Intelligence Unit (MIU) and the Office of Fair Trade (OFT), which revealed widespread misrepresentation by various housing societies and developers, said a release issued here on Tuesday. The inquiry would specifically target projects falsely claiming to be located within the Islamabad Capital Territory (ICT) or registered with the Capital Development Authority (CDA), despite being situated outside its jurisdiction. The CCP has called upon all stakeholdersaincluding consumers, investors, and overseas Pakistanisato assist the Commission by submitting any available evidence, documents, or promotional materials that can support the inquiry. Complaints and proofs may be submitted through the CCPas Online Complaint Portal at www.cc.gov.pk. Initial analysis conducted by the CCP indicates that several housing societies and real estate projects have engaged in deceptive practices, including, misrepresenting project location by using the name aIslamabada for developments actually situated in Rawalpindi, Attock, Taxila, and Murree. The real estate projects falsely claiming regulatory approvals, NOCs, or affiliation with CDA and using fake images, digital renderings, or exaggerated portrayals of development. They provide false assurances of utilities such as electricity, gas, and water, or amenities like schools, hospitals, and community centers that do not exist in approved plans, and employing unauthorized endorsements, celebrity testimonials, and misleading installment plans with hidden charges. Also promising unrealistically high returns on investment in unapproved or non-existent projects. The CCP emphasized that such practices mislead buyers and investors, particularly overseas Pakistanis, distort competition, and undermine consumer trust. Deceptive marketing constitutes a violation of Section 10 of the Competition Act, 2010, and undertakings found guilty may face penalties of up to PKR 75 million or 10% of annual turnover. Continued violations may also result in further legal and corrective measures to safeguard public interest.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}