{
  "article_id": "2025-10-07_9e4bbe4c7f8c3fba306d8b6e88e7bcb1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-reiterates-pakistans-commitment-to-thriving-startup-ecosystem-business-friendly-environment/",
    "retrieved_at": "2025-10-11T23:56:26.259Z"
  },
  "metadata": {
    "title": "PM reiterates Pakistan’s commitment to thriving startup ecosystem, business-friendly environment",
    "author": null,
    "date_published": "2025-10-07T09:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 270,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KUALA LUMPUR, Oct 7 (APP): Prime Minister Shehbaz Sharif on Tuesday reiterating his government's commitment to creating a business-friendly environment and ease of doing business, said that efforts were underway for reforms to support startups and early-stage investors through investment facilitation and better infrastructure access. The prime minister, in a meeting with a delegation from the Malaysian business group Gobi Partners, led by Co-Founder and Chair Thomas G. Tsao, said that the Special Investment Facilitation Council was striving to provide all possible facilities to foreign investors. Citing immense potential for enhancing economic and trade cooperation, he said that Pakistan and Malaysia were working diligently towards that goal. He commended the Pakistan-Malaysia Business and Investment Conference held on Monday to strengthen business-to-business ties which was addressed by both Prime Minister Shehbaz Sharif and his Malaysian counterpart Anwar Ibrahim. Appreciating Gobi Partners' confidence in Pakistan's startup ecosystem, Prime Minister Shehbaz said that mobilizing international and domestic investment to build a sustainable startup ecosystem was his government's priority. He said that the digital economy, particularly fintech, e-commerce, and IT services, was a vital component of the national development strategy and that the country welcomed relevant international business groups and investors, keeping in view its vast potential in IT, tech, and AI sectors. Gobi Partners expressed keen interest in collaboration in Pakistan's e-commerce and financial technology sectors. The meeting was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, Minister for Commerce Jam Kamal Khan, Minister for National Food Security and Research Rana Tanveer Hussain, Minister for Information and Broadcasting Attaullah Tarar, Special Assistant to PM Tariq Fatemi, and relevant senior government officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}