{
  "article_id": "2025-10-07_91982ca2dc3647cf0b7138b855639fd2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-winds-up-three-day-official-visit-to-malaysia/",
    "retrieved_at": "2025-10-11T23:56:23.358Z"
  },
  "metadata": {
    "title": "PM Shehbaz winds up three-day official visit to Malaysia",
    "author": null,
    "date_published": "2025-10-07T13:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 247,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KUALA LUMPUR, Oct 7 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday left here for Pakistan after concluding his three-day official visit to Malaysia. At the Bunga Raya Complex of Kuala Lumpur International Airport, the prime minister was given a red-carpet send-off as the smartly turned-out static guards saluted him. Prime Minister Anwar Ibrahim was at the airport to bid farewell to Prime Minister Shehbaz, while Pakistan's Ambassador to Malaysia Syed Ahsan Raza, and diplomatic staff were also present. Earlier, upon the prime minister's arrival in Malaysia, Anwar Ibrahim warmly welcomed him at his residence. The prime minister travelled from his residence to the airport in an exceptional state protocol. Prior to departure, the Malaysian prime minister presented a commemorative album featuring photos from Shehbaz Sharif's three-day visit during which he held a bilateral meeting with Anwar Ibrahim and delegation-level talks, besides addressing the Pakistan-Malaysia Business and Investment Conference. During the talks, the two countries agreed to further strengthen cooperation in multiple sectors, with Malaysia announcing to import $200 million worth of meat from Pakistan. Several Memoranda of Understanding (MoUs) were signed to enhance cooperation in various sectors between the two countries. Prime Minister Shehbaz had also presented to Anwar Ibrahim an Urdu translation of his book 'SCRIPT: For a Better Malaysia'. During the visit, Shehbaz Sharif was also conferred an honorary degree of Doctor of Philosophy in Leadership and Governance by International Islamic University Malaysia (IIUM) in recognition of his outstanding leadership and contributions to nation-building.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}