{
  "article_id": "2025-06-14_265378c57acfe97c10f7870c349ef525",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-stands-with-iran-against-israeli-aggression-pm-shehbaz-sharif/",
    "retrieved_at": "2025-08-27T11:08:23.596Z"
  },
  "metadata": {
    "title": "Pakistan stands with Iran against Israeli aggression: PM Shehbaz Sharif",
    "author": null,
    "date_published": "2025-06-14T16:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 291,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Jun 14 (APP):Prime Minister Muhammad Shehbaz Sharif held a telephone conversation on Saturday with Dr Masoud Pezeshkian, President of the Islamic Republic of Iran, Saturday evening. He said Pakistan stood resolutely in solidarity with the brotherly people and the Government of Iran in face of Israel's unprovoked and unjustified aggression. He strongly condemned Israeli attacks against Iran, that violated its sovereignty and territorial integrity, and were in complete defiance of the UN Charter and international law. Iran had the right to self-defence, as provided under Article 51 of the UN Charter, he added. While expressing heartfelt condolences to President Pezeshkian over the loss of precious lives in the attacks, the prime minister recalled Pakistan's support to Iran at the UN Security Council's emergency meeting, held on Friday. The PM denounced Israel's blatant provocations and adventurism as a grave threat to regional and global peace and stability. He also strongly condemned Israel's unabated genocidal campaign against the valiant Palestinians, carried out with complete impunity. He urged the international community and the United Nations to take urgent and credible steps to put an end to Israel's aggressive behaviour and its illegal actions. He stated that Pakistan was fully committed to promoting peace in the region and stood ready to play its role in this context. President Pezeshkian thanked Prime Minister Shehbaz Sharif for Pakistan's support and solidarity with Iran at this difficult time, particularly at the UN Security Council. He said this gesture was reflective of the close and brotherly relations between the two countries. He apprised the PM about Iran's perspective on the crisis with Israel and urged the international community, particularly the Islamic countries, to work together closely to counter these threats. Both leaders agreed to remain in close contact.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}