{
  "title": "PM directs immediate COVID-19 vaccination of 5-12 years children",
  "link": "https://www.app.com.pk/national/pm-directs-immediate-covid-19-vaccination-of-5-12-years-children/",
  "date_published": "2023-01-03T07:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 3 (APP): Prime Minister Shehbaz Sharif on Tuesday, expressing satisfaction over the COVID-19 situation being under control in Pakistan, directed the authorities concerned to ensure the vaccination of children aged 5-12 years on an urgent basis.\nThe prime minister, who chaired the meeting to review the COVID-19 situation in the country, instructed to further improve screening at border points as well as airports. He also sought a report on a third-party evaluation of the screening process at border points and airports.\nHe said it was pleasing that no COVID-related death was reported from across the country in the last 15 weeks and said the whole nation was thankful for the countries which had donated vaccines to Pakistan.\nThe prime minister said the decline in the ratio of COVID infection was pleasing but “we have to be alert all the time.”\nHe appreciated the efforts by the NCOC and other relevant office bearers for containing the spread of COVID.\nDuring the meeting, the prime minister was briefed about the current COVID situation, new variants, ongoing efforts, and the status of vaccination.\nIt was told that Pakistan apparently faced no threat from the new variant as almost 90% of the population was fully vaccinated and 95% partially vaccinated.\nAround five million children of 5-12 years of age have been vaccinated which was 25% of the total strength and the target of full vaccination would be achieved within the next few months.\nThe meeting was told the infection ratio of 0.2 to 0.5% average was reported in the country.\nThe participants of the meeting were told that an effective mechanism was in place at the borders to contain the spread of COVID. Moreover, the ratio of random sampling at the airport has been increased to 2% besides ensuring the fumigation of the planes coming from the affected countries.\nIt was told that Pakistan was among very few countries where genomic surveillance of COVID has been introduced to ensure early detection of the new variants.\nThe prime minister also appreciated the efforts by the NCOC, the officers of the Ministry of National Health Services and the officials of Civil Aviation to contain the spread of the virus.",
  "retrievedAt": "2025-08-11T05:40:26.997Z"
}
