{
  "title": "Committee recommends not to shift PSQCA headquarters to Islamabad from Karachi",
  "link": "https://www.app.com.pk/national/committee-recommends-not-to-shift-psqca-headquarters-to-islamabad-from-karachi/",
  "date_published": "2023-01-03T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 03 (APP): The National Assembly Standing Committee on Science and Technology in a meeting held here Tuesday recommended that the headquarters of the Pakistan Standards and Quality Control Authority (PSQCA) should not be shifted from Karachi to Islamabad.\nIn the meeting which was held here at the parliament house under the Chairmanship of Member National Assembly, Sajid Mehdi, the committee observed that the shifting of PSQCA headquarters from Karachi to Islamabad may cause loss to the government exchequer.\nThe Additional Secretary, Ministry of Science and Technology apprised the Committee that under PSQCA Act of 1996, the headquarters of the Authority shall be at Karachi and it may, with the approval of the Federal Government, set up regional offices at such places as when and where required.\nHe informed that a Bill was introduced in the Senate by Senator Kauda Babar for transferring the PSQCA headquarters from Karachi to Islamabad. The said Bill was referred to the Senate Standing Committee of Science and Technology for consideration and report.\nHe also informed that the Committee considered the amendment in Section (2) of the PSQCA Act and passed the Bill with the majority. The Additional Secretary was of the view that the said shifting is not feasible.\nThe Committee recommended that the headquarters of PSQCA should not be shifted from Karachi to Islamabad.\nWhile briefing on the updated status of the Hemp Policy, the Committee was informed by the Additional Secretary that a Summary regarding National Industrial Hemp and Medicinal Cannabis Policy was submitted to Cabinet Division on September 01, 2022 which was routed through the Ministry of Narcotics Control, Ministry of Commerce and Ministry of National Food Security and Research.\nHe also informed that the Cabinet Division has forwarded the summary to the Prime Minister’s Office for approval.\nThe Committee directed the Ministry of Science and Technology to pursue the case from the Prime Minister’s Office for the issuance of the National Industrial Hemp and Medicinal Cannabis Policy as early as possible.\nThe committee was also briefed regarding the regularization of the contractual/daily wages employees of the Ministry.\nThe Additional Secretary apprised that 13 employees of National Institute of Electronics (NIE) were appointed in a Public Sector Development Program (PSDP) project on a contract basis and after the completion of the project their appointments stood terminated as the PSDP project was not converted to the non-development side; therefore, the employees cannot be regularized.\nThe meeting was attended by MNAs including Nisar Ahmed Cheema, Mukhtar Ahmad Malik, Chaudhry Muhammad Ashraf, Khursheed Ahmed Junejo, and Naveed Aamir Jeeva. The senior officers from the Ministry of Science and Technology and PSQCA, Karachi were also present in the meeting.",
  "retrievedAt": "2025-08-11T05:40:07.710Z"
}
