{
  "title": "Pakistan can avert water crisis by adopting drip, spray irrigation system in farming: President",
  "link": "https://www.app.com.pk/national/pakistan-can-avert-water-crisis-by-adopting-drip-spray-irrigation-system-in-farming-president-2/",
  "date_published": "2023-12-07T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP):President Dr Arif Alvi has said that Pakistan needs to employ smarter and less water-intensive practices like drip and spray irrigation in agriculture to avert the looming crisis of water shortage.\nThe agriculture sector, he said, consumes approximately 95 percent of the country’s water, which needs immediate planning and reforms on water use efficiency.\nIn a video-link address to the international conference on ‘Transformative pathways for water and food systems in a climate resilient Pakistan held in Karachi on Wednesday, he said the country needed effective management to secure its existing water resources.\nInternational and local water experts attended the event which was organized by the International Water Management Institute (IWMI), the Pakistan Council of Research in Water Resources (PCRWR), the Ministry of National Food Security and Research, the Ministry of Water Resources, the Ministry of Climate Change and UNICEF.\nPresident Alvi said Pakistan ranked among the top 10 countries worldwide most affected by climate change and natural disasters.\nHe pointed out that the water crisis being faced by Pakistan was one of the most pressing challenges, aggravated due to rapid population growth, urbanization, industrialization, depletion of water resources, environmental deterioration, climate change, and irrational human behaviour.\nThe president emphasized research and technological innovation to promote modern agricultural technologies at grassroots level.\nHe said there was a need to educate farmers about water conservation, rain-water harvesting, and aquifer technologies.\nCommunity involvement and implementation of laws could prove helpful in effective water management, he added.\nThe president mentioned that Pakistan’s farmers were dependent on conventional methods of flood irrigation, which wasted water while the world practiced drip and spray irrigation and recycling of water.\nCrop substitution, he said, could make a difference if farmers chose crops that were less expensive on water.\nHe proposed research on using rice grain which grew on less water and produced high yield.\n“We should adopt the technology that can handle the water scarcity and improve food sustainability,” he said.\nThe president referred to the example of The Netherlands, which is 19 times smaller than Pakistan in land mass, but is the second-largest exporter of food products. With water conservation, vertical farming, planet control farming, and hydroponic farming, a small country can produce more yield per acre, he added.\nDr Alvi stressed attitudinal change to adopt the ways of water usage which were inexpensive and technically better.\nHe said water pricing in agriculture and urban was necessary to avoid waste of water.\nThe president said besides the external Indus water treaty with India, Pakistan had an internal provincial water distribution arrangement that needed improvement.\n“We have to improve the telemetry system and develop a confidence-building system among provinces on judicious use of water,” he said. Also, satellite telemetry can be used to know the actual water flow towards provinces.\nHe said Pakistan is endowed with 158 million acre-feet of water per annum and the tube wells in Punjab supply 12 million acre-feet of the commodity.\nHe pointed out that water pumping had affected the levels of the aquifer and stressed the need for modes to recharge the traditional aquifers to avoid its depletion.\n“A whole-of-the-society approach is needed to be adopted right from childhood on caring for the environment. Pakistan needs both mitigation and adaptation as important tools to increase water storage to meet its needs,” he said.\nThe president emphasized an effective drainage system to avoid the discharge of industrial waste into the seas.\nDirector General Pakistan Council of Research in Water Resources Dr Hifza Rasheed, Dr Bunyod Homatov and Dr Juan Carlos Sanchez Ramirez from the International Water Management Institute, Dr Stephen Davies from International Food Policy Research Institute, and Dr Neil Lazarow from the Australian Centre for International Agricultural Research spoke on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:54:38.275Z"
}
