{
  "title": "Solangi assures general elections to be held on February 8",
  "link": "https://www.app.com.pk/national/solangi-assures-general-elections-to-be-held-on-february-8/",
  "date_published": "2023-12-07T07:44:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 07 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi categorically said on Thursday that general elections in Pakistan would be held on February 8, 2024 and no one should have any doubts in that regard.\nAddressing a press conference along with Provincial Information Minister Ahmed Shah here, he said the caretaker regime was fully committed to ensure free and fair elections on the date given by Election Commission of Pakistan ( ECP).\nMurtaza Solangi reaffirmed the commitment of the government that all the financial, administrative and security needs of ECP would be met.\nHe said that the federal government was making all out efforts to ensure that there was no lack of communication between the federal and provincial governments.\nThe minister said that the federal and provincial information ministers would formulate a joint strategy regarding upcoming elections.\nHe said it was prerogative of the people of Pakistan to decide who would rule the country.\nThe preamble of the Constitution of Pakistan clearly stated that the country would be run by its elected representatives, he said.\nMurtaza Solangi said “Making major decisions is the job of the elected parliament and elected government.”\nThe minister said it was the effort of the present government that the situation should not deteriorate in the run up to the general elections.\n“We will hand over the country in a better condition to the elected government,” he added.\nConducting free and transparent elections was the responsibility of ECP and the caretaker set up was providing all possible support and facilitation to ECP in that regard, he remarked.\nReplying to a question, the minister said that Caretaker Prime Minister Anwaarul Haq Kakar had visited Karachi several times in a short period of two months.\nSolangi said even today, the Prime Minister would visit Karachi to attend a function at the Stock Exchange.\nThe minister said said that caretaker prime minister had a good record of visiting provinces and different cities.\n” You have never seen such a friendly prime minister”, he opined.\nTo another question, Murtaza Solangi said that there had been security concerns in the run up to every elections in the past.\nHe said former prime minister Benazir Bhutto was martyred during the election campaign in 2008 and there were also security challenges in the 2013 elections.\nHe said that so far such situation had not arisen in the country which the national security agencies could not control.",
  "retrievedAt": "2025-08-11T10:53:37.446Z"
}
