{
  "title": "PM urges business community to leverage SIFC; commits conducive environment",
  "link": "https://www.app.com.pk/national/pm-urges-business-community-to-leverage-sifc-commits-conducive-environment/",
  "date_published": "2023-12-07T15:23:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 7 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday, reiterating the government’s commitment to providing a conducive environment and streamlining regulations, urged the local business community to take advantage of the Special Investment Facilitation Council (SIFC).\nThe prime minister, addressing the ceremony for distribution of Pakistan Stock Exchange (PSX) Awards to top 25 companies of the country for the year 2022, said the caretaker government’s ultimate goal was to provide a blueprint for the next government.\nHe said the government had sought help from the Pakistan Army to facilitate the business environment through the SIFC forum.\nHe told the gathering that the measures taken by the government, including the crackdown on smuggling, illicit foreign currency trade and power theft, had yielded results, triggering market sentiments and propelling the Pakistan Stock Exchange by 33% in November to the historic 60,000-point mark, besides boosting investors’ confidence.\nWelcoming the private sector to invest and take advantage of the government’s measures, he called for building and rebranding Pakistan.\nHe said the privatization process was underway that would also have positive impacts on the economy.\nThe prime minister, who also distributed awards among the top 25 companies, said the PSX mirrored the vibrancy of the corporate sector and highlighted the symbiotic relations between the government’s policies and the prosperity of the businesses.\nHe emphasized the inherent responsibility of Corporate Social Responsibility (CSR), urging businesses to adopt it as a moral obligation rather than mere rhetoric. He also urged business leaders to embrace digital evolution and collaborate with higher education institutions.\nPrime Minister Kakar urged the corporate sector to explore opportunities in regions like Economic Cooperation Organization (ECO), Caucasus, and the unexplored around 1.3 billion African population. He emphasized the need to prepare for $36 trillion trade activity expected to take place in China within 10-15 years.\nHe encouraged soul-searching and improvement of approaches to envision Pakistan as the economic power of the region.\nHe said Pakistan, a 240 million nation with immense natural resources like four seasons, mountains, and others as well as the youth bulge was destined to rise.\nThe prime minister said the award ceremony to recognize outstanding companies was a testament to cooperation between the government and the corporate sector.\nHe congratulated award-winning companies on their extraordinary performance and said such ceremonies would create a culture of healthy competition to inspire more firms.\nIn her address, Caretaker Finance Minister Dr Shamshad Akhtar expressed the synergies between the Pakistan Stock Exchange and her professional journey.\nEmphasizing the visible potential of the PSX, with a noteworthy gain in the last quarter of 2023, she highlighted the government’s collaborative efforts that enabled the swift stabilization of the economy within a short period.\nShe stressed the need to harness the underlying potential of the PSX further and pledged the government’s commitment to sow the seeds for future growth.\nShe hinted at significant progress in the restructuring of the Federal Board of Revenue (FBR), assuring that tangible results would be evident before the departure of the interim government.\nThe finance minister highlighted the government’s commitment to facilitating businesses and said the PSX had made substantial inroads into Islamic finance which also got recognition from the market.\nShe said the country established an investor protection system as well as a robust appellate mechanism.\nStarted with the recitation of Quranic verses and the National Anthem, the awards ceremony was also attended by Sindh Governor Kamran Khan Tessorti and Caretaker Chief Minister Justice (Retd) Maqbool Baqir, besides a huge number of prominent business figures.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:54:12.803Z"
}
