{
  "title": "Parents, teachers play key role in shaping students’ future: PM",
  "link": "https://www.app.com.pk/national/parents-teachers-play-key-role-in-shaping-students-future-pm/",
  "date_published": "2023-12-07T08:05:00.000Z",
  "source": "APP",
  "content": "KOHAT, Dec 7 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday, said the parents and teachers were the most important partners playing key role in shaping and designing the future of students.\nAddressing the 58th Parents Day of Cadet College Kohat (CCK), the prime minister upon the faculty members, who play central role in the overall education system, to pay full attention to groom and guide the future of the country by inducing a high sense of purpose in the students.\nPrime Minister Kakar, who is also the alumni of the college urged the parents to fulfill their responsibilities by supporting the college and imparting better training and grooming to their wards.\nRecalling his student’s life in the college, the prime minister said he spent a healthy and challenging routine in the college.\n“But all the challenges were directed solely at making us promising professionals and making better human beings to face challenges of adult life in a befitting manner,” he added.\nHe said modern education specially in the field of science and technology guaranteed the material prosperity of a nation.\nHe said the educated youth imbued with high moral values could ensure a bright future for the beloved homeland. “In this age of competition we should concentrate all our energies to equip ourselves with modern education coupled with strict work ethics to enable ourselves to cope with the challenges of this ever competitive and rapidly evolving world.”\nThe prime minister also urged the students to concentrate their focus on studies, taking full advantage of time and the facilities and fulfill the obligation made to their parents.\nHe said he got admitted in the college in 1984 when he was a very fragile individual coming from a backward area of Balochistan province.\nPM Kakar also paid rich tribute to his teachers-some of them had passed away- saying that at what level he had reached now was totally because of his teachers and parents.\nHe advised the students to work hard in their lives and set goals for their future. He said with their persistent hard work, honesty and sincerity, they could achieve their goals.\nPrinciple Cadet College Kohat Brigadier (Retd) Tufail Muhammad Khan said that the college had provided the best possible education and training facilities to the students due to which the CCK students had always gave the best results.",
  "retrievedAt": "2025-08-11T10:53:37.609Z"
}
