{
  "title": "PTDC takes immense initiatives for tourism promotion",
  "link": "https://www.app.com.pk/national/ptdc-takes-immense-initiatives-for-tourism-promotion/",
  "date_published": "2023-12-07T09:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP): The Pakistan Tourism Development Corporation (PTDC) has taken immense new initiatives to promote tourism across the country by marketing the country’s natural landscape, history, culture and archaeological sites to facilitate the tourists.\nAn official told APP on Thursday that the PTDC was planning to develop Tourism Application to inform the foreign and local tourists for easy access about their destination.\nHe said the corporation has already established the Tourist Information Centers (TIC) at various airports to provide accurate information to the tourists, adding that it was also planning to set up a modern TIC at new International Gwadar airport to facilitate the tourists by providing comprehensive information regarding recreational sites of the province.\nHe said, “PTDC is projecting the country as a tourist friendly destination in bringing Pakistan amongst top five tourist destinations of Asia and marketing of tourist places at home and abroad through tourism show and exhibitions to generate revenues.”\nThe official said tourism sector is contributing a lot to the national exchequer as well, adding that PTDC was developing infrastructure and services within the country to facilitate the tourists.\nHe said, “PTDC, with the collaboration of the Capital Development Authority (CDA) has kicked off an effective cleanliness campaign at different parks of the federal capital to ensure neat and clean environment to attract numerous tourists in a healthy ambiance.”\nThe official said that launching of the campaign was aimed to ensure clean environment. He urged the tourists to maintain cleanliness at tourist spots of the capital city as people from various parts of the country throng to the twin cities of Islamabad and Rawalpindi for recreation and tourism purposes.\nIt is pertinent to mention here that a large number of tourists including locals and foreign dignitaries are visiting the country’s recreational sites to enjoy a pleasant and lovely weather besides the peaceful atmosphere.\n\\395\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:54:17.942Z"
}
