{
  "title": "Dr Saqib terms self-accountability, integrity as basic elements for corruption free society",
  "link": "https://www.app.com.pk/national/dr-saqib-terms-self-accountability-integrity-as-basic-elements-for-corruption-free-society/",
  "date_published": "2023-12-07T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 07 (APP): Chairperson Benazir Income Support Programme (BISP), Dr Muhammad Amjad Saqib Thursday said that self-accountability and integrity are the fundamental elements for building a corruption-free society.\nWhile addressing as the chief guest at an event organized by the National Accountability Bureau (NAB) and Legal Aid and Justice Authority (LAJA) at the National Library of Pakistan, Dr Saqib emphasized the importance of social justice and collective fight against corruption.\nDuring his keynote address, he highlighted the profound truth that a nation not holding itself accountable will find its accountability written in history. “Not to lose hope for the betterment of society,” urged Dr. Amjad Saqib, emphasizing that the process of change begins with the individual.\nHe stressed the importance of practical knowledge alongside formal education in fostering personal and societal development.\nDr. Amjad Saqib expressed his gratitude to NAB for their efforts in the recovery of funds lost to corruption.\nThe event saw the distribution of shields and cash prizes to acknowledge the superior performance of NAB officers in the pursuit of justice and anti-corruption initiatives.\nOther distinguished speakers at the event included Dr. Raheem Awan, Director General Legal; Dr. Kaleem Imam, former Inspector General of Police; Mirza Irfan Baig, Director General NAB Rwp/Isb; and Mr. Sohail Nasir, Deputy Chairman NAB.\nEarlier, Dr. Muhammad Amjad Saqib also participated as a keynote speaker at the International Islamic Economics and Development Conference organized by Quaid-e-Azam University and the Institute of Policy Studies in Islamabad.\nThe conference theme, “Brotherhood – a key institution of an Islamic economy,” explored critical aspects of Islamic economic principles.\nDuring the address, Dr Saqib said, “Western economic theory is not the solution to our problems.”\nHe emphasized that the world faces no shortage of resources; rather, the challenge lies in the unfair distribution of wealth and resources.\nDr Saqib called for a deep understanding of sustainable development goals in the light of Islamic teachings and urged the exploration of the hidden treasures of the universe for the development of the country and improvement of the economy.\nDr. Tariq Majeed, Director School of Economic QAU; Dr. Niaz Ahmad Akhtar, Vice-Chancellor QAU; Dr M Idrees, Dean of Faculty Social Sciences QAU; and Saleem Ahmad Ranjha Director Akhuwat Foundation also attended the conference.",
  "retrievedAt": "2025-08-11T10:53:51.088Z"
}
