{
  "title": "Pakistan sets target of deporting 1 mln illegal immigrants till Jan 30: Jan",
  "link": "https://www.app.com.pk/national/pakistan-sets-target-of-deporting-1-mln-illegal-immigrants-till-jan-30-jan/",
  "date_published": "2023-12-07T16:01:00.000Z",
  "source": "APP",
  "content": "QUETTA, Dec 07 (APP): Balochistan Caretaker Minister of Information Jan Achakzai on Thursday stated that the government had given the law enforcement authorities a target of deporting one million illegal immigrants by January 30, 2024.\n“We aim to deport as many as 10,000 illegal immigrants a day. About 500,000 illegal immigrants have so far been repatriated since the deadline set for leaving Pakistan voluntarily expired,” he said while talking to APP.\nFollowing the decision taken by the Apex Committee in its October 2023 meeting, he said the caretaker government had given an ultimatum to all the undocumented immigrants to leave Pakistan by October 31 or risk imprisonment and deportation.\nAfter the expiry of the deadline, he added, the caretaker government launched a major crackdown against the illegal immigrants.\n“Apart from other provinces, some 150,000 illegal immigrants have so far been repatriated to their native countries from Balochistan alone,” Jan Achakzai said, adding that the process of repatriation would continue without any delay.\nTo a question, he termed the decision of Apex Committee wise, saying it was yielding positive results on the overall economic and law and order situation in the country.\n“The overall law and order and economy will definitely improve after the repatriation of all the illegal immigrants,” he hoped.\nThe minister, while reiterating the government’s resolve against Indian-sponsored terrorism in Balochistan, stated that poverty and unemployment were no reasons to take up arms against the state.\n“Pakistan’s wise policies have whitewashed all plots and hidden agendas of enemies to turn the Baloch youth into armed rebels against state institutions. The youth whose minds had been poisoned by RAW have now joined the national mainstream.\n“Pakistan’s foes, especially India, have failed in their designs, and all their efforts to harm Pakistan’s economy are also failing.”\nThe minister praised the remarks made by Shambay Gulzar, ex-militant who surrendered and joined the national mainstream, saying that the fight for rights could never be won by force or weapons.\nThe disgruntled elements had realised that taking up arms was not a solution of their problems, he added.\nJan Achakzai further emphasized that the countdown against the elements funded by India had begun and they would soon be exposed.\n“The bloody politics of those conspiring to make the innocent people of Balochistan against the state has been buried for good,” he added.\nExpressing his satisfaction over the improvement of economic indicators in the country, he said that under the leadership of Prime Minister Anwaarul Haq kakar and the vision of the Army Chief, Pakistan was thriving.",
  "retrievedAt": "2025-08-11T10:53:48.762Z"
}
