{
  "title": "Tarin hopes successful outcome of negotiations with IMF, links trade with India to K-dispute resolution",
  "link": "https://www.app.com.pk/business/tarin-hopes-successful-outcome-of-imf-negotiations-links-trade-with-india-to-k-dispute-resolution/",
  "date_published": "2021-10-14T07:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP): Federal Minister for Finance and Revenue, Shaukat Tarin Thursday expressed hope for successful outcome of top level negotiations between Pakistan and International Monetary Fund (IMF), for putting the $6 billion Extended Fund Facility (EFF) back on track.\n“I believe that the progress we have made to date is really encouraging and as we say Inshallah I see this happening now in this visit,” the federal minister said in an interview at United States Institute of Peace (USIP) on ‘Pakistan’s Economic Future’.\nThe minister said that the concluding 6th round of talks with IMF was the most important part of his visit to United States (US), adding that many virtual meetings already took place while the technical level discussions have also been concluded.\nHe said, at the final, meetings would be held with seniors at the IMF, including Managing Director of the Fund.\nThe minister said his government thought that IMF’s demand to increase power tariffs would trigger inflation, adding that this point was made in technical discussion with the fund, which was also informed that the increase in tariff would be made in gradually manner so that it does not have abrupt impact on inflation.\nHe said that there were some problems on power side, including excessive capacity, for which the government had to pay, adding the performance of distribution and generation companies was also being improved. He said all this was being successfully negotiated with the IMF.\nEconomy and Growth Rate\nThe minister said that there was no stagnation in growth, the Pakistan economy would grow by over 5 percent during the fiscal year 2021-22.\nHe said that back in 1960s Pakistan’s economy was 4th largest in Asia, however the nationalization policy of Zulfiqar Ali Bhuto and Afghani War in 1979 disrupted the economic growth.\nHe said, Prime Minister Imran Khan took over an economy which was struggling in 2018 with $ 20 billion current account deficit, unsustainable fiscal deficit, adding that he had to go for tough IMF programme besides taking some politically unpopular decisions including currency devaluation, increasing discount rate and increasing utility prices.\nThe minister said as the country’s economy had started consolidating and growing, the Covid-19 pandemic hit the world.\nHowever, it was skillfully dealt by the government as was indicated by far lesser human and property losses caused by the pandemic in Pakistan compared to rest of the world. He said the government during Covid-19 kept investing in two productive sectors, agriculture and industry as well as housing.\nHe said during Fiscal Year 2021, the growth was recorded at over 4 percent as compared to negative half percent growth the previous year, showing V-shaped recovery.\nHe said, the country had around 60 percent population below the age of 30 years who need jobs, so the government revitalized agriculture, industry, exports, housing and believe that economy would grow by over 5, percent. However, he said, at the same time there was need to make sure it is not overheated.\nHe said, the government was also ensuring that underprivileged were not ignored and made to wait for trickledown effect of positive economic growth, which has never reached to them for many decades. So the government utilized bottom-up approaches to ensure sustainable and inclusive growth.\nFor this purpose, the government was providing interest free loans to farmers and low income families besides issuing health cards and giving technical trainings to help around 4 million households.\nChange in Focus from Geo-Security to Geo-Economics\nThe minister said, Prime Minister has changed the focus of the country from geo-security to geo-politics to ensure economic welfare of people. This kind of change in focus means everything changes in terms of foreign policy, economic policy, internal security, and whatever else and relationship with neghbours.\nHe said that Pakistan was having good relations with all neghbouring countries, but there were issues with India, which needed to be resolved.\nPak-India Trade and Kashmir Dispute\nThe minister said that there was a fundamental issue between Pakistan and India and that was Kashmir, which he said was a disputed territory as per the United Nations Security Council resolutions.\nHowever, he said, the current Indian government was not accepting its disputed nature and had taken some unilateral decisions, depriving Kashmiris of various privileges given to them.\nHe said that trade and economic operations between India and Pakistan were suffering, adding that Imran Khan had offered so many times to India that if they take one step Pakistan would take two steps, urging Indian government to respond positively.\nHe said at political level, there was a need to provide some space for economics and welfare of people of both the countries.\nAfghanistan Situation\nThe minister said that like all other counties of world, Pakistan also wanted inclusive government in Afghanistan and was also striving for that.\nHowever, he cautioned that Taliban were running out of cash and if the world did not come to support them on humanitarian grounds, there would be complete chaos, which would spill over to Pakistan and other countries.\nHe said that since Taliban were saying that they would cooperate with world, become responsible country, take care of human rights, protect women rights and pledged not to promote terrorism, we should help them step by step and encourage them to demonstrate improvements in there behaviuor.\nHe said, if situation in Afghanistan worsens it would affect Pakistan the most. “Pakistan believes if the situation in Afghanistan deteriorates we will directly get effected, ” the minister remarked.\nTalking about the security situation in Pakistan the Minister said that Pakistan had fenced border with Afghanistan, except a small strip near Chaman while traffic flow to and from Afghanistan has been controlled and security forces were also taking necessary action to maintain security.\nReforms in Human Resource\nThe minister said that the government was working to reform the entire human resource; bring in private sector in key position in ministries and have combination of bureaucrats who understand both government and private sector.\nHe said that Federal Board of Revenue (FBR) had constituted, a committee on these lines having half-half representation from public and private sectors to move forward efficiently.\nEase of doing business\nThe minister said that owing to the comprehensive policy decisions, Pakistan jumped 28 places in ease of doing business. He said that Prime Minister was taking charge himself and Board of Investment was reporting directly to him while the PM was holding two meetings every month.\nHe said that Special Economic Zones (SEZs) would be made autonomous to provide a conducive environment to the foreign investors, adding that autonomous status would initially be introduced in around 6 zones within next 12 months and would be replicated in other zones later.\nPrivatization Priorities\nThe minister said that there were around 85 companies run by the government out of which 15 were making loses of around one percent of GDP. These include airline, railways, steel mill and power distribution companies.\nHe said that these companies would be disassociated from ministries and their control would be handed over to professional people to overhaul them and within 5 years, these would be privatized. He maintained that in developing countries like Pakistan, government had no job to run the businesses.\nHe said that people were being probed for flight of capital, adding that nobody would be spared and whoever had done anything wrong would have to face the consequences.\nPakistan-China-US relations\nThe minister said that Pakistan wanted to be friend with everybody including United States, China.\nHe said that Pakistan had major strategic partnership with US and its friendship with China would not affect its relations with US. “We believe we can work with both powers equally.”\nHe said, Chaina had helped us to build infrastructure and that does not mean Pakistan had become China-Centric. “We are open and want to do business with china, US, Europe, Japan, Korea. We are open country. There should be no misconception,” he cleared.\nOn China Pakistan Economic Corridor (CPEC), the minister said that Pakistan needed to build infrastructure to attract foreign investments. Since Pakistan was not in position to build such huge infrastructure, so China provided funds and helped us in building roads, railways, power generation,  and other infrastructure, which generated economic activity.\nTo a question, the minister said that there were some projects where companies from China, United States and Pakistan were in engaged joint ventures and collaborating with each other. This cooperation could be enhanced he added.\nThe minister again made it clear that Gwadar port was not China-Centric, saying that it was open to everybody including Japanese, South Koreans, Europeans. He said, if anybody wants to have business with African countries and Central Asia States, Gwadar was the right place.\nThe minister said that the government wanted to attract investment form different counties and that was why it had developed infrastructure. He said, Gwadar was a big opportunity as it was a unique territory covering Gulf, Central Asian republics and even distance to china is also short from this port.\nAny country can come and invest and Pakistan has been making efforts to attract people from different countries to invest in economic zones and was also approaching overseas Pakistanis for this purpose.\nHowever, he added, peace and stability in Afghanistan was needed, adding that stable Afghanistan was good for all, urging world community to help make Afghanistan manageable for benefit of all.\nThe minister said that Pakistan had met 26 out of 27 Financial Action Task Force (FATF) conditions and the 27th one was also half met.\nHe said, any other country meeting such conditions would have been removed from the grey list, however “Pakistan was being punished by some countries for different reason, not economic reasons.”\n“Frankly it is same mantra that Pakistan is a terrorist state. Pakistan encourages terrorism,” he said adding that the country which lost 80,000 people and suffered $150 billion loses and has been suffering for 40 years is being blamed continuously.\nThe minister said, no amount of hurdle would stop us to making Pakistan economically great again and one of the top countries in Asia first and then world. “In our lifetime if we make Pakistan one of the top countries economically in Asia that will be a achievement that is my motivation,” he said.",
  "retrievedAt": "2025-08-11T21:27:58.512Z"
}
