{
  "title": "Chinese PV firm to boost Pakistan renewable energy development",
  "link": "https://www.app.com.pk/national/chinese-pv-firm-to-boost-pakistan-renewable-energy-development/",
  "date_published": "2021-10-14T15:01:00.000Z",
  "source": "APP",
  "content": "BEIJING, Oct 14 (APP): China photovoltaic firm is assisting to boost Pakistan renewable energy development. Recently, Pakistan industry and commerce rooftop market has entered into a new era of 500W+ by adopting a type of advanced photovoltaic modules made by China JinkoSolar.\nJinkoSolar, along with its local partner Hadron Solar, will provide 775 pieces of Tiger Pro modules with 500W+, which will be installed on the rooftop of a pharmaceutical factory of the Regency Group in Pakistan, China Economic Net (CEN) reported on Thursday.\nThese modules will generate 633 MWh electricity annually in 25 years to meet the factory need. Whatmore, it will take only three years to recover costs.\nWith Jinko modules good competitiveness in efficiency and power generation, we wish to drive the development of local PV industry,said Gener Miao, Chief Marketing Officer of JinkoSolar.\nThe good competitiveness of products is attributed to JinkoSolar input in technologies and innovation.\nJinkoSolar announced on Wednesday it has set a new world record for the fourth time in a year with the maximum solar conversion efficiency of 25.4% for its large-size passivating contact solar cell.\nThe achievement has been confirmed by the Japan Electrical Safety and Environment Technology Laboratories (JET).\nPakistan has planned to boost the share of its electric power that comes from renewables to 30% by 2030, up from about 4% currently.\nThe China-Pakistan Economic Corridor (CPEC) is paving the way for Pakistan to achieve the goal, according to Muzaffar Ali, the chairman of Energy Engineering Department of University of Engineering and Technology, Taxila.\nAmid this strategy, besides offering advanced technologies and modules, JinkoSolar will cooperate with Energy Training and Research Center (ETRC) of Pakistan to train talents so as to help the development of renewable energy.\nJinkoSolar will provide professional technology supports for the training program, which will not only boost the shift to green energy resource, but also create job opportunities in solar sectors.\nJinkoSolar is one of the largest and most innovative solar module manufacturers in the world.\nJinkoSolar distributes its solar products and sells its solutions and services to a diversified international utility, commercial and residential customer base all over the world.",
  "retrievedAt": "2025-08-11T21:27:41.465Z"
}
