{
  "title": "PM gives go-ahead to revised NDCs, National Wildlife Policy: Amin",
  "link": "https://www.app.com.pk/national/pm-gives-go-ahead-to-revised-ndcs-national-wildlife-policy-amin/",
  "date_published": "2021-10-14T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP):Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam on Thursday announced that the Prime Minister had approved the revised nationally determined contributions (NDCs) among four other key decisions setting the environment friendly practical vision of Pakistan.\nThe prime minister made these decisions while chairing the Climate Change Council meeting here, the SAPM told here addressing a news conference.\nAmin said the revised NDCs clearly stated that Pakistan would reduce 15 percent of its green house gas (GHGs) emissions out of the total 50 percent target set for 2030. “This will be managed through E-Vehicle Policy, Ten Billion Tree Tsunami Plantation (TBTTP) project, Clean Green Pakistan movement and environment friendly sustainable development and other ecological conservation interventions,” he added.\nAmin told that the world countries were submitting NDCs based on 2050-60 targets where Pakistan was the only country that gave its proposals for 2020-30 to cut its GHGs at the COP-26 to be held in Glasgow.\n“We can do it more through conditional finances where a proposed US$100 billion funding has been proposed in the NDCs for GHGs emissions reduction with sector specific recommendations,” the SAPM said.\nPakistan, he said had appeared as a leader country on global climate action with practical measures on ground, where the revised NDCs document was appreciated globally.\nHe mentioned that the World Bank’s Regional Director for Sustainable Development, South Asia John Roome who in a video message praised the NDCs document as a great achievement and lauded the country’s leading climate change mitigation and adaptation measures despite worst affected by natural calamities.\nThe prime minister, he said had also approved the updated Climate Change Policy 2012 as there was huge difference in climate vision as compared to that of 2012.\nHe added that the country’s first ever National Wildlife Policy was also approved which was a unanimous document approved by all the federating units to protect the dwindling wildlife species found in variety in 12 ecological zones of the country.\n“The base of this policy is habitat conservation through community engagement, empowerment and ownership of the natural reserves,” Amin said.\nHe informed that the prime minister also approved to establish a Leopards reserve for the common Asian Leopards found in the Margalla Hills National Park. “It will help protect the habitat of the leopards that have proved to be resident leopards after a study. However, guided tours like safari tours will be managed in the reserve to provide tourism and educative spot to the masses,” he underlined.\nThe SAPM informed that TBTTP project had emerged as the trademark of nature conservation where various countries around the world were replicating the project with the similar name.\nThe Crown Prince of Kingdom of Saudi Arabia (KSA) had invited Prime Minister Imran Khan to deliver keynote address at the Leaders Summit on October 25 and also to inaugurate Climate Summit in the KSA, he told.\n“The Crown Prince has replicated Prime Minister Imran Khan’s vision of TBTTP under his 50 Billion Tree Tsunami for the middle east. He wants Pakistan to collaborate in this initiative,” he informed.\nAmin informed that team were formed and had started working out a detailed memorandum of understanding (MOU) which would be signed by the Prime Minister at the Leaders Summit. It would help generate employment opportunities and earn precious foreign exchange, he said, adding, “it is a great opportunity for the country.”\nHe said countries like UAE, Germany and Denmark were eager to partner Pakistan’s environment conservation vision to address climate change.\nHe concluded that the COP-26 in Glasgow would fail without clear climate finances where Pakistan would stir the conscious of global community to support developing countries through its due share of finances to international climate fund.",
  "retrievedAt": "2025-08-11T21:27:47.512Z"
}
