{
  "title": "Govt striving to transform Pakistan into Islamic welfare state: Farrukh",
  "link": "https://www.app.com.pk/national/govt-striving-to-transform-pakistan-into-islamic-welfare-state-farrukh/",
  "date_published": "2021-10-14T08:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP):Minister of State for Information and Broadcasting Farrukh Habib said on Thursday that the present government was striving to transform Pakistan into an Islamic welfare state on the pattern of State of Madina Munawwarah.\nAddressing the participants of All Pakistan Naat Competition here he said when the Prime Minister Imran Khan came into power, he gave the vision for transformation of the Pakistani society on the model of state of Madina.\nThe prime minister, he said, has renewed his determination to make the principles of the state of Madina his beacon and goal.\nFarrukh Habib said that the spirit of national leadership being witnessed today was unprecedented in the history.\nThe minister said that life and teachings of the Holy Prophet (PBUH) was a complete code of conduct for Muslim Ummah who seek guidance from them.\nHe said that the Holy Prophet (PBUH) was a mercy for all the world and there was no compulsion in Islam.\nFarrukh Habib said that followers of the Holy Prophet (PBUH) were present all over the world and their sentiments were hurt by blasphemous remarks by non-believers.\nThe prime minister raised the issue at every forum, including United Nations and Organisation of Islamic Cooperation and stressed that there was need of legislation in this regard.\nHe said that every citizen has a responsibility to learn from the life and teachings of the Holy Prophet (PBUH).\nHe said that every Muslim loved the Holy Prophet (PBUH) and had devotion for Him.\nHe said, he was glad that PTV and Pakistan Broadcasting Corporation were playing an important role in nurturing the talent of “Naat Khawani” among the new generation.",
  "retrievedAt": "2025-08-11T21:27:57.252Z"
}
