{
  "title": "PEC can act as think-tank by contributing in water policy, solar grid stations: Chairman PEC",
  "link": "https://www.app.com.pk/national/pec-can-act-as-think-tank-by-contributing-in-water-policy-solar-grid-stations-chairman-pec/",
  "date_published": "2020-01-27T23:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP):Pakistan Engineering Council (PEC) has the ability to act as a think tank for the country by providing guidelines in Water Policy, Construction Industries Regulation, Engineering Education, Building Code and Solar Grid Stations.\nThis was stated by Chairman PEC, Engineer Jawed Salim Qureshi during the 11th meeting of the National Assembly Standing Committee on Science and Technology held under the chairmanship of Sajid Mehdi, Member National Assembly.\nDuring the briefing, the chairman PEC informed that the council could act as a think tank to render the advice on technical matters or projects for federal government.\nHe also informed that engineering education in Pakistan was recognized internationally under the Washington Accord of June, 2017, due the efforts of PEC.\nResponding to the question of a member, he elaborated that Chairman PEC had been elected as Deputy President of Federation of Engineering Institutions of Islamic Countries (FEIIC).\nHe informed that PEC had instructed all the universities to ensure best quality engineering education which was a mandatory requirement for establishing a university.\nOtherwise, the university not complying with the requirements will be banned and their students will be shifted to another university.\nAfter such instructions, 97% of the universities have fulfilled the basic requirement and the rest of the 3% are making efforts to meet the standards.\nSimilarly, opening of new university in private sectors in the rental or leased building have been banned.\nFurthermore, all universities have been instructed to make available an amount of Rs. 25 million as endowment fund and Rs.20 million in Bank account to run the engineering programmes.\nAll universities have been instructed to enroll the new students as per sanction strength fixed for all departments by PEC.\nPEC is also developing software for registration of the students of the universities through their bio-metric from NADRA. This software would helpful PEC and as well as the engineering students.\nThe council has also introduced Special and Certification courses for fresh graduate engineers so that they can generate self employment.\nPEC has also taken steps to provide them opportunity to fresh graduates for getting the C-II category license for the fresh graduate engineers for self-generating the employment.\nPEC has also provided online registration and renewals for Pakistanis Engineers settled globally.\nResponding to the questions of the committee members, that PEC has printed a terms and conditions on the back side of the license issued to the foreign company that it should hire at least 70% Pakistani Engineers as when the company awards the project within the country.\nRegarding Agriculture Technology Transfer and Precision Agriculture, Federal Secretary for Ministry of Science and Technology, Nasim Nawaz informed that Research and Development in the field of agriculture is the mandate of the ministry.\nHowever, policy formation, economic coordination and planning in respect of Agriculture Technology Transfer and Precision Agriculture is the mandate of Ministry of National Food, Security and Research.\nSecretary, Ministry of Science and Technology also informed that some Agriculture Technologies have been developed and adopted by the end user through Pakistan Science Foundation and Pakistan Council of Scientific and Industrial Research.\nChairman Pakistan Engineering Council informed that the council has the potential to provide guidelines on the said agenda.\nHe informed that Pakistan has to move in accordance with the other countries of the world and regions in the field of agriculture, due to climatic changes.\nThe agenda items regarding pending legislative business referred to the Committee was again deferred for next meeting due to non availability of Mover and representative from Ministry of Law and Justice.",
  "retrievedAt": "2025-08-11T18:42:31.034Z"
}
