{
  "title": "Federal Ombudsman launches awareness campaign to disseminate its message in far flung areas",
  "link": "https://www.app.com.pk/national/federal-ombudsman-launches-awareness-campaign-to-disseminate-its-message-in-far-flung-areas/",
  "date_published": "2020-01-27T23:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP):The Federal Ombudsman during the year of 2019 has initiated a vibrant awareness campaign through social media tools in order to expand its message and services among the people of far flung areas of the country.\nTo achieve the task, the ombudsman had initiated a number of innovative techniques to enhance awareness among general public about the use of services being offered, said an official while talking to APP on Tuesday.\nHe said in this regard two seminars were held at President Secretariat and Governor House, Lahore, adding the president of Pakistan had also inaugurated public friendly website and mobile app through which the public could easily file their complaints.\nHe said this office also created accounts of Facebook, Instagram and YouTube so that maximum people could be aware of its services. The public service messages were also run through TV channels and mobile phones to aware the people about their rights, he added.\nAn awareness documentary, the official said, was telecast on PTV and awareness lectures were also delivered in the leading universities, adding the Federal Ombudsman Syed Tahir Shahbaz also held 16 press conferences himself in various parts of the country, he maintained.\nHe said a Mobile App had also been launched through which 2,054 complaints were received.\nNow a person can lodge a complaint from his/her home through Mobile App and also witness the entire process and status of his complaint.\nDuring the year a number of meetings were held with the provincial chief secretaries and heads of criminal justice departments of the four provinces to improve the living conditions of prisoners in jails.\nHe further said to facilitate the general public, this office had already established a telephone helpline (1055) which provides information between 9 AM to 10 PM.\nHe went on saying that the mentally ill prisoners had been segregated from other prisoners.\nDuring this year the One Window Facilitation Desks at 08 international airports received more than 175,000 complaints from the passengers which were resolved immediately, he said.\nHe said in order to facilitate the government officials, E-Pension system had been established in AGPR and all ministries and departments had been linked with AGPR for in-time processing of their pension cases.\nHe said speedy and free of cost justice was being delivered at the doorsteps of the people by the institution.",
  "retrievedAt": "2025-08-11T18:42:25.145Z"
}
