{
  "title": "Cabinet decides to recover billions of rupees illegally spent by ex-PMs, CMs: Murad",
  "link": "https://www.app.com.pk/national/cabinet-decides-to-recover-billions-of-rupees-illegally-spent-by-ex-pms-cms-murad/",
  "date_published": "2020-01-28T04:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP):Minister for Communications and Postal Services Murad Saeed Tuesday said the Federal Cabinet decided to recover billions of rupees illegally spent by a former president, prime ministers and chief ministers from the national exchequer.\nIf the misused public money was not surrendered by the accused then the law would take its course of action against them, he said while addressing a press briefing on the cabinet meeting flanked by Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan.\nThe minister said former prime minister Yousaf Raza Gillani had set up five camp houses in Multan and Lahore despite having his own residences in the cities and all the expenses incurred there were footed from the national exchequer.\nSimilarly, former president Asif Ali Zardari had three camp offices whereas the Sharif brothers (former prime minister Nawaz Sharif and ex-Punjab chief minister Shehbaz Sharif) maintained five camp offices excluding the prime minister and chief minister houses, the minister said.\nMurad mentioned that Shehbaz Sharif even declared Nawaz’s Jati Umra residence in Raiwind as his camp office after the latter’s disqualification by the Supreme Court in the Panama Papers case.\nHe said a squad of some 790 to 1,722 police personnel was deputed at a time for the security of Asif Ali Zardari, which had cost around Rs163.7137 billion to the national kitty.\n“Nawaz Sharif spent about Rs 270 million on the fencing of his private residence of Jati Umra and a contingent of 2,753 policemen was deputed on its security.\nMoreover, separate police squads were deployed for the security of their children such as Hamza squad, Maryam squad and son-in-law Imran squad etc,” Murad added. The minister said Nawaz Sharif’s trip to London for his medical check-up cost Rs 340 million as the special aeroplane had to made two trips to bring him back to Pakistan. In the first trip, the aircraft waited for two days at a London airport and then returned to the country without the former prime minister, he added.\nHis brother Shehbaz Sharif used the former prime minister’s plane for 556 times and done shopping of luxury item of Rs 8.7259 billion during his foreign sojourns, he added.\nMurad said former president Asif Ali Zardari had cost Rs 3.16 billion to the national exchequer for his lavish shopping abraod.\nHe said Nawaz Sharif as prime minister made some 25 private visits to London costing Rs 1.835 billion and Asif Zardari as president made 69 private tours to different destinations abroad costing Rs 1.421 billion.\nShehbaz Sharif soon after assuming charge as Punjab chief minister bought a new helicopter of his own choice for Rs 1.3 billion as the old one was probably uncomfortable for him, he added.\nThe minister said Imran Khan was living in his private residence at Bani Gala despite being the prime minister. He even spent the money from his own pocket on the construction of the road leading to his home despite being the country’s chief executive. He had also shunned using a chartered plane for foreign visits and was rather preferring commercial flights.\nHis visit to New York and Washington DC had cost only $ 68,000 in contrast to the former prime ministers, who used to spend hefty amount on such visits, Murad added.\nHe said the Federal Cabinet today made the big decision of recovering illegally spent taxpayers money by the former rulers, besides of amending rules for allocating special funds for camp offices.",
  "retrievedAt": "2025-08-11T18:42:20.212Z"
}
