{
  "title": "FM leaves for Kenya on 2-day visit; to attend first-ever Pakistan-Africa Trade Development Conference",
  "link": "https://www.app.com.pk/national/fm-leaves-for-kenya-on-2-day-visit-to-attend-first-ever-pakistan-africa-trade-development-conference/",
  "date_published": "2020-01-28T04:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi on Tuesday left for two-day (January 29-30) official visit of Kenya.\nDuring the visit, he will hold meetings with the Kenyan leadership, including Cabinet Secretaries for Foreign Affairs and International Trade, African Community and Northern Corridor Development, Transport and Ports, as well as for Trade, Industry and Cooperatives, a Foreign Office statement issued said.\nThe first-ever Pakistan-Africa Trade Development Conference, hosted jointly by the Ministries of Commerce and Foreign Affairs, Government of Pakistan, will be held in Nairobi on January 30-31.\nBesides Foreign Minister Qureshi, Advisor on Commerce, Textiles, Industry and Production, and Investments, Abdul Razzak Dawood will participate in the Conference.\nBoth the Foreign Minister and the Adviser will address the Inaugural Session.\nApart from Kenyan Cabinet members, dignitaries from other African States and Pakistani envoys in Africa, the Conference will be attended by a strong contingent of business-people and entrepreneurs from Pakistan, who will interact with their African counterparts. In all, some 300 participants are expected to attend.\nAfrica’s increasing integration and growth momentum together with Pakistan’s potential as a connectivity hub, have opened multiple avenues for win-win collaboration.\nThe Conference will provide a platform for G2G (Government to Government) and B2B (Business to Business) interaction.\nIt will be an important opportunity for Pakistani and African businesses to interface, identify the areas for enhanced engagement, and develop proposals for customized economic collaboration.\nThe Conference was part of Pakistan’s ‘Engage Africa’ initiative, which was in line with Prime Minister Imran Khan’s vision to forge closer political and economic ties with the African Continent, and place a stronger accent on economic diplomacy, the foreign office statement said.\nPakistan has been a long-standing partner of Africa – from extending assistance in freedom struggles from colonial yoke, to supporting peace and security through participation in multiple peace-keeping operations under the UN auspices.\nPakistan enjoys fraternal relations with all African partners, including Kenya, grounded in shared interests, mutual respect and mutual support.\nThe Foreign Minister’s visit will serve to reaffirm the historic ties of friendship, and further expand the scope of multi-faceted cooperation.\nForeign Minister Qureshi in a pre-departure statement said that since economic stability was pivotal for a free and independent foreign policy, the Ministry of Foreign Affairs, in order to achieve that objective, had adopted economic diplomacy as a basic fundamental and moving forward.\nHe said that under the economic diplomacy an “Engage Africa” conference was also held at the Foreign Office, adding Africa with 54 countries was a great and resource-rich continent and had ample trade and investment opportunities.\nThe Foreign Minister said that as in the past due attention was not given to Africa, the present government by changing the strategy has decided to focus Africa.\nThe holding of Engage Africa conference, which was addressed by President Dr. Arif Alvi and Prime Minister Imran Khan, gave a clear direction, he added.",
  "retrievedAt": "2025-08-11T18:42:19.075Z"
}
