{
  "title": "‘Her Hunar’ to sharpen entrepreneurial skills, global market’s knowledge of women: SAPM",
  "link": "https://www.app.com.pk/national/her-hunar-to-sharpen-entrepreneurial-skills-global-markets-knowledge-of-women-sapm/",
  "date_published": "2023-03-04T09:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 04 (APP): Special Assistant to the Prime Minister (SAPM) on Commerce Malik Ghulam M. Raza Rabbani Khar while underlining the importance of women’s empowerment on Saturday said ‘Her Hunar’ would provide an opportunity for the participants to sharpen their entrepreneurial skills and acquire much-needed knowledge of the global market.\nAddressing the inauguration ceremony of the “ Her Hunar” exhibition, he said that it would also provide a platform for women to kick-start an idea, label, brand or production house.\nHe said we could not grow as a nation if only half of the population was working. Women’s empowerment was an essential component for growth in developing nations like Pakistan for lifting millions of families out of the poverty cycle, he said.\nGhulam Rabbani said encouraging women entrepreneurs would be strongly assistive in a positive growth trajectory and assist in meeting the objectives of the United Nation’s Sustainable Development goals.\nHe said the presence of female entrepreneurs at the ‘Her Hunar’ exhibition was a unique opportunity for Pakistani women entrepreneurs hailing from the North of Pakistan to market their ‘hunar’.\nThe SAPM said such exhibitions would provide a platform for women entrepreneurs to explore the international market for their beautiful and unique products. Additional session on the protection of Intellectual Property Rights was another commendable step, he added.\nCongratulating the Ministry of Commerce and Trade Development Authority of Pakistan (TDAP) for organizing the exhibition, he expressed the hope that the ministry and TDAP would take further initiatives to promote women entrepreneurs.\nIn the welcome address, Secretary TADP Fareed Iqbal Qureshi said that the exhibition would provide an opportunity to translate ‘hunar’ of the women. It would also help sharpen the skills of women entrepreneurs to expand their businesses globally.\nHe said in future more events would be organized for women of the South of Pakistan.\nEarlier, the SAPM inaugurated the exhibition and distributed souvenirs among the participating women entrepreneurs from across the country.\nAmbassador of Turkmenistan and Dean of Diplomatic Corps Mr. Atadjan Movlamov and Chief Secretary Gilgit Baltistan Mohyuddin Ahmad Wani were also present on the occasion.",
  "retrievedAt": "2025-08-11T06:16:24.910Z"
}
