{
  "title": "Pakistani universities contribute over Rs. 500 Million for earthquake relief in Turkiye",
  "link": "https://www.app.com.pk/national/pakistani-universities-contribute-over-rs-500-million-for-earthquake-relief-in-turkiye/",
  "date_published": "2023-03-04T08:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 04 (APP): Pakistani universities have pledged an amount of Rs. 500 million for earthquake relief activities in Turkey.\nA 34 member high-level Pakistani delegation from 18 universities participated in the Eurasian Higher Education Summit in Istanbul under the auspices of Private Sector Universities Pakistan (APSUP).\nThe universities pledged more than 500 million for the earthquake-affected areas of Turkiye which would be spent on relief, rehabilitation, and scholarships for students from the affected areas.\nDuring the summit, the Pakistani Pavilion was set up, and the Chairman of APSUP, Prof. Dr. Abdul Rehman, along with Rector Superior University, Prof. Dr. Sumaira Rehman, handed over a cheque of 400,000 Turkish lira to Elif Aydin, Vice Chairman of the Board Anatolian Education and Cultural Foundation Turkiye.\nThe President of Eurasian Universities Union, Prof. Dr. Mustafa Aydin, expressed his gratitude to APSUP and the Pakistani nation for their continued support to the Turkish people, especially during hard times.\nSeveral universities in Pakistan extended their support to the earthquake-affected people of Turkey.\nThe University of Lahore donated one million US dollars in the form of 150 tons of edibles, fireproof and waterproof tents, blankets, and medicines.\nThe University of Faisalabad donated 110 hundred dollars for community services, and a 20-member team from the University of Faisalabad participated in rehabilitation activities in the affected areas.\nThe University of Sialkot and the International Institute of Science, Arts, and Technology Gujranwala jointly announced scholarships worth 10 million Pakistani rupees for Turkish students affected by the earthquake.\nUnder the University of Management and Technology Lahore Scholarship Program for Turkey, scholarships worth one million dollars will be awarded, with special preference given to students from the affected areas.\nAdditionally, the Coordinator General of COMSTECH, Prof. Dr. M. Iqbal Chaudhary who was also part of the Pakistani delegation, offered fully funded scholarships and research fellowships to Turkish nationals severely affected by the earthquake in collaboration with APSUP and member universities of COMSTECH Consortium of Excellence.\nThe APSUP member universities remain committed to extending all possible assistance to the earthquake-affected people of Turkiye.",
  "retrievedAt": "2025-08-11T06:16:25.615Z"
}
