{
  "title": "Urdu poet Wasif Ali Wasif remembered on his death anniversary",
  "link": "https://www.app.com.pk/national/urdu-poet-wasif-ali-wasif-remembered-on-his-death-anniversary/",
  "date_published": "2024-01-18T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):An illustrious Urdu poet, writer, and Sufi intellectual, Wasif Ali Wasif, was remembered on his 31st death anniversary for his distinctive literary style.\nBorn on January 15, 1929, in Khushab, Wasif Ali Wasif gained widespread acclaim for his short essays, exploring themes such as love, life, fortune, fear, hope, expectation, promise, prayer, happiness, and sorrow, all with the profound objective of elucidating the true essence of Islam.\nA master of aphorism, Wasif possessed a miraculous ability to encapsulate a spectrum of meanings within a few carefully chosen words, many of which have evolved into contemporary proverbs. His book “Kiran Kiran Suraj,” a collection of these aphorisms, remained a bestseller for numerous years.\nWasif Ali Wasif departed this world on January 18, 1993, leaving behind a legacy that continues to inspire generations. He found his final resting place in Lahore.\nHis literary repertoire comprises various works, including “Shab Chiragh” (Urdu Poetry), “Kiran Kiran Sooraj” (Aphorism), “The Beaming Soul” (English Version of Kiran Kiran Sooraj), “Dil Darya Samundar” (Essays), “Qatra Qatra Qulzum” (Essays), “Ocean in Drop” (English version of Qatra Qatra Qulzam), “Harf Harf Haqeeqat” (Essays), “Bharay Bharolay” (Punjabi Poetry), “Shab Raaz” (Urdu Poetry), “Baat Say Baat” (Aphorism), “Gumnam Adeeb” (Letters), “Ziker-e-Habeeb” (Na’tia Poetry), “Dareechay” (Aphorism), “WasifYat” (Essays), “Kulyat-e-Wasif Ali Wasif” (Poetry), and “Aqwaal-e-Wasif Ali Wasif Ka Encyclopedia.”\nWasif Ali Wasif’s literary contributions continue to resonate, ensuring his place as a timeless figure in Urdu literature.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:43:09.687Z"
}
