{
  "title": "Minister inaugurates two-day National Citrus Festival",
  "link": "https://www.app.com.pk/national/minister-inaugurates-two-day-national-citrus-festival/",
  "date_published": "2024-01-18T12:49:00.000Z",
  "source": "APP",
  "content": "SARGODHA, Jan 18 (APP):Federal Minister for National Heritage and Culture (NH&C) Jamal Shah, along with Secretary NH&C Humaira Ahmed, Commissioner Sargodha Division Muhammad Ajmal Bhatti, inaugurated on Thursday the two-day National Citrus Festival, here at Sargodha Arts Council.\nRegional Police Officer Shariq Kamal Siddiqui, Deputy Commissioner Capt (retd) Shoaib Ali, Director General Pakistan National Council of the Arts (PNCA) Ayub Jamali, Executive Director Lok Virsa Uzair Khan, Chairman Pakistan Academy of Letters (PAL) Dr Najeeba Arif and diplomats were also present.\nThe minister told the ceremony the National Heritage and Culture Division, in collaboration with the Government of Punjab, was organising the National Citrus Festival on 18th and 19h of January. He said Sargodha served as the perfect backdrop for a grand celebration of the nation’s diverse citrus heritage. The minister said the festival would be crafted not only to showcase the economic and agricultural significance of citrus but also to promote social cohesion and a strong sense of national identity.\nJamal Shah said the festival aimed to attract visitors from across Pakistan, promoting national unity through shared cultural experiences. He said that the festival provided a national platform for businesses, farmers, and artisans to showcase and sell citrus-related products, fostering economic growth and national resilience, thereby contributing to a more socially cohesive society.\nSecretary National Heritage and Culture Humaira Ahmed said the festival aimed to conduct workshops, seminars and demonstrations to educate the public on citrus farming techniques, nutritional benefits and sustainable agricultural practices, reinforcing a shared commitment to environmental stewardship and social responsibility.\nIn his welcome address, Commissioner Sargodha Division Muhammad Ajmal Bhatti highly praised National Heritage and Culture Division for organising citrus festival in Sargodha. He said that Sargodha was a major citrus producing city, thanks to its favourable weather conditions for growing the best quality kinnow. This year, however, saw a drop in exports, he said and added that the ministry concerned should work on it to increase the export of kinnow.\nTraditional music, dance and art performances from different regions of Pakistan would be part of the festival. Display of various citrus varieties from different provinces was made, focusing on their unique characteristics, nutritional benefits, and regional importance, emphasizing the shared cultural heritage of the nation.\nPNCA Puppet Theatre, National Performing Arts Group, Lok Virsa Fazal Jutt and Awais Niazi performed on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:43:05.397Z"
}
