{
  "title": "Political hustle bustle everywhere, Social media shaping various political party campaigns",
  "link": "https://www.app.com.pk/national/political-hustle-bustle-everywhere-social-media-shaping-various-political-party-campaigns/",
  "date_published": "2024-01-18T06:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):As February 8 upcoming poll season approaches fast in the country, political hustle and bustle is seen in every nook and cranny of the country, including twin cities, where almost every constituency is being festooned with colorful party flags and posters displaying according to code of conduct.\nSocial media during the current election atmosphere in the country was playing an important role in enabling the country’s politicians to reach out to the voters and provide them with a platform to connect easily, according to a report aired by a private news channel.\n“The printing and selling of election-related items has also picked momentum, and wholesalers and vendors have expressed happiness over the increasing demand and sales of party posters,” said a citizen.\n“As time passes and the general elections are drawing near, the political parties will continue their political wars on social media grounds,” said a youngster while favoring a party and posting a picture of his favorite politician.\n“In Islamabad and other cities, various corner meetings, political camps, and rallies have become routine matters, said a politician while commenting on the election drive.”\n“Portraits and stickers of different political leaders could easily be noticed on rickshaws, wagons, Suzuki pickups, cars, and private buses,” said a student.\n“These electioneering processes have seen widespread use among social media users, where enthusiastic youth and women were actively campaigning for their preferred candidates, said another citizen of Punjab City.”\n“This election will be unique due to the increased number of young and female voters,” said another politician\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:43:41.798Z"
}
