{
  "title": "PEMRA advises national electronic media to abide by ECP code of conduct on elections",
  "link": "https://www.app.com.pk/national/pemra-advises-national-electronic-media-to-abide-by-ecp-code-of-conduct-on-elections/",
  "date_published": "2024-01-18T09:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP): Pakistan Electronic Media Regulatory Authority on Thursday advised national electronic media to abide by the code of conduct issued by the Election Commission of Pakistan.\nThe directives issued by the PEMRA stated that all its licensees were obliged to abide by the code of conduct issued by the Election Commission of Pakistan in the run of the elections being held on February 8.\nThe code of conduct applying to print, electronic, digital media, and social media influencers was released by ECP on October 14 last year for the national media and outlined various guidelines required to adhere to during the campaign and polling.\nThe ECP specified that the media should refrain from expressing biased opinions that undermine Pakistan’s ideals, sovereignty, security, independence, and the integrity of the judiciary and other national institutions.\nFurthermore, any statements or accusations that pose a threat to national unity and the law-and-order situation will be strictly prohibited from being broadcast.\nThe code prohibits the inclusion of material that engages in attacks against candidates or political parties based on gender, religion, or community.\nAny violation of the code will be treated seriously, and allegations made by one candidate against another will require confirmation from both sides before prosecution can commence.\nIn order to ensure compliance with the code, the Pakistan Electronic Media Regulatory Authority (PEMRA), Pakistan Telecom Authority (PTA), Pakistan Information Department (PID), and the Cyber Digital Wing of the Ministry of Information will actively monitor the coverage given to political parties and candidates.\nTo support the electoral watchdog in implementing the code, PEMRA, PTA, PID, and the Cyber Digital Wing of the Ministry of Information will provide assistance.\nTo ensure the smooth functioning of the election process, the media campaign will conclude 48 hours before election day and the electoral process will not be interrupted. Besides, surveying in polling stations or constituencies that may adversely impact voters will be avoided.\nOnly accredited media representatives will be allowed to enter the polling stations, accompanied by a camera to document the polling process. However, the secret ballots will not be videotaped, and media representatives will observe the count without cameras.\nThe code also emphasises that media representatives must not engage in activities that obstruct the election process before, during, or after the voting.\nThe broadcast of election results will be prohibited until one hour after the end of polling, it will be stated explicitly that the\nresults are unofficial and incomplete, and they will only be considered final when officially declared by the Returning Officer.\nIt is important to note that a journalist or media organisation may have their accreditation terminated if they violate the code of conduct.",
  "retrievedAt": "2025-08-10T23:43:17.604Z"
}
