{
  "title": "Airspace violation by Iran under investigation: Solangi",
  "link": "https://www.app.com.pk/national/airspace-violation-by-iran-under-investigation-solangi/",
  "date_published": "2024-01-17T19:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): Caretaker Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Wednesday said the government had lodged protest with Iranian authorities over “unprovoked violation” of its airspace, confirming that the “illegal move” was under investigation.\n“Pakistan has recalled its ambassador from Iran and as for now, the current ambassador of Iran in Pakistan, who is already in his country, has been told not to return Pakistan,” said the minister while speaking in a television talk show of the private media.\nHe said ongoing and expected official visits between Pakistan and Iran had also been cancelled. The matter was being investigated and the authorities concerned would give appropriate response to this end.\nHe said Pakistan would take appropriate measures while keeping the relevant international laws in the view especially regarding the sovereignty of the state.\nTo a query, the minister said the only constitutional body entrusted with holding free and fair elections was the Election Commission of Pakistan (ECP) that stood committed to hold the elections on February 8, he said while reiterating the caretaker government’s commitment to supporting the ECP in every possible way for holding elections on given date.\nNo political party was being treated discriminately, he said, adding those, who were involved in the May 9 incidents, had been arrested and their arrests had nothing to do with the elections.\nHe said the criminal trials of many people were completed while rest of them underway. Whether it was the caretaker government or an elected one, the law would take its own course, he added.\n“The political culture is that if you project yourself victim and oppressed you get sympathies,” he said while pointing out the victim card being played by the political parties under the garb of a level-playing field.\n“If you ask PTI they will say we are not getting a level-playing field especially in Punjab and KPK. If you ask Peoples Party they will say we are not getting a level-playing field in Punjab and if you ask PML-N they will say we are not getting a level-playing field in Sindh,” he remarked.\nTo another question, he said that for more than a decade from 2013 to 2024, the PTI had failed to hold fair intra-party elections.\nHe recalled that the PTI came into being to bring change in the political culture.\nSolangi said the apex court’s decision over the intra-party polls of the PTI would promote democracy within the parties.\nPrior to the 2013 general elections, he said the PTI’s intra-party elections were held that were marred by the allegations of rigging. How could a party champion democracy if it did not promote democracy within itself, he questioned.\nHe brushed aside the rumors regarding the election delay and regretted that certain elements were deliberately churning out lies in this regard.\n“The caretaker cabinet took oath on August 17, 2023 and since then we have been consistently saying that the elections will be held as per the Election Commission schedule,” he said while reiterating the government’s commitment to support the ECP in holding the free and fair elections on Thursday, February 8, 2024.\nThe minister also highlighted the administrative measures taken by the caretaker government to stabilize the economy and strengthen the rupee against the dollar.",
  "retrievedAt": "2025-08-10T23:43:20.716Z"
}
