{
  "title": "Petroleum Division condemns malicious campaign against SSGC chairperson",
  "link": "https://www.app.com.pk/national/petroleum-division-condemns-malicious-campaign-against-ssgc-chairperson/",
  "date_published": "2024-01-18T18:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):The Petroleum Division on Thursday condemned the malicious campaign circulating on electronic, print, and social media against Sui Southern Gas Company (SSGC), its chairperson, and its Board of Directors.\nSSGC Chairperson Dr. Shamshad Akhter, along with the Board members, had successfully led the organization since her initial appointment in 2019, said a news release.\nThe Petroleum Division said, “Under her (Dr Shamshad’s) visionary leadership, SSGC has achieved significant milestones in areas such as technology upgradation, improvement of business operations, human resources, policy formulation, discipline, risk management, and a notable reduction of Unaccounted-for Gas (UFG).\nThe Chairperson and Board members work collaboratively, making decisions based on collective wisdom and consensus.\nThe Board has made significant contributions to budgetary systems, audits, finances, and UFG strategies. The UFG in Sindh province has decreased from 15% to 7%, reflecting the effective approach of the management and the SSGC Board, especially the Chairperson.\nThe Board has been actively involved in policy and strategic decision-making, delegating implementation to the management team. Since its formation, the Board has been steadfast in pursuing an agenda of HR and institutional reforms, recognizing their critical role in transforming SSGC.\nEfforts are underway to institutionalize high-quality performance assessment and results-based accountability to meet stakeholder expectations. A new Employment Handbook, developed under the oversight of the Board, has been approved and is under implementation.\nIn recognition of her professional dedication, the government has nominated Dr. Shamshad Akhter for another tenure as Chairperson of the Board of Directors, with elections to be held. The Petroleum Division fully supports and trusts SSGC, its Board, and Dr. Shamshad Akhter in all legal, governance, and financial matters.\nNegative reporting, particularly as a public sector listed company, impacts the confidence of private shareholders and dedicated employees of SSGC.\nThe ministry urges the media to report on such matters with a positive perspective, considering the substantial achievements under Dr. Shamshad Akhter’s leadership and the collective efforts contributing to the growth of the energy sector in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:42:30.361Z"
}
