{
  "title": "Pakistan assumes Regional Leadership of INSARAG for Asia Pacific in 2024",
  "link": "https://www.app.com.pk/national/pakistan-assumes-regional-leadership-of-insarag-for-asia-pacific-in-2024/",
  "date_published": "2024-01-18T09:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):Pakistan took the helm of INSARAG (International Search and Rescue Advisory Group) as the Regional Chair of Asia Pacific for 2024, marking a significant stride in global disaster response coordination.\nThe official handover ceremony occurred during a pivotal global meeting via video link, where New Zealand gracefully transferred the regional chairmanship to the National Disaster Management Authority (NDMA), Pakistan, according to a news release issued here.\nAs the newly appointed Regional Chair, Chairman NDMA was represented by Raza Iqbal, Executive Director Plans, NDMA, who, on behalf of the Chair, pledged to foster international collaboration and enhance disaster response capabilities across the Asia-Pacific region.\nUnder Pakistan’s leadership, NDMA outlined key activities to fortify disaster response capabilities, i.e., the 1st International Rescue Challenge (Lahore), the Asia-Pacific Earthquake Response Exercise (Lahore), where NDMA, with the support of Punjab Emergency Services, Rescue 1122, will host an earthquake response exercise, simulating a seismic event to enhance preparedness and coordination in earthquake-prone regions, and the Asia-Pacific Regional Meeting (Islamabad), bringing together member states to strategize and collaborate on disaster response initiatives.\nAmbassador Dominik Stillhart from the Swiss Agency for Development and Cooperation (SDC), the incoming Global Chair, assumed a pivotal role in steering INSARAG’s global initiatives. Joining the league of regional chairs were Marius Dogeanu, from the Ministry of Internal Affairs, Romania (AEME Regional Chair); Jorge Carrillo, Risk Management Secretary, Ecuador (Americas Regional Chair); and NDMA Pakistan, representing the Asia-Pacific region. Sebastian Rhodes Stampa, Chief Emergency Response Section (ERS), and INSARAG Secretary from the INSARAG Secretariat participated. As the regional chair, Pakistan envisioned a proactive and collaborative approach to address the dynamic challenges of disaster response.\nNDMA, Pakistan, looked forward to a fruitful year marked by resilience, cooperation, and shared expertise within the INSARAG community. INSARAG, a global network under the United Nations, is dedicated to enhancing international coordination in urban search and rescue operations during disasters, especially structural collapse primarily due to earthquakes.It endeavors to establish standardized procedures, promote best practices, and facilitate effective collaboration among member countries.\nINSARAG acts as a global lifeline after major disasters like earthquakes and floods. They set standards for urban search and rescue teams worldwide, guiding their deployments and fostering international cooperation to pull victims from collapsed buildings and disaster zones, ensuring no country faces catastrophe alone.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:43:33.853Z"
}
