{
  "title": "Four-day training workshop for digitization of community teacher courses",
  "link": "https://www.app.com.pk/national/four-day-training-workshop-for-digitization-of-community-teacher-courses/",
  "date_published": "2024-01-18T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):Four-day training workshop for the digitization of community teacher courses concluded at Allama Iqbal Open University (AIOU) on Thursday.\nSpeaking during the ceremony, UNESCO representative, Aleema Bibi termed AIOU as the most effective platform for bringing out-of-school children into the educational network.\n“Collaboration with this university will be a focal point for special attention because addressing issues of children outside school is crucial for Pakistan’s prosperity”, she said.\nShe mentioned that digitizing educational courses for the professional development of community teachers was a UNESCO project accomplished through collaboration with AIOU.\nShe stated that efforts by AlOU to bring out-of-school children into the educational network are commendable.\nWhile presiding over the concluding ceremony, Professor Dr. Fazal Rahman, Dean of the Faculty of Education, stated that University’s Vice-Chancellor, Professor Dr. Nasir Mahmood Khan, is giving special attention to maintaining standards, and under his leadership, we will link the university’s educational courses with the Sustainable Development Goals (SDGs) for sustainable progress.\nHe emphasized that digitizing educational courses will contribute to the professional development of community teachers.\nHe mentioned that digitizing educational courses will result in the professional development of community teachers.\nHe applauded the successful organization of the workshop, acknowledging UNESCO and the field of non-formal and continuing education for their efforts in promoting such initiatives.\nRepresentatives from Alite Pakistan, Tariq Cheema, Dr. Salim Iqbal from Jaaica, Prof. Dr. Javaid Iqbal, former head of the Instructional Design department at the Open University, Dr. Muhammad Ajmal Chaudhry, Chairman of the department of non-formal and continuing education, and the workshop coordinator, Dr. Tahira Bibi, emphasized that digitizing community teacher courses was the most crucial need of the time.\nHe congratulated the UNESCO and Allama Iqbal Open University team for successfully fulfilling this requirement.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:42:58.264Z"
}
