{
  "title": "NADRA Chairman asks business community to cooperate in tax broadening",
  "link": "https://www.app.com.pk/national/nadra-chairman-asks-business-community-to-cooperate-in-tax-broadening/",
  "date_published": "2024-01-18T11:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP): Chairman National Registration and Database Authority (NADRA) Lt. Gen. Muhammad Munir Afsar here on Monday said that his organization and FBR are in collaboration to expand the tax base and register new taxpayers to improve the tax revenue of the country.\nTalking to a delegation of the Islamabad Chamber of Commerce and Industry (ICCI), he called upon\nthe business community to cooperate in such efforts.\nMunir Afsar briefed the business community about the key initiatives of NADRA to facilitate the citizens.\nHe said that NADRA e-Sahulat is a low-cost e-services platform, which provides a secure payment and collection facility to the citizens.\nThis network consists of over 17,000 active franchisees connected with telcos and banks and employing thousands of youths besides adding revenue to retailers’ income.\nSpeaking on the occasion,\nPresident ICCI Ahsan Zafar Bakhtawari, President, lauded the efforts of NADRA to promote digitalization in Pakistan.\nHe said that NADRA has already set up its Facilitation Desks in Lahore Chamber of Commerce and Industry to provide its services to the business community and NADRA should also set up its Facilitation Desk in ICCI so that ICCI members can avail NADRA’s services under one roof in Chamber.\nHe said that FBR is putting more burden on the existing taxpayers and assured that the business community would cooperate to broaden the tax base.\nFaad Waheed, Senior Vice President ICCI proposed that NADRA to maintain a database of suppliers and vendors that would help in promoting business activities.\nEngineer Azhar ul Islam Zafar, Vice President of ICCI said that Pakistan needs to promote e-governance to provide efficient services to the citizens, and the role of NADRA in realizing this goal is very important.",
  "retrievedAt": "2025-08-10T23:43:10.384Z"
}
