{
  "title": "Over 17,800 candidates to contest 2024 elections",
  "link": "https://www.app.com.pk/national/over-17800-candidates-to-contest-2024-elections/",
  "date_published": "2024-01-18T18:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):Over 17,800 candidates, including 11,785 independents, are flexing their muscles to try their luck in National and provincial assembly seats in the country’s general elections in 2024.\nAccording to the detailed list of candidates unveiled for the approaching general elections scheduled on February 8, 2024, a total of 5,121 candidates are in the fray for 266 National Assembly seats.\nOut of these, 6,031 candidates have political party affiliations. In the race for National Assembly seats, 4,807 are males, 312 are females, and two are transgenders. Additionally, a total of 12,123 males, 570 females, and two transgender candidates will compete for provincial assembly seats.\nAccording to data from the ECP, the National Assembly has 1,780 male candidates affiliated with political parties, while 93 females have party tickets, making their combined total 1,873.\nYet, the count of independent candidates for the lower house of parliament is nearly twice as high, comprising 3,027 males, 219 females, and two transgenders, totaling 3,248. In the electoral competition for general seats in the four provincial assemblies, 3,976 males have party affiliation, with females numbering 182, making the overall total 4,158.\nIn contrast, the count of those independently contesting without party affiliation stands at 8,537. This includes 8,147 male candidates, 388 female candidates, and two transgender candidates participating across the provincial assemblies.\nAs indicated by Form-33, Punjab sees a collective of 6,710 candidates participating, encompassing both genders, affiliated with parties or contesting independently for the provincial assembly’s general seats. Similarly, in Sindh, the overall count of male and female candidates is 2,878, inclusive of those affiliated with parties and independent contenders.\nIn the quartet of provinces, Khyber Pakhtunkhwa stands out as the sole region where two transgenders are vying for general seats. In addition, there are 1,763 male candidates and 63 females, bringing the total to 1,834. Similarly, in Balochistan, the collective count comprises 1,273 male candidates with affiliations and independents, including 1,233 males and 40 females.\nIn terms of appeals, the appellate tribunals received a total of 2,373 appeals contesting the acceptance and rejection of nomination papers. Out of these, 178 appeals were against the acceptance of nomination papers, and 2,195 were against rejections. Among the total appeals, the tribunals accepted 1,611 and rejected 762.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:42:28.733Z"
}
