{
  "title": "Accused involved in Gujjarpura incident identified: CM",
  "link": "https://www.app.com.pk/national/accused-involved-in-gujjarpura-incident-identified-cm/",
  "date_published": "2020-09-12T15:22:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 12 (APP): Punjab Chief Minister (CM) Sardar Usman Buzdar has said that police has adopted scientific investigation method to identify the criminals involved in the motorway rape incident occurred at the night between 9th and 10th September on the Lahore-Sialkot Motorway.\n“I also personally monitored the progress made in the investigation and issued directions for the early completion,” CM said. Addressing a press conference at CM office here on Saturday the CM said the government had succeeded in making it to the criminals in the less than 72 hours. The dreaded criminals will soon be in the grip of the law and they will be given stringer punishment according to the law.\n“I have also contacted the affected woman and assured her of provision of justice,” he added. Our police officers were also in constant contact with her. Those helping in arrest of these accuse will be given cash reward of Rs.25 lakh for each and their names will be kept secret.\nTo a question, the CM said that Capital City Police Officer (CCPO) statement was irresponsible and he had also been issued a ‘Show Cause Notice’ to give reply within seven days by the IG Police. Legal action will be initiated on unsatisfactory reply. CCPO should have not given such an irresponsible statement.\nHe said that the Punjab government constituted 28 teams to investigate the case and effective measures will be taken to avoid such incidents in future. “I have also issued directions to police and concerned departments in this regard,” stated CM.\nTo another question, Usman Buzdar stated that Punjab police had traced all heinous crime cases and presented criminals before the courts. The criminals involved in this case will also be brought into court of law for stern punishment. All the criminals involved in Sahiwal Tragedy and Kasur Incident were presented before the courts.\nHe said that the seven cases were registered against the accused Abid while two against Waqar. He said that police had worked hard to identify the criminals. “We observe law and every job will be done according to the law,” he added. IG Punjab Police Inam Ghani said that Chief Minister Punjab extended full support to trace the accused and we reached the criminals under his guidance. He said that accused Abid was the resident of tehsil Fort Abbas distract Bahawalnagar whereas second accused Waqar-ul-Hassan was from Qila Sattar Shah Ali Town.\nHe disclosed that DNA of accused Abid had been matched last night and we sent our teams to his area and sent the other teams to arrest Waqar. There were four mobile-phone sims on the name of accused Abid, but he was not using them. The police traced another mobile number of accused Abid with the help of that number police were able to trace the other accused Waqar. Both accused were at large but our teams were behind them soon they will be arrested.\nProvincial Ministers Raja Basharat, Fayyaz-ul-Hassan Chohan, Additional Chief Secretary (Home), Principal Secretary to CM and Secretary Information were present on this occasion.",
  "retrievedAt": "2025-08-11T19:47:52.974Z"
}
