{
  "title": "Provision of Gas facility to 25 villages, adjacent localities approved: Amin Aslam",
  "link": "https://www.app.com.pk/national/provision-of-gas-facility-to-25-villages-adjacent-localities-approved-amin-aslam/",
  "date_published": "2020-09-12T05:48:00.000Z",
  "source": "APP",
  "content": "Attock, Sep 12 (APP): Special Assistant to Prime Minister on Climate Change Malik Amin Aslam Saturday said that provision of gas facility to 25 villages and adjacent localities of NA-56 had been approved.\nWhile addressing a gathering in Pindigheb, he said the government believed in across the board provision of facilities without any discrimination. He said that NA 56 constituency remained ignored in past by the so called leaders who served their vested interest but did nothing for local people.\nHe said that oil and gas companies were working in the constituency since long but had neither given gas facility nor jobs to the youth of the area, adding, now this injustice would not be allowed anymore. He said now these companies will be made bound to give gas facility and jobs to the youth of the area, he added.\nHe said the villages for which government has allocated Rs1848.56 million for provision of gas facility included 12 villages of tehsil Jand namely Ziarat, Parriot,Kharriot, Bela, BhandarLoharan, BhandarKaramsher, Bhandar Toda, Bhandar Tahlian, Jaba, Thathi, Rangli and Uchri, three villages of tehsil Pindigheb namely Surg, Maghian and Saidran and ten villages of tehsil Fatehjang namely GhariHassu Khan, BhalSyedan, Burj, KharalaKhurd, Ajuwala, Chharat, KharalaKalan, Ferozwali, Makial, Gulial and adjoining areas.\nHe said that this mega project will be completed in four phases. During the first phase, eight villages will be provided gas facility for which Rs560 million have been allocated, during the second phase four villages will be provided gas facility for which Rs540 million have been allocated, during the third phase, four villages will be provided gas facility for which Rs330 millionwere allocated and during the fourth phase nine villages will be provided gas facility for which Rs410 million have been allocated.\nMalik Amin said that beside this Nakka Toot , Maira Sharif , Kharapa , Naka Kalan and all other villages falling with in five km radius of the gas companies will also be provided gas facility for which a survey will be carried out .\nMalik Amin also came hard on those so called leaders who have been exploiting the people of this under developed tehsil for their vested interests and said that now this will not be repeated and said that this govt under the dynamic leadership of Prime Minister Imran Khan believes in justice with out political affiliation and its ample proof is approval of gas facility to 25 villages of this area. He said , now people must wake up and support the govt of PTI for the development of this country and prosperity of its people",
  "retrievedAt": "2025-08-11T19:47:54.810Z"
}
