{
  "title": "World now acknowledges Jinnah’s two nation theory: President Arif Alvi",
  "link": "https://www.app.com.pk/national/world-now-acknowledges-jinnahs-two-nation-theory-president-arif-alvi/",
  "date_published": "2020-09-12T10:01:00.000Z",
  "source": "APP",
  "content": "MIRPURKHAS, Sep 12 (APP): The President Dr. Arif Alvi has said the two nation theory of the founder of the nation Quaid-e-Azam Muhammad Ali Jinnah was now being acknowledged in the world after witnessing atrocities with the minorities in India.\nThe President stated this while addressing a joint reception of the workers of Pakistan Tehreek-e- Insaf Hyderabad and Mirpurkhas Division here Saturday noon.\nReferring to his visit to Mazar of Quaid-e-Azam to lay floral wreath and offer fateha on his death anniversary, the President Dr. Arif Alvi said that the great leader was born in Sindh and had led history making struggle for creation of Pakistan.\nHe said the minorities in Pakistan were enjoying equal rights and the Prime Minister Imran Khan was fully committed to safeguard their rights who were playing their vital role for the development of the homeland.\nResponding to relief work for the rain affected population, the President said that besides government efforts, the role of non-governmental and social welfare organizations for carrying out relief activities are commendable.\nThe people of Pakistan always come forward for charity whenever the country and even other countries of the world experience natural disasters, the President maintained and recalled his visit to Turkey where the charity work of Pakistanis particularly the people of Lahore and Karachi during the earthquake and war was widely acknowledged.\nThe President informed that the Government of Turkey had maintained a record of charity works which it received from Pakistani people during earthquakes and war. Eminent educationist and scholar Hassan Ali Effendi also received honour of “Affendi” because of his charity work in Turkey, the President informed.\n” I have close association with all parts of Sindh therefore I am fully aware of the issues being faced by the people of the province,”  the president said and assured that the government of Prime Minister Imran Khan would not leave the people of Sindh alone in this crucial time and all out efforts would be made for relief and rehabilitation of rain affected people of the province.\nThe effective strategy of the Prime Minister Imran Khan have not only helped to successfully meet out the challenges of COVID-19, but the government policies also helped to continue economic activities along with financial assistance to 16.9 million poor families of the country, the President said and added that it become possible because of closed contacts of the Prime Minister with the masses.\nAmong others, Governor Sindh Imran Ismail, MNA Lal Malhi, MNA Nuzhat Pathan, MNA Jay Parkash and PTI Parliamentary Leader in Sindh Assembly Haleem Adil Shaikh were also present on the occasion.",
  "retrievedAt": "2025-08-11T19:47:53.332Z"
}
