{
  "title": "Trump says US seeking control of Bagram air base given up in Afghanistan withdrawal - World - DAWN.COM",
  "author": null,
  "content": "The United States is trying to get Bagram air base in Afghanistan back, President Donald Trump said on Thursday during a joint news conference with British Prime Minister Keir Starmer.\n\nTrump is on an official state visit to the UK — his second state trip to Britain — where he signed a technology agreement with Starmer earlier today.\n\n“We’re trying to get it back,” Trump said, referring to Bagram. “It’s one of the biggest airbases in the world; we gave it to them for nothing. We’re trying to get it back.\n\n“One of the reasons we want the base, as you know, is it’s an hour away from where China makes its nuclear weapons.”\n\nBagram Air Base served as the linchpin for US operations in the rugged country, where the long war against the Taliban and their Al Qaeda allies was fought with air strikes and resupply missions from the airfield.\n\nThe historic Soviet-built airstrip was the main base for American forces in Afghanistan following the September 11, 2001, attacks, up until their 2021 withdrawal, which led to a takeover by the Afghan Taliban.\n\nIn July 2021, all US and Nato troops left Afghanistan’s biggest air base, signalling the complete withdrawal of foreign forces from the country after two decades of war.\n\nA week after the US withdrawal, Bagram buzzed again with activity as Afghan forces settled into the vast premises, complete with its runways, barracks, control towers and hospital.\n\nBefore the joint presser, Trump and Starmer signed a huge tech deal, which the British PM hailed as “the biggest investment package of its kind in British history by a country mile”.\n\nBritain’s work in wooing the unpredictable Trump on his second state visit seemed to have paid off as he and Starmer signed the partnership, boosting ties in artificial intelligence, quantum computing and nuclear energy.\n\nTrump said the deal was “very big”, and added of US relations with key Nato ally Britain that, “It’s an unbreakable bond we have regardless of what we’re doing today.”\n\nThe deal comes on the back of pledges of £150 billion ($205bn) of investment into the UK from American giants, including Microsoft, Google and Blackstone.\n\nContinuing the press conference, Trump said he disagreed with Starmer over recognising a Palestinian state, speaking following their bilateral meeting.\n\n“I have a disagreement with the prime minister on that score, one of our few disagreements, actually,” Trump said in response to a question during the press conference.\n\nMeanwhile, Starmer said he and Trump agreed on the ultimate aim of peace in the region.\n\n“We absolutely agree on the need for peace and a road map, because the situation in Gaza is intolerable,” he said.\n\nWhen pressed about reports he was waiting for Trump to leave the country before formally recognising a Palestinian state this weekend, Starmer said: “I made my position clear at the end of July as to the timing, which has got nothing to do with this state visit.\n\n“I’ve discussed it with the president, as you would expect, amongst two leaders who respect each other and like each other and want to bring about a better solution in the best way that we can,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/182039468f3a920.webp",
  "retrievedAt": "2025-10-12T04:15:53.037Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942988/trump-says-us-seeking-control-of-bagram-air-base-given-up-in-afghanistan-withdrawal",
  "dateList": "2025-09-20",
  "date_published": "2025-09-18T15:44:05.000Z"
}
