{
  "title": "Balochistan wants families to report ‘missing’ relatives, those with militant links - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Envisions sworn affidavits disowning relatives linked to militancy\n• Non-compliant individuals to be treated as abettors, facilitators\n\nQUETTA: The Balochistan government has directed families to immediately report if any of their relatives go missing or join non-state or militant groups, warning that strict legal action will be taken against those who fail to comply.\n\nAccording to an official notification issued by the Home Department, families are required to provide such information within seven days and submit sworn declarations disowning relatives involved in militancy, or else face action under anti-terrorism laws.\n\nThe notification stated that citizens, parents and guardians must inform the nearest police station and FC/army unit within one week if a family member goes missing or is found to have joined any non-state or militant group.\n\nIt further directed that details of individuals already missing must also be submitted within seven days under Sections 118 and 202 of the Pakistan Penal Code (PPC), read with Section 11(1)(EEE) of the Anti-Terrorism Act (ATA), 1997.\n\nSimilarly, families of those who have already joined militant outfits must file a sworn affidavit of separation and disownment within a week, in line with sections 120/120-A of the PPC, read with Section 11(1)(a)(EEE) of the ATA.\n\nThe notification warned that if families fail to report missing persons or refuse to disown them, and it is later established that the individual was involved in terrorism, the family will be treated as abettors/facilitators under the ATA. Their names may also be placed in the Fourth Schedule under sections 107, 109 and 114 of the PPC, read with ATA provisions.\n\nThe Home Department warned that facilitators will face strict legal action, including confiscation of property, dismissal from government service, and denial of all state financial and welfare benefits.\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/200746487985c34.webp",
  "retrievedAt": "2025-09-20T12:12:15.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943353/balochistan-wants-families-to-report-missing-relatives-those-with-militant-links",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:56:12.000Z"
}
