{
  "title": "Rashford stars as Barca beat Newcastle, City see off Napoli - Sport - DAWN.COM",
  "author": null,
  "content": "PARIS: Marcus Rashf­ord proved the perfect replacement for Lamine Yamal, scoring twice on his return to England as Barcelona kicked off their Champions League bid with a 2-1 victory away to Newcastle United on Thursday, while Kevin De Bruyne watched mostly from the sidelines as Napoli lost 2-0 at his former club Manchester City.\n\nWith Yamal missing thr­o­ugh injury, Rashford — a loan signing from Manch­ester United — got a start and scored both Barca goals at St James’ Park. The second took the breath away, a piledriver from 25 metres that flew in off the crossbar.\n\n“It’s an amazing experience playing for Barcelona. I’ve always been a huge admirer of the club. We just want to win as much as possible,” Rashford said. “I’m very motivated and determined. The quality we have in the team, that excites me alone. It’s so refreshing to play with these guys.”\n\nDe Bruyne was also back on English soil, at the club where he spent 10 years before an emotional farewell in May. But his Etihad Stadium return lasted 26 minutes before he was substituted following a red card for team-mate Giovanni Di Lorenzo and City wound up a comfortable winner thanks to second-half goals from Erling Haaland and Jeremy Doku.\n\nHaaland’s header put him on 50 goals in 49 Cham­pions League appea­rances, with the Norway striker reaching that milestone quic­­ker than any other pla­yer in the competition’s history.\n\nThe third consecutive evening of action in the first round of games in this season’s league phase also saw Eintracht Frankfurt, Sporting Lisbon and Club Brugge record big wins while FC Copenhagen held Bayer Leverkusen.\n\nEngland coach Thomas Tuchel was in the stands of a raucous St. James’ Park to witness Rashford showcase his finishing abilities that United could do with right now.\n\nRashford was still looking for his first Barca goals and he got off the mark by heading in Jules Kounde’s cross in the 58th before he created space for himself with some clever footwork and blasted a ferocious right-footed shot from outside the area off the underside of the bar in the 67th.\n\nAnthony Gordon pulled one back for Newcastle, putting in a low cross from substitute Jacob Murphy in the 89th, but Barca — beaten in the semi-finals last season — held on to claim their first three points of the campaign.\n\nPep Guardiola’s City, the 2023 Champions League winners, got off to an ideal start too as they saw off Serie A champions Napoli at the Etihad Stadium.\n\nThe game was conditioned by the sending-off of Napoli captain Di Lorenzo, dismissed for wiping out Haaland as the Norwegian headed towards goal.\n\nNapoli’s defensive reorganisation meant De Bruyne was sacrificed. Ever the team player, the Belgium playmaker took the decision well, jogging off to applause from a home crowd that once cheered his every assist and goal.\n\n“It was the only option I could do,” Napoli coach Antonio Conte said. “I was really, really sorry for him.”\n\nBy the end of the game, City fans were chanting De Bruyne’s name, confident the three points were safe and their former hero — perhaps the club’s greatest-ever player — couldn’t hurt them.\n\n“He’s a legend of the club,” City midfielder Phil Foden said. “I can’t thank him enough for what he has done.”\n\nCity’s undoubted star is now Haaland and the Norway striker has started the season in red-hot form, with his clever header in the 56th from Foden’s flick into the box making it 12 goals in seven matches for club and country.\n\n“The numbers speak for themselves and how fortunate we are to have him,” Guardiola said of Haaland, who is 12th in the all-time Champions League scoring charts — barely over a third of the way to Cristiano Ronaldo’s record 141 goals. “Along with the two monsters of the past 15 to 20 years. Ronaldo and [Lionel] Messi, Erling is there. In terms of goals he is unbelievable.”\n\nDoku added the second with a neat finish in the 65th as City laid down an early marker in Europe, leaving Napoli without a win in 13 visits to face English opposition in European competition.\n\nFrankfurt were the night’s biggest winners as they beat Galatasaray 5-1, despite the Turkish visitors taking an early lead through Yunus Akgun at the Waldstadion.\n\nA Davinson Sanchez own goal brought Frankfurt level on 37 minutes, before teenage Turkey midfielder Can Uzun fired in his first Champions League goal just before the break and another own goal from Wilfried Singo at a free-kick gave the Bundesliga side some breathing space.\n\nJonathan Burkardt’s deflected effort and Ansgar Knauff’s late strike wrapped up a comfortable night for the hosts.\n\nFellow Bundesliga side Leverkusen had to come from behind twice to snatch a point in a 2-2 draw away to Copenhagen in the Danish capital. A brilliant Alejandro Grimaldo free-kick cancelled out Jordan Larsson’s early opener for the hosts.\n\nYoung Brazilian forward Robert restored the hosts’ advantage in the 87th minute only for a Pantelis Hatzid­iakos own goal in stoppage time, deflecting the ball into his own net from substitute Claudio Echeverri’s cross, to give Leverkusen a share of the spoils.\n\nClub Brugge, who reached the last 16 last season, claimed a stunning 4-1 win at home to Monaco in Belgium, with an early penalty miss by Maghnes Akliouche for the visitors proving crucial.\n\nThe Belgians struck three goals in the space of 10 minutes shortly before half-time through Nicolo Tresoldi, Raphael Onye­dika and Hans Vanaken.\n\nFrench 19-year-old forward Mamadou Diakhon lashed in a fourth with 15 minutes left, before Ansu Fati, making his Monaco debut, scored a late consolation.\n\nKairat Almaty, the tournament newcomers from Kazakhstan, made what is thought to be longest ever trek for a Champions League fixture — across three time zones and more than 7,000 kilometres — and lost 4-1 at Portuguese champions Sporting.\n\nKairat, who beat Celtic in the play-offs, had seen 18-year-old goalkeeper Sherkhan Kalmurza save an early penalty from Morten Hjulmand.\n\nSporting, though, went ahead just before half-time through Francisco Trinccao, who then fired in another after 65 minutes before Alisson Santos and Geovany Quenda also struck in quick succession.\n\nEdmilson pulled one back for Kairat, who host Real Madrid next in a fortnight.\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cdcd7098658.jpg",
  "retrievedAt": "2025-09-20T12:12:02.408Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943334/rashford-stars-as-barca-beat-newcastle-city-see-off-napoli",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:57:51.000Z"
}
