{
  "title": "China sticks to its stance on TikTok’s US future after Trump call - Business - DAWN.COM",
  "author": null,
  "content": "China stuck to its stance on the future of TikTok in the United States on Saturday, a day after US President Donald Trump said a deal to switch short video app TikTok to US-controlled ownership was progressing.\n\n“China’s position on TikTok is clear: The Chinese government respects the wishes of the enterprise, and welcomes it to carry out commercial negotiations in accordance with market rules to reach a solution compliant with China’s laws and regulations, and strikes a balance of interests,” China’s Commerce Ministry said in a statement, reiterating a position it has maintained over the past week.\n\nKey questions remain about the potential US-China deal after Trump and Chinese President Xi Jinping held a call on Friday.\n\nThey include the precise ownership structure of TikTok, how much control China will retain over the app’s inner workings, and what Beijing gets from backing down and letting the US muscle in on one of China’s most successful companies.\n\nProgress over the future of the social media app, which has 170 million US users, is seen as key to unlocking concessions in other areas — from airplanes to soybeans — as the world’s two largest economies chart a path beyond their current tariff truce.\n\n“It is hoped that the US side will work towards the same goal as China, earnestly fulfil its corresponding commitments, and provide an open, fair, equitable and non-discriminatory business environment for the continued operation of Chinese enterprises in the US, including TikTok,” the Commerce Ministry statement added.\n\nSince a framework deal was struck in Madrid earlier this week, Chinese officials and state media have called it a “win-win”, promising to review TikTok’s technology exports and intellectual property licensing.\n\nThe framework deal was one hurdle Trump needed to clear to keep TikTok open. US Congress had originally ordered the app to be shut down for US users by January 2025 if its US assets were not sold by Chinese owner ByteDance.\n\nHe Yadong, a spokesperson for China’s Commerce Ministry, reiterated China’s hope that the US reduce the barriers to trade facing Chinese firms, when asked what Beijing had got out of the Madrid deal during a news conference on Thursday.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-20T12:11:56.003Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943427/china-sticks-to-its-stance-on-tiktoks-us-future-after-trump-call",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T11:26:45.000Z"
}
