{
  "title": "Islamabad court indicts accused in teenage social media influencer Sana Yousaf’s murder case - Pakistan - DAWN.COM",
  "author": null,
  "content": "An Islamabad court indicted accused Umar Hayat in the murder case of 17-year-old social media influencer Sana Yousaf on Saturday.\n\nThe accused pled not guilty to murdering Yousaf, who was shot dead at her house in June.\n\nDuring the hearing, Additional District and Sessions Judge Mohammad Afzal Majoka enquired whether Hayat had killed Sana.\n\n“I did not commit any such crime,” the accused replied.\n\nThe judge then asked him whether he was falsely accused in the case.\n\n“Is this all a lie?” the judge remarked. He also pointed out that Hayat had also been accused of snatching Yousaf’s mobile phone.\n\nAt that, the accused maintained that all allegations levelled against him were “based on falsehood”.\n\nThe court then adjourned the hearing until September 25.\n\nIslamabad police had arrested Hayat on June 3, a day after Yousaf was killed at her house in Islamabad.\n\nPreceding his arrest, a first information report (FIR) of the murder was registered at Islamabad’s Sumbal police station against an unidentified man on the complaint of Sana’s mother, Farzana Yousaf, invoking Section 302 (intentional murder) of the Pakistan Penal Code (PPC).\n\nIn the FIR, Yousaf’s mother said that a man with a pistol in his hand had entered their house suddenly at around 5pm and “shot straight at my daughter with the intention to kill”.\n\nLater, Islamabad Inspector General (IG) Syed Ali Nasir Rizvi had said during a press conference the police had arrested a suspect, who was a was a 22-year-old man, from Faisalabad.\n\nHe said Hayat had tried to contact Yousaf repeatedly and was being “rejected by her again and again”, adding that the accused had taken Yousaf’s mobile phone in a bid to wipe out the evidence but it had been recovered along with the weapon of offence.\n\nOn July 25, police had formally submitted the challan against Hayat to the prosecution branch of the district and sessions courts. It also included Hayat’s confessional statement recorded under Section 164 of the Code of Criminal Procedure.\n\nIn his statement, Hayat — son of a retired government official and a TikToker himself — said he had developed a one-sided infatuation with Sana after connecting with her through social media. He had confessed that suspicion and jealousy drove him to kill her.\n\nHayat revealed that he had travelled from Jaranwala to Islamabad on May 28 to wish Sana on her birthday. When she did not meet him, he became convinced she was deliberately avoiding him, he said, adding that On June 2, he returned to the capital after renting a Toyota Fortuner and carrying a 30-bore pistol, intending to confront her.\n\nAccording to his account, when Sana did not respond to his repeated calls, he went to her home in G-13 sector of the capital, forced his way inside, and fatally shot her in front of her mother and maternal aunt. He then took Sana’s mobile phone to erase their conversations and fled.\n\nHayat said he directed the driver to drive fast and later hid the murder weapon near a railway bridge before returning to Jaranwala.\n\nFollowing the last hearing of the case on September 13, Dawn reported that Hayat had expressed remorse for his actions, telling the magistrate that he felt deeply ashamed for having taken the life of an innocent teenage girl.\n\n“I feel deeply ashamed for committing such a cruel act,” he had reportedly said, adding that his confession was voluntary and not made under pressure.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-20T12:12:01.152Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943409/islamabad-court-indicts-accused-in-teenage-social-media-influencer-sana-yousafs-murder-case",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T07:58:43.000Z"
}
