{
  "title": "Karachi man gets 24 years in prison for throwing acid on estranged wife - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A sessions court has sentenced a man to a total of 24 years of rigorous imprisonment for throwing acid on his wife.\n\nAdditional District and Sessions Judge (South) Muhammad Yousuf Malik found Muhammad Sajid guilty of the offence and sentenced him to 14 years in prison for throwing acid on his wife, Saima Bibi, who had suffered 22 per cent burn injuries, and an additional 10 years for trying to kill her.\n\n“It has been established that the accused committed offence of throwing acid upon an innocent lady without any justification,” the court remarked.\n\nAccording to state prosecutor Ayesha Saeed, the couple had been married for 12 years, but the woman had been living with her parents along with her three children for the past two-and-a-half years as her husband, who was a drug addict, used to beat her.\n\nIn her testimony before the court, the acid attack survivor stated that on the day of the incident, she was at her parents’ house when, at around 8pm, her husband arrived, suddenly threw acid on her and fled.\n\nSubsequently, her brother and mother shifted her to a hospital, where she recorded her statement and nominated her husband for the offence.\n\nDuring the trial, the defence counsel contended that the accused was falsely implicated in the case. Claiming that the brother of the woman had thrown acid, he also argued that the prosecution failed to produce independent witnesses in the case.\n\nBut the court rejected the defence plea and noted that the accused failed to produce substantial evidence in support of his claim.\n\nIt added that the incident had taken place inside the house; therefore, the family members who were present and saw the incident came forward and recorded their statements in support of the victim.\n\nA case was registered at the Defence police station under Section 324 (attempted murder) and 336-B (punishment for hurt by corrosive substance) of the Pakistan Penal Code.\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-20T12:11:59.504Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943307/karachi-man-gets-24-years-in-prison-for-throwing-acid-on-estranged-wife",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:58:33.000Z"
}
