{
  "title": "Punjab to set up flood relief committees at local level - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Survey app, monitoring dashboard introduced for transparent aid distribution\n• Sutlej breach submerges 150 villages in Multan, Lodhran, Bahawalpur\n• PDMA says monsoon ends; rivers across Punjab return to normal levels\n• Gilani calls for BISP role in relief\n\nLAHORE: The Punjab government will establish flood relief committees at district and tehsil levels to oversee aid and rehabilitation in areas devastated by recent floods.\n\n“A survey form, a mobile application and a central monitoring dashboard will ensure effective aid distribution and oversight,” Chief Minister Maryam Nawaz said while chairing a meeting on Friday.\n\nShe directed officials to initiate comprehensive rehabilitation efforts for affected families, ensure the immediate restoration of roads and bridges and devise simple, effective procedures for providing assistance.\n\nThe chief minister said the floods had impacted 3,775 villages across 64 tehsils in 27 districts, damaging more than 63,000 concrete houses and over 309,000 mud houses.\n\nSurvey teams comprising officials from the Urban Unit, Revenue Department, Agriculture Department and the Pakistan Army will collect data to ensure accurate assessments.\n\nCM Maryam emphasised that no victim should be left without support. “We will compensate each individual for their losses so that no one is deprived of their rightful relief,” she said, directing the establishment of additional relief camps and distribution points.\n\nSutlej breach submerges villages\n\nA devastating breach of the Sutlej River at Noraja Bhutta has intensified the crisis in south Punjab, inundating 150 more villages across Multan, Lodhran and Bahawalpur districts. Thousands have been displaced as floodwaters encroached on a 20-kilometre stretch near the Multan-Sukkur M-5 Motorway.\n\nIn Bahawalpur, villages including Nowshera Jadeed, Saadullahpur, Soiwala, Nai Basti and Basti Chakar were submerged. In Lodhran, Adam Wahan, Munshi Wala, Jhangra and Thali Wala were washed away.\n\nJalalpur Pirwala remains under water, with authorities reviewing a plan to breach the motorway to redirect floodwaters into the Chenab. A technical committee is expected to deliberate on the plan.\n\nMultan Division Commissioner Amir Karim Khan visited Jalalpur Pirwala to supervise rescue and relief operations. He inspected the damaged motorway section, where National Highway Authority officials briefed him on ongoing repair work using heavy machinery.\n\nMotorway police spokesperson Imran Shah said the M-5 was closed due to flooding, with diversions set up for travellers. Alternate routes through the national highway from Shah Shams and Uch Sharif interchanges were being provided.\n\nFatalities, losses\n\nPunjab Disaster Manage­ment Aut­hority (PDMA) Director General Irfan Ali Kathia said the death toll in Punjab had reached 123. Speaking at a press conference, he noted that floodwaters were receding in several areas, with boat operations discontinued as water levels dropped.\n\nHe confirmed the end of the monsoon season and said all rivers had returned to normal levels, except for a slightly higher flow in the Sutlej.\n\nHowever, water remains on 10-12 kilometres of the M-5 motorway, keeping a 22-kilometre section closed.\n\nHe stated that water from the Indus River did not cause any problems. “A breached section of the bridge has been filled in,” Mr Kathia said.\n\nA report from the South Punjab Secretariat confirmed large-scale hu­­man and material losses, including 45 deaths. Around 1.17 million people were affected and 1,112 villages inundated. Floods also damaged 1.17m acres of farmland and destroyed crops on 1.25m acres.\n\nRelief efforts include 1,145 camps providing food, medicine and other essentials. More than 1.5m people and 1.47m livestock have been evacuated. Medical treatment has been provided to 451,978 people, and 848,119 animals have been treated.\n\nBISP relief\n\nEarlier, PPP’s Acting President Yusuf Raza Gilani visited Jalalpur Pirwala and reviewed the flood situation.\n\nSpeaking to the media, he said that PPP Chairman Bilawal Bhutto-Zardari has demanded that flood victims be assisted through the Benazir Income Support Programme (BISP).\n\nHe held a meeting with Adviser to the Prime Minister Rana Sanaullah two days ago and discussed political matters and flood-affected areas.\n\nHe said that Mr Bhutto-Zardari had stressed BISP’s role in relief efforts while Rana Sanaullah was of the view that assistance to flood-affected people would be conducted through other programmes.\n\nMr Gilani urged the government to reconsider their decision to help flood-affected people from other programmes and said that the flood victims’ families should be supported via the BISP.\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cdd46463299.jpg",
  "retrievedAt": "2025-09-20T12:12:05.513Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943351/punjab-to-set-up-flood-relief-committees-at-local-level",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:56:12.000Z"
}
