{
  "title": "UNGA at 80: time to act - Newspaper - DAWN.COM",
  "author": null,
  "content": "AS the United Nations General Assembly (UNGA) marks its 80th session in 2025, it stands at a critical crossroads — not just as a platform for global diplomacy, but also as a moral compass in an era of escalating climate emergency.\n\nWhat began in 1945 as a beacon of peace and multilateralism must now evolve to meet the greatest existential threat of our time: climate change. And in doing so, it must acknowledge the human rights dimensions of this crisis, ensuring justice for those least responsible but most affected.\n\nIn this historic year, the UNGA cannot afford to offer only symbolic gestures. It must champion real, urgent climate action, particularly in the realm of adaptation and funding for loss and damage, and push for the recognition of climate chan­ge not just as an environmental or economic issue, but also as a violation of fundamental human rights.\n\nNowhere is this injustice starker than in Pakistan, which has faced one of the worst climate disasters in recent history. In 2022, catastrophic floods submerged a third of the country, affecting 33 million people, killing over 1,700 people and displacing millions. The economic damage was estimated at over $30 billion. Monsoon- or cloudburst-triggered floods in 2025 have left more than 800 people dead since June.\n\nFor a country responsible for less than one per cent of global greenhouse gas (GHG) emissions, the devastation was not just tragic, it was unjust. Pakistan’s experience is a grim reminder that climate change respects no borders and its impacts are disproportionately felt by nations and populations with the least resources to cope.\n\nThe UN General Assembly cannot afford to offer only symbolic gestures. It must champion real, urgent climate action.\n\nThe recurring floods in Pakistan aren’t merely a natural disaster; they are a symptom of a global system failing its most vulnerable. As the climate crisis intensifies, extreme weather events will no longer remain isolated but become more frequent and intense.\n\nThe creation of the Loss and Damage Fund at COP27 was a historic moment, recognising the responsibility of high-emitting countries to support those suffering the worst climate impacts. However, nearly two years on, the fund remains under-financed and under-delivered. Without substantial and sustained contributions, the promise of the fund will remain hollow.\n\nAdaptation efforts aimed at helping communities adjust to the changing climate are also woefully under-funded. According to the UN, adaptation finance needs in developing countries could rise to $300bn annually by 2030, yet current flows are just a fraction of that. This shortfall translates directly into lives lost, livelihoods destroyed and futures foreclosed.\n\nThe 80th session of the UNGA must serve as a turning point. Member states must move beyond pledges and towards binding financial commitments to fund adaptation and loss and damage. They must recognise that climate finance is not charity but compensation for harm caused, and a step towards a more just and stable world.\n\nThe moral imperative for climate action gained significant legal and ethical weight with the International Court of Justice’s (ICJ) advisory opinion delivered in July 2025. The non-binding advisory opinion states that countries have a legal obligation under international law to curb GHG emissions and protect the climate system, particularly in relation to human rights and intergenerational equity.\n\nThis landmark case marks a profound shift in how the world perceives climate change — not just as a scientific or geopolitical issue, but as a matter of justice and human dignity. The ICJ’s advisory opinion affirms that governments have legal obligations to protect their citizens from climate harm and must act with urgency in reducing emissions and financing resilience.\n\nClimate-induced forced displacement, food insecurity, water scarcity and growing inequality are all fundamentally human rights violations. Nations that breach climate obligations and cause harm may have to pay reparations to the affected countries.\n\nThe UN, with its long-standing commitment to human rights, must take this moment to align its climate response accordingly. It must support mechanisms to hold nations and corporations accountable for climate-related harm and elevate the voices of communities on the front lines.\n\nAs world leaders gather in New York to commemorate 80 years of the UNGA, there is both celebration and reckoning. The UN has presided over decades of dialogue, diplomacy and peace-building, but it must now rise to meet the challenge of climate justice with the same resolve.\n\nWe need a dedicated ‘UN Climate Justice Council’ to monitor, report on, and advise states on fulfilling their human rights obligations under climate law. We need robust financial commitments to adaptation and loss and damage, not in the billions, but in the trillions. And we need legal pathways for the victims of climate injustice to seek redress.\n\nClimate change is the defining issue of our generation, and how we address it will define the legitimacy of global governance for decades to come. The outcome of the 80th UNGA must not be limited to lofty speeches, but reflect the aspirations of the global majority under threat. It must choose justice over delay, action over apathy, and responsibility over indifference.\n\nEighty years ago, the founders of the United Nations pledged to “save succeeding generations from the scourge of war”. Today, the scourge is climate change and the generation is already here. Let the legacy of the 80th UNGA be one of courage, compassion and commitment to a liveable and equitable future for all. The UN at 80 must rise to the occasion.\n\nThe writer is chief executive of the Civil Society Coalition for Climate Change.\naisha@csccc.org.pk\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cdd99fb3e7e.jpg",
  "retrievedAt": "2025-09-20T12:11:57.901Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943370",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:59:51.000Z"
}
