{
  "title": "Bid to lift UNSC nuclear sanctions on Iran fails to pass - World - DAWN.COM",
  "author": null,
  "content": "• Russia, China, Pakistan and Algeria vote in favour; nine against; two abstentions\n• Islamabad urges peaceful resolution, more time for diplomacy, and preservation of JCPOA framework\n• Iran says council decision ‘weakens diplomacy’, but leaves door open for talks\n\nUNITED NATIONS: The United Nations Security Council did not adopt a draft resolution on Friday to permanently lift sanctions on Iran, but Tehran and key European powers still have eight days to try and agree to a delay.\n\nThe 15-member UN Security Council was required to vote on the draft resolution on Friday after Britain, France and Germany launched a 30-day process on August 28 to reimpose UN sanctions, accusing Tehran of failing to abide by a 2015 deal with world powers that aimed to prevent it from developing a nuclear weapon.\n\nIran denies having any such intention.\n\nRussia, China, Pakistan and Algeria voted in favour of the draft text on Friday. Nine members voted against and two abstained.\n\nPakistan’s Permanent Representative to the UN, Asim Iftikhar Ahmad, in a statement, said Islamabad believes that all issues concerning Iran’s nuclear programme must be resolved peacefully through dialogue and cooperation. He stressed the need to allow more time for diplomacy to succeed.\n\nHe emphasised the imperative of avoiding any confrontation that could further complicate the situation.\n\nMr Ahmad said that Pakistan stresses the importance of preserving the framework of the Joint Comprehensive Plan of Action (JCPOA) and Resolution 2231 as the basis for reaching an amicable solution, without resorting to coercive measures, until a successor arrangement or ‘new deal’ is achieved.”\n\nThe Security Council vote has now set up a week of intense diplomacy while world leaders — including Iran’s President Masoud Pezeshkian — are in New York for the annual high-level UN General Assembly.\n\n‘Weakens diplomacy’\n\n“The door for diplomacy is not closed, but it will be Iran, not adversaries, who decide with whom and on what basis to engage,” Iran’s UN Ambassador Amir Saeid Iravani told reporters after the vote.\n\nIran’s Foreign Minister Abbas Araqchi will meet with his European counterparts in New York next week on the sidelines of the UN General Assembly, he said, adding that Friday’s divided vote showed there was “no consensus in the council”.\n\n“This decision weakens diplomacy and risks dangerous consequences for non-proliferation,” Irav­ani said.\n\nBritain, France and Germany have offered to delay reinstating sanctions for up to six months — to allow space for talks on a long-term deal on Tehran’s nuclear programme — if Iran restores access for UN nuclear inspectors, addresses concerns about its stock of enriched uranium, and engages in talks with the United States.\n\n“Without these most basic conditions being met, there is no clear path to a swift diplomatic solution,” Britain’s UN Ambassador Barbara Woodward told the council. “We are ready for further engagements, diplomatically, in the next week, and beyond to seek to resolve differences.”\n\nAny delay on reimposing sanctions would require a Security Council resolution. If a deal on an extension can’t be reached by the end of September 27, then all UN sanctions will be reimposed.\n\n‘US remains ready to engage’\n\nActing US Ambassador Dorothy Shea said that while the US voted “no” on Friday, it “does not impede the possibility of real diplomacy”, adding that a return of sanctions on Iran “does not preclude later removal through diplomacy”.\n\n“More importantly, President Trump has continued to reiterate the United States ongoing readiness for meaningful, direct, and timebound dialogue with Iran be it prior to the conclusion of the snapback process on September 27, or after,” she told the council.\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cdcf7e6d91a.jpg",
  "retrievedAt": "2025-10-12T04:16:05.381Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943349/bid-to-lift-unsc-nuclear-sanctions-on-iran-fails-to-pass",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:56:40.000Z"
}
