{
  "title": "IOC to allow Russians, Belarusians under neutral flag at 2026 Winter Olympics - Sport - DAWN.COM",
  "author": null,
  "content": "MILAN: Russians will compete as neutral independent athletes without a national flag or anthem at the Milano-Cortina 2026 Winter Games, the International Olympic Committee said on Friday, maintaining the same sanctions as the Paris Summer Games last year.\n\nThe IOC suspended the Russian Olympic Committee in October 2023 for recognising regional Olympic councils for Russian-occupied regions of Ukraine, Luhansk, Donetsk, Kherson and Zaporizhzhia, following Russia’s 2022 invasion of Ukraine, saying the move had violated the Olympic Charter.\n\n“We also spoke about the Independent Neutral Athletes (AINs). This will be nothing new,” IOC President Kirsty Coventry told a press conference. “The executive board will take the exact same approach that was done in Paris (2024 Olympics). Nothing has changed.”\n\nRussian and Belarusian athletes who reach qualifying times will be first vetted for any links to the Russian military or support of the war in Ukraine, both of which will exclude them.\n\nRussian teams are banned from the Games. Belarus has acted as a staging ground for the invasion of Ukraine.\n\nA small number of individual Russian and Belarusian athletes were allowed to take part as AINs in the Paris 2024 Summer Olympics after first passing rigorous vetting by the IOC. They competed without the Russian or Belarusian flag and anthem. Instead, they took part as neutral athletes.\n\nIt remains to be seen how winter sports federations will respond to the IOC’s decision.\n\nSome have maintained a total ban on Russians. These include the International Ski Federation (FIS), whose disciplines account for more than half of the podium places at the Winter Olympics.\n\nThe International Biathlon Union (IBU) is taking the same line, as is the International Luge Federation (FIL), which conducted an anonymous survey among its athletes revealing “their concerns about safety, Olympic quotas, compliance with anti-doping regulations and fairness” in the event of a Russian return.\n\nThe organisation governing skating, the ISU has opened a narrow path to Olympic qualification, allowing one competitor from each of the two nations in each category, but no entries in relays or team events.\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-20T12:12:01.319Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943326/ioc-to-allow-russians-belarusians-under-neutral-flag-at-2026-winter-olympics",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:57:51.000Z"
}
