{
  "title": "Trump hits H-1B visas, a tech industry favorite, with $100,000 fee - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Friday ordered an annual $100,000 fee be added to H-1B skilled worker visas, creating potentially major repercussions for the tech industry where such permits are prolific.\n\nThe new measure, which could likely face legal challenges, was announced alongside the introduction of a $1 million “gold card“ residency programme that Trump had previewed months earlier.\n\n“The main thing is, we’re going to have great people coming in, and they’re going to be paying,” Trump told reporters as he signed the orders in the Oval Office.\n\nH-1B visas allow companies to sponsor foreign workers with specialised skills — such as scientists, engineers, and computer programmers — to work in the United States, initially for three years, but extendable to six years.\n\nThe United States awards 85,000 H-1B visas per year on a lottery system, with India accounting for around three-quarters of the recipients.\n\nLarge technology firms rely on Indian workers who either relocate to the United States or come and go between the two countries.\n\nTech entrepreneurs — including Trump’s former ally Elon Musk — have warned against targeting H-1B visas, saying that the United States does not have enough homegrown talent to fill important tech sector job vacancies.\n\n“All the big companies are on board,” said Commerce Secretary Howard Lutnick, who joined Trump in the Oval Office.\n\nTrump has had the H-1B programme in his sights since his first term in office, but faced court challenges to his earlier approach, which targeted the types of jobs that qualify. The current iteration has become the latest move in the major immigration crackdown of his second term.\n\nAccording to Trump’s order, the fee will be required for those seeking to enter the country beginning Sunday, with the Homeland Security secretary able to exempt individuals, entire companies, or entire industries.\n\nThe order expires in a year, though Trump can extend it.\n\nThe number of H-1B visa applications has risen sharply in recent years, with a peak in approvals in 2022 under then-president Joe Biden.\n\nIn contrast, the peak in rejections was recorded in 2018, during Trump’s first term in the White House.\n\nThe United States approved approximately 400,000 H-1B visas in 2024, two-thirds of which were renewals.\n\nTrump also signed an order creating a new expedited pathway to US residency for people who pay $1 million, or for corporate sponsors to pay $2 million.\n\n“I think it’s going to be tremendously successful,” Trump added.\n\nIndia’s leading trade body Nasscom has said the timeline for implementing the new $100,000 fee for H-1B visas for high-tech workers in the United States was a “concern”.\n\n“A one-day deadline creates considerable uncertainty for businesses, professionals, and students across the world,” it said in a statement after President Donald Trump announced the fee which comes into force from Sunday.\n\nIt added that policy changes of this scale were best “introduced with adequate transition periods, allowing organisations and individuals to plan effectively and minimise disruption.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/201046448a15cd9.webp",
  "retrievedAt": "2025-09-20T12:11:56.249Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943398/trump-hits-h-1b-visas-a-tech-industry-favorite-with-100000-fee",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T05:47:43.000Z"
}
