{
  "title": "Man arrested for digging up grave to perform ‘black magic’ in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Rawalpindi police have arrested a man accused of performing black magic after digging up the grave of a seven-year-old girl in a graveyard in Dhamial.\n\nThe accused was presented before a court, which granted four days’ physical remand on Friday for further investigation.\n\nThe remand was approved on the police’s request after the court expressed satisfaction that more inquiry was required in the sensitive case.\n\nA police spokesman said a shroud was found near the grave of the girl in the last week of August. Following the discovery, Dhamial police launched an investigation and arrested the suspect accused of desecrating the grave. According to initial findings, the suspect dug up the grave for witchcraft purposes and then attempted to cover it again.\n\nPolice immediately responded to the information and had the grave exhumed. No direct evidence of desecration of the body was initially observed. However, forensic reports are awaited for a conclusive determination. Samples were collected during the exhumation, the spokesman added.\n\nThe arrest posed a challenge, for which special teams were formed. Police said they worked tirelessly using technical and human intelligence to trace the suspect. Once forensic reports are received, the accused will be charged with solid evidence, and all legal formalities will be completed to ensure punishment for the crime.\n\nA medical board, accompanied by a judicial magistrate, conducted the exhumation of the girl’s grave in Girja Road graveyard. The girl had been buried three days earlier. Samples from her body were collected for DNA and forensic analysis.\n\nPolice confirmed that no signs of violence or injuries were found on the body. Nevertheless, a case was registered for desecration of the grave and tampering with the remains.\n\nZafar Iqbal, father of the girl, lodged the initial complaint. He stated that his daughter died on August 26.\n\nWhen he visited the grave the following morning for fateha, he found the grave disturbed and the shroud lying in a nearby mansion.\n\nUpon receiving the report, City Police Officer Khalid Hamdani ordered legal action, considering all aspects of the case. Police later sought court approval for exhumation and the appointment of a medical board to establish facts without disturbing the grave unnecessarily.\n\nWhen exhumation began, the girl’s head and parts of her body became visible, as though the soil had been filled hastily. Her lower torso remained under stone slabs, and the body was without a shroud. According to sources, decomposition had already begun as the body had been buried for three days. Samples were collected before the body was reburied.\n\nA senior police official said the exhumation and postmortem were completed, with tissues and samples sent to the Forensic Science Agency for DNA and other tests. He confirmed that the grave had indeed been tampered with, and a case was registered against unidentified suspects.\n\nAs the investigation progressed, police traced the suspect, who turned out to be a black magic practitioner from Mansehra. He was arrested and remanded into custody for four days to aid further investigation.\n\nPublished in Dawn, September 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-20T12:11:59.638Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943263/man-arrested-for-digging-up-grave-to-perform-black-magic-in-rawalpindi",
  "dateList": "2025-09-20",
  "date_published": "2025-09-20T00:59:11.000Z"
}
