{
  "title": "Pakistan, US to resume tariff talks within days - Pakistan - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: A senior trade delegation from Pakistan is due in Washington this week for talks with US officials on the recently imposed American tariffs and related economic issues, diplomatic sources told Dawn.\n\nThe three-day visit will be the latest in a series of high-level exchanges between Islamabad and Washington amid a fragile regional security climate following last month’s military standoff between India and Pakistan.\n\nLed by Commerce Secretary Jawad Paul, the delegation includes senior Federal Board of Revenue officials and representatives of the energy and information technology sectors. They will hold meetings with counterparts at the Office of the United States Trade Representative, focusing on trade imbalances, tariff adjustments, and sectoral cooperation.\n\nDiplomatic sources confirmed that Deputy Prime Minister and Foreign Minister Ishaq Dar was scheduled to visit Washington by June 29. His visit would launch the first round of official discussions on the recent Indian military ‘misadventure’. Mr Dar is expected to meet US Secretary of State Marco Rubio and other senior officials to discuss regional security, post-conflict diplomacy, and broader strategic cooperation.\n\nCommerce, IT, energy, FBR officials to be part of trade delegation due in US this week; PTI plans protests\n\nPTI plans protests on 14th\n\nWhile official dates for these visits are being withheld due to political sensitivities, the PTI, which has long opposed the current Pakistani establishment, has announced plans to stage large-scale demonstrations during the visit.\n\nIn a tweet posted over the weekend, PTI’s Secretary for Overseas Affairs, Sajjad Burki, called for a protest outside the Pakistan embassy in Washington on June 14, coinciding with the expected presence of senior Pakistani officials in the US capital. “Let the White House know that any deal with this government is not acceptable to the people of Pakistan,” Mr Burki posted, in a message that is also being distributed as pamphlets in Washington’s Pakistani-American neighbourhoods.\n\nWhile the PTI announcement claims that Pakistan’s army chief Field Marshal Asim Munir would visit Washington around the same time, neither the US nor Pakistani officials have confirmed his visit. The ambiguity surrounding his travel plans reflects security concerns and diplomatic caution, especially given the protest plans.\n\nIn the wake of last month’s border hostilities, parliamentary delegations from both India and Pakistan visited Washington to present their respective positions. Islamabad has publicly thanked US President Donald Trump for helping arrange a ceasefire and has urged Washington to play a more active role in defusing regional tensions and reviving dialogue on the longstanding Kashmir dispute.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:32:00.406Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916434/pakistan-us-to-resume-tariff-talks-within-days",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T00:00:59.000Z"
}
