{
  "title": "Provinces to receive record Rs8.2tr under NFC Award - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The provinces are projected to receive a record Rs8.2 trillion from the federal divisible tax pool in the upcoming fiscal year 2025-26, according to budget document and the framework established by the National Finance Commission (NFC) Award.\n\nThe allocation, governed by the legally binding President’s Order No. 5 of 2010 (amended in 2015), dictates that 57.5 per cent of all net proceeds from key federal taxes — including income tax, sales tax (excluding services), federal excise, and customs duties — are distributed among the four provinces. The federal government retains the remaining 42.5pc.\n\nProvincial shares are determined by a fixed formula based on four key indicators: Population (82.0pc); primary driver of allocation and poverty/backwardness (10.3pc): supporting less developed regions and revenue collection/generation (5.0pc): and incentivising provinces to boost their own revenue and inverse population density (2.7pc).\n\nPunjab to get Rs4.07tr, Sindh Rs2.04tr, KP Rs1.34tr and Balochistan Rs743bn\n\nThe formula for province-wise allocation results in the following fixed percentage shares of the provincial pool: Punjab 51.74pc, Sindh 24.55pc, Khyber Pakhtunkhwa 14.62pc (plus an additional 1pc of the entire divisible pool specifically for war on terror expenses), and Balochistan 9.09pc.\n\nBased on these percentages and additional adjustments, the projected financial distribution for the fiscal year 2025-26 is as follows: Punjab will get Rs4.07tr (51.74pc of provincial pool), Sindh Rs2.04tr (24.55pc + share of straight transfers + additional grant: Rs53.9bn (0.66pc of provincial pool as compensation for abolished petrol & zilla tax), Khyber Pakhtunkhwa Rs1.34tr (14.62pc + KP’s share of straight transfers + war on terror 1pc: Rs79.885m); and Balochistan Rs743bn (9.09pc + largest share of royalties/surcharge).\n\nBudget estimates for 2025-26 show significant increases in total transfers compared to the revised estimates for FY25.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:32:21.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916464/provinces-to-receive-record-rs82tr-under-nfc-award",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T03:34:32.000Z"
}
