{
  "title": "PTI rejects ‘IMF-dictated’ budgetary proposals - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Teh­reek-i-Insaf (PTI) has rejected the budgetary proposals, alleging that the proposed budget for the upcoming financial year has been prepared by the International Monetary Fund (IMF).\n\nThe party arrived at this conclusion after discussing the budgetary proposals for financial year 2025-26 at a meeting of the parliamentary party, which was attended by PTI chairman Barrister Gohar Ali Khan, leader of the opposition in National Assembly Omar Ayub Khan and leader of opposition in Senate Shibli Faraz among others.\n\nCalling the PML-N government “illegitimate”, the participants were of the opinion it had no authority to present the budget. They said the PTI would never accept the budget prop­o­sals as the IMF had allegedly prep­a­red them. They alleged that relaxati­ons were proposed for the elite, while the less privileged were crushed.\n\nThe PTI leaders also criticised the ‘biased role’ of the NA speaker. The party decided that if the national broadcaster/PTV failed to air speeches by lawmakers from the opposition benches, the party would hold protests during budget debate.\n\nWhile talking to Dawn, PTI leader from Rawalpindi Shehryar Riaz said the budget 2025-26 demonstrated a narrow, IMF-driven fiscal tightening, heavily prioritising defence at the expense of social welfare and reforms.\n\n“Without bold tax reform, debt relief or growth-centred investments, it risks perpetuating poverty and instability,” he said.\n\nNo benefit for salaried class\n\nLater, PTI leader Salman Akram Raja told a presser there was hardly any benefit for the salaried class.\n\n“They are told to invest money in the stock market. People are being encouraged to invest in stock market that fluctuates. The class, which cannot protest, is continuously being burdened,” he said.\n\nSenate Opposition Leader Shibli Faraz said budget made for the elite broke all records of burdening the less privileged.\n\nThe senator suggested that the figures from Imran Khan’s tenure and current government’s tenure should be compared. Economic conditions of the masses had become so weak that many people could not even afford to sacrifice animal during Eidul Azha, he noted.\n\nInterest on loans\n\nShibli Faraz said the debt was continuously increasing and most of the tax revenue was being used in paying the interest on loans.\n\nHe said that government employees protested due to which all roads leading to Parliament House were closed and it had become difficult for lawmakers to reach there for the budget session.\n\nPTI Information Secretary Sheikh Waqas Akram said that instead of a minute increase in salaries, the government should have apologised to the masses.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:53:01.968Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916429/pti-rejects-imf-dictated-budgetary-proposals",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T00:01:04.000Z"
}
