{
  "title": "PSX hits all-time high as proposed ‘neutral-to-positive’ budget well-received by investors - Business - DAWN.COM",
  "author": null,
  "content": "Shares at the Pakistan Stock Exchange (PSX) hit an all-time high of 124,000 points on Wednesday as the proposed federal budget for the upcoming fiscal year was well-received by investors for being “neutral-to-positive”.\n\nMaintaining an aggressive stance on fiscal consolidation, as required by the Int­ernational Monetary Fund (IMF), the government yesterday still managed to offer some notional relief to the salaried class in the budget for FY2025-26, along with incentives for the real estate and construction sectors to revive the struggling industrial sector and stimulate economic growth.\n\nWhile there had been uncer­tainties surrounding the taxation measures ahead of the budget announcement, the PSX remained bullish yesterday and gained nearly 400 points to cross the 122,000 point-mark, just before the budget was presented in the National Assembly.\n\nThe benchmark KSE-100 index crossed the 124,000-point barrier at around 11am. It then witnessed a slight decline before resurging to 124,588.17 points at 3:30pm — 2,563.73 points (2.10pc) higher than yesterday’s.\n\nThe index finally closed at 124,352.68 points, recording a gain of 2,328.24 points (1.91pc).\n\nAwais Ashraf, research director at AKD Securities, told Dawn.com today that the budget announcement was “well-received by investors, primarily due to the absence of any new taxes or levies on the stock market, alleviating initial concerns”.\n\nHe noted: “Overall, the budget is viewed as neutral-to-positive for the listed sectors, with tax collection and fiscal deficit/primary surplus targets seen as non-events, as we believe they remain within the authority’s ability to meet for FY26.”\n\nDespite a record tax shortfall of Rs1.07 trillion recorded for the outgoing fiscal year, the government has set next year’s revenue target at Rs14.13tr — an 18.7pc increase from this year’s revised estimate of Rs11.9tr, against the original budget target of Rs12.97tr.\n\nExpanding upon the factors related to the stock market, Ashraf said the increase in tax rate for profit on debt and “proportionate imposition of tax on mutual funds contingent to dividends received from debt and equities at rate of 25pc and 15pc mutual funds, respectively, is expected to provide further traction for the equity market”.\n\nFaran Rizvi, country head of sales at JS Global Capital, observed that the market reaction to the budget had been “cautiously optimistic, with the PSX positioned for short-term gains as investors respond to tax relief measures on capital gains”.\n\n“The Capital Gains Tax (CGT) framework, which was expected to tighten significantly, turned out to be more favourable than anticipated,” he noted, echoing Ashraf’s opinion of a positive budget for the stock market.\n\n“This has encouraged mutual funds and institutional investors to redirect capital toward equities, potentially boosting market liquidity,” Rizvi noted.\n\nStating that while the PSX may see near-term upside, Rizvi stressed that “sustained market performance will depend on the government’s ability to manage public finances, address inflationary pressures, and maintain stable monetary policies in alignment with IMF conditions”.\n\nHe further said that broader concerns remained regarding the “sustainability of fiscal measures and the government’s ability to meet ambitious revenue collection targets while maintaining investor confidence”.\n\nYousuf M. Farooq, research director at Chase Securities, told Dawn.com: “Post-budget, we believe the market is entering the mass participation phase, characterised by rising volumes and increased public involvement. Valuations remain reasonable and are expected to trend higher.”\n\nHe said the 3.9pc GDP deficit target reinforced investor confidence in the government’s commitment to economic stability.\n\nFinance Minister Muhammad Aurangzeb yesterday announced an increase in the tax rate on interest income from 15pc to 20pc, a move that may discourage savings.\n\nHowever, some businessmen have labelled the proposed plan a “camouflage budget” due to its unrealistic targets and the lack of meaningful relief for both the business community and the general public.\n\nPakistan Business Council Chief Executive Ehsan Malik, while noting “small mercies”, termed the real estate sector the “real winner” from the budget.\n\nOverseas Investors Chamber of Commerce and Industry (OICCI) Secretary General M. Abdul Aleem expressed disappointment over the government’s limited progress in addressing inequitable corporate tax rates.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/111751085a1bf9d.jpg",
  "retrievedAt": "2025-08-20T03:52:34.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916492/psx-hits-all-time-high-as-proposed-neutral-to-positive-budget-well-received-by-investors",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T07:29:07.000Z"
}
