{
  "title": "Supreme Court issues detailed verdict in Noor Mukadam murder case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court, in its detailed verdict in the Noor Mu­­kadam murder case issued on Tuesday, expounded the significance of digital evidence by declaring that footage can be admissible as primary evidence under the ‘silent witness theory’, provided it is properly authenticated.\n\n“It is a well-known fact that technology has become so ingrained in our lives that everyone is utilising one form of technology or another,” Justice Muhammad Hashim Kakar observed in the 13-page judgement.\n\nJustice Kakar headed the three-member bench that confirmed the de­­­ath penalty awarded to Zahir Zakir Jaffer on May 20 by rejecting his ap­­peal for the 2021 ghastly murder that sent shockwaves across the country.\n\nThe judge explained that the convict appea­red to the court as a desperate person, evoking no sympathy with members of the bench in the matter of his death sentence. However, Justice Ali Baqar Najafi, a member of the bench, said he would give his additional note soon.\n\nRules that authentic footage is admissible as primary evidence\n\nNoor Mukadam, 27, was found brutally murdered at Jaffer’s residence in Islamabad on July 20, 2021. Jaffer was arrested as the prime suspect in the case and a trial court on Feb 24, 2022 sentenced him to death for murder. The court also found him guilty of rape, handing over 25 years of rigorous imprisonment and imposing a fine of Rs200,000 on him. Later, the IHC not only upheld death sentence but also converted the life imprisonment for rape into death sentence.\n\nExplaining the significance of photo and video evidence, Justice Kakar observed the silent witness theory of authentication had developed in almost all jurisdictions over the last 25 years to allow photos to substantively “speak for themselves” after being authenticated by evidence that supports the reliability of the process or system that produced the photos.\n\nThe silent witness theory is a rule of evidence that allows for the admission of photog­r­a­­phic video or other recorded evidence as substantive proof of what it depicts, without the need for an eyewitness to testify they personal­ly observed the events depicted in the recording.\n\nThe bench noted that courts remained unable to capitalise on digital evidence, which was considered hearsay, for quite long, though digital evidence was admissible only under Article 164 of the Qanun-i-Shahadat Order, 1984.\n\nHowever, in light of the growing importance of tracing and identifying perpetrators, some critical legislative changes were implemented to grant digital evidence the status of primary evidence, the SC observed.\n\nAbout footage and its evidentiary value, the court cited some examples from the UK, Canada and the US.\n\nIn recent past, such evidence was treated as hearsay and secondary evidence in the country, but keeping in view its importance, particularly in tracing and identifying culprits, required changes were made in relevant laws in order to give the status of primary evidence to the digital evidence, thus, being primary evidence, it was admissible, the court declared.\n\nIt explained it was widely accepted that punishment could be based on circumstantial evidence, subject to rigorous standards and principles. “Conviction exclusively on the basis of circumstantial evidence is not prohibited by law… The circumstantial evidence must be of a nature that is inconsistent with accused’s innocence. The accused must be linked to the offence by a complete and unbroken chain of circumstantial evidence,” it said.\n\nThe SC noted that the petitioner neglected to provide any explanation for the victim’s presence at his residence and the ensuing recovery of her body from the premises.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:31:49.698Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916426/supreme-court-issues-detailed-verdict-in-noor-mukadam-murder-case",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T00:01:05.000Z"
}
