{
  "title": "Budget grants 10pc pay raise, 7pc pension increase for govt employees - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government has increased the salaries of federal employees (Grade-1 to Grade-22) by 10 per cent, while the retired government servants will be eligible for a 7pc pension raise in light of the budget for the financial year 2025-26 tabled on Tuesday.\n\nThe government also introduced pension reforms, in a bid to reduce the exp­e­nditure under this head, as it eliminated multiple allowances and limited the family pension period to 10 years in case of the death of the actual beneficiary.\n\nInterestingly, the government did not announce the minimum wage — currently at Rs37,000 — in the federal budget. Previously, the federal government would set a minimum wage threshold and provinces would also follow suit. Moreover, the differently-abled employees would be eligible for a monthly conveyance allowance of Rs6,000 — an increase of Rs2,000.\n\nAlthough the budget document showed that the government had proposed a 6 per cent increase in the salaries of government employees, the budget speech by Finance Minister Muhammad Aurangzeb announced a 10 per cent pay hike.\n\nProposal puts end to multiple allowances, reduces family pension period to 10 years\n\n“Besides reducing tax on salaried class and despite financial constraints, the government has decided to take relief measures for the government employees. Such as a 10 per cent increase in the salaries of government employees (from grade 1 to 22), 7 per cent raise in pension of retired employees, conveyance allowance for differently-abled employees has been increased from Rs4,000 per month to Rs6,000 per month,” the finance minister said.\n\n“Following the constitution regarding equal rights, disparity in salaries is being eliminated and thus there is a proposal of 30 per cent disparity reduction allowance for eligible employees,” the minister said, adding that the country was facing acute security threats and armed forces of the country have rendered remarkable services for the defence of the country’s borders.\n\n“In recognition of their services, there is a proposal of a special relief allowance for armed forces officers, soldiers and JCOs. These expenses will be met under defence budget of the year 2025-26,” he added.\n\nPension reforms\n\nTalking about pension reforms, the finance minister said the government had introduced some reforms in the sector to diminish the burden on the exchequer. In the last few pension schemes, some changes had been made through executive orders that caused an extra burden on the exchequer, he claimed.\n\nListing the reforms, he said, “Discouraging early retirement; linking of pension increase with the Consumer Price Index (CPI); after the death of the life partner, the family pension period will be limited to ten years; abolishing of more than one pension; choosing any one of the two — pension or salary in case of re-employment after retirement.”\n\nMr Aurangzeb noted that there was a proposal to impose 5 per cent tax on pensioners below 70, who were drawing over Rs10 million yearly pension. However, there would be no tax on low-to-medium income pension-earners, he added.\n\nBefore the budget, Prime Minister Shehbaz Sharif presided over the federal cabinet meeting and said that during the last one-and-a-quarter year, the nation faced a hard situation and challenges, but steering the country out of the quagmire was no ordinary achievement.\n\n“The common man and the salaried class gave sacrifices,” the prime minister said, adding that the salaried class was asking the question that they had contributed about Rs400 billion to the national exchequer in the form of taxes and how much the wealthy and opulent had given?\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:53:15.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916441/budget-grants-10pc-pay-raise-7pc-pension-increase-for-govt-employees",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T00:00:53.000Z"
}
