{
  "title": "Tax relief for property buyers, but not for sellers - Business - DAWN.COM",
  "author": null,
  "content": "• Disappointed industry players term decision shocking\n• Say curbs on non-filers will further slow real estate activities\n\nLAHORE: The government has finally announced tax relief for the real estate sector by reducing various taxes on property transactions.\n\nIn his budget speech, Finance Minister Muhammad Aurangzeb on Tuesday announced a reduction in withholding tax for various property purchasers’ slabs from 4 per cent to 2.5; 3.5 to 2pc; and 3 to 1.5pc.\n\nThe minister also announced the abolition of 7pc Federal Excise Duty (FED) on property transactions. Similarly, the stamp duty on property transactions in Islamabad has also been reduced to 1pc from 4pc.\n\nAccording to budget documents, the tax relief has been divided into three categories: property transactions worth up to Rs50m, up to Rs100m and over Rs100m.\n\nOn the other hand, the tax has been increased for sellers from 3pc to 4.5pc on property valuing up to Rs50m, 5pc on transactions from Rs50 to Rs100m and 5.5pc on deals worth over Rs100m. The tax credit for houses up to 10 marlas and apartments up to 2,000 sq ft has also been announced. There is also a proposal in the budget that non-filers will not be able to buy property, vehicles, or open bank accounts.\n\nProperty experts have criticised the tax relief as an inadequate measure to revive the real estate sector, stating that the government should have thoroughly examined the longstanding crisis facing the industry.\n\nThe people, particularly non-filers, have also expressed disappointment, demanding that the government abolish the eligibility criteria under which only filers will be able to buy property from July 1.\n\n“The relief on real estate is very strange. On one hand, the budget proposes reduction in taxes for buyers. But at the same time, the taxes on property sellers have been increased. I am really surprised how, in this way, the government can give a boom to the real estate sector that directly and indirectly links with several industries,” said Akbar Sheikh, a former chairman of the Association of Builders and Developers (ABAD).\n\n“Which kind of relief they (the government) has given? And how they will justify no relief for the sellers. The government must recognise that the transaction of property cannot be completed in the absence of a seller or buyer. Therefore, the relief should have been for both, as in this way, there would be no considerable improvement for the revival of the real estate sector,” Mr Sheikh explained.\n\nAccording to him, the announcement related to the abolition of FED on commercial properties, plots and houses is also vague. “In his budget speech, the sentence on abolishing the 7pc FED starts from commercial property.\n\nHowever, it is unclear whether the duty would be considered abolished for residential plots and houses. Therefore, the government must explain it well,“ he sought, adding that the government must explain its announcement related to tax credits.\n\nTalking to Dawn, Asad Tariq, a realtor and developer, was of the view that having a filer status for buying property would be very damaging to the sector. He was also concerned about submitting the details related to assets along with the income tax return.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:32:17.569Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916465/tax-relief-for-property-buyers-but-not-for-sellers",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T03:35:29.000Z"
}
