{
  "title": "Syria requires women to wear burkinis on public beaches - World - DAWN.COM",
  "author": null,
  "content": "Syria’s government has decreed that women should wear burkinis or other swimwear that covers the body at public beaches and swimming pools, while permitting Western-style beachwear at private clubs and luxury hotels.\n\nThe tourism ministry decision issued this week marks the first time the Damascus authorities have issued guidelines related to what women can wear since Bashar al-Assad was toppled in December.\n\nDuring the Assad family’s iron-fisted rule of Syria, which was shaped by a secular Arab nationalist ideology, the state imposed no such restrictions, though people often dressed modestly at public beaches, reflecting conservative norms.\n\nThe new requirements were set out in a wider decree dated June 9, which included public safety guidelines for beaches and swimming pools ahead of the summer, such as not spending too long in the sun and avoiding jellyfish.\n\nIt said that beachgoers and visitors to public pools should wear “appropriate swimwear that respects public decency and the feelings of different segments of society”, requiring “more modest swimsuits” and specifying “the burkini or swimming clothes that cover the body more”.\n\nWomen should wear a cover or a loose robe over their swimwear when moving between the beach and other areas, it said.\n\nMen should wear a shirt when not swimming, and are not allowed to appear bare-chested “in the public areas outside the swimming areas — hotel lobbies or … restaurants”, it said.\n\nThe decree added that “in public areas outside the beaches and swimming pools”, it was preferable to wear loose clothing that covers the shoulders and knees and to avoid transparent or very tight clothing.\n\nIt offered an exception for hotels classed as four stars or above, and for private beaches, pools and clubs, saying “normal Western swimwear” was generally permitted, “with adherence to public morals and within the limits of public taste”.\n\nSince rebels overthrew Assad, fliers have appeared urging women to cover up, but the government has issued no directives ordering them to observe conservative dress codes.\n\nA temporary constitution passed earlier this year strengthened the language on the role of Sharia in Syria.\n\nInterim President Ahmed al-Sharaa, who led an al Qaeda group before cutting ties with the jihadist network, has sidestepped interviewers’ questions on whether he thought Syria should apply Sharia, saying this was for experts to decide.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:52:32.697Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916526/syria-requires-women-to-wear-burkinis-on-public-beaches",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T14:00:04.000Z"
}
