{
  "title": "Petrolheads in for a price shock - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The auto sector appears unsatisfied over the budgetary measures for fiscal year 2025-26, especially towards the increase in general sales tax (GST) on small cars to 18 per cent from 12.5pc while the GST on hybrid and plug-in hybrid vehicles has also been raised to 18pc from 8.5pc. Both these measures are expected to propel vehicle prices by Rs138,000 to Rs1.4 million.\n\nThe government’s proposed GST increase on automobiles below 850cc may prove negative for small car manufacturers like Pak Suzuki Motor Company Limited, which rolls out its iconic Alto 660cc.\n\nDirector General of the Pakistan Automotive Ma­­nufacturers Association, Abdul Waheed Khan told Dawn that the government has brought tariff reform measures as outlined in the National Tariff Policy, including the introduction of four new tariff slabs: 0pc, 5pc, 10pc, and 15pc. These new slabs have been proposed on major tariff lines in the Pakistan Customs Tariff (PCT). However, these do not apply to Chapter 87 of the Pakistan Customs Tariff relating to automobiles.\n\nThe maximum rate of regulatory duty (RD) has been reduced from 90pc to 50pc. RD has been removed from 554 PCT codes, and the rate of RD on goods under 559 PCT codes has been reduced, he said.\n\nAuto industry experts label increasing sales tax on under 850cc vehicles ‘misguided’ and ‘counterproductive’\n\nThe rate of additional customs duty (ACD) has also been reduced on several tariff lines. Both RD and ACD are set to be phased out by 2030, he further explained.\n\nSimilarly, the 8.5pc existing sales tax on hybrid electric vehicles has been raised to 18pc. A new act for new energy vehicles has been introduced, under which the local manufacture and the import of internal combustion vehicles will be subject to a new levy. The rates of this new levy are 1pc for vehicles up to 1,300cc, 2pc for vehicles up to 1,800cc and 3pc for vehicles exceeding 1,800cc.\n\nAuto sector expert Mashood Ali Khan said the finance minister’s speech closely mirrors the International Monetary Fund’s recommendations. The downward trend in ACD, RD, and customs duty will likely hit local manufacturing instead of exports in the future.\n\n“I foresee severe consequences for our local manufacturing industry. Without a thriving domestic industry, our import bill will surge, and foreign reserves will take a hit,” he cautioned.\n\nFurthermore, it’s unclear how exports will increase without a robust local industry. He urged the finance minister to revisit the budget before seeking approval from the National Assembly. Without a supportive industrialisation policy, local manufacturing will struggle, and exports will suffer.\n\n“The current plan seems misguided, as the middle class can’t afford new cars. Increasing sales tax on small cars, especially those below 850cc, is counterproductive.”\n\nMr Ali asked the government to reduce GST and other taxes on small cars, making them more affordable and boosting demand. This would not only stimulate local auto parts manufacturing but also pave the way for exporting small cars from Pakistan in the future, he added.\n\nWhile the government rightly recognises climate change as an existential threat — introducing carbon and new energy vehicle levies to support climate action — the proposed increase in GST on hybrid and plug-in hybrid vehicles sends conflicting signals.\n\nThe government has not considered any measures on “old vehicle scrapping policy” to phase out vehicles over 10 years old, nor has it imposed additional taxes on diesel-powered vehicles despite their significant contribution to the smog issue.\n\nMoreover, President of the All Pakistan Motor Dealers Association, H.M. Shahzad, said he was hopeful for the increase in the age limit of used cars from three to five years from but unfortunately, the budget remained silent on that front.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:52:44.678Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916458/petrolheads-in-for-a-price-shock",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T03:27:41.000Z"
}
