{
  "title": "Budget 2025-26: Opposition fails to rattle Aurangzeb - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Fol­low­ing their past tradition, the opposition PTI me­­mbers on Tuesday lodged a noisy protest in the Na­­ti­onal Assembly, but failed to deter Finance Minister Muhammad Aurangzeb from delivering the bud­get speech.\n\nThe opposition benchers continued their noisy protest by chanting slog­a­­ns and desk-thumping with the budget books throughout over 100-minute spe­ech of the finance minister whereas some ruling PML-N MNAs, in­­­cl­uding Anjum Aqeel Khan, Malik Abrar and Keso Mal Khealdas, made a human shield around Prime Minister Shehbaz Sharif to prevent protesters from coming close to him.\n\nThe members belonging to the ruling coalition parties were already present in the House when the sitting began 30 minutes behind the scheduled time of 5pm, whereas the opposition members, carrying placards and portraits of their incarcerated leader Imran Khan, started entering the asse­mbly hall during the recitation of the Holy Quran.\n\nThe absence of Pasht­oonkhwa Milli Awami Par­ty (PkMAP) President Me­­hmood Khan Achakzai and Jamiat Ulema-i-Islam (JUI-F) chief Maulana Fazlur Rehman was conspicuous.\n\nPTI lawmakers chant slogans, thump their desks during finance minister’s speech; Achakzai, Fazl conspicuous by their absence\n\nAs soon as Speaker Ayaz Sadiq gave floor to the finance minister to deliver the budget speech, the opposition members started their noisy protest making it impossible for those sitting in the galleries to hear it. After remaining on their seats for some 30 minutes and failing to create any difficulties for the confident-looking finance minister, the opposition members started gathering in front of the speaker’s dais and continued shouting till completion of the budget speech. Some of the opposition members even kept on blowing whistles throughout the speech.\n\nJamshed Dasti, Zartaj Gul and Muhammad Iqbal Khan were found to be most active protesters. Some of the opposition members, including Faisal Amin Ga­­ndapur, were seen making videos of the protest from their mobile phones. Many opposition members tore apart the copies of the budget documents and tossed them in the air.\n\nThe finance minister, however, remained steadfast in delivering his spe­ech and while concluding, he invited the opposition to join the government’s hand in strengthening the country’s economy.\n\nBefore the start of the NA sitting, the speaker presided over a meeting of the Business Advisory Committee to finalise a schedule and business to be transacted during the budget session.\n\nAccording to the appro­ved schedule, the House will remain in recess on Wednesday (today) and Thu­­rsday and the budget debate will commence on Friday (June 13). The deb­ate will conclude on June 21 and the budget will be taken up for approval by the House on June 26.\n\nLater, Mr Aurangzeb laid the Finance Bill, before the Senate, amid a similar noisy protest by opposition lawmakers.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6848c075dd4b6.jpg",
  "retrievedAt": "2025-10-12T03:32:03.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916430/budget-2025-26-opposition-fails-to-rattle-aurangzeb",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T00:01:04.000Z"
}
