{
  "title": "Budget highlights alarming youth unemployment and skills gap - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Unemployment stands at 6.3pc, with youth aged 15-35 being the most affected group\n• There is a major gap between available jobs and skills of jobseekers\n\nISLAMABAD: Pakistan faces a significant unemployment challenge at 6.3 per cent, particularly impacting the youth aged 15-35, according to budget 2025-26.\n\nUnemployment remains a complex issue and youth joblessness is particularly alarming, with 44.9pc of jobseekers aged 15–24, and female unemployment far exceeding male, the budget document says.\n\nPakistan, having a substantial domestic labour force of 71.8 million, holds the sixth largest workforce globally. Each year, approximately 2m young Pakistanis join the labour market, contributing to an expanding talent pool. There is a significant gap between the demand and supply of workers, especially, a serious mismatch between the jobs demanded and the supply of skills and trained manpower in the country. Pakistan’s labour market faces significant challenges, particularly concerning youth unemployment, gender disparities, and the need for skill development.\n\nThese trends are exacerbated by a mismatch between educational outcomes and labour market needs, especially in rural and underserved regions. It also reflects deep-rooted issues such as limited access to quality education, insufficient job creation, and gender inequality in economic participation.\n\nPakistan is a country of 241.5m population (Population Census 2023) with annual growth rate of 2.55pc echoes demographic expansion which may increase unemployment rate further. Pakistan’s population is characterised by a high proportion of youth, presenting both opportunities and challenges for its future. The latest labour force survey shows that the total youth population (15-29 years) is close to 62.58m (26pc) population. Additionally, 40pc of the population falls in the age group between 0-14 years, implying that the youth population will continue to rise. The Pakistan Demographic (2020) reports that by 2030 out of a total estimated population of 280m, 100m will be youth.\n\nThe budget document says that around 0.8m semi-skilled, skilled and highly skilled Pakistanis proceed abroad for employment annually.\n\nThe government has launched several initiatives to tackle these issues, including commitments to continued fiscal consolidation under the new IMF programme, planned privatisations of state-owned enterprises (SOEs), reforms of power distribution companies, and an accelerated business regulatory reform agenda.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:31:29.564Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916433/budget-highlights-alarming-youth-unemployment-and-skills-gap",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T00:00:59.000Z"
}
