{
  "title": "New taxes to make online shopping costlier - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The government has introduced new taxes on local and foreign e-commerce marketplaces, making online shopping costlier for Pakistani customers.\n\nMoreover, the Finance Bill has proposed a tax on social media advertising in Pakistan by foreign e-commerce platforms.\n\nThe bill has proposed amendments to the Income Tax Ordinance, 2001 to add the definitions of e-commerce platforms and “digitally delivered services”.\n\nUnder the proposed amendments, e-commerce would include the “sale or purchase of goods and services” through “websites, mobile applications or online marketplaces”.\n\nIn a consequential move, govt looks to tax foreign companies for selling goods, running ads in Pakistan\n\nMeanwhile, digitally delivered services would include music, audio and video streaming services, cloud services, online software applications, telemedicine, e-learning, and online banking etc.\n\nAs per the proposal, local e-commerce companies will have to pay a tax on every purchase made from their platforms within Pakistan.\n\nFor digital payments, a tax rate of 1pc will be charged on payments not exceeding Rs10,000.\n\nFor payments between Rs10,000 and Rs20,000, the tax would be 2pc of the gross amount and 0.25pc for over Rs20,000.\n\nIf a customer pays for electronic items through cash-on-delivery payments, they will be charged 0.25pc of the gross amount as tax. For clothing items, the rate would be 2pc and 1pc for every other item.\n\nThe tax on digital payments will be charged by payment gateways when processing the transactions.\n\nIn case of cash on delivery, courier services will collect the amount, inclusive of tax, from customers. As per the law, courier services would include logistics companies, ride-hailing and food delivery platforms and delivery services provided by e-commerce platforms.\n\nNew rules for sellers\n\nThe bill has also proposed tightening the regulations for online vendors to bring them into the tax net.\n\n“Every online marketplace or courier service … shall not allow any vendor to use its platform services to carry out e-commerce transactions unless such vendors have been registered under the Sales Tax Act, 1990 (VII of 1990) and this Ordinance.”\n\nThe provision essentially means that shopkeepers not registered under the Sales Tax Act will not be allowed to sell their goods on online stores.\n\nForeign vendors\n\nThe government has also introduced new taxes on goods purchased online from outside Pakistan.\n\nThe new measures, announced by Federal Minister Muhammad Aurangzeb in his budget speech, included the promulgation of a new law titled the Digital Presence Proceeds Tax Act, 2025.\n\nIt aims to bring online marketplaces that sell to Pakistani customers but have little to no physical presence in the country.\n\nUnder section 3 of the proposed law, every foreign vendor with a “significant digital presence in Pakistan” will be charged a tax on goods sold online from outside Pakistan.\n\nTypically, these vendors include online marketplaces such as AliExpress, Temu, and Amazon, among others.\n\nUnder the proposed law, customers would be charged 5pc of the amount paid to the vendor for the purchase of goods from a foreign marketplace.\n\nThe tax would be collected by banks, financial institutions, or payment gateways that facilitate transactions between customers and the online marketplace.\n\nCustoms have been empowered to ensure that goods purchased online from foreign marketplaces are not delivered to customers unless the courier companies provide evidence of tax payment.\n\nForeign marketplaces will not only have to pay taxes for goods sold to Pakistani customers, but they will also be charged for social media ads run in the country.\n\nAs per the proposed law, every foreign vendor who pays “social media platforms or any other online platform for online advertisement in Pakistan” will pay 5pc of the amount paid to social media platforms.\n\nAs per the law, payment intermediaries and social media platforms will file quarterly statements on tax deducted and deposited into the government exchequer.\n\nFailure to submit these reports would result in penalties of Rs1 million every quarter.\n\nPublished in Dawn, June 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6848c1ef7069c.jpg",
  "retrievedAt": "2025-10-12T03:32:22.114Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916435/new-taxes-to-make-online-shopping-costlier",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T00:00:59.000Z"
}
