{
  "title": "Finance Bill 2024: Senate proposes 128 recommendations to National Assembly",
  "link": "https://www.app.com.pk/national/finance-bill-2024-senate-proposes-128-recommendations-to-national-assembly/",
  "date_published": "2024-06-24T14:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP): The Senate on Monday proposed a total of 128 recommendations including nine about the public sector development programme (PSDP) for year 2024-25 to the National Assembly for inclusion in the Finance Bill 2024.\nThe recommendations on the Finance Bill, 2024 would be forwarded to National Assembly which would decide whether or not these recommendations are to be incorporated into the Money Bill.\nOut of total 128, some 69 were related to general recommendations on budget 2024-25, eight in Custom Act, 1969, 23 in Sales Tax Act, 1990, 15 in Income Tax Ordinance, 2001, three in the Federal Excise Act, 2005 and one in Abandoned Properties.\nChairman of the Senate Standing Committee on Finance Saleem Mandviwala presented the Senate’s budget recommendations which were adopted by the House.\nEarlier speaking at the floor of the House, Saleem Mandviwala said that they were given six days instead of 14 to go through the budget document and prepared recommendations for the lower house of the Parliament.\nHe said that some 32 associations, chambers of commerce from all provinces and members of the civil society including education, medical, retail, automotive and others met the finance committee and gave their feedbacks.\nHe went on to say that out of the total Rs 18.9 trillion budget, some Rs 9.75 trillion were to be paid in interest and debt repayments while Rs 2.63 trillion to be borrowed to make up the budget deficit.\nHe said that 2.9 million non filers were left at large by the authorizes who should be brought into the tax net to increase revenue instead of burdening the poor masses.\nHe said the committee unanimously rejected increased tax on low tiered salaried class and also the one imposed on baby milk.\nHe said for the first time persons with disabilities who served in public departments came to the forum and presented their grievances. They Disabled persons claimed that they were ignored in the budgets passed in the past decade, he said.\nHe said the committee proposed the government to allocate special allowance, negotiate with them and listen to their problems. Charity hospitals should be given incentives and those charging fee to the masses should be taxed, he added.\nHe said for the first time taxes were imposed on school children books and stationery items where as general Public and stakeholders demanded to abolish and the committee also supported their demand.\nMandivalla urged the entire house to quit politics on Pakistan’s economy. “\nIf this practice continues then the next budget would be the worst,” he said. He said that all the political parties have to sign a genuine charter of economy on the pattern of charter of democracy signed by the political leaderships to protect democracy from derailment.\nThe Senate recommended to the National Assembly that the minimum wages that has been raised to Rs 37,000 must be brought Rs 45,000, disabled persons should be given an extra allowance equivalent to 100 % of their basic pay, measures be taken to broaden the tax base and reduce the tax load on the salaried class.\nThe Senate also recommended that 10% GST imposed on newsprint imports should be withdrawn and revive the zero-rated status for the print industry, sales tax imposition on poultry feed should be withdrawn as it would increase the prices of poultry products resulting affecting the consumers. It has also been proposed that the increase in petroleum levy on petroleum product should be withdrawn.\nFor documentation of the economy, it has also been recommended that credit/debit card transaction should be made mandatory on purchase above Rs 35,000/. A uniform rate of sales tax should be imposed on the parts related to solar industry whether imported or produced locally.\nIt has also been proposed that 1.3 trillion increase in general sales collection/GST which is expected to increase by 36 % to Rs 4.9 trillion next year should be withdrawn. The Senate also recommended that Rs 7,458 billion under the head of indirect taxes including sales tax, excise duty, custom duty and service tax should be reduced by 50 percent in order to lower the prices of essential goods and food items for poor persons.\nIt has also been recommended that Rs 5,512 billion under the head of direct taxes must be increased through broadening the tax net and inclusion of big industries such as sugar, cement, tobacco, fertilizers, power sector entities and big business chains under the direct tax net.\nThe senate proposed that instead of imposing concession of custom duties on import of Electric vehicles having value above $ 50,000, the same concession should be given on import of vehicles of 600cc.\nIt also proposed that zero rated exemptions should be continued in the sector such as pharmaceuticals, books and newspapers, agriculture produce and medical supplies as they were exempted from any application of sales tax.\nFor reduction of government expenditures, the Senate recommended that capacity payments of around Rs 2.1 trillion to IPPs for 2024 should be done away through renegotiating the IPPs agreements. It has also been recommended that persons, sectors and entities involved in Tax Evasion of approximately Rs 5.8 trillion annually, which constitutes about 6.9% of the country’s Gross Domestic Product (GDP) should be brought under the tax net.\nFor saving of huge revenue every year, the Senate also proposed a complete ban be imposed on smuggling of goods. It has also further proposed that to facilitate charitable hospitals the GST exemption for medical equipment, medicines, intra Ocular Lens used in Cataract surgery and other medical devices should be revived.\nFor development of Balochistan, the Senate recommended that the new development programs, youth development programs, scholarships and schemes for youth and students of Balochistan besides announcing development schemes for the province.\nFor addressing power shortage in Balochistan, it has been proposed that funds be allocated for energy projects in the province including LPG plants.\nThe Senate also recommended that exemption of local supplies made in region of FATA/PATA in line with Income Tax Ordinance, 2001 should be reinstated till June 30, 2025 and rate of sales tax on imported supplies in FATA/PATA should also be reduced to 3 % till June 30, 2025 and 6% from July 1, 2025 to June 30, 2026.\nIt has also been proposed that residents of erstwhile FATA and PATA should be provided exemption from advance tax applicable on distribution, dealers and wholesalers.",
  "retrievedAt": "2025-08-11T03:25:53.939Z"
}
