{
  "title": "ICT admin cracks down on dengue breeding sites, arrests 16",
  "link": "https://www.app.com.pk/national/ict-admin-cracks-down-on-dengue-breeding-sites-arrests-16/",
  "date_published": "2024-06-24T13:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP):The Islamabad Capital Territory (ICT) administration has ramped up its anti-dengue efforts with a series of targeted actions across the Federal Capital, detecting dengue larvae at 53 locations and arresting 16 people for violations of dengue Standard Operating Procedures (SOPs).\nOn the directions of Deputy Commissioner (DC) Islamabad, Assistant Commissioners (ACs) have been conducting extensive surveillance and enforcement activities, resulting in multiple arrests, said the spokesman of the ICT administration.\nIn a recent operation, AC City led a team to inspect commercial areas in sector F-7 and arrested four individuals after dengue larvae were found on their premises. These actions reflect a stringent approach towards controlling the mosquito-borne disease.\nMeanwhile, AC Secretariat held a meeting with dengue staff at the Rural Health Center (RHC) in Bhara Kahu to review ongoing surveillance strategies. The session focused on refining plans to effectively monitor and control dengue outbreaks in the area.\nSimilarly, the DC held a review meeting to discuss the status and effectiveness of the current anti-dengue campaign. The meeting included detailed briefings from all Assistant Commissioners, highlighting the comprehensive efforts being made across the city.\nOn the occasion, the DC emphasized the importance of coordinated action in every neighborhood. The campaign, aimed at identifying and eliminating dengue breeding sites, has seen significant enforcement measures.\nIn one operation, nine people were arrested at Gol Market in F-7 for failing to take necessary precautions against dengue. The shop linked to the spread of dengue in this area has been sealed, and legal actions were taken against the responsible shopkeepers. Similarly, in sector F-1, three more arrests were made as part of the anti-dengue efforts.\nDC Islamabad affirmed that stringent actions would continue against those found responsible for the presence and spread of dengue larvae. The ICT administration is determined to curb the spread of the disease through rigorous enforcement and community cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:26:34.997Z"
}
