{
  "title": "PM, Gates visits Emergencies Operations Centre",
  "link": "https://www.app.com.pk/national/pm-gates-visits-emergencies-operations-centre/",
  "date_published": "2024-06-24T15:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP):Prime Minister Muhammad Shehbaz Sharif and Gates Foundation Chairman Bill Gates on Monday visited the National Emergencies Operations Centre (NEOC).\nNational Disaster Management Authority (NDMA) Chairman Lt General Inam Haider Malik gave a comprehensive briefing about the NDMA and NEOC encompassing the pre and post-disaster mechanisms that are in place to predict and cope any disaster including both natural catastrophes and human-induced incidents.\nThe prime minister and the Gates Foundation chairman visited different sections of the NEOC whereby experts briefed them about the operations of the organization.\nBill Gates appreciated the state of the art facilities at NEOC and underscored the importance of predictions of disasters to mitigate the losses and to expedite reconstruction and rehabilitation in the aftermath.\nHe also appreciated the efforts of the current government in prioritizing the important area as climate change was adversely affecting the vulnerable countries as happened in Pakistan during the floods of 2022.\nAfterwards, an interactive session including the prime minister, Gates Foundation chairman, Federal Minister for Information, Broadcasting and Cultural Heritage Attaullah Tarar, Coordinator to Prime Minister on Climate Change Romina Khursheed Alam, entrepreneurs, climate change activists and experts was held.\nThe session discussed innovative steps and tailor made solutions for Pakistan regarding health, nutrition, gender balance, preventive diseases, climate change, disaster management, climate resilient agriculture and other multiple areas.\nThe meeting concluded with a firm resolve of cooperation between the Gates Foundation and Pakistan to come up with solutions to the issues with mutual cooperation.\nPrime Minister Shehbaz Sharif thanked Bill Gates for his resolve to help Pakistan in multiple areas that would benefit the common man.",
  "retrievedAt": "2025-08-11T03:25:52.755Z"
}
