{
  "title": "Why did PTI members commit suicide by joining SIC?: CJP",
  "link": "https://www.app.com.pk/national/why-did-pti-members-commit-suicide-by-joining-sic-cjp/",
  "date_published": "2024-06-24T17:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP):Chief Justice of Pakistan Qazi Faez Isa on Monday questioned why the Pakistan Thehreek-e-Insaf (PTI) members had committed suicide by joining the Sunni Ittehad Council (SIC), as it was already a political party.\nThe 13-member full court bench presided by the CJP and comprising justices Syed Mansoor Ali Shah, Munib Akhtar, Yahya Afridi, Amin ud Din Khan, Jamal Khan Mandokhail, Muhammad Ali Mazhar, Ayesha Malik, Athar Minallah, Syed Hasan Azhar Rizvi, Shahid Waheed, Irfan Saadat Khan and Naeem Akhtar Afghan, heard the SIC’s appeal with regard to the reserved seats in National Assembly. The proceedings of the case were  live-streamed on the SC’s website and YouTube channel.\nDuring the course of proceedings, the chief justice remarked that even if 90% members in the National Assembly were independent, the reserved seats would be given to the political parties with 10% members.\nAddressing SIC’s lawyer Faisal Saddique, the CJP said that it was an old practice that the political parties had to submit their lists for the reserved seats first and “now you have brought a new system”.\nThe chief justice questioned that why the PTI did not hold intra-party elections despite the requests of Election Commission of Pakistan (ECP) and why 0.85 million PTI members were ignored.\nThe court would only view the matter in accordance with the Constitution, he remarked.\nFaisal Siddiqui said that new system had not been introduced rather a  new issue had come to the fore, which required solution.\nThe chief justice asked the lawyer to explain the bench as per the Constitution that how the reserved seats could be given to the SIC.\nFaisal Siddiqui said that each party should be given reserved seats based on its representation in the assembly after the inclusion of independent candidates.\nAt this, the CJP asked whether the court should ignore the natural meaning of the Constitution.\nJustice Mandokhail questioned that why those who did not bother to contest elections should be given reserved seats.\nAddressing the lawyer, Justice Irfan Saadat Khan said that the words written in the Constitution “will become ineffective with your arguments as  the SIC is not a political party”.\nThe CJP said that the PTI still existed as a political party, and “why did you commit suicide by joining another party which goes against your arguments”.\nThe independent members could have joined the PTI, he added.\nJustice Mansoor Ali Shah said that the PTI had taken many wrong decisions during the elections and repeated its mistakes.\nFaisal Saddique Advocate concluded their arguments.\nKanwal Shauzeb’s lawyer Salman Akram Raja said that an independent candidate could join the assembly at any time during the prescribed period, and then join a party even after three days.\nThe chief justice said that the people should know who are the candidates and what are the political parties.\nLater, the court adjourned the case till next date.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:25:48.599Z"
}
