{
  "title": "IHCBA supports proposed 27th Amendment - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Amid speculation in legal circles about the government planning to bring 27th Amendment, the Islamabad High Court Bar Association (IHCBA) has endorsed the amendment while calling for broad-based judicial reforms, including the nationwide rotation of judges.\n\nSpeaking at a press conference on Tuesday, IHCBA President Syed Wajid Hussain Gilani stated that the legal fraternity welcomes the 27th Amendment, which follows the precedent set by the 26th Constitution Amendment.\n\nHe stressed the need for strengthening judicial institutions and called for broader structural changes in the judiciary, particularly in Islamabad.\n\n“We fully support those advancing this amendment. The 27th Amendment includes significant constitutional revisions, and we believe our institution — the Islamabad High Court Bar Association — should be strengthened in tandem with it,” said Mr Gilani.\n\nSuggests nationwide rotation of judges to preclude ‘personal relationships’\n\nHighlighting the practice of appointing judges from other provinces to Islamabad, he argued that the system should be reciprocal. “Just as judges have been appointed to Islamabad from other regions, judges from the Islamabad High Court should also be posted to other provinces.”\n\nA major part of the bar association’s demand is the rotation of district judiciary judges, including civil and sessions judges, across the country. Mr Gilani said the current system — where judges are only rotated between Islamabad’s two districts, East and West — is insufficient.\n\n“Islamabad is a small district, and many judges develop close personal relationships within the legal community, which can affect their impartiality. A broader rotation across the country is essential to maintain judicial integrity and performance,” he noted.\n\nHe claimed that lawyers have expressed concerns about limited benefits being enjoyed by a few chambers, while most remain disadvantaged under the current system.\n\nMr Gilani concluded by reiterating the bar association’s support for the 27th Amendment, provided it includes meaningful judicial reforms that promote transparency, impartiality, and fairness in the judicial system.\n\nEarlier, there was a proposal for the transfer of judges from one high court to another in the initial draft of the 26th Amendment.\n\nInitially, an amendment to Article 200 of the Constitution — which pertains to the transfer of high court judges — was proposed in the ‘Constitutional Package’.\n\nAccording to the existing law, the president “may transfer a judge of a High Court to another High Court, but no judge shall be so transferred except with his consent and after consultation by the President with the Chief Justice of Pakistan and the Chief Justices of both High Courts”.\n\nHowever, it was proposed that this article would omit the words “his consent”. Subsequently, the government, in consultation with the chief justice of Pakistan and the chief justices of the borrowing and lending courts, would be able to transfer a judge.\n\nIt may be recalled that initially, a proviso to the said article — added to the Constitution through the 5th Amendment — allowed the president to transfer a judge without his consent or consultation “if such transfer is for a period not exceeding [two years] at a time”.\n\nHowever, the 18th Amendment omitted this provision and made the transfer conditional on the consent of the judge.\n\nThere have been instances in the past where judges were transferred from one high court to another. In February 2008, Justice Sardar Mohammad Aslam of the Lahore High Court was transferred to the Islamabad High Court, while in 2009, Justice M. Bilal Khan of the LHC was transferred to the IHC as its chief justice.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:42:02.978Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915322/ihcba-supports-proposed-27th-amendment",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:15:55.000Z"
}
