{
  "title": "Saudi Arabia using AI and real-time translation to open Haj to the world - World - DAWN.COM",
  "author": null,
  "content": "The world’s largest gathering of people, and perhaps it’s the world’s largest test of communication, takes place in holy sites in Saudi Arabia, where more than two million pilgrims from 180 nations converge for Haj.\n\nWith those pilgrims come hundreds of languages, dialects, and customs, making effective communication profoundly challenging.\n\nAccording to a press release from the Saudi Ministry for Haj and Umrah, the kingdom is “rewriting the rules of communication at Haj”, making broad use of AI translation tools at the core of a pilgrimage built on clarity, access, and spiritual depth.\n\n“One of the most powerful examples came during the Arafat sermon, a central and emotionally resonant moment of Haj,” the press release read. “This year, the sermon was translated in real-time into 35 languages, allowing millions around the world — and every pilgrim on the ground — to hear the message of unity, compassion, and faith in their own tongue”.\n\nAccording to the ministry, the broadcast was enabled by advanced AI systems under the General Authority for the Care of the Two Holy Mosques, exemplifying “how technology and tradition can harmonise to elevate spiritual experience”.\n\n“Translation is not simply a technical feature—it is a spiritual bridge,” the ministry said.\n\nInitiatives like ‘Smart Haj’ and the ‘In their languages’ programmes have allowed Saudi Arabia to ensure multilingual support at nearly every point of the pilgrimage.\n\nPilgrims use the Nusuk App to navigate along their journey in multiple languages. Its AI-powered Personal Assistant delivers real-time voice translation, allowing pilgrims to ask for help, understand procedures and communicate with worshippers and service teams seamlessly, according to the press release.\n\n“Manara, a voice-activated robot, offers religious guidance in 11 languages, answering common questions with clarity and cultural sensitivity,” the ministry added.\n\n“On the ground, field teams use AI-powered devices that understand both speech and images, enabling quick, precise communication in each pilgrim’s native language. These tools don’t just make things easier, they help every pilgrim feel understood, included, and supported in real-time.”\n\nThe ministry said Saudi Arabia’s commitment to inclusive communication also extends to the Holy Quran.\n\n“Translated copies are widely distributed across the Grand Mosque, allowing pilgrims to reflect on sacred verses in their own languages. In these most sacred spaces, worship becomes deeply personal and universally accessible,” it stated.\n\nThe ministry added that in terms of medical emergencies or crowd management, AI-powered translation is proving to be life-saving.\n\n“Instant, accurate communication across dozens of languages is essential to maintaining safety and order during one of the world’s most densely populated religious gatherings,” it said.\n\n“By placing real-time translation at the core of the Hajj experience, Saudi Arabia is creating a global case study for how technology can enhance, not replace, faith,” the press release said.\n\n“What was once a logistical challenge is now an opportunity to deepen spiritual connection. In bridging languages, the kingdom is also bridging hearts. Through thoughtful innovation, Haj is not only more accessible, but it’s more connected, more human, and more spiritually alive than ever before.”\n\nHaj, one of the fundamental pillars of Islam, is performed each year by millions of Muslims worldwide. Pakistan receives one of the highest Haj quotas from Saudi Arabia.\n\nLast month, the Saudi Health Ministry launched a health awareness kit, to promote the health and well-being of Haj pilgrims and last month, the Saudi government announced that its 937 Health Call Centre was offering multilingual support to Haj pilgrims around the clock. Both of these services can be availed in Urdu.\n\nHeader image: Pilgrims make their way to Mina during Haj from Makkah, Saudi Arabia on June 4. — Reuters.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/04205154edd0112.jpg",
  "retrievedAt": "2025-08-20T03:41:41.637Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915413/saudi-arabia-using-ai-and-real-time-translation-to-open-haj-to-the-world",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T16:31:07.000Z"
}
