{
  "title": "Heads roll, over 130 still at large after ‘largest jailbreak’ in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "• IG Prisons removed; DIG Prisons and jail superintendent suspended\n• CM Murad calls incident ‘unacceptable’, regrets jail authorities did not reach out to govt or law enforcement agencies for assistance\n• One prisoner killed, four others injured in melee; officials say prisoners bolted after being let out of barracks following tremors\n\nKARACHI: At least 83 of the 216 inmates — who managed to break out of the Malir District Prison — have been rounded up and teams have been formed to bring in those still at large, police said.\n\nIn the wake of the jailbreak, dubbed as “one of the largest-ever in Pak­istan” by Law Minister Ziaul Hasan Lanjar, Sindh Chief Minister Murad Ali Shah removed the provincial prisons chief and suspended the deputy inspector general of prisons, as well as the superintendent of the chaos-hit penitentiary.\n\nThe jailbreak began just before midnight and continued into the early hours of Tuesday after hundreds of prisoners — spooked by low-intensity quakes — were allowed into the prison courtyard, Home Minister Ziaul Hasan Lanjar later told reporters at the scene.\n\nPolice said the prisoners snatched guns from prison staff and forced open the main gate after a shootout, evading paramilitary soldiers. At least one prisoner was shot dead and two others were injured, said Sindh IGP Ghulam Nabi Memon.\n\nPolice surgeon Dr Summaiya Syed told Dawn the body of one deceased prisoner, along with four other inmates with gunshot injuries and two policemen, were brought to a hospital.\n\nIGP Memon, who visited the jail on Tuesday morning, said that as per his assessment and briefings from jail and police officials, the jail administration brought an estimated 2,000 prisoners out of their barracks for counting shortly after midnight, following low-intensity tremors.\n\n“Most of the prisoners were drug addicts,” he noted. “The addicts’ state of mind is such that they tend to develop mob psychology. Thus, when such an atmosphere was created inside the prison, the prisoners ran by opening the door of the jail,” he elaborated.\n\nThe police chief said FC personnel deployed at the prison resorted to aerial firing to push them back.\n\nSubsequently, law enforcers launched an operation, managing to recapture 78 prisoners.\n\nThe Sindh police head said they are setting up teams to re-arrest the remaining 138 escaped prisoners. “One of the escaped prisoners was brought back to the jail by his mother,” he added.\n\nHe said the Sindh government has decided to set up an inquiry committee to ascertain the circumstances that led to the incident and fix responsibility for it.\n\nHeads roll\n\nIn the wake of the incident, Sindh CM Murad Ali Shah ordered the removal of IG Prisons Qazi Nazir and suspended DIG Prisons Hassan Sehto and Malir Jail Super­intendent Arshad Hussain.\n\nTerming the incident “completely unacceptable”, the chief minister said it demonstrated gross negligence and inefficiency on the part of the prison administration.\n\nPresiding over an emergency meeting at the CM House, the chief minister directed the chief secretary to conduct a thorough investigation of the Malir Jail incident by engaging Commissioner Karachi Hassan Naqvi and Karachi police chief Javed Alam Odho.\n\nHe emphasised that the jail authorities should have immediately contacted the local district administration and law enforcement agencies for assistance. “There appears to be a complete breakdown in communication and preparedness,” he observed.\n\n“Those responsible will be held accountable,” he said, while directing the home secretary to conduct a comprehensive security audit of all prisons across the province.\n\nCM Murad was informed that most of the escaped prisoners were involved in minor offences, and none were facing heinous charges.\n\nThe chief minister appealed to the fugitives to surrender voluntarily. “My request to them (escaped prisoners) would be to surrender, otherwise, their involvement in the jail break incident will amount to terrorism or bigger cases,” he added.\n\nSuperintendent’s account\n\nIn his report, the now-suspended prison superintendent said that prisoners became agitated due to tremors and started raising a commotion and shouting from the barracks just after midnight on Tuesday.\n\nHe claimed that security staff rushed to control the situation and tried to convince the prisoners to remain calm, but many of them instigated their fellow inmates to break down the doors of the barracks at Circle No IV.\n\nThe report claimed that the rushing inmates overpowered him and other security staff and rushed to the main ‘Marri’ (security point) as well as other circles and broke the locks of many barracks in circles No. V and No. II.\n\nThis resulted in hundreds of prisoners rushing the office block, prison hospital and main marri, interview booths, E-Court and other rooms.\n\nThe prisoners also succeeded in entering the main Marri, where they beat the security staff and rushed towards the outer gate of the prison compound around 1:30am.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683f8339eac2f.jpg",
  "retrievedAt": "2025-08-20T03:42:09.459Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915327/heads-roll-over-130-still-at-large-after-largest-jailbreak-in-karachi",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:15:37.000Z"
}
