{
  "title": "Lee Jae-myung rides anti-martial law wave to South Korea’s presidency - World - DAWN.COM",
  "author": null,
  "content": "SEOUL: South Korea’s Democratic Party candidate, Lee Jae-myung, was elected president in Tuesday’s snap election, six months to the day after he evaded military cordons to vote against a shock martial law decree imposed by his ousted predecessor.\n\nLee’s victory stands to usher in a political sea change in Asia’s fourth-largest economy, after the backlash against the martial law brought down Yoon Suk Yeol, the conservative outsider who narrowly beat Lee in the 2022 election.\n\nNearly 80 per cent of South Korea’s 44.39 million eligible voters cast their ballots, the highest turnout for a presidential election in the country since 1997, with Lee terming the polls “judgement day” against Yoon’s martial law and the People Power Party’s failure to distance itself from that decision.\n\nWith more than 99pc of the votes counted, the Democratic Party’s Lee stood at 49.3pc to PPP candidate Kim Moon-soo’s 41.3pc, according to National Election Commission data. A subdued Kim conceded the race and congratulated Lee in brief remarks to reporters.\n\nLee had long been favoured to win, and his supporters erupted in cheers as exit polls by the country’s major broadcasters showed him defeating Kim by wide margins.\n\nIn a brief speech to supporters gathered outside parliament after the polls closed, Lee said he would fulfil the duties of the office and bring unity to the country.\n\n“We can overcome this temporary difficulty with the combined strength of our people, who have great capabilities,” he said.\n\nHe also vowed to revive the economy and seek peace with nuclear-armed North Korea through dialogue and strength.\n\nThe martial law decree and the six months of ensuing turmoil, which saw three different acting presidents and multiple criminal insurrection trials for Yoon and several top officials, marked a stunning political self-destruction for the former leader and effectively handed the presidency to his main rival.\n\nYoon was impeached by the Lee-led parliament, then removed from office by the constitutional court in April, less than three years into his five-year term, triggering the snap election.\n\nLee has accused the PPP of having condoned the martial law attempt by not fighting harder to thwart it.\n\nKim was Yoon’s labour minister when the former president declared martial law on Dec 3.\n\n“I was here on Dec 3 after martial law was declared and Dec 14 when Yoon was impeached,” said Choi Mi-jeong, 55, a science teacher who gathered outside parliament to hear Lee speak. “Now Lee Jae-myung is becoming president. I hope he will become a leader who supports ordinary people, not vested interests, not a small number of riches.”\n\nNeed for change\n\nPark Chan-dae, acting leader of Lee’s Democratic Party, told a TV channel that the projections suggest voters rejected the martial law attempt and are hoping for an improvement in their lives.\n\n“I think people made a fiery judgement against the insurrection regime,” he said. The winner must tackle a host of challenges, including a society deeply scarred by divisions made more obvious since the attempt at military rule.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/04084231bd80b82.jpg",
  "retrievedAt": "2025-10-12T03:25:31.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915307/lee-jae-myung-rides-anti-martial-law-wave-to-south-koreas-presidency",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:16:20.000Z"
}
