{
  "title": "Suspect in Hafizabad double child murder case drowns in canal while fleeing police custody - Pakistan - DAWN.COM",
  "author": null,
  "content": "One of the main suspects of a double child murder case drowned after jumping into a river as he was fleeing custody in Punjab’s Hafizabad district on Wednesday, according to the police.\n\nTwo boys were found dead in a metal trunk of a house after both went missing in Kassoki village of Hafizabad district. Two uncles of one of the deceased boys, and their three accomplices, were among the suspects and police had arrested two of them.\n\nPolice had registered a case against four nominated and two unidentified suspects and started an investigation.\n\nHafizabad Crime Control Department (CCD) Deputy Superintendent of Police Ijaz Ahmed told Dawn.com today that one of the uncles was in CCD custody when the incident occurred. “The suspect drowned and his dead body was later recovered from the canal,” he added.\n\nThe first information report (FIR) of the incident was registered at Hafizabad’s Kasoki Police Station on the complaint of Sub-Inspector Ali Kamran under Section 224 (resistance or obstruction by a person to his lawful apprehension) of the Pakistan Penal Code.\n\n“During an interrogation, the suspect confessed to the crime, saying that he had physically tortured the victims with a wooden bat,” the FIR said, adding that he hid the bat in his living room.\n\nIt added that the police were on their way with the suspect to recover the bat when the vehicle slowed down near a canal near Kariala village after approaching a pothole, where the suspect removed the handcuffs from his right hand. The FIR said the police tried to stop the suspect but he jumped out of the vehicle and ran towards the bushes.\n\nAs the police were chasing after the suspect, they heard a splashing sound, the FIR said and added that the police called on him, but the suspect kept moving forward in the water and disappeared.\n\nLast month, Non-Governmental Organisation (NGO) Sahil’s report revealed that 3,364 child abuse cases were reported from across the country in 2024. The children were most vulnerable to abuse in the age group of 11-15 years, in which more boys than girls were reported.\n\nThe Punjab Home Department recently launched a campaign to raise awareness about the safety of children. The campaign, called ‘Safe Children, Safe Punjab’, was created “to prevent incidents of sexual abuse of minors”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:41:40.725Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915411/suspect-in-hafizabad-double-child-murder-case-drowns-in-canal-while-fleeing-police-custody",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T17:46:04.000Z"
}
