{
  "title": "Ukraine invited to Nato summit in The Hague - World - DAWN.COM",
  "author": null,
  "content": "VILNIUS: Ukraine has been invited to a Nato summit later in June, President Volodymyr Zelensky and the alliance said, after earlier warning it would be a “victory” for Russia if it was not there.\n\nThe heads of Nato states will gather in The Hague, Netherlands, from June 24-26, with Russia’s invasion of Ukraine and US President Donald Trump’s calls for alliance members to ramp up defence spending set to dominate the agenda.\n\n“We were invited to the Nato summit. I think this is important,” Zelensky said Monday after he held a meeting with Nato Secretary General Mark Rutte in Vilnius.\n\nKyiv is seeking to shore up its support from Europe because of uncertainties over vital military aid under Trump.\n\nKyiv claims fresh attack on Crimean bridge\n\nA Nato official confirmed that “that Ukraine will be with us in The Hague”. “We will publish the Nato Summit agenda in due course,” the official said.\n\nLast week Zelensky had said that “if Ukraine is not present at the Nato summit, it will be a victory for Putin, but not over Ukraine, but over Nato.” Zelensky wants Nato to offer security guarantees to Ukraine in the event of a ceasefire or peace deal with Russia — something Moscow has called “unacceptable.” Meanwhile Ukraine’s SBU security service claimed it had hit a pillar of the Crimean bridge linking the annexed peninsula to Russia with an underwater explosive device. The extent of the damage was unclear following a temporary closure to the bridge after the attack.\n\nCeasefire talks\n\nRussia on Tuesday said it was wrong to expect a quick breakthrough in Ukraine talks, a day after Moscow rejected Kyiv’s call for an unconditional ceasefire at negotiations in Istanbul.\n\nThe sides agreed on a large-scale swap of captured soldiers and exchanged their roadmaps to peace, or so-called “memorandums”, at the discussions, which lasted under two hours.\n\nMore than three years into Russia’s offensive — which has killed tens of thousands on both sides and forced millions from their homes in eastern Ukraine — the two sides appear as irreconcilable as ever. “The settlement issue is extremely complex and involves a large number of nuances,” Kremlin spokesman Dmitry Peskov told reporters on Tuesday.\n\n“It would be wrong to expect immediate solutions and breakthroughs,” he added.\n\nMoscow demanded Ukraine pull its troops out of four eastern and southern regions that Moscow claims to have annexed as a precondition to pausing its offensive, according to the document handed to the Ukrainians that was published by Russian state media.\n\nKyiv had pressed for a full and unconditional ceasefire. Russia instead offered a partial truce of two to three days in some areas of the frontline, its top negotiator said after the talks.\n\nPeskov also dismissed the idea of a summit between the presidents of Russia, Ukraine and the United States.\n\n“In the near future, it is unlikely,” Peskov told reporters when asked about the chances of the leaders meeting, adding that such a summit could only happen after Russian and Ukrainian negotiators reach an “agreement”.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:41:58.899Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915304/ukraine-invited-to-nato-summit-in-the-hague",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:16:21.000Z"
}
