{
  "title": "Over 5,000 children treated for foot deformity at Peshawar paraplegic centre - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Speakers on Tuesday called upon parents to contact experts for the clubfoot deformities of children to enable them to grow like normal people as the problem is totally curable.\n\n“We have provided treatment to 5,071 children for congenital clubfoot deformity with the dedication, professionalism and compassionate spirit of the medical and technical teams working in the centre,” CEO of Paraplegic Centre Peshawar Dr Syed Mohammad Ilyas told a World Clubfoot Day function.\n\nHe said the PCP wasn’t only a medical institution but a great mission of humanitarian service, an embodiment of hope.\n\n“Nations that understand their problems and seek lasting solutions progress and PCP is a living example of this very philosophy,” he said.\n\nCEO says more clubfoot clinics being set up\n\nDr Ilyas said the Clubfoot Programme was initiated in 2018 with the support of the International Committee of the Red Cross and later expanded in 2022 through a partnership with the global organization MiracleFeet.\n\nHe said the collaboration not only enhanced the standard of care to international levels but also paved the way for establishing multiple new centres across the country.\n\n“The PCP has developed a comprehensive system, aligned with global standards, for the treatment of children born with clubfoot.”\n\nThe CEO said the highly successful Ponseti Method was employed, which, in most cases, avoided surgical intervention.\n\n“Each child is individually assessed by a team of pediatricians, physiotherapists, orthopedic surgeons and trained staff, while parents receive continuous guidance and education throughout the treatment process,” he said.\n\nDr Ilyas also announced the expansion of services, saying two clubfoot clinics are being established in Gilgit and Bannu with the support of MiracleFeet.\n\nHe said those centres would enable local children to receive timely and quality care without burdening families with the cost and difficulty of long-distance travel.\n\n“Clubfoot clinics under the PCP’s supervision are operating successfully in multiple cities including Peshawar, Abbottabad, Haripur, Swat, Swabi, Islamabad and Azad Jammu and Kashmir. These centres have become a beacon of hope for children suffering from this deformity, offering not just medical treatment but psychological support to families as well,” he said.\n\nDirector (rehabilitation) and programme coordinator Dr Aamir Zaib said the PCP gave equal importance to physical rehabilitation and the emotional and psychological strengthening of both children and their families.\n\nHe said parental training, counseling and consistent follow-up were distinguishing features of the PCP’s clubfoot clinics.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:41:55.118Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915251/over-5000-children-treated-for-foot-deformity-at-peshawar-paraplegic-centre",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:17:04.000Z"
}
