{
  "title": "Have former tribal districts lost more post-merger? - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: As the National Econo­mic Council (NEC) meets on Wednesday (today), tribesmen from the merged ex-tribal districts of Khyber Pakhtunkhwa are asking where they stand in the grander scheme of things.\n\nA common strain of thought is gaining traction among tribesmen, and the same narrative is also being pushed by political parties like JUI-F; that erstwhile Fata has lost much after its merger with KP.\n\nThe region has lost a number of National Assembly seats, representation in the Senate and received only broken promises of bringing the region at par with rest of the country through massive development allocations.\n\nThis feeling, according to government officials, is leading to disillusionment among the people and has the potential to further deteriorate the region’s security situation.\n\nDetails available with Dawn show federal releases for the merged districts have stagnated whereas expenditures have skyrocketed. In 2019-20, the federal government released Rs95.7 billion for merged districts against allocation of Rs151bn, whereas actual expenditure stood at Rs95bn.\n\nThe allocation dropped to Rs121bn in 2020-21 and Rs119bn was released. In 2021-22, Rs131bn was allocated while only Rs109bn was released and expenditure jumped to Rs119.9bn. In the current fiscal, Rs93.7bn has been released against allocation of Rs135bn, whereas Rs127bn has been spent so far.\n\nThe allocation for the current fiscal for merged areas has been projected to be around Rs108bn, but the federal government released Rs44bn only, leaving a gaping hole of Rs42bn in provincial finances.\n\nThis, according to officials, is forcing the province to bridge the gap from its own resources, thus diverting resources meant to be spent on development into payment of salaries and pensions.\n\nThe officials said in the next fiscal regions current budget needs to be increased to Rs119bn to cater to the pay and pension raise. On development side, under the accelerated implementation programme (AIP), the centre has allocated Rs42bn in the current financial year, while only Rs6bn was released.\n\n“Imagine how many roads, water supply schemes, schools, hospitals and importantly police stations, police equipment and weapons we could have if we were given these funds on time,” a senior official said while speaking to Dawn.\n\nSecondly, he added, the AIP includes important projects of main roads / highways of the merged districts, police infrastructure and capacity building, health, urban centers improvement etc. Merged area fund should be above politics as it is the question of our national security, the official said.\n\nRegarding the NFC, the official said that it was constitutional right not a favour. “By delaying the due share of NFC, we are denying constitutional rights to the people of merged areas. What a citizen of Lahore, Peshawar, Kohat, Faisalabad and Quetta is getting from national finances, a citizen of Khyber, Bajaur and South Waziristan is unfortunately deprived of,” he argued.\n\nHe said people of the merged districts should have been given more than their constitutional rights for the sufferings of the last 40 years, which they had faced just because of the international issues and strategic policies. “If we want to win the war against terrorism, we have to win the hearts of people of the merged areas and giving them their due share in the NFC is the right step to start with,” he believed.\n\nAn earlier version of this story erroneously mentioned provincial assembly seats instead of National Assembly. The error is regretted and has been rectified.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:26:13.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915325/have-former-tribal-districts-lost-more-post-merger",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:15:38.000Z"
}
