{
  "title": "Bulls toss PSX to record above 120,400 - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The anno­uncement of strong projections for economic growth and development spending for the upcoming fiscal year propelled the Pakistan Stock Exchange (PSX) to new highs on Tuesday. Renewed value buying across all sectors pushed the benchmark KSE 100 index to an all-time high, closing above 120,400.\n\nBulls maintained a firm grip on the market, propelling the benchmark KSE-100 index to a record close of 120,450.87, with a gain of 1,573 points or 1.32 per cent, supported by renewed investor confidence and an improving macroeconomic outlook.\n\nAccording to Topline Securities, the index surged to an intraday high of 1,816 points as momentum picked up sharply after news broke that the Asian Development Bank (ADB) approved a $800 million loan under Pakistan’s public finance programme — a major vote of confidence in the country’s economic reform trajectory.\n\nAdding further fuel to the rally, the IMF gave its nod to Pakistan’s budget proposals, reinforcing hopes of continued fiscal discipline and policy continuity. Key index movers were Fauji Fertiliser, Habib Bank, Engro Fertiliser, Lucky Cement, and Bank Al-Habib, which collectively added 691 points.\n\nAhsan Mehanti of Arif Habib Corporation attributed the scaling of a new peak to expected budgetary relief for oil refineries, real estate, and agriculture sectors.\n\nThe government has set a GDP growth target of 4.2pc and a Rs880 billion Public Sector Development Programme in the budget 2025-26, which will be announced on June 10.\n\nAli Najib, Deputy Head of Trading at AHL, said the significant breakthrough above the 120,000 mark reflects robust investor confidence and a strong bullish sentiment in the market.\n\nMedia reports regarding the prime minister’s acknowledgement of the IMF’s pre-approval of the upcoming budget further reinforced investor optimism by reducing uncertainty around the fiscal direction.\n\nThe market momentum suggests that the PSX may be poised to test the 125,000 level in the near term. However, a decisive and sustained close above 121,000, a key resistance, is essential to confirm this upward trajectory, Mr Ali observed.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683fc237abb45.jpg",
  "retrievedAt": "2025-08-20T03:41:50.931Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915342/bulls-toss-psx-to-record-above-120400",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T03:50:49.000Z"
}
