{
  "title": "Musk blasts Trump’s mega-bill, days after farewell - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Elon Musk on Tuesday hammered US President Donald Trump’s proposed spending bill as a “disgusting abomination” as tensions between the pair burst into the open following the tech billionaire’s White House exit.\n\nMusk left his role as an official government employee last week, lauded by Trump for spearheading a federal spending cuts programme, but disagreements between the duo have been building.\n\n“This massive, outrageous, pork-filled Congressional spending bill is a disgusting abomination,” Musk posted on X, in by far his most caustic remarks on Trump’s spending plans.\n\n“Shame on those who voted for it: you know you did wrong.” It was not Musk’s first comments on Trump’s so-called “big, beautiful bill” which is set to add $3 million to US deficits over a 10-year horizon, despite deep cuts to health and food aid programmes.\n\nBut Musk’s previous criticism was restrained, with the ex-head of Trump’s Department of Government Efficiency (DOGE) task force offering only that it undermined his cost-cutting efforts.\n\nOn Tuesday he said that the bill — being considered by Congress — would burden “citizens with crushingly unsustainable debt.” The escalation in rhetoric indicated bitter hostilities between the White House and Musk, who donated almost $300 million to Trump’s election campaign but has recently voiced frustrations.\n\n“The president already knows where Elon Musk stood on this bill, it doesn’t change his opinion,” White House Press Secretary Karoline Leavitt told reporters in a rapid response to Musk’s tweet.\n\n“This is one big, beautiful bill, and he’s sticking to it.” As the world’s richest person bowed out of his role as Trump’s cost-cutter-in-chief, their relationship appeared on an even keel as the Republican hailed his fellow billionaire’s “incredible service.”\n\nOnce inseparable\n\nTrump even insisted that Musk was “really not leaving” after a turbulent four months in which the South African born tycoon cut tens of thousands of jobs, shuttered whole agencies and slashed foreign aid. Musk was once almost inseparable from Trump, glued to his side on Air Force One, Marine One, in the White House and at Trump’s Mar-a-Lago resort in Florida.\n\nThe right-wing magnate’s DOGE led an ideologically-driven rampage through the federal government, with its young “tech bros” slashing tens of thousands of jobs.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:25:54.313Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915301/musk-blasts-trumps-mega-bill-days-after-farewell",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:16:21.000Z"
}
