{
  "title": "Gilgit-Baltistan traders block KKH for fifth consecutive day - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Protests draw support from regional political opposition\n• Local businesses face mounting losses as sit-ins in Gulmat Nagar and Sost sever vital commercial links\n\nGILGIT: Local traders protesting import-export policies continued to block the Karakoram Highway (KKH) at Gulmat Nagar for a fifth consecutive day on Tuesday, with a separate demonstration also halting traffic in Sost town near Khunjerab Pass.\n\nThe KKH Hunza-Nagar section remained blocked at two locations, causing difficulties for tourists and passengers amid long queues of vehicles.\n\nProtesters, led by the Pak-China Traders Action Committee, vowed not to call off their sit-in until their demands concerning trade with China and what they termed “exploitative policies” by the Federal Board of Revenue (FBR) are met.\n\nThe committee is an alliance comprising the Gilgit-Baltistan Importers and Exporters Association, the Nagar Chamber of Commerce, and small trade associations from Nagar, Hunza, and Gilgit.\n\nKey demands include the clearance of 240 consignments imported from China, stuck at Sost Dry port for seven months, through an amnesty scheme, and a waiver of all port charges.\n\nThey also seek an exemption for consignments at Sost Dry Port from misdeclaration cases, facilitation of barter trade between Gilgit-Baltistan (GB) and Xinjiang province under a 1985 border agreement, and an exemption for GB residents from sales and income taxes on goods imported from China, citing the region’s disputed status.\n\nThe protest has drawn support from GB political and religious parties, with opposition members in the GB Assembly announcing their solidarity.\n\nJaved Ali Manwa, an opposition member who joined the protest, said, “The demands of protesters are fundamental rights of GB people.”\n\nHe accused the federal government of making “people of this [region] jobless and economically attacked”.\n\nGB opposition leader Kazim Mesum, in a statement, noted “the only land route with China [is] blocked” and urged the federal government to “resolve the demands of the traders before the entire GB people will take to streets”.\n\nProtesters said they initially planned to march towards Sost but were stopped by the administration, compelling them to stage the KKH sit-in.\n\nThey said the federal government is “reluctant to settle the genuine issues of the local people” and warned “the situation will be dangerous if their demands are further delayed”.\n\nProtesters highlighted that GB people “had annexed the region with Pakistan without getting status and rights of constitutional citizens”.\n\nOrganisers of the protest closed the KKH to all traffic except ambulances, disconnecting the road link with China and leaving local passengers and tourists stranded.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/04111331a9d5264.jpg",
  "retrievedAt": "2025-08-20T03:42:01.190Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915319/gilgit-baltistan-traders-block-kkh-for-fifth-consecutive-day",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:15:55.000Z"
}
