{
  "title": "Murder of three children in Nowshera solved, suspect arrested, say police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Nowshera police on Wednesday arrested the prime suspect in the murder of three children last month, with the alleged killer revealed to be the victims’ grandmother, according to a statement issued by Nowshera police.\n\nIn May, a family suffered from health problems after consuming food believed to be contaminated, resulting in the death of three children in Khyber Pakhtunkhwa’s Nowshera district.\n\nNowshera police spokesperson Turk Ali Shah told Dawn.com, “The family had consumed Mithai [sweets] with tea at night, after which their condition deteriorated. Three siblings died after consuming poisonous food. Their mother was in critical condition.”\n\nAccording to Wednesday’s statement, police formed an investigation team to probe the case, which was registered on May 19 upon the complaint of the victim’s father. An inquiry was launched under Section 174 of the Code of Criminal Procedure (CrPC) (police to inquire and report on suicide, etc).\n\n“District Police Chief Abdul Rashid formed an investigative team led by SP (Superintendent of Police) Alamzaib Khan and assigned them the task of ascertaining the facts of the case,” the statement read.\n\nThe team comprised Nowshera Cantt Circle Sub-divisional Police Officer (SDPO) Muqaddam Khan, Azakhel Station House Officer (SHO) Adil Syed and Investigation Officer Naik Zaman Khan.\n\n“The complainant and his wife, while recording their statements under Section 164 of the CrPC (power to record statements and confessions), filed a formal claim against his mother, claiming that due to [a] domestic dispute, she had given his wife and children a poisonous substance, which caused their death,” the statement read.\n\nNowshera police said that the suspect had been arrested and that further investigation was underway.\n\nLast week, a woman turned out to be the killer of her two minor children in the Rangpur locality of Gujrat, Punjab as A-Division police claimed to have resolved a mysterious double murder case.\n\nThe suspect confessed to strangling her five-year-old son and three-year-old daughter to enter into a second marriage with a man.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:41:40.795Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915408/murder-of-three-children-in-nowshera-solved-suspect-arrested-say-police",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T16:00:04.000Z"
}
