{
  "title": "At least 11 die in crowd chaos outside Indian cricket stadium - World - DAWN.COM",
  "author": null,
  "content": "At least 11 people died on Wednesday in a crowd surge outside a cricket stadium in the Indian city of Bengaluru, where fans were celebrating Royal Challengers Bengaluru’s first Indian Premier League title win, authorities said.\n\nThousands of people, some waving the home team’s red flag, lined the streets around the Chinnaswamy Stadium as the team arrived in a bus in the evening, TV channels showed, with some climbing trees and the stadium wall for a better view.\n\nAs the celebration proceeded, some people outside without passes tried to push through gates and there was further trouble between the perimeter and main arena, police said. Images from the scene showed people climbing over others.\n\nAt least 11 people were killed and 47 were injured in the incident, Karnataka state chief minister Siddaramaiah, who uses only one name, told reporters.\n\n“At a time of celebration, this unfortunate event should not have happened. We are saddened by this. The fans that showed up were beyond our expectations,” he said.\n\nOne policeman carried an injured spectator to an ambulance, while people gathered around another lying seemingly unconscious on the ground. Visuals also showed some people receiving CPR.\n\nPolice started caning people at one gate, leading to more chaos, said Mithun Singh, a software engineer among the crowd.\n\nNaseer Ahmed, political secretary for the Karnataka chief minister, told broadcaster NDTV the crowd became uncontrollable and authorities were unable to make proper arrangements.\n\nThe team had given away free passes for the event through its website, but also warned that numbers would be limited.\n\nBengaluru Metro stopped services near the stadium, where the ceremony continued despite the turmoil outside.\n\nStampedes and other accidents are not uncommon when large crowds gather in India, including during religious events.\n\nAt least 30 people were killed in a stampede at the Maha Kumbh Hindu festival in January, as tens of millions gathered to take a dip in sacred waters on its most auspicious day.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/042154074d8c18e.jpg",
  "retrievedAt": "2025-08-20T03:41:43.287Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915397/at-least-11-die-in-crowd-chaos-outside-indian-cricket-stadium",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T12:41:26.000Z"
}
