{
  "title": "Agricultural solarisation bill sails through Balochistan Assembly - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan Assembly on Tuesday adopted the Agricultural Solarisation and Electricity Theft Prevention Bill amid opposition by the leader of opposition who demanded its further review from the standing committee.\n\nParliamentary Secretary Nawabzada Zain Khan Magsi moved the bill during the session presided over by Speaker Abdul Khaliq Achakzai.\n\nDespite opposition’s resistance, the bill passed by a majority vote, which aims to switch the agricultural tube wells to solar power and impose strict penalties to curb electricity theft.\n\nOn the occasion, opposition leader Younis Zehri demanded that the bill be referred back to the standing committee for further review, but his request was overruled. He argued that while the opposition does not demand free electricity, proper metering should be ensured before disconnections are made.\n\nMr Zehri also criticised the Quetta Electric Supply Company (Qesco), calling it a “white elephant” for its inefficiency to address public grievances.\n\nHowever, Chief Minister Mir Sarfraz Bugti supported the bill with amendments and proposed a fine of up to Rs2 million on owner of land for illegally reconnecting power after disconnection.\n\nHe said that the federal government had provided Rs52bn for the solarisation of agriculture tube wells in the province which was a long standing demand of the land owners (Zamindars) of Balochistan. He said that 80 per cent land owners were provided funds for the solarisation of agriculture tube wells while the remaining will get funds soon.\n\nThe chief minister said that he had promised to the federal government that illegal tube well connections would not be allowed in the province.\n\nPublished in Dawn, June 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:25:57.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915310/agricultural-solarisation-bill-sails-through-balochistan-assembly",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T02:15:56.000Z"
}
