{
  "article_id": "2025-08-11_2db9e9333d78c9440e1a771d39d73337",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/27-professional-beggars-arrested-in-capital-crackdown/",
    "retrieved_at": "2025-08-17T20:00:13.653Z"
  },
  "metadata": {
    "title": "27 professional beggars arrested in Capital crackdown",
    "author": null,
    "date_published": "2025-08-11T21:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 426,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 11 (APP):The Islamabad Capital Territory (ICT) administration has intensified its campaign against professional begging in the Federal Capital, arresting 27 individuals during an operation across the city's main roads and markets. According to the spokesman of ICT administration, the authority, in coordination with police, conducted an extensive operation targeting professional beggars operating in different parts of Islamabad. The crackdown covered major commercial areas, markets, and busy intersections. According to officials, the campaign is part of ongoing efforts to address the growing presence of professional beggars in public spaces. The administration has increased monitoring in key locations where begging is frequently reported, including major shopping areas and traffic signals. During the latest operation, 27 individuals identified as professional beggars were taken into custody. They were later shifted to police stations for further legal action under relevant laws. Authorities stated that the detainees were found repeatedly engaging in begging despite previous warnings and actions. Meanwhile, the ICT administration has set up special teams to carry out regular operations across the federal capital. These teams are tasked with patrolling public places, identifying repeat offenders, and preventing the use of children or individuals with disabilities for begging purposes. Officials stressed that such activities are being monitored closely to ensure public spaces remain accessible for residents and visitors. The administration also urged citizens to cooperate by avoiding giving money to beggars, pointing out that such acts often encourage organized networks that exploit vulnerable individuals. Instead, residents are advised to contribute to registered charitable organizations or welfare institutions. This campaign follows multiple similar operations conducted in recent months, during which dozens of professional beggars were arrested and legal proceedings initiated. Officials said the drive will continue without interruption, with a focus on dismantling the networks that manage and profit from begging in the capital. The ICT administration has reiterated its commitment to maintaining law and order in public spaces and ensuring that Islamabad's markets, roads, and recreational areas remain free from organized begging activities. In addition to enforcement measures, the administration has called for public awareness campaigns to highlight the negative impact of professional begging and the exploitation involved. The authorities have warned that anyone found running or supporting organized begging operations will face strict legal action. Surveillance in public places has been increased, and coordination with police stations has been enhanced to ensure quick response during operations. The ICT administration has confirmed that similar operations will be carried out in the coming weeks in different sectors of the city, particularly in areas where complaints about professional begging are frequent.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}