{
  "article_id": "2025-08-11_fd982e91928e6c16bb188f650b18d318",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/chinese-embassy-marks-world-anti-fascist-war-anniversary/",
    "retrieved_at": "2025-08-17T19:58:10.040Z"
  },
  "metadata": {
    "title": "Chinese embassy marks World Anti-Fascist War anniversary",
    "author": null,
    "date_published": "2025-08-12T04:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 291,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 11 (APP): The embassy of the People's Republic of China in Pakistan held a commemorative event on Monday marking the 80th anniversary of the victory of the Chinese People's War of Resistance Against Aggression and the World Anti-Fascist War. The gathering honored the sacrifices and unity that led to the historic triumph in 1945, which remains a cornerstone of global peace and mutual respect. Chinese Ambassador to Pakistan, Jiang Zaidong addressed the ceremony, highlighting the enduring friendship between China and Pakistan and the significance of remembering history to build a peaceful future. \"The victory of the Chinese People's War of Resistance and the World Anti-Fascist War was not only a triumph for China, but also for all peace-loving nations around the globe,\" the ambassador said. \"It reminds us that unity, sacrifice, and cooperation are essential in safeguarding peace and justice.\" The ambassador emphasized that China and Pakistan, bound by deep-rooted ties, continue to support each other in promoting peace, development, and mutual prosperity. He noted that both nations share a vision of building a community with a shared future for mankind, where historical lessons guide present-day cooperation. The ambassador said, \"We need to strengthen our commitment to maintaining peace. We need to defy challenges, and enhance our capability to defend peace.\" Other speakers paid tribute to the martyrs and veterans of the war, and reaffirmed their commitment to promoting friendship and collaboration between the two countries. They expressed warm congratulations on the achievements of Chinese government and commended China's significant historical contributions to the victory of the World Anti-Fascist War. A photo exhibition was also arranged to mark the anniversary showcasing historical moments from the war and the unwavering spirit of the Chinese people during the struggle against aggression.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}