{
  "article_id": "2025-08-11_838af412727210cab9a5a51289129fbe",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/koica-undp-launch-project-to-strengthen-agricultural-productivity-water-supply-in-flood-affected-areas-of-sindh/",
    "retrieved_at": "2025-08-17T19:59:22.603Z"
  },
  "metadata": {
    "title": "KOICA-UNDP launch project to strengthen agricultural productivity, water supply in flood-affected areas of Sindh",
    "author": null,
    "date_published": "2025-08-12T01:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 551,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 11 (APP):The Korea International Cooperation Agency (KOICA) and the United Nations Development Programme (UNDP), in partnership with the Government of Pakistan and the Government of Sindh, launched the project \"Agricultural Productivity and Rural Village Water Supply Enhancement of Flood Damaged Regions in Sindh Province, Pakistan (2025-2029)\" to boost agricultural productivity and water supply in flood-affected areas of Sindh. With a generous contribution of US$8 million from KOICA, the project will benefit nearly 19,000 people, including small-scale farmers and vulnerable households. The initiative seeks to rehabilitate flood-damaged farmland, strengthen agricultural productivity through improved irrigation infrastructure, establish solar-powered community water supply schemes to improve access to safe drinking water, and build the capacity of local farmers, government officials, and water user associations for sustainable agriculture and water management. The launch ceremony, held at the UNDP Country Office in Islamabad on August 7, was attended by senior representatives from KOICA, UNDP, the Economic Affairs Division (EAD), and the Planning and Development (P&D) Department, Government of Sindh. The initiative marks the beginning of a five-year partnership aimed at improving the livelihoods of communities in District Dadu, one of the regions most severely affected by the 2022 floods. Speaking at the ceremony, Dr. Samuel Rizk, Resident Representative of UNDP Pakistan, said: \"This project stands as a testament to our commitment to building forward better by strengthening the resilience of flood-affected communities, restoring agricultural livelihoods, and advancing economic empowerment. Together, we are putting in place solutions that not only restore hope but also enable communities to recover with dignity.\" Je Ho Yeon, KOICA Pakistan Country Director, added: \"KOICA appreciates the close cooperation of the Government of Sindh, the Economic Affairs Division, and UNDP Pakistan. This project was developed in response to the urgent need to restore water infrastructure and agricultural productivity in flood-affected areas of Sindh. We believe that this project will contribute to secure water sources and rehabilitation of land as well as to improve the long-term livelihoods in the project area. We look forward to continued collaboration to bring tangible improvements to the lives of affected communities.\" The launch marks a new chapter in the UNDP-KOICA partnership anchored in shared values of inclusion, sustainability, and local empowerment. Together, both partners remain committed to building a more resilient and equitable future for all. Muhammad Zubair Khan, Deputy Secretary, (UN-DESK), Economic Affairs Division, said, \"The Ministry of Economic Affairs applauds KOICA and UNDP for launching this important project to support flood-affected communities in Sindh. The Ministry reaffirms its commitment to strengthen Pakistan's sustainable development agenda and help vulnerable communities build forward stronger and more resilient in the face of climate challenges.\" Naila Sarfaraz Bhatti, P&D Department, Government of Sindh, welcomed the launch of this crucial initiative and appreciated KOICA and UNDP for supporting flood-affected communities. \"P&D, Government of Sindh, remains committed to facilitating the effective implementation of the project to improve the lives of people in District Dadu, and work toward sustainable and climate-resilient development.\" The project is aligned with Pakistan's Resilient Recovery, Rehabilitation, and Reconstruction Framework (4RF) and contributes to the Sustainable Development Goals (SDGs), particularly SDG 2 (Zero Hunger) and SDG 6 (Clean Water and Sanitation). With strong collaboration across development and government partners, the initiative aims to deliver transformative change and serve as a model for integrated, climate-resilient recovery in post-disaster contexts.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}