{
  "article_id": "2025-08-11_df51f96aa20ebeb57626df375e4db259",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/chinese-envoy-urges-closer-pakistan-china-cooperation-for-regional-peace/",
    "retrieved_at": "2025-08-17T19:58:18.339Z"
  },
  "metadata": {
    "title": "Chinese envoy urges closer Pakistan-China cooperation for regional peace",
    "author": null,
    "date_published": "2025-08-12T04:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 609,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 11 (APP): Chinese Ambassador to Pakistan, Jiang Zaidong has urged both nations to deepen cooperation, advance their shared future vision, and take concrete steps to ensure regional peace and stability. Addressing the symposium on commemorating the 80th anniversary of the victory of the Chinese people's war of resistance against aggression and the world anti-fascist war, the ambassador stressed the need to work together to implement the important consensus reached by leaders of both countries to accelerate the building of a closer China-Pakistan community in the new era through concrete actions. He said that as all-weather strategic cooperative partners and important members of the Global South and the Shanghai Cooperation Organization, China and Pakistan have always understood, trusted, and supported each other in international and regional affairs, jointly upholding the UN-centered international system. He said, \"Together with Pakistan's peace-loving friends, we bear history in mind, to honor all those who laid down their lives, cherish peace, and open up the future, is of profound significance.\" He said, \"More than eighty years ago, the dark clouds of fascism shrouded the globe, threatening human civilization with unprecedented catastrophe.\" He added, the Chinese people, together with the people of the world, defeated fascism with indomitable will and heroic struggle, winning a great victory.\" He said, \"We fought shoulder to shoulder and erected a monument of history. China was the first country to resist fascist aggression, endured the longest fight, and inflicted the heaviest losses.\" He said that the Communist Party of China was the first to raise the banner of national resistance, actively advocated the establishment of the National United Front, and became the backbone of the whole-nation for fighting aggression. He said that after fourteen years of hard fighting, the Chinese people secured a great victory in the war of resistance against aggression, paying a price of 35 million casualties, and achieved the complete victory of the World Anti-Fascist War, which is a historic accomplishment forever engraved on the monument of human progress. He said that in this arduous struggle, Pakistan also made an indelible contribution as the port of Karachi worked around the clock to transship strategic materials for the allies, supporting China's war of resistance. The shared trials and common struggle form a precious memory cherished by the Chinese and Pakistani peoples alike. He said, \"We share a common responsibility to write a new chapter for peace. As a founding member of the United Nations and the first country to sign the UN Charter, China steadfastly practices multilateralism, firmly upholds the authority of the UN, and resolutely follows the path of peaceful development and win-win cooperation.\" He said that committed to safeguarding world peace, the Chinese military has, over the past 35 years, dispatched more than 50,000 peacekeepers to UN operations in over 20 countries and regions to fulfill various peacekeeping tasks. He said that under the guidance of President Xi Jinping, we hold high the banner of building a community with a shared future for humanity, implement the global development initiative, global security initiative, global civilization initiative, promote an equal and orderly multipolar world and universally universally beneficial and inclusive economic globalization, and contribute Chinese wisdom to making global governance fairer and more reasonable. He said that shouldering the responsibility of a major country for common development, China has signed Belt and Road Initiative (BRI) cooperation agreements with more than 150 countries and over 30 international organizations, and provided development assistance to more than 160 countries. He said that in a few weeks, China will solemnly commemorate the 80th anniversary of the victory of the Chinese people's war of resistance against aggression and the world anti-fascist war.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}