{
  "article_id": "2025-08-11_3cbf3d4c852a6b0bb97e94f9bb7deaad",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aseefa-bhutto-parliamentarians-unite-for-stronger-breastfeeding-nutrition-laws/",
    "retrieved_at": "2025-08-17T19:58:33.024Z"
  },
  "metadata": {
    "title": "Aseefa Bhutto, parliamentarians unite for stronger Breastfeeding, Nutrition Laws",
    "author": null,
    "date_published": "2025-08-12T04:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 657,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 11 (APP):First Lady Aseefa Bhutto Zardari, Sindh Health Minister Dr Azra Fazal Pechuho, and parliamentarians from across the political spectrum on Monday signed a landmark joint declaration on gender, breastfeeding, and nutrition in Pakistan, pledging coordinated action to protect child health, empower mothers, and remove systemic barriers to optimal breastfeeding practices. The declaration, endorsed during the Parliamentarian Advocacy Forum on the Prevention, Protection and Support of Breastfeeding - jointly organized by UNICEF and the Women Parliamentary Caucus at the Pakistan Institute for Parliamentary Services (PIPS) - calls for treating breastfeeding as a national investment in health and development, said a press release. First Lady Aseefa Bhutto Zardari, who was elected MNA from NA-207, signed the declaration, signalling strong political support for prioritizing breastfeeding and maternal nutrition nationally. It urged strict enforcement of laws regulating the marketing of breastmilk substitutes, integrating breastfeeding promotion into healthcare systems, improving workplace protections for mothers, and engaging communities to shift harmful cultural norms. Sindh Health Minister Dr Azra Fazal Pechuho, delivering the keynote address, urged parliamentarians from both houses not to allow formula milk to be removed from the jurisdiction of the Drug Regulatory Authority of Pakistan (DRAP), stressing that it is a medicine, not food, and must be regulated accordingly. She highlighted the Sindh Protection and Promotion of Breastfeeding and Young Child Nutrition Act, 2023, saying her government faced enormous pressure from vested interests but did not bow down. \"Even the high court dismissed a petition against this law because the judges understood the importance of breastfeeding,\" she said. Dr Pechuho announced plans to hire lactation counsellors and therapists in Sindh, provide multiple micronutrient supplements to pregnant women, and continue efforts to promote breastfeeding for the health of both infants and mothers. She linked the rise in non-communicable diseases, including heart attacks and strokes, to the absence of mother's milk in early childhood nutrition. UNICEF Representative in Pakistan Pernille Ironside called on federal and provincial lawmakers to replicate Sindh's breastfeeding law nationwide, invest in gender-responsive healthcare systems, and make breastfeeding a national priority. UNICEF Nutrition Chief Anteneh Girma Minas described the event as an important milestone, noting the rare presence of the First Lady at such a policy-focused forum. Presenting key evidence, Prof Jamal Raza, Executive Director of the Sindh Institute of Child Health and Neonatology underscored that Pakistan loses around US$2.8 billion annually due to low breastfeeding rates, with over US$888 million spent each year on breastmilk substitutes. Citing national data, he said exclusive breastfeeding rates stand at just 48.4 percent, far below the World Health Assembly's target of 60 percent by 2030. Formula feeding, he warned, not only exposes infants to infection and malnutrition risks due to poor water quality and over- or under-dilution but also increases long-term health risks such as obesity and cardiovascular disease. He stressed that raising exclusive breastfeeding to 70 percent could save up to 34,000 child lives annually, prevent as many as 2.8 million diarrhoea cases, and save up to US$55 million in healthcare costs. Women Parliamentary Caucus Secretary Dr Shahida Rehmani stressed the importance of breastfeeding for reducing infant mortality and improving maternal health. UNICEF gender specialist Fahmida Khan urged parliamentarians to join hands in promoting breastfeeding as a life-saving intervention, noting that optimal breastfeeding could significantly reduce malnutrition and stunting rates in the country. UNICEF specialists Saba Shuja and Dr. Mazhar Hussain also made a detailed presentation on Pakistan's malnutrition crisis, highlighting the health and economic impacts of low breastfeeding rates and the harmful effects of breastmilk substitutes. The joint declaration signed at the forum commits lawmakers to champion breastfeeding-friendly legislation, ensure enforcement of existing laws, integrate breastfeeding promotion into all levels of the health system, and secure sustainable financing for maternal and child nutrition. Lawmakers from the PPP, PML-N, PTI, JUI-F, and MQM - predominantly women parliamentarians - pledged to work across party lines to protect Pakistan's youngest citizens from the harmful impact of aggressive marketing of breastmilk substitutes.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}