{
  "article_id": "2025-08-11_b3b45b7938fe7aed50cd294873d08dad",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-body-directs-nepra-to-submit-five-year-balance-sheets-of-power-plants-for-roi-review/",
    "retrieved_at": "2025-08-17T19:58:58.071Z"
  },
  "metadata": {
    "title": "Senate body directs NEPRA to submit five-year balance sheets of Power Plants for ROI review",
    "author": null,
    "date_published": "2025-08-12T02:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 644,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 11 (APP):The Senate Standing Committee on Power met here at the Parliament House on Monday under the Chairmanship of Senator Mohsin Aziz. The committee discussed in detail the 207 MW Madyan and 88 MW Gabral hydropower projects, along with other energy initiatives. The Special Assistant to the Chief Minister of Khyber Pakhtunkhwa (KP) on Energy informed that land worth Rs. 5 billion had already been purchased for these projects, and both physical and financial progress had been made. However, the federal government had removed them from the IGCEP project list, said a press release. Federal Minister for Power, Awais Ahmad Leghari, clarified that KP authorities did not fully present the CCI-approved power policy, and citing a single clause without context was misleading. He added that if these projects were included, electricity prices could rise by Rs. 6 per unit by 2034. The Power Division, he said, had removed 8,000 to 10,000 MW worth of projects from the plan - including several CPEC power projects - to protect the public from expensive electricity. The Minister further informed the committee that the government had terminated agreements with five IPPs and renegotiated others, resulting in an estimated saving of Rs. 3.4 trillion over the next four to five years. This year alone, distribution company (DISCO) losses were reduced by Rs 191 billion. He acknowledged the persistent problem of electricity theft but noted that the target for establishing a competitive market had been achieved, freeing the government from mandatory power purchases. The committee also deliberated on captive power plants, costly imported coal and LNG projects, and the tariff structure for the protected category. Chairman Committee called for a review of the protected category policy. Secretary Power Division confirmed that a reassessment is underway and that consumers using up to 200 units are receiving subsidies. The Chairman urged the Federal Minister to introduce multiple slab rates to protect the consumers from a sudden high jump in tariff. Senator Mohsin Aziz urged both the federal and provincial governments to revisit the matter so that these KP projects could be completed, benefiting both the province and the country. The Chair urged the Federal Minister to overlook minor discrepancies and favorably consider inclusion of these projects in IGCEP. The Committee also discussed the matter of Net Hydel Profit (NHP). NEPRA officials stated that NHP is being paid to the provinces; however, Khyber Pakhtunkhwa officials maintained that the amount being paid by NEPRA is very low and continues to pile up. The Committee recommended that NEPRA clear the backlog and pay a substantial portion of the NHP to the provinces every month. The Chair directed that a meeting in this regard may be held and report be sent to the Committee within a week and recommended that at-least 5 billion per month may be paid to KP Government in this account. While discussing the matter of wheeling charges, Federal Minister Awais Leghari stated that NEPRA rules have been amended and subsequently approved by the Cabinet, which removes the standard rate of Rs. 28 and replaces it with a base rate of Rs. 12 and now the proposal is with NEPRA for final approval. Senator Mohsin Aziz highlighted the matter of the return on investment (ROI) of IPPs, stating that the data reveals the ROI for some power projects is as high as 100%, which is unjustifiable at any cost. NEPRA officials explained that the high ROI for these plants was due to dollar-based payments. The Committee recommended that NEPRA officials provide the last five balance sheets of the power plants in the upcoming meeting to review the ROI. In attendance were Senators Rahat Jamali, Manzoor Ahmed, Haji Hidayatullah Khan, Muhammad Aslam Abro, Poonjo Bheel, Ahmed Khan, Danesh Kumar, Mirza Muhammad Afridi, Federal Minister for Power Awais Muhammad Leghari, Secretary for Power Fakhar e Alam and other concerned officials of relevant departments.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}