{
  "article_id": "2025-08-11_bea6891124d713c3182e3e343483afe2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gillani-announces-formation-of-parliamentary-caucus-on-minorities-in-senate/",
    "retrieved_at": "2025-08-17T19:59:14.756Z"
  },
  "metadata": {
    "title": "Gillani announces formation of Parliamentary Caucus on Minorities in Senate",
    "author": null,
    "date_published": "2025-08-12T00:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 341,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 11 (APP): Chairman Senate Syed Yousaf Raza Gillani on Monday announced the formation of a Parliamentary Caucus on Minorities in the upper house. In his message on the occasion of the International Day of Minorities, he said, the caucus will also include members from the National Assembly, nominated by the Speaker of the National Assembly. The Chairman Senate decided to constitute a Parliamentary Caucus after a demand from senators belonging to different minority communities. Gillani said that the welfare and empowerment of women and minorities have always been among his top priorities. He added that, even during his tenure as Prime Minister, he worked to ensure that these groups were integrated into the national development process and given significant representation. Highlighting the contributions of the late Prime Minister Benazir Bhutto, Gillani said she played a pioneering role in advancing the rights and participation of women and minorities in all sectors of life. He added that PPP Chairman Bilawal Bhutto Zardari shares this vision, striving to empower women, promote their inclusion in national institutions, and ensure their leadership roles. Gillani further said that President Asif Ali Zardari is equally committed to safeguarding minority rights and providing them with equal opportunities across all walks of life. The Chairman also mentioned ongoing efforts to increase the quota for women and minorities in government jobs and to allocate four per cent representation for minorities in the Senate. He stressed that giving these groups a stronger voice in decision-making processes will help address long-standing social injustices that have limited their full potential in the past. According to Gillani, the proposed Parliamentary Caucus will actively work to protect, promote, and ensure the representation of minority communities. He said, a special resolution will be tabled in the upcoming Senate session to formally recognise the contributions of minorities to Pakistan's progress and prosperity. Acknowledging the vital role minorities have played in national development, Gillani said that Pakistan is a multicultural country where citizens of every language, faith, and culture contribute to its growth, stability, and interfaith harmony.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}