{
  "title": "Arshad Nadeem pledges to keep shinning, thanks nation for unwavering support",
  "link": "https://www.app.com.pk/national/arshad-nadeem-pledges-to-keep-shinning-thanks-nation-for-unwavering-support-2/",
  "date_published": "2024-08-12T05:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP):Pakistan’s gold medal winner Arshad Nadeem, fresh from his triumphant return from the Paris Olympics Monday has expressed his heartfelt gratitude to the nation, his family, and his fans for their unwavering support and love where he reiterated his commitment to continue working hard and making country proud.\nIn his exclusive Interview with a private news channel,  Arshad acknowledged that his success has brought a sense of responsibility, saying, “I feel a deep sense of responsibility to continue making Pakistan proud. I want to inspire the next generation of athletes to work hard and chase their dreams.”\nWhen asked about his future plans, Arshad revealed that he is already setting his sights on the next Olympics. “I am focused on continuing my training and improving my performance. I want to win more medals for Pakistan and make my country proud again and again.”\nResponding a query, Nadeem said that he sets a new Olympic record of 92.97m to win the men’ s javelin throw gold at the Paris Olympics, adding, India’s Neeraj Chopra won silver whereas Grenada’s Andersen Peters won bronze.\n“Neeraj and I are good friends, but when we stepped onto the javelin throw field, our friendship took a backseat,” Arshad Nadeem said with a smile. “We were no longer just friends, but rivals representing our respective countries. We both knew what was at stake our country’s respect and pride”, he said.\n“Our friendship remains strong, but when it comes to representing our countries, we give it our all,” he added.\nTo another question, Arshad Nadeem also took the opportunity to express his gratitude to WAPDA (Water and Power Development Authority) for their unwavering support.\n“I am not just thankful to WAPDA for providing me with a job and facilities, but also for supporting other national heroes like me,” he said.\n“WAPDA has been a constant source of encouragement and support, allowing us to focus on our training and competitions without worrying about our livelihood.\nTheir contribution to the development of sports in Pakistan is immense, and I am proud to be associated with them,” he mentioned.\nArshad Nadeem’s eyes also lit up with gratitude as he spoke about his mother’s encouragement and family support.   “My mother has been my biggest inspiration and strength,” he said, adding, she always encouraged me to pursue my passion for javelin throw, even when I faced setbacks and injuries. Her unwavering belief in me and my abilities kept me going, and I am forever grateful to her.”\nArshad also praised his family’s support, saying, “My family has been my rock throughout my journey. They have made countless sacrifices to help me achieve my dreams, and I am thankful to each and every one of them, he added.\nArshad Nadeem, basking in the glory of his historic gold medal win, also used the opportunity to urge the government to promote athletes’ talent and provide more facilities.\n“I am grateful for the support I received from the government and sports authorities, but I believe more needs to be done to promote sports in Pakistan,” he said.\n“We have immense talent in our country, but lack of facilities and infrastructure hinders our progress. I request the government to invest in sports infrastructure, provide better training facilities, and support athletes financially so they can focus on their training without worrying about their livelihood.”\nArshad emphasized, If we provide our athletes with the right resources and support, I am confident we can produce more Olympic medalists and make Pakistan proud globally. He also suggested, “The government should establish sports academies, provide scholarships to young athletes, and organize international training camps to help us compete with the best in the world, he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:35:25.493Z"
}
