{
  "title": "IBCC launches National Assessment Workshop for grades IX-XII",
  "link": "https://www.app.com.pk/national/ibcc-launches-national-assessment-workshop-for-grades-ix-xii/",
  "date_published": "2024-08-12T13:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP):The Inter Boards Coordination Commission (IBCC) has launched a two-day consultation workshop on the National Assessment Framework 2024 for grades IX to XII, taking place in Islamabad from August 12 to August 13.\nAccording to the IBCC, the workshop aims to analyze the draft framework, focusing on establishing a cohesive national strategy for assessment and examination systems across the country.\nDr. Ghulam Ali Mallah, Executive Director of IBCC, highlighted the importance of reviewing past efforts and refining the framework for greater effectiveness.\nContributions from the Federal Board of Intermediate and Secondary Education (FBISE), BISE Peshawar, and BISE Abbottabad were acknowledged.\nKey participants include Mr. Abrar Jaffar, Additional Secretary of the Boards and Universities Department Sindh; Muhammad Rizwan Soomro, Project Director of the Sindh Education Improvement Project (SEIP); Dr. Muhammad Luqman, Deputy Project Director of SEIP; Atta Hussain Lakho, Exam Reform Specialist; Fakrharunisa Qamar, Gender Specialist of SSEIP; Muhammad Athar, Additional Director of DCTE Abbottabad; Aftab Khushk, Education Consultant; Narsurallah Khan, Chairman of BISE Peshawar; Muhammad Shafiq Awan, Chairman of BISE Abbottabad; Amir Riaz, Director of Curriculum PCTB, Lahore; Dr. Muhammad Idrees, Director of PIE; Dr. Muhammad Zaigham, Director of PIE; Dr. Shafqat Ali Janjua, Director of NCC; Mirza Ali, Director of FBISE; and Dr. Muhammad Farooq Hasan from BISE SBA.\nParticipants shared best practices and provided feedback to enhance the framework, aiming to implement a unified strategy that meets national educational standards. The IBCC appreciates the active participation of all attendees.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:34:23.512Z"
}
