{
  "title": "Arshad Nadeem’ s success a new chapter for Pakistan sports: DG PSB",
  "link": "https://www.app.com.pk/national/arshad-nadeem-s-success-a-new-chapter-for-pakistan-sports-dg-psb/",
  "date_published": "2024-08-12T07:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP):Deputy Director General of the Pakistan Sports Board (PSB) Muhammad Shahid Islam on Monday warmly congratulated  Arshad Nadeem’ s ground breaking gold medal win, terming it as a “new chapter for Pakistan sports” and reaffirmed the PSB’s unwavering commitment to equipped athletes with resources and support needed to dazzle on the global stage.\nIn an Interview with PTV news channel, PSB DG praised remarkable achievement of Pakistan’s golden boy, Arshad Nadeem and termed his success as a beacon of hope and inspiration for young athletes who clinched the top honour and  inspired our new generation to strive for excellence.\nArshad Nadeem’ s success is a testament to his unwavering commitment and passion for athletics,” Islam said.\n“His down-to-earth nature and humility, despite achieving greatness, is a quality that sets him apart and makes him a role model for our youth,” he added.\nIslam emphasized that Nadeem’ s triumph is not just a personal achievement but a milestone for Pakistani sports, and his legacy will continue to motivate and inspire future generations of athletes to strive for excellence.\nResponding to a query, DG said the Pakistan Sports Board (PSB) is leaving no stone unturned in its efforts to provide top-notch training to athletes.\nAs part of its endeavors, the PSB is arranging for qualified and certified coaches to work with athletes and organizing training sessions in foreign countries to expose them to international standards, he mentioned.\nIslam cited the example of Arshad Nadeem, who was sent to various countries for training, which ultimately contributed to his remarkable success in winning the gold medal at the Paris Olympics.\nThis approach, Islam emphasized, is crucial in helping Pakistani athletes compete and win at the global level, he added.\nTo another query, Director General Muhammad Shahid Islam urged social media activists and users to refrain from spreading propaganda against sports and instead focus on showcasing the soft image of Pakistan at the global level.\nHe emphasized the importance of promoting positivity and highlighting the achievements of Pakistani athletes, who have brought pride and recognition to the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:35:07.810Z"
}
