{
  "title": "Governor, CM Punjab reiterate commitment to public welfare",
  "link": "https://www.app.com.pk/national/governor-cm-punjab-reiterate-commitment-to-public-welfare/",
  "date_published": "2020-01-06T23:11:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 07 (APP):Punjab Governor Chaudhry Mohammad Sarwar and Punjab Chief Minister Sardar Usman Buzdar have reiterated their resolve to put up joint efforts for the welfare of the masses in the province.\nDuring a meeting on the sidelines of the oath-taking ceremony of MPA Sibtain Khan at the Governor’s House here on Tuesday, both the leaders discussed administrative and political matters besides progress and prosperity of the province and provision of basic facilities to the people.\nProvincial Ministers Mian Mehmood-ur-Rasheed, Fayaz-ul-Hassan Chohan, Syed Sumsam Bokhari, Hafiz Mumtaz Ahmed and Dr. Akhtar Malik also called on Punjab Governor Chaudhry Mohammad Sarwar.\nThe Punjab Governor, speaking on the occasion, vowed to continue joint efforts for the people’s welfare as per vision of Prime Minister Imran Khan.\nHe said all political parties were united in the larger national interest and regional security, adding that after passage of the Army Act Amendment Bill from the National Assembly (NA), the bill would also be passed by the Senate. He said the entire nation stood by their Armed Forces and it was a clear and loud message to the country’s enemies that any misadventure by India would get a befitting response from Pakistan.\nSarwar said the armed forces had set new examples of bravery and sacrifice in the war against terrorism.\nGovernor Punjab said PTI government under the leadership of Prime Minister Imran Khan was committed to “One Pakistan: not the two”, adding that revolutionary measures were taken by the government in the health, education, agriculture and other sectors to provide maximum relief to the masses.\nHe said the economy was stable today due to the tangible economic policies and faith of the foreign investors.\nSarwar said federal government’s decision to set aside billions of rupees funds for seven projects for poverty alleviation and improving the water supply system in Southern Punjab was a people-friendly step.\nHe said PTI would provide maximum relief to the people in the Southern Punjab as per its election manifesto.\nGovenror Punjab Chaudhry Mohammad Sarwar said the government would provide clean drinking water to 20 million people by June 2020 under the Punjab Aab-e-Pak Authority.",
  "retrievedAt": "2025-08-11T18:35:24.547Z"
}
