{
  "title": "Punjab CM chairs cabinet meeting, orders payment to sugarcane growers",
  "link": "https://www.app.com.pk/national/punjab-cm-chairs-cabinet-meeting-orders-payment-to-sugarcane-growers/",
  "date_published": "2020-01-06T23:12:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 07 (APP):Punjab Chief Minister Sardar Usman Buzdar on Tuesday directed the officers concerned to ensure full payment to sugarcane growers, saying that exploitation of farmers would not be tolerated at any cost.\nHe was addressing the 23rd Punjab Cabinet meeting at his office here. He said that dysfunctional sugar mills should be made to resume operations by January 10 and agriculture as well as food departments should keep a vigilant eye on the situation.\nHe ordered for constituting a committee for monitoring the situation in future, adding that the cabinet legislative committee should carry out necessary legislation at the earliest. The ministers should monitor the crushing season and administrative officers ensure protection of sugarcane farmers’ rights in their districts, he added.\nThe meeting decided to constitute women hostel authority along with the approval of the appointment of Atif Bajwa as the president of the Bank of Punjab. The meeting also decided to give ex post facto approval to joint investigation teams constituted in the province and authorized cabinet sub-committee for law & order for granting necessary ex post facto approval. This sub-committee would give ex post facto approval of JITs after review and authority would rest with the cabinet sub-committee for law & order to constitute JITs in future.\nThe meeting decided to establish e-rogzar centres in colleges and further decided to abolish superstructure tax for sale deeds in special economic zones and industrial estates.\nApproval of constitution of boards of management for children’s hospital and Institute of Child Health Multan was also granted approval while the agenda item of up-gradation of different posts in the light of recommendations of a committee headed by ACS was deferred.\nThe meeting approved signing of an MoU for plantation in Karole Forest Shahdarah and measurement as well as estimation of trees falling in the way of dualization of motorway link Kohat via Jand, Pindi Ghaib to Khushalgarh (package-I) project. The meeting approved increasing the licence fee for keeping grey and black Francolins along with the approval of amendments in Punjab Urial Conservation, Protection and Trophy Hunting (Committees) Rules, 2016 and inclusion of grizzly Bear in Punjab Wildlife (Protection, Preservation, Conservation & Management) Amendment Act, 2007.\nApproval of amendments to Section 2 (1) (a) (h) (j) of the Punjab Protection of Women Against Violence Act, 2016 was granted and the meeting also decided to empower the deputy commissioners for creating ease of doing businesses by the environment department at the district level.\nThe Punjab cabinet decided to amend the Punjab Local Government (Appointment and Conditions of Service) Rules, 2018 and gave approval to amendments in OGRA Ordinance, 2002 and the draft summary about the formulation of Pakistan Petroleum Exploration and Production Regulatory Authority.\nMinutes of 21st and 22nd meeting of Punjab cabinet were endorsed along with the approval of decisions made in the 20th meeting of cabinet standing committee for finance and development.\nSecretary food gave a briefing about sugarcane crushing season and said that so far 8.4 million matric tons sugarcane has been crushed. Rs 22 billion have been paid to farmers this year while 99 per cent payment was made to sugarcane growers last year.",
  "retrievedAt": "2025-08-11T18:35:21.227Z"
}
