{
  "title": "Punjab govt’s urban forestry drive to make Lahore a ‘city of Gardens’: Malik Amin",
  "link": "https://www.app.com.pk/national/punjab-govts-urban-forestry-drive-to-make-lahore-a-city-of-gardens-malik-amin/",
  "date_published": "2020-01-06T23:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP):Federal Minister and Adviser to Prime Minister of Pakistan for Climate Change, Malik Amin Aslam Tuesday said that the Punjab government under the vision of Prime Minister Imran Khan had been working on a plan to turn Lahore city a ‘city of Gardens’ with urban forest project.\nTalking to private news channel, he said owing to the climate change and air pollution in Punjab province specially in Lahore, the present government is striving hard to increase the green cover and preserve green character of the cities, adding that Punjab government is focusing on planting the indigenous species, especially fruit and flowering trees in Lahore for the enhancement of its beauty.\nHe said that his government’s mission was to transform Lahore into lush green city of the province and in this regard all resources would be utilized.\nMalik Amin said that enhanced plantation and green net would help address the issue at the national level.\nHe said a first Urban Forest of the province was launched recently in Lahore that will be expanded to other parts of the province gradually.\nWe will plant as many species of shade and fruit trees as was possible in the province, he added.\nHe said that Lahore needs to once again become a dream city known for its gardens and fresh air, adding, today gardens in Lahore lies in ruins, if the Mughals were alive, they would be disappointed.\nHe said that short and long-term planning would be devised for the protection of forests in Lahore and other areas of the province.\nBillion tree project announced by PTI government will prove to be a game-changer in the environmental history of the country, he added.\nTalking about a Urban forest project in Lahore , The Lahore Development Authority (LDA) will grow a dense forest in the city for the first time in the history of Pakistan with the help of Miyawaki method.\nThis project will be self-reliance and fertilizer or water will not be needed for the forest, he added.\nUnder the Green Pakistan Programme, the Punjab government has set a target of planting 150 million saplings in the province.\n“It is very important to plant trees to control increasing environmental problems, he said, adding, trees are being planted in every area, according to the land and its weather.\nIn Punjab, urban forestry is being introduced for the first time and under this policy, it will be mandatory to plant trees in open areas of houses, private buildings and plazas, he added.\n“The plantation of trees is not only necessary for a healthy environment, but it is also a good deed,” he said.\nHe emphasized the need for the private sector and individuals to come forward, as it is a great cause and is also an investment for our future generations towards providing them a healthy environment.\nHe said a new Forest between Gurdwara Nankana Sahib to Lahore would also be inaugurated soon.\nDistribution of plants drive would also be launched in Lahore and other areas of the Punjab city soon under the of green & clean Pakistan drive, he said.",
  "retrievedAt": "2025-08-11T18:35:21.098Z"
}
