{
  "title": "Pakistan Hockey Federation making no progress in recovery of lost funds - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Hockey Federation has been unable to recover funds looted in its name as it has shelved its own inquiry which had deducted gross financial irregularities in one of its bank accounts.\n\nFormer PHF president retired Brig Khalid Sajjad Khokhar had in February 2021 formed a fact-finding committee after it had emerged that an illegal account of the PHF was running in Sindh Bank — a record of which was not available in the federation’s books.\n\nOlympian Asif Baja, the PHF secretary at the time, headed the committee and in the report, had recommended the president to take strict action.\n\n“The committee’s findings and opinion firmly establish gross financial irregularities and misuse of authority in management of Sindh Bank Account of PHF,” the report, a copy of which was obtained by Dawn, said.\n\n“The happening is unfortunate as financial damage is caused to PHF in a funds constrained environment. Though funds maintained in Sindh Bank were of donations by various organisations and not the public money/government grants but seriousness of matter is not reduced.\n\n“It therefore warrants strict actions against those involved. I desire to initiate such actions to seek recovery of any loss incurred to PHF from transactions of Sindh Bank account as well implement effective controls to deny such happenings in future.”\n\nThe committee had recommended several actions, namely asking former PHF secretary general Shahbaz Ahmed to produce a record of the bank statement through “his mutual communication with [former PHF finance officer] Adnan Shahid and deposit the unaccounted for amount in the PHF accounts”.\n\nIt also said that in case there was no response, “FIR should be lodged against Adnan Shahid” to ensure the recovery of missing funds. “The amount required to be deposited in PHF accounts be shown as receivables in PHF accounts in consultation with commercial auditors,” the report added. “In case some payments made to PHF officials from Sindh Bank accounts are found to be non-authentic then the officials be asked to credit the said payments in PHF accounts.”\n\nAlthough an FIR was lodged in a local police station, no steps were taken with Khokhar resigning from his post in February last year, handing over the charge to Tariq Hussain Bugti.\n\nBugti had initially vowed to take action against former PHF office-bearers but the PHF has since done little in that regard while the case of embezzlement in PHF’s Sindh Bank account is also being investigated by the FIA.\n\nFormer Olympians Hanif Khan, Khalid Bashir and other had held a news conference some months back where they urged the FIA to take action on the PHF’s financial corruption cases.\n\nMeanwhile, a PHF official told Dawn on the condition of anonymity that there was no record of any report by the Bajwa-led committee.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:02.667Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902392/pakistan-hockey-federation-making-no-progress-in-recovery-of-lost-funds",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:42.000Z"
}
