{
  "title": "Not cricket - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT is getting embarrassing for the Pakistan cricket team, and for the sport as a whole in the country — the lack of professionalism and game awareness laid bare once again.\n\nEven skipper Mohammad Rizwan didn’t shy away from admitting that after his side were whitewashed by a second-string New Zealand in their three-match One-day International series.\n\nIn a series in which Pakistan looked severely out of their depth, New Zealand proved their recent status as the bogey side for Rizwan and his charges. They had punctured Pakistan’s euphoria twice in the tri-nations series, before comprehensively beating them in the opener of the Champions Trophy; the first international event in the country in 29 years, where Rizwan’s men went out without a whimper.\n\nThe series in New Zealand offered a chance for a reset, but once again, Pakistan fell woefully short. It was a no-contest in the end, with the Black Caps winning the three games by 73, 84 and 43 runs, respectively. However, Pakistan had their moments in the series, but they failed to capitalise and ended up losing their grip on the matches; Rizwan admitting his side’s death overs problems are continuing to haunt them. Pakistan had New Zealand on the ropes in the first game of the series, only to concede 344 and then lose the plot when they seemed to be on target in the chase. They never recovered in the second game after having New Zealand at 132-5 at one stage, while the chase never got going in the rain-affected final game on Saturday.\n\nRizwan pointed out that team management and the Pakistan Cricket Board are well aware of the issues but the struggles seem never-ending. It raises questions regarding Pakistan’s evolution in modern-day cricket, with the side only giving glimpses of their promise to change their approach. There was some show of ‘intent’ in the T20 series that preceded the ODIs, but there also Pakistan ended up on the losing end. The loss in New Zealand also likely marks the end of the road for head coach Aaqib Javed, under whom Pakistan recorded ODI series victories against South Africa and Australia but have only gone downhill from there.\n\nIt is evident that the team needs fresher ideas and better execution. The PCB, too, hasn’t helped with the continuous chopping and changing of the team management. Consistency at the top is a prerequisite for consistency on the field, and the PCB has been doing exactly the opposite. It is high time that the PCB sets things right; even if it demands a complete overhaul of the system as Pakistan seem to be at the risk of becoming the also-rans in world cricket.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:47.776Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902444",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:58:37.000Z"
}
