{
  "title": "One of three ex-judges to vote for IHC chief justice appointment - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: One out of three former judges of the Islamabad High Court (IHC) will vote for the next chief justice of Islamabad High Court (IHC).\n\nThe Judicial Commission of Pakistan (JCP) in its meeting scheduled for April 11 will finalise the name of the former judges who will become JCP member to cast vote to select the chief justices of their respective high courts.\n\nNominations for the appointment of chief justices of IHC, Sindh High Court (SHC), Peshawar High Court (PHC) and Balochistan High Court (BHC) will be considered later in a JCP meeting, which is expected to be held on April 18.\n\nFor the provincial high courts there are several choices, but for the IHC these are limited to only three namely ex-CJ Mohammad Anwar Khan Kasi, retired justice Shaukat Aziz Siddiqui and retired justice Noorul Haq N. Qureshi, as others who served at the IHC were incumbent chief justice or Federal Shariat Court Iqbal Hameedur Rehman, Justice Athar Minallah and Justice Aamer Farooq who are serving in the Supreme Court, while retired justice Riaz Ahmed Khan died in August 2021.\n\nJCP will finalise name of its member from among Anwar Khan Kasi, Shaukat Aziz Siddiqui and Noorul Haq Qureshi on 11th\n\nJustice Qureshi formally joined PTI after retirement, Justice Kasi who was facing multiple references in the Supreme Judicial Council is spending time at home, while Justice Siddiqui was reinstated by the apex court in the reference in which he was removed for criticising intelligence agencies’ meddling in the judiciary.\n\nInterestingly, the judges, who vehemently voiced against the meddling last year, practically abandoned Justice Siddiqui in 2018 when he pointed out interference of retired Lt-Gen Faiz Hameed in the affairs of judiciary.\n\nInsiders said that the main contenders were Justice Kasi and Justice Siddiqui, as the government may not vote for Justice Qureshi who is expected to get PTI lawmaker’s vote.\n\nHeaded by the Chief Justice of Pakistan, the JCP included three most senior judges of the SC, federal minister for law and justice, attorney general, a Pakistan Bar Council representative, two senators (one each from opposition and treasury benches), two MNAs (one each from opposition and treasury benches), and a woman or non-Muslim to be nominated by the NA speaker for a term of two years.\n\nAccording to Clause 5 of Article 175-A, for the appointment of a judge of the high court, the JCP composition includes CJ of the high court to which the appointment is being made, head of constitutional bench, provincial law minister, and an advocate having at least 15 years of practice in the high court to be nominated by the respective bar council for a term of two years. In case the head of constitutional benches of a high court is the chief justice of that high court, the judge who is next in seniority shall become JCP member.\n\nIt says if for any reason the CJ of a high court is unavailable, he shall be substituted by an ex-CJ or former judge of that court, to be nominated by the JCP.\n\nHowever, the JCP composition is slightly different for the IHC appointments as it inc­lu­des federal minister nominated by the prime minister instead of the provincial minister.\n\nIn case of appointment of IHC CJ, the JCP will appoint a former IHC judge as member to pick CJ.\n\nOn Feb 13, the law ministry had notified acting chief justices of the four high courts: Justice Sardar Mohammad Sarfraz Dogar for the IHC, Justice Ejaz Swati for the BHC, Jus­tice Junaid Ghaffar for the SHC and Justice S.M. Attique Shah as acting CJ of the PHC.\n\nThe nominees for the regular chief justice of IHC are Justice Dogar, Justice Mohsin Akhtar Kayani and Justice Miangul Hassan Aurangzeb.\n\nFor the BHC, the nominees are Justice Swati, Justice Mohammad Kamran Khan Mulakhail and Rozi Khan Barrech. For the SHC, nominees are justices Ghaffar, Zafar Ahmed Rajput and Mohammad Iqbal Kalhoro. Likewise, the PHC’s nominations included justices Shah, Ijaz Anwar and Arshad Ali.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:23:35.799Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902428/one-of-three-ex-judges-to-vote-for-ihc-chief-justice-appointment",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:26.000Z"
}
