{
  "title": "UN seeks help for Myanmar; quake toll over 3,350 - World - DAWN.COM",
  "author": null,
  "content": "BANGKOK: The United Nations called for the world to rally behind quake-hit Myanmar on Saturday as the death toll rose to 3,354, while a former USAID official said a US aid team had received notice they were losing their jobs after arriving in the disaster zone.\n\nIn addition to those killed by the March 28 earthquake, 4,850 people were injured and another 220 are missing, state media said.\n\nDuring a visit to Myanmar’s second-biggest city, Mandalay, which was near the epicentre of the 7.7 magnitude quake, United Nations aid chief Tom Fletcher appealed for international support.\n\n“The destruction is staggering. Lives lost. Homes destroyed. Livelihoods shattered. But the resilience is incredible,” he said in a post on X. “The world must rally behind the people of Myanmar.”\n\nMyanmar’s neighbours, such as China, India and Southeast Asian nations, are among those that dispatched relief supplies and rescuers to aid the recovery effort in quake-hit areas that are home to about 28 million people over the past week.\n\nThe United States, which was until recently the world’s top humanitarian donor, had pledged at least $9 million to Myanmar to support earthquake-affected communities, but current and former US officials say the dismantling of its foreign aid programme has affected its response.\n\nThree US Agency for International Develop­ment workers who had travelled to Myanmar after the quake were told they were being let go, Marcia Wong, a former senior USAID official, said. “This team is working incredibly hard, focussed on getting humanitarian aid to those in need. To get news of your imminent termination — how can that not be demoralising?” said Wong.\n\nThe UN Office of the High Commissioner for Human Rights said on Friday the junta was restricting aid supplies to quake-hit areas where communities did not back its rule.\n\nThe UN office also said it was investigating 53 reported attacks by the junta against opponents, including air strikes, of which 16 were after the ceasefire was declared on Wednesday.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f1a43d2305e.jpg",
  "retrievedAt": "2025-10-12T02:22:52.621Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902344/un-seeks-help-for-myanmar-quake-toll-over-3350",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:19.000Z"
}
