{
  "title": "Missile strike on Kyiv kills one amid ‘massive’ attack - World - DAWN.COM",
  "author": null,
  "content": "A missile attack on the Ukrainian capital Kyiv early on Sunday killed one person and injured at least three people, city officials said, as missile and drone strikes across the country left at least one more person dead.\n\nRussia “in the early hours of this morning launched a massive nationwide attack on Ukraine using ballistic missiles, cruise missiles and drones”, said First Deputy Prime Minister Yulia Svyrydenko.\n\nIn Kyiv, explosions were heard overnight and a dark plume of smoke rose up from the city early Sunday morning, AFP journalists saw.\n\nIn the capital, “preliminarily, one person was killed, and three were wounded, two of them were hospitalised”, the head of the city’s military administration, Tymur Tkachenko, wrote on social media.\n\nCity mayor Vitali Klitschko said that “the body of a man killed in an enemy attack was discovered in Darnytsia district. He was on the street, near the epicentre of the explosion. The man’s identity is being established.”\n\nEmergency services said that during attacks, fires broke out in Kyiv in non-residential buildings, damaging a multi-storey business centre, a furniture factory and warehouses.\n\nThe emergency services posted video of smoke rising from charred debris, a gutted hangar and a large multi-storey administrative building with the roof torn off and windows blown out.\n\nOvernight, Russia attacked Ukraine with 23 cruise and ballistic missiles and 109 drones, the Ukrainian air force said, causing damage to six regions.\n\nThe air force said it shot down 13 of the missiles and 40 drones while 54 others caused no damage.\n\nIn the southern Kherson region, a drone killed a 59-year-old man, while in the northeastern Kharkiv region near the border with Russia two were injured in an attack using guided aerial bombs, regional officials said.\n\nIn western Ukraine’s Khmelnytsky region, authorities said air defences destroyed a missile but falling fragments damaged a house and a woman was injured.\n\nThe attacks come as US President Donald Trump pushes for a partial ceasefire between Russia and Ukraine, more than three years into Moscow’s full-scale invasion, and seeks a thaw in ties with the Kremlin.\n\nUkrainian President Volodymyr Zelensky said today the number of Russian air attacks is increasing, indicating that there is not enough international pressure on Moscow.\n\nMissile and drone attacks across the country killed at least two people overnight and injured at least four people, as well as damaging offices of state broadcasters, officials said.\n\n“The number of air attacks is increasing,” the president wrote on Facebook.\n\n“The pressure on Russia is still insufficient, and the daily Russian strikes on Ukraine prove it,” Zelensky said. Russia “intends to continue the war and the killing. That is why there can be no easing of pressure”, the president said.\n\n“All efforts must be aimed at guaranteeing security and bringing peace closer.”\n\nOver the past week, Russia has launched more than 1,460 guided aerial bombs, nearly 670 attack drones, and over 30 missiles of various types on Ukraine, Zelensky said.\n\nZelensky’s chief of staff Andriy Yermak said today: “The language of force is the only one that [Russian President Vladimir] Putin understands. All our partners need to switch to this language.”\n\nThe UN’s high commissioner for human rights denounced Russia’s “reckless disregard” for civilians after a missile attack killed 18 people, including nine children in Kryvyi Rig — also Zelensky’s home city.\n\n“The use of an explosive weapon with wide area effects by the Russian Federation in a densely populated area — and without any apparent military presence — demonstrates a reckless disregard for civilian life,” Volker Turk said in a communique.\n\nYesterday, Zelensky slammed the US embassy for what he called a “weak” statement that did not blame Russia for the deadly missile strike on his home city.\n\nThe Russian missile struck a residential area near a children’s playground in the central Ukrainian city.\n\nIn an emotional statement on social media, Zelensky named each of the nine children killed in the attack, accusing the US embassy of avoiding referring to Russia as the aggressor.\n\nZelensky said the children killed in the strike ranged in age from three to 17.\n\n“Unfortunately, the reaction of the American embassy is unpleasantly surprising: such a strong country, such a strong people — and such a weak reaction,” Zelensky wrote.\n\n“They are even afraid to say the word ‘Russian’ when talking about the missile that killed the children.”\n\nThe Ukrainian president took aim at the US Ambassador Bridget Brink after she posted a message on X on Friday that said: “Horrified that tonight a ballistic missile struck near a playground and restaurant.”\n\nIn subsequent posts, Brink has referred to Russia as the aggressor, writing on Sunday morning that Ukraine was “under a ballistic and cruise missile attack from Russia”.\n\nMeanwhile, the ballistic missile strike on Kyiv overnight partially destroyed a building housing offices of state channels broadcasting in foreign languages, a television channel said today.\n\nRussia launched a massive missile and drone attack on Ukraine overnight, striking several targets and killing at least two people.\n\n“On April 6 overnight, a Russian ballistic missile strike on Kyiv caused significant destruction to buildings housing the editorial offices of Ukraine’s State Foreign Broadcasting Enterprise,” the Freedom television channel, which broadcasts in Russian, wrote in a report.\n\n“The top three floors of the business centre where the foreign broadcasting channels were located were completely destroyed, with a large crater nearby. The lower floors were also heavily damaged and are now unusable,” Freedom reported.\n\nFreedom said the building housed Freedom, Dom, UATV English, The Gaze, UATV Espanol, UATV Arabic and UATV Portugues — state foreign-language television channels and online media.\n\nNo employees were hurt in the attack, the head of the state broadcasting enterprise, Yulia Bin, said. The channels had only recently moved into the building after a previous strike in February targeted their previous offices, Bin said.\n\n“This is the second attack in less than two months. The facilities destroyed this time were the very ones we had just moved into after the February strike,” Bin said.\n\nTrump is pushing the two sides to agree to a ceasefire but his administration has failed to broker an accord acceptable to both.\n\nZelensky on Saturday hailed “tangible progress” after meeting British and French military chiefs in Kyiv on Friday to discuss a plan by London and Paris to send a “reassurance” force to Ukraine if and when a deal on ending the conflict is reached.\n\nThe Ukrainian president wrote on social media that the meeting with British Chief of the Defence Staff Tony Radakin and French counterpart Thierry Burkhard agreed “the first details on how the security contingent of partners can be deployed”.\n\nThis is one of the latest efforts by European leaders to agree on a coordinated policy after Trump sidelined them and opened direct talks with the Kremlin.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/06131934f3aaa02.jpg",
  "retrievedAt": "2025-08-25T14:00:48.833Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902478/missile-strike-on-kyiv-kills-one-amid-massive-attack",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T07:05:56.000Z"
}
