{
  "title": "Lawyers in Gilgit-Baltistan go on strike till 16th - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Legal fraternity in Gilgit-Baltistan has announced a boycott of all court proceedings and will hold protest demonstrations across the region until April 16, citing the non-fulfillment of their demands.\n\nFor the past five months, lawyers in Gilgit-Baltistan have been protesting and boycotting court proceedings, except for emergency cases, due to the unmet demands. However, this time, lawyers have decided to not appear in courts even for emergency cases till April 16.\n\nA meeting of GB High Court Bar Association (GBHCBA) under the chairmanship of Advocate Tanveer Akhtar passed a resolution and reviewed progress on the joint demands of GB Bar Council, GB Supreme Appellate Court Bar Association, GBHCBA and district bar associations.\n\nAccording to a statement issued by the association on Saturday, the meeting expressed reservations over government’s failure to implement lawyers’ demands despite repeated strikes and protests. The lawyers termed not fulfillment of the demands “a conspiracy against GB people” for not giving access to justice.\n\nBar association regrets little progress on appointment of key judge and other demands of legal fraternity\n\nThe meeting asked lawyers to not appear in all court proceedings across GB, even in emergency cases, till April 16, to make the protest more effective. The meeting asked the GB judges to not decide cases in absence of counsel, as lawyers would hold protest demonstrations in all districts of the region.\n\nIt GBHCBA decided that licences of the lawyers, who would not boycott proceedings till April 16, would be cancelled by GB Bar Council and in case of appearances lawyers in district courts, chief court, Supreme Appellate Court and revenue and service tribunals, a fine ranging from Rs100,000 to Rs300,000 would be imposed on them.\n\nThe meeting also decided to consider locking courts and other actions in case their demands, including the long-delayed appointment of judges in the GB Supreme Appellate Court, remained unmet.\n\nLater, a GB Bar Council meeting endorsed the resolution and demanded that authorities resolve the issues of the legal fraternity.\n\nThe representatives of the lawyers’ community said the GB chief minister had accepted their demands and issued directives to address the issues, yet relevant authorities failed to take any action.\n\nOne of the key demands is appointment on the vacant positions in the GB Supreme Appellate Court, the region’s highest judicial forum, as around 8,000 cases were pending before the court due to the delay in the appointment.\n\nAnother major demand is the extension of the Lawyers Protection Act to GB by the federal government, a move they argued is essential for ensuring their safety and professional rights.\n\nThe proposed land reforms draft has also come under criticism from the legal community, who described it as ambiguous and flawed. They demanded that their recommendations be incorporated before it is passed in the GB Assembly, warning that failure to do so would be a violation of local people’s rights. They urged the GB chief judge to take steps to appoint judges to the vacant positions in labour, consumer, family and ATCs, and assistant registrar’s office.\n\nThe lawyers called for the advertisement of vacant civil judge positions and demanded that judicial magistrate posts be separated from civil judge posts, as practised in other parts of the country, with appointments made from the legal fraternity on merit.\n\nAccording to GBHCBA president Tanveer Khan, the GB Supreme Appellate Court has been operating with only one judge for past seven years. According to rules, a single judge cannot hear all cases, causing thousands of important cases to remain pending.\n\nCommenting on the GB reforms draft, he criticised that lawyers’ objections were ignored, and mineral and mining leases were being awarded to outsiders. He warned the GB government of severe consequences if their demands were not fulfilled.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:18.192Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902430/lawyers-in-gilgit-baltistan-go-on-strike-till-16th",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:26.000Z"
}
