{
  "title": "US to revoke all visas for South Sudanese, says secretary of state - World - DAWN.COM",
  "author": null,
  "content": "Washington is revoking all visas for South Sudanese passport holders and blocking new arrivals, Secretary of State Marco Rubio said on Saturday, complaining that the African nation is not accepting its nationals expelled from the United States.\n\nThe State Department “is taking actions to revoke all visas held by South Sudanese passport holders and prevent further issuance to prevent entry,” Rubio said in a statement.\n\nIt was the first such measure singling out all passport holders from a particular country since Donald Trump returned to the White House on January 20, having campaigned on an anti-immigration platform.\n\nRubio accused the transitional government in Juba of “taking advantage of the United States,” saying that “every country must accept the return of its citizens in a timely manner when another country… seeks to remove them.”\n\nWashington “will be prepared to review these actions when South Sudan is in full cooperation,” Rubio added.\n\nThe world’s newest country and also one of the poorest, South Sudan is currently prey to tensions between political leaders.\n\nSome observers fear a renewal of the civil war that killed 400,000 people between 2013 and 2018.\n\nSouth Sudanese nationals had been granted “temporary protected status” (TPS) by the administration of Trump’s predecessor Joe Biden, with the designation set to expire on May 3, 2025.\n\nThe United States grants TPS, which shields people against deportation, to foreign citizens who cannot safely return home because of war, natural disasters or other “extraordinary” conditions.\n\nThere were about 133 South Sudanese in the United States under the TPS programme, with another 140 eligible to apply, the Department of Homeland Security said in September 2023.\n\nBut the Trump White House has begun overturning TPS designations, revoking protection in January from more than 600,000 Venezuelans.\n\nA federal judge this week put that decision on hold after calling into question the government’s claims that the majority of Venezuelans in the US were criminals.\n\nAccording to the Pew Research Center, as of March 2024 there were 1.2 million people eligible for or receiving TPS in the US, with Venezuelans making up the largest group.\n\nThe Trump administration’s singling out of South Sudan also comes after growing numbers of Africans attempted to enter the US via its southern border — an alternative to risky routes into Europe.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:48.123Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902475/us-to-revoke-all-visas-for-south-sudanese-says-secretary-of-state",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T07:00:09.000Z"
}
