{
  "title": "Another robbery suspect injured in ‘encounter’ in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After another suspect was injured during an encounter in the federal capital, the number of injuries in such incidents over the past five days has increased to three.\n\nThe encounter took place at Karnal Sher Khan Road (formerly I.J.P Road) in the area of the Sabzi Mandi police station. Over the incident, a case was also registered with the Sabzi Mandi police under sections 324, 353, and 186 of the Pakistan Penal Code, along with sections 13 and 20 of the Arms Ordinance 1965.\n\nIn the FIR, the police said that the two suspects were attempting to commit a crime at the time of the incident; however, no case was registered at the police station in this regard.\n\nA two-member police patrolling team was on duty in the area of Karnal Sher Khan Road. The police officials spotted two persons riding on a motorcycle who were attempting to commit a crime when they reached Pirwadhi Mor near Dhok Hassu. The police officials asked them to stop, but the duo escaped on their motorcycle while brandishing weapons. The police team chased them, and after covering some distance, the riders fell on the road after their motorcycle slipped.\n\nThey then started firing at the police while running away from the scene on foot. The police, however, crouched behind their official car to escape the firing by the suspects and also retaliated using their SMG. In the meantime, one of the suspects sustained a bullet injury due to the firing of his accomplice. Later, the police arrested both suspects.\n\nIslamabad police say suspect injured by firing of accomplice, both men arrested\n\nOn March 31, two suspects were injured during an encounter with the police, while another managed to escape.\n\nOver the incident, a case was registered at the Shalimar police station under sections 324, 353, and 186 of the PPC in response to a complaint lodged by SI Mohammad Ishaq. However, the content of the FIR and the police statement on the official X account seemingly contradicted each other.\n\nAccording to the FIR, a five-strong police team was making the rounds in an area of E-11/2 when they received a call from the police helpline informing them that four robbers had looted a citizen at the E-11 flyover at 11:56pm. After getting the information, First Responding Officer Assistant Sub-Inspector Khushal met the victim and collected details of the robbery committed by four people riding on two Honda 125cc motorcycles.\n\nAt 11:58pm, ASI Khushal informed that he was chasing the robbers, and they were seen moving towards the service road in F-10 Markaz. Around 12:10am, two motorcycles were spotted near Street 8 in Sector F-10 while moving towards Margalla Road.\n\nThe police patrolling team tried to intercept them, however, the riders started firing, and during the chase, one of the motorcycles slipped. Later on, all four riders got separated and spread in different directions in a wooded area and continued firing.\n\nWhen the police searched the area after the firing stopped, they found two persons lying in an injured condition. During the preliminary investigation, the suspects stated that they got injured by the firing of their accomplices.\n\nAn extra police contingent was also called to the spot, and a search operation for the two other suspects was conducted.\n\nOn the other hand, in a statement on the official X account, the police said that four suspects opened fire at a police checkpoint in the area of the Shalimar police station. Police officials were safe due to alert duty and security measures, however. Heavy firing continued between the robbers and the police while the police pursued them.\n\nPolice officers showed bravery and arrested two injured suspects along with weapons, a motorcycle, and looted items. A search operation was launched in the area by a heavy police contingent to arrest other accomplices.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:49.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902335/another-robbery-suspect-injured-in-encounter-in-islamabad",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:58:08.000Z"
}
