{
  "title": "Yunus meets textile leaders after US tariffs ring alarm bells - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Bangladesh’s interim leader called an emergency meeting on Saturday after textile leaders in the world’s second-largest garment manufacturing nation said US tariffs were a “massive blow” to the key industry.\n\nTextile and garment production accounts for about 80 percent of exports in the South Asian country, and the industry has been rebuilding after it was hard hit in a revolution that toppled the government last year.\n\nUS President Donald Trump on Wednesday slapped punishing new tariffs of 37pc on Bangladesh, hiking duties from the previous 16pc on cotton and 32pc on polyester products.\n\nBangladesh exports $8.4 billion of garments annually to the United States, according to data from the Bangladesh Garment Manufacturers and Exporters Association (BGMEA), the national trade body. That totals around 20pc of Bangladesh’s total ready-made garments exports.\n\nInterim leader Muhammad Yunus “convened an emergency meeting… to discuss the US tariff issue,” the government said in a statement. Sheikh Bashiruddin, the commerce minister, told reporters after the meeting that Yunus “will raise the issue with the US administration”.\n\nBashiruddin said he believed Bangladesh would “not be severely affected”, adding that some other competitors faced “much higher than those on us”.\n\nYunus’ senior advisor Khalilur Rahman said the government had been readying for the tariff hike, and had began talks with US officials in February.\n\n“The discussions are ongoing. We will take the necessary steps based on these discussions.” Bangla­desh’s tax authority, the National Board of Reve­nue, is also expected to meet to review the fallout from the tariffs.\n\nRakibul Alam Chowdhury, chairman of RDM Group, a major manufacturer with an estimated $25 million turnover, said on Thursday that the industry would lose trade.\n\n“Buyers will go to other cost-competitive markets — this is going to be a massive blow for our industry,” he said. Several garment factories produce clothing for the US market alone.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:23:13.760Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902412/yunus-meets-textile-leaders-after-us-tariffs-ring-alarm-bells",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:48.000Z"
}
