{
  "title": "8 terrorists killed as infiltration attempt on Pak-Afghan border thwarted in North Waziristan: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security forces killed eight terrorists and injured another four as they thwarted an infiltration attempt on the Pakistan-Afghanistan border in Khyber Pakhtunkhwa’s North Waziristan district, the military’s media affairs wing said on Sunday.\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in KP and Balochistan, after the proscribed Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022.\n\nOn the night of April 5-6, the “movement of a group of khwarij, trying to infiltrate through Pakistan-Afghanistan border, was picked up by the security forces in general area” of North Waziristan’s Hassan Khel, the Inter-Services Public Relations (ISPR) said in a press release.\n\n“Own troops effectively engaged and thwarted their attempt to infiltrate. After an intense exchange of fire, eight khwarij were sent to hell, while four khwarij got injured,” it added.\n\nFitna Al Khawarij is a term the state uses to refer to the banned TTP.\n\n“Pakistan has consistently been asking Interim Afghan Government to ensure effective border management on their side of the border,” the ISPR noted, adding that it expected Kabul to “fulfil its obligations and deny the use of Afghan soil by khwarij for perpetuating acts of terrorism against Pakistan”.\n\nThe ISPR asserted that “security forces of Pakistan are determined and remain committed to secure its borders and wipe out the menace of terrorism from the country”.\n\nThe statement added that a sanitisation operation was being conducted to eliminate any other kharji found in the area.\n\nThe failed infiltration attempt follows another one in late March in North Waziristan. Security forces had foiled that attempt and killed 16 terrorists.\n\nDays later, 11 terrorists were killed in four different encounters with security forces in KP — 10 of whom were eliminated in different areas of North Waziristan.\n\nLast month, the government had ruled out a fresh military operation amid a surge in terrorist attacks, especially in KP and Balochistan.\n\nMilitant violence and security operations intensified in the country in March, with the number of militant attacks surpassing 100 for the first time since November 2014, according to data released by the Pakistan Institute for Conflict and Security Studies (Picss).\n\nIn KP, at least 206 people were killed — including 49 security personnel, 34 civilians, and 123 militants — while 115 were injured, with 63 security personnel and 49 civilians among them, the Picss report said.\n\nPakistan ranked second in the Global Terrorism Index 2025, with the number of deaths in terrorist attacks rising by 45 per cent over the past year to 1,081.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:41.871Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902506/8-terrorists-killed-as-infiltration-attempt-on-pak-afghan-border-thwarted-in-north-waziristan-ispr",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T13:31:11.000Z"
}
