{
  "title": "Zelensky slams ‘weak’ US reply to Russian strike on his hometown - World - DAWN.COM",
  "author": null,
  "content": "KYIV: Ukrainian President Volodymyr Zelensky on Saturday slammed the US embassy for what he called a “weak” statement that did not blame Russia for a missile strike on his hometown which killed 18 people, including nine children.\n\nIn one of the deadliest strikes in recent weeks, a Russian missile on Friday evening struck a residential area near a children’s playground in the central Ukrainian town of Kryvyi Rig, followed up by attack drones.\n\nSeventy-two people were wounded, 12 of them children, Dnipropetrovsk governor Sergiy Lysak said after the end of emergency operations overnight, with city officials declaring three days of mourning.\n\nZelensky in an emotional statement on social media named each of the children killed in the attack, accusing the US embassy of avoiding referring to Russia as the aggressor. “Unfortunately, the reaction of the American Embassy is unpleasantly surprising: such a strong country, such a strong people — and such a weak reaction,” Zelensky wrote.\n\nUkrainian president says Moscow has no interest in stopping the war\n\n“They are even afraid to say the word ‘Russian’ when talking about the missile that killed the children.” Zelensky singled out the United States for criticism as President Donald Trump has pushed for a partial ceasefire between Russia and Ukraine while seeking a thaw in ties with Moscow.\n\nRussia’s defence ministry said it “delivered a precision strike” in the city “where commanders of formations and Western instructors were meeting”.\n\nThe commander of the Ukrainian army retorted that Moscow was “trying to cover up its cynical crime” and “spreading false information”. He accused Russia of “war crimes”.\n\n‘Calling a spade a spade’\n\nThe Ukrainian president was taking aim at a message posted on X by US Ambassador Bridget Brink on Friday evening, which said: “Horrified that tonight a ballistic missile struck near a playground and restaurant”.\n\nBrink, who was appointed by Trump’s predecessor Joe Biden and has been ambassador since May 2022, added that “this is why the war must end”.\n\nZelensky wrote on Saturday: “Yes, the war must end. But in order to end it, we must not be afraid to call a spade a spade.” In recent posts, Brink did not refer directly to Russia, but on Saturday, after Zelensky’s criticism, she referred to “Russian attacks” while visiting the war-torn city of Kharkiv.\n\nOleksandr Vilkul, the head of Kryvyi Rig’s military administration, said three days of mourning had been declared on April 7, 8 and 9.\n\n“This is nothing less than a mass murder of civilians,” he said. Pictures circulated by rescue services showed several bodies, one stretched out near a playground swing. “This is the kind of pain you wouldn’t wish on your worst enemy,” Lysak said.\n\n‘Not human’\n\nTrump, who said during his re-election campaign he could end the three-year conflict within days, is pushing the two sides to agree to a ceasefire but his administration has failed to broker an accord acceptable to both.\n\nZelensky said the missile attack showed Russia had no interest in stopping its full-scale invasion, launched in February 2022. “Russia does not want a ceasefire and we see it. The whole world sees it,” he said, adding that Moscow launched attack drones “right during the rescue operation”. “People who are capable of that kind of thing aren’t human,” Zelensky said.\n\nKryvyi Rig, in Ukraine’s central Dnipropetrovsk region, is about 60 kilometres from the front line, and has regularly been targeted by Russian drones and missiles.\n\nThe Ukrainian leader was born in the industrial city, which had a pre-war population of around 600,000 people. He said the children killed by the latest attack ranged in age from a three-year-old boy, Tymofiy, to a 17-year-old teenage boy, Nikita.\n\nZelensky hailed “tangible progress” after meeting British and French military chiefs in Kyiv on Friday to discuss a plan by London and Paris to send a “reassurance” force to Ukraine if and when a deal on ending the conflict is reached.\n\nThe president wrote on social media that the meeting with British Chief of the Defence Staff Tony Radakin and French counterpart Thierry Burkhard agreed “the first details on how the security contingent of partners can be deployed”, without giving details.\n\nThis is one of the latest efforts by European leaders to agree on a coordinated policy after Trump sidelined them and opened direct talks with the Kremlin. Russia and Ukraine have accused each other of breaking a supposed deal to stop firing on energy sites, though a formal agreement has not been put in place.\n\nRussia on Saturday once again claimed Ukraine targeted its energy infrastructure, with the defence ministry saying Kyiv had attacked 14 sites in the last 24 hours. Ukraine denied these “false” accusations.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0608083342c727a.jpg",
  "retrievedAt": "2025-10-12T02:23:31.144Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902340/zelensky-slams-weak-us-reply-to-russian-strike-on-his-hometown",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:19.000Z"
}
