{
  "title": "US delegation to visit Islamabad for minerals investment forum - Business - DAWN.COM",
  "author": null,
  "content": "A US delegation headed by Eric Meyer, the senior official overseeing the Bureau of South and Central Asian Affairs at the State Department, will visit Islamabad from April 8-10, 2025, to advance US interests in the critical minerals sector at an investment forum.\n\nThe Oil and Gas Development Company Limited (OGDCL) in collaboration with the Government of Pakistan and strategic partners, is set to organise the Pakistan Minerals Investment Forum 2025 (PMIF25) on April 8-9 at the Jinnah Convention Centre in Islamabad.\n\nThe forum will serve as a premier platform for global stakeholders to explore investment opportunities in Pakistan’s emerging minerals sector and unlock the country’s vast mineral potential.\n\nAccording to a statement by the US State Department, Eric Meyer “will meet with senior Pakistani officials to expand opportunities for American businesses in Pakistan and promote the deepening of economic ties between our two countries”.\n\nMeyer will also engage with senior officials to underscore the importance of continued collaboration between Pakistan and the US on counterterrorism.\n\nThis statement comes after President Donald Trump imposed a 29 per cent tariff on goods the US imports from Pakistan, along with duties on dozens of countries from rivals to allies, intensifying a global trade war.\n\nThe US imposed 29pc reciprocal tariffs on Pakistan, which charges the US 58pc, according to a board that Trump held during his announcement.\n\nPakistan exports to US are $6bn annually — 18pc of the total exports of the country. However, they account for 0.16pc of total US imports of $3.36 trillion in 2024, while countries such as Vietnam, Bangladesh, Sri Lanka and India have shares of 4.2pc, 0.26pc, 0.09pc and 2.7pc.\n\nAdditionally, textile comprises 75 to 80pc of Pakistan’s exports to the US.\n\nOther exported commodities include leather, surgical goods, rice, cement, steel products, and salt.\n\nIt should be noted that Pakistan largely competes with countries such as China, India, Vietnam, Cambodia, Indonesia, and Bangladesh in textiles.\n\nMeanwhile, Prime Minister Shehbaz Sharif and his cabinet have repeatedly highlighted Pakistan’s mineral resources as the linchpin of the country’s economic revival.\n\nMoreover, Saudi Arabia’s Manara Mineral was looking at investing in Balochistan’s Reko Diq mine after having already visited Pakistan last year for talks about buying a stake in the Reko Diq mine, considered one of the world’s largest underdeveloped copper-gold areas by global mining company Barrick Gold, which owns the project jointly with Pakistan.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:46.546Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902482/us-delegation-to-visit-islamabad-for-minerals-investment-forum",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T08:34:40.000Z"
}
