{
  "title": "BNP-M demonstrators face tear gas, shelling amid sit-in near Quetta - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Balochistan National Party-Mengal (BNP-M) on Sunday evening announced that police used tear gas and shelling to disperse protesters during their sit-in, according to a social media post.\n\nThe BNP-M had begun a “long march” from Wadh to Quetta on March 28 to protest the arrests of Baloch Yakjehti Committee (BYC) leaders and activists, including Dr Mahrang Baloch and Sammi Deen Baloch, as well as a crackdown on their sit-in in Quetta. Sammi was released on Tuesday.\n\n“A complete wheel-jam strike is underway on Kechi Beg, Sariab, Faizabad and Shahwani Roads against the blockade of the Balochistan National Party’s long march,” the party wrote on X.\n\n“Police used tear gas and shelling on BNP district office bearers and workers,” the party added. “On the other hand, authorities are raiding houses in Sariab, violating the sanctity of their homes.\n\nEarlier on Sunday, the Balochistan government warned Sardar Akhtar Mengal, chief of his faction of the BNP-M, that he would be arrested under the Maintenance of Public Order (MPO) if his party’s march against the jailing of Baloch activists entered Quetta.\n\nThe BNP-M’s sit-in at the Lakpass area of Mastung entered its 10th day today. The party is set on heading to Quetta as a deadlock persisted over its demands — including Mahrang’s release — while the Balochistan government warned to limit the march to Quetta’s Sariab Road.\n\nHowever, that offer seemed to be no longer on the table as Balochistan government spokesperson Shahid Rind asserted today that Mengal would be arrested if he “moves towards Quetta”.\n\nResponding to a post on X by Mengal, who claimed his party was “completely encircled by security forces” at Lakpass, Rind said the BNP-M president had been alerted at 6am about the orders to arrest him under the MPO.\n\nMPO orders are usually issued to maintain public order and cite a “threat to the public safety” along with a possible “breach of peace and tranquility”.\n\nRind wrote: “Mengal refused to give his arrest. The administration and the police have clearly told him that if he moves towards Quetta, he will be arrested, and this is why law enforcement agencies (LEAs) are present there.\n\n“BNP’s calls to block national highways right now is adding to the difficulties faced by the citizens. The administrations of all districts have been instructed that national highways will not be shut.”\n\nThe government spokesperson, without specifying the other party, quipped: “There is one thing common in the beneficiary groups of 2018 [elections]: crafting a narrative, which is why both are doing the same thing.”\n\nThe provincial government has blocked roads by placing containers around the protest site at Lakpass. It has also suspended internet services in Quetta, Mastung, Kalat and Khuzdar.\n\nFollowing Rind’s statement, the BNP-M quoted Mengal as saying: “The state has decided to crush us, but we won’t bow down. This sit-in will continue under all circumstances and now, we will make the entire Balochistan the centre of resistance.”\n\nIn another post, the BNP-M shared a video, claiming that LEAs had started shelling on party workers at Quetta’s Sona Khan Chowk gathering to welcome the march. White fumes could be seen billowing in the distance in the purported video.\n\nMengal, in a post on X earlier in the morning to which Rind had directly replied, stated: “We are currently stationed at Lakpass, completely encircled by security forces. A major operation against us is imminent.\n\n“I call upon all districts to immediately shut down all national highways in protest. Let the world witness this injustice. We remain peaceful, but resolute.\n\n“Whatever unfolds today — the consequences, the blood, the fallout — will rest solely on the shoulders of the government and the local administration,” Mengal added.\n\nA post on X by the BNP-M shortly after also said security forces had surrounded Mengal and the people at the sit-in, adding that it was “deeply concerned” about the situation at Lakpass.\n\n“This is open aggression that will not be tolerated under any circumstances. BNP announces that all national highways should be closed immediately in protest.”\n\nVeteran politician Afrasiab Khattak asked in a post on X: “Why have the security forces encircled the peaceful Baloch marchers and are not letting them go to Quetta?\n\n“In fact, the entire Balochistan is encircled. Do they insist on proving the fact that Pakistan is an open prison for all the oppressed people?” he added.\n\nMeanwhile, the BNP-M called for roadblocks and a shutter-down strike across Balochistan tomorrow against obstructions placed for its march to Quetta.\n\nFormer BNP-M Senator Sanaullah Baloch told Dawn.com the party has called for “Balochistan-wise roadblocks and strike against government brutalities, firing and shelling against unarmed protesters”.\n\nAddressing a press conference in Quetta — attended by leaders of the Awami National Party (ANP) and the Jamhoori Watan Party (JWP) — BNP-M Senior Vice President Sajid Tareen also reiterated the strike call.\n\nTareen said the plan of action for “further protests” would also be announced tomorrow after consultation with other political parties.\n\n“The rulers want to put the people on the path of hatred under a conspiracy,” Tareen alleged, saying that police, Frontier Corps and security forces have been deployed to prevent the protesters from entering Quetta.\n\nInsisting that “not a single pot” was broken so far as the sit-in remained peaceful, the BNP-M leader condemned the “use of force against a democratic action”.\n\nTareen also expressed the apprehension that he may be arrested: “I have reports that I may be arrested. I am in Quetta but we will keep raising our voices against oppression.”\n\nFollowing the call, BNP-M workers led by Mir Ghulam Rasool Mengal blocked a road near the Eastern Bypass in Quetta’s Baloch Colony area.\n\nSimilarly, the route to the city’s Sariab Road was blocked by party supporters at Kechi Baig Road by burning tyres.\n\nAccording to Mengal, the previous two rounds of negotiations were not successful as the government delegations did not enjoy any authority to make decisions on the demands tabled by the BNP during the talks.\n\nA day earlier, Balochistan government spokesperson Shahid Rind offered the BNP-M to march till Quetta’s Shahwani Stadium on Sariab Road and warned the party of action if the city’s Red Zone is breached.\n\nAddressing a press conference, Rind denied any government official’s meeting with Mahrang in the district jail on Friday night.\n\nHe said that the BNP leadership had been offered an alternative venue in Sariab during negotiations but they did not accept the government’s offer and insisted that they would stage their sit-in in the Red Zone despite Section 144.\n\nRind, while referring to the talks with the BNP, said that two rounds of negotiations had been held with the BNP leaders, with inputs from BNP-Awami, the National Party, and Jamiat Ulema-i-Islam, but all in vain.\n\nHe further asserted that Mengal will not be allowed entry in the Red Zone, the Balochistan Assembly, or the Balochistan High Court premises.\n\nMeanwhile, BNP responded strongly to the government’s position. “Here, laws are crafted to suit the whims and interests of the ruling elite. Such bluster is not new — dictators like Musharraf also made similar threats, which were ignored then and will be ignored now,” the statement said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/061542154097616.jpg",
  "retrievedAt": "2025-08-25T14:00:46.861Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902476/bnp-m-demonstrators-face-tear-gas-shelling-amid-sit-in-near-quetta",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T07:25:34.000Z"
}
