{
  "title": "North Korean leader fires new sniper rifle while visiting troops - World - DAWN.COM",
  "author": null,
  "content": "SEOUL: North Korean leader Kim Jong Un has test-fired a newly developed sniper rifle, state media said on Saturday, as he inspected special forces whose training he said bolstered “actual war capability for guaranteeing victory”.\n\nSuch units are among the thousands of troops that South Korea’s spy agency says Pyongyang has deployed to Russia to support Moscow’s war against Ukraine.\n\nDuring the visit to a special operations unit on Friday, Kim said the “actual war capability for guaranteeing victory in the war field is bolstered up through intensive training,” the Korean Central News Agency (KCNA) reported.\n\nHe added that their training is “the most vivid expression of patriotism and loyalty to the country,” according to the agency. Images released by state media showed Kim peering through the scope of a sniper rifle that KCNA said was going to be “newly supplied to special operation units”.\n\nOther images showed him pointing to the bullseye of a target, crouching alongside heavily camouflaged soldiers, and smiling and waving to troops.\n\nKim supervised “automatic rifle firing drills and sniper rifle firing drills” and, after personally test-firing the weapon, expressed “great satisfaction over the performance and power of the sniper rifle developed in our own way”, KCNA said.\n\nKim’s visit to the special forces came on the same day that South Korea’s Constitutional Court upheld president Yoon Suk Yeol’s impeachment over his disastrous martial law declaration, booting him from office and triggering fresh elections.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f1c880778e5.gif",
  "retrievedAt": "2025-10-12T02:23:12.021Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902409/north-korean-leader-fires-new-sniper-rifle-while-visiting-troops",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:48.000Z"
}
