{
  "title": "Punjab opposition rejects ‘PM’s token power cut’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Opposition Leader in the Punjab Assembly Malik Ahmad Khan Bhachar has accused the prime minister of hoodwinking the people of Pakistan by slashing just Rs7 from the Rs60 power tariff, pointing out that it stood at Rs17 during the PTI government.\n\nFlanked by party MPAs, Mr Bhachar told a presser at Lahore Press Club on Saturday that the incumbent ‘Form-47 government’ did not give any relief to the agriculture sector.\n\nHe said inflation had surged by 212 percent and added sugar was sold for up to Rs200 per kg during Ramazan.\n\nThe opposition leader said wheat was being sold at a minimum rate of Rs2,000 per 40kg, making it a lucrative product for hoarders. He said farmers raised a canola crop, but the government imported soybeans instead.\n\nHe criticised the government’s tall claims about providing solar panels and inverters, noting the equipment remained deficient in operating tubewells.\n\nHe alleged the government engaged only three companies in the solar programme. He also lamented that the Suthra Punjab programme was now taking its toll, as people of Punjab were compelled to pay additional costs in their utility bills.\n\nMr Bhachar said the government was out to outsource tertiary care at Jinnah Hospital and chided the chief minister for only making TikToks.\n\nHe claimed the government had already destroyed the education system through privatization and noted that the crime rate in Punjab increased by 33 percent during Ramazan.\n\nThe opposition leader accused the government of focusing on blocking PTI founder Imran Khan’s meetings with his sisters and party leaders, bemoaning that it was pushing the nation toward anarchy. He said the PTI had faced state aggression unlike any other party in Pakistan’s history.\n\nMr Bhachar also criticized PPP chairman Bilawal Bhutto Zardari on the issue of canals on the Indus River, urging him to take to the streets if he was serious about his commitment to the people. He warned that the proposed canals would reduce irrigation water for Punjab farmers.–\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:00.465Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902369/punjab-opposition-rejects-pms-token-power-cut",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:58:01.000Z"
}
