{
  "title": "Water level in key dams rises slightly after rainfall - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The water level in major dams has risen from critically low threshold due to increased inflows from the melting of glaciers and rainfall in March.\n\nMangla and Tarbela, two of the biggest reservoirs in Pakistan, almost ran out of water in recent weeks, prompting fears of acute water shortage for domestic and agriculture use.\n\nAccording to a Pakistan Meteorological Department (PMD) report, Khyber Pakh­­tunkhwa, north Punjab, most of Balochistan, Azad Kashmir, and Gilgit Baltistan received light to heavy rainfall in March.\n\nThe inflows increased the water level in Mangla Dam on Jhelum River from 1,066.25 feet on March 23 to 1,086.70 feet on April 4, Wapda data shows.\n\nSimilarly, the water level in the Tarbela Dam increased from the dead level of 1,402 feet to 1410 feet.\n\nMangla and Tarbela over dead level; PMD says drought still a threat\n\nHowever, the PMD warned that mean temperatures were expected to remain above normal nationwide during April.\n\nThe forecast for April said that slightly below-normal rainfall is anticipated in northern Punjab, Kashmir and adjoining areas of northern KP.\n\nIn contrast, southern regions are expected to experience closer to normal rainfall, with a reduced negative anomaly as per the region’s climatological patterns.\n\nThe PMD report said mean temperatures are expected to remain above normal nationwide, with maximum temperatures over Kashmir, GB and northern KP.\n\nThe April forecast predicted normal rainfall in drought-prone southern regions.\n\n“This expected rainfall should improve soil moisture in areas like coastal Balochistan, the Thar Desert in Sindh, and the Cholistan region in Punjab,” PMD said, adding that mild to moderate drought conditions already present in Sindh and coastal Balochistan may intensify if the rainfall remains deficient, Met Office cautions.\n\nThe meteorological department advised all stakeholders to save water to mitigate the adverse impacts of drought.\n\nAbout dry days, the PMD said the number of consecutive dry days has increased from 200 to 237 days across Turbat, Pasni, Lasbela, and Sindh.\n\nHowever, substantial rainfall has concluded consecutive dry days in central and northern regions of the country.\n\nSoil moisture condition has improved due to recent rainfall in Punjab, and this will boost major crops like wheat, sugarcane, sesame, grams and pulses, primarily thriving in its irrigated plains.\n\nSindh has reported satisfactory growth and harvesting processes for its primary crops, including wheat, sugarcane, seasonal vegetables, and orchards.\n\nThe crop conditions remain generally good, supported by adequate management practices.\n\nIn Khyber Pakhtunkhwa, all standing crops, such as wheat and sugarcane are progressing well, with ongoing harvesting and satisfactory orchard conditions.\n\nBalochistan maintained healthy and growth of wheat, orchards, and vegetables, with seasonal fruits being efficiently produced and marketed.\n\nHowever, persistent dry conditions in some areas have caused moisture stress, adversely affecting crop development.\n\nLast month, the coastal belt of Balochistan, southern and western Sindh, and southeast Punjab had faced mild to moderate drought, attributed to moisture stress and lower-than-average rainfall over the previous three months.\n\nThe PMD has advised farmers that normal to slightly below normal rainfall is expected in most agricultural plains during April.\n\nTo achieve a good yield, it is necessary to control weeds in the crop, which not only reduces the yield but also have other negative impacts.\n\nFarmers have been advised to apply herbicides to destroy these weeds, abstaining from spraying during strong winds and following the advice of the agricultural department.\n\nWith the wheat crop now ripe in Punjab and Sindh, farmers have been advised to schedule harvesting based on the latest weather forecasts.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:23:28.477Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902429/water-level-in-key-dams-rises-slightly-after-rainfall",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:26.000Z"
}
