{
  "title": "Quetta braces for BNP long march as impasse persists - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: All efforts so far made to break a deadlock between the provincial authorities and the lea­dership of the Balochis­tan National Party-Mengal fai­led to bear fruit on Satur­day, with both sides sticking to their positions on the eve of the long march.\n\nThe BNP-M deadline for the acceptance of its demands, including the release of Dr Mahrang Baloch, ended on Saturday midnight. According to its announcement, the BNP-M will start on Sunday (today) its long march towards Quetta from the Lakpass area of Mastung, where the party has been staging its sit-in for the last 10 days.\n\nAccording to Sardar Akhtar Mengal, the previous two rounds of negotiations were not successful as the government delegations did not enjoy any authority to make decisions on the demands tabled by the BNP during the talks.\n\n“We stick to our demands, which were presented during the negotiations, including the release of BYC leader Dr Mahrang Baloch and allowing long march participants to enter Quetta,” he said.\n\nHe said another delegation headed by former Senate chairman Sadiq Sanjrani visited the sit-in camp along with Deputy Speaker of the Balochistan Assembly Ghazala Gola and Education Minister Raheela Hameed Khan Durrani.\n\nHowever, no progress was made. “No progress was made in this meeting, in which it was requested to postpone the long march,” Sardar Mengal said, adding that the delegation came to talks in their personal capacity.\n\nMeanwhile, Pashtunkhwa Milli Awami Party Chairman and MNA Mehmood Khan Achakzai also visited the sit-in camp and expressed solidarity with the BNP. Speaking on the occasion, he said that “we want constitutional rights for all nations living in Pakistan. We are not against Pakistan, but we demand dignity, rights, and representation”.\n\nBNP President Sardar Akhtar Mengal, talking to media via phone, said that National Assembly Speaker Sardar Ayaz Sadiq had contacted him last night and assured him that the matter would be brought before the prime minister. However, there has been no follow-up communication, he said.\n\nMr Mengal criticised both the PML-N and PPP, accusing them of treating Balochistan as a political orphanage and compared the current oppression to the injustices committed during General Pervez Musharraf’s regime.\n\n‘Red Zone off-limits’\n\nMeanwhile, the Balochistan government has decided not to allow the long marchers to enter the Red Zone and instead offered the BNP leadership to stage their sit-in at Shahwani Stadium.\n\nThis was stated by Balochistan government spokesman Shahid Rind at a press conference on Saturday. He denied any government official’s meeting with Baloch Yakjehti Committee (BYC) Chief Organiser Dr Mahrang Baloch in the district jail on Friday night.\n\nHe said that the BNP leadership had been offered an alternative venue in Sariab during negotiations but they did not accept the government’s offer and insisted that they would stage their sit-in in the Red Zone despite Section 144.\n\nHe, however, said that in case of any violation of law, the marchers will be strictly dealt with. “Legal proceeding has already initiated against Dr Sabiha Baloch, a BYC activist, for making anti-state speech in a protest,” Shahid Rind said, adding that a formal response will also be issued over BNP President Sardar Akhtar Mengal’s recent address, which was also deemed hostile to the state.\n\n“Sardar Akhtar Mengal is adamant about staging a sit-in within the Red Zone,” Mr Rind said, adding that the government was exercising restraint despite security concerns that escalated after the recent attack on the Jaffar Express. “The government had already issued alerts regarding potential threats in the city,” he added.\n\nMr Rind, while referring to the talks with the BNP, said that two rounds of negotiations had been held with the BNP leaders, with inputs from BNP-Awami, the National Party, and Jamiat Ulema-i-Islam, but all in vain.\n\nHe outlined Mengal’s three main demands, which included the release of Mahrang Baloch — a matter under judicial purview, not the government’s. The second demand was to allow the sit-in in the Red Zone, which cannot be accepted due to the imposition of Section 144. “The provincial government stands by its offer to let the protesters gather at Shahwani Stadium, but the BNP insists on marching to the Red Zone,” he said.\n\nResponding to a question about the legitimate status of BYC, the government spokesman said that only Dr Mahrang herself could clarify that. “The public is well aware that after the Jaffar Express incident, the BYC organised protests and sit-ins. Just yesterday, their leadership made another anti-state speech at a rally held under the banner of a registered political party. This entire episode is under legal review and appropriate action will be taken.”\n\nHe further asserted that Sardar Akhtar Mengal will not be allowed entry in the Red Zone, the Balochistan Assembly, or the Balochistan High Court premises.\n\nResponding to a question on Afghan refugees, Rind said the provincial government is bound by the federal government’s policy.\n\nMeanwhile, BNP has responded strongly to the government’s position. In an official statement, the party declared that if the rule of law truly existed in the country, the situation would not have deteriorated to this extent. “Here, laws are crafted to suit the whims and interests of the ruling elite. Such bluster is not new — dictators like Musharraf also made similar threats, which were ignored then and will be ignored now,” the statement said. “These salaried spokespeople simply recite scripted lines for the media. No one takes them seriously.”\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/06074115464a46d.png",
  "retrievedAt": "2025-10-12T02:23:33.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902347/quetta-braces-for-bnp-long-march-as-impasse-persists",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:13.000Z"
}
