{
  "title": "North America & Europe should work for free trade zone: Musk - World - DAWN.COM",
  "author": null,
  "content": "ROME: Billionaire US presidential adviser Elon Musk said on Saturday he hoped Europe and the United States would agree to join in a free-trade zone, after US leader Donald Trump unleashed heavy global trade tariffs.\n\nMusk, a Trump adviser who has been working to eliminate wasteful US public spending, spoke via video-link at a congress in Florence of Italy’s right-wing, co-ruling League Party.\n\nTrump’s sweeping tariffs announced earlier this week sent global stocks tumbling, worried allies and raised the prospect of others — including potentially the European Union — raising tariffs themselves. The EU, which faces a 20-per cent tariff, has already vowed to retaliate in “a calm, carefully phased, unified way”, EU trade chief Maros Sefcovic said.\n\nItaly’s Economy Minister Giancarlo Giorgetti, who is from the League, said earlier on Saturday the government wanted “de-escalation” with the US following Trump’s tariff announcement, and warned against imposing retaliatory tariffs.\n\nEU trade chief says ready to impose retaliatory tariff in ‘a calm, carefully phased, unified way’\n\n“I hope that the United States and Europe can establish a very close partnership,” Musk said in a video address to a gathering of the Italian hard-right party La Liga.\n\n“I hope it is agreed that both Europe and the United States should move ideally, in my view, to a zero-tariff situation, effectively creating a free-trade zone between Europe and North America,” he added in the video, posted on Musk’s social media platform X by La Liga’s leader, Deputy Prime Minister Matteo Salvini.\n\nInterviewed by League leader Matteo Salvini, Musk, who has repeatedly expressed support for right-wing parties across Europe, said he also hoped to see greater freedom of movement between Europe and the United States. “That has certainly been my advice to the president,” he added. But he reiterated his condemnation of what he saw as mass immigration.\n\nBoth groups have a hard-right agenda based on law-and-order, tax cuts and cracking down on irregular immigration. “At the end of the day, I hope it’s agreed that both Europe and the United States should move ideally, in my view, to a zero tariff situation, effectively creating a free trade zone between Europe and North America,” Musk said.\n\n“If people wish to work in Europe or wish to work in North America, they should be allowed to do so in my view,” Musk said, adding that this “has certainly been my advice to the president.”\n\nMusk, who has been close in the past to Italy’s rightist Prime Minister Giorgia Meloni and her Brothers of Italy party, has also expressed support for Salvini’s League.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:22:53.392Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902407/north-america-europe-should-work-for-free-trade-zone-musk",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:48.000Z"
}
