{
  "title": "Govt hopes US tariffs may yield win-win situation - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Aurangzeb says high-level delegation to be sent to Washington amid export concerns\n• Tax-to-GDP ratio expected to rise to 10.6pc by end-June\n• Trader tax contributions nearly double; tax filers increase to 6m\n\nISLAMABAD: Facing a decli­ning foothold in the US market, Finance Minister Muhammad Aurangzeb on Saturday unveiled plans to dispatch a high-level delegation to Washington, hoping that the evolving US tariffs regime could be turned into a win-win situation for both countries.\n\n“You should never let a good crisis go to waste. We are looking at it both as a challenge as well as an opportunity,” he said at a press conference in Islamabad.\n\nThe move to send a team to the United States is aimed at reaffirming Pakistan’s dedication to a long-term strategic alliance with the United States as a critical step to address challenges confronting Pakistan’s export sector.\n\nThe announcement comes in response to the changing US trade policy and tariffs under President Donald Trump’s administration. The United States remained Pakistan’s leading export destination in FY24, with exports totalling $5.442 billion.\n\n“We are going to finalise our recommendations to the prime minister in the next few days,” Mr Aurangzeb said. He said that after the approval of the premier, a high-level delegation would leave for Washington to get Pakistan’s view across and to ensure that Islamabad want to be a long-term strategic partner.\n\nMr Aurangzeb said that two committees have been formed to tackle emerging challenges, including a steering group led by Mr Aurangzeb himself and a working group headed by the commerce secretary. Over the past few days, these groups have convened multiple meetings, with plans to continue discussions aimed at turning obstacles into opportunities.\n\n“We view this as both a challenge and an opportunity,” said Mr Aurangzeb, emphasising the government’s proactive engagement in addressing the issue. He noted that a comprehensive package is being developed, which, once finalised, would be presented to the US administration for discussion.\n\nThe minister underlined the importance of fostering a medium- to long-term, mutually beneficial partnership between Pakistan and the United States.\n\nOn the IMF issue, the minister said that a new Fund mission would come for the budget discussion. He said that the delay in the staff-level agreement was due to the need to develop consensus with all stakeholders, especially provinces, over the commitments for implementation.\n\nHe claimed that Pakistan went through the quantitative benchmark and structural benchmarks. “We are on track on our commitments,” he said. “We are monitoring compliance to the benchmarks on a monthly basis.”\n\nHe mentioned that the structural benchmarks also witnessed historic development, adding that the agriculture income tax through the provincial assemblies was a historic development.\n\nAfter the IMF board approval, Pakistan is set to receive about $1bn in terms of the next tranche, which is there under the current EFF programme. He said negotiations on the Resilience and Sustainability Fund (RSF) also continued, though the fund will be linked with the implementation of the commitments.\n\nThe minister also claimed that the government was undertaking structural reforms to end reliance on the IMF. He said that negotiations with China were at an advanced level over debt issues.\n\nTaxation, revenue growth\n\nOn taxation, the minister said the country’s tax-to-GDP ratio was projected to reach 10.6 per cent by the end of June — an increase of 1.8 percentage points in a year. He praised the Federal Board of Revenue (FBR) for improving collection, noting that tax contributions from traders nearly doubled to Rs413bn from Rs189bn last year.\n\nThe number of tax return filers has also risen to six million. Mr Aurangzeb said return filing would be simplified for salaried individuals in the upcoming budget.\n\nInflation, interest rates\n\nMr Aurangzeb noted that inflation had dropped to 0.7pc — the lowest level in nearly six decades. He said the government is working with the provinces to ensure that this benefit is passed on to the public.\n\nHe also pointed out that the interest rate currently stands around 12pc. “In my personal view, there is room to reduce it further,” he said. The fall in markup rates has also led to a lower Karachi Interbank Offered Rate (Kibor), providing relief to the industrial sector.\n\nHe said that business, investor and consumer confidence were on the rise, supported by increased activity in the capital market, as indicated by various reports.\n\nThe minister said that new investors were entering the capital market, and the government expected more to follow.\n\nOn the external front, Mr Aurangzeb expressed optimism that remittances would hit a record $36bn this financial year.\n\nStructural reforms, fiscal sustainability\n\nThe minister also spoke at length about the economic stability and sustainability and the government’s aim to drive growth through export-led, production-led and private sector-led strategies, focusing on increasing foreign exchange reserves, promoting business confidence and implementing structural reforms.\n\n“We are quite confident that the foreign exchange reserves will be a little over $13bn by the end of June,” he said.\n\nHe said economic activity during the Eid period also surged, with spending rising to Rs870bn compared to Rs720bn last year.\n\nThe minister announced significant developments across key sectors, focusing on energy, structural reforms and debt management.\n\nIn the energy sector, he mentioned a major reduction in electricity tariffs for industries, with rates dropping by one-third.\n\nHe also emphasised ongoing restructuring efforts in the National Transmission and Despatch Company (NTDC) and distribution companies (Discos) to enhance sustainability.\n\nHe highlighted restructuring plans across federal ministries, noting that 400 departments are currently under review. The government has approved the first two phases of downsizing and rationalisation, with two more phases to be presented to the cabinet soon.\n\nA fifth phase is underway, and a complete analysis is expected by June, with tangible impacts expected in the next budget.\n\nOn debt management, the minister reported progress in extending debt maturity to 3.5 years, which will result in projected savings of Rs1 trillion in debt servicing costs.\n\nPublished in Dawn, April 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/06082442e3e99cf.jpg",
  "retrievedAt": "2025-08-25T14:01:20.243Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902350/govt-hopes-us-tariffs-may-yield-win-win-situation",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T00:57:13.000Z"
}
