{
  "title": "40 dengue cases reported in 24 hours; 1,742 fogging operations carried out in ICT",
  "author": null,
  "content": "ISLAMABAD, Oct 2 (APP):The Islamabad Capital Territory (ICT) administration on Thursday revealed that the Federal Capital has recorded 40 new dengue cases in the past 24 hours, and authorities conducted 1,742 fogging operations across the city as part of a large-scale anti-dengue campaign.\nThe campaign, launched under the supervision of the Deputy Commissioner (DC) Islamabad, involves continuous monitoring, awareness drives, and targeted actions against dengue breeding sites, said the spokesman of ICT administration here.\nIn this regard, an important meeting chaired by the DC brought together medical experts to review recommendations for curbing the spread of dengue larvae.\nAssistant Commissioners have been deployed in different areas to oversee house-to-house fogging operations. The district administration said the officials are ensuring that fumigation is carried out in both residential and commercial zones. Special attention is being given to areas identified as hotspots for dengue.\nDuring the last 24 hours, field teams conducted 977 inspections across Islamabad. These inspections led to the identification of 19 positive hotspots where dengue larvae were found and 19 negative hotspots where no breeding was detected.\nAlongside fumigation, teams are also running a door-to-door awareness campaign. Residents are being briefed on preventive measures, including removal of stagnant water and proper waste disposal, to eliminate potential breeding grounds for mosquitoes.\nThe district administration confirmed that fogging was carried out at 1,742 locations in a single day. Officials stressed that the operations are aimed at covering all reported areas, especially localities where new cases have been detected.\nThe meeting chaired by the DC emphasized coordinated efforts between the administration, health professionals, and field teams. Experts reviewed the progress of preventive measures and put forward recommendations for stricter monitoring in high-risk zones.\nThe district administration stated that the campaign will continue with daily inspections, fogging, and public awareness activities until the risk of dengue subsides. Teams have been instructed to maintain close coordination with local health facilities to track new cases and respond promptly in affected areas.\nAuthorities urged citizens to cooperate with inspection teams and take preventive steps at the household level to support the ongoing anti-dengue drive.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:46:34.351Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/40-dengue-cases-reported-in-24-hours-1742-fogging-operations-carried-out-in-ict/",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T16:09:00.000Z"
}
