{
  "title": "KP holds great potential for business, investment: Acting President",
  "author": null,
  "content": "PESHAWAR, Oct 02 (APP):Acting President and Chairman Senate, Syed Yousuf Raza Gilani while addressing the Pakistan Business Summit here Thursday said that Khyber Pakhtunkhwa holds great potential for business and investment.\nHe expressed satisfaction that the summit had been organised to explore ways of boosting Pakistan’s economic growth and development.\nGilani said that Pakistan’s economy was moving towards stability and that new opportunities for trade and investment were opening up.\nHe noted that both local and international investors were showing confidence in Pakistan, as the government continued its efforts to ensure a secure and supportive environment for business.\nHe emphasised that Pakistan’s young population, which makes up around 60 percent of the country, is its greatest strength. He said that empowering the youth and helping them realise their potential is vital for a prosperous future.\nGilani also highlighted the importance of tourism, recalling that during his tenure as Minister for Tourism, he had established the Malam Jabba chairlift to encourage tourism in the region.\nSpeaking about Pakistan’s struggle against terrorism and extremism, the Acting President said that when dialogue failed, the government was left with no choice but to take firm action.\n“When we stood up against terrorism and extremism, the whole world supported Pakistan,” he said. He added that more than 2.5 million internally displaced persons were successfully rehabilitated within 90 days, in collaboration with the international community, which was a remarkable humanitarian effort that gained global recognition.\nGilani shared that despite personal hardship, including the abduction of his son by terrorists, he chose the path of peace, progress and cooperation with the international community. He said that Pakistan’s sacrifices in the fight against terrorism, made by its people, armed forces, police, Levies and Frontier Corps, must never be forgotten or allowed to go in vain.\nHe recalled that as Prime Minister, he had invited 14-year-old Malala Yousufzai to his office and presented her with a national peace award for her courage and commitment to education, long before she received international acclaim.\nGilani said that Pakistan and Afghanistan are bound by geography, faith, culture and history, describing the two countries as “twin brothers.” He added that a peaceful and stable Afghanistan is in Pakistan’s best interest and expressed hope that Afghan soil would never be used against Pakistan.\nHe reaffirmed Pakistan’s commitment to maintaining constructive relations with Afghanistan as well as with all neighbouring countries, including China, Russia and Iran.\nReflecting on his interactions with world leaders, Gilani said that Pakistan has always sought peace and dialogue in the region. Referring to the aftermath of the Mumbai attacks, he said that Pakistan had offered full cooperation and proposed resuming talks to resolve all outstanding issues, including Kashmir, Siachen and terrorism.\nIn conclusion, the Acting President said that nations learn from their mistakes and must move forward with unity and wisdom. Quoting an Urdu verse, he said, “Lamhoon ne khata ki thi, sadiyon ne saza paai,” reminding that Pakistan cannot afford further errors. “We have learned from our experiences. Now we must build a future founded on peace, stability and progress,” he said.\nHe expressed confidence that closer cooperation between the public and private sectors, together with lasting regional peace, would help strengthen Pakistan’s economy and create a more prosperous future for its people.\nGovernor Khyber Pakhtunkhwa Faisal Karim Kundi, senior PPP leaders and members of the business community were also present.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:44:53.808Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kp-holds-great-potential-for-business-investment-acting-president/",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T21:55:00.000Z"
}
