{
  "title": "CCP approves Systems Ltd’s acquisition of BAT SAA Services",
  "author": null,
  "content": "ISLAMABAD, Oct 2 (APP):The Competition Commission of Pakistan (CCP) has approved the proposed acquisition of SAA Services (Private) Limited by Systems Limited from the British American Tobacco International Holdings (UK) Limited.\nThe transaction, executed under a Share Purchase Agreement, was reviewed under Phase-I of CCP’s merger assessment framework in accordance with the Competition Act, 2010,said a release issued here on Thursday.\nSystems Limited, a leading Pakistani technology company in software development, BPO, and cloud services, will acquire full ownership of the captive service provider which currently operates within the global British American Tobacco Group.\nThe entity provides IT and IT-enabled services such as HR, finance, procurement, and digital technology to group companies, without serving any external customers in Pakistan or internationally.\nAfter conducting its review, CCP concluded that the transaction raises no competition concerns as the target’s operations are confined to the BAT Group and there is no overlap with Systems Limited in the domestic BPO sector. The Commission observed that while both companies are in the IT and IT-enabled services space, their customer bases are distinct and the deal does not consolidate market power or reduce competition.\nThe acquisition is expected to bring strategic and economic benefits, enabling Systems Limited to leverage global expertise and best practices to enhance service offerings in Pakistan. It is also aligned with national objectives of job creation, technology transfer, and digital transformation of the economy.\nThe CCP has accordingly authorized the transaction under Section 31(1)(d)(i) of the Competition Act, 2010, determining that it will not create or strengthen a dominant position in the relevant market.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:45:46.107Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ccp-approves-systems-ltds-acquisition-of-bat-saa-services/",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T18:09:00.000Z"
}
