{
  "title": "Afghanistan rejected notion of border market, Senate panel told - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Senate functional committee was informed that Afghanistan has rejected the notion of a border market, and progress on the proposal with Iran is slow owing to what the commerce ministry officials claimed the Iranian government’s inordinate delay.\n\nThe Senate committee on problems of less developed areas was chaired by Senator Agha Shahzaib Durrani to discuss initiatives launched by the commerce ministry to promote local trade facilities, including border markets in less developed border areas.\n\nOfficials of the commerce ministry said that the government has initiated border markets with Iran and Afghanistan. While the physical structure of the border market with Iran is in place, Afghanistan has rejected the proposal.\n\nOn the issue of implementation of the project with Iran, the officials claimed that the border market has not become operational due to ‘excessive delays’ from the Iranian government and lack of road connectivity in the region. Importantly, the government has also notified a duty concession for the border markets.\n\nSenator Manzoor Ahmed Kakar said that in a recent meeting of a trade delegation with Iranian officials, the Iranian officials have said that the border markets have been delayed due to delays on the part of the Pakistan government.\n\nThe committee, in order to identify the cause of the delay, recommended the ministry to provide details of communications held with the Iranian government within seven days. Fur­thermore, the committee deliberated on the policy guidelines concerning the certificate of origin for Iranian-origin goods and the way forward to streamline the Pak-Iran trade issues.\n\nOfficials further said that trade with Iran cannot be conducted through normal banking channels due to existing US sanctions on Iran. However, the Balochistan High Court has exempted the import/export form for trade with Iran in its stay, which was vacated in October of last year.\n\nAfterwards, the government introduced a 45-day waiver for Iranian-origin products, which has also expired.\n\nSenator Shahzaib Durrani questioned the fate of the goods ordered before the expiry of the waiver, for which the payment has been made and which are currently lying at the port awaiting approval.\n\nThe committee directed the State Bank of Pakistan and the commerce ministry to conduct a joint meeting on the issue so that the goods lying at the port could be cleared and traders could be saved from losses.\n\nThe meeting was attended by Senators Muhammad Aslam Abro, Falak Naz, Danesh Kumar, Hamid Khan, Manzoor Ahmed Kakar, Secretary of Cabinet Division Kamran Ali Afzal, Additional Secretary Finance and Revenue Amjad Mahmood and other senior officials from relevant departments.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:51:33.957Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885241/afghanistan-rejected-notion-of-border-market-senate-panel-told",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:03:28.000Z"
}
