{
  "title": "Sindh Assembly descends into chaos after rejection of MQM-P resolutions - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The private members’ day in the Sindh Assembly on Tuesday was marred by a commotion raised by opposition lawmakers after their three out of five resolutions were rejected by the treasury in view of its numeric majority in the house.\n\nMuttahida Qaumi Movement-Pakistan (MQM-P) lawmaker Muhammad Aamir Siddiqui had given the notice to move a resolution seeking establishment of an independent commission to evaluate and improve education in Sindh.\n\nOpposing the resolution, Law and Parliamentary Affairs Minister Zia Lanjar said that a commission was already there, comprising members of civil society.\n\nThe second resolution forwarded by MQM-P member Muhammad Rashid Khan pertained to alleged corruption and irregularities in the Sindh Public Service Commission.\n\nHouse urges govt to establish special care centres for autistic children\n\nThe third resolution rejected by the house was forwarded by MQM-P’s Sabir Hussain asking the provincial government to formulate a population policy to meet the future needs of the province in view of the growing population.\n\nThe law minister opposed the resolution which was rejected by the house with a majority vote.\n\nTreasury, opposition adopt two resolutions\n\nThe house unanimously adopted the resolutions presented by two MQM-P women lawmakers.\n\nMPA Fouzia Hameed moved the resolution asking the provincial government to take steps for establishment of state-of-the-art autism centres for specialised care and support for individuals with autism spectrum disorder (ASD) in the province.\n\nShe said that the rate of people with ASD was increasing, while proper facilities were not available for them. She asked the provincial government to establish autism centres in all major cities of Sindh.\n\nWelcoming the resolution, Health Minister Dr Azra Fazal Pechuho said that the provincial government was already working for the disabled people across the province.\n\nShe said that this resolution would bring happiness to the children and families who were facing this condition.\n\nThe health minister said that the provincial government was providing treatment and training to children living with autism. “Vocational training can also be given to these children”, she added.\n\nThe minister said there were no clinical psychologists in every district as there was a shortage of them.\n\nShe said that rehabilitation centres would be established for children suffering from autism in every district.\n\nThe health minister said that the largest autistic centre in the province was located near the Dr Ruth Pfau Civil Hospital Karachi.\n\nThe resolution was adopted unanimously by the house.\n\nThe house also unanimously adopted the resolution of MQM-P MPA Farah Sohail calling for integrating gender perspective in all policies, programmes and activities.\n\nShe urged the government to ensure equal opportunities and treatment for all individuals regardless of gender.\n\nQuestion Hour\n\nDuring Question Hour, Opposition Leader Ali Khurshidi became angry and expressed concern over the replies to the lawmakers’ queries given by Social Welfare Minister Tariq Talpur, which he termed were unsatisfactory.\n\nHe said that the PPP had been ruling the province for the past 16 years, but the development projects were delayed for years. “Who should be blamed for the delay?” he asked.\n\nMQM-P Dr Abdul Basit said that he was the chairman of the Standing Committee on Social Welfare, but he was not provided relevant record and documents.\n\nThe social welfare minister said that the MQM-P MPA never contacted him and he was only “making allegations” while sitting in the House.\n\nResponding to the lawmakers’ written and verbal queries, Mr Talpur told the House that the department funded nine different non-governmental organisation (NG)s) which were working up to the satisfaction of all concerned.\n\nHe said that department officials monitored the activities of the NGOs and funding would be stopped if their working was no satisfactory.\n\nThe house also decided that the adjournment motion of PPP member Heer Soho regarding unannounced loadshedding of electricity in Sindh would be discussed for two hours on next Friday. Two motions of opposition members were also rejected by the House.\n\nLater, the house was adjourned to Friday at 10am.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:12:26.926Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885191/sindh-assembly-descends-into-chaos-after-rejection-of-mqm-p-resolutions",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:04:21.000Z"
}
