{
  "title": "PTI senators take issue with ‘contempt of parliament’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Disrupt proceedings over non-compliance with Ejaz Chaudhry’s production order\n• Law minister rules out blanket amnesty for PTI prisoners, asks them to move court\n• Dar says efforts underway to resume UK flights, inquiry ordered into controversial PIA advert\n\nISLAMABAD: After incarcerated PTI Senator Ejaz Chaudhry was not able to attend the session, the issuance of his production order by the Senate chairman, PTI lawmakers staged a noisy protest in the upper house for what they described as the ‘contempt of parliament’.\n\nAt the outset of proceedings, Senate opposition leader Syed Shibli Faraz thanked the chairman for issuing the production order. He, however, regretted that the senator was still not in the house, because the Punjab government did not want to bring to the house “the high-profile prisoner”.\n\nShibli Faraz said it was contempt of the parliament that the order had not been complied with and asked members from both sides of the aisle to protest the move. The opposition lawmakers were also seen carrying placards with pictures of the imprisoned senator and PTI founder Imran Khan during the proceedings.\n\n‘Bat judgement’\n\nThe Jan 13 judgement of the Supreme Court that deprived the PTI of its iconic bat symbol less than a month before the 2024 elections also reverberated in the upper house, with Senator Faraz calling the ruling an “attempt to disenfranchise millions of people”.\n\nWithout naming the Awami National Party, the senator said some parties were allowed to contest elections without conducting intra-party polls after a fine of a few thousand rupees.\n\nThe senator said a “puppet” government was installed after the “farce elections”, adding that fascism that started even before the elections continued. He alleged that the number of political prisoners at present was the highest ever in history.\n\nHe alleged hundreds of false and fabricated cases had been registered against the PTI leadership. The PTI senator also criticised the government’s failure on the economic front, saying they could not even sell the Pakistan International Airline, as only a sole bidder party was interested in its purchase.\n\nIn response to the criticism of the Jan 14 judgement, PML-N leader and Planning Minister Ahsan Iqbal held the PTI responsible, claiming that despite repeated reminders by the Election Commission of Pakistan, the party did not conduct intra-party elections for three years. He also blamed the party for the delayed general polls, saying that a decision for the census had been taken in 2017, but the PTI government did not conduct the exercise during its four years in power. “We had to go for digital census and as a result, the electoral process was affected,” he remarked.\n\nResponding to the criticism over a single party coming forth to bid for the PIA, he said the PTI caused a loss of billions of rupees to the national flag carrier. He said, “They defamed the PIA pilots in the world leading to a ban on PIA flights to Europe and the US.” He threatened that investigations would take place and the PTI leadership would have to face the law on the charges of ruining the PIA and the civil aviation.\n\nAbout the criticism over economic conditions, he said investment of $3 billion had come from China and work on the largest nuclear power plant having a capacity of 1200 MW had started. The noisy protest by the opposition involving sloganeering continued during the speeches from the treasury benches.\n\n‘No blanket relief’\n\nLaw Minister Azam Nazeer Tarar, meanwhile, said that the PTI demand for the release of all prisoners could not be met. He said a blanket relief for the PTI prisoners through an executive order was not possible as many of them were facing terrorism and corruption cases.\n\nThe law minister said that the government facilitated a meeting of PTI founder Imran Khan with his party’s negotiation team over the weekend. “Now a demand has come as a result of this meeting that all those jailed PTI workers and leaders who are facing terrorism, corruption and other cases should be released through an executive order,” he revealed. He advised the PTI to approach the courts to seek relief.\n\nSpeaking about the production order for the PTI leader, he said it was the duty of the authorities to implement the order, adding that the matter of the production order could be taken up in the third meeting between the government and the PTI’s negotiation committee.\n\nPIA flights\n\nDeputy Prime Minister Ishaq Dar has said the government is making all-out efforts for the restoration of the PIA flights to the United Kingdom.\n\nResponding to a calling attention notice moved by PPP’s parliamentary leader Senator Sherry Rehman, he said 22 PIA planes were currently operational. He said the privatisation process of the national flag carrier would resume soon.\n\nEarlier, Senator Rehman raised concerns over the grounding of the PIA aircraft and the ambiguity surrounding its privatisation. “The privatisation process of the PIA remains completely unclear,” Senator Rehman said, urging the government to provide clarity on the matter.\n\nSenator Rehman also raised concerns about the limited reach of PIA services, particularly to the remote areas of the country. She urged the aviation minister to provide details on the airline’s routes and fleet management. “Out of PIA’s fleet of 34 aircraft, only 19 are operational, while the rest are grounded,” she said.\n\nAn unconventional advertisement by the PIA announcing its return to Paris also came under discussion in the Senate. Mr Dar revealed that Prime Minister Shehbaz Sharif had ordered an inquiry into the advertisement of PIA.\n\nIshaq Dar wondered who conceived this advert. “You could have shown the plane flying over it (Eiffel Tower) or its tail towards the tower,” he said, adding that European analysts and security experts had also criticised the advertisement.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/15083000ecfb87a.jpg",
  "retrievedAt": "2025-10-12T01:12:26.572Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885250#:~:text=the%20treasury%20benches.-,%E2%80%98No%20blanket%20relief%E2%80%99,-Law%20Minister%20Azam",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:03:03.000Z"
}
