{
  "title": "Pakistan not formal ally, but strong partner: White House official Kirby - World - DAWN.COM",
  "author": null,
  "content": "Pakistan has played a pivotal role in US counterterrorism efforts over the years, but it has never been a formal ally bound by treaty obligations, senior White House official John Kirby has clarified.\n\nThis nuanced positioning underscores the delicate and complex nature of US-Pakistan relations, shaped by shared security concerns and divergent strategic priorities.\n\nAt a Washington briefing, White House National Security Communications Advisor John Kirby candidly addressed the nature of the US-Pakistan relationship, highlighting the absence of any formal defence pact.\n\n“Pakistan was never a technical ally of the United States. I mean, there was no treaty of alliance with Pakistan,” he stated in response to a question.\n\nDespite this, Kirby emphasised the long history of cooperation between the two countries, particularly in combating terrorism in the volatile Afghanistan-Pakistan border region.\n\n“Certainly, over many, many years in the last couple of decades, we partnered with Pakistan as appropriate to deal with the terrorist threat that still exists on that spine between Afghanistan and Pakistan,” he explained.\n\nIn August last year, State Department spokesperson Vedant Patel had reaffirmed the US’s commitment to preventing groups like the banned militant group Tehreek-i-Taliban Pakistan (TTP) from using Afghanistan as a base for launching terrorist attacks against neighbouring countries.\n\nThe next month, State Department spokesperson Matthew Miller asserted that the US would continue to stand “shoulder to shoulder with Pakistan in its fight against terrorism”.\n\nA US State Dep­ar­tment report released in December noted that Pakis­tan has made substantial progress in countering terrorist financing and addre­ssing regional extremist networks.\n\nIn the most recent bilateral engagement, Interior Minister Mohsin Naqvi and outgoing US Ambassador Donald Blome discussed strategies for addressing global challenges such as terrorism.\n\nAt the same time, Kirby also acknowledged the human cost of terrorism in Pakistan, recognising that its citizens continue to suffer from cross-border violence.\n\n“We recognise that Pakistan is still — still the Pakistani people fall victim to terrorist violence coming from across that border.\n\n“And we have, and for as long as we’ll be in office here, remain committed to working with Pakistan to address those common threats and challenges. And that’s not — that hasn’t changed. It’s not going to change,” Kirby said during the briefing.\n\nAccording to the interior ministry, 351 civilians and 573 law enforcement agencies (LEAs) personnel lost their lives in 1,566 terrorism incidents in the first 10 months of 2024.\n\nThis acknowledgement reflects a broader trend in the Biden administration’s policy toward Pakistan: a focus on shared security challenges while steering clear of deeper strategic commitments. Washington’s reluctance to treat Pakistan as a formal ally mirrors its broader approach to avoiding entanglement in Pakistan’s internal political dynamics.\n\nFor instance, when asked to comment on alleged firing at a PTI rally on November 26, State Department Spokesperson Matthew Miller maintained a measured stance.\n\n“We want to see any protests be peaceful, and we want to see the government of Pakistan, as is true with any government around the world, engage with peaceful protests respectfully and to deal with them peacefully,” he said.\n\nThis careful approach extends even to strategic issues such as Pakistan’s missile programme. Last month, when the US sanctioned three Pakistani firms for their alleged involvement in supporting the country’s missile programme, Deputy Spokesperson Patel clarified the rationale behind the decision.\n\n“These sanctions that we made in Pakistan are rooted in, as I have said now three times, our longstanding concerns about their long-range ballistic missile programme. It is not a bearing on other areas of cooperation between us and Pakistan,” Patel said.\n\nThe Biden administration’s messaging, therefore, signals a deliberate effort to balance criticism with the preservation of a functional working relationship, particularly in counterterrorism.\n\nAt the same time, the Pentagon has consistently highlighted its close ties with Pakistan’s military establishment. Spokesperson Major General Patrick S. Ryder, for instance, emphasised the enduring nature of this relationship while discussing counterterrorism efforts at a recent briefing.\n\n“We value Pakistan as a partner in the region and have worked closely with Pakistan on counterterrorism efforts in the past and will continue to have those conversations,” he said.\n\nIn another statement, Ryder underscored Washington’s commitment to supporting Pakistan in combating terrorism. “In terms of Pakistani military strategy, as we’ve discussed before, the US of course values Pakistan as a partner when it comes to areas like counterterrorism,” he stated, adding that such discussions would continue.\n\nThis careful balancing act — acknowledging Pakistan’s importance in addressing shared security concerns while avoiding deeper strategic obligations — has defined the Biden administration’s approach. It reflects the enduring complexity of US-Pakistan ties, shaped by decades of collaboration, mistrust, and shifting geopolitical priorities.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:42:07.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885350/pakistan-not-formal-ally-but-strong-partner-white-house-official-kirby",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T10:02:16.000Z"
}
