{
  "title": "Private firms urged to use Gwadar port - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Tuesday sought private sector support in routing their cargoes through Gwadar Port whose capacity utilisation has remained far short of its potential owing to insufficient marketing.\n\nAt a meeting on the commercialisation of the port, the National Logistic Cell (NLC) contested criticism from the Planning Commission over its purported higher rates. The meeting, second in less than a week and presided over by Planning Minister Ahsan Iqbal, had been called on the prime minister’s directives.\n\nThe management of the NLC presented a report on the port tariff plan as called for in the Jan 8 meeting. It asserted that not only was the state-run freight operator entirely focused on transporting shipments to and from Gwadar port, but its rates were very reasonable compared with other ports in the region.\n\nThe minister told the participants that the prime minister had issued directives for devising short- and medium-term strategies to operationalise Gwadar Port effectively within six months. He emphasised the importance of comparing Gwadar’s trade costs with other regional ports.\n\nHe urged the private sector to share detailed proposals to enhance trade through Gwadar port, assuring full government support in providing relevant data and trade and transport facilitation.\n\nHe also asked the participating entities to help the private sector bring more shipments to Gwadar, which had handled traffic mainly through government initiatives so far.\n\nThe minister tried to address concerns regarding Gwadar’s infrastructure saying that “there are no water issues due to the availability of a desalination plant, and most areas now have access to electricity”.\n\nRegarding the port’s capability to handle significant cargo volume, the minister said the facility previously handled 600,000 tonnes efficiently.\n\nHe also reminded the participants of Gwadar’s potential as a key hub for trade with Central Asian Republics, given its proximity and capability to handle imports and exports efficiently.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/15094656e1e85cd.jpg",
  "retrievedAt": "2025-08-26T07:42:34.976Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885214/private-firms-urged-to-use-gwadar-port",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:03:40.000Z"
}
