{
  "title": "Questions remain over India’s participation in Champions Trophy opening ceremony - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Amid the Bharatiya Janata Party government’s staunch stance of not sending its national cricket team to Pakistan, questions are arising about whether the Indian side or their captain Rohit Sharma will come to the neighbouring country to attend the opening ceremony of the Champions Trophy which is an ICC event.\n\nThe Champions Trophy will be held in Pakistan from Feb 19 to March 9.\n\nIndia, due to political strains with Pakistan, has not pla­yed any bilateral cricket with Pakistan since 2012-13 when a Misbah-ul-Haq-led squad toured India for a white-ball series. While no Indian team has toured Pakistan after the 2008 Asia Cup, Pakistan teams in the meantime have been travelling to India for different ICC events.\n\nTo accommodate India in the eight-nation Champions Trophy, a two-way hybrid model has been adopted recently by the ICC with the consent of the Pakistan Cricket Board (PCB) and the Board of Control for Cricket in India (BCCI) to hold all the Champions Trophy matches involving India in Dubai.\n\nUnder the same model, the Green-shirts will also not travel to India for any future ICC event in which India will hold Pakistan’s matches at a neutral venue.\n\nAccording to sources, the Indian media has sent several queries to the PCB in order to confirm if the BCCI or the International Cricket Council had contacted the PCB in this regard.\n\nHowever, the PCB has not received any such request despite the fact it had already conveyed to the ICC to submit the names of the squads of all participating countries including players, coaching staff and other officials to help them in issuing Pakistani visas timely.\n\nSources said that the PCB letter was meant for all the participants and not for any specific country or player.\n\n“The PCB has informed the ICC that the opening ceremony featuring all [the] teams and their captains will take place in Pakistan. This is in line with all ICC events. The PCB communique is neither country nor captain specific,” a source close to the situation told Dawn on Tuesday.\n\n“As regards visas, it is the responsibility of the host nation to provide visas to all players, officials, commercial partners, media and spectators. The PCB will fulfil this responsibility, just like it did last week when an ICC inspection team, comprising three Indian nationals, visited Karachi, Rawalpindi and Lahore venues. But traditionally all the teams have to attend the opening ceremony of the ICC events,” the source added.\n\nIt is also learnt that the ICC may ensure the participation of the Indian team and their captain in the opening ceremony through online contact.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/15115133a7726d1.png",
  "retrievedAt": "2025-10-12T00:51:19.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885205/questions-remain-over-indias-participation-in-champions-trophy-opening-ceremony",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:03:56.000Z"
}
