{
  "title": "Thousands to be evacuated after Mount Ibu eruption in Indonesia - World - DAWN.COM",
  "author": null,
  "content": "Thousands of islanders are set to be evacuated after a volcano erupted in eastern Indonesia, spewing a towering column of smoke and ash into the atmosphere, officials said on Wednesday.\n\nMount Ibu, located on the remote island of Halmahera, erupted for a fifth time this year on Wednesday, sending a column of smoke four kilometres into the sky.\n\nIndonesia’s Geological Agency subsequently raised the volcano’s alert status to the highest level.\n\n“Following the increase in Mount Ibu’s (alert) level, today we will evacuate residents in five villages,” said local disaster management head Wawan Gunawan Ali. He added that local authorities were planning to evacuate approximately 3,000 residents from nearby villages on Wednesday evening.\n\nAn AFP reporter on the ground reported that many residents had already gathered in a village hall, ready for evacuation.\n\nMount Ibu has shown a significant increase in volcanic activity since last June, following a series of earthquakes. In the first weeks of January alone, the volcano, which is one of Indonesia’s most active, erupted four times.\n\nResidents living near Mount Ibu and tourists have been advised to avoid a five- to six-kilometre exclusion zone around the volcano’s peak and to wear face masks in case of falling ash.\n\nAs of 2022, around 700,000 people were living on Halmahera island, according to official data.\n\nIndonesia, a vast archipelago, experiences frequent seismic and volcanic activity as it lies along the Pacific Ring of Fire.\n\nLast November, Mount Lewotobi Laki-Laki, a 1,703-metre twin-peaked volcano on the tourist island of Flores erupted more than a dozen times in one week, killing nine people in its initial explosion.\n\nMount Ruang in North Sulawesi province erupted more than half a dozen times last year, forcing thousands from nearby islands to evacuate.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/1517304789926ee.jpg",
  "retrievedAt": "2025-08-26T07:42:02.534Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885372/thousands-to-be-evacuated-after-mount-ibu-eruption-in-indonesia",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T12:42:55.000Z"
}
