{
  "title": "Auto sales surge 54pc in July-December - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Despite the absence of sales numbers by Saazgar Engineering Works Ltd, the entire auto sector, barring the tractor segment, showed robust sales performance during IHFY25.\n\nSales of cars, LCVs, pickups and vans surged 54 per cent to 60,676 units in July-December 2024-25 from 39,453 units in the corresponding period last year thanks to declining interest rates, increasing remittances and falling inflation.\n\nIn December 2024, car sales clocked in at 9,820 units, up by 69pc YoY and down by 3pc month-on-month (MoM).\n\nMyesha Sohail of Topline Securities linked the marginal MoM decline primarily to the end-of-year effect, with buyers postponing deliveries or purchases to obtain new-year registrations.\n\nShe said the YoY rise in car sales was driven by lowered interest rates, improved consumer confidence, and the introduction of newer variants and models.\n\nMs Sohail claimed that Kia Lucky Motors saw a 30-40pc rise in sales in 2024 compared to 2023 with volumes expected at 6,500-7,000 units. Including KIA sales, she estimated that industry car sales in 2024 are up 51pc.\n\nIndus Motor Company was the only assembler to experience a MoM decline of 25pc in December 2024 to 1,665 units from 2,194 in November 2024. However, IMC recorded 74pc higher sales in IHFY25 to 12,541 from 7,198 units. Pak Suzuki Motor Company Ltd sales in December 2024 went up by 25pc MoM and 58pc YoY to 5,903 units, thus jacking up IHFY25 sales by 40pc to 30,817 from 21,997 units in IHFY24.\n\nHonda Atlas Cars Ltd sales in December 2024 stood at 1,110 units as compared to 1,112 units in November 2024, but December 2024 sales were higher by 23pc from December 2023 of 901 units. Honda Atlas sold 7,084 units in IHFY25, up 45pc compared to last fiscal year.\n\nHyundai Nishat sales rose 14pc in 1HFY25 to 4,242 from 3,730 units in the same period last fiscal year, while December 2024 sales stood at 918 units, up by 27pc MoM and 158pc YoY.\n\nThe Saazgar Engineering Works did not release its December sales data Tractors/two and three-wheelers Sales of two- and three-wheelers increased by 43pc YoY while down 2pc MoM, totalling 118,091 units in December 2024, while 1HFY25 sales clocked in at 696,455 units from 541,821 in the same period last fiscal year.\n\nTractor industry sales remained depressed by 26pc in 1HFY25 to 17,397 from 23,411 in the same period last year.\n\nTruck and bus sales were up 84pc YoY but down 41pc MoM, reaching 193 units in December 2024. Total sales in 1HFY25 surged to 1,798 from 962 units in the same period last fiscal.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:42:35.379Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885216/auto-sales-surge-54pc-in-july-december",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:03:40.000Z"
}
