{
  "title": "‘Centre, provinces must collaborate to enrol 23m out-of-school kids’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif has called for coordination between the federal and provincial governments to enrol the 22.8 million out-of-school children and achieve other objectives of the ‘Education Emergency’.\n\nIn his address to the federal cabinet on Tuesday, the prime minister said education was a subject devolved to provinces, and the Centre should “aggressively work” with the provincial governments to address the challenge of out-of-school children, the majority of whom are girls.\n\nHe directed the federal education minister to enhance coordination with provinces on this subject.\n\nThe prime minister lauded the officials for organising the international conference on girls’ education in the Muslim world that brought together global experts.\n\nPM Shehbaz also appreciated the resumption of PIA’s flights to Europe and termed it a great achievement.\n\nHe regretted that the unfounded statements by the aviation minister during the PTI government resulted in “huge economic losses” and led to restrictions on the national carrier’s flights.\n\nHe expressed hope for the resumption of flights to London as the government was working to expand PIA’s routes.\n\nThe PM also thanked the government of Iran for a new border crossing on the Pakistan-Iran border.\n\nHe said the crossing would curb smuggling and promote legal trade between the two countries.\n\nThe meeting was told that anti-terror operations were going on across the country, with 27 terrorists eliminated in a recent operation.\n\nIT exports\n\nThe prime minister also chaired a meeting regarding the IT sector and expressed satisfaction with the steps being taken to boost IT exports to $25 billion in the next five years.\n\nHe directed the relevant authorities to simplify the current Right of Way rules to promote broadband services through fibre optics.\n\nHe also issued directions to provide the youth with IT training as per international standards to help them find jobs abroad.\n\nPM Shehbaz also ordered the authorities to facilitate foreign investors who are interested in investing in Pakistan’s IT sector.\n\nOn the recommendation of the Pakistan Software Exports Board, the PM said foreign businesspersons seeking services from Pakistani IT companies should be issued visas within 24 hours.\n\nPM Shehbaz also called for a strategy to market Pakistan’s IT sector internationally.\n\nDuring the meeting, the prime minister was briefed on measures taken to increase IT exports to $25 billion.\n\nThe current number of 1.4 million freelancers in the country will be increased to 2m over the next two years, officials told the meeting.\n\nThe meeting was attended by Economic Affairs Minister Ahad Khan Cheema, State Minister for IT Shaza Fatima Khawaja, and other senior officials.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:42:09.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885207",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:03:15.000Z"
}
