{
  "title": "Entry of vehicles into historic Muzaffarabad market banned - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: In a bid to resolve the persistent parking and traffic woes in Madina Market — the busiest and historic commercial hub of Azad Jammu and Kashmir (AJK) capital — civic authorities have banned the entry of vehicles into the market and established a parking lot on a nearby vacant land.\n\nAdditionally, measures are also being taken to facilitate shoppers and residents, including the removal of encroachments and the establishment of public restrooms in shopping plazas, said Masoodur Rehman, divisional commissioner of Muzaffarabad.\n\nSpeaking to journalists in his office on Tuesday, he said inadequate parking facilities and severe traffic congestion, particularly in the old part of the administrative capital, had long been a major concern for residents.\n\nIn keeping with the situation, AJK Prime Minister Chaudhry Anwarul Haq had directed that these issues be addressed and additional measures implemented to enhance the sprawling town’s overall appearance, Mr Rehman added.\n\nThe commissioner said the Radio Colony site, left unused after its residential quarters were razed in the 2005 earthquake, had now been repurposed into a parking lot with the cooperation of the Pakistan Broadcasting Corporation (PBC) management.\n\n“We are grateful to the PBC officials for their commendable role in resolving this major issue in the city,” he said.\n\nMr Rehman said a shuttle service had also been planned, operating between CMH Road and Hamam Wali Masjid, to assist shoppers navigating the market, which has expanded from a few shops in one street to multiple adjacent streets.\n\nFor permanent residents of the market’s neighbourhood, vehicle entry would be permitted on a scheduled basis, he said.\n\n“All permanent residents will be issued passes and only those with valid passes will be allowed to bring their vehicles inside,” the commissioner said.\n\nTo address the widespread encroachments in Madina Market and other neighbourhoods, notices were issued to traders, directing them to voluntarily remove unauthorised structures by a specified deadline.\n\n“After the deadline, a phased operation against encroachments will be launched across the city,” he warned.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/1211075355b449f.jpg?r=110811",
  "retrievedAt": "2025-08-26T07:42:22.152Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885253/entry-of-vehicles-into-historic-muzaffarabad-market-banned",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:04:33.000Z"
}
