{
  "title": "Notorious katcha gang kidnaps three Karachi youths after luring them to Ghotki - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Three young men engaged in an online business of carpet/sofa cleaning in the metropolis were lured to Ghotki on the pretext of work and kidnapped by riverine (katcha) area gangs, it emerged on Tuesday.\n\nInvestigators identified the kidnapped victims as Awais, 24, his brother Faizyab, 18, and their friend Anas, 20. They said that the abductors demanded a total ransom of Rs6 million (Rs2 million for each abductee) from their families.\n\nGhotki SSP Dr Samiullah Soomro told Dawn that the ‘Shar gang’ was involved in the kidnapping. He said that the Ghotki police, in coordination with other agencies, was working on the case.\n\nHe said that this was not a “forced kidnapping”, instead, the youths were lured by the kidnappers.\n\nPolice say victims were last traced in Ubauro\n\nReferring to the technical analysis of their cell phones, he said that the youths had arrived at the Pano Aqil interchange, from where they were taken in a vehicle.\n\nThey were moved to the katcha areas of four districts: Sukkur, Shikarpur, Kashmore and their last known location was traced to Ubauro, Ghotki.\n\nSSP-Central Zeeshan Shafiq Siddiqi told Dawn that three youths from Gulbahar, who had created a Facebook page named ‘Perfect Choice’ and were involved in cleaning carpets and sofa sets, were lured by bandits from the katcha area under the pretext of cleaning carpets and were kidnapped there.\n\nHe said that when the police learned about it through social media — after the dacoits posted a video showing all three men chained, with the kidnappers threatening to kill them unless the ransom was paid — they approached the families in Waheedabad, Gulbahar, and lodged an FIR under Section 365-A (kidnapping for ransom) of the Pakistan Penal Code on Monday.\n\nComplainant Noman Ismail told the police that his two maternal nephews, Awais and Faizyab, along with their friend Anas, were working in an online carpet/sofa cleaning business in Gulbahar.\n\nOn Jan 2, Awais received an online order for sofa/carpet cleaning from Ghotki. He spoke to his mother and the trio then travelled to Ghotki by bus.\n\nWhen they arrived in Ghotki, Awais contacted his mother from his cell phone, informing her that those who gave the order “did not seem to be good persons”.\n\nThe mother consoled her son. Soon after, both of Awais’s cell phones were turned off.\n\nOn Jan 3, at around 4pm, Awais called his mother and the complainant, informing them that they were being held by dacoits, who were demanding Rs6m as ransom for their release.\n\nIn the meantime, an unidentified person, using Awais’s cell phone, told them to arrange the ransom money, and sent a video of the kidnapped youths.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:42:22.771Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885188/notorious-katcha-gang-kidnaps-three-karachi-youths-after-luring-them-to-ghotki",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T01:04:21.000Z"
}
