{
  "title": "South Korean investigators arrest impeached President Yoon in insurrection probe - World - DAWN.COM",
  "author": null,
  "content": "South Korean authorities arrested impeached President Yoon Suk Yeol on Wednesday over insurrection allegations, with the embattled leader saying he agreed to comply with what he called an illegal probe to avoid “bloodshed”.\n\nHis arrest, the first ever for an incumbent South Korean president, is the latest head-spinning development for one of Asia’s most vibrant democracies even though the country has a history of prosecuting and imprisoning former leaders.\n\nSince lawmakers voted to stand him down after his short-lived declaration of martial law on December 3, Yoon has been holed up at his hillside residence, guarded by a small army of personal security that blocked a previous arrest attempt.\n\nA defiant Yoon said he submitted himself for questioning to avoid any violence after more than 3,000 police officers marched on his residence to arrest him from the early hours of Wednesday.\n\n“I decided to respond to the CIO’s investigation — despite it being an illegal investigation — to prevent unsavoury bloodshed,” Yoon said in a statement, referring to the Corruption Investigation Office for High-ranking Officials (CIO) that is heading the criminal probe.\n\nYoon’s motorcade was later seen leaving his residence in an upscale area known as Seoul’s Beverly Hills. It arrived at the investigators’ office but was quickly surrounded by security and moved to the back of the building, where Yoon slipped in, evading the waiting media.\n\nAuthorities now have 48 hours to question Yoon after which they must seek a warrant to detain him for up to 20 days or release him.\n\nYoon’s lawyers have said the arrest warrant is illegal because it was issued by a court in the wrong jurisdiction and the team set up to investigate him had no legal mandate to do so. A warrant to search Yoon at his residence, a copy of which was seen by Reuters, referred to Yoon as “ringleader of insurrection”.\n\nYoon’s declaration of martial law shocked South Koreans, rattled Asia’s fourth largest economy and ushered in an unprecedented period of political turmoil in one of Washington’s key security partners in the region. Lawmakers voted to impeach him and remove him from duties shortly after on Dec 14.\n\nSeparate to the criminal investigation, the Constitutional Court is deliberating whether to uphold his impeachment by parliament and permanently remove him from office or restore his presidential powers.\n\nThe United States remains committed to working with the government in Seoul and appreciates all its efforts and citizens “to act in accordance with the Constitution”, a spokesperson for the White House National Security Council said in statement.\n\nThe top government spokesperson in neighbouring Japan, Yoshimasa Hayashi, told a daily news briefing that Tokyo was following developments in South Korea “with particular and serious interest”.\n\nThe latest arrest attempt that began before dawn gripped the nation with hundreds of thousands glued to live feeds showing busloads of police arriving near the presidential residence, pushing past Yoon supporters and then walking towards the gates of the compound carrying ladders and wire cutters.\n\nAs local news broadcasters reported that Yoon’s detention was imminent, some minor scuffles broke out between pro-Yoon protesters and police near the residence, according to a Reuters witness at the scene.\n\nMeanwhile, a man set himself on fire near the corruption investigation office, where Yoon was being interrogated, the national fire agency said.\n\nThe man, in his 60s, was severely burned and unconscious following the incident which happened just after 8pm local time, the fire agency said. The Yonhap news agency had earlier reported that the man had died.\n\nThrongs of those protesters gathered in sub-zero temperatures, some wrapped in foil blankets and others waving flags bearing “Stop the Steal” slogans referring to Yoon’s unsubstantiated claims of election fraud — one of the reasons he gave to justify his short-lived martial law declaration.\n\nSome of Yoon’s supporters have drawn parallels with his plight and that of US President-elect Donald Trump, who also claimed voter fraud contributed to his election defeat in 2020 but recovered to make a stunning political comeback.\n\n“It is very sad to see our country falling apart,” said Kim Woo-sub, a 70-year-old retiree protesting Yoon’s arrest outside his residence on Wednesday.\n\n“I still have high expectations for Trump to support our president. Election fraud is something they have in common but also the US needs South Korea to fight China,” he said.\n\nDespite polls showing a majority of South Koreans disapprove of Yoon’s martial law declaration and support his impeachment, the political standoff has given oxygen to his supporters and his People Power Party (PPP) has seen a revival in recent weeks.\n\nSupport for the PPP stood at 40.8 per cent in the latest Realmeter poll released on Monday, while the main opposition Democratic Party’s support stood at 42.2pc, within a margin of error and down from a gap of 10.8pc from last week, the poll said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/15110053ffeccb1.jpg",
  "retrievedAt": "2025-08-26T07:42:07.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885335/south-korean-investigators-arrest-impeached-president-yoon-in-insurrection-probe",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T06:09:22.000Z"
}
