{
  "title": "100 days of solitude: Hunger, strife and despair in Parachinar - Pakistan - DAWN.COM",
  "author": null,
  "content": "On November 28, just a few days after over 40 people including women and children were killed in Lower Kurram, Mahir Hussain’s house in the Zeran village was lit up. He had just become a father to twins but the joy of parenthood was the last thing on the 36-year-old’s mind; Parachinar was under siege and he had nothing to feed his newborns.\n\nMarkets and businesses were closed as a curfew was imposed and mobile phone services were suspended in Kurram, a remote mountainous area in Khyber Pakhtunkhwa.\n\nMahir searched the desolate bazaars of Parachinar — a 20-minute drive from his village — for medical supplies and baby food, but after hours on the streets, he came back home empty-handed. Helpless, he resorted to cow’s milk, the only available alternative in his hometown. The desperate decision, however, exposed his children to intestinal infections and weaknesses that persist to this day.\n\nLike Mahir’s, there are several houses across Kurram reeling from over 100 days of violence that have cut them off from not just the rest of the country but also basic necessities.\n\nFrom afar, Kurram looks deceptively calm and mesmerisingly beautiful. But as you move closer, deep-rooted sectarian tensions are simmering under its fertile land. The town, bordering Afghanistan’s frontier, has seen little peace for the past several months if not years.\n\nOn September 21, gunfire and rocket attacks in the region killed 45 people and injured dozens more. By October 12, another wave of violence erupted, after a vehicle carrying passengers came under attack, killing 16 people.\n\nThen on November 21, a convoy of passenger vehicles was ambushed near Lower Kurram. The attack occurred in the Mandori Charkhel area, a region with a history of sectarian tensions and land disputes.\n\nThe situation further escalated when markets in Baggan, Lower Kurram, were set on fire on November 23, resulting in 16 casualties. These attacks — attributed to sectarian violence with suspected terrorist groups targeting Sunni and Shia populations in the region — led to widespread anger and hostility in Kurram.\n\nMore recently, reports emerged that two persons were killed and later decapitated after being waylaid on their way towards Parachinar in the Bagan area of district Kurram. Ishaq Hussain and Waseem Hussain, residents of Parachinar who had returned from abroad, had hired the services of some persons to reach Parachinar. They were intercepted by the culprits on their way, however, and shot dead followed by decapitation. This further heightened tensions in the region.\n\nThe spillover of the clashes in Kurram also seeped down to Karachi, where demonstrations and sit-ins were organised to protest the violence in Parachinar. At least 11 people were wounded in clashes between the police and protesters in the port city.\n\nThis isn’t the first time Parachinar has been under siege, with a similar situation occurring after sectarian clashes in 2007. Back then, the town remained cut off for years, relying on aid from Afghanistan and using a lengthy route to reach Peshawar.\n\nHowever, the current situation is far more complex due to the Taliban’s control in Afghanistan, the fencing of the Pak-Afghan border, and the closure of the border by Pakistani authorities.\n\nAccording to government estimates, the population of Kurram — one of the seven former tribal districts of Pakistan that borders Afghanistan — is roughly 58 per cent Sunni (primarily Deobandi) and 42pc Shia.\n\nAfter the 2018 merger of formal tribal areas into the mainstream administrative framework, Kurram, designated as a district, was divided into three regions: Upper Kurram, Lower Kurram and Central Kurram. Upper Kurram, where Parachinar town is located, is inhabited by a Shia-majority tribe with some Sunni villages nearby.\n\nLower Kurram, on the other hand, has a Sunni-majority population but it also includes a significant Shia population in Alizai. Central Kurram, incorporated into the district in recent years, is again Sunni-dominant, except for one small Shia village.\n\nIn Boshehra, a village in upper Kurram where Shia and Sunni communities reside close to each other, a bitter land dispute has escalated since 2023. Centred on a 100-kanal plot of land, the conflict, going back decades, has caused recurring clashes leading to numerous casualties.\n\nMoreover, after the Taliban’s control of Afghanistan in 2021, this violence over land disputes in Kurram has spiked, fuelled by the influx of advanced American weapons left behind by the US forces.\n\nSpeaking to Dawn.com about the deteriorating law and order situation in Kurram, Sajid Hussain Turi, a former federal minister, claimed that despite peace accords between local tribes, the presence of terror groups such as the Tehreek-i-Taliban Pakistan (TTP) has destabilised the region.\n\n“There is a need for elders from neighbouring tribal districts to play a constructive role in restoring peace,” he emphasised, urging them to prevent people from engaging in sectarian clashes, which only exacerbate the situation.\n\nSome locals have also raised questions over the government’s role in the crisis. “The ruling party’s neglect towards Kurram’s plight has allowed religious extremists to fill the power vacuum,” said PTI Kurram President Syed Akhlaq Hussain.\n\n“This neglect has exacerbated the situation and it will not bode well for the people of Kurram,” he warned.\n\nMeanwhile, Ali Afzal Afzaal, senior journalist and chairman of the Parachinar Press Club, slammed the government for “spreading misinformation” and “baseless news” about Kurram. He accused them of manipulating and distorting the truth, contradicting firsthand reports from journalists on the ground.\n\n“This has only complicated the already complex Kurram issue,” Afzaal claimed.\n\nSince November, sporadic violence stemming from Kurram’s complex and deep-rooted issues has claimed at least 130 lives. Earlier this month, a peace agreement was finally signed between the warring sides but the route connecting Parachinar with the rest of the province remained blocked, causing a severe shortage of food and medicine for Kurram’s 800,000 residents.\n\nConsequently, families, such as that of Bibi Najma, found themselves trapped.\n\nThe mother of five and resident of Parachinar has been forced to cook food without salt and tea without sugar for the past three months. Harsh winters, with temperatures plunging below zero degrees, have further exacerbated the crisis, with limited wood charcoal and unavailability of LPG (liquified petroleum gas).\n\n“All of these conditions have caused us severe anxiety and trauma,” Bibi Najma told Dawn.com.\n\nWhile authorities and aid organisations have made several attempts to provide some relief through goods convoys and helicopter deliveries of medicines, it has now become clear that sustained peace is needed to support people stranded in Upper Kurram and surrounding villages in Lower Kurram.\n\nEarlier, it was reported that at least 128 children had died in Parachinar since the conflict started almost three months ago due to the lack of resources. The death toll of patients, including children, who have lost their lives due to a lack of resources has now risen to 300, according to leaders of the Kurram District Drug Association.\n\nDr Zulfiqar Ali, a child specialist at the Parachinar District Headquarters Hospital, recalled to Dawn.com the painful instances where children suffered from severe temperatures, convulsions and nerve damage due to a shortage of medicines.\n\nDr Ali recounted that the hospital was desperately short of antibiotics, which forced doctors to send patients to pharmaceutical stores. They too were empty. “The facility also struggled with gas cuts because of which we would send patients home,” he lamented.\n\n“We were also unable to refer patients to Peshawar due to road blockades and incubation problems,” Dr Ali said, appealing that authorities should actively work on alleviating the suffering of Kurram’s people and ensure sustainable peace.\n\nEver since the hostilities surged, daily wagers in Kurram have found themselves in a tight squeeze, unable to find work. Sher Zaman, hailing from the Karman village, has been forced to survive on loans for nearly three months now.\n\nLately, however, even that is not working out. “People have refused to lend money to me because even they are struggling … how am I supposed to feed my children now?” he questioned.\n\nOn the other hand, Naveed Bangash, a frustrated resident of Sadda City, told Dawn.com how the crisis had disproportionately affected daily wagers in the region.\n\n“Wealthy individuals with interests in arms, food commodities, and petroleum have exploited the situation for personal gain,” he said, lamenting that illiterate poor people from various tribes were being scapegoated and bearing the brunt of the conflict.\n\nTraders in Kurram don’t have it any better either. Upper Kurram has been facing severe challenges since October 12, where areas such as Teri Mengal, Gabazana, and others have remained cut off for three months due to closed borders and roads, leading to immense misery for the residents.\n\n“We’re facing unprecedented challenges,” said Nazir Ahmed, president of the Trade Union Parachinar. “With the roads blocked for over three months, our stocks have depleted, and we’re unable to receive new shipments.”\n\nHe lamented that the situation was exacerbated by the uncertain condition of the road, which according to Ahmed, would sporadically open only to be shut soon after. “Since 2021, the road has been open for only 10 days at a time, followed by 20 days of closure. This has brought our business to a standstill.”\n\nAhmed emphasised that traders were not just facing a loss of business, but also incurring significant expenses due to the shutdown. “We’re still paying rent, salaries, and other expenses, even though our shops are empty and our warehouses are depleted,” he told Dawn.com.\n\nHe warned that the trading community was on the verge of collapse. “We’re not just struggling to stay afloat; we’re facing complete ruin. Our shops are empty, and we’re running at a loss. If the situation doesn’t improve, we’ll be forced to shut down our businesses permanently.”\n\nHe too appealed to the authorities to take immediate action to resolve the crisis. “We urge the government to intervene and find a solution to this crisis. We can’t keep our businesses running under these conditions. We need help, and we need it now,” Ahmed stressed.\n\nKurram’s complex issues are deeply rooted in its history, with sectarian clashes, tribal rivalries, and terrorist activities creating a volatile environment. Having witnessed the recent tragic events in the district raises a critical question: Can this cycle of bloodshed ever stop? Or is this violence destined to repeat?\n\nLocal leaders who spoke to Dawn.com all concurred that the government needed to play a concrete role in addressing the region’s challenges, including adopting a multifaceted approach, implementing policy reforms, addressing administrative gaps and promoting interfaith harmony.\n\nMalak Rasheed Zaman, chairman of the village council in Boshehra, called for the implementation of the Murree Accord of 2008 in which the warring Bangash and Turi tribes of Kurram signed a written declaration for permanent peace.\n\nHe also emphasised resolving land disputes to address the root causes of the conflicts, further stressing the importance of cracking down on social media handlers spreading sectarian hatred.\n\nMeanwhile, Jalal Hussain Bangash, secretary of the Anjuman-e-Hussainia Parachinar — a religious, political and social Shia organisation — said: “We’ve been suffering for a long time, but the past three months have been particularly devastating.”\n\nHussain demanded that the government ensure its writ to put a halt to the terror situation in Kurram. He welcomed the recent 14-point agreement signed by Shia and Sunni elders of Kurram but stressed that its implementation is crucial.\n\nThe seven-page agreement was signed on Jan 1 after weeks of discussions and deliberations. The pact called for a ban on the display of arms while bunkers will also be destroyed. Moreover, safe passage will be assured on all thoroughfares.\n\nHowever, as Hussain said, the agreement would be worthless if not implemented properly. “The government must hold violators accountable, regardless of their affiliation. Selective enforcement of the law only encourages extremists to disrupt the peace process,” he said.\n\nHe urged the authorities to apply the rules equally to all parties. “Section 144 is in place, but it’s being violated with impunity. The government must take responsibility for enforcing the law and maintaining peace.\n\n“The peace agreement is a step in the right direction, but it’s up to the government to make it a reality. If they fail, innocent people will continue to suffer, and the bloodshed will never end,” Hussain added.\n\nHussain’s words were also echoed by Muneer Bangash of the Anjuman-e-Farooqia — an organisation representing the displaced Sunni people of Parachinar — who called for the implementation of the latest peace treaty.\n\n“Despite its natural beauty, this region has been plagued by two years of unrest and sectarianism which has led to a lack of tolerance among the youth,” he said.\n\nMuneer identified two primary reasons for Kurram’s instability: the non-implementation of the Murree Accord and the prevalence of sectarianism. “To restore peace, we must prioritise collective benefits over personal interests,” he highlighted.\n\nHe called for promoting tolerance and discouraging sectarianism among the youth, adding that land disputes needed to be addressed based on local customs and revenue records and not on sectarian grounds.\n\nHeader image: A man sits with an infant in his lap in Parachinar. — All photos by author",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/14140709ce155c6.png",
  "retrievedAt": "2025-08-26T07:42:09.201Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884905/100-days-of-solitude-hunger-strife-and-despair-in-parachinar",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T05:58:39.000Z"
}
