{
  "title": "World Bank pledges $20bn to Pakistan under 10-year partnership framework - Business - DAWN.COM",
  "author": null,
  "content": "The World Bank has pledged to provide $20 billion to Pakistan under the 10-year country partnership framework (CPF) to support inclusive and sustainable development within the country, an official statement said.\n\nAccording to the statement, the new framework for the country aimed to “support inclusive and sustainable development through a strong focus on building human capital”, in addition to fostering durable private sector growth.\n\n“Our new decade-long partnership framework for Pakistan represents a long-term anchor for our joint commitment with the government to address some of the most acute development challenges facing the country: child stunting, learning poverty, its exceptional exposure to the impacts of climate change, and the sustainability of its energy sector,” said World Bank Country Director Najy Benhassine.\n\nOut of the total amount, $20bn would be provided through International Development Association (IDA) and International Bank for Reconstruction and Development (IBRD).\n\nThe framework, according to the statement, aimed to focus to on several critical areas such as reducing child stunting through increased access to clean water and sanitation services; decreasing learning poverty through quality education; increasing resilience to floods and other climate-related disasters; increasing fiscal space and better management and more progressive public expenditures for development; and increasing productive and inclusive private investment to improve external trade balances.\n\nSpecific goals of the framework also included increasing tax-to-GDP ratio to over 15 per cent and adding 10 Gigawatts of renewable energy capacity.\n\nOn the energy side, the World Bank document on the framework stated one of its aims to develop a financially sustainable energy sector, adding that this would be achieved through reforms and investments, including in the transmission and distribution (T&D) sector “to reduce losses and geographical imbalances between consumption and generation”.\n\nAdditionally, the framework laid a special focus on sustainable development goals (SDGs), such as providing quality education to 12 million Pakistani students and delivering healthcare services to 50m citizens.\n\nThe CPF also seeks to provide safe drinking water and sanitation facilities to 60m people, strengthen food security for 30m individuals, and increase access to family planning services for 30m women.\n\nAdditionally, the CPF includes objectives to address flood and disaster risks, which would benefit 75m people across the country.\n\nPer the statement, the 10-year framework is “well aligned with key objectives of the recently launched National Economic Transformation Plan, Uraan Pakistan, and those of the Prime Minister’s Economic Transformation Agenda and Implementation Plan”.\n\nFurthermore, the framework priorities were formed through extensive consultations across the country with key stakeholders.\n\nPakistan has been a member of the World Bank since 1950. So far, the Bank has provided $48.3bn in assistance to the country.\n\nThe Bank’s programme in Pakistan is governed by a Country Partnership Strategy with four priority areas of engagement: energy, private sector development, inclusion, and service delivery.\n\nThe current portfolio for IBRD, IFC and MIGA in Pakistan include 106 projects and a total commitment of $17bn.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/15112339daf3df3.jpg",
  "retrievedAt": "2025-08-26T07:42:07.957Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885337/world-bank-pledges-20bn-to-pakistan-under-10-year-partnership-framework",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T07:05:26.000Z"
}
