{
  "title": "Doctors warn of protest over privatisation of hospitals - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Young Doctors Association (YDA) of the country has threatened to launch a countrywide protest and boycott of hospitals if the Balochistan government did not stop its planned move to privatise 11 public sector hospitals of Balochistan and release all doctors arrested in Balochistan within 48 hours.\n\nSpeaking at a press conference in Islamabad on Tuesday, members of YDA demanded immediate release of all young doctors arrested in Balochistan and withdrawal of cases registered against them. It also demanded to stop raids at houses of doctors and harassment of medical community.\n\nThe press conference was addressed by YDA President Dr Atif Majeed Chaudhry, Patron In-chief Dr Omer Sultan, Chairman Dr Rizwan Kundi, spokesperson Dr Faiz Khan Achakzai and others.\n\nThe YDA leaders urged PPP leader Bilawal Bhutto-Zardari to intervene in the serious matter as his party was in power in Balochistan and the PPP has always claimed to follow pro-worker policies.\n\nYoung Doctors Association demands release of all held doctors and withdrawal of cases against them\n\nSpeaking on the occasion, Dr Achakzai said the government of Balochistan has decided to now run 11 public sector hospitals through public-private partnership without taking young doctors into confidence over the issue as this action of the provincial government will adversely affect stakes of civil servants.\n\n“The Director General of Health of Balochistan, Amin Mandokhel, exchanged heated arguments with leaders of YDA and then got an FIR registered against them and because of this Dr Bahadur Shah and Dr Hafeez Mandukhel have been arrested and law-enforcement agencies have been raiding houses of other doctors including Dr Yasir, Dr Saboor, Dr Zarqoon and others,” he said.\n\n“We have video evidence that the DG Health used abusive language against doctors and now action is being taken against young doctors to stop any resistance and protest against the privatisation of the hospitals,” the YDA leaders said.\n\nThey said that doctors have already started boycott of outpatient departments (OPDs) in Balochistan, but now the YDA has decided to extend the scale of the protest across the country if the Balochistan government does not stop its privatisation of public sector hospitals and withdraw FIRs filed against the doctors within 48 hours.\n\nDr Atif Chaudhry said that doctors from all parts of the country have now reached the National Press Club, Islamabad, as they feared their arrest.\n\nThe YDA leaders appealed to the Chief Justice of Pakistan and Army Chief to take notice of the situation as the provincial government’s planned privatisation move will further aggravate the already worsening law and order situation in Balochistan.\n\nDr Rizwan Kundi said that young doctors were also suffering in Khyber Pakhtunkhwa and said that the entire medical fraternity of the country is united on the demands of YDA.\n\nMeanwhile, the Young Consultants Association Pakistan chairman, Dr Asfandyar Khan, has condemned the arrest of young doctors of Balochistan and demanded their immediate release.\n\nPublished in Dawn, January 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:51:20.150Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885327/doctors-warn-of-protest-over-privatisation-of-hospitals",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T04:03:06.000Z"
}
