{
  "title": "Military strongly reacts to Indian army chief calling Pakistan ‘epicentre of terrorism’ - World - DAWN.COM",
  "author": null,
  "content": "The military on Wednesday strongly reacted to the Indian army chief calling Pakistan the “epicentre of terrorism”, saying that instead of trying to “conjure up non-existent terror infrastructure in Pakistan, it would be wise not to indulge in self-delusion”.\n\nThe statement from the the Inter-Services Public Relations (ISPR) came in response to Indian Army Chief General Upendra Dwivedi’s remarks during a press conference on Monday, ahead of India’s Army Day, when he claimed that in 2024, “60 per cent of the terrorists eliminated” in Indian-occupied Kashmir (IoK) were allegedly of Pakistani origin.\n\nGeneral Dwivedi further alleged that “80pc of the remaining fighters in IoK were of Pakistani origin”, according to the Press Trust of India.\n\nIn a strongly-worded response today, the Pakistani military said: “Insinuating Pakistan as the epicentre of terrorism by the Indian Army chief is not only contrary to facts but also an exercise in futility to beat the dead horse of India’s default position — blaming Pakistan for indigenous reaction to state-sponsored brutality. It is a classic case of extreme duplicity.”\n\nThe statement added that the remarks were being made in an “attempt to deflect the world’s attention from India’s brutality in Indian Illegally Occupied Jammu and Kashmir (IIOJK), repression of minorities internally and India’s trans-national repression”.\n\nIt continued: “The general officer, in his earlier stint in llOJK personally oversaw the most brutal repression of Kashmiris. Such politically motivated and fallacious statements reflect the extreme politicisation of the Indian Army.”\n\nGeneral Upendra Dwivedi officially took over as the Indian Army chief on June 30, 2024. His command appointments include leading the 18 held-Jammu and Kashmir Rifles regiment, the 26 Sector Assam Rifles brigade, and serving as inspector general of Assam Rifles and the Indian Army’s 9 Corps.\n\nHe has also served as Northern Army Commander for the Indian army where he oversaw the Indian Army Corps in Occupied Kashmir and the Chinese border and played an important role in India’s ongoing negotiations with China to resolve border issues.\n\nThe statement further mentioned that the world was witness to India’s “hate-speech conclave that provoke genocide against Muslims”, adding that the international community was “not oblivious to India’s trans-national assassinations and Indian Security Forces’ oppressive use of force against innocent civilians and gross human rights violations against unarmed Kashmiris”.\n\n“Such oppression has only served to strengthen the resolve of Kashmiris for their right of self-determination, enshrined in the UN Security Council Resolutions,” it said.\n\nThe ISPR said that “instead of trying to conjure up a non-existent terror infrastructure in Pakistan, it would be wise not to indulge in self-delusion, and appreciate the ground reality.”\n\nReferring to Indian spy agent Kulbhushan Jadhav’s 2016 arrest, who confessed to fomenting terrorism in Balochistan and Karachi, the military said: “The sobering fact that a senior serving Indian military officer is in Pakistan’s custody, caught red-handed while orchestrating acts of terror against innocent civilians inside Pakistan, seems to have been conveniently ignored by the general.\n\n“Pakistan takes strong exception to such baseless and unfounded statements.”\n\nThe statement concluded by saying that Pakistan “empathised with the victims of the Indian Army’s brutality”.\n\n“It is hoped that civility, professionalism and norms of state-to-state behaviour would guide the conduct of Indian Army’s leadership, rather than pandering to political exigencies.”\n\nSeparately, the Foreign Office (FO) also issued a statement today saying that Pakistan “strongly rejected” the remarks issued by India’s defence minister and chief of army staff on Monday and Tuesday, respectively.\n\nIndian Defence Minister Rajnath Singh said on Tuesday that India must “dismantle Pakistan’s terror infrastructure” in Azad Jammu and Kashmir (AJK), The Hindustan Times reported. Addressing an Army Day event in Akhnoor, Singh had said IoK was “incomplete” without AJK, calling it “the crown jewel of India”.\n\nThe minister made these remarks in response to AJK Prime Minister Chaudhry Anwarul Haq, who said last week that his government would “redirect all available resources towards ousting Indian forces from occupied Kashmir”.\n\nThe FO stressed that IoK remained an “internationally recognised disputed territory, whose final status is to be determined in accordance with relevant United Nations Security Council (UNSC) resolutions and the aspirations of the Kashmiri people”.\n\n“In this context, India has no legal or moral grounds to assert fictitious claims over the territories of AJK and Gilgit-Baltistan,” the FO asserted.\n\nIt further said, “Such rhetoric from the Indian leadership cannot divert international attention from the grave human rights violations and oppressive measures being carried out in IIOJK,” noting that India’s actions “suppress the legitimate and just struggle of the Kashmiri people for their inalienable right to self-determination”.\n\n“Pakistan also underscores that provocative statements of this nature are counterproductive to regional peace and stability,” the FO statement said.\n\nIt highlighted the issue of extra-territorial killings — including in Pakistan — which, according to multiple reports by international media outlets, were carried out by the Indian government.\n\n“Instead of levelling baseless allegations against others, India must introspect and address its own documented involvement in orchestrating targeted assassinations, acts of subversion, and state-sponsored terrorism in foreign territories,” the FO said.\n\nA recent report in the Washington Post has laid bare the ins and outs of an Indian intelligence campaign, which has been orchestrating killings — on Pakistani soil — of individuals it deems a threat to its national interests\n\nAccording to WaPo, the Research and Analysis Wing (RAW) has been running an assassination campaign in Pakistan since 2021, an operation that shares similarities with covert actions recently attributed to Indian agencies in North America.\n\nBased on interviews with Pakistani and Indian officials, militant associates, family members, and a review of police documents, the report documents six killings in Pakistan that are allegedly part of this coordinated effort.\n\nThe report notes that India extended this campaign beyond Pakistan, employing similar tactics in North America against Sikh activists, including Hardeep Singh Nijjar in Canada and Gurpatwant Pannun in the United States.\n\nThe report draws comparisons between the tactics used in Pakistan and similar Indian operations against Sikh activists in Canada and the US. In both cases, Indian operatives allegedly relied on local criminal networks and poorly trained contractors.\n\nHowever, these operations faced significant setbacks in North America, including the plot to assassinate Sikh activist Gurpatwant Pannun in New York. The assassination attempt failed when an intermediary unknowingly approached a Drug Enforcement Agency (DEA) informant posing as a hitman.\n\nCanadian officials have also accused Indian diplomats of surveilling, intimidating and plotting to assassinate Sikh activists. Electronic communications reportedly linked these diplomats to such activities, further straining relations between India and Western nations.\n\nIndia’s Ministry of External Affairs declined to comment on the report, maintaining its longstanding position of neither confirming nor denying involvement in specific killings, but Indian officials have previously justified their actions.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/15163455fc49f06.png",
  "retrievedAt": "2025-08-26T07:42:06.028Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885363/military-strongly-reacts-to-indian-army-chief-calling-pakistan-epicentre-of-terrorism",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T11:09:21.000Z"
}
