{
  "title": "Saudi looking into $100m investment in Pakistan’s mining sector with focus on Reko Diq: minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "Saudi Mining Minister Bandar Alkhorayef told Reuters on Wednesday that Saudi Arabian mining company Manara Minerals was looking at investing in Balochistan’s Reko Diq mine.\n\nHe added that the Saudi Development Fund could contribute over $100 million to Pakistan’s mining infrastructure.\n\n“Part of what we are looking at is how we can help Pakistan also in some infrastructure,” Alkhorayef said in an interview on the sidelines of the Future Minerals Forum in Riyadh.\n\n“Without that infrastructure, the economics of the deal are not attractive, so through the Saudi Development Fund we are thinking about how we can finance it.”\n\nManara, a joint venture between state-controlled Ma’aden and the $925 billion Public Investment Fund (PIF), was set up as part of the kingdom’s efforts to diversify its economy away from oil, including by buying minority stakes in assets overseas.\n\nExecutives from Manara visited Pakistan in May last year for talks about buying a stake in the Reko Diq mine, considered one of the world’s largest underdeveloped copper-gold areas by global mining company Barrick Gold, which owns the project jointly with Pakistan.\n\nSeparately, Alkhorayef also said that Saudi state oil giant Aramco’s project to extract lithium was “promising, but not yet commercially viable”.\n\nAramco has partnered with the King Abdullah University for Science and Technology (KAUST) for the pilot, he said. Lithium Infinity, also known as Lihytech, a startup launched out of KAUST, is leading the extraction project with cooperation from Aramco and Saudi mining company Ma’aden.\n\nLithium is a key component in the batteries of electric cars, laptops, and smartphones. Reuters previously reported that Saudi Arabia and the United Arab Emirates’ national oil companies planned to extract the mineral from oil runoffs.\n\nAramco and Ma’aden signed a non-binding term sheet today to explore the creation of a minerals exploration and mining joint venture in the kingdom.\n\nThe proposed venture “would focus on energy transition minerals, including extracting lithium from high concentration deposits and advancing cost-effective direct lithium extraction (DLE) technologies”, the two companies said during the Future Minerals Forum in Riyadh.\n\nCommercial production of lithium could potentially start by 2027.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:42:03.045Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885389/saudi-looking-into-100m-investment-in-pakistans-mining-sector-with-focus-on-reko-diq-minister",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T15:31:19.000Z"
}
