{
  "title": "Snowfall over country’s upper parts may affect transportation: PMD",
  "link": "https://www.app.com.pk/national/snowfall-over-countrys-upper-parts-may-affect-transportation-pmd/",
  "date_published": "2024-01-29T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 29 (APP):Pakistan Meteorological Department (PMD) has warned that snowfall over the upper parts of the country may affect transportation on January 30-31.\nThe PMD has advised the tourists to remain cautious during the period.\nAs per the synoptic situation, a westerly wave was affecting the western and upper parts of the country and was likely to persist in the upper parts for the next few days.\nMainly cold weather is expected in most areas of the country while cloudy in the upper Parts. However, rain with snowfall over mountains is expected in Gilgit-Baltistan, Upper Khyber-Pakhtunkhwa, Pothohar region, Kashmir and Surrounding hilly areas.\nShallow to moderate fog was likely to persist in a few plain areas of Punjab and upper Sindh.\nDuring the last 24 hours, mainly cold and partly cloudy weather prevailed in most areas of the country.\nHowever, rain occurred in Khyber Pakhtunkhwa, Kashmir, Islamabad, Pothohar region and Gilgit-Baltistan.\nFog/smog prevailed over plain areas of Punjab and upper Sindh.\nThe rainfall recorded during the period was Khyber Pakhtunkhwa: Dir (Upper 32mm, Lower 04), Pattan 28, Kalam 20, Malam Jabba 19, Saidu Sharif 15, Balakot 13, Chitral 10, Parachinar 09, Mir Khani 07, Drosh 05, Kakul 03, Mardan 02, Kashmir: Muzaffarabad (City 12, Airport 07), Rawalakot 10, Garhidupatta 09, Kotli 03, Punjab Murree 04, Islamabad (A/P 01), Gilgit-Baltistan: Astore 04, Gupis 02 and Bagrote 01.\nThe snowfall recorded during the period was Malamjabba 12 inches, Kalam 11, Astore and Murree 01 inches.\nThe lowest temperatures recorded were Kalam -06C,  Malamjabba, Gupis -04, Astore and Hunza -03C.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:02:22.629Z"
}
