{
  "title": "Pakistan, Iran agree to expand cooperation in areas of security, trade, economy",
  "link": "https://www.app.com.pk/national/pakistan-iran-agree-to-expand-cooperation-in-areas-of-security-trade-economy/",
  "date_published": "2024-01-29T10:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 29 (APP):Pakistan and Iran on Monday agreed to further expand cooperation in the shared goals of security, regional stability, trade and economy, adopting a collective approach to address the confronted common challenges.\n“Pakistan and Iran have agreed to adopt collective and collaborative approaches to confront the terrorism by fully leveraging the robust institutional mechanism which already exists between the two countries,” Caretaker Foreign Minister Jalil Abbas Jilani said in a joint press stakeout after an extensive meeting with his Iranian counterpart Hossein Amir-Abdollahian.\nHe said the two sides recognized that the close bilateral relationship was not only imperative for shared prosperity and development of the people of the two countries but also an important source of stability for the region.\nHe said during the meeting, both sides agreed to establish a high level consultative mechanism at the level of foreign ministers.\nThe two foreign ministers would meet alternatively in both Iran and Pakistan on a regular basis to oversee the progress that “is being made in various areas of our cooperation”, he added.\nStressing the need to address each other’s concerns with regard to terrorism, FM Jilani said in that respect the two sides had agreed to station liaison officers on which an agreement was already in place. The liaison officers would be deployed in Turbat and Zahidan, he added.\nThe foreign minister maintained that the visit of his Iranian counterpart testified deep commitment of both sides to further strengthen the bilateral relations.\nHe said during the meeting, respect of territorial integrity remained the foundational principle of bilateral cooperation.\nThe two sides, he added, also agreed to prioritize economic uplift of their border areas.\n“We have also agreed to fast-track the operationalization of the five remaining border markets,” he said. The markets would be operationalized at the  the earliest, he added.\nIranian Foreign Minister Hossein Amir-Abdollahian, in his remarks, said that Iran and Pakistan were enjoying great geographical, historical and cultural commonalities.\n“If we look at the history of Pakistan and Iran there has never been any case of territorial differences or border problems between the two countries, which was one of the clear manifestations of friendly bilateral relations,” he added.\nHe said that Iran considered Pakistan as its brotherly, neighbourly and friendly country. “Both countries strongly respect territorial integrity of each other.”\nThe Iranian foreign minister said it was agreed that the two countries would not let the terrorists  endanger the security of border areas.\n“In a loud voice we will tell all terrorists that we (Iran and Pakistan) will not provide them with any opportunity to endanger our common security.”\nHe said there was no doubt that the terrorists located in common border areas of the two countries were supported by the third countries.\nHe said in the meeting, the two high ranking delegations agreed to take further actions together as soon as possible with respect to the border security, necessity of fighting against terrorism, enhancing of trade and economic cooperation, expanding border markets and establishing free trade zones.\nHe said the two sides also agreed to work together to promote the pilgrimage tourism and projects of energy cooperation.\nAs regards the Palestine issue, the Iranian FM appreciated Pakistan’s stance of supporting the Palestinians.\nHe also reiterated his country’s resolve to continue to support the people of Palestine and the Palestine resistance.\nThe Iranian FM wished successful and safe conduct of elections in Pakistan.\nReplying to a question with respect to the recent incidents, FM Jilani said that due to deep and historical bilateral relationships, the two sides were able to resolve the misunderstandings very quickly.\nHe said Pakistan also extended an invitation to the Iranian president for a visit, which hopefully may take place any time after the general elections.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:02:56.655Z"
}
