{
  "title": "COAS, Iranian FM reaffirm to remain closely engaged, bar any spoilers to divide brotherly nations",
  "link": "https://www.app.com.pk/national/coas-iranian-fm-reaffirm-to-remain-closely-engaged-bar-any-spoilers-to-divide-brotherly-nations/",
  "date_published": "2024-01-29T16:14:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 29 (APP): Foreign Minister of Iran Amir Abdollahian called on Chief of Army Staff (COAS) General Syed Asim Munir here at the General Headquarters on Monday.\nDuring the meeting, both sides reaffirmed the resolve to remain closely engaged and not allow any spoilers to drive a wedge between the brotherly nations, an Inter-Services Public Relations (ISPR) news release said.\n“Pakistan and Iran are fraternal neighbours, and the destiny of both nations are intertwined,” both the dignitaries resolved.\nRealizing the historical, religious and cultural ties that bind Pakistan and Iran, both sides emphasized on strengthening bilateral ties and fostering greater understanding of each other’s concerns.\nThe COAS underscored the centrality of respecting the other state’s sovereignty and territorial integrity, calling it sacrosanct, inviolable and the most important cardinal of state-to-state relationship.\nThe two sides observed that terrorism was a common threat that needed to be tackled through collaborative efforts, better coordination and intelligence sharing.\nThe COAS emphasized the need for sustained engagement and utilizing available communication channels to address security concerns.\nBoth sides agreed to operationalize the mechanism of deployment of military liaison officers in each other’s country at an early date to improve coordination and efficiency of response against common threats.\nBoth sides reiterated their commitment to peace, stability and prosperity in the border region which was identified as an indispensable requirement for the well-being of people living on both sides.",
  "retrievedAt": "2025-08-11T00:01:32.190Z"
}
