{
  "title": "Prosperity, economic uplift linked with equitable justice, rule of law: PM",
  "link": "https://www.app.com.pk/national/prosperity-economic-uplift-linked-with-equitable-justice-rule-of-law-pm/",
  "date_published": "2021-05-06T14:56:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 06 (APP): Prime Minister Imran Khan Thursday said that Pakistan could only achieve prosperity and economic development by ensuring equitable enforcement of law and providing justice to masses.\nThe prime minister, in a meeting with the members of the National Assembly and Punjab provincial assembly here during his visit, said the South Punjab region lagged behind in development owing to unjust distribution of resources in the past.\nHowever, the incumbent government would take all out measures for uplift of South Punjab, he assured.\nFederal Minister for Industries Makhdoom Khusro Bakhtiar, Punjab Chief Minister Usman Buzdar, and Punjab Finance Minister Hashim JawanBakht attended the meeting.\nAmong the parliamentarians who met the prime minister included MNAs Farooq Azam, Rana Qasim Noon, Sardar Nasrullah Khan Dareshak, Tahir Iqbal, Abdul Ghaffar Wattoo, Mian Shafiq Arain and Sardar Amir Talal Gopang, and MPAs, Samiullah Chaudhry, Hasnain Dareshak, and Dost Muhammad Mazari.\nThe meeting focused the public welfare projects and establishment of South Punjab Secretariat.\nThe parliamentarians presented proposals for different projects including roads, clean drinking water and sewage.\nThe legislators thanked the prime minister for prioritizing the development projects in South Punjab. They viewed that the PTI government was pursuing a vision for the progress and prosperity of South Punjab.\nThe prime minister directed the parliamentarians to ensure resolution of the issued facing their constituents and assured that he would soon chair a meeting for approval of the proposals put forward by them.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T20:42:18.528Z"
}
