{
  "title": "Pak, Indonesian FMs discuss combating Islamophobia, promoting inter-faith harmony",
  "link": "https://www.app.com.pk/national/pak-indonesian-fms-discuss-combating-islamophobia-promoting-inter-faith-harmony-2/",
  "date_published": "2021-05-06T10:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 06 (APP): Foreign Minister Shah Mahmood Qureshi and his Indonesian counterpart Retno Marsudi on Thursday discussed the need for stronger cooperation amongst members of the Organisation of Islamic Cooperation (OIC) to combat Islamophobia.\nIn a telephone conversation, Foreign Minister Qureshi stressed that Pakistan’s efforts were aimed at creating awareness and building greater understanding for the promotion of inter-faith harmony and mutual respect.\nHe thanked Indonesia for supporting the unanimous adoption of Pakistan-sponsored resolution at the 47th OIC Council of Foreign Ministers meeting in Niamey last November, which declared 15th March as an International Day to Combat Islamophobia.\nQureshi sought continued collaboration between the two sides in New York for the smooth adoption of a resolution by the UN General Assembly in that regard.\nHe emphasized that disrespect towards revered Islamic personalities hurts the sensibilities of more than 1.5 billion Muslims around the world.\nHe noted that such actions were not covered under legitimate expressions of the right to freedom of opinion, which carries certain responsibilities under international human rights law.\nForeign Minister Qureshi highlighted that Muslims unequivocally condemn all acts of violence or incitement to violence on the basis of religion or belief, and these notions must be respected by all.\nHe called upon the OIC to work together for making the international community understand the deep-rooted love and devotion of all Muslims for the Holy Prophet (P.B.U.H.) and the Holy Quran.\nHe also underscored that a global dialogue amongst civilizations, under the ambit of the United Nations, was required to promote inter-faith harmony, tolerance and peaceful co-existence.",
  "retrievedAt": "2025-08-11T20:42:09.175Z"
}
