{
  "title": "President directs for a sample electronic voting machine for demo",
  "link": "https://www.app.com.pk/national/president-directs-for-a-sample-electronic-voting-machine-for-demo/",
  "date_published": "2021-05-06T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 6 (APP): President Dr Arif Alvi Thursday directed the authorities concerned to manufacture a prototype of Electronic Voting Machine for presentation to the federal cabinet and members of the National Assembly after Eid-ul-Fitr.\nChairing a meeting of the sub-committee on Emerging Technologies on I-Voting at Aiwan-e-Sadr, the president stressed the need for expediting the I-Voting process for overseas Pakistanis to enable them register and cast their votes through internet conveniently.\nMinister for IT & Telecom (IT&T), Syed Amin-ul-Haque, Minister for Railways, Senator Muhammad Azam Khan Swati, Minister for Science and Technology, Senator Syed Shibli Faraz, Secretary IT&T, Shoaib Ahmed Siddiqui, Acting Chairman NADRA, Brig (Retd) Khalid Latif, Director General (IT) Election Commission of Pakistan, Khizer Aziz, and senior government officials attended the meeting.\nPresident Alvi said that modern voting solutions like I-Voting and Electronic Voting Machines (EVMs) would increase accessibility, speed-up the processing of results on polling day and ensure transparency in the general elections.\nMinister for Science and Technology Senator Syed Shibli Faraz updated the meeting about the progress made so far regarding the development of a prototype of Electronic Voting Machine (EVM).\nThe president said that he would engage parliamentarians and members of the political parties to support the introduction of EVMs in the upcoming general elections.\nHe also expressed the desire to consult Chief Election Commissioner and members of the ECP for the early materialization of EVMs, Biometric Verification Machines and I-Voting systems for overseas Pakistanis.\nActing Chairman NADRA, Brig (Retd) Khalid Latif assured the meeting that NADRA would provide full support to I-Voting system.",
  "retrievedAt": "2025-08-11T20:42:07.283Z"
}
