{
  "title": "Speakers see full potential in BRI to bring peace, prosperity to Afghanistan",
  "link": "https://www.app.com.pk/national/speakers-see-full-potential-in-bri-to-bring-peace-prosperity-to-afghanistan/",
  "date_published": "2021-09-24T18:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP): Speakers at a webinar on Friday expressed confidence that the China’s Belt and Road Initiative (BRI) had the full potential to bring peace and prosperity to Afghanistan.\nThey said China and the countries on BRI would be engaging Afghanistan through regional trade linkages, development, and communications networks creating opportunities for stability.The webinar titled “How BRI can help Afghanistan: Views from the Globe” was organized by the Friends of BRI Forum.\nWhile moderating the session, Editor-in-Chief, In Zhejiang Media Group Ke Ye said the webinar was aimed at holding the intellectual discourse on the ongoing crisis in Afghanistan and humanitarian assistance that countries on BRI could collaborate to support Afghanistan in an essence of shared humanity.\nCo-founder of Friends of BRI Forum Farhat Asif highlighted the primary aim of the initiative of launching the forum.\nShe informed that the forum had organized several debates on the subject including business, media, academic institutions linkages amongst 138 countries, and international organizations of the world.\nChairman of Schiller Institute, Sweden, Ulf Sandmark said Afghanistan was in dire need of humanitarian aid especially when winter was coming, and about 90 percent of people there had no proper health care. “Hence, BRI can contribute to the towards food and health connectivity.”Vice-Chancellor of Shaheed Benazir Bhutto University, Dr Razia Sultana said a stable Afghanistan was in the interest of the whole world. “On BRI Afghanistan can be a strong trade and business linkages with the global markets.”\nShe said China along with the regional countries was helping to facilitate the dialogue process for an inclusive government in Afghanistan for durable peace there.\nChairman of Association of Russian Diplomats, Dr Igor V. Khalevinskiy said in Afghanistan, the humanitarian crises were imminent and the world needed to focus in a collective manner and “the BRI is a good option to do that.”\nVice President of New Silk Road Committee, BWA Global Economic Network, Germany, Urs Unkauf appreciated the continuation of China’s Embassy work and diplomatic missions amid the chaos in Kabul.\nDirector, Pearson Institute for Higher Education, South Africa, Dr. Farhana Paruk told the forum about opportunities for Afghanistan in the BRI while giving the example of China and Africa.Adviser, Center of Analysis of International Relations (AIR Center), Azerbaijan, Naghi Ahmadov said China’s initiated project, B&R, had immense importance and that attracted markets across the world.\nExecutive Director of Center for Non-Traditional Security & Peaceful Development Studies (NTS-PD), Zhejiang University, Dr Hong MI highlighted the contribution of China for the Afghanistan people.\nHe said China had helped Kabul in anti-drug trafficking, COVID vaccine donation, trade engagement and construction of their mechanism.\nAmong others, a large number of media persons, journalists, students, and academicians from different parts of the world attended the webinar.",
  "retrievedAt": "2025-08-11T21:19:24.315Z"
}
