{
  "title": "KIIR webinar eulogizes Shaheed Burhan Wani’s role in freedom struggle",
  "link": "https://www.app.com.pk/national/kiir-webinar-eulogizes-shaheed-burhan-wanis-role-in-freedom-struggle/",
  "date_published": "2020-07-08T21:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 09 (APP):Speakers at a webinar eulogized the role and peerless contribution of Shaheed Burhan Muzaffar Wani and said that the martyrdom of the charismatic commander infused new life to Kashmiris’ resistance movement.\nThe webinar was organized by Kashmir Institute of International Relations (KIIR) to mark 4th martyrdom anniversary of the Shaheed Burhan Wani, according to KIIR press statement issued here Thursday.\nWeteran Kashmiri intellectual and writer Syed Arif Bahar, APHC leader Syed Yousaf Naseem, Dr Waqas Ali Kouser, Raja Sajad Latief, Manzoor-ul-Haq Butt, Advocate Parveez Shah and KIIR chief Altaf Hussain Wani addressed the webinar and highlighting the indomitable role and sacrifices of the Kashmiri youth.\nThe speakers said that it were these unprecedented sacrifices that youth have brought the Kashmir issue at centre stage at international level.\nReferring to the 2016 mass uprising the speakers observed that “Wani’s martyrdom has led to massive youth uprising and it was for the first time that the youth of Kashmir expressed their complete un-acceptability of Indian control that as a matter of fact poses a big question mark over Indian presence in the disputed territory”.\nShaheed Burhan Wani’s contribution and role they said would be written in golden letters in the history of Kashmir.\nBurhan, they said, was a hero of Kashmiri youth and an icon of the resistance movement. The tech-savvy commander they said has inspired young and educated youth like Dr Manan Wani, Reyaz Naiko, Junaid Sehrai, Sabzar Bhat Shaheed and thousands of others who were ready to join the resistance struggle to get their homeland free from the clutches of Indian imperialism.\n“Shaheed commander was not just an individual, he was a character and symbol of ongoing resistance, his martyrdom will continue to inspire Kashmir’s future generations”, they said adding that it were the sacrifices of these martyrs that have lend credence to Kashmiris’ freedom movement of being a legitimate and indigenous struggle.\nPaying great tributes to Kashmiri martyrs who sacrificed their today for the better tomorrow of their nation the speakers said that these proud sons of the soil would be remembered for a long time in the annals of Kashmiris history.\nReferring to Kashmiris’ political aspirations they said Kashmiris have been fighting for their legitimate right, which was guaranteed to them by no less an authority than the United Nations.\nKashmiris, they said, were the worst victims of state terrorism and systematic state sponsored terrorism. Citing the simmering situation in Kashmir they said that India has turned the entire Kashmir valley into a virtual prison by imposing restrictions on the media and the movement of the people in the region.\nEver since India and Pakistan emerged as two sovereign states, the issue of Kashmir has been a bone of contention and a constant threat to peace and security in the region”, the speakers said adding that war clouds looming large on Indo-Pak borders today were due to the non-resolution of the lingering dispute that until now has consumed three generations of Kashmiris.\nRegarding India’s naked aggression against Kashmiris they said in order to quell the ongoing freedom movement in Kashmir India had unleashed reign of terror in the region by using lethal weapons, pellet guns and live ammunition against Kashmiris.\nReferring to fresh wave of state terrorism in Kashmir they said, “These incidents of violence serve as a chilling reminder of the terrors of totalitarian regime and the atrocities it had committed against innocent and unarmed people of the state”.\nUnless the political aspirations of the people of Jammu and Kashmir are addressed they said that the human rights situation in the region cannot improve.\nFor any positive change to take place in the region the speakers said that India needs to reverse its current course and come forward with a positive state of mind to settle the Kashmir issue peacefully keeping in view its political and history perspective.\n“The people especially the youth of Kashmir are being killed day in and day out by unbridled trigger-happy Indian forces but it is quite unfortunate that the world community is watching this macabre game of bloodbath in Kashmir like that of a bystander”, the speakers maintained.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:28:18.260Z"
}
