{
  "title": "CM Buzdar, PA Speaker Elahi discuss matters of mutual interest",
  "link": "https://www.app.com.pk/national/cm-buzdar-pa-speaker-elahi-discuss-matters-of-mutual-interest/",
  "date_published": "2020-07-09T01:56:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 09 (APP):Punjab Chief Minister Sardar Usman Buzdar and Speaker Punjab Assembly Ch. Pervaiz Elahi during a meeting at Punjab Assembly here on Thursday discussed matters of mutual interests and also agreed to jointly counter the propagandists besides taking the journey of public service forward.\nChief Minister Usman Buzdar said on the occasion that critics would be left behind and the Naya Pakistan would continue to move forward under the leadership of Prime Minister Imran Khan.\nHe regretted that the critics were engaged in propaganda while the best relationship existed with ally PML-Q.\nThe CM maintained that the PTI-led government had rightly identified the public priorities and the Punjab province was moving towards the real change in accordance with the vision of the Prime Minister.\nThe government was engaged in a public welfare agenda which the past rulers failed to fulfill even in years and public interest was tremendously jeopardised due to wrong policies, he added.\nSpeaker PA Ch. Pervaiz Elahi said that designs of those fascinating about differences would not be fulfilled.\nThe province was despoiled and it was bankrupted due to the wrong policies of the past government, he said and added that the common man had faced consequences of delay in public welfare projects.\nPervaiz Elahi said that PML-Q was an ally of the PTI and would jointly continue to work for public welfare.\nMeanwhile, Chief Minister Usman Buzdar and Speaker Ch. Pervaiz Elahi also chaired a meeting at Punjab Assembly to review progress on MPAs’ hostel building and new Punjab Assembly building project.\nThe CM directed to early complete the new Punjab Assembly building and gave the deadline of September for completing the work and said there was no justification of delay despite the availability of funds.\nHe expressed displeasure over failure in completing the work within the stipulated period and directed that the backlog should be filled with continuous work. He assured that the Punjab government would continue its full support with regard to the remaining work of the new building. He said that the government would provide funds on priority for completion of state-of-the-art building.\nUsman Buzdar regretted that past rulers gave preference to their personal likes and dislikes even in public welfare projects.\nThe CM directed that MPAs hostel should also be completed at the earliest.\nCh. Pervaiz Elahi appreciated the support of the CM Punjab with regard to the construction of new assembly building and hostel. The MPAs hostel’s basement would accommodate 600 vehicles.\nThe past rulers willingly delayed the new building project which resulted in wastage of public money and construct cost was also increased. A gap had occurred due to coronavirus outbreak but there was a need to take forward this project speedily, he added.\nProvincial Law Minister Raja Basharat, Chairman P&D, Secretary C&W, Secretary Finance, Secretary Punjab Assembly and others attended the meeting.",
  "retrievedAt": "2025-08-11T19:28:15.218Z"
}
