{
  "title": "K Electric to be provided additional electricity to meet need in Karachi: Omar",
  "link": "https://www.app.com.pk/national/k-electric-to-be-provided-additional-electricity-to-meet-need-in-karachi-omar/",
  "date_published": "2020-07-09T02:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 09 (APP):Minister for Energy Omar Ayub Thursday informed the National Assembly that the government will provide hundreds of additional megawatts of electricity to K Electric from the national grid and build two grid stations to end energy shortages in Karachi.\nSpeaking at the floor of the house while responding to a calling attention notice of legislators, he said the previous governments of Pakistan Tehreek i Insaf and Pakistan Muslim League (N) mishandled the affairs of K Electric in Karachi.\nHe said K Electric was getting 650 megawatts from the national grid, adding however as demand for electricity increased as compared to the limited supply the present government would increase the supply to it by another 200 megawatts generated from nuclear and renewable energy sources.\nThe K Electric will get additional 500 megawatts in future with supply of 100 mmcfd of gas, he told.\nHe said K Electric had limited capacity to get electricity from the national grid.\nTwo grid stations will be built in east and west of Karachi for distribution of electricity from the national grid, he added.\nThe minister said the cabinet committee on energy was holding meetings to find a sustainable solution to meet the energy needs of citizens of Karachi.\nHe said the provincial government of Sindh should play its role as its member in National Electric Power Regulatory Authority should help impose heavier fines on K Electric for causing difficulties to the consumers in Karachi.\nHe said the government of Sindh failed to desilt nullahs and drains before the monsoon season and its negligence resulted in death of people due to electric current after rains in Karachi.\nMinister for Planning and Development Asad Umar said the privatisation of K Electric was done during the tenure of Pakistan Muslim League(Q) government and then during the five year tenures of PMLN and Peoples Party affairs of K Electric worsened.\nHe said the transmission capacity of K Electric was not improved so it could get electricity from the main national grid.\nHe assured that the federal government would take measures to increase electricity supply to K Electric from the national grid.\nThe ministers were responding to the concerns of legislators from different parties including Agha Rafiullah, Shagufta Jumani, Aminul Haq, Aslam Khan, Faheem Khan and Shazia Marri over long hours of loadshedding in Karachi by K Electric.\nAdvisor to Prime Minister on Parliamentary Affairs Dr Babar Awan assured the house that change in boundaries of any province could any be made with a constitutional amendment and resolution of a provincial assembly.\nHe was responding to MNA Maulana Abdul Akbar Chitrali who raised the concern that Shandur which was part of Chitral was being shown to be part of Gilgit Baltistan at official level.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:28:09.336Z"
}
