{
  "title": "US sees Kashmir dispute through prism of India due to realpolitik: AJK President.",
  "link": "https://www.app.com.pk/national/us-sees-kashmir-dispute-through-prism-of-india-due-to-realpolitik-ajk-president/",
  "date_published": "2020-07-08T23:49:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jul 09 (APP):Azad Jammu Kashmir Sardar Masood Khan, has said that because of US’s protection to India in the United Nations Security Council (UNSC), the latter is operating with absolute impunity in the Indian Occupied Jammu and Kashmir (IOJK).\nThis is where, he said, realpolitik is steering dynamics of the Kashmir dispute. Both the US and India have economic and defence partnerships, and this has become a barrier for the US, as it sees the Kashmir dispute through the prism of India, he said.\nThe AJK President made these remarks while addressing a virtual conference of club members, belonging to different walks of life, of a prestigious IVY League institute. The address was followed by a comprehensive Q&A session, AJK Presidential secretariat later told media Thursday evening.\nIn his introductory remarks, the President while explaining the genesis of the Kashmir issue said that in 1947, the people of Jammu of Kashmir had to choose either to accede to Pakistan or India.\nThe partition did not take place according to plan and India invaded the territory and has since occupied it. “Things have not changed since then. The killing spree continues”, he said.\nThe President said that on August 5 of last year, the people of IOJK were stripped of their special rights to education, employment, acquisition of property and permanent residence which had been protected under Article 35-A. Subsequently, in the same year on October 31 and April 2 of this year they – without consulting its people – India annexed IOJK (Jammu and Kashmir and Ladakh) bringing it under the direct control of Delhi and then after introduced New Domicile Rules respectively.\nThe fascist Indian government has begun settling non-native Hindus from all over India in IOJK. He said the plan is to transform the demography and reduce the Muslim majority into a minority.\n“This is, plain and simple, land grab. Kashmiris are running from pillar to post just to prove that they are State subject. They are facing, disenfranchisement, dispossession and displacement”, he said.\nIf this continues, in a matter of a few years, we would not have a Kashmir with its distinct identity, he warned.\n“The New Domicile Rules introduced in IOJK, is akin to the policy followed by Nazi Germany against the Jews, based initially on economic strangulation, followed by demonization and marginalization and finally physical extermination”, said Masood Khan.\nPresident Masood said that the killings have not stopped, rather they have intensified. Young Kashmiris are incarcerated, torture of detainees is common, sexual violence is rampant and communication blackout persists for the past 11 months as journalists continue to be arrested and their content strictly monitored and censored under the Unlawful Activities (Prevention) Act 1967.\n“Genocide, war crimes, ethnic cleansing, crimes against humanity is taking place in IOJK. These are a violation of the Geneva Convention, the UN Charter, covenants of the 1960s, numerous treaties, economic and cultural rights, ICC statues and UNSC resolutions”, he said while adding that US-based Genocide Watch has declared that IOJK has entered the 8th stage of the 10 stages of genocide that have been defined by them.\nThe last four stages defined by Dr. Gregory H. Stanton’s (founder of Genocide Watch) are: Stage 7: Preparation for the “Final Solution”; Stage 8: Persecution of victims identified and separated out; Stage 9: Extermination; and finally Stage 10: Denial of everything.\nThe AJK President maintained that this all does not stop here, as the Indian Prime Minister, the Defence Minister, Home Minister and RSS Chief claimed Gilgit-Baltistan and Azad Jammu and Kashmir as part of their union territory and have threatened to “take it back” using military aggression further backing up these threats with the use of nuclear weapons. He added that an unresolved Jammu and Kashmir dispute is a ticking geo-strategic flashpoint and a risk of a nuclear war is very real.\nHe urged the United States leadership and the global community to help avert a nuclear war between the nations neighbouring Jammu and Kashmir.\n“ A nuclear fallout would be no less than an Armageddon with far-reaching impacts leading to global change in climate, unprecedented economic recession, drop in crop yields, mass migration, and direct and indirect effect on the lives of over 2.5 billion humans living around the world”, he said\nSimilarly, he said the recent standoff India-China standoff along the Line of Actual Control that abuts Kashmir could lead to a military miscalculation or a deliberate escalation by one party or the other. These are perils which we have to avoid, he said.\nThe AJK President said that historically, the US was a facilitator in the successful passage of UNSC resolutions on Kashmir. Back then, he said, they demonstrated global leadership. He appealed to the US leadership not to underwrite India’s crimes against humanity in IOJK.\n“We need leaders like Senator Mitch McConnell, Richard Holbrooke and former US President Jimmy Carter to help mediate. United States, please play a leadership role in restoring the world order you had created in the shape of the United Nations. I urge you to start a Boycott, Divestment and Sanctions movement against India to strip India of its economic prowess”, he urged.\nPresident Khan thanked the international media including the US media who spoke up for the Kashmiri people, US Congress for holding hearings, parliaments like the British Parliament and the European Parliament for debating on Kashmir. Robust support, he said, came from 650 Members of the European Parliament (MEPs) who tabled a resolution warning India of the consequences for its actions in IOJK, to rescind these actions and called for a plebiscite in Kashmir.\nHe said that in in September, October and November of last year the issue was internationally highlighted but then certain diversions like BREXIT, Covid-19 and impeachment proceedings of the US President blurred the focus on Kashmir. He appealed to the US civil society activists and opinion leaders to help the people of Kashmir regain that attention and create space for multi-lateral diplomacy on the Jammu and Kashmir dispute.\nResponding to the questions posed by the participants, the President said that the US can play an important role as a neutral party that could exude empathy. The US has no dearth of leadership and intellect. He said that unlike India; Pakistan and the people of Kashmir are ready for talks, the only condition being that Kashmiris have to be involved in these talks. President Trump had offered mediation but over time he has been diluting his offer. The issue is neither internal nor bilateral but its trilateral as the people of Kashmir are the key party to the dispute because as they are the ones to decide their political future.\nResponding to a question on pre-independent movements in IOJK, AJK and Pakistan, the President said that in the occupied territory, India has banned the Jammu and Kashmir Liberation Front (JKLF) – a pro-independence party – and its head Yasin Malik is in under arrest. “On the other hand, in Azad Kashmir and Pakistan, the JKLF is not banned, and its leaders and political activists are free to go wherever they like — in the bars, in the universities, in the press clubs — and they are allowed to put across their point of view very freely. There is tolerance for dissent in Azad Kashmir and in Pakistan”, he said.",
  "retrievedAt": "2025-08-11T19:28:17.151Z"
}
