{
  "title": "Rs152.395 billion disbursed among over 12,593,361 lockdown affectees",
  "link": "https://www.app.com.pk/national/rs152-395-billion-disbursed-among-over-12593361-lockdown-affectees/",
  "date_published": "2020-07-09T01:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 9 (APP):The Ehsaas Emergency Cash initiative has so far disbursed an amount of over Rs152.395 billion among over 12,593,361 lockdown affected persons under different categories.\nThe programme was initiated to disburse cash amount of Rs12,000 among those affected from the coronavirus lockdown.\nThe payment process under different categories of the programme was continued across the country.\nAccording to the cash update received on July 09, a total of over Rs68.913 billion has been disbursed among over 5,693,981 deserving families in Punjab so far while around Rs45.272 billion has been disbursed among 3,753,957 families in Sindh.\nOver Rs26.120 billion has been disbursed among more than 2,151,472 beneficiaries in Khyber Pakhtunkhwa while over Rs7.689 billion has been disbursed among 632,972 persons in Balochistan.\nIn Azad Jammu and Kashmir over 2.502 billion have been distributed among 204,755 persons while Rs1.100 billion has been distributed among more than 89,994 people in Gilgit Baltistan.\nAn amount of Rs 0.800 billion has been disbursed among more than 66,230 beneficiaries in Islamabad.\nThe people who registered through 8171 or Prime Minister Labour Portal can find their eligibility by entering their Computerized National Identity Card number through the web portal.\nThe link to the portal is as follows: https://ehsaas.nadra.gov.pk/ehsaasTracking/.\nThose persons whose parents or spouses are eligible but died can file an appeal through sending application with mentioning name and CNIC of the deceased and name of proposed deserving member of family and his or her CNIC number to the address: Dr. Sania Nishtar, Speical Assistant to Prime Minister on Social Protection and Poverty Alleviation, F Block, Pak Secretariat.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:28:15.268Z"
}
