{
  "title": "Only 550 selected from over 38,000 applicants for Hajj support staff: Minister assures more transparent policy in future",
  "author": null,
  "content": "ISLAMABAD, Jul 15 (APP): Federal Minister for Religious Affairs and Interfaith Harmony Sardar Muhammad Yousaf on Tuesday said that out of a total of 38,297 applicants who applied through the National Testing Service (NTS), only 550 individuals were selected to serve during the annual pilgrimage.\nIn response to a query regarding the recruitment process for Moavineen-e-Hujjaj (Hajj Assistants) for the year 2024, in the upper house, the minister said that the applicants included candidates from across the country and various government departments.\nAccording to official figures, the 6,333 applicants applied for supervisory positions and field supporting staff roles. Of these, only 50 individuals were selected for supervisory roles while 500 were appointed as field supporting staff, bringing the final selection tally to 550.\nThe minister clarified that the entire selection process was conducted through NTS, ensuring merit-based shortlisting.\nResponding to concerns raised during the session, Sardar Yousaf acknowledged that although the specific complaint mentioned in the question was not included in the original query, any reported irregularities or shortcomings following the process would be addressed. He further assured that as the government formulates a new Hajj policy, measures will be taken to rectify any flaws in the previous selection process.\n“We welcome feedback and will incorporate necessary improvements in the upcoming policy to ensure better transparency and inclusivity,” he stated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:37:54.396Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/only-550-selected-from-over-38000-applicants-for-hajj-support-staff-minister-assures-more-transparent-policy-in-future/",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T14:53:00.000Z"
}
