{
  "title": "D-Chowk sees high turnout in emission testing drive",
  "author": null,
  "content": "ISLAMABAD, Jul 15 (APP): The Islamabad Transport Authority (ITA) has expanded its vehicle emission testing initiative across the federal capital, urging citizens to ensure their cars meet environmental standards.\nThe campaign aims to reduce harmful emissions and improve air quality by enforcing mandatory inspections and maintenance.\nAccording to the spokesman of ICT administration here, the Islamabad Transport Authority is actively conducting vehicle inspections under its Vehicle Emission Testing System. A dedicated inspection camp was recently set up at D-Chowk, where a large number of citizens brought their vehicles for testing.\nAccording to ITA Chairman Irfan Memon, the inspection drive began with vehicles belonging to government departments. In the next phase, the initiative was extended to include private vehicles owned by citizens. He noted that participation from the public has been encouraging, with many residents acknowledging the importance of checking vehicle emissions to protect the environment.\nVehicles that pass the emission test at the camp are issued clearance stickers. These stickers indicate that the vehicle meets the required environmental standards.\nIrfan Memon emphasized that this step is necessary to control pollution levels in the city, and it is being executed with the help of advanced machinery.\n“The inspection process is not limited to one area. We plan to expand it throughout the city using modern equipment,” Irfan Memon stated. He urged all vehicle owners to voluntarily present their cars for inspection.\nHe further warned that vehicles failing the inspection or not maintained properly after testing will face strict action. The ITA will conduct joint operations with Islamabad Traffic Police to take action against vehicles without clearance stickers.\n“This is a collective effort to improve the city’s air quality and ensure that only compliant vehicles remain on the roads,” Irfan Memon added.\nThe Islamabad Transport Authority’s initiative is part of broader efforts to address increasing environmental concerns, especially rising pollution from unregulated vehicle emissions. The campaign reflects the city’s commitment to sustainable urban living and public health protection.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:38:59.692Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/d-chowk-sees-high-turnout-in-emission-testing-drive/",
  "dateList": "2025-07-15",
  "date_published": "2025-07-15T11:44:00.000Z"
}
