{
  "title": "PM says economic stability, job creation his top priority amid COVID-19 situation",
  "link": "https://www.app.com.pk/national/pm-says-economic-stability-job-creation-his-top-priority-amid-covid-19-situation/",
  "date_published": "2020-06-05T08:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):Prime Minister Imran Khan Friday said the priority of his government was to stabilize the economy with focus on job creation for the youth so as to counter the negative impact of the COVID-19 pandemic.\nChairing here a high-level meeting to review the proposals for the federal budget 2020-21, the Prime Minister said every section of the society was affected by coronavirus besides putting an impact on the government’s efforts towards development.\nHe said keeping in view these stark realities, the first priority of the government was to promote those sectors which could create job opportunities for youth and boost the economic process.\nThe Prime Minister said reduction in non-development expenditure, especially a cut in unnecessary government expenditure, was the government’s priority from day one.\nAdviser to PM on Finance Dr Abdul Hafeez Sheikh briefed the Prime Minister on the strategy for implementing government’s priorities, keeping in view the status of revenue, expenditure and ground realities of the budget for next financial year.\nConsidering the issue of subsidies in various sectors and the provision of financial assistance by the government, Prime Minister Imran Khan said the subsidy given by the government was in fact the tax collected by the people, and added that it was important to optimally utilise this money.\nHe said it was vital that not only this money was used efficiently to achieve desired goals but also to ensure that the money was spent on the deserving.\nThe Prime Minister said the present economic situation demanded that the pace of reforms be accelerated so that unnecessary burden on the people could be minimized and relief be provided to them.",
  "retrievedAt": "2025-08-11T19:17:56.796Z"
}
