{
  "title": "MPs’ Salaries & Allowances Amendment Bill 2020 tabled in Senate",
  "link": "https://www.app.com.pk/national/mps-salaries-llowances-amendment-bill-2020-tabled-in-senate/",
  "date_published": "2020-06-04T23:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):Advisor to the Prime Minister on Parliamentary Affair Zaheer Uddin Babar Awan laid a copy of the\nMoney Bill – the Members of Parliament (Salaries and Allowances) (Amendment) Bill, 2020 – in\nthe Senate on Friday which aims at ensuring utility of 25 air tickets to the parliamentarians for\ntheir family members, sans any burden on the exchequer.\nThe Bill points out that the expression in the existing legislation, the MPs being entitled to 25\nbusiness class open return air tickets, be substituted with being entitled to receive travel vouchers\nof equal amount of 25 business class open return air tickets of Pakistan International Airlines (PIA).\nThe bill says the unutilized air tickets and vouchers for financial year 2019-20 will remain\nacceptable till their utilization up to June 30, 2020.\nThe statement of object and reasons of the bill says Section 10 of the existing act regulates free\ntravel privilege of the MPs, who are entitled to 25 business class open return air tickets from airport\nnearest to their constituencies to Islamabad, per annum.\nIn addition, vouchers of Rs 3,00,000 to be utilized for traveling by air or train by MPs as well as\ntheir family members are also annually provided.\nIt says that there has been persistent demand by the MPs to extend the utility of 25 air tickets\nto their family members as well. National Assembly Standing on Rules of Procedure has recommended accordingly. Therefore, vouchers of equal value in lieu of admissible 25 business class open return air\ntickets, are proposed to be issued to the MPs, which may be utilized by their family members as well.\nSection 10 says every MP member will be provided during a year such vouchers of the value of\nRs 3,00,000 as would enable him to travel within Pakistan at any time without payment of any fair\nby air or by rail.\nThe number of air tickets will remain 25 in a year and expenses will not be increased, whereas,\nthe lawmaker could take refund of unused air tickets.\nAbout this Money Bill, the Chairman Senate Sadiq Sanjrani asked the members to forward their recommendations on the bill till June 8, 2020 while report on this Bill would be presented in the\nHouse within ten days by the relevant committee.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:02.452Z"
}
