{
  "title": "Current account deficit brings down to $ 3-6 bln: Senate told",
  "link": "https://www.app.com.pk/national/current-account-deficit-brings-down-to-3-6-bln-senate-told/",
  "date_published": "2020-06-05T00:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):Minister for Industries and Production Hammad Azhar on Friday informed the Senate that the incumbent government has brought down current account deficit from $ 20 billion to $3-6 billion.\nResponding to various supplementary questions during Question Hour, the Minister said that since 2018, Pakistan has received $ 1442 million under the Extended Fund Facility (EFF 2019-2023) and $ 1,383.4 million under the Rapid Finance Instrument (RFI) from the International Monetary Fund (IMF).\nSimilarly, he said an amount of $ 1,279.27 million has been returned to IMF since March 2018.\nTo another question, the minister said that the government has announced a stimulus package of Rs 1240 billion to support different segments of the society including the poor and the businesses during the Covid-19 pandemic.\nHe said prior to COVID-19 out break, gross domestic product growth (GDP) was projected at 3.24% for FY 2020 with Agriculture (2.85%), Industry (1.95%) and Services (4.04%).\nHowever, due to COVID-19, FY2020 posted a negative growth of 0.4% (Provisional), of which Agriculture (2.67%), Industry (-2.64 %) and Services (-0.59%).\nFBR tax revenue might drop to around Rs 3,905 billion against Pre COVID target of Rs. 4800 billion. Revenue loss in the range of Rs. 700-. 900 billion from April to June 2020 was expected due to the pandemic, he added.\nHe said with shortfall in revenues and increase in public spending due to fiscal stimulus package, fiscal deficit was expected to exceed the target of 7.5% of GDP and might go up to 9.4% of GDP.\nLow economic activity in EU, USA, UK, Middle East and resultant fall in commodity prices, exports of Pakistan would remain around $21-22 billion (Pre COVID: $ 25.5 billion).\nHe said workers’ remittances were expected to remain around $ 20-21 billion (Pre COVID: $ 23 billion). In total 3 million jobs were likely to be lost in the initial round of the crisis, he added.\nHe said due to COVID-19, the Pakistani currency depreciated by 7.5 per cent on Month on Month basis in March over February FY2020.\nThe increase in debt burden due to COVID-19 would be dependent on increase in fiscal deficit which was expected to increase by 1.91 percent (from 7.5 of GDP to 9.4% of GDP).\nBudget deficit was expected to exceed the target of 7.5% of the GDP and might go up to 9.4% of GDP due to shortfall in revenues, reprioritizing of expenditures and increase in public spending due to fiscal stimules package, he said.\nHammad Azhar said our initiatives have helped reduce the inflation rate from 12 per cent to eight per cent.\nHe said we have also reduced the petroleum prices which were currently the lowest in the South Asian region.\nTo another query, the ministry said the number of tax filers has increased from1.6 million to 2.6 million in a period of one year as a result of steps taken by the present government.\nHe said tax collection also witnessed 27 per cent growth before the breakout of Covid-19.\nThe minister said the post pandemic has seen 30 per cent decline in tax collection but expressed the confidence that the situation would improve as the business activities are being resumed.\nHe said database was being used to improve the tax collection. He said the government planned to phase out import based duties and focus on domestic taxation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:00.624Z"
}
