{
  "title": "Experts team for standardization of health facilities reach provinces, NCOC told",
  "link": "https://www.app.com.pk/national/experts-team-for-standardization-of-health-facilities-reach-provinces-ncoc-told/",
  "date_published": "2020-06-05T00:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):National Command and Operation Centre (NCOC) on Friday took a detailed review of media campaigns launched by Ministry of Information and Broadcasting (MoIB) and Inter Services Public Relations (ISPR) and provincial authorities to ensure strict compliance of standard operating procedures (SOPs) and overall status of healthcare equipment, Epi Curve Chart.\nAdditionally, the forum was informed about steps being taken for standardizing and assisting provinces on health facilities by sending Special Team led by Dr Faisal Sultan and establishment of helpline for FLHCIN was also discussed.\nMinister for Planning Development Reforms and Special Initiatives, Asad Umar chairing the NCOC meeting mulled over to project markets and industries complying with SOPs amid strict enforcement to encourage the masses to follow safety guidelines.\nSpeaking on the occasion, he appreciated the provincial chief secretaries, MoIB and ISPR for effective media campaign highlighting the stringent efforts made by the government to implement SOPs at grassroots level.\nHe said, “We should continue to hammer SOPs compliance in the masses whereas the positive outcome of enforcement should also be projected at the forum and media”. It was suggested that the provincial chief secretaries to take the opportunity of traders associations contacting with media to make them realize their self-responsibility for implementing the SOPs in the markets.\nHe mentioned that the government had two pronged strategy focusing on disease spread control and upgrading the healthcare system.\nISPR official briefed the forum that complete information sharing was carried out from the highest tier of the government to the lowest one whereas SOPs compliance data would flow from bottom to top.\nThe prompt data sharing from the provinces was appreciated and the efforts made by Khyber Pakhtunkhwa and Islamabad Capital Territory administration was lauded for ensuring strong implementation of SOPs on the ground.\nSpecial Assistant to the Prime Minister on Information and Broadcasting (SAPM) and Chariman CPEC Authority Lieutenant General (R) Asim Saleem Bajwa said there was a need to create balance in the enforcement and avoid creating panic among the masses. He added that ground level engagement with masses would help improve the impact of SOPs compliance.\nThe SAPM also suggested the provinces to share their positive success stories with the ministry for better media projection and coverage. The provincial chief secretaries including that of Gilgit Baltistan and Azad Jammu and Kashmir apprised the forum on action taken for SOPs compliance and smart lockdowns implemented in the areas with maximum COVID-19 cases reported.\nChief Secretary Punjab informed the forum that other than Lahore hundreds of shops were sealed in Faisalabad, Rawalpindi and Multan whereas the City Traffic Police actively engaged with the masses for making awareness on wearing masks and fine to be imposed upto Rs2,000 on violating the safety protocol.\nChief Secretary Balochistan told the forum that around 3,800 shops were sealed across the province on violating SOPs. Chief Secretary Sindh mentioned that there was positive impact of media campaign on SOPs compliance where strict warning notices were issued to markets and shopkeepers on violating SOPs.\nChief Secretary Khyber Pakhtunkhwa said that around 25,000 information and education pamphlets and banners were displayed on ‘No mask no service’ whereas under takings were received from the traders before opening markets to comply with SOPs.\nChief Secretary Gilgit Baltistan informed that around 440 shops were sealed and 1000 people were fined on violation of SOPs where 8 smart lockdowns were implemented in the areas with large number of COVID-19 cases.\nChief Secretary AJK noted that ‘No mask no service’ was in place in the province since May 10 for effective SOPs compliance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:01.291Z"
}
