{
  "title": "PM directs to pace up registration of small grocery shops under Ehsaas Ration Programme",
  "link": "https://www.app.com.pk/national/pm-directs-to-pace-up-registration-of-karyana-stores-under-ehsaas-ration-programme/",
  "date_published": "2021-12-02T06:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP): Prime Minister Imran Khan on Thursday directed the authorities concerned to speed up the registration process for Ehsaas Ration Programme to benefit a maximum number of poor households.\nChairing a meeting on Ehsaas Ration Programme, he also emphasized involving district government authorities to raise awareness among Karyana (grocery shops) stores and the potential beneficiaries in this regard.\nThe prime minister said, “The government is taking all possible measures to provide maximum relief to a common man.”\n“Being cognizant of sufferings of people due to inflation, we are extending subsidy to poorest of the poor people on essential commodities,” he added.\nEarlier, the prime minister was apprised that under Ehsaas Ration Programme, a monthly subsidy of Rs. 1,000 on flour, ghee and pulses would be given to 20 million households of the country that have their monthly income below Rs. 50,000.\nThe prime minister was briefed that the programme would be launched across the country on December 15.  2021. The registration of Karyana stores under the programme is in progress, and more than 15000 Karyana stores have been registered so far.\nThe meeting was attended by Special Assistant on Poverty Alleviation Dr Sania Nishtar, Adviser on Finance Shaukat Fayyaz Tarin, Chief Minister Gilgit Baltistan Khalid Khurshid, Special Assistant on Political Communication Dr Shehbaz Gill and senior officers concerned.\nChief Minister Punjab Sardar Usman Buzdar, Chief Minister Khyber Pukhtunkhwa Mahmood Khan, Prime Minister Azad Jammu and Kashmir Sardar Abdul Qayyum Khan Niazi joined the meeting via video-link.",
  "retrievedAt": "2025-08-11T21:40:47.569Z"
}
