{
  "title": "The Citizens Foundation’ to feature at Dubai Expo 2020",
  "link": "https://www.app.com.pk/national/the-citizens-foundation-to-feature-at-dubai-expo-2020/",
  "date_published": "2021-12-02T13:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 02 (APP):The Citizens Foundation (TCF), perhaps the largest network of independently run schools in the world, is set to be featured at the Expo 2020 Dubai’s Global Best Practices Programme in December 2021.\nThis week as the Expo 2020 Dubai celebrates the Knowledge and Learning Week, we will see many organisations such as TCF highlighting best practices in education to achieve Sustainable Development Goals, said in a Press Release issued here on Thursday.\nThe Citizen’s Foundation is a leading non-profit working to provide quality education in Pakistan’s most neglected rural and slum communities where we find children, especially girls, out of school. Pakistan is the world’s sixth most populous country and has the second-highest number of out-of-school children in the world.\nThese children in Pakistan often face deep-rooted structural inequalities that are most often linked to gender biases, poverty and lack of access to quality schools.\nWhat started as a discussion among 6 friends to correct their country’s trajectory, has now become a national movement and a global best practice. TCF has evolved a model to deliver quality education at scale. It runs 1,687 schools in 62 districts across Pakistan. Currently it has an enrollment of 275,000 students, of which nearly 50% are girls.\n“When we started TCF we wanted to ensure that girls received an equal opportunity to study. That is why we make sure that all TCF schools are within walking distance to communities. We also hire only female teachers to encourage parents to send their daughters to school,” says Ateed Riaz, Co-founder and Chairman of The Citizens Foundation.\nHiring only female teachers has made TCF one of the largest private employers of women in Pakistan with a faculty of 12,950 women. TCF not only provides transportation to these teachers to and from the schools but also conducts a rigorous training of over 120 hours annually to develop their capabilities and ensure quality education in its classrooms.\n“Ensuring that we make a lasting impact in the lives of our students, we decided to provide support beyond just school years,” says TCF’s CEO Asaad Ayub Ahmad.\n“TCF provides ongoing support to its Alumni through scholarships and its Alumni Development Programme where it helps students obtain admissions in universities.”\nTo date 50,500 students have graduated from TCF Schools and this year 733 TCF alumni have received admission in the top universities in Pakistan.\nToday, TCF alumni are serving as agents of positive change and inspiring change in their communities. One such alumna is Dr. Sidra Saleem, daughter of a daily-wage laborer, who grew up in a slum in Karachi. Sidra is now a Doctor of Neurology in Toledo, Ohio and is in her second year of medical residency. She is just one of thousands of TCF alumni who beat all odds and are on the path to success through quality education.\nFor 26 years, TCF is working to transform the children of Pakistan into agents of positive change. TCF remains committed to its mission and magnifying its impact by reaching 2 million agents of positive change by the year 2030.\nIt aims to do this by continuing to expand the formal schooling programmes, supporting alumni through higher education, providing structured interventions for basic literacy and life skills to communities outside the context of formal schooling and nurture and expand partnerships with provincial governments and social enterprises to confront the massive education crisis faced by Pakistan.",
  "retrievedAt": "2025-08-11T21:40:43.878Z"
}
