{
  "title": "Pakistan reaffirms commitment to protection of human rights: law minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "Law Minister Azam Nazeer Tarar assured the international community of Pakistan’s efforts in protecting human rights in the country, saying “robust legislative and policy measures” were in place to ensure that, a statement from the human rights ministry said on Wednesday.\n\nHis remarks came as he addressed a high-level segment of the United Nations Human Rights Council’s 58th session in Geneva yesterday.\n\nAmnesty International, in a statement last year, observed that human rights abuses remained “rampant” in Pakistan. Reports of extra-judicial killings, harassment of human rights defenders, mass arrests, military trials of civilians and violation of freedom of the press were some of the concerns listed by the rights group.\n\nLast month, the European Union warned Pakistan to reconsider its GSP+ status, citing human rights violations as one of the reasons. Pakistan has been a member of the International Covenant on Civil and Political Rights (ICCPR) for more than a decade.\n\n“Highlighting Pakistan’s robust legislative and policy measures, the minister underscored that over 70 human rights-related laws have been enacted in the past decade, with the recent 26th Constitutional Amendment recognising a clean, healthy, and sustainable environment as a fundamental right, a milestone in Pakistan’s human rights framework,” the statement said.\n\nThe law has received much flak for its controversial nature from opposition political parties, journalists, and rights-based groups, a “milestone in Pakistan’s human rights framework.\n\nPer the statement, Pakistan’s engagement with international human rights mechanisms remained steadfast, with Tarar noting that the country underwent its fourth Universal Periodic Review (UPR) in 2023, accepting 70 per cent of the recommendations and committing to their implementation.\n\n“The mid-term UPR report will be submitted soon, reinforcing Pakistan’s proactive approach to human rights commitments,” it said.\n\nSpeaking about Israel’s war on Gaza, the law minister condemned Tel Aviv’s ongoing atrocities in the coastal enclave, stating that forced displacement and demographic re-engineering violated fundamental principles of international law.\n\nHe also denounced India’s illegal occupation of Jammu and Kashmir and its continued denial of the Kashmiri people’s right to self-determination.\n\nAccording to the statement, the minister “called on the Office of the UN High Commissioner for Human Rights to continue monitoring the situation and update its Kashmir reports while urging the establishment of a Commission of Inquiry to investigate systematic human rights violations in IOJK (Indian-occupied Kashmir).”\n\nExpressing grave concern over the global rise in religious intolerance, particularly Islamophobia, Tarar reaffirmed Pakistan’s commitment to combating all forms of discrimination, hostility, and violence based on religion or belief.\n\n“As a nation aspiring to serve its sixth term on the Human Rights Council, Pakistan remains a steadfast supporter of the Council’s mandate and a vocal advocate for justice, equality, and human dignity worldwide,” the statement said.\n\nThe minister also announced Pakistan’s resumption of voluntary contributions to key UN trust funds, including those for victims of torture, the implementation of Universal Periodic Review, and the participation of Small Island Developing States and Least Developed Countries in the Council.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/261646201b46639.jpg",
  "retrievedAt": "2025-08-25T20:01:42.168Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894449/pakistan-reaffirms-commitment-to-protection-of-human-rights-law-minister",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T11:37:34.000Z"
}
