{
  "title": "IHC seeks record on contempt pleas against jail official - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) on Tuesday sought record of two contempt petitions against interior secretary and the superintendent of Adiala Jail for failing to comply with the court order that allowed ex-premier Imran Khan to meet his visitors.\n\nJustice Raja Inaam Ameen Mi­­n­has also directed the petitio­ner to attach the high court’s order da­­ted January 28 with the petition.\n\nAdvocate Faisal Chaudhry, the counsel for Mr Khan, earlier challenged the objections raised by the registrar’s office regarding the pe­­tition’s admissibility, arguing that only courts had the authority to decide admissibility of a petition.\n\nHe said the contempt petition was filed due to the violation of the court order permitting meetings between the PTI founder and his associates.\n\nWhile another petition regarding the PTI founder’s meeting with his wife Bushra Bibi is already under consideration in a separate court, the current petition pertains specifically to the restrictions on his meetings with other visitors.\n\nNotices issued\n\nSeparately, Justice Khadim Hussain Soomro of the IHC issued notices to respondents seeking their responses regarding a joint petition filed by Public Accounts Committee (PAC) chairman Junaid Akbar, along with PTI leaders Rauf Hassan, Sher Ali Arbab and Dr Amjad, who had been denied permission to visit Mr Khan in jail.\n\nAdvocate Ayesha Khalid, representing the petitioners, informed the court they approached the IHC after multiple unsuccessful attempts to secure a meeting with Mr Khan.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:02:19.180Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894385/ihc-seeks-record-on-contempt-pleas-against-jail-official",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:00:32.000Z"
}
