{
  "title": "PCB reviews security after ‘pitch invasion’ - Sport - DAWN.COM",
  "author": null,
  "content": "• ‘Intruder’ gets bail, banned from all venues\n• Imran slams board chairman over India defeat\n\nRAWALPINDI: The Pakistan Cricket Board (PCB) took serious note of a security breach during the ICC Champions Trophy match between New Zealand and Bangladesh on Monday, when a spectator entered the field of play at Rawalpindi Cricket Stadium.\n\nDuring the incident, a man ran onto the pitch holding a photo of Tehreek-i-Labbaik Pakistan (TLP) chief Hafiz Saad Rizvi and attempted to hug New Zealand player Rachin Ravindra.\n\nThe intruder, identified as an Attock resident, was held and a case was registered at the New Town police station. On Tuesday, a local court granted bail to him upon furnishing a surety bond of Rs50,000.\n\n“The PCB has taken serious note of the security breach that occurred yesterday when a spectator entered the field of play. Ensuring the safety of players and officials remains our top priority,” the board said on Tuesday.\n\n“The individual involved was arrested and presented before a court of law today. In addition, he has been permanently banned from entering all cricket venues in Pakistan,” it added.\n\n“To prevent such incidents in the future, the PCB is working closely with security agencies and venue authorities to review and re­­inforce security protocols,” it said.\n\nPitch invasion incidents are com­mon in cricket and other spor­­ts across the globe when overeager fans enter the playing field to try and meet their favourite players in person. A pro-Palestinian protester in India broke thro­ugh security cordons to invade the pitch at the ICC World Cup final in 2023, stopping play briefly while he hugged batsman Virat Kohli.\n\nAccording to the FIR registered for obstructing a public servant in performing duties and criminal trespass, filed by Sub-Inspector An­­warul Haq, the man scaled the boundary fence from the Yasir Arafat Enclosure at around 8:15pm and entered the playing field, violating security directives. He was apprehended by security personnel. The suspect was presented before the court which gra­nted him bail on the surety bond.\n\nMeanwhile, law enforcement agencies decided to strengthen security arrangements for upcoming matches, with over 5,000 police personnel and 350 traffic officers being deployed.\n\nA special control room was set up to monitor movement in and around the stadium. Also, snipers have been stationed on rooftops while police, elite forces and dolphin force squads are patrolling the vicinity.\n\nImran criticises Naqvi\n\nSeparately, former prime minister Imran Khan criticised PCB chairman Mohsin Naqvi following Pakistan’s defeat against India in the Champions Trophy.\n\nAccording to Mr Khan’s sister, Aleema Khan, who spoke to reporters outside Adiala Jail, the ex-premier attributed the defeat to “appointments made on recommendations rather than merit,” blaming it for the decline of cricket standards in the country.\n\nAleema said her brother watc­h­­ed the match on PTV.\n\n“Imran Khan said Mohsin Naqvi was ap­­pointed as PCB chairman and his actions destroyed the cricket in the country. No one in Pakistan has as many posts as Mohsin Na­­qvi has. If he (Mr Naqvi) was a res­pectable person, he would have resigned after such a defeat,” she quoted Mr Khan as saying.\n\nIkram Junaidi in Islamabad also contributed to this report\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/26095155201f6d7.jpg",
  "retrievedAt": "2025-08-25T20:02:19.238Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894387/pcb-reviews-security-after-pitch-invasion",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:00:32.000Z"
}
