{
  "title": "Trump to sell ‘gold card’ US visas for $5 million - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump unveiled plans on Tuesday to sell new “gold card” residency permits for a price of $5 million each — and said Russian oligarchs may be eligible.\n\nTrump said sales of the new visa, a high-price version of the traditional green card, would bring in job creators and could be used to reduce the US national deficit.\n\n“We’re going to be selling a gold card. You have a green card, this is a gold card. We’re going to be putting a price on that card of about $5 million,” Trump told reporters in the Oval Office.\n\nThe Republican president, who has made the deportation of millions of undocumented migrants a priority of his second term, said the new card would be a route to highly prized US citizenship.\n\n“A lot of people are going to want to be in this country, and they’ll be able to work and provide jobs and build companies,” Trump said. “It’ll be people with money.”\n\nSales of the cards would start in about two weeks, Trump added.\n\n“We’ll be able to sell maybe a million of these cards. We have it all worked out from a legal standpoint,” Trump added.\n\nThe billionaire former real estate tycoon said that all applicants for the new gold cards would be carefully vetted. But asked if wealthy Russians would also be able to apply, Trump said it was a possibility.\n\n“Possibly. I know some Russian oligarchs that are very nice people. It’s possible,” Trump said. “They’re not as wealthy as they used to be. I think they can. I think they can afford $5 million.”\n\nA number of Russian oligarchs have been hit by Western sanctions since Moscow’s invasion of Ukraine three years ago.\n\nTrump has caused shock in European capitals by suddenly opening negotiations with Russia to end the war, amid fears that he could be willing to sell Ukraine short.\n\nThe US president told reporters that lifting sanctions on Russia was possible “at some point” but was not currently on the table.\n\nUS Commerce Secretary Howard Lutnick, standing at Trump’s side in the Oval Office, said of the gold cards that “we can use that money to reduce our deficit.”\n\nTrump, who has branded a series of hotels and casinos in a long business career, even suggested the new cards could also be named after him.\n\n“Somebody said, ‘Can we call it the Trump gold card?’ I said, ‘If it helps, use the name Trump,’” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/2613010899cc833.jpg",
  "retrievedAt": "2025-08-25T20:01:45.473Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894427/trump-to-sell-gold-card-us-visas-for-5-million",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T08:03:28.000Z"
}
