{
  "title": "US ruling party official and Trump confidante writes to top US diplomat to ‘free Imran Khan’ - World - DAWN.COM",
  "author": null,
  "content": "US Congressmen Joe Wilson and August Pfluger have written to Secretary of State Marco Rubio, urging him to engage with Pakistan to secure the release of former prime minister Imran Khan.\n\nWilson has made several posts on his X account in the past weeks, calling for Imran’s release. The PTI founder has been incarcerated since August 2023 in a series of legal cases, which he claims were “politically motivated”.\n\nWilson, a key member of the House Foreign Affairs and Armed Services committees, heads the Republican Policy Committee and is considered close to US President Donald Trump. Pfluger chairs the Republican Study Committee.\n\nIn a joint letter to top US diplomat Rubio, dated February 25, Wilson and Pfluger wrote: “We write as staunch conservatives to ask that you engage with the military regime of Pakistan to free Imran Khan.”\n\nSharing a copy of the letter on his X account, Wilson said he and Pfluger were urging Rubio to “free Imran Khan and work to restore democracy in Pakistan”.\n\n“US-Pakistan relations are strongest when they are based on freedom!” he added.\n\nThe letter said Imran was “widely beloved in Pakistan, and his release would usher in a new era of US-Pakistan relations with freedom values at its core”. It recalled that the PTI founder was the prime minister “in your first term, and you both shared a strong relationship”.\n\n“Former PM Imran Khan has been the victim of massive judicial abuse, not unlike President Trump,” the congressmen said, adding he was imprisoned on “trumped-up charges”.\n\nApparently terming Imran’s ouster in 2022 through a vote of no-confidence as the “suspension of democracy in Pakistan”, they claimed: “This suspension has strained US-Pakistan relations as the military regime has cracked down on dissent.\n\n“More broadly, we urge you to work with Pakistan to restore democracy, human rights, the rule of law, and respect for the fundamental guarantees of due process, freedom of press, freedom of assembly, and freedom of speech for the people of Pakistan.”\n\nWilson and Pfluger asserted that Imran deserved to be “treated as any other politician would be”. “He does not belong in prison, and his persecution is a stain on Pakistan’s history.\n\n“We know that your goal is to have the strongest relations with every country in the world, and the strength of the US-Pakistan relationship hinges on freedom for Imran Khan,” the letter concluded.\n\nThe letter comes over a week after Wilson met with Rubio. “I look forward to working with him (Rubio) to restore democracy in Pakistan,” he had said.\n\nThe meeting had come on the heels of the Pakistani American Political Action Committee (Pakpac) organising meetings on Capitol Hill throu­ghout the week, pressing lawmakers to take a stronger stance on democracy and human rights in Pakistan.\n\nEarlier this month, Wilson had sent a letter to President Asif Ali Zardari, Prime Minister Shehbaz Sharif and Chief of Army Staff General Asim Munir, emphasising that a strong US-Pakistan relationship was in the national interest of both countries.\n\n“In over 75 years of bilateral relations between the US and Pakistan, our relationship has been at its strongest when Pakistan upholds its democratic ideals and the rule of law,” he had written.\n\n“Democracy cannot work if political opponents are unjustly detained on politicised charges rather than defeated at the ballot box.”\n\nThat letter was followed by his calling for Imran’s release on the floor of the US Congress.\n\n“Pakistan has been a valued partner of the United States for 70 years, and our relationship is strongest when Pakistan embraces democratic principles and the rule of law,” he told the House of Representatives.\n\nSadly, he had added, Pakistan has undermined demo­cracy by jailing the ex-premier. Wilson also drew a parallel between Imran’s legal troubles and those of Trump before the latter won a second term in office in November 2024.\n\nLast month, in an interview with Voice of America, Wilson said he had told Interior Minister Mohsin Naqvi that relations between Islamabad and Washington could only improve with Pakistani institutions following the rule of law. He had also called for Imran’s release.\n\nSeparately, Wilson that he had almost finished drafting the Pakistan Democracy Act.\n\nHe had first announced his drafting of the bill in a Feb 13 X post, saying the bill would seek to “ban from the US those in the Pakistan military government responsible for the wrongful persecution and imprisonment of Imran Khan”.\n\nWilson outlined the bill’s salient features in an X post today, saying it sets down that it is US policy to restore democracy in Pakistan, mandates a 30-day determination of sanctions on senior officials and reviews all senior officials and their families for sanctions.\n\nA portion of the bill he shared said it sought to “authorise the imposition of sanctions with respect to certain foreign persons who have knowingly engaged the wrongful persecution and imprisonment of political opponents in Pakistan, and for other purposes”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/2617334258cc771.png",
  "retrievedAt": "2025-08-25T20:01:40.768Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894451/us-ruling-party-official-and-trump-confidante-writes-to-top-us-diplomat-to-free-imran-khan",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T16:44:18.000Z"
}
