{
  "title": "Disputed canal project - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE widespread protests across Sindh against the controversial canal project on the Indus has put the province on the boil.\n\nThe Save River Indus drive is fast turning into a mass movement, bringing together diverse political forces. The issue has put the PPP, which has ruled the province without interruption for the past 16 years, in a precarious position.\n\nAlthough the PPP has lately distanced itself from the federal government’s decision to build six canals to irrigate desert land in Punjab, the matter has nevertheless placed the party at the centre of the storm. For many, the canal project means turning a large part of the province into barren land. And the PPP being a part of the ruling coalition at the centre cannot escape the blame for the looming disaster.\n\nWhile the distribution of water from the Indus has long been a politically sensitive matter for Sindh, the latest controversy over the new canals has turned the situation in the province extremely volatile.\n\nIt has given a huge impetus to Sindhi nationalism, which had been largely dormant for a long time, with the PPP dominating the provincial political landscape.\n\nThe people of Sindh are seething and their voice needs to be heard.\n\nThousands of people, mostly the youth and women, are joining the protests organised by disparate Sindhi nationalist groups across the province. Many mainstream political parties and members of civil society have also come out to oppose the canal project that they believe would undermine the unity of the federation.\n\nGrowing public anger has also forced the provincial administration to challenge the federal government’s divisive canal project. But there is still a lot of scepticism over the PPP’s position. The party leadership remained quiet for a long time while work on the project had already started. Some allege that President Asif Zardari had assented to the project last year. It is also alleged by the opposition that the provincial government has granted thousands of acres of agricultural land to the Green Pakistan Initiative launched by the federal government and backed by the establishment. The army chief and Punjab chief minister recently inaugurated a GPI project in the southern Punjab region of Cholistan that is to be irrigated by the new canals on the Indus.\n\nFor many provincial leaders, the proposed canals echo the controversy over the long-dead Kalabagh dam project that had united the entire province in protest. A major concern is that the canals would further reduce the flow of water to Sindh. Thousands of acres of land are devoured by the sea each year with the depleting level of water flows in the Indus.\n\nFederal Planning Minister Ahsan Iqbal’s reassurance that no water will be diverted from Sindh’s share has been met with scepticism. There is no surplus water available from its quota that Punjab could spare for the Cholistan canal project. How will it have the quantity needed to fill the capacity of the canals?\n\nWhat is most shocking is that such a sensitive issue pertaining to the federation was never discussed and approved by the Council of Common Interests. It’s also surprising that the PPP did not demand a CCI meeting earlier when the canal plan was starting to take shape, and only woke up to the disturbing issue after the opposition took to the streets. It has been several months since the protests started, but there seems to be no clear policy yet to deal with the issue that directly affects people’s lives. The Sindh government has denied the allegation of failing to raise the issue with the federal government more effectively. Yet, it’s lacklustre approach in dealing with a highly serious issue raises questions.\n\nIt’s not just about standing up to the federal government but also the security leadership which is backing the GPI. With its huge stakes in the present hybrid system, it’s not surprising that the PPP would try to avoid any direct confrontation on the issue.\n\nPPP leaders maintain that the party will adopt constitutional and democratic methods to fight Sindh’s case. That may be a wise thing to do but it would require much more to deal with an issue that is threatening the federal structure. There is a need to resolve the dispute over the canal project sooner than later as the prevailing public unrest in the province can take a more violent turn. It’s a serious crisis that could destabilise the province. With KP and Balochistan already in turmoil the growing unrest in the country’s second most populated province would be disastrous for the federation.\n\nThere is a growing demand that the canal project, which nationalist leaders say is a life and death issue for Sindh, be shelved. While these leaders’ words sound extreme, the people’s concerns about the project are not unfounded. The major responsibility lies with the federal government and the establishment to heed those concerns. The people of Sindh are seething and their voice needs to be heard.\n\nThere exists a comprehensive constitutional mechanism for resolving water disputes among the provinces but it is hardly followed. The Sindh government accuses the federal government of failing to fully implement the Water Apportionment Accord of 1991. The unilateral decision to build the canals is a violation of the Constitution. It seems that those in power have not learnt any lesson from our history.\n\nThe ongoing public protests on the canal issue also reflect the growing distrust between the federating unit and the federation. It will only strengthen extremist nationalist forces. The widespread protest is just one indicator of the growing public discontent, particularly among the youth, against an elite-dominated system.\n\nIt’s also a message for the PPP which has ruled the province for decades. It seems that the party, which claims to champion the struggle for people’s democratic rights, is now only interested in protecting its own power. It seems to have lost touch with the fast-changing social and political landscape in the province. The latest wave of protests must come as a wake-up call for the party leadership.\n\nThe writer is an author and journalist.\n\nzhussain100@yahoo.com\n\nX: @hidhussain\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67be66bb6eaf4.jpg",
  "retrievedAt": "2025-08-25T20:01:46.277Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894398",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:01:35.000Z"
}
