{
  "title": "Let sanity prevail - Pakistan - DAWN.COM",
  "author": null,
  "content": "A SINGLE piece of advice can change a life, says Richard Reed, a writer who embarked on a project to seek the most valuable advice through interviews and encounters with some remarkable people from all walks of life.\n\nHis efforts resulted in the book If I could tell you just one thing…. “Good advice,” he says, “is like a nutrient-rich broth, made from boiling down the bones of life.” He means what he says by capturing the insights gained from someone else’s “hard years of experience, thereby allowing us all to benefit from them”. I can’t resist sharing some pearls of wisdom collected through a global pool of advice.\n\nTerry Waite — the Church of England’s envoy to negotiate the release of prisoners — was himself held hostage for five years in Lebanon in the late 1980s. His objective was to achieve reconciliation. Having empathy was a fundamental tenet of his approach to life which helped him to set three rules for himself: “no regrets, no self-pity and no sentimentality”. He said: “We are all members of the same human family. We all have fears and hopes and aspirations.” According to him, every disaster, or seeming disaster, in life can be mostly turned around and something creative can emerge from it. “It’s the way you approach it, and the way you approach life after.” This kind of empathy is the need of the hour in Pakistan today. Let’s embark upon the path of reconciliation after a phase of terrible persecution and brutality perpetrated by various elements of national power.\n\nStephen Fry, a British self-confessed techno-geek, with a love of traditions and cultures, believes it is better to put yourself in the shoes of others. “It is the secret of art, and it is the secret of life: the more time you spend imagining what it’s like to be someone else, the more you develop empathy for others, the easier it is to know yourself and to be yourself.” Let our ruling elite imagine themselves behind bars on false charges to satisfy the perverse egos of haughty minds. Will they abandon the course of resentment, which destroys everything but itself?\n\nEsther Perel, renowned relationship therapist and the daughter of Holocaust survivors, advises: “The quality of your life ultimately depends on the quality of your relationships. Not on your achievements, not on how smart you are, not on how rich you are, but on the quality of your relationships, which are basically a reflection of your sense of decency, your ability to think of others, your generosity.”\n\nShe adds that ultimately at the end of your life, you are remembered for “how you treated the people around you and how you made them feel”. In the present-day environment of acrimony, can we sincerely consider adopting the course of forgiveness and reconciliation?\n\nWe should embark upon the path of reconciliation after a phase of persecution and brutality.\n\nPatrisse Khan-Cullors, co-founder of Black Lives Matter, wants the oppressed to get organised if they seek change. “It is too easy to become demoralised, to say this is awful and terrible, we’re not going to get out of this. But we will. This too shall pass. It will be a blip in history.” To fundamentally overhaul the system, people need to get organised, understand their goals and prepare for a long fight. And to win against authoritarian forces, we need to stay strong as defenders of true democracy. That’s what matters.\n\nHarry Belafonte, titan of the US Civil Rights Movement, has this piece of advice to offer: “Discover the joy of embracing diversity. When people become more open to the strange, to the unusual, to the radical, to the ‘other’, we become more nourished as a species. Currently, our ability to do that is being manipulated, diversity is being looked upon as a source of evil rather than as a source of joy and development. We must recapture the profound benefits of seeing the joy in our collective diversity, not the fear.”\n\nIn Pakistan’s context, diversity is our strength. The state must seek unity in diversity by engaging constructively with the disillusioned Baloch youth and the politically disempowered segments of society who are crying out for inclusivity and fair play. The radical ‘others’ need to be understood and embraced rather than condemned and killed.\n\nDr Maki Mandela, a daughter of Nelson Mandela believes “all strength and power comes from within”. One must deal with inner demons, bitterness, anger and live one’s own life by walking one’s own path. Her father was living proof as he walked down his own path to freedom.\n\nCriminal defence attorney Nancy Hollander knows that the law is bigger than the government. She stands resolute, taking on opponents much bigger than herself. “Whatever you do, do it with intent … Do not say something unless you mean it, do not do something unless you are committed.” This is the dilemma we face today; we must insist that the institutions of the state shall follow the Constitution and prosecute people fairly.\n\nThere are few better symbols of the fight for justice than two of Nelson Mandela’s fellow freedom fighters: Ahmed Kathrada and Denis Goldberg who were also imprisoned for three decades by the apartheid regime. Denis quotes John Stuart Mill: “To be free, it is not sufficient to cast off your chains; you must so live that you respect and enhance the freedom of others.” Kathrada states his truth: “And ultimately, the fight for justice will inevitably lead to success. No matter what the sacrifices are.”\n\nArchbishop Desmond Tutu proclaimed: “I am who I am only through others in society. We’re humans in the end, and that’s what it’s all about.” And finally, the Dalai Lama’s advice in a single word: “Oneness.” That one word contains a lifetime of wisdom. He says: “We are all part of humankind… We are all interdependent… We need to place less emphasis on our secondary differences, our religions, our nation states, and more emphasis on the fact that ultimately, we are the same. That is how we can live much more peacefully.”\n\nThe writer is a former IG police. His book Walking a Tightrope was published recently.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67be670047e4e.jpg",
  "retrievedAt": "2025-08-25T20:01:46.846Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894399/let-sanity-prevail",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:01:35.000Z"
}
