{
  "title": "Petrol may see a spike - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The petrol price is expected to rise by approximately Rs4 per litre, while the diesel rate is likely to decrease slightly on Friday for the upcoming fortnight starting March 1 due to fluctuations in the international market and exchange rates.\n\nInformed sources said the ex-depot petrol price was estimated to go up by Rs4 to 4.50 per litre depending on the final calculation on Feb 28, while high-speed diesel (HSD) and kerosene may drop by less than a rupee per litre.\n\nThe estimates for higher petrol prices stem from a slight increase in international rates and exchange rate loss against the dollar. The benchmark Brent prices have generally remained stable during the last ten days.\n\nThe ex-depot petrol price currently stands at Rs256.13 per litre, while that of HSD is Rs263.95 per litre. Kerosene’s official rate is Rs171.65 per litre, but it is sold at Rs300-350 per litre.\n\nPetrol is mainly used in private transport, small vehicles, rickshaws, and two-wheelers, and it directly affects the budget of the middle and lower middle classes. Most of the transport sector runs on HSD. Its price is considered inflationary as it is mostly used in heavy transport vehicles, trains and agricultural engines like trucks, buses, tractors, tube wells and threshers, which adds to the prices of vegetables and other eatables.\n\nThe government is charging about Rs76 per litre tax on petrol and HSD. Although the general sales tax (GST) is zero on all petroleum products, the government charges Rs60 per litre petroleum development levy on both products that normally impact the masses.\n\nThe government also charges about Rs16 per litre customs duty on petrol and HSD, irrespective of their local production or imports. In addition, about Rs17 per litre distribution and sale margins are charged by oil companies and their dealers on both products.\n\nOn the other hand, it charges Rs50 per litre on light diesel and high octane blending components and 95RON petrol used by the wealthy in luxury imported vehicles.\n\nPetrol and HSD are the major revenue spinners, with their monthly sales of about 700,000-800,000 tonnes compared to the demand for kerosene at just 10,000 tonnes.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:02:12.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894378/petrol-may-see-a-spike",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:00:41.000Z"
}
