{
  "title": "Three buried beneath snow avalanche in Neelum Valley - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD:Three residents of the upper belt of Neelum Valley were buried under a snow avalanche early on Tuesday morning, and despite relentless efforts by their community, their bodies had not been retrieved by late evening, officials confirmed.\n\nDeputy Commissioner Neelum Nadeem Ahmed Janjua told Dawn that five residents of Phulawai village—part of Gurez sub-valley—had travelled to theirDudgaibehakon Sunday, taking advantage of a sunny day, presumably to check on their summer dwellings.\n\nBehaks are high-altitude hamlets where villagers migrate in the summer along with their cattle. In some dialects, they are also known asMahlis.Dudgaibehakis located about eight kilometers to the left of Taobutt, the valley’s last settlement, roughly 190 kilometres from Muzaffarabad.\n\nThe group, identified as Munir, son of Alamgir; Tehseel, son of Syed Mira’n; Waheed, son of Mashkoor; Shahzad, son of Shiraz; and Mohammad Zahid, son of Shafi, spent two nights in their traditionaldhara—modest huts made of mud and wood.\n\nHowever, on Tuesday morning, four of them were caught in a snow avalanche nearGagai Nullah,a water channel that originates from the rear side of the Deosai region in Gilgit-Baltistan (GB) and merges into the Neelum River at Taobutt.\n\nZahid was the only one who survived after being pulled out of the snow by his fellow villager, Shahzad. The other three were buried alive under the heavy mass of snow.\n\nAccording to officials, this area is home to an ancient pedestrian route linking Neelum Valley with Astore district in GB. The track is still used by nomadic communities and locals, many of whom have familial and cultural ties on both sides. Notably, the residents of Phulawai speak both the Shina and Pahari languages.\n\nSurvivors recount ordeal\n\nAkhtar Ayoub, the district disaster management officer in Neelum Valley, said that the two survivors immediately rushed downstream to alert their community about the tragedy. Villagers launched a rescue operation, but by evening, they had been unable to recover the missing men.\n\n“We were at the nullah when suddenly a massive wave of snow engulfed us,” Shahzad recalled in a video shared with media persons by Mr Ayoub.\n\nHowever, when asked why they had ventured into the snowbound area, the survivors could not provide a clear reason beyond checking on their summer hamlets.\n\nAn official source, speaking on condition of anonymity, hinted that the men may have been hunting in the snow-covered region.\n\n“When weather improves after snowfall, wildlife such as ibex and deer often emerge in search of food. Local villagers, aware of this pattern, sometimes venture into such areas to hunt for meat,” he speculated.\n\n“It is unlikely they went there just to check on abandoned houses.”\n\nMr Ayoub agreed that this used to happen but stopped short of confirming whether the victims had the same purpose for their visit.\n\nRecurring avalanche disasters Avalanches frequently claim lives in the upper reaches of Neelum Valley during winter.\n\nIn March 2021, five members of a family perished in Surgan after their house was buried under a massive snow slide.\n\nHowever, the deadliest incident occurred in January 2020, when three successive avalanches struck Bakwaali and Seri hamlets in the Surgan area, killing 75 residents and injuring 56 others.\n\nWith heavy snowfall continuing in the region, Deputy Commissioner Janjua said that rescue teams from the army and police were on standby but had been unable to proceed due to relentless snowfall.\n\n“If the weather permits, teams will be dispatched on Wednesday,” he said.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:01:48.789Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894301/three-buried-beneath-snow-avalanche-in-neelum-valley",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:01:15.000Z"
}
