{
  "title": "Rawalpindi admin chalks out plan to prevent flooding in monsoon - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: To avoid a flood-like situation in Leh Nullah and Soan River in monsoon season, the district administration has chalked out a plan for desilting of Leh Nullah and other drains besides removal of encroachments along these nullahs.\n\nA senior official told Dawn that the district administration had finalised a plan to avoid a flood-like situation in monsoon season and detected 19 vulnerable points along Leh Nullah and Soan River. The work will start next month.\n\nThese vulnerable points are: Kattarian, Bangash Colony, Ziaul Haq Colony, Boring Road, Dhoke Naju, Dhoke Dalal, Pirwadhai, Dhoke Hassu, Hazara Colony, Dhoke Ratta, Gawalmandi, Dhoke Ellahi Bux, Javed Colony, Nadeem Colony, Bakramandi, Tench Bhatta, Range Road, and Sharoon Colony along Soan River.\n\nHe said the Water and Sanitation Agency (Wasa), Rawalpindi Waste Management Company (RWMC), Rescue 1122, Civil Defence, and the Rawalpindi Municipal Corporation will assist the district administration.\n\nWasa to clean Leh nullah; RWMC and RMC to clean 11 other drains\n\n“Wasa will desilt Leh Nullah and the RWMC and the RMC will clean ‘roadside drains’ and 11 big nullahs; the work will be completed by May-end and the district administration has already imposed a ban on dumping solid waste and construction material along nullahs and drains,” he said.\n\nFor encroachments, he said that the Rawalpindi Municipal Corporation and the Rawalpindi Development Authority had been directed to complete the survey in their respective areas to clear encroachments before the summer season.\n\nHe said that maintenance of Leh Nullah in the jurisdiction of cantonment boards would be their responsibility, adding the administration would improve coordination with civic bodies in the cantonment areas to finish the work before monsoon.\n\nHe said that Wasa would send its estimates for cleaning the nullah to the Punjab government so that the work could be started as soon as possible. He said that the health authority had been asked to activate dispensaries along Leh Nullah to launch work for dengue surveillance and deal with monsoon-related cases.\n\nWhen contacted, Deputy Commissioner Dr Hassan Waqar Cheema said a flood contingency plan had been made so the departments would complete their tasks ahead of the rainy season.\n\n“The Punjab government made clear directions to save the garrison city from any kind of flood in the monsoon season and in this regard, the duties of the civic bodies had been assigned to complete the work within two months,” he said.\n\nHe said that two months were enough for preparation to avoid a flood-like situation, adding that the district administration decided to take strict action over negligence.\n\nHe said that Rawalpindi Waste Management Company had been asked to thoroughly clean the drains and collect garbage, including solid waste, and dump it out of the city as well as bring more integrated systems for garbage collection.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:01:47.993Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894291/rawalpindi-admin-chalks-out-plan-to-prevent-flooding-in-monsoon",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:01:16.000Z"
}
