{
  "title": "Girl gang-raped by two men in Lodhran - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: An 18-year-old girl was allegedly gang-raped by two men here on Tuesday in Dunyapur, Lodhran district.\n\nComplainant ‘N’ told the police that her daughter was on her way to meet her neighbours when she was forcibly led to a nearby cattle pen by two suspects ‘H’ and ‘M’ who allegedly gang-raped her there.\n\nAccording to police spokesman, after registration of a rape case against them, ‘H’ was arrested. He said raids are being carried out to arrest the other suspect.\n\nMeanwhile, Lodhran police claimed to have arrested four suspects Abdul Rafay, Shahid, Zaigham and Hasnat out of total five, who allegedly tortured a man, Ali Ahmed, and uploaded his video on social media. Victim Ali Ahmed said the suspects had an altercation with him a few days back.\n\nPolice after their arrest lodged them in lock-up.\n\nPOISONED: A woman was allegedly poisoned by her husband here on Tuesday in Gailiwal police precincts.\n\nAccording to police sources, Saeed, a resident of the Gailiwal police station limits in Lodhran district, alleged that Rafique, the husband of deceased Nousheen, had alleged affairs with women in the area and his wife used to reprimand him.\n\nIn response, Rafique served her a poisonous substance on Monday as a result she fell unconscious. She was taken to Bahawal Victoria Hospital (BVH) where she expired on Tuesday.\n\nFollowing a complaint by Nousheen’s uncle Saeed, the Gailiwal police registered a murder case and arrested Rafique.\n\nFurther investigation is underway.\n\nENCOUNTER: An alleged burglar, Irfan alias Budda Baloch, was injured in a police encounter after being shot by his own two accomplices, who managed to escape near Pathanwala in the jurisdiction of Saddar Lodhran police station.\n\nPolice said Irfan, along with his two armed accomplices, allegedly snatched a motorcycle, a purse and a mobile phone at gunpoint from a man, Safdar, and attempted to flee.\n\nHowever, as they were escaping, they encountered a police team at a checkpoint. The suspects allegedly opened fire on the police and during the exchange of gunfire, Irfan was injured by shots fired by his own accomplices, who then fled the scene.\n\nThe police have registered a case against the arrested Irfan and his accomplices, who remain at large.\n\nPROJECTS: Divisional Commissioner Musarrat Jabeen on Tuesday briefed of Punjab CM’s Inspection, Surveillance and Monitoring Directorate Chairperson retired Brig Babar Allauddin on the ongoing development projects in the Bahawalpur division.\n\nThe chairperson also met Regional Police Officer (RPO) Rai Babar Saeed, who briefed him on the declining crime rate in the region.\n\nEarlier, the chairperson visited Sadiq Public School (SPS) in Bahawalpur.\n\nADJOURNED: The Bahawalpur bench of Lahore High Court (LHC) on Tuesday adjourned the hearing of the dispossession case of Cholistanis to Wednesday as some of the respondents are expected to attend the court today.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:39:27.109Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894318/girl-gang-raped-by-two-men-in-lodhran",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:01:10.000Z"
}
