{
  "title": "Opposition alliance accuses govt of forcing Islamabad hotel to revoke permission for moot’s 2nd day - Pakistan - DAWN.COM",
  "author": null,
  "content": "The opposition alliance Tehreek Tahafuz Ayeen-i-Pakistan on Wednesday accused the government of pressuring an Islamabad hotel’s administration to revoke permission for the second day of its two-day conference, which was being held at the venue, but vowed to proceed with the event.\n\nAfter talks between the government and the opposition collapsed in January, the PTI made another push to establish a joint front against the federal government and roped in Abbasi to become part of its anti-government movement.\n\nThe two-day moot conference kicked off in Islamabad today at the Legend Hotel, where opposition parties gathered to discuss the current political situation and national issues.\n\nAddressing a press conference in Islamabad with other opposition leaders beside him, former prime minister and president of the Awaam Pakistan party Shahid Khaqan Abbasi said the conference was on the country’s issues and the rule of law and the Constitution.\n\n“There was nothing which was against any matter of the state or any talk of incitement. Just talks on the Constitution and the rule of law. This is the country’s capital and today we have a government in existence that is worried by the name of the Constitution and a single conference.\n\n“This conference was behind closed doors. It was not out in the streets with the participation of hundreds of thousands but only a few hundred people were there in an auditorium but the government could not bear this and after the end of the conference’s first day, the hotel administration told us that there were intelligence or administration officials here who threatened the hotel staff that if you hold the conference you will be fined millions and you will be detained even though this hotel is for lawyers and provides services to them and it is linked to the institution of the Supreme Court as well,” he said.\n\nAbbasi added that despite the above, the opposition members were told that they could not hold the second day of the moot at the Legend Hotel’s premises. “The hotel [staff] expressed its helplessness,” he said.\n\nThe former premier said the opposition members told the hotel administration that they had already made a booking for two days and it was a national conference with a discussion of the country’s issues so if anyone had exerted pressure on the staff then this should be given in writing that the conference could not be held for the above reason.\n\n“The hotel administration unfortunately appears desperate. So we have decided this conference will definitely take place tomorrow. This is our constitutional right. Not only that, we are also talking about the Constitution so this is the biggest argument for this government’s failure and weakness that today they’re worried by the name of the Constitution. They are worried about one conference.”\n\nHitting out at a PML-N supplement published in today’s newspapers, he said its reality was that the government spending “billions on advertisements is today fearful of a single conference”. He said the above amounted to the government’s “total performance” and said it was a moment to ponder what the state of the rest of the country, its affairs and the government was then.\n\n“This is misfortune. This government is based on two major parties that have ruled for the last 50 years. We have also been part of them but today the misfortune is that those talking about democracy and the Constitution are now scared of them. This government is established today only for the lust for power, it has nothing to do with the country’s issues and wants to remain in power at any cost. This is the country’s reality today.”\n\nHe reiterated that the conference would definitely be held tomorrow.\n\nA video shared on the PTI’s X account showed opposition members sitting in the office of a hotel staff member and telling him they would go ahead with their seminar’s second day, even if they had to hold it on the street outside the premises.\n\nThe hotel staff member could be heard saying: “I only know one thing, there are 150 employees here, it’s their livelihood, I’m looking at it from that angle. Politically you are completely right, I’m not objecting to anything. But if not today or tomorrow, they might come two days later, lock the place and go and then what I can do?”\n\nThe opposition members assured the staff member that they would support and fight for the employees if the premises were shut down.\n\nSpeaking after Abbasi, Leader of the Opposition in the National Assembly Omar Ayub praised the content of today’s discussions on the conference’s first day.\n\nHe said everyone talked about strengthening the country, adding that everyone gathered was of a democratic mindset.\n\n“We are talking to strengthen the country and here the hotel administration came to us and expressed their desperation that they are under pressure. Questioned about whose pressure, they said: ‘You are wise people so realise.’\n\n“So then the sensible person understands that it either may be Gog and Magog or angels or intelligence officials but it must be someone who is pressuring them.”\n\nHe said the opposition members demanded of the hotel administration to give the matter in writing and said the alliance strongly condemned the situation. “I want to tell the people in this installed regime … that if they do this tomorrow [because] we will definitely come, then I will directly knock on the chief justice of Pakistan’s door as opposition leader because just recently on his invitation, we went and briefed him about the lack of the Constitution and the law in the country with the judiciary driven against the mall and its living example is these antics of the installed regime.”\n\nTTAP head Mehmood Khan Achakzai vowed to continue “this sacred battle” and said the alliance would return for the moot’s second day. “This alliance has announced a fight against unconstitutional and undemocratic forces. We will fight this battle in a democratic manner,” he added.\n\nAchakzai said the TTAP was a natural and organic alliance unlike all those previously seen in the country’s political history.\n\nIn April last year, the PTI already formed a multi-party opposition alliance named Tehreek Tahafuz Ayeen-i-Pakistan (TTAP), comprising the Sunni Ittehad Council, Pashtunkhwa Milli Awami Party, Balochistan Nat­ion­­al Party-Mengal, Jamaat-i-Islami, and Majlis Wahdat-i-Muslimeen.\n\nTTAP leaders on Saturday also met Grand Democratic Alliance chief Pir Pagara and invited the GDA to the two-day national conference.\n\nPTI Secretary General Salman Akram Raja had said on the occasion his party wanted democratic rights in the country. He was of the view that his party’s politics was for the people of Pakistan and urged others to join them since it was a struggle for the country’s survival.\n\nRestrictions have been imposed on freedom of expression and trade unions are being abolished, he said, claiming that PTI was up against injustices and the party founder Imran Khan had asked them to approach everyone, including Pashtun Tahaffuz Movement leader Manzoor Pashteen and rights activist Mahrang Baloch.\n\nPrime minister’s aide on political affairs Rana Sanaullah rebuffed claims that the hotel was ordered to stop hosting the moot on the instructions of the government.\n\n“Which hotel said that the government ordered them to stop hosting the conference?” Sanaullah asked while appearing on Geo News programme ‘Aaj Shahzeb Khanzada Kay Saath’.\n\n“If the opposition wishes to tell the truth, then they should. Which minister or officer gave orders against the conference?”\n\nThe former interior minister said it may be possible that the claim was fabricated by a staff member at the hotel. “Maybe someone on the hotel staff is against the conference,” he said.\n\n“There are deputy commissioners, commissioners, ministers and the rest of the government beyond that,” Sanaullah clarified. “If any of them reached out to the hotel, then tell us.”\n\nSpeaking during the conference earlier, Abbasi said those in power were “suppressing democracy and dismantling the judicial system”.\n\nAbbasi — while referring to the ruling coalition of PML-N and PPP— said, “These are the same people who used to talk about the same things that I am talking about today.\n\n“They talked about these issues for ages but today, they are suppressing democracy, dismantling the judicial system, suppressing public opinion and are unsuccessful in ending political anarchy. What is compelling you to make such moves?” he questioned.\n\n“This is unfortunate because when those running the political system sell their conscience and when political parties abandon their principles, such countries don’t function. These are evident facts in Pakistan today,” he continued.\n\n“Today, there is no permission to even talk, laws are being made to stop people from talking and to dismantle the judicial system,” he said, with an apparent reference to the recently promulgated Prevention of Electronic Crimes (Amendment) Act 2025, also known as Peca.\n\nReferring to the ruling coalition, he said that those who championed democracy in the past were now more invested in political power, calling out the authorities concerned for making it difficult to arrange the moot.\n\n“Now, their government is not even allowing a conference related to the Constitution to be held behind closed doors in the nation’s capital,” he said, adding that three venues of the conference had to be changed as the authorities did not allow holding the conference there.\n\n“We are thankful to lawyers for providing this space today; we tried other places as well, including the institutions, but today the government is so scared that even a conference on the constitution is not possible,” Abbasi said.\n\nHe urged the public to speak up about the country’s affairs, the supremacy of the Constitution and the democratic process. “This is an open forum and this is everyone’s responsibility,” he said.\n\nSpeaking about the opposition alliance, he said that while it wasn’t unusual for different political parties to have disagreements, they all stood united when it came to the Constitution, its supremacy, respect for the law and the judicial system’s freedom.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/2619371008ec895.png",
  "retrievedAt": "2025-08-25T20:01:44.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894425/opposition-alliance-accuses-govt-of-forcing-islamabad-hotel-to-revoke-permission-for-moots-2nd-day",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T09:39:39.000Z"
}
