{
  "title": "DeepSeek rushes to launch new AI model as China goes all in - Business - DAWN.COM",
  "author": null,
  "content": "DeepSeek, the Chinese startup which triggered a $1 trillion-plus sell-off in global equities markets last month with a cut-price AI reasoning model, is looking to press home its advantage, according to sources.\n\nNow, the Hangzhou-based firm is accelerating the launch of the successor to January’s R1 model, according to three people familiar with the company.\n\nDeepSeek had planned to release R2 in early May but now wants it out as early as possible, two of them said, without providing specifics. The company says it hopes the new model will produce better coding and be able to reason in languages beyond English.\n\nDetails of the accelerated timeline for R2’s release have not been previously reported.\n\nDeepSeek did not respond to a request for comment for this story. Rivals are still digesting the implications of R1, which was built with less-powerful Nvidia chips but is competitive with those developed at the costs of hundreds of billions of dollars by US tech giants.\n\n“The launch of DeepSeek’s R2 model could be a pivotal moment in the AI industry,” said Vijayasimha Alilughatta, chief operating officer of Indian tech services provider Zensar.\n\nDeepSeek’s success at creating cost-effective AI models “would likely spur companies worldwide to accelerate their own efforts … breaking the stranglehold of the few dominant players in the field”, he said.\n\nR2 is likely to worry the US government, which has identified leadership of AI as a national priority. Its release may further galvanise Chinese authorities and companies, dozens of which say they have started integrating DeepSeek models into their products.\n\nLittle is known about DeepSeek, whose founder Liang Wenfeng became a billionaire through his quantitative hedge fund High-Flyer. Liang, who was described by a former employer as “low-key and introverted”, has not spoken to any media since July 2024.\n\nReuters interviewed a dozen former employees, as well as quant fund professionals knowledgeable about the operations of DeepSeek and its parent company High-Flyer.\n\nIt also reviewed state media articles, social-media posts from the companies and research papers dating back to 2019.\n\nThey told a story of a company that functioned more like a research lab than a for-profit enterprise and was unencumbered by the hierarchical traditions of China’s high-pressure tech industry, even as it became responsible for what many investors see as the latest breakthrough in AI.\n\nLiang was born in 1985 in a rural village in the southern province of Guangdong. He later obtained communication engineering degrees at the elite Zhejiang University.\n\nOne of his first jobs was running a research department at a smart imaging firm in Shanghai. His then-boss, Zhou Chaoen, told state media on Feb 9 that Liang had hired prize-winning algorithm engineers and operated with a “flat management style”.\n\nAt DeepSeek and High-Flyer, Liang has similarly shunned the practices of Chinese tech giants known for rigid top-down management, low pay for young employees and “996” — working from 9 am to 9 pm six days a week.\n\nLiang opened his Beijing office within walking distance of Tsinghua University and Peking University, China’s two most prestigious education institutions. He regularly delved into technical details and was happy to work alongside Gen-Z interns and recent graduates that comprised the bulk of its workforce, according to two former employees.\n\nThey also described usually working eight-hour days in a collaborative atmosphere.\n\n“Liang gave us control and treated us as experts. He constantly asked questions and learned alongside us,” said 26-year-old researcher Benjamin Liu, who left the company in September.\n\n“DeepSeek allowed me to take ownership of critical parts of the pipeline, which was very exciting.”\n\nLiang did not respond to questions sent via DeepSeek.\n\nWhile Baidu and other Chinese tech giants were racing to build their consumer-facing versions of ChatGPT in 2023 and profit off of the global AI boom, Liang told Chinese media outlet Waves last year that he deliberately avoided spending heavily on app development, focusing instead on refining the AI model’s quality.\n\nBoth DeepSeek and High-Flyer are known for paying generously, according to three people familiar with its compensation practices.\n\nAt High-Flyer, it is not uncommon for a senior data scientist to make 1.5 million yuan annually, while competitors rarely pay more than 800,000, said one of the people, a rival quant fund manager who knows Liang.\n\nThe largesse was funded by High-Flyer, which became one of China’s most successful quant funds and, even after a government crackdown on the sector, still manages tens of billions of yuan, according to two people in the industry.\n\nDeepSeek’s success with a low-cost AI model is based on High-Flyer’s decade-long and substantial investment in research and computing power, three people said.\n\nThe quant fund was an earlier pioneer in AI trading and a top executive said in 2020 that High-Flyer was going “all in” on AI by re-investing 70 per cent of its revenue, mostly into AI research.\n\nHigh-Flyer spent 1.2bn yuan on two supercomputing AI clusters in 2020 and 2021. The second cluster, Fire-Flyer II, was made up of around 10,000 Nvidia A100 chips, used for training AI models.\n\nDeepSeek had not been established at that time, so the accumulation of computing power caught the attention of Chinese securities regulators, said a person with direct knowledge of officials’ thinking.\n\n“Regulators wanted to know why they need so many chips?” the person said.\n\n“How they were going to use it? What kind of impact would that have on the market?” Authorities decided not to intervene, in a move that would prove crucial for DeepSeek’s fortunes: the US banned the export of A100 chips to China in 2022, at which point Fire-Flyer II was already in operation.\n\nBeijing now celebrates DeepSeek, but has instructed it not to engage with the media without approval, according to a person familiar with Chinese official thinking.\n\nAuthorities had asked Liang to keep a low-profile because they were worried that too much hype in the media would draw unnecessary attention, the person said.\n\nChina’s cabinet and commerce ministry, as well as China’s securities regulator, did not respond to requests for comment.\n\nAs one of the few companies with a large A100 cluster, High-Flyer and DeepSeek were able to attract some of China’s best research talent, two former employees said.\n\n“The key advantage of vast (computing) resources is that it allows for large-scale experimentation,” said Liu, the former employee.\n\nSome Western AI entrepreneurs, like Scale AI CEO Alexandr Wang, have claimed that DeepSeek had as many as 50,000 higher-end Nvidia chips that are banned for export to China.\n\nHe has not produced evidence for the allegation or responded to Reuters’ requests to provide proof. DeepSeek has not responded to Wang’s claims. Two former employees attributed the company’s success to Liang’s focus on more cost-effective AI architecture.\n\nThe startup used techniques like Mixture-of-Experts (MoE) and multihead latent attention (MLA), which incur far lower computing costs, its research papers show.\n\nThe MoE technique divides an AI model into different areas of expertise and activates only those related to a query, as opposed to more common architectures that use the entire model.\n\nMLA architecture allows a model to process different aspects of one piece of information simultaneously, helping it detect key details more effectively.\n\nWhile competitors like France’s Mistral have developed models based on MoE, DeepSeek was the first firm to depend heavily on this architecture while achieving parity with more expensively built models.\n\nDeepSeek’s pricing was 20 to 40 times cheaper than what OpenAI charged for equivalent models, analysts at Bernstein brokerage estimated in early February.\n\nFor now, Western and Chinese tech giants have signaled plans to continue heavy AI spending, but DeepSeek’s success with R1 and its earlier V3 model has prompted some to alter strategies.\n\nOpenAI cut prices this month, while Google’s Gemini has introduced discounted tiers of access. Since R1’s launch, OpenAI has also released an O3-Mini model that relies on less computing power.\n\nAdnan Masood of US tech services provider UST told Reuters that his laboratory had run benchmarks that found R1 often used three times as many tokens, or units of data processed by the AI model, for reasoning as OpenAI’s scaled-down model.\n\nEven before R1 gripped global attention, there were signs that DeepSeek had caught Beijing’s favor.\n\nIn January, state media reported that Liang attended a meeting with Chinese Premier Li Qiang in Beijing as the designated representative of the AI sector, ahead of the leaders of better-known firms.\n\nThe subsequent fanfare over the cost competitiveness of its models has buoyed Beijing’s belief that it can out-innovate the US, with Chinese companies and government bodies embracing DeepSeek models at a pace that has not been offered to other firms.\n\nAt least 13 Chinese city governments and 10 state-owned energy companies say they have deployed DeepSeek into their systems, while tech giants Lenovo, Baidu and Tencent — owner of China’s largest social media app WeChat — have integrated DeepSeek’s models into their products.\n\nChinese leader Xi Jinping and Li “have signalled they endorse DeepSeek”, said Alfred Wu, an expert on Chinese policymaking at Singapore’s Lee Kuan Yew School of Public Policy.\n\n“Now everyone just endorses it.”\n\nThe Chinese embrace comes as governments from South Korea to Italy remove DeepSeek from national app stores, citing privacy concerns.\n\n“If DeepSeek becomes the go-to AI model across Chinese state entities, Western regulators might see this as another reason to escalate restrictions on AI chips or software collaborations,” said Stephen Wu, an AI expert and founder of hedge fund Carthage Capital.\n\nFurther limits on advanced AI chips are a challenge that Liang has acknowledged.\n\n“Our problem has never been funding,” he told Waves in July. “It’s the embargo on high-end chips.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/26122020337a431.jpg",
  "retrievedAt": "2025-08-25T20:01:44.883Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894420/deepseek-rushes-to-launch-new-ai-model-as-china-goes-all-in",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T07:30:48.000Z"
}
