{
  "title": "Two killed as rain, snowfall lash Khyber Pakhtunkhwa - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Two children were killed while two other family members were injured in a roof collapse incident in New Colony area of Teri City locality of Karak district due to heavy rain on Tuesday.\n\nFour members of a family were also injured in another roof collapse incident in Peshawar.\n\nRescue 1122 in a statement said that roof of a room in Afghan national Akhtar Zaman’s house collapsed in Karak, which resulted in killing of his two children: Mohammadullah Umar (7) and Iqra (4). Besides, his wife and another son were injured. The injured were referred to a Kohat hospital after provision of basic treatment in Teri hospital.\n\nIn the provincial capital, the incident took place near City Hospital on Kohat Road injuring four members of a family. Rescue 1122 said the injured, who were all males in their twenties, were rushed to hospital for treatment and are said to be in stable conditions.\n\nRoad closures, power outages reported; experts say rainfall highly beneficial for wheat crop\n\nMeanwhile, rain and snowfall lashed a large part of Khyber Pakhtunkhwa on Tuesday, causing power outages and road closures.\n\nThe rain, together with snowfall in high-altitude regions, began early on Tuesday and continued until late evening.\n\nThe provincial capital received rain throughout the day, with some areas witnessing power outages due to the tripping of electricity feeders.\n\nPeshawar Electric Supply Company, in a statement, said that the power supply from 71 feeders across the province was affected by rains.\n\nIt added that 19 feeders in Peshawar, 15 in Bannu, 17 in Khyber and 12 in Dera Ismail Khan circles were hit by the downpour.\n\nThe power utility said that its teams were working to restore power supply from those feeders.\n\nIn Shangla district, a fresh spell of rain and snowfall began late on Monday and continued throughout Tuesday.\n\nSnowfall was reported in Shangla top, Lilownai, Ajmeerr, Spen Ghar, Gamtal, Bruj Banda, Kass, Lal Khan, Yakhtangay, Kandaw and other areas, while rain lashed Bisham, Puran, Chakesar, Alpuri, Dandai, Martung, Makhozi and other localities, turning the weather cold.\n\nIt rained in plain areas of Lower and Upper Dir districts, while hilly areas in the region received snowfall.\n\nThe hilltops of Shahi, Bin Shahi, Laram, Sheen Ghar and Kalpani Maidan in Lower Dir, and Lowari Top, Kumrat, Doog Dara, Usherai Dara and Barawal Top in Upper Dir were covered in snow.\n\nAccording to residents, intermittent rain in the lowlands and snowfall in the mountains began on Monday night and continued for the whole day on Tuesday.\n\nThe Met Department said that the rainfall would be highly beneficial for the wheat crop and help replenish underground water levels.\n\nAgricultural experts highlighted its positive impact on farming, providing much-needed relief for farmers.\n\nHowever, the snowfall has led to road closures in several areas, prompting local authorities to deploy heavy machinery to clear snow.\n\nSimilarly, a fresh wave of rain in the plains and heavy snowfall in the mountainous regions on Tuesday brought a significant drop in temperature across Swat district.\n\nThe rain in plains and snowfall on mountains began early in the morning and continued throughout the day, extending into the evening. Heavy snowfall was reported in Kalam, Utror, Gabral, Matiltan, Mankiyal, Malam Jabba, Gabin Jabba, Jarogo and other hilltops in Swat.\n\nMohmand tribal district also received rains after a long drought in various areas of the district. The rainfall continued until Tuesday night.\n\nThe rain brought cold weather back to the district.\n\nIn most Mohmand areas, people have not cultivated wheat due to a lack of rain, while in some areas, wheat has been cultivated, which has been green by this rain.\n\nSimilarly, Thandiani, Ayubia, Nathiagali and other hilly areas of Galiyat received a second spell of snowfall, which continued untilTuesday evening with frequent intervals.\n\nSix-inch snowfall was recorded in Galiyats and Thandiani. All link roads in Galiyats were open. However, Abbottabad-Murree Road was cleared by the Galiyat Development Authority. Besides the Rescue 1122, Galiyat police were also helping out tourists.\n\nAccording to police, a large number of tourists are in Galiyat and enjoying snowfall.\n\nTraffic police issued an advisory for tourists not to go to Galiyats after sunset and use chained tyres.\n\nThe high-altitude areas of Hazara experienced snowfall on Tuesday, while the plains received heavy rainfall.\n\nSnowfall, which began in the early hours, continued throughout the day in Kaghan, Siren and Konsh valleys, and the hilly areas of Mansehra, as well as Kandia and Spat valleys in Kohistan.\n\nThe fresh spell of snowfall also blocked link roads in the mountainous areas of the division, to the misery of residents.\n\nPolice teams, deployed in the lower parts of Kaghan Valley and the tourist resort of Shogran, restricted the entry of tourists and motorists into snowbound areas within their respective jurisdictions.\n\n“We have deployed police personnel on the Mansehra-Naran-Jalkhad road and the road linking it to Shogran to ensure the safety of visitors and motorists,” district police officer Shafiullah Khan Gandapur told reporters.\n\nHe urged visitors to avoid going beyond the designated points set by the police, as doing so could put their lives at risk.\n\n“We have taken all possible measures and deployed police personnel to prevent tourists from sneaking into the prohibited snowy areas of Kaghan Valley and Shogran,” Mr Gandapur added.\n\nHe mentioned that in a recent incident, two foreign visitors were stranded at the Koh-i-Makra base camp due to snowfall and inclement weather, and police rescued them safely after 19 hours.\n\nMeanwhile, Mansehra, Torghar, Upper Kohistan, Lower Kohistan, and Kolai-Palas received heavy rainfall.\n\nWater flooded parts of the Karakoram Highway and Mansehra-Naran-Jalkhad Road in various areas of Mansehra and Kohistan districts, temporarily disrupting traffic.No loss of life due to rain or snowfall was reported in the division.\n\nBajaur tribal district also received heavy rain, whereas hilly areas of Lowi Mamund, War Mamund, Salarzai and Nawagai tehsils have received snow of several inches.\n\nThe Met Office said Upper Dir received 24mm of rain, Lower Dir 9mm, Parachinar 20mm,Kalam 18mm, Mir Khani 15mm,Malam Jabba 12mm, Bannu 11mm,Peshawar andDrosh 10mm, Pattan 9mmand Chitral 7mm.\n\nIt also forecast intermittent widespread rain along with strong winds and thunderstorm and snowfall over hills for Dir, Chitral, Kohistan, Swat, Shangla, Mansehra, Buner, Abbottabad, Swabi, Mardan, Malakand, Bajaur, Mohmand, Khyber, Karam, Nowshera, Peshawar, Charsadda districts and surroundings for today (Wednesday).\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67be2c8777da9.jpg",
  "retrievedAt": "2025-08-25T20:01:48.207Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894287/two-killed-as-rain-snowfall-lash-khyber-pakhtunkhwa",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:01:23.000Z"
}
