{
  "title": "Nations spar over nature funding at UN talks - World - DAWN.COM",
  "author": null,
  "content": "ROME: Global talks to protect nature restarted on Tuesday with a call for humanity to come together to “sustain life on the planet” and overcome a fight over funding that caused a previous meeting last year to end in disarray.\n\nMore than two years after a landmark deal on nature — including a pledge to protect 30 per cent of the world’s land and seas by 2030 — nations are still haggling over the money needed to reverse destruction that scientists say threatens a million species.\n\nNegotiators meeting at the UN’s Food and Agriculture Organisation headquarters in Rome this week are tasked with resolving a deadlock between rich and developing countries over whether or not to create a specific fund to finance nature conservation.\n\nDisagreement over this saw the previous UN COP16 talks in Cali, Colombia, in November stretch hours into extra time and end without agreement.\n\nSpeaking at the opening of the talks in Rome, many developing nations urged the meeting to unblock funds and called on wealthy countries to make good on their pledge to provide $20 billion a year for poorer nations by 2025.\n\n“Without this trust might be broken,” Panama’s representative said, urging the international community to ensure that overall financing beyond 2030 reflects the “urgency of the biodiversity crisis”.\n\n“This is a matter of survival for ecosystems, economy and humanity. We cannot repeat the failures of climate finance, COP16.2 must deliver more than words, it must deliver funding. The world is out of time.”\n\nThe talks come at a moment of geopolitical upheaval with countries facing a range of challenges from trade tensions and debt worries to the war in Ukraine.\n\nWhile Washington has not signed up to the UN’s Convention on Biological Diversity, new US President Donald Trump has moved to halt development funding through the United States Agency for International Development.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/26101953b70c19f.jpg",
  "retrievedAt": "2025-08-25T20:02:00.925Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894367/nations-spar-over-nature-funding-at-un-talks",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:00:55.000Z"
}
