{
  "title": "Digital rights report exposes Peca threats to press freedom - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Digital rights activists have raised concerns that the Prevention of Electronic Crimes Act (Peca) and other related laws, while ostensibly aimed at combating cybercrime, are, in practice, curtailing freedom of expression for journalists in the country.\n\nAccording to the latest report by the Digital Rights Foundation (DRF), titled ‘Bytes Behind Bars: Decoding Pakistan’s Digital Expression Legislation’, journalists and media professionals are bearing the brunt of an increasingly regulated media landscape and restrictive social environment. The report, launched through the Initiative for Digital and Media Freedoms project, examines how Peca and other broadly defined legislations are being enforced in the country’s legal system.\n\nDRF says journalists bearing the brunt of increasingly regulated media landscape\n\n“The DRF has cautioned, time and again, that there must be a balance between public safety and fundamental rights, without the former overshadowing the latter, especially the case when journalists and others were doing work vital to a healthy democracy,” DRF Executive Director Nighat Dad said.\n\nShe added that the report highlights the damaging impacts of Peca and other similar legislations on speech and press freedom. The report analyses how democratic norms of a healthy society are weakened through the repression and self-censorship faced by journalists and citizens overall.\n\nRecent amendments to Peca potentially shrink the room for freedom of expression and expand the draconian repression and “chilling effect” on journalists and other tellers of truth to power.\n\nNational and international journalist organisations have condemned the amendments, as well as Peca itself, reflecting growing awareness of the threats faced by media practitioners, particularly amid rising censorship.\n\nThe report highlights that the country’s law enforcement agencies continue to restrict the freedom of expression of journalists and, by extension, greatly weaken healthy political and social discourse in the country.\n\nThe report says the government’s overly broad and aggressive approach towards the regulation of digital spaces has led to a “chilling effect” phenomenon. “As a result, journalists and others will be forced to practise self-censorship as a form of pre-emptive protection, in the face of repressive government frameworks and legislative actions,” it says.\n\nSeveral participants who took part in the research expressed frustration with what they viewed as the theatrics of online legislation and regulation, used as a means of signalling what speech is acceptable and what is unacceptable.\n\nPublished in Dawn, February 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:38:57.410Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894303/digital-rights-report-exposes-peca-threats-to-press-freedom",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T01:00:22.000Z"
}
