{
  "title": "Shireen for separate cell in prisons for transgenders",
  "link": "https://www.app.com.pk/national/shireen-for-separate-cell-in-prisons-for-transgenders/",
  "date_published": "2020-01-09T23:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP):Minister for Human Rights Dr Shireen Mazari Friday said there should be a separate cell for transgenders in the prisons.\nShe was chairing a meeting of commission formed by Islamabad High Court on jail reforms to finalize its report on the subject and also instructed to operationalize the recommendations in their respective provinces, said a press release.\nSecretary of Ministry of Human Rights Ms. Rabiya Javeri Agha briefed the participants about the recommendations of the report.\nShe highlighted that recommendations are based on Nelson Mandela guidelines adopted by United Nations and Bangkok rules which deals with female prisoners.\nThe main recommendations included capacity building of staff of prisons and appointment of medical staff of prisons at vacant seats.\nThe report will be submitted to Islamabad High Court before 18th January, 2020.\nThe Commission was formed on the writ petition filed by Khadim Hussain, currently a prisoner at the Central Jail Adyala, Rawalpindi, before the Islamabad High Court after his vision was impaired during the course of his sentence due to failure and negligence of prison authorities.\nAfter hearing the plight of the prisoner, the High Court constituted a commission to be chaired by the Minister of Human Rights to look into the following areas; to investigate human rights violations in the prisons and lack of medical assistance and obstacles in access to a court of law of prisoners who do not have means or assistance in this regard.\nTo investigate failure on part of the executive authorities and respective Governments to fulfill obligations and enforce the Prison Rules and the Code of Criminal Procedure, 1898 relating to prisoners who suffer from illness and diseases.\nTo carry out a review of the Prison Rules and other relevant laws with the object of fulfilling the commitments of the State of Pakistan under the Constitution, International Treatise and Conventions.\nPropose regarding solutions to deal with the human right violations in the prisons and amendments in any law, rules or regulations.\nThe Commission comprised of Minister of Human Rights (Chairperson), Secretaries Ministry of Human Rights, Ministry of Interior and Ministry of Health, former chairperson of Human Rights Commission of Pakistan, Ghazi Shahabuddin, journalist; Zia Awan Advocate Supreme Court, Tariq Khosa, former Director General Federal Investigation Agency and Provincial Chief Secretaries.",
  "retrievedAt": "2025-08-11T18:36:22.760Z"
}
