{
  "title": "ANF had its viewpoint in Rana Sanaullah case: Murad",
  "link": "https://www.app.com.pk/national/anf-had-its-viewpoint-in-rana-sanaullah-case-murad/",
  "date_published": "2020-01-09T23:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP):Minister for Communication Murad Saeed Friday said the government believed in economic and social justice and would continue to act again corruption and malpractices.\nSpeaking on a point of order in the National Assembly while responding to speech of member of Pakistan Muslim League(N) Rana Sanaullah, he said Anti Narcotics Force (ANF) had its own point of view in the case of recovery of heroin from Rana Sanaullah.\nHe said Anti Narcotics Force had given its viewpoint in briefings.\nMinister for Anti Narcotics Control Shehryar Afridi would give viewpoint of the government in this case in the upcoming session of the National Assembly, he added.\nHe said ANF had 90 percent success rate in narcotics cases.\nHe recalled that first case against Rana Sanaullah was filed by family of Nawaz Sharif, adding father of Abid Sher Ali had alleged that Rana Sanaullah was involved in killing of people.\nHe reminded of the case of Model Town saying 14 persons lost their lives in that incident and Rana Sanaullah had an involvement in it.\nThe minister said ANF had stated that it recovered a bag filled with heroin from Rana Sanaullah.\nEarlier while speaking in the house, Rana Sanaullah took oath on Quran and stated that a false case was concocted against him.\nHe demanded that an inquiry should be held by a judicial commission or any committee of the Parliament to ascertain facts into his case.\n“I am ready to present myself for investigation at every forum.”\nHe said ANF did not investigate him in the case and just presented the challan in the court.\nHe sais no video of his arrest or investigation was produced.\nHe said in the FIR registered by ANF it was mentioned that he was part of a network which smuggled drugs from Afghanistan to Faisalabad and then from Lahore to different parts of the world but no member of the network was arrested.\nRana Sanaullah said he was in politics for 30 years, remained member of provincial assembly five times and was Punjab home minister for 10 years and in that period he never used his influence for any person involved in peddling of drugs.",
  "retrievedAt": "2025-08-11T18:36:22.608Z"
}
