{
  "title": "Azakhel dryport- A gift of PTI Govt for people of KP to transform logistic, freight services",
  "link": "https://www.app.com.pk/national/azakhel-dryport-a-gift-of-pti-govt-for-people-of-kp-to-transform-logistic-freight-services/",
  "date_published": "2020-01-09T23:47:00.000Z",
  "source": "APP",
  "content": "NOWSHERA, Jan 10 (APP):The state-of-the art Azakhel dry port was all set to be inaugurated by Prime Minister Imran Khan here on Friday.\nModern dry-port is a great gift of PTI Government for people of Khyber Pakthunkhwa that would immensely help them in transportation of their goods and shipments to every nook and corner of the country with the help of Pakistan Railways.\nAll arrangements were completed for inauguration of this modern dry-port completed by Pakistan Railways with an estimated cost of Rs507 million in record 12 months time.\nThe shifting of Azakhel dry port to Nowshera from Peshawar was planned in 2006 and its completion was possible today due to keen interest taken by the Prime Minister Imran and Federal Minister for Railways Sheikh Rasheed Ahmed.\nSpread over on 28 acres land at about 20 kilometers distance of Peshawar on main GT Road in Nowshera district’s town Azakhel, the dry port was equipped with all kinds of latest loading and onloading facilities for freight, goods and shipments services.\nIt could easily be approached through Peshawar-Islamabad Motorway via Rashakai interchange via Risalpur, GT Road and Ring Road Peshawar.\nThe goods and shipments transported from Karachi port could be on loaded here before its onward transportation to Peshawar, other districts of KP and Afghanistan through enhanced roads and rails services.\nAfter construction of 1872 kilometers railways track from Peshawar to Karachi under CPEC, Azakhel dry port would make KP especially Peshawar a hub of trade and foreign investment. After its inauguration, Pakistan Railways would be able to get 20pc share from market that would make it a profitable organization in couple of years.\nThe dry port would generate employment opportunities for thousands of workforce, youth and laborers besides alleviate poverty and accelerate pace of economic development in the province.\nImports and exports process would be further increased and exporters of other provinces of Pakistan besides Afghanistan and Central Asian Republics would also be largely benefited from it.\nThe Government has also planned to extend railways track from Peshawar to Jalalabad and Azakhel dry port’s role to increase trade volume between Pakistan and Afghanistan would carried significance importance.",
  "retrievedAt": "2025-08-11T18:36:19.102Z"
}
