{
  "title": "World sees similarity in India’s RSS with KKK, Hitler racist ideologies: President",
  "link": "https://www.app.com.pk/national/world-sees-similarity-in-indias-rss-with-kkk-hitler-racist-ideologies-president/",
  "date_published": "2020-01-10T04:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP):President Dr Arif Alvi on Friday said India’s racist Rashtriya Swayamsevak Sangh (RSS) ideology had started getting a worldwide comparison with American Ku Klux Klan’s (KKK) white supremacist hatred and Hitler’s fascism.\n“The real message about RSS, being similar to KKK and to Hitler’s fascist goals, is being recognized as such throughout the world,” the president in a tweet.\nPresident Alvi recalled that disenfranchisement, based on racism in the history, led to genocide, firstly of Jews in Europe and then of Rohingyas in Myanmar.\nHe also shared a video clip of a black American named Jada who spoke before a Town Council in New Hampshire against the disenfranchisement of U.S. citizens and compared it with India’s RSS’ racism.\nThe video shows Jada, who grew up in Louisiana, criticizing the Member of State House of Representatives David Duke and also a Grand Wizard of KKK – a despised group in America with no official political power.\n“But KKK of India has held power there for the last five years. And India’s KKK is called the RSS,” Jada said, adding that RSS was responsible for “lynching, bombings, assassinations and pogroms against Christians,\nMuslims and anyone who stands up against its xenophobic agenda”.\n“The RSS also groomed people like Narendra Modi to take office,” he said.\nJada also raised question on the connection between India’s RSS and Tulsi Gabbard, who campaigned hard to become America’s next president.\n“She does not want voters in New Hampshire to know that RSS helped her get into Congress. She took hundreds of thousands of dollars from RSS activists,” he said.\nJada mentioned that Gabbard repeatedly spoke at RSS events in America and in India, while an RSS spokesperson was hosted at her wedding in Hawaii as Modi’s special guest.",
  "retrievedAt": "2025-08-11T18:36:12.523Z"
}
