{
  "article_id": "2025-07-04_4a8b1671c219e57778bee5e93ac2a3cb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-elections-for-11-vacant-seats-khyber-pakhtunkhwa-on-july-21/",
    "retrieved_at": "2025-08-27T09:14:16.736Z"
  },
  "metadata": {
    "title": "Senate elections for 11 vacant seats of Khyber Pakhtunkhwa on July 21",
    "author": null,
    "date_published": "2025-07-04T14:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 4 (APP):Senate elections for 11 seats - including seven general seats, two reserved for women, and two for technocrats/Ulema - from Khyber Pakhtunkhwa are scheduled for July 21 at the provincial assembly building. An Election Commission spokesperson stated on Friday that the commission had postponed the elections on April 2, 2024, due to an incomplete electoral college - resulting from the Speaker's failure to administer oaths to members elected on reserved seats in the Provincial Assembly. In addition, the Election Commission has announced the schedule for filling two vacant reserved women's seats of the Pakistan Muslim League-Nawaz (PML-N) in the National Assembly from Khyber Pakhtunkhwa. These seats were reinstated following the Supreme Court's verdict on reserved representation. According to the official schedule, the Returning Officer will issue the public notice on July 8, 2025. Nomination papers can be submitted on July 9 and 10. Scrutiny of the nomination papers will be conducted on July 14, and the final list of candidates will be published on July 24, 2025. The PML-N's priority list has been exhausted, and they must submit a new priority list to the Returning Officer by July 10, according to a press release. On July 2, 2025, the Election Commission issued notifications for members elected to reserved seats in the National and Provincial Assemblies. Letters have also been dispatched to the respective Speakers, inviting them to hold oath-taking ceremonies so members may formally assume office and participate in the upcoming Senate elections for Khyber Pakhtunkhwa and Punjab.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}