{
  "title": "AJK President seeks Muslim countries role to fight Islamophobia in IIOJK",
  "link": "https://www.app.com.pk/national/ajk-president-seeks-muslim-countries-role-to-fight-islamophobia-in-iiojk/",
  "date_published": "2021-02-12T13:08:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Feb 12 (APP): Azad Jammu and Kashmir President Sardar Masood Khan has urged Muslim states like Malaysia to unite against the worst Islamophobia and help stop the genocide of Muslims in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAddressing a webinar organized by Malaysia-based Malaysian Consultative Council for Islamic Organization (MAPIM) on the latest situation of occupied Jammu and Kashmir on Friday, he said that we are thankful to the government and the people of Malaysia particularly former Prime Minister Mahathir Mohamed and the influential organizations like MAPIM for unequivocally declaring their support to Pakistan and the people of Jammu and Kashmir, AJK President office said Friday evening.\n“We are thankful to the people and government of Malaysia for being a robust voice for the Kashmiris,” he said and added that former Prime Minister, Mahathir Mohammad in his address to the UN General Assembly strongly denounced India’s invasion and reoccupation of Kashmir and called for the settlement of the dispute under UNSC resolutions.\nHe said that civil society organizations like MAPIM have acted as a catalyst for internationalizing the issue of Kashmir and also garnering support for the Kashmiris in the ASEAN Parliaments and at masses level.\n“The main issue we should focus on is the mass settlement of Hindus from all over India into IIOJK.\nOver two million Hindus have been given state citizenship.\nThis level of importation of foreign nationals in a disputed territory has not been seen in modern history. Demographic change in IOJK is the prime objective of the BJP-RSS regime in India,” Khan said.\nThe AJK president exhorted that our friendly countries need to understand that Jammu and Kashmir had never been nor is a part of India.\nOn the contrary, India acting as an aggressor state, and its one million troops deployed in the occupied Kashmiri are brutalizing the Kashmiri people simply because they are Muslims and followers of Islam.\nHe maintained that one million Indian troops, armed to the teeth have besieged the Kashmiri people for the last more than one and a half year, and have let loose an unprecedented reign of terror in the occupied territory.\nThe unabated land grab is continuing in IIOJK and laws have been amended to commandeer land from Kashmiris and declare it as Indian land. Unarmed Kashmiris, especially youth are killed, maimed, blinded and detained and sexual molestation and rape of women is used as a weapon of war, he said.\nThe state president said that more than 13,000 youth including political leaders and activists have been arrested and locked up in different prisons in occupied Kashmir and India.\n“We salute the youth of occupied Kashmir particularly our sisters and daughters who are not ready to give up their struggle for freedom and right to self-determination and braving the tyranny with courage and determination,” he added.\nPaying glowing tributes to pro-freedom leaders, Syed Ali Geelani, Mir Waiz Umar Farooq, Chairman Jammu and Kashmir Liberation Front Yasin Malik, Dukhtaran-e-Millat chief Asiya Andrabi, Ashraf Sehrai, Musarrat Alam Butt, Syed Shabbir Ahmed Sha, prominent Hurriyet leaders Syed Ali Shah Gilani and Mirwaiz Omar Farooq for remaining firm on their stand despite remaining under constant detention, Sardar Masood Khan said that their sacrifices would soon bear fruit.\nThe webinar was also addressed by former Jamaat Islami Azad Kashmir chief Abdur Rashid Turabi, prominent liberation leader Yasin Malik’s spouse Mishal Malik, former Malaysian MP Haji Mohammad Azmi Abdul Hameed, former Foreign Secretary Aizaz Chaudhry and others.",
  "retrievedAt": "2025-08-11T20:21:07.174Z"
}
