{
  "title": "“Pleased” over Biden admin’s unchanged Kashmir policy: Qureshi",
  "link": "https://www.app.com.pk/national/pleased-over-biden-admins-clarification-of-no-change-in-kashmir-policy-qureshi/",
  "date_published": "2021-02-12T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): Foreign Minister Shah Mahmood Qureshi Friday expressed his pleasure over the clarification by the United States that there had been no change in their policy on Kashmir as they still considered it a disputed territory.\nThe foreign minister, in a statement, said that Pakistan immediately presented its stance following a State Department’s tweet.\nHe was referring to a State Department’s tweet on February 10 about resumption of 4G service in which IIOJK was referred as “India’s Jammu and Kashmir” what Pakistan viewed was “inconsistent” with the disputed status of Jammu and Kashmir as recognized by numerous United Nations Security Council (UNSC) resolutions and the international community.\nWe welcome the resumption of 4G mobile internet in India’s Jammu & Kashmir. This marks an important step for local residents and we look forward to continued political & economic progress to restore normalcy in J&K.\n— State_SCA (@State_SCA) February 10, 2021\nHowever, State Department Spokesperson in his media briefing clarified, “I want to be very clear there has been no change in US policy in the region.”\nQureshi said like elsewhere in the world, the economy in the Gulf countries was also hit by COIVD-19 which resulted into layoffs and consequent repatriation of many people.\nLikewise, the pandemic also adversely impacted aviation, hoteling and restaurant businesses as well as the construction industry.\nWe are disappointed to note the reference to Jammu & Kashmir in the U.S. Department of State’s tweet regarding resumption of 4G mobile internet in #IIOJK. The reference is inconsistent with disputed status of J&K as recognized by numerous UNSC resolutions & int’l community. 1/3\n— Spokesperson  MoFA (@ForeignOfficePk) February 12, 2021\nHe said during his recent visit to the UAE, he had discussed the matter in detail with his counterpart. The UAE’s reservations were not Pakistan-specific, though the latter was trying to address those, he explained.\nThe foreign minister said the discussion was underway and hoped for a better outcome.\nReferring to Naval Exercise AMAN-21 being hosted by Pakistan Navy and participated by 40 international navies, the foreign minister termed it a great success of Pakistan.\nThe exercises would also provide an opportunity for discussion on blue economy, Qureshi said and also hinted at visiting Karachi on the invitation of Naval chief.",
  "retrievedAt": "2025-08-11T20:21:09.869Z"
}
