{
  "title": "Dream of new, prosperous Pakistan being transformed into reality: CM",
  "link": "https://www.app.com.pk/national/dream-of-new-prosperous-pakistan-being-transformed-into-reality-cm/",
  "date_published": "2021-02-12T13:04:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 12 (APP): Punjab Chief Minister Sardar Usman Buzdar has said that the dream of a new and prosperous Pakistan is being transformed into reality under the leadership of Prime Minister Imran Khan, as the country is fast moving forward.\nIn a statement issued here on Friday, he said political opponents would be left behind as their conspiracies had been thwarted. The past rulers devastated the country and wreaked havoc on the economy.\nThe CM regretted that the institutions were weakened in the past for the sake of personal interest, while national interests and public needs were neglected in policies formulation.\nEvery child was under debt today due to the wrong policies of the past governments, as nothing was done for the welfare of the indigent strata, he said and added that the incumbent government had to make difficult decisions to rectify institutional discrepancies.\nHe said it was sanguine that decisions were being taken in the larger interest of the country and to attend to public needs.\nThe CM said that the needs and requirements of every district had been identified and a separate development package was being devised for every city in consultation with the parliamentarians concerned. He reiterated that every citizen will be provided free medical facilities in the province under universal health coverage by Dec 2021.\nIt was the flagship initiative as the PTI government was committed to serving every citizen while fulfilling every decision made with the people, he continued. Alongside, the CM added that an agreement had been signed with NESPAK for a feasible study of dams over 13 hilly areas to store the hill-torrents’ gushing water in tribal areas of Rajanpur and Dera Ghazi Khan. The government has provided Rs 1.25 billion for the purpose, he added.\nGiving details, he said four intermediate dams would be constructed in Koh-e-Suleman area to irrigate more than 2 lakh acres of land. The pilot project would be started in the month of June as water reservoirs would be constructed in the areas of Hathi Morr, Jalebi Morr, Khar Munroe and Thalang in the first phase, he added.\nThe CM said that the network of shelter homes and almonries has been established to facilitate the hoi polloi, while the scope of almonries was being expanded in remote areas as the impecunious stratum deserved special attention of society.\nThe Pakistan Tehreek-e-Insaf (PTI) government was the strong supporter of the disfranchised segments and the responsibility of the welfare of the homeless persons would be fulfilled, concluded the CM.",
  "retrievedAt": "2025-08-11T20:21:06.867Z"
}
