{
  "title": "Indian activist’s computer hacked to insert incriminating letters on Modi murder plot",
  "link": "https://www.app.com.pk/global/indian-activists-computer-hacked-to-insert-incriminating-letters-on-modi-murder-plot/",
  "date_published": "2021-02-12T10:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): Stooping to a new low, the Narendra Modi’s government falsely incriminated a writer-activist Rona Jacob Wilson and others for Modi’s assassination plot, by hacking his computer and inserting fake documents.\nArrested in June 2018, in Bhima-Koregaon case, Rona Wilson and others have been charged of plotting to assassinate Modi.\nInitially, the case involved violence at Koregaon Bhima on the outskirts of Pune, where members of the Dalit community had gathered on December 31, to celebrate what they called a historic victory over Maratha Peshwas.\nLater, the police said they have found letters from a suspected Maoist in Rona Wilson’s laptop, which revealed a plot to assassinate Prime Minister Narendra Modi.\nPublished by the US daily Washington Post, a report of the Arsenal Consulting, a Massachusetts-based digital forensics firm, revealed that Rona Wilson’s computer was hacked two years before his arrest, and the purpose was “aggressive surveillance” and inserting fake documents.\nA brief statement from Arsenal President Mark Spencer regarding Report I in the Bhima Koregaon case. #DFIR pic.twitter.com/UHiSK2YYXm\n— Arsenal Consulting (@ArsenalArmed) February 10, 2021\nThe firm was asked by Wilson’s lawyers to examine an electronic copy of the hard disc of his laptop which was being used as key evidence against him.\nAccording to the daily, the report had deepened the “doubts about a case viewed as a test of the rule of law under Prime Minister Narendra Modi.”\nIt said an attacker used malware to infiltrate a laptop belonging to Rona Wilson deposited at least 10 incriminating letters on the computer.\nHuman rights groups and legal experts consider the case an attempt to suppress dissent in India, where government critics have faced intimidation, harassment and arrest during Modi’s tenure.\nArsenal’s report was also reviewed by three outside experts who reviewed the document said the report’s conclusions were valid.\nSudeep Pasbola, a lawyer representing Wilson, said the Arsenal report proved his client’s innocence and “destabilizes” the prosecution case against the activists.\nThese are NetWire communications between Rona Wilson’s computer and the attacker’s command & control server, recovered from Windows hibernation slack (January 6, 2018 – January 7, 2018 timeframe) using @ArsenalRecon‘s Hibernation Recon and @xchatty‘s bulk_extractor. #DFIR pic.twitter.com/REbkhiqkhF\nWilson’s lawyers included the report in a petition filed in the High Court of Bombay urging judges to dismiss the case against their client.\n.@OnReality_Check | “Not unusual for computer to be compromised, but this is unprecedented,” says Mark Spencer, Head of the US Forensic lab that analysed the copy of Rona Wilson’s hard drive#BhimaKoregaonCase pic.twitter.com/lRZgyG8cwR\n— NDTV (@ndtv) February 10, 2021\nJaya Roy, a spokeswoman for the National Investigation Agency, the anti-terrorism authority overseeing the cases against the activists, said that the forensic analysis of Wilson’s laptop conducted by law enforcement did not show any evidence of malware on the device. She added that there was “substantial documentary and oral evidence” against the individuals charged in the case.\nMore than a dozen activists have been targeted in the investigation. All are advocates for the rights of India’s most underprivileged communities, including tribal peoples and Dalits, formerly known as “untouchables.” They’re also outspoken opponents of Modi’s government.\nHow the evidence was planted in Rona Wilson’s laptop over 22 months. And scarier knowing who might have done it.\nRelease the #politicalprisoners\nFinding by @ArsenalArmed #RonaWilson pic.twitter.com/iCWbWfdsLC\n— Hidayath (@W3Hidayath) February 12, 2021\nThey have denied the charges, which accuse them of working with a banned Maoist militant group to wage an insurgency against the Indian state.\nThe most explosive allegation came from a letter that police said Wilson had written to a Maoist militant in which Wilson discussed the need for guns and ammunition and urged the banned group to assassinate Modi.\nArsenal Consulting found that the letter — along with at least nine others — had been planted in a hidden folder on Wilson’s computer by an unidentified attacker who used malware to control and spy on the laptop.\n“This is one of the most serious cases involving evidence tampering that Arsenal has ever encountered,” the report said, citing the “vast timespan” — nearly two years — between the time the laptop was first compromised and the moment the attacker delivered the last incriminating document.\nThe case against the Indian activists has drawn criticism from rights groups and experts.\nWhat an amazing report by the same team that unearthed the truth about Boston bombing. Activist Rona Wilson was charged for evidence that was planted in his computer years ago in 2016! Apparently analysis shows he never even opened that document which NIA has charged him for pic.twitter.com/B5mF6jf2R9\n— sunetra choudhury (@sunetrac) February 10, 2021\nA spokeswoman for the U.N. high commissioner for human rights recently urged the Indian authorities to release the detained activists. Earlier U.N. experts called the accusations a “pretext” aimed at silencing defenders of marginalized groups.\nThe American Bar Association has also expressed concern about the case, and its human rights initiative helped Wilson’s lawyers facilitate the review of the digital evidence.\nArsenal’s report gives a detailed account of the cyberattack. One afternoon in June 2016, it said, Wilson received several emails that appeared to be from a fellow activist he knew well. The friend urged him to click on a link to download an innocuous statement from a civil liberties group.\nInstead, the report says, the link deployed NetWire, a commercially available form of malicious software that allowed a hacker to access Wilson’s device.\nThis is one of many “process trees” Arsenal built from recovered application execution data on Rona Wilson’s computer in the Bhima Koregaon case. You can see a NetWire RAT launch, delivery of a crucial document into a hidden folder, & creation of a new “Key Logger” file. #DFIR pic.twitter.com/vAG4IGz9wA\nArsenal discovered records of the malware logging Wilson’s keystrokes, passwords and browsing activity. It also recovered file system information showing the attacker creating the hidden folder to which at least 10 incriminating letters were delivered — and then attempting to conceal those steps. The letters were created using a newer version of Microsoft Word that did not exist on Wilson’s computer, the report said.\nWe reported on the sheer absurdity of the so-called “Maoist” letters that a US-based forensics firm has concluded were planted on Rona Wilson’s laptop through malwarehttps://t.co/tSMz39HKx4\n— Supriya Sharma (@sharmasupriya) February 10, 2021\nArsenal found no evidence that the documents or the hidden folder were ever opened.\nSpencer, Arsenal’s president, called the attack “very organized” and “extremely dark” in intent.\nArsenal has spent more than 300 hours analyzing the laptop’s contents, he said.\nSpencer said the company has only rarely seen malware used for evidence tampering and that Wilson’s case was “unique and deeply disturbing.”\n#BREAKING key evidence against BK-16 was planted on Rona Wilson’s laptop and co-defendants, reveals report by @ArsenalArmed#FreeDalitActivists #BhimaKoregaon #RonaWilosn#BhimaKoregaon pic.twitter.com/UIbG1lNrcn\n— AJAY KASBE (@AjayKas35398800) February 10, 2021\nArsenal produced a “serious and credible” analysis documenting how the laptop was infected with malware, said John Scott-Railton, a senior researcher at Citizen Lab at the University of Toronto. It raises “urgent questions about the reliability of evidence from that computer in a prosecution.”\nThe report does not identify the person or institution behind the malware attack on Wilson’s laptop. But it notes that Wilson was not the attacker’s only victim. The same attacker deployed some of the same servers and IP addresses to target Wilson’s co-defendants in the case over a period of four years, the report said, based on a review of forensic images related to those individuals.\nLast year, Amnesty International revealed that nine people seeking to help the activists accused in the case were also targeted with emails containing malicious links that deployed NetWire.\nThe fact that the same domain names and IP addresses appear both in the Arsenal and Amnesty reports is “not a coincidence,” said Adam Meyers, senior vice president of intelligence at the cybersecurity firm CrowdStrike, one of the experts who reviewed the report at The Post’s request.\nLawyers for other defendants in the case have asked law enforcement authorities to provide digital images of the electronic devices seized from their clients — including phones and laptops — for possible analysis. To date, copies of digital devices belonging to at least two of the activists have been shared, defense lawyers said.\nAfter three years of investigation, the charging documents in the case now run to more than 17,000 pages. They cite both digital evidence and accounts by witnesses, who allege that some of the activists were members of the banned Communist Party of India (Maoist), a group that has fought an armed insurgency against the government for decades.\nNearly all of the 16 accused have remained imprisoned throughout the pandemic, even as India temporarily released thousands of other prisoners because of worries about rising infections. Several of the activists are senior citizens with serious health ailments, their friends and family say; one, a Jesuit priest named Stan Swamy, 83, suffers from Parkinson’s disease.\nPoet Varavara Rao, 80, is another of the imprisoned activists. His health has deteriorated in jail and he became incoherent last summer, his family said. He also contracted the coronavirus and repeatedly had to be transferred to the hospital.\nSudha Bharadwaj, a labor lawyer and activist who gave up her American citizenship after returning to India to work for the rights of tribal communities, has spent more than two years behind bars.\nAPP Digital Report By Ishtiaq Ahmed",
  "retrievedAt": "2025-08-11T20:21:09.074Z"
}
