{
  "title": "PTI to purge politics of corrupt practices: Sarwar",
  "link": "https://www.app.com.pk/national/sarwar-inaugurates-punjab-police-khidmat-markaz-in-taxila/",
  "date_published": "2021-02-12T12:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP):Minister for Aviation Ghulam Sarwar Khan Friday said the Pakistan Tehreek-i-Insaf (PTI) government would purge the politics of corruption by making all those accountable who remained indulged in corrupt practices.\nAddressing inaugural ceremonies of ‘Punjab Police Khidmat Markaz’ and Faisal Shaheed Road in Taxila city of Rawalpindi district, he held PML-N leader Nawaz Sharif responsible for the prevailing culture of corruption and bribery in the politics.\nThe minister said such tendencies in politics had affected the credibility of politicians, and vowed that the PTI government would cleanse the society of all corrupt elements.\nHe said it was the PTI that had ousted 20 parliamentarians from the party on taking bribes and indulging in corruption, adding the government wanted to adopt the show-of-hand method in the upcoming Senate elections, but the Pakistan Democratic Movement (PDM) was opposing it.\nHe said nobody was supporting the PDM leaders due to their double standards, corrupt practices and anti-state activities.\n“The PDM is following the agenda of Modi [Indian PM].”\nGhulam Sarwar expressed confidence that the country would get economic strength and stability this year due to prudent policies introduced by the present government under the dynamic leadership of Prime Minister Imran Khan.\nHe said the PTI government believed in public service, that was why it started massive development projects in different localities.\nToday, the minister said he had inaugurated a facility of ‘Punjab Police Khidmat Markaz’ and performed groundbreaking of Faisal Shaheed Road, from Khatm-e-Nabuwat Chowk to Farooqia, in Taxila.\nAround 10.5 kilometer dual-carpeted road would be constructed at an estimated cost of Rs 1.14 billion to facilitate local commuters.\nHe also announced to start another project during the current year under which widening and remodeling of Chungi Number 26-Hassabdal Road would be carried out, on the pattern of motorway.\nAt this section, he said, three overhead bridges for pedestrians and service roads would also be set up.\nThe minister said providing all basic amenities of life to the common man was the top most priority of PTI government.",
  "retrievedAt": "2025-08-11T20:21:07.179Z"
}
