{
  "title": "Distributor of money in leaked horse-trading video case did not belong to KP: Khattak",
  "link": "https://www.app.com.pk/national/distributor-of-money-in-leaked-horse-trading-video-case-did-not-belong-to-kp-khattak/",
  "date_published": "2021-02-12T15:11:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 12 (APP):Minister for Defence Pervez Khattak Friday said the person, who had distributed money among the parliamentarians for horse trading in the last Senate polls did not belong to Khyber Pakhtunkhwa.\nThe same person had again been awarded ticket by the Pakistan Peoples Party for the Senate election, he said talking to local delegations at his residence in Nowshera.\nThe minister said all the political parties and media were well aware of the fact that who was the person behind the heinous crime. His (Khattak’s) conscience was very clear and whosoever was leveling allegation against him would be exposed before the masses soon, he added.\nSuch elements and political parties, he said, would not succeed to steal the mandate of Pakistan Tehreek-e-Insaf (PTI) in the Senate polls as the party would grab 19 seats and one by its ally Pakistan Muslim League-Quaid (PMLQ).\nPervez Khattak said the media persons should visit the Speaker House and compare it with the one shown in the leaked video to ascertain the culprit of horse trading.\nA handful of privincial assembly members were trying to defame him and Speaker National Assembly Asad Qaiser by leveling such allegations, he added.\nKhattak said the PTI would nominate the best candidate for Senate seats who could deliver after being elected and defend the party.\nReferring to the Pakistan Democratic Movement (PDM), he said the government believed that holding protest was a democratic right of the opposition but it should not take law in hands by blocking roads and creating difficulties for the masses.\nHe warned strict legal action in case the PDM took the law in hand. The government had neither offered negotiation to the PDM nor would do so in future as it were the same elements who had looted the national kitty and later fled abroad.\nPrime Minister Imran Khan started a movement against such elements as leader of the PTI and now they would face the law for their misdeeds, he added.",
  "retrievedAt": "2025-08-11T20:21:04.186Z"
}
