{
  "title": "Artificial Intelligence to change world, need to explore the economic potential of digitization: EU Envoy",
  "link": "https://www.app.com.pk/national/artificial-intelligence-to-change-world-need-to-explore-the-economic-potential-of-digitization-eu-envoy/",
  "date_published": "2021-02-12T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): European Union Ambassador to Pakistan, Androulla Kaminara Friday said that Artificial Intelligence (AI) has changed the world system more than anything else due to its multi-dimensional impacts, including time efficiency and accuracy.\nShe stressed the importance of using technology for people to create a fair and competitive economy, as well as an open,democratic and sustainable society.\nShe expressed these views during a webinar convened by the Delegation of the European Union to Pakistan\naimed at to showcase European policy initiatives on Digitization and to discuss the challenges and potential of the digital economy in Pakistan.\nShe said that digital transformation for economic growth and recovery required close collaboration, shared learning and exploring opportunities to work together on areas such as health, governance and satellite mapping.\nAndroulla Kaminara underlined the need for regulation of the digital space to ensure respect for human rights, including the right to privacy and freedom of speech and safety of vulnerable groups such as women and children.\nAppreciating the event ,she said this was an attempt to start a continuous process of sharing best practices and legislative approaches between the EU and Pakistan, which can create opportunities for dialogue, partnerships and investments promoting regional and global connectivity.\nReplying to a question, she said the Covid19 pandemic accelerating the digital transformation, but also exposing its challenges, the webinar was a timely opportunity to share experiences and expertise.\nThe speakers at a webinar shared the EU’s experiences in developing the European Digital Strategy, Data Strategy, Digital Services Act, as well as ensuring data protection and security.\nThey also highlighted how digitalisation has impacted infrastructure, education and social systems in EU Member States and its partner countries and offered examples of potential venues for cooperation.\nPolicy experts from the European Union, United Nations Development Programme (UNDP) and International\nTelecommunications Union (ITU) introduced a wide range of areas concerning the digital\ntransformation in both the EU and Pakistan.\nThe webinar was attended by over 30 representatives and experts from federal and provincial government and agencies, foreign missions, IT and telecommunication companies and civil society.",
  "retrievedAt": "2025-08-11T20:21:06.387Z"
}
