{
  "title": "All roads reopened for traffic in Islamabad",
  "link": "https://www.app.com.pk/national/all-roads-reopened-for-traffic-in-islamabad/",
  "date_published": "2024-10-07T07:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 07 (APP): Traffic in Islamabad has returned to normal, with all major roads now open following earlier disruptions due to protests. The Islamabad Traffic Police (ITP) have confirmed that routes across the city are operational.\nAccording to ITP statement SSP Traffic along with all traffic officers, are present on the roads to ensure smooth traffic flow.\nHe said traffic officers are actively engaged in maintaining the flow of traffic and assisting citizens.\nCitizens can also get traffic updates by contacting 1915 or tuning into FM 92.4 for real-time information, he said.\nHe said Rawat T-Cross has been opened to traffic in both directions.\nKorang Chowk has also been cleared and reopened for vehicles from both sides he said.\nHe said Khanna Pul is now open for traffic in both directions, ensuring smooth flow in this area.\nFaizabad and Murree Road, along with the Expressway, have been cleared, and traffic is now moving freely in both directions, he added.\nHe said Peshawar Mor and Golra Mor are both open for traffic from both directions.\nTraffic has resumed at 26 Number Chungi and Motorway Link Road in both directions, he said.\nHe added Colonel Sher Khan Shaheed Road is now fully operational in both directions.\nHe said Iran Avenue has been opened to traffic in both directions.\nThe route from Khanna Pul to Lehtrar Road is also open for vehicles on both sides, he said.\nHe said Srinagar Highway at G-14 is now open, and traffic is flowing smoothly in both directions.\nHe said Seventeen-Mile Toll Plaza at Bhara Kahu has been reopened, allowing traffic to pass freely on both sides.\nKatti Pahari GT Road is now operational, with traffic moving in both directions, he added.\nHe said Zero Point and Khayaban Chowk have also been reopened for traffic in both directions.\nCitizens can use Margalla Road to access the Red Zone, as all entry points have been cleared.",
  "retrievedAt": "2025-08-10T19:53:34.138Z"
}
