{
  "title": "IPRI hosts special lecture on Gaza’s aggression, genocide",
  "link": "https://www.app.com.pk/national/ipri-hosts-special-lecture-on-gazas-aggression-genocide/",
  "date_published": "2024-10-07T12:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 7 (APP):Islamabad Policy Research Institute (IPRI) on Monday marked a year of aggression and genocide in Gaza by hosting a Special Lecture of His Excellency Deputy Head of Mission, Embassy of the State of Palestine, Nader K. Alturk, who spoke eloquently on “A Year of War in Gaza.”\nAddressing the special lecture, he listed out the trials and tribulation of a year, and said hapless Palestinians and Gazans were on the receiving end as more than 50,000 were killed, millions are displaced, and almost 80 percent of Gaza has been obliterated. He said that Israel had attacked each and every human and civil installations, under the guise of taking out military targets, and destroyed mosques, schools and hospitals, said a press release.\nHe said that under International Law, besieged Palestinians had every right to defend themselves and use measures at their disposal in self-defense.\nAlturk said that Gaza, a region of 365 km, today is in rubbles and more than a million were displaced, leaving behind the rest to live in a squeezed territory of less than 30 kms.\nHe particularly mentioned the tactics that Israel and the United States were employing to hoodwink the definition of “Right to return” of Palestinians under the UN Resolutions.\nThe Palestinian envoy talked about “Greater Israel” plans and showed a map wherein the Zionist state had explicit aggressive deigns over almost all of its neighbours up to Iraq and Saudi Arabia.\nHe said that one year of death and destruction had simply proved the incapacity and failure of international organisations, as well as the UN Security Council that had failed to uphold international security as per its mandate under the UN Charter.\nHe said that the legitimate government of Palestine was doing everything in its capacity to further the cause of Palestinian Statehood, and all avenues were being tapped in lawfare and diplomacy.\nPresident IPRI Dr Raza Muhammad, in his welcome address, said that Pakistan stands with the brethren of Palestine, and termed the year-long terrorism of Israel as genocide. He also underscored the need for pushing the cause of statehood at every forum to realise Two-State solution in the volatile region of Mideast.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:53:29.421Z"
}
