{
  "title": "AI to make big difference in next 35 years: Khalid Maqbool",
  "link": "https://www.app.com.pk/national/ai-to-make-big-difference-in-next-35-years-khalid-maqbool/",
  "date_published": "2024-10-07T18:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 07 (APP):Minister for Federal Education and Professional Training Dr Khalid Maqbool Siddiqui on Monday underlined the need of Artificial Intelligence, stating that it is going to make a big difference in the next 35 years.\nWhile addressing the ‘Space Week 2024’ opening ceremony held at Islamabad Model College for Girls (IMCG) F/6-2, he said the fear is that a billion people will become irrelevant with arrival of artificial intelligence.\nHe said that Artificial Intelligence has just been discussed at the United Nations,adding, the world is utilising it, and we are just getting started.\nHe said that there are 15 to 18 million youth in Pakistan, which is also a big challenge. He said that government is making sincere efforts to provide employment opportunities for youth.\nHe said in today’s modern age everyone can have equal opportunities.\nHe said that the Qur’an had conveyed the advanced truth to us and leads the people towards modern education.\nNo country in the world can develop alone, he said adding that everyone needs the support of other countries for trade, business opportunities and development.\nWhile giving the example of Chinese development plan, the Minister said that the neighboring countries have made the population an asset, not a burden.\nHe further said that God has brought an opportunity for in shape of youth and we will utilise them through skills development.\nHe urged the relevant educational authorities to educate youth according to international standards.\nThe Minister said said that sending our children abroad to study is not a brain drain but brain train.\nEmphasising the role of technology in modern era, Dr Maqbool said that a big data is also monitoring all of us.\n“Telescopes have been given in schools and microscopes will also be given soon”, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:52:37.002Z"
}
