{
  "title": "NUML and Korean Tongwon University sign letter of interest for academic collaboration",
  "author": null,
  "content": "ISLAMABAD, Jun 20 (APP):A high-profile delegation from Tongwon University, Republic of Korea, led by Vice President Professor Dr. Choi Jongin, visited the National University of Modern Languages (NUML) on Friday to explore avenues of academic collaboration and cultural exchange.\nThe delegation was warmly welcomed by Rector NUML, Major General Shahid Mahmood Kayani HI(M), along with senior university officials. During the meeting, both sides discussed various areas for mutual cooperation, including student exchange programs, academic excellence, research opportunities, and institutional partnerships.\nFollowing the meeting with the Rector, the delegation interacted with faculty members and students of the Department of Korean Language, where a vibrant question-and-answer session took place.\nVice President Tongwon University, Dr. Choi, in his address, appreciated the academic environment at NUML and expressed gratitude for the hospitality extended. He encouraged the students to pursue their goals with dedication and transform their aspirations into achievements.\nThe Director of the International Department of Tongwon University provided a comprehensive presentation on the university’s academic strengths, modern facilities, and unique opportunities available for Pakistani students, particularly those from NUML. He also highlighted the Korean government’s new pilot program, which enables Pakistani students to enrol in two-year diploma programs with the added benefit of part-time employment, offering both academic and financial support.\nThe event concluded with remarks from Dr. Safeer Awan, Pro-Rector (Research and Strategic Initiatives), who expressed gratitude to the Korean delegation for their keen interest in partnering with NUML and fostering international academic relations.\nA Letter of Interest (LOI) was formally signed between the two institutions by Rector NUML, Maj Gen Shahid Mahmood Kayani HI(M) (retd), and Vice President Dr. Choi Jongin of Tongwon University.\nThe LOI outlines a comprehensive framework for bilateral cooperation between the two institutions, focusing on the exchange of students, faculty, researchers, and administrative staff. It also includes joint educational and research initiatives, the organization of seminars, conferences, and other academic events, as well as collaboration in graduate and post-graduate programs. Furthermore, the agreement emphasizes capacity-building through specialized training sessions and academic short courses aimed at enhancing institutional and individual competencies.\nThis collaboration marks a significant milestone in NUML’s efforts to strengthen its global academic partnerships and enhance international learning opportunities for its students and faculty.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:17:25.721Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/numl-and-korean-tongwon-university-sign-letter-of-interest-for-academic-collaboration/",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T13:51:00.000Z"
}
