{
  "title": "CUI rises to 664 in QS World University Ranking",
  "author": null,
  "content": "ISLAMABAD, Jun 20 (APP):COMSATS University Islamabad (CUI) has secured 664th rank in the QS World University Rankings 2026, marking a continued upward trajectory in global academic excellence.\nAround 1500 leading universities from across the world including 18 from Pakistan were assessed on this year’s ranking. COMSATS University Islamabad secured 6th  position in Pakistan, improving its global rank from 711-720 band to 664.\nThe  QS World  University  Rankings  are  among  the  most  prestigious  and widely  recognized benchmarks of international higher education performance.\nCOMSATS University’s position at 664 in the world reflects its dedication to quality education, impactful research, global outreach, and commitment to Sustainable Development Goals (SDGs).\nProf.   Dr.   Sajid   Qamar,   Rector,   COMSATS   University   Islamabad,   while   congratulating   the university faculty and staff said that “Our inclusion among the top 700 universities worldwide is a significant milestone for CUI despite its resource constraints.\nIt may not have been possible without the hard work of our faculty, the dedication of our students, and stakeholders.\nIt reaffirms our commitment to excellence, innovation, and contributing to the knowledge economy.”Over the past years, CUI has made significant strides in improving academic quality and research output, enhancing faculty credentials through its Faculty Development Academy, strengthening industry   linkages   through   its   Career   Development   Centers,   and   expanding   its   international collaborations. Recently the varsity introduced a fully funded PhD program, in order to attract the best talent from around the world to contribute towards its research.\nThe upward trajectory on the QS Ranking has also been attributed to focused efforts towards improving student placement in the industry and engagement with its Alumni body of over 100,000 graduates. During 2024-25 the university made significant infrastructural investments and focused on improving student services and learning experience, which is expected to yield dividends in the coming years.\nThese strategic efforts have reinforced the status of COMSATS University Islamabad as a premier institution of higher   learning in Pakistan and the region. CUI remains dedicated   to   further advancing its position by focusing on quality assurance, student success, sustainable development, and fostering an environment of inclusivity and academic freedom.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:17:24.316Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cui-rises-to-664-in-qs-world-university-ranking/",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T15:33:00.000Z"
}
