{
  "title": "DG FGEHA takes strict action against officers responsible for issuing 26 BUP Awards in G-14/1",
  "author": null,
  "content": "ISLAMABAD, Jun 20 (APP): Director General (DG) of the Federal Government Employees Housing Authority (FGEHA), Captain (R) Zafar Iqbal, has initiated strict disciplinary action against officers involved in the issuance of 26 BUP (Built-Up Property) awards in Sector G-14/1.\nTo investigate the matter, the Director General constituted a fact-finding committee comprising four senior officers, said a press release.\nThe purpose of the committee was to examine the BUP awards and identify any possible irregularities, discrepancies, or errors. The members of the committee included Faiz Umar Sial – Director Admin, Asim Aamir – Director IT, Sahibzada Qasim Noor – Deputy Director Finance, Haris Fawad – Assistant Director GIS.\nThe Terms of Reference (TORs) of the committee included a comprehensive review of various aspects of the BUP awards. It was tasked to identify any irregularities and inconsistencies, analyze the built-up properties using GIS technology, and determine whether compensation was being paid to genuine affectees or to unauthorized constructions.\nThe Fact-Finding Committee (FFC) submitted its report to the Director General, based on which disciplinary action has been taken.\nThe following officials have been suspended for their involvement: Yasir Qayyum – DC/LAC, Muhammad Waqas – Deputy Assistant Director (BUP), Irfan Dogar – Tehsildar, Ubaid Ishaq – Sub-Engineer.\nDG has forwarded the report to the Ministry of Housing and recommended that an inquiry be conducted under the E&D (Efficiency and Discipline) Rules against the above-mentioned officials and others involved.\nMoreover, under the instructions of the Director General, recovery orders have been issued to reclaim the payments made illegally under the BUP awards.\nDG reiterated that the Housing Authority is the guardian of the rights of genuine owners and will continue to prioritize their interests.\nHe assured that all rightful BUP compensation claimants should remain confident that their rights will be protected. Strict action will continue to be taken against corrupt elements.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:17:01.236Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dg-fgeha-takes-strict-action-against-officers-responsible-for-issuing-26-bup-awards-in-g-14-1/",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T17:28:00.000Z"
}
