{
  "title": "Austria opens consulate in Karachi to boost trade ties with Pakistan",
  "author": null,
  "content": "KARACHI, Jun 20 (APP): Federal Minister for Commerce Jam Kamal Khan on Friday said the opening of the Consulate General of Austria in Karachi will play a vital role in strengthening trade relations between the two countries.\nSpeaking as the guest of honour at the inauguration ceremony of the Austrian consulate, the minister noted that the move would help expand Pakistan’s future trade prospects with Austria.\nHighlighting the economic significance of Pakistan’s coastal cities, Jam Kamal said, “Port cities like Karachi carry immense potential for growth in industries such as manufacturing, textiles, and pharmaceuticals.” He assured full support from the Ministry of Commerce to facilitate the consulate’s efforts in enhancing bilateral trade.\nThe minister also shed light on the government’s broader economic vision. “Under the leadership of Prime Minister Muhammad Shehbaz Sharif, the Ministry of Commerce has initiated a tariff rationalization program, a first in Pakistan. Our aim is to reduce tariffs over the course of a five-year plan,” he said.\nReflecting on recent economic challenges, he acknowledged the difficulties faced over the past two to three years but expressed optimism about the future. “We expect the upcoming budget to be a reform-oriented one,” he added.\nHe also welcomed the newly appointed Consul General Dr Hussain Islam, expressing confidence in his capabilities. “With the background he brings, I am hopeful that Dr Hussain Islam will make significant contributions in this role,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:16:37.211Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/austria-opens-consulate-in-karachi-to-boost-trade-ties-with-pakistan/",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T18:57:00.000Z"
}
