{
  "title": "Expanded Quaid-e-Azam Trophy set to begin on Oct 6 - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Cricket Board (PCB) on Tuesday announced that the Quaid-e-Azam Trophy, the country’s premier domestic first-class tournament, will begin on Oct 6 with an expanded lineup of ten regional teams.\n\nThis marks the first time the tournament will feature ten sides, a significant increase from the traditional eight, following a series of late changes to the qualification criteria.\n\nInitially, the PCB had planned for a composition of the top six teams from the previous Quaid-e-Azam Trophy and the two top teams from the ongoing Hanif Mohammad Trophy.\n\nHowever, upon the conclusion of the Hanif Mohammad Trophy, the board first revised its plan to include the top two teams from each of that tournament’s two groups, which would have brought the total to four qualifiers.\n\nThe following day, the PCB altered the criteria again, deciding instead to determine the four qualifiers based on the combined points of all eight teams from the Hanif Mohammad Trophy, regardless of their group.\n\nThis final decision resulted in Multan, which finished third in its group, securing a place at the expense of Lahore Blues, which had finished second in the other group.\n\nThe four teams that qualified via the Hanif Mohammad Trophy are FATA, Faisalabad, Karachi Blues and Multan.\n\nThey will join Abbottabad, Bahawalpur, Islamabad, Lahore Whites, Peshawar and defending champions Sialkot in the competition. The tournament will be played across four cities: Abbottabad, Islamabad, Peshawar and Rawalpindi.\n\nThe PCB stated that the 10-team tournament will be played on a single-league round-robin format, with a total of nine rounds scheduled from Oct 6 to Nov 26.\n\nThe five-day final between the top two teams is set for Nov 29 to Dec 3, with the venue to be announced later.\n\nThe specific venues include the Abbottabad Cricket Stadium, the Shoaib Akhtar Stadium in Rawalpindi, the Imran Khan Cricket Stadium in Peshawar, and both the Diamond and Marghzar Cricket Grounds in Islamabad. All venues except Peshawar hosted matches in the previous edition.\n\nThe first round will feature a high-profile rematch of last year’s final, with defending champions Sialkot taking on Peshawar at the Imran Khan Stadium in Peshawar. Sialkot had won the previous final by one wicket in a closely fought contest.\n\nOther opening fixtures include Abbottabad versus Bahawalpur, Lahore Whites versus Islamabad, FATA versus Multan and Faisalabad versus Karachi Blues.\n\nThe squads for all ten teams are to be announced at a later date.\n\nPublished in Dawn, October 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:20:37.826Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945759/expanded-quaid-e-azam-trophy-set-to-begin-on-oct-6",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T01:45:06.000Z"
}
