{
  "title": "The missing voice: What Gazans think about Trump’s ‘peace plan’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "On Monday, US President Donald Trump, standing alongside Israeli Prime Minister Benjamin Netanyahu at a press briefing, announced the 20-point peace plan for Gaza, hailing it as a historic breakthrough and a new chapter for the Middle East.\n\nThe plan, according to the White House, aims to halt the two-year-long Israeli onslaught in Gaza, which has killed more than 66,000 Palestinians and reduced the enclave to rubble and dust.\n\nThe proposal calls for a ceasefire in the Gaza Strip, release of hostages by Hamas, disarmament of Hamas and a gradual Israeli withdrawal. It also includes the deployment of a “temporary international stabilisation force” in the enclave and the creation of a transitional authority headed by Trump and featuring other foreign leaders.\n\nIt further stipulates that Hamas and other Palestinian factions would not have any role in the governance of Gaza.\n\nNetanyahu has offered his backing to the plan, and Trump has given Hamas an ultimatum of “three or four days” or “pay in hell” if it rejects the deal. On the other hand, a Hamas source told AFP that it had “begun a series of consultations within its political and military leaderships, both inside Palestine and abroad”, which would “take several days due to the complexities of communication among leadership members and movements”.\n\nBut as world leaders continue to come up with deals, plans and proposals, the real stakeholders of the war — Palestinians in Gaza who have lost everything in the last two years — remain missing from the discourse.\n\nHere’s what they have to say:\n\n“For me and for everyone in Gaza, Trump’s plan is not in our interest, it doesn’t consider us, our rights, or treat us as human beings who must be allowed to live and whose blood should be spared,” lamented Nour Abu Shammala, a human rights advocate and writer based in the enclave.\n\nSpeaking to Dawn.com over the phone, she said the plan was meant to “whitewash Netanyahu’s image before the world”.\n\n“If Hamas refuses, the narrative will be flipped and the problem will be portrayed as coming from the Palestinian side, which will give him a justification to do whatever he wants in Gaza. And this, of course, comes after the international isolation Netanyahu and Israel have faced recently.\n\n“The plan is nothing more than a presentation of investment routes and a vague form of control over Gaza under unclear labels and question marks; it aims to destroy the Palestinian cause in the long term,” she stated.\n\nNour was clear on the plan: “We do not accept it, it does not give us our rights, nor does it do justice after all this suffering.”\n\nBut at the same time, she also stressed that Palestinians were now utterly exhausted. “We want the destruction and killing to stop, and we want to remain in our city and homeland, even though we know that death and injustice may continue whether the deal goes through this time or not.”\n\nMotasem A Dalloul, a Palestinian journalist covering the war, believed that ending the Israeli genocide in Gaza was never a plan.\n\nInstead, it was a “dirty trick to reinforce Israeli occupation with an international cover that would give Netanyahu more support and power to complete the annihilation of Gaza if the Palestinians rejected it,” he said in a post on X.\n\nIn another post, while sharing a photo of world leaders seated with Trump and Netanyahu, he said: “After making Israel isolated and looked at as a rogue state, these leaders saved it and made the victims — the Palestinians — isolated if they rejected a dirty plan drafted by zionists that would increase their suffering.”\n\nOn the other hand, Khalil Abu Shama, a Gaza-based human rights defender, told Dawn.com that while the plan was generally bad, the people of Gaza were seeing it as a stop to genocide and displacement.\n\n“Of course, some Hamas supporters will oppose it, but the general public — the majority — supports it. Their support is based on 23 weeks of genocide and destruction, during which no one was able to protect them,” he pointed out.\n\nShama, who has witnessed and lived the two-year-long war, stated that the overwhelming majority in Gaza no longer cared about the position of Palestinian factions because they had left the people to face their fate alone.\n\n“The truth is, as Palestinians, we have been defeated — and the defeated do not get to decide.\n\n“It’s like if two football teams were competing for a championship, and one team lost 5–0 — does anyone expect the losing team to take home the trophy?” he questioned.\n\nHaitham Elmasri, a business administration graduate in Gaza, called the plan “nothing but the beginning of a new war, not its end”.\n\n“He [Trump] has never cared about the Palestinian people at all; his only concern has been the sovereignty of Israel and its citizens. May God curse him and his partners,” he posted on X.\n\n“This is all manipulation. What does it mean to hand over all the prisoners without official guarantees to end the war?” Abu Mazen Nassar, 52, told AFP. He was displaced from his home in north Gaza to central Gaza’s Deir el-Balah.\n\n“We as a people will not accept this farce,” he said, adding, “Whatever Hamas decides now about the deal, it’s too late.”\n\n“Hamas has lost us and drowned us in the flood it created.”\n\nHeader image: A woman brushes a young girl’s hair in a tent at a make-shift camp for people displaced by conflict in Khan Yunis in the southern Gaza Strip on September 30, 2025. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0112005496a75bf.webp",
  "retrievedAt": "2025-10-12T04:28:49.144Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945828/the-missing-voice-what-gazans-think-about-trumps-peace-plan",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T08:28:37.000Z"
}
