{
  "title": "Islamabad court recalls non-bailable arrest warrants as Imaan Mazari, husband appear before judge - Pakistan - DAWN.COM",
  "author": null,
  "content": "An Islamabad District and Sessions Court on Wednesday recalled the non-bailable arrest warrants issued against human rights defenders and lawyers Imaan Zainab Mazari-Hazir and her husband Hadi Ali Chattha after the two appeared in court.\n\nArrest warrants had been issued for the two lawyers yesterday for failing to appear before the court in a case related to controversial tweets. A junior lawyer informed the court that Mazari and Chattha had left for another appearance in Rawalpindi after marking their attendance earlier in the day.\n\nThe case was heard by Judge Mohammad Afzal Majoka, with police deployed outside the courtroom for tight security.\n\nWhile the couple appeared in court today, they did not respond with a confirmation or denial when the charge sheet against them was read out.\n\n“We will hire lawyers and can respond to the court regarding this after that,” Chattha said. “We have filed a new application regarding our documents … No indictment can be made until this application is decided.”\n\nThe accused had earlier applied to obtain their written statements submitted before the Federal Investigation Agency (FIA) under Section 161 (examination of witnesses) of the Code of Criminal Procedure (CrPC) and other documents. Section 161 deals with the power of the police to examine witnesses orally during an investigation and to reduce their statements into writing.\n\nJudge Majoka then directed the National Cyber Crime Investigation Agency (NCCIA) to provide the documents to both the lawyers and adjourned the hearing until 11:30am.\n\nWhen the hearing resumed, Judge Majoka issued an order on the accused couple’s miscellaneous application for the documents.\n\nFormer Islamabad High Court Bar president Riasat Ali Azad, along with Islamabad Bar Association President Naeem Gujjar and its ex-president Qaiser Imam, also appeared before the court.\n\nThe prosecution had initially expressed ignorance about the written statements, but once the judge began dictating the order, the statements were handed over to Mazari and Chattha.\n\nSubsequently, the two decided to challenge the trial proceedings till the current stage of framing of charges and their lawyers requested additional time from the court. The request was accepted, and the hearing was adjourned until October 7.\n\nLast week, Mazari filed a grievance letter over “inaction” on her workplace harassment complaint against Islamabad High Court (IHC) Chief Justice Sarfraz Dogar.\n\nOn September 11, Justice Dogar had warned Mazari of a contempt of court case and was reported to have gone as far as passing warning remarks along the lines of “getting a hold of her”. Multiple lawyers’ bodies had issued condemnatory statements in reaction and called for the judge’s dismissal from the post of the IHC top judge.\n\nMazari had also approached an inquiry committee of the IHC and the Supreme Judicial Council (SJC) against Justice Dogar.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/01184830efcfb1c.webp",
  "retrievedAt": "2025-10-12T00:20:11.951Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945837/islamabad-court-recalls-non-bailable-arrest-warrants-as-imaan-mazari-husband-appear-before-judge",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T10:29:07.000Z"
}
