{
  "title": "Pakistan wavers after Gaza deal draft ‘changed’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• ‘This is not our document’, says Dar about White House plan; sticks to joint statement from Muslim bloc\n• Reveals Indonesia has committed 20,000 troops; Islamabad expected to make a decision soon\n• Axios claims Netanyahu negotiated changes to draft agreed between Trump, Muslim leaders\n• US president gives Hamas ‘three to four days’ to agree to deal; insiders say group will ‘likely reject’ proposal\n\nISLAMABAD / WASHI­N­GTON: A day after US President Donald Trump unveiled his ambitious plan to end the war in Ga­za, signs have began to emerge that not everyone is happy with the draft made public by White House.\n\nThis was evident from Foreign Minister Ishaq Dar’s presser on Tuesday, where he made it clear in so many words that the US peace plan for Gaza would not be acceptable if the am­e­ndments — jointly pro­posed by eight Muslim co­u­n­tries — were not included.\n\nThe “document has been issued by the US”, he said, seemingly distancing Pakistani decision-makers from the plan, even though Trump has previously claimed that both PM Shehbaz Sharif and Field Marshal Asim Munir are behind it ‘100pc’.\n\n“This is not our document, which we sent to them. There are some key areas that we want covered… If they are not covered, they will be covered,” he said.\n\nConsider Trump’s anno­u­ncement of the 20-point plan as “an announcement from their side”, he said.\n\nMr Dar, who is also the deputy prime minister, added that Pakistan owned the joint statement given on behalf of eight Muslim countries. “If there is a difference, we will go by this,” he said.\n\nIn response to a question, the foreign minister said the plan put forward by Trump envisions an independent technocrat government of Pales­tinians, to be overseen by an international body — mostly comprised of Palestinians.\n\nHe was also guarded about the possibility of sending troops to become part of the International Stabilisation Force (ISF).\n\n“On the ground, there will be Palestinian law-enforcement agencies… there will be [separate] forces supporting them. Indonesia has offered 20,000 troops for that. I am sure Pakistan’s leadership will also be making a decision on this,” he said.\n\nMr Dar maintained that this would be a special force for Gaza alone, and the arrangement for its deployment would be documented at the UN Security Council.\n\nRoad to deal\n\nDuring the presser, Mr Dar expounded on the diplomatic process that led to the finalisation of the pea­ce plan, saying that one of the main purposes of attending the UN General Assembly was to work with some “like-minded countries” on trying to end the misery in Gaza as a “member of the Muslim ummah”.\n\nEight countries, including Pakistan, agreed to take up this matter very proactively with President Trump during the US visit, he said.\n\nDar said a preparatory meeting was held before the Muslim leaders’ huddle with Trump.\n\nThe meeting with Trump was meant to try for a ceasefire in Gaza, make arrangements for sending humanitarian aid to the strip without any hurdles, stop the forced displacement of Pales­tinians and make arrangements for the return of those displaced from the Gaza, plan for Gaza’s reconstruction and stop Israel’s attempts to annex the West Bank, he said.\n\n“These objectives were conveyed to him (Trump), and he was asked to work with us on achieving them,” Dar said, adding that the US president then proposed that his team would devise a “workable solution” with the foreign ministers of the eight Muslim countries that participated in the meeting.\n\nHe said it was decided that the details of meetings held in this regard would be “secret” and “classified”.\n\nAfter sharing further details of how the proposal for ending the Isr­aeli onslaught in Gaza was finalised, Dar said he had received messages from the Saudi foreign minister.\n\n“He told me that five countries had reached a consensus on joint statem­ent [regarding the Gaza plan] and that our agreement was needed on this matter as well, and that they had also reached out to Indonesia and the UAE.\n\n“I then consulted the foreign secretary and proposed some changes. I spoke to the Saudi foreign minister again … as I had some objections … He then send me a revised version … and the joint statement was released.”\n\nWhen asked to assure that “you still believe in the two-state solution”, he said there was no change in Pakistan’s policy on Palestine. “And I rather would say the seven other countries are also with us on this.”\n\nThe repeated reference to the Mus­lim bloc’s joint statement is being seen as a ‘mild protestation’ over cha­nges to the terms of the deal, which were ostensibly carried out at Israeli PM Benjamin Netan­yahu’s request.\n\nChanges to the draft\n\nAccording to US news outlet Axios, the deal now before Hamas is significantly different than the one the US and a group of Arab and Muslim countries had previously agreed on, due to Netanyahu’s intervention.\n\nThe main stumbling block, it seems, were the last-minute edits secured by Israeli PM Benjamin Netanyahu when he held a six-hour meeting with White House envoy Steve Witkoff and Trump’s son-in-law Jared Kushner.\n\nThese included the conditions and timetable for Israel’s withdrawal from Gaza, and the proposal ties Israel’s withdrawal to the progress of disarming Hamas, and gives Israel a veto over the process.\n\nEven if all conditions are met and three phases of withdrawal are completed, Axios reported that Israeli forces would still remain within a security perimeter “until Gaza is properly secure from any resurgent terror threat”.\n\nAlthough there was no push-back publicly, officials from Saudi Arabia, Egypt, Jordan and Turkiye were furious over the changes behind the scenes, Axios reported.\n\nAccording to the report, the Qat­a­ris even tried to convince the Trump administration not to release the det­ailed plan on Monday due to those objections. The White House relea­s­­ed it anyway, and pushed the Arab and Muslim countries to support the plan. The eight Muslim countries then issued a joint statement welcoming Trump’s announcement, but without expressing full support for it. The Qataris told the other countries that after the generally positive statement, they would have further discussions with the US over the details, sources told Axios.\n\nQuoting a senior Arab official involved in the negotiations, the Axios report said that while Netanyahu had managed to change the text, it still has a lot of very positive elements for the Palestinians.\n\nDeadline for Hamas\n\nAfter Qatar and Egypt shared the 20-point plan with Hamas on Monday, President Trump gave the group “three to four days” to accept the proposal, or meet “a very sad end”.\n\nSpeaking to reporters in Washington, Trump said Israeli and Arab leaders had already endorsed the plan and that “were just waiting for Hamas” to make its decision.\n\n“Hamas is either going to be doing it or not, and if it’s not, it’s going to be a very sad end,” Trump said as he left the White House. Asked whether there was scope for further talks on the proposal, he replied: “Not much.”\n\nA source close to Hamas told Reu­t­ers the plan was “completely biased to Israel” and imposed “impossible conditions” that aimed to eliminate the group.\n\nQatar’s foreign ministry has said Hamas is studying the White House proposal “responsibly”.\n\nHowever, a senior Hamas figure told the BBC that the group is likely to reject Donald Trump’s peace plan for Gaza, saying it “serves Israel’s interests” and “ignores those of the Palestinian people”.\n\nThe source said the group is unlikely to agree to disarming and handing over their weapons.\n\nPublished in Dawn, October 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/010926355455410.webp",
  "retrievedAt": "2025-10-12T00:20:50.658Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945779/pakistan-wavers-after-gaza-deal-draft-changed",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T01:33:54.000Z"
}
