{
  "title": "Textile exporters struggle amid rising costs and tariffs - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Pakistan’s textile sector is struggling to benefit from a reduced Indian presence in the United States market, with rising production costs, declining cotton quality, and unfavourable policy changes impeding exporters. Despite hopes of capturing a larger market share due to tariffs on Indian textiles, Pakistan’s textile industry continues to face significant hurdles.\n\nThe sector’s challenges were underscored this week by concerns over external tariffs, inflationary pressures, and the aftermath of natural disasters. Industry leaders warn that without immediate reforms, Pakistan risks missing out on critical export opportunities.\n\nJaved Bilwani, President of the Karachi Chamber of Commerce and Industry, raised concerns over rising costs: “How can we compete when production costs are so high that selling in the US market becomes unviable?”\n\nKey issues include high tariffs on Pakistani textile exports, flood damage to cotton crops, and changes to the Export Facilitation Scheme (EFS). The US has imposed a 29pc effective tariff on Pakistani textiles, which includes a 19pc additional tariff and a 10pc base tariff. This makes Pakistani products less competitive compared to regional competitors like China and Vietnam, where production costs are lower.\n\nGul Ahmed’s suspension of apparel exports highlights broader struggles in textile sector\n\nAmir Aziz, another exporter, explained that his company has stopped accepting orders due to the high tariffs. “At 29pc, our products cannot gain meaningful market share, even as India’s presence declines,” he said.\n\nFloods earlier this year worsened the sector’s situation by damaging cotton crops, reducing both the quantity and quality of the crop. Pakistan’s cotton output is estimated to fall to five million bales this year, a decline exacerbated by continuing flood impacts. While the government has yet to complete a full damage assessment, exporters stress that quality is the more significant concern than production levels.\n\nIn addition, outdated agricultural practices and poor seed quality have contributed to a drop in cotton quality, making it harder for the industry to produce yarn and textiles that meet export standards. Industry experts argue that improving cotton quality through better research and seed innovation is vital for sustaining the textile sector.\n\nRecent amendments to the EFS have added to the industry’s burdens. Previously, the scheme allowed duty- and tax-free imports of raw materials for export production. The new rules, however, exclude cotton, yarn, and grey cloth from zero-rating, forcing exporters to pay taxes upfront, which strains liquidity and increases production costs.\n\nBilwani criticised these changes, stating that they “undermine the competitiveness of Pakistani exports” and could “threaten the viability of the textile sector”. The Pakistan Textile Council, along with other industry bodies, has strongly opposed the amendments, warning that they could undermine efforts to boost exports.\n\nAmid these compounded issues, exporters argue that Pakistan’s textile industry will continue to struggle despite the opportunity created by India’s reduced access to the US market. Without improvements in cotton quality and supportive government policies, Pakistan is unlikely to seize a larger share of the global textile market.\n\nGul Ahmed Textile Mills Limited (GATM), one of Pakistan’s largest textile manufacturers, announced this week that it would suspend its apparel export operations. The company cited rising production costs, policy changes, and increased regional competition as the main reasons for the decision.\n\nIn a notice to the Pakistan Stock Exchange, Gul Ahmed said that persistent operational losses, worsened by rising costs and competition, had made apparel exports unsustainable. However, it clarified that the company would continue its operations in other segments, including home textiles, spinning, and weaving.\n\n“The Board of Directors of Gul Ahmed Textile Mills Limited, in its meeting held on 29 September 2025, resolved to discontinue the business operations of the company’s export apparel segment. This decision follows a comprehensive strategic review of the segment’s performance and future outlook,” the notice stated.\n\nThe company attributed the decision to several factors, including intense competition from regional players, a stronger exchange rate, and recent government policy changes, such as an increase in the advance turnover tax. Additionally, rising fabric costs and high energy tariffs had significantly disrupted the cost structure and profitability of the apparel export segment.\n\nGul Ahmed believes that halting apparel exports will allow the company to focus on sustainable growth in its other business areas, strengthening its overall financial position.\n\nPakistan’s textile sector is grappling with a combination of external tariffs, flood-related disruptions, and domestic policy changes. The industry’s struggles underscore the urgent need for reforms to enhance cotton quality, refine tax policies, and foster a more supportive environment for exporters.\n\nWithout these measures, Pakistan risks missing valuable export opportunities, even as India’s reduced presence in key markets presents a temporary window for growth.\n\nPublished in Dawn, October 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:28:53.376Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945766/textile-exporters-struggle-amid-rising-costs-and-tariffs",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T01:45:00.000Z"
}
