{
  "title": "Competition Commission of Pakistan approves PTCL’s acquisition of Telenor with conditions - Business - DAWN.COM",
  "author": null,
  "content": "The Competition Commission of Pakistan (CCP) has approved Pakistan Telecommunications Limited’s (PTCL) acquisition of mobile carrier Telenor Pakistan and Orion Towers shareholdings, according to a press release issued on Wednesday.\n\nAccording to the telecommunication company’s website, one of its subsidiaries is mobile carrier Ufone. As part of the deal, Telenor and Ufone will merge.\n\nAccording to the press release, the merger was announced today at a press conference at the CCP’s head office. CCP Chairman Dr Kabir Ahmed Sidhu, CCP Registrar and Head of Legal Ambreen Abbasi and members Salman Amin and Shahzad Hussain shared the key highlights of the agreement.\n\n“They explained that [the] CCP conducted a comprehensive review of the merger transaction,” the press release read. “The review examined market structure, concentration levels, efficiencies, and potential competition risks.”\n\nDr Sidhu emphasised that the commission’s decision “ensures a level playing field for all telecom operators and safeguards consumer interests”.\n\n“The merger aims to enhance service quality, expand product offerings and accelerate technological innovation, including the rollout of 5G,” he was quoted as saying.\n\n“The CCP [has] studied various international precedents, including orders from the United States, United Kingdom and European Union, involving similar transactions before granting approval.”\n\nAccording to the press release, Abbasi explained that the assessment considered possibly lessening competition in the relevant sub-markets, market shares and efficiency claims. She underlined that the merger was approved conditionally, with safeguards designed to prevent anti-competitive conduct.\n\nSome of the key conditions listed in the press release were:\n\nIn the press release, Amin was quoted as saying that these conditions are specifically aimed at preventing favouritism, predatory pricing and barriers to market entry, while ensuring continued regulatory oversight by the CCP and PTA.\n\nLast week, the CCP raised concerns over PTCL’s non-cooperation and delay in providing critical information for evaluating the merger, with the watchdog citing potential competition risks and warned of cross-subsidisation between PTCL and Ufone, both of which operate under joint management.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:20:09.906Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945855/competition-commission-of-pakistan-approves-ptcls-acquisition-of-telenor-with-conditions",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T12:34:33.000Z"
}
