{
  "title": "Tehreek-i-Insaf govt in KP flayed for clipping powers of local bodies - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The participants of a multi-party conference here on Tuesday came down hard on Pakistan Tehreek-i-Insaf government in Khyber Pakhtunkhwa for what they called paralysing local government system with mala fide intentions and depriving elected representatives of the local bodies of their constitutional and democratic powers.\n\nThe conference was attended by leaders of different political parties, mayors, chairmen of tehsil councils and village and neighbourhood councils from across the province. The conference was held at Peshawar district council hall.\n\nANP provincial president Mian Iftikhar Hussain, MPA Nisar Baz, Leader of Opposition in Khyber Pakhtunkhwa Assembly Dr Ibadullah of PML-N, Maulana Amanullah Haqqani and Jalil Jan of JUI-F, Zahir Ali Shah of PPP and Sikandar Khan Sherpao of QWP participated in the conference.\n\nMayors of Mardan and Peshawar Himayatullah Mayar and Zubair Ali also addressed the multi-party conference.\n\nParticipants of multi-party conference to propose alternative local government law\n\nThe event was meant to take a unified stand on functioning of local government system in the province, the powers of public representatives and issues faced by people, according to a communiqué issued at the end of the conference.\n\nIt said that depriving elected representatives of local bodies of their powers and funds was actually an insult of people’s mandate. They said it also weakened democratic system at grassroots level.\n\nThe participants of the conference alleged that nepotism, favouritism and mismanagement paralysed the government departments in the province that affected writ of the state. They said that government multiplied problems of people instead of resolving the same.\n\nThey said that PTI had promised in its manifesto to empower local bodies but in fact it deprived local bodies of their powers. They said that government shifted powers of local bodies to bureaucracy. It was not only injustice with the people of the province but also a mockery of the elected representatives, they said. They added that such acts would deprive the province of development.\n\nThe participants of the event said that mayors and chairmen of tehsil councils and other members including women, minorities, youth and farmers’ representatives were elected directly by people for the first time in the province.\n\nHowever, the provincial government kept them away from social service by clipping their powers through major amendments to KP Local Government Act 2013, which was recently declared unconstitutional by Peshawar High Court, they said. “Since PHC has annulled those actions, then the question arises as to who will be made accountable for wasting three-and-half years of public representatives,” they questioned.\n\nThe participants of the conference said that opposition lawmakers in provincial assembly would move a motion in the house if an officer in any government department utilised illegal powers or curbed the constitutional powers of public representatives. They said that such an officer would be summoned to the relevant committee of provincial assembly.\n\nThey also expressed concerns over deteriorated situation in health and education sectors, unemployment in the province and large-scale migration of youth abroad. They alleged that mega scandals of corruptions were emerging on daily basis in KP, which was not only a proof that provincial government was corrupt but also a question mark on the performance of accountability institutions.\n\nDuring the conference, a unanimous resolution was also passed that a strong and empowered local government system would be established that would not only strengthen democracy but would also ensure provision of social services to people. The participants of the event also demanded of the provincial government to release development funds to local bodies according to law.\n\nThey also decided to frame another local government law in consultation with all political parties prior to local government elections.\n\nPublished in Dawn, October 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68dc40be78f48.jpg",
  "retrievedAt": "2025-10-12T00:20:24.420Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945695/tehreek-i-insaf-govt-in-kp-flayed-for-clipping-powers-of-local-bodies",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T01:45:39.000Z"
}
