{
  "title": "Irked by new polio cases, Sindh CM takes ‘negligent’ officials to task - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Murad suspends two DHOs, removes as many ACs and orders disciplinary action against DCs of Badin and Thatta\n• Says negligence in anti-polio drive will not be tolerated\n\nKARACHI: Expressing displeasure over the detection of two more poliovirus cases in the province this month, Sindh Chief Minister Syed Murad Ali Shah has suspended district health officers (DHOs) of Badin and Keamari and ordered disciplinary action against deputy commissioners (DCs) of Badin and Thatta districts.\n\nHe also removed assistant commissioners (ACs) of Matli and Mirpur Sakro.\n\n“Polio is a debilitating disease, and its eradication is our national duty, which everyone must perform diligently. Negligence will not be tolerated,” he stated.\n\nThe chief minister said this while presiding over a meeting on polio eradication at the CM House here on Tuesday. The meeting was attended by Health Minister Dr Azra Fazal Pechuho, Chief Secretary Asif Hyder Shah, Secretary to the CM Raheem Shaikh, Health Secretary Rehan Baloch, Emergency Operation Centre (EOC) Coordinator Irshad Sodhar and other concerned officials.\n\nThe CM said that the new cases, all within the Hyderabad Division, highlight a critical reality.\n\nThe health minister added that despite achieving over “98 per cent coverage” in recent vaccination drives, the virus continues to find and paralyse vulnerable children.\n\nThe chief minister was also informed that nine polio cases had been detected in the province, including three in Badin, two in Thatta, and one each in Hyderabad, Larkana, Kambar and Umerkot.\n\nIn response, the chief minister, expressing displeasure, ordered the suspension of two DHOs, Dr Anjum Ali Soomro of Badin and Dr Wali Muhammad Rahimoon of Keamari, and issued disciplinary notices to the DCs of Badin and Thatta. He also removed the ACs of Matli and Mirpur Sakro due to their poor performance in the polio eradication effort. The chief secretary approved these notifications.\n\n“Our campaigns are reaching the majority, but polio eradication is about protecting every last child,” said the CM.\n\nDr Azra mentioned the virus was a ruthless opportunist exploiting the smallest gaps, and that the strategy was shifting to systematically find and protect missed children.\n\nThe chief minister directed the Sindh Health Department and the EOC to launch an aggressive new phase of the polio eradication campaign following the detection of new cases in September.\n\nPakistan has seen a significant reduction in polio cases compared to 2024. The provincial government, through the Health Department, is confronting stubborn challenges that keep the virus circulating in the province, he said.\n\nThe September campaign left a critical gap: approximately 4,500 children refused.\n\nIt was also pointed out in the meeting that 81pc of Sindh’s environmental samples test positive for the virus, with all 12 sites in Karachi consistently testing positive.\n\nRecent cases in Badin and Umerkot are linked to mobile and migrant populations, who are often hard to reach with static health services.\n\nThe chief minister instructed the health department to unveil a comprehensive plan for the last quarter of 2025.\n\n“I want two large-scale campaigns to be planned for October and December, supported by a focused Fractional Inactivated Polio Vaccine campaign (fIPV) in Karachi and a combined Measles-Polio campaign in November,” he said.\n\nHe directed immediate mop-up vaccinations with Oral Polio Vaccine (OPV), supplemented with Inactivated Polio Vaccine (IPV) boosters, which are reportedly under way in areas where recent cases have been identified.\n\nThe CM also announced that a major operation would be launched to track and vaccinate children missed during the September campaign.\n\nHe emphasised that enhanced pre-campaign efforts would involve community influencers and medical professionals to address parental concerns and reduce refusals.\n\n“The path to a polio-free Sindh is clear,” the chief minister said.\n\n“We have the plan, the resources, and the commitment. Now, we are deploying senior teams to the highest-risk districts to ensure our efforts reach every home and every child. This final push requires the support of every community leader and parent to succeed.”\n\nPublished in Dawn, October 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:20:25.782Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945745/irked-by-new-polio-cases-sindh-cm-takes-negligent-officials-to-task",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T01:45:20.000Z"
}
