{
  "title": "10 terrorists killed during CTD operation in Quetta: spokesperson - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least ten terrorists were killed in Quetta’s Aghbarg area during an exchange of fire with security personnel from the Counter-terrorism Department (CTD), a spokesperson said on Wednesday.\n\n“Ten terrorists were killed during an exchange of fire between them and the CTD team in the Aghbarg neighbourhood of Quetta,” the spokesperson said in a statement.\n\n“CTD carried out the operation after receiving a tip-off from intelligence agencies,” he said, adding that “upon reaching the area, they were attacked by the terrorists but promptly retaliated.”\n\n“Heavy ammunition and weapons were recovered from the slain terrorists,” as per the statement.\n\nThe spokesperson said that the “terrorists had previously been involved in attacking security forces and belonged to a banned terrorist outfit.”\n\n“The slain terrorists have not yet been identified,” the spokesperson said, adding that their “bodies have been transferred to a hospital for identification purposes.”\n\n“Further investigation into the matter is underway,” the statement said.\n\nThe Inter-Services Public Relations confirmed that 10 terrorists belonging to Indian proxy Fitna al Khawarij were killed in a separate statement.\n\nThe development comes a day after 10 people, including four security personnel, were martyred in a suicide car blast near the headquarters of the Frontier Corps (FC) in Quetta.\n\nThe security situation in Balochistan has worsened in recent months, as terrorists, long involved in a low-level insurgency, have stepped up the frequency and intensity of their attacks. The banned so-called Balochistan Liberation Army (BLA), in particular, has adopted new tactics to inflict higher casualties and directly target Pakistani security forces.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:20:12.829Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945833/10-terrorists-killed-during-ctd-operation-in-quetta-spokesperson",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T07:56:15.000Z"
}
