{
  "title": "Philippines quake death toll rises to 69, official says - World - DAWN.COM",
  "author": null,
  "content": "The death toll from a 6.9-magnitude earthquake that hit the central Philippines has risen to 69, a disaster official said on Wednesday as the government mobilised agencies to search for survivors and restore power and water supplies.\n\nIn Bogo city in the north of Cebu province, which was near the epicentre of the shallow quake that struck off the coast just before 10pm on Tuesday, the hospital has been “overwhelmed,” Civil Defence official Raffy Alejandro told reporters.\n\nThe death toll of 69 was based on data from the Cebu provincial disaster office and was subject to validation, said Jane Abapo, an information officer at the regional Civil Defence office. Another official said more than 150 people were injured.\n\nPresident Ferdinand Marcos Jr assured survivors of swift assistance, saying cabinet secretaries were on the ground directing relief operations, as he expressed his condolences to those who lost loved ones.\n\nCebu, one of the Philippines’ most popular tourist destinations, is home to 3.4 million people. Despite the damage, Mactan-Cebu International Airport, the country’s second busiest gateway, remained operational.\n\nAnother hard-hit town, San Remigio, was placed under a state of calamity to help the response and relief efforts. Vice Mayor Alfie Reynes appealed for food and water for evacuees, as well as heavy equipment to aid search and rescue workers.\n\n“It is raining heavily and there is no electricity, so we really need help, especially in the northern part because there’s a scarcity of water after supply lines were damaged by the earthquake,” Reynes told DZMM radio.\n\nIn the nearby town of Pilar, resident Archel Coraza said most of his family were asleep when their house began to shake violently.\n\n“I woke them up and we all rushed outside into the street,” he told DZMM. Coraza, who lives close to the shoreline, said he saw seawater recede after the tremor.\n\nLocal media posted videos of people rushing out of their homes as the ground shook and buildings collapsed, including a church that was more than 100 years old.\n\nReynes said among the deceased were some people who had been playing basketball in a sports complex in San Remigio when it partially collapsed due to the quake.\n\nEarthquake monitoring agencies put the quake’s depth at around 10km and recorded multiple aftershocks, the strongest having a magnitude of 6. There was no tsunami threat following the quake.\n\nThe Philippines lies in the Pacific “Ring of Fire“, where volcanic activity and earthquakes are common. The country had two major earthquakes in January, with no casualties reported. In 2023, a 6.7-magnitude offshore earthquake killed eight people.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/010955025483093.webp",
  "retrievedAt": "2025-10-12T00:20:13.552Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945820/philippines-quake-death-toll-rises-to-69-official-says",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T04:56:46.000Z"
}
