{
  "title": "CCP clears merger of PTCL with Telenor - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The policy board of the Pakistan Telecommunication Company (PTCL) has accepted the terms and conditions set by the Competition Commission of Pakistan (CCP) for merger with Telenor Pakistan.\n\nThe PTCL has formally submitted its acceptance of the terms and conditions laid for its $40 billion acquisition of Telenor. An announcement is expected to be made soon.\n\nThe move clears the path for CCP to issue its much-anticipated order on the landmark merger, which has been pending for over 18 months.\n\nAfter the merger Ufone-Telenor-Pakistan will become almost as large as Jazz, leaving Zong behind.\n\nTwo lingering issues contributed to the delay: a pending payment of $800m by the UAE-based telecom giant and a plan for investment to be submitted by PTCL to CCP. This amount was slashed to $650m after negotiations when the PTI was in power.\n\nThe second stumbling block was a future investment plan to be submitted by the PTCL to the CCP.\n\nAn official acknowledged that the merger will create a highly concentrated operator by combining PTCL’s Ufone with Telenor Pakistan, raising risks of potential dominance. The CCP had also raised concerns that the abuse of dominance by the PTCL can rise after the merger.\n\nHowever, the CCP official added that the conditional approval framework is expected to mitigate these risks through safeguards on pricing, interconnection, infrastructure sharing, and fair competition. According to officials, the CCP faced considerable political and corporate pressure to fast-track approval.\n\nPublished in Dawn, October 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:20:38.401Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945763/ccp-clears-merger-of-ptcl-with-telenor",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T01:45:00.000Z"
}
