{
  "title": "Irsa, provinces at odds over Rabi water estimates - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Despite ample water stored in reservoirs and healthy post-flood soil moisture, the country’s agriculture output in the coming cropping seasons may still be hampered by delays in completing key development projects, creating operational challenges for irrigation.\n\nOn paper, the country’s main reservoirs — Tarbela and Mangla dams and Chashma barrage — were 99.3 per cent full at the start of the Rabi 2025 season, holding 13.217 million acre feet (MAF) of water against a maximum capacity of 13.316MAF. This healthy carryover could help offset some of the losses to agriculture caused by floods during the recently concluded Kharif season.\n\nHowever, the Indus River System Authority (Irsa) and provincial irrigation departments face hurdles in making full use of the available water due to the Water and Power Development Authority’s (Wapda) failure to complete three critical projects at Tarbela — Tunnel-4 (T4), Tunnel-5 (T5) and Low Level Outlet (LLO) at Tunnel-4.\n\nAgainst this backdrop, Irsa convened an unannounced meeting of its technical committee on Sept 29. The authority and the provinces failed to agree on water availability estimates for the Rabi season and the next Kharif season starting in April. The deliberations were also kept under wraps, unlike in the past.\n\nIrsa has now called a meeting of its advisory committee on Oct 7 for “app­roval of anticipated water availability criteria for Rabi season 2025-26 and progress, updated status and operational constraints of T4, T5 & T4-LLO”.\n\nAccording to informed sources, T4 and its LLO were due for completion three years ago, while T5 was supposed to be finished by July 2025 after the expiry of a 33-month deadline. These projects remain unfinished, and despite repeated reminders, Wapda has not provided formal updates on their completion timelines. T5 is now undergoing expansion.\n\nThe sources warned that these operational challenges could affect Rabi cropping patterns and have more serious consequences for the next Kharif season due to reduced carryover storage.\n\nOfficials said the water situation this season was expected to be normal after many years and any shortage would be “minimal, bearable and manageable”. Tarbela dam has remained at its peak conservation level of 1,550 feet for over a month, while Mangla dam reached 1,240.75 feet, close to its maximum conservation level of 1,242 feet, although inflows in the Jhelum River remained low throughout the Kharif season.\n\nOverall, total storage has already reached 13.217MAF — about 99.3 per cent of the maximum capacity of 13.3MAF — compared to 11.388MAF last year.\n\nThe total water requirement for Rabi crops under the 1991 Water Appor­tionment Accord is about 37-38MAF. With the carryover from Kharif, water availability is expected to reach about 35-36MAF along with river flows over the next six months.\n\nPublished in Dawn, October 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:28:09.795Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945769/irsa-provinces-at-odds-over-rabi-water-estimates",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T01:34:18.000Z"
}
