{
  "title": "‘Crushing’ injustice — The lawyer who took on the mining giants and won - Pakistan - DAWN.COM",
  "author": null,
  "content": "A quick Google search for Ghumawan, a quiet village tucked along Thandiani Road in Abbottabad, yields little more than a map pin and a handful of Facebook posts. No Wikipedia entry, no history, no headlines. Yet a Shutterstock result labelled “serene” shows photos with a backdrop of half-eaten mountainsides and a disappearing landscape.\n\nThe culprit? Mining.\n\nIn this forgotten village, a small storm has been brewing. Not of weather, but of will. A young man named Hashim Jadoon, just shy of 30, had returned home after studying law at the University of London in 2022. He had done his time in Islamabad’s legal circuit, working the grunt roles young lawyers are usually handed, and received his high court licence. “I wanted to do something more,” he said. He left Islamabad, unaware that what he was wishing to pursue was waiting for him at home, in humble Ghumawan.\n\nFor decades, the residents of Ghumawan valley have lived under the shadow of machines. Stone crushers roar throughout the day and detonate through the night at 180 decibels (comparable to the sound of a rocket launching). They spew dust, fracture homes, poison waterways, choke lungs, and shatter the peace and silence that once defined the village.\n\nThe land in question is Shamlat, a community grazing ground designated under the category of ‘Wajib ul Arz’. Though Wajib ul Arz is steeped in history and cultural tradition, Shamlat is also backed by law. As communal land, no one person or group can lay claim to it — certainly not without compensation.\n\nYet in 1984, the land was quietly leased out, without the community fully grasping what this meant. Over time, a dangerous myth took root: the leaseholder was now considered the “owner.” Few remembered the Shamlat. Fewer dared to challenge the ownership. No one spoke up, no one questioned. Perhaps it was inertia, perhaps a paralysing mix of fear and confusion. Unfortunately in Pakistan, all too often, the thinking goes: why take on a losing battle?\n\nAdnan, a local resident who supported Jadoon and even filed one of the cases under his own name, blames complacency. “People are as much to blame as local governance. They are afraid of being isolated by the community. Afraid they won’t be invited to weddings and funerals. As a small community, some of the mines were even run by relatives.”\n\nThe issue ran deeper than law; it was about confronting and breaking a silence that had become suffocating. Jadoon’s journey began with truth-seeking. He called a jirga at the village hujra [a traditional multi-purpose space, exclusively for men], where landowners, villagers, leaseholders, and even the mining operators sat together to discuss the nuisance of the stone crushing operations.\n\nHe listened. Then he argued. The law, he reminded them, isn’t just a theoretical concept; it lives in justice, in the air we breathe, and in the future we are mortgaging away. The stone crushers, drunk with power, dared him to challenge them. “This is Pakistan,” they scoffed, “here, the law only lives in books,” and walked out.\n\nEmboldened, Jadoon retorted after them: “If you can’t see how this is wrong, why not sell drugs? Both kill society. One just does it with more noise!”\n\nThe challenge was accepted.\n\nAccording to a pre-feasibility study conducted by Small and Medium Enterprises Development Authority (SMEDA) in 2016, demand for stone crushing increased as the construction sector grew at a sizeable rate, providing budding businessmen at the time with investment insight, and promising a return of 29 per cent in three years.\n\nSince then, Pakistan’s construction sector has contributed approximately 2.5pc to the GDP in the fiscal year 2024, employing almost 8pc of the total labour force and stimulating over 40 industries, according to the Board of Investment (BoI). GlobalData has further prophesied that the industry is expected to grow at an average annual growth rate of 4.6pc from 2026 to 2029.\n\n“There was a time there was nothing but the jungle in Dhodial and beyond,” recalls Adnan, “There were wild hares and partridges that frequented our orchards. Google satellite imagery of 1990 can show you the devastation.”\n\nStone crushers produce 20mm, 16mm, 13mm, 10mm, or 5mm stone chips to supply the ever-expanding construction industry. The material primarily consists of hard limestone and granite, though no exact geological mapping exists. According to SMEDA, “tens of billions of tonnes” are available across the country. These can be extracted either through powered mining — blasting mountainsides — or through riverbed mining, which involves fishing out large stones from rivers.\n\nRegulatory standards dictate environmental protection measures, such as ensuring stone-crushing units maintain a 500-metre distance from residential areas, avoid blocking traffic, and do not pose safety hazards. These concerns are largely tied to byproducts such as effluent (liquid waste discharged into waterways) and asbestos, a naturally occurring toxic fibre with carcinogenic silicate minerals that is present in dust particles.\n\nFurther guidelines recommend the use of coagulation solvents, sedimentation tanks, and measures to prevent effluent from mixing with waterways. They also call for dust containment enclosures and tarpaulins to limit aerosol loading, along with the enforcement of proper safety standards and provision of protective equipment for miners.\n\nHowever, according to a study conducted by Syed Yawar Ali in 2012 at the Pakistan Institute of Development Economics (PIDE), stone crushing largely makes use of manual labour (usually rural to urban migrants, and unskilled labour). Ali posited that the industry remained largely unorganised and undocumented, giving high leeway to bypass environmental and social welfare regulations.\n\nConducting interviews and questionnaires with local residents, he uncovered that most stone crushing units in Khyber Pakhtunkhwa (KP) were within residential or commercial areas. One in 10 had an official licence, most labourers did not have personnel safety gear and suffered numerous diseases including cancer, asthma and other respiratory issues.\n\nCancer incidence in the KP region accounted for about 20.2pc of cases in a 1994–2021 study by Shaukat Khanum Memorial Cancer Hospital.\n\n“I have only recently been operated on for kidney stones, and someone else I know just came out of surgery,” says Adnan. Research suggests exposure to heavy metals, such as those found in mining environments, can be a risk factor for developing kidney stones.\n\nThe environmental and health costs were undeniable. The crush plants operated up to 18 hours a day. Aerosol loading was blatantly apparent, waterways were poisoned, and forests were disappearing. Noise pollution was loud enough to cause permanent hearing damage.\n\nA girls’ high school stood right behind a mine; its foundations cracking. Roads were destroyed by 40-tonne trucks, denying locals their ability to work and live comfortably. The illegalities of the law were evident. The case wrote itself.\n\n“They consistently dump in our natural water channels, which not only pollutes our fresh water, but raises the river beds, to flood surrounding fields,” claims Adnan.\n\nIn June 2022, Jadoon filed his case before the Environmental Protection Tribunal. The process, predictably, was anything but smooth. Hearings were delayed, and the case before the Tribunal was adjourned indefinitely. A writ petition had to be filed before the high court just to resume the case. Since the court was proving to be a very slow process, the villagers and other local affectees sought the assistance of the district administration. More than 60 affectees petitioned before the deputy commissioner and asked him to seal the crush plants. The district administration took swift action, sealing the plants and halting the sale and transport of their material on March 10, 2023. The first win.\n\nThis led to a new round of litigation between the crush plant owners, the district administration, and the people. Jadoon, who was formerly the litigator, became the people’s lawyer.\n\nThe crush plant owners were aggrieved by the court’s order and filed a review petition. This legal battle led to a series of purposeful delays. The crush plant owners preyed on the weakness of the judicial system and filed another writ petition.\n\nOne of the petitioners who opposed the sealing order, had filed a case against the AC/DC (assistant and deputy commissioners). In a cruel twist of fate, he suffered a fatal heart attack while walking up the very road his own activities had helped destroy. The incline, carved by heavy trucks and rendered impassable, had left his vehicle behind. He passed before reaching his destination.\n\nThe miners, unphased, still opposed the district administration’s sealing order.\n\nMisinterpretation of the law, change of judges, playing victim, blatant violations and misinterpretation of court orders, led to a year-long cat-and-mouse game between the crush plant owners and Jadoon. When they failed in one court room, they would file writ petitions in different names and argue the same case in another court room. The stone crushers walked away with interim relief.\n\nUltimately, the case found its way to the court of the Chief Justice (CJ) of the Peshawar High Court (PHC). Jadoon had informed the CJ of the various inexplicable delays and the CJ directed the crush plant owners and their counsel to conclude the matter at the next date of hearing. Despite the CJ’s order, the crush plant owners failed to appear on the next date and the review petition was dismissed for being baseless and without merit.\n\nAs of March 11 2025, the PHC, Abbottabad Bench, dismissed multiple constitutional petitions filed by various stone crushing plants challenging an Environmental Protection Tribunal. This restrained their operations for lacking the mandatory Environmental Approvals (EAs) under Section 13 of the Khyber Pakhtunkhwa Environmental Protection Act, 2014 (KPEPA).\n\nThe crush plant owners once again challenged the stay order of the Tribunal before the PHC. Here things took a sensational turn.\n\nOn May 19 2025, Justice Syed Mudasser Ameer passed a landmark 31 page judgment (Writ Petition (WP) number (no.) 316-A/2025) — the judgment that ultimately destroyed all crush plants.\n\nThe verdict declared that Pakistan’s pride — its mountains — were being destroyed at an unprecedented speed, while holding the Environment Protection Department (EPD) and the government for not accounting for the disappearing landscape. The court opined that until and unless the government could strategise to preserve the mountains, no crush plant owner should be granted environmental approval to operate.\n\nIn open court, Justice Mudasser stated that crush plant owners need to look to other lines of business. He urged them to look toward global innovations such as building roads out of plastic and recycled products.\n\nAs the miners continued to oppose and play various games, a similar case unfurled in Haripur (also represented by Jadoon), which made it to the Supreme Court (SC).\n\nOn July 11, 2024, the Supreme Court, led by Justice Mansoor Ali Shah, delivered a precedent-setting ruling, directing the Environmental Protection Agency (EPA) to issue Environmental Protection Orders (EPOs) against more than 900 illegal crush plants operating across Khyber Pakhtunkhwa.\n\nIn this landmark victory, Justice Shah — a staunch advocate for environmental justice — championed a bold shift in how courts approach environmental litigation. He called for a proactive, inquisitorial, and sustainability-driven model of judicial intervention.\n\nHe asserted that the environment itself, not just the litigants, must stand at the heart of every decision, to be treated as a third party in the courtroom. In his words and actions, he made clear: in every environmental dispute, the ultimate winner must be the planet.\n\nAs of July 17, 2025, all mining leases have been suspended. The court held that none of the plants in question possessed a valid Environmental Impact Assessment (EIA), rendering their operations illegal from the outset. It further ruled that procedural objections could not legitimise activities explicitly prohibited by law.\n\nAll these developments raise the pertinent question of the purpose of the EPD which previously did little more than draft reports. Why has it lacked the power to shut down illegal or harmful activity without a court order? How could it issue licences without proper environmental assessments? Should the agency’s role and jurisdiction be fundamentally rethought? The case also revealed that the National Environmental Quality Standards (NEQS) have not been updated since 2010.\n\nEmphasising the constitutional right to a clean environment (Articles 9 and 9-A), the “precautionary principle,” and prior SC jurisprudence, the SC ruled that environmental protection overrides business rights under Article 18. It affirmed that the EPD has both the authority and the duty to halt unlawful operations in order to prevent irreversible ecological harm. The Court further directed the department to strictly enforce the KPEPA, act against all violators without discrimination, and ensure that no environmentally harmful activity proceeds without lawful approval.\n\nJadoon’s crusade has grown into a movement. His name now echoes in legal circles — not merely as a litigator, but as a defender of the commons. He has taken on cases against illegal hotels in Nathia Gali, unapproved mining in Haripur, environmental degradation in Sooraj Gali, unlawful taxes on small hotel owners, and even property taxes unlawfully collected by the Cantonment Board.\n\nYet, he laments: “I represent one village, one municipality. What of the others? The law should be the deterrent, not me.”\n\nUndeterred, Jadoon has filed two new writ petitions, arguing that crush plants have long operated illegally, flouting repeated court orders and violating explicit SC directions that no stone crushing may take place without environmental clearance.\n\nThrough sheer persistence, he has shed light on systemic blind spots in environmental governance that demand urgent reform.\n\n“The crux of the issue is a lack of awareness. It takes millions to invest in mining, but it takes trillions to repair the damage. Hashim bhai [Jadoon] was truly a one man army, and for that I am eternally grateful,” Adnan reflected.\n\nIt all began with one village. One jirga. One young man willing to ask: “If we don’t fight for our land, who will?”\n\nHeader image: Rescue workers stand beside a wreckage of a damaged truck as they search for survivors after a collapse at a marble quarry in Ziarat area of Mohmand, Pakistan, on September 8, 2020. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/30140905edff38f.webp",
  "retrievedAt": "2025-10-12T04:28:05.893Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944970/crushing-injustice-the-lawyer-who-took-on-the-mining-giants-and-won",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T06:33:38.000Z"
}
