{
  "title": "Kashmiris observing India Republic day as Black Day in IOK",
  "link": "https://www.app.com.pk/national/kashmiris-observing-india-republic-day-as-black-day-in-iok/",
  "date_published": "2020-01-26T02:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP):Kashmiris on both sides of the Line of Control (LoC) and across the world on Sunday are observing Indian Republic Day as Black Day in protest against India’s continued denial of Kashmiris’ right to self-determination.\nCall for the observance of the Black Day has been given by the All Parties Hurriyat Conference Chairman, Syed Ali Gilani, and other Hurriyat leaders and organizations including Muhammad Ashraf Sehrai and Mirwaiz Umar Farooq-led Hurriyat forum.\nThe day is marked with a complete strike in the occupied Kashmir and anti-India demonstrations and rallies in world capitals, Kashmir Media Service reported.\nThis year, the observance of the Black Day is also aimed at registering protest against the continued lockdown of the occupied Kashmir imposed by India for the past almost six months since August 5, last year.\nMeanwhile, stringent measures in the name of security have been taking on the India’s Republic Day for bringing more miseries to the already besieged people in the occupied Kashmir. Indian troops have intensified checking and frisking in Srinagar city and other parts of the territory.\nWhile the Kashmir Valley remains under strict military lockdown on 175th straight day, today, Indian troops and police personnel have been deployed in strength to keep a watch on the movement of people. The forces’ personnel have set up check points on every road and chowk where commuters and pedestrians are being frisked and vehicles are checked thoroughly.\nIn Srinagar, all roads leading towards a cricket stadium, where the main function of 26th January is scheduled to be held, have been sealed with barbed wire and barricades have been erected around the stadium. Unprecedented arrangements have been made in and around the stadium.\nA close vigil is being maintained on all vehicles and pedestrians entering the city. Police personnel can be seen carrying out surprise checking of the vehicles on the entry and exit points in the summer capital. The cops are also frisking motorcyclists and passengers of vehicles in the city. Similar reports have emerged from other parts of the territory.\nThe occupation authorities have ordered closure of all tuition and coaching centers as well as computer institutions.",
  "retrievedAt": "2025-08-11T18:41:31.451Z"
}
