{
  "title": "Will never succumb to pressure rather face challenges: PM",
  "link": "https://www.app.com.pk/national/will-never-succumb-to-pressure-rather-face-challenges-pm/",
  "date_published": "2020-01-26T09:20:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 26 (APP):Prime Minister Imran Khan Sunday resolved that the government would never succumb to any pressure rather would face challenges despite all negative propaganda being created by a mafia.\n“I want to clarify that we will never succumb to the pressure. We have always faced the challenges and will continue doing so,” the prime minister resolved in a meeting with the members of the national assembly from Punjab during his day long visit here.\nHe told the parliamentarians that a mafia, that had been detracting the people since decades to fulfill their nefarious designs, was now creating a negative impression against the government.\nThey intentionally try to create a chaotic situation just to undermine the positive changes being brought about by the government.\nHe said the purpose of the meeting was to discuss the problems being faced by the people of their respective constituencies, difficulties in execution of development projects and their early resolution.\nThe prime minister said no part of the country would be discriminated regarding the development work.\nHe advised the parliamentarians to keep in contact with the people in their constituencies and always strive to resolve their issues.\nThe members of national assembly also apprised the prime minister about the social and development issues confronting the people in their areas.\nThe prime minister directed the provincial government to devise a mechanism for effective coordination between the administration and the parliamentarians.\nHe told the meeting that the elimination of corruption was the key component of the Pakistan Tehreek-e-Insaf’s manifesto and for the first time in Punjab’s history, notorious criminals and land mafia gangs had been taken to task.\nHe said the government had inherited a country with record deficit, constantly devaluing currency and huge debt burden but now the situation had changed with rupee gaining strength.\nHe told the parliamentarians that the world was looking at Pakistan as an attractive destination for investment. The country had also get an unprecedented acknowledgment in Davos where the representatives of giant firms believed that Pakistan offered immense opportunities and potential for investment.",
  "retrievedAt": "2025-08-11T18:41:26.845Z"
}
