{
  "title": "US consulate Lahore to start visa service; says CG Katherine Rodriguez",
  "link": "https://www.app.com.pk/national/us-consulate-lahore-to-start-visa-service-says-cg-katherine-rodriguez/",
  "date_published": "2020-01-26T02:03:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 26 (APP):Consul General, United States Consulate in Lahore, Catherine Rodriguez said on Sunday the Lahore consulate had planned to start visa service from Lahore to ease visa processing for the people of Punjab.\n“It is only possible if the Lahore consulate is moved in a new building as the current building housing the US consulate was built in 1933 and too cramped to start new services, adding that 25,000 people from Punjab travel to Islamabad or Karachi for US visas annually”, she said in an interview with APP.\nTo a query, CG Catherine Rodriguez said a piece of land had been identified in the provincial metropolis and the work would start on it shortly after the land was acquired from the provincial government.\nShe said the new compound would allow better administration, more space and improved facilitation services to the public.\nRodriguez further said the new building would mean that the consulate could depute more staff to work for better agriculture services, commercial services, cultural exchange programs, besides special focus on enriching business ties with businesses in America, adding that the consulate had fantastic ideas for the 20th century building like starting visa service in Lahore.\nKatherine Rodriguez, a seasoned diplomat who served in different capacities in Karachi and Peshawar previously, admired the love, warmth and hospitality of Pakistani people, adding youth development and women empowerment in Pakistan were very close to her heart.\nTo a query, she said women make up 50 percent of population in Pakistan and economic boons would be unimaginable if women were engaged in economy. She further said women must stand shoulder to shoulder with men if a nation wishes to be great.\n“Women must have faith in themselves and do their best to challenge barriers fearlessly”, Ms. Rodriguez urged Pakistani women.\nAbout her other priorities as Consul General, Rodriguez said she wanted to see improved people to people contacts, encourage business opportunities for local businesses, support religious tourism in the province and create public awareness on air quality issues in Punjab especially Lahore during her tenure.\nHaving studied environment issues closely with a degree in “Environment Science and Policy’, she said air quality was poor in Lahore which must be improved to avoid all kinds of hazards.\nIn an effort to mobilize society in Pakistan on the air quality issue, the US mission recently invited US envoy on Science Dr James Schauer who visited universities including Forman Christian College (FCC) University, met business leaders and  government functionaries to devise ways to stem the rot.\nOn US mission’s efforts for preserving cultural heritage in Punjab as national treasures, she said 2 million dollars have already been awarded for the preservation of historic sites in Punjab, adding that the US consulate had invited fresh applications and proposals for heritage funding in the month of December last.\n“A sum of 1.2 million dollars has already been committed for the preservation of archaeologically important houses/havelis around Wazir Khan mosque – a project previously funded by the US”, she said.\nCatherine Rodriguez also expressed the hope to enhance cultural exchanges between the two countries, adding that Punjab had a rich culture and distinct music.\nOn education, the CG said United States has always patronized education in Pakistan, adding that Fulbright scholarship, University exchange programs and English Access Program were few features of the services rendered to promote education and scholarship in Pakistan.\nWhen asked about her favorite city in Pakistan, she shied away from naming the one and remarked all cities were distinct for their rich culture and distinct history. However, she expressed her desire to discover more of Pakistan especially the Northern areas during her two-year stint in Lahore.\n“I am a foodie and have tasted more or less every Pakistani dish spicy or non-spicy but ‘Hareesa’ is one dish on my list I am yet to savour”, she responded when asked about her favorite Pakistani dish.\nCG Catherine Rodriguez wished Pakistan a strong future, adding that the United States wanted to be part of country’s great future.",
  "retrievedAt": "2025-08-11T18:41:32.605Z"
}
