{
  "title": "Govt. to complete constitutional tenure, Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/govt-to-complete-constitutional-tenure-sheikh-rasheed/",
  "date_published": "2020-01-26T09:13:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 26 (APP):Minister for Railways Sheikh Rashid Ahmed on Sunday said Pakistan Tehreek-e-Insaf (PTI) government will complete its constitutional tenure.\nAddressing at breakfast ceremony held at Satellite Town 6th Road, Sheikh Rasheed said there are all rumors and nothing wrong. “The MQM, PML-Q and other coalition partners are standing with the prime minster Imran Khan,” he said.\nThe Minister pointed out after untiring efforts, the worst economic condition has been put in the right direction and stern decisions being taken for the betterment of economy are proving to be fruitful.\nHe stated the past ruler’s ruined the economy of the country and looted the money.\nPunjab Chief Minister Sardar Usman Buzdar would continue to stay in the office, Sheikh Rasheed said, adding that CM Usman Buzdar would also attend a public meeting at Laal Haveli scheduled for February 5.\nThe Minister said price-hike was an issue but there is a need to revisit the policies to control price hike and suggested that Price Control Committees should be set up with the elected members to monitor the prices of daily use.\nTo improve the education sector in the city, two universities has already been built while IT University and Railway University are also in pipeline which would impart higher education to young generation at their doorstep.\nHe said the present government was taking a special interest in laying a network of schools, colleges and institutions adding that more educational institutions would also be built in the city.\nThe construction of mother and child hospital would be operational soon equipped with all modern facilities, he added.\nHe said that multi-billion development projects including Ring Road, Nullah Lai and others would change the fate of the people of the city and announced to quit the politics.",
  "retrievedAt": "2025-08-11T18:41:26.538Z"
}
