{
  "title": "PBM spends Rs 2 bln on medical treatment; sets to make medical assistance process more simple :MD",
  "link": "https://www.app.com.pk/national/pbm-spends-rs-2-bln-on-medical-treatment-sets-to-make-medical-assistance-process-more-simple-md/",
  "date_published": "2020-01-26T02:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP):Pakistan Bait-ul-Mal (PBM) is all set to launch online medical assistance application to cut delay in reaching out to the most needy and streamline its services for those having no other recourse to urgent expensive medical treatment.\n“We are committed to reach out to the most needy on merit, without having them to run from pillar to post, or to beg someone for a ‘special favour’,” Managing Director  PBM Aon Abbas Buppi told  APP.\nHe said the online application form has been designed to cut down on bureaucratic procedures and provide necessary funds in seven days, against the current process that may take time.\nPresident Arif Alvi launched the PBM’s smart phone app for the disabled last week aimed at providing customised wheel chairs on first come first served basis and making the process convenient.\n“We already have spent over Rs two billion on providing medical care to 12,500 patients last year,” he said adding, as many as 198,635 deserving persons were provided medical assistance,40,000 educational assistance, 5,500 orphans provided basic amenities in Dar-ul-Ehsaas Centres, 204,142 poor women imparted vocational training besides paying education stipends to 47,000 students during last year.\nBuppi said while laying out his vision for injecting a new vigour into the social welfare organisation which is currently running around seven major projects aimed at reaching out to the poorest of the poor segments. Of these projects the cochlear implants seems to be the latest passion of Aon Abbas Buppi .\n“Imagine a child hearing the voice of his mother, hearing the Azan, for the first time…, how will he feel,” Buppi said adding, PBM has recently started providing cochlear implants to speaking and hearing impaired deserving children.\nA cochlear implant, costs from Rs 1.3 million to Rs 1.8 million but PBM has inked  agreements with four private hospitals to conduct cochlear implant operations at subsidized rate of Rs one million. “We had paucity of funds, we made an appeal and people in days donated Rs 180 million.”\nHe mentioned that a couple who just walked into his office one day and handed him a cheque of a very handome amount as part of their zakat.\nHe said PBM has made the system transparent and any deserving person could apply online. So far, 534 families have applied for cochlear implants. Their operation would be in next six months. He said Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection Dr Sania Nashtar has agreed to provide PBM Rs 400 million for the purpose. He was optimist that that 1,500 patients would be able to hear the first ever sound in their lives this year.\n“By the time the PTI concludes its term in 2023, we plan to to conduct 10,000 cochlear implants, ” Aon Abbas Buppi said.\nHe said the Prime Minister had agreed to give the PBM handsome amount for hearing aids.\nBuppi, who brings with him a vast experience in management and an honoury degree from the University of Nottingham, England, hails from South Punjab and described his latest assignment a challenging, yet very satisfying.\nHe said Prime Minister Imran Khan told him while handing over the assignment that taking care of orphans and needy was a very responsible task, and he must come up to the expectations of the destitute.\nHe said the number of Dar-ul-Ehsaas Centres (orphanage houses) have already been enhanced to 55 from 36 by the PTI government.\nBuppi plans to have  80 Dar-ul-Ehsaas Centres (erstwhile Pakistan Sweet Home)  in various areas of the country by June this year.\n“I sincerely believe that mother of an orphan child is the best of the service providers,” he said.\nHe said PBM was running 160 Women Empowerment Centres (WECs). The women of poor families were being imparted vocational training in these centres. The WECs have recently been affiliated with the National Vocational and Training Commission (NAVTTC) with the mandate to conduct six month course and award certificates to the students.\nThe women trainees were being paid Rs 50 daily allowance.  WECs were imparting training among 25,000 women in one year. The trained having workable business plan of Rs 25,000 to Rs 100,000 would be provided personal loans in collaboration with Pakistan Poverty Alleviation Fund. The loan would be returnable in the time span of 18 months first six months as grace period, he informed.\nPBM was also running 160 Schools for Rehabilitation of Child Labour, he said adding that PBM has finalized a plan to transform Pakistan Bait-ul-Mal School for Rehabilitation of Child Labour in to model schools.\nIn these schools, almost 100 students would be educated free and matching number would be imparted education by charging fee.\nHe said five new Thalassemia Centres would start working in different cities soon. 100 children have been registered in each centre, while a total of 3,300 Thalassemia patients have been registered by PBM for free blood transfusion. PBM has inked  Memorandum of Understanding with Lyton Rahmatullah Benevolent Trust (LRBT) to pay Rs 2500 to Rs 3,000 for each patient. PBM has allocated a sum of Rs 40 million for the purpose.\nHe said PBM has also devised a mechanism to address people’s complaints. He has settled 500 public notices. PBM has established regional offices in every tribal district of Khyber Pakhtunkhwa. Dar-ul-Ehsaas was also being opened there.\nHe said budget of PBM is Rs 5.6 billion and PBM is likely to get Rs three billion additional for helping the poor and completing different projects. He said Saudi Arabia  had distributed ration among 18,000 deserving families through PBM last year.\nThis year they have expressed their willingness to provide Ration to 50,000 families in collaboration with the PBM.",
  "retrievedAt": "2025-08-11T18:41:32.555Z"
}
