{
  "title": "Sherry Rehman expresses solidarity with brave Kashmiris of IIOJK on Youm-e-Istehsal",
  "link": "https://www.app.com.pk/national/sherry-rehman-expresses-solidarity-with-brave-kashmiris-of-iiojk-on-youm-e-istehsal/",
  "date_published": "2023-08-05T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): Federal Minister for Climate Change and Environmental Coordination, Senator Sherry Rehman on Saturday expressed solidarity with the brave Kashmiris of Indian Illegally Occupied Jammu and Kashmir (IIOJK) on Youm-e-Istehsal being observed on August 5 .\nIn her statement on the occasion, the federal minister said four years ago on this day, the Modi government usurped the rights of Kashmiris by abrogating Article 370 of the Indian Constitution.\nSenator Rehman said the Modi government has created a new history of exploitation and brutality. After the revocation of Article 370, the Modi government has made Occupied Kashmir the biggest prison in the world.\n“Atrocities are still being inflicted on innocent Kashmiris by the Indian forces due to the fear of rebellion. Hundreds of Kashmiri leaders who opposed the Modi government’s decision are still imprisoned in Indian jails,” the Minister said.\nچار سال پہلے آج کے دن مودی حکومت نے بھارتی آئین کے آرٹیکل 370 کا خاتمہ کرکے کشمیریوں کے حق پر شب خون مارا اور استحصال اور بربریت کی نئی تاریخ رقم کی۔ آرٹیکل 370 کے خاتمے کے بعد مودی حکومت نے مقبوضہ کشمیر کو دنیا کا سب سے بڑا جیل بنایا ہوا ہے جہاں  بغاوت کے ڈر سے بھارتی افواج کی… pic.twitter.com/09aJ7lWfAL\n— SenatorSherryRehman (@sherryrehman) August 5, 2023\nSenator Sherry Rehman said on the other hand, former Prime Minister Imran Khan, the head of the most incompetent government in Pakistani history, was sharing pictures of his previous condemnation statements.\n“However, the dark day of August 5 will be remembered in the history as PTI’s legacy. Instead of fighting the case of Occupied Kashmir against India, they announced 2 minutes of silence every Friday. Imran Khan’s incompetence and anti-Kashmir vision will not be excused under any circumstances,” she added.",
  "retrievedAt": "2025-08-11T09:04:49.932Z"
}
