{
  "title": "792 Kashmiris martyred since August 5, 2019 in IIOJ&K: Report",
  "link": "https://www.app.com.pk/national/792-kashmiris-martyred-since-august-5-2019-in-iiojk-report/",
  "date_published": "2023-08-05T05:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): The grave human rights violations including killings, extrajudicial executions, arbitrary arrests, torture, and destruction and snatching of property witnessed a surge to an alarming proportion in Indian illegally occupied Jammu and Kashmir after the Narendra Modi-led Hindutva Indian government’s illegal move of repealing the special status of the territory on August 5, 2019.The Kashmir Media Research report on the completion of four years of the Modi regime’s illegal and unconstitutional move, revealed that Indian troops have martyred 792 Kashmiris including 16 women during the period.It said that senior Hurriyat leader, Muhammad Ashraf Sehrai and Altaf Ahmed Shah were among dozens of Kashmiris who died in the custody of Indian police.It said that at least 2,369 people were critically injured due to the use of brute force including the firing of bullets, pellets, and teargas shells by Indian troops, paramilitary and police personnel on peaceful demonstrators and mourners in the territory.The report pointed out that the killings since 05 August 2019 have been higher than those in 2011, 2012, 2013, 2014, 2015 and 2019.It said, most of the victims were killed in fake encounters and in custody in the garb of violent cordon and search operations in the length and breadth of the territory. It said, many youths were picked up from their houses and then eliminated after being labeled as mujahideen or over-ground workers of mujahid organizations.It added that most of the arrested youth were booked by the Indian authorities under black laws like Public Safety Act and Unlawful Activities (Prevention) Act.The report pointed out that the killings by the troops since 05 August 2019 have rendered 52 women widowed and 128 children orphaned.It said, the troops damaged over 1,106 houses and structures and molested or disgraced 129 women and arrested 21,263 people including aged woman and half a dozen girls during CASOs across the occupied territory in the period.The report maintained that the life of Kashmiris has been particularly made economically, politically and socially miserable since India repealed the special stratus of the territory. The move, the report added, was aimed at changing the Muslim-majority status of the occupied territory into a minority.As the entire occupied Jammu and Kashmir has been turned into an open-air prison for its inhabitants, thousands of Hurriyat leaders and activists, religious and political leaders, businessmen and civil society members and youth were arrested after or before 5 August 2019 and they still continue to remain in different jails of India and IIOJK.Prominent among them are; APHC chairman Masarrat Aalam Butt, Shabbir Ahmed Shah, Muhammad Yasin Malik, Aasiya Andrabi, Nayeem Ahmed Khan, Fehmeeda Sofi, Naheeda Nasreen, Ayaz Muhammad Akbar, Peer Saifullah, Raja Merajuddin Kalwal, Shahid-ul-Islam, Farooq Ahmed Dar, Syed Shahid Yousuf, Syed Shakeel Yousuf, Muzafar Ahmad Dar, Ghulam Muhammad Butt, Mushtaqul Islam, Ameer Hamza, Maulvi Bashir Irfani, Bilal Siddiqi, Zafar Akbar Butt, Muhammad Yousuf Mir, Muhammad Yusuf Falahi, Muhammad Rafiq Ganai, Hayat Ahmed Butt, Dr Muhammad Qasim Fakhtoo, Ghulam Qadir Butt, Muhammad Shafi Shariati, Dr Hameed Fayaz, Maulana Abdul Majid Dar, Maulana Mushtaq Veeri, Abdul Rashid Doowoodi, Maulana Abdul Wahid Kishtwari, Showket Hakeem, Mehrajidin Nanda, Waheed Ahmad Gojri, Mehmood Toopewali, Feroz Adil Zargar, Dawood Zargar, Noor Muhammad Fayaz, Engineer Rasheed, human rights activists, Khurram Parviaz, and journalists Aasif Sultan and Fahad Shah.Senior APHC leader, Mirwaiz Umar Farooq, continues to remain under house detention in Srinagar while senior resistance leader Mohammad Ashraf Sehrai died during incarceration. Over 4000 people have been detained under black laws, PSA and UAPA.The report deplored that press freedom is under constant threat in IIOJK where journalists were detained and harassed. The new media policy introduced by the Modi regime in IIOJK in 2020 has further restricted the flow of free information in the territory, it added.The report pointed out that India is using brutal tactics to achieve its nefarious objectives in IIOJK. “Modi regime is engaged in changing the Muslim majority status of the occupied territory. For this purpose, it has granted domicile certificates to thousands of Indians.RSS-inspired BJP leadership wants to obliterate Muslims from IIOJK. RSS-backed Modi regime is furthering its Hindutva ideology in IIOJK. Properties of pro-freedom leaders are being confiscated to force them to give up their just cause. India is re-arranging constituencies in IIOJK to give more seats to Hindus,” it deplored.The report, however, said the worst Indian brutalities and cruelties have failed to subdue the freedom sentiment of the Kashmiri people and they are determined to keep fighting for their rights, including the right to self-determination.It said that New Delhi must realize the fact that it would not be able to silence the Kashmiris. It said the BJP government must be punished for its crimes against humanity in IIOJK.It maintained that the world community must take cognizance of India’s brutal actions in the occupied territory and force it to resolve the Kashmir dispute in accordance with the Kashmiris’ aspirations and the relevant UN resolutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:04:44.088Z"
}
