{
  "title": "India’s actions in IIOJK cannot legitimate illegal occupation, suppress Kashmiri’s rights: FM",
  "link": "https://www.app.com.pk/national/indias-actions-in-iiojk-cannot-legitimate-illegal-occupation-suppress-kashmiris-rights-fm/",
  "date_published": "2023-08-05T06:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): Foreign Minister Bilawal Bhutto Zardari on Saturday said that India’s actions in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) could neither accord legitimacy to its occupation, nor suppress the true sentiments of the Kashmiri people as coercion and intrigue could not replace legitimacy.\nIn a message on ‘Youm-e-Istehsal’ being observed today, the foreign minister stressed that the international community must demand an end to India’s gross and widespread human rights violations in IIOJK; reversal of its unilateral and illegal actions of 5 August 2019; repeal of draconian laws; and implementation of relevant UN Security Council resolutions on Jammu and Kashmir.\n“Pakistan wants good relations with all its neighbors, including India. However, good relations can only be achieved through dispute resolution and not through dispute denial. The durable peace in South Asia remains contingent upon the settlement of the Jammu and Kashmir dispute,” a press release quoted the foreign minister as saying.\nAs a party to the Jammu and Kashmir dispute, he said Pakistan stands ready to play its role to ensure a free and impartial plebiscite in accordance with the United Nations Security Council resolutions.\n“Our strong and steadfast moral, political and diplomatic support for the Kashmiri people will continue till the realization of their inalienable right to self-determination,” he reiterated.\nThe foreign minister further said that ‘Youm-e-Istehsal’ was a somber occasion to recall India’s illegal and unilateral actions of 5 August 2019 in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). That day, India scrapped the special status of IIOJK and bifurcated it into two so-called ‘Union Territories’ to alter its internationally-recognized disputed status and undermine the right to self-determination of the Kashmiri people.\nThe Indian actions triggered a process of demographic change and political engineering. As a result, the Kashmiri people were confronted with the danger of becoming a disempowered minority in their own land, he added.\nForeign Minister Bilawal further said that India had unleashed a new reign of oppression in IIOJK since 5 August 2019. Efforts were being made to muzzle the media and silence the genuine leadership of the Kashmiri people. Lately, the Indian authorities have sought death penalty for one of the most renowned Kashmiri leaders, Yaseen Malik.\n“The harassment of innocent people, arbitrary detentions, ‘cordon and search’ operations, and extra judicial killings have become a matter of routine. The Kashmiri people remain deprived of their fundamental freedoms of expression, assembly and religion. Above all, they are unable to exercise their inalienable right to self-determination,” he added.",
  "retrievedAt": "2025-08-11T09:04:44.778Z"
}
