{
  "title": "Film industry incentivized to promote, project national narrative through screen tourism: Marriyum",
  "link": "https://www.app.com.pk/national/film-industry-incentivized-to-promote-project-national-narrative-through-screen-tourism-marriyum/",
  "date_published": "2023-08-05T09:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Saturday that the present government has incentivized the local film industry with the aim to promote and project Pakistan’s image at global level through screen tourism.\nTalking to media at the inaugural ceremony of Censor Cinema Hall at Central Board of Film Censors, she said that during past over three decades, the entertainment industry had been struggling due to restrictions imposed on culture and heritage of the country.\nShe said that after 1970, many restrictions were imposed on the film industry and impacts of those restrictions were still being felt. She said film policy given by the government was not a stand alone initiative, but a comprehensive cultural policy was introduced.\nThe objective behind multiple concessions given to entertainment industry was to promote Pakistan’s national narrative and its rich culture and heritage, she said.\nThe government, she added, was working on screen tourism to improve the image of Pakistan as most of the countries of the world promote their narrative using screen tourism.\nShe said Prime Minister Muhammad Nawaz Sharif had initiated the Pakistan Culture Policy during PML-N’s 2013-2018 tenure.\nThe entry of young talented filmmakers in this sector would not only revitalize the industry but it would help promote and project culture and heritage which was of utmost importance.\nShe said that all over the world, the concept of censorship had ended and now film certification boards had been established and in Pakistan, film Censor Board would soon become a certification board. She said that the establishment of PTV Film Division was part of the policy to facilitate those who want to join this field.\nThe minister congratulated the Film Censor Board officials over the inauguration of Censor Cinema hall as in the past, the CBFC had to hire the services of a private cinema for the film censor. She said that at PTV Film Division, a small cinema was being renovated.\nThe minister said that the government has worked for the betterment of PTV and Radio Pakistan during its short stint in power. “When we came to power 15 months ago, there was a serious economic crisis in the country,” she maintained.\nThere was a journey of inflation from 2018 to March 2022 as the bad economic policies of the the PTI regime pushed the country to an economic quagmire.\nShe said first they ruined the economy and forced to approach International Monetary Fund for rescue action, but when Imran Khan realized that days of his rule were numbered, he first violated and then suspended the IMF deal signed by himself.\nThe minister said that IMF program was rescued with the hard work of Prime Minister Shehbaz Sharif and Finance Minister Ishaq Dar. She said not only inflation had increased due to PTI government’s actions, but friendly countries were angered by the previous regime.\nPrime Minister Shehbaz Sharif worked day and night to improve relations with friendly countries, initiated steps to revive economy and started rehabilitation activities during floods.\nShe said that Special Investment Facilitation Council (SIFC) would play a key role in attracting investment in the country.\n“Pakistan is moving towards economic stability once again as economy is gradually stabilizing”, Marriyum Aurangzeb said.\nShe said for the first time in the history of Pakistan, health insurance schemes for journalists and artists have been launched.\nShe said the present coalition government has institutionalized both Radio Pakistan and Pakistan Television Corporation.\nShe said that modern technology was being installed in the radio and now its broadcast will be heard in 52 countries of the world. She said that Radio Pakistan broadcast quality will improve with introduction of Digital Radio Mondiale technology worth Rs 4 billion and its new business plan would improve its finances and problem of salaries and pensions of its employees would be resolved.\nShe said the PTVflix has been launched after digitization of all its archives and similarly PBC archive has also been digitalized which will be inaugurated by the Prime Minister within few days.\nThe minister said that despite of tense political situation in the country during past 15 months, she took many initiatives to upgrade and modernize the Ministry of Information and its attached departments as strengthening of the institutions was the vision of the PML-N leadership.\nSecretary Information and Broadcasting Sohail Ali Khan, Principal Information Officer Mubashar Hassan, Chairperson Central Board of Film Censors Raisa Adil and senior officers of Ministry of Information and Broadcasting were also present on this occasion.",
  "retrievedAt": "2025-08-11T09:04:45.801Z"
}
