{
  "title": "Pakistan reaffirms global commitment to disaster risk reduction at PEDRR-25",
  "author": null,
  "content": "ISLAMABAD, May 06 (APP):Federal Minister for Climate Change and Environmental Coordination Dr. Musadiq Malik on Tuesday inaugurated the 2nd Pakistan Expo on Disaster Risk Reduction (PEDRR-25), organized by the National Disaster Management Authority (NDMA), reaffirming the nation’s strong commitment to disaster preparedness and climate resilience.\nAddressing a distinguished gathering of diplomats, parliamentarians, UN representatives, humanitarian partners, academics, and private sector leaders, the Minister highlighted Pakistan’s pioneering role in disaster risk management despite being among the most climate-vulnerable countries globally.\n“This expo reflects Pakistan’s unwavering commitment to strengthening disaster resilience through early warning systems, localized response mechanisms, and international cooperation,” the Minister said. “Pakistan has transformed challenges into opportunities by developing indigenous capacities like NEOC and sharing technical expertise with regional partners, creating goodwill and diplomatic leverage.”\nAcknowledging the devastating impacts of climate-induced disasters such as the 2022 super floods, the Minister praised the collaborative efforts of Pakistan’s civil and military responders, NGOs, and development partners.\nHe also emphasized the need for global support in accessing climate finance and carbon markets to safeguard the country’s glaciers, food security, and water resources.\nThe Minister stressed that disaster management in complex environments requires a culturally sensitive, data-driven, and community-inclusive approach.\nHe lauded NDMA’s initiative to establish a national think tank and promote knowledge exchange with global academic institutions.\n“Pakistan’s vision for resilience by 2030 hinges on innovation, inter-agency coordination, and evidence-based decision-making,” the Minister noted, calling on international donors to prioritize support for Pakistan’s adaptation and mitigation strategies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:10:31.565Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-reaffirms-global-commitment-to-disaster-risk-reduction-at-pedrr-25/",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T10:50:00.000Z"
}
