{
  "title": "Pakistan will not initiate conflict with India, armed forces will respond on aggression: Tarar",
  "author": null,
  "content": "ISLAMABAD, May 06 (APP):Federal Minister for Information and Broadcasting Attaullah Tarar on Tuesday said that Pakistan will not initiate conflict with India, but if aggression is directed towards the country, the response from Pakistan’s armed forces will be such that future generations will remember it.\nSpeaking in the National Assembly, Tarar said, “Pakistan has never initiated war, but if anyone dares to attack us, our answer will be unforgettable.” He accused India of sponsoring terrorism in Pakistan, saying, “India has been behind terrorist activities in Pakistan for years. Innocent lives have been lost because of its actions. Pakistan continues to make sacrifices in the fight against terrorism.”\nTarar praised Pakistan’s armed forces, police, and security agencies for their courage. “I pay tribute to politicians from all parties who gave their lives in this fight. Our leaders have shed blood to protect the country,” he said. He added that the spirit of sacrifice exists in every part of Pakistani society.\n“There is no group or class in this country that hasn’t suffered. Even the politicians in this Parliament have earned their place in history for their bravery.” Highlighting growing criticism within India, Tarar pointed to the failure of Indian forces to provide security during the Pahalgam attack. “Even Indians are questioning how nine hundred thousand troops in Kashmir failed to stop the incident. India has also failed diplomatically,” he said. Tarar said Pakistan has demanded an international investigation into the Pahalgam incident, increasing pressure on India. “India is now cornered. If it even thinks of aggression, Pakistan’s response will make history.”\nHe said that the entire Pakistani nation stands united behind its armed forces. “We are exposing India’s lies day by day. During our recent visit to the Line of Control, Indian media had no choice but to cover it. When they tried to block our social media accounts, we responded with full strength.” Tarar recalled a moment with students near the LoC, saying, “A child told me, ‘Let us face the enemy too—our chests are ready.’ When a nation’s youth, mothers, and daughters show such resolve, it cannot be defeated.” Reaffirming Pakistan’s stand against terrorism, Tarar warned that conspiracies against the country would fail in the face of national unity and resilience. He said Pakistan is a strong nation that always triumphs when united. “History proves it. Whenever we stood together, we defeated powerful enemies by the grace of Allah.”\nAttaullah Tarar strongly condemned the terrorists involved in the Jaffar Express attack and exposed their links to Indian state-sponsored terrorism. “I want to call out those terrorists from the floor of the House today—the ones who were given a platform on Indian media. If they had any courage, they would have removed their masks and shown their faces before giving interviews. But they hid behind masks and took shelter on Indian channels,” he said. He questioned how Indian media aired footage of the railway track blasts shortly after the incident, calling it proof of Indian involvement. “The trail leads directly to Indian state-sponsored sabotage.”\nHe criticized the hypocrisy of accusing Pakistan of terrorism while ignoring the fact that Pakistan has paid an enormous price in the fight against militancy. “We have sacrificed 90,000 lives in the war on terror. Name one other country that has made such immense sacrifices.”\nHe called the Pahalgam incident a false flag operation by India’s BJP government, aimed at harming Pakistan’s global reputation and halting its economic progress. “They thought this attack would benefit them, but it backfired.” He dismissed Indian media claims that Hindus were specifically targeted. “A Muslim was also killed. If it was truly indiscriminate, how do you explain someone calmly enjoying a zipline ride in the video?”\nTarar said video evidence contradicts India’s narrative. “People in the area were walking around normally. Some were even relaxing. This raises serious doubts about India’s version of events.” He added that Pakistan’s diplomatic efforts had forced India on the defensive. “International media like The New York Times and The Economist have supported our position. India has failed to present any proof against Pakistan. It’s all propaganda.” Pakistan, he said, welcomes a fair international investigation. “We have nothing to hide. Let the truth come out.”\nHe highlighted Prime Minister Shehbaz Sharif’s recent meetings with diplomats from China, the UK, Turkey, Saudi Arabia, the UAE, Kuwait, and others to raise the Kashmir issue at the UN Security Council. The Minister also warned that any attempt to divert Pakistan’s water resources would trigger a strong response. “Our intentions are peaceful, but we will not remain silent if our sovereignty is threatened.”\nHe condemned India’s repeated attempts to defame Pakistan, calling it ironic that a country engaged in transnational repression, including assassinations of Sikh leaders in Canada, Australia, and the U.S., dares to point fingers at Pakistan.\n“India is the state involved in killing Sikhs abroad—it is a terrorist state, not Pakistan.” “I salute the Sikh community across the globe for their courage. They have declared they will take bullets to the chest but never fight for the Indian army. Voices are rising worldwide, questioning who killed Hardeep Singh Nijjar and others. The answer is clear: it is the Indian state,” he said. He reminded the House that Indian naval officer Kulbhushan Jadhav, arrested in Balochistan, remains evidence of Indian terrorism. Tarar called India’s actions in Pahalgam a major failure of intelligence and security. “We took international media to places India falsely claimed were terrorist camps. These remote mountain areas are hundreds of kilometers from the LoC—India’s claims are baseless.”\nHe mocked India’s security forces for failing despite having a large presence in Kashmir. “You have nine lakh troops and still say a few men crossed rugged terrain to carry out an attack? What is your army doing then?” The Minister slammed the treatment of Kashmiris by Indian forces. “Today, young Kashmiris are being thrown into rivers, their bodies later recovered with the excuse that they jumped to evade arrest. This is not law enforcement—it is targeted killing,” he said. “The Indian forces have done nothing for the past seven decades except inflict brutality upon the innocent Kashmiri people.” He emotionally recounted the unwavering resolve of Kashmiris.\n“Despite the ban on the Pakistani flag, mothers and sisters in Kashmir continue to bury their martyrs wrapped in it. What kind of spirit is this?. Tarar questioned how India registered an FIR just 10 minutes after the Pahalgam attack. “How is that possible when even a victim’s father says police arrived 90 minutes later?” He said Indian forces near the site were focused not on protecting civilians, but on suppressing Kashmiris. “This was a clear security and intelligence failure.”\nThe Information Minister also highlighted Pakistan’s efforts in information warfare. “We bought airtime to play patriotic songs on Indian YouTube channels. We are fighting back in the information space and winning.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:10:13.545Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-will-not-initiate-conflict-with-india-armed-forces-will-respond-on-aggression-tarar/",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T11:16:00.000Z"
}
