{
  "title": "NBF showcases Pakistani literature at Abu Dhabi Int’l Book Fair 2025",
  "author": null,
  "content": "ISLAMABAD, May 05 (APP):National Book Foundation (NBF) of Pakistan proudly set up the “Pakistan NBF Book Stall” at the prestigious Abu Dhabi International Book Fair 2025.\nThe book fair, held from April 26 to May 5, attracted millions of literature lovers, artists, writers, intellectuals, poets, journalists, and cultural enthusiasts from around the world. With over 1,400 book stalls from various countries, the event proved to be a global celebration of knowledge and creativity, said a press release here on Monday.\nThe Pakistani book stall was officially inaugurated by Pakistan’s Ambassador to the United Arab Emirates, Faisal Niaz Tirmizi.\nFollowing his directions, a large number of students and teachers from Pakistani schools across the UAE attended the event, demonstrating their enthusiasm for books, literature, and reading culture.\nAmbassador Tirmizi also paid a special visit to the NBF stall and graced the launching ceremony of a special publication featuring essays on leading Pakistani figures from various fields.\nIn his keynote address, he praised the dedication and efforts of Pakistani authors and emphasized the significant role of literature and the arts in promoting Pakistan’s moderate and cultural image on a global scale.\nHe commended Sarmad Khan, the visionary behind World Books, for his outstanding administrative contributions to organizing Pakistan’s participation in the fair. Ambassador Tirmizi also encouraged Pakistani schools in the UAE to actively participate in such events and highlighted the importance of strengthening cultural cooperation between the NBF and Abu Dhabi’s Department of Culture and Tourism—particularly in translating and promoting literary works across both countries’ languages.\nManaging Director of NBF,  Jahangir Kamran, expressed his delight at the Ambassador’s recognition of Pakistan’s rich literary heritage, stating, “It is heartening to see that our literary wealth is being acknowledged and shared on such prestigious platforms.”\nHe also acknowledged the pivotal role played by Sarmad Khan, a UK-qualified Chartered Accountant with vast experience in organizing successful events in the UK, Pakistan, and the UAE.\nNBF Secretary Murad Ali Mohmand and Ibrahim Mohammad Aslamah from Abu Dhabi’s Department of Culture were also present at the event.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:10:56.086Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nbf-showcases-pakistani-literature-at-abu-dhabi-intl-book-fair-2025/",
  "dateList": "2025-05-06",
  "date_published": "2025-05-05T19:05:00.000Z"
}
