{
  "title": "Expired food, unsafe meat: Restaurant in F-6 sealed by IFA",
  "author": null,
  "content": "ISLAMABAD, May 06 (APP): The Islamabad Food Authority (IFA) has sealed a private restaurant in sector F-6 after discovering expired food items, unhygienic conditions, and violations of food safety rules.\nTalking to APP, Deputy Director Operations of IFA, Dr Tahira Siddique said that a restaurant operating in Islamabad’s F-6 sector has been sealed by the Islamabad Food Authority (IFA) for multiple violations of health and safety regulations.\nShe said that the restaurant was found serving expired food and storing unsafe meat, raising serious concerns about food safety and consumer health.\nDuring the inspection, the IFA team discovered that the restaurant was functioning without a valid license from the authority, a clear breach of local food business regulations. In addition, the staff had failed to follow basic hygiene practices. The team noted that employees were not using gloves or wearing safety caps while preparing and handling food.\nDeputy Director of Islamabad Food Authority stated that the restaurant was not following the standard operating procedures set for food safety. He said the use and sale of expired food items is strictly prohibited, and the presence of such products during inspections leads to immediate action.\nThe inspection also revealed poor cleanliness in the kitchen and storage areas. Officials highlighted that the restaurant did not have proper arrangements in place to maintain hygiene, further adding to the risk of contamination.\nThe Islamabad Food Authority clarified that food businesses in the capital are required to register and obtain a license before starting operations. Running a food outlet without approval from the authority is not allowed and is subject to legal action.\nDuring the operation, food safety officers noted clear violations of hygiene protocols. These included the absence of protective clothing, poor sanitation, and the presence of spoiled and expired food. The team documented these findings before sealing the premises.\nThe Deputy Director emphasized that the authority is committed to ensuring food safety and will continue to inspect restaurants and food points across the city. He said that actions like this are part of routine monitoring to prevent the sale of expired or unsafe items.\nUnder the law, restaurants are not allowed to keep or sell expired food products. Businesses found doing so face penalties, closures, or both. The official reiterated that all food outlets must meet the safety standards set by the Islamabad Food Authority.\nThe authority has urged citizens to report unhygienic or illegal food practices so that action can be taken to ensure safe dining options in the capital. Regular inspections, he added, will continue in various sectors of Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:10:08.264Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/expired-food-unsafe-meat-restaurant-in-f-6-sealed-by-ifa/",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T11:51:00.000Z"
}
