{
  "title": "“Water is a red line, any misadventure to be repulsed with force”: Parliamentarians",
  "author": null,
  "content": "ISLAMABAD, May 6 (APP): Parliamentary Secretary for Privatization Aasia Ishaque Siddiqui on Tuesday said that despite being a nuclear power, Pakistan has always shown restraint, but that should not be taken for weakness.\nSpeaking in the National Assembly, she said Pakistan has exposed Indian state-sponsored terrorism on every international platform and will continue to do so.\nPPP leaders Sharmila Farooqi and Shagufta Jumani both accused India of fabricating the Pahalgam attack as part of a series of false flag operations, including the Pulwama incident, aimed at justifying aggressive actions like revoking Kashmir’s special status and attempting to block Pakistan’s water.\nSharmila Farooqi warned that water is a red line for Pakistan, and any attempt to block it would be considered an act of war.\nMQM’s Hafizuddin said India, after scrapping Articles 370 and 35A, has tried to increase its grip over Kashmir, but the region remains an inseparable part of Pakistan.\nHe said that India’s actions mimic Israel’s oppression of Muslims and warned that 250 million Pakistanis stand ready to defend their country.\nPML-N’s Tahira Aurangzeb said India has once again challenged the resolve of 250 million Pakistanis and questioned the authenticity of the FIR filed mere minutes after the Pahalgam incident.\n“If a real investigation were conducted, it would clearly implicate Modi,” she said.\nPTI lawmaker Aslam Ghumman said that India repeatedly blames Pakistan instead of accepting its own security failures.\n“If India dares another misadventure, Pakistan will take the fight into Indian territory,” he warned, noting that ongoing internal movements within India are enough to weaken it from within.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:10:06.135Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/water-is-a-red-line-any-misadventure-to-be-repulsed-with-force-parliamentarians/",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T12:24:00.000Z"
}
