{
  "title": "JCP approves 7-member Constitutional Bench",
  "link": "https://www.app.com.pk/national/jcp-approves-7-member-constitutional-bench/",
  "date_published": "2024-11-05T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): The Judicial Commission of Pakistan (JCP) on Tuesday approved a seven-member Constitutional Bench with representation from all four provinces for a term of two months.\nThe JCP, reconstituted under the 26th Constitutional Amendment, convened its first meeting Chaired by Mr. Justice Yahya Afridi, Chief Justice of Pakistan / Chairman of the Judicial Commission here at the Supreme Court of Pakistan. The meeting was attended by Justice Mansoor Ali Shah, Justice Munib Akhtar, Justice Amin-ud-Din Khan, Mr. Azam Nazeer Tarar, Federal Minister for Law and Justice, Mr. Mansoor Usman Awan, Attorney-General for Pakistan, Senator Farooq Hamid Naek, Senator Syed Shibli Faraz, Sheikh Aftab Ahmad, Member of the National Assembly, Mr. Umar Ayub Khan, Member of the National Assembly and Ms. Roshan Khurshid Bharucha.\nThe Commission considered the formation of a Constitutional Bench within the Supreme Court to consider constitutional matters/cases. The Chief Justice expressed the views of the judges regarding the Constitutional Bench under Article 175(A) of the Constitution and suggested certain duration of the Bench. Other participants also expressed their views on the matter which was considered and thoroughly debated.\nFollowing a vote, the majority (7 out of 12) approved a seven-member Constitutional Bench with representation from all the four provinces for a term of two months, comprising of the judges including Justice Amin-ud-Din Khan, (Chairman), Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Ayesha A. Malik, Justice Syed Hasan Azhar Rizvi, Justice Musarrat Hilali and Justice Naeem Akhtar Afghan.\nEarlier, the Chairman JCP welcomed the participants and congratulated them on their nomination. At the outset, Mr. Umar Ayub objected to the quorum of the Commission highlighting the absence of one member. This objection was later put to a vote and by majority, the meeting affirmed that the proceedings are in consonance with the Constitution and can continue in the absence of one member.\nThe Commission discussed the establishment of a dedicated Secretariat to support and perform its functions and, after thorough consideration, the Commission authorized the Chairman to proceed with its rule making and establishment.\nThis initial session of the reconstituted Judicial Commission marks a procedural step in advancing the functions of the Commission under the new framework provided by the 26th Constitutional Amendment. The meeting ended with a note of thanks to and from the Chair.",
  "retrievedAt": "2025-08-10T15:03:14.996Z"
}
