{
  "title": "Ayaz expresses concern over impact of armed conflicts on environment",
  "link": "https://www.app.com.pk/national/ayaz-expresses-concern-over-impact-of-armed-conflicts-on-environment/",
  "date_published": "2024-11-05T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): Speaker National Assembly, Sardar Ayaz Sadiq Tuesday emphasized the need to address the environmental consequences of armed conflicts.\nHe expressed these views in his message on the occasion of the “International Day for Preventing the Exploitation of the Environment in War and Armed Conflict”, which was observed across the world on 6th November 2024 under the auspices of the United Nations.\nThe Speaker stressed that armed conflicts not only bring widespread human suffering but also lead to severe environmental degradation and badly affect biodiversity.\nHe highlighted the impact of war on natural resources and the ecosystems that sustain life, urging global collaboration to protect the environment in conflict zones.\n“The devastating effects of war on the environment extend beyond national borders and generations.”\nAyaz Sadiq said that armed conflicts and war destroy infrastructure as well as cause deforestation, and soil degradation and undermine the global efforts to address climate change and biodiversity loss.\nThe Speaker called on lawmakers worldwide to advocate for policies that prioritize environmental protection, even amidst conflict, and to push for legislation that holds parties accountable for environmental damage in conflict zones.\n“It is our collective responsibility to safeguard our planet. By addressing environmental damage in conflict zones, we can contribute to a more sustainable and peaceful future.”\nAyaz Sadiq reaffirmed the commitment of the National Assembly of Pakistan to support international efforts aimed at mitigating the environmental impact of armed conflicts and expressed solidarity with the affected communities.",
  "retrievedAt": "2025-08-10T15:04:01.884Z"
}
