{
  "title": "Telenor secures top position at Telecom Cyber Security Awards 2024",
  "link": "https://www.app.com.pk/national/telenor-secures-top-position-at-telecom-cyber-security-awards-2024/",
  "date_published": "2024-11-05T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):Telenor Pakistan announced its top achievement at the “Telecom Cyber Security Awards 2024,” organized by the Pakistan Telecommunication Authority (PTA).\nThe awards ceremony, held in the federal capital, recognized Telenor Pakistan for its outstanding performance in Category I, which includes Cellular Mobile Operators (CMOs) and large operators.\nThe recognition follows PTA’s comprehensive audit and revalidation exercises, which revealed Telenor Pakistan’s exemplary compliance percentage with the Critical Telecom Data and Infrastructure Security Regulations (CTDISR).\nThis annual assessment by the PTA evaluates operators on their adherence to critical security protocols to safeguard national telecom infrastructure.\nTelenor Pakistan’s CEO, Khurrum Ashfaque, received the award on behalf of the company from the Minister of State for IT & Telecom.\nThe awards ceremony was attended by prominent officials, including the Chairman of PTA, the Minister of State for IT & Telecom, and key leaders from across the telecom and tech sectors, including CEOs and Chief Information Security Officers (CISOs).\nAwais Vohra, Chief Technical Officer at Telenor Pakistan, shared his insights on the achievement: “This award is a recognition of Telenor Pakistan’s dedication to uplift its cybersecurity posture according to the changing global threat landscape. “Ensuring the security of our assets is essential to our commitment to providing secure and reliable services for our customers. We remain committed to leading the industry by implementing strong cybersecurity controls and driving improvement initiatives.”\nThis award reinforces Telenor Pakistan’s commitment to cybersecurity excellence, setting a benchmark for industry standards and fostering a safer digital ecosystem in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:03:43.528Z"
}
