{
  "title": "Acting President Gilani urges media to acquaint people with Mohtasib’s role in addressing public grievances",
  "link": "https://www.app.com.pk/national/gilani-urges-media-to-acquaint-people-with-mohtaibs-role-in-addressing-public-grievances/",
  "date_published": "2024-11-05T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):Acting President Syed Yousuf Raza Gilani on Tuesday urged the media to raise awareness about the role of federal Ombudsmen offices in resolving numerous grievances, with many more anticipated to be addressed in the near future.\nThe acting president heard representations against the orders of the Ombudsmen at the federal level. Justice (R) Irfan Qadir, the nominee of the President of Pakistan to process and decide these representations, was also present on the occasion.\nThese representations included matters pertaining to Wafaqi Mohtasib, Federal Ombudsman for Protection Against Harassment at Workplace (FOSPAH) and Federal Insurance Ombudsman. After the hearings, the acting president said that in the last six months, the President of Pakistan through his nominee had decided hundreds of cases, providing relief to the downtrodden, widows, persons with disabilities, including persons belonging to minorities and backward areas against the maladministration of the executive.\n“Such prompt disposal of cases in recent times is unprecedented”, he remarked.\nActing President Gilani stated that large scale relief was also provided to citizens and overseas Pakistanis in the taxation and banking sector.\nHe said that the institution of Ombudsmen at the federal level, inclusive of the Apex forum of the President’s nominee, had provided relief to the general public against the maladministration of the executive in issues concerning all the departments of the federal Government, Autonomous Bodies and other public and private sector organizations of national importance.\nIn this way, over 200,000 cases per year are being decided where the President of Pakistan is the highest forum, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:04:24.692Z"
}
