{
  "title": "ITP implements diversion plan for underpass construction Dhookri Serena Chowk",
  "link": "https://www.app.com.pk/national/itp-implements-diversion-plan-for-underpass-construction-dhookri-serena-chowk/",
  "date_published": "2024-11-05T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):The Islamabad Traffic Police (ITP) has issued a diversion plan on Tuesday for the ongoing construction of the underpass at Dhookri Serena Chowk.\nMotorists are advised to follow the alternative routes detailed below to ensure a smooth traffic flow.\nFrom the Red Zone to Murree Road and Express Highway: Drivers are instructed to use Shahrah-e-Dastoor, France Turn, Jinnah Convention Centre, Kashmir Chowk, and Club Road, a public relation officer told APP.\nMotorists traveling from Bhara Kahu or Murree to the Red Zone should enter through the Bari Imam Barrier Point by using Quaid-e-Azam University Road from Murree Road.\nMotorists traveling from sectors G-6, G-7, and F-7 to Bhara Kahu or Murree should use the 7th Avenue and the Chand Tar Flyover, traveling via Garden Avenue on Murree Road.\nMotorists traveling from the motorway or Srinagar Highway to Bhara Kahu or Murree should take the Expressway and use Murree Road via the Faizabad Bridge.\nTo access the motorway from Bhara Kahu or Murree, motorists should use Murree Road, Kashmir Chowk, Club Road, Faizabad, and then the Srinagar Highway.\nMotorists traveling from the Expressway to the Red Zone should use Zero Point, Srinagar Highway, 7th Avenue, and Jinnah Avenue.\nTo travel from the Red Zone (F-6, F-7, G-6, G-7) to the Expressway, motorists should take 7th Avenue, the Chand Tara Flyover, and use the Srinagar Highway.\nTo travel from D-12, E-11, F-10, and F-11 to Jinnah Avenue, Blue Area, or the Red Zone, motorists should use Margalla Road.\nResidents of G-10, G-11, G-12, G-13, G-14, can reach Jinnah Avenue, Blue Area, or the Red Zone by using 7th Avenue and Faisal Avenue from Srinagar Highway.\nFor entry to the Red Zone, Nadra Chowk, Express Chowk, Ayub Chowk, and Baghala Road will be open from Embassy Road.\nCitizens are requested to refrain from unnecessary travel to the construction site and to adhere to traffic regulations to facilitate smoother movement for all.\nNote: Additional traffic updates will be provided on ITP FM 92.4 or the ITP WhatsApp channel for public guidance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:03:34.693Z"
}
