{
  "title": "IGP Muhammad Khalid Khan Khattak appointed as National Coordinator of NACTA",
  "link": "https://www.app.com.pk/national/igp-muhammad-khalid-khan-khattak-appointed-as-national-coordinator-of-nacta/",
  "date_published": "2024-11-05T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):The Ministry of Interior Tuesday appointed Inspector General of Police (IGP) Muhammad Khalid Khan Khattak as the National Coordinator of the National Counter Terrorism Authority(NCTA).\nAccording to a notification, IGP Khattak, an officer of the Police Service of Pakistan (PSP) with nearly three decades of distinguished service, now holds one of the most critical roles in Pakistan’s counterterrorism landscape.\nWith 29 years of extensive experience in policing and law enforcement, IGP Khattak has an impressive track record, having served in diverse roles at both the federal and provincial levels. His career, which began in November 1995 when he joined the PSP, spans roles that include fieldwork, strategic positions in the Ministry of Interior, and responsibilities as a Staff Officer to the Inspector General of Police.\nHe has commanded several districts, led teams on the ground, and managed crucial law enforcement portfolios, underscoring his deep expertise in public safety and security.\nIGP Khattak’s record is equally notable in specialized domains. He has held the role of Additional Director at the Federal Investigation Agency (FIA), focusing on white-collar crimes and immigration. His experience extends to the Anti-Narcotics Force (ANF), where he directed three critical areas: International Cooperation (IC), Assets and Financial Investigation (AFI), and Planning & Development (P&D). This multifaceted experience has endowed him with a comprehensive understanding of security, investigation, and law enforcement challenges within Pakistan and in the international arena.\nPreviously, IGP Khattak also served as the Capital Police Chief of Islamabad, where he was responsible for overseeing the security of the federal capital. This role tested his abilities in managing urban security concerns, countering organized crime, and maintaining public order in the nation’s capital.\nIn his latest role at NACTA, Khattak had been serving as the Member of Counter-Terrorism, making him the senior-most officer at the agency. His appointment as National Coordinator not only leverages his current expertise in counterterrorism but also positions him at the helm of NACTA’s strategic and operational functions.\nIGP Khattak’s academic background includes a Bachelor’s degree in Sciences and Political Science, further complemented by his participation in specialized courses on policing, management, human rights, and gender issues. His training spans both national and international platforms, underscoring his commitment to continuous learning and adaptation in the fast-evolving field of law enforcement.\nIGP Khattak’s appointment comes at a time when Pakistan faces complex challenges in counterterrorism and internal security. His extensive experience in managing white-collar crime, narcotics, immigration issues, and counter-terrorism efforts, coupled with his field experience and strategic roles, makes him uniquely suited for this critical assignment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:03:36.867Z"
}
