{
  "title": "IPESC approves standardized academic calendar to streamline Pak student admissions",
  "link": "https://www.app.com.pk/national/ipesc-approves-standardized-academic-calendar-to-streamline-pak-student-admissions/",
  "date_published": "2024-11-05T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):In a landmark decision aimed at improving the efficiency of Pakistan’s educational system, the Inter-Provincial Education Secretaries Committee (IPESC), led by Mr. Mohyuddin Ahmed Wani, Federal Secretary, Ministry of Federal Education & Professional Training, has approved a standardized academic calendar for all educational boards in the country.\nThis new policy, designed to streamline the student admissions process, was discussed in a meeting convened on November 4, 2024 and is set to be implemented across all provinces.\nAs part of this change, all educational boards will now conduct their annual examinations in March, with results to be announced by the end of July each year. This unified examination and result declaration timeline will allow students to apply for college and university admissions promptly, ensuring that they are able to secure placements in their desired programs without unnecessary delays.\nExecutive Director IBCC, Dr. Ghulam Ali Mallah, emphasized the significance of this change for students and institutions alike.\nHe stated, “This decision represents a pivotal moment for Pakistan’s education system. By standardizing the academic calendar, we are ensuring that students can proceed with their higher education without facing the challenges that previously arose from discrepancies in examination schedules. This new structure will not only simplify the admissions process but will also foster better planning for educational institutions across the country.”\nThe standardized academic calendar aims to address long-standing concerns about the misalignment between examination schedules and admission cycles, which often caused delays and confusion for students across the country. By streamlining this process, the government hopes to create a more student-friendly and efficient educational environment.\nThe Federal Ministry of Education, in collaboration with the IBCC and provincial education boards, will continue to monitor the implementation of the new calendar and work towards further reforms to enhance the quality of education and support systems for students.\nThis initiative marks an important step towards modernizing Pakistan’s education system, and it is expected to have a positive impact on the future of students and educational institutions nationwide.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:04:00.150Z"
}
