{
  "title": "Hajj quota fixed at 179,210 for next year as federal cabinet approves policy",
  "link": "https://www.app.com.pk/national/hajj-quota-fixed-at-179210-for-next-year-as-federal-cabinet-approves-policy/",
  "date_published": "2024-11-05T12:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): The federal cabinet on Tuesday gave the green light to the Hajj Policy 2025, paving the way for 179,210 Pakistani nationals to perform Hajj next year.\nAs per the Policy, the Hajj quota will be split evenly between government and private schemes and those under 12 years of age will not be allowed to travel for Hajj, according to a PM Office press release.\nThe meeting, chaired by Prime Minister Shehbaz Sharif, was told that selection under the government scheme will be made through a computerised balloting.\nAs per policy, 1,000 seats would be allocated for hardship cases and 300 for laborers and low-income employees registered under the Employees Old-Age Benefit Institution or Workers Welfare Fund.\nUnder the policy, Road to Makkah facility would be available at Islamabad and Karachi international airports.\nThe Hajj Group Organisers would sign a Service Provider Agreement with the Ministry of Religious Affairs, which would be strictly monitored.\nIt was told that a new portfolio of Nazim (administrator) had been introduced to facilitate the pilgrims. One Nazim will be appointed for each 100 pilgrims, who would be selected from among the welfare staff.\nUnder the policy, the compensation for the heirs of the deceased has been increased from Rs1 million to Rs2 million while the injured ones would be given Rs1 million.\nThe cabinet members were told that a special Hajj Management App has been developed to facilitate the pilgrims and arrangements have been made for their training.\nThe federal cabinet called for preference to the intended pilgrims who could not succeed during the last year’s balloting. The meeting also stressed the need for taking all-out measures for the facilitation of the pilgrims.\nThe cabinet approved the appointment of Saeed Iqbal, Moazzam Ahmed, Madiha Khalid, Usman Haider and Muhammad Sajjad Farouqui in the board of Public Private Partnership Authority as private members.\nOn the finance ministry’s recommendation, the cabinet gave post facto approval to the agreement on transfer of Foreign Commercial Financing Facility from London Interbank Offered Rate to Secured Overnight Financing Rate.\nThe meeting approved the Jammu and Kashmir Estate Property Budget for fiscal year 2024-25, besides endorsing an agreement between Directorate General of Ports and Shippings Karachi and Bahria Classification Society on the certification of the classification of ships.",
  "retrievedAt": "2025-08-10T15:04:00.083Z"
}
