{
  "article_id": "2025-09-20_d7c0e5c01c4cd032a76ae27ab95eb391",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sco-a-beacon-of-trust-in-turbulent-world-fosters-cooperation-over-confrontation-sehar-kamran/",
    "retrieved_at": "2025-09-20T12:10:28.595Z"
  },
  "metadata": {
    "title": "SCO a beacon of trust in turbulent world, fosters cooperation over confrontation: Sehar Kamran",
    "author": null,
    "date_published": "2025-09-20T13:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 552,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "MOSCOW, Sep 20 (APP): Member of the National Assembly Sehar Kamran on Saturday said that the Shanghai Cooperation Organisation (SCO) stood as a \"beacon of trust and collaboration\" in the turbulent world fostering cooperation over confrontation and offering a platform to tackle shared challenges of security, connectivity, energy, and development through dialogue and mutual trust. The parliamentarian, in her address at World Public Assembly being held here from September 20-21 on \"The SCO: A Space of Trust between Nations\" said that the SCO was rightly described as a space of trust between nations, representing nearly half of humanity, spanning 70% of Eurasia, contributing 30% of global GDP, and uniting four nuclear powers. \"In today's rapidly changing world, multipolarity is no longer an aspiration but a reality. The SCO stands as a vivid embodiment of this transition, bringing together diverse civilizations, economies, and cultures on the basis of equality and mutual respect,\" she told the gathering of experts, opinion leaders, policy makers, government officials and parliamentarians. MNA Sehar Kamran, also Patron in Chief of Centre for Pakistan and Gulf Studies and a former senator, extended felicitations to the organizers, acknowledging Stanislav Korolev, Director of the National Center for SCO People's Diplomacy in Russia and Deputy Secretary General of the Assembly of the World's Peoples; Piao Yangfan, Deputy Secretary General of the SCO; and Bakhtiyor Khakimov, Special Representative of the President of the Russian Federation for SCO Affairs. As the session unanimously agreed to establish a Parliamentary Assembly of SCO, suggested by the WPA Deputy Secretary General, she called it a significant step toward enhanced cooperation. Highlighting the recent SCO Summit in China, she appreciated the decisions to establish an SCO development bank, trade financing, adopt a 10-year strategy for an equitable multipolar world, and create platforms for green industry and digital economy cooperation. She cited progress in Pakistan-Russia relations recalling the meeting between Prime Minister Shehbaz Sharif and Russian President Vladimir Putin at the Tianjin summit wherein they discussed deepening ties in energy, trade, and defense. MNA Sehar Kamran said that a new trade corridor was also under discussion to link Belarus, Russia, Kazakhstan, Uzbekistan, Afghanistan, and Pakistan and that the SCO's renewed emphasis on Eurasian connectivity aligned with Pakistan's vision of becoming a regional transit hub through Gwadar and CPEC corridors. She told the international gathering that Pakistan recently assumed the chair of the SCO's Regional Anti-Terrorist Structure (RATS) for 2025-26. \"No other country understands the horrors of terrorism more directly than Pakistan. Our people and our soldiers have paid an immense price in the global fight against terror - with over 80,000 lives lost and enormous economic sacrifices. By leading RATS, Pakistan brings not only experience but also credibility. We know firsthand that terrorism respects no borders, and that only through trust, cooperation, and shared intelligence can we defeat it.\" She highlighted that Pakistan would will host the next SCO Summit, acting as a bridge between South Asia and Central Asia, between China and Russia, and between East and West. Calling for unity on matters of peace and security, Sehar Kamran said, \"The challenges before us are formidable: terrorism and extremism, geopolitical rivalries, economic vulnerabilities, and the existential threat of climate change... Together, in this new world of conscious unity, the SCO can illuminate the path to a peaceful, prosperous future.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}