{
  "article_id": "2025-09-20_64dea310dde37d4d6f8e78626920de53",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/iaea-praises-pakistans-partnership-progress-in-peaceful-nuclear-programme/",
    "retrieved_at": "2025-09-20T12:10:49.533Z"
  },
  "metadata": {
    "title": "IAEA praises Pakistan’s partnership, progress in peaceful nuclear programme",
    "author": null,
    "date_published": "2025-09-20T13:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 369,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 20 (APP):The peaceful nuclear programme of Pakistan received recognition from the Director General of the International Atomic Energy Agency (IAEA), Mr. Rafael Mariano Grossi, who acknowledged the country's steady progress and close cooperation with the Agency. In a social media message following his meeting with the Chairman, Pakistan Atomic Energy Commission (PAEC), Dr. Raja Ali Raza Anwar, on the sidelines of the 69th IAEA General Conference in Vienna, Mr. Grossi highlighted Pakistan's achievements in expanding its civil nuclear energy capacity. He observed that Pakistan's nuclear power programme is advancing \"at a good pace,\" particularly with the ongoing construction of Chashma Nuclear Power Plant Unit-5 (C-5). The DG recalled witnessing the first concrete pouring at the site in February 2025, which he described as a major milestone in Pakistan's efforts to strengthen energy security through clean and sustainable nuclear power. During the meeting, the IAEA Director General and PAEC Chairman reviewed areas of cooperation under various Agency initiatives. These included Atoms4Food, which applies nuclear technology to improve crop yields, food safety, and pest control, and Rays of Hope, which aims to expand access to nuclear medicine and radiotherapy for cancer care across the Asia-Pacific region. Mr. Grossi appreciated Pakistan's active engagement with the Agency, especially in capacity-building, training, and the application of nuclear knowledge for socio-economic development. He noted that Pakistan continues to serve as an important partner in the peaceful uses of nuclear science and technology. The PAEC Chairman reaffirmed Pakistan's commitment to the peaceful applications of nuclear technology, in line with national development priorities and IAEA frameworks. He underlined that Pakistan's nuclear power plants operate under the highest safety standards and contribute significantly to the energy mix by providing reliable, low-carbon electricity. He added that PAEC's activities are closely aligned with the IAEA's vision of promoting nuclear technology for peace, health, and prosperity. The meeting also provided an opportunity to discuss Pakistan's contributions to regional initiatives under the IAEA, particularly in the Asia-Pacific, where Pakistani expertise in nuclear applications is being shared with other Member States. Pakistan reiterated its resolve to continue working with the IAEA and Member States in advancing peaceful nuclear cooperation, sustainable development, and improved quality of life for people across the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}