{
  "article_id": "2025-09-20_031ecd9bf3f5dc1c707895b492d37ef6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/working-group-set-up-to-tackle-e-waste-issue-in-pakistan/",
    "retrieved_at": "2025-09-20T18:36:15.080Z"
  },
  "metadata": {
    "title": "Working group set up to tackle e-waste issue in Pakistan",
    "author": null,
    "date_published": "2025-09-20T16:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 380,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 20 (APP): The Ministry of Climate Change and Environmental Coordination (MoCC&EC) has constituted a working group to address the country's growing challenge of electronic waste (e-waste). According to an official notification available with Wealth Pakistan, the working group has been tasked with deliberating on and providing technical input for the development of a national e-waste management system. It will also contribute to the formulation of a national e-waste management policy framework, identify regulatory gaps, and propose effective implementation mechanisms. The working group will be chaired by MoCC&EC Secretary Aisha Humera Chaudhry. Other members include the Secretary of the Ministry of Information Technology, a representative of the Pakistan Telecommunication Authority (PTA), the Secretary or representative of the Ministry of Industries and Production, a representative of the Federal Board of Revenue (FBR), the Secretary or representative of the Ministry of Commerce, Director Generals of Provincial Environmental Protection Agencies (Pak-EPAs), a representative of the National Electric Power Regulatory Authority (NEPRA), the Executive Director of the Higher Education Commission (HEC), a representative from the National Radio and Telecommunication Corporation (NRTC), among others. The Pakistan Environmental Protection Agency (Pak-EPA) in Islamabad will serve as the secretariat for the working group, facilitating its meetings, communications, and reporting. As per its Terms of Reference (ToRs), the working group will focus on improving e-waste collection, transportation, recycling, and disposal practices. It will also review existing environmental laws, import/export regulations, and international obligations relating to e-waste, while identifying policy, institutional, and enforcement gaps. Furthermore, the group will recommend a comprehensive national framework, including a roadmap for the development of a national e-waste management policy or regulations. It will define the roles of federal and provincial governments, regulators, the private sector, and informal recyclers in e-waste management. The group will also suggest appropriate standards, technology options, certification systems, and capacity-building initiatives aligned with global best practices. A senior official at MoCC&EC told Wealth Pakistan that e-waste has become an overwhelming issue in the country, posing serious environmental and public health risks due to unsafe disposal and informal recycling practices. He added that the ministry, in collaboration with relevant provincial departments, is making all-out efforts to address the issue, while work is also underway to conduct a baseline study to map the scale and nature of e-waste in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}