{
  "article_id": "2025-09-20_68099a4a3387ef01d51b6090eb686d8e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/3-day-book-literary-exhibition-kicks-off-in-federal-capital/",
    "retrieved_at": "2025-09-20T12:10:49.533Z"
  },
  "metadata": {
    "title": "3-day book & literary exhibition kicks off in federal capital",
    "author": null,
    "date_published": "2025-09-19T23:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 286,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 19 (APP):The three-day premier international book & literary exhibition - IBooX 2025 kicked off Friday, offering an inclusive platform for dialogue, discovery, and cultural exchange to promote reading and literary exploration within the community. IBooX 2025, jointly hosted by IndusTree and MOD Consultancy, is a free three-day literary exhibition supported by key media and city partners. It runs daily from 10 AM to 8 PM and wraps up on September 21. The event also seeks to promote and revive the reading culture, which has been declining over time. This three-day celebration promises to be a vibrant showcase of books, ideas, and culture. The event has brought together booksellers and publishers from across the country under one roof, showcasing rare and exceptional collections of books to readers. Many exhibitors are offering significant discounts on their entire range of books. This year's event is packed with activities designed for readers of all ages and interests, including a wide variety of book stalls featuring local and international publishers; seminars and panel discussions with renowned authors, scholars, and educators; book launches of upcoming titles across various genres; live theatre performances exploring literary and social themes; educational activities tailored for students and young readers; and a vibrant food court to keep visitors refreshed throughout the day. A large number of literature lovers, book collectors, students, and culture enthusiasts visited the exhibition, purchasing books of their choice. Booksellers and publishers reported an overwhelming response, with many selling out of their stock within the first day. Organized as a joint venture by IndusTree and MOD Consultancy, IBooX 2025 is supported by several prominent partners including DawnMedia (Media Partner), K1ktree (Digital Media Partner), and the CDA & Metropolitan City Islamabad (Event Partners).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}