{
  "title": "Rubina Khalid urges BISP’s beneficiaries not to trust messages from any number except ‘8171’",
  "link": "https://www.app.com.pk/national/rubina-khalid-urges-bisps-beneficiaries-not-to-trust-messages-from-any-number-except-8171/",
  "date_published": "2024-05-25T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Chairperson of the Benazir Income Support Programme (BISP), Rubina Khalid Saturday advised the beneficiaries not to trust messages received from any other number except BISP’s official number which is ‘8171’.\nShe urged the beneficiaries to visit the designated payment centres to collect their quarterly stipends and warned against trusting any number other than 8171, as other numbers are likely fraudulent and used to deceive innocent people.\nShe was speaking to the women during her visit to the BISP payment centres in Peshawar, said a news release issued here.\nRubina Khalid made a clear announcement that the total amount of the quarterly tranche issued under Benazir Kafaalat is Rs. 10,500. She advised deserving women to count and receive their full amount and to request a bank receipt.\nIn case of any deduction of the stipend or abuse by the staff, she urged beneficiaries to immediately file a complaint with the BISP helpline at 080026477.\nDuring her visit, Chairperson Rubina Khalid inspected the payment centres established at Tamash Stadium and the UC20 office in Peshawar to review the payment disbursement process to deserving women and the necessary arrangements and facilities provided to them.\nLater, Rubina Khalid also visited the BISP office in Peshawar. She instructed the staff to prioritize payments to elderly women and those with young children. She emphasized that deserving women should be informed about their amount while issuing tokens.\nThe Chairperson BISP stressed the importance of maintaining cleanliness in the office and improving arrangements for deserving women. She insisted that women be treated with respect and courtesy, warning that any misbehavior will not be tolerated.\nAddressing the staff, Rubina Khalid urged them to perform their duties honestly. She directed the concerned officers to display clear written instructions and banners to guide the beneficiaries and the general public, ensuring they do not face any difficulties.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:43:16.517Z"
}
