{
  "title": "PM commends SIFC’s role in national prosperity; urges for further collective efforts",
  "link": "https://www.app.com.pk/national/pm-commends-sifcs-role-in-national-prosperity-urges-for-further-collective-efforts/",
  "date_published": "2024-05-25T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday said that the Special Investment Facilitation Council (SIFC) was playing a critical role in country’s progress and prosperity and thanked the provincial governments for expressing their confidence in SIFC.\nAddressing a meeting of SIFC, the prime minister said that should work tirelessly to build a ‘Pakistan as perceived by their founding fathers and by acting upon the advices of Quaid-e-Azam Muhammad Ali Jinnah and Allama Muhammad Iqbal.’\nThe prime minister urged the provincial governments to further support the SIFC and move ahead in unison like a family to compensate for the losses of the past and overcome issues of poverty and hunger in the country.\nHe said that the federal government did not get enough for initiating development projects after distribution of resources among the provinces, therefore under such conditions all the governments should move together with unity.\nUpdating the members of SIFC about his recent visit to the United Arab Emirates, he said the UAE leadership had announced 10 billion dollars investment in Pakistan and expressed their complete confidence in SIFC.\nThe leadership of brotherly countries and others as well were aware of the functioning of SIFC, he observed.\nWhen SIFC was formed through legal procedures, certain concerns were expressed by a quarter but with the passage of time, its significance, efficiency and achievements had shut all kinds of criticism and everybody now fully supported its initiatives, he added.\nThe prime minister also cited his meeting with a German delegation that was also aware of the functioning of the SIFC.\nThe prime minister stressed that they should resolve today to achieve their targets as sky was the limit and would work day and night to transform Pakistan into something upon which the Pakistanis could feel pride, adding it was possible with the untiring efforts and by shedding sweat and blood.\nThe prime minister also underlined the need of capacity building and enhancing professionalism of experts in different fields.\nHe said that he had already instructed the ministries clearly to hire consultants and experts and would soon seek their feedback.\nThe prime minister said that the digitization process of the Federal Bureau of Revenue had already commenced.\nHe urged all the stakeholders to redouble their efforts and promote the local talent and industry, adding that 60 per cent population of the country comprised youth bulge, who should be trained in IT field while the natural resources worth billions of rupees lying untapped be fully utilized.\nThe prime minisiter also credited SIFC for paving way for the Reko Diq project in Balochistan province.",
  "retrievedAt": "2025-08-11T02:42:55.707Z"
}
