{
  "title": "Mohsin Naqvi seeks plan to establish ‘Safe City’ in Dasu, Chilas",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-seeks-plan-to-establish-safe-city-in-dasu-chilas/",
  "date_published": "2024-05-25T12:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Minister for Interior Mohsin Naqvi chaired a meeting regarding the establishment of the Safe City Project in Dassu and Chilas to ensure the foolproof security of Chinese and foreign nationals.\nThe minister has formed a special committee to seek a comprehensive plan in this regard and directed the committee to submit final recommendations within 15 days.\nOn this occasion, the minister said that the prime minister had directed to establish the safe city project in Dassu and Chilas. He emphasised the implementation of the project on the pattern of safe cities in Islamabad and Lahore.\nHe highlighted that the purpose of Safe City is not just to install cameras but a system that is equipped with advanced technology and artificial intelligence tools, adding that the Safe City project will ensure surveillance and security of the entire area.\nThe minister further said that Islamabad Police will provide all kinds of support in this regard. He directed that Water and Power Development Authority (WAPDA), Khyber Pakhtunkhwa Police and Islamabad Police should jointly prepare a comprehensive plan in this regard.\nThe minister also constituted a committee comprising of IG Islamabad, RPO Hazara and the representative of WAPDA. He said that it is their responsibility to ensure the security of Chinese citizens working for the progress and development of Pakistan, assuring that no effort will be spared in this regard.\nThe meeting was attended by Federal Secretary for Interior Khurram Ali Agha, Chairman WAPDA Lieutenant General (R) Sajjad Ghani, Chief Commissioner Islamabad Muhammad Ali Randhawa, and IG Islamabad Ali Nasir Rizvi. Additionally, the Additional Chief Secretary Home, Additional IG Khyber Pakhtunkhwa and RPO Hazara joined the meeting via video link.",
  "retrievedAt": "2025-08-11T02:43:16.742Z"
}
