{
  "title": "Efferts afoot to revive past glory of entertainment industry of Pakistan: Tarar",
  "link": "https://www.app.com.pk/national/efferts-afoot-to-revive-past-glory-of-entertainment-industry-of-pakistan-tarar/",
  "date_published": "2024-05-25T09:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Minister for Information, Broadcasting and Culture Attaullah Tarar on Saturday said that Pakistan had a great legacy in the entertainment industry and efforts were being made to revive that legacy.\n“We in Pakistan used to take great pride in the dramas that we used to produce which were watched the world over. We used to take great pride in the songs and films we used to produce and they were also very famous the world over,” he said while addressing the screening ceremony of “Kazakh Khanate: GoldenThrone ” drama series here.\n“Pakistan had a great legacy that I had inherited as minister for information and culture and this legacy had a great historical value”, he maintained.\n“I believe that my mission as minister would be to revive the legacy that we once had and promote cooperation between the two countries”, he added.\nAttaullah Tarar said that Pakistan and Kazakhstan enjoyed a lot of commonalities and they had deep-rooted linkages not only in culture but also in history. He said that historic relations and culture, common history and heritage brought the two nations closer.\nThe minister opined that there were a lot of common terminologies in the national languages of both countries which also brought them closer. He said as minister for information and culture, it was his responsibility to promote not only entertainment but also promote deep-rooted strategic ties between Pakistan and Kazakhstan.\n“Our deputy prime minister was in Astana just a few days back and had a significant dialogue with Kazakhstan foreign minister and dignitaries there”, he remarked.\nTarar said since he had assumed office as minister for information and culture, he had taken steps to promote the screening of films and the next target was the production of films. He said he would like to encourage the private sector to come forward in the film production field.\nThe minister said he had read the brief about “The Kazakh Khanate: The Golden Throne” which he opined would be very popular in Pakistan if it was aired by Pakistan Television in Urdu, through some agreement. It will not only be popular but also help in bringing the people of Pakistan and Kazakhstan together and to understand each other’s cultures and diversity on better terms, he added.\nHe assured the Kazakhstan ambassador that as minister for information and culture, he would take every step to promote cultural relations between the two countries and he would want to air this series on the PTV. The minister said Pakistan and Kazakhstan had memorandums of understanding (MoUs) regarding cooperation in media and he would like to see this cooperation going forward and more exchanges taking place between the two countries in the fields of media, culture and film production.\nHe said that steps were taken to produce a Pakistani series of Netflix which was currently being filmed in Italy. Moreover, a Hollywood film company was making an Urdu version of Jane Austin’s popular novel Pride and Prejudice which will highlight women’s empowerment in Pakistan.\nBesides the ventures already embarked upon, he said he would like to take this venture forward and the Ministry of Information and Broadcasting would provide all possible assistance for this purpose.\nHe said that this series tells the story of how the Kazakh state was established over the years and if it could be shown in Pakistan, people of Pakistan would be deeply interested in it. He expressed his gratitude to the Kazakhstan ambassador for providing him the opportunity to watch the screening of the series.\nHe hoped that Pakistan and Kazakhstan would move forward as partners and brothers and promote joint culture, history and entertainment for the people and betterment of both countries.",
  "retrievedAt": "2025-08-11T02:43:19.701Z"
}
