{
  "title": "Caretaker PM for road infrastructure in areas serving magnet for foreign investment",
  "link": "https://www.app.com.pk/national/caretaker-pm-for-road-infrastructure-in-areas-serving-magnet-for-foreign-investment/",
  "date_published": "2023-08-15T13:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday said that an efficient road infrastructure played a pivotal role in the development and progress of any country and stressed upon laying of road infrastructure in those areas which could attract foreign investment.\nThe caretaker prime minister chaired a meeting to review the ongoing road infrastructure projects. The meeting was attended by relevant authorities, PM Office Media Wing said in a press release.\nThe meeting was briefed in detail about the ongoing work on Pinjarra bridge on the Quetta-Sukkar highway and Sawar bridge on Quetta-Zhob road. The work on Pinjarra bridge which was damaged during last year’s flood, would commence next month.\nA causeway was constructed after the floods which restored vehicular movement. The construction period of the new bridge with 15-meter height and 12-meter width, would take about 9 months, it was further added.\nThe prime minister directed for reducing the stipulated time period for the completion of the new bridge.\nThe meeting was apprised that reconstruction and rehabilitation work on 118-km long Quetta-Dhadar road and 188-km Dhadar-Jacobabad road would be undertaken anew which would not only help in fuel saving, but also reduce the vehicular pressure.\nThe meeting was also informed about the repair work on Sawar bridge. The repair work on the 282-meter-long bridge was in the final stages while during the work, the traffic could not be diverted due to lack of alternate route.\nThe reconstruction work on the bridge would commence soon and its completion would take about 6 months.\nThe caretaker PM observed that the National Highway Authority (NHA) was playing an efficient role in the maintenance and construction of roads.\nHe emphasized upon completion of road infrastructure in Balochistan province and directed reconstruction of Karachi to Chaman highway.\nHe also asked for adoption of out of the box approach to expedite construction work because it was the responsibility of the government to provide facilities to the masses.\nThe prime minister directed the relevant authorities to expedite work on the ongoing projects on priority basis and sought briefing over the proposed projects.\nHe also asked for improving road network linking Balochistan with other provinces.",
  "retrievedAt": "2025-08-11T09:10:56.566Z"
}
