{
  "title": "PRA sets over Rs. 80 billion target of revenue collection from key sectors for current fiscal: Spokesperson",
  "link": "https://www.app.com.pk/national/pra-sets-over-rs-80-billion-target-of-revenue-collection-from-key-sectors-for-current-fiscal-spokesperson/",
  "date_published": "2023-08-15T10:33:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 15 (APP): With an overall target of Rs 240 billion, the Punjab Revenue Authority (PRA) has set an ambitious over Rs 80 billion target of revenue collection from diverse key sectors including digital platforms, Real Estate, and Hospitality for the current fiscal year against last year’s collection of Rs. 12.6 billion.\nAccording to a PRA Spokesperson, the Authority under the dynamic leadership of Chairperson Javed Badar was taking proactive measures to diversify revenue streams and strengthen fiscal resilience.\nIn this regard the focus lies on expanding tax compliance and realizing due arrears from different sectors and prominent business houses operating in the province.\nThe spokesperson further said that real estate sector had been identified as a potential source of significant revenue as over 1400 societies were operating under the jurisdiction of Lahore Development Authority (LDA) and Ravi Urban Development Authority (RUDA) covering vast area, taxable at a rate of Rs 100 per square yard.\nIn the area of property developers and promoters an ambitious revenue target of Rs  48 billion has been fixed for the fiscal year 2023-24 as compared to a meager collection of Rs 0.478 billion in 2022-23.\n“Focus is on compliance regarding revenue from services of property developers, promoters, construction, real estate management, advertisement services, janitorial services, commission agents, contractors for land and development, services provided by the property dealers, architects, town planners, landscape designers and legal professionals, attracting the withholding provisions. “\nIn the construction sector a target of Rs 14.6 billion has been fixed for the current fiscal year as compared to the previous year’s collection of Rs.4.08 billion.\nThe spokesperson told that as per LDA data, show cause notices against all major contractors, malls, housing societies, town planners, and also assessment work based on the agreements, bank statements, Financial Statements of high-rise buildings in Lahore involving tax amount of over 1 billion have been issued.\nThe spokesperson said that while concentrating upon the broadening and realization of due arrears under withholding and service provisions from digital platforms having turnover in billions with digital presence, a target of Rs. 4 billion has been set for the current fiscal year as compared to Rs. 2.45 billion revenue collection achieved during the last fiscal year.\nIn the hospitality sector, a number of popular and luxurious hotels are now under the radar of authority for withholding of construction, building maintenance, and franchise payments.\nThe tax authority has already issued show-cause notices to recover outstanding amounts of Rs. 209 million. A target of Rs. 4 billion has been set in this sector for current fiscal year as compared to last year’s collection of Rs. 2.14 billion.\nIn the Commission Agents (Corporate) sector, attention has been directed towards the data of Federal Board of Revenue (FBR) on income tax deduction of commission under Section 233 of Income Tax.\nIn this area a target of Rs. 3 billion target has been fixed for the current fiscal year as against the last year’s collection of Rs.1.5 billion.\nAccording to the spokesperson, compliance with dues is emphasized, particularly an amount of Rs 413 million for the years 2017 and 2018. Additionally, a broadening approach will extend to the commission of steel, cement, and fertilizers.\nRide-hailing services sector will now face enforcement of tax payments based on the gross value of the invoice rather than the share-basis. In the ride hailing  services  Rs. 1.5 billion target has been fixed for the current fiscal year as compared to the previous year’s collection  of  Rs. 0.89 billion.\nThe spokesperson said that various clubs were undergoing tax recovery procedures to settle arrears. Show-cause notices have also been issued to these establishments. In this domain Rs. 3 billion target has been fixed for the current fiscal year as compared to the last year’s collection of Rs. 0.42 billion.\nLeading fashion designers are also being reviewed based on their bank statements and online website operations. The tax authority seeks to ensure compliance with tax on payment gateways realizations through online sales.\nIn the area of fashion designing Rs 6 billion target has been fixed for the current fiscal year as compared to the last year’s collection of Rs 06 billion.\nThe spokesperson said that the advertising and media marketing services sector has witnessed significant growth in recent years, making it an important area for potential revenue generation. PRA has also expanded its revenue target in this sector from Rs. 0.55 billion to 2 billion.",
  "retrievedAt": "2025-08-11T09:10:44.569Z"
}
