{
  "title": "ECP directs caretakers to ensure equal opportunities for all candidates in elections",
  "link": "https://www.app.com.pk/national/ecp-directs-caretakers-to-ensure-equal-opportunities-for-all-candidates-in-elections/",
  "date_published": "2023-08-15T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): The Election Commission of Pakistan (ECP) on Tuesday instructed the interim governments, both at the national and provincial levels, to guarantee a fair and balanced playing field for all candidates and political parties in the upcoming general elections.\nThe Commission, in a notification, also banned transfers and postings of public officers to ensure transparent elections, citing Clause 2(f) of Section 230 within the Elections Act of 2017 that “prohibits the federal and provincial governments from posting or transferring any public official after the notification’s issuance without obtaining prior written approval from the ECP”.\nThe ECP also imposed a ban on all forms of recruitment within federal, provincial, and local government ministries, divisions, departments, or institutions, with only exception in cases with prior approval from the Commission.\nThe Commission also instructed the interim governments to abstain from declaring or initiating any new development projects at both the federal and provincial levels, except for those that were already in progress or approved prior to the issuance of the notification.\n“Starting from the moment the election schedule is announced, all development funds allocated for new projects within local government institutions across provinces and cantonment boards throughout the country will be halted. This pause will remain in effect until the announcement of the results of the general elections,” the notification said.\nIt specified that the interim governments were obligated to execute their roles and handle day-to-day essentials necessary to govern the federation and provinces, ensuring strict adherence to legal provisions.\nThe ECP directed the interim governments to ensure that official residences and vehicles were promptly vacated by former federal and provincial ministers, besides the withdrawal of excess security personnel from former ministers and other individuals.\nThe ECP instructed the interim authorities to disclose their assets information within three days of taking up their responsibilities. “This declaration encompasses assets and liabilities of both spouses and dependents,” the notification said.\nThe election watchdog stated that it was constitutionally responsible for organizing and conducting elections fairly and honestly, as required by Article 218(3) of the Constitution.\n“The ECP must now take essential actions according to the Constitution and existing laws to ensure the successful execution of general elections,” the notification emphasized.\nThe ECP also instructed the interim administrations at both national and provincial levels to collaborate with the it in conducting elections within legal frameworks. “This involves adhering to all the notifications, guidelines, and regulations outlined in Section 230 of the same Act.”",
  "retrievedAt": "2025-08-11T09:10:41.728Z"
}
