{
  "title": "Turkiye & Pakistan may jointly undertake global & regional missions: Lawmaker",
  "link": "https://www.app.com.pk/national/turkiye-pakistan-may-jointly-undertake-global-regional-missions-lawmaker/",
  "date_published": "2023-08-15T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Turkish lawmaker Ali Sahin has said that Turkiye and Pakistan can work together on different missions on the global and regional scales, from security to countering Islamophobia.\nAli Sahin, who heads an inter-parliamentary friendship group between Ankara and Islamabad, wrote a letter marking Pakistan’s 76th Independence Day, pointing to the “genetic” nature of the relationship between the two nations, Anadolu reported.\nNoting that Türkiye-Pakistan relations go beyond inter-state ties, the lawmaker emphasized that the relationship was unique and not common in other parts of the world.\nWhile pointing out that interests are the main foundation for international relations, Sahin said it was not the motivation between Pakistan and Türkiye.\nConsidering the military capacities, the potential to generate security, and other capabilities of Türkiye and Pakistan, he said, the two countries could build a sincere and strong model to ensure security in the region.\nHe underlined the “common genetic, social and cultural harmony that Türkiye and Pakistan have with the countries of the region, it will be seen that they have the potential to produce a very strong security for the region”.\n“Actually, the most powerful security is a security that can be achieved through peace. Instead of the artificial security need created by the West through hostility, conflict, and threats for the purpose of exploitation, establishing a regional security model centered around peace will be both more cost-effective and a much more sincere and humane security and stability model” he added.\nSahin also emphasized Türkiye and Pakistan’s potential in terms of producing Muslim solution mechanisms for problems faced by Muslims.\nHe said another mission that Türkiye and Pakistan would undertake on a global scale would be to present a model to solve the problem of Islamophobia.\nSahin said he had made a proposal to Turkish President Recep Tayyip Erdogan to open an Asian representative office based in Islamabad to develop and expand historical kinship ties with the Muslims in Pakistan and Southeast Asia.",
  "retrievedAt": "2025-08-11T09:10:52.666Z"
}
