{
  "title": "Taliban’s governance achieved semblance of stability & security: Speakers",
  "link": "https://www.app.com.pk/national/talibans-governance-achieved-semblance-of-stability-security-speakers/",
  "date_published": "2023-08-15T18:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP):Speakers at a webinar on Tuesday said along with governance structure, the Taliban rulers had achieved some semblance of stability and security, and visible pragmatism regarding the economy in Afghanistan.\nThe Centre for Afghanistan, Middle East and Africa (CAMEA) at the Institute of Strategic Studies (ISSI) hosted a webinar titled “Interim Afghan Government in Power – Two Years On”. It was moderated by Ms. Amina Khan, Director CAMEA, a news release said.\nThe speakers at the webinar included ISSI Director General Sohail Mahmood, Charge d’Affairs and Minister Counselor, Islamic Emirate of Afghanistan Sardar Ahmad Shakeeb, former Afghan Minister of Mining and Petroleum Nargis Nehan, former ambassador Ayaz Wazir, Head of Office, UNAMA Liaison Office, Islamabad Dr Malick Ceesay, Nonresident Senior Fellow Atlantic Council Omar Samad and Research Fellow at the Quincy Institute for Responsible Statecraft Adam Weinstein, and Chairman BoG, ISSI, Khalid Mahmood.\nSohail Mahmood stated that completion of two years since Kabul’s fall and the establishment of Interim Afghan Government was an important juncture to take stock. He recalled the several unanticipated developments including short timeline of eventual U.S./NATO troop withdrawal, meek response of Afghan National Security Forces (ANSF) to Taliban advances, and sudden departure of the then Afghan President that shaped the turn of events culminating in the transition of August 15, 2021.\nHe underscored Pakistan’s role in mobilization of international support for preventing a humanitarian crisis and crafting a regional response with Afghanistan’s neighbors through the establishment of six neighbouring countries platform.\nHe added that besides humanitarian assistance, unfreezing of Afghanistan’s financial assets was pivotal for building a sustainable economy in Afghanistan.\nHe noted that while territorial control had been established and security environment had improved, terrorist attacks by Daesh/ISKP had continued.\nWhile shedding light on other challenges, Sohail Mahmood pointed out that inclusive governance and girls’ education and women’s rights faced restrictions, while terrorist entities targeting Pakistan remained a concern requiring concrete steps by the Interim Afghan authorities.\nHe stressed that a peaceful, stable and prosperous Afghanistan was in the vital interest of Pakistan, while regional economic integration and connectivity – including through CPEC – would benefit all. In the wake of prevailing challenges and opportunities, he stressed the need for all actors to ensure a prudent response, constructive engagement, and win-win outcomes.\nAmina Khan stated that initially, there was lack of clarity regarding the Taliban’s return to power, but the past two years had provided significant insights into the Taliban’s approach, which could be described as a blend of authoritarian policies and pragmatism. Despite lacking formal recognition, the group had consolidated their position as the de facto and not de jure political authority.\n“In spite of shortcomings in the Taliban’s governance structure, they have achieved some semblance of stability and security, visible pragmatism regarding the economy, clamped down on corruption and reduced poppy cultivation. However, major concerns continue to persist regarding political and social cohesion, denial of basic yet fundamental human rights, and discrimination against women, further exacerbated by humanitarian crisis and presence of terrorist groups,” she added.\nShe said learning from the past mistakes was crucial as it was a rare chance for all Afghans to unite and focus on a political system that was inclusive, accountable, and one that serves the Afghan people.\nSardar Ahmad Shakeeb highlighted the interim government’s achievements in Afghanistan’s security and economy. He noted a substantial 90% reduction in poppy production and highlighted the efforts regarding drug addicts rehabilitation, which included a vocational program for drug addiction recovery.\nWhile shedding light on other achievements, he said that the economic achievements include combating food insecurity and poverty, reducing inflation from 18% to 9%, and strengthening the Afghan currency against the US dollar. Security measures also included a dedicated ports committee and women’s involvement in commerce. Diplomatically, he mentioned that there has been active engagement and high-level meetings between the current dispensation and representatives of various countries and international organisations.\nNargis Nehan stressed the importance of an inclusive government, women’s rights, and safeguarding minority rights for effective national functioning. She highlighted fundamental pre-transition institutions and urged stability through a Taliban-consensus framework, emphasizing women’s education.\nAyaz Wazir acknowledged the present peace in Afghanistan but expressed concern over human rights violations and women’s education. He proposed that a framework be established to effectively address the matter of co-education based on religious principles. He also urged trust-building between Afghanistan and Pakistan, and suggested Chinese facilitation in bridging the trust gap.\nHe also said that Pakistan’s priorities in Afghanistan required decisions that serve its own interests, rather than conforming to the models or desires of any other countries.\nDr. Malick Ceesay highlighted Afghanistan’s evolving landscape with the Taliban’s security efforts, curbing regional warlord influence and fostering local security. Despite UN and US sanctions, he also acknowledged China’s growing influence through diplomatic and economic collaborations. He emphasized challenges in recognition due to Taliban-imposed restrictions on girls’ education and women’s employment and said that a proactive response to ISKP’s presence was required.\nOmar Samad expressed that the current juncture was crucial in Afghanistan’s history, highlighting the impact on Afghan lives. He said that shared narratives involving all segments of society were essential, encompassing security, stability, counterterrorism, women’s education, and economic growth.\nHe emphasized on-ground engagement and the significance of women’s education, employment, and inclusivity. He concluded by stressing on regional countries’ respect for Afghan sovereignty.\nAdam Weinstein, while expressing his views, said,”We need to work towards more sustainable solutions.”\nWhile shedding light on some of the achievements of the Taliban, he said that the Taliban had managed the economy and infrastructure development.\nHowever, on the downside of things, he said, the ban on girls education and restrictions on their presence in work places had further plunged the Afghan women into isolation. He further said that diplomacy with the Taliban was the only way forward and concluded by saying that the Taliban must not miss this opportunity as over time, the international community will put Afghanistan on the backburner.\nDuring the Q&A session further comments were made on the issues of security, counter-terrorism, recognition, role of Afghan diaspora, nature of the resistance front, and regional and international diplomacy.\nKhalid Mahmood concluded by addressing Afghanistan’s situation, noting achievements but acknowledging international concerns on human rights, terrorism, and inclusive politics. He urged constructive dialogue over static opposition.",
  "retrievedAt": "2025-08-11T09:10:44.632Z"
}
