{
  "title": "Incredible feat as lady cop breaks record in 76km Ultra-marathon",
  "link": "https://www.app.com.pk/national/incredible-feat-as-lady-cop-breaks-record-in-76km-ultra-marathon/",
  "date_published": "2023-08-15T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Umaira Sheraz, a lady constable, from Islamabad Capital Territory Police (ICTP), has written her name in sporting history by setting a remarkable record in the Ultra-marathon held in Taxila on the eve of 76th Independence Day.\nShe covered a staggering distance of 51 kilometers (km) during the 76km long Ultra-marathon race organized by the Pakistan Road Runner International Club, coinciding with the 76th Independence Day celebrations.\nThe setting for the race was the scenic New City Phase 2 in the vicinity of Taxila.\nAs many as 32 participants, comprising both young boys and girls hailing from various corners of the city, took up the challenge which pushed participants to the limits of their physical and mental capacities.\nNotably, only 9 individuals out of the total entrants managed to complete the arduous 76-kilometer stretch.\nAmong the inspirational participants was the 12-year-old child Husnain Raza, already acclaimed as the Child South Asian Boxing Champion. Displaying a maturity beyond his years, Husnain covered an impressive distance of 43 kilometers in this test of endurance.\nFollowing closely in her brother’s footsteps, Fajar Fatima, the Asian Boxing Champion, exhibited her unwavering determination by completing an admirable 35 kilometers.\nUmaira Sheraz, the standout star of the event, shared her profound gratitude to the Almighty that guided her through the incredible journey.\nFor her, this was an inaugural foray into the realm of running an astounding 76 kilometers.\nShe said she achieved the feat without an extensive amount of preparatory practice, further cementing her place as an exemplar of dedication and natural talent.\nTalking to APP on Tuesday, Umaira Sheraz expressed her belief in the potential of girls to excel across diverse domains, emphasizing the pivotal role of physical activity in nurturing both fitness and national pride.\nThe instrumental figure in Umaira’s journey, Coach Jamal, also expressed his jubilation at his student’s triumph.\nHe urged all female athletes to embrace rigorous training and earnest dedication to represent the nation on the international stage.",
  "retrievedAt": "2025-08-11T09:10:53.431Z"
}
