{
  "article_id": "2025-01-03_02e9f2b7484844dabfbd589b16605f1c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nsu-islamabad-bid-farewell-to-female-graduates/",
    "retrieved_at": "2025-08-27T11:18:57.935Z"
  },
  "metadata": {
    "title": "NSU Islamabad bid farewell to female graduates",
    "author": null,
    "date_published": "2025-01-03T11:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 296,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 03 (APP):National Skills University (NSU) Friday hosted a special ceremony to bid farewell to its outgoing female students from various technology programs. These students, who have excelled in their respective fields, were praised for their dedication and hard work. Prof. Dr. Muhammad Mukhtar, the Founding Vice Chancellor of NSU, highlighted the pivotal role of women in shaping the nation's future,describing daughters as blessings from Allah. Speaking at the newly established Noo-E-Ilahi Garden, a dedicated and secure space for female students within the university premises, Prof. Mukhtar emphasised, \"Daughters, like sons, are blessings from God, and as a fatherly figure, I am immensely proud to see daughters from across the country thriving in technology programs at the NSU. These young women are the nation's future and will play a vital role in the country's much-needed, technologically skilled workforce.\" The Noo-E-Ilahi Garden, strategically situated in front of the girls' hostels, represents a landmark initiative in fostering inclusivity and creating a nurturing environment for female students. The garden, with its lush greenery and serene atmosphere, is dedicated exclusively to the university's female students. It is equipped with seating areas, study spots, and recreational facilities, encouraging them to connect and collaborate within a safe and serene setting. The farewell ceremony, organised by junior students, was a vibrant affair filled with joy and camaraderie. Zara Obaid, the hostel warden, commended the university administration for its forward-thinking approach. \"Having a specified, secure space solely for girls and female faculty members is a unique and empowering initiative. It reflects the administration's commitment to the well-being of its female students.\" The farewell ceremony, organised by junior students, was a vibrant affair filled with joy and camaraderie. The event reflected the university's emphasis on fostering a culture of respect, collaboration, and mutual appreciation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}