{
  "article_id": "2025-01-03_787abe094eedda851f8a48d0ea560127",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/scp-disposed-off-7482-cases-in-two-months/",
    "retrieved_at": "2025-08-27T11:18:21.604Z"
  },
  "metadata": {
    "title": "SCP disposed off 7482 cases in two months",
    "author": null,
    "date_published": "2025-01-03T15:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 271,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 03 (APP):Under the leadership of Chief Justice Mr. Justice Yahya Afridi, the Supreme Court of Pakistan has gained momentum in fast-tracking cases disposal from October 28, 2024, to January 3, 2025, the Court disposed off 7482 cases, against new institution of 2,950 cases during the period. The Chief Justice and Judges of the Supreme Court have worked relentlessly to ensure that the highest court of the country remains responsive to the needs of the public. Chief Justice Yahya Afridi has placed a strong emphasis on judicial reforms to enhance the performance, efficiency, and transparency of the judiciary. Advanced information technology systems are being integrated to streamline administrative workflows, optimize case tracking, facilitate faster decision-making, and improvements in case management processes with a focus on litigants' facilitation by introducing e-Affidavit and instant certified copies. Mechanisms for collecting feedback from stakeholders, including legal practitioners, litigants, and civil society organizations, have been introduced. These initiatives aim to make the judiciary more accountable, accessible, and responsive to the needs of the public. Recognizing the critical role of the district judiciary as the first point of contact for litigants, Chief Justice Yahya Afridi personally visited remote districts across the country. These visits were aimed at assessing the state of justice delivery at the grassroots level, identifying challenges faced by district courts, and exploring ways to enhance their efficiency. The district judiciary not only forms the backbone of the justice system but also plays a pivotal role in shaping public trust and confidence in the judiciary. Efforts are underway to strengthen its capacity, address resource gaps, and ensure equitable access to justice for all citizens.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}