{
  "article_id": "2025-01-03_a2c3170f165ff98a13e3588b767bf13e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-body-for-tweaks-in-access-to-information-act/",
    "retrieved_at": "2025-08-27T11:18:21.415Z"
  },
  "metadata": {
    "title": "Senate body for tweaks in Access to Information Act",
    "author": null,
    "date_published": "2025-01-03T15:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 372,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 3 (APP):The Standing Committee of Senate on Information and Broadcasting has asked the relevant ministry to furnish a report on possible amendments in the Pakistan Right of Access to Information Act, 2017 with the consultation of the concerned authorities. Presiding over the Senate Panel, Senator Ali Zafar passed the directives after all the members concluded comprehensive discussion on the public petition referred by the Chairman Senate regarding amendments in the Access to Information Act. At the outset of the meeting, Director General Operations Broadcast/Media, Muhammad Tahir briefed the committee about the overall functions, operations and the performance of the Pakistan Electronic Media Authority (PEMRA) since its inception. The Committee was apprised that PEMRA under the Act had been mandated to facilitate and regulate electronic media. The Director General apprised the Committee about the organizational structure of the Authority, composition of PEMRA Board and Council of Complaints. Director General (Licensing-Broadcast) Wakeel Khan informed the committee about the issuance of licenses for broadcast and distribution services. The authority has so far issued 142 licenses for Satellite TV channels including 37 for news and current affairs. While 235 licenses for FM radio have been issued including 175 commercial and 60 non-commercial, he added. Discussing another agenda item, regarding censor policy, Chairman Committee said freedom of expression is a national issue and it should not be limited to any person. He said every parliamentarian is entitled to be covered and every speech in Parliament deserves coverage and this issue has come up in the Senate several times. Secretary Ministry of Information and Broadcasting who is also MD PTV apprised the committee that this issue may be occurred due to technical glitch. The committee directed the authorities' concerned to make sure that such technical issue could not happen again in future. While discussing the issues related to pensions, the committee sought a report within ten days regarding the payment of pensions to pensioners of Radio Pakistan and PTV. The meeting was attended by Secretary Information and Broadcasting Ms. Ambreen Jan, Chairman PEMRA Muhammad Saleem Baig, DG (IP) Ashique Hussain, Joint Secretary M/o Information and Broadcasting, Pemra officials, members of the committee, Senator Pervaiz Rashid, Senator Jan Muhammad, Senator Aon Abbas, Senator Sarmad Ali and others.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}