{
  "title": "PM visits low-cost housing project; appreciates fast pace of construction",
  "link": "https://www.app.com.pk/national/pm-visits-low-cost-housing-project-appreciates-fast-pace-of-construction/",
  "date_published": "2021-11-19T06:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP): Prime Minister Imran Khan on Friday visited the site of 4400 under-construction houses under the Naya Pakistan Housing Project and said it was for the first time that the people who could never afford, could now own a house of their own.\n“No government in the past cared for the low-income segment of the society, who had no shelter,” Imran Khan said after visiting the construction site at Farash Town, in the suburbs of Islamabad.\nAround 4400 apartments are being constructed in collaboration with CDA, Naya Pakistan Housing and Development Authority and FWO at a very fast pace. The Prime Minister was given a detailed briefing and informed that the pace of the project was according to the schedule. Prime Minister Imran Khan had performed ground-breaking of the project in April this year.\nThe apartments were being constructed on 70 kanals of land and out of these 2000 houses have been reserved for low-income groups registered under the Naya Pakistan Housing, 400 were for the slum dwellers and 2000 for middle income and salaried class people. The entire project would cost Rs 15.3 billion.\nIn his address, the Prime Minister regretted that the previous governments did not pay heed to the basic needs of people including affordable housing. He said the banks were asked to provide mortgages to the people to help them construct a house of their choice. He pointed that currently, the mortgage facility in India was 10 per cent, 30 per cent in Malaysia 30, while it was around 80 per cent in the West.\nHowever, in Pakistan, it was zero and it took two years to make foreclosure laws of banks aimed at facilitating the general public in the construction of houses. He said the government, besides undertaking the construction was also providing a subsidy of Rs 300,000 for each house and providing loans at a very small markup. A sum of Rs 30 Bn has been allocated for this purpose, he added.\n“It is our effort that the people have to pay less every month, almost equivalent to what they pay for monthly rent,” he said.\nThe Prime Minister said the markup subsidy scheme; offered long term housing finance of up to 20 years, on as low as 2% service charges for the first five years to the low-income people. The middle-income people can get housing finance for 5 Marla houses on 5% markup for the first five years and for 10 Marla houses on 7% markup for the first five years. A sum of Rs 35 Bn has been allocated for the first phase of this schemeHe said the government offered 90 per cent exemption on taxes on the construction sector and said despite the negative impact of Covid19 all over the world, Pakistan was one of the few countries as it kept its construction sector open and the people had an opportunity to earn their livelihood.\nHe said the banks have applications in process amounting to around Rs 226 billion, while the cases for Rs 90 billion have been approved, while Rs 24 billion has been disbursed.\nHe said currently 100,000 houses were under construction he said it took almost two years to put in place a structure that can take up this difficult task. However, now the Naya Pakistan Authority was fully functional to plan and execute the objective of construction of low-cost houses.\nImran Khan said 52,500 Housing Units were under construction, out of which 20,000 have already been delivered through Akhuwat and Workers Welfare Fund. He said 104 projects comprising 307,000 housing units were under evaluation and processing whereas work on 45,133 housing units has either started or was in the final stages of planning.",
  "retrievedAt": "2025-08-11T21:38:16.395Z"
}
