{
  "title": "Sikh Yatrees thank Pakistan for Kartarpur Corridor; warm reception",
  "link": "https://www.app.com.pk/national/sikh-yatrees-thank-pakistan-for-kartarpur-corridor-warm-reception/",
  "date_published": "2021-11-19T18:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP): The Sikh Yatrees attending the 552nd birth anniversary celebrations of Guru Nanak Dev Ji, Friday spoke high of the Pakistan government for easing access to their holiest site of Gurdwara Darbar Sahib by establishing the Kartarpur Corridor.\nAs the celebrations of the Sikhism founder’s birth anniversary started, Sikh pilgrims from across the world continued pouring in Pakistan.\nThe high-level government functionaries are receiving the pilgrims and overseeing the arrangements to ensure a safe and pleasant stay of the guests in Pakistan.\n“Wishing 552nd Guru Nanak Dev Ji Jayanti to all Sikhs around the world. On this auspicious occasion, we welcome thousands of Sikhs to visit their religious sites in Pakistan,” Prime Minister Imran Khan said on Twitter.\nOn prime minister’s behalf, Federal Minister for Religious Affairs and Interfaith Harmony Dr Pir Noor-ul-Haq Qadri reached Nankana Sahib to welcome the Sikh pilgrims, reiterating the Pakistan Tehreek-i-Insaf (PTI) government’s resolve for maximum facilitation to the Yatrees.\nSpeaking on the occasion, he said the government was going to establish Baba Guru Nanak University in Nankana Sahib, which would bring the Muslims and Sikhs closer to each other, adding Pakistan was the land of respect for the whole Sikh community.\nNoor-ul-Haq Qadri said all facilities were being provided to the Sikh pilgrim during their stay in Pakistan and the government was making sincere efforts to maintain an atmosphere of interfaith harmony in the country.\nFederal Minister for Narcotics Control Ijaz Ahmed Shah, in his address, extended a warm welcome to the Sikh pilgrims and said that the opening of the Kartarpur Corridor from the Indian side was a great achievement.\n“Serving the Sikh pilgrims is a matter of pride for the people of Pakistan,” he added.\nHe said all religious minorities living in Pakistan had complete freedom to practice their religions, adding that minorities’ issues and complaints were being solved on priority basis.\nTalking to media, a Sikh Yatree said they were fed negative stories about Pakistan in India. But the way they were received had falsified all those notions.\n“We got impressed by the way government and people of Pakistan showed us their love… We are convinced that the people there (across the border) told a lie. Pakistan is not like that,” a Sikh Yatree told a private television channel.\nTalking to Radio Pakistan, President All India Sikh Student Federation Women Wing Mandeep Kaur Sindhu thanked Prime Minister Imran Khan for establishing the Kartarpur Corridor and easing their approach to their holy site. She was also thankful for the people and the government for impressive arrangements and warm hospitality.\nIn a statement on the birth anniversary of Baba Guru Nanak, Minister of State for Information and Broadcasting Farrukh Habib said providing basic rights to minorities and protection of their life and property was among the priorities of PTI government.\nHe said Pakistan would provide all possible facilities to Sikh pilgrims during their stay in Pakistan, adding, the establishment of Kartarpur Corridor was a gift of the present government to the Sikh community.\nSpecial Assistant to Chief Minister (SACM) Punjab and Spokesperson for Punjab Government Hasaan Khawar congratulated the Sikh community on the 552nd birth anniversary of Baba Guru Nanak and termed the reopening of Kartarpur Corridor after effective tackling of the coronavirus a ‘double happiness.’",
  "retrievedAt": "2025-08-11T21:38:14.008Z"
}
