{
  "article_id": "2025-04-26_b4fac69a48c4cee6c5164aa5ff0ebf66",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/irfan-siddiqui-slams-india-as-slaughterhouse-for-minorities/",
    "retrieved_at": "2025-08-27T14:55:12.427Z"
  },
  "metadata": {
    "title": "Irfan Siddiqui slams India as ‘Slaughterhouse’ for Minorities",
    "author": null,
    "date_published": "2025-04-26T10:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 26 (APP): Parliamentary leader PML-N Irfan Siddiqui on Saturday fiercely criticized India's human rights abuses against Muslims and minorities, terming it a major slaughterhouse and alleging the Pahalgam attack was a false flag operation. In an exclusive message with PTV News, Irfan Siddiqui stated that India, under Prime Minister Modi' s leadership has deviated from its democratic roots and is now emulating Israel's policies, particularly in Indian-occupied Jammu and Kashmir (IIOJK), where he fears it may create a situation akin to Palestine and Gaza. Siddiqui strongly criticized India for issuing an empty threat to cut off Pakistan's water supply, condemning its aggressive behavior. PML-N's Irfan Siddiqui further issued a stern warning, vowing that any attempt to cut off Pakistan's water supply would be met with a fierce response equivalent to a declaration of war. Irfan Siddiqui emphasized that in the face of such aggression, the nation stands united, stressing that every citizen is resolute in their determination to defend the country's sovereignty and integrity. He declared, \"We will not tolerate any threat to our nation's security and will respond with full force to protect our people and our land.\" Siddiqui asserted, \"We are not intimidated or cowed instead, we will confront any threat head-on and fiercely protect our nation's honor and sovereignty.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}