{
  "article_id": "2025-04-26_e9b9eb014c12b497343d1ec93dcffd6f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ministers-launches-complaint-cell-to-ensure-transparency-in-maritime-sector/",
    "retrieved_at": "2025-08-27T14:55:41.673Z"
  },
  "metadata": {
    "title": "Minister launches complaint cell to ensure transparency in maritime sector",
    "author": null,
    "date_published": "2025-04-26T07:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 257,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 26 (APP):Federal Minister for Maritime Affairs, Muhammad Junaid Anwar Chaudhury, on Saturday launched a complaint cell aimed at key component of the upcoming comprehensive reforms agenda in maritime sector for promoting transparency and ensuring faster delivery of public services.In line with the vision of Prime Minister Muhammad Shehbaz Sharif, Junaid Anwar Chaudhry launched the complaint cell, which is a new platform dedicated to receiving public grievances and suggestions related to maritime affairs, said a press release.At the inauguration of complaint cell, the minister stated that the launch reflects the vision of the prime minister, who has emphasized the importance of open communication between government institutions and the public.He said, \"This complaint cell demonstrates the government's commitment to good governance and public service, acting as a bridge between the ministry and all stakeholders, including citizens, seafarers, port users, and investors.\"Through the minister's complaint cell, individuals can now lodge complaints, highlight issues, or offer constructive suggestions regarding maritime operations, port management, shipping policies, and other areas falling under the ministry's jurisdiction. The feedback collected will help in policy refinement, service improvement, and quick resolution of legitimate concerns.Junaid Chaudhry said this initiative is aimed at promoting transparency, accountability, and greater stakeholder engagement in maritime governance.The complaint cell will be available online through the ministry's official website and accessible via email and phone. A dedicated team will ensure timely responses and effective follow-ups.The federal minister noted this step marks a significant milestone in the ministry's efforts to modernize and make the country's maritime sector more efficient, people-centric, and responsive.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}