{
  "title": "Independence Day of Pakistan: A zenith of Muslims’ epic struggle for separate homeland",
  "link": "https://www.app.com.pk/features/independence-day-of-pakistan-a-zenith-of-muslims-epic-struggle-for-separate-homeland/",
  "date_published": "2021-08-13T13:11:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 13 (APP): Faced with disparity, discrimination and dejection after 1857 debacle, the Muslims of sub-continent were subjected to an intellectual, political and educational decay after colonial rulers’ strengthened grip on united India and tilted towards socio-economic and educational empowerment of Hindus as they considered Muslims their rivals following snatching of power from them under the guise of East India Company.\nAfter failure of 1857 War of Independence, the Muslims of British India were given a new hope and direction by great educationist and social reformer, Sir Syed Ahmed Khan, who instilled a new vigour into Muslims after an inspired teachings of the renowned religious leaders,Mojadad Alf Sani and Shah Waliullah.\nSir Syed had brought about an intellectual revolution among Muslims through his educational, political and social reforms besides nullifying the malicious propaganda of colonial rulers, Hindus and pessimist forces during an era of ominous, discrimination and oppression.\nWhile taking cognizance of the socioeconomic and educational decay of oppressed Muslims, Sir Syed founded All India Muhammadan Educational Conference (AIMEC) Aligarh in 1886, which carried forward his vision regarding modern education, socio-economic empowerment and political unity of Muslims to regain past glory.\nThe network of educational institutions and political unity organized under AIMEC had enabled millions of Muslims to compete with other communities including Hindus and provided a launching pad for Muslims to initiate a political and democratic struggle for a separate homeland in the subcontinent.\nSir Syed’s reforms had excelled Muslims in education, social, economic and political sciences, resultantly their voices have strongly been heard by British rulers.\nUnder the flag of All India Muslim League (AIML) founded on December 30, 1906 at Dhaka, the Muslims got united by giving new impetus to independence movement.\nIt witnessed further momentum after Quaid e Azam spearheaded independence movement after formally joining AIML in 1913 and outlining of an independent state for Muslims majority provinces in north western India by great poet philosopher Dr. Allama Muhammad Iqbal during historic Allahabad address in 1930.\nThus, Dr. Allama Iqbal became the first politician to articulate about the two nation-theory that Muslims were a distinct nation and deserved political independence from other regions and communities of the united India.\nAllahabad address had set a clear direction to the great Quaid, who united millions of Muslims at Iqbal Park Lahore on March 23, 1940 where the historic Pakistan’s Resolution was passed.\nFollowing adoption of the Pakistan Resolution, Quaid-e-Azam had reorganized AIML on modern lines and made repeated visits to all Muslims majority provinces including KP (earlier called NWFP) to mobilize masses for the creation of Pakistan.\n“The legendary Quaid had received a historic welcome when he visited Khyber Pakthunkhwa and Islamia College Peshawar (ICP) in 1945 where a sea of people from KP and Merged Areas (erstwhile Fata) arrived to see his few glimpses,’ said Younas Khan, Chairman, Pakistan Studies Department, ICP, while talking to APP.\nHe said it was the love of the people of KP with Quaid- e- Azam that AIML secured over 50 seats in the province during 1946 elections and after that historic victory, nobody could stop the independence movement from KP.\nAs a result of the strong commitment and dedicated political struggle by the Muslims under leadership of Quaid e Azam, Pakistan came into being on August 14, 1947 within seven years after adoption of the Pakistan Resolution on March 23, 1940.\n“The history of the Pakistan Movement is incomplete without mentioning the role of ICP’s students,” Younas Khan said, adding the great Quaid visited ICP in 1936, 1945 and 1948 to acknowledge the outstanding role of its students for Pakistan.\nOn April 12, 1948, Quaid-e-Azam visited ICP as Governor General of Pakistan where he presented glowing tributes to the services of its students towards making Pakistan in these words. “I am indeed very happy to be present here today and to have the privilege of addressing students of this great Darul Uloom, who are the future builders of Pakistan.”\n“Remember your government is like your own garden. Your garden flourishes by the way you look after it and the efforts that you put towards its improvement. Similarly, your government can only flourish by your patriotic, honest and constructive efforts to improve it,” Quaid e Azam told students.\nHe wished to construct a university near ICP that was fulfilled by the Government within a gap of one year by establishing University of Peshawar in 1949.\nQuaid had an immense love for tribesmen of merged tribal districts (Erstwhile FATA) for their strong commitment, loyalty, supreme sacrifices and consistent support during the Pakistan Movement that was acknowledged by him during his address at Grand Tribal Jira at Governor House, Peshawar on April 17, 1948.\nThe Founder of Pakistan laid great emphasis on education and socio- economic development of tribesmen and considered technical education, science and technology as prerequisites for attaining goals of development and economic prosperity.\nManzoorul Haq, former ambassador said that 14th August was a significant day to remind the heroic struggle of Muslims of the sub-continent for a separate homeland where they could live with freedom, dignity and harmony according to their religious, social and cultural values.\nHe said, “It is a day to pay rich tributes to our forefathers, who underwent great trial and tribulation during the Pakistan Movement for the sake of our prosperous and secure future.”\nMeanwhile, independence day preparations have reached the climax in KP where Government departments and private organizations besides educational institutions planned special programs including flags hoisting ceremonies, declamation contests, sports and art competitions in connection with Jashin-e- Azadi.\nThe celebrations would formally start with 21-gun salutes at the provincial capital on August 14.\nNational flags are hoisted on all major Government and private buildings including historic Balahisar Fort, Governor House, Chief Minister House, Chief Secretary and IGP Offices, Islamia College Peshawar, University of Peshawar, High Court,, PTV, Radio Pakistan, KP Assembly, Peshawar Development Authority, Rescue 1122, Ghanta Ghar and Frontier Constabulary Headquarters that were artistically illuminated looking festive at nights.\n“My joy is doubled after seeing hoisting of national flags everywhere in KP especially in Peshawar where all major buildings, markets and bazaars are beautifully decorated with colourful lights and buntings on occasion of Jashin e Azadi,” said Malaika Khan, a Grade-III student of a private school and a resident of Nowshera district while talking to APP.\nHolding her father’s hand at Qissa Khwani bazaar flooded with national flags, she said, “I purchased 500 national flags, green stickers, badges and models of ICP and Minar e Pakistan for myself, relatives and friends to celebrate independence day in most befitting manner.\nLike Malaika Khan, hundreds of thousands of children have purchased national flags, green stickers, badges, caps, models of historical buildings and portraits of heroes of Pakistan Movement to express their love for their motherland.",
  "retrievedAt": "2025-08-11T21:04:39.005Z"
}
