{
  "title": "COVID-19 deaths jump to 79 on Friday, 4618 more tested positive",
  "link": "https://www.app.com.pk/national/covid-19-deaths-jump-to-79-on-friday-4618-more-tested-positive/",
  "date_published": "2021-08-13T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP): The national tally on Friday of total deaths was recorded 79, with 4619 more people tested positive for the deadly virus during the last 24 hours.\nThe total active coronavirus cases in Pakistan reached to 86,236 as of 13 August , according to the latest update issued by the National command and Operation Centre (NCOC).\nOut of total 79 corona patients who died during past 24 hours, 74 of whom were under treatment in hospital and five out of the hospital in their respective quarantines or homes.\nDuring the last 24 hours most of the deaths had occurred in Sindh followed by the Khyber-Pakhtunkhwa. Out of the total 79 deaths occurred during last 24 hours, 38 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 43 percent, Islamabad Capital Territory (ICT) 43 percent, Peshawar 37 percent and Bahawalpur 40 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Abottabad 76 percent, Islamabad 43 percent, Gujranwala 41 percent and Karachi 60 percent.\nAround 456 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan.\nSome 59,504 tests were conducted across the country on Thursday, including 21,430 in Sindh, 19,017 in Punjab, 10,013 in Khyber Pakhtunkhwa (KP), 5,416 in Islamabad Capital Territory (ICT), 1,294 in Balochistan, 962 in GB, and 1372 in AJK.\nAround 979,411 people have recovered from the disease so far across Pakistan making it a significant count.\nSince the pandemic outbreak, a total of 1,089,913 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 28,654, Balochistan 31,396, GB 9,137, ICT 92,768, KP 150,708, Punjab 369,358 and Sindh 407,892.\nAbout 24, 266 deaths were recorded in country since the eruption of the contagion. Around 6,355 have perished in Sindh, out of which 37 died in hospital and two out of hospital on Thursday.\n11,307 in Punjab out of which 12 deaths occured in hospital and three out of hospital during past 24 hours.\n4,624 in KP, where 20 of them died in hospital on Thursday, 827 in ICT among three deaths in hospital during past 24 hours, 332 in Balochistan, 161 in GB and 660 in AJK succumbed to the deadly virus out of which two were died in hospital on Thursday.\nA total of 16,735,031 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 5,095 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T21:04:38.974Z"
}
