{
  "title": "Russia faces tariffs in 10 days if no progress on ending Ukraine war: Trump - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Tuesday that the US would start imposing tariffs and other measures on Russia “10 days from today” if Moscow showed no progress toward ending its more than three-year-long war in Ukraine.\n\nTrump first announced on Monday that he was shortening the initial 50-day deadline he set a month ago for action from Moscow, and mentioned a new deadline of 10 to 12 days. On Tuesday, he told reporters he had not heard a response from Russia.\n\nSpeaking aboard Air Force One, Trump said he was not worried about the potential impact of Russian sanctions on the oil market or prices, vowing to boost domestic oil production to offset any impact.\n\n“I don’t know if it’s going to affect Russia, because [Russian President Vladimir Putin] wants to, obviously, probably keep the war going,” Trump said. “But we’re going to put on tariffs and the various things that you put on.”\n\nThe US president, who has in the past spoken about having a good relationship with Putin, has grown increasingly frustrated with Moscow’s refusal to agree to a ceasefire. The fresh deadline suggests Trump is prepared to move forward on his threat of sanctions, after previously hesitating on doing so.\n\nSpeaking in Scotland on Monday, he threatened sanctions on both Russia and buyers of its exports — also known as secondary sanctions — unless progress is made.\n\nUS Treasury Secretary Scott Bessent told reporters that he raised the issue of secondary sanctions with Chinese officials during two days of bilateral talks this week. He said he told Chinese officials that Beijing could face high tariffs if it continued its Russian oil purchases.\n\nIn a post on X, former Russian president Dmitry Medvedev, a close ally of Putin, said Trump was playing “a game of ultimatums” that could lead to a war involving the United States.\n\nThe Kremlin said it continues to monitor statements by Trump regarding sanctions against Moscow, but that Russia had acquired immunity to such measures thanks to long experience.\n\n“We have been living under a huge number of sanctions for quite a long time, our economy operates under a huge number of restrictions,” Kremlin spokesman Dmitry Peskov told reporters.\n\n“Therefore, of course, we have already developed a certain immunity in this regard, and we continue to note all statements that come from President Trump, from other international representatives on this matter.”\n\nRussian Foreign Ministry spokeswoman Maria Zakharova called the threat of new sanctions “routine” and said it was odd that the US and the West had not yet understood that imposing such measures did not work and only served to hurt Western economies.\n\n“We see that the West simply cannot let go of the issue of sanctions. It seems as if they are constantly stuck in a rut,” Zakharova told a news briefing in Moscow.\n\n“Apparently, there are no other options left — they have been exhausted. We are responding and taking measures to counteract all of this or even turn it to our own advantage.”\n\nTrump, who is also struggling to achieve a peace deal in Gaza, has touted his role in ending conflicts between India and Pakistan as well as Rwanda and Congo. Before returning to the White House in January, Trump campaigned on a promise to end Russia’s conflict with Ukraine in a day.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/30172916247f9b0.jpg",
  "retrievedAt": "2025-08-17T21:43:05.664Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927617/russia-faces-tariffs-in-10-days-if-no-progress-on-ending-ukraine-war-trump",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T12:36:27.000Z"
}
