{
  "title": "Dozens stranded in Gabd due to Iran border closure - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Dozens of students enrolled in different religious schools in Iran have been stranded at the Gabd border for two days, waiting to cross over.\n\nSome of them returned to the country during Muha­­rram, others had fled the Iran-Israel war a month ago; and nearly all of them possess valid travel documents issued by the Iranian government. But the border crossing, located almost 70km from the port city of Gwadar, has remained closed since the Iran-Israel conflict broke out.\n\nThe stranded individuals have been staying in hotels and other lodgings, while immigration officials await ‘fresh orders’ to process their exit. The recent bar on travelling to Iraq and Iran by road has only complicated matters.\n\nAn official of the Federal Investigation Agency (FIA), posted at the Gabd border, said the students had valid travel documents, but they could not be allowed to cross, as the border was still closed.\n\n“No fresh order has been issued by the Pakistani authorities concerned for opening the border with Iran (after the war ended),” FIA Deputy Director Asif Naseem told Dawn.\n\nHe said that in addition to the earlier closure, a recent decision by the government to ban road travel during Chehlum had also imposed restrictions on such travel. The FIA official said the students could travel to their destination by air.\n\nLast week, the Iranian embassy in Islamabad issued guidelines for pilgrims, saying the land entry would be subject to the approval of the Pakistani government. A day later, the government said no such travel would be allowed on account of security concerns.\n\nHowever, it did not specify if the ban pertained to the Chehlum pilgrims or applied to all travellers entering Iran. In any case, land crossings with Iran haven’t re-opened since the war.\n\n“More than 50 students, some with families, are stuck at the Gabad border, while hundreds more are waiting in Karachi and other towns, as Pakistani immigration officials claim they have received no instructions to process their exit,” said Maulana Ali Anwar, brother of one of the stranded students.\n\nTalking to Dawn, Mr Anwar, who is also a Majlis Wahdat-i-Musl­imeen (MWM) office-bearer, said his brother was stuck at Gabad. He added that many other students had been staying in Karachi and other cities after receiving the news about the stranded students.\n\nAccording to Mr Anwar, the students, having Iqama, return to their native areas every year during the Muharram holidays and start returning to Iran in the Islamic month of Safar.\n\n‘Arrangements being made’\n\nOn the other hand, Minister of State for Interior Tallal Chaudhry told Dawn that arrangements were being made to facilitate “some 30 to 40 students” stranded at the Pak-Iran border. Jus­tifying the ban concerning land pilgrimage to Iran and Iraq, he claimed it was meant to facilitate Zaireen.\n\nAccording to the minister, the government will introduce fundamental changes by August 31 to regulate pilgrimage to Iran and Iraq on the pattern of Haj and Umrah.\n\nAsked to comment on fears that the ‘tour operator mafia’ would be the ultimate beneficiary of this policy, he said hundreds of operators would be registered under an open and transparent policy, noting that healthy competition would benefit the pilgrims. “It is a successful model in many parts of the world,” he remarked.\n\nHe said Pakistan, Iran, and Iraq were in the process of formulating a joint strategy to facilitate pilgrims, adding that the interior secretary would soon pay a visit to the two countries for follow-up meetings with the relevant authorities. He also revealed that a ship service for pilgrims was being mulled.\n\nIftikhar A. Khan and Kalbe Ali in Islamabad also contributed to this report\n\nPublished in Dawn, July 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/15202848515d116.jpg?r=202911",
  "retrievedAt": "2025-08-17T21:46:13.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927475/dozens-stranded-in-gabd-due-to-iran-border-closure",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T00:52:20.000Z"
}
