{
  "title": "US, India launch powerful Earth-monitoring satellite - World - DAWN.COM",
  "author": null,
  "content": "A formidable new radar satellite jointly developed by the United States and India launched on Wednesday, designed to track subtle changes in Earth’s land and ice surfaces and help predict both natural and human-caused hazards.\n\nDubbed NISAR (Nasa-ISRO Synthetic Aperture Radar), the pickup truck-sized spacecraft blasted off around 5:40pm (5:10pm PKT) from the Satish Dhawan Space Centre on India’s southeastern coast, riding an ISRO Geosynchronous Satellite Launch Vehicle rocket.\n\nA livestream of the event showed excited schoolchildren brought to watch the launch and mission teams erupting in cheers and hugging.\n\nHighly anticipated by scientists, the mission has also been hailed by US President Donald Trump and Indian Prime Minister Narendra Modi as a milestone in growing cooperation between the two countries.\n\n“Congratulations India!” Dr Jitendra Singh, India’s science and technology minister, wrote on X, calling the mission a “game changer”.\n\n“Our planet’s surface undergoes constant and meaningful change,” Karen St Germain, director of Nasa’s Earth Science Division, told reporters ahead of launch. “Some change happens slowly. Some happens abruptly. Some changes are large, while some are subtle.”\n\nBy picking up on tiny shifts in the vertical movement of the Earth’s surface — as little as one centimetre — scientists will be able to detect the precursors for natural and human-caused disasters, from earthquakes, landslides and volcanoes to ageing infrastructure like dams and bridges.\n\n“We’ll see land substance and swelling, movement, deformation and melting of mountain glaciers and ice sheets covering both Greenland and Antarctica, and of course, we’ll see wildfires,” added St Germain, calling NISAR “the most sophisticated radar we’ve ever built”.\n\nIndia in particular is interested in studying its coastal and nearby ocean areas by tracking yearly changes in the shape of the sea floor near river deltas and how shorelines are growing or shrinking.\n\nData will also be used to help guide agricultural policy by mapping crop growth, tracking plant health, and monitoring soil moisture.\n\nIn the coming weeks, the spacecraft will begin an approximately 90-day commissioning phase during which it will unfurl its 12-metre radar antenna reflector.\n\nOnce operational, NISAR will record nearly all of Earth’s land and ice twice every 12 days from an altitude of 747 kilometres, circling the planet near the poles rather than around the equator.\n\nAs it orbits, the satellite will continuously transmit microwaves and receive echoes from the surface.\n\nBecause the spacecraft is moving, the returning signals are distorted, but computer processing will reassemble them to produce detailed, high-resolution images.\n\nAchieving similar results with traditional radar would require an impractically large 12-mile-wide dish.\n\nNISAR will operate on two radar frequencies: L-band and S-band. The L-band is ideal for sensing taller vegetation like trees, while the S-band enables more accurate readings of shorter plants such as bushes and shrubs.\n\nNasa’s Jet Propulsion Laboratory and India’s ISRO shared the workload, each building components on opposite sides of the planet before integrating and testing the spacecraft at ISRO’s Satellite Integration and Testing Establishment in the southern Indian city of Bengaluru.\n\nNasa’s contribution came to just under $1.2 billion, while ISRO’s costs were around $90 million.\n\nIndia’s space programme has made major strides in recent years, including placing a probe in Mars orbit in 2014 and landing a robot and rover on the Moon in 2023.\n\nShubhanshu Shukla, a test pilot with the Indian Air Force, recently became the second Indian to travel to space and the first to reach the International Space Station — a key step toward India’s own indigenous crewed mission planned for 2027 under the Gaganyaan (“sky craft”) programme.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/30233408394f01f.jpg",
  "retrievedAt": "2025-08-17T21:42:41.525Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927641/us-india-launch-powerful-earth-monitoring-satellite",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T18:35:05.000Z"
}
