{
  "title": "France brands Israeli settler violence as ‘terrorism’ - World - DAWN.COM",
  "author": null,
  "content": "PARIS: France on Tuesday condemned the “murder” in the West Bank of a Palestinian activist who contributed to an Oscar-winning documentary, describing Israeli settler violence as “terrorism”.\n\nPalestinian authorities said Israeli settlers killed Awdah Muhammad Hathaleen, a teacher, on Monday. The Israeli police said it was investigating but did not directly comment on the claim that he was killed by settlers.\n\n“France condemns this murder with the utmost firmness as well as all deliberate acts of violence committed by extremist settlers against the Palestinian population, which are multiplying across the West Bank,” a foreign ministry spokesman said.\n\n“These acts of violence are acts of terrorism.” The spokesman urged Israeli authorities to “immediately sanction the perpetrators of these acts of violence, which continue with complete impunity, and protect Palestinian civilians”.\n\nThe Palestinian Authority’s education ministry accused Israeli settlers of killing Hathaleen “during their attack on the village of Umm al-Khair” near Hebron, in the south of the occupied territory.\n\nThe Israeli police said it was investigating an “incident near Carmel,” a settlement neighbouring Umm al-Khair, adding that an Israeli had been arrested for questioning.\n\nAwdah Hathaleen was a resident of Masafer Yatta, a string of hamlets on the hills south of Hebron, which have been declared a military zone by Israel.\n\nTheir efforts to prevent Israeli forces from destroying their homes was the subject of “No Other Land”, which won Best Documentary prize at the Oscars in March.\n\nIts Israeli co-director, Yuval Abraham, posted a video on Instagram showing a man with a gun in his hand arguing with a group of people, while shouts can be heard in Hebrew and Arabic.\n\n“An Israeli settler just shot (Awdah Hathaleen) in the lungs, a remarkable activist who helped us film ‘No Other Land’ in Masafer Yatta,” Abraham wrote.\n\nAbout three million Palestinians live in the West Bank alongside nearly half a million Israelis living in settlements, which are considered illegal under international law.\n\nIsraeli soldiers or settlers have killed at least 962 Palestinians, including fighters and civilians, since the start of the Gaza war in October 2023, according to a tally based on PA data.\n\nPublished in Dawn, July 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/24094037f7f2655.jpg?r=094321",
  "retrievedAt": "2025-08-17T21:44:42.460Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927537/france-brands-israeli-settler-violence-as-terrorism",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T00:52:54.000Z"
}
