{
  "title": "Jirga demands inquiry into Tirah firing incident - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: Fata Loya Jirga (FLJ) on Monday condemned the security forces’ ‘direct’ firing on tribesmen in Tirah and demanded an independent and transparent inquiry of the incident.\n\nThe demand was made during a meeting held in Jamrud with the FLJ chief Bismillah Khan in the chair.\n\nThe jirga unanimously rejected the official contention that some miscreants had opened fire at the protesting tribesmen on Sunday from nearby hillocks, and alleged that the security forces had in fact directly fired at the unarmed protesters, killing seven and injuring 17 tribesmen.\n\nThe FLJ also announced its full support to the Bar Qambarkhel tribesmen’s demand that first the terrorists of the banned Tehreek-i-Taliban Pakistan and then the security forces should leave the Tirah Valley.\n\nReacting to the TTP local commanders’ assertion that they would consult their top shura in Afghanistan regarding demand for their pullout from Tirah, the FLJ reiterated its demand of sending an authoritative jirga of prominent tribal elders to hold dialogue with TTP top leadership in Afghanistan for peace in the merged districts.\n\n“The FLJ has the capability to negotiate a lasting peace deal with the TTP while utilising its longtime experience and time-tested abilities to tackle such situations,” it added through a resolution.\n\nThe FLJ through another resolution demanded of the federal government to include an equal number of tribal elders, selected from the FLJ, along with the 18-member official jirga, which was constituted under the leadership of federal minister Amir Muqam for the resolution of some thorny issues confronted by the residents of seven merged districts.\n\nPublished in Dawn, July 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/27211220c25e7b7.jpg?r=211407",
  "retrievedAt": "2025-08-17T21:44:07.373Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927453/jirga-demands-inquiry-into-tirah-firing-incident",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T00:53:19.000Z"
}
