{
  "title": "Explaining Trump 2.0 - World - DAWN.COM",
  "author": null,
  "content": "THE American empire is committing suicide. Americans re-elected Donald Trump, knowing his fascist proclivities, to accomplish precisely this aim. Notwithstanding the clownish aspects of the fascist consolidation of power (reminiscent of the classical precedents), the cruelty, vengeance, ignorance and pettiness are real, and threaten to take down the entire human species in the course of the predictable implosion from within.\n\nIn writing about incipient American fascism since the late 1990s, I have always been careful to note the missing elements compared to the Italian and German precedents, particularly the lack of a charismatic leader and a revolutionary militia, but no such doubts remain. I was cautious even 10 years ago, when pointing out the limited appeal of the alt-right’s ethno-nationalist fantasies, but no longer hesitate to declare this a classical fascist dictatorship in its objectives. Curtis Yarvin’s prescription for a revived monarchy, appealing to authoritarian tech bros, is useful as shorthand, but the case of American fascism is overdetermined and suffers from a surfeit of explanations.\n\nIn just six months, this version of Trump, empowered by reactionary oligarchs during the 2020-2024 interregnum, has been worse than the most diehard pessimists expected. Trump’s personal buffoonery aside, the masterplan being executed to convert this nation into an authoritarian/ monarchical/ post-constitutional ethno-state is breathtaking for its rigour, discipline and single-mindedness.\n\nIn retrospect, Democrats clearly must have been privy to these internal machinations, glimpses of which appeared in Project 2025, but because they have themselves been the main party carrying the neoliberal virus, serious opposition is precluded. In basic substance they agree with the conversion of the American citizen into a compliant consumer-subject, and the convergence of pseudo-AI (not the real thing) with the radical aims of depopulation, disenfranchisement and the projected importation of the apocalyptic warlordism of the Mad Max world the empire has already conjured, with the help of its abject proxy Israel, in the Middle East.\n\nWhen crushing media dissenters with debilitating lawsuits and studiously ignoring federal judges’ orders to stop disappearing migrants to foreign concentration camps (whether in El Salvador or South Sudan) or to reinstate essential government employees laid off by Elon Musk’s DOGE chainsaw-wielders, the administration does so with the assurance that the supreme court will always provide it with just enough cover to go ahead with its plans, whether to end Medicare and social security or to fatally undermine birthright citizenship.\n\nThe post-constitutionalists are also guaranteed zero real opposition from the Democrats, who have shown more gumption over taking down one of their own, and the brightest and most popular at that, New York City mayoral candidate Zohran Mamdani, while remaining silent accomplices to the deportations, the gutting of entire agencies like the FDA and the Department of Education, and the acceleration of the anti-Islamic wars in the Middle East.\n\nCivil society is paralysed and unable to summon any meaningful response to the daily annihilation of liberties.\n\nThe empire is putting itself out of business by dismantling federal government agencies looking after health, education, safety, retirement and welfare. It is destroying the second-to-none higher education system by punishing universities for so-called DEI by defunding them, banishing international students, and ending basic research. It is destroying immigration by going after birthright citizenship in addition to unprecedented mass deportations resembling the former Latin American dictatorships’ ‘disappearances’. It is imposing a radical tariffs regime all but overturning the global economic order that it painstakingly constructed and defended by military coercion over the last 80 years. It is militarising a long-running subterranean civil war by putting the military on the streets without provocation and without bothering to invoke legal justification.\n\nIn short, because this is faster and more comprehensive than expected, and more disciplined and organised because of the oligarchic forces emboldening Trump and using him as an instrument to attain complete asymmetrical power, civil society is paralysed and unable to summon any meaningful response to the daily annihilation of liberties. The worst of the symbolism has been the omnipresent masked mercenaries, masquerading as official ICE agents, arresting dutiful immigrants showing up in court for their appointments while pursuing legal means of residency.\n\nExcept for a handful of the usual leftist critics who remain on the fringes, and have been so since the Bush administration’s preview of the current atrocities under more legal cover, there is no appetite among Americans for a reckoning of how and why we got here, aside from a cute nostalgic wish to return to ‘normality’ as it existed before, where ‘we the people’ allegedly sent our obedient representatives to Washington, and monarchy ended with the 1776 revolution.\n\nBut why would an empire which — if things were managed skillfully — could have lasted a long while yet, especially given China’s hesitancy to claim the mantle of world leadership, end itself? World-class universities, a global trading regime supporting dollar hegemony and a largely undeserved high domestic standard of living, and in-migration of the best and brightest, are features of the late-stage empire to be crushed only if you desire in the end to destroy even your own MAGA supporters.\n\nTrump’s autarkic sensibility — which has resonated strongly with less-educated Americans all throughout the Cold War and afterwards — might represent the wish to carve out three independent authoritarian zones, America (with expanded he­­m­­ispheric territory), Russia (with claims on Euro­­pe) and China (much of Asia, except the Middle Eastern oil states), but this seems too schematic, and American military strategy won’t allow it.\n\nThere is the perfect symmetry of empire beginning with genocide and ending with one. The psychological burden of fighting endless wars and flattening nation after nation for more than 80 years, in Latin America, Africa, Asia and more recently the Muslim world, has become too much to bear. At some point, when empire’s atrocities become too great, the contradictions and hypocrisies dissolve entirely, as the empire implodes in a burst of honesty, and citizens step back to admire their own gruesome handiwork.\n\nThe scary thing is that Trump is merely an exc­l­a­mation point, giving vent to the vapid brutality of the American soul, in both its liberal and conserva­t­­ive incarnations, with no varnish or prettification.\n\nThe writer’s political books include Why Did Trump Win?\n\nPublished in Dawn, July 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68896f2746307.jpg",
  "retrievedAt": "2025-08-17T21:44:01.394Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927562/explaining-trump-20",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T01:05:11.000Z"
}
