{
  "title": "State Bank keeps monetary policy rate unchanged at 11pc - Business - DAWN.COM",
  "author": null,
  "content": "The State Bank of Pakistan (SBP) kept its policy rate unchanged on Wednesday at 11 per cent.\n\nThe central bank’s policy rate, after being slashed by 1,000bps from 22pc since June 2024 in seven intervals, was cut to 11pc in May. The bank had kept the rate unchanged on June 16 as well.\n\nA press release issued by the SBP said its Monetary Policy Committee noted that inflation in June had decelerated to 3.2pc year on year, led mainly by lower food prices, whereas core inflation also declined slightly.\n\nHowever, it noted that the inflation outlook had worsened in the wake of higher-than-anticipated adjustment in energy prices, especially gas tariffs.\n\n“Nonetheless, inflation is projected to stabilise in the target range going forward.\n\n“Moreover, economic activity is gaining further traction amidst the still-unfolding impact of the earlier reductions in the policy rate. At the same time, the committee noted that the trade deficit is expected to widen further in FY26 amidst the pickup in economic activity and slowdown in global trade. Given this macroeconomic outlook and the emerging risks, the MPC considered today’s decision as necessary to ensure price stability,” the SBP said of the decision to keep the policy rate unchanged.\n\nThe bank noted that since the MPC’s prior meeting, its foreign exchange reserves had crossed $14 billion on the back of improved financial inflows and a current account surplus.\n\nIt said the recent upgrade in Pakistan’s sovereign credit rating had led to a decline in Eurobond yields and narrowed credit default swap spreads in international markets. It also said that inflation expectations had increased slightly for consumers but declined for businesses in the latest sentiment surveys.\n\nThe SBP said that the Federal Board of Revenue’s tax revenue for FY25 was recorded at Rs11.7 trillion, which fell short of the revised estimate by around Rs200bn. Lastly, it said that global oil prices had remained volatile, whereas metal prices increased, while at the same time, the impact of global trade tariffs remained uncertain, prompting central banks to maintain their cautious monetary policy stance.\n\n“In view of these developments and potential risks, the committee assessed that the real policy rate should continue to be adequately positive to stabilise inflation in the target range of 5-7pc. The MPC emphasised on the need to continue the ongoing prudent monetary and fiscal policy mix to sustain macroeconomic stability. Moreover, the committee reiterated its view that without structural reforms, it would be difficult to achieve higher growth on a sustainable basis,” the press release said.\n\nAwais Ashraf, director research at AKD Securities, said that stability in the currency market along with clarity on the inflation front would allow the SBP to cut interest rates into the single digit.\n\nThe Pakistan Business Forum (PBF) had claimed that both interest and exchange rates were being kept artificially high without economic justification, and appealed to Prime Minister Shehbaz Sharif to ensure a correction to support growth and stability.\n\nThe PBF also criticised the current interest rate of 11pc, calling it unjustifiable given that the Consumer Price Index-based inflation had dropped to 4pc. It urged the State Bank of Pakistan (SBP) to reduce the policy rate to at least 9pc in its upcoming monetary policy announcement scheduled for July 30.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/301531096a9fa1f.png",
  "retrievedAt": "2025-08-17T21:43:15.671Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927601/state-bank-keeps-monetary-policy-rate-unchanged-at-11pc",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T10:17:58.000Z"
}
