{
  "title": "Five Sukkur policemen booked for shooting youth in ‘fake encounter’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Five police officials have been booked at the SITE police station of Sukkur after a departmental inquiry found them guilty of shooting a university student in a fake encounter.\n\nThe case was registered on an order issued by Sukkur DIG retired Captain Faisal Abdullah Chachar on Tuesday after the report was submitted to him.\n\nThe victim, Nasrullah Mangrejo, who is a third-year student of microbiology at the Shah Abdul Latif Uni­versity, Khairpur, was shot on his knee by the police team about a month ago.\n\nThe team comprised ASIs Abdur Rehman Shaikh and Shahzaib Shaikh; head constable Rajjal Khan; and constables Jawed Ahmed and Roshan Ali.\n\nThe cops had wounded a university student after keeping him in custody for 24 hours\n\nMangrejo had gone missing after he had left his home to take part in the 5th Muharram procession.\n\nHis family informed lodge a complaint about his disappearance but initially the SITE police appeared reluctant to declare that he was in their custody. The very next day, they came out with the claim that Mangrejo had received a bullet wound during an encounter and arrested.\n\nThey had taken the youth to the Sukkur Civil Hospital in custody for treatment.\n\nDisbelieving the police claim, the affected family and their relatives held a protest demonstration at the hospital and demanded action against the police team. They also approached the higher police officials with complaint of excesses by the police team stating that Mangrejo had no criminal record nor was he wanted in any criminal activity.\n\nThey kept demanding a fair investigation into the whole episode and punishment to the errant policemen.\n\nDIG Chachar ordered departmental inquiry into the alleged encounter which found no criminal record of the victim. Accordingly, the DIG directed the Sukkur SSP, Azhar Khan Mughal, to register a case against all members of the police team.\n\nHe also ordered departmental action against them.\n\nIn compliance of the order, the FIR (No.124/2025) was registered at the SITE police station on July 7 and the fake encounter case (FIR No. 114/2025) of the same police station was put in ‘B’ class.\n\nThe inquiry and action remained secret until the DIG came across local journalists on Tuesday and was asked about such a report circulating in the social media.\n\nConfirming the reports, the DIG in unequivocal terms stated that the police team’s claim of ‘encounter’ turned out to be false. The registration of the FIR against these police officials itself confirms that the it was a fake encounter, according to him.\n\nThe DIG also gave details of the inquiry process, saying that he had immediately ordered the probe when the matter was brought to his knowledge.\n\nHe said that Nasrullah Mangrejo’s parents, the errant police team and their colleagues at the station were interviewed by the investigation team to reach a conclusion.\n\nIn reply to a question, the DIG said that the SITE police had indeed arrested a suspect in the same area that day who had a criminal record but Nasrullah Mangrejo had nothing to do with the suspect.\n\nHe said the inquiry team checked all relevant records, including Mangrejo’s call data record (CDR) and examined them. Finally, it reached the conclusion that Mangrejo had no connection with any criminal activity, he added.\n\nIn the light of the findings, it was decided to register a case against all members of the errant police team and take departmental action against them, the DIG said.\n\nRegarding medical treatment of Mangrejo, the DIG said the errant policemen would definitely be asked to bear the cost of his treatment.\n\nHe, however, ruled out possibility of any compensation to be paid to the victim by his department.\n\nOn his part, Nasrullah Mangrejo told Dawn that the police team had picked him up in the Old Sukkur area where he had gone to participate in mourning procession on the 5th of Muharram. “After an interrogation, they shifted me to the C-Section police for my biometric identification. They later kept shifting me from one police station to the other before staging the encounter the next evening,” he stated.\n\nThe victim’s father, Habibuallh Mangrejo, told Dawn that he wondered why no action was recommended in the inquiry report against DSP Badar Bhutto, SHO Sultanpur Zulifqar Bhambbro, SHO C-Section Aijaz Jiskani and SHO SITE Allauddin Phlpoto who, according to him, were equally responsible for the fake encounter and excesses.\n\nPublished in Dawn, July 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:44:33.525Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927482/five-sukkur-policemen-booked-for-shooting-youth-in-fake-encounter",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T00:53:00.000Z"
}
