{
  "title": "Ledecky wins 22nd world title, Popovici savours ‘scary’ gold - Sport - DAWN.COM",
  "author": null,
  "content": "SINGAPORE: Katie Ledecky claimed a sixth 1,500 metres freestyle title and a record-extending 22nd world championships gold medal in Singapore on Tuesday as Romanian rocket David Popovici added the men’s 200 crown to his Paris Olympic triumph.\n\nThere was also gold for Australia’s backstroke queen Kaylee McKeown, who foiled American rival Regan Smith once again to claim the 100 title in a thriller, while South Africa’s Pieter Coetze clinched the men’s race.\n\nUnbeaten in the 1,500 since the age of 13, world record holder Ledecky came home ahead of Italian Simona Quadarella with Australian Lani Pallister winning bronze at the World Aquatics Championships Arena.\n\nThe American great was under world record pace (15:20.48) for all but a few laps before fading in the last lengths to finish at 15:26.44, more than five seconds ahead of Quadarella.\n\nWrapped in an American flag, Ledecky beamed as she exited the pool, having clinched a 28th world championships medal, moving past Ryan Lochte in the all-time list.\n\nOnly Michael Phelps, with 33, has more.\n\nAt 28 and with the Los Angeles Games on the horizon, Ledecky said she had no desire to take a breather.\n\n“I really hate taking breaks so I start dreading the impending break that’s coming after this meet,” she said. “The water always calls me back, the team mates always call me back, and I’m just going to keep enjoying it.” Ledecky’s 22nd world title is the most by any female swimmer and second only to Phelps’s overall record of 26.\n\n“Growing up it was very inspiring to watch world championships, Olympic Games that Michael was in, trying to learn from the very best,” said Ledecky. “I was always a student of the sport.”\n\nLedecky was the red-hot favourite going into the race, having qualified for the final over 10 seconds faster than nearest challenger Pallister.\n\nShe also went into the race owning the top 24 1,500m freestyle times ever, and set the second-fastest time in history in April behind her own record.\n\nPallister pushed her with a fast early tempo and Ledecky was on world record pace until late in the race.\n\nIn the end she fell short of the mark but still clocked the fifth-fastest time ever.\n\n“Lani took it out there. I knew she would be out fast and I just wanted to get out fast, but comfortable enough that I could go from there,” said Ledecky. “I’m happy with the time and happy with the swim.”\n\nIt is Ledecky’s first gold medal of the championships, after picking up a bronze behind Summer McIntosh in the 400m freestyle on Sunday’s opening night in Singapore.\n\nLedecky is set to go head-to-head with Canadian phenomenon McIntosh again in the 800m freestyle.\n\nQuadarella, who won the 1,500 at the world championships in Doha last year in Ledecky’s absence, punched the water in delight after shaving nearly 10 seconds off her personal best and setting the European record.\n\nEuropeans have become a force in men’s swimming, with Popovici among those leading the way. The 20-year-old was the strong favourite to win the 200 and duly delivered with a brilliant finish before revealing he had very nearly pulled out.\n\nHalf a body length behind Luke Hobson at the turn of the last lap, Popovici roared to the wall in 1:43.53, 0.31 ahead of the American, with Japan’s Tatsuya Murasa taking bronze.\n\n“I think [this feels] even better than the Olympics, to be honest,” said Popovici. “You know why? I trained a lot for the Olympics but this year [is] a more relaxed year, more easy-going after the Olympics. I’m very proud of myself.”\n\nPopovici said that he had seriously considered withdrawing from the competition before it started, even going as far as looking at flights home.\n\n“It was a mental thing and it had to do with the fear of seeing my real potential,” said Popovici, who reclaimed his world crown from 2022. “That’s very scary. And so I’m really glad I didn’t quit.”\n\nMCKEOWN REIGNS SUPREME\n\nMcKeown had not even wanted to race in the 100 backstroke in Singapore initially but took her place in lane five to leave world record holder Smith heartbroken again.\n\nThe Australian produced a sizzling burst of pace in the last 25 metres to overtake Smith and touch in a personal best of 57.16, only 0.03 off the American’s world record.\n\nThe ultimate big-stage performer, McKeown came from behind to deny Smith twice for the 100 and 200 golds at the Paris Olympics.\n\nSmith had to once more settle for second, just 0.19sec behind, while Katharine Berkoff, also of the United States, took bronze.\n\n“It’s just really emotional because of the low I came back off from the Olympics,” said the 24-year-old Queenslander. “To come out there tonight and just forget about all the pressure, forget about all the nerves and just swim really goes to show what I can do when I am relaxed.”\n\nThe men’s 100 backstroke final was also a belter, as Coetze set an African record of 51.85 to deny Italian Olympic champion Thomas Ceccon by 0.05 seconds.\n\nFrance’s bronze winner, Yohan Ndoye-Brouard, was only 0.02 further adrift in a furious finish.\n\nWrapping up the medal events, Germany’s Anna Elendt upstaged major contenders with a stunning swim from lane one to claim the women’s 100 breaststroke gold in 1:05.19, 0.08 seconds ahead of American Kate Douglass, with China’s Tang Qianting third in 1:05.64.\n\nDay four on Wednesday will feature another bumper programme of five medal events, with Australian Olympic champion Mollie O’Callaghan bidding for a second 200 freestyle title.\n\nNew Zealand’s Erika Fairweather joined O’Callaghan in the final, bouncing back from her shock disqualification in the 400 heats.\n\nThe men’s 800 freestyle final also promises to be a highlight as Ireland’s Olympic champion Daniel Wiffen battles a stacked field including Australian Sam Short and Tunisia’s Ahmed Jaouadi.\n\nPublished in Dawn, July 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688961941fcf0.gif",
  "retrievedAt": "2025-08-17T21:45:13.067Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927512/ledecky-wins-22nd-world-title-popovici-savours-scary-gold",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T00:52:47.000Z"
}
