{
  "title": "Tsunami waves reach Hawaii, Japan after huge 8.8-magnitude quake rattles Russia’s Far East - World - DAWN.COM",
  "author": null,
  "content": "A magnitude 8.8 earthquake struck off Russia’s Far Eastern Kamchatka Peninsula on Wednesday, the strongest in the region since 1952, damaging buildings and generating a tsunami of up to 4 metres that prompted warnings and evacuations in Hawaii, Japan and across the Pacific Ocean.\n\nSeveral people were injured in the remote Russian region, while much of Japan’s eastern seaboard — devastated by a powerful earthquake and tsunami in 2011 — was ordered to evacuate as Tsunami waves hit the Pacific coast of the country.\n\nMeanwhile, Hawaii recorded tsunami waves measuring up to 5ft, according to the Pacific Tsunami Warning Centre. However, no waves of consequence have hit Hawaii yet.\n\nWhat we know so far:\n\nThe magnitude 8.8 quake struck at 8:24 am (4am PKT) off Petropavlovsk on Russia’s remote Kamchatka peninsula and was one of the 10 biggest recorded, according to the US Geological Survey.\n\nThe USGS said the earthquake was shallow at a depth of 19.3km, and was centred 119 km east-southeast of Petropavlovsk-Kamchatsky, a city of 165,000.\n\nThe epicentre of the earthquake is roughly the same as the massive 9.0 temblor in 1952, which resulted in a destructive, Pacific-wide tsunami, according to the USGS.\n\n“Today’s earthquake was serious and the strongest in decades of tremors,” Kamchatka Governor Vladimir Solodov said in a video posted on the Telegram messaging app.\n\nA tsunami with a height of 3-4m was recorded in parts of Kamchatka, said Sergei Lebedev, regional minister for emergency situations, urging people to move away from the shoreline.\n\nRussian authorities said a tsunami hit and flooded the port town of Severo-Kurilsk, while local media said one wave of between three and four metres high was recorded in the Elizovsky district of Kamchatka.\n\n“The strongest earthquake since 1952 has just occurred in the Kamchatka seismic zone … Given the scale of the event, strong aftershocks with a magnitude of up to 7.5 should be expected,” Kamchatka’s geophysical service said on Telegram.\n\nThirty additional tremors were recorded following the main earthquake off the Kamchatka Peninsula, a regional branch of the Geophysical Service of the Russian Academy of Sciences said.\n\nIn December 2004, a 9.1 magnitude earthquake struck off the Indonesian island of Sumatra, triggering a tsunami that killed around 220,000 people in 11 nations.\n\nSeveral people sought medical assistance following the quake, Oleg Melnikov, regional health minister, told Russia’s TASS state news agency.\n\n“Unfortunately, there are some people injured during the seismic event. Some were hurt while running outside, and one patient jumped out of a window. A woman was also injured inside the new airport terminal,” Melnikov said.\n\n“All patients are currently in satisfactory condition, and no serious injuries have been reported so far.”\n\nWhile a kindergarten was also damaged, most buildings withstood the quake, and no fatalities had been reported, the ministry added.\n\nRussia’s Ministry for Emergency Services said on Telegram that the port in the Sakhalin town of Severo-Kurilsk and a fish processing plant there were partially flooded by a tsunami. The population has been evacuated.\n\n“Everyone was evacuated. There was enough time, a whole hour. So everyone was evacuated, all the people are in the tsunami safety zone,” Mayor Kuril Islands district Alexander Ovsyannikov said at a crisis meeting with officials.\n\nAuthorities in Russia’s far eastern Sakhalin region declared a state of emergency in the northern Kuril Islands.\n\n“A state of emergency has been declared in the North Kuril District, where an earthquake and tsunami occurred today,” the Sakhalin government said in a statement.\n\nMeanwhile, the Kamchatka Volcanic Eruption Response Team recorded that the Klyuchevskoy volcano — a highly active volcano in the region — ejected ash to a height of up to 3km above sea level as a result of the quake, Al Jazeera reported.\n\n“The volcano is continuing to erupt explosively at the summit. Ash emissions at altitudes up to 8km above sea level may occur at any time,” said KVERT in a statement.\n\nKVERT has assigned an orange colour code for aviation hazards to the volcano, which indicates an increased likelihood of eruption.\n\nThe whole Pacific coast of Japan has reported tsunami waves, Al Jazeera reported, citing Japanese broadcaster NHK World.\n\nWaves as high as 60cm were recorded along some parts of the coast, including Kuji Port and Hamanaka town, according to NHK.\n\nThe size of the waves has grown steadily from 20cm earlier this morning, and authorities say they could reach as high as 3m.\n\nTsunami warning advisories will be in place across Japan for at least the next 24 hours, the Japanese broadcaster said.\n\nAccording to Japan’s Meteorological Agency, the country’s Pacific coast has already been hit by four to five rounds of tsunami waves, and has warned that there are no signs of the Tsunami waves receding, Al Jazeera reported.\n\nThere is also a chance of powerful and unexpected surges, it added.\n\nEarlier, Japan’s weather agency issued a warning, saying it expected tsunami waves of up to 3m to reach large coastal areas starting around 1am GMT (6am PKT).\n\nTsunami alarms sounded in coastal towns across Japan’s Pacific coast with authorities urging people to seek higher ground.\n\nFootage on public broadcaster NHK showed scores of people in the northern island of Hokkaido on the roof of a building, sheltering under tents from the beating sun, as fishing boats left harbours to avoid potential damage from the incoming waves.\n\n“We came here hoping to swim, but once we heard a tsunami warning had been issued, we didn’t go in at all, not even close to the water,” local Tomoyo Fujita, 35, told AFP as she left the area with her young daughter.\n\nTelevision footage showed several whales washed up on a beach.\n\nWorkers evacuated the stricken Fukushima nuclear plant, where a meltdown following the 2011 tsunami caused a radioactive disaster, operator TEPCO said.\n\nThere were no injuries or damage reported so far, and no irregularities at any nuclear plants, Japan’s Chief Cabinet Secretary Yoshimasa Hayashi said.\n\nThe Pacific Tsunami warning centre recorded waves measuring up to 1.7m in Maui, Hawaii, while another high wave of 1.5m was recorded in Hailo, the BBC reported.\n\nTsunami waves were “now impacting Hawaii”, the Centre said in an update.\n\nThe US National Weather Service confirmed the reports, according to Al Jazeera.\n\nHawaii Governor Josh Green said so far, no waves of consequence have hit the islands, but all flights in and out of Maui were cancelled, Reuters reported.\n\nIn light of the tsunami situation, the Department of Transportation in Hawaii announced, in a social media post, the cancellation of all flights to and from Kahului Airport, the main airport in Maui, Al Jazeera reported.\n\nEarlier, the US Tsunami Warning Centres issued a Tsunami Warning — its highest level alert — for the entire US state of Hawaii, with the first waves expected at 7:17pm local time (10:17pm PKT).\n\n“People are also advised to stay away from the beach and not to go to the coast,” the seismology centre said in a warning.\n\nHawaii ordered evacuations from some coastal areas. “Take Action! Destructive tsunami waves expected,” the Honolulu Department of Emergency Management said on X.\n\nThe Hawaii warning urged residents of low-lying areas to either move to higher ground or to the fourth floor of a building.\n\n“Due to a massive earthquake that occurred in the Pacific Ocean, a Tsunami Warning is in effect for those living in Hawaii,” US President Donald Trump said in a social media post.\n\n“A Tsunami Watch is in effect for Alaska and the Pacific Coast of the United States. Japan is also in the way. Please visit tsunami.gov/ for the latest information. Stay strong and stay safe!”\n\nTsunami waves have also hit California on the West Coast, according to the National Weather Service. The weather body said the waves hit the coast at 1:12am local time (1:12pm PKT).\n\nEarlier, Tsunami alerts were pushed to mobile phones in California, according to local AFP reporters.\n\nThe US Tsunami Warning System also warned of “hazardous tsunami waves” within the next three hours across the Pacific. According to the seismology centre, waves reaching more than 3m were possible along some coasts of Russia and Ecuador, while waves of 1-3m were possible in Japan, Hawaii, Costa Rica, French Polynesia, Guam, Chile and the Solomon Islands, it said. Smaller waves were possible along coastlines across much of the Pacific, including the US West Coast.\n\nWaves of up to one metre were possible elsewhere, including Australia, Colombia, Mexico, New Zealand, Tonga and Taiwan.\n\nIt described the potential conditions as “hazardous.”\n\nIn Mexico, the Navy warned that strong currents are expected at port entrances from Baja California in the northwest to Chiapas in the south of Mexico, AFP reported.\n\nThe country has mobilised authorities at all levels of government to keep its population away from Pacific beaches.\n\nFollowing suit, Peru also issued a statement warning of a possible tsunami.\n\n“After an analysis and evaluation by the National Tsunami Warning Centre, it has been determined that this event generates a tsunami warning for the Peruvian coast,” the Directorate of Hydrography and Navigation of the Peruvian Navy said in a statement, adding that the situation “will be kept under constant surveillance.”\n\nEcuador officials ordered ‘preventive evacuations’ from Galapagos beaches and the suspension of all maritime activities, AFP reported.\n\nMeanwhile, China’s tsunami warning centre said that waves of between 30 centimetres and one metre were expected to hit parts of the eastern seaboard.\n\n“Based on the latest warning and analysis results, the Tsunami Advisory Centre of the Ministry of National Resources has determined that the earthquake has triggered a tsunami, which is expected to cause damage to certain coastal areas of China,” the advisory centre said.\n\nKamchatka and Russia’s Far East sit on the Pacific Ring of Fire, a geologically active region that is prone to earthquakes and volcanic eruptions.\n\nThe Russian Academy of Sciences said it was the strongest quake to hit the region since 1952.\n\n“However, due to certain characteristics of the epicentre, the shaking intensity was not as high … as one might expect from such a magnitude,” said Danila Chebrov, director of the Kamchatka Branch of the Geophysical Service, on Telegram.\n\n“Aftershocks are currently ongoing … Their intensity will remain fairly high. However, stronger tremors are not expected in the near future. The situation is under control.”\n\nAuthorities in French Polynesia warned the population of several of the Marquesas Islands to expect tsunami waves up to four metres high in the early hours of Wednesday morning.\n\nThey said the waves would reach the islands of Ua Huka, Nuku Hiva and Hiva Oa at 00:57am local time (3:27pm PKT).\n\nOther islands in the Marquesas were expected to experience wave heights between 0.6m and 0.9m, the local government also said.\n\n“Our armed forces in French Polynesia are on alert as a precautionary measure, to be ready to assist our fellow citizens and state services in potential search and rescue operations or medical evacuations,” French Defence Minister Sebastien Lecornu said on the social media platform X.\n\nResidents were urged to move to higher ground and follow official instructions, including securing boats or moving them away from the shore.\n\nThe Marquesas Islands, among the most remote in the world, have a population of approximately 9,500, according to a 2022 census. The population is predominantly of Polynesian descent, alongside French and other immigrant communities. The largest settlements are Taiohae on Nuku Hiva and Atuona on Hiva Oa.\n\nOther archipelagos in French Polynesia may be affected by waves less than 30 cm high, which do not require evacuation or sheltering, local authorities said.\n\nFrench Polynesia covers 4,200 sq km of the Pacific Ocean. Its five archipelagos comprise 118 islands.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/30094308c57974c.jpg",
  "retrievedAt": "2025-08-17T21:43:59.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927570/tsunami-waves-reach-hawaii-japan-after-huge-88-magnitude-quake-rattles-russias-far-east",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T03:52:10.000Z"
}
