{
  "title": "PHC seeks NAB report in Kohistan ‘funds misappropriation’ case - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court on Thursday sought report from National Accountability Bureau about ongoing probe into alleged misappropriation of funds from the district accounts office, Upper Kohistan, over a plea of Senator Azam Khan Swati against placing of his name on the Exit Control List by the federal government.\n\nA bench consisting of Justice Ijaz Anwar and Justice Dr Khurshid Iqbal fixed July 31 for next hearing, directing Mr Swati to cooperate with NAB in the probe.\n\nBarrister Waqar Ali Khan appeared for the petitioner, whereas special prosecutor Arbab Kaleemullah represented the NAB KP.\n\nThe petitioner’s counsel stated that recently Mr Swati intended to travel abroad for medical treatment but was offloaded at the Islamabad airport on the ground that his name had been placed on the ECL by the federal government.\n\nAzam Swati challenges placing of his name on ECL\n\nHe stated that his client had regularly been appearing in cases registered against him and was on bail in all those cases. He added that there was no ground available for the government to place him on the ECL.\n\nBarrister Waqar contended that Mr Swati was also elected senator in the recently-held Senate polls in the province.\n\nThe special prosecutor stated that the bureau had been investigating the involvement of the petitioner in the case related to misappropriation of funds in Upper Kohistan.\n\nHe stated that a questionnaire was also given to the petitioner and was asked to appear before the investigation team on July 24, through a call-up notice, but he didn’t turn up.\n\nBarrister Waqar stated that on July 24 the petitioner had to appear before another court in a case due to which he could not visit the NAB office.\n\nHe stated that the petitioner had earlier received a call-up notice from NAB on June 17, which was challenged in the high court. He added that the court had directed the bureau not to arrest the petitioner in the said case.\n\nHe stated that last year the petitioner’s name was placed on ECL and other travel restriction lists, but the same was declared by the PHC as illegal and unconstitutional earlier this year.\n\nHe stated that the high court had ruled that mere pendency of criminal cases against a citizen was no ground to deny him freedom to travel within or outside Pakistan.\n\nThe special prosecutor contended that the Kohistan scam was presently one of the biggest embezzlement cases in the country as around Rs40 billion had been misappropriated by scores of suspects.\n\nHe alleged that there was a transaction of heavy amount from a bank account under probe to the account of the petitioner due to which he was issued the call-up notice.\n\nThe bench decided to again hear the petition on July 31 (Thursday) with the direction to the bureau to submit report about the probe so far conducted in the said case.\n\nPublished in Dawn, July 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:44:08.854Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927446/phc-seeks-nab-report-in-kohistan-funds-misappropriation-case",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T00:53:20.000Z"
}
