{
  "title": "Federal cabinet approves National AI Policy 2025 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The federal cabinet on Wednesday marked major reforms after key decisions in strategic areas, including the approval of the National Artificial Intelligence (AI) Policy 2025.\n\nPrime Minister Shehbaz Sharif chaired a meeting of the federal cabinet today, which unanimously approved the National AI Policy 2025, designed to create a complete AI ecosystem in the country. The policy aims to democratise access to artificial intelligence, enhance public services and open up new employment and innovation avenues.\n\n“Our youth are Pakistan’s greatest asset. Providing them with education, skills, and equal opportunities in AI is a top priority,” PM Shehbaz said.\n\nThe AI policy outlined training a million AI professionals by 2030, establishing an AI Innovation Fund and AI Venture Fund to boost private sector involvement, creating 50,000 AI-driven civic projects and 1,000 local AI products in the next five years.\n\nIt also called for the distribution of 3,000 annual AI scholarships and facilitation of 1,000 research projects, inclusion of women and individuals with disabilities through accessible education and financing, strengthening cybersecurity and national data security protocols, promoting global partnerships and compliance with international AI regulations.\n\nAn AI Council and a comprehensive master plan and action matrix will oversee the policy’s implementation.\n\nThe prime minister applauded the Ministry of IT and allied institutions for their timely efforts, saying, “AI will not only modernise our economy but also enhance productivity across agriculture, public services, and governance.”\n\nThe cabinet also ratified decisions made in earlier sessions of the Cabinet Committee on Privatisation and the Committee on Legislative Business held on July 8, 17, and 25, respectively.\n\nEarlier in the month, Pakistani AI platform SOCByte launched the country’s first AI-powered cybersecurity programme designed to provide critical information to professionals.\n\nIn May, the Ministry of Finance announced the allocation of 2,000 megawatts of electricity for Bit­coin mining and AI data centres to “transform Pak­is­tan into a global leader in digital innovation”.\n\nIn April, in a landmark judgement, the Supreme Court emphasised the potential of AI to streamline the judicial system, reduce delays, improve case management systems and expand legal knowledge — particularly at the district level — but urged a cautious and ethically grounded approach to its integration.\n\nThe cabinet also approved next year’s Haj policy, with the prime minister also directing complete digitisation of the Haj operation beginning in 2026, ensuring transparency, efficiency and world-class services for pilgrims.\n\nHe emphasised that no compromise would be tolerated in providing top-tier facilities to Pakistani pilgrims. “Ensuring comfort, transparency, and timely support for every pilgrim is our foremost duty,” PM Shehbaz said.\n\nThe new Haj policy allocates 70 per cent quota to the government and 30pc to private operators. Notably, private companies that failed to fulfil their responsibilities in the previous year would now be required to accommodate affected individuals in 2026.\n\nMoreover, the federal cabinet approved third-party validation for all Hajj operations, real-time monitoring of payments and application processes under private operators, a mandatory minimum of 2,000 pilgrims per private company, 1,000 seats reserved for hardship cases,\n\nIt also approved the use of enhanced digital tools, including the Pak Hajj mobile app, digital wristbands and mobile SIMs for better tracking and service delivery, transparent selection of assistants through competitive testing, emergency compensation mechanisms and upgraded lodging and food arrangements.\n\nThe prime minister also directed the Ministry of Information Technology to collaborate with the Ministry of Religious Affairs to ensure seamless digital transformation of the entire Hajj process.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/30220154a2d7261.jpg",
  "retrievedAt": "2025-08-17T21:42:50.055Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927634/federal-cabinet-approves-national-ai-policy-2025",
  "dateList": "2025-07-30",
  "date_published": "2025-07-30T17:23:18.000Z"
}
