{
  "title": "Pakistan keen to learn from Korean expertise in IT, industrialisation: PM",
  "link": "https://www.app.com.pk/national/pakistan-keen-to-learn-from-korean-expertise-in-it-industrialisation-pm/",
  "date_published": "2024-05-13T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP): Prime Minister Shehbaz Sharif on Monday said that Pakistan was keen to learn from Korea’s experience of industrialization and SME sector growth as well as in the field of IT including artificial intelligence.\nThe prime minister, talking to Ambassador of the Republic of Korea to Pakistan Park Ki Jun, who called on him, also offered to enhance export of skilled manpower from Pakistan to meet Korea’s human resource needs.\nThe Korean ambassador congratulated the prime minister on behalf of the Korean leadership upon his re-election.\nThe prime minister thanked the Korean leadership for the warm message of greetings that he received and expressed the desire to work closely to further strengthen bilateral ties.\nPrime Minister Shehbaz said that Pakistan and Korea enjoyed good relations, particularly in trade and investment.\nHe said both countries had cooperated since the early 1960s for economic development and conveyed admiration for Korea’s remarkable transformation into a modern technologically advanced economy.\nThe prime minister also offered to enhance export of skilled manpower from Pakistan to meet Korea’s human resource needs.\nTo promote mutually beneficial trade, he proposed the exchange of business delegations between Seoul and Islamabad. In this regard, Prime Minister Shehbaz said that he would instruct relevant cabinet members to coordinate with the Korean side to discuss existing investments by Korean companies as well as to explore new opportunities.\nHe also extended an invitation to President Yoon Suk Yeol to undertake an official visit to Pakistan.\nThe Korean ambassador thanked the prime minister for receiving him and conveyed the desire of the Korean government to enhance its bilateral cooperation with Pakistan in a number of areas of mutual interest, particularly trade, investment, IT, culture, tourism and people to people exchanges.",
  "retrievedAt": "2025-08-11T02:28:26.729Z"
}
