{
  "title": "Pakistan, US reaffirm commitment to continue counter-terrorism cooperation",
  "link": "https://www.app.com.pk/national/pakistan-us-reaffirm-commitment-to-continue-counter-terrorism-cooperation-2/",
  "date_published": "2024-05-13T18:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP):Pakistan and the United States have reaffirmed their commitment to continue counter-terrorism, pledging to work together to address regional and global security challenges and promote stability in the region.\n“The counter-terrorism dialogue underscores the cooperation between Pakistan and the United States in addressing the most pressing challenges to regional and global security, including Tehreek-e-Taliban Pakistan (TTP) and ISIS-Khorasan”, a joint statement issued after the Pakistan-US counter-terrorism dialogue held in Washington D.C on May 10, said.\nAdditional Foreign Secretary for the UN and OIC, Ambassador Syed Haider Shah, and US Department of State Coordinator for counter-terrorism, Ambassador Elizabeth Richard, co-chaired the dialogue.\nDiscussions centred on the counter-terrorism landscape in the region, with a focus on areas of mutual interest.\nPakistani and US senior officials emphasized the importance of expanded counter-terrorism collaboration and capacity building, including exchanges of technical expertise and best practices, investigative and prosecutorial assistance, provision of border security infrastructure and training, including the United States training of more than 300 police and frontline responders since the last Pakistan-US counter-terrorism dialogue in March 2023, and strengthening multilateral engagement such as in the UN and the Global counter-terrorism forum.\nPakistan and the United States recognize that a partnership to counter ISIS-Khorasan, TTP, and other terrorist organizations will advance security in the region and serve as a model of bilateral and regional cooperation to address transnational terrorism threats.\nBoth governments resolved to increase communication on these topics and continue collaboration to detect and deter violent extremism through whole-of-government approaches.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:28:19.052Z"
}
