{
  "title": "Arid University, QAU students mark World Migratory Birds Day",
  "link": "https://www.app.com.pk/national/arid-university-qau-students-mark-world-migratory-birds-day/",
  "date_published": "2024-05-13T18:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP):The students of Pir Mehr Ali Shah Arid Agriculture University and Quaid-i-Azam University (QAU) students on Monday celebrated the World Migratory Birds Day with the Islamabad Wildlife Management Board (IWMB) and Friends of Margalla Hills National Park here at Kinara Park.\nThe theme for this year was “Protect Insects, Protect Birds” that aimed at highlighting the relationship between migratory birds and insects where both were facing decline in their population due to climate change, habitat loss and anthropogenic activities.\nThe students held a bird watching activity at the Park which is located at the Bank of the Rawal Dam providing a panoramic view of the entire water body and the national park with multiples birds of various species hovering around making it a feast for the birds watcher and wildlife lovers.\nThe Awareness Man, Sohail Sherwani provided awareness to the participants on the national park, wildlife species, threats to the natural environment and role of the citizens in its protection and conservation.\nThe Park is famous for holding clean up activities and birds watching instances. The Friends of Margalla Hills National Park, a group of volunteers serving the national park and IWMB in nature conservation and public awareness voluntarily.\nThe students on the occasion pledged to play a responsible role towards nature conservation, birds and wildlife protection by containing plastic pollutions, littering in natural environment and actively engaging with the communities for awareness on significance of wildlife and environmental conservation to boost arrival of migratory birds.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:28:19.080Z"
}
