{
  "title": "HBL PSL 2025 : Batters, Faheem give Quetta Gladiators huge win over Peshawar Zalmi - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Quetta Gladi­ators looked much more compact than Peshawar Zalmi in all departments here Sunday night at the Gaddafi Stadium as the former recorded a comprehensive 64-run win to boost their campaign in the Pakistan Super League.\n\nThe way an animated Mohammad Amir trapped Zalmi captain Babar Azam in front of the wicket as his team looked to chase 179, showed how well prepared Gladiators were for the game. If their top five batters made useful contributions, their fast bowlers, particularly Faheem Ashraf (5-33), were spot on.\n\nThe win lifted Gladia­tors, who recorded their second consecutive win of this PSL season, to third in the six-team league while Zalmi slid to fifth spot.\n\nSaim Ayub’s cracking shot over cover on the very first ball of the opening over bowled by Amir signalled that Zalmi were ready and positive for the challenge. However, that was not to be.\n\nSaim (five) was caught by wicket-keeper Kusal Men­­dis off fast bowler Faheem Ashraf in the second over as the batter tried unsuccessfully to play a fast rising delivery. Zalmi were 17-1.\n\nBabar’s departure in the next over delivered by Amir proved a massive setback for Zalmi. The former Pakistan captain failed to negotiate a typical swinging ball from the left-armer that came in sharply. The batter opted for DRS that showed ball would have hit top of middle-stump.\n\nWhen pacer Mohammad Wasim Jr disturbed the timber behind Tom Kohler-Cadmore, who missed the line of the delivery while trying to play through the onside, it made 33-3 in the fifth over. Mohammad Haris started his cameo with a six on the very first ball he faced from Amir.\n\nA dismal 41-3 at the end of powerplay asked for a solid rescue mission by Zalmi that never came as they kept losing wickets.\n\nFaheem jolted Zalmi further with a double strike in the eighth over.\n\nFirst, he induced Haris (17 off 16) to hole out to Rilee Rossouw at long-on and two balls later forced Abdul Samad (two) to get a very faint edge as Mendis took another catch to leave Zalmi tottering at 50-5.\n\nAfter reaching 76-5 in 10 overs Zalmi needed a significant boost. Though Hussain Talat and Mitchel Owen (15 off eight) added 31 off 18 balls to give their team some hope but those were ended by fast bowler Khurram Shahzad with a double blow in the 11th.\n\nOwen was caught nicely by Wasim at sweeper cover and when Khurram on his very next ball sent Alzarri Joseph, caught down the leg-side by Mendis, back to the pavilion, a big defeat started staring Zalmi in the face. They were now 81-7.\n\nLuke Wood (eight) hit Fah­eem for a six in the 12th over but the batter was und­one on the very next ball.\n\nHussian Talat, who made a 34-ball 39, was the ninth wicket to fall, as the left-hander was caught by Rossouw off spinner Abrar Ahmed in the 15th over.\n\nSufyan Muqeem became Faheem’s fifth victim in the next over when Ros­souw took his fourth catch of the innings.\n\nKhurram took 2-9 in his three overs while Amir claimed 1-18 and Wasim 1-21 in three.\n\nEarlier, captain Saud Shakeel and Finn Allen gave Gladiators a brisk start of 46 in 4.2 overs after Zalmi invited them to bat first before the latter misjudged a short ball outside off and was caught by Saim at point off Joseph. Allen made 31 off 16 with four fours and a couple of sixes.\n\nIncoming Rossouw (27 off 18) kept the momentum going alongside Saud as the former cracked four fours in the sixth over bowled by pacer Ali Raza to help Gladiators end the powerplay at 67-1. Rossouw, was cleaned up by Saim in the 10th over as Gladiators were now 91-2. Gladiators reached 100 in 10.2 overs.\n\nSaud’s innings (32 off 26, five fours) was ended by Saim in the 12th over as the southpaw played a slog sweep only to be caught by Samad just inside the mid-wicket boundary. The scoreboard now read 105-3.\n\nMendis smashed five boundaries in his 27-ball 32 before he was caught by Haris off Joseph.\n\nAli’s last over, 18th of the innings, produced 17 runs for Gladiators, who in the process reached 150 in 17.3 overs, as Mark Chapman (33) collected three fours.\n\nFaheem (one) skied a short-pitched delivery from Joseph who himself took the catch. Hasan Nawaz (eight), after being hit by a Joseph bouncer, struck him for a six. He was eventually run out in the last over bowled by pacer Wood after a mix-up with Chap­man.\n\nWood dismissed Chap­man who, trying to play a big shot, was caught by Owen nicely at long-on as Gladiators lost their seventh wicket at 173.\n\nSaim gave away only 24 runs for his two wickets while Joseph claimed three wickets for 33 in his four overs. Ali conceded 48 without a wicket while left-arm wrist spinner Sufiyan remained wicket-less for 33.\n\nSCOREBOARD\n\nQUETTA GLADIATORS:\n\nSaud Shakeel c Samad b Saim 32\n\nFinn Allen c Saim b Joseph 31\n\nRilee Rossouw b Saim 27\n\nKusal Mendis c Haris b Joseph 32\n\nMark Chapman c Owen b Wood 33\n\nFaheem Ashraf c&b Joseph 1\n\nHasan Nawaz run out (Wood) 8\n\nMohammad Wasim not out 0\n\nMohammad Amir not out 4\n\nEXTRAS (B-1, LB-4, NB-1, W-4) 10\n\nTOTAL (for seven wickets, 20 overs) 178\n\nDID NOT BAT: Khurram Shahzad, Abrar Ahmed\n\nFALL OF WICKETS: 1-46 (Allen), 2-91 (Rossouw), 3-105 (Saud), 4-144 (Mendis), 5-164 (Faheem), 6-173 (Hasan), 7-173 (Chapman)\n\nBOWLING: Wood 4-0-35-1 (1w), Joseph 4-0-33-3 (1w), Ali 4-0-48-0 (1w, 1nb), Sufiyan 4-0-33-0 (1w), Saim 4-0-24-2\n\nPESHAWAR ZALMI:\n\nSaim Ayub c Mendis b Faheem 5\n\nBabar Azam lbw b Amir 12\n\nTom Kohler-Cadmore b Wasim 5\n\nMohammad Haris c Rossouw b Faheem 17\n\nHussain Talat c Rossouw b Abrar 39\n\nAbdul Samad c Mendis b Faheem 2\n\nMitchell Owen c Wasim b Khurram 15\n\nAlzarri Joseph c Mendis b Khurram 0\n\nLuke Wood c Rossouw b Faheem 8\n\nSufiyan Muqeem c Rossouw b Faheem 4\n\nAli Raza not out 0\n\nEXTRAS (LB-3, W-4) 7\n\nTOTAL (all out, 15.2 overs) 114\n\nFALL OF WICKETS: 1-17 (Saim), 2-21 (Babar), 3-33 (Kohler-Cadmore), 4-46 (Haris), 5-50 (Samad), 6-81 (Owen), 7-81 (Joseph), 8-94 (Wood), 9-114 (Hussain)\n\nBOWLING: Amir 3-0-18-1, Faheem 3.2-0-33-5 (2w), Khurram 3-1-9-2 (1w), Wasim 3-0-21-1 (1w), Abrar 3-0-30-1\n\nRESULT: Quetta Gladiators won by 64 runs.\n\nPLAYER-OF-THE-MATCH: Faheem Ashraf\n\nCURRENT STANDING\n\nTabulated under (Teams, matches, wins, losses, points, net run-rate)\n\nUnited 5 5 0 10 2.342\n\nQalandars 6 3 3 6 0.543\n\nGladiators 5 3 2 6 0.140\n\nKings 6 3 3 6 -0.217\n\nZalmi 6 2 4 4 -0.847\n\nSultans 6 1 5 2 -1.562\n\nPublished in Dawn, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680ecec5944b9.gif",
  "retrievedAt": "2025-08-25T14:40:30.202Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906986/hbl-psl-2025-batters-faheem-give-quetta-gladiators-huge-win-over-peshawar-zalmi",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T01:31:09.000Z"
}
