{
  "title": "On the brink, again - Newspaper - DAWN.COM",
  "author": null,
  "content": "INDIA and Pakistan are back on the brink of a dangerous confrontation. Escalating tensions have pushed the subcontinent into uncharted territory heightening the risk of a full-blown crisis as bilateral mechanisms are cast aside and diplomatic relations further downgraded.\n\nFollowing a terrorist attack in Pahalgam in occupied Kashmir, which claimed the lives of 26 civilians, India announced a raft of punitive measures against Pakistan. They included suspension of the Indus Waters Treaty (IWT), which governs the sharing and management of trans-border rivers between the two neighbours. Other steps involved closing the Attari border crossing, cancelling visas and shrinking the size of the Pakistan High Commission in New Delhi.\n\nThese so-called retaliatory steps were taken without any investigation into the terrorist incident and absent any evidence of Pakistan’s involvement. The Indian foreign secretary’s announcement only mentioned “cross-border linkages of the terrorist attack”. But an orchestrated campaign in the Indian media pointed the accusing finger at Pakistan.\n\nMore significantly, Prime Minister Narendra Modi warned of “unimaginable punishment” for the attackers and their backers. This intensified speculation in India that his government was planning some kind of kinetic action to avenge the killings. It recalled memories of the 2019 Balakot crisis when Indian planes crossed the border to launch strikes inside Pakistani territory ostensibly against militant hideouts. Pakistan retaliated by air strikes in Jammu. The crisis was defused with the help of friendly countries after Pakistan repatriated an Indian pilot captured when his plane was shot down by Pakistan.\n\nIslamabad’s response to India’s April 23 announcement was carefully calibrated to match Indian moves. A statement issued after a meeting of the National Security Committee announced a slew of retaliatory actions. It described Indian measures as “unilateral, unjust and irresponsible”. It rejected the Indian decision to suspend the IWT and warned any attempt “to stop or divert the flow of water belonging to Pakistan” will be “considered an act of war and responded with full force”. Pakistan, it said, reserved the right to hold “all bilateral agreements with India”, including the Simla Agreement, “in abeyance” but stopped short of suspending any. Pakistan also shut down the Wagah border crossing and its airspace to Indian overflights as well as halted all trade. These steps mostly mirrored Indian actions.\n\nEscalating tensions have pushed the region into uncharted territory and towards a full-blown crisis.\n\nIndia’s announcement about putting the IWT “in abeyance” was not made in a vacuum. For the past several years New Delhi has been raising doubts about the fate of the 1960 treaty, that has for over six decades survived wars, confrontations and tensions to provide a framework for water-sharing.\n\nThe two countries disagreed in recent years over the treaty’s dispute settlement mechanism. India, for example, boycotted a court of arbitration hearing in January 2023 at The Hague on Indian hydroelectric projects on the Chenab and Jhelum rivers disputed by water-stressed Pakistan. It wanted a neutral expert instead. In January 2023, India notified Pakistan of its intention to amend the treaty’s dispute settlement provisions. Islamabad responded at the time by expressing willingness to discuss any concerns in the relevant body, the joint Indus Waters Commission, while calling on India to comply with the treaty.\n\nIn August 2024, New Delhi formally asked Islamabad for a review and renegotiation of the IWT. In its communication to Pakistan, India called for modifying it on grounds of what it called “fundamental and unforeseen change” in circumstances as well as security concerns. It mentioned concerns over issues including “demographic changes, environmental challenges, and the need to accelerate clean energy development”. India’s letter of April 24 to Pakistan echoed the same points but significantly added “sustained cross-border terrorism by Pakistan” as justification for putting the treaty in abeyance.\n\nIndia’s decision to suspend the treaty is neither consistent with treaty provisions nor international law. The treaty does not allow either party to unilaterally put it in abeyance or abrogate it. Both parties have to consent to any treaty modification or its termination according to its provisions. India’s announcement says the IWT “will be held in abeyance with immediate effect until Pakistan credibly and irrevocably abjures its support for cross-border terrorism”.\n\nFor now, abeyance means India will cease sharing water flow data and exchanging information about project designs. But it already stopped doing that years ago. It can take other steps to mount pressure. But India cannot immediately halt the flow of water or significantly divert it as it lacks the infrastructure at present to do so. So, the near-term impact of this action will be limited. Of course, in the longer term it has serious implications.\n\nThe imminent danger is from any military action New Delhi is tempted to take, encouraged by what its officials see as ‘effective’ Indian coercive diplomacy in play, which needs reinforcement. Modi’s speech in Bihar on April 24 in which he said terrorists and their backers will be pursued to the “ends of the earth” is being widely construed as strong indication of that possibility. Speculation is running rife that conventional kinetic strikes may be combined with cyberattacks and asymmetrical actions by India.\n\nAlready deployment of heavy weaponry is reported close to the Line of Control and international border. Prime Minister Modi may think he can borrow from the Israeli playbook to ‘punish’ Pakistan but any Indian kinetic action will be met by a strong military response from Pakistan, with uncertain and unpredictable consequences for New Delhi. This will likely set off an escalatory cycle and trigger an all-out crisis, which could be on a larger scale than what happened in 2019.\n\nIn 2019, a third party helped to defuse the crisis. Will this happen again? If no such help is forthcoming in a timely way it would make the situation between two nuclear neighbours more dangerous than in the past.\n\nThe notion of limited war waged under the nuclear threshold is fraught with untold risks. Such a scenario should be avoided at all costs. Even though there is little appetite for this by the Indian side, a backchannel must be re-established without delay to avoid any miscalculation, manage the crisis and prevent it from spinning out of control. The alternative is too terrifying to contemplate.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680edcbf00eef.jpg",
  "retrievedAt": "2025-08-25T14:40:03.954Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907055",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T01:43:30.000Z"
}
