{
  "title": "Centre irked by Punjab delaying lower tariff for LNG plants - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The federal government has conveyed its displeasure to the Punjab government over delay in approval process for tariff reduction of its two LNG-based power plants of more than 2,400MW, involving about Rs600bn savings over their remaining useful lives of 18 to 23 years.\n\nA senior official told Dawn that Central Power Purchasing Agency (CPPA) — a subsidiary of the power division — had been in contact with Punjab’s energy department for completion of formalities to file tariff reduction applications before the National Electric Power Regulatory Authority (Nepra).\n\nHe said the CPPA management to the government that the case for approval of revised tariffs with Punjab’s two plants was included in the agenda of the provincial cabinet well before Eidul Fitr. “The CPPA has reported that approval from the Punjab cabinet has not come through as of April 25, despite reminders,” the official said.\n\nPunjab government’s two LNG-based plants at Bhikki and Trimmu are among the most efficient plants with plant efficiency beyond 61pc. The 1,180MW Bhikki plant had come into operation in 2018 and its remaining 18-year term expires in 2043 while the 1,262MW Trimmu plant that started commercial operations in May 2023 can continue to operate till 2048.\n\nFederal govt awaiting approval to file tariff reduction pleas before Nepra\n\nThe official said the power division and PM office had conveyed their displeasure to the CPPA for the ongoing delays and had also taken up with the provincial government for early clearance.\n\n![ .](https://www.dawn.com/news/19063510\n\nHe said the task force on power producers had concluded the revised terms with all the four LNG-based plants — two plants belonging to federal and provincial governments each — about two months ago.\n\nThe centre had not only secured federal cabinet approvals but also filed tariff reduction petitions with Nepra that had already conducted public hearing last week. The federal government had expected that regulatory process for all four similar plants to conclude simultaneously if not jointly. However, the provincial approvals are still not available.\n\nThe sources said the combined savings from Bhikki and Trimmu was estimated at about Rs596bn over their remaining useful life of 18 and 23 years, respectively. The change in terms of their contracts included a ‘hybrid take-and-pay’ model instead of existing ‘take-or-pay’ model, reduction in rate of return and a cap on dollar indexation at Rs168.\n\nThe government claims a total of Rs2.162 trillion savings from six government-owned power plants which also include two above projects of the provincial government. It claims Rs1.567tr savings from four federal projects with a cumulative capacity of about 3,700MW — two LNG-based project at Balloki and Haveli Bahadurshah of around 1,220MW each, 747MW Guddu power project and 510MW Nandipur power project.\n\nFollowing revised agreements secured by the taskforce, Nepra announced that it had decided to discontinue dollar-based indexations for these plants, transitioning instead to rupee-based indexations fixed for the entire useful life of the power projects.\n\n“This strategic revision aims to curb foreign exchange exposure and reduce tariff volatility for consumers,” it said, adding that it also capped the indexation for Operations & Maintenance (O&M) costs to 70pc of rupee devaluation, down from the previous 100pc.\n\nAdditionally, the return on equity (ROE) structure has been rationalised and the plants will now receive 35pc of the ROE as fixed, with the remaining 65pc linked directly to the actual operation of the plant.\n\nThe revised O&M shall be indexed quarterly.\n\nUnder the deal, the applicants agreed to implement a ‘hybrid take-and-pay model’, whereby tariff payment to the company shall be made by the CPPA as follows: “from the effective date, prorated for remaining period of the current agreement year, and thereafter for every agreement year, the company will be entitled to 35pc of revised RoE components of tariff as part of CPP.\n\nFrom the effective date, in case the despatched and delivered Net Electrical Output (NEO) of the company exceeds 35pc of the total contract capacity in terms of kWh, the company will be entitled to receive RoE components of tariff, which shall be calculated on the actual NEO exceeding 35pc of the total contract capacity in terms of kWh and the company shall claim the differential CPP accordingly.\n\nThe government claims about Rs3.5tr savings through revised power purchase agreements with 29 IPPs and GPPs over remaining useful life.\n\nPublished in Dawn, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:40:12.594Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907075/centre-irked-by-punjab-delaying-lower-tariff-for-lng-plants",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T02:06:20.000Z"
}
