{
  "title": "Trump touts immigration crackdown despite concerns about due process - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump’s administration on Monday touted the early results of his immigration crackdown despite concerns over due process, displaying photos of alleged criminal offenders on the White House lawn and preparing to target cities and states that limit cooperation with federal immigration enforcement.\n\nTrump plans to sign an executive order on Monday directing top officials to identify within a month the cities and states failing to sufficiently comply with federal immigration laws, a White House official said.\n\nTrump launched an aggressive enforcement campaign after taking office, surging troops to the southern border and pledging to deport millions of immigrants in the US illegally.\n\nThe Republican president — who made immigration a major campaign issue in 2024 — said the actions were needed after years of high illegal immigration under his predecessor, Democrat Joe Biden.\n\nAt a press briefing, White House officials touted a steep decline in illegal crossings at the border during Trump’s first three months in office — even as concerns have emerged over the due process rights of immigrants and US citizens swept up in the dragnet.\n\nUS Border Patrol arrested 7,200 migrants illegally crossing the border in March, the lowest monthly total since 2000 and down from a peak of 250,000 in December 2023.\n\n“We have the most secure border in the history of this nation and the numbers prove it,” Trump border czar Tom Homan said at the briefing.\n\nDemocrats and civil rights advocates have criticised Trump’s heightened enforcement tactics, including the cases of several US-citizen children recently deported with their parents, including one with a rare form of cancer, according to the American Civil Liberties Union.\n\nHoman blamed the parents for putting their children at risk of deportation by remaining in the US. “If you choose to have a US-citizen child, knowing you’re in this country illegally, you put yourself in that position,” he said.\n\nIn his first hundred days in office, Trump has moved to strip legal immigration status from hundreds of thousands of people, increasing the pool of those who can potentially be deported.\n\nWhile arrests of immigrants in the US illegally have spiked, deportations remain below last year’s levels under Biden, when there were more people illegally crossing the border who could be quickly returned.\n\nDeportations were down in Trump’s first three months in office from 195,000 last year to 130,000 this year, Reuters reported last week. Homan defended the figures and said it was not fair to compare them to Biden-era tallies.\n\nUS Immigration and Customs Enforcement (ICE) detention facilities have been over capacity, with some 48,000 in custody as of early April, beyond the funded level of 41,500.\n\nHoman said Texas military base Fort Bliss could be ready “in the very near future” to hold migrant detainees. The Trump administration has already been using the US naval base in Guantanamo Bay, Cuba.\n\nPhotos posted on the White House lawn featured 100 people charged or convicted of serious crimes, including murder, rape and fentanyl distribution.\n\nNumerous studies show immigrants do not commit crimes at a higher rate than native-born Americans.\n\nTrump has criticised cities and states that limit cooperation with federal immigration enforcement, labelling them “sanctuaries” and blaming them for releasing criminal offenders instead of coordinating their transfer to ICE.\n\nLast week, a federal judge blocked Trump’s administration from withholding federal funding from more than a dozen so-called sanctuary jurisdictions that have declined to cooperate with Trump’s hardline immigration crackdown.\n\nThe executive order planned for Monday, first reported by The Wall Street Journal, would build on Trump’s early efforts to pressure the jurisdictions to cooperate.\n\n“President Trump plans to sign an executive order on Monday, escalating his battle against Democratic-led states and cities that don’t fully cooperate with federal immigration authorities,” a White House official said.\n\nUS officials arrested a Wisconsin judge on Friday and charged her with helping a man in her court briefly evade immigration authorities. The arrest triggered backlash from Democrats and immigrant rights advocates who raised concerns that immigrant victims may not feel safe in courthouses.\n\nHoman defended the arrest, saying the administration would enforce laws prohibiting harbouring a person in the US illegally.\n\n“You will be prosecuted, judge or not,” he said.\n\nTrump’s schedule calls for him to sign executive orders at 5pm Eastern Standard Time (2100 GMT, 1am PKT). Americans are split on Trump’s immigration approach, but he has a 45 per cent approval rating on immigration, better than on other major issues, a Reuters/Ipsos poll conducted in mid-April found.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/28224003cbbb78d.jpg",
  "retrievedAt": "2025-08-25T14:39:31.749Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907166/trump-touts-immigration-crackdown-despite-concerns-about-due-process",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T17:56:55.000Z"
}
