{
  "title": "A road map for savings - Newspaper - DAWN.COM",
  "author": null,
  "content": "Economics 101 indicates that a country with a savings rate below its investment will find it difficult to achieve sustained growth. It also states that a country with a low financial literacy rate, high inflation and high cash in circulation (cash printed but not in any bank account) will have a very low national savings rate.\n\nPakistan fits this diagnosis perfectly. Firstly, the official savings rate (savings in banks as a percentage of GDP) stood at 14 per cent. Secondly, although inflation has eased in the recent past, rates provided by banks for savings products were well below the inflation rate, hence providing a negative rate of return. Thirdly, we remain a cash economy; money in circulation as of March 14 stood at Rs9.1 trillion.\n\nThis perfect storm will make increasing the official savings rate very challenging. Regulators and providers must use the customer lens if they are to make a dent in our savings habit. The solution must provide a real rate of return without high risk, must be safe (no Ponzi schemes), must be easily accessible (no 10-page documentation with twenty signatures), must have an affordable ticket size and must be liquid.\n\nResearch suggests that Pakistanis save in cash, cryptocurrency, dollars, gold, real estate, stocks and animals (mostly in the rural areas). Let us look at each asset class and see what can be done to entice the savers to move from rupee savings outside the system to an asset class within the system.\n\nThere is a major opportunity to bring trillions of rupees in circulation into one of the many asset classes provided that access and knowledge is simplified\n\nThis will not only document the economy and raise the official savings rate but potentially also allow the banks to lend more. In addition, let us also examine what Rs10,000 invested five years ago in the asset classes mentioned would be worth today.\n\nAs seen in the table, investments in cryptocurrency, gold and company shares provided a positive rate of return after adjusting for inflation, yet the biggest asset class that we save in is Pakistani rupees. While Rs34tr is within the system, banks and the national savings schemes, Rs9.1tr is in circulation, and we can assume this to be in private lockers, office vaults and under pillows. The return on Rs10,000 invested five years ago would, if deposited in a savings account, show a negative rate of return given the five-year inflation rate.\n\nSo, in order to attract more people to save in rupees, we need to do four things. Firstly, educate the potential savers that there are rupee instruments, like the 90-day T-bill, that provide a rate better than inflation. Secondly, the opening of an Investor Portfolio Securities account — needed to invest in capital market instruments — must be made as easy as opening a digital wallet. Thirdly, the denomination of the investment must be made palatable (the T-bill already has a Rs5,000 denomination but is not offered to customers), and lastly, the investment must be made liquid.\n\nCryptocurrency, especially Bitcoin and Ethereum, has become extremely popular in Pakistan. While the figures cannot be verified directly from the exchanges, analysts suggest that the holding of crypto assets by Pakistanis ranges between $10 billion and $30bn with over 10 million people holding a crypto wallet in one or more crypto exchanges.\n\nUnfortunately, this activity is not regulated, and these assets are acquired via institutionalised hawala systems.\n\nAlthough crypto investments can potentially be used for money laundering, are a major drain on foreign currency reserves and are speculative in nature, they are here to stay. The best immediate course of action would be to create a synthetic contract that mimics one or more cryptocurrencies and the exchange element.\n\nIn this manner, once the ‘know your customer’ and ‘anti-money laundering’ processes have been done, customers can invest the cryptocurrencies without risks. Pakistanis also save in physical dollars. While the physical dollar is a dead asset, the charm is in the dollar’s value appreciating.\n\nMoving on, gold is one of the most popular asset classes. Gold is not saved via financial instruments or gold bricks but in gold ornaments. It is estimated that over $10bn worth of gold ornaments exist in the country. In order to make investing in gold as easy as buying a cold drink, we must fractionise and tokenise it.\n\nImagine an app that allows you to buy gold worth Rs100; it allows you to pay from your digital wallet and/or credit card, always provides a bid-offer spread so that you can buy or sell at any time, and offers the option of getting physical gold once you reach an agreed weight. The entity providing this service could be reg­u­lated and have physical gold against which it has fractionalised and tokenised the service. This can be a game changer and will start to bring in the money in circulation in the system.\n\nAlthough the Pakistan stock exchange provided resounding returns over the past few years, most Pakistanis don’t invest in equities for three main reasons: they are unaware of the returns and the risks associated with equity investments; financial literacy is low, and as a consequence, individual broking accounts are less than 100,000; and opening a broking account is a very painful exercise.\n\nSo financial literacy related to the risks and rewards of investing in company shares and the ease of opening an account must be improved if we are to see wider representation in the stock exchange.\n\nThere is a major opportunity to bring trillions of rupees from cash in circulation into one or more asset classes discussed. This will not only document the economy and improve the savings rate but also provide additional liquidity to the banks. To achieve this objective, the regulators, the existing banks and cutting-edge start-ups will need to work together.\n\nThe author is the Chairman of the Pakistan Fintech Network\n\nPublished in Dawn, The Business and Finance Weekly, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680ea83fdd936.jpg",
  "retrievedAt": "2025-08-25T14:39:54.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906971",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T01:31:02.000Z"
}
