{
  "title": "Two security men martyred in Pasni blast - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Two security personnel were martyred and a civilian sustained injuries in a bomb attack on a car in the coastal town of Pasni, while Police Lines in Dhadar of Kachhi district and a livestock office in Sibi town came under grenade attacks on Sunday.\n\nOfficials said that an improvised explosive device was used to target a car at Muskan Chowk of Pishin town of Gwadar district late night, resulting in the killing two security personnel travelling in the car while another man was injured.\n\n“The car was blown up and badly damaged in the powerful blast, causing panic among the people of Pasni town,” a senior police officer said, adding that soon after the blast the personnel of law enforcement agencies rushed to the site and shifted the bodies and injured to the district hospital.\n\nThe deceased were identified as Nawab Salman, a resident of Pasni, and Muhammad Nawaz, a resident of Khushab district of Punjab.\n\nAlso, some armed men hurled hand grenades at the Police Lines area of Dhahar in Kacchi district and at a livestock office in Sibi. However, no loss of life was reported in the grenade attacks.\n\nClash over land dispute\n\nMeanwhile, three Bugti tribesmen were killed and two others injured in an armed clash in the Sui area of Dera Bugti over land dispute.\n\nLevies officials said two groups of the Bugti tribe took arms against each other in the Jani Beeri area of Sui tehsil and an exchange of fire left three people dead and two others injured.\n\nPublished in Dawn, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:40:17.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907073/two-security-men-martyred-in-pasni-blast",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T02:06:20.000Z"
}
