{
  "title": "More homes razed as India continues crackdown on Kashmiris - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Indian forces in India-held Jammu and Kashmir have arrested more than 2,000 Kashmiris and demolished several homes in a sweeping crackdown following the Pahalgam incident.\n\nThe arrests were carried out across multiple districts, including Srinagar, Ganderbal, Bandipora, Kupwara, Baramulla, Budgam, Islamabad, Pulwama, Shopian, and Kulgam, according to the Kashmir Media Service.\n\nIn the Islamabad district of held-Kashmir alone, cordon-and-search operations and house raids resulted in the arrest of over 175 people. The detainees have been transferred to police stations and army camps.\n\nA police spokesperson said that 175 individuals had been detained during house raids and search operations across various areas of the district, adding that additional checkpoints had been set up and patrolling had been intensified, particularly in densely forested regions.\n\nMore than 2,000 people picked up, shifted to police stations, army camps\n\nFollowing the April 22 attack in Pahalgam, Indian troops and paramilitary forces escalated operations across the valley, carrying out widespread house raids and arbitrary arrests.\n\nIndian forces have also launched a campaign of demolishing the homes of pro-freedom Kashmiris. Since Saturday, the ancestral homes of seven Kashmiris have been destroyed using explosives by Indian forces, the Kashmir Media Service reported.\n\nOn the other hand, the houses of five more Kashmiris were demolished in what critics described as ‘collective punishment’.\n\nThe demolished houses belonged to the families of Amir Nazeer Wani, Jameel Ahmad Sher Gojri, Adnan Safi Dar, Amir Ahmed and Farooq Ahmad Tedwa. High-intensity explosives caused extensive damage to surrounding homes, leaving dozens of families homeless and in distress.\n\nCritics accuse Indian authorities of mimicking Israeli tactics of occupation and dispossession to render Kashmiris homeless and break their resistance to Indian rule.\n\nAbdul Rashid Minhas, a spokesman for the All Parties Hurriyat Conference (APHC), condemned the demolitions and arrests in a statement issued in Srinagar.\n\nPublished in Dawn, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/28091047e6efd13.jpg",
  "retrievedAt": "2025-08-25T14:40:34.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906955/more-homes-razed-as-india-continues-crackdown-on-kashmiris",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T01:30:54.000Z"
}
