{
  "title": "CORPORATE WINDOW: An optimistic take on tech - Newspaper - DAWN.COM",
  "author": null,
  "content": "Muhammad Farooq Naseem started his entrepreneurial journey with the establishment of a television assembly plant that has since diversified into different businesses. With a turnover of $150 million, his DWP Group now employs around 5,500 people in its four business verticals: home appliances; MEP or mechanical, electrical, and plumbing services; cement; and information technology (IT) services.\n\n“It was our collaboration with Samsung that threw us into a bit more prominence,” the founding chairman and chief executive officer of DWP Group told Dawn in an interview, reminiscing about how his “small company was discovered” by the Korean brand he helped establish in Pakistan back in 1999.\n\nBy the time a legal dispute forced him to exit his partnership with Samsung, he had already formed a new collaboration with one of the top, globally reputed Chinese home appliance manufacturers, Gree, to locally assemble a whole suite of consumer electronics.\n\n“In the last five years, we have invested heavily in localisation that has created a very large value addition. We have complete manufacturing facilities because we are now component manufacturers for a lot of things,” Mr Naseem noted. “It has given us a big competitive advantage over our local competitors.”\n\nGlobal evolution in the energy paradigm, the rise of digital technology and automation, and the extensive use of data could make or break countries like Pakistan in the near future\n\nThat said, the journey hasn’t been without difficulties, with the most formidable challenge being Pakistan’s recurring macroeconomic upheavals. The latest round of the ‘bust cycle’ that hit the country back in 2022 has been the worst he has ever seen.\n\n“It was a roadblock you suddenly hit without really seeing it coming when you were driving at a speed of 100 miles an hour,” he said. “I’ve seen the currency go up and down; I’ve seen Pakistan being put through nuclear tests and things of that sort. But this was way beyond that: this was a tidal wave, a tsunami that had hit you.”\n\nThe home appliances market shrank by about 40-50 per cent (due to skyrocketing prices and rapid currency depreciation that massively reduced the purchasing power of middle-class consumers). On top of that, the liquidity crunch led the government to restrict imports as the State Bank’s international reserves depleted amid fears of a sovereign default.\n\n‘Comparing IT with the rest of the industries, the negative list is much smaller to work with and can be easily converted into exportable income for this country very quickly’\n\n“We also had to curtail our footprint drastically. Luckily, because the company is not leveraged much, we were able to survive the downturn. As a company, I think we did a great job because we survived the crisis without losing any real money. Now that the government has managed the downturn to a certain extent and the markets are normalising, we are back and investing again into new business opportunities.”\n\nAre the bad times behind us? “I think that’s a bigger question than DWP Group as a commercial entity, because, as you know, the real issues stem from country risks, whether they are macroeconomic imbalances or security matters which are not currently highlighted. I don’t think it’s completely over.\n\n“But for now, fortunately, the economy is starting to pick up; our businesses are also reflecting that sentiment. We see this segment growing because home appliances are about the emergence of the middle class and the level of urbanisation. These aren’t luxury items anymore. When you talk about refrigerators, it’s about food security. When you talk about television, it’s the first level of entertainment in somebody’s home. So, if you’re going to talk about uplift or the emergence of the middle class, which other countries have experienced, then our products are right in the middle of it.”\n\nHis company is now making strides in increasing exports, especially in the IT sector. “What we’re discovering is that the products that you make are not competitive (in the world markets) because the import costs are very high. I think we’ve missed the boat there because for that you needed to invest heavily into heavy industries like steel and plastic.\n\n“That brings you to the virtual world: the IT services. That’s where we see the opportunity for export growth. As a Pakistani company, we are investing and aligning ourselves with the competitiveness of our people and their ability to leapfrog. If you talk purely in technological terms, the world is going through multiple fronts of technological disruption,” he explained.\n\nAs of late, the DWP group has expanded its IT operations to the Middle East and North America. “We’ve also invested in a tech fund in which we are tapping into the new talent in frontier technologies. Yes, we are lacking certain talents, but those talents can be harnessed because at the moment we have a huge cost advantage over others, including India. But it’s not something we can say will perpetuate. It could very much evaporate. At the moment, the biggest problem is the internet. You want to have an IT future as a country, and your internet speed is not up to par.”\n\nEmphasising the importance of IT, Mr Naseem argued that the issues facing the industry are easier to fix. “When you compare IT with the rest of the industries, the negative list is much smaller to work with. It is fixable, and it can be converted into exportable income for this country very quickly. It is a low-hanging fruit. If you were to fix Pakistan’s industrial policy, it would be a nightmare, but if you were to fix Pakistan’s IT competitiveness, that is easily fixable,” he concluded.\n\nMr Naseem believes that in the next 10 years the world is not going to look anything like the one that we know of. The changes, like a shift in the energy paradigm — how energy is created, distributed, and stored — the rise of digital technology and automation, and the extensive use of data could help countries, like Pakistan, bridge the gap of competitiveness. Adversely, these could also widen the competitive gap if we fail to adapt to these changes.\n\nBut do we still have time and opportunity to take advantage of technology? “There is always time. The question is: are you, as a country, ready for a transformation that requires national resolve? You are a country of 250m with one of the youngest populations in the world. But, if we look at our overall policy framework, we don’t see any focused effort to move into, say, new energy like solar, wind power, etc. Neither do we see any efforts to train our human resources to become part of the digital revolution going around,” Mr Naseem observed.\n\nYet, he believes there is hope: “The future frontier is something that we need to plan now. And that is what we see as an opportunity.”\n\nPublished in Dawn, The Business and Finance Weekly, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680d380abc270.gif",
  "retrievedAt": "2025-10-12T02:46:04.114Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906752",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T01:31:03.000Z"
}
