{
  "title": "Brics set to meet over Trump trade policies - World - DAWN.COM",
  "author": null,
  "content": "Senior diplomats from Brics countries will meet on Monday in Brazil to present a united front in the face of threats emerging from US President Donald Trump’s aggressive trade policies.\n\nThe meeting comes at a critical moment for the world economy after the International Monetary Fund (IMF) this week slashed growth forecasts over the impact of the American leader’s sweeping new tariffs.\n\nDiplomats from the trading bloc that includes current president Brazil, Russia, India, China and South Africa will meet for two days in Rio de Janeiro, as a precursor to a leaders summit in July.\n\n“The ministers are negotiating a declaration aimed at reaffirming the centrality and importance of the multilateral trading system,” Brazil’s Brics representative Mauricio Lyrio told reporters Saturday.\n\nThe group has expanded significantly since its inception in 2009 — and now includes Iran, Egypt and the United Arab Emirates. It makes up nearly half of the global population and 39 per cent of global GDP.\n\nTrump since returning to the White House in January has hit dozens of countries with a blanket 10pc tariff, but China faces levies of up to 145 percent on many products. Beijing has responded with duties of 125 percent on US goods.\n\nTrump has threatened to impose 100pc tariffs on Brics countries if they undercut the US dollar.\n\nBrazilian Foreign Minister Mauro Vieira will host the meeting that will be attended by Russia’s Sergei Lavrov and China’s Wang Yi among others.\n\nIt is scheduled to begin at around 11:00am (1400 GMT) with a statement expected in the afternoon.\n\nClimate change is expected to feature high on the agenda ahead of the United Nations COP30 climate summit in November hosted by Brazil in the Amazonian city of Belem.\n\nThe group is also likely to discuss the war in Ukraine, as Trump seeks to push Russia and Ukraine toward a peace agreement.\n\nThe Brics will be joined for discussions on Tuesday by nine other “partner” countries, including several former Soviet states, as well as Cuba, Malaysia, Thailand, Uganda and Nigeria.\n\nBeijing insisted that “no phone call” took place recently between President Xi Jinping and his US counterpart, after Donald Trump said he had spoken with the Chinese leader.\n\nThe world’s two biggest economies are locked in an escalating tit-for-tat trade battle triggered by Trump’s levies on Chinese goods, which have reached 145pc on many products.\n\nIn an interview conducted on April 22 with TIME Magazine and published Friday, Trump insisted Chinese leader Xi called him despite Beijing denying there had been any contact between the two countries over their bitter trade dispute.\n\nThe US president did not say when the call took place or specify what was discussed.\n\nAsked about the comments Monday, foreign ministry spokesman Guo Jiakun said: “As far as I know, there has been no phone call between the two heads of state recently.”\n\n“China and the United States are not conducting consultations or negotiations on tariff issues,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2812450608ed64b.jpg",
  "retrievedAt": "2025-08-25T14:39:38.158Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907112/brics-set-to-meet-over-trump-trade-policies",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T07:48:43.000Z"
}
