{
  "title": "Traders protest colleague’s kidnapping in Dera Murad Jamali - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA MURAD JAMALI: Locals staged a sit-in in Dera Murad Jamali on Sunday against the kidnapping of a Hindu trader, Sital Das, who was abducted by armed men from Mangoli area of Nasirabad district.\n\nThe traders gathered at the DC Chowk and blocked the Sibi-Sukkur National Highway, suspending traffic between Sindh and Balochistan.\n\nThey set up a sit-in camp and demanded the immediate recovery of the abducted trader.\n\nThe protesters chanted slogans against the local administration and police and warned that if the trader was not recovered within the next 18 hours, they would start a protest on the highway for an indefinite period.\n\nThe leaders of different political parties, including the district council chairman, Haji Mir Fareedul Haq, former minister Mir Ghafoor Lehri, Shah Muhammad Baloch and other leaders visited the sit-in camp to express their solidarity with traders.\n\nBalochistan Awami Party Senator Danish Kumar Palyani, PPP MPA Sanjay Kumar Panjwani, JUI-F MPA Ravi Kumar, former ministers Abdul Majid Abro, Mir Sikandar Umrani, Mir Safdar Khan Umrani and other political leaders have demanded that the Balochistan government recover the kidnapped trader immediately and arrest the kidnappers.\n\nThey said the Hindu community was feeling insecure due to the law and order situation and it was the government’s responsibility to protect the minorities.\n\nShahid Rind, the Balochistan government spokesperson, said Chief Minister Sarfraz Bugti has taken notice of the kidnapping.\n\nHe described the abduction as extremely concerning and assured that all available resources were being used to ensure Mr Das’ recovery.\n\nThe police and other law enforcement agencies were working on this case and positive progress was expected soon, Mr Rind emphasised, adding the abductors will be brought to justice.\n\nHe further stated that protecting the lives and property of citizens was the government’s top priority and CM Bugti has issued clear instructions for action against criminals.\n\nPublished in Dawn, April 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:40:11.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907069/traders-protest-colleagues-kidnapping-in-dera-murad-jamali",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T02:06:20.000Z"
}
