{
  "title": "UNGA President-elect due in Islamabad Sunday for two-day visit",
  "link": "https://www.app.com.pk/national/unga-president-elect-due-in-islamabad-sunday-for-two-day-visit/",
  "date_published": "2020-08-08T08:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP):The President-elect of the 75th Session of the United Nations General Assembly (UNGA) Volkan Bozkir is scheduled to arrive here on Sunday for a two-day visit (August 9-10), on the invitation of the Government of Pakistan.\nDuring the visit, Foreign Minister Shah Mahmood Qureshi will have wide-ranging talks with President-elect Volkan Bozkir on issues relating to the three main pillars of the United Nations’ work, including peace and security, development, and human rights.\nVolkan Bozkir will also call on Prime Minister Imran Khan, a Foreign Office press release said.\nThe PGA-elect’s visit is an important opportunity to inter alia highlight Pakistan’s strong and substantive contributions to the United Nations (UN) efforts in the promotion and maintenance of international peace and security, especially through our contribution to the United Nations Peacekeeping Operations around the world.\nVolkan Bozkir is the first-ever Turkish national to be elected to the Office of the President of the United National General Assembly.\nHe will be leading a historic and unprecedented General Assembly Session as the UN commemorates 75th anniversary of its establishment this year.\nPakistan remains committed to supporting the role of the UN General Assembly on the questions relating to international peace and security; economic and social development; promotion and protection of human rights; peaceful settlement of international disputes and refraining from the threat of use of force.\nThe country is also committed to developing friendly relations among nations based on the principle of equal rights and self-determination of peoples, as enshrined in the purposes and principles of the UN Charter.",
  "retrievedAt": "2025-08-11T19:37:35.310Z"
}
