{
  "title": "Two million saplings plantation on Tiger Force Day (August 9)",
  "link": "https://www.app.com.pk/national/two-million-saplings-plantation-on-tiger-force-day-august-9/",
  "date_published": "2020-08-08T05:07:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 08 (APP): Special Assistant to Prime Minister on Youth Affairs Usman Dar on Saturday said that two million saplings would be planted on Tiger Force Day (August 9) across the country,saying the gigantic initiative would be dedicated to the efforts and sincerity of young people becoming the part of the volunteer force.\nAddressing a press conference at Press Information Department’s office on Saturday, Usman Dar said that on the directions of Prime Minister Imran Khan, Tiger Force Day would be celebrated on August 9 to motivate youth of the country and ensure their maximum participation in the force. He was accompanied by Punjab Secretary Forest, Muhammad Asif and PITB Chairman Azfar Manzoor.\nHe appreciated that the Tiger Force responded to the call of Prime Minister Imran Khan in the crucial time when services were required during COVID-19 pandemic. The Tiger Force effectively contributed to various tasks during Corona virus pandemic, including distribution of food ration, implementation on SOPs in markets, Ehsaas Cash Disbursement Centers and others tasks, he highlighted.\nUsman Dar said that 1.2 million saplings would be planted with the cooperation of Forest Department, while the rest would be planted at 529 points in Punjab. He said 0.5 million saplings would be planted at 853 locations in Khyber Pakhtun Khwah (KPK), adding that tree plantation campaign would be carried out across the country.\nHe appreciated the efforts of Punjab Information and Technology Board (PITB) for developing Tiger Force android application and said that through this ‘app’ young people can become part of Tiger Force as the membership of Tiger Force has been opened and maximum number of young people could register with this force.\nThe Special Assistant said that Pakistan was facing environment related challenges, besides COVID-19 therefore timely steps were needed to provide wholesome,healthy environment to people.\nSAPM said that Prime Minister Imran Khan would plant a sapling on August 9 to mark Tiger Force Day in Islamabad, while Punjab Chief Minister Sardar Usman Buzdar and Governor Chaudhery Sarwar would plant saplings in Lahore. KPK Chief Minister, Governor Sindh, as well as federal/ provincial ministers and other government officials would also join the campaign.\nHe said that Sindh government should also benefit from the volunteer services of Tiger Force as 154,000 Tiger Force’s registered youth in Sindh were ready to work with the provincial government to provide relief to people. He regretted that if Tiger Force’s services had been utilized in Karachi during rainy spells the people would have faced fewer problems.\nDuring the press conference, Usman Dar invited PML-N president Shehbaz Sharif, PPP Chairman Bilawal Bhutto, PML-N leaders Ahsan Iqbal and Khwaja Asif to become part of the tree plantation campaign by setting aside their differences with the ruling party with the larger aim to make Pakistan “clean and green”.\nHe said that opposition parties, instead of criticizing Tiger Force, should focus on welfare projects for the people.",
  "retrievedAt": "2025-08-11T19:37:41.199Z"
}
