{
  "title": "FM Qureshi discusses political situation, Southern Punjab secretariat’s affairs with CM",
  "link": "https://www.app.com.pk/national/fm-qureshi-discusses-political-situation-southern-punjab-secretariats-affairs-with-cm/",
  "date_published": "2020-08-08T08:50:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 08 (APP):Foreign Minister Shah Mehmood Qureshi met Punjab Chief Minister Sardar Usman Buzdar at CM’s Office here on Saturday where matters of mutual interest, political situation and Southern Punjab Secretariat’s affairs came under discussion.\nProvincial Minister Dr. Muhammad Akhtar, Chief Whip National Assembly MNA Aamir Dogar, MNA Zain Qureshi, Principal Secretary to the CM Punjab and officers concerned were also present on this occasion.\nThe meeting decided to take prompt administrative steps to make Southern Punjab Secretariat fully functional.\nTalking on the occasion, Foreign Minister Shah Mehmood Qureshi said the PTI government was fulfilling all its promises made to the people. He said that establishment of Southern Punjab Secretariat would bring relief to the localities.\nThe problems of the people would be solved at the grassroots level besides improving the governance.\nShah Mehmood Qureshi, Usman Buzdar and other members of the Assembly strongly condemned the worst military siege and oppression of Modi government in Indian Illegally Occupied Jammu and Kashmir.\nShah Mehmood Qureshi said that Pakistan was incomplete without Kashmir. Modi had orchestrated Muslims’ genocide in Indian Illegally Occupied Jammu and Kashmir and had set a new history of oppression on Kashmiris, he added.\nUsman Buzdar said that the government under the leadership of Prime Minister Imran Khan had been highlighting Indian atrocities at all levels and the entire nation observed Youm-e-Istehsal.\nOne road in every division of Punjab, including Lahore, would be named after Srinagar, he said, adding, the government paid tribute to everlasting struggle of the Kashmiri people against the illegal Indian occupation.\nHe termed Kashmir as a jugular vein of Pakistan and said that Pakistan could not back off from the core issue of Kashmir cause.\nHe said that Modi blatantly violated the U.N. resolutions on August 5, 2019. He said that Pakistan would continue to expose India’s stubbornness and illegal steps at every level.\nUsman Buzdar said that secretaries of different departments would soon be posted in Southern Punjab Secretariat and the secretaries would be fully empowered.\nThe Southern Punjab Secretariat would be given administrative and financial autonomy so that affairs related to Multan, Bahawalpur and Dera Ghazi Khan Divisions could be dealt with locally, the Chief Minister stated.\nUsman Buzdar, while giving principle approval of setting up of 100-bed Mother & Child Hospital in Multan, said that this hospital would be established on the old building of Ghalla Mandi. He directed to resolve issues related to WASA and sewerage immediately. He said that setting up of Southern Punjab Secretariat was a major step of PTI government.\nHe said that the people of Southern Punjab would not have to come to provincial metropolis for the solution of their problems.\nHe said that former rulers used the funds of Southern Punjab in their own constituencies and people were entertained with hollow slogans, therefore people of Southern Punjab rejected such elements who hoodwinked them in the name of development in the general election.",
  "retrievedAt": "2025-08-11T19:37:45.607Z"
}
