{
  "title": "Govt introducing all bills in favour of country, requirement of FATF: MNA Bokhari",
  "link": "https://www.app.com.pk/national/govt-introducing-all-bills-in-favour-of-country-requirement-of-fatf-mna-bokhari/",
  "date_published": "2020-08-08T07:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP): Parliamentary Secretary for Law and Justice Maleeka Bokhari on Saturday said all bills which were introducing by the government in the Parliament or its committees were need of the country and requirements of the Financial Action Task Force (FATF).\nTalking to a private TV channel, she said the government was striving to bring out the country from gray list of FATF.\nShe said Pakistan was considered in FATF gray list during the last tenure of the Pakistan Muslim League-Nawaz\n(PML-N), adding the present government was trying to implement the FATF recommendations.\nThe MNA said Mutual Legal Assistant Bill, United Nations Security Council Bill and Anti Terrorism Act were the part of the FATF recommendations and these were not against constitution of the country.\nShe said the government was working to improve system of the country and taking every step according to the constitution.\nReplying to a question, she said the Pakistan Tehreek-e-Insaf (PTI) government was working for the betterment of the country and welfare of its people as it was part of PTI’s manifesto.\nShe said the National Accountability Bureau (NAB) could take action against corrupt practices and money laundering as it falls under its constitutional domain.\nMaleeka Bokhari said the previous governments including the PML-N and Pakistan Peoples Party (PPP) had destroyed the national institutions through political interferences in their official matters but the present government was utilising its efforts to make them strengthened, adding, the government maintained balance in the national economy.\nShe said Prime Minister Imran Khan’s policies and his strategies about the COVID-19 pandemic were being acknowledged at national and international level but opposition was criticising and politicking on the matter.",
  "retrievedAt": "2025-08-11T19:37:38.333Z"
}
