{
  "title": "AJK President advises youth to be ready to help oppressed people in IIOJK",
  "link": "https://www.app.com.pk/national/ajk-president-advises-youth-to-be-ready-to-help-oppressed-people-in-iiojk/",
  "date_published": "2020-08-08T06:13:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 08 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Saturday urged the youth besides focusing on their education to prepare themselves to help rid their brother and sisters in Indian Illegally Occupied Jammu and Kashmir (IIOJK) from the Indian subjugation.\nHe was talking to a student’s delegation which called on him in the State’s metropolis under the leadership of Secretary-General Islami Jamiat-e-Talaba Azad Kashmir Mehran Maroof.\n“The youth side by side with paying attention to their character building in the light of Qur’ran and Sunnah should also equip themselves with the modern and contemporary sciences in order to play their role in the progress and the prosperity of Pakistan and Azad Kashmir on the one hand and to prepare themselves to respond to the threats posed by the enemies to the security and existence of the country on the other hand,” the president added.\nHe asserted that keeping in view problems being faced by the students, 4G internet facilities would be extended to the liberated territory shortly.\nSardar Masood said that the government was fully aware of the problems erupted due to disruption of curricular activities in the public sector universities and other educational institutions following the outbreak of coronavirus and efforts were underway to resolve the problems.\nKeeping in view the financial constraints of the students, fee for the period of the lockdown had been curtailed to provide relief to them he said adding that 4G internet facilities would be extended to the whole of liberated territory soon except in some areas of Haveli, Neelum and areas along the Line of Control.\nThe president said that the government had launched Ehsas scholarship and need-based scholarships to help the students facing financial hardships.\nHe said that war if broke out, would be fought by not Pakistan Army alone but the whole nation as well, and the youth would be the frontline fighters in the war.\nOn this the occasion, the students’ leaders suggested that the history of Kashmir and the Kashmir liberation movement should be included in the academic syllabus of Azad Kashmir to apprise the new generation of their past and the sacrifices being offered in the liberation movement.\nThe students delegation also demanded necessary steps to restore the role of Azad Kashmir as the real base camp of Kashmir liberation struggle to accelerate the ongoing liberation struggle in Kashmir.",
  "retrievedAt": "2025-08-11T19:37:38.664Z"
}
