{
  "title": "No apology for Kashmir remarks; can now speak without Indian boycott threats: Mahathir",
  "link": "https://www.app.com.pk/national/no-apology-for-kashmir-remarks-can-now-speak-without-indian-boycott-threats-mahathir/",
  "date_published": "2020-08-08T08:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP):Former Malaysian Prime Minister Mahathir Mohamad Saturday said despite knowing potential backlash, he had spoken in support of Kashmiri people at United Nations General Assembly last year for what he would offer “no apology.”\n“I had chosen to speak out despite being aware of the potential backlash. To my mind, keeping quiet is not an option… I offer no apology for what I had said,” Mahathir said addressing an event held in Kuala Lumpur to mark a year of military siege in Indian Illegally Occupied Jammu and Kashmir.\nDr Mahathir also shared some key points of the address on his Twitter handle which rubbished the impression created by multiple Indian media outlets on Saturday as the Malaysian leader felt any remorse over his remarks in support of the Kashmiri people for its adverse impact on Malaysian exports.\nPutting to rest Indian media assertions, he said though his remarks had affected Malaysian palm oil export to India but “I don’t know if that is a high price to pay for speaking out against such injustices.”\nDuring his last year’s address at United Nations General Assembly, Dr Mahathir Mohamad said, “despite UN resolution on Jammu and Kashmir, the country has been invaded and occupied. There may be reasons for this action but it is still wrong.” He had called for resolution of the issue by peaceful means.\n“India should work with Pakistan to resolve this problem. Ignoring the UN would lead to other forms of disregard for the UN and the Rule of Law,” he had remarked at the United Nations (UN).\nAddressing the event, he said all the tell-tale signs were pointing towards another situation whereby a big and powerful country imposed its will with impunity on a small and defenceless nation.\nMahathir, once world’s longest serving elected leader, said that it was transpired from his “contentious speech” at UN last year that what he had said there was mild and to a certain degree, restrained.\n“Now that I am no more the Prime Minister, I take it that I can now speak without restrain and address the Kashmir issue without threats of boycotts and such,” he remarked.",
  "retrievedAt": "2025-08-11T19:37:46.267Z"
}
