{
  "title": "Tiger Force to break one-day tree plantation record on Sunday",
  "link": "https://www.app.com.pk/national/tiger-force-to-break-one-day-tree-plantation-record-on-sunday/",
  "date_published": "2020-08-08T06:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP): Stage is set for breaking a one-day tree plantation record as the government has completed its preparation for planting around 3.5 million saplings across the country on Sunday (August 9), announced as the ‘Tiger Force Day’ by Prime Minister Imran Khan to recognize the voluntary services of youth during the coronavirus pandemic.\nAll the local administrations along with the Corona Relief Tiger Force (CRTF) members have completed rehearsals in their respective areas to mark the day with full zeal and fervor. The social networking sites are flooded with the pictures of the CRTF volunteers who can be seen rehearsing for the day while donning dedicated jackets, masks and caps.\nSuch activities would obviously pave the way for achieving the ambitious plan of the present government for planting 10 billion trees in the country by 2023. ’10 Billion Tree Tsunami’ is a flagship initiative of the current government to enhance the forest cover and cope with the looming threat of climate changes.\nPreviously, there was a record of planting some 600,000 plants in one-day which was also set by the Pakistan Tehreek-e-Insaf government in Khyber Pakhtunkhwa.\n“All arrangements for commemoration of ‘Tiger Force Day’ have been finalized as 3.5 million saplings are delivered to all the local administrations for the upcoming plantation drive,” said Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar in a video message released here.\nTeams of the tiger force volunteers had been formed for the upcoming drive and they were told about their assignments in that regard, he added.\nUsman Dar said Prime Minister Imran Khan would take part in the plantation drive to boost the morale of the CRTF members, who were fully determined to make the drive a success.\nThe prime minister would kick off the plantation campaign from Islamabad, whereas Chief Minister Punjab Sardar Usman Ahmad Khan Buzdar would launch it in Sialkot.\nHe said the local administrations, forest departments and other stakeholders would fully participate in the drive to make it successful.\nThe SAPM urged the leaders of opposition parties to take part in the plantation campaign as it was a national cause.\nMeanwhile, Usman Dar , who heads the CRTF, met Chief Minister (CM) Usman Buzdar to discuss overall strategy for celebrating the ‘tiger force day’ in the province. The CM Punjab told the SAPM that around 520 ceremonies would be held in connection with the plantation drive.\nHe said the province would plant 1.2 million trees to ensure green environment for the future generations under the vision of Prime Minister Imran Khan.\nThe CRTF was announced in March after the coronavirus pandemic broke out in the country. More than one million youth from across the country signed up for the force which has been receiving acclaim internationally for their volunteerism during the coronavirus pandemic.\nInitially, it was assigned the task of assisting the local administrations in carrying out rescue and relief activities across the country. Later, additional tasks were added to their duties including tree plantation drive, locusts’ surveillance and other services that required more human resource.",
  "retrievedAt": "2025-08-11T19:37:39.744Z"
}
