{
  "title": "Qureshi for enhanced post-COVID cooperation among ASEAN states",
  "link": "https://www.app.com.pk/national/qureshi-for-enhanced-post-covid-cooperation-among-asean-states/",
  "date_published": "2020-08-08T04:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP): Foreign Minister Shah Mahmood Qureshi Saturday while commending the ASEAN states for handling COVID-19 pandemic, called for enhanced cooperation and collaboration among the member states for betterment of humanity.\n“This unprecedented crisis calls for harnessing the spirit of cooperation and collaboration, embodied so admirably by ASEAN, for the greater good of all humanity,” the foreign minister said in his message to Association of South East Asian Nations (ASEAN) and its members, on the 53rd ASEAN Day, a Foreign Office press release said.\nAugust 8, 1967 marks the historic day when five South East Asian nations forged a common platform premised on the basic principles of cooperation, amity and non- interference.\nExtending felicitations to the members, the foreign minister said, “today, ASEAN is a dynamic organization of ten members, spanning an area of 4.4 million square kilometers, a population of over 649 million, and a GDP exceeding US$2.9 trillion.”\nHe said the ASEAN Community Vision 2025, comprising the ASEAN political-security, economic and socio-cultural components provided a blueprint to further integrate, synergize and harness the immense potential of the peoples and economies of the region.\n“In pursuit of this noble endeavour, we wish ASEAN and its members every success,” he remarked.\nThe foreign minister said Pakistan enjoyed close, friendly ties with all ASEAN members and its historic and deep-rooted relations pre-date the modem era, harkening back to abiding linkages forged during the time of the Gandhara Civilization.\nThis enduring and unique relationship finds expression today in Pakistan’s association with ASEAN as a Sectoral Dialogue Partner, and an active member of the ASEAN Regional Forum (ARF). We remain committed to upgrading our partnership with ASEAN to higher levels,” he resolved.\nHe said that in line with its ‘Vision East Asia’ policy, Pakistan would continue to deepen and further strengthen political, economic and cultural ties with ASEAN and its members.",
  "retrievedAt": "2025-08-11T19:37:40.962Z"
}
