{
  "article_id": "2025-02-15_85e619a146323d028c819f85b07bbbfc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-for-greater-cooperation-with-china-in-agriculture-communication-space-technology-industry-2/",
    "retrieved_at": "2025-08-27T12:45:33.265Z"
  },
  "metadata": {
    "title": "President for greater cooperation with China in agriculture, communication, space, technology, industry",
    "author": null,
    "date_published": "2025-02-15T13:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 772,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 15 (APP): President Asif Ali Zardari desired that Pakistan, due to its closer geographical proximity with China, would like to take advantage from the Chinese advancements in different fields including agriculture, communication space, technology and industry. In an interview with CCTV during his recent visit to China and broadcast by the national Tv channels on Saturday, the president said Pakistan accorded high priority to all-weather friendship with China as the latter had always been a steadfast friend and stood by Pakistan in difficult times. He also reaffirmed Pakistan's unwavering support to China, its leadership and the nation, saying that they firmly believed in their strongest friendly bonds. He said Pakistan, due to its geographical location and owing to mutual extensive cooperation and partnership, wanted maximum benefits from the Chinese advancements and experiences in different fields. He also termed the Chinese achievements in realms of science and technology as the 'good thing' for the entire world and the region. The president said agriculture was a sector where China could help as Pakistan's per acre yield was less when compared with China. Responding to a query to China-Pakistan cooperation in space technology, he said Pakistan wanted to take advantage from the Chinese technology, adding Pakistan was growing its capacity in this regard by forging partnership with China, 'which is a good thing'. He said Pakistan could use the Chinese technology for its advancement, in every field, whether it was utility of water or it was climate change. Pakistan wanted to take advantage from the Chinese lessons. The president expressed his satisfaction over the pace of connectivity and development under the umbrella of CPEC which was fast transforming the economic landscape of Pakistan. The president said, during his recent visit to China, the two sides had discussed the industrial development. The industrial parks would be only for China; and worked upon by the Pakistani labourers while the chief executive of a company could be running a business online while sitting in China. The president said that China and Pakistan were known as all-weather friends. \"If I cannot develop myself to China's standards, I can bask in China's glory,\" he said, underscoring to take advantage from the Chinese technology for their coming generations. Responding to a query, he said Pakistan wanted to take advantage of its position and its ties with the Chinese people that spanned over centuries. Expressing his affection for the Chinese people, he said that he loved them and would always stand with China. \"Goodwill, goodwill and goodwill\", it is always the trust and goodwill and in-depth relationship,\" the president said while summoning up his recent visit. The president also lauded President Xi as a 'very strong and very steadfast' who understood a lot of things, adding that he wanted to convey to the world that they were all-weather friends. Further admiring President Xi's political philosophy and his governance; he observed that China had made strides in different fields, showing 'a very vast difference' under the Chinese president's leadership. To another question, President Zardari said that relationship between Pakistan and China was centuries old as people from the two countries had been travelling and interacting with each other. This relationship was based upon humanity and trust, he said, adding the Chinese people had never been inhuman and never gone to another country to massacre people. China had never been an occupier. President Zardari, who held meetings with the Chinese leadership during his visit, said that Pakistan had been home to the world's oldest civilizations like Harrapa and Mohenjo-daro while the Chinese had their own oldest global civilization that tied them together. To a query about China's progress, he said that every time he arrived there, he was impressed with the new developments in different cities and cited Beijing city where he had last visited ten years back. It was the fact that the Chinese people were hard-working. Everybody was working in his own field for the collective advantage of the Chinese nation, he opined. The president said China has been home to 1.4 billion people and the world could not compete because it was all about the new technology. About China's rapid advancements in different sectors, he said the world should not be scared of such rapid growth. He said Pakistan as a neighbor knew that the Chinese were not the kind who wanted to interfere in other country. \"I will never be scared of China\" in terms of its fast progress,\" he maintained. President Zardari expressed his confidence that Shanghai Cooperation Organization (SCO), as the significant global forum, would move forward after China assumed its chair for the next year.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}