{
  "article_id": "2025-02-15_728583c45fe955111385421cc9aad9fe",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ifc-chief-says-planning-2-bln-annual-equity-investments-in-pakistan-for-decade/",
    "retrieved_at": "2025-08-27T12:45:47.133Z"
  },
  "metadata": {
    "title": "IFC chief says planning $2 bln annual equity investments in Pakistan for decade",
    "author": null,
    "date_published": "2025-02-15T08:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 264,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 15 (APP): International Finance Corporation's Chief Makhtar Diop has said that IFC is increasing equity investments and eyeing large-scale infrastructure financing in Pakistan, in an investment plan that could unlock $2 billion annually over a decade. \"Between now and maybe October, we will be able to progress enough on a couple of transactions that will signal that this is a country ready to receive large-scale financing for critical and important infrastructure,\" said Makhtar Diop, the corporation's managing director told Reuters during his visit to Pakistan. International Finance Corporation chief Makhtar Diop's maiden visit to Pakistan follows the World Bank's plans to allocate up to $20 billion for Pakistan under a Country Partnership Framework announced in January, with the IFC (the World Bank's private investment arm) also slotted to invest the same amount. Diop said a $2 billion annual investment \"is not a large number\" for Pakistan, which needs infrastructure development in international airports, energy, water and ports. According to Reuters, the IFC had an exposure of $2.1 billion in Pakistan during the fiscal year 2024, ending in June, marking its record investment in the South Asian country's $350 billion economy. Diop said the IFC is looking into agriculture, infrastructure, the \"very important\" financial sector, and the digital sector. Diop said equity-based transactions were to be expected in Pakistan too. \"Debt will still be a very important part in our business, but our equity will increase in the world, but also in Pakistan. It means we are believing really in Pakistan because we can take equity for a long, long time,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}