{
  "title": "ANP-led multiparty moot declares past policies ‘a failure’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A multiparty conference (MPC) on Sunday declared that past internal and foreign policies are responsible for the current instability and terrorism plaguing Pakis­tan, particularly in the Khyber Pakht­unkhwa and Balochistan provinces.\n\nThe conference, organised by the Awami National Party (ANP), asserted that peace and development are not possible without democracy, the supremacy of the constitution, and granting rights to the provinces.\n\nAlthough 20 political parties atten­ded the conference, the PTI was absent. According to ANP sources, the PTI was invited to the conference, but no prominent leader from the party attended it on Sunday.\n\nAttendees included Senator Aimal Wali Khan, JUI-F chief Maulana Fazlur Rehman, PML-N’s Irfan Siddiqui and PPP’s Nayyer Bukhari, among others.\n\nCalls for an end to military operations in KP, Balochistan\n\nIn a joint declaration, the participants condemned all forms of terrorism and extremism, which they alleged were a result of past policies, and stressed the need for new steps to address the issues.\n\nThe declaration suggested an end to military operations in KP and Balochistan and called for the establishment of a “Truth Commission, under judicial oversight, to investigate losses”. The participants also demanded the abolition of so-called “death squads” and illegal armed groups to protect citizens.\n\nThe conference urged for the full implementation of the 18th Constitu­tional Amendment and suggested that non-constitutional bodies, especially the Special Investment Facilita­tion Council (SIFC), should be abolished.\n\nThe participants stated that the National Finance Commission (NFC) Award should be implemented as per the Constitution and that the rights of provinces over their minerals and resources must be granted.\n\nThe declaration also suggested the cancellation of land allotments in Balochistan and KP.\n\nOn human rights, the participants of the meeting called the enforced disappearances a violation of the Constitution and demanded that all missing persons be recovered and produced in courts.\n\nThey also called for the release of political prisoners, the lifting of travel restrictions on politician Sardar Akhtar Jan Mengal, and the abolition of the Peca Act to ensure media freedom.\n\nThe declaration stated that Pakis­tan should not participate in foreign wars and should remain neutral. It called for historic trade routes to be reopened and for the return of internally displaced persons (IDPs) to their homes. It also demanded an halt to the forced repatriation of Afghan refugees.\n\nAdditionally, the declaration rejected a proposal to merge the Levies Force with the police in Balochistan and the decision to merge the Frontier Consta­bulary with the Federal Constabulary.\n\nIt demanded that all powers in the merged districts be transferred to the civil administration and that laws like the “Action in Aid of Civil Power” be abolished.\n\nThe declaration demanded a relief package for flood-affected districts in Khyber Pakhtunkhwa and handing over of Rescue 1122 vehicles to the provincial government.\n\nHowever, PML-N and PPP refused to sign the joint declaration.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/18095208f95de9e.png",
  "retrievedAt": "2025-08-20T04:54:37.362Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931596/anp-led-multiparty-moot-declares-past-policies-a-failure",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:32:51.000Z"
}
