{
  "title": "PTI workers arrested in Lahore for celebrating ‘Quaid Day’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: In the Pakistan of today, the Pakistan Tehreek-i-Insaf says, even displaying Quaid-e-Azam’s pictures has been declared a crime as on Independence Day, the first time in history, the founder of the country’s image was absent from the government advertisements, banners, and official ceremonies.\n\nPTI leader Shayan Bashir on Sunday said that in response to the situation, the PTI announced observing ‘Quaid Day’ on Aug 16. Public came out on the streets holding Quaid’s pictures, but the brutal police of the fake government not only subjected them to violence and carried out illegal arrests, but also went so far as to run over motorcyclists with government vehicles, he added.\n\n“This is not only a clear example of fascism and shamelessness but also undeniable proof of hatred towards the founder of Pakistan,” Mr Bashir observed.\n\nBy removing Quaid’s picture from official posters and replacing it with those of fugitive thieves, he stated, the authorities revealed their true intentions.\n\nHe lamented that even a gathering organised by civil society for offering prayers for the Quaid-i-Azam was savagely attacked by the police, during which more than a hundred people, including reporters,were arrested. “This horrific conduct makes it clear that justice, law, and ethics have completely vanished in the country.”\n\nThe PTI leader said that the fake government propped up by undemocratic forces had crossed all limits. After trampling upon the constitution and the law to corner Imran Khan and his party, the PTI observed, the rulers are now trying to erase the founder of Pakistan under some sinister agenda – an attempt that the PTI and the people of Pakistan will, at all costs, foil.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/181049331a645ed.png",
  "retrievedAt": "2025-08-20T04:54:24.160Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931547/pti-workers-arrested-in-lahore-for-celebrating-quaid-day",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:33:15.000Z"
}
