{
  "title": "Alcaraz to face defending champ Sinner in Cincinnati final - Sport - DAWN.COM",
  "author": null,
  "content": "CINCINNATI: World number one Jannik Sinner and hot rival Carlos Alcaraz will face off in a major final for the fourth time this season after both booked straight-set wins into the title match at the ATP-WTA Cincinnati Open on Saturday.\n\nDefending champion Sinner ruthlessly subdued 136th-ranked qualifier Terence Atmane 7-6(7/4), 6-2 while Spanish second seed Alcaraz defeated an ailing Alexander Zverev, who was suffering badly from the 32 Celsius heat and humidity, by 6-4, 6-3.\n\nAlcaraz and Sinner have played for trophies this season in Rome, Roland Garros and Wimbledon, with the Italian winning their most recent at the All England Club last month.\n\nSinner, celebrating his 24th birthday, ended Frenchman Atmane’s dream run and will now try to become the first man since Roger Federer in 2014-15 to win back-to-back titles in Cincinnati.\n\nSinner, tuning up for the US Open in his first tournament since winning Wimbledon, hasn’t dropped a set en route to the final.\n\n“It’s a very, very tough challenge every time you play a new opponent,” Sinner said. “In the later stages of the tournament, the pressure is on, they deserve to be there.”\n\nAlcaraz will also be playing in his second Cincy final after losing to Novak Djokovic in 2023.\n\nThe Spaniard increased his ATP season match win lead to 53 in a year of five titles.\n\nAlcaraz broke Zverev once in the opening set to claim it before the German, who is diabetic, began feeling poorly and took a medical timeout off court after the third game of the second set.\n\nZverev, who has retired in only two matches since 2014, came back out to finish what was a patchy match from Alcaraz, who double-faulted for times in the second game of the second set but won the last 12 points with Zverev running on fumes.\n\n“We started well with good rallies, a good level,” Alcaraz said. “All of a sudden he felt bad and I was thinking more about how he was feeling instead of playing good tennis. “It was tough and I just wish him all the best.”\n\nAlcaraz said he is keen to try and take his Wimbledon revenge on Sinner in the unorthodox Monday final.\n\n“We always bring our best tennis. We raise each other’s level. I’m ready to take the challenge,” Alcaraz said.\n\n“I will try and adjust my game better and correct what I did wrong in our last match. I want to be ready with my 100%. Mentally I’ll be ready — I’m excited for Monday.”\n\nMeanwhile, Sinner had his hands full throughout a tightly contested first set which featured an imperious serving display from both men and not a single break point opportunity for either player.\n\nSinner, who lost just three points on serve in the opening set, held to love for a third consecutive game to force the tiebreak where Atmane gifted his opponent the opening point with a double fault. From there the Italian never looked back.\n\nThe reigning US Open, Australian Open and Wimbledon champion opened the second set with a nine-minute hold of serve, then held to love before finally breaking for a 3-1 lead that gave him the cushion he needed.\n\nSinner followed that with another hold to love to go 4-1 up and all but end any hope for Atmane, who beat top-10 players Taylor Fritz and Holger Rune en route to his maiden ATP Masters 1000 semi-final.\n\nWith Atmane serving to stay in the match, Sinner quickly jumped ahead 0-40 before sealing the win on his third match point when the Frenchman sent a forehand into the net.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a26f42d7e1d.gif",
  "retrievedAt": "2025-10-12T03:50:41.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931578/alcaraz-to-face-defending-champ-sinner-in-cincinnati-final",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:32:58.000Z"
}
