{
  "title": "Northern China flash flood kills 10 - World - DAWN.COM",
  "author": null,
  "content": "BEIJING: At least 10 people died in a flash flood in northern China, state media reported on Sunday, with two others still missing, as the East Asian monsoon continues to unleash atmospheric chaos across the world’s second-largest economy.\n\nThe banks of a river running through the grasslands of Inner Mongolia burst at around 10pm on Saturday, the report said, washing away 13 people camping on the outskirts of the city of Bayannur, a major agricultural hub.\n\nA search and rescue operation involving more than 700 people is underway, according to state news agency Xinhua. One person has been rescued.\n\nChina has suffered weeks of extreme weather since July, battered by heavier-than-usual downpours with the monsoon stalling over its north and south. Weather experts link the shifting pattern to climate change, testing officials as flash floods displace thousands and threaten billions of dollars in economic losses.\n\nBayannur is an important national grain and oil production base, as well as a sheep breeding and processing centre.\n\nAt the other end of the country, a three-and-a-half-month fishing suspension in the southern province of Hainan ended on Saturday, state media reported, after agricultural affairs officials ordered ships to shelter in port owing to persistent, heavy rain.\n\nIn the southwestern province of Sichuan, severe weather on Friday killed two people and injured three others at a beer festival in the city of Mianzhu, after a truss fell on them, according to a local police report on Saturday.\n\nThe deluge in Inner Mongolia follows a deadly downpour in Beijing — just under 1,000 km (621 miles) away — late last month which killed at least 44 people and forced the evacuation of more than 70,000 residents.\n\nThe central government announced last week 430 million yuan ($59.9 million) in fresh funding for disaster relief, taking the total allocated since April to at least 5.8 billion yuan.\n\nA flash flood in Inner Mongolia killed nine people and left three missing, Chinese state media said. A group of 13 people were camping outdoors in Inner Mongolia’s Urat Rear Banner when a flash flood occurred around 10pm on Saturday, state news agency Xinhua said.\n\nAs of Sunday afternoon, one person had been rescued and over 700 workers were “urgently” searching for the missing, Xinhua added. The Ministry of Emergency Management has ordered full-scale rescue efforts, verification of the status of the missing, and dispatched a working group to the scene, state broadcaster CCTV said.\n\nNatural disasters are common across China, particularly in the summer, when some regions experience heavy rain while others bake in searing heat. The death toll from flash floods and mudslides in northwest China in early August was at least 13, state media said previously.\n\nHeavy rain in Beijing in the north also killed 44 people last month, with the capital’s rural suburbs hardest hit, and another eight people died in a landslide in nearby Hebei province. Scientists have shown that human-driven climate change is causing more intense weather patterns that can make destructive floods more likely.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:50:42.306Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931582/northern-china-flash-flood-kills-10",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:33:03.000Z"
}
