{
  "title": "Sharaa hopes for Kurdish deal to prevent conflict - World - DAWN.COM",
  "author": null,
  "content": "AMMAN: Syrian President Ahmed al-Sharaa has expressed hope that his country would avoid military conflict with US-backed Kurdish forces if efforts to integrate their autonomous administration in northeast Syria into the state structure collapse.\n\nIn remarks late on Saturday to senior figures from Idlib, where he has mustered loyalist forces, Sharaa said Kurdish leaders had signalled readiness to move forward with a landmark deal in March to bring their Kurdish-run areas under state authority.\n\nBut their actions on the ground suggested otherwise, he told the publicised forum. At times on the ground there are signals opposite to what they say in the negotiations, Sharaa said.\n\nTurkiye and Washington, the main powers backing the deal to integrate Syria’s oil-rich northeast into the state, wanted to resolve the issue peacefully, Sharaa said.\n\n“These parties are pushing for a solution peacefully. I hope we don’t enter into a dispute. I am hopeful in a few months we will resolve it,” he said.\n\nThe collapse of follow-up talks since the March deal has escalated tensions in the region, triggering fresh clashes this month between government troops and the Kurdish-led, US-backed Syrian Democratic Forces (SDF).\n\nThe SDF, which controls parts of northeast Syria where Arabs form a majority, has recently fortified extensive tunnel networks along the frontlines. Many tribal Arabs accuse the SDF of discriminatory policies — claims Kurdish officials deny.\n\nTurkiye-backed rebels have also reinforced their positions amid concerns over a potential large-scale escalation in hostilities, officials say. Ankara has warned of military action against the SDF, which it considers a terrorist organisation and has targeted in past cross-border operations. It expects the Syrian government to address its security concerns but says it reserves the right to mount an offensive if needed.\n\nUS envoy for Syria, Tom Barrack — an advocate for a strong, unified Syrian state — voiced concern last month over Kurdish delays in implementing the March deal, urging faster progress. Authorities in Damascus reacted earlier this month angrily to a recent SDF conference calling for greater decentralisation and which demanded a review of a constitutional declaration it said discriminated against minorities, a move officials said threatened Syria’s territorial integrity.\n\nSyrian officials said any military push against the SDF would rely on Turkish-backed factions operating in northern Syria, adding that Ankara has grown impatient with what it sees as Kurdish foot-dragging.\n\nSharaa said those who sought partition were dreaming and insisted the country would not give up any stretch of territory. He also criticised Druze groups seeking support from Israel in their confrontation with Damascus.\n\nThousands joined a large Druze protest in Sweida on Saturday, demanding self-determination, hoisting Israeli flags and praising Israel for a military intervention that forced Syrian forces to retreat after hundreds of people were killed last month.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:54:26.073Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931585/sharaa-hopes-for-kurdish-deal-to-prevent-conflict",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:33:03.000Z"
}
