{
  "title": "Karachi woman remanded in police custody for killing minor son, daughter - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate on Sunday remanded a woman in police custody in a case pertaining to the killing of her two minor children.\n\nThe investigating officer (IO) of the case brought Adeeba, 37, before the duty judicial magistrate (South) and sought her physical custody for 14 days.\n\nAccording to the IO, the court was informed that the complainant, Ghufran Khalid, had lodged an FIR stating that on Aug 14, at around 2:30pm, he received a phone call from his ex-wife, Adeeba. During the call, she asked him if he knew what she had done. When he replied in the negative, she made a video call and showed him that she had murdered their two children, who had been staying with her.\n\nSubsequently, the father of the minors informed his relatives about the incident and later stated that his ex-wife had killed the children with a sharp-edged weapon.\n\nThe IO sought her physical remand to interrogate her and ascertain the source of the crime weapon.\n\nAfter hearing the IO, the court remanded her in police custody for two days and directed the officer to submit a progress report at the next hearing.\n\nAccording to the police, they had recovered the knife used in the double murder. They added that the couple had separated last year and the issue of custody of the children was taken to a family court, which gave the decision in favour of the father. However, the mother was allowed to meet her children.\n\nA case has been registered at the Darakhshan police station under Section 302 (murder) of the Pakistan Penal Code.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:51:04.760Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931565/karachi-woman-remanded-in-police-custody-for-killing-minor-son-daughter",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:33:10.000Z"
}
