{
  "title": "Arsenal battle to beat United, Chelsea held by Palace - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Arsenal’s quest for Premier League glory got off to a winning start as Riccardo Calafiori’s goal beat Manchester United 1-0 on Sunday, while world champions Chelsea were lucky to escape with a 0-0 draw against Crystal Palace.\n\nAfter finishing second for the past three seasons, the pressure is on Arsenal boss Mikel Arteta to deliver the club’s first league title since 2003/04.\n\nThe Gunners were far from impressive at Old Trafford but earned a huge three points thanks to a glaring error from United’s stand-in goalkeeper Altay Bayindir.\n\nThe Turkish international flapped at Declan Rice’s corner on 13 minutes, presenting Calafiori with the simple task of heading into an empty net.\n\nUnited gave debuts to all of their new 200 million ($271 million) attacking trident of Matheus Cunha, Bryan Mbeumo and Benjamin Sesko but could not find a way past the Premier League’s best defence for the past two seasons.\n\nPatrick Dorgu came closest to an equaliser when the Dane smashed against the post from long range.\n\nIt was a tale of the two goalkeepers as Arsenal stopper David Raya also produced fine saves to deny Cunha and Mbeumo a perfect start to their United careers.\n\nEarlier, Chelsea suffered a Club World Cup hangover as they were kept at bay by FA Cup winners Palace.\n\nThe Eagles were denied an early opener when Eberechi Eze’s free-kick was ruled out by a VAR review for Marc Guehi obstructing the Chelsea wall.\n\nNew Chelsea signing Estevao came closest to snatching a winner for the home side, but the newly-crowned world champions were blunt in attack against a well-organised Palace defence.\n\nPalace’s key duo of Guehi and Eze started despite mounting speculation the England internationals are set to join Liverpool and Tottenham Hotspur, respectively.\n\n“As long as they are 100 per cent committed, they will play as they are so good,” said Palace boss Oliver Glasner.\n\n“They didn’t just show they are great footballers, but they are great persons and that’s what I expected.”\n\nChelsea’s demolition of European champions Paris St-Germain in the Club World Cup final last month had raised the Blues’ hopes they can challenge for a first Premier League title since 2017.\n\nBut Enzo Maresca bemoaned his side’s lack of preparation time since beating PSG in New York just 35 days ago.\n\n“They played about eight (pre-season) games, we played just two so we tried our best,” said the Italian.\n\n“We expected a tough game. Apart from the first half free-kick, we didn’t concede any chances.”\n\nMeanwhile, Nottingham Forest made light of manager Nuno Espirito Santo’s pre-season fears over a lack of signings with a dominant 3-1 win over a much-changed Brentford.\n\nChris Wood struck twice either side of Dan Ndyoe’s debut goal for Forest on a nightmare afternoon for new Brentford boss Keith Andrews.\n\n“It was a very good first half. The combinations were really good, beautiful goals,” said Nuno. “This is why we are insisting on a good balanced squad that gives us options and solutions.”\n\nThe Bees have lost their manager, captain and top scorer in the off-season.\n\nThomas Frank left to take charge of Tottenham, Mbeumo got his dream move to Manchester United and Arsenal secured Christian Norgaard.\n\nYoane Wissa was also missing from the Brentford squad ahead of an expected move to Newcastle United.\n\nIgor Thiago’s first goal for the club from the penalty spot late on was the only consolation for the visitors.\n\n“I do have genuine belief but we have to take responsibility for a first half that wasn’t good enough,” said Andrews.\n\nHAALAND GETS DOUBLE\n\nOn Saturday, Erling Haaland struck twice as Manchester City kicked off their Premier League campaign with a crushing 4-0 win at Wolverhampton Wanderers.\n\nNew signings Tijjani Reijnders and Rayan Cherki netted debut goals for Pep Guardiola’s revamped team in what they hope will be the first step towards improving on last season’s disappointing third-place finish.\n\nHaaland, who has scored in all four season-opening games during his spell in England’s top flight, struck in the 34th minute when Reijnders chipped a ball through to Rico Lewis who sent in a low cross for the Norwegian to tap home.\n\nReijnders scored three minutes later when Oscar Bobb, who missed most of last season with a broken leg, pounced on a loose pass before setting up the Dutch midfielder who fired the ball into the far corner.\n\nHaaland, the Premier League’s top scorer in his first two seasons at City, completed his brace in the 61st minute when Bobb pulled the ball back for him to fire a low drive past Jose Sa.Cherki completed the rout after 81 minutes to ice an emphatic start to the season for City, who won the title four years in a row from 2021-24.\n\nA summer of change followed City’s season without a trophy, as they acquired Reijnders, Cherki, Rayan Ait-Nouri and James Trafford, with Jack Grealish, Kyle Walker and Kevin De Bruyne among stalwarts to leave.\n\nIt was an emotional start to the game at Molineux as fans participated in a minute of applause in memory of former Wolves forward Diogo Jota and his brother Andre Silva, who died in a car crash in July.\n\nA huge banner read; “We’ll remember you when you walk in fields of gold”.\n\nThe fans chanted “Diogo, Diogo” in the 18th minute — Jota’s Wolves shirt number at Wolves — and his shirt was laid on the pitch after full time.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a26ddf7d658.gif",
  "retrievedAt": "2025-10-12T03:50:41.168Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931569/arsenal-battle-to-beat-united-chelsea-held-by-palace",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:32:58.000Z"
}
