{
  "title": "Challenging karo-kari, strong women forge sisterhood in rural Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Slowly but surely there is a silent revolution under way in many cities of Sindh and it is because of a movement started by the government-financed Sindh Rural Support Organisation (SRSO), which works towards women-focused community mobilisation and development.\n\nThe SRSO basically works towards the uplift of talented folks by making them realise that they ‘can’ do anything. This they do by providing them training for setting up businesses followed by giving them interest-free loans to make them self-reliant.\n\nBut in giving their lives new directions, even the SRSO is pleasantly surprised to notice a positive “side effect” to its efforts — women’s empowerment. It not only makes them financially independent, but also resilient, bold, and confident enough to stand up for their rights and challenge illegal practices like karokari. They have become role models who give strength to others to stand up against such dark traditions. It is a sisterhood like no other.\n\nHafeeza from Ghotki said that she had proved herself by running small businesses, for which she got training from the SRSO. “They also taught us how to save money besides making a respectable income,” she said. Hafeeza said that it was through the sisterhood of strong women she met at the SRSO and her union council that she was able to save her son and niece, who were wrongly accused and being sentenced in a case of karo-kari.\n\n“My son and niece — my sister’s daughter — were locked up due to a misunderstanding by the people of my village. They would have been killed for sure had I not reached out to the women in our working groups. They said to me that I am always there for them so they will be there for me when I need help. Seeing our numbers, the mob was also taken aback. Somehow we locked up their leaders while freeing our children whom we helped escape. Safe now, they have both moved on with their lives individually.\n\nSRSO is actively working to empower communities, making them self-reliant and courageous through mobilisation, training, and awareness\n\nNaseem Khoso of Shikarpur said that earlier if anyone, even the police, heard of any domestic issue or accusations of karo-kari they would not interfere saying that people should be allowed to handle their personal issues.\n\n“But the SRSO works through local support organisations of which we are also a part. The local support organisation in our union council heard about a case where the husband of a woman would gamble. During a gambling argument he accused the man he had lost money to of having ‘illegitimate relations’ with his wife. No one in the village came to the woman’s rescue until we got to hear of the matter,” she said.\n\n“It was pressure from our women groups that the Superintendent of Police sent out as many as seven mobiles to the house of the wrongly-accused woman to rescue her. We also got her to divorce her husband. Today, she has started life afresh somewhere else and is happily married,” said Naseem. “All this courage we could only gather after realising our worth and potential. We don’t need anyone to depend on. We have to help ourselves or no one will come forth to help us,” she added.\n\nWhen Mahnaz Mahar’s older son fell sick, the poor peasant woman could not afford the medicine prescribed for him by the doctor. “He had prescribed an antibiotic which cost 350 rupees. I sold my nose pin then which fetched only half of the amount so I bought fever medicine and cough syrup for my son from that money. It could not help him and I lost him,” she said.\n\n“But that day, I promised myself to never be caught in such a helpless situation again,” she added.\n\nThrough a loan of just Rs15,000 from the SRSO in 2009, Mahnaz bought a little calf. In three years it fetched her Rs120,000. She also enrolled in training through the SRSO, and met many like-minded women, there.\n\n“I had studied only up to class three. But I’m a matriculate today,” she says. She also runs a small restaurant in Shikarpur. I also started working with the union council of my area. If I find anyone sick or in pain, I don’t leave them alone. I take them to doctors, hospitals, I’m there for whoever needs me, and it is all because of gaining awareness about what I’m capable of,“ she concludes.\n\nKhalida Paveen of Ghotki said that things started changing for the better as they changed themselves for the better. “When we changed, the attitudes of people towards us also changed,” she pointed out.\n\nRukhsana Sarki of Jacobabad said that the SRSO was a dream of the late prime minister Benazir Bhutto for the women of Sindh. “She wanted to see us empowered and strong. Today, Bilawal and Asifa, her children are witnessing the realisation of their mother’s dream,” she said, becoming a little emotional.\n\nAliya Mirani of Sukkur said that they were a part of many of the SRSO’s projects, which tell them about their legal rights. “For instance, in 2020, we also took part in some training sessions organised by the UN Women against violence,” she said.\n\nSamira Laghari of Qambar Shahdadkot said that after attending the various courses and being part of the SRSO’s projects, she felt that she had the courage not to accept any decision made about her without first asking herself what she thought of it.\n\n“Earlier, we just used to be kept under the thumb of landlords because we used to be dependent on them for our livelihoods. We had no schooling, no money, no awareness and no respect so we wouldn’t question anything. But now after becoming aware, we can also snatch our rights from those who don’t give them to us readily,” she said.\n\nThe SRSO’s CEO, Muhammad Zulfiqar Kalhoro, popularly known as “Dittal Saaen”, said that it was their vision to socially and economically empower communities through women-focused community mobilisation programmes. “The Sindh government supports our policy to alleviate poverty by providing resources. The rest these people do for themselves,” he concluded.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/18110610c7a867b.png",
  "retrievedAt": "2025-08-20T04:54:25.005Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931564/challenging-karo-kari-strong-women-forge-sisterhood-in-rural-sindh",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:33:10.000Z"
}
