{
  "title": "War on truth - Newspaper - DAWN.COM",
  "author": null,
  "content": "AS Israel’s military onslaught on Gaza intensifies, targeting and assassinating journalists is part of its genocidal campaign. Last week, four Al Jazeera journalists were killed in cold blood, among them Anas al-Sharif, the most prominent face on the global television network who had courageously been reporting on the catastrophic war and famine conditions in Gaza. The journalists were killed in a drone attack on a makeshift media tent outside Al-Shifa hospital. Targeting journalists is a war crime but Israel has acted with impunity and has long shown contempt for international humanitarian law or norms.\n\nThe Israeli military has been carrying out deliberate assaults on journalists since its war on Gaza began nearly two years ago. According to the UN, 242 journalists have been killed in that period, which is described as the highest number in any conflict. Israel’s military claimed responsibility for the murder of Anas al-Sharif saying he was a “Hamas terrorist” — a patently false allegation that Al Jazeera vehemently denied. Labelling journalists as militants is a disingenuous tactic Israel has always used. According to the Israeli-Palestinian news outlet ‘+972 magazine’ Israel’s military has a special unit charged with identifying journalists to ‘smear’ as Hamas members and target them.\n\nThe killings of journalists sparked global outrage. UN Secretary General António Guterres denounced it and the UN’s Human Rights Office called it a grave breach of international law. Journalists’ bodies and human rights organisations, including Reporters without Borders, Amnesty International, Human Rights Watch and the Committee for the Protection of Journalists all issued strong condemnations of these extrajudicial murders and called for accountability and international action to stop Israel. There have been worldwide protests over the killings.\n\nClearly, Israel’s intent is to silence voices and prevent media coverage of the atrocities and war crimes it is committing in Gaza as well as the mass starvation it has subjected Palestinians to. Suppressing the truth is a time-old practice of occupying forces, but it is always in vain. Despite Israel’s ban on the international media from reporting from Gaza, the world knows exactly what’s happening there, thanks to brave local journalists who have risked their lives to report the atrocities. Pictures of starving children have been on television screens across the world and video footage of Israeli soldiers firing on desperate aid-seekers have gone viral on social media. This, in fact, is the most documented genocide in history.\n\nEven though Israel faces global isolation, US backing enables it to continue its genocidal war.\n\nIsrael has stepped up both its military offensive and its war on truth ahead of its planned takeover of Gaza City leading to the full occupation of Gaza. Prime Minister Benjamin Netanyahu announced his plan for the military capture of Gaza City earlier this month with Israel’s military given the go-ahead to launch an offensive to achieve this objective. This prompted worldwide condemnation with UN officials warning it would lead to “unimaginable suffering” and “another calamity”, which would reverberate across the region. Arab states, Pakistan, the EU and many Western countries denounced the impending move. In an emergency meeting of the Security Council on Aug 10, China, the UK, France, Russia and other members voiced opposition to the plan and called on Israel to reverse its decision. The only exception was the US, which backed Israel.\n\nThe shift in global especially Western opinion against Israel is palpable. It is being driven by the humanitarian catastrophe in Gaza and Israel’s use of starvation as weapon of war. As a BBC correspondent put it, “Starvation appears to be an inflection point for European countries — a moral impetus to drive their divergent diplomacy.” Last week, the foreign ministers of 27 countries, including over 20 European nations, issued a joint statement demanding that Israel allow unhindered aid into Gaza.\n\nMore Western nations are moving towards recognition of a Palestinian state. Australia has followed France, Canada and the UK, who announced plans to recognise Palestinian statehood, even though the UK has qualified that by saying it will refrain from doing so if Israel moves towards ending the war. France’s decision is particularly significant as it is a permanent member of the UN Security Council. These announcements are aimed at raising diplomatic pressure on Israel but haven’t been enough to stop it from continuing the war. As of now, 147 of the UN’s 193 member states recognise the state of Palestine.\n\nThe US, of course, remains opposed to recognition, saying that would reward Hamas. This echoes Tel Aviv’s stance. The US position on a two-state solution, which it long supported but is now ambivalent on, isolates it from the rest of the international community and bucks the global consensus reflected in several Security Council resolutions. Mike Huckabee, the American ambassador in Israel said in June — and wasn’t contradicted by the administration — that he did not think a sovereign Palestinian state is still a goal of US foreign policy. If this is the case, then it marks a significant shift in American policy under President Donald Trump. Again, it would be in line with Israel’s complete rejection of a Palestinian state and imply backing Netanyahu’s vision of a ‘Greater Israel’, a notion that has recently been condemned by the OIC.\n\nDespite Israel’s growing global isolation, Netanyahu can ignore that as well as violate international law and continue its ethnic cleansing policy because he can count on unwavering US support. Trump’s oft-repeated desire for a Gaza ceasefire rings hollow as he has done nothing to pressure Israel in this direction. Throughout the war, Washington has extended military, diplomatic and financial support to Israel. It has also backed the militarised aid-distribution system Israel set up, which has been rejected by the UN and is widely seen as ‘death traps’; over 1,400 Palestinians have been killed while seeking food at these sites.\n\nAll this with no real effort to restrain Netanyahu, has given Israel a licence to do whatever it wants in Gaza. The US has also not dissuaded Tel Aviv from its disastrous plan to take over Gaza City and eventually reoccupy the entire Strip. Washington and the self-proclaimed ‘man of peace’ are fully complicit in the catastrophic situation in Gaza. And the world, for all its condemnations and moral outrage, has been unable to mount real pressure on the US to change course.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a289dc4b6bb.jpg",
  "retrievedAt": "2025-08-20T04:54:39.696Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931621/war-on-truth",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T02:05:39.000Z"
}
