{
  "title": "Indian foreign minister stresses on border peace in talks with China’s top diplomat - World - DAWN.COM",
  "author": null,
  "content": "Indian Foreign Minister Subrahmanyam Jaishankar began talks with his Chinese counterpart Wang Yi in New Delhi on Monday and stressed that there could be positive momentum in ties between the neighbours only if there was peace on their border.\n\nWang arrived in the Indian capital on Monday for a two-day visit during which he will hold the 24th round of border talks with Indian National Security Adviser Ajit Doval and also meet Prime Minister Narendra Modi.\n\n“This (discussing border issues) is very important because the basis for any positive momentum in our ties is the ability to jointly maintain peace and tranquility in the border areas,” Jaishankar told Wang in his opening remarks.\n\nIt is also important for the two countries to pull back their troops amassed along their disputed border in the western Himalayas since a deadly border clash in 2020, Jaishankar said.\n\nIndia’s foreign ministry said in a social media post that “important engagements of the India-China Special Representatives and on bilateral relations” were scheduled over the next two days.\n\nWang’s visit comes days before Modi travels to China — his first visit in seven years — to attend the summit of the Shanghai Cooperation Organisation, a regional political and security group which also includes Russia.\n\nRelations between the Asian giants began to thaw in October after New Delhi and Beijing reached a milestone pact to lower military tensions on their Himalayan border following talks between Chinese President Xi Jinping and Modi in Russia.\n\nThe world’s two most populous nations are intense rivals competing for influence across South Asia, and fought a deadly border clash in 2020.\n\nBut caught in global trade and geopolitical turbulence triggered by US President Donald Trump’s tariff war, the countries have moved to mend ties.\n\nRestarting border trade across their icy and high-altitude Himalayan border is expected to feature high on Wang’s agenda. Its resumption would be significant for its symbolism, and follows agreements to return direct flights and issue tourist visas.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:54:11.159Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931690/indian-foreign-minister-stresses-on-border-peace-in-talks-with-chinas-top-diplomat",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T14:03:45.000Z"
}
