{
  "title": "Country’s running well, no need for 27th Amendment: FM Dar - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Monday said that the country was “running well” and experiencing stability and economic improvement, adding that there was no need for a 27th Constitutional Amendment.\n\nEven though the 26th Amendment remains mired in controversy, the power corridors in Islamabad had been abuzz with talk of a possible 27th Constitutional Amendment, which, according to insiders, would further ‘fine-tune’ the structure and the functioning of the superior judiciary.\n\nSpeaking to reporters in London during a visit to the United Kingdom, the deputy PM said: “We are still digesting the 26th Constitutional Amendment, so there is no need for a 27th right now. The country is running well. There is stability and economic improvement.\n\n“We are putting our full attention towards GDP growth and development. Under [Prime Minister] Shehbaz Sharif’s leadership, all efforts are being made.”\n\nDar added that under the leadership of former prime minister Nawaz Sharif in 2017, Pakistan was “the 24th-biggest economy” and added that the government was working to bring the economy back to that point.\n\n“We are headed that way very quickly, and we are getting ready to become part of the G20,” Dar said.\n\nIn June, amid speculation in legal circles about the government planning to bring in the 27th Amendment, the Islamabad High Court Bar Association had endorsed a possible amendment while calling for broad-based judicial reforms, including the nationwide rotation of judges.\n\nSources had said certain contentious matters, such as a separate constitutional court, left unresolved in the 26th Amendment, would be taken up in the new amendment. Though speculations had been rife since then, there had been no official word regarding the 27th Amendment.\n\nSeparately, FM Dar had “productive meetings” with British lawmakers of Pakistani origin, according to a statement from the Foreign Office (FO).\n\nThe deputy PM arrived in the UK on Saturday ahead of diplomatic engagements with British and Commonwealth leadership from August 17-19. The FO said earlier this week that he would meet British Deputy Prime Minister Angela Rayner and Parliamentary Under-Secretary of State for Pakistan Hamish Falconer.\n\nIn today’s statement, the FO said that Dar met with British members of parliament (MP) Mohammad Yasin, Tahir Ali, Imran Hussain, Ayoub Khan and Adnan Hussain.\n\n“The deputy prime minister/foreign minister underscored the deep historical and cultural bonds between Pakistan and the United Kingdom, which are further strengthened by the vibrant Pakistani diaspora in the UK,” the statement read.\n\nDuring the meetings, Dar highlighted the diaspora’s pivotal role as a bridge between Islamabad and London, fostering mutual understanding, cultural exchanges and robust people-to-people connections, the FO added.\n\nDar “emphasised Pakistan’s strong commitment to enhancing bilateral parliamentary exchanges with the United Kingdom”, the statement read.\n\n“He noted that such engagements facilitate the sharing of democratic experiences, international best practices and core democratic values, which are vital for the growth and stability of democratic institutions in both countries.”\n\nThe FO said that the deputy PM appreciated the efforts of the MPs to bring greater attention to the issue of human rights violations in occupied Kashmir and commended them for raising awareness on the situation in the UK.\n\nThe FO said FM Dar also met UK Parliamentary Under-Secretary of State for the Middle East, Afghanistan and Pakistan Hamish Falconer at the Foreign, Commonwealth and Development Office (FCDO) in a “productive” meeting.\n\n“During the meeting, both sides reviewed the full spectrum of bilateral relations and reaffirmed their shared commitment to deepening cooperation across political, economic, climate and people-to-people domains,” the FO stated.\n\nDar and Falconer also exchanged views on regional and global developments, while the deputy PM highlighted Pakistan’s commitment to economic reforms and shared Pakistan’s perspective on peace and stability in South Asia.\n\n“He (Dar) underscored the importance of the just and peaceful resolution of [the] Jammu and Kashmir Dispute, in accordance with the relevant UN Security Council Resolutions,” the statement read.\n\nAccording to the FO, both sides appreciated the trajectory of UK-Pakistani relations and noted the importance of regular, high-level interactions to maintain ties and open up new avenues for cooperation.\n\nThe foreign minister also met Kashmiri community leaders.\n\nThe foreign minister also inaugurated two initiatives at the Pakistan High Commission in London: the Provision of Land Record Services and the One Window Passport Processing System.\n\nThe FO said the Land Record Services, developed through a collaboration between the Punjab Land Revenue Authority and itself, enabled British Pakistanis to remotely access and manage property records in Punjab without the need to travel to Pakistan with services such as online sale deeds, record of rights, mutation entries and document attestation, all secured by blockchain technology to ensure transparency and prevent fraud.\n\n“A dedicated Land Services Desk at the Pakistan High Commission in London will support the pilot phase, with plans to expand to other Pakistani consulates in the United Kingdom.”\n\nIt added that the One Window Passport Processing System, implemented by the Directorate General of Immigration and Passports, streamlined passport application procedures by consolidating multiple steps into a single, efficient counter, reducing processing time to approximately 10 minutes per application and thus enhancing convenience, reducing congestion and ensuring greater transparency for British Pakistanis.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:54:10.727Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931689/countrys-running-well-no-need-for-27th-amendment-fm-dar",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T13:43:06.000Z"
}
