{
  "title": "Situationer: As monsoon wreaks havoc, only fraction of cars insured - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Just 2.5pc vehicles have coverage, leaving millions of owners at risk\n• Experts urge government to make insurance mandatory\n\nWITH the country currently in the grip of cataclysmic monsoon rains, every passing day brings with it more reports of deaths and destruction.\n\nAmong the losses to life and property, images of damaged veh­icles — either swept up by floodwaters or battered by falling debris — have become a common sight.\n\nAlongside lost homes, businesses and civic amenities, damage to vehicles constitutes a major chunk of the losses incurred by people.\n\nAccording to insurance experts, however, the uptake for motor vehicle coverage in the country stands at a paltry 2.5 per cent.\n\nTake, for example, the freak hailstorm that inflicted damages worth millions of rupees to vehicles across Islamabad earlier this year. According to data from around 12 insurance and takaful operators (out of a total of 28 providers), around 958 vehicle repair claims were received in the wake of the hailstorm from the federal capital and its adjoining areas in April 2025.\n\nSources in the motor insurance sector put the gross claim amount at around Rs144 million.\n\nBut this figure only includes those who had insurance and opted to go that route. Given the massive bills and long queues for repair work in the aftermath of the hailstorm, many vehicle owners chose to avail themselves of offers for discounted repairs offered by carmakers themselves, or took their business to their local ‘ustaad’.\n\nAccording to an insurance company official, who asked not to be identified as he is not authorised to speak to the media, his company had served around 250 customers, with a total payment estimate of around Rs30 million during FY25 alone.\n\nA majority of these claims came from Islamabad and its surrounding areas, and most were for saloon or sedan vehicles.\n\nHe highlighted that parts shortages, such as the one created in the wake of the Islamabad hailstorm, put pressure on supply, leading to a price rise. This is exactly what was witnessed in the case of the damages from the hailstorm, with workshops and technicians making hay due to the sky-high demand for parts such as windshields.\n\nThe insurance official claimed that this practice also hurts their company, which tries to find the best possible deal for their clients.\n\nInsurance ‘not the norm’\n\nSectoral experts say that most car owners in Pakistan do not have coverage.\n\nSaqib Zeeshan, CEO of Pak-Qatar General Takaful, told Dawn that out of the millions of vehicles on Pakistan’s roads, only about three million were covered by any insurance or takaful policy.\n\n“This is despite the presence of 28–30 companies offering attractive insurance and takaful packages. Unfortunately, we are not an insurance-oriented society, and a large segment of the population lacks basic awareness about the concept of insurance,” he said.\n\nHe added that Pak-Qatar received over 60 vehicle claims from the April hailstorm alone.\n\n“Currently, we have around 14,000 vehicles insured under Motor Takaful, which is still a small number compared to major players who handle significantly larger volumes and claims.”\n\nLack of coverage\n\nWith widespread flooding, heavy rains, and landslides ravaging the northern parts of the country, thousands of affected vehicle owners are likely to submit claims to their respective insurers, in the hopes of compensation.\n\nBut industry experts say that a large chunk of those affected would not have insurance to begin with. Non-customs paid vehicles, such as those widely used across the Malakand Division — in areas such as Swat, Dir, Chitral — are usually not insured. The same goes for many of the private vans or buses plying on inter-city routes, save for those that are part of organised fleets.\n\nHowever, Mr Zeeshan pointed out that vehicles financed through banks and leasing companies are compulsorily insured until the loan matures, i.e. the instalments are paid off.\n\n“However, only 20pc of customers continue insurance coverage after the financing period ends. Once the loans are repaid, the insurance penetration drops drastically,” he said.\n\nIn his view, most people in Pakistan view insurance or takaful as an expense rather than an investment. Given the country’s propensity towards climatic disasters, this thinking needs to change.\n\nEven though most insurance companies offer both comprehensive and third-party liability coverage, Mr Zeeshan says the latter, which is available for a nominal premium, is often ignored.\n\nIn addition, while natural disasters are now covered under comprehensive policies, certain insurance packages — especially those with low premiums — still don’t insure against force majeure (unforeseen circumstances or acts of God).\n\nTo address this issue, the industry has urged the government to make motor insurance mandatory. Countries in the Gulf Cooperation Council (GCC), such as Saudi Arabia and the UAE, have already made vehicle insurance mandatory.\n\n“Only the government has the authority to enforce such a policy,” Mr Zeeshan said.\n\nAs per data from the Insurance Association of Pakistan (IAP), the gross premium contribution for the motor insurance segment reached Rs36.18 billion in 2024, up from Rs34bn in 2023. However, IAP does not maintain segregated data on vehicle claims resulting from natural calamities.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a257479d376.jpg",
  "retrievedAt": "2025-08-20T04:54:18.870Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931529/situationer-as-monsoon-wreaks-havoc-only-fraction-of-cars-insured",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:32:40.000Z"
}
