{
  "title": "Govt may allow new gas connections with fee hike - Newspaper - DAWN.COM",
  "author": null,
  "content": "• 120,000 connections for LNG-based piped supply planned in first year\n• Move comes amid push to address continuing glut in gas network\n\nISLAMABAD: The government is almost set to allow new gas connections at the price of imported LNG — around Rs3,900 per million British thermal unit (mmBtu) at the current rate — and almost four times the current connection fee.\n\nSources told Dawn that a summary has been moved by the petroleum division to the federal cabinet for lifting the ban on new connections, with a first-year target of 120,000.\n\nPriority would be given to applicants who had previously been issued demand notices or had paid the urgent fee but could not get connections because of a subsequent ban. The number of new connections would be enhanced for next year.\n\nAround 250,000 applicants fall in this category, who would have to file affidavits not to approach the courts for their past claims and the connection fee increase. Before the ban, consumers were allowed to pay an upfront fee of Rs25,000 to secure a connection on a priority basis, unlike the routine Rs5,000-Rs7,500 fee. On the other hand, a new LNG connection earlier cost Rs15,000.\n\nAt present, more than 3.5 million applications for new connections are pending with the gas companies. While new connections provide an additional avenue for the gas companies to claim a guaranteed return on fixed assets (pipelines and related infrastructure), this also leads to higher gas losses and lower revenue recoveries on top of greater gas shortages in winter.\n\nNo wonder then that the Lahore-based Sui Northern is rationing gas supplies even before the peak winter demand and provides gas to domestic consumers for 6-9 hours per day — at breakfast, lunch, and dinner hours. The recent increase in fixed charges starting July 1, 2025 by 50pc provides an additional incentive to secure higher funds without the additional gas supply.\n\nThe moratorium on new gas connections was imposed in 2009, partially removed after six years before being enforced again in 2022 due to rising gas shortages. Sources said Prime Minister Shehbaz Sharif had recently expressed displeasure with delays in new connections.\n\nNew connections\n\nThe new connection fee would now be set at Rs40,000-50,000 and the consumers would be billed at the notified re-gasified liquefied natural gas (RLNG) price — currently at about Rs3200 per mmBtu. The final price, including general sales tax, would go up to Rs3,900-Rs4,000 per mmBtu. The average gas price for high-end domestic consumers with a monthly consumption of 300 cubic metres per month currently stands at Rs3,300 per mmBtu and goes up to Rs4,200 per mmBtu for more than 400 cubic metres of monthly consumption.\n\nThe cabinet was informed that a comparative price of liquefied petroleum gas (LPG) was worked out at around Rs5,300 per mmBtu, and it was being used by millions of poor and lower-middle-class consumers, including those in the remote areas, which meant the LNG-based piped gas supply would still be cheaper 35-40pc.\n\nGas surplus\n\nThe removal of the gas connection ban is being pushed to address a continuing glut in the gas network that is putting at risk the integrity of the pipeline system and the sovereign international commitments. The Ministry of Finance recently suggested considering “demand side intervention through lifting of moratorium on new gas connections” to address the issue of the LNG surplus.\n\nThe higher LNG imports also involve greater foreign exchange requirements. Interestingly, the Oil and Gas Regulatory Authority (Ogra) had been resisting allowing the cost of LNG diversion to domestic consumers for almost a decade, but it recently allowed Rs75 billion in revenue requirements of gas companies for the 2015-22 backlog and indicated it’d adjust the 2023-25 claims in the subsequent price revisions.\n\nEven with existing gas connections, the two gas companies, particularly SNGPL serving Punjab and Khyber Pakhtunkhwa, face acute gas shortages in winters and imported LNG supply to residential consumers leads to the multiplication of circular debt. Already, the gas companies face around Rs200bn of annual revenue shortfall on this account.\n\nHowever, the government has found itself in a paradoxical situation owing to economic slowdown, forced closure of gas to industrial captive power plants, unaffordable electricity rates, and insignificant utilisation of LNG by the power sector, for which the entire import arrangement was made in 2015-16, including sovereign commitments and more than $7bn worth of infrastructure.\n\nThe mandatory 66pc LNG utilisation in four “must-run” power projects of over 5200MW, for which the long-term international contracts were signed in 2015-16 and then in 2020-21, has since been reduced to 33pc LNG utilisation. These plants, however, remain outside the grid through tactical operations, shifting the power sector’s circular debt to the petroleum sector.\n\nAt present, more than 300 million cubic feet per day (mmcfd) of domestic gas fields have been put on forced closure to create space for the imported LNG at more than twice the domestic producer price.\n\nThis is not only at the expense of domestic gas fields, but also causes weekly losses of billions of rupees to gas producers, compromising future exploration and development activities.\n\nThis means at least three monthly cargoes under the long-term contracts with Qatar have become surplus. This is on top of the diversion of a monthly LNG cargo to the international market that was contracted by Pakistan under a guaranteed private long-term contract.\n\nLast winter, the government had postponed five cargoes — 500mmcfd — from Qatar, which are now due for rescheduling in FY2026 on top of about 150 annual routine cargoes.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:54:18.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931531/govt-may-allow-new-gas-connections-with-fee-hike",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:32:40.000Z"
}
