{
  "title": "Khyber Pakhtunkhwa picks up the pieces after deadly deluge - Pakistan - DAWN.COM",
  "author": null,
  "content": "• At least 323 dead, 150 missing in the province; PM orders ministers to supervise KP relief efforts\n• 657 lives lost nationwide since June 26; NDMA warns of more rain spells next month\n• Food shortages, lack of utilities take hold as parts of GB remain cut off\n• Flows in Punjab rivers subside to ‘low flood’ levels\n\nPESHAWAR/ISLAM­ABAD: With more than 150 people feared missing, the recent catastrophic floods in Khyber Pakhtunkhwa have claimed at least 323 lives, provincial authorities said on Sunday, as the nationwide toll from rain-related incidents since late-June rose to 657.\n\nAs another two to three waves of heavy rain are expected in early September, Prime Minister Shehbaz Sharif has directed members of his federal cabinet to personally supervise relief operations in the worst-hit KP province.\n\nSpeaking at a news conference on Sunday, Khyber Pakhtunkhwa Provincial Disaster Management Authority (PDMA) Director General Asfandyar Khattak said that as per details collected by revenue staff in the Buner and Shangla districts, around 150 people are still missing.\n\nHe added that rescue operations were underway and that five armed forces helicopters were at the disposal of the provincial government.\n\nFlanked by Barrister Muhammad Ali Saif and Dir­ector General Resc­ue-1122 Muhammad Tayyab Abdullah, Mr Khattak said the provincial government had released Rs1.5 billion for relief activities.\n\nOut of the initial release of Rs500m, the allocations included Rs150m for Buner, Rs100m for Mansehra, Rs50m for Bajaur, Rs40m each for Batagram, Swat, and Shangla, and Rs10m each for Upper Kohistan, Lower Kohistan, and Kolai Palas, he added.\n\nThe PDMA DG further said that 33 trucks of non-food items had reached Buner, eight had reached Swat, and seven had reached Bajaur, while additional supplies were also being dispatched.\n\nMore rain in Sept\n\nWith heavy monsoon rains expected to persist until August 22, National Disaster Management Authority (NDMA) Spokes­person Dr Tayyab Shah warned on Sunday that two to three more spells of heavy rain are expected to hit the country in September.\n\nHe noted that this year, monsoon rainfall had been 50 to 60 per cent heavier than last year.\n\nThis year’s monsoon season ranks among the most destructive in recent memory, he said.\n\nNDMA put the number of those who had lost their lives in rain-related incidents across Pakistan since June 26 at 657, with 929 injured.\n\nOf the total casualties, 171 were children, 94 women, and 392 men.\n\nKP province alone accounted for 390 deaths, including 288 men, 59 children, and 43 women, underscoring the province’s disproportionate vulnerability to seasonal downpours and related hazards.\n\nIn Punjab, 164 people including, 70 children, 63 men, and 31 women, have died in rain-related incidents since June 26.\n\nSindh has recorded 28 deaths, including 14 children, 10 men, and 4 women.\n\nIn Balochistan, 20 fatalities, including 11 children, 5 men, and 4 women were reported.\n\nIn Gilgit-Baltistan, the toll reached 32 deaths, comprising 18 men, 8 children, and 6 women.\n\nAzad Jammu and Kashmir (AJK) reported 15 casualties, evenly split among 5 men, 5 women, and 5 children while in Islamabad, 8 people died, including 4 children, 3 men, and a woman.\n\nGB situation\n\nIn Gilgit-Baltistan, a cloudburst-triggered flood in Katishu village of Kharmang district claimed two lives on Sunday.\n\nPolice said a woman and her daughter went missing after the flash flood struck their village. The body of their daughter has been recovered, while the woman is still missing. Two other women, injured in the flood, were shifted to Skardu for treatment.\n\nThe flash flood also caused severe damage to fields, water channels, agricultural land, and both public and private properties.\n\nMeanwhile, rescue teams recovered the body of a four-year-old girl from under flood debris in Khalti village, Gupis Valley (Ghizer district), while the body of an elderly man was retrieved on Saturday night. Both had gone missing in flash floods on Friday.\n\nOn the other hand, several major roads, including the Karakoram Highway (KKH), Baltistan Highway, Ghizer–Shandur Road, and Naltar Highway, along with various link roads, remained blocked, leaving thousands of people, including tourists, stranded.\n\nLocal residents faced acute shortages of drinking water, prolonged power outages, and disruption of mobile and internet connectivity in several areas.\n\nIn Gilgit city, residents held protest demonstrations, blocking main roads against the prolonged water and electricity crisis. They said locals had been without basic utilities for several days.\n\n‘Ministers to supervise KP relief ops’\n\nIn the wake of recent destructive rains in Khyber Pakhtunkhwa, Prime Minister Shehbaz Sharif has directed federal ministers to supervise relief operations in the province.\n\n“On the prime minister’s directives, federal ministers will participate in relief operations in the flood-hit districts of Khyber Pakhtunkhwa,” said an official statement from the PM Office.\n\nAs per the instructions, Federal Minister for Kashmir Affairs and Gilgit-Baltistan Engineer Amir Muqam will oversee relief distribution in Shangla and Buner; the Federal Minister for Power Division will assist in Buner; Federal Minister for Religious Affairs Sardar Yousaf will supervise operations in Mansehra; and the PM’s Special Assistant Mubarak Zeb will oversee aid distribution in Bajaur.\n\nThe prime minister is personally overseeing NDMA’s relief operations across all flood-affected districts of KP.\n\nUnder the PM’s Relief Package, more truckloads of supplies are being dispatched to the affected districts. The relief goods include food rations, tents, and medicines, which are being handed over to the respective district administrations.\n\nWater levels in rivers\n\nMeanwhile, the PDMA Punjab reported that the River Sutlej continued to experience fluctuating water levels, with a low-level flood situation at Ganda Singhwala and Sulemanki.\n\nThe authority said that the current water flow stands at 70,000 cusecs at Ganda Singhwala and 74,000 cusecs at Sulemanki, with authorities closely monitoring the situation due to ongoing fluctuations.\n\nThe Sutlej River is expected to remain at low to medium flood levels in the coming days, with flows ranging between 75,000 to 85,000 cusecs.\n\nPDMA Director General Irfan Ali Kathia said that water flows exceeding 80,000 cusecs could trigger low-level flooding in the Sutlej, while 120,000 cusecs may lead to moderate flooding, and 175,000 cusecs could cause high-level flooding.\n\nThe PDMA has also forecast severe monsoon rains in most districts of Punjab, with the seventh spell of monsoon rains expected to continue until August 22/23.\n\nJamil Nagri in Gilgit, Syed Irfan Raza in Islamabad and Imran Gabol in Lahore also contributed to this report\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/18101312b7ea965.jpg",
  "retrievedAt": "2025-10-12T03:51:00.958Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931533/khyber-pakhtunkhwa-picks-up-the-pieces-after-deadly-deluge",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:32:40.000Z"
}
