{
  "title": "Trump says to meet Putin, Zelensky if ‘everything works out’ - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Monday that if his meeting with Ukrainian counterpart Volodymyr Zelensky went well, he expected to hold a trilateral meeting with Russian leader Vladimir Putin with the goal of ending the Ukraine-Russia war.\n\nTrump is pushing Ukraine to make major concessions following his summit with Russian President Vladimir Putin in Alaska last week, saying Kyiv must give up Crimea and abandon its Nato ambitions. Those are two of Moscow’s top demands.\n\nBut Zelensky, who huddled with the Europeans before they all went to the White House to meet Trump, urged Trump to bring “peace through strength” against Russia and stressed the need for United States security guarantees.\n\n“We’re going to have a meeting. I think if everything works out well today, we’ll have a trilat (trilateral summit) and I think there will be a reasonable chance of ending the war when we do that,” said Trump, sitting alongside Zelensky at the White House.\n\n“I just spoke to President Putin indirectly and we’re going to have a phone call right after these meetings today.”\n\nZelensky thanked Trump for hosting the talks, which will be expanded to include European leaders later in the day. “Thank you for [the] invitation and thank you very much for your efforts, personal efforts to stop killings and stop this war,” he said.\n\nFielding questions from reporters, Trump said that Washington will be involved in providing security guarantees as part of a peace agreement on ending Russia’s war.\n\nEuropean countries are “the first line of defence because they are there, they are Europe, we’re going to help them out also. We’ll be involved”, he stated.\n\nHowever, the US president repeated his view that a ceasefire was not necessary to end the Russia-Ukraine war, echoing earlier comments that brought his position more in line with Putin.\n\n“I don’t think you need a ceasefire,” Trump said. “I know that it might be good to have, but I can also understand strategically why one country or the other wouldn’t want it. You have a ceasefire and they rebuild and rebuild and rebuild and you know maybe they don’t want that.”\n\nTrump welcomed Zelensky to the White House, saying, “We love them,” when asked what his message was to the people of Ukraine after shaking Zelensky’s hand.\n\nHe also complimented Zelensky on his smart black jacket, after the Ukrainian was criticised by right-wing media for failing to wear a suit during a visit in February that ended in a shouting match.\n\nEarlier, European leaders began arriving at the White House ahead of the high-stakes talks, with Nato chief Mark Rutte, European Commission head Ursula von der Leyen and British Prime Minister Keir Starmer being among the first to arrive.\n\nTrump, 79, said it was a “big day at the White House” and appeared to be in a combative mood, churning out a string of social media posts.\n\n“I know exactly what I’m doing,” the Republican said on his Truth Social network. “And I don’t need the advice of people who have been working on all of these conflicts for years, and were never able to do a thing to stop them.”\n\nTrump will later meet separately with the leaders of Britain, France, Germany, Italy and Finland, as well as Rutte and von der Leyen.\n\nThe European leaders held a preparatory meeting with the Ukrainian president in Washington on Monday morning, while Zelensky also met Trump’s Ukraine envoy, Keith Kellogg.\n\nZelensky described the talks at the White House as “very serious” — and sought to flatter Trump ahead of the meeting, by echoing his trademark “peace through strength” language.\n\n“President Trump has that strength. We have to do everything right to make peace happen,” he said.\n\nThe Ukrainian leader added that they would have “time to speak about the architecture of security guarantees. This is, really, the most important”.\n\nBritish Prime Minister Keir Starmer told reporters on the plane to Washington: “We’ve got to make sure there is peace, that it is lasting peace, and that it is fair and that it is just.”\n\nItalian Prime Minister Giorgia Meloni said before going to the White House that a “small window of dialogue is opening” and that she backed the security guarantees idea.\n\nReports had said Putin would be open to Western security guarantees for Ukraine in the event of any peace deal, but had ruled out Kyiv’s long-term ambition to join Nato.\n\nRussia kept up its attacks on Ukraine ahead of the new talks, killing at least seven people, including two children, in dozens of drone and ballistic missile strikes overnight, Ukrainian officials said. Zelensky called the strikes an attempt to “humiliate diplomatic efforts”.\n\nA Trump-Putin summit in Alaska last week failed to produce a ceasefire in the nearly three-and-a-half-year war that began with Russia’s full-scale invasion in February 2022.\n\nAfterwards, Trump dropped his previous insistence on a ceasefire in favour of seeking a complete peace deal, meaning negotiations could proceed while the war goes on. He also alarmed Kyiv and European capitals by repeating a number of Russian talking points.\n\nTrump said on Sunday that Zelensky could end the war “almost immediately, if he wants to”, but that, for Ukraine, there was “no getting back” Crimea, which Russia annexed in 2014, and “No going into Nato”.\n\nUS media reports have said Putin would consider freezing much of the current frontline in Ukraine if Kyiv agreed to completely give up the Donbas region in eastern Ukraine.\n\nTrump envoy Steve Witkoff said Moscow had made “some concessions” on territory. But such a move is widely viewed as unacceptable for Ukraine, which still holds much of the resource-rich area.\n\nYevgeniy Sosnovsky, a photographer from the captured Ukrainian city of Mariupol, said he “cannot understand” how Ukraine would cede land already under its control.\n\n“Ukraine cannot give up any territories, not even those occupied by Russia,” he told AFP.\n\nKyiv and European leaders have warned against making political and territorial concessions to Russia, whose assault on Ukraine has resulted in tens of thousands of deaths.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1823022780f782c.jpg",
  "retrievedAt": "2025-08-20T04:54:12.929Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931702/trump-says-to-meet-putin-zelensky-if-everything-works-out",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T16:54:25.000Z"
}
