{
  "title": "Colonial-era laws prioritise executive supremacy over justice, says ex-AGP Makhdoom Ali - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The British legal system that is still followed in Pakistan was originally desig­ned not to serve public justice, but to enforce executive supremacy and keep Indian citizens as well as politicians under control.\n\nThis view was expressed by senior lawyer and former Attorney General for Pakistan (AGP) Makhdoom Ali Khan at a talk titled “Pakistan’s Judicial System Now and Then”, where he stressed the need to reform the very structure of the legal system in order to bring about positive change in the judiciary and make it fully independent.\n\nThe talk was organised by the Danish-o-Ramish Institute on its premises.\n\nSpeaking on the occasion, Advocate Khan said that most of the legal system and civil laws introduced by the British during their rule in the Indian subcontinent are still in force in Pakistan.\n\nHe added that this is one of the factors behind the country’s weak justice system, since these laws were originally framed by colonial rulers to keep the local population subordinate.\n\nLawyer Makhdoom Ali Khan calls for structural reforms in judicial system to ensure civilian supremacy\n\nHe explained that the primary purpose of such laws was to maintain executive supremacy and ensure that the Indian population and political class remained under control.\n\nThe senior lawyer referred to various examples of how Indian citizens were subjected to unfair and unjust treatment in British courts. He also pointed out how political leaders and workers were targeted on the basis of these laws.\n\nMr Khan remarked that the same practices have continued in Pakistan since independence. The judicial system here, he said, does not prioritise public justice and welfare as it should, while political workers and politicians are still targeted under this framework.\n\nTherefore, he emphasised, there is a pressing need to reform the very structure of the law to build a system that prioritises justice for the people and upholds civilian supremacy rather than executive authority. Until such reforms are made, he warned, the system will remain unchanged.\n\nMoreover, he argued, the judiciary cannot truly function independently in a country where the political system itself is weak.\n\nResponding to a question from the audience, Advocate Khan said that Pakistan has not yet been able to form a truly unified nation. He referred to the troubling situation in the country, particularly the deteriorating security conditions in Khyber Pakhtunkhwa and Balochistan, and the sectarian and ethnic divisions persisting since independence.\n\nHe added that nations are not just made; they are rather moulded over time, with justice and equality as the key elements of that process. However, he lamented that no meaningful effort is being undertaken by the powers that be to ensure these principles.\n\nPublished in Dawn, August 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/181015041c023ff.png",
  "retrievedAt": "2025-10-12T03:50:40.691Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931567/colonial-era-laws-prioritise-executive-supremacy-over-justice-says-ex-agp-makhdoom-ali",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T00:33:10.000Z"
}
