{
  "title": "Nature’s payback - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE frequency and intensity of disasters is increasing in Pakistan with every passing year. This phenomenon, if allowed to continue unabated, will extract a heavy social, economic and political price. After the Paris Agreement, it has become common practice in Pakistan to attribute every disaster to climate change and cite lack of finance for unpreparedness. However, time has come for some serious soul-searching and honest introspection.\n\nDeforestation and disaster reinforce each other through a negative feedback loop. Forest cover in Pakistan has been declining over the years. This reckless deforestation plays a significant role in what we are witnessing today in the form of hydrometeorological disasters and widespread devastation, wreaking havoc in the lives of communities.\n\nThe main forested areas in the country are situated in Azad Kashmir, KP and Gilgit-Baltistan. According to the Global Forest Watch, in 2020 KP had 937 kilohectares (2.3 million acres) of natural forest, extending over 12 per cent of its land area. In 2024, it lost 235 hectares (581 acres) of natural forests, equivalent to 40.8 kilotons of carbon dioxide emissions. The region of Malakand stands out for being the most responsible with 50pc tree cover loss at 1.73 kha compared to an average of 431 ha between 2005 and 2024. Hazara follows with loss of 1.49 kha in forest cover. KP has been losing forests at a rate of 1.5pc annually equivalent to 11,000 hectares per year between 2000 and 2023. In Chitral, projected loss under current trends is 23pc by 2030.\n\nThe loss of forest in the upper areas of Chitral, Kalam and upper Hazara has created large expanses of bare ground that is heating up much faster in the absence of tree canopy and undergrowth. This results in enhancing the land-sea thermal contrast as sun-exposed soil can reach extreme surface temperatures (often 5-8 degrees Celsius higher) than land under forest cover. Higher ground temperature intensifies local low pressure zones, strengthening the ‘heat pump’ effect that draws in moist monsoon winds inland from the Arabian Sea and Bay of Bengal. The reinforced vertical pull of hotter, drier surface air rises more vigorously when it collides with cool, moist air from the sea. The result is intense convective updrafts making it the perfect recipe for cloudbursts and landslides, glacial lake outburst floods and other hydrometeorological disasters.\n\nDeforestation and disaster reinforce each other.\n\nThis year the Arabian Sea surface temperature is about 0.8ºC above average, with winds carrying more water vapour. When these moisture-laden winds meet deforested, superheated hillsides, the uplift and condensation are explosive. What we see happening in AJK, KP and GB are disasters amplified by deforestation.\n\nThe reports about the latest destruction of forest in Arandu Gol in Chitral and violation of forest rules in Makhniyal Guzara Forest in Hazara and Ayubia National Park are alarming and ominous developments. Deforestation is not only about environmental degradation, it is about loss of human life, disruption of livelihoods, displacement of vulnerable communities and destruction of costly infrastructure. There is an urgent need for an inquiry into the aforementioned allegations to arrest damage before it becomes a cause of the next major disaster.\n\nThe lessons of floods in 1992 and 2010 in Kalam and cloudbursts now in Babusar, GB, Mansehra, Buner and Swat should not be lost on us. The costs, both economic and social, are staggering. There is a direct connection between deforestation, flood severity and damages. Forest protection and taking firm action now can save us from risks associated with natural disasters.\n\nMoreover, as a signatory to the Paris Agreement, Pakistan will sev­erely undermine its mitigation co-m­mitments if it allows forests to be decimated for timber, real estate development and money-making ventures by vested interest groups at the cost of compromising its emission reduction commitments.\n\nPakistan’s track record is poor. It is woefully behind in meeting SDG goals, faces challenges in implementing climate policies and seemingly lacks the ability to enforce forest rules and regulations. For how long can we blame external factors and refuse to take internal responsibility for things that we can control to reduce risks?\n\nSustainable development makes it necessary to reduce future economic burdens, safeguard communities from displacement and preserve health and livelihoods. With unchecked deforestation we are wilfully putting ourselves in harm’s way, contributing to intensification of disasters and exposing more people to risks.\n\nOur future resilience depends on ecological restoration of degraded ecosystems and protecting existing forests from exploitation and deforestation.\n\nThe writer is chief executive of the Civil Society Coalition for Climate Change.\n\naisha@csccc.org.pk\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a141a502f77.jpg",
  "retrievedAt": "2025-10-12T03:51:04.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931386/natures-payback",
  "dateList": "2025-08-18",
  "date_published": "2025-08-17T02:43:58.000Z"
}
