{
  "title": "T20 Asia Cup: Are Pakistan right in leaving out Babar, Rizwan? - Pakistan - DAWN.COM",
  "author": null,
  "content": "The rumour mill had been churning for some time now. And yet, the notion of going into the T20I Asia Cup next month without the most experienced batters in the line-up was considered too big of a gamble even for this administration that continues to be crushed under the weight of abysmal results.\n\nMoreover, the hamstring injury to Fakhar Zaman during Pakistan’s last T20I assignment in the Caribbean further fuelled the speculation. But the administration has been crystal clear in its ambitions for the T20I side.\n\nAnd so Aaqib Javed, one of the four selectors, flanked by head coach Mike Hesson confirmed on Sunday that for the first time in a decade, Pakistan did not intend to take Babar Azam, their highest run-scorer across all international cricket in the last 10 years, to the Asia Cup, as he announced the squad. Mohammad Rizwan was the other notable omission from the squad.\n\nPakistan have played 14 T20Is this year and both former captains have not featured in any of them.\n\nTo understand how we got to this point, let us consider how Pakistan have fared with the duo over the last five years.\n\nIn 2021, Pakistan’s campaign in the T20I World Cup was unfolding like a fairy tale. They were the first team to qualify for the semi-finals and defeated all five teams in their group to move into the knockouts. They walloped India by 10 wickets to secure the first-ever men’s World Cup win over the arch-rivals and trounced New Zealand, Afghanistan, Namibia, and Scotland.\n\nCome the semi-final game, Pakistan had been the favourites even before the first ball was bowled. They had played their entire ‘home’ cricket in the UAE, the hosts for this tournament, over the last decade, and had been playing like a side that had every right to win the competition.\n\nBut then, it all imploded.\n\nAny mention of that semi-final brings back images of Hasan Ali overrunning the catch or Matthew Wade despatching Shaheen Afridi for three consecutive sixes to overhaul Pakistan’s 176 with an over to spare. Many still criticise Hasan, who had also given 15 runs in the 18th over, and Shaheen.\n\nBut the contest had been pretty much settled in Australia’s favour by the first half of the first innings. In yet another conservative batting display, Rizwan Babar put up only 71 runs from the first 10 overs on what was possibly the best batting surface rolled out in that tournament.\n\nOverall, the Riz-Bar partnerships in the 2021 T20I World Cup produced 411 runs at a staggering average of 82.20. No other opening pair came close to that many runs and that average. But their run-rate of 7.33 was the worst among the four sides that made it to the semi-finals.\n\nPakistan’s overall run-rate in this tournament stood at 8.56, the second best behind England’s 8.66. It underscored the brisk scoring abilities of the batters after Babar and Rizwan, but the openers left too little balls for them to score from. In fact, of the 696 balls that Pakistan played in the 2021 T20I World Cup, Rizwan and Babar faced a whopping 460 — the most balls that number one and two of any team had played in that tournament.\n\nT20s are won by hitting out the oppositions. To this end, the initial overs, the first six overs (powerplay), in particular, and the first 10 overs, are considered the best phases to gather runs as that is when the conditions are the most in favour of the batting side.\n\nThe new Kookaburra ball comes onto the bat nicely and the provision of only two fielders outside the inner-circle in the first six overs opens up huge gaps for the batters, encouraging them to clear the in-field often.\n\nBut as the ball gets old and soft, the run scoring becomes challenging. The older ball on surfaces such as the ones in the UAE start to grip. Nowadays, each side has specialised death bowlers for the last five overs, which further impedes run scoring.\n\nOver the years, it has become a norm for teams to load their top-order with power-hitters who can hit boundaries more often and score at blistering rates. Not Pakistan. Until the start of this year, when Rizwan and Babar were part of the line-up, Pakistan continued to play the new ball with caution, rather than attack it, and left it to the middle order to take the side to defensible scores.\n\nThere were three T20I World Cups played between 2021 and 2024 and all three were won by teams who lead the overall run-rate chart: India in 2024, England in 2022 (with Pakistan being the finalists), and Australia in 2021.\n\nDuring this time, Pakistan, already among the bottom half of the 12 teams, were one of the only four sides to have a negative difference between the first-wicket partnerships and overall run-rates. Pakistan’s negative run-rate stood at 0.33. It was the second worst behind India, who had much healthier overall and opening-stand run-rates than Pakistan’s.\n\nThe last three T20I World Cups have been played at venues known for their middling scores. That, in theory, perfectly aligns with Pakistan’s conservative batting approach. But all the teams playing in these tournaments had been doing one thing right that Pakistan had not been: their openers had been maximising the powerplays and the first 10 overs.\n\nThat Pakistan played the final of the 2022 T20I World Cup in Australia was due to other results going their way and their bowlers rising up to the occasion. They were some noteworthy performances with the bat, but the batting unit, as a collective, failed to click.\n\nRiz-Bar scored at just 6.45 an over. In the list of last four teams, Pakistan’s run-rate was made to look better only by India who had a first-wicket run-rate of 4.98, the second worst in the tournament after Namibia’s 4.44. Openers from New Zealand and England recorded the best run-rates for the first wicket in the entire tournament as they dashed 9.26 and 9.20 runs per overs.\n\nPakistan will hope that 2024 goes down as the most terrible T20I World Cup in the history for them. They crashed out in the group-stage after the embarrassment of losing to USA — who were making their first appearance in the tournament and were only there courtesy of being the hosts — and India. Pakistan started with Riz-Bar opening against USA and India and sandwiched Saim Ayub between the two — as Babar dropped to number three — for the matches against Canada and Ireland.\n\nThe two opening pairs did not even go at run-a-ball. Their run-rate of 5.37 was almost two runs — 1.87 to be precise — less than what Reeza Hendricks and Quinton de Kock scored at for finalists South Africa, which was the worst among the four semi-finalists. Rohit Sharma and Virat Kohli, the winning side’s openers, scored 7.82 runs every six balls, and the opening pairs of Afghanistan and England scored at 7.65 and 9.95. England had the best run-rate for the first-wicket in the tournament.\n\nWhat made Pakistan persist with Riz-Bar was their ability to gather runs consistently. They have put together 2,522 runs at an average of 46.70 and have eight stands of 100 or more in 56 innings. They also have made ten 50-partnerships. They remain the only opening pair to breach the 2,000-run mark in the format.\n\nBut these runs have come at a sluggish 7.91 runs per over. It is the second worst run-rate when the top 10 most successful opening partnerships in the history of the format are assembled by the metric.\n\nMore than the number of runs, it is the rate at which they are scored is what matters in this format. Pakistan, more often than not, left out crucial runs batting first and failed to chase the challenging totals when these two batted together for longer.\n\n2024 proved to be the breaking point as Pakistan won only nine of the 26 completed T20Is and the onus of Pakistan’s appalling year was put on how Riwan and Babar approached the game. Six of these wins were against Zimbabwe (two), Ireland (two), and Canada, and the other three were against second-string New Zealand in Christchurch, Rawalpindi, and Lahore.\n\nThe two, once again, scored the most runs from their country, but what those runs lacked was impact. Babar was the fifth best run-getter in the world and made 738 at a strike rate of 133.21. Rizwan was 18th on the list with 617 runs at 117.30. Seven more batters made over 100 runs for Pakistan that year and six had better strike rates than Riz-Bar — Fakhar Zaman (152.57), Saim Ayub (143.67), Usman Khan (122.75), Iftikhar Ahmed (115.72), Irfan Khan Niazi (140.36), Shaheen Afridi (130.09), and Shadab Khan (150.68).\n\nTheir strike rates gave grimmer reading in the T20I World Cup that year. Rizwan, the captain, made his 110 runs at 90.90 and Babar scored his 122 at 101.66.\n\nThe humiliation of a group-stage exit from the home Champions Trophy sparked changes in Pakistan’s T20I set-up. It is often the case in Pakistan that attempts to rectify the blunders of one format in another. Hence, the Pakistan Cricket Board (PCB) removed Rizwan from the captaincy of the shorter-format and dropped him along with Babar from the T20Is altogether to bring in youngsters and lesser experienced players who enjoyed the reputation of being aggressive with the bat.\n\nThe PCB went in overdrive to package these changes as a realisation that they had fallen behind and that this was a much-needed overhaul to evolve with the rest of the world. The selectors, head coach, and captain spoke about the necessity of instilling aggression in the batting, and promised to do it right at the top of the batting order.\n\nThat this year’s PSL was the worst for Rizwan and Babar further stressed the necessity of moving on from the two. Rizwan made 367 runs — the least he has scored in the last five years — in 10 matches. Babar’s returns were even worse. He scored 288 runs, which are the least he has made in a single edition of the PSL when he has played more than two matches.\n\nThe squad Pakistan has announced for the T20I Asia Cup and the tri-series against Afghanistan and hosts UAE in the lead-up to the continental championship comprise players who have now become regular under this head coach and captain. It does not happen in Pakistan that a bunch of players are handed a long rope. But this is important if the management desires from the players to buy in to an ideological shift that it is introducing. Players, especially batters, need to be divorced from the fear of failure if they are asked to play aggressive and high-risk cricket.\n\nPakistan, this year, have played only one T20I series at home, which they won comprehensively against Bangladesh in Lahore. This new approach is yet to produce results on the road. Out of the three series in New Zealand, Bangladesh, and West Indies, Pakistan have won only the latter, that too 2-1.\n\n“We were challenged with three different surfaces [in each of the three series],” Pakistan head coach Mike Hesson said on Sunday after selector Aaqib Javed announced the squad. “In Lahore, the surfaces were flat and the batting excelled. We went to Bangladesh where they were incredibly challenging and low-scoring games.\n\n“Our top order sets the game up. All the games we won, the top order performed really well. The third game in the West Indies, our openers put on 140 [138]. We need that at a run rate that gets us ahead of the game. T20 is all about setting the game up and being ahead of the game all the time in case you get yourself out. From a batting point of view we’ve got a line-up that can continue to do that.”\n\nWhen asked about Babar, Hesson said: “Babar played nicely in the first ODI but missed out on the next two. There’s no doubt Babar’s been asked to improve in some areas around taking on spin and in terms of his strike rate. Those are things he’s working really hard on.\n\n“But at the moment, the players we have selected have done exceptionally well. Sahibzada Farhan has played six games and won three Player of the Match awards. A player like Babar has an opportunity to play in the BBL (Australia’s Big Bash League) and show he is improving in those areas in T20s. He’s too good a player not to consider.”\n\nThe series win at home against Bangladesh was followed by their first-ever series defeat to the same opposition in the corresponding series in Mirpur, Dhaka. Pakistan, this year, have won seven of the 14 T20Is.\n\nAs it seems, the management would rather lose with the younger lot that they can nurture to play a certain way than with the established players who refuse to alter their approach.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/18123039658342b.jpg",
  "retrievedAt": "2025-08-20T04:54:15.368Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931651/t20-asia-cup-are-pakistan-right-in-leaving-out-babar-rizwan",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T07:30:46.000Z"
}
