{
  "article_id": "2025-05-29_eb041f62f1f55d4bd000196eaf8225ab",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dr-zeeshan-danish-assumes-charge-as-pbms-dg-operations/",
    "retrieved_at": "2025-08-27T16:02:37.831Z"
  },
  "metadata": {
    "title": "Dr. Zeeshan Danish assumes charge as PBM’s DG operations",
    "author": null,
    "date_published": "2025-05-29T12:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 192,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 29 (APP):Professor Dr. Muhammad Zeeshan Danish has officially assumed the role of Director General (DG) Operations at Pakistan Bait-ul-Mal, headquartered in Islamabad. He received a warm welcome from Managing Director Captain Khalid Shaheen Butt, accompanied by a gathering of over 400 employees, including Directors and staff members. The team expressed their delight at Dr. Danish's arrival, presenting him with a bouquet as a warm gesture of welcome. Their enthusiastic reception highlights their eagerness to collaborate under his leadership and expertise. While extending his best wishes to embark on this new role, Managing Director PBM Senator Capt. Shaheen Khalid Butt expressed his hope that the organization will reach new heights in its mission to reduce poverty in align with the federal government's vision. Acknowledging the importance of his responsibilities as DG Operations, Professor Dr. Muhammad Zeeshan Danish reaffirmed his steadfast commitment to strengthening the organization. He emphasized his role in overseeing operational activities, driving strategic initiatives, and ensuring efficient service delivery to society's most vulnerable groups. On the occasion, DG Operations PBM, Professor Dr. Zeeshan Danish paid a courtesy visit to multiple branches of the PBM Headquarters to engage with personnel.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}