{
  "article_id": "2025-05-29_1bad73d61092d8b2245688d72764174d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/six-day-accredited-mediation-program-for-adr-stakeholders-begins-in-capital/",
    "retrieved_at": "2025-08-27T16:03:22.619Z"
  },
  "metadata": {
    "title": "Six-day ‘Accredited Mediation’ program for ADR stakeholders begins in capital",
    "author": null,
    "date_published": "2025-05-29T10:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 430,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 29 (APP):The 6-day internationally recognized \"Accredited Mediation Program\" in collaboration with the International Mediation and Arbitration Center (IMAC) of the Ministry of Law and Justice and ADR-ODR International began on Thursday at COMSTEC, Islamabad. In his welcome address, Secretary Law and Justice, Mr. Raja Naeem Akbar welcomed and thanked all the participants. The Secretary Law highlighted the efforts of the Ministry of Law and Justice in institutionalizing Alternative Dispute Resolution (ADR) in Pakistan, including the recent signing of the Singapore Convention on Mediation, notification of 129 internationally recognized mediators, establishment of six mediation centers and training of over 576 professionals across the country. He stressed that mediation provides a timely and cost-effective solution to the backlog of over 2.4 million cases in Pakistan. Ms. Ayesha Rasool, Project Director, International Mediation and Arbitration Centre (IMAC), said that IMAC, a key initiative of the Ministry of Law and Justice of Pakistan, is working to transform the dispute resolution mechanism in the country, providing simple, speedy and globally recognized solutions. She highlighted that IMAC aims to address the huge backlog of cases pending in the courts, reducing the time to resolve cases from several years to a few weeks. This will not only reduce the pressure on the judicial system but also create a positive environment for business, promote investment, and strengthen public confidence in Pakistan's legal institutions, she said. Mr. Rahim Shamji, Founder and CEO of ADR-ODR International and Lead Trainer of the training program, emphasized that mediation is rapidly becoming a global force, while traditional litigation is gradually losing its appeal. Appreciating the efforts of the government of Pakistan, Mr. Shamji said that initiatives like IMAC show that Pakistan is committed to adopting modern and globally recognized dispute resolution methods, which give the country a better position internationally. Ms. Sara Tarar, Resident Representative of ADR-ODR International and Lead Trainer for Pakistan, emphasized that traditional litigation usually ends with one party winning and the other losing, while ADR ensures that all parties achieve mutually beneficial outcomes. She emphasized that integrating ADR into Pakistan's legal system is not only beneficial but also essential for harmony, efficiency and justice. This six-day tri-accredited civil/commercial mediation training program is attracting participants from various sectors, including the Federal Minister for Law and Justice, Minister of State for Law and Justice, officials from ministries, provincial governments, judicial institutions, bar councils, chambers of commerce, and regulatory authorities. Once equipped with mediation skills, these professionals will be able to effectively mediate civil and commercial disputes in Pakistan and internationally, thereby enhancing the global image of Pakistan's legal system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}