{
  "article_id": "2025-05-29_ae3a9df8c2d62ef317b8c329d3716f14",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/speakers-propose-substantial-increases-in-tobacco-taxation/",
    "retrieved_at": "2025-08-27T16:00:57.287Z"
  },
  "metadata": {
    "title": "Speakers propose substantial increases in tobacco taxation",
    "author": null,
    "date_published": "2025-05-29T18:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 558,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 29 (APP): Public health experts, parliamentarians, and civil society leaders have called for urgent and substantial increases in tobacco taxation. Addressing a high-level policy dialogue on tobacco control, they also urged for stricter enforcement of tobacco control laws to address the alarming rise in nicotine consumption, especially among Pakistan's youth. MNA Saher Kamran, highlighted the critical role of educational institutions in safeguarding youth. She informed that she has moved many bills in the Senate as well as National assembly during the past 15 years. Presenting compelling data, Asif Iqbal, Managing Director of the Social Policy and Development Centre (SPDC), underscored that the freeze on Federal Excise Duty (FED) since February 2023, coupled with relatively low inflation, has made cigarettes increasingly affordable. He warned that if corrective tax measures are not implemented in the upcoming fiscal year, over 490,000 young people are likely to initiate smoking. \"A significant tax hike would not only curb tobacco consumption but also generate much-needed revenue for public health,\" Iqbal stressed. Zaheer Qureshi, Director of the Federal Board of Revenue's (FBR) Track and Trace System, provided insights into FBR's efforts to combat illicit trade through digital monitoring. He noted that products like tobacco, sugar, and cement are now tracked electronically across the supply chain to enhance transparency and revenue collection. Dr. Arsalan Haider, Director of the Tobacco Control Cell at the Ministry of National Health Services, shared the mandate of TCC terming it as a comprehensive, self-guiding framework aimed at supporting Pakistan's commitments under the WHO Framework Convention on Tobacco Control (FCTC). From the provincial legislature, Punjab MPA Tahira Mushtaq spoke about her successful resolution in the Punjab Assembly, advocating for a provincial tobacco levy and legal measures to regulate emerging products like vapes and e-cigarettes. \"These newer forms of nicotine are infiltrating our youth unchecked. We must act now,\" she asserted. Echoing similar concerns, MNA Sabeen Ghauri emphasized the need to plug legislative gaps and modernize Pakistan's tobacco control laws. \"Despite having two federal laws, we face serious enforcement challenges. We are committed to amending existing laws and introducing new ones to cover all nicotine products including vapes and nicotine gums,\" she affirmed. Ghauri also expressed optimism about increased tobacco taxes in the upcoming federal budget. MNA Dr. Shazia Sobia and MNA Naeema Kishwar Khan also supported tax increase on tabacco. Safdar Raza from Aurat Foundation while citing a recent WHO policy brief, pointed out that while the industry claims revenue loss due to illicit trade, official figures show a 30% rise in economy-brand production and a 22% overall increase in cigarette output, undermining industry claims. \"We must abolish the tiered system and impose uniform, high taxes on all tobacco products,\" he urged. MNA Naeema Kishwar Khan raised concerns about the plight of tobacco farmers, especially in Khyber Pakhtunkhwa. She urged to introduce alternative cash crops and ensure fair economic returns for growers, alongside increasing tobacco taxes in the upcoming budget. Ms. Mumtaz Mughal, Director Programs at Aurat Foundation, emphasized that tobacco use poses unique challenges for women, particularly when male family members are addicted. \"Tobacco control is a women's issue, too. We must empower women as change-makers in this fight,\" she concluded. The dialogue concluded with a unified call for decisive policy action-comprehensive tax reforms, stronger legal frameworks, and nationwide enforcement-to protect public health and the future of Pakistan's youth.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}