{
  "title": "Sherry Rehman calls for gender equality, condemns violence against women",
  "link": "https://www.app.com.pk/national/sherry-rehman-calls-for-gender-equality-condemns-violence-against-women-2/",
  "date_published": "2023-03-08T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 08 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Wednesday marked International Women’s Day by honoring the women of Pakistan at an event organized by the Women’s Parliamentary Caucus.\nIn attendance were Secretary of the Caucus Shahida Rehmani, and Speaker of the National Assembly Raja Pervaiz Ashraf, a news release said.\nMinister Rehman said, “Women who hold positions of power today owe a debt of gratitude to trailblazers like Shaheed Mohtarma Benazir Bhutto, whose sacrifices paved the way for us to enter the political mainstream and effect change. But the fight for gender equality is far from over, with the UN Chief warning that it may take as long as 300 years to achieve. However, we cannot afford to wait decades or even years to act. Each of us must do our part, both professionally and personally, to bring us closer to the goal of women’s equality.”\nThe Minister called on elites to address the cultural and societal barriers preventing women from obtaining their rights. “From elites to the bottom of the pyramid, there are obstacles of culture and vultures, who stand as a barrier in front of women and stop them from obtaining their rights. Despite the existence of negotiating tables for terrorists, women are still denied their rightful demand for equal rights.\nThe Pakistan Peoples Party and Shaheed Mohtarma have always been at the forefront of protecting vulnerable groups through legislation and awareness campaigns. It is now time for our elites to act, as we can no longer ignore the pervasive violence against women in our country and around the world.”\nShe concluded that every day is a battle for women, but it is heartening to witness women from all political affiliations in parliament standing united against misogynistic and sexist remarks. “Women are at the forefront of parliamentary business, as well as in the informal economy – from care services to agriculture.\nThe empowerment and inclusion of women in the economy could potentially add US$80 billion to our GDP. However, this can only happen if women are not sidelined and given the opportunity to thrive.”\nMinister Rehman also attended the First Gender and Climate Awards Ceremony organized by the Embassy of France and International Union for the Conservation of the Nature (IUCN) at the French Embassy.\nThe Minister presented the awards to the winners and highlighted that the Minister of Climate Change emphasizes the importance of gender mainstreaming in all programs and projects.\n“This award recognizes the efforts of individuals and organizations promoting gender equality and climate action, creating role models for young women and girls in the fight against climate change. The awardees showcase the power of collaboration, innovation, and dedication to build a better future for generations to come,” said the Minister.\nMinister Rehman also condemned the baton charge by Islamabad Police during a peaceful procession of Aurat March.\n“This incident must be thoroughly investigated, and those responsible must be held accountable. It is a shame that such actions took place on International Women’s Day, and it is not what we fought for.\nI condemn this act of violence and have already requested an inquiry into the matter. Furthermore, I have informed the Interior Minister about the situation, and we will not tolerate such behavior in the future,” said the Minister.",
  "retrievedAt": "2025-08-11T06:18:54.715Z"
}
