{
  "title": "Speakers demand urgent revamp of Pakistan’s existing defence production model",
  "link": "https://www.app.com.pk/national/speakers-demand-urgent-revamp-of-pakistans-existing-defence-production-model/",
  "date_published": "2023-03-08T08:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP):The speakers here on Wednesday were of the view that given the prevailing geopolitical and geo-economic environment, there was an urgent need to revamp and transform Pakistan’s existing archaic public-controlled model regarding defence production.\n“To exploit its defence production potential to the fullest, Pakistan needs to develop and progress in the fields of education, quality human resource, research and development, industrialization, technology, academia-industry linkages and provide an enabling environment to the private sector.”\nThis was the key message of the eminent speakers at the seminar on ‘Defence Production Potential in Pakistan: Increasing through Public-Private Partnership-A Policy Construct’ organized by the Centre for Aerospace and Security Studies (CASS), a news release said.\nThe keynote address was delivered by former Chairman Joint Chiefs of Staff Committee, General (R) Zubair Mehmood Hayat. The seminar was chaired by President CASS Air Marshal (R) Farhat Hussain Khan, while Air Vice Marshal Faheem Ullah Malik, Director at CASS moderated the proceedings.\nThe fundamental objective, it was stressed should be the capacity and capability-based development of the private industry through public-sector support. In this regard, DPEs should create a conducive environment for the private sector and fund their Research and Development (R&D). It was important for the public sector to own the private sector to foster indigenous R&D and transfer of production.\nRepresentatives of Defence Production Establishments (DPEs), retired and serving military officers, scholars from various think tanks, and other relevant stakeholders participated in the seminar and forwarded well-considered proposals for the improvement of existing defence production processes.\nOther distinguished speakers included Vice Admiral (R) Iftikhar Ahmed Rao, former Deputy Chief of Naval Staff (Operations) and Managing Director Karachi Shipyard; Air Vice Marshal (R) Asad Ikram, Senior Advisor, Project Phoenix, Air Headquarters and Tanveer Sultan Awan, Chairman, Hajvairy Technologies (Pvt) Limited.",
  "retrievedAt": "2025-08-11T06:19:12.058Z"
}
