{
  "title": "Women played key role in community resilience initiatives: Sherry Rehman",
  "link": "https://www.app.com.pk/national/women-played-key-role-in-community-resilience-initiatives-sherry-rehman/",
  "date_published": "2023-03-08T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP):Federal Minister for Climate Change, Senator Sherry Rehman on Wednesday said the women of the climate catastrophe-impacted regions of the country played a key spearheading role in successful management of initiatives intended to enhance climate resilience and disaster preparedness.\nThe Federal Minister delivered her keynote address at the launch of the first Pakistan Gender and Climate Awards to mark the International Women’s Day, held under her patronage jointly organised by the Embassy of France and Agence française de développement (AFD), together with International Union for Conservation of Nature and Natural Resources (IUCN Pakistan).\nThe objective of this award is to highlight women’s commitment and leadership in the fight against climate change and the need to adopt gender-responsive policy in line with the Paris Agreement.\nSenator Rehman said, “We are training all provinces with UNDP to manage GLOF events and enhance disaster resilience with focus on community protection.”\nShe added that these summers were going to be tough for women again especially in the flood affected areas who were still disproportionately affected as they were in all crises.\n“Vulnerabilities go up exponentially from predations to pressures on the resources that they have to produce for their families or the confinements they face and dangers and troubles they face while living on roadsides,” she said.\nThe Minister underlined that many of those women were faced with sanitary challenges including maternal morbidity and the country saw over 650,000 women pregnant at several phases of the 2022 Floods, some critical at height of summers, whereas the country’s rescue and relief workers were not able to attend or reach them timely because there were no health centers devastated by floods.\n“These are difficult times for the human race particularly those of us who are on the frontline of the ground zero of climate change,” she cautioned.\nThe Minister said 33 million affected persons appealed during 2022 monster floods out of which 70 percent were women and children would better tell the world that the country was very much among the top three climate vulnerable countries.\nShe also extended her felicitations to the winners of the awards, and organisers for successful launch of the event.\n“We are very pleased to bring the Gender and Climate Award to Pakistan, and I’m honored that Minister Rehman is honoring this event with her presence,” said Ambassador of France Nicolas Galey.\n“This award provides a platform for organizations and individuals in Pakistan to showcase their efforts in promoting gender equality and climate action and to inspire others to join the movement.\nIt also echoes Pakistan’s leadership in international climate change negotiations after the floods of 2022, particularly during the COP27 in Sharm El-Sheikh.”, he added.\nCountry Representative of IUCN Pakistan, Mahmood Akhtar Cheema said, “The Gender and Climate Award is in line with the gender policy objectives of the National Climate Change Policy of the Government of Pakistan (October 2021).\nThe IUCN has also made up a concrete follow up to the launch of the first national Climate Change Gender Action Plan of Pakistan, with the assistance of Green Climate Fund.\nThe winners have received recognition, visibility, and support to scale their initiatives and to further advance gender and climate action in Pakistan.”\nThe award draws attention to good practices and concrete solutions led by women from civil society for a more fair, equal and healthy planet. It responds to the Paris Agreement’s objective of promoting gender equality, justice and youth engagement in climate action. It seeks to promote greater inclusion and leadership of women in climate action.\nThe award was open for activists, grassroots and women-led organizations (including community-based organizations), private education institutions, and social enterprises) working for climate protection and gender equality.\nApplications for the Gender and Climate Award in Pakistan were screened by a jury comprising representatives from the Embassy of France in Pakistan, the AFD in Pakistan, IUCN Pakistan, as well as representatives from the Civil Society Coalition for Climate Change (CSCCC) and the UNDP.\nThe jury has selected the best initiatives that promote gender equality and climate action in Pakistan. The first prize winner has received 3,500 EUR, the second prize winner has received 2,500 EUR, and the third prize has received 2,000 EUR. The award money shall be invested in the initiative or project of winners.\nHumera Iqbal, She Leads Agriculture, Irum Fatima, Pakistani Hoslamand Khawateen Network (PHKN) and Mehreen Raza – SheGuard were the winners.",
  "retrievedAt": "2025-08-11T06:19:01.767Z"
}
