{
  "title": "WMC holds student-enrollment ceremony for MBBS, BDS’s fresh sessions",
  "link": "https://www.app.com.pk/national/wmc-holds-student-enrollment-ceremony-for-mmbs-bdss-fresh-sessions/",
  "date_published": "2023-03-08T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP): Watim Medical & Dental College (WMC) on Wednesday held a ceremony to enroll students in its fourth session of Bachelor of Medicine & Bachelor of Surgery (MBBS) and for the 7th batch of Bachelor of Dental Surgery (BDS).\nFormer AJK Secretary Health Major General (Retd.) Tariq Hussain was the chief guest and President of AJK Central Bar Association Raja Aftab Ahmed participated in the event titled “White Coat Ceremony” as a guest of honor.\nA large number of people, including parents of the enrolled students, WMC faculty members, College Chairman Prof. Dr Abdur Rasheed Mian, Principal WMCR Prof. Dr Major General (Retd.) Muhammad Ahmed and Principal WDCR Prof. Dr Mohtada Hassan also attended the ceremony.\nThe college has enrolled around 100 students for MBBS and 50 for BDS classes.\nSpeaking on the occasion, chief guest Major General (Retd.) Tariq Hussain said stepping into the field of medicine and dentistry was an important milestone in the lives of the students.\nHe said this White Coat Ceremony indicated that the students were entering a profession that was ‘honourable’ by all means, advising future doctors to always remain polite and kind to patients.\n“Doctor-Patient relationship is of prime importance. When you talk to a patient, took yourself in his place, think and feel his/her pain and the agony from which he or she suffering,” he said.\nAfter becoming a doctor, Tariq Hussain asked the students never to ignore the family and attendants of the patients because they were also going through the same agony and pain.\n“Don’t expect the behavior of a normal person from patient or attendant because it is a suffering . . . they are going through the pain and miserable time of life. So if they are harsh, you have to ignore,” he added.\nChairman Prof. Dr Abdur Rasheed Mian congratulated the students for their admission to MBBS and BDS classes; informed them about the rules and regulations of the college and the study schedule besides other activities.\nHe said the college had a team of dedicated and professional faculty that always produced remarkable results.\nReferring to the recent MBBS result, he said seven students achieved distinction and the college’s result stood at 91 percent, adding the management and faculty were committed to further improving the passing out percentage.\nHe said three departments of the college were imparting specialized education in dentistry and four in the field of medicine.\nParents of the enrolled students also spoke on the occasion and expressed their complete satisfaction over the education standard and system of the WMC.\nLater, the WMC Chairman presented souvenirs to chief guest Major General (Retd.) Tariq Hussain and guest of honour Raja Aftab Ahmed.",
  "retrievedAt": "2025-08-11T06:19:10.043Z"
}
