{
  "title": "CPSC launches three Chinese books at ISSI",
  "link": "https://www.app.com.pk/national/cpsc-launches-three-chinese-books-at-issi/",
  "date_published": "2023-03-08T08:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP): The China-Pakistan Study Center (CPSC) at the Institute of Strategic Studies Islamabad (ISSI) has hosted a book launch ceremony for three books authored by Chinese writers and translated by Pakistani authors.\nThe books included, “Mao Zedong and Contemporary China”, “How the Chinese Communist Party Manages the Development Issue”, and “Beyond the Karakoram: A Photographic Dialogue Between a Chinese and a Pakistani Scholar”.\nSenator Dr Musadik Malik, Minister of State for Petroleum, and Fahd Haroon, Minister of State/SAPM on Public Communication and Digital Platform were the chief guests at the event held the other day.\nFormer Ambassador to China Naghmana Hashmi and Dr Hassan Daud Butt, Associate Professor from Bahria University reviewed the books. Dr Talat Shabbir, Director of the China-Pakistan Study Centre, highlighted the significance of literature in building people-to-people contacts.\nDG ISSI Ambassador Sohail Mahmood on the occasion underlined that Pakistan’s relations with China were the “cornerstone” of its foreign policy.He highlighted the key features and growth trajectory of the Pakistan-China ‘All-weather Strategic Cooperative Partnership’; the role of Chairman Mao in the Chinese revolution and China’s modernization; the CPC’s role in China’s socio-economic development; and the importance of further strengthening the Public Diplomacy dimension of Pakistan-China relations through such events.\nNaghmana Hashmi in her remarks stressed on Mao’s vision in reference to the book.\nShe said history had always been important in understanding modern China and the vision of the country was different from that of other nations worldwide. “It is pertinent to seek the understanding of these philosophies that China follows in its journey toward prosperity.”\nHashmi said that when one was able to understand these philosophical concepts, one can predict where China is heading.\nDr Hassan Butt, in his detailed presentation, highlighted the geo-strategic, geo-economic and geopolitical significance of China in current international politics. The Communist Party of China plays important role in leading the country in the right direction, he underlined, while citing examples from the book under review.\nPang Chunxue, Charge d’ Affaires, emphasised the strong Pakistan-China relationship. “Literature has always played a dominant role in understanding the visions of nations. These books translated into Urdu depict the commitments of both countries to understand each other,” she added.Pang stressed that such events would play a constructive role in expanding people-to-people exchanges.\nSAPM Fahad Haroon acknowledged that China’s current leadership was following what Mao had visioned decades earlier. He also reaffirmed Pakistan’s commitment to further deepen and broaden its relations with China.\nSenator Dr Musaddiq Malik shed light on the current international dynamics and how China was rising as a resilient nation under courageous and visionary leadership. He stressed that China’s leaders had served in the best interests of their country and set a unique growth and development trajectory, which was something to be emulated.\nLater, Chairman BoG Ambassador Khalid Mahmood presented mementos to the speakers.",
  "retrievedAt": "2025-08-11T06:19:11.805Z"
}
