{
  "title": "Women must help set country’s direction through their vote power: Maryam",
  "link": "https://www.app.com.pk/national/women-must-help-set-countrys-direction-through-their-vote-power-maryam/",
  "date_published": "2023-03-08T14:29:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 08 (APP):Pakistan Muslim League Nawaz (PML-N) Senior Vice President and Chief Organiser Maryam Nawaz Sharif has urged women to help set direction of the country by participating in the voting process.\nAddressing a programme, held in connection with the International Women’s Day under the auspices of the PML-N Women Wing here on Wednesday, she called upon them to contribute to progress of the country by participating in all sectors of life. She said there were a lot of inspirational stories of several women, who were playing their role in different fields including politics, Pakistan armed forces, police, science, aerospace, sports, education, health, civil services, writing, games, fire-fighting, mountaineering and several others.\nShe said that Mohtarma Fatimah Jinnah was an inspiration for women, who always stood by her brother, Quaid-e-Azam Muhammad Ali Jinnah, in the Pakistan Movement struggle. She said that Fatimah Jinnah was a trendsetter, from whom women should get encouragement.\nShe said that her mother Kalsoom Nawaz Sharif was a traditional and eastern lady, but during testing times, she came out and bravely faced the dictatorship of General Musharraf. “She was a great mother, who trained me to face the hardship of the life,” Maryam added.\nThe PML-N leader also lauded Mohtarma Benazir Bhutto for her contribution for the country, adding that BB was the first Muslim prime minister of the world and it was a pride for the nation. She named several women who were playing their role on the frontline for progress of the country.\nMaryam said: “The population of the country consists of 52 per cent women, and their share in all fields, including politics, should also be 52 per cent.”\nThe PML-N leader said that she was encouraged by her father former prime minister Muhammad Nawaz Sharif in politics. She said the ratio of women vote was two per cent more than the males in the country and women should realise their power and set the direction of the country through participation in voting process.\n“Has every woman the freedom to judge independently whom she should vote and whom not,” she asked. She said that women should have freedom of vote to set the direction of the nation.\nMaryam Nawaz said earlier the PML-N had been a male-dominated party, but now a larger number of women were joining the frontline of the party politics.\n“I am a traditional, conventional and eastern cultured woman, and I am proving to the first droplet of rain in the PML-N mainstream party activists,” she added.\nMaryam appreciated several PML-N woman leaders including Marriyum Aurangzeb, Hina Butt, Azma Bukhari, Nausheen and Sadia over their services for the party as women.\nThe PML-N senior vice president said that it was unfortunate that Pakistan was placed at 145th number in the list of global gender gap, discrimination, inequality and division, which was slightly better than India.She said that in Pakistan women’s life was under threat during delivery process even today, and a number of women and children die every year during this process.\nShe said that women had to face discrimination in education and they were discouraged for getting education.“I got married at the age of 19, and I completed my Masters in English Literature after marriage,” she said.\nMaryam Nawaz wished the same opportunities for women as men were provided, and urged parents to encourage their daughters to get education and join different fields, as they would also make them hold their heads high, like their sons. She said that women workforce should be respected in the country, adding that a large number of women worked in factories, homes, agricultural fields, but regretted that their work was not recognised accordingly.\n“I wish their work should be acknowledged with due respect and wages,” she added. Unfortunately, working women did not even realise their rights and contribution, adding that the country could make progress at a good pace if more women share their contribution in the progress.\nShe said that daughters, sisters and mothers should be provided a protected and conducive environment in the fields of Science, Technology, Engineering and Mathematics (STEM), so that they could excel in these fields and brighten the name of the country.\nMaryam said that women victimization was common in the country and despite legislation, only a few could get justice. She regretted that women were still harassed at their workplaces.\nShe stressed that women should be provided a protective environment when they are out of their homes. She said that Pakistan had women of great caliber from Khyber to Karachi and they should be recognised and acknowledged.\nShe gave credit to her father that he encouraged her to participate in politics for the sake of the party and the country. The PML-N chief organiser said that every woman should be political and no woman should be apolitical even she was at home or at office, as they should participate in the decision making.\nShe said that women should elect members of such a party in which they could be represented and their rights could be protected.\n“They should vote for such representatives who can protect their rights,” she added. Maryam said that she herself had to face harassment when PTI chief Imran Khan, in his speeches, discussed her marriage, which was, in fact, a arranged marriage with the full participation of her parents and grandparents.\n“I do not even like to utter Imran’s name, but due to politics, I had to do so. I do not talk about Imran’s personal life, but as a political leader,” she added.\nShe expressed her pride that women in the PML-N always felt they were safe in the gatherings and no man had courage to even touch any woman in the PML-N meetings and public gatherings. And on the other hand, she added that the chief of the PTI himself used foul language about women like he did about a respectful woman judge and his followers just went to his gatherings to harass women. She regretted that not a single woman was safe in the PTI.\nShe appreciated the Pakistan Peoples Party for its culture about women and said that she had seen a due respect in the PPP for women even it was a different party and the PML-N had contested several elections against it.\nShe said that the PTI was a strange party in a way, where women came to protect men and their leader and what they had to face was clear in an audio tape between Dr Yasmin Rashid and a woman leader of the PTI. If women were harassed like in the PTI did, then which respectable family would allow their daughters to go for politics, she questioned.\nShe said that talking about Imran’s daughter Tyrian White was not a personal attack because he told a lie about his daughter and the case about it was in the courts. “It is not his personal matter as he is not accepting her as his daughter in the courts,” she said.\nMaryam said that her father Nawaz Sharif always welcomed her (Maryam) by rising up from his seat and her father always respected his wife and this was training from her home.\n“Once a person suggested Imran to own his daughter, but he refused by saying that it would end his politics,” Maryam claimed. She said that a respectable man could never prefer his politics over his daughter. She asked Imran to accept his daughter and give her respect. She promised that the court would be requested not to disqualify Imran on that matter.\n“I respect Jamima Khan as she is looking after Imran’s daughter, though she is not her real mother,” she added.A person who did not own his daughter, how come he could give respect to the nation’s daughters, she raised a question. “I am referring to a mental disease of Niazi, and it is not a personal attack,” she added.",
  "retrievedAt": "2025-08-11T06:18:51.141Z"
}
