{
  "title": "Indian forces raided civil society, destroyed 657 houses during 2020, says LFOVK annual report",
  "link": "https://www.app.com.pk/national/indian-forces-raided-civil-society-destroyed-657-houses-during-2020-says-lfovk-annual-report/",
  "date_published": "2020-12-30T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP): The Indian occupied forces conducted 312 Cordon and Search Operations (CASOs) and Cordon and Destroy Operations (CADOs) resulted in 124 encounters in which 232 freedom fighters embraced martyrdom during the year, said a report issued on Wednesday.\nSuch annual report was prepared by the Legal Forum for Oppressed Voices of Kashmir (LFOVK) on human rights situation in Indian Illegally Occupied Jammu and Kashmir which covers the period from January 1 to December 30, 2020.\nAccording to the report, the Indian forces destroyed 657 houses during such operations.\nThe martyrs included 65 civilians, 232 freedom fighters while 177 Indian forces were also killed.\n2020 may be recorded as “Zero year” in the human history for the COVID-19 pandemic forced most of global citizenry inside their homes to save themselves from the deadly infection.\nHowever, for IIOJK, the year added more complications and saw no letup in atrocities committed by the Indian occupying forces, report stated.\nThe Indian forced launched broad-day inhuman attacks on Kashmir’s civil society, raiding residencies and offices of human rights defenders, journalists and civil society organizations, it added.\nThe year witnessed 65 extra judicial killings of civilians.\nThe destruction of civilian properties during encounters saw an increase during the COVID-19 lockdown enforced by the government; an entire village in Budgam district was vandalized rendering many families homeless and without shelter, it said.\nThis is despite the fact that United Nations Secretary General Antonio Guterres called for a global ceasefire in conflict regions amid the COVID-19 pandemic. But, as usual offender of international law and agreements, India defied the call from world’s highest office and continued with its war crimes policies in Indian-occupied Jammu and Kashmir.\nAccording to report, the journalists working for Kashmir and international media continued to be pressurized, intimidation and harassment by the Indian authorities.\nMany journalists were booked under criminal laws while one still remains behind bars amid delayed trial by the puppet government agencies.\nThe authorities launched new media policy in which government holds full control on newspapers and magazines. The year witnessed the continuation of the ban on internet services which remain enforce since August 5 2019.\nThe right to access to information continues to be restricted in Jammu and Kashmir as part of India’s all-out onslaught against Kashmiris as there were 141 instances of internet blockades recorded from January 1 to December 30 2020.\nThis, amid deadly pandemic, when internet was of utmost importance for health authorities as well as general public. During the period from 01, January to 30 December, 2773 persons were detained and arrested by Indian occupational forces and lodged in different jails across India.\nThis year saw one of the worst assaults on human rights when India rushed its agencies to Kashmir which raided residencies and offices of Journalists, human rights workers and civil society organizations.\nIn early November, India’s so-called anti-terror body NIA raided residence of Khurram Parvez, Parvaiz Bukhari besides others.\nThe raids were held on rights bodies offices, NGOs. This is unprecedented wherein Journalists and human rights defenders are put under such humiliation, said the report.",
  "retrievedAt": "2025-08-11T20:11:58.608Z"
}
