{
  "title": "Pakistan, Djibouti desire strengthening of bilateral cooperation in diverse areas",
  "link": "https://www.app.com.pk/national/pakistan-djibouti-desire-strengthening-of-bilateral-cooperation-in-diverse-areas/",
  "date_published": "2020-12-30T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP): Pakistan and Djibouti on Wednesday reiterated their desire to strengthen bilateral cooperation in the areas of commerce, culture and defence.\nThis was discussed at a meeting between President Dr Arif Alvi and the visiting Djibouti parliamentary delegation, led by President of National Parliament of Djibouti and acting-Chairman of African Union Parliament, Mohamed Ali Houmed here at the Aiwan-e-Sadr.\nWhile welcoming the delegation, the President said that Pakistan and Djibouti enjoyed excellent relations and Pakistan wanted to further improve defence and economic ties with Djibouti for the mutual benefit of the two brotherly countries.\nHe appreciated the visit of Parliamentary delegation and expressed the hope it would further strengthen the existing foundation of strong bilateral relations between the two countries.\nHe said that Pakistan highly valued its ties with Djibouti and had decided to open its embassy there and resident diplomatic missions in other African countries.\nThe President sought the support of the Government of Djibouti to expeditiously process and clear Pakistani goods at Djibouti port meant for Ethiopia and other destinations in the Horn of Africa.\nHe also highlighted the atrocities and human rights violations being committed by India against the Muslim population in the Illegally Occupied Jammu and Kashmir (IIOJK).\nThe President emphasized the need for a unified call from international community to put pressure on India to stop human rights violations and grant Kashmiris their right to self-determination as promised under the UN Security Council resolutions.\nPresident of National Parliament of Djibouti underscored the need for expanding bilateral cooperation in every sphere, including culture, trade and defence.\nHe said that Gwadar and Djibouti ports would help boost trade between the two brotherly countries.\nBoth sides emphasized the need for parliamentary, cultural and defence exchanges which would help in bringing the two countries further closer",
  "retrievedAt": "2025-08-11T20:11:59.660Z"
}
