{
  "title": "2020 remains exceptional year for water, hydel power in Pakistan",
  "link": "https://www.app.com.pk/national/2020-remains-exceptional-year-for-water-hydel-power-in-pakistan/",
  "date_published": "2020-12-30T06:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP): The year 2020 proved to be an exceptional year for water and hydropower sectors in the country, as the Water and Power Development Authority (WAPDA) succeeded in achieving the historic milestones in the two sectors during this year.\nBesides generating highest-ever low-cost hydel electricity, WAPDA also initiated construction work on the long-delayed mega multi-purpose Diamer Basha Dam Project in 2020.\nAs per the details, WAPDA hydel generation continued to surge during 2020 too.\nAs many as 22 hydel power stations owned and operated by WAPDA across the country generated 38.3 billion units, which is the highest-ever generation in a year.\nThis record generation includes 12.08 billion units from Tarbela, 4.98 billion units from Tarbela 4th Extension, 6.48 billion units from Ghazi Barotha, 5.76 billion units from Mangla, 4.93 billion units from Neelum Jhelum and 4.07 billion units from rest of the hydel power stations.\nWAPDA hydel generation in 2020 stands 3.8 billion units more, if compared with that of 2019, benefitting the country with about Rs.53.2 billion, as the national exchequer had to bear the brunt of Rs.53.2 billion if this additional electricity would have been generated through thermal source.\nRemoving obstacles in the way to implementing the project, WAPDA started in July this year construction of Diamer Basha Dam a vital project for water, food and energy security of the country with gross water storage of 8.1 million acre feet (MAF), live water storage of 6.4 MAF and power generation of 4500 megawatt (MW).\nDespite Corona Virus Pandemic, construction work continued satisfactorily on Mohmand Dam during 2020.\nThe project was initiated in May 2019. With completion of Mohmand, Diamer Basha, Dasu and several other on-going projects from 2024 to 2029, hydel power generation will enhance from existing 9389 MW to about 20500 MW more than double with addition of 11122 MW.\nSimilarly, live water storage capacity in the country will also increase from the existing 15.1 MAF to 23.4 MAF with an addition of 8.3 MAF.",
  "retrievedAt": "2025-08-11T20:12:05.222Z"
}
