{
  "title": "CDA sets Oct 20 deadline for brick kilns amid Islamabad smog crackdown",
  "author": null,
  "content": "ISLAMABAD, Oct 13 (APP): The Capital Development Authority (CDA) and the Environmental Protection Agency (EPA) have launched an intensified campaign to combat smog and air pollution in Islamabad, setting strict deadlines for brick kilns and strengthening monitoring of vehicles and industries.\nChairman CDA Muhammad Ali Randhawa while chairing a joint meeting with DG EPA said that all brick kilns in the capital must adopt modern zig-zag technology by 20 October 2025, warning that non-compliant kilns could face legal action, including demolition. The move is part of a broader strategy to reduce pollution from industrial and transport sectors.\nCurrently, five certified laboratories are operational for vehicle carbon emission testing, with additional checkpoints planned across the city. Real-time data from these tests will be shared on a central dashboard. To monitor air quality more effectively, three to four new stations will be added alongside the existing station in sector H-8.\nThe crackdown also targets open-air burning of waste, with violators facing immediate legal action. Dust from construction sites will be controlled through water sprinkling and strict adherence to Environmental Impact Assessment mitigation measures.\nThe joint meeting was attended by Member Engineering, Member Environment, Deputy Commissioner Islamabad, DG Resources, and other senior officials. Randhawa emphasized that coordinated enforcement and adherence to deadlines are critical to ensuring a cleaner and healthier environment for the capital.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-16T23:58:37.674Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-sets-oct-20-deadline-for-brick-kilns-amid-islamabad-smog-crackdown/",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T18:32:00.000Z"
}
