{
  "title": "Rubina Khalid calls for national strategy to combat rising breast cancer cases in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Oct 13 (APP):Chairperson of the Benazir Income Support Programme (BISP), Senator Rubina Khalid has urged for a comprehensive national strategy to tackle the alarming rise of breast cancer among Pakistani women, marking the occasion of World Breast Cancer Awareness Day.\nSenator Khalid highlighted that breast cancer has become the most frequently reported disease affecting women in Pakistan.\n“One in every nine Pakistani women faces the risk of developing breast cancer during her lifetime,” she said, adding that more than 100 women lose their lives every day due to breast cancer complications.\nShe lamented that the loss of precious lives is largely due to the lack of timely diagnosis and awareness.\n“In Pakistan, the disease often appears at a younger age, yet social pressures and unnecessary shame prevent women from seeking medical help,” she noted.\nEmphasizing the psychological toll, Senator Khalid pointed out that the absence of post-surgery psychological support is a major concern for many women. “Awareness alone is not enough; we need effective and practical strategies,” she stressed.\nThe BISP Chairperson called for moving beyond symbolic campaigns to ensure access to quality and affordable treatment across the country.\n“In countries where timely screening is available, recovery rates exceed 90%. If we normalize screening, testing, and treatment, we can achieve similar results,” she said.\nSenator Khalid underscored that breast cancer is not just a medical issue but a national challenge impacting thousands of families.\n“It is time for the government, institutions, and the public to unite on one page in the fight against breast cancer,” she concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:00:11.690Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rubina-khalid-calls-for-national-strategy-to-combat-rising-breast-cancer-cases-in-pakistan/",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T14:03:00.000Z"
}
