{
  "title": "Railways generates Rs 13.547 bln by leasing land",
  "author": null,
  "content": "ISLAMABAD, Oct 13 (APP):Pakistan Railways has generated Rs 13.547 billion in revenue by leasing its valuable commercial and agricultural land over the past five financial years, aiming to transform the department into a profitable entity.\n“The department has been leased out around 14,042 acres of railway land for various purposes through competitive bidding,” an official from the Ministry of Railways told APP.\nThe official said that Pakistan Railways leases its land through open auctions under the Railway Property and Land Rules, 2023, which were approved by the Federal Cabinet.\nHe said the efforts to generate non-fare revenue are being led by the Real Estate Development and Marketing Company (REDAMCO), a subsidiary of the Ministry of Railways.\nTo a question, the official said the department has also decided to accelerate its ongoing anti-encroachment operations against land grabbers nationwide to reclaim railway land from individuals, groups, and even business organizations.\nUnder the directives of Minister for Railways Muhammad Hanif Abbasi, anti-encroachment operations have been launched across the railway network. A joint procedural order was issued to all divisional superintendents for the retrieval of encroached land.\n“These operations are being conducted with the assistance of the Railway Police and the district administrations of the respective provincial governments,” he added.\nIn a recent operation in the Lahore Division, the department successfully conducted a major anti-encroachment drive in the Mehmood Booti area, reclaiming 15 acres of prime land worth Rs 50 billion.\nThe official revealed that the recovered land had been illegally developed into a housing society, which also housed seven factories, seven markets, and two petrol pumps.\n“Pakistan Railway authorities have sealed the housing society, commercial markets, and petrol pumps during the operation,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:00:11.644Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/railways-generates-rs-13-547-bln-by-leasing-land/",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T12:53:00.000Z"
}
