{
  "title": "SC adjourns super tax case hearing until Tuesday",
  "author": null,
  "content": "ISLAMABAD, Oct 13 (APP):The Supreme Court’s constitutional bench on Monday adjourned the hearing of the super tax case until Tuesday. The case was heard by a five-member bench headed by Justice Amin-ud-Din Khan.\nDuring the proceedings, Advocate Farogh Naseem presented arguments on behalf of various companies.\nJustice Jamal Khan Mandokhail observed that the National Finance Commission (NFC) may impose taxes other than sales tax. Justice Muhammad Ali Mazhar remarked that no new tax can be enforced after the closing date. Advocate Farogh Naseem agreed, stating that once the prescribed period lapses, no new tax may be levied.\nJustice Mazhar questioned why the matter had not been clarified to date, adding that the issue keeps surfacing repeatedly without any final interpretation.\nAdvocate Naseem informed the court that the Sindh High Court had earlier struck down a tax enforced from July 1, 2023, ruling instead that a 4 percent rate would apply instead of 10 percent.\nChief of the bench, Justice Amin-ud-Din Khan, remarked that judges often face great pressure. Advocate Farogh Naseem commented that no judge has the right to insult a lawyer, to which Justice Amin-ud-Din agreed, emphasizing that patience and composure must be observed during proceedings. Naseem praised Justices Muhammad Ali Mazhar and Shahid Bilal Hasan for always maintaining patience and dignity during hearings.\nAdvocate Hafiz Ahsan Khokhar also stated that lawyers expect their arguments to be heard with respect and tolerance.\nLater, the constitutional bench adjourned further hearing of the super tax case until Tuesday.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-16T23:59:52.703Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-adjourns-super-tax-case-hearing-until-tuesday/",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T14:38:00.000Z"
}
