{
  "article_id": "2025-02-19_30cab4421e136c8d789841b0f5086479",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-invites-dcp-participants-in-digital-fdi-initiative/",
    "retrieved_at": "2025-08-27T12:54:25.478Z"
  },
  "metadata": {
    "title": "Pakistan invites DCP participants in Digital FDI initiative",
    "author": null,
    "date_published": "2025-02-19T17:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 373,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 19 (APP): Minister of State for Information Technology and Telecommunication, Shaza Fatima Khawaja, on Wednesday invited participants of the Digital Cooperation Organization (DCO) along with other nations to participate in the Digital Foreign Direct Investment (FDI) initiative, scheduled for April 29-30. Addressing the 4th General Assembly of DCO in Jordan, she said, \"I would like to take this opportunity to invite all of you to Pakistan to attend this event. Formal invitations will be shared at a later stage.\" She further urged member states to encourage their private sectors and development partners to participate in this ground-breaking event, which is being jointly organized by the Government of Pakistan, the National Cooperation Organization, and the World Economic Forum. Highlighting Pakistan's commitment to digital transformation, she said, \"The Digital FDI Initiative, jointly championed by Pakistan, the DCO, and the World Economic Forum, will be piloted in Pakistan and is envisioned as an annual event.\" The minister said that the launch of the Digital FDI Initiative would facilitate global projects by helping nations identify and implement policies to attract investment in the digital economy. It aims to foster knowledge sharing on successful digital reforms. \"Today, Pakistan stands at a point where we are proud to say that our tech sector is growing at an annual rate of approximately 27%,\" she added. She also highlighted the recent passage of the National Pakistan Act, which focuses on digitizing the country across three key verticals: economy, governance, and society. The initiative, she said is being led by Prime Minister Shehbaz Sharif, who will chair the National Digital Commission. \"Our vision for Digital Pakistan is to bring social and economic prosperity, as well as citizen empowerment, through digital transformation,\" she added. The minister further outlined the key objectives of the initiative, which included encouraging private sector investments by connecting local players with international investors and development partners. Enhancing human capital by bridging the industry-academia gap through advanced education and internationally accredited training programs. Strengthening Pakistan as a digital investment hub by ensuring a rationalized and stable tax policy, along with investor-friendly regulations. She reiterated Pakistan's commitment to fostering an enabling environment for digital investment and innovation, positioning the country as a leading destination in the global digital economy.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}