{
  "article_id": "2025-02-19_6cc9fbd2b5cf0c5e24d7d0da38c4fbbd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ict-admin-hosts-thrilling-tent-pegging-competition-at-f-9-park-attracts-global-attention/",
    "retrieved_at": "2025-08-27T12:54:18.033Z"
  },
  "metadata": {
    "title": "ICT admin hosts thrilling Tent Pegging competition at F-9 Park, attracts global attention",
    "author": null,
    "date_published": "2025-02-18T19:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 358,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 18 (APP): The district administration of Islamabad on Tuesday organized a thrilling Tent Pegging competition at F-9 Park, in which over 300 teams participated from across the country. The Tent Pegging competition, held in Islamabad's F-9 Park, brought together more than 300 teams from various regions of the country. The event, organized by the district administration, aimed to provide entertainment for the citizens while promoting traditional sports. Participants demonstrated their expertise in handling fast-paced horses, maintaining balance, and focusing on a small target known as the \"killa.\" The riders had to skill-fully dislodge the target using a javelin to earn applause and recognition from the audience. The competition was not just a local affair. Alongside residents of Islamabad, international guests, including a delegation from the World Bank and the Australian High Commissioner with his family, attended the event. They cheered for the participants and appreciated the display of talent and dedication. The presence of such high-profile attendees highlighted the event's significance and its ability to bring people together from diverse backgrounds. On the occasion, Additional Deputy Commissioner Usman Ashraf stated that the primary goal of the event was to offer recreational opportunities for the citizens. He also mentioned that more such events are planned in the coming days to continue providing entertainment and engagement for the public. The successful organization of the Tent Pegging competition has set a positive precedent for future events in the Federal Capital. Participants expressed their gratitude to the district administration for organizing the event, stating that it not only allowed them to showcase their skills but also helped in preserving and promoting traditional sports. The riders, who displayed remarkable performance, were awarded prizes for their efforts. The event's success has sparked interest in similar activities, with many hoping that such initiatives will become a regular feature in Islamabad's cultural and recreational calendar. The Tent Pegging competition not only entertained the audience but also reinforced the importance of traditional sports in modern times. The district administration's efforts in organizing such events are commendable, and the positive response from the public and international guests indicates a bright future for similar initiatives in Islamabad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}