{
  "article_id": "2025-02-19_3fce502206b4612a80ef90467a583334",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-akhuwat-foundation-launch-book-mawakhat-stories-of-resilience-and-rebuilding-after-the-2022-floods/",
    "retrieved_at": "2025-08-27T12:54:44.969Z"
  },
  "metadata": {
    "title": "ISSI, Akhuwat Foundation launch book, âMawakhat: Stories of Resilience and Rebuilding After the 2022 Floodsâ",
    "author": null,
    "date_published": "2025-02-19T15:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 871,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 19 (APP):The Institute of Strategic Studies Islamabad (ISSI) on Wednesday launched aMawakhat: Stories of Resilience and Rebuilding After the 2022 Floods,a a book compiled by Akhuwat Foundation. The book features over a hundred portraits and testimonies of families affected by the 2022 floods, who rebuilt their lives with Akhuwat Foundationas support, said a press release. The launch event included a keynote address by Senator Mushahid Hussain Sayed, Former Minister of Information and Broadcasting, and remarks by Dr Muhammad Amjad Saqib, Founder of Akhuwat. The panel discussion, moderated by Dr. Neelum Nigar, Director, Centre for Strategic Perspectives (CSP), ISSI, featured Dr. Muhammad Khalid Riaz, Chairman, Human Development Foundation; Ambassador Seema Ellahi Baloch, Pakistanas Former Ambassador to Poland; Ms. Kiran Afzal, Senior Private Sector Specialist, World Bank; Mr. Azhar Hamid, Global President of Akhuwat Foundation; and Dr. Abid Suleri, Executive Director, Sustainable Development Policy Institute (SDPI). In his welcome remarks, DG ISSI Ambassador Sohail Mahmood noted key highlights of Dr. Amjad Saqibas professional life and enduring initiatives in poverty alleviation, women empowerment, and education and healthcare. He praised the bookas core concept a Mawakhat, an Islamic principle of solidarity reflecting Ansaras selfless welcoming of Muhajireen. He commended Dr. Saqib for his phenomenal legacy as the founder of Akhuwat Foundation, a vision that embodies Mawakhat. Ambassador Sohail Mahmood noted that the book not only documents acts of resilience but also emphasizes the importance of compassion, inclusivity, and sustainability in humanitarian efforts. It highlights the transformative role of grassroots initiatives in post-calamity rebuilding. He emphasized the need for collaborative efforts across all sectors and informed the audience of ISSIas commitment to facilitating informed decision-making and coordinated responses for future climate-induced crises. Ambassador Sohail Mahmood recommended that Pakistanas humanitarian efforts should align with the UN Sustainable Development Goals (SDGs) to ensure long-term sustainability. Dr. Amjad Saqib shared the story of an encounter 25 years ago with a tearful woman who refused charity, inspiring the Akhuwat vision of empowering with dignity. The core principle of Akhuwat is that the haves should be friends with the haves-not, sharing compassion, and practicing giving. He noted that Akhuwat has supported over six million families, disbursing US$1.5 billion in loans with a 99.9 percent recovery rate, reflecting the honesty of the Pakistani people. Akhuwat employs two strategies: providing small, interest-free loans and offering free higher education. He concluded that Akhuwatas mission revolves around poverty alleviation through interest-free microfinance and envisions developing a society that ensures respect and dignity for each individual. In his keynote address, Senator Mushahid Hussain Sayed praised Dr. Amjad Saqib, recognizing him as a leading role model for Pakistan. The principle of Mawakhat possesses a strong moral and religious dimension crucial to society. He added that Dr. Saqib embodies three unique characteristics: he is a giver who restores hope; he brings out the best in both the haves and have-nots, and he transforms vicious cycles into virtuous ones. His empathy for the dis-advantaged, and commitment to education illuminates the path forward. Referencing on resilience, he noted the Gaza situation and the resilience of Kashmiris, demonstrating reliance among Pakistanis. He expressed desire for Dr. Saqibas recognition with a Nobel Prize. During the panel discussion, Dr. Abid Suleri emphasized Mawakhatas role as support and solidarity that provides hope in times of despair. He affirmed the bookas testament to Mawakhat is directly relating it to sustainable development, inclusivity, social justice, shared prosperity, and collective responsibility as highlighted in the SDGs, with the motto of ano one is left behind.a He emphasized that Pakistan should not suffer the consequences of a climate crisis it did not instigate. He recommended documenting and compiling the impact of initiatives like Akhuwat to build a stronger case for climate financing. Azhar Hamid emphasized his responsibility to build credibility for Akhuwat Foundation, highlighting its adherence to core Islamic principles, and mentioning the positive feedback received from loan recipients. He highlighted the measurable impact of Akhuwat Foundation. He noted that kindness is inherent in humanity and that Akhuwat has expanded its initiatives to Africa, sharing its best practices, and emphasized that honesty and charity form the foundation for organizations like Akhuwat. Ambassador Seema Ellahi Baloch shared how Akhuwat empowers its beneficiaries with compassion, highlighting the foundationas womenas empowerment initiatives. Drawing from stories in the book, she stressed the immeasurable psychological trauma experienced by vulnerable communities. She recommended collaboration, future research, consultation with affected communities on disaster preparedness and mitigation, and the implementation of gender-sensitive measures. Dr. Muhammad Khalid Riaz emphasized that the international community has adopted the concept of Mawakhat through North-South partnerships. He recommended acknowledgment for leaders in poverty eradication and alleviation and developing a consultative platform to address social issues ensuring education for every child and eliminating hunger. Ms. Kiran Afzal highlighted the deficiency in spatial planning concerning natural disasters and recommended proactive and rational spatial planning, seeking tech-based innovative solutions, regenerative communities for long-term outcomes, and finding local solutions. Earlier, Dr. Talat Shabbir, Director, China Pakistan Study Centre, ISSI, provided context for the event and highlighted the significant correlation between solidarity and the resilience of those affected by the floods. Dr. Neelum Nigar stated that the book provides valuable guidelines for policymakers on how grassroots-level and community initiatives can play a transformative role.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}