{
  "title": "Enhanced Games destined to fail, says sprint great Carl Lewis - Sport - DAWN.COM",
  "author": null,
  "content": "Sprint great Carl Lewis says he does not think the controversial Enhanced Games will be successful and the American is not keen to lend it any oxygen either.\n\nThe Enhanced Games, which allows athletes to use performance-enhancing drugs to elicit ‘superhuman’ performances, has stirred the still water of traditional sports and attracted Olympic medallists such as American sprinter Fred Kerley and British swimmer Ben Proud.\n\n“I don’t think it’s going to be successful,” nine-times Olympic gold medallist Lewis, who was in India as brand ambassador of last Sunday’s Vedanta Delhi Half Marathon, told Reuters.\n\n“I just don’t think people want to abandon faith in things that are right just for the sake of performance.\n\n“It’s not just about competing. Sports is about doing the right thing.”\n\nSix-times world champion swimmer Kyle Chalmers turned down a “life-changing” sum of money to join the Enhanced Games, the Australian swimmer revealed last month.\n\nThe World Anti-Doping Agency has slammed the event as “dangerous and irresponsible”, while athletes who joined it have faced backlash from fans and administrators.\n\nEnhanced Games has sued World Aquatics, USA Swimming and WADA alleging an illegal campaign to “crush” the event.\n\nLewis said it lacked “purpose and honour” and did not see it as a threat to the image or integrity of Olympic sports.\n\n“I think we’re giving it more legs than it deserves,” he said.\n\nLewis felt athletics at the top level was financially attractive and its leading athletes were less likely to fall to the lure of the Enhanced Games.\n\n“There will always be people who’d like to do their own thing their own way and have their own motivation. Some people will be in enhanced sports not because of sports but because they think they can make money,” he added.\n\n“The less oxygen we give to that subject and get that event, I think the more challenging it would be for them.”\n\nThe Enhanced Games have set their inaugural competition for May 2026 in Las Vegas, with athletics, swimming and weightlifting on the agenda.\n\nLewis’ collection of Olympic gold medals includes one stripped from drug cheat Ben Johnson at the 1988 Seoul Games.\n\nThe American was unsurprisingly pithy about why he thinks the Enhanced Games is a non-starter.\n\n“I don’t think many athletes will compete,” he said.\n\n“I don’t think any records will be broken because I don’t think the event is going to happen because I don’t think the money will be there because I don’t think people would support it.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:19:10.089Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949554/enhanced-games-destined-to-fail-says-sprint-great-carl-lewis",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T13:42:56.000Z"
}
