{
  "title": "PHC directs KP Governor Kundi to administer oath to CM-elect Sohail Afridi by 4pm tomorrow - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Peshawar High Court (PHC) directed Khyber Pakhtunkhwa Governor Faisal Karim Kundi on Tuesday to administer the oath to Chief Minister-elect Sohail Afridi by 4pm tomorrow.\n\nPHC Chief Justice (CJ) S.M. Attique Shah issued the directive, further instructing that KP Assembly Speaker Babar Saleem Swati should administer the oath if the governor did not.\n\nThe court’s decision, which was reserved earlier today, came on a PTI application seeking the nomination of the assembly speaker or any other person “considered appropriate” in place of the governor to administer the oath to Afridi.\n\nAfridi’s election on Monday was held amid uncertainty about the status of Ali Amin Gandapur’s resignation from the provincial chief executive’s position. The two resignations submitted to KP Governor Kundi by Gandapur — who is also from the PTI and stepped down on party founder Imran Khan’s directive — have been returned over “disparate signatures”.\n\nBut, the PTI maintains that a chief minister’s resignation does not require the governor’s approval under the Constitution. With this contention, the party elected Afridi in a session boycotted by the opposition.\n\nThe same day, in a pre-emptive move, it approached the PHC with the request pertaining to Afridi’s oath-taking.\n\nIn its written order on the application released today, the court noted that Gandapur had “unequivocally affirmed” on the floor of the provincial assembly that he had tendered his resignation on Oct 8. “In light of the certified copy of the transcript of the speech, […] it is manifest that the office of the chief minister stood vacated with effect from” Oct 8, the order stated.\n\nIt further said that consequently, a new chief minister was elected in accordance with the procedure laid down in the Constitution.\n\nCiting Article 130(5) of the Constitution, the court observed that it required a newly elected CM to be sworn in by the governor before assuming office.\n\n“Correspondingly, it is the constitutional obligation of the worthy governor to administer the oath of office to the newly elected chief minister without delay or obstruction.\n\n“Certainly, upon his failure to administer oath to the newly elected chief minister within a reasonable time, it would be construed that such circumstances have arisen rendering the administering of oath to the newly [elected] chief minister impracticable in terms of Article 255 of the Constitution,” the order read.\n\nIt further stated that keeping in view the assurance given by Additional Attorney General (AAG) Sanaullah, who was representing the governor, the court expected that Kundi “shall fulfil his constitutional obligations” and administer the oath to Afridi in accordance with the Constitution without further delay.\n\n“This forum further trusts that no impediment shall be caused in the administration of oath, and that the process will be completed without any further delay.”\n\nIt added that if the governor failed to administer the oath to the CM-elect by 4pm tomorrow, in terms of the authority conferred under Article 255(2) of the Constitution, the PHC chief justice was nominating the KP Assembly speaker to administer the oath to Afridi tomorrow.\n\n“This direction is issued to uphold the sanctity of the Constitution, to ensure continuity in governance, and to prevent the constitutional vaccuum in the Province of Khyber Pakhtunkhwa,” the order said.\n\nThe court had directed AAG Sanaullah yesterday to confirm whether the KP governor had received the summary related to Afridi’s oath-taking from the assembly secretariat and submit a reply today.\n\nThe AAG informed the court today that the governor was out of city. He said the governor had told him that his flight to Peshawar was scheduled for tomorrow. “He said he does not have a private plane […] and the provincial government could send him helicopter to arrive in the city today.”\n\nMoreover, the advocate general requested the court to nominate a person to swear Afridi in and ensure that the oath-taking took place today.\n\nCounsel for the PTI Salman Akram Raja and the KP governor’s lawyer, Amir Javed, also presented their arguments.\n\nRaja contended that why did the governor want to verify Gandapur’s signatures. Accusing the opposition of intending to “create difficulties”, he argued that after a CM’s election, matters could not be delayed any further.\n\nCJ Shah, who was presiding over the proceedings, observed that Article 255 of the Constitution, which deals with the subject of oath of office, had been amended to address issues as the one presently under consideration.\n\nFor his part, Kundi’s counsel Javed informed the court that he spoke to his client multiple times over the phone yesterday. The lawyer told the court that the governor stated that he would decide on Gandapur’s resignation if legal conditionalities were met.\n\nThe chief justice then enquired whether the opposition parties had not participated in the election. He observed that the opposition had boycotted the election at the last minute.\n\nJaved requested the court to wait until 3pm tomorrow on the matter.\n\nAt that, the PHC CJ observed that under Article 255, a chief minister’s resignation did not require any approval.\n\nThen, addressing Javed, he asked: “Can you guarantee that the governor will be present tomorrow and administer the oath?”\n\nHe went on to observe that the governor had raised objections over Gandapur’s signatures on his two resignation letters. “[Even though], Ali Amin Gandapur confirmed on the assembly floor that he had resigned.”\n\nArguing further on this, Javed cited multiple provisions from the Constitution.\n\nHe said “everything is clear” in Article 130(7), which states: “The chief minister shall hold office during the pleasure of the governor, but the governor shall not exercise his powers under this clause unless he is satisfied that the chief minister does not command the confidence of the majority of the members of the provincial assembly, in which case he shall summon the provincial assembly and require the chief minister to obtain a vote of confidence from the assembly.”\n\nMoreover, he said the governor’s powers were also made clear in Article 48 (president to act on advice, etc.).\n\nHe assured the court that the governor would make a decision tomorrow in accordance with the Constitution.\n\nAt that, the CJ asked, “Who is running the province at the moment?”\n\nHe also enquired whether the election schedule for the CM’s post had been challenged.\n\nSaturday and Sunday were off days for the court, which was why the schedule wasn’t challenged, Javed replied.\n\nEventually, the court reserved its decision on the matter and later ruled that the KP governor should administer the oath to Afridi by 4pm tomorrow.\n\nFollowing the court’s decision, Kundi said while speaking to the media in Karachi that he had been saying he would abide by the Constitution. “I never said that I would not administer the oath,” he added.\n\nKundi said he was in Karachi on an official engagement, and “as governors don’t have special planes, I have requested the [Sindh] chief minister for one.”\n\nAsked whether he would reach Peshawar tonight, he replied: “God willing, I will reach any time tonight.”\n\nMeanwhile, PTI leaders hailed the court decision, with party Chairperson Barrister Gohar Ali terming it “great news from [the] judiciary”.\n\nIn a post on X, he expressed the hope that the transition would be completed tomorrow and the new KP government would “stay focused on public issues”.\n\nSpeaking to the media outside Adiala Jail, he said the chief minister’s election was a democratic process and the PTI’s mandate in KP should be respected with the process completed smoothly.\n\nHe said the PTI delegation met Imran for the first time since the transition in KP, adding that the PTI founder appreciated the fact that everyone showed unity throughout the process.\n\nPTI MNA Asad Qaiser said every child in the province knew the chief minister’s election was in accordance with the law and the Constitution.\n\n“In the current situation, we want everyone to move forward together, but if someone thinks that they will snatch our mandate from us, it would be their wishful thinking,” he said on X. “No matter how much they try, they cannot break a single worker of Imran Khan.”\n\nSpeaking to the media outside the PHC, he said democracy and the law had won today.\n\nHe thanked the PHC chief justice for serving “justice”, saying that if the courts would issue rulings with such “courage”, the entire nation would stand with them.\n\nEarlier today, JUI-F leader Maulana Lutfur Rehman also filed a petition in the PHC, requesting that the election of Afridi as the KP chief minister be “set aside” and declared null and void.\n\nRehman was one of the four people in the race for the KP CM office, along with Sardar Shah Jehan Yousaf of the PML-N, and Arbab Zarak Khan of the PPP and PTI’s Afridi.\n\nIn a petition filed today, a copy of which is available with Dawn.com, Rehman named six respondents, including the KP government, Governor Kundi, the KP Assembly through Speaker Swati, the secretary of the provincial assembly, Gandapur and Afridi.\n\nIn his petition, he requested the court to set aside the election and declare it “ab initio void” as the it was “wholly unlawful, arbitrary, capricious, mala fide, without jurisdiction, coram non judice.”\n\nRehman questioned how an election could be held if Gandapur’s resignation had not yet been accepted. Citing Article 130(8) of the Constitution, he stressed that elections for the post can not be held unless it was vacant.\n\nArticle 130(8) states that “the Chief Minister may, by writing under his hand addressed to the governor, resign his office”, and is the same clause that the PTI has been citing to contend that the CM’s resignation does not require the governor’s acceptance or approval.\n\nRehman’s petition further asked the court to declare decisions taken by the assembly and the speaker with regard to the chief minister appointment as “without lawful authority, void, and of no legal effect.”\n\nThe petition further urged the court to “declare all consequential notifications and actions, including the impugned notification, as illegal, arbitrary, capricious, without jurisdiction and having no legal effect.”\n\nRehman requested the court to halt any further proceedings in the matter until the governor had “lawfully received and verified” the resignation of Gandapur.\n\nThe petition called for a fresh election “in accordance with the Constitution and the assembly rules, after lawful confirmation of vacancy.”\n\nIt concluded by requesting the PHC to suspend the election result in order to “prevent chaos and ensure preservation of the rule of law.”\n\nSpeaking to the media outside the court, Rehman reiterated the opposition’s stance over the validity of the elections.\n\n“We said this yesterday as well that the former chief minister’s resignation has not been accepted yet, and the governor has summoned him on Oct 15.\n\n“Until the seat becomes vacant, the election can not be held,” he said.\n\nResponding to a question that why the opposition chose to field candidates for the CM election if it believed the election was not in line with the law, he said, “At first, we were under the impression that the resignation had been finalised, but then the governor’s letter came to light, detailing that the resignation had not yet been finalised.”\n\nPrior to the PHC’s decision today, the barely two-year-old KP Assembly seemed to be facing a constitutional crisis, which originated from events following Imran’s decision on October 8 to change the command at the helm in the province.\n\nIn line with his directive, Gandapur resigned from his role on Oct 8 while the party’s general secretary confirmed that the party had picked Afridi as his potential replacement.\n\nThe resignation letter, shared by Gandapur on X, was typed on his official letterhead and signed at the bottom. However, this initial resignation letter had apparently gotten lost in red tape, with the Governor’s House initially denying ever receiving it.\n\nBut, a copy of the letter seen by Dawn showed that it was received by the governor’s staff.\n\nSubsequently, Gandapur sent another handwritten resignation to the governor, which was acknowledged by Kundi on Oct 11. He said in a post on X that the Governor House had received a handwritten resignation letter from Gandapur. “After thorough scrutiny and legal formalities as per the constitution [and] relevant laws, subject resignation will be processed in due course of time,” he added.\n\nLate at night the next day, Governor Kundi returned the two letters submitted by Gandapur over “disparate signatures” and summoned him on October 15 (tomorrow) to settle the matter.\n\nFor his part, Gandapur responded to Kundi’s post on X, stating: “Finally, the resignation submitted on October 8, previously denied by the Governor Office, also acknowledged.”\n\nHe further said that both resignations submitted by him bore his “authentic signatures”.\n\nBy that time, Swati had already convened an assembly session to elect a new leader of the house. And the PTI maintained that under Article 130(8) of the Constitution, a chief minister’s resignation did not require the governor’s acceptance or approval.\n\nThe opposition, however, disagreed and walked out of the session held for the CM election yesterday. Following its boycott, candidates fielded by the JUI-F, the PPP and the PML-N recieved zero votes while Afridi won the race with 90.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/141400001db81ee.webp",
  "retrievedAt": "2025-10-16T23:40:16.706Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948846/phc-directs-kp-governor-kundi-to-administer-oath-to-cm-elect-sohail-afridi-by-4pm-tomorrow",
  "dateList": "2025-10-17",
  "date_published": "2025-10-14T06:47:21.000Z"
}
