{
  "title": "From friends to foes: Pakistan must rethink its approach to the Taliban. But what does that look like? - Pakistan - DAWN.COM",
  "author": null,
  "content": "On the night of October 9, explosions erupted in Kabul, as well as other parts of eastern Afghanistan. Soon after, social media was abuzz with speculations that Pakistan had struck the leadership of the Tehreek-i-Taliban Pakistan (TTP) in the wake of a string of bloody attacks on this side of the border by the terror outfit.\n\nThe Pakistani military, at a press conference the next day, neither accepted nor denied the rumours. “Afghanistan is a neighbourly, Islamic country. We have historical connections, cultural connections. Pakistan has hosted Afghan refugees for four decades. We only say one thing to the Afghan government: do not allow your soil to be used for terrorism against Pakistan,” said Inter-Services Public Relations Director General Lt Gen Ahmed Sharif Chaudhry.\n\nTwo nights later, the Afghan Taliban attacked Pakistan’s border posts. Islamabad was quick to retaliate, forcing the Taliban fighters to retreat. By morning, dozens were dead on both sides of the Durand Line.\n\nFour years ago in August 2021, when the Taliban seized Kabul, few could have imagined what is unfolding today: a full-blown conflict between the Afghan Taliban and Pakistan — once friends, now foes. In the years since, deteriorating ties between the neighbours have come to the fore, with crossfire at the border, exchange of scathing rebukes, and stern warnings.\n\nBut the latest clash, so far the deadliest confrontation, has brought the two countries close to war. In the early hours of Oct 15, the Pakistani military said it again repulsed an attack by the Afghan Taliban in the Spin Boldak area, killing about 15-20 fighters. On the other hand, Afghan Taliban spokesperson Zabiullah Mujahid claimed that his forces were “forced to retaliate” after cross-border attacks by Pakistan.\n\nLater the same day, both countries agreed upon a ceasefire for the next 48 hours after Pakistan said it conducted “precision strikes” in Kabul and Kandahar.\n\nEven though the fighting has stopped for now, the situation remains extremely volatile, and hence, questions arise: what triggered this situation, and where do we go from here?\n\nIt is no secret that the Afghan Taliban, since the group’s emergence in the 1990s, have remained a close ally of Islamabad, especially after Pakistan extended a swift recognition to the Taliban regime in 1996. That strategy, of having a malleable government in Kabul that won’t act against Islamabad, has now backfired, with the group’s strident refusal to recognise the Durand Line and its provision of sanctuary for militants such as the TTP.\n\nAt the same time, Islamabad’s erstwhile ‘friend’ has batted aside accusations of support for militancy, alternating between vehement denials of Afghan soil being used to launch attacks across the border, assurances that have failed to materialise, and simply telling the Pakistani state to negotiate with the TTP. But it is not just Pakistan that believes the Taliban is actively providing support for the TTP.\n\nA 2024 UN report found that “the Taliban do not conceive of TTP as a terrorist group: the bonds are close and debt owed to TTP significant”, referring to the outlawed group’s assistance in the former’s 20-year insurgency campaign. Noting that the “TTP continues to operate at significant scale in Afghanistan and to conduct terrorist operations in Pakistan”, the report highlights the Taliban’s support — in the form of funding, provision of weapons left behind by Nato forces, and safe haven — for the group.\n\nThe TTP, too, considers itself to be closely linked to the Taliban, with its emir Mufti Noor Wali Mehsud renewing his oath of allegiance to the Islamic Emirate of Afghanistan two days after the Taliban recaptured Kabul in 2021. Not coincidentally, the TTP’s violence in Pakistan has since only continued to soar. The current year is on track to be the deadliest so far, with the first three quarters of 2025 witnessing nearly as much militant violence as all of 2024.\n\nIn response to the TTP’s activities, Pakistan has tried to exert pressure on the Taliban regime by restricting trade, expelling thousands of Afghan refugees over the past two years, and carrying out sporadic airstrikes against alleged TTP strongholds in eastern Afghanistan.\n\nStrikes in the Afghan capital, though, are an unprecedented escalation — one that would be a sore humiliation for any country but more so for one that lacks any real air defence.\n\nThe discussions on social media following the Oct 9 strike on Kabul claimed that Pakistan had targeted a TTP convoy carrying the organisation’s chief, Noor Wali Mehsud. While Islamabad neither confirmed nor denied the strikes, claims later emerged that Mehsud had survived, with Taliban spokesperson Zabihullah Mujahid insisting that the TTP emir was neither in Kabul nor Afghanistan.\n\nIf Mehsud indeed was the target, his death would have been a substantial triumph for Pakistan — in the TTP’s war against the state, he is a man who makes a difference.\n\nAscending the TTP’s ranks, Mehsud combined the unlikely roles of jurist, scholar and commander. A veteran from the Afghan Taliban’s early years, he served at various points as a deputy for TTP leaders previously in power, a qazi in the group’s sharia courts, and its Karachi chief. Thus, when the then-TTP emir, Mullah Fazlullah, was killed in an American drone strike in 2018, Mehsud was anointed his successor.\n\nFazlullah — the only non-Mehsud TTP chief to date — had been a controversial choice, which led to infighting and defections that weakened the organisation during his reign. The public and military backlash after the 2014 Army Public School massacre, too, had forced the group on the back foot.\n\nBut Mehsud pulled the TTP back together, smoothing over ruffled feathers and brokering agreements. He brought allies to the table, pushed offshoots back under the umbrella, and shifted the organisation’s focus from civilian to military targets — likely to avoid further alienation of the population and to stand apart from the Islamic State’s brutality. With his leadership and the sanctuary given by the post-2021 Afghan government, the group reorganised and escalated its cross-border assaults.\n\nUnder Mehsud, the TTP may be the most serious threat Pakistan faces within its borders, yet again. The past few years have seen the group inflict heavy casualties on security forces. And so, it is no surprise that the state would jump at a chance to eliminate him.\n\nSuch decapitation strategies aim to cut off terrorist organisations at the head, disrupting operations, denting morale and sowing discord within the ranks. After all, it makes intuitive sense that eliminating leaders will only weaken a group. The TTP has, however, survived over the years despite three of its previous chiefs being killed.\n\nResearch has found that decapitation may work against young, small groups, but not for older and bureaucratised groups with popular support. Groups with networked structures divided into semi-autonomous cells, transnational sanctuaries, and steady financing tend to be more resilient.\n\nAnd the TTP fits the bill.\n\nFor the group, it is Noor Wali Mehsud who makes a difference. Killing him would certainly be a substantial blow for the TTP. But would it stop their war against the state or leave them wounded beyond repair? Unlikely. From the TTP’s perspective, the recent strikes in Kabul would serve as a warning, pushing the group to deepen its security, send its leadership into hiding, and potentially escalate its attacks across the border.\n\nOver the past four years, Pakistan has made several overtures — through religious and tribal to official diplomatic channels — to urge the Afghan Taliban authorities to rein in the TTP.\n\nDelegations of ulema, tribal elders, federal ministers and top-level officials have visited Kabul to no avail. Meanwhile, assurances by the de facto Afghan government and increasingly tough warnings by the Pakistani state made little difference as the TTP continued to ramp up its violence across the border.\n\nIncreasingly desperate, Pakistan has in the last two years resorted to kinetic strikes targeting TTP strongholds in eastern Afghanistan. At the same time, Islamabad also imposed trade restrictions on its neighbour and began deporting over a million Afghan refugees residing in the country, hoping to coerce the Taliban into complying with its demands. But this too made little difference.\n\nEarlier this year, as highlighted by former ambassador Maleeha Lodhi, Pakistan shifted from its coercive strategy to a carrot-and-stick approach with the resumption of diplomatic visits and confidence-building measures. Yet, Islamabad remained unsuccessful in shifting the course of the Taliban regime.\n\nSo where does the problem lie?\n\nIt is rooted in the fact that the Taliban have a long-held principle: it won’t give up its militant allies. The group didn’t give up Al Qaeda and Osama bin Laden to the US, even when the cost was engaging in a two-decade war with the West. And, now that it no longer needs Pakistan’s help to survive, it has no reason to give up the TTP either. Rather, keeping the TTP close can be more useful to it, giving it leverage over a potential proxy.\n\nBy now, Pakistan’s patience appears to have run out, especially after Afghan Foreign Minister Amir Khan Muttaqi’s recent visit to New Delhi, just months after the India-Pakistan standoff in May, signalling a rapprochement between the two countries. For Islamabad, this budding friendship portends a hostile agenda from both its eastern and western borders — a position untenable for Pakistan.\n\nAmid these developments, one wonders: what is the strategy now?\n\nThe state will, as Pakistani officials imply, continue to respond offensively against Afghanistan in retaliation for terror attacks. This, perhaps, is the new normal — albeit a dangerous one, in the region — with India setting the precedent in its strikes on ‘militant bases’ in Pakistan just a few months back.\n\nThis has amplified concerns about deepening mistrust, complicating security dialogues, and, potentially, leading to war.\n\nIn the past few months, Pakistan has shown that it can handle itself on the battlefield, and it certainly has the military and technological superiority for it. It has an operational edge too, being no stranger to Afghan conflicts — it knows the language, the geography, the politics of the land, and has strong intelligence capabilities in Afghanistan, especially when it comes to human intelligence.\n\nThe problem, though, is that the Taliban don’t fight on the battlefield — a lesson the US learned over the 20-year war. Their fighters and allies are battle-hardened insurgents who would likely find renewed purpose and unity in a conflict against Pakistan, a conflict that would not be fought conventionally.\n\nInstead, it is more likely that the Taliban would retaliate with its own proxies, including the TTP, for stealthier attacks and waves of suicide bombings across the border. The Pakistani state could ramp up security, of course, but there is only so much it can secure. And the logic of substitution in terrorism means that attacks would only shift from hardened targets to softer, likely civilian, ones. This is something Pakistan cannot afford, not after years of devastation at the hands of the TTP.\n\nIn fact, neither country would want a full-blown war to add to their struggles. The Taliban regime has an economic crisis on its hands and few international allies. Pakistan, too, has its own financial and political instabilities to deal with, as well as the looming threat of a fresh conflict with India.\n\nThere are other considerations as well. War with Afghanistan could push the Taliban regime even closer to New Delhi, which had been a close ally of the former US-backed government in Kabul. Pakistan’s own alleged support for the Taliban had been a way for it to hedge bets against the Indian threat. Then again, much of the Afghan population already harbours resentment against Islamabad for its past interference and current refugee expulsion policies. Continued conflict is likely to deepen this hostility and create sympathy for the Taliban and, maybe, even the TTP.\n\nFor its part, the Taliban regime would be right to exercise caution. Pakistan’s extensive intelligence networks and on-ground links in Afghanistan will allow it to gather information on prominent figures and vulnerabilities within the setup, and it is no hard task for it to enter Afghan airspace as it pleases.\n\nIt may look like we’re edging closer to war with recurring clashes and political chest-thumping on both sides. However, these statements were primarily aimed at the people of each country — after all, neither government wants to appear to be backing off in the face of a major threat.\n\nFor the Taliban, if it wants to curry favour with a population that already holds it in dislike, denouncing a neighbour that is similarly loathed is just good PR. And the push at the border is the bare minimum; it needs to show its resolve and at least try to establish some level of deterrence, even if it is a small match for Pakistan’s military might in a head-on battle.\n\nFor Pakistan, Kabul’s latest overtures to New Delhi place the Taliban alongside not just the TTP, but an enemy that has repeatedly threatened Pakistan’s very existence. Between the TTP’s lethal attacks, Muttaqi’s trip to India and now the Taliban’s attacks at the border, there is no way that it can hold back from taking action. For now, though, it seems that action is still restrained, even as government officials take pains to emphasise the fragility of the current ceasefire.\n\nIn an all-out war, Pakistan could inflict significant damage on the Taliban — though victory may come at a steep cost. Thus, restraint may still be needed.\n\nOver the weekend, the Pakistani Ministry of Foreign Affairs released a statement, hinting at a shift in the country’s stance on how it sees the de facto Afghan government’s legitimacy.\n\nUrging the Taliban to “act responsibly, honour its commitments, and play a constructive role in achieving the shared objective of rooting out terrorism from its soil”, the ministry voiced its hope that “one day, the Afghan people would be emancipated and they would be governed by a true representative government”.\n\nThe implication, of course, is that Pakistan is retreating from its view of the Taliban regime as a legitimate government. The statement also has a whiff of threat, the threat of regime change, obliquely paving the way for engagement with the opposition in Afghanistan.\n\nAt the same time, media outlets in Pakistan have started referring to the government in Kabul as the ‘qabiz [occupying] Afghan Taliban’, reinforcing the rapidly changing perceptions.\n\nThe thought is tempting: a friendly government in Kabul has, after all, long been the establishment’s desire. Realistically, though, overthrowing the Taliban would bring chaos to Afghanistan once again, which has never boded well for Pakistan, with each episode of instability pushing another surge of violence and refugees next door.\n\nMoreover, Pakistan has long kept its Afghanistan eggs in the Taliban basket. Will it actually be able to find any potential allies among the opposition? Perhaps, but with its longstanding unpopularity across the border, it seems unlikely that any significant opposing forces will want to throw in their lot with the state.\n\nWhat’s more, the TTP would still not be put down; rather, the inevitable weakness of a new Kabul government and anger at such regime change efforts may well combine to give them both the space and added motivation to continue their charge against the Pakistani state.\n\nSimply put, Islamabad needs to rethink its approach to the Taliban. And voices calling for the same have already emerged, case in point: Mushahid Hussain.\n\n“Unfortunate eruption of hostilities due to Kabul regime’s failure to control terror proxies is also a moment of introspection for Pakistan, given flawed and failed Afghan policy that’s now in tatters, with faulty assumptions and an ambitious overreach that failed to take cognisance of Afghanistan’s ground realities and regional geopolitics.\n\n“Our policymakers now need to calmly and coolly review past mistakes & take effective remedial measures to tackle [the] consequences of a potentially lethal emerging Indo-Afghan Axis,” the former senator said in a post on X.\n\nThe question, however, remains: how to get them to reconsider their support for the TTP?\n\nThe goal is to raise the cost for Kabul, whether direct or opportunity costs. In the past, we have tried carrots and we have tried sticks — the sticks that may still lead to dangerous outcomes.\n\nFor now, Pakistan has signalled its willingness to talk, with Prime Minister Shehbaz Sharif explaining to the federal cabinet on Thursday that the “ball is in their [Afghanistan’] court”.\n\n“Yesterday we decided the temporary 48-hour ceasefire [and] the message has been sent that if they want to fulfil our justified conditions through talks, then we are ready,” he added.\n\nPerhaps this is where international partners who have stakes in the Afghan-Pakistan region can come in, both to pile on the diplomatic pressure and to entice Kabul to shift its course, with carrots such as bilateral engagement, trade agreements and development projects that are conditional on reining in the militancy. Beijing has already offered to play a constructive role in establishing peace. There are also rumours of a diplomatic effort afoot in Qatar, but the details remain scant.\n\nMeanwhile, US President Donald Trump has also hinted at getting involved in the conflict, gloating: “I’m good at making peace.” While his statement is easy to dismiss, Trump has repeatedly expressed his desire to retake the Bagram airbase in Afghanistan. His involvement, if it happens, could change the situation drastically.\n\nAt the same time, adopting the carrot approach doesn’t mean giving up on the stick altogether. Strikes on high-value TTP targets would continue to impose consistent pressure on both the Taliban and the TTP, but such action must try to avoid the loss of civilian lives, which has previously been reported, and it must be backed by the proof of sponsorship that the Pakistani security establishment claims to have.\n\nThat proof is important. With the War on Terror came the concept of contingent sovereignty — the idea that sovereignty is not absolute, but rather depends on a state meeting its fundamental obligations both to its own people and to the international community. Sovereignty, in this understanding, demands responsibility over your own territory.\n\nWhile contingent sovereignty is normally associated with the responsibility to protect, since the 9/11 attacks, it has also been used to justify interventions against active threats within other states. And so, Pakistan must be able to justify any kinetic strikes within Afghanistan with concrete evidence of terrorist activity emanating from the neighbouring territory.\n\nAnother reason why this is important is that a substantial portion of the country’s own population sympathises with the Taliban. In their eyes, these are holy warriors fighting the enemies of Islam — a view that the Pakistani state is responsible for encouraging during the Afghan jihad against the Soviets. This view extends somewhat to the TTP as well, which saw little animosity from the public even during its peak.\n\nNot until the APS massacre did people and even mainstream politicians turn against the group. And their current strategy of focusing on security targets has succeeded in subduing that anger, too.\n\nPakistan cannot win against the Taliban or the TTP until it deals with the public sympathy for these organisations. At the end of the day, it must change the narrative, or any action against the Taliban, whether kinetic or otherwise, risks a backlash from its own people.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/170114450edbed2.webp",
  "retrievedAt": "2025-10-20T18:19:24.455Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948883/from-friends-to-foes-pakistan-must-rethink-its-approach-to-the-taliban-but-what-does-that-look-like",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T05:51:18.000Z"
}
