{
  "title": "Ex Trump adviser Bolton surrenders following charges of mishandling classified information - World - DAWN.COM",
  "author": null,
  "content": "John Bolton, the national security hawk and former adviser to Donald Trump who has become one of the US president’s biggest critics, surrendered on Friday morning on charges of mishandling classified information.\n\nBolton, who was indicted on Thursday, is the third of Trump’s prominent critics to face prosecution in recent weeks, as the US president dispenses with decades-long norms designed to insulate federal law enforcement from political pressures.\n\nBolton did not speak with reporters as he arrived at the courthouse in Greenbelt, Maryland, to surrender. He is expected to appear in court later in the day.\n\nBolton and his team were seen entering the US Marshals Service office to surrender.\n\nThe indictment alleges that Bolton shared sensitive information with two of his relatives for possible use in a book he was writing, including notes on intelligence briefings and meetings with senior government officials and foreign leaders.\n\n“I look forward to the fight to defend my lawful conduct and to expose (Trump’s) abuse of power,” Bolton said in a statement on Thursday.\n\nBolton’s lawyer, Abbe Lowell, said Bolton did not unlawfully share or store any information.\n\nTrump, a Republican who campaigned for the presidency on a vow of retribution after facing a slew of legal woes once his first term in the White House ended in 2021, has actively pursued his attorney general, Pam Bondi, to bring charges against his perceived adversaries.\n\nThat included pushing Bondi’s Justice Department to bring charges against former FBI Director James Comey and New York Attorney General Letitia James, even driving out a prosecutor he deemed to be moving too slowly in doing so.\n\nBolton served as White House national security adviser during Trump’s first term, before emerging as one of the president’s most vocal critics. Bolton, also a former US ambassador to the United Nations, described Trump as unfit to be president in a memoir he released last year.\n\nThe investigation of Bolton was opened in 2022, predating the Trump administration. Inside the Justice Department, the case is viewed as stronger than the prosecutions of Comey and James, according to a person familiar with the matter.\n\nThe indictment of Bolton, filed in federal court in Maryland, charges him with eight counts of transmission of national defense information and 10 counts of retention of national defense information, all in violation of the Espionage Act.\n\nEach count is punishable by up to 10 years in prison, but any sentence would be determined by a judge based on a range of factors.\n\nIn some of the chats described in the indictment, Bolton and his relatives — who are not identified — discussed using some of the material for a book.\n\nBolton referred to the two people with whom he shared his daily notes as his “editors,” the indictment said.\n\n“Talking with (book publisher) because they have a right of first refusal!” Bolton wrote in one message, according to the indictment.\n\nThe two relatives referred to in the indictment are Bolton’s wife and daughter, two people familiar with the matter said.\n\nAsked by reporters at the White House about the Bolton indictment on Thursday, Trump said: “He’s a bad guy.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/17193452d8cb1e3.webp",
  "retrievedAt": "2025-10-20T18:19:12.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949559/ex-trump-adviser-bolton-surrenders-following-charges-of-mishandling-classified-information",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T15:30:50.000Z"
}
