{
  "title": "Liverpool seek mojo against Man Utd, Postecoglou hunts first win - Sport - DAWN.COM",
  "author": null,
  "content": "Liverpool will be desperate to recapture their spark against bitter rivals Manchester United this weekend but Ruben Amorim’s men will harbour hopes of pinching a rare win at Anfield.\n\nThe champions have lost just one of their past 14 Premier League meetings against United but have suffered three straight defeats in all competitions, with Arsenal now top of the pile.\n\nNottingham Forest boss Ange Postecoglou survived the international break but remains under intense pressure after failing to record a win in his first seven matches.\n\nLiverpool bank on Anfield factor against Man Utd When Liverpool started this season with five straight Premier League wins, it appeared they were on track for a record 21st English top-flight title — which would take them one clear of United.\n\nBut problems they had papered over with a flurry of late goals finally caught up with them in defeats to Crystal Palace and Chelsea, either side of a Champions League loss at Galatasary.\n\nLiverpool, one point behind leaders Arsenal, trolled United on social media this week, reminding them of the 7-0 drubbing they dished out in March 2023.\n\nMohamed Salah scored twice that day and has an eye-catching record against United, netting in 10 of the past 11 matches between the clubs in all competitions.\n\nBut the Egypt forward will go into the fixture searching for form while new signings Florian Wirtz and Alexander Isak are struggling to make an impact. Arne Slot’s men are also shaky at the back.\n\nUnited, without a win at Anfield since 2016, have come away with creditable draws from their past two visits.\n\nRuben Amorim’s men, wallowing in mid-table, will not scare Liverpool but they will likely have chances to exploit chinks in the home side’s armour.\n\nPostecoglou still winless Ange Postecoglou does not appear to be over-concerned about his position at Nottingham Forest despite a winless start to his reign at the City Ground.\n\nThe club, just one place above the relegation zone, host Chelsea in the early kick-off on Saturday.\n\nIt is a rapid fall from grace for Forest, who finished seventh last season under the now-departed Nuno Espirito Santo to secure European football.\n\nBut it continues a troubling pattern for Postecoglou, who endured a nightmare league campaign last season with Tottenham, which cost him his job despite Europa League glory.\n\nThe Australian said he relished a challenge after his team’s 2-0 defeat at Newcastle on October 5, just days after home fans at the City Ground called for his sacking.\n\n“I’ve fought for things my whole life, so it’s just another fight that I love to be in the middle of,” said the 60-year-old.\n\nTime will tell whether the international break will help Postecoglou or has merely delayed the inevitable, with former Burnley and Everton manager Sean Dyche reportedly in the frame to replace him.\n\nUnstoppable Semenyo Antoine Semenyo is arguably the most in-form player in the Premier League, the main man in a Bournemouth team who are flying high.\n\nThe London-born Ghana winger has scored six times and provided three assists in the league for Andoni Iraola’s side, who are fourth in the table after their best start to a Premier League campaign.\n\nSemenyo has been involved in nearly 82 per cent of his team’s goals — by far the highest proportion for any player in the league.\n\n“He is incredible,” said teammate Justin Kluivert. “He shows it every game now. He is just world-class.”\n\nIraola’s Bournemouth are riding high despite selling around 200-million ($269m) worth of talent in the summer transfer window.\n\nNow they a tough challenge against a Crystal Palace team determined to prove a point after the end of their 19-match unbeaten run across all competitions.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/171310470438dbf.webp",
  "retrievedAt": "2025-10-20T18:19:17.582Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949517/liverpool-seek-mojo-against-man-utd-postecoglou-hunts-first-win",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T08:12:57.000Z"
}
