{
  "title": "US judge halts shutdown layoffs as Trump threatens 10,000 jobs - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: A US judge ordered President Donald Trump on Wednesday to pause the planned mass layoffs of federal workers during the government shutdown after the White House said it expected to fire 10,000 workers.\\n\\nThe shutdown has ground into its third week, with Congress deadlocked in a clash over spending and Trump following through on his threats to take a hatchet to the workforce in response.\\n\\nDistrict Judge Susan Illston issued the temporary restraining order in San Francisco in response to a suit filed by labor unions claiming the layoffs are illegal and “not ordinary.” Some employees also did not know they were being laid off because notices were sent to government email accounts which cannot be accessed during a shutdown, according to the seven-page order.\\n\\nIllston said unions had been hearing from pregnant members or other workers who “worry their health insurance will be impacted,” but there is no one in the office to answer questions. “Those who have received reductions in force notices cannot prepare for their upcoming terminations because the human resources staff who would typically assist them are also furloughed,” she added.\\n\\nTrump’s budget chief Russ Vought had been asked in an interview earlier how many layoffs there would be. “I think we’ll probably end up being north of 10,000,” he said. “We want to be very aggressive where we can be in shuttering the bureaucracy.” Court documents filed by the Department of Justice showed that more than 4,000 employees were fired on Friday, with the US Treasury and health, education and housing departments hardest hit. Vought said that was a “snapshot” and that there would be more.\\n\\nThe court drama came as the Senate failed for the ninth time to approve a House-passed funding bill championed by Republicans — ensuring that an estimated 1.4 million federal employees remain at their posts unpaid or on enforced leave, also without pay.\\n\\n‘Playing politics’\\n\\nTrump has warned that continued refusal by Democrats to support the resolution would result in mass layoffs targeting workers deemed to be aligned with the opposition party. But with lawmakers bracing for a historically long standoff, Trump has also sought to deflect blame from Republicans by diverting funds to popular causes such as the military and young mothers.\\n\\nHouse Speaker Mike Johnson told reporters on Monday that Congress was “barreling toward one of the longest shutdowns in American history.” Johnson has kept the House floor shuttered since mid-September, and is holding firm in refusing to move a standalone bill to pay troops throughout the shutdown. But Trump directed Defense Secretary Pete Hegseth to use any funds available to avoid 1.3 million military personnel missing their first paychecks on Wednesday.\\n\\nMany Democrats consider the move illegal, although most have balked at embarking on what would be a politically unpopular lawsuit to block it. While the military are guaranteed to get their paychecks on time, the Capitol Police — the force charged with securing Congress — missed their full paycheck for the first time on Tuesday.\\n\\nPublished in Dawn, October 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/17074105488f565.webp",
  "retrievedAt": "2025-10-20T18:40:24.336Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949449/us-judge-halts-shutdown-layoffs-as-trump-threatens-10000-jobs",
  "dateList": "2025-10-17",
  "date_published": null
}
