{
  "title": "SBP projects 3.25pc growth in FY26 - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The State Bank of Pakistan (SBP) has projected real GDP growth to remain near the lower end of its earlier estimate — around 3.25pc — for FY26, while warning that headline inflation may exceed 7pc in the second half of the fiscal year, breaching the upper bound of the medium-term target range of 5-7pc.\\n\\nIn its Annual Report on the State of Pakistan’s Economy 2024-25, released on Thursday, the SBP noted that while there has been a partial recovery in industrial activity, macroeconomic risks remain, including pressure on inflation, fiscal accounts, and external balances.\\n\\nGDP growth for FY25 was revised up to 3.02pc from 2.68pc, following a sharp rebound in the fourth quarter. Industrial output rose by 19.9pc in Q4, after growing marginally in the first three quarters — 0.3pc in Q1, 0.2pc in Q2, and 1.2pc in Q3. This late surge was driven by value addition in electricity, gas, water supply, and construction. Manufacturing, particularly small-scale manufacturing, also contributed, though mining and quarrying continued to contract for the fourth consecutive year.\\n\\nThe central bank emphasised the need for structural reforms to enhance economic resilience and position the economy on a sustainable path of high growth. Key areas identified include promoting savings and investment, improving resource allocation, and advancing institutional and regulatory reforms to enhance competitiveness.\\n\\nTwin deficit/inflation\\n\\nThe report flagged that increased economic activity and expected agricultural shortages may lead to higher imports in FY26. However, lower US tariffs on Pakistani exports and sustained workers’ remittances could help mitigate the current account deficit. The SBP projects the current account deficit (CAD) to range between 0-1pc of GDP in FY26.\\n\\nOn the fiscal side, continued tax reforms and efforts to document the economy are expected to strengthen revenue mobilisation. Additional support is expected from the transfer of SBP profits in August 2025. As a result, the fiscal deficit is projected to fall within a range of 3.8-4.8pc of GDP in FY26.\\n\\nDespite a relatively stable global commodity outlook and subdued domestic demand, inflationary pressures may resurface. “Headline NCPI inflation may cross the upper bound of the medium-term target range in the second half of FY26, before returning to the range in FY27,” the SBP stated. It noted upside risks from flood-related damage to agriculture and infrastructure, and warned of downside risks to growth from geopolitical and trade uncertainty.\\n\\nThe report also pointed to structural weaknesses in financial intermediation. Elevated government borrowing has crowded out private sector credit, with banks preferring to invest in government securities due to their high returns and low risk. This trend, the SBP noted, contributes to Pakistan’s low credit-to-GDP ratio compared to peer economies and undermines financial development, discouraging both savings and private investment.\\n\\nPrivate construction activity remained sluggish due to rising input costs and higher property taxes, despite increased development spending supporting public sector construction.\\n\\nSBP reserves rise $21m\\n\\nThe foreign exchange reserves held by the SBP increased by $21 million to $14.441 billion during the week ended on October 10, the central bank reported on Thursday.\\n\\nThe country’s total liquid foreign exchange reserves stood at $19.811bn, including $5.369bn held by commercial banks.\\n\\nPublished in Dawn, October 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1707345844744bd.webp",
  "retrievedAt": "2025-10-20T18:40:25.948Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949451/sbp-projects-325pc-growth-in-fy26",
  "dateList": "2025-10-17",
  "date_published": null
}
