{
  "title": "Australia may see last of Indian batting stalwarts Kohli, Rohit in ODI series - Sport - DAWN.COM",
  "author": null,
  "content": "Australian cricket fans may have their last chance to see India batting stalwarts Virat Kohli and Rohit Sharma in action when the pair tour in the one-day international series starting in Perth on Sunday.\n\nBoasting almost 600 ODIs between them, both 36-year-old Kohli and 38-year-old Rohit are active internationally only in the 50-overs format but their future beyond the three-match series is uncertain.\n\nHead coach Gautam Gambhir was tight-lipped when asked this week whether the duo might continue on under new captain Shubman Gill, who leads the ODI squad for the first time in Australia.\n\nRohit and Kohli last played for India in the Champions Trophy final in March in which they beat New Zealand.\n\nIf Australia is to be their last taste of international cricket, it will be in front of crowds packed with fans from the country’s booming Indian communities in Perth, Adelaide (October 23) and Sydney (October 25).\n\nA number of test players in the Australia squad, including batter Travis Head and veteran pacemen, Josh Hazlewood and Mitchell Starc, will use the series to loosen up for the Ashes.\n\nIt will be Starc’s first start in international cricket in the Australasian summer, having retired from T20s.\n\nMarnus Labuschagne, a late call-up to replace injured all-rounder Cameron Green, will hope to convert his hot red-ball form into white-ball runs to continue building his case for an Ashes recall.\n\nLabuschagne was dropped from the test side for the tour of West Indies but has roared back into contention with centuries in his last two Sheffield Shield matches for Queensland.\n\nCricket Australia said on Friday Green had been ruled out of the ODI series after having “low grade side soreness” in training and would likely return to play in Shield cricket.\n\nThe all-rounder joins Pat Cummins on the sidelines, with the regular skipper struggling to shake off lower back bone stress which has put him in doubt for the start of the Ashes.\n\nAustralia will also be without regular wicketkeeper Alex Carey for the Perth opener against India along with spinner Adam Zampa.\n\nJosh Philippe will be behind the stumps, while left-arm spinner Matt Kuhnemann gets a rare chance in the one-day side in Zampa’s absence.\n\nThe ODIs precede a five-match T20I series starting in Canberra on October 29 as both nations tune up for the T20 World Cup in India and Sri Lanka next year.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1711511748e513e.webp",
  "retrievedAt": "2025-10-20T18:19:18.968Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949502/australia-may-see-last-of-indian-batting-stalwarts-kohli-rohit-in-odi-series",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T06:53:06.000Z"
}
