{
  "title": "Saudi Arabia in talks with US for defence pact: report - World - DAWN.COM",
  "author": null,
  "content": "Saudi Arabia is discussing a defence deal with the United States which it hopes to seal when Crown Prince Mohammed bin Salman visits the White House next month, the Financial Times reported on Friday, citing people familiar with the matter.\n\nA senior Trump administration official told the Financial Times there were discussions about signing something when the crown prince comes, but the details are in flux.\n\nThe FT said the deal in discussion was similar to the recent US-Qatar pact that pledged to treat any armed attack on Qatar as a threat to the United States. The US deal with Qatar came after Israel last month attempted to kill leaders of Hamas with an air strike on Doha.\n\nThe US State Department told the FT that defence co-operation with the kingdom was a “strong bedrock of our regional strategy,” but declined to comment on details of the potential deal.\n\nThe US State Department, the White House and the Saudi government did not respond to a Reuters request for comment on the FT report.\n\nLast month, Pakis­tan and Saudi Arabia entered into a landmark mutual defence agreement, under which any aggression against one state will be considered an attack on both. The pact was signed by Prime Minister Shehbaz Sharif and Saudi Crown Prince Mohammad Bin Salman at the Al-Yamamah Palace in Riyadh.\n\nThe timing of the accord, coming on the heels of an Arab summit that signalled a shift towards collective security — in the wake of Israel’s attack on Qatar — hints that it is rooted in current world affairs and reflects the defence concerns of both countries. It also came just months after a deadly India-Pakistan conflict in May, as well as the 12-day war between Iran and Israel in June.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:19:20.905Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949494/saudi-arabia-in-talks-with-us-for-defence-pact-report",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T05:16:28.000Z"
}
