{
  "title": "Cabinet ratifies amendments to boost women’s role in business, education - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The federal cabinet on Thursday ratified a series of legislative amendments, including measures aimed at increasing women’s representation in business and education.\n\nIn order to support female entrepreneurs, a meeting of the cabinet presided over by Prime Minister Shehbaz Sharif, ratified an amendment to the Trade Organisation Rules 2013, ensuring no increase in the licence grant and renewal fees for women’s chambers of commerce and industry across the country.\n\nAnother amendment to the Inter-Board Coordination Commission Act, 2023 was approved to ensure 33 per cent representation for women on education boards throughout Pakistan.\n\nThe cabinet also ratified amendments to bring several ordinances and acts in line with the State-Owned Enterprises (SOEs) Act, 2023. These include the Jammu and Kashmir (Administration of Property) Ordinance, 1961; the Karachi Port Trust Act, 1986; the Gwadar Port Authority Ordinance, 2002; and the Port Qasim Act, 1973.\n\nPraises PM for his role in Gaza peace agreement\n\nThe meeting ratified the Pakistan Digital Authority (Management and Utilisation of Digital Nation Fund) Rules, 2025, and amendments to the governing council of the Pakistan Bureau of Statistics, the Armed Forces Nursing Services Rules, 1969, the Civil Unmanned Aircraft Rules, 2025, and the Passport Amendment Rules, 2021.\n\nThe cabinet also approved decisions made by the Cabinet Committee on Legislation (CCLC) in recent meetings.\n\nAt the outset of the meeting, cabinet members praised PM Shehbaz’s speech at the recent Gaza Peace Summit in Egypt. They paid tribute to the PM for what they called his crucial role in the Gaza peace agreement, applauding him by thumping their desks. PM Shehbaz thanked the cabinet members for the gesture.\n\n“Allah Almighty gave immense respect to Pakistan in Sharm El-Sheikh,” the PM said, adding that the country “played a very crucial role in the Gaza peace agreement”.\n\nHe said that after Marka-i-Haq, the world began seeing Pakistan as a very important country. “We cannot thank Allah Almighty enough for granting Pakistan honour and respect all over the world,” he added.\n\nWith input from APP\n\nPublished in Dawn, October 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/17084043aacffd7.webp",
  "retrievedAt": "2025-10-20T18:19:40.594Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949426/cabinet-ratifies-amendments-to-boost-womens-role-in-business-education",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T00:17:55.000Z"
}
