{
  "title": "13.7m face severe hunger due to aid cuts, says UN - World - DAWN.COM",
  "author": null,
  "content": "ROME: Almost 14 million people in countries including Afghanistan, Democratic Republic of Congo, Haiti, Somalia, South Sudan and Sudan, risk severe hunger due to cuts in global humanitarian aid, the United Nations World Food Programme has warned.\\n\\nThe WFP’s biggest donor, the United States, has slashed its foreign aid under President Donald Trump, and other major nations have also made or announced cuts in development and humanitarian assistance. “WFP’s funding has never been more challenged. The agency expects to receive 40pc less funding for 2025, resulting in a projected budget of $6.4 billion, down from $10 billion in 2024,” the Rome-based agency said on Wednesday.\\n\\nA WFP report, titled “A Lifeline at Risk”, estimated that cuts to its food assistance could push 13.7 million people from “crisis” to “emergency” levels of hunger, one step away from famine in a five-level international hunger scale.\\n\\nMajor WFP operations in six countries — Afghanistan, Dem­ocratic Republic of Congo, Haiti, Somalia, South Sudan and Sudan — are facing serious funding shortages before the end of the year, the agency said.\\n\\nPope blames a ‘soulless economy’ for the scourge\\n\\nA WFP spokesperson clarified on Thursday that the expected 13.7-million increase in the number of severely hungry people included, but was “not exclusive”, to those six countries. “The gap between what WFP needs to do and what we can afford to do has never been larger. We are at risk of losing decades of progress in the fight against hunger,” WFP executive director Cindy McCain said.\\n\\n“It’s not just the countries engulfed in major emergencies. Even hard-won gains in the Sahel region, where 500,000 people have been lifted out of aid dependence, could experience severe setbacks without help, and we want to prevent that,” she added.\\n\\nPope Leo XIV on Thursday condemned the world’s failure to stop millions of people from going hungry, blaming a “soulless economy” and calling on others to rethink their lifestyles and priorities.\\n\\n“Allowing millions of human beings to live — and die — victims of hunger is a collective failure, an ethical aberration, a historical sin,” Leo said in a speech at the Rome-based UN agricultural agency.\\n\\n“The scourge of hunger… continues to atrociously plague a significant portion of humanity,” he said, a day after the United Nations warned global hunger “is at record levels”.\\n\\nThe crisis was “a clear sign of a prevailing insensitivity, a soulless economy”, Leo told the Food and Agricultural Organisation (FAO) at a World Food Day ceremony that falls on the agency’s 80th anniversary.\\n\\nSwingeing cuts to aid led by the United States and other wealthy nations, including Britain, France and Germany, are threatening to undermine the fight against poverty and hunger. Experts warned earlier this year the cuts could lead to more than 14 million avoidable deaths by 2030.\\n\\nLeo highlighted the “outrageous paradoxes” by which enormous amounts of food go wasted in the world “while multitudes of people scramble to find something in the garbage to put in their mouths”. “How can we explain the inequalities that allow a few to have everything and many to have nothing?” he asked.\\n\\n‘Fatal lethargy’\\n\\nAround 319 million people are facing acute food insecurity, including 44 million in emergency levels of hunger, according to the World Food Programme (WFP).\\n\\nThe Catholic leader also lambasted that people seem “to have forgotten” that using starvation as a weapon is a war crime.\\n\\nPublished in Dawn, October 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/17074608c72adcc.webp",
  "retrievedAt": "2025-10-20T18:40:25.521Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949445/137m-face-severe-hunger-due-to-aid-cuts-says-un",
  "dateList": "2025-10-17",
  "date_published": null
}
