{
  "title": "More than 1.4m Afghans repatriated, no further extension by govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "A high-level meeting, chaired by Prime Minister Shehbaz Sharif, was informed on Friday that as of October 16, a total of 1,477,592 Afghan nationals have been repatriated and the government will grant no further extension.\n\nA drive to expel more than 1.3 million Afghan nationals with Proof of Registration (PoR) card holders, the last category of refugees legally living in the country without visas, has been underway since Sept 1 this year.\n\nAccording to a statement released by the Prime Minister’s Office (PMO), the meeting’s attendees were told that only those Afghans who possess a valid Pakistani visa would be allowed to stay in Pakistan and the number of exit points on the Afghan side are being increased to make the repatriation process smoother and faster.\n\n“Officials informed the meeting that harboring Afghan nationals residing illegally in Pakistan or allowing them to stay in guesthouses is a criminal offense, and efforts are underway to identify such individuals. The public will be involved in the repatriation process, and no one will be allowed to violate government policy by providing shelter to Afghan nationals,” stated the statement from the PMO.\n\nPM Shehbaz emphasised that during the repatriation of illegal Afghan refugees, elderly persons, women, children, and minorities must be treated with dignity.\n\nThe meeting was attended by Chief of the Staff Army Field Marshall Asim Munir, chief ministers of all provinces except KP, premier of Azad Kashmir, federal ministers and other officials.\n\nReferring to Afghanistan, the prime minister said that senior Pakistani officials, including the deputy prime minister, had visited Kabul multiple times to hold discussions with the Afghan interim government, urging them to prevent Afghan soil from being used for terrorism against Pakistan.\n\n“Pakistan has made serious diplomatic and political efforts to stop the infiltration of militants from Afghanistan,” said the prime minister during the meeting.\n\n“The brave people of Pakistan, who have lost loved ones in the war against terrorism, now ask: how long will the government continue to bear the burden of Afghan refugees?”\n\nThe prime minister maintained that the recent attack on the border areas of Pakistan from Afghanistan and support for terrorist infiltration is a “matter of serious concern”.\n\n“The brave armed forces of Pakistan gave a strong and decisive response to this attack. Under the leadership of Field Marshal Asim Munir, the Pakistan Armed Forces repelled the Afghan attacks. The entire nation joins me in paying tribute to them,“ added Shehbaz.\n\nConcluding the meeting, the premier urged all provinces to extend full cooperation regarding the repatriation of Afghan refugees. The forum also decided that all recommendations presented would be “strictly implemented”.\n\nThe UN’s refugee agency had reported that more than 3.5 million Afghans had been living in Pakistan, including around 700,000 people who came after the Taliban takeover in 2021. The UN estimated that half of them were undocumented.\n\nThough Pakistan had taken care of Afghans during the past decades of war, the government is now compelled to say that the high number of refugees is eventually posing risks to national security and causing pressure on public services.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/17174732e866a0f.webp",
  "retrievedAt": "2025-10-20T18:19:14.359Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949548/more-than-14m-afghans-repatriated-no-further-extension-by-govt",
  "dateList": "2025-10-17",
  "date_published": "2025-10-17T12:48:29.000Z"
}
