{
  "title": "Sost trade resumes after tribunal ruling - Business - DAWN.COM",
  "author": null,
  "content": "GILGIT: Trade activities at the Sost Dry Port have resumed following a decision by the Pakistan Cus­toms Appellate Tribunal, which ordered the clearance of over 200 stuck consignments and ruled on the confiscation of goods worth nearly Rs8bn over misdeclaration charges.\\n\\nTrade between Pakistan and China had remained suspended for several months due to a standoff between Pakistan Customs and Gilgit-Baltistan (GB) traders. The dispute centred on tax collection and allegations of misdeclaration in Goods Declarations (GDs) by traders.\\n\\nLocal traders, supported by political and religious parties, blocked the Karakoram Highway near Khunjerab Pass, halting cross-border trade and travel for more than two months.\\n\\nThe protest ended after negotiations between a federal committee and GB representatives last month, leading to the partial resumption of trade on Sept 29.\\n\\nGB traders had challenged the Customs (Adju­dication) orders before the Customs Appellate Tribunal in Islamabad. A special division bench, comprising Hafiz Ansarul Haq (judicial) and Abdul Waheed Marwat (technical), heard over 80 appeals and issued judgments on Tuesday.\\n\\nAccording to the tribunal, traders were found to have deliberately misdeclared the nature and value of goods, including cigarette acetates, to evade taxes. Each case involved an average of Rs1.5bn in underreported value, with a total evasion attempt nearing Rs8bn.\\n\\nWhile the tribunal upheld the findings of misdeclaration, it directed Pakistan Customs to re-examine and reassess the goods in the presence of importers’ representatives.The tribunal waived off all fines and penalties on majority of cases.\\n\\nPublished in Dawn, October 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f16ab721611.gif",
  "retrievedAt": "2025-10-20T18:40:26.748Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949453/sost-trade-resumes-after-tribunal-ruling",
  "dateList": "2025-10-17",
  "date_published": null
}
