{
  "title": "PM Shehbaz announces Rs7.41 per unit cut in power tariffs for countrywide consumers - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Thursday announced a Rs7.41 per unit cut in power rates across the country in a “major” relief package to reduce the burden on citizens facing exorbitant electricity bills.\n\nSpeaking at an event in Islamabad, the premier congratulated the nation and said that it was not easy to convince the International Monetary Fund (IMF) of the cut, adding that his team had gone to great lengths to achieve the feat.\n\nFor industries, he declared that electricity prices would be cut by Rs7.69.\n\nThe premier also emphasised that the government would have to take up structural reforms in the power sector, highlighting his determination to tackle the theft of Rs600 billion.\n\n“Even though work on it has already started, we have to completely eradicate [malpractices]”, he said. “If a shopkeeper is paying the electricity bill honestly and the shopkeeper next to him does not, then it is an unhealthy competition.”\n\nHighlighting the structural reforms to be taken in the power sector, the prime minister said the government would ensure halting power theft which was around Rs600 billion per year. Similarly, he said by establishing an open market, electricity tariffs would be further decreased.\n\nHe said there was no option but to privatise or commercialise power distribution companies (DISCOs) to reduce the burden of line losses and power theft on the national exchequer.\n\n“I have directed the team concerned to work diligently to implement reforms in the sector as soon as possible,” he added.\n\nAppreciating the task force formed to finalise power reforms, the prime minister said the force worked really hard and through their innovative thoughts, they brought different options and managed to convince the IMF to reduce the power tariffs.\n\n“We did not pass on the low international petroleum prices and retained the prices to ensure that the government will reduce the power tariffs to which IMF agreed in principle,” he added. He said the trust with the IMF that was breached in 2020, was now being restored.\n\nSimilarly, he said the government successfully negotiated with independent power producers (IPPs), and praised the government team for their commendable efforts.\n\n“After negotiation with the IPPs, our team managed to save Rs3,696bn that were to be paid to the IPPs,” he added.\n\nLikewise, he added that the government was also facing an immense challenge of circular debts of Rs2,393bn.\n\nPM Shehbaz said the government had also made arrangements to gradually but permanently solve this problem within five years.\n\nA statement from Power Minister Awais Leghari said the government had fulfilled its promise made to the people by the power tariff reduction for domestic consumers.\n\nHe said the Power Division was also working on other aspects to further reduce and stabilise electricity prices in the country.\n\nLeghari said the public would now witness continuous improvement in the electricity sector. “We are working day and night to improve the electricity distribution system and bring further reductions in power tariff,” he said.\n\nHe said owing to the government’s initiatives, industries would soon operate at full capacity.\n\nThe government on Wednesday wrote on its official X account that “great news for the entire nation” would be unveiled today, without providing any details about the announcement itself. The post bore the hashtag ‘Small Eid, Big Gift’, referring to Eidul Fitr.\n\nIt was widely reported last month that the prime minister would announce a Rs8 per unit reduction in electricity rates in his speech to the nation on March 23. The prime minister, however, did not announce any such relief package in his Pakistan Day speech.\n\nInstead, he presided over a meeting on the power sector in light of a last-minute hiccup after a substantial reduction in electricity tariffs could not get past the Fund. The premier reiterated that a cut in electricity tariffs would “be announced soon”.\n\nIt may be noted that the government had decided to maintain the petroleum prices at the existing level — instead of an up-to-Rs13 per litre cut worked out by the oil regulator and the petroleum division — promising to transfer its financial impact to electricity consumers.\n\nMeanwhile, the ruling PML-N had said PM Shehbaz would give a “big gift from the federal government to the people”.\n\nRana Sanaullah, the premier’s aide, wrote on X that the highly anticipated relief package would “thwart Pakistan’s default plot”.\n\n“Stock market rally, remittances rise, and inflation fall — tomorrow the propaganda of despair will end!” the PM’s adviser maintained in Wednesday’s post.\n\nDefence Minister Khawaja Asif had also posted about the announcement, calling it “good news … which will be the fruit of the hard work and the result of Allah’s grace since 2022”.\n\nHe added, “This journey of development, progress and economic revival will continue.”\n\nToday, the premier described power rate cut “as a gift to the nation on the occasion of Eid,” according to state-owned Radio Pakistan.\n\nPM Shehbaz emphasised that a reduction in power tariffs was crucial for uplifting industries and agriculture, as well as boosting exports, expressing his confidence in the economy.\n\nOn March 26, PM Shehbaz’s team unlocked the new $1.3 billion arrangement with the IMF, along with a successful first review of the ongoing 37-month bailout programme.\n\nThe IMF disclosed in March that it had allowed only a Re1 per unit reduction in power tariff against a grid levy imposed on industrial captive power plants.\n\n“The programme allows some explicit tariff differential subsidy and revenue from CPP (captive power plants) firms can be used for reducing Rs1 per kWh (kilowatt-hour) electricity price.\n\n“The benefit of the reduction in the prices will go to everyone,” IMF Resi­dent Representative in Islam­­abad Mahir Binici told journalists.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0314341149e446b.jpg",
  "retrievedAt": "2025-08-25T13:56:53.907Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901850/pm-shehbaz-announces-rs741-per-unit-cut-in-power-tariffs-for-countrywide-consumers",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T10:15:25.000Z"
}
