{
  "title": "Katcha crime mystery deepens: Fellow outlaw killed vlogger dacoit after ‘Rs16m police deal’ in Rahim Yar Khan - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Initial police inquiries suggest that a suspected criminal, Umar Lund, who was shot dead by armed men in Rahim Yar Khan last Saturday, had murdered the Katcha area hardened criminal and vlogger – Shahid Lund – for Rs16 million, following an alleged deal with the Punjab police.\n\nThe Punjab government had announced Rs10 million head money for killing Shahid Lund or helping the police in his arrest.\n\nIt was reported that the Punjab Elite police (of Rajanpur district) were providing security to Umar Lund after he allegedly shot Shahid Lund dead in November 2024. Shahid was the ringleader of Lund gang operating in Katcha area of the river Indus and was also a YouTuber.\n\nAccording to an official privy to the information, Umar was ambushed in Jmaldin Wali area of Rahim Yar Khan soon after the Elite police, deputed for his security by Rajanpur police, left him under mysterious circumstances, triggering a debate on the police’s role in the episode.\n\nWhy police suddenly left his killer at the mercy of dacoits is yet to be known\n\nThe official, seeking anonymity, said that one of the attackers was the brother of Shahid Lund and two others were his cousins, who managed to return back to the Katcha area after completing their task successfully. He said the fatal attack on Umar was planned to avenge Shahid’s murder. However, he said, that the mystery surrounding the killing of Shahid Lund deepened when the police high-ups launched an investigation to trace the police officials who might have leaked any information to the attackers who targeted Umar.\n\nThe official source further says that Umar Lund was hired by the Punjab police to eliminate Shahid Lund after the latter began to appear on social media frequently, threatening the law enforcement agencies with dire consequences and challenging them to get him.\n\nHe says that a “think tank” of the Punjab police devised a plan to exploit the differences existing between Umar Lund and his tribesmen, and Shahid Lund. Finally, the Punjab police succeeded in striking a deal with Umar Lund, under which he was to be paid Rs16 million as “reward money” for killing Shahid, he adds.\n\nThe source claims that an advance amount of Rs2 million was paid to Umar Lund from the accounts of the Punjab police department, while police of Rajanpur and Rahim Yar Khan districts paid Rs1.5m each to the suspect.\n\nHe says that the police high-ups assured Umar that he would also get the Rs10m head money for killing Shahid.\n\nThe official says that for the payment of the remaining amount to Umar, the Rajanpur district police officer (DPO) sent a request to the Central Police Office (CPO) for the release of the head money amount.\n\nHe says that Umar was being provided full security by Rajanpur police during the 12 days\n\nbefore his killing. However, when he entered RYK from Rajanpur district, he was left unprotected and was targeted by armed men, who had apparently been chasing him constantly, and managed to escape back to Katcha area without facing any resistance from the police.\n\nThe murder of Umar Lund and his accomplices despite the security cover being allegedly provided to them by Rajanpur police puts a big question mark on role of the police. It is not clear why Umar was left unprotected despite such a serious threat to his life, and who leaked the information about his movement to his enemies?\n\nIt is also not known that who will get the “head money” announced by the government for killing Shahid Lund after the murder of Umar?\n\nHowever, Punjab Inspector General of Police Dr Usman Anwar, when asked the same question by Dawn, said no one was paid the head money placed on Shahid Lund as the amount was yet to be released from the official account.\n\nOPERATION: Rahim Yar Khan police claimed to have demolished hideouts of criminals, arresting their two facilitators in a an intelligence-based search operation launched in the areas adjacent to Katcha region, including Paka Chandia and Dawa Wala.\n\nAccording to a Punjab police spokesperson, the search operation is targeted against those suspected of aiding the dacoits of Katcha area.\n\nThe operation is being supervised by Sadiqabad ASP, with SHOs from Kot Sabzal, Bhong, and Ahmedpur Lama, along with Elite commandos and a police force.\n\nThe police are utilising armoured and bulletproof vehicles in the operation.\n\nThe IGP has directed the officials that all facilitators of Katcha criminals must be brought to justice to ensure long-term peace in the region.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:19:54.233Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901792/katcha-crime-mystery-deepens-fellow-outlaw-killed-vlogger-dacoit-after-rs16m-police-deal-in-rahim-yar-khan",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:57:34.000Z"
}
