{
  "title": "Customs clearing agent shot dead by robbers in Karachi’s DHA - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A man was shot dead by robbers in the Defence Housing Authority area on Wednesday afternoon, police said.\n\nThey said that 35-year-old Amir Sultan was shot and killed in Phase I near Tooba Masjid when he resisted a robbery bid.\n\nDIG-South Syed Asad Raza said Sultan was standing in front of his apartment building when two muggers on a motorbike emerged there, held him at gunpoint and demanded his cell phone.\n\n“The victim tried to get hold of one of the muggers and during the scuffle he was fatally shot in the head, “ the DIG said.\n\nDefence SHO Bhai Khan told Dawn that the man was gunned down in front of his teenage son.\n\nHe said CCTV footage showed the victim was approaching towards his parked car when one of the muggers got off the motorbike and demanded his cell phone. He put up resistance and overpowered the mugger, but his accomplice shot Sultan in the head.\n\nThe body was shifted to the Jinnah Postgraduate Medical Centre for medico-legal formalities. The victim was a customs clearing and forwarding agent and originally hailed from Abbottabad.\n\nThe DIG said that investigators examined CCTV footage that showed the muggers fled towards Korangi Industrial Area after the fatal shooting. He said that the police were trying to trace their escape route to ascertain their whereabouts.\n\nMan killed by robbers on Eid’s first day\n\nA man was shot dead and another wounded by armed muggers off Superhighway on the first day of Eidul Fitr on Monday.\n\nPolice identified the deceased as Rahat Gul, 37, and wounded as Kashif Rafiq, 23.\n\nThey were shot when they resisted a robbery bid in Faqeera Goth near Pareshan Chowk, the police said.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:20:20.158Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901678/customs-clearing-agent-shot-dead-by-robbers-in-karachis-dha",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:14:05.000Z"
}
