{
  "title": "2 arrested in Karachi for impersonating police, carrying out online robberies, kidnappings - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two people have been arrested in Karachi for impersonating the police and committing robberies and kidnappings via an online platform, it emerged on Thursday.\n\nThe suspects used to steal data from a private digital site and contact customers to receive deliveries, according to a press release by Karachi District East Police spokesperson.\n\n“After contacting customers, the suspects would wear fake police uniforms and reach the doorsteps of the customers ti commit house robberies and kidnappings,” the statement said.\n\nGulshan-e-Iqbal Station House Officer (SHO) Naeem Rajput arrested two of the suspects after identifying them through CCTV footage obtained from several crime scenes.\n\nTwo illegal 30 bore pistols with ammunition, mobile phones, and stolen watches, among other items, were recovered from the suspects during their arrest.\n\nThe vehicle used by the suspects, which had a fake number plate BKY-361, was seized by the police, and information is being obtained based on the car’s records, the statement further added.\n\nFollowing the interrogation, the arrested suspects identified the items looted during the house robberies. They included three police uniforms, eight stolen mobile phones, dozens of mobile phone covers, dozens of uniform badges, various mobile SIMs and 20 bags.\n\nThey confessed that the items were stolen during the following robbery incidents.\n\nOn March 6, after entering a house in Gulshan-e-Iqbal Block 1, they looted four mobile phones, an LED TV, gold ornaments, watches and cash. They then kidnapped the victim and took him to ATMs at different locations in Karachi to withdraw money, after which they escaped. The case related to the incident was registered under charge number 202/2025 at the Gulshan-e-Iqbal Police Station.\n\nIn another incident on February 8 in Gulshan-e-Iqbal Block 13/D, they entered an apartment after introducing themselves in the above-mentioned police uniforms and took the victim’s mobile phone, ATM card and car documents. They then put him in the car and drove him to various ATMs and EasyPaisa shops in Karachi, forcing him to withdraw money.\n\nThey then fled with the vehicle. The case of the incident has been registered under charge number 80/2025 at Gulshan-e-Iqbal Police Station.\n\nDuring interrogation, the suspects revealed that they had committed several incidents inside and outside Karachi, the details of which are being obtained.\n\nCases have been registered against the arrested suspects under the code of conduct, while more cases have been handed over to the investigating authorities for arrest and investigation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0313550882d0faa.png",
  "retrievedAt": "2025-08-25T13:56:50.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901835/2-arrested-in-karachi-for-impersonating-police-carrying-out-online-robberies-kidnappings",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T09:56:08.000Z"
}
