{
  "title": "Myanmar junta declares quake ceasefire - World - DAWN.COM",
  "author": null,
  "content": "• Devastating earthquake has killed nearly 3,000, made thousands homeless\n• Hundreds of people scramble for aid distribution\n• WHO reports one in three houses collapsed in Sagaing\n\nSAGAING: Myanmar’s junta announced a temporary ceasefire on Wednesday as the death toll from a devastating earthquake rose and desperate survivors pleaded for more help amid frantic scenes of aid distribution.\n\nThe shallow 7.7-magnitude earthquake on Friday flattened buildings across Myanmar, killing nearly 3,000 people and making thousands more homeless.\n\nThe military government said it would observe a ceasefire from Wednesday until April 22 to make quake relief efforts easier, after other armed groups fighting the country’s bloody four-year civil war made similar pledges.\n\nRights groups and several foreign governments had earlier condemned the junta for continuing to carry out air strikes even as the country grappled with the quake aftermath.\n\nThe junta said in a statement the ceasefire had “the aim of speeding up relief and reconstruction efforts, and maintaining peace and stability”.\n\nBut it warned its opponents — a complex array of pro-democracy and ethnic minority armed groups — it would still respond to attacks, acts of sabotage or “gathering, organising, and expanding territory that would undermine peace”.\n\nThe junta also said Min Aung Hlaing will travel to Bangkok on Thursday for a summit of South Asian countries plus Myanmar and Thailand, where he will discuss the quake response.\n\nIt is a rare foreign trip for the leader, and something of a diplomatic coup as it breaks with a regional policy of not inviting junta leaders to major events in the wake of the putsch.\n\nScramble for food\n\nAFP journalists saw frantic scenes as hundreds of desperate people scrambled for aid distribution in Sagaing, the city closest to the epicentre of the quake, with some running through traffic to join the queues.\n\nVolunteers handed out water, rice, cooking oil and other basic supplies to residents clamouring for assistance.\n\n“I have never queued for food like this before. I can’t express how worried I am. I don’t know what to say,” Cho Mar, 35, carrying her baby and clutching instant coffee packs and mosquito repellent, told AFP.\n\nDestruction in the city is widespread, with the World Health Organisation (WHO) reporting that one in three houses have collapsed, and five days after the quake locals complained of a lack of help.\n\nAye Thi Kar, 63, head of a school for young nuns razed to the ground by the tremors, said food supplies were low but shelter was a bigger priority — along with nets to ward off mosquitos in the stifling tropical heat.\n\nMany people have been sleeping in the streets since the quake hit, unable to return to damaged buildings or fearful of aftershocks.\n\n“Right now we need roofing and walls to have proper shelter for the night,” she told AFP.\n\n“We also need nets and blankets for sleeping, as we don’t want to sleep directly on the ground.” Healthcare facilities, damaged by the quake and with limited capacity, are “overwhelmed by a large number of patients”, while supplies of food, water and medicine are running low, WHO said in an update.\n\nHopes of finding more survivors are fading, but there were moments of joy on Wednesday as two men were pulled alive from the ruins of a hotel in the capital Naypyidaw.\n\nCall for peace\n\nThe junta said Wednesday that the death toll had risen to 2,886, with more than 4,600 injured and 373 still missing.\n\nBut with patchy communication and infrastructure delaying efforts to gather information and deliver aid, the full scale of the disaster has yet to become clear, and the toll is likely to rise.\n\nRelief groups say the overall quake response has been hindered by continued fighting between the junta and the complex patchwork of armed groups opposed to its rule, which began after the military seized power in a 2021 coup.\n\nEven before Friday’s earthquake, 3.5 million people were displaced by the fighting, many of them at risk of hunger, according to the United Nations.\n\nLate Tuesday, an alliance of three of Myanmar’s most powerful ethnic minority armed groups announced a one-month pause in hostilities.\n\nThe announcement by the Three Brotherhood Alliance followed a separate partial ceasefire called by the People’s Defence Force — civilian groups that took up arms after the coup to fight junta rule.\n\nA junta spokesman said soldiers fired warning shots on Tuesday when a Chinese Red Cross convoy failed to stop while approaching a village in conflict-ridden Shan state to deliver aid to earthquake victims.\n\nHundreds of kilometres away, in the Thai capital Bangkok, workers continued to scour through the rubble of a 30-storey skyscraper that was still being built when it collapsed on Friday.\n\nThe death toll at the site has risen to 22, with more than 70 still believed trapped in the rubble.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67edb5643a2a6.jpg",
  "retrievedAt": "2025-08-25T13:57:33.222Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901716/myanmar-junta-declares-quake-ceasefire",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:12:19.000Z"
}
