{
  "title": "France warns of military confrontation if there’s no deal on Iran’s N-plan - World - DAWN.COM",
  "author": null,
  "content": "PARIS: France’s foreign minister warned on Wednesday that if world powers were unable to quickly reach a new agreement with Iran over its contested nuclear programme then a military confrontation seemed “almost inevitable”.\n\nSpeaking after President Emmanuel Macron convened a rare and undisclosed meeting of key ministers and experts on Wednesday to discuss the Iran dossier, Jean-Noel Barrot appeared to ramp up the pressure on Tehran.\n\nEuropean powers are seeking to create a diplomatic path with a view to getting an agreement to curb Iran’s uranium enrichment activity by the summer and ahead of an Oct 2025 deadline, when UN sanctions related to a 2015 accord on Iran’s nuclear programme with world powers expire.\n\nWestern powers say the nuclear programme amounts to a disguised effort to develop an atomic bomb. Iran has long denied seeking nuclear weapons. “The window of opportunity is narrow. We only have a few months until the expiration of this (2015) accord. In case of failure, a military confrontation would seem to be almost inevitable,” Barrot told a parliamentary hearing.\n\nThe earlier cabinet meeting, confirmed by three diplomatic sources, is rare and highlights mounting concern among Washington’s European allies that the United States and Israel could launch airstrikes on Iran’s nuclear facilities unless there is a quick negotiated deal on its nuclear programme.\n\nAddition of aircraft\n\nThe US is increasing the number of aircraft carriers deployed in the Middle East to two, keeping one that is already there and sending another from the Indo-Pacific, the Pentagon said on Tuesday, amid a US bombing campaign against the Houthis who control much of Yemen and are supported by Iran.\n\nThe Carl Vinson will join the Harry S. Truman in the Middle East “to continue promoting regional stability, deter aggression, and protect the free flow of commerce in the region,” Pentagon spokesman Sean Parnell said in a statement.\n\n“To complement the CENTCOM maritime posture, the secretary also ordered the deployment of additional squadrons and other air assets that will further reinforce our defensive air-support capabilities,” Parnell said, referring to the US military command responsible for the region.\n\n“The United States and its partners remain committed to regional security in the CENTCOM (area of responsibility) and are prepared to respond to any state or non-state actor seeking to broaden or escalate conflict in the region,” he added.\n\nA day before the carrier announcement, US President Donald Trump vowed that strikes on Yemen’s Houthis would continue until they are no longer a threat to shipping. While Trump signalled that the deployment of second aircraft carrier in the Middle East is to eradicate Houthi’s in the Red Sea and Gulf of Aden, a senior European official said European strategists were asking themselves whether the campaign could be a precursor to a US strike on Iran in the coming months.\n\nTrump, who has urged Supreme Leader Ayatollah Ali Khamenei to engage immediately in negotiations, threatened Iran on Sunday with bombing and secondary tariffs.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:19:36.052Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901732/france-warns-of-military-confrontation-if-theres-no-deal-on-irans-n-plan",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:13:45.000Z"
}
