{
  "title": "Missing Palestinian medics found in mass grave - World - DAWN.COM",
  "author": null,
  "content": "GAZA: The shocking discovery of the remains of 15 people — including a UN worker and medics working for the Palestine Red Crescent Society (PRCS) — killed and buried in a mass grave by Israel, has prompted outrage and condemnation from across the world.\n\nThe nine PRCS medics in ambulances, along with some civil defence workers, had gone to help people in Rafah when they disappeared on March 23 after coming under attack from Israeli forces.\n\nWhat followed was a week of Israeli obstruction until international teams were finally able to enter the area where the medics and rescue workers disappeared, Al Jazeera reported.\n\nThey found gruesome proof of direct attacks on the humanitarian workers. One medic remains missing.\n\nTeam dispatched to find missing PRCS workers was also killed; some bodies found with their hands bound\n\nAccording to PRCS, one ambulance was dispatched to al-Hashaashin, Rafah, to help people injured by Israeli attacks on March 23, which was shot at by Israeli soldiers.\n\nThe PRCS then sent a further three ambulances to help the injured people their colleagues were trying to reach, and to rescue their colleagues who had been attacked.\n\nAccording to Tommaso Della Longa, spokesperson for the International Federation of Red Cross and Red Crescent Societies (IFRC), PRCS “lost contact with their colleagues” on March 23.\n\nLonga said that, for a whole week, the IFRC, PRCS, ICRC and the UN made appeals to Israeli authorities to enter the area to investigate.\n\nIsrael blocked the requests until finally a mission was able to enter and look for the missing rescue workers.\n\nVideo from the scene showed searchers digging out several bodies wearing orange emergency vests, some piled on top of each other.\n\nAccording to the Guardian, some of the bodies were found with their hands or legs tied and had gunshot wounds to the head and chest, according to two witnesses.\n\nThere were three ambulance officers — who transport the wounded and offer emergency healthcare at times: Ezzedine Shaath, Mostafa Khafaga and Saleh Muamer.\n\nThere were also five first responder volunteers: Ash­raf Abu Labda, Mohammad Bahloul, Mohammed al-Heila, Raed al-Sharif and Rifatt Radwan.\n\nAmbulance officer Assad al-Nassasra is still missing. “We don’t know where he is,” Della Longa told Al Jazeera.\n\nOne of the deceased men was a UN agency employee.\n\nThey were killed “one after another”, then buried in the sand along with their emergency vehicles, the UN said.\n\n“The available information indicates that the first team was killed by Israeli forces on March 23, and that other emergency and aid crews were struck one after another over several hours as they searched for their missing colleagues,” a spokesperson for the United Nations Office for the Coordination of Humanitarian Affairs (OCHA) in Palestine said.\n\nOCHA head Jonathan Whittall said from the scene: “We’re digging them out in their uniforms, with their gloves on. They were here to save lives.”\n\n“These ambulances have been buried in the sand. There’s a UN vehicle here, …[an] Israeli forces bulldozer has buried them.”\n\nBut the Israeli army’s spokesperson, Nadav Shoshani, claimed the medics had not been killed deliberately.\n\nThe Israeli military said that an inquiry had found that troops had opened fire on vehicles including ambulances and fire trucks that approached a position without prior coordination and without headlights or emergency signals.\n\nBut Soshani did not explain the fact that one body was recovered with his hands bound, according to the Red Crescent in Gaza, and that Israeli bulldozers had tried to bury the vehicles after the fact.\n\nCondemnation\n\n“I condemn the attack by the Israeli army on a medical and emergency convoy on 23 March resulting in the killing of 15 medical personnel and humanitarian workers in Gaza,” United Nations High Commissioner for Human Rights Volker Turk said in a statement.\n\n“The subsequent discovery of their bodies eight days later in Rafah, buried near their clearly marked destroyed vehicles, is deeply disturbing,” he added.\n\n“This raises significant questions with regard to the conduct of the Israeli army during and in the aftermath of the incident.”\n\n“I am heartbroken. These dedicated ambulance workers were responding to wounded people. They were humanitarians,” IFRC Secretary General Jagan Chapagain said.\n\n“Even in the most complex conflict zones, there are rules. These rules of International Humanitarian Law could not be clearer — civilians must be protected; humanitarians must be protected. Health services must be protected.”\n\nThe ICRC said in a separate statement that it was “appalled” that the medics were killed while carrying out their work.\n\nThe head of the UN agency for Palestinian refugees (UNRWA), Philippe Lazzarini, said the UN staff member was one of its employees and that the burial of the bodies in “shallow graves” was “a profound violation of human dignity”.\n\nOCHA spokeswoman Olga Cherevko said there needed to be a full investigation to establish exactly what happened.\n\n“They were aid workers in clearly marked vehicles, so this is why it’s obviously important to get to the bottom of it and get all the facts,” she told the BBC.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67edc407d5150.jpg",
  "retrievedAt": "2025-08-25T13:57:34.520Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901757/missing-palestinian-medics-found-in-mass-grave",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:11:24.000Z"
}
