{
  "title": "What the world says about Trump’s tariffs - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Wednesday announced sweeping new tariffs on imports to the United States from countries across the globe.\n\nHere are international reactions so far from the world’s major economies:\n\nBeijing said it “firmly opposes” the new tariffs on its exports, and vowed “countermeasures to safeguard its own rights and interests”.\n\nTrump unveiled particularly stinging tariffs of 34 per cent on China, one of its largest trading partners, while a 10pc base tariff on all countries also applies. That comes on top of a 20pc rate imposed last month.\n\nThe tariffs “do not comply with international trade rules”, China’s Commerce Ministry said.\n\nIt urged Washington to “immediately cancel” them, warning they “endanger global economic development”.\n\nThe tariffs are a “major blow to the world economy”, warned EU chief Ursula von der Leyen.\n\n“There seems to be no order in the disorder. No clear path through the complexity and chaos that is being created as all US trading partners are hit,” she said.\n\nAfter the 20pc tariffs on EU exports to the United States, she said Brussels was “preparing for further countermeasures” but added it was “not too late to address concerns through negotiations”.\n\nThe German Automotive Industry Association said the tariffs would “only create losers” and urged the EU to act “with necessary force, while continuing to signal its willingness to negotiate”.\n\nThe German chemical industry, which counts the United States as its largest export market, urged the EU to “keep a cool head”, stressing “an escalation would only worsen the damage”.\n\nTrade minister Yoji Muto said the 24pc tariffs on Japanese exports to the United States were “extremely regrettable, and I have again strongly urged (Washington) not to apply them to Japan”.\n\nJapan’s chief cabinet secretary Yoshimasa Hayashi told reporters the tariffs may contravene World Trade Organisation rules and the pair’s trade treaty.\n\nAjay Sahai, chief executive of the Federation of Indian Export Organisations, told AFP the tariffs will “hurt demand” for its exports.\n\n“The tariffs slapped on India are definitely both high and higher than expected,” he said. But he said competitor nations like China and Vietnam had been hit harder, which opened up space for India to gain a market share.\n\nThe UK will “remain calm, and committed” to sealing a trade deal with the United States which could help “mitigate” a 10pc tariff imposed on British exports to the United States, business minister Jonathan Reynolds said.\n\nHowever, “we have a range of tools at our disposal and we will not hesitate to act”, he added.\n\nPresident Emmanuel Macron will meet representatives of French sectors “impacted by the tariff measures”, his office said.\n\nItalian Prime Minister Giorgia Meloni criticised the new US tariffs on imports from the EU and urged a deal, warning a trade war would “inevitably weaken the West”.\n\n“The introduction by the US of tariffs towards the EU is a measure that I consider wrong and that does not suit either party,” she said.\n\nPrime Minister Mark Carney warned the tariffs will “fundamentally change the global trading system”.\n\n“We are going to fight these tariffs with countermeasures. We are going to protect our workers,” he said.\n\nBangladeshi textile industry leaders said that US tariffs posed a “massive blow” to the world’s second-largest garment manufacturer, which accounts for some 80pc of the South Asian nation’s exports.\n\n“Buyers will go to other cost-competitive markets — this is going to be a massive blow for our industry,” said Rakibul Alam Chowdhury, chairman of RDM Group, a major manufacturer with an estimated $25 million turnover. “We will lose buyers.”\n\nBrazil’s Congress approved a so-called “Economic Reciprocity Law” allowing the executive to respond to the 10pc tariffs on exports from Latin America’s biggest economy, which is the second-largest exporter of steel to the United States after Canada.\n\n“A global tariff war has become a reality,” said acting president Han Duck-soo following Trump’s 25pc tariffs on imports from South Korea.\n\nHan convened an emergency task force and vowed to mobilise “all government resources” to overcome the “trade crisis”, urging ministers to minimise the damage through aggressive negotiations with Washington.\n\nPrime Minister Anthony Albanese said the new tariffs were “not the act of a friend” and would hurt the close allies’ relationship.\n\n“These tariffs are not unexpected, but let me be clear: they are totally unwarranted,” he said.\n\nAfter Switzerland was hit with 31pc tariffs, President Karin Keller-Sutter said the government would quickly decide on the next steps.\n\n“The country’s long-term economic interests are the priority. Respect for international law and free trade are fundamental,” she said.\n\nIn a rather different reaction than most countries, Polish Prime Minister Donald Tusk said: “Friendship means partnership. Partnership means really and truly reciprocal tariffs.”\n\nThe Taiwanese government found the 32pc levy “highly unreasonable and deeply regretted it” said cabinet spokeswoman Michelle Lee. She said Taiwan would “initiate serious negotiations with the United States”.\n\nHeader image: US President Donald Trump stands after delivering remarks on tariffs, at the White House in Washington, DC, April 2, 2025. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0311160957c62bb.jpg",
  "retrievedAt": "2025-08-25T13:56:51.708Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901823/what-the-world-says-about-trumps-tariffs",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T06:34:19.000Z"
}
