{
  "title": "Indian bill to revamp Muslim land management faces backlash - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: The Indian government on Wednesday presented a bill in parliament that plans sweeping changes in the management of vast tracts of land set aside solely for Muslim use, potentially stoking tensions between the government and minority Muslims.\n\nThe land and properties fall under the “waqf” category, which means “to stay” in Arabic, and are endowed by a Muslim for religious, educational or charitable purposes. Such land cannot be transferred or sold.\n\nGovernment and Muslim organisations estimate that over 25 waqf boards hold nearly 85,1535 properties and 900,000 acres of land, putting them among the top three landowners in India.\n\nThe Waqf (Amendment) Bill, tabled by Prime Minister Narendra Modi’s government, proposes inclusion of non-Muslim members in the central Waqf Council and waqf boards and will enable the government to determine ownership of disputed waqf properties.\n\nOpposition, Islamic groups in India see legislation as a ploy to secure assets owned by Muslims\n\nThe legislation comes amid tensions between the Muslim community and Modi government. Opposition lawmakers and Islamic groups see the bill as a plan to secure assets owned by Muslims and to weaken their property rights under the Indian constitution.\n\nMinister of Minority Affairs Kiren Rijiju, who tabled the bill, said it would end corruption, mismanagement and examine ownership rules largely controlled by some Muslim families and elite groups.\n\nThe bill should “be viewed as a “pro-Muslim reform,” he said.\n\nVote to decide bill’s fate\n\nA vote by ruling alliance and opposition lawmakers in the lower house will decide the fate of the bill later on Wednesday.\n\n“It is okay to reserve two posts in the Waqf board for non-Muslims but does it mean that Muslims will get similar reservation in the boards of Hindu temples?” asked Kamal Farooqui, an official of the All India Muslim Personal Law Board.\n\n“Modi government wants to control the Islamic land bank and they have no right to undermine our institutions,” he said.\n\nA 2006 report by the government-appointed Sachar Commit­tee had urged an overhaul of waqf boards and monitoring of properties to generate higher returns for the Muslim community.\n\nIndia is set to have the world’s largest Muslim population by 2050, the Pew Research Center has forecast. Yet the community, which makes up about 13 per cent of India’s population, lags the national average on indicators such as education, employment and political representation.\n\nMuslim groups allege Modi’s ruling party and hardline Hindu affiliates since 2014 have promoted anti-Islamic policies, violent vigilantism and demolished Muslim-owned properties.\n\nModi and his party officials deny religious discrimination allegations.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:20:49.928Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901714/indian-bill-to-revamp-muslim-land-management-faces-backlash",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:12:19.000Z"
}
