{
  "title": "Economists see hurdles and opportunities for Pakistan as US imposes 29pc tariff on country - Business - DAWN.COM",
  "author": null,
  "content": "Analysts saw immediate hurdles and long-term opportunities for Pakistan after US President Donald Trump on Thursday imposed a 29 per cent tariff on goods the United States imports from Pakistan, along with duties on dozens of countries from rivals to allies, intensifying a global trade war.\n\nThe US imposed 29pc reciprocal tariffs on Pakistan, which charges the US 58pc, according to a board that Trump held during his announcement.\n\nAli Hasanain, associate professor of economics at LUMS, said that “America is one of Pakistan’s most important trade partners, and the one with which we run the largest trade surpluses”, adding that nearly a fifth of the country’s exports were destined for the US.\n\nHe highlighted that exports to the US were less than 1.5pc of Pakistan’s GDP.\n\n“Even if these are entirely wiped out — which is highly unlikely — the impact will be smaller than multiple times we have shrunk our economy through our own mismanagement,” he said.\n\nOn whether this would impact US-Pakistan relations, he noted that relations with the US appeared to be stable but “in a low equilibrium at the moment”.\n\n“The trade relationship is one component of our dealings with the US. Far more important in the short term is American support for Pakistan’s IMF programme,” he said. “And I — as a non-expert watcher of International Relations — expect the impact to be minimal.”\n\nHe highlighted that since the tariffs impacted the US trade relations with all countries, there would a major shift in global trade patterns as a result — where countries will seek new options.\n\n“However, the US is by a significant margin our biggest market, and may not be fully replaceable for Pakistani businesses,” he said.\n\nOn Pakistan’s pivot to other countries, he highlighted that there will be some attempts to shift to other markets by Pakistan and other major textile exports such as Bangladesh.\n\n“Pakistan should continue to seek more diverse markets for our products, while at the same time working with other countries to join multilateral efforts to dissuade the US from staying on this course, which will shrink global trade overall and dampen economic activity moving forward,” he said.\n\nSajid Amin, economist and deputy executive director (res) at Sustainable Development Policy Institute (SDPI), speaking to Dawn.com, noted that immediate impact will be negative, considering the US is the country’s largest trading partner.\n\n“To offset that, Pakistan might have to subsidise local production to become more competitive,” he said. “Somewhere, you would have to cut down on local production costs” of the major exports to the US.\n\n“The challenge will be whether the IMF will allow the country to subsidise,” he highlighted.\n\nHe added that the long-term impact, however, remained uncertain.\n\n“Firstly, you would have to successfully offset the immediate negative impact,” he said.\n\n“Secondly, Pakistan’s tariffs are less than Bangladesh and Vietnam, which can be an opportunity but for that we’d need to be innovative,” he stated, adding that the medium and long-term impact would depend on how the country can offset the immediate negative impact of the tariffs, and how Pakistan can innovate in industries where it has an advantage over other countries hit by tariffs.\n\nOn Pakistan’s retaliatory measures, he stated: “Interestingly, we have imposed a 58pc tariff on the US.\n\n“It’s already quite high — also if you look at Pakistan’s trade-to-GDP, as a trading partner the US might be a major export destination for the country, but for the US, Pakistan stands nowhere.”\n\nHe added that since Pakistan was small trade partner of the US, the significance of the trade relations and volume remained very little. “So, in that sense, the power — or the need — to retaliate is very insignificant, therefore, I don’t think Pakistan will do that,” he added.\n\nOn whether this can push Pakistan towards alternative, he said he did not see the tariffs having that big of an impact, since the US has always been one of the largest trade partners of the country.\n\n“Perhaps the trade volume will be impacted, if we don’t offset the impact, but the trade patterns will remain the same,” he said.\n\nAdil Nakhoda, economist and professor at the Institute of Business Administration Karachi (IBA), told Dawn.com that the country’s exports to US have been limited to textile, which could face the most significant challenges in the short-run.\n\nHe noted the US was the “most important single country destination market for Pakistani exports”, and that he did not see the reciprocals tariffs having an impact of the foreign relations as the US imposed tariffs on all trading partners, albeit at different levels.\n\nOn measures the country could take, he noted that, “Pakistan can consider increasing its exports of textile made-up products to the EU.\n\n“It should strengthen trade relations with other countries regardless of its trading relationship with the US,” he added.\n\n“My take on this is that the countries with larger trade surpluses with the US are being targeted based on the proportion of their trade surplus to total bilateral exports to the US,” he said.\n\n“Pakistan will have to consider sourcing upstream textile products from the US in order to reduce this ratio as well as receive concessions on its exports (products with US content are likely to receive a certain level of tariff concessions).”\n\nKhurram Husain, business and economic journalist, noted that the tariffs imposed would make the ties between the two countries “even more transactional”.\n\nHe also highlighted that alternative markets for the country’s exports would “take a long time to cultivate”.\n\n“At the moment there is no replacement for the US for Pakistani exporters,” he said, adding that the US and the EU remained the most significant markets for the country.\n\n“Pakistan will certainly look to other countries to improve its export performance but it will take a long time to make that transition,” he added.\n\nInterestingly, Husain said that non-textile exports “are going to suffer more”.\n\n“Textile exports will be helped by the fact that tariffs on competitor countries are all higher,” he explained\n\nMaleeha Lodhi, Pakistan’s former ambassador to the US, noted that the country would be affected by Trump’s tariffs, considering the US was a major trade partner.\n\nPakistan’s textile sector, whose majority exports go to the US, will “experience a shock and the low margin categories of textile will be exposed”, Lodhi told Geo News.\n\n“Pakistan will have to see how it adjusts,” she said, adding that the country would have to search for “more markets, and Pakistan will have to see how to make its exports more competitive”.\n\nMichael Kugelman, an expert on Washington’s relations with South Asian nations, noted on X that “textiles (main export for Pakistan and Bangladesh) could be quite impacted” as a result of the new levies.\n\nKugelman observed that the four South Asian nations of India, Pakistan, Bangladesh and Sri Lanka were “already dealing [with] economic stress”.\n\nAccording to Topline Securities, Pakistan’s exports account for 0.16pc of total US imports of $3.36 trillion in 2024.\n\nIt highlighted that countries such as Vietnam, Bangladesh, Sri Lanka and India had shares of 4.2pc, 0.26pc, 0.09pc and 2.7pc.\n\n“Although imports from Pakistan in US makes only 0.16pc of total US Imports, however, the number is quite significant from Pakistan’s perspective,” it stated. “Pakistan exports to US are $6bn annually, 18pc of total exports of the country.”\n\nAdditionally, it said that textile comprises 75 to 80pc of Pakistan’s exports to US.\n\nWhile other exported commodities include leather, surgical goods, rice, cement, steel products, and salt.\n\n“Pakistan’s competitors in textile exports like Vietnam, Bangladesh, and China are also imposed with tariffs of 29-46pc,” it said. “While tariffs on India are at slightly lower rate of 26pc vs. Pakistan’s 29pc.”\n\nThe firm noted that Pakistan largely competed with countries such as China, India, Vietnam, Cambodia, Indonesia, and Bangladesh in textile.\n\nThe duties imposed on China, Cambodia, Indonesia, Vietnam and Bangladesh are higher than Pakistan, while duties imposed on India are 3pc lower.\n\nIt noted that that the textile products that Pakistan exports also exported by India, which has duty advantage now.\n\n“We believe, theoretically, due to Pakistan’s duty disadvantage with India, Pakistan textile exports may face some pressure, however, higher duties on Bangladesh and Vietnam shall provide some respite to Pakistan exports in US,” it said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/03153950431b22a.jpg",
  "retrievedAt": "2025-08-25T13:56:52.561Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901838/economists-see-hurdles-and-opportunities-for-pakistan-as-us-imposes-29pc-tariff-on-country",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T08:53:29.000Z"
}
