{
  "title": "US Secret Service refused to serve summons on Doval - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: A New York court ruled last month that summons were not yet successfully served on India’s National Security Adviser (NSA) Ajit Doval in a case filed by pro-Khalistan separatist lawyer Gurpatwant Singh Pannun, as the Secret Service guarding the official guest house where the Indian official stayed refused to accept them during the Indian prime minister’s visit to Washington in February, The Wire said on Monday.\n\nIt said that on Sept 18 last year, the US District Court for New York issued summons to the government of India and individually to NSA Doval, former RAW chief Samant Goel, former RAW officer Vikram Yadav, and detained Indian national Nikhil Gupta, in a civil suit filed by Pannun.\n\nThe suit was based on an indictment filed by US prosecutors against Nikhil Gupta, accusing him of attempting to hire a hitman to assassinate Pannun on the instru­ctions of then unnamed Delhi-based RAW officer, The Wire said.\n\nA month later, another indictment was unsealed in October which formally named a former R&AW operative Vikash Yadav as the mastermind of the plot. In January this year, the Indian government implicitly accepted the charges by issuing a statement that a high-powered government committee had recommended “legal action” against “an individual”.\n\nOn February 12, the day Narendra Modi was set to arrive in Washington, the US court granted Pannun permission for “alternative service”, allowing the summons to be delivered to any Secret Service agent providing security for Doval during his visit.\n\nMr Doval was accompanying Mr Modi, who was staying at Blair House, the official residence for foreign dignitaries in the United States. It was the first visit by the Indian PM after President Donald Trump started his second term in January. Notably, Mr Doval had skipped the last visit of the Indian PM to the US during former president Joe Biden’s term that took place in the second half of September last year.\n\nFailed attempts\n\nAccording to a Feb 26 letter submitted to the court, Mr Pannun’s legal team detailed multiple failed attempts to serve summons on Mr Doval at Blair House. The first attempt took place on the evening of Feb 12, just an hour after Mr Modi’s scheduled arrival. The letter noted that the process server, Ambiko Wallace, reported that the area was heavily secured, with barricades and a single checkpoint manned by Secret Service agents.\n\nDespite presenting the court order permitting service on security personnel, Mr. Wallace was denied access and instructed to leave. He was also not allowed to speak to a supervisor. “The agent also refused to provide his name or to permit Mr. Wallace to speak to a supervisor. Mr Wallace feared that if he took any further action he would be arrested,” said the letter.\n\nA second process server, Wayne Engram, tried again the next day. At that time, as per the Indian PM’s schedule, Republican leader Vivek Ramaswamy was calling on Mr. Modi at Blair House.\n\nMr Engram was also stopped at the checkpoint by three Secret Service agents who refused to accept the summons, even after he showed them the court order. “Left with no other option, Mr Engram told the agents that he would place the envelope containing the service documents on the ground in front of them – a standard method of service Mr Engram has used many times in his 15 years as a process server. However, one of the agents told Mr. Engram that if he left the documents on the ground, agents would arrest him,” the letter stated.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:57:18.958Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901738/us-secret-service-refused-to-serve-summons-on-doval",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:13:45.000Z"
}
