{
  "title": "Trump’s tariffs stoke global trade war as China, EU hit back - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump’s move to slap a 10 per cent tariff on most goods imported to the United States, as well as much higher levies on dozens of rivals and allies alike, has intensified a global trade war that threatens to stoke inflation and stall growth.\n\nThe sweeping penalties announced against the serene backdrop of the White House Rose Garden on Wednesday immediately unleashed turbulence across world markets and drew condemnation from other leaders now facing the end of an era of trade liberalisation that has shaped the global order for decades.\n\nNow facing 54pc tariffs on exports to the US, the world’s No. 2 economy China vowed countermeasures, as did the European Union — Washington’s friends and foes united in criticism of measures they fear will deal a devastating blow to global trade.\n\nWhat we know so far:\n\nThe US imposed 29pc reciprocal tariffs on Pakistan, which charges the US 58pc, with analysts seeing immediate hurdles but also long-term opportunities for the country.\n\nAs Asia digested the news on Thursday, stock markets in Beijing and Tokyo sank to multi-month lows, with US and European stock futures also pointing to sharp losses as investors scrambled to the safety of bonds and gold.\n\nThe base 10pc tariffs go into effect on April 5 and the higher reciprocal rates on April 9.\n\nChina, faced with a fresh 34pc tariff on top of the 20pc Trump previously imposed, urged the US to immediately cancel its latest levies and vowed countermeasures.\n\nThe US slapped a 26pc tariff on imports from India but exempted pharmaceutical exports, bringing cheer to India’s pharma industry.\n\nUS Treasury chief Scott Bessent urged other nations not to retaliate, moves that could lead to dramatically higher prices for consumers on everything from bicycles to wine. “If you retaliate, that’s how we get escalation,” Bessent told CNN.\n\nClose US allies were not spared Trump’s ire, including the European Union, which faces a 20pc tariff, and Japan, which is targeted for a 24pc rate. Tokyo said it was leaving all options to respond to the “extremely regrettable” duties.\n\nThe “reciprocal” tariffs, Trump said, were a response to duties and other non-tariff barriers put on US goods. He argued that the new levies will boost manufacturing jobs at home.\n\n“For decades, our country has been looted, pillaged, raped and plundered by nations near and far, both friend and foe alike,” Trump said.\n\nOutside economists have warned that tariffs could slow the global economy, raise the risk of recession, and increase living costs for the average US family by thousands of dollars.\n\nEven some fellow Republicans have expressed concern about Trump’s aggressive trade policy.\n\nWithin hours of Wednesday’s announcement, the Senate voted 51-48 to approve legislation that would terminate Trump’s Canadian tariffs, with a handful of Republicans breaking with the president. Passage in the Republican-controlled US House of Representatives, however, was seen as unlikely.\n\nTrump’s top economist, Stephen Miran, told Fox Business on Wednesday that the tariffs would work out well for the US in the long run, even if they cause some initial disruption.\n\n“Are there going to be short-term bumps as a result? Absolutely,” Miran, the chairman of Trump’s Council of Economic Advisors, told the network’s ‘Kudlow’ programme.\n\nThe effective US import tax rate has shot to 22pc under Trump from just 2.5pc in 2024, according to the head of US research at Fitch Ratings.\n\n“That rate was last seen around 1910,” Olu Sonola said in a statement. “This is a game-changer, not only for the US economy but for the global economy. Many countries will likely end up in a recession. You can throw most forecasts out the door if this tariff rate stays on for an extended period of time.”\n\nThe reciprocal tariffs do not apply to certain goods, including copper, pharmaceuticals, semiconductors, lumber, gold, energy and “certain minerals that are not available in the United States”, according to a White House fact sheet.\n\nFollowing his remarks, Trump also signed an order to close a trade loophole used to ship low-value packages — those valued at $800 or less — duty-free from China, known as “de minimis”.\n\nThe order covers goods from China and Hong Kong and will take effect on May 2, according to the White House, which said the move was intended to curb the flow of fentanyl into the US.\n\nChinese chemical makers are the top suppliers of raw materials purchased by Mexico’s cartels to produce the deadly drug, US anti-narcotics officials say.\n\nA Reuters investigation last year showed how traffickers often route these chemicals through the United States by exploiting the de minimis rule. China has repeatedly denied culpability.\n\nTrump is also planning other tariffs targeting semiconductors, pharmaceuticals, and potentially critical minerals, the official said.\n\nTrump’s barrage of penalties has rattled financial markets and businesses that have relied on trading arrangements that have been in place since the middle of last century.\n\nEarlier in the day, the administration said a separate set of tariffs on auto imports that Trump announced last week will take effect starting on Thursday.\n\nTrump previously imposed 25pc duties on steel and aluminum and extended them to nearly $150 billion worth of downstream products.\n\nTariff concerns have already slowed manufacturing activity across the globe, while also spurring sales of autos and other imported products as consumers rush to make purchases before prices rise.\n\nUS Representative Gregory Meeks, the top Democrat on the House Foreign Affairs Committee, said he would introduce legislation to end the tariffs. Such a bill has little chance of passing the Republican-controlled Congress, however.\n\n“Trump just hit Americans with the largest regressive tax hike in modern history — massive tariffs on all imports. His reckless policies are not only crashing markets, they will disproportionately hurt working families,” Meeks said.\n\nChina urged the US to immediately cancel its latest tariffs and vowed countermeasures to safeguard its own interests.\n\nThe US move disregards the balance of interests reached in multilateral trade negotiations over the years and the fact that it has long benefited greatly from international trade, the Chinese Commerce Ministry said in a statement.\n\n“China firmly opposes this and will take countermeasures to safeguard its own rights and interests,” the ministry said, as the world’s largest economies look set to spiral deeper into a trade war that stands to upend global supply chains.\n\nTrump on Wednesday announced China would be hit with a 34pc tariff, on top of the 20pc he previously imposed earlier this year, bringing the total new levies to 54pc and close to the 60pc figure he had threatened while on the campaign trail.\n\nChinese exporters, as with those from every other economy, will face a 10pc baseline tariff, as part of the new 34pc levy, on almost all goods shipped to the world’s largest consumer economy from Saturday before the remaining, higher “reciprocal tariffs” take effect from April 9.\n\nThe 2020 “Phase 1” US-China trade agreement had required China to increase purchases of US exports by $200bn over a two-year period, but Beijing failed to meet its targets when the Covid-19 pandemic struck.\n\nChina bought $153bn in US goods in 2017, before the trade war began, Chinese customs data shows, and that figure rose to $164bn last year.\n\n“China+1” strategies caught on among Chinese exporters and multinational companies that had made the production powerhouse central to their supply chains during Trump’s first term.\n\nTrump’s tariffs could encourage China to step up its trade with alternative markets, but no other country currently comes even close to US consumption power, where Chinese producers sell more than $400 billion worth of goods annually.\n\n“Trump’s tariffs certainly won’t help Chinese firms and will cause some real pain in some sectors, but they don’t make any definitive mark on the Chinese economy,” said William Hurst, Chong Hua Professor of Chinese Development at the University of Cambridge.\n\n“US exports are of declining importance to China. The American tariffs will spur more Chinese trade with other places, from Europe to Southeast Asia and Africa,” he added.\n\nBut Chinese producers have described shifting to alternative markets as a “rat race”, resulting in price wars among exporters that risk fanning deflationary forces in the world’s second-largest economy as firms continue to squeeze shrinking margins.\n\n“Trump and Xi are locked in a paradox of pressure and pride,” said Craig Singleton, senior fellow at Washington-based research institute Foundation for Defence of Democracies.\n\n“Trump’s strategy mixes maximum pressure with sudden diplomatic overtures — he sees leverage and engagement as complementary. Xi, by contrast, is methodical and risk-averse, relying on delay and discipline. But here’s the dilemma: if he refuses to engage, the pressure escalates; if he engages too soon, he risks looking weak,” he added.\n\n“Neither wants to be seen as folding first, but delay could deepen the standoff.”\n\nThe US slapped a 26pc tariff on imports from India in a setback to the country’s expectation of getting relief from Trump’s global trade policy that has unnerved world markets for weeks.\n\nA 10pc baseline tariff starts on Saturday before the higher reciprocal tariff takes effect from April 9. The tariff on India is nearly half of that on China and significantly less than that on Vietnam.\n\n“They (India) are charging us 52pc and we charge almost nothing for years and years and decades,” Trump said at the White House. The relatively lower tariffs imposed on India calmed equity markets.\n\nIndia imposed “uniquely burdensome” non-tariff barriers, the removal of which will increase US exports by at least $5.3bn annually, the White House said.\n\nThe tariffs would remain in effect until Trump determined that the “threat posed by the trade deficit and underlying non-reciprocal treatment is satisfied, resolved, or mitigated,” the statement added. The US has a trade deficit of $46bn with India.\n\nLast week, Reuters reported that New Delhi is open to cutting tariffs on US imports worth $23bn to mitigate the impact on its exports in sectors like gems and jewellery, pharmaceuticals and auto parts.\n\nThe Trump administration, however, exempted pharmaceutical exports from the tariff, bringing cheer to India’s pharma industry. The US accounted for nearly a third of India’s pharmaceutical exports — mainly cheaper versions of popular drugs — with sales of about $9bn last fiscal year.\n\nAsian healthcare stocks surged today, led by Indian generic drugmakers, defying the drop in the broader market after Trump’s wide-ranging reciprocal tariffs.\n\nIndian pharma companies, which rely on the US for a major portion of their revenue, “can breathe easy for now”, Jefferies’ analysts said, but cautioned that tariffs at a later date could not be ruled out.\n\nIndian equity markets are better placed than their Asian counterparts to ride out the impact of the sweeping tariffs, according to strategists at JP Morgan Private Bank and Morgan Stanley.\n\nAustralian Prime Minister Anthony Albanese said Trump’s decision to impose a 10pc tariff on its ally was “not the act of a friend”, but ruled out reciprocal tariffs against the US.\n\nIn comments outside the White House, Trump singled out Australian beef, which saw a surge in exports to the United States last year, reaching A$4 billion amid a slump in US beef production.\n\n“They won’t take any of our beef. They don’t want it because they don’t want it to affect their farmers and you know, I don’t blame them but we’re doing the same thing right now,” Trump said.\n\nAustralia banned US fresh beef products in 2003 due to the detection of bovine spongiform encephalopathy (BSE), otherwise known as mad cow disease, in US cattle. BSE poses a risk to human health and has never been detected in cattle in Australia.\n\nAlbanese said Trump had not banned Australia beef, but had imposed a 10pc duty on all Australian goods entering the US, equivalent to the US baseline tariff on all imports, despite US goods entering Australia tariff-free.\n\n“The (Trump) administration’s tariffs have no basis in logic and they go against the basis of our two nations’ partnership. This is not the act of a friend,” Albanese told reporters.\n\nAustralia would not impose reciprocal tariffs as this would increase prices for Australian households, he added. “We will not join a race to the bottom that leads to higher prices and slower growth,” Albanese said.\n\nAustralian shares dropped 0.9pc and the local dollar AUD=D3, a proxy for global risk sentiment, fell 0.5pc to $0.6269. Australian officials said countries in the Indo-Pacific region were among the hardest hit by the US tariffs, with Albanese suggesting this could advantage China.\n\nAustralia would seek to negotiate with the US to remove the tariffs without resorting to a dispute resolution mechanism in the two countries’ Free Trade Agreement, he said.\n\nNegotiations to avoid a tariff stalled over beef as Australia insisted on US meat imports meeting its biosecurity standards, Albanese said.\n\nAmid the campaign for parliamentary elections set for May 3, opposition Liberal Party leader Peter Dutton criticised Albanese for not winning a tariff exemption, and said Australia should leverage its critical minerals deposits and defence alliance to quickly strike a deal with Trump.\n\n“This is a bad day for our country,” Dutton said.\n\nEuropean leaders reacted with dismay, saying a trade war would hurt consumers and benefit neither side.\n\nEuropean Commission President Ursula Von Der Leyen said: “President Trump’s announcement of universal tariffs on the whole world, including the EU, is a major blow to the world economy.\n\n“Uncertainty will spiral and trigger the rise of further protectionism. The consequences will be dire for millions of people around the globe.”\n\nNoting that the EU was already finalising a “first package of countermeasures in response to tariffs on steel”, Der Leyen announced they were “now preparing for further countermeasures, to protect our interests and our businesses if negotiations fail”.\n\nItaly’s PM Giorgia Meloni said: “We will do everything we can to work towards an agreement with the United States, with the goal of avoiding a trade war that would inevitably weaken the West in favor of other global players.”\n\nGerman Chancellor Olaf Scholz termed Trump’s tariffs decision as “fundamentally wrong”, saying it would harm the entire world economy.\n\n“The recent tariffs decision by the US President is in my view fundamentally wrong and it is an attack on a trade system that has created prosperity all round the world, itself an American achievement,” he told a news conference welcoming Jordan’s King Abdullah to Berlin.\n\n“We want cooperation, not confrontation, and will defend our interests. Europe will respond united, strong and proportionately to this decision.”\n\nFrance’s PM Mançois Bayrou said the introduction of tariffs marks a catastrophe for the world economy.\n\n“It’s an immense difficulty for Europe. I think it’s also a catastrophe for the United States and for US citizens,” Bayrou told reporters after a meeting in the French Senate. His comments were broadcast on BFM TV.\n\nPresident Emmanuel Macron will host a meeting with representatives of business sectors hit by the tariffs at the Elysee palace later in the day.\n\nGreece’s finance minister said the fresh tariffs were a historic shift towards protectionism and a deviation from how the EU sees economic and social progress.\n\n“As a country, we are in favour of free trade,” Kyriakos Pierrakakis said in a statement. “We hope that this chapter will last as little as possible.”\n\nCanada and Mexico, the two largest US trading partners, already face 25pc tariffs on many goods and will not face additional levies from today’s announcement.\n\nTrump is not imposing his new 10pc global tariff rate on Canada and Mexico while his previous order remains in place for up to 25pc tariffs on many goods from the two countries over border control and fentanyl trafficking issues, the White House said in a fact sheet.\n\n“[Trump] has preserved a number of important elements of our relationship, the commercial relationship between Canada and the United States. But the fentanyl tariffs still remain in place, as do the tariffs for steel and aluminum,” noted Canadian Prime Minister Mark Carney.\n\n“We are going to fight these tariffs with counter-measures, we are going to protect our workers, and we are going to build the strongest economy in the G7,” Carney vowed.\n\nMexico’s President Claudia Sheinbaum said Mexico would not pursue a “tit-for-tat on tariffs” but would rather announce a “comprehensive programme” today.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/031110280b4340d.jpg",
  "retrievedAt": "2025-08-25T13:56:56.616Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901810/trumps-tariffs-stoke-global-trade-war-as-china-eu-hit-back",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T03:45:15.000Z"
}
