{
  "title": "Govt committed to addressing political, economic issues of Balochistan: minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJAR KHAN: Minister of State for Railways Bilal Azhar Kiani on Wednesday said political engagement and addressing the grievances of the people of Balochistan through economic empowerment, and countering terrorism are crucial to peace and prosperity in the province.\n\nTalking to Dawn in Jhelum, the minister said that the government was serious about solving the Balochistan issue and restore peace in the resource-rich province.\n\nThe minister said that launching development projects was the hallmark of the Pakistan Muslim League-Nawaz (PML-N), and the government was in talks with the Chinese authorities on the upgradation of the Main-Line 1 (ML-1) project, adding that Pakistan Railways had beefed up the security of trains and more Railway Police personnel were being recruited following the Jaffar Express incident.\n\nMr. Kiani reiterated that there were two parts of the government strategy: one is to counter insurgency in Balochistan, and the second is engaging and activating the local political representatives for a political solution and economic empowerment of the people.\n\nThe minister said that practical steps need to be taken to alleviate the grievances of the Balochistan people, whether they are regarding education, employment, the Benazir Income Support Programme (BISP), or other issues.\n\n“Service delivery has to be done by the Balochistan government, as all of the funds and powers now belong to the province,” the minister said, adding that the prime minister is committed to creating opportunities for youth in the province for their economic empowerment.\n\nWhen questioned about the government’s plan on the ML-1 upgradation project, the minister responded that the project was critical to improving railway infrastructure in the country.\n\n“The government is in talks with the Chinese authorities on ML-1 upgradation project, and the initial package of the Karachi-Hyderabad ML-1 upgradation is ready and will be presented to the Chinese technical team visiting Pakistan soon,” the minister maintained, adding that, “the government is hopeful and making efforts to get the work started on the Karachi-Hyderabad segment during the ongoing year after materializing the deal with China.” Mr Kiani said.\n\nThe project would have been completed, had the PML-N government continued after 2018.\n\nHe expressed optimism that the project would be completed during the tenure of the party. He emphasized that upgrading the ML-1 track was inevitable to ensure safety, enhance predictability, overcome delays, increase speed, and improve overall railway service.\n\nTalking about the Jaffar Express incident last month, the minister said that security of trains in Balochitan had been beefed up, following the incident.\n\nHe said that earlier there used to be 13 security officials boarding the trains, including eight Frontier Corps personnel and five Railway police officials, maintaining that the strength has been increased to 22 following the attack while their communication equipment and weaponry have been improved and security arrangements have been enhanced at railway stations.\n\nThe minister further said that around 500 more personnel were being recruited in Railway Police to make up for any shortage.\n\nThe minister emphasized that the government was making all-out efforts to strengthen the national economy and uproot terrorism. He asserted that some political parties, including the Pakistan Tehreek-i-Insaf (PTI), were involved in malicious anti-state propaganda to damage the economy and armed forces. “Civil and military leaderships are on the same page to eliminate terrorism and would succeed in the mission of maintaining peace in the country,” he added.\n\nTalking about development projects in the Jhelum district, the minister said that the 128-km Lillah-Jhelum dual carriageway was under construction while the Sialkot-Kharian-Rawalpindi motorway project would further boost communication facilities in the region. He said that the Lillah-Jhelum dual carriageway would prove a ‘game-changer’ for the district as it would open new economic opportunities in the region.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67edb1aca2c51.jpg",
  "retrievedAt": "2025-10-12T02:20:30.844Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901707/govt-committed-to-addressing-political-economic-issues-of-balochistan-minister",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:14:25.000Z"
}
