{
  "title": "Gilani designated founding chairman of Inter-Parliamentary Speakers’ Conference - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Senate Chairman Syed Yousuf Raza Gilani has been designated as the founding chairman of the Inter-Parliamentary Speakers’ Conference (ISC), a Seoul-based global forum dedicated to fostering parliamentary dialogue, promoting sustainable development and augmenting cooperation in addressing key challenges such as climate change, renewable energy and water scarcity.\n\nThe decision to the effect was made during Mr Gilani’s recent visit to Kuala Lumpur, Malaysia, where he attended an exclusive briefing session on the forthcoming ISC in Seoul, South Korea.\n\nAccording to a statement, the formal ceremony in this regard will take place during the forthcoming World Summit 2025, sponsored by the Universal Peace Federation (UPF) in Seoul. The summit will be participated by 500 representatives and 45 speakers of parliaments from 150 countries.\n\nIn recognition of his leadership, an award was presented to Senate Chairman Gilani, bearing an inscription that lauds his commitment to building bridges between legislative bodies and advancing a shared global agenda of peace, prosperity and democratic values.\n\nMr Gilani’s Kuala Lumpur visit and his subsequent appointment as the founding chairman of the ISC represents significant milestones in Pakistan’s growing influence on the global parliamentary stage, particularly towards strengthening inter-parliamentary relations, enhancing regional cooperation and advancing shared economic and diplomatic objectives.\n\nEarlier, reflecting on his extensive experience in international relations, including his tenure as Pakistan’s prime minister, the Senate chairman stressed that fostering dialogue, inclusivity and people-to-people connectivity has always been the cornerstone of his political career.\n\nHe highlighted how forums such as the Commonwealth Parliamentary Association (CPA), the Asia Pacific Assembly (APA) and the Inter-Parliamentary Union (IPU) have paved the way for enhanced global cooperation.\n\nAs the founding chairman of the ISC, he called upon parliamentary leaders to transform shared ideals into tangible outcomes.\n\n“Our collective efforts must translate into actionable policies that ensure regional stability, peace, and sustainable development,” he asserted.\n\nSyed Yousuf Raza Gilani also underlined the ISC’s critical role in addressing not only domestic challenges but also in fostering innovative parliamentary solutions for issues on the Korean peninsula and beyond. His address at the conference was well received, emphasising Pakistan’s commitment to regional peace, economic stability and global legislative cooperation.\n\nIn another related development, the Senate chairman also held high-level discussions with Speaker of the House of Representatives of Malaysia and incumbent President of Asean Tan Sri Dato’ (Dr) Johari bin Abdul.\n\nDuring the meeting with Tan Sri Dato’ (Dr) Johari bin Abdul, Mr Gilani praised and acknowledged the fraternal and close bilateral and inter-parliamentary relations and connectivity between the two brotherly countries.\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:57:07.864Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901703/gilani-designated-founding-chairman-of-inter-parliamentary-speakers-conference",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:14:25.000Z"
}
