{
  "title": "What are tariffs and how do they work? - Business - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Wednesday announced a universal “baseline” 10 per cent tariff on imports into the US, on what he has dubbed “Liberation Day”.\n\nHe pinned the tax hikes as a blow against unfair trade practices, painting a portrait of the US as a country exploited by even its closest allies, according to Al Jazeera.\n\nDescribing April 2, 2025 as “our declaration of America’s economic independence”, he said “reciprocal tariffs” would start at that baseline, although 60 countries would be hit with far higher rates of up to 50pc, BBC reported.\n\n“Tariff”, Trump has been quoted saying many times, “is the most beautiful word in the dictionary.”\n\nTariffs are typically charged as a percentage of the price a buyer pays a foreign seller. In the United States, tariffs are collected by Customs and Border Protection agents at 328 ports of entry across the country, the Associated Press’s Paul Wiseman writes.\n\nAccording to BBC’s Adam Fleming, “Normally tariffs are used as a tool to manage trade, if you have got a home grown industry and you are worried that it is facing competition from cheap exports from abroad then you can put a tariff on to level the prices of products.\n\nTypically, tariffs are a percentage of a product’s value. For example, a 25pc tariff on a $10 product would mean an additional $2.50 charge, BBC explains.\n\nUsually, US tariff rates vary across products, for example, 2.5pc on passenger cars and 6pc on golf shoes.\n\nTariffs can be lower for countries with which the United States has trade agreements.\n\nBefore the US began imposing 25pc tariffs on good from Canada and Mexico as of Tuesday, most goods moved between the United States and those countries tariff-free because of President Donald Trump’s US-Mexico-Canada trade agreement.\n\nWith the current tariff laws, US “importers — American companies — pay tariffs, and the money goes to the US Treasury”, AP reported.\n\nThe companies in return “typically pass their higher costs on to their customers in the form of higher prices”.\n\nTrump argues that even though the prices for consumers could go up, the tax hikes — which make foreign goods more expensive — will help US manufacturers and protect jobs.\n\nHowever, AP‘s Wiseman noted that if we look at the past — eg Trump’s 2018 taxes on imported steel — the number of jobs at US steel plants barely budged: they remained right around 140,000.\n\nEven though Trump announced baseline 10pc tariffs on imports from all countries, nations including Cambodia, Vietnam, Malaysia and Bangladesh will be hit much harder, with tariffs reaching 50pc in some cases, BBC reported.\n\nUK goods will be hit by a 10pc tariff, while those from the 27-member EU bloc by 20pc.\n\nThe baseline 10pc tariff will kick in on April 5 12:01am EST (9:01am PKT), while higher rates starting from 12:01am EST (9:01am PKT) on April 9.\n\nTrump has previously announced a 25pc tariff on all foreign-made cars coming into the US, which takes effect at midnight EST (9am PKT) April 3.\n\nLast month, he had unveiled a 25pc tariff on all steel and aluminium imports.\n\nThe US president had also doubled to 20pc a tariff on Chinese goods, slapped 25pc on goods from Mexico and Canada, and a 10pc tariff on Canadian energy imports.\n\nBy raising the price of imports, tariffs can protect home-grown manufacturers. They may also serve to punish foreign countries for unfair trade practices such as subsidising their exporters or dumping products at unfairly low prices.\n\n“What Donald Trump is doing is different. He is using tariffs as a tool. He is wielding it like a weapon or a threat to in negotiations to get other things,” said BBC’s Fleming.\n\nAccording to the AP report, Trump used the threat of tariffs in 2019 as leverage to persuade Mexico to crack down on waves of Central American migrants crossing Mexican territory as they entered the US.\n\nIt observed that the US president “even sees tariffs as a way to prevent wars”.\n\n“I can do it with a phone call,’’ AP quoted Trump as saying at a North Carolina rally in August 2024.\n\nIf another country tries to start a war, Trump said he would issue a threat: “We’re going to charge you 100pc tariffs. And all of a sudden, the president or prime minister or dictator or whoever the hell is running the country says to me, ‘Sir, we won’t go to war.’”\n\nHeader image: A 3D-printed miniature model of US President Donald Trump, the US flag and the word “tariffs” are seen in this illustration taken on April 2, 2025. — Reuters/Dado Ruvic/Illustration",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0312573854c1378.jpg",
  "retrievedAt": "2025-08-25T13:56:51.976Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901829/what-are-tariffs-and-how-do-they-work",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T07:47:04.000Z"
}
