{
  "title": "Australia’s new Olympic chief hopes to use 2032 in battle for talent - Sport - DAWN.COM",
  "author": null,
  "content": "MELBOURNE: Inco­ming Australian Olympic Comm­ittee (AOC) chief Mark Arbib hopes the 2032 Brisbane Games will persuade the nation’s talented young athletes to pursue medals over football careers.\n\nAustralian Rules football and rugby league have long dominated the country’s professional sports market, offering the kind of salaries and support to young athletes that Olympic sports struggle to match.\n\nArbib, confirmed on Wednesday as the replacement for outgoing Chief Executive Matt Carroll, said the AOC needed to compete hard against the National Rugby League (NRL) and the Australian Football League (AFL) to lure talent.\n\n“I am a big fan of the NRL and a big fan of the AFL, I love those sports,” he told reporters in Sydney. “They are absolute commercial giants, they are juggernauts.\n\n“And we need to ensure that we are on a playing field and that we are fighting for every dollar and for every athlete. Because they are working very hard and they have been very successful in what they are doing.\n\n“For me, that is one of the greatest challenges … fighting for athlete talent. Brisbane is the best way for us to leverage that.”\n\nA long-serving AOC board member and former federal sports minister, Arbib has held various roles in sports administration, including posts at the World Anti-Doping Agency and directorships at professional sports clubs such as NRL team South Sydney and A-League soccer team Sydney FC.\n\nOne of the 53-year-old’s priorities will be securing more government funding to support Olympic athletes and ensure Australia builds on its record haul of 18 gold medals at the Paris Games.\n\nWith 13 of those golds won in women’s events, Arbib said the AOC were concerned about potential Olympians being lost to the women’s competitions set up by the AFL and NRL in the past decade.\n\n“Their women’s competitions are extremely successful, so we are competing for talent now in the women’s sports space,” said Arbib. “And what I don’t want to see is that impacting upon our results.\n\n“We need to ensure we are inspiring kids to join us to become Olympic swimmers, to become Olympic athletes — that is the dream.”\n\nPublished in Dawn, April 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/031110045866e10.jpg",
  "retrievedAt": "2025-08-25T13:57:19.735Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901748/australias-new-olympic-chief-hopes-to-use-2032-in-battle-for-talent",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T02:13:16.000Z"
}
