{
  "title": "CRTF to fill human resource gap in administrative affairs: Usman Dar",
  "link": "https://www.app.com.pk/national/crtf-to-fill-human-resource-gap-in-administrative-affairs-usman-dar/",
  "date_published": "2020-10-16T07:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP):Special Assistant to the Prime Minister on Youth Affairs Usman Dar Friday said Corona Relief Tiger Force (CRTF) was working as a facilitator to fill the gap of human resource in administrative affairs.\nAddressing to a press conference here, the SAPM said Prime Minister Imran Khan will give future course of action to the CRTF in controlling artificial inflation in the country at a ceremony held at convention centre tomorrow (Saturday).\nUsman Dar said development of youth was top priority of the present government and the Prime Minister has provided opportunities to the youth in national level activities.\nThe SAPM said the government had developed a portal to facilitate the CRTF volunteers, enabling them to report the hoarding, artificial price hike and non-display of the official rate lists in markets of their respective union councils through Geo-tagging technology.\nThe government had conducted a successful test-run of the portal—tigerforce.gov.pk—that will also be launched tomorrow , he said, adding that CRTF volunteers had started registering themselves on the website.\nHe said the members of tiger force, during the pandemic’s peak time, had made tremendous efforts to ensure implementation of the anti-coronavirus standard operating procedures (SOPs) such as social distancing and ‘No Mask No Service’ campaign at hospitals, utility stores, mosques and Ehsaas Emergency Cash Centers.\nDar regretted that the opposition was targeting the volunteers, who exhibited great responsibility and performed various tasks without any greed and monetary gains during the trying times.\n“Tiger force is a name of an ideology as its members came forward with a national spirit and the sense of duty,” Dar remarked.\nHe assured the traders that the CRTF members would only be deputed for identifying the hoarding and price hike. “The traders should not be wary of their deployment, if they are running their businesses in transparent manners.” he said.\nHe said anti-coronavirus guidelines were issued for the CRTF convention, and volunteers were asked to wear face mask and gloves and observe physical distancing during the function.\nThe volunteers were informed to bring their identification cards with them for attending the convention.\nThe tiger force was formed in March following Covid-19 outbreak in the country to aid the civil administration in carrying out coronavirus related activities.\nLater on, it was assigned additional duties related to tree plantation, anti-dengue and anti-polio campaigns, locust surveillance, traffic management, flood prevention and control and other issues that require more human resources.",
  "retrievedAt": "2025-08-11T19:54:39.950Z"
}
