{
  "title": "Past governments provided unfunded subsidies; Senate told",
  "link": "https://www.app.com.pk/national/past-governments-provided-unfunded-subsidies-senate-told/",
  "date_published": "2020-10-16T10:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): Federal Minister for Industries and Production Hammad Azhar on Friday informed the Senate that the past governments had provided unfunded subsidies without any proper budgetary allocation.\nReplying to a question in the Senate, the minister said that the present government was efficiently working to improve the economic condition of the country and the IMF programme was being implemented for economic stability.\nIn a written reply to a question, Minister for Finance and Revenue said that the government was implementing a home-grown economic reforms programme with the support of the IMF. The reforms aimed to stabilize the country’s economy by addressing deep-seated structural imbalances and lay the foundation for sustained and inclusive growth, he added.\nHe said these measures were largely directed towards achieving fiscal consolidation, reducing external sector vulnerabilities, broadening of tax base, improving the country’s competitiveness, reforming and improving governance in state-owned enterprises, strengthening the anti-money laundering and terror financing regimes, addressing energy sector imbalances and strengthening the autonomy of the State Bank of Pakistan. One major component of reforms was to ensure social protection for the poorer sections of the society, he added.\nHe said that the markup of IMF loans varied according to the SDR interest rate, which was calculated every week, and the level of utilization of its quota by a member country.\nAt present, the markup was 4.05 percent (as of 10th August, 2020) while repayments of ongoing IMF programme will start from 2024 and will continue up to 2032, he added.\nHe said that the details of the agreement with the IMF were also available on IMF’s website. The government was undertaking reforms with the support of the World Bank and the Asian Development Bank to improve fiscal management and trade competitiveness, address energy sector deficiencies and develop the financial markets of the country, he added.\nHe said that the government had made 21 agreements with the World Bank, 22 with Asian Development Bank, 11 with Islamic Development Bank and four with Asian Infrastructure Investment Bank.",
  "retrievedAt": "2025-08-11T19:54:38.766Z"
}
