{
  "title": "Pakistan’s future economic, strategic prospects closely tied to Middle East: Foreign Secy",
  "link": "https://www.app.com.pk/national/pakistans-future-economic-strategic-prospects-closely-tied-to-middle-east-foreign-secy/",
  "date_published": "2020-10-16T11:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): Foreign Secretary Sohail Mahmood has said that Pakistan’s future economic and strategic prospects are closely tied with Middle East, stressing need for an in-depth research and enhanced understanding to fully capitalize the potential.\nThe Foreign Secretary expressed these views at the inauguration of Center for Middle East and Africa (CMEA) here at the Institute of Strategic Studies Islamabad (ISSI) on Thursday.\nThe Foreign Secretary emphasized the political, economic and strategic importance of the Middle East and Africa.\nRecalling Pakistan’s warm and cordial ties with the countries of the region, the Foreign Secretary reaffirmed Pakistan’s keen desire to further enhance bilateral ties by deepening and diversifying areas of cooperation.\nThe Foreign Secretary highlighted the strong bonds of amity with the countries in the Middle East which were rooted in shared religion, culture and values.\nHe appreciated how Pakistan and the countries in the Middle East stood shoulder-to-shoulder on many important occasions in history.\nHe lauded the contributions of more than four million Pakistani expatriates currently residing in the Middle East region, working diligently for the development of the host countries and for the progress of their own country.\nThe Foreign Secretary said that Africa and Pakistan shared common history of successful struggle against colonialism and faced similar developmental challenges – both of which could form a strong foundation for enhanced cooperation.\nHe apprised the participants of Pakistan’s “Engage Africa” Initiative, aimed at further deepening and broadening the scope of Pakistan’s diplomatic, political and economic engagement with the Continent.\nAcknowledging the rapid changes in the two regions, the Foreign Secretary emphasized the need to invest energy and effort in developing a better understanding of the regional dynamics.\nIn this regard, he congratulated the ISSI for taking the important step in establishing the Center for Middle East and Africa.\nThe Foreign Secretary hoped that the newly-established Center would contribute to better understanding of the transformations taking place in the two regions and help build stronger partnerships.\nDirector General ISSI Ambassador Aizaz Ahmed Chaudhry, High Commissioner of Kenya to Pakistan Julius Bitok and Director CMEA Amina Khan also spoke on the occasion.",
  "retrievedAt": "2025-08-11T19:54:38.074Z"
}
