{
  "title": "Corrupt elements targetting PM, just to save plundered wealth: Shibli",
  "link": "https://www.app.com.pk/national/corrupt-elements-targetting-pm-just-to-save-plundered-wealth-shibli/",
  "date_published": "2020-10-16T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): Minister for Information and Broadcasting Senator Shibli Faraz on Friday said the opposition got together to save its corruption and looted wealth and the corrupt elements were targetting the upright and honest leadership of the country.\nSpeaking in the Senate, he said the opposition got together under the banner of Pakistan Democratic Movement to bring back the period of price hikes and weakening of institutions and economy.\nHe said the opposition Senators gave the impression that they had never been in the government.\nThese Senators forgot that they were in the government for a long time, he said adding the opposition’s approach was not democratic but dictatorial as it did not strengthen the\ninstitutions.\nPrime Minister Imran Khan smashed the stranglehold of opposition on power with his struggle of 22 years, he added.\nThe minister said when the opposition was in power it did not give respect to the vote but it preferred amassing wealth. The opposition leaders looted national wealth and lied on the floor of the House, he added.\nHe said those who damaged the national institutions, had now become champions of democracy and added, the opposition after ruling for decades, was raising hue and cry\nabout the economy.\nThe nation was aware of the people who had now become ideological to serve their own interests, he noted.\nHe said the Punjab government had arranged for sanitizers and masks for the opposition.\nThe Punjab government should also give them handkerchiefs so that they could hide their faces as they levelled allegations against each other, termed each other liars and filed cases in the past.\nThe minister stressed that the government was determined for strengthening of institutions and progress of the country. The resolve of Prime Minister Imran Khan could not be weakened as he would free the nation from the clutches of looters, he added.\nHe held the wrong policies of opposition responsible for the price hikes and inflation and said now the opposition was expecting from the government to resolve in two years the issues that lingered for the last 40 years.\nAll efforts to put pressure on the government would fail, he said adding the opposition had double standards as when verdicts were delivered by the courts in favour, it was right, otherwise wrong and flawed.\nHe said the opposition exerted pressure on the government on the issue of Financial Action Task Force (FATF) linked legislation. Opposition wanted its own definition of corruption in the law of National Accountability Bureau (NAB).\nHe assured that the good times were ahead and said opposition gathered to save wealth of two family limited companies which were shouting after losing elections.\nHe said his party Pakistan Tehreek i Insaf lost 16 seats in the last elections with less than few hundreds votes.\nHe said opposition did not file petitions in the Election Commission, adding the son of Malauna Fazlur Rehman won the election while he himself contested election of the President from the same Parliament.\nShibli said he challenged the opposition to fill the Jinnah stadium in Gujranwala but it failed and turned half the stadium into a stage.",
  "retrievedAt": "2025-08-11T19:54:38.072Z"
}
