{
  "article_id": "2025-08-05_8051e498da24cf30216d068715b7903f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-rubina-khalid-expresses-solidarity-with-kashmiris-on-youm-e-istehsal/",
    "retrieved_at": "2025-08-10T10:17:50.827Z"
  },
  "metadata": {
    "title": "Senator Rubina Khalid expresses solidarity with Kashmiris on Youm-e-Istehsal",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 301,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP):Chairperson of the Benazir Income Support Programme (BISP), Senator Rubina Khalid has expressed unwavering solidarity with the oppressed people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) on the occasion of Youm-e-Istehsal, marking six years since India's illegal and unilateral revocation of the region's special constitutional status. In her statement, Senator Rubina Khalid said that on August 5, 2019, India abrogated Article 370 and 35A of its constitution, in a blatant violation of international laws and UN Security Council resolutions. \"This move was aimed at altering the disputed status of Jammu and Kashmir and undermining the Kashmiri people's inalienable right to self-determination,\" she said. She condemned India's continued attempts to change the demographic structure and political landscape of the region through measures such as arbitrary delimitation, inclusion of non-Kashmiris in electoral rolls, and issuance of domicile certificates to outsiders. Senator Rubina Khalid noted that since the revocation, repression in IIOJK has intensified. \"Kashmiris have been subjected to surveillance, curfews, unlawful detentions, and severe restrictions on their freedom of expression. Local media has been silenced and the Kashmiri people are being rendered powerless in their own homeland,\" she said. She emphasized that this year's Youm-e-Istehsal carries exceptional importance in view of India's relentless aggression and grave human rights abuses in the occupied territory. Reiterating Pakistan's firm stance, the BISP Chairperson said, \"A just and lasting solution to the Jammu and Kashmir dispute in accordance with UN Security Council resolutions is vital for sustainable peace in South Asia. Pakistan will continue to extend its political, diplomatic, and moral support to the Kashmiri people until they achieve their legitimate rights.\" Senator Rubina Khalid also lauded the success of \"Operation Bunyan-ul-Marsous,\" calling it a source of national pride and a reflection of Pakistan's commitment to justice and the support of oppressed nations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}