{
  "article_id": "2025-08-05_b5266a121bc9c4c94f9dc0e9c12f1687",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/human-rights-councils-youm-e-istehsal-kashmir-not-a-mere-symbolic-day-but-a-continuous-call-for-global-protest/",
    "retrieved_at": "2025-08-10T10:15:30.831Z"
  },
  "metadata": {
    "title": "Human Rights Councilâs Youm-e-Istehsal Kashmir: not a mere symbolic day, but a continuous call for global protest",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 318,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP): The Human Rights Council of Pakistan Tuesday organized a purposeful and impactful conference at the National Library of Pakistan to mark Youm-e-Istehsal-e-Kashmir (Kashmir Exploitation Day), shedding light on the constitutional assault, human rights violations, and global silence over the plight of the Kashmiri people. Themed aYoum-e-Istehsal-e-Kashmir a Constitutional Attack, Human Rights Violations, and Global Conscience in Silence,a the conference aimed to highlight the grave political and humanitarian crisis in Indian Illegally Occupied Jammu and Kashmir (IIOJK) following the abrogation of Articles 370 and 35A by the Indian government on August 5, 2019, which stripped the region of its special constitutional status. Prominent Hurriyat leader Sheikh Abdul Mateen was among the keynote speakers, paying tribute to the sacrifices, resilience, and unwavering struggle of the Kashmiri people. Muhammad Tauqeer Khan, journalist and former president of Khoi Ratta Press Club as well as Central Secretary General of AJK Electronic Media, addressed the gathering on the mediaas role in amplifying the voices of oppressed Kashmiris, stressing the need for objective and persistent coverage. Renowned poet Kashif Kamal moved the audience with a heart-touching poem dedicated to Kashmir, evoking deep emotions. Executive Member of the Human Rights Council, Advocate Hammad Abbasi of the Supreme Court, gave a detailed presentation on the constitutional and international dimensions of the Kashmir dispute, calling for urgent intervention. The event was ably moderated by Nisar Ahmed, who ensured the smooth flow of proceedings. Speakers emphasized that Youm-e-Istehsal is not merely a symbolic day, but part of a sustained effort to amplify the voices of Kashmiris worldwide. They expressed grave concern over the United Nations and international communityas silence and demanded the immediate granting of the right to self-determination to the Kashmiri people. aYoum-e-Istehsal is not a symbolic day; it is a continuous call for global protest,a a resolution at the conference declared. aKashmir will become Pakistan a but with justice, democracy, and human values!a",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}