{
  "article_id": "2025-08-05_1675344834f180f3c5a60bd750ae015d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/zamurad-khan-strongly-reaffirmed-pakistans-commitment-to-kashmir-cause/",
    "retrieved_at": "2025-08-10T10:17:28.500Z"
  },
  "metadata": {
    "title": "Zamurrad Khan strongly reaffirmed Pakistan’s commitment to Kashmir cause",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 222,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP):Chairman, Pakistan Sweet Homes, Zamurrad Khan on Tuesday, strongly reaffirmed Pakistan's commitment to the Kashmir cause, Yom-e-Istihsal: \"India's Pride Shattered with Rafale's Downing - Kashmir Near to Freedom\". Addressing a special gathering on Yom-e-Istihsal, renowned political and social leader Zamurrad Khan strongly reaffirmed Pakistan's commitment to the Kashmir cause and hailed recent symbolic victories in the struggle against Indian oppression. In a passionate speech, Zamurrad Khan stated, \"Kashmir is near to achieve its freedom,\" highlighting the resilience of the Kashmiri people despite years of brutal occupation. Referring to the spirit of Bunyanum-Marsoos , he praised the strategic unity and strength of the Pakistani nation and its armed forces in standing shoulder to shoulder with Kashmiris. He further declared, \"India's pride was shattered with the downing of the Rafale,\" referring to the symbolic blow dealt to India's military superiority narrative. While official details on any Rafale incident remain unconfirmed, the statement drew attention and applause for representing the sentiment of resistance and defiance. \"Pakistan's flag flew with pride,\" Khan added, \"and victories are being discussed across the country - because truth and justice are on Kashmir's side.\" Zamurrad Khan's remarks echoed the collective national sentiment on Yom-e-Istihsal, marking six years since India's unilateral revocation of Article 370, which stripped Jammu & Kashmir of its special status under the Indian Constitution.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}