{
  "article_id": "2025-08-05_1a9daa205e9805b476afc81f432ed498",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistani-students-win-4-medals-at-international-nuclear-science-olympiad/",
    "retrieved_at": "2025-08-10T10:15:32.446Z"
  },
  "metadata": {
    "title": "Pakistani students win 4 medals at International Nuclear Science Olympiad",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP): Pakistani students have brought pride to the nation by winning four medals at the 2nd International Nuclear Science Olympiad (INSO-2025) held in Malaysia.Nuclear safety trainingNuclear education The achievement includes one Gold, one Silver, and two Bronze medals, showcasing the exceptional talent and potential of the country's youth in the field of nuclear science. The event, held from July 30 to August 5 under the auspices of the International Atomic Energy Agency (IAEA), featured participants from 19 countries including China, Japan, Singapore, Malaysia, Indonesia, Turkiye, Thailand, Sri Lanka, Saudi Arabia, and Qatar. Representing Pakistan, Muhammad Tayyab Bukhari of Beaconhouse School Abbottabad won the Gold Medal, while Ammar Asad Warraich of Siddique Public School Islamabad claimed Silver. Rawah Javed, also from Siddique Public School, and Tatheer Aima Naqvi from Chenab College Jhang, earned Bronze Medals. The team was mentored by Dr. Sajjad Tahir from the Pakistan Institute of Engineering and Applied Sciences (PIEAS) and Dr. Muhammad Maqsood from the Directorate of Education, Pakistan Atomic Energy Commission (PAEC). This success reflects the strong foundation being laid by institutions like PIEAS and PAEC to nurture future scientists. It also highlights Pakistan's growing presence in global scientific forums and the country's commitment to promoting nuclear science for peaceful purposes across education, agriculture, medicine, and industry.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}