{
  "article_id": "2025-08-05_f7ebe800da52ec6f00f83bf2d5fd02be",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/youm-e-istehsal-observed-across-globe-events-highlight-indias-2019-illegitimate-actions-2/",
    "retrieved_at": "2025-08-10T10:33:26.917Z"
  },
  "metadata": {
    "title": "Youm- e- Istehsal observed across globe; events highlight Indiaâs 2019 illegitimate actions",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 661,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP): Pakistan missions and embassies in various capitals of the world, Tuesday, observed Youm-e-Istehsal-Kashmir to mark the 6th anniversary of Indiaas continued illegal actions of 5th August 2019, in which a large number of Pakistani diaspora and Kashmiris participated. The messages of President of Pakistan Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif and were read out during these events and special documentaries highlighting atrocities of Indian Government in IIOJK were also screened. Pakistan embassy in Abu Dhabi, United Arab Emirates observed the day to highlight Indiaas illegal steps aimed at altering the internationally recognized disputed status of the Indian Illegally Occupied Jammu & Kashmir (IIOJK). In his statement, Charge daaffaires Qasim Aziz highlighted the importance of observance of the Youm-e-Istehsal and recalled Indiaas brutality in IIOJK resulting in violation of fundamental rights of the Kashmiri people. He referred to illegal actions of 5 August 2019 as a blatant violation of international law including the UN Charter and UN Security Council Resolutions. He emphasized the need of international communityas active role in resolving the Jammu & Kashmir dispute in line with aspirations of Kashmiri people and pursuant to the UNSC Resolutions. He also reaffirmed Pakistanas resolve to extend political, diplomatic and moral support to Kashmiri people in their just struggle for realization of their inalienable right to self-determination. Embassy of Pakistan, Tehran organized an event to denounce the abrogation of article 35 A and 370 of the constitution that guarantee special autonomous status for Jammu & Kashmir by Indian Government on 5th August 2019 which aimed at changing demography in illegally Indian Occupied Jammu & Kashmir (IIOJK). The event was attended by Pakistani nationals, students and media representative in large number. Prominent Iranian scholars Dr. Qasim Safi and Samaneh Khalafzadeh while addressing the audience highlighted the struggle of Kashmiris for their independence and right of self-determination. They also appreciated the role of Pakistan and its leadership to support the Kashmir cause at every forum and raising the voice against human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK). On the occasion, Deputy Head of Mission Ismat Hassan Sial mentioned that Iranian leadership has also given a great regard to struggle in Kashmir and at multiple times called upon the world community to break its silence on the human rights violations in Jammu & Kashmir. In her remarks, she said that Kashmiris were subjected to barbarism of Indian forces since October 1947. The Indian security forces have maimed, executed, murdered, blinded, raped, and suffocated the innocent Kashmiris. aPakistan has always been calling upon world leaders, international community including the United Nations, and all Human rights organizations to urge India to halt the brutal use of force against the people of Kashmir and resolve the issue diplomatically under the charter of the United Nations Security Council,a she added. A minute of silence was observed by Pakistan Embassy in Egypt by the Ambassador, embassy Officials earlier on Youm e Estehsal to honour the relentless sacrifices of valiant Kashmiri people for the realization of their inalienable right to self-determination. Pakistan Embassy in Jordan organized a seminar to mark Youm-e-Istehsal (Day of Exploitation,Kashmir), highlighting the ongoing oppression in Indian Illegally Occupied Jammu & Kashmir (IIOJK). The event was attended by distinguished members of the academia, think tanks, media, and other notables from Jordan. Speakers strongly condemned the atrocities committed by Indian occupation forces in IIOJK and emphasized the urgent need to resolve the Kashmir dispute in accordance with the UN Security Council resolutions and the aspirations of the Kashmiri people. High Commissioner Malik Farooq attended the Youm-e-Ishtehsal event in Cape Town organized by PASA Official. He highlighted Indian atrocities in IIOJK & reaffirmed as support for Kashmirisa right to self-determination. Ganief Hendricks, Khalid Syed & local MPs also joined. The Embassy of Pakistan in Tokyo observed the sixth anniversary of Youm-e-Istehsal. On this occasion, the embassy also organized a photographic exhibition to highlight the human rights situation in IIOK. MORE/irf",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}