{
  "article_id": "2025-08-05_ea984584adcf7f127dab94dbf664f83d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ncsw-calls-for-stronger-dowry-law-to-end-symbolic-justice/",
    "retrieved_at": "2025-08-10T10:17:36.915Z"
  },
  "metadata": {
    "title": "NCSW calls for stronger dowry law to end 'symbolic' justice",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 450,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP):The National Commission on the Status of Women (NCSW) has renewed its call for comprehensive reforms to Pakistan's decades-old dowry law, urging lawmakers and enforcement agencies to move beyond symbolic measures and take decisive action against the harmful tradition. At the second national consultation on the Dowry and Bridal Gifts (Restriction) Act, 1976, held here, the Commission stressed that without serious legal amendments and effective implementation, the law will continue to fail the very women it was meant to protect. The session was part of a broader effort to reform family laws in Pakistan under the directives of the Prime Minister and the National Assembly's Gender Mainstreaming Sub-Committee. Chaired by NCSW Chairperson Ume Laila Azhar, the focused session brought together stakeholders from key federal ministries and departments to examine the 1976 Act in detail. The review covered definitions of dowry and bridal gifts, monetary and non-monetary restrictions under the law, legal avenues for lodging complaints, and enforcement challenges. \"The harmful practice of dowry remains a deeply entrenched form of gender-based violence and economic injustice in Pakistan,\" said Azhar. \"While the Act aimed to curb these practices, it has unfortunately lacked effective implementation.\" She stressed the urgency of updating the law to reflect contemporary social realities and align with international human rights standards. \"We strongly urge all stakeholders, particularly legislative and enforcement bodies, to ensure strict adherence to the proposed amendments. This law must become a tool for real transformation, not remain symbolic,\" she added. The Dowry and Bridal Gifts (Restriction) Act, introduced nearly five decades ago, was originally intended to restrict excessive demands made at the time of marriage. However, critics have long argued that the law has been poorly enforced, with many families continuing to suffer under the economic and social pressures of traditional dowry practices. During the session, participants pointed out several gaps in the Act's current implementation. Key concerns included vague definitions, lack of legal clarity on permissible gift limits, and limited public awareness about how to report violations. The consultation concluded with a call for written feedback from stakeholders to inform the next stage of legal reform. The NCSW emphasized the importance of evidence-based, practical amendments that can lead to meaningful change in the lives of women and girls. This initiative follows a renewed government commitment to review discriminatory laws and advance gender equality, as outlined in the NCSW's mandate under the NCSW Act, 2012. The reform process is expected to continue through a series of national consultations, leading to a formal draft of amendments to be presented to the legislature. If passed, the updated law could significantly impact the prevalence of dowry-related violence and economic coercion, particularly in rural and marginalized communities.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}