{
  "article_id": "2025-08-05_8245e16a2d9abcb9dba191be7c20668e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dar-reaffirms-pakistans-complete-support-for-kashmiri-people/",
    "retrieved_at": "2025-08-10T10:33:18.244Z"
  },
  "metadata": {
    "title": "Dar reaffirms Pakistan’s complete support for Kashmiri people",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 361,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 5 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Tuesday reaffirmed Pakistan's complete moral, diplomatic and political support to the Kashmiri people's just struggle for realisation of their inalienable right to self-determination. \"On this day, six years ago, India took a number of unilateral and illegal actions vis-a-vis Indian Illegally Occupied Jammu and Kashmir (IIOJK). These measures were aimed at undermining the internationally recognised disputed status of the territory and consolidating the Indian occupation,\" the deputy PM said in his message on 'Youm-e-Istehsal'. He said India has introduced a number of laws aimed at changing the demographic structure and political landscape of IIOJK since 5 August 2019. \"Issuing domicile certificates to outsiders, registering temporary residents in the voters' lists, gerrymandering of the Assembly constituencies, modification of land and property ownership laws,and according greater administrative powers to the so-called Lieutenant Governor are some key measures which have been introduced in that connection. Clearly, all these actions are in blatant violation of the UN Charter, United Nations Security Council resolutions, and international law, including the 4th Geneva Convention.\" Ishaq Dar noted that in the continued presence of hundreds of thousands of Indian troops, IIOJK remains one of the highly militarised zones in the world. Thousands of Kashmiri political prisoners have been languishing in jails for years. The mistreatment of Kashmiri journalists and human rights defenders has further revealed India's willingness to go to any lengths to silence the dissenting voices. The massive crackdown, launched in the aftermath of the Pahalgam Attack, demonstrated that India still treats IIOJK as a colony. He said the recent hostilities between Pakistan and India have once again highlighted the urgent need for a peaceful settlement of the Jammu and Kashmir dispute, in accordance with the relevant UN resolutions and wishes of the Kashmiri people, for the sake of a durable peace in South Asia. \"The Kashmiris have waited for the United Nations to fulfil its solemn commitments for the past seven decades. It is the need of the hour that the international community urges India to end its human rights violations in IIOJK, and implement the relevant UN Security Council resolutions,\" he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}