{
  "article_id": "2025-08-05_cbb4cb1a22ca2f9de135d6267f29cdef",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/outgoing-head-of-european-delegation-to-pakistan-calls-on-president-zardari/",
    "retrieved_at": "2025-08-10T10:33:20.757Z"
  },
  "metadata": {
    "title": "Outgoing head of European delegation to Pakistan calls on President Zardari",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 198,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 5 (APP): The outgoing Head of the European Union Delegation to Pakistan, Dr. Riina Kionka Tuesday paid a farewell call on President Asif Ali Zardari at Aiwan-e-Sadr. Welcoming Dr. Kionka, the president said that Pakistan attached great importance to its multidimensional partnership with the European Union. He observed that a strong Pakistan-EU relationship contributed to regional stability and global security in a volatile world. President Zardari highlighted that the European Union was one of Pakistan's largest trade and investment partners. He said there was vast potential to further expand development cooperation with the EU, given Pakistan's large young population and significant industrial growth prospects. The president also expressed hope that Pakistan would continue to benefit from European expertise through programs such as Erasmus Mundus and Horizon Europe. He reaffirmed Pakistan's commitment to the full implementation of the Pakistan-EU Strategic Engagement Plan, underscoring that shared objectives in trade, development, climate ,migration and regional peace form the basis of an enduring and stronger partnership. President Zardari congratulated Dr. Riina Kionka on the successful completion of her tenure in Pakistan and lauded her valuable contributions to further strengthening Pakistan-EU relations. He wished her continued success in her future endeavours.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}