{
  "article_id": "2025-08-05_157c7774a28552db378d2fdd3b198dab",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/talal-slams-pti-over-disruptive-protest-strategy-politicizing-children/",
    "retrieved_at": "2025-08-10T10:17:24.824Z"
  },
  "metadata": {
    "title": "Talal slams PTI over disruptive protest strategy, politicizing children",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 480,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP): Minister of State for Interior Talal Chaudhry on Tuesday slammed Pakistan Tehreek-e-Insaf (PTI) for its vague and erratic protest plans, labeling them politically motivated, irresponsible and accusing the party of deliberately staging them on August 5-Youm-e-Istehsal-to disrupt national solidarity. Participating in the National Assembly's debate on Kashmir,Talal Chaudhry accused Pakistan Tehreek-e-Insaf (PTI) of exploiting its founder's children in political narratives and bypassing official procedures for protest approvals, alleging the party routinely orchestrates disruptions during sensitive national events and has lobbied abroad against Pakistan's interests. He clarified that no new military operation was being launched but reaffirmed the continuation of the National Action Plan. He urged political leadership in Khyber Pakhtunkhwa and Balochistan to support security forces, warning that any party aligning with militants would face consequences. Chaudhry said PTI's protest application was received by post just three days ago, with no follow-up despite repeated contact attempts by the Deputy Commissioner's office. He noted conflicting statements about the protest's location and leadership, calling the strategy unclear even to the media. Chaudhry alleged that PTI deliberately stages protests during sensitive national moments-such as security briefings, IMF deadlines, and Kashmir solidarity events-to undermine unity. He also accused PTI of lobbying abroad for sanctions against Pakistan, saying, \"No hostile country has lobbied as actively as PTI's people abroad.\" On security, the minister said the Interior Ministry had coordinated with all four provinces to prepare for both August 5 events and the PTI protest. He said law enforcers were ready to provide protection for lawful demonstrations, but warned that the government would not allow groups to gather en masse at KP House and then march toward Adiala Jail or any location in Punjab to create disorder. Regarding security operations, he clarified that no new military offensive was being launched in Bajaur or any other region. However, both armed and non-armed components of the National Action Plan remain actively in effect. He emphasized that defeating terrorism in Khyber Pakhtunkhwa and Balochistan hinges on resolute political backing for security forces. \"The issue in KP isn't a lack of security capacity-it's the political leadership's cowardice and unwillingness to confront militants. The same holds true for Balochistan,\" he asserted. The minister expressed satisfaction over recent cooperation with Iran following the Iranian president's visit, noting agreement to jointly combat terrorism along the border. \"You will see results in Balochistan when there is coordinated action from both sides,\" he said, adding that Pakistan also expected reciprocal cooperation from Afghanistan, recalling the sacrifices Pakistan had made for its neighbour in terms of both blood and resources. Chaudhry concluded by reaffirming that any political party aligning itself with terrorist elements would face firm state action. \"No new operation is being launched, but the National Action Plan will be implemented in full. Political irresponsibility in KP and Balochistan is costing Pakistan dearly and will no longer be tolerated,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}