{
  "article_id": "2025-08-05_66df1a9f078a9de727e285ee9bdd6123",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rana-sanaullah-expresses-solidarity-with-kashmiri-people/",
    "retrieved_at": "2025-08-10T10:17:52.958Z"
  },
  "metadata": {
    "title": "Rana Sanaullah expresses solidarity with Kashmiri people",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 218,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP):Advisor to the Prime Minister on Political and Public Affairs Rana Sanaullah on Tuesday said that August 5, reminds us of a day, to remember the atrocities committed against the people of illegally occupied Jammu and Kashmir. In a statement, Sanaullah, who also holds the portfolio of the Ministry of the Inter Provincial Coordination (IPC), said five years ago, India revoked the special status of India's Illegally Occupied Jammu and Kashmir (IIOJK), which was a direct attack on the right of self-determination of the Kashmiri people. He expressed complete solidarity with the Kashmiri brothers and sisters, saluting their eternal sacrifices and decades-long struggle for freedom. Sanaullah emphasized that the courage and steadfastness of the Kashmiri people are a beacon of light, and pledged to continue extending moral, political, and diplomatic support to their just struggle. He called upon the United Nations to take notice of the ongoing human rights violations in IIOJK and urged the international community to resolve this long-standing dispute in accordance with United Nations Security Council resolutions. Sanaullah stressed that the matter of IIOJK is not just an issue, but a problem of humanity and global justice. He concluded by praying for the early freedom of the Kashmiri people, saying \"May Allah Almighty grant the Kashmiri people the blessing of early freedom.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}