{
  "article_id": "2025-08-05_bba69c3841a55543ed85c4c10ba5148a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/solidarity-walk-held-to-mark-youm-e-istehsal-e-kashmir-in-di-khan/",
    "retrieved_at": "2025-08-10T10:17:52.203Z"
  },
  "metadata": {
    "title": "Solidarity walk held to mark Youm-e-Istehsal-e-Kashmir in DI Khan",
    "author": null,
    "date_published": "2025-08-10T15:14:25+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 284,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "DERA ISMAIL KHAN, Aug 05 (APP):The district administration has organized a solidarity walk to mark Youm-e-Istehsal-e-Kashmir here on Tuesday. The walk, led by Assistant Commissioner Syed Arsalan Shah, was started from GPO Chowk and culminated at Topanwala chowk. The officials of various departments, media representatives, civil society members, and a large number of citizens participated in the walk. The participants were carrying banners and placards denouncing Indian atrocities and expressing unwavering support for Kashmiris. They chanted slogans in favor of Kashmir's freedom throughout the event. On this occasion, the assistant commissioner while talking to media reaffirmed unwavering support for the people of Kashmir, stating that Pakistan stands shoulder to shoulder with its Kashmiri brethren in their just struggle for self-determination. \"We have not forgotten our Kashmiri brothers and sisters. We will stand by them at every level until they are granted their rightful freedom,\" he said. The participants condemned the continued human rights violations being committed by Indian armed forces in Indian illegally occupied Jammu and Kashmir, terming them as blatant breaches of international law and human dignity. They emphasized that such observances aim to draw the attention of the global community to the plight of unarmed Kashmiris and to urge international institutions to ensure justice. Addressing the gathering, Assistant Commissioner Arsalan Shah said the observance of Youm-e-Istehsal-e-Kashmir sends a clear message to India that Pakistan rejects the revocation of Jammu and Kashmir's special status. \"The blood of innocent Kashmiris will not go in vain. Insha'Allah, the dawn of freedom will soon rise over Kashmir,\" he stated. Earlier, a ceremony was also held at the Deputy Commissioner's Office, where a one-minute silence was observed to honor the resilience and sacrifices of the Kashmiri people.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}