{
  "title": "Indian activists seek to save child brides - World - DAWN.COM",
  "author": null,
  "content": "When wedding season comes in India, the phone of child rights activist Tatwashil Kamble never stops ringing with appeals to stop girls from being married off due to poverty.\n\nKamble said he has helped stop thousands of illegal marriages in India, where nuptials before the age of 18 are banned.\n\n“The elders of the village think: ‘How dare we come to stop a marriage in their village!’” said Kamble, who has been campaigning for more than a decade in western Maharashtra state.\n\nMany families are motivated by poverty to marry off their daughters, so that the girls can start earning their own living.\n\nWhen activists have sought to stop marriages, “it has led to physical altercations,” according to Kamble.\n\nSometimes they are able to stop the nuptials from taking place, or, if they arrive too late, then the bride is taken to a shelter and supported in deciding on her own future.\n\nIndia accounts for one in three of the world’s child brides, according to the UN children’s agency, with at least 1.5 million girls getting married each year.\n\nKamble said he is driven by the bitter memory of seeing a teenager die of blood loss during labour.\n\n“That’s when I thought: so many young girls are getting married and, even after their death, it’s not being called child marriage. They are saying ‘the mother has died’” without acknowledging she was a girl.\n\nKamble works in the Beed district of Maharashtra, an area dominated by sprawling sugarcane fields hit hard by years of drought.\n\nWorkers said they have little choice but to marry their daughters off young — arguing they do it to protect the girl, not harm her.\n\n“It is not like we don’t like the idea of education,” said Manisha Barde, a sugarcane cutter who was a child bride herself.\n\n“We want her to become a doctor.”\n\nBarde, however, arranged for her teenage daughter to be married only to be stopped by authorities.\n\nShe did so because they were poor and, if they had “better jobs, we wouldn’t have thought of her marriage”.\n\nFarm labourers said that when their children are little, relatives look after them or they come to the fields.\n\nBut when the girls become teenagers, their parents begin to worry — either that they could start a relationship before marriage, or be subjected to sexual violence.\n\n“There are very few girls who stay unmarried until 18,” said Ashok Tangde, district chief of the child welfare committee. “I have seen girls who have never seen a school,” he said.\n\nFamilies worry for “the girl’s safety,” Tangde said, and even those opposed to child marriage can end up organising a wedding.\n\nTangde said his team received 321 calls from across the district about child marriages that were taking place, or about to happen, in the first five months of this year.\n\nDuring peak wedding season, which runs from October to March, Tangde said he gets around 10 to 15 calls daily, which prompt his team and other activists to raid ceremonies.\n\nTangde has a dedicated network of activists and other informants who help in villages across the district, sending photographs of weddings.\n\n“There are some people who want to do the right thing,” he said.\n\nSometimes the bride calls directly. Other times, a guest rings and makes the authorities listen to the wedding music.\n\n“Disrupting a wedding… there is a lot of drama,” said Tangde. “People get ready to beat up those who go to stop such marriages.”\n\nJyoti Thorat was 16 when her parents married her off to a 20-year-old man, ending her hopes of continuing school and joining the police.\n\n“My parents fixed it, and I wasn’t happy,” Thorat said, a decade later and a mother of two schoolboys.\n\nHer older sisters had also been married off before they turned 18, with her parents prioritising getting their only son educated.\n\nThorat recalled with despair how work cutting cane beckoned soon after her wedding, a fate that awaits other girls.\n\n“They have to start working as sugarcane workers that same year,” she said. “A machete is ready for them. “\n\nHeader image: A couple ride past a hostel for children of sugarcane workers in Umrad Khalsa village, Maharashtra. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/231115063dc0730.jpg",
  "retrievedAt": "2025-08-20T04:24:21.498Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919320/indian-activists-seek-to-save-child-brides",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T08:36:42.000Z"
}
