{
  "title": "FM Dar arrives in UAE to lead 12th JMC meeting - World - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Monday arrived in the UAE for the upcoming 12th session of the Pakistan-UAE Joint Ministerial Commission (JMC) to be held in Abu Dhabi.\n\nThe 12th session of Pak-UAE JMC is being held following a hiatus of 13 years after it was scheduled in October 2024. The last session was held in Islamabad from 6-7 November 2013.\n\nAccording to a statement by the Foreign Office (FO), Dar will lead the Pakistan delegation to the meeting scheduled on June 24.\n\n“The JMC serves as the highest institutionalised platform for bilateral cooperation between Pakistan and the UAE. The upcoming session will take forward the agenda of deepening strategic, economic and development cooperation between the two brotherly countries,” the statement said.\n\nIt said that the delegation “will comprise secretaries and senior officials from key ministries including Economic Affairs, Commerce, Energy, Maritime Affairs and Interior”.\n\n“The UAE side will be led by Sheikh Abdullah bin Zayed Al-Nahyan, Deputy Prime Minister and Minister of Foreign Affairs, along with high-level representation from relevant Emirati institutions,” it added.\n\nFO also said that the session will discuss progress across different areas of bilateral cooperation and explore new avenues for collaboration in trade, investment, energy, infrastructure development and IT.\n\n“A number of legal instruments are expected to be finalised during the session to institutionalise sectoral cooperation.”\n\nThe statement added, “The session will provide an important opportunity for both sides to align their economic priorities and unlock the potential of enhancing [the] scope of mutually beneficial partnership.”\n\nDar also wrote on X that he had reached the UAE to lead Pakistan’s delegation at the JMC meeting.\n\nThe UAE is Pakistan’s third-largest trading partner after China and the United States, is home to more than a million Pakistani expatriates, and is the second-largest source of remittances to the South Asian country after Saudi Arabia.\n\nPakistan’s Ambassador to the UAE, Faisal Tirmizi, had said that the bilateral trade between Pakistan and the UAE exceeded US$10.9 billion in the fiscal year 2023–24, including goods and services.\n\nEarlier this month, Prime Minister Shehbaz Sharif met UAE President and Ruler of Abu Dhabi Sheikh Mohamed bin Zayed Al Nahyan during his official one-day visit to the Gulf state, where he discussed matters of bilateral and regional interest.\n\nThe high-level engagement aimed at reaffirming Pakistan’s gratitude to friendly nations that supported Islamabad’s position during its recent standoff with New Delhi.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:24:14.236Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919392/fm-dar-arrives-in-uae-to-lead-12th-jmc-meeting",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T14:44:42.000Z"
}
