{
  "title": "What are the main US military bases in the Middle East? - World - DAWN.COM",
  "author": null,
  "content": "Iran on Monday struck a retaliatory missile attack targeting the American Al Udeid Air Base in Qatar, while launching a missile operation called “Annunciation of victory” against US bases in Iraq and Qatar, according to Iran’s Tasnim news agency.\n\nA day earlier, President Donald Trump said US air strikes “totally obliterated” Iran’s main nuclear sites, as Washington joined Israel’s war with Tehran in a flashpoint moment for the Middle East.\n\nThe strikes drew threats from Tehran to retaliate, with US military installations in the region a potential target.\n\nThe following are significant US facilities in the Middle East:\n\nHome to the headquarters of the US Navy’s Fifth Fleet, whose area of responsibility includes the Gulf, Red Sea, Arabian Sea and parts of the Indian Ocean.\n\nThe 24-hectare Al Udeid Air Base, in the desert outside the capital Doha, is the forward headquarters for US Central Command, which directs US military operations in a huge swathe of territory stretching from Egypt in the west to Kazakhstan in the east. The Middle East’s largest US base houses around 10,000 troops.\n\nSeveral sprawling military installations include Camp Arifjan, the forward headquarters of US Army Central and the Ali Al Salem Air Base, roughly 40 kilometres from the Iraqi border and known as “The Rock” for its isolated, rugged environment.\n\nCamp Buehring was established during the 2003 Iraq War and is a staging post for US Army units deploying into Iraq and Syria, according to the US Army website.\n\nThe Al Dhafra Air Base, situated south of UAE capital Abu Dhabi and shared with the UAE Air Force, is a critical US Air Force hub that has supported key missions against the Islamic State, as well as reconnaissance deployments across the region, according to the US Air Force Central Command.\n\nDubai’s Jebel Ali Port, while not a formal military base, is the US Navy’s largest port of call in the Middle East that regularly hosts US aircraft carriers and other vessels.\n\nThe US maintains a presence at Ain Al Asad Air Base in western Anbar province, supporting Iraqi security forces and contributing to the Nato mission, according to the White House. Iranian missile strikes targeted the base in 2020, in retaliation for the US killing of Iranian General Qasem Soleimani.\n\nSituated in the semi-autonomous Kurdistan Region of northern Iraq, Erbil Air Base serves as a hub for US and coalition forces conducting training exercises and battle drills. The base supports US military efforts by providing a secure location for training, intelligence sharing, and logistical coordination in northern Iraq, according to the congressional report.\n\nUS soldiers in Saudi Arabia — which numbered 2,321 in 2024 according to a White House letter — operate in coordination with the Saudi government, providing air and missile defence capabilities and supporting the operation of US military aircraft.\n\nSome are stationed roughly 60 kilometres south of Riyadh, at Prince Sultan Air Base, which supports US Army air defence assets including Patriot missile batteries and Terminal High Altitude Area Defence systems.\n\nLocated in Azraq, 100 kilometres northeast of the capital Amman, the Muwaffaq al Salti Air Base hosts the US Air Forces Central’s 332nd Air Expeditionary Wing, which engages in missions across the Levant, according to a 2024 report in the Library of Congress.\n\nHeader Image: US President Donald Trump delivers remarks to US troops, next to a banner reading, “Peace Through Strength”, during a visit to Al Udeid Air Base in Doha, Qatar, May 15. — Reuters/File",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2322352984cd045.jpg",
  "retrievedAt": "2025-08-20T04:24:12.432Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919442/what-are-the-main-us-military-bases-in-the-middle-east",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T17:39:33.000Z"
}
