{
  "title": "Stakeholders renew push for Child Marriage Bill in Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: A joint consultative meeting of stakeholders—including members of civil society, human rights activists, and social and political workers —revived efforts to pass the pending Child Marriage Restraint Bill in the Balochistan Assembly.\n\nThe meeting was jointly organised by National Commission on the Rights of the Child (NCRC) Baloc­histan, the Social Welfare Department, Unicef and other partners. Advocate Abdul Hayee, NCRC member from Balochistan, along with representatives from Unicef, UNFPA and civil society attended the meeting.\n\nThe bill, which seeks to set the minimum marriage age at 18 in line with national and international commitments, has remained stalled since 2013, despite cabinet approval. Participants of the meeting expressed frustration over the delay and urged provincial lawmakers to immediately table and pass the bill.\n\nThey acknowledged the PPP’s historic role in passing the Sindh’s Child Marriage Law in 2014 and praised President Asif Ali Zardari and Chairman Bilawal Bhutto-Zardari for pushing child protection legislation at the federal level.\n\nThe participants urged Chief Minister Sarfraz Bugti to fulfill his commitment made in 2018 to support the bill’s passage. They stressed that child marriage is not only a human rights violation but a serious public health concern, contributing to life-threatening conditions like obstetric fistula.\n\nOn the occasion, the civil society members vowed to intensify advocacy to ensure swift legislative action.\n\nPublished in Dawn, June 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:43:02.103Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919225/stakeholders-renew-push-for-child-marriage-bill-in-balochistan",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T00:04:24.000Z"
}
