{
  "title": "Sindh opts for OPS postings after Centre delays civil servants’ promotion notifications - Pakistan - DAWN.COM",
  "author": null,
  "content": "• CS posts two senior BS-19 officers as DIGs in BS-20 in ‘own pay scale’\n• CM House spokesperson says cabinet allowed posting of senior officers who fall in promotion zone to next grade\n\nKARACHI: Fed up with the inordinate delay in the issuance of a notification by Islamabad regarding promotion of more than 100 civil servants belonging to the Police Service of Pakistan (PSP) and Pakistan Administrative Service (PAS) groups, the Sindh government has decided to give postings in the next grade to the officers working in the province on an “own pay scale (OPS)” basis, it has emerged.\n\nOfficial sources told Dawn that the federal government has not yet issued the official notification regarding promotion of dozens of PAS and PSP officers, whose promotion from BS-19 and BS-20 to the next grades was approved by Prime Minister Shehbaz Sharif on the recommendations of the high-powered Central Selection Board several weeks ago.\n\nThey said that the reason behind an inordinate delay was a tug of war between a close aide to the PM and two provincial governments over the implementation of the Federal Rotation Policy of civil servants.\n\nThe sources said that the PM’s close aide wanted certain officers working in Punjab and Sindh for over a decade transferred to Balochistan and Khyber Pakhtunkhwa in accordance with the rotation policy.\n\nHowever, the provincial governments in question did not want to surrender what they considered “their officers” to other provinces due to which the promotion notification was being delayed, they added.\n\nAgainst this backdrop, the Sindh government has decided not to wait for the federal government’s notification and posted two PSP officers on higher grade posts on an OPS basis.\n\nLast week, the Sindh government had issued a notification, posting two PSP officers in BS-19 — Farrukh Ali and Sheeraz Nazeer — on BS-20 posts as the DIG of Karachi’s East Zone and DIG of Sindh police’s Special Branch, respectively, in their own pay scale.\n\n“Dr Farrukh Ali, an officer of Police Service of Pakistan (BS-19), PSO to Minister for Home, Sindh, is transferred and posted with immediate effect and until further orders as DIG (BS-20), East Zone, Karachi, on his own pay and scale, being senior officer,” according to the June 17 notification, whose other part reads: “Mr Sheeraz Nazeer, an officer of Police Service of Pakistan (BS-19), PSO to Chief Minister, Sindh, is transferred and posted with immediate effect and until further orders as DIG (BS-20), Special Branch, Sindh, Karachi on his own pay and scale, being senior officer.”\n\nKnown for their competence and professionalism in the force, DIG Ali and DIG Nazeer are among those civil servants whose promotion in BS-20 has been approved by the PM, pending formal notification, the sources added.\n\nThe sources said that some more proposals regarding postings of the senior BS-19 officers on BS-20 posts have been finalised and the Services and General Administration Department would issue formal notifications soon.\n\nWhile the judiciary had discouraged the appointment of a civil servant on an OPS basis, a senior Sindh government official said that the authorities had decided to go ahead keeping in view the fact that the promotions of the officers in question had already been approved and announced and just a formal notification is awaited.\n\nHe said that delaying formal notifications was a sheer injustice to the already promoted officials, which is why the Sindh government has decided to give such officials postings in their next grades. “Their postings will be actualised the day the federal government releases their notification. Till then, they continue to work on OPS.”\n\nRegarding the rotation policy, the official said: “Sindh is already facing a serious shortage of experienced PAS and PSP officers and all I know is that the provincial authorities have decided not to surrender them to the establishment division.”\n\nDawn tried to reach out Federal Minister Ahad Khan Cheema, who holds the additional portfolio of Establishment, to get his version about non-issuance of promotion notification as well as the rotation policy but to no avail.\n\nWhen contacted about the decision to post officers on an OPS basis, Spokesperson to Sindh Chief Minister House Rasheed Channa said: “The Sindh cabinet has already decided that officers who are the senior-most in their respective grades and fall within the promotion zone may be considered for posting in a higher grade.”\n\nRegarding DIG Ali and DIG Nazeer, he told Dawn that their promotions in BS-20 had already been approved, and an official notification was awaited.\n\nPublished in Dawn, June 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:24:33.818Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919216/sindh-opts-for-ops-postings-after-centre-delays-civil-servants-promotion-notifications",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T00:04:48.000Z"
}
