{
  "title": "Pakistani cueists dominate opening day at Asian 6-red - Pakistan - DAWN.COM",
  "author": null,
  "content": "COLOMBO: Pakistani snooker stars made a resounding statement on the opening day of the Asian 6-Red and Team Snooker Championship, securing convincing victories in their respective group stage matches on Sunday.\n\nThe championship, featuring 32 players from 13 nations divided into eight groups, commenced in Colombo. Each player will contest three matches in the league round, with the top two from each group advancing to the pre-quarterfinals.\n\nLeading the Pakistani charge was Awaisullah Munir, the defending champion. The 31-year-old from Pakistan began his title defence in style, overcoming a spirited challenge from Chi Kin Chan of Macao China with a 4-2 victory.\n\nAwaisullah dropped the first frame (1-53) but responded strongly, taking the next two frames with breaks of 41 (41-01) and 31 (38-06).\n\nChan levelled the match (09-38) in the fourth frame, but Awaisullah regained control, sealing the win with convincing breaks of 37 (49-0) and a superb 52 (57-0) in the final two frames.\n\nAwaisullah then produced a masterclass against Bangladesh’s Ziaur Rahman Azad, cruising to a dominant 4-0 win.\n\nThe defending champion was in scintillating form, firing in high breaks throughout the match: a 65 clearance (65-0), a 47 (47-17), a 43 (59-8) and a flawless 75 clearance (75-0) to complete the whitewash.\n\nMeanwhile, Mohammad Asif, Pakistan’s most decorated cueist with five international titles, also enjoyed a successful start. The 42-year-old veteran secured a 4-1 win over Neang Tola of Cambodia.\n\nAsif took the first two frames confidently, aided by a 37 break (37-17) and another 37 break (47-0). Tola fought back to take the third frame with a 35 break (9-59). However, Asif regained his composure, winning the next two frames (44-0 and 29-9) to claim the match.\n\nCompleting a perfect day for the Pakistani contingent was Mohammad Sajjad. The 40-year-old cueist delivered a commanding performance agai­nst Khalil Busaif of Bahrain, securing a clean 4-0 victory.\n\nSajjad displayed consistent scoring and tactical prowess throughout the match, winning the frames (46-35, 34-17, 48-17) before sealing the win with a 33 break in the final frame (46-13).\n\nPublished in Dawn, June 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/6854d5b3dd441.jpg?r=115225",
  "retrievedAt": "2025-08-20T04:24:23.042Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919288/pakistani-cueists-dominate-opening-day-at-asian-6-red",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T03:56:13.000Z"
}
