{
  "title": "Two teenagers drown in Battagram’s Nendhyar River: rescue official - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two teenagers drowned while bathing in the Nendhyar River of Khyber Pakhtunkhwa’s Battagram district, a rescue official said on Monday.\n\nSpeaking to Dawn.com, Rescue 1122 official Aziz Khan said, “The two teenagers — identified as Hafiz Usman, 16, and Ayan, 14 — were bathing in the river when they drowned and died on the spot.\n\n“The Rescue 1122 medical team retrieved the bodies and shifted them to the District Headquarters Hospital Battagram, where they were pronounced dead.”\n\nA rescue search operation was initially underway for a third child due to initial suspicions, according to Khan.\n\nLater, at the request of locals, Rescue 1122 personnel were informed that only two children had drowned, following which District Emergency Officer Kashif Khattak instructed the rescue team to end the search operation.\n\nDeath by drowning is common in the country due to several reasons, including strong river currents, lack of swimming skills, and inadequate safety measures. Many rivers have dangerous undercurrents that are not visible on the surface, catching people off guard. The problem worsens during the monsoon season, when rivers swell and flooding becomes common.\n\nA day ago, Rescue 1122 retrieved the body of a girl who had drowned in Chashma-Jhelum Link Canal along with her father and brother on Thursday, while two girls drowned in the Indus River in Torghar district on Sunday, according to police and rescue officials.\n\nLast week, a boat carrying tourists capsized in the Shahi Bagh lake in Kalam area of KP’s Swat district, drowning two women and two children, with a third child missing.\n\n“Efforts to locate a third missing child are still underway,” said Rescue 1122 Spokesperson Bilal Faizi regarding the capsize.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/23165539b470b25.png",
  "retrievedAt": "2025-08-20T04:24:14.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919379/two-teenagers-drown-in-battagrams-nendhyar-river-rescue-official",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T12:14:17.000Z"
}
