{
  "title": "Fact check: Viral videos do not show US attack on Iran’s nuclear facilities - World - DAWN.COM",
  "author": null,
  "content": "Posts from multiple users on social media platforms since Sunday were sharing two videos, claiming they showed the United States’ attacks on Iranian nuclear facilities. However, the videos do not show the US attacks but different instances from 2024.\n\nA US airstrike on Sunday, codenamed “Operation Midnight Hammer”, targeted and “totally obliterated” Iran’s primary nuclear enrichment facilities at Fordow, Natanz, and Isfahan, President Donald Trump announced. Iran has condemned the strikes as a “barbaric violation” of international law and warned of “everlasting consequences”, including potential unilateral action such as closing the Strait of Hormuz.\n\nOn Sunday, an Indian user on X shared a video claiming it showed a US attack on Iran’s nuclear facilities. The footage featured a massive explosion at night, with towering flames and a large plume of smoke rising into the sky.\n\nThe caption read: “Video footage of the US attack on Iran’s nuclear facilities has emerged. The intensity and accuracy of the attack clearly shows that it was a highly planned action. Everyone is now waiting for Iran’s response. The situation has become extremely tense.”\n\nThe post garnered over 1.2 million views.\n\nThe post did not mention which of the three sites was show in the video.\n\nThe same video, with similar claims, was circulated by other users on X, with individual posts receiving over 1.5m, 200,000, and 12,000 views, respectively.\n\nThe claim was also widely shared by other users as can be seen here, here, here and here.\n\nSimilarly on Sunday, an X user shared an 8-second clip showing a massive explosion lighting up the night sky in the distance, with a bright fireball and smoke rising above a landscape.\n\nThe post’s caption said, “Major escalation: The US has launched airstrikes on Iran’s top nuclear facilities, including Fordow, Natanz, and Isfahan. This marks a turning point in the regional conflict, with the US directly targeting Iran’s nuclear infrastructure for the first time.”\n\nThe post received over 493,000 views.\n\nThe same clip was shared by several other X users, as seen here, here, here, here, here, here, here and here collectively accumulating over 200,000 views.\n\nThe above posts mainly claimed that the video was from the attack on the Fordow nuclear site.\n\nThe same clip was found on Instagram which can be seen here, here and here.\n\nSimilarly, the clip was widely shared on Facebook too as can be seen here and here.\n\nA fact-check was initiated to determine the veracity of the claims due to their high virality and keen public interest in the US involvement in the the Iran-Israel conflict.\n\nA reverse image search led to a news report published by US news outlet CNN on September 18, 2024, titled “Ukraine claims to have destroyed large Russian ammunition depot in overnight drone attack”.\n\nThe report included a video featuring identical visuals to those seen in the viral clip.\n\nAccording to the news report, a Ukrainian drone strike targeted a major Russian weapons depot in the city of Toropets, located in the Tver region. The depot, reportedly used to store Iskander and Tochka-U missile systems along with other ammunition, was operated by Russia’s defence ministry. The overnight attack caused a massive explosion and fire, prompting evacuations and raising concerns about Russia’s missile capabilities. Ukraine described the strike as part of a deliberate effort to reduce Russia’s military strength.\n\nThe same video was also featured in a news report by British outlet Metro on September 19, 2024, titled: “Putin’s ‘impenetrable’ arms depot taken out in huge mushroom cloud blast”.\n\nFor the second video clip, a reverse image search yielded an X post from December 16, 2024, featuring the same video.\n\nIt was captioned: “Breaking: Israeli airstrike on Tartus, Syria.”\n\nA keyword search for “Israel” and “Tartus, Syria” led to multiple news reports about Israel’s aggression in Syria in December 2024.\n\nAccording to the reports, Israel launched airstrikes on Tartus in northwestern Syria, triggering massive explosions that were so powerful they registered as a 3.0 magnitude earthquake on nearby seismic sensors. The Israeli military stated that these strikes were aimed at preventing military infrastructure and equipment that were formerly under the control of the Assad regime from falling into the hands of rebel groups following the regime’s collapse.\n\nThe viral clip was also featured in a news bulletin from German state broadcaster DW News titled “Reports: Israel strikes missile storage sites in Syria’s Tartus region,” aired on December 16, 2024.\n\nThe viral clip appears at the 2:09-minute mark in the broadcast. Sky News Australia also aired the same footage.\n\nTherefore, the fact-checks determined that the claims that two viral videos show attacks by the US on Iran’s nuclear facilities are false. The videos are not recent and date back to September 2024, when a Ukrainian drone strike destroyed an ammunition depot in Russia, and December 2024, when Israel conducted attacks in Syria’s Tartus region.\n\nThese fact checks were originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/06/23115802c37b852.jpg",
  "retrievedAt": "2025-08-20T04:24:22.560Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919327/fact-check-viral-videos-do-not-show-us-attack-on-irans-nuclear-facilities",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T09:23:38.000Z"
}
