{
  "title": "US aggression - Newspaper - DAWN.COM",
  "author": null,
  "content": "BY striking Iran’s nuclear sites, America has initiated the process of a long and devastating war that will affect the entire global order geopolitically and economically.\n\nEven earlier in April, when talks on the nuclear issue between the US and Iran, mediated by Oman, were underway, the Iranian supreme leader had expressed “distrust” towards the “opposing parties”. As it turned out, his pessimism was not without reason.\n\nUsing diplomacy as a smokescreen, Israel and the US started a reckless campaign of aggression against the Islamic Republic that may shake the international order to its core. While Israel launched surprise attacks on Iran on June 13, the much-anticipated US strikes materialised early on Sunday. Apparently, three Iranian nuclear facilities were hit, and President Donald Trump has issued more threats unless Iran makes peace on America’s terms. Mr Trump said after the strikes that “now is the time for peace”. Not exactly, it would appear.\n\nMany argue that the US-Israeli campaign is not all about nuclear weapons, which Iran denies it is pursuing, or the other ‘destabilising activities’ the Western bloc accuses Tehran of indulging in. Muslim states, in fact much of the Global South, would not be wrong in assuming that the new war is designed to punish a Muslim country that refused to bow before Pax Americana, as enforced by Israel in the Middle East. Many credible sources argue that Iran was not pursuing the bomb, but this counts for little when the Empire decides that an errant nation must be ‘punished’. The double standards are glaring when Israel, armed to the teeth with nukes, accuses another power of pursuing atomic weapons.\n\nIf there is any state in the world that the international community must be concerned about harbouring weapons of mass destruction, it is Israel, which has unleashed a genocide in Gaza and committed aggression against nearly all its neighbours. But many in the Western camp conveniently overlook the hypocrisy of censuring Iran and embracing Israel. In fact, like the UK, they have applauded the US attacks on Iran from the sidelines.\n\nThis is a moment of grave danger for the entire international community. All eyes are on how and when Iran retaliates. The Iranian Majles has called for closing the Strait of Hormuz. Even if Iran were not to take immediate kinetic action against US forces, closing Hormuz would itself draw in America, in its self-assigned role as global policeman, to keep the strait open for international trade. In case US facilities or personnel are hit, matters would escalate rapidly. The only way to prevent a march into a conflagration of devastating proportions is for the US and Israel to immediately halt their aggression against Iran, and respect what remains of international law.\n\nPublished in Dawn, June 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:43:35.710Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919272",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T03:22:29.000Z"
}
