{
  "title": "Low taxes fail to spur hybrid adoption in Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Difference in upfront cost of hybrid, petrol cars is around Rs4m\n• Maintenance charges also make timeline to recover initial investment on hybrids longer\n\nKARACHI: Despite lower taxes compared to gasoline vehicles, the adoption of hybrid electric vehicles (HEVs) in Pakistan has been slow, largely due to the higher up-front cost that prolongs the recovery period.\n\nThe general sales tax (GST) on hybrid electric vehicles (HEVs) is 8.5 per cent compared to 12.5 to 25pc on various categories of locally assembled fossil fuel vehicles.\n\nThe GST on fossil fuel vehicles below 850cc is 12.5pc, below 1,400cc, 18pc, and above 1,400cc, 25pc, according to Syed Asif Ahmed, the general manager of MG Pakistan.\n\nOn locally made HEVs and plug-in hybrid electric vehicles (PHEVs) below 1,800cc, the GST is 8.5pc, while the rate on 1,801 to 2,500cc is 12.75pc.\n\nYet, a hybrid compact SUV vehicle costs up to Rs 12 million, while similar variants of petrol cars cost Rs 8m, leaving a price difference of approximately Rs 4m.\n\nGlobally, hybrid vehicles deliver financial value when their purchase price does not exceed more than 10pc of the cost of an equivalent petrol vehicle.\n\nHowever, according to Mr Ahmed, this benchmark is not followed in Pakistan, where the price gap between hybrids and their petrol counterparts is significantly wider, averaging around 45pc.\n\nLonger recovery period\n\nHEV sales in Pakistan have more than doubled in 2024, according to Reuters.\n\nLast year, over 35,000 SUVs, priced over Rs8m were sold in Pakistan with around half of them being hybrids.\n\nHEVs employ an internal combustion engine and can run on fuel as well as battery power. However, unlike PHEVs, they cannot be charged directly with electricity and instead rely on their engines to produce electric power.\n\nFor most buyers, the incentive to purchase a hybrid vehicle is to save on fuel costs which would eventually offset the higher up-front cost over the years.\n\nHowever, the massive difference in the upfront costs and periodic maintenance charges prolong the recovery period, even beyond a typical car ownership cycle.\n\nAccording to Mr Ahmed of MG Pakistan, hybrids generally offer a fuel economy advantage of 8 to 10 km per litre compared to petrol vehicles, which equates to Rs 35/km operational cost saving.\n\nTo recover the additional Rs4m, a consumer would need to drive the hybrid for approximately 115,000km, Mr Ahmed explained.\n\nAssuming an average annual drive of 15,000km, this payback period extends to over 7.5 years, he elaborated.\n\nGiven this timeline, the first owner of the vehicle is generally unlikely to fully recoup the higher upfront investment during their typical ownership cycle.\n\nThis raises critical questions about the cost-effectiveness of hybrids in Pakistan.\n\nIn terms of technology, hybrid vehicles are only efficient if used in stop-and-go driving in cities as a hybrid system only engages at low speeds, around 40 to 60km per hour.\n\nAt high speed, the fuel efficiency drops to the same level as a gasoline car.\n\nMr Ahmed added the price difference can vary but it is common for HEVs to cost 15 to 25pc more upfront than gasoline cars.\n\nHe said in the USA, HEVs have a higher initial purchase price than gasoline-powered vehicles but offer potentially long-term savings through fuel efficiency and lower maintenance costs.\n\nThe periodic maintenance requirements of hybrid cars are the same as petrol ones, making their total cost of ownership higher than petrol due to the steep acquisition cost.\n\nIn Pakistan, duties and taxes on automobile parts also make maintenance costlier.\n\nThe customs duty on the import of non-localised parts for the assembly of fossil fuel-driven vehicles and HEVs is 30pc along with 2pc additional customs duty. For new entrants, these duties are 10pc both versions of vehicles.\n\nA hybrid car is only viable if the fuel saving offsets the high purchase price in less than three years.\n\nA better option for buyers in Pakistan is a pure electric vehicle or EV which requires maintenance after 15 months, making it the most efficient mobility option available.\n\nHowever, EVs’ adoption suffer from a different set of challenges like high acquisition cost and lack of charging infrastructure.\n\nPublished in Dawn, June 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6858934462d4e.gif",
  "retrievedAt": "2025-08-20T04:24:55.365Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919231/low-taxes-fail-to-spur-hybrid-adoption-in-pakistan",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T00:04:24.000Z"
}
