{
  "title": "Bangladesh probe into Hasina-era abuses, warns ‘impunity’ remains - World - DAWN.COM",
  "author": null,
  "content": "A Bangladesh government-appointed commission investigating hundreds of disappearances by the security forces under ousted premier Sheikh Hasina on Monday warned that the same “culture of impunity” continues.\n\nThe Commission of Inquiry into Enforced Disappearances is probing abuses during the rule of Hasina, whose government was accused of widespread human rights abuses.\n\nThat includes the extrajudicial killing of hundreds of political opponents and the unlawful abduction and disappearance of hundreds more.\n\nThe commission was established by interim leader, Nobel Peace Prize winner Muhammad Yunus, 84, who is facing intense political pressure as parties jostle for power ahead of elections expected early next year.\n\nBangladesh has a long history of military coups and the army retains a powerful role.\n\n“Enforced disappearances in Bangladesh were not isolated acts of wrongdoing, but the result of a politicised institutional machinery that condoned, normalised, and often rewarded such crimes,” the commission said, in a section of a report released by the interim government on Monday.\n\n“Alarmingly, this culture of impunity continues even after the regime change on August 5, 2024”.\n\nThe commission has verified more than 250 cases of enforced disappearances spanning the 15 years that Hasina’s Awami League was in power.\n\nCommission chief Moyeenul Islam Chowdhury said earlier this month that responsibility lay with individual officers, who were “involved in conducting enforced disappearances”, but not the armed forces as an institution.\n\nEarlier this month, a joint statement by rights groups, including Amnesty International and Human Rights Watch, called on the security forces to “fully cooperate with the commission by guaranteeing unfettered and ongoing access to all detention centres … and providing free access to records regarding those seized or detained”.\n\nMeanwhile, A Bangladesh court on Monday remanded in custody the former elections chief for his alleged role in rigging the vote in favour of Hasina.\n\nKM Nurul Huda, 77, was ordered to be detained for four days while questioning continues, a day after a mob, who smashed into his home and assaulted him, eventually handed him over to the police.\n\nOn Sunday, the powerful Bangladesh Nationalist Party (BNP) filed a case against Huda and other former election commissioners it accuses of rigging past polls in favour of Hasina.\n\nHours after the case was filed, a mob stormed Huda’s home in the capital, Dhaka and dragged him onto the street. They put a garland of shoes around his neck and beat him up before handing him over to the police.\n\nThe interim government condemned the incident and urged people not to take the law into their own hands.\n\n“Swooping on an accused and physically assaulting him is illegal, contrary to the rule of law, and a criminal offence,” the statement read.\n\nInterim leader Muhammad Yunus has said elections will be held in early April 2026.\n\nPolice put a helmet on Huda while taking him to the court for his protection. Human rights organisations also condemned the attack on Huda.\n\n“It was a complete violation of … the rule of law,” Abu Ahmed Faijul Kabir from the rights group Ain O Salish Kendra said in a statement.\n\nHasina, 77, remains in self-imposed exile in India, where she fled after she was ousted last year.\n\nShe has defied orders to return to Dhaka to face charges amounting to crimes against humanity. Her trial in absentia continues.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/232007293ecc2c2.jpg",
  "retrievedAt": "2025-08-20T04:24:14.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919412/bangladesh-probe-into-hasina-era-abuses-warns-impunity-remains",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T15:19:25.000Z"
}
