{
  "title": "Honouring the brave: federal ministers pay tribute to martyred heroes on 59th Pakistan Defence Day",
  "link": "https://www.app.com.pk/national/honouring-the-brave-federal-ministers-pay-tribute-to-martyred-heroes-on-59th-pakistan-defence-day/",
  "date_published": "2024-09-06T19:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): Pakistan marked its 59th Defense Day with somber tributes and heartfelt condolences, as federal ministers visited the families of martyrs and paid homage to their sacrifices on Friday.\nThe day-long observance honoured the bravery and ultimate sacrifices of Pakistan’s armed forces, which have defended the country against external threats and internal strife.\nMinister for Defence Khawaja Muhammad Asif visited the residence of martyred Major Jalaluddin in Quetta and met with his family.\nHe paid tribute to the family of martyred Major, stating that Jalaluddin sacred blood will not go in vain.\n“The Pakistani nation takes pride in its martyrs,” he said adding that it is an honour for me to meet the family of a brave martyred soldier of the Pakistan Army.\nFederal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar visited the residence of Captain Ahmed Badr Shaheed, where he met with his father Colonel (retd) Badruddin and other relatives.\nHe expressed heartfelt condolences to the family of martyred Captain Ahmed Badr and offered Fateha for his soul.\nTerming Captain Ahmed Badr Shaheed as the pride of Pakistan, the information minister said that the nation will never forget the sacrifice of Captain Ahmed Badr Shaheed.\nFederal Minister for Power Division Sardar Awais Ahmed Khan Laghari visited the family of Shaheed (martyred) Lance Naik Hasnain Ali Shah.\nThe minister prayed for elevation of the soul of martyr and offered condolence to the bereaved family.\nFederal Minister for Maritime Affairs Qaiser Ahmed Shaikh visited the Pakistan Navy graveyard and laid a floral wreath on the grave of Martyr Lt Cdr Zeeshan.\nThe minister, after laying the wreath offered Fateha and prayed for the departed soul of Shaheed Lt Cdr Zeeshan.\nFederal Minister for Commerce Jam Kamal Khan Paid homage by visiting martyrs’ families on defence day.\nIn a solemn tribute to the nation’s fallen heroes on Defence Day, the minister visited the homes of two martyrs, honouring their sacrifices and reaffirming the government’s commitment to supporting their families.\nThe first visit was to the home of Havaldar Muhammad Munir Abbasi, who was martyred in a helicopter crash at Darya B on August 6, 2015.\nHe reassured the family that the government remains committed to their welfare, announcing that Havaldar Munir’s son would be offered a job in line with his qualifications.\nMinister for Privatization Abdul Aleem Khan, along with members of the National Assembly, visited the residence of martyred Subedar Major Muhammad Khurshid to pay tribute to the brave soldier who sacrificed his life for the country.\nHe met with the family members of the martyred soldier, including his children and expressed his condolences.\nHe praised the sacrifices of Subedar Major Muhammad Khurshid, saying that his martyrdom was a great honour for the nation.\nMinister for Finance and Revenue Senator Muhammad Aurangzeb visited the residence of Shaheed Lance Naik (L/NK) Waqar Hussain Shah, who laid down his life in the line of duty, defending the nation with unparalleled bravery and dedication.\nDuring the visit, the minister met with the martyr’s widow Sania Nazir and their children, extending his deepest condolences and expressing the nation’s immense pride in the valor and sacrifice of Shaheed Waqar.\nFederal Minister for Industry and Production Rana Tanveer Hussain visited residence of Shaheed Lieutenant Colonel Asif Ali Awan and highlighted the sacrifices rendered by martyrs while safeguarding motherland.\nDuring the visit, he met with the family members of the martyred officer, paid tribute to the Shaheed and expressed his deepest condolences.\nMinister of State for Information Technology and Telecommunication Shaza Fatima Khawaja stressed the importance of national unity in the fight against terrorism, urging all citizens to play their part.\nHer remarks came during a visit to the family of Captain Muhammad Ali Qureshi Shaheed in Walton, Lahore, where she offered condolences and paid tribute to the fallen hero.\nAdvisor to the Prime Minister on Political and Public Affairs, Rana Sanaullah, visited the residence of Shaheed Captain Nawab Zada Jazib Rehman and met with his family to pay homage to the martyred soldier.\n“It is an honour to meet the family of a Pakistan Army Shaheed,” Sanaullah said, acknowledging the ultimate sacrifice made by Captain Nawab Zada.\nFederal Minister for Kashmir Affairs and Gilgit-Baltistan, Engineer Amir Muqam paid tribute to the martyrs who laid down their lives for the defence of the nation at Haveli Kahuta during a wreath-laying ceremony.\nHe attended a ceremony held to mark Pakistan’s Defence Day, honoured soldiers Sepoy Raja Vilayat Khan, Sepoy Muhammad Bashir, Sepoy Alam Din, and Sepoy Abdul Majeed, who died defending the country.\nFederal Minister for Law, Justice & Human Rights, Senator Azam Nazeer Tarar, visited the house of Major Humayun Jahanzeb Shaheed and met his family and paid homage to the martyr.\nMajor Humayun Jahanzeb was martyred in a helicopter crash near Mansehra on August 6, 2015 during a mission.\nFederal Minister for Petroleum, Dr. Musadik Malik, visited the residence of Shaheed Major Usman Ullah to pay his respects and offer condolences to the family.\nMajor Usman Ullah embraced martyrdom on August 6, 2015, during a rescue mission when his helicopter crashed in Mansehra. In recognition of his bravery and service to the nation, he was posthumously awarded the Tamgha-i-Basalat.\nInterior Minister Mohsin Naqvi visited the residence of Shaheed Lieutenant Abdul Moeed at Lahore.\nDuring the visit, he met the martyr’s mother and brothers, Abdul Hanan and Abdul Mateen, and expressed solidarity with them.",
  "retrievedAt": "2025-08-10T20:51:48.955Z"
}
