{
  "title": "Stipulated seasonal discharge of water from Mangla Dam begins",
  "link": "https://www.app.com.pk/national/stipulated-seasonal-discharge-of-water-from-mangla-dam-begins/",
  "date_published": "2023-10-04T09:49:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): Oct 04 (APP): Besides the advent of seasonal power generation, the stipulated normal discharge of water from the country’s biggest Mangla dam has begun as the water level in the reservoir fell to 1223.30 feet against the maximum conservation level of 1242 feet with live storage of 5.924 MAF on Wednesday.\nAs a result of the continual due inflow of water during the ongoing season, the water level in the country’s largest reservoir Mangla Dam was recorded as 1223.30 feet after the discharge of 18.70 feet of water from the reservoir by Wednesday.\nMangla Dam stands the biggest reservoir in terms of water storage in the country, and was filled to its maximum conservation capacity of 1242 feet, on August 17 as seasonal impounding of the reservoir. official sources told APP on Wednesday.\nAt present 5.924 million acre-feet (MAF) water is available in the Mangla dam reservoir, the media wing of WAPDA told the news agency.\nThe inflows of Jhelum river at Mangla reservoir was recorded as 12100 cusecs with outflows of the same 40000 cusecs of water from the dam.\nAt the same time, the position of the river inflows and outflows at Tarbela, Mangla and Chashma along with the reservoir levels and the barrages remained on Wednesday as under:-\nRivers: Indus at Tarbela: Inflows 46500 cusecs and Outflows 85000 cusecs, Kabul at Nowshera: Inflows 12300 cusecs and Outflows 12300 cusecs, Khairabad Bridge: Inflows 63900 cusecs and Outflow 63900, Jhelum at Mangla: Inflows 12100 cusecs and Outflows 40000 cusecs, Chenab at Marala: Inflows 18100 cusecs and Outflows 5900 cusecs.\nBarrages: Jinnah: Inflows 97900 cusecs and Outflows 89900 cusecs, Chashma: Inflows: 98100 cusecs and Outflows 95000 cusecs, Taunsa: Inflows 99400 cusecs and Outflows 83500 cusecs, Guddu: Inflows 105900 cusecs and Outflows 90300 cusecs Sukkur: Inflows 88600 cusecs and Outflows 43900 cusecs Kotri: Inflows 43300 cusecs and Outflows 13900 cusecs Trimmu: Inflows 22900 cusecs and Outflow 5400 cusecs Panjnad: Inflows 25900 cusecs and Outflows 8700 cusecs.\nReservoirs (Level and Storage):\nTarbela: Minimum operating level 1402 feet, present level 1536.36 feet, maximum conservation level 1550 feet, live storage today 5.034 MAF.\nMangla: Minimum operating level 1050 feet, present level 1223.30 feet, maximum conservation level 1242 feet, live storage today 5.924 MAF.\nChashma: Minimum operating level 638.15 feet, present level 642.90 feet, maximum conservation level 649 feet, live storage today 0.076` MAF.\nThe inflows and outflows of River Indus at Tarbela, Jinnah and Chashma, River Kabul at Nowshera and River Jhelum at Mangla have been reflected as mean flows of 24 hours, whereas the other flows have been gauged at 6.00 a.m. Wednesday.",
  "retrievedAt": "2025-08-11T09:57:00.668Z"
}
