{
  "title": "ECP issues Code of Conduct for international observers, media",
  "link": "https://www.app.com.pk/national/ecp-issues-code-of-conduct-for-international-observers-media/",
  "date_published": "2023-10-04T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 4 (APP):The Election Commission of Pakistan has issued a concise 30-point Code of Conduct for international observers and media during elections, emphasizing impartiality, respect for local laws and culture, responsible reporting, and security and violations may lead to accreditation withdrawal by the Commission.\nThe code of conduct instructs international observers to rigorously adhere to local laws, and show respect for Pakistan’s sovereignty and cultural norms.\nIt forbids actions that might sway voters, acceptance of gifts from political entities, and making personal remarks about the election. Additionally, it provides guidelines for responsible reporting and underscores the significance of security measures.\nAny individual or member of a local group or international election observation mission, who is observing and reporting on the electoral process must thoroughly read and comprehend this Code of Conduct. They are also required to sign a pledge that is attached to this Code.\nInternational observers and media personnel visiting Pakistan are required to follow the visa application procedures outlined by the government and must not exceed the authorized visa duration. Their conduct should respect Pakistan’s sovereignty and the fundamental rights and freedoms of its people.\nInternational observers and media representatives in Pakistan must comply with the nation’s constitution and laws, as well as respect the authority of the Election Commission and its officials. They are obligated to maintain impartial, objective, and highly accurate observations and reporting.\nObservers must heed instructions from the Election Commission and state authorities, maintaining a respectful demeanor toward them. Additionally, they should adhere to government and security agency advisories aimed at ensuring their safety during their stay in Pakistan.\nObservers must demonstrate professionalism and cultural respect while displaying their official identification badges or accreditation cards issued by the Election Commission of Pakistan, complying with requests from electoral officials and relevant authorities.\nObservers must maintain complete political impartiality throughout the election process, refraining from any bias or preference toward political parties or candidates.\nThey should adhere to photography rules and restrictions, while retaining the right to ask questions and seek clarification without obstructing any pre-election, election, or post-election procedures. Observers are also expected to collaborate harmoniously with fellow observers, media personnel, and polling staff.\nObservers must consult with the Election Commission of Pakistan to select areas for election observation while prioritizing their security. Nevertheless, they should aim for balanced observation and reporting in their area choices. If needed, observers may employ Pakistani interpreters, but they must furnish all necessary information about these interpreters during the accreditation card application process.\nInterpreters hired by observers should remain impartial and unprejudiced.\nThey have the freedom to observe and report all aspects of election management, including the actual polling day, without intervening in the proceedings at polling stations.\nFurthermore, observers must avoid personal and professional relationships that might create conflicts of interest with their roles as observers and reporters.\nObservers must refrain from accepting gifts or favors from any individuals, organizations, or political parties involved in the electoral process.\nThey are prohibited from wearing, carrying, or displaying partisan symbols or colors. Furthermore, observers should avoid making personal comments about their observations or conclusions to the media and should not engage in activities that could give the impression of favoring or opposing any political party or candidate.\nContent featured in international print and electronic media, as well as any international media personnel, newspapers, digital media channels, and other influencers on international social media platforms, should not contain elements that promote parochialism, jeopardize the nation’s peace and security, or incite hatred or violence against any specific individual or group within Pakistan.\nSimilarly, this content should avoid any form of personal attacks against candidates or political parties in Pakistan based on factors such as gender, religion, sect, caste, or social background.\nInternational media, including radio, television, and print, should refrain from publishing content that could harm public opinion about a particular political party or candidate in Pakistan. They must report only officially authenticated election results from the Returning Officer or the Election Commission of Pakistan.\nObserver organizations should share their findings with the Election Commission, and the government and law enforcement agencies are tasked with ensuring the safety of international observers and media personnel.\nThe Election Commission of Pakistan (ECP) specifies that this code of conduct extends to the official social media accounts of international newspapers, channels, media individuals, and social media influencers.\nInternational print, electronic, and digital media entities and influencers on their official digital media platforms should abstain from conducting entrance and exit polls or any surveys in polling stations or constituencies that could potentially impact voters’ free choice during the election process.\nThe Election Commission of Pakistan retains the authority to withdraw observer accreditation from both individual observers and observer missions, as well as individual journalists and media organizations, in the event of a violation of this Code of Conduct.\nThe Election Commission also holds the responsibility of determining such violations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:57:12.053Z"
}
