{
  "title": "Education in nation-building is as essential as foundation stone: Mushaal",
  "link": "https://www.app.com.pk/national/education-in-nation-building-is-as-essential-as-foundation-stone-mushaal/",
  "date_published": "2023-10-04T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 4 (APP): Mushaal Hussain Mullick Special Assistant to Prime Minister (SAPM) on Human Rights and Women Empowerment on Wednesday made it clear that the role of education in nation-building is as essential as the foundation stone and our young generation through education can play a significant role in the uplift and development of the country.\n“We can create awareness about human rights only through education,” she added.\nThe SAPM made these remarks while speaking as a chief guest at a ceremony titled the Millennium Education One World Campus, E-11/4 Islamabad hosted by Student Council Investiture Ceremony and High Achievers Awards 2023 aimed at encouraging young individuals to regularise the student body and become responsible citizens.\nShe said that it was next to impossible to enslave educated people; hence the Indian notorious fascist government was making all-out efforts to deprive the people of education through various coercive tactics.\nMushaal stated that the occupation authorities were well aware of the power of education that a war-like situation was created and a curfew was placed in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) under a well-conceived plan so that parents could not send their children to educational institutions because of fear of their detention and torture at the hands of brutal Indian forces.\nEnlightening the Millennials about progressive education, she said education is not only the name of getting marks but also the name of improving the different abilities of the students.\nMushaal encouraged the learners to work hard and put their best efforts towards their respective clubs and societies.\nHighlighting the role of education in breaking the shackles of slavery, the SAPM on Human Rights and Women Empowerment said that Sir Syed Ahmed Khan laid the foundation stone of the Aligarh College which became the focal point of the Muslim activities during the Pakistan movement that eventually led to creation of Pakistan.\nSimilarly, Mushaal shed light on the role played by Allama Muhammad Iqbal’s poetry in awakening the youth, who, she said offered immense hope to the young because his imagery of the dawn to come is emphatic, adding that Iqbal emphasized the youth, “See your present in the light of the past.” “Iqbal’s message was very clear: he meant that the\n“New Dawn” could only come from the modern youth who are capable of overthrowing the shackles of external materialism and reawakening their inner fire,” she added.\nTherefore, Mushaal underlined that it was high time to focus on education for the progress and prosperity of the country.\nThe SAPM on Human Rights and Women Empowerment said: “We are proud of our children who have made Pakistan famous in “OA” levels.\nDuring the ceremony, Mushaal, CEO of Roots Millennium Schools, Chaudhry Faisal Mushtaq, Sabina Zakir Director of Communications, Community, and Outreach of The Millennium Education Group, awarded sashes to all the members of the council inclusive of members of Millennium Clubs and Societies.",
  "retrievedAt": "2025-08-11T09:56:44.445Z"
}
