{
  "title": "Climate change hits Pakistan’s elderly population most: George",
  "link": "https://www.app.com.pk/national/climate-change-hits-pakistans-elderly-population-most-george/",
  "date_published": "2023-10-04T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP): Caretaker Federal Minister for Human Rights Khalil George on Wednesday at a seminar on Older People Day Tuesday said the devastating climate change impacts massively affected the elderly population of the country which was unable to protect itself from natural disasters.\nHe was addressing the HelpAge International Pakistan national seminar held in collaboration with the Ministries of Human Rights (MHR) and Climate Change here, focusing on the theme “Climate Change and its Impact on Older People.”\nThe International Day of Older People observed annually on October 1st, serves as a platform to highlight the challenges faced by older individuals globally while celebrating their invaluable contributions to society. This year’s event aimed to draw attention of climate change and the well-being of older people.\nGeorge said the country lost many of it’s senior citizens due to natural calamities due to climate change and COVID-19 pandemic which left the society deprived off it’s mentors and guiding forces.\nHe said love for elders is the proof of our success in the world and raising awareness among the youth to prevent elder abuse is an important task.\nHe added that the government had initiated many positive initiatives to ensure the rights of the elderly people which should be promoted and endorsed by the society.\n“It is the responsibility of the government to provide the basic needs of the nation. We are doing positive work to give relief to the elderly We have to work together to achieve this goal. Our ministry always stands with the oppressed,” he added.\nThe main objectives of the International Day of Older People’s observance are to raise awareness about the specific challenges faced by older individuals in the context of climate change, advocate for policies prioritizing the protection and well-being of older people in a changing climate, recognize and celebrate the contributions of older individuals in climate action and sustainable development.\nVice Chancellor of Government College University Lahore, Dr. Asghar Zaidi was the keynote speaker at the event where he addressed the audience on Ageing and Demographic Transition in Pakistan.\nHe added: “As we stand at the cliff of environmental challenges, it is crucial that we turn our attention to the often overlooked and vulnerable demographic of older individuals. Failing to do so is like knowingly awaiting a devastating tsunami, whose arrival we have been forewarned of. The time to commence preparations is not tomorrow, but today.”\nPanel Discussion was held on Climate Change and Vulnerabilities for Older Individuals, a group of experts came together to explore and discuss the multi-layered challenges faced by older individuals in the wake of a changing climate.\nThe panelists included the chairperson of the National Humanitarian Network (NHN) – Pakistan, Muhammad Amad, Country Coordinator at Pakistan Humanitarian Forum (PHF), Syed Shahid Kazmi, National Advisor/National Coordinator at the National Adaptation Plan project of the Ministry of Climate Change and United Nations Environment Programme, Arshad Samad Khan and Dr Sumaira from NUST. The panel discussion was moderated by Ms. Javeria Afzal.\nThe discussion shed spotlight on a range of critical aspects, including the vulnerabilities, health concerns, and risks to livelihoods that older individuals face because of climate change.\nDiverse participants from the Ministries of Human Rights and Climate Change, National Disaster Management Authority (NDMA), Civil Society Organisation, various donor organizations, UN agencies, academic institutions, media, representatives from Older People’s Associations (OPA), and the pensioners group graced the event with their presence.\nCountry Director, HelpAge International-Pakistan, Syed Moeez Kakakhel shared his insights as: “To address the issues, we must work collectively to ensure that older people are included in climate action strategies and adaptation plans. We must take steps to protect their health, well-being, and living conditions in the face of a changing climate.”\nHelpAge International is a global network of organizations working towards a world where older people can lead dignified, healthy, and secure lives. With over 150 members in 90 countries, HelpAge supports older people in the face of poverty, discrimination, and neglect.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:57:07.324Z"
}
