{
  "title": "PM arrives in Qatar for daylong visit to express solidarity following Israeli airstrikes",
  "author": null,
  "content": "DOHA, Sep 11 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday arrived here on a day-long visit to express solidarity with Emir of Qatar Sheikh Tamim bin Hamad Al Thani, the Qatari royal family, and the Qatari people following the Israeli airstrikes in residential areas of the Qatari capital city.\nUpon his arrival at Doha Airport, the prime minister was received by Deputy Prime Minister and Minister of State for Defense Affairs of Qatar Sheikh Saoud bin Abdulrahman bin Hassan Al Thani.\nThe prime minister was accompanied by a high-level delegation including Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, Defence Minister Khawaja Muhammad Asif, Minister for Information and Broadcasting Attaullah Tarar, and Special Assistant Tariq Fatemi.\nDuring the visit, Prime Minister Shehbaz will meet with Emir of Qatar Sheikh Tamim bin Hamad Al Thani, and express solidarity with him as well as the people of Qatar in wake of the unjustified Israeli aggression on Qatar in blatant violation of international laws.\nThe prime minister will also convey to the Qatari leadership that Qatar and Pakistan share longstanding, fraternal ties rooted in shared faith and values, and that Pakistan always stood by Qatar in challenging times and will continue to do so.\nTheir meeting will also include consultations on Israel’s unwarranted attacks on various countries in the region, its ongoing aggression, and efforts to establish peace in the region.\nThe visit underscores Pakistan’s unwavering support for the security and sovereignty of Qatar and its commitment to peace and stability in the Middle East.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:49:14.083Z",
  "source": "APP",
  "link": "https://www.app.com.pk/global/pm-arrives-in-qatar-for-daylong-visit-to-express-solidarity-following-israeli-airstrikes/",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T13:46:00.000Z"
}
