{
  "title": "Wafaqi Mohtasib team holds Khuli Katchery  at Talagang",
  "author": null,
  "content": "ISLAMABAD, Sep 11 (APP):On the instructions of Wafaqi Mohtasib, Ejaz Ahmad Qureshi, a three-member team from the Wafaqi Mohtasib Secretariat comprising Advisor, Maj. Gen. (R) Haroon Sikandar Pasha, Consultant Khalid Sial and Liaison Officer, Hussain Ahmad Bokhari held an open court at Talagang, district Attock on Thursday wherein they heard public complaints against federal entities like WAPDA, Sui Gas, NADRA, BISP etc. A large number of people attended the Khuli Katchery and presented many complaints against the federal and provincial departments.\nThey complained that the road network in the city was in a very bad shape, needed full restoration as a number of electricity polls had also fallen here and there which had not been restored their original positions despite filing complaints with the departments concerned. Some of the complainants said that the electricity department never initiated action on a complaint unless the general public greased the palms of the officials concerned. A complainant disclosed that the line man concerned even transferred the funds intended for restoration of the damaged transformer to his personal account but the transformer is yet to be restored.\nThe Wafaqi Mohtasib team directed that an immediate inquiry be held to ascertain the facts in this case. Similarly, people complained that the electricity wires pass over the roof of their houses and this may result in any mishap. The team instructed that these should be immediately remove from the roof top to avoid any accident.\nA large number of complaints pertained to non-provision of electricity connection, non-installation of electricity transformer and excessive billing along with delay in issuance of CNIC and difficulties in getting financial support from the BISP.\nThe Wafaqi Mohtasib team issued on the spot instructions for prompt resolution of the public complaints pertaining to the federal government agencies and departments whereas it referred to the provisional bodies concerned the complaints relating to the Provincial Ombudsman.\nThe Khuli Katchery was attended by the local heads of the federal government agencies and departments, district administration officials along with the representatives of the press and media. Earlier, the Wafaqi Mohtasib’s officials also delivered an awareness lecture aimed at apprising the general public of the ways and means of utilizing the services offered by the Wafaqi Mohtasib’s institution particularly with regard to redressal of complaints relating to maladministration of the federal entities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:49:11.454Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/wafaqi-mohtasib-team-holds-khuli-katchery-at-talagang/",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T17:25:00.000Z"
}
