{
  "title": "Commander of Iraqi Air Force calls on Air Chief Marshal Zaheer Ahmed Baber Sidhu",
  "author": null,
  "content": "RAWALPINDI, Sep 11 (APP): A high-level defence delegation led by Lieutenant General Staff Pilot Mohanad Ghalib Mohammed Radi Al-Asadi, Commander of the Iraqi Air Force, called on Air Chief Marshal Zaheer Ahmed Baber Sidhu, Chief of the Air Staff, Pakistan Air Force, at Air Headquarters, Islamabad.\nThe meeting covered various prospects of cooperation between the two brotherly nations, with special emphasis on joint training, capacity building, and advancements in the aviation industry, according to an ISPR news release.\nUpon his arrival, a smartly turned-out contingent of Pakistan Air Force presented a Guard of Honour to Lieutenant General Staff Pilot Mohanad Ghalib Mohammed Radi Al-Asadi.\nDuring the meeting, the Chief of the Air Staff highlighted the deep-rooted religious and historic bonds between Pakistan and Iraq, describing them as the foundation of the enduring relationship between the Air Forces of the two countries. He reaffirmed the Pakistan Air Force’s commitment to extending unwavering support to the Iraqi Air Force in the training domain.\nThe Air Chief also reassured the visiting dignitary that PAF would continue to support the Iraqi Air Force in its capacity-building endeavors.\nBoth Commanders concurred on conducting joint exercises and training initiatives aimed at bolstering interoperability and forging stronger operational synergy between the two Air Forces.\nThe Commander of the Iraqi Air Force conveyed his sincere appreciation for the warm reception and generous hospitality accorded to his delegation.\nHe commended the visionary leadership of PAF and acknowledged its transformation into a modern, professional and technologically advanced Air Force of the region.\nThe visiting dignitary conveyed the Iraqi Air Force’s strong desire to restructure its entire training system spanning from basic to advanced operational and tactical levels. Acknowledging PAF’s world-class training excellence, he sought support in building a modernized training paradigm for the Iraqi Air Force.\nThe Iraqi Commander also highlighted the aspiration of his force to benefit from exchange postings of PAF pilots, underscoring the immense value Iraqi aviators attach to learning directly from PAF’s combat-proven professionals.\nDeeply impressed by the innovative initiatives, indigenous capabilities and forward-looking vision showcased by PAF at the National Aerospace Science & Technology Park, he remarked that the Iraqi Air Force aspires to establish a similar ecosystem in Iraq, drawing inspiration from PAF’s model of integrating academia, industry and military needs under one umbrella.\nLater, the dignitary visited the National ISR & Integrated Air Operations Centre and the PAF Cyber Command, where he was briefed on the operational capabilities and technological initiatives of PAF.\nThe visit of this high level defence delegation from Iraq to Air Headquarters, Islamabad signifies a resolute commitment of both countries to reinforce their military partnership, fostering collaboration and promoting robust relations",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:48:49.132Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/commander-of-iraqi-air-force-calls-on-air-chief-marshal-zaheer-ahmed-baber-sidhu/",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T17:52:00.000Z"
}
