{
  "title": "PM directs 300-day climate action plan, says Minister Musadik",
  "author": null,
  "content": "ISLAMABAD, Sep 11 (APP):Federal Minister for Climate Change and Environmental Coordination Senator Musadik Malik said on Thursday that Prime Minister Shehbaz Sharif had directed the ministry to prepare a comprehensive 300-day implementation plan within the next 15 days to confront the escalating impacts of climate change, including risks from monsoon rains and glacial melting.\nAddressing a press conference, Malik said the action plan would be finalized in coordination with federal ministries, provincial governments, armed forces, NGOs, and welfare organizations.\n“We must act within our own resources, with the support of our civil administration, welfare institutions, and armed forces to safeguard our children and communities,” he stressed.\nFlanked by Chairman NDMA Lieutenant General Inam Haider Malik, the minister noted that Prime Minister Sharif, during a cabinet meeting, declared both a national climate emergency and an agricultural emergency.\nMalik explained the measures were preventive, aimed at reducing losses from next year’s monsoon season and glacial melt. “This is not unique to Pakistan. The entire world is changing, and all nations must wake up to this reality,” he said.\nDetailing the government’s flood response, Malik said more than 2.5 million people had been evacuated to safer areas in Punjab, while Sindh was receiving advanced warnings due to delayed water inflows.\n“From Sialkot to Narowal, Lahore, Shahdara, Jhang, and Sargodha, two major flood waves have already been tracked, with one now approaching near Head Punjnad,” he added.\nThe minister praised the contributions of NGOs and welfare groups, noting they had delivered over 2,000 tons of relief goods, while the military and provincial administrations were working in close coordination.\n“In times of national crises, we stand together—Punjab, Sindh, Khyber Pakhtunkhwa, Gilgit-Baltistan, and Azad Jammu and Kashmir. This is a natural calamity, and we face it collectively as one nation,” he said.\nMalik said the detailed climate action plan would be completed within a month, reiterating the government’s commitment to resilience and preparedness.\n“We pray no such devastation ever comes again, but if it does, Pakistan will face it united, with preparation, resilience, and faith,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:48:25.648Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-directs-300-day-climate-action-plan-says-minister-musadik/",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T19:39:00.000Z"
}
