{
  "title": "Sardar Yousaf announces implementation of Hajj, Umrah Act to curb malpractice, protect Pakistan’s image abroad",
  "author": null,
  "content": "ISLAMABAD, September 11 (APP): Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Thursday said the government has approved the Hajj and Umrah (Regulation) Act 2024 and is going to implement in order to curb malpractice and protect Pakistan’s image abroad, stressing that no one would now be able to send beggars on Umrah.\nAddressing the pre-launch ceremony of the 3rd Pakistan Hajj and Umrah Exhibition 2025, the minister said some individuals in the past had misused religious travel by begging in Saudi Arabia, which tarnished the country’s reputation. “This will no longer be tolerated,” he asserted.\nSardar Yousaf emphasized that pilgrims represent Pakistan as ambassadors of their country and must strictly observe Saudi laws alongside performing religious duties. “Hajj is both a physical and financial form of worship, not a recreational or business trip,” he remarked.\nReflecting on his tenure from 2013 to 2018, he said significant reforms were introduced, including abolishing multiple Hajj categories and adopting a single transparent scheme, which helped resolve many complaints. He added that under his leadership, five Hajj operations were successfully carried out.\nThe minister explained that in line with Islamic financial principles, the ministry had previously decided to deposit pilgrims’ funds in a Shariah-compliant account at Meezan Bank, following consultation with renowned scholar Maulana Taqi Usmani.\nHe informed that for Hajj 2026, the federal cabinet had already approved the policy, allocating 70 percent quota for the government scheme and 30 percent for the private scheme. With applications received within the stipulated time, Pakistan will fully utilize its quota of 179,000 pilgrims next year.\nSardar Yousaf also underlined the economic potential of Hajj and Umrah, urging Pakistan to emulate China by boosting exports to Saudi Arabia during the pilgrimage season. He said the upcoming exhibition would help train master trainers, enhance bilateral cooperation, and contribute to strengthening the national economy.\nHe assured full support of the Ministry of Religious Affairs and Interfaith Harmony to Maassalama, the company organizing the exhibition, and pledged that efforts would be made to ensure the lowest possible Hajj package in 2026.\nHighlighting the importance of responsible conduct, the minister advised youth to use social media wisely and urged pilgrims to focus on worship during Hajj while avoiding unnecessary distractions.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:48:48.463Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sardar-yousaf-announces-implementation-of-hajj-umrah-act-to-curb-malpractice-protect-pakistans-image-abroad/",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T17:08:00.000Z"
}
