{
  "title": "Pakistan, UAE agree to strengthen anti-narcotics cooperation in high-level meeting",
  "author": null,
  "content": "ISLAMABAD, Sep 11 (APP):Federal Interior Minister Mohsin Naqvi met with Sheikh Zayed bin Hamad bin Hamdan Al Nahyan, Chairman of the United Arab Emirates’ National Anti-Narcotics Authority, at the Ministry of Interior on Thursday to discuss enhanced cooperation against drug trafficking.\nMinister Naqvi warmly welcomed Sheikh Zayed and his delegation, underscoring Pakistan’s commitment to combating narcotics as a national priority. Both sides held detailed discussions on anti-narcotics efforts and other matters of mutual interest, agreeing to expand bilateral collaboration in countering drug smuggling.\nTo facilitate closer coordination, Pakistan appointed DG Anti-Narcotics Force Major General Abdul Mueed as its focal person, while the UAE named Brigadier Taher Gharib as its special representative. Naqvi congratulated Sheikh Zayed on becoming the first chairman of the UAE’s newly established National Anti-Narcotics Authority and praised the move as a step toward deeper regional cooperation.\n“The establishment of this authority will significantly boost joint efforts between Pakistan and the UAE in combating narcotics,” Naqvi said, assuring Sheikh Zayed of Pakistan’s full support. He highlighted Pakistan’s frontline role in the fight against drugs, noting that over 400 suspects involved in trafficking to the UAE had been arrested and five tons of narcotics seized.\nNaqvi credited these successes to joint efforts and timely information sharing, while warning of an uptick in synthetic drug smuggling. “This is a war for the future of our generations, and defeat is not an option,” he emphasized.\nSheikh Zayed affirmed the UAE’s commitment to providing all possible cooperation to Pakistan in anti-narcotics operations, stressing the importance of strengthening bilateral collaboration to ensure a safer future for coming generations.\nThe UAE delegation included senior anti-narcotics officials from Abu Dhabi, Dubai, Sharjah, Ras Al Khaimah, Ajman, Fujairah, and Umm Al Quwain. Pakistani officials present included Minister of State for Interior Talal Chaudhry, the Federal Interior Secretary, Special and Additional Secretaries, DG Anti-Narcotics Force, and other senior representatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:49:38.432Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-uae-agree-to-strengthen-anti-narcotics-cooperation-in-high-level-meeting/",
  "dateList": "2025-09-11",
  "date_published": "2025-09-11T11:59:00.000Z"
}
