{
  "title": "Chairman Senate meets President of Italian Chamber of Deputies",
  "author": null,
  "content": "ISLAMABAD, May 20 (APP):Chairman Senate Syed Yousuf Raza Gilani on Tuesday held a productive meeting with Lorenzo Fontana, President of the Italian Chamber of Deputies (Speaker of the Lower House).\nDuring the meeting, Gilani highlighted the importance Pakistan places on its friendly relations with Italy, which are built on mutual trust and cooperation at multilateral forums.\nHe thanked Italy for its principled support within the European Parliament, said a news release.\nBoth leaders appreciated the longstanding friendship between their countries and reaffirmed their commitment to strengthening parliamentary cooperation and exchanges, viewing them as key to fostering people-to-people ties.\nGilani welcomed the recent visit of the Italian Interior Minister to Pakistan (6–7 May 2025) and noted the signing of a Memorandum of Understanding on Migration and Labor Mobility as a significant step forward.\nHe also briefed his Italian counterpart on the recent tensions with India, stating that Pakistan acted with restraint and in accordance with the UN Charter, defending itself responsibly.\nOn regional issues, the two sides exchanged views on Afghanistan. The Chairman said that Afghanistan is a brotherly country, and Pakistan wishes to see it stable, peaceful, and prosperous.\nSpeaker Fontana thanked the Chairman for the meeting and expressed interest in accepting the invitation extended by National Assembly Speaker Sardar Ayaz Sadiq for a bilateral visit to Pakistan.\nHe also underlined the importance of formalizing inter-parliamentary cooperation through an agreement between the two legislatures.\nThe meeting marked a significant step toward revitalizing high-level parliamentary engagement between Pakistan and Italy.\nBoth sides concluded the interaction by reaffirming their commitment to continued political and parliamentary dialogue.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:41:48.202Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chairman-senate-meets-president-of-italian-chamber-of-deputies/",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T14:33:00.000Z"
}
