{
  "title": "Israel’s expanded ground operation, plans to control Gaza threaten peace efforts: FO",
  "author": null,
  "content": "ISLAMABAD, May 20 (APP): Pakistan on Tuesday said that the expansion of Israeli ground operations in Gaza, as well as its announcement to “take control of all” of Gaza, posed a grave threat to efforts aimed towards achieving peace and stability in the region.\nForeign Office spokesperson Shafqat Ali Khan, in a statement, condemned in the strongest possible terms the continued Israeli aggression in Gaza, resulting in the deaths of dozens of Palestinians, as well as deliberate targeting of hospitals and other critical infrastructure, along with mass evacuation orders.\n“The expansion of Israeli ground operations in Gaza, as well as its announcement to ‘take control of all’ of Gaza, poses a grave threat to efforts aimed towards achieving peace and stability in the region. In addition, Israel also continues to deliberately obstruct critical humanitarian aid from reaching millions in dire need, which amounts to the imposition of collective punishment on the besieged Palestinian people,” he remarked.\nHe said that the UN Secretary-General, António Guterres, recently expressed his alarm at the prevailing situation, with one in every five people in Gaza facing starvation, and the entire population facing high levels of acute food insecurity and the risk of famine.\nThe spokesperson said that the latest actions by the occupying power yet again demonstrated Israeli impunity and its blatant disregard for international law and humanitarian principles.\nHe reiterated Pakistan’s call for the international community for an immediate end to Israel’s genocidal campaign, and to ensure a lasting ceasefire in Gaza. He also urged concrete steps towards the provision of unimpeded humanitarian supplies to millions of Palestinians in dire need, as well as to hold Israel accountable for its egregious crimes.\nSpokesperson Khan reaffirmed Pakistan’s unequivocal opposition to any attempts to displace the Palestinians from their ancestral lands, expand illegal Israeli settlements or to annex any part of the Occupied Palestinian Territory.\n“Pakistan reaffirms its unwavering support for the Palestinian people’s right to self-determination and calls for the establishment of an independent, viable and contiguous Palestinian state based on pre-1967 borders, with Al-Quds Al-Sharif as its capital,” he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:42:27.371Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/israels-expanded-ground-operation-plans-to-control-gaza-threaten-peace-efforts-fo/",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T10:42:00.000Z"
}
