{
  "title": "IHC Judges Transfer and Seniority Case; hearing to continue tomorrow",
  "author": null,
  "content": "ISLAMABAD, May 20 (APP):The Supreme Court has adjourned hearing of the Islamabad High Court judges’ transfer and seniority case until Wednesday, May 21.\nThe hearing was conducted by the five-member Constitutional Bench headed by Justice Muhammad Ali Mazhar. Other members of the bench included Justice Naeem Akhtar Afghan, Justice Shahid Bilal Hassan, Justice Salahuddin Panhwar, and Justice Shakeel Ahmed.\nDuring the proceedings, senior lawyer Hamid Khan, representing the Lahore High Court Bar, continued his arguments, stating that several legal aspects of judges’ transfers from high courts need thorough consideration.\nJustice Muhammad Ali Mazhar remarked that, in India, judges’ consent is not required for transfers, and such decisions are made in consultation with the Chief Justice. “In our system, however, obtaining a judge’s consent for transfer is a constitutional requirement,” he noted.\nJustice Naeem Akhtar Afghan observed that India follows a unified cadre system for high court judges, while Pakistan does not have a similar system for seniority. Justice Shakeel Ahmed added that in India, the seniority list for high court judges is uniform.\nHamid Khan argued that in India, consultation with the Chief Justice is mandatory prior to any transfer. He emphasized that consent is essential when transferring judges and that, under Section 3 of the Islamabad High Court Act, consultation is required before a transfer or new appointment. He further stated that the selection of judges for transfer must be based on merit and that the executive branch should not hold the authority to nominate judges for transfer. “This power should rest solely with the Chief Justice,” he asserted.\nHamid Khan also pointed out that instead of transferring judges to the Islamabad High Court, new appointments are often made. He noted that in a recent case, the acting Chief Justice was consulted regarding the transfer of a judge from Balochistan, but the advice for transfers was not approved by the Cabinet.\nFollowing the conclusion of Hamid Khan’s arguments, advocate Idrees Ashraf, representing the founder of PTI, began his submissions. He argued that the transfer notification did not mention the tenure of the transferred judges and claimed that such transfers could lead to discrimination among judges within the same high court.\nJustice Muhammad Ali Mazhar responded by asking if Article 25, which ensures equality before the law, should be considered in the process of judges’ transfers. He further inquired whether the counsel would be satisfied if the transfer tenure was fixed at two years, noting that the core issue remains the matter of seniority.\nThe court later adjourned the hearing until 9:30 AM on Wednesday, May 21.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:42:47.081Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ihc-judges-transfer-and-seniority-case-hearing-to-continue-tomorrow/",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T10:59:00.000Z"
}
