{
  "title": "Call, click or visit: ICT citizens get three ways to complain",
  "author": null,
  "content": "ISLAMABAD, May 20 (APP):Deputy Commissioner (DC) Islamabad Irfan Nawaz Memon is meeting citizens every day to directly address their problems and without needing a reference or appointment, residents can speak to him and get their complaints forwarded to the relevant officials on the spot.\nAccording to the spokesman of ICT administration here, Deputy Commissioner Irfan Nawaz Memon, is holding open court sessions daily to listen to public concerns and ensure immediate action by government officers present at the venue. These sessions aim to bridge the gap between the public and administration.\nTalking to APP, DC Memon said that any citizen can visit the open court without needing any recommendation. The purpose, he added, is to provide a platform where residents can raise their issues directly and find a timely response.\nTo make the process more accessible, the district administration has also shared a contact number — 051-9108084 — where citizens can register their complaints. The administration will review each complaint and take necessary steps for\nIn addition to the phone line, residents are also encouraged to use the Prime Minister’s Citizen Portal to file complaints. This platform allows users to share their concerns online, which are then sent to the relevant departments for action.\nAccording to DC Memon, public engagement is a key part of improving governance. By interacting with citizens on a daily basis, the administration can better understand the problems faced by different communities in the capital. He said the process is simple and open to all residents of Islamabad.\nHe explained that the open courts are helping to address a variety of issues including water supply, waste collection, road maintenance, encroachments, and official delays. Many of these complaints are resolved on the spot through coordination with relevant officers.\nThe DC said that citizen participation in these sessions is steadily growing, which shows the public’s interest in resolving local issues through direct communication. He noted that people from both urban and rural areas of Islamabad are attending the sessions, highlighting a wide range of problems from basic civic services to land and administrative matters.\nThe administration is also maintaining a record of all complaints received during the open courts, as well as through the phone and online portals. Follow-ups are being conducted to ensure that each complaint is addressed properly.\nDC Memon added that the aim of these efforts is to build a responsive and people-focused administration. He said that the complaints and suggestions gathered from these meetings are also used to improve service delivery across departments.\nHe encouraged citizens to continue using the available platforms to voice their concerns and help the administration in identifying areas that require attention. The DC assured that every complaint will be taken seriously and efforts will be made to resolve it within the shortest possible time.\nBy making these complaint mechanisms widely available, the district administration wants to ensure that every resident of Islamabad has the opportunity to report their problems and contribute to improving their surroundings.\nDaily public meetings, along with a complaint hotline and the Prime Minister’s Portal, offer multiple channels for communication between the administration and the people. These efforts reflect a growing trend toward more open and accessible local governance in the capital.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:42:12.970Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/call-click-or-visit-ict-citizens-get-three-ways-to-complain/",
  "dateList": "2025-05-20",
  "date_published": "2025-05-20T13:35:00.000Z"
}
