{
  "title": "Pakistan to benefit from agricultural expertise of Belarus: PM",
  "author": null,
  "content": "LONDON, Apr 13 (APP):Prime Minister Muhammad Shehbaz Sharif said Pakistan would benefit from the expertise of Belarus in the agriculture sector by undertaking joint ventures in the country for the agriculture machinery presently being manufactured in Belarus.\nTalking to journalists here Sunday, he said his visit to Belarus was beneficial and successful.\nHe said Allah Almighty had blessed Pakistan with minerals wealth, adding in Belarus, he visited a factory making machinery related to mines and minerals and with the grace of Allah cooperation would also be furthered in this field.\nAn understanding was reached with Belarus for sending 150,000 skilled Pakistani youth to Belarus and they would be sent purely on merit, he added.\nHe said Punjab Speed was Pakistan Speed, which had now become Super Pakistan Speed.\n“We are serving the nation under the leadership of Mian Muhammad Nawaz Sharif. God willing, Pakistan, which is progressing and rapidly moving towards prosperity, is our destination,” he added.\n“God willing, we will achieve this destination with collective efforts, hard work of day and night and with the prayers of the whole nation,” he remarked.\nThe prime minister said he always called Afghanistan a brotherly neighbouring country.\n“We always have to live like neighbours. It depends on us whether we live as good neighbours or cause conflicts,” he continued.\nShehbaz Sharif said, “Numerous times we gave message to the Afghan interim government that according to the Doha agreement, they will not allow the use of land of Afghanistan for terrorism in any way.”\n“But unfortunately, TTP, ISKP and other terrorist organizations operate from there and they have martyred innocent people of Pakistan,” he noted.\nThe prime minister said the sacrifices rendered by people, armed forces, police and other law enforcement agencies would not go in vain.\n“It is my sincere advice to Afghanistan that it should immediately rein in the terrorist organizations and should not allow use of its land by these elements,” he added.\nHe said, “Today Overseas Convention has started and Alhamdullilah it will be a large historic convention. Overseas Pakistanis are coming to their home Pakistan.”\nOverseas Pakistanis work day and night and shine the name of Pakistan and send remittances of billions of dollars every year, he added.\n“This year the remittances sent by overseas Pakistanis increased considerably,” he said, adding convention will be a great opportunity to talk to them.\nHe said he would listen closely to the just demands of overseas Pakistanis and would implement them speedily as much as possible.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:26:52.293Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-to-benefit-from-agricultural-expertise-of-belarus-pm/",
  "dateList": "2025-04-13",
  "date_published": "2025-04-13T14:18:00.000Z"
}
