{
  "article_id": "2025-01-09_c0428bb0874b5e8d41d36e0724799347",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/successful-intl-conference-on-girls-education-to-commence-on-saturday-dr-khalid-siddiqui/",
    "retrieved_at": "2025-08-27T11:29:39.405Z"
  },
  "metadata": {
    "title": "Intâl conference on girlsâ education to commence on Saturday: Dr Khalid Siddiqui",
    "author": null,
    "date_published": "2025-01-09T13:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 459,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 9 (APP): Minister for Federal Education and Professional Training (MoFEPT), Dr Khalid Maqbool Siddiqui on Thursday said it was significant development that ministry would organize International conference on girlsa education in Muslim countries from January 11 to 12 in federal capital. Addressing a press conference, the minister said that International conference would jointly organized by the MoFEPT and the Muslim World League (MWL) with aims to address challenges and opportunities of girlsa education. He said that Pakistan was taking lead to host international conference to promote and project girlsa education among Muslim communities and the ministry under special directives of Prime Minister Muhammad Shehbaz Sharif had already sent invitations to 57 counties which was confirmed by the 48 countries. He further said that the conference would be attended by leaders, policy makers, diplomats, religious scholars, educationists, and experts from Muslim countries who were at the forefront of driving educational reforms to further streamline the system. Dr Khalid Maqbool apprised that the prestigious event will be presided over by the Prime Minister Muhammad Shehbaz Sharif. The conferenceas keynote address would be delivered by Nobel Laureate and globally acclaimed advocate for girlsa education Malala Yousafzai, he added. He said, aGirls education in a state of emergency in Muslim counties and holding the international conference would not only pave the ways to promote girlsa education but also give a platform for initiating actionable programs and devising strategic solutions to address harness opportunities to advance womenas education in such countries.a The minister underscored that the conference would drew attention of all Muslim countries of the world and the move would help and demonstrate the transformative impact of education. He said besides federal ministers, provincial ministers and chief ministers would also attend the conference to make it successful, adding that education was a biggest asset and weapon of the men and women, it was foremost responsibility of them to impart education for better home, coming generations, and society to survive a life with dignity. He emphasized that successful holding of the conference would give a strong message to world that Muslim countries believed in girlsa education and putting obstacles in that regard. aEducation is a cornerstone of progress and development within Muslim counties while the girlsa educations hold immense transformative potential.a The minister said that the government was focusing on training human resources through such project to get desired result especially in education sector. Replying to a question, he said that no compromise would be made on corruption especially in education ministry and all the funds would be utilized in a transparent manner. He said that formal invitation had already been sent to Afghanistan to participate in the International conference and expressed the hope that its representative would attend in this regard.",
    "summary": "A two-day international conference on girls' education in Muslim countries is set to commence on Saturday, with the aim of promoting and projecting girls' education among Muslim communities. The conference will be attended by leaders, policy makers, diplomats, religious scholars, educationists, and experts from Muslim countries. Nobel Laureate Malala Yousafzai will deliver the keynote address.",
    "keywords": [
      "girls' education",
      "Muslim countries",
      "International conference",
      "Malala Yousafzai",
      "Dr. Khalid Maqbool Siddiqui",
      "Prime Minister Muhammad Shehbaz Sharif"
    ]
  },
  "entities": {
    "people": [
      {
        "name": "Dr. Khalid Maqbool Siddiqui",
        "wiki_data_id": "Q19810888",
        "sentiment": "Positive"
      },
      {
        "name": "Malala Yousafzai",
        "wiki_data_id": "Q17753425",
        "sentiment": "Positive"
      }
    ],
    "organizations": [
      {
        "name": "Muslim World League (MWL)",
        "wiki_data_id": null
      },
      {
        "name": "MoFEPT (Ministry of Federal Education and Professional Training)",
        "wiki_data_id": null
      }
    ],
    "locations": [
      {
        "name": "Pakistan",
        "wiki_data_id": "Q15154"
      },
      {
        "name": "Islamabad",
        "wiki_data_id": "Q1498"
      }
    ]
  }
}