{
  "article_id": "2025-01-09_a1b9f4e8cbde70d9f1ceafbdf0256987",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-serves-notices-in-plea-seeking-cases-details-against-rauf-hassan/",
    "retrieved_at": "2025-08-27T11:30:06.080Z"
  },
  "metadata": {
    "title": "IHC serves notices in plea seeking cases details against Rauf Hassan",
    "author": null,
    "date_published": "2025-01-09T10:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 182,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 9 (APP): The Islamabad High Court (IHC) on Thursday served notices to the Interior Ministry and other respondents in a case seeking details of FIRs registered against PTI leader Rauf Hassan. The court sought response from the respondents till January 30, and adjourned the case. IHCas Justice Mohsin Akhtar Kayani heard the case wherein petitioneras lawyer Ayesha Khalid Advocate appeared before the court. The lawyer contended that there could be some hidden cases against his client and prayed the court to issue directives to the authorities for provision of the details regarding total registered cases. She also requested the court to stop the potential arrest of Rauf Hassan in any case till the judgment on this case. The court inquired that why the petitioner didnat sought information under information act. The petitioner has sought information from provinces as well and it also not named federation as respondent in the case, the bench noted. The court asked the petitioner to also name federal government as respondent in the case. The further hearing of the case was then adjourned till January 23.",
    "summary": "The Islamabad High Court has served notices to the Interior Ministry and other respondents in a case seeking details of FIRs registered against PTI leader Rauf Hassan.",
    "keywords": [
      "PTI",
      "Rauf Hassan",
      "Islamabad High Court",
      "Interior Ministry",
      "Justice Mohsin Akhtar Kayani"
    ]
  },
  "entities": [
    {
      "type": "ORGANIZATION",
      "name": "PTI",
      "wikiDataId": null,
      "sentiment": "Neutral"
    },
    {
      "type": "LOCATION",
      "name": "Islamabad",
      "wikiDataId": null,
      "sentiment": "Neutral"
    },
    {
      "type": "PERSON",
      "name": "Rauf Hassan",
      "wikiDataId": null,
      "sentiment": "Negative"
    },
    {
      "type": "PERSON",
      "name": "Justice Mohsin Akhtar Kayani",
      "wikiDataId": null,
      "sentiment": "Neutral"
    },
    {
      "type": "PERSON",
      "name": "Ayesha Khalid Advocate",
      "wikiDataId": null,
      "sentiment": "Neutral"
    }
  ]
}