{
  "article_id": "2025-01-09_9f95411c7f326c441b70a462491d7b96",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/zehri-incident-balochistan-government-orders-investigation/",
    "retrieved_at": "2025-08-27T11:30:46.237Z"
  },
  "metadata": {
    "title": "Zehri Incident: Balochistan government orders investigation",
    "author": null,
    "date_published": "2025-01-09T10:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 197,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "QUETTA, Jan 09 (APP):The Balochistan government has ordered a transparent and impartial investigation into the Zehri incident, directing a review of all aspects of the case. According to the Balochistan Home Department, strict action will be taken against the responsible elements. The spokesperson of Balochistan government clarified that the protection of the public and the restoration of the stateas writ are the governmentas top priorities. Taking notice of the local administrationas lack of immediate response to the Zehri incident, the Home Department has issued orders to activate the civil administration and prevent any further shortcomings. The spokesperson further said that law enforcement agencies are closely monitoring the situation, and measures to maintain peace and order have been further tightened across the province. The progress of the investigation will be reviewed on a daily basis to ensure that the true facts would revealed as soon as possible. The Home Department assured the public that the stateas writ is firmly established across the province, and no negligence or irresponsibility will be tolerated. According to the spokesperson, the government has taking steps to improve the performance of the civil administration in all districts to prevent such incidents in the future.",
    "summary": "The Balochistan government has ordered a transparent and impartial investigation into the Zehri incident, directing a review of all aspects of the case. The government has assured the public that the state's writ is firmly established across the province, and measures to maintain peace and order have been tightened.",
    "keywords": [
      "investigation",
      "Balochistan",
      "government",
      "Zehri incident",
      "public protection",
      "law enforcement agencies",
      "peace and order"
    ]
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}