{
  "title": "Religious Ministry ensures merit-based selection of Moavineen-e-Hujjaj : Dr.Tariq Fazal",
  "author": null,
  "content": "ISLAMABAD, Apr 14 (APP): Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry said on Monday that the Ministry of Religious Affairs and Interfaith Harmony selects Moavineen-e-Hujjaj strictly on merit.\nDuring the National Assembly’s question hour, he said the ministry follows a transparent and rigorous process to appoint staff for Hajj duties. A selection committee, led by a senior officer of Grade-20 or above, evaluates candidates based on well-defined merit-based criteria to ensure competence and fairness.\nHe informed the House that these assistants are deployed at key locations including Makkah, Madinah, Jeddah, and Saudi airports, where they help pilgrims and support the smooth delivery of Hajj services.\nTo further improve transparency and address past concerns, the ministry has partnered with the National Testing Service (NTS) to conduct the recruitment test for Moavineen-e-Hujjaj.\nThe minister said that NTS, along with other testing services like ATS, is a well-established and trusted institution that regularly conducts recruitment exams for government bodies.\n“In previous years, there were concerns about the selection process of Hajj support staff. To make it more merit-based and transparent, the Ministry has chosen NTS for recruitment,” he said.\nThis step, he added, is part of the Ministry’s broader strategy to institutionalize transparency, build credibility, and ensure a fair selection system for those sent to assist Pakistani pilgrims in Saudi Arabia.\nHe clarified that this measure is not limited to the current government but is part of ongoing efforts to improve Hajj operations and maintain public trust in national processes.\nDr. Tariq Fazal Chaudhry said the number of assistants is calculated according to the percentage of pilgrims allocated to Pakistan each year. “This year too, the number of Moavineen has been decided in proportion to the Hajj quota,” he added.\nHe explained that three main categories of personnel are sent to Saudi Arabia for Hajj operations. Moavineen-e-Hujjaj are not permanent employees of the ministry but are nominated by different government departments through the National Information Technology Board (NITB). They provide logistical and administrative support to pilgrims.\nSeasonal Duty Staff, he said, are regular employees of the Ministry of Religious Affairs with extensive experience in Hajj management. They supervise the implementation of Hajj arrangements and are often reappointed due to their performance and expertise.\nHe said that Medical Mission includes doctors from the Pakistan Army and other government healthcare institutions. They are responsible for providing medical care and emergency services to pilgrims in Makkah, Madinah, Jeddah, and at airports.\nAPP/zah-sra",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:28:07.742Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/religious-ministry-ensures-merit-based-selection-of-moavineen-e-hujjaj-dr-tariq-fazal/",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T12:44:00.000Z"
}
