{
  "title": "IMF mission calls on President SCBAP",
  "author": null,
  "content": "ISLAMABAD, Apr 14 (APP):A meeting between the President Supreme Court Bar Association of Pakistan (SCBAP), Mian Muhammad Rauf Atta, and the IMF mission was held today in Islamabad.\nOn the occasion, Mir Atta Ullah Langove and Barrister Sarfraz Metlo, Presidents of the High Court Bar Associations of Baluchistan and Sindh, respectively, were also present. The agenda of the meeting was to discuss issues such as judicial efficiency, contract enforcement, and property rights protection, etc.\nThe meeting, which lasted for more than one hour, covered extensive discussions on a range of issues, particularly the issue of judicial efficiency, which appears to be one of the core concerns of the mission.\nThe mission also shared its concerns regarding contract enforcement and property rights issues, directly affecting foreign investments. In this context, the President SCBAP provided a detailed and factual response to the mission’s queries.\nPresident SCBAP, while recognizing the importance of judicial efficiency, viewed that for a vibrant and independent judicial system, judicial efficiency is one of the basic prerequisites.\nHe apprised the mission that two important efforts are currently being made to enhance judicial efficiency, one on the judicial side and the other on the legislative side.\nOn the judicial side, he apprised the mission of the initiatives taken by the Chief Justice of Pakistan aimed at improving judicial efficiency, such as the introduction of an e-filing system replacing the orthodox filing system, revamping the case management system, expeditious disposal of pending cases, and the introduction of video link facilities in the Supreme Court. All these initiatives are directed toward improving judicial efficiency and eliminating hurdles in the process.\nAdditionally, efforts are being made to introduce the same initiatives in the higher and subordinate judiciary, the President stated.\nOn the legislative side, he apprised the mission that the recently introduced 26th Constitutional Amendment was made with the aim of improving judicial independence, enabling the judicial system to work more efficiently and effectively.\nIt was reiterated that under the amendment, a constitutional bench has been formed to address more complex high-profile political and constitutional cases, so as to save more time of the court for regular work without interruption.\nBesides that, an institutional system to check the performance of judges is already functioning.\nThe mission was also informed about other initiatives aimed at enhancing judicial efficiency, such as increasing the number of expert judges not only in the Supreme Court but also in the high courts, the introduction of a number of tribunals, especially in tax matters, and the creation of forums to resolve complex issues through Alternate Dispute Resolution (ADR) initiatives, ensuring that justice is served effectively at the grassroots level.\nRegarding the issues of contract enforcement, the mission was apprised that, albeit delays due to procedural inefficiencies, the government is trying its level best to provide a conducive environment to attract and secure direct foreign investment, and specialized courts and benches are being introduced to adjudicate these matters.\nAdditionally, it was mentioned that Articles 23 and 24 of the Constitution deal with the right to own property, and efforts are being made to strengthen anti-encroachment laws and enforcement mechanisms.\nThe meeting concluded with both sides agreeing that the recipe to resolve all the aforesaid issues lies in economic and political stability, and good governance, with the President of SCBAP describing the rule of law as the cornerstone.\nIn this context, a questionnaire containing queries related to the aforesaid matters will be shared with this Association by the mission, followed by a detailed response along with proposals and suggestions to be made by the other side.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:28:31.315Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/imf-mission-calls-on-president-scbap/",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T10:29:00.000Z"
}
