{
  "title": "Islamabad sees 20% drop in crime during four months",
  "author": null,
  "content": "ISLAMABAD, Apr 14 (APP):The Islamabad Police have reported a significant 20% decline in overall crime rates over the past four months, attributing the success to intensified law enforcement efforts under the leadership of Inspector General of Police (IGP) Syed Ali Nasir Rizvi.\nAccording to a police spokesperson, robberies, street crimes, vehicle thefts, burglaries, and other serious offenses have all decreased significantly, with 600 fewer criminal cases reported in early 2025 compared to the same period last year.\nIGP Rizvi stated that a well-coordinated strategy has been implemented, with daily operations targeting criminals, drug traffickers, and their networks.\nSpecial police teams have been deployed to dismantle drug syndicates, with a focus on shutting down drug dens and arresting suppliers and buyers.\n“Our mission is to eradicate this menace from society and protect our youth,” said IGP Rizvi. “Islamabad Police will not tolerate those poisoning our future generations.”\nIn a bid to strengthen community trust, senior officers are now holding daily open courts to address citizens’ concerns directly.\nIGP Rizvi urged the public to cooperate with law enforcement, emphasizing that a safer society requires collective effort.\nHe also paid tribute to officers injured in the line of duty, some of whom have been honored with the title of ‘Ghazi’ for their bravery. “When we wear this uniform, we pledge to serve and protect,” he said.\nThe IGP reaffirmed that protecting lives and property remains the top priority for Islamabad Police. With sustained efforts and public cooperation, the capital aims to become a model for crime-free urban policing.\n“A peaceful society is possible only when citizens and police work together,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:29:24.971Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/islamabad-sees-20-drop-in-crime-during-four-months/",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T17:43:00.000Z"
}
