{
  "title": "US Congress members term Pakistan visit a success, call for stronger bilateral ties",
  "author": null,
  "content": "ISLAMABAD, Apr 14 (APP):A delegation of visiting US Congress members has described their recent trip to Pakistan as highly successful and productive, expressing optimism for stronger Pakistan-US relations in the future.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/04/WhatsApp-Video-2025-04-14-at-1.54.07-PM.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nDuring their visit, the American lawmakers held meetings with senior political and military leadership of Pakistan, which they said would contribute to further strengthening bilateral ties.\nCongressman Jack Bergman highlighted the strategic importance of the Pakistan-US relationship, stating, “The significance of our partnership is undeniable and will remain relevant in the years to come.”\nHe underscored that the positive impact of enhanced cooperation would not be limited to Pakistan and the United States (US) but would also extend to other developing regions around the world.\n“We are working in specific sectors and promoting partnerships. One such critical area is mineral development,” Bergman said, adding that this collaboration would lay the foundation for robust industries that could benefit not only Pakistan but the global economy.\nHe further noted that new mining technologies and innovative products are essential for future industrial growth, and emphasized shared values between the two countries. “Our relationship is vital because both nations believe in the principles of freedom,” he remarked.\nCongressman Thomas Richard Suozzi began his remarks with a warm “Assalamualaikum” and thanked the Pakistani people for their hospitality. “The visit has been remarkable. We are grateful for the warm welcome extended to us,” he said.\nSuozzi called for building bilateral relations on strong foundations, acknowledging the role of the Pakistani diaspora in the US. “We see Pakistani immigrants as ambassadors who have excelled on American soil,” he added.\nHe praised Pakistanis as hardworking, educated, and family-oriented individuals, and stressed the importance of joint efforts to promote economic security and enhance economic activity between the two nations.\nCongressman Jonathan Luther Jackson also lauded the visit, saying, “I witnessed the spirit of faith, unity, and discipline in Pakistan.” He termed the visit a unique opportunity to strengthen ties based on shared history and mutual trust.\n“I firmly believe that Pakistan has a very bright future,” Jackson said, adding that he visited religious sites and met with top leadership in Pakistan.\nHe reaffirmed his commitment to deepening relations, expanding cooperation, and supporting Pakistan’s progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:28:32.408Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/us-congress-members-term-pakistan-visit-a-success-call-for-stronger-bilateral-ties/",
  "dateList": "2025-04-14",
  "date_published": "2025-04-14T09:37:00.000Z"
}
