{
  "title": "Govt to ensure more investment to achieve universal health coverage targets",
  "link": "https://www.app.com.pk/national/govt-to-ensure-more-investment-to-achieve-universal-health-coverage-targets/",
  "date_published": "2021-03-12T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP):Special Assistant to Prime Minister on National Health Services, Regulations and Coordination Dr Faisal Sultan on Friday said that effective measures are being adopted to ensure achieving targets of universal health coverage (UHC).\n“The government is working for expansion of universal health coverage (UHC) by investing in health systems, especially in Primary Health Care (PHC) and is committed to implement its agenda to achieve the target of UHC,” Dr Faisal said while chairing a meeting on Health Sahulat Program.\nHe reiterated the strengthening of Primary Health Care in the country and taking innovative steps to improve the health status of the population.\nHe assured expansion in coverage of the Sehat Sahulat Program, which will be instrumental in decreasing the financial burden on the poor and marginalized population and endorsement of the Universal Health Coverage Benefit Package.\nHe said that the government is working on developing strategies and plans for strengthening the PHC services and implementation of UHC plan.\nIn the wake of a sudden increase in the number of infections in the country during these days, Dr Faisal urged the public to strictly adhere to COVID-19 Standard Operating Procedures (SoPs) to effectively counter the disease.\nHe said, “The government is seeking public full cooperation in adhering to the SoPs. We can save precious lives including those of our near and dear ones by taking preventive measures.”\nHe urged citizens to wear mask, maintain social distance, wash hands with soap frequently and avoid crowded places.\nHe asked the provincial and district governments to enforce necessary preventing measures at public places and encouraging people to protect themselves and others from the virus by adhering to the SoPs.",
  "retrievedAt": "2025-08-11T20:28:57.042Z"
}
