{
  "title": "PDM’s politics doomed with Gilani’s defeat in Senate chairman election: Shibli",
  "link": "https://www.app.com.pk/national/pdms-politics-doomed-with-gilanis-defeat-in-senate-chairman-election-shibli/",
  "date_published": "2021-03-12T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP):Minister for Information and Broadcasting Senator Shibli Faraz on Friday said with the defeat of Yousaf Raza Gilani in the Senate chairman election, the politics of Pakistan Democratic Movement (PDM), which revolved around personal interests, had doomed.\nTalking to media persons here outside the Parliament House flanked with Senator Faisal Javed Khan, he said Prime Minister Imran Khan and his allies were striving to ensure transparency in the electoral process by moving a bill in the Parliament and sending a reference to the Supreme Court.\nHe said the PM had made all-out efforts to stop misuse of money, and sale and purchase of votes in the Senate election. Accordingly, the government introduced amendments in the relevant laws in the Parliament and also approached the apex court for open balloting , but the opposition parties opposed it.\nShibli Faraz said Imran Khan desired the country to move towards progress and prosperity, by eliminating the old system which had ruined the economy, ethics and democratic norms.\nOn the contrary, those who had opposed transparency in the electoral system were against the country’s progress, he said, adding the people should strengthen Imran Khan’s hands.\nGilani’s defeat was in fact the defeat of old corrupt system, and the narrative of corrupt politicians and their promoters, the minister remarked.\nHe said the PDM had started its so-called movement from a long march, and then gave a deadline for resignations from the assemblies, but nothing had happened so far.\nHe said the opposition parties made a malicious attempt to breach the secrecy of ballot, but it was exposed with the detection of hidden camera installed by them around the polling booth.\nSimilar drama was staged by their leaders outside the Parliament on the day of PM’s vote of confidence, he added.\nThe minister said with the blessings of Allah Almighty, Muhammad Sadiq Sanjrani, a brave and upright person, got a success, and those, who believed in malpractices, were humiliated with the replay their own rejected votes saga.\nThe Pakistan Muslim League-Nawaz should better question its own members whether they had availed the services of Ali Haider Gilani for getting their votes rejected, he added.\nShibli Faraz said the opposition parties’ corrupt practices could be judged from the fact they managed to win the Senate seat of Yousaf Raza Gillani despite minimum votes in the National Assembly.\nThe opposition leaders were apt in the ‘art of rigging’ as they had always been adopting various methods of manipulating the election process, he added.",
  "retrievedAt": "2025-08-11T20:28:47.569Z"
}
