{
  "title": "Senate defeat’s referendum on PDM narrative: Governor Punjab",
  "link": "https://www.app.com.pk/national/senate-defeats-referendum-on-pdm-narrative-governor-punjab/",
  "date_published": "2021-03-12T15:46:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 12 (APP):Governor Punjab Chaudhry Mohammad Sarwar on Friday said that victory of government candidates in the Senate Chairman and Deputy Chairman elections against Pakistan Democratic Movement (PDM) candidates was a referendum on opposition’s narrative of political instability and division.\nPTI-led government candidates Sadiq Sanjrani (48 votes) and Mirza Muhammad Afridi (54 votes) secured victory against their rivals Syed Yousuf Raza Gilani (42 votes) and Maulana Abdul Ghafoor Haidri (44 votes) of the PDM.\nIn a tweet, Governor Punjab Chaudhry Mohammad Sarwar hailed the success of both PTI candidates, adding that the success of Sadiq Sanjrani and Mirza Muhammad Afridi was triumph of democracy.\nHe said there was no doubt that the narrative of the opposition had been rejected even in the Senate elections and the opposition should now understand that their narrative of chaos and division would never be successful. He said the government had no threat from the opposition’s Long March, adding that the government was now stronger than ever.\nSarwar the government under the leadership of Prime Minister Imran Khan had emerged successful yet again and it had once again proved that the government and its ally political parties were strong and united.\nHe asked the opposition parties to prefer national interests to political interests and support the government in legislation for electoral reforms, adding that electoral reforms would further strengthen both democracy and parliament.\nThe Governor Punjab said the PTI government would complete its constitutional term and the general elections would be held on time. “I once again advise the opposition to rise above the politics of long marches and rallies and play a democratic role inside and outside the Parliament”, he added.\nAcknowledging support of the ally parties, Governor Punjab Chaudhry Mohammad Sarwar said the PTI government was thankful to the allies for their unconditional support, stressing that the government took the country forward on the road to prosperity.",
  "retrievedAt": "2025-08-11T20:28:44.917Z"
}
