{
  "title": "Rs. 325 bln reduction in circular debt targetted for next two years to benefit electricity consumers, PM told",
  "link": "https://www.app.com.pk/national/rs-325-bln-reduction-in-circular-debt-targetted-for-next-two-years-to-benefit-electricity-consumers-pm-told/",
  "date_published": "2021-03-12T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP):Prime Minister Imran Khan was told on Friday that electricity consumers would benefit from reduction of around Rs 325 billion in the circular debt due to the target set for next two years to check power sector losses and improve receipts.\nHe was presiding over a meeting regarding electricity prices, with special focus on the reduction of circular debt.\nFederal ministers Makhdoom Khusro Bakhtiar, Dr Abdul Hafeez Sheikh, Muhammad Hammad Azhar, Syed Fakhar Imam, Umar Ayub and Asad Umar, special assistants Nadeem Babar, Dr Waqar Masood and Tabish Gohar, former finance minister Shaukat Tareen, federal secretaries and other senior officers were in attendance.\nThe prime minister was briefed about the proposed strategy to check electricity prices as well as reducing the circular debt.\nThe meeting was told that as a result of the present government’s efforts, decreasing trend in technical and non-technical losses was witnessed and improvement in the receipts of electricity bills was also recorded.\nIt was further told that a strategy had also been formulated to further check transmission and distribution losses.\nThe prime minister, in his remarks on the occasion, said as the previous governments, besides establishing most expensive power projects, also neglected the aspect of curbing transmission and distribution losses as well as improving flaws in the system, and its burden was being faced by people.\nThe people were facing difficulties due to the mistakes committed in the past by the previous governments, he remarked.\nAbout the proposed strategy for bringing about improvement in the power sector, the prime minister directed to clearly determine the responsibilities of all relevant ministries for realization of the set targets and timely implementation of the measures.",
  "retrievedAt": "2025-08-11T20:28:47.395Z"
}
