{
  "title": "Moderate to heavy rain lashes capital; subsides fog",
  "link": "https://www.app.com.pk/national/moderate-to-heavy-rain-lashes-capital-subsides-fog/",
  "date_published": "2024-01-31T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP):Moderate to heavy rain lashed the federal capital, like other parts of the country, on Wednesday, bringing relief to the commuters who were bearing the persistent dense foggy conditions during the last month.\nThe rain continued from Tuesday night till Wednesday evening with occasional gaps and turned into heavy falls at times. The sudden hail storm also accompanied by heavy rain in the city at around 5:30 pm.\nThe city dwellers who had been facing month-long densest foggy conditions which was an unusual thing for them welcomed the rain which not only subsided the fog but proved to be beneficial for the standing crops.\nAccording to the Pakistan Meteorological Department, a westerly wave was affecting the western and upper parts of the country and likely to persist during the next few days.\nOn Thursday, cloudy weather with rain (snowfall over mountains) is expected in Gilgit Baltistan, Khyber Pakhtunkhwa, Islamabad, Potohar region, Upper Punjab, and Kashmir. Heavy rainfall/ snowfall is likely at isolated places in Kashmir, Gilgit Baltistan, Murree, Galiyat, and upper Khyber Pakhtunkhwa during the period.\nFog is likely at a few places in Punjab and upper Sindh. During the last 24 hours, mainly cold and Cloudy weather prevailed in most areas of the country.\nHowever, rain (with snowfall at isolated places) occurred in Kashmir, Islamabad, Northeast/central Punjab, Khyber Pakhtunkhwa, Karachi, Thatta and Ormara. Fog prevailed over plain areas of Punjab and upper Sindh.\nThe PMD has warned that snowfall over the upper parts of the country may affect transportation on January 31 and February 01 therefore the tourists are advised to be cautious.\nThe rainfall recorded was Kashmir: Muzaffarabad (Airport 34mm, City 33), Rawalakot 22, Garhi Dupatta 18, Kotli 08, Punjab: Rawalpindi (Chaklala 17, Kacheri 11, Shamsabad 07), Murree 10, Islamabad (Zero Point, Golra 08, Saidpur 07, Airport 06, Bokra 05), Mangla 08, Gujranwala, Jhelum 06, Sialkot (Airport 06, City 05), Gujrat, Mandi Bahauddin 04, Chakwal, Narowal 03, Hafizabad, Khanpur, Sheikhupura 02, Attock, Johar Abad 01, Khyber Pakhtunkhwa: Dir (Upper) 13, Kakul 09, Patan 07, Parachinar 06, Balakot, Charat 05, Drosh 04, Bacha Khan (Airport), Mir Khani 02, Chitral, Kalam, Peshawar, Saidu Sharif 01 Sindh: Quaidabad 08, DHA Phase Two 05, North Karachi 04, Kemari, Saadi Town, Nazimabad 03, Malir, Old Area (Airport), Masroor Base 02, Surjani Town, University Road, Faisal Base 01, Thatta 01, Balochistan: Ormara 01mm.\nThe snowfall recorded was 02 inches in Murree. The lowest minimum temperatures recorded during the last 24 hours were Leh -07C, Kalam, Gupis -05, Skardu -03, Hunza, and Rawalakot -02C.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:07:48.130Z"
}
