{
  "title": "NADRA, NIMC strengthen identity related services through partnership",
  "link": "https://www.app.com.pk/national/nadra-nimc-strengthen-identity-related-services-through-partnership/",
  "date_published": "2024-01-31T17:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP):Pakistan’s National Database and Registration Authority (NADRA) and Nigerian Identity Management Commission (NIMC) further strengthened its commitment and strategic partnership toward the Global Position in identity-related services.\nIn a significant move to expand its global presence, this collaboration marks a milestone as NADRA solidifies its position as the leading provider of identity solutions to the world’s third-largest demographic, encompassing Pakistan, Nigeria, Kenya, and Somalia, said a news release issued here on Wednesday.\nThe latest development in this partnership includes an agreement to further enhance their collaboration.  A recent contract between NIMC’s Project Implementation Unit (PIU) and NADRA focus on modernizing Nigeria’s existing middle-ware solution, paving the way for a more advanced identity ecosystem.\nThis contract, driven by a thorough pre-assessment and comprehensive recommendations, aims to enhance the efficiency, security, and interoperability of the National ID Back-end System. It supports NIMC’s plans to scale up enrolment and ID operations by utilizing cutting-edge technology for a robust National Identity system of Nigeria.\nThe collaboration between NIMC and NADRA is built on a trusted partnership spanning over 15 years. Both organizations actively work together to strengthen their operational frameworks for a more secure and efficient identification system. NIMC Nigeria has issued over 102 million National Identification Numbers (NINs) to Nigerian citizens, demonstrating the effectiveness of combined expertise in identity management.\nA high-level delegation from Pakistan’s National Database & Registration Authority (NADRA) recently met with Nigeria’s National Identity Management Commission (NIMC) to strengthen their ongoing collaboration.\nThe meeting, held at the NIMC headquarters in Abuja, focused on synchronizing project timelines and aligning key objectives to advance their shared goal of building robust and technologically advanced identity management systems.\nDirector General/CEO of the National Identity Management Commission (NIMC), Engr Abisoye Coker-Odusote, warmly welcomed the NADRA delegation. She expressed full support for the outlined goals of the NADRA visit and shared optimism about the future of this partnership.\nBeyond a formal agreement, this contract underscores NADRA’s unwavering commitment to international cooperation, transfer of technology, and knowledge exchange, further establishing Pakistan’s pivotal role in advancing global digital initiatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:06:56.800Z"
}
