{
  "title": "Caretaker minister taking steps for players development, sports promotion",
  "link": "https://www.app.com.pk/national/caretaker-minister-taking-steps-for-players-development-sports-promotion/",
  "date_published": "2024-01-31T15:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP):Caretaker Sports Minister for Punjab Wahab Riaz on Wednesday underlined the need to focus on investing players’\ndevelopment to achieve objectives in the sports sector.\nTalking to a private news channel, he said there is a need to redirecting focus towards investing in players rather than infrastructure development. He said that existing facilities across Pakistan are sufficient to move forward in the field of sports and its promotion.\nHe highlighted the steps being taken to promote sports activity in the provincial areas. He said, we  should make efforts to enhance financial security of athletes.\nWahab Riaz outlined ongoing measures taken for hockey development including renovation of Lahore hockey stadium at a cost of Rs. 30 crore. He mentioned that various camps have been organized to improve skills of hockey players. The “Rising Punjab Games” initiative aims at encouraging athletes from the provincial parts, and this year, the age limit condition has been removed to facilitate young participation. He stressed the significance of financial security for players and announced substantial prize money for sports promotion. In hockey, he said.\nthe winner will receive Rs25 lakh and Rs15 lakh for runners, while in table tennis, the winner will receive Rs15 lakh and the runner-up will get Rs10 lakh that indicating the Punjab government’s commitment to supporting athletes.\nAcknowledging caretaker Chief Minister Mohsin Naqvi’s vision for sports development, he highlighted the unprecedented work being done for sports in Punjab. The minister outlined initiatives including the distribution of 150 bikes to ground staff for improved mobility.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:07:30.166Z"
}
