{
  "title": "Speakers laud late Pervaiz Shaukat’s services for journalist community",
  "link": "https://www.app.com.pk/national/speakers-laud-late-pervaiz-shaukats-services-for-journalist-community/",
  "date_published": "2024-01-31T15:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP): Speakers at a condolence reference, organised to pay tributes to veteran journalist and trade union activist Pervaiz Shaukat, said that approval of new Wage Board Award and enactment and implementation of laws for the security and protection of journalists were the fruit of untiring struggle of the deceased.\nThey termed Pervez Shaukat’s life a role model for journalists and media workers.\nActing President of PFUJ-Workers Tahir Rathore, in his address, said that the journey of honesty, integrity and hard work set by late Parvaiz Shaukat would continue.\nHe said that Parvaiz Shaukat rendered selfless service for the journalist community.\nBesides Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi and Secretary Information and Broadcasting Shahera Shahid, senior leader of Pakistan Peoples Party Farhatullah Babar, former federal minister J. Salik, PFUJ Workers Vice President Dr Sadia Kamal and Information Secretary Abdul Razzaq Chishti, Parvaiz Shaukat’s brother Azhar Sohail, RIUJ Workers President Jahangir Aslam and Secretary Bilal Izzat, senior journalists Farooq Aqdas, Ayub Nasir, Farooq Faisal Khan, Zafar Mehmood Sheikh, Khawar Nawaz Raja, Mazhar Iqbal, Javed Malik, Shakeel Qarar, Rashid Habib, Sagheer Chaudhry, Namood Muslim, Anwar Zaidi, Farrukh Nawaz Bhatti, Akmal Shahzad, Farhat Fatima, Rana Adnan and other leaders addressed the reference.\nInformation Secretary Shahera Shahid said that the deceased always visited her office with the only agenda of the rights of workers.\nShe said that a successful persons could be remembered by celebrating his achievements.\nOther speakers said that the deceased lived a purposeful life, kept honesty as his motto and did not achieve his personal goals and positions by adopting the agenda journalism.\n“Parvaiz Shaukat was a true leader, and a compassionate and generous person,” they said, adding that they were proud that their brother, friend and leader had left behind a good name and character.\nThe deceased’s brother Sohail Azhar, and nephews Adeel Raza and Manhal said their family was grateful to his friends who had organized the event in his memory.\nThey called for renaming a road in the Capital as Pervaiz Shaukat Road in recognition of his services.",
  "retrievedAt": "2025-08-11T00:07:11.806Z"
}
