{
  "title": "Gohar urges overseas investors to tap Pakistan’s trade potential",
  "link": "https://www.app.com.pk/business/gohar-urges-overseas-investors-to-tap-pakistans-trade-potential/",
  "date_published": "2024-01-31T17:57:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 31 (APP): Caretaker Minister for Interior, Commerce, Industries, Overseas Pakistanis and Investment Dr Gohar Ejaz, encouraging the overseas investors to invest in the country, Wednesday said that Pakistan was poised to become a trillion dollar economy in a decade and investors should exploit the growth potential.\nAddressing foreign and local investors at the Overseas Chamber of Commerce and Industry, he urged the investors to grab the opportunity as “Pakistan is a gold mine, which is bound to go far ahead”.\nThe caretaker government during its short tenure, he said, had taken comprehensive and fundamental measures, even tough decisions, and those were giving remarkable results in economic and financial sectors with currency appreciation, growth in exports, declining imports, current account surplus and reviving confidence of investors.\nThe minister said the issue of depreciation in currency was dealt with by turning to basics, ensuring rule of law, and curbing misuse of the Afghan Transit Trade (ATT) and smuggling.\nThe Pakistan’s currency was now up by 2 percent, he said, adding that in seven months the capital market had also been showing positive results with 60 % increase in stock exchange.\nExports were also increasing as the target of $ one billion extra exports was achieved in just four months by only focusing on non- textile exports, he added.\nPakistan, he said, needed to tap the potential of other products and export substitution of textile and manufacturing products.\nHe urged the investors to focus on import substitution and bring the latest technologies to Pakistan.\nThe minister said that overseas companies working in Pakistan earned Rs 700 billion in the previous year and also contributed significantly to the taxes.\n“We respect and value our investors and are ready to do all possible to secure your investments,” he assured. “You are the best brains and professionals and could play an important role in promoting Pakistan around the world.”\nReferring to city and area based export development approach of China, the minister said that fruits and flowers of Gilgit, gems of Swat, cutlery of Wazirabad, sports products from Sialkot, pumps of Gujranwala and a number of other products form different cities could add up billions of dollars to the country’s exports.\nHe said the Commerce Ministry was working on the export policy aiming to facilitate export of specific areas which could earn billions of dollars. He invited the businessmen and investors to put forward their suggestions in that regard.\nHe said that different regions of the country would be divided into 39 divisions with regard to their recognized products. A trade commissioners would be deputed in each division to look into GDP and exports to asses the trade potential and business opportunities.\nEalier, OICCI Secretary Abdul Aleem briefed the meeting about the Chamber’s performance, primary focus areas and contribution in national economy, besides highlighting issues and recommendations.",
  "retrievedAt": "2025-08-11T00:06:40.833Z"
}
