{
  "title": "47 women to contest polls on general seats in Khyber Pakhtunkhwa",
  "link": "https://www.app.com.pk/national/47-women-to-contest-polls-on-general-seats-in-khyber-pakhtunkhwa/",
  "date_published": "2024-01-31T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP): For the first time in the history of Khyber Pakhtunkhwa province as many as 47 women candidates from different political parties will contest on general seats of National Assembly and Provincial Assembly in upcoming elections.\nAccording to data available with APP, the record increase was witnessed in women aspirants of contesting on general seats after imposition of condition on political parties that at least 5 percent women should be awarded party tickets on general seats.\nPakistan Muslim League-Nawaz (PML-N) has fielded candidates on the general seats of the National Assembly in Khyber Pakhtunkhwa included, Sobia Shahid to contest polls from NA-29 and NA-31 from Peshawar while Farah Khan is participating in polls from NA-24.\nSimilarly, on the general seats of the provincial assembly, Sobia Khan from PML-N will contest elections from PK-76, Shaista Khan from PK-46. Likewise, Basirat Khan will participate in elections from PK-94, Orkazai and Janzeeba Azam to contest from PK-108, Tank.\nAbout the participants of Pakistan Peoples Party (PPP) on the National Assembly seats, it fileded Meher Sultana from NA-38 and Farzana Shireen from NA-39 on general seats.\nOn the Provincial Assembly seats, the tickets were awarded to Sawira Prakash for PK-25, Sajida Tabbasum for PK-39, Shahnaz Shamsheer for PK-46, Shaista Raza for PK-48 Haripur and Anila Shehzad will contest elections to grab PK-56.\nThe Awami National Party (ANP) has issued tickets to Khadija Bibi from NA-1, Samar Haroon Bilour from PK 83 and Shaheen Zameer from PK-40.\nThe Pakistan Tehreek-i-Insaf (PTI) has awarded tickets on general seats to women included Dr Asiya to contest election from NA-35 and Seemi Falak will contest from PK-76.\nPakistan Markazi Muslim League has fielded Samreen Rasid from PK-75 while Tehreek-e-Jawaan Pakistan has awarded ticket to Rehma Sehar from PK-79.\nPK 86 Nowshera Farahim, PK 90 Kohat Nazia Bibi, PK 91 Kohat Sofia Bano and PK 92 Kohat Shanila are the candidates from Jamaat-e-Islami.\nOn the other hand, Bushra from PK-73, Shakra Gul from PK-79, Nazia Ali from PK-81, Afshan Afridi from PK 82 and Shumaila Tabbasum from PK-83 are contesting as independent candidates",
  "retrievedAt": "2025-08-11T00:06:13.008Z"
}
