{
  "title": "One day workshop for raising awareness on National Adaptation Plan held",
  "link": "https://www.app.com.pk/national/one-day-workshop-for-raising-awareness-on-national-adaptation-plan-held/",
  "date_published": "2024-01-31T13:58:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 31 (APP):Ministry of Climate Change & Environmental Coordination (MoCC&EC) under its ongoing UNEP NAP-Project arranged a one-day awareness-raising workshop here on Wednesday in collaboration with the Planning and Development Department (P&DD) Khyber Pakhtunkhwa.\nAccording to a press release, the workshop aimed to discuss with the relevant departments the impact of climate change and the way forward in addressing the adaptation issues and developing the provincial and district adaptation plans.\nThe main objective was to raise awareness about the National Adaptation Plan developed for Pakistan by the MoCC&EC as well as how to develop an adaptation plan at the provincial and local levels.\nDr Syed Sarfaraz Ali Shah, Advisor P&DD, Govt of KPK was the chief guest. The workshop was also attended by Imtaiz Ali Shah, the Additional Chief Secretary, Mr. Asif Sahibzada, Director General, of Ministry of Climate Change & Environmental Coordination and Arshad Samad Khan, National Technical Advisor, UNEP NAP Pakistan project.\nDuring the opening session, the Advisor P&DD emphasised the need of adaptation for addressing the natural disasters and suggested that this must not end in a document but serve a platform for the future to do something for the betterment of the province.\nAdditional Chief Secretary suggested that such plans must should also be developed at the district level. Arshad Samad Khan stressed that considering current the natural disasters in the province, we don’t have any other option but to develop and build the resilience of the communities, systems, infrastructure, and governmental and non-governmental entities for addressing the climate-induced atrocities.\nThe Workshop was attended by more than 70 participants representing various line departments, academia, NGOs, and international organizations working for climate change in the province.\nParticipants were informed about the climate risks and vulnerabilities in the KPK province to facilitate them in suggesting the appropriate measures for building resilience to the adverse impacts of climate change.\nIn the workshop, presentations were made on climate finance including different approaches and methodologies for accessing international climate finance to meet the financial needs required for building the country’s resilience.\nIn the concluding session, Asif Sahibzada thanked the P&DD for providing support to the Ministry of Climate Change and UNEP for organizing this workshop.\nHe also emphasized that in the adaptation planning process representatives from districts, local governments and communities’ leaders should also be involved in order to build ownership of the adaptation interventions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:08:13.084Z"
}
