{
  "title": "SC adjourns hearing of audio leak case till next week",
  "link": "https://www.app.com.pk/national/sc-adjourns-hearing-of-audio-leak-case-till-next-week/",
  "date_published": "2023-05-31T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP):The Supreme Court on Wednesday adjourned hearing of a petition filed against the judicial commission probing the veracity of recent audio leaks till next week.\nA five-member larger bench comprising Chief Justice of Pakistan Umar Ata Bandial, Justice Ijaz Ul Ahsan, Justice Munib Akhtar, Justice Syed Hasan Azhar Rizvi and Justice Shahid Waheed heard the case.\nDuring the course of proceedings, the judicial commission led by Justice Qazi Faez Isa submitted a concise statement through commission secretary Hafeezullah Khajjak and objected to the five-member bench.\nThe response stated that one of the alleged audio leaks concerned the chief justice’s mother-in-law and Justice Akhtar was also mentioned during the conversation.\nThe commission stated that it would not be appropriate for the bench to hear the petitions as the SC judges were required to not allow their personal interest to influence their official conduct or official decisions.\nOne of the petitioners Advocate Riaz Hanif Rahi said he wanted to file a contempt of court petition.\nThe chief justice observed that all the petitions would be clubbed and included in the case.\nHe said the court would first hear Attorney General for Pakistan (AGP) Mansoor Usman Awan’s arguments against the five-judge bench. No decision was taken on the objections to the bench at the previous hearing, he added.\nHe said the court was directing the registrar to allot a number to the AGP’s plea and directed Awan to provide copies of his petition to all the respondents.\nHe said the government’s petition had included some words that should not had been there.\nAdvocate Shoaib Shaheen, counsel for Supreme Court Bar Association (SCBA) President Abid Shahid Zuberi, said the association had always defended the apex court in talk shows but the judicial commission had stated that “we speak against the judiciary during talk shows”.",
  "retrievedAt": "2025-08-11T08:35:27.615Z"
}
