{
  "title": "Govt to enhance rural economy through value addition of agri-produce: PM",
  "link": "https://www.app.com.pk/national/govt-to-enhance-rural-economy-through-value-addition-of-agri-produce-pm/",
  "date_published": "2023-05-31T16:57:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 31 (APP): Prime Minister Muhammad Shehbaz Sharif Wednesday stressed upon taking of practical and permanent steps over the agriculture reforms and said that the government would improve the rural economy through value addition of agri-production.\nThe prime minister chaired a high level meeting on the fiscal budget 2023-24 proposals regarding the agriculture sector, PM Office Media Wing said in a press release.\nThe prime minister observed that agriculture sector was the backbone of the national economy and the country’s progress was not possible without innovations in this sector.\nHe said that due to incumbent government’s Kisan package, record wheat yield was achieved in the current season.\nDuring the meeting, the prime minister was apprised in details of the agriculture reforms during the previous one year.\nDue to PM’s special Kisan Package, the provision of loans to farmers on affordable terms was not only ensured but due to supply of timely fertilizers and quality seeds, the country also achieved the bumper wheat crop, exceeding the previous production in the last ten years.\nUnder prime minister’s directive, the best supporting prices over different crops led to prosperity of farmers which would also boost the upcoming crops, it was added.\nThe prime minister also directed for direct provision of subsidy to farmers on fertilizers.\nHe said that provision of quality seeds, latest machinery, extension services and for agriculture research, resources would be allocated in the fiscal budget.\nThe prime minister said that practical steps should be incorporated in the fiscal budget for complete conversion of agriculture tube wells on solar energy.\nThe prime minister was also informed about the international quality seeds, import of semen for animals breeding, functioning of the agriculture institutions and implementation over Kisan package.\nThe meeting was briefed over the National Oil Seed Policy whose objective was to reduce dependence over import of edible oil by provision of quality seed.\nAutomatic Seed Certification and Track and Trace System was being introduced for provision of quality seed, it was further added.\nThe prime minister terming the proposals of experts as very useful, directed his Adviser Ahad Khan Cheema to form two sub-committees to give final shape to budget proposals regarding the agriculture sector.\nThese committees would be tasked to give concrete shape to innovations in this sector, mechanization, provision of quality seeds, direct provision of subsidy to farmers on fertilizers, solarization of tube wells and policy measures.\nThe committees, for the purpose of export in agriculture sector, would also ensure linking of value addition and agriculture production with the global value chains so that production of farmers could be timely supplied to the international markets.\nThe meeting was attended by Federal Ministers Muhammad Ishaq Dar, Rana Sanaullah, Tariq Bashir Cheema, Ahsan Iqbal, Engineer Khurram Dastagir, Makhdoom Murtaza Mahmood, PM’s adviser Ahad Khan Cheema, Minister of State Dr Musadiq Malik, Ayesha Ghaus Pasha, PM’s Special Assistants Tariq Bajwa, Jehanzaib Khan, Tariq Pasha, governor State Bank of Pakistan, chairman FBR and other high officials. Besides, different prominent experts and farmers in modern agriculture also attended the meeting.\nThe prime minister regretted that the previous government had intentionally destroyed the agriculture research institutions which were established by them and directed for immediate functioning of the Agriculture Policy Institute.\nHe observed that during the current year, they had ensured prosperity of farmers by extending the best support price on wheat, cotton and sugarcane.\nThe prime minister also directed to establishment of small fruit processing and pulping units in the villages.\n“The government will make the country self sufficient in edible oil by increasing its production. With autarky in edible oil and other food grains, the dependence on import will decrease, besides it will result in saving of precious foreign reserves,” a press release in Urdu language quoted the prime minister as saying.\nThe government would ensure provision of timely loans to farmers on easy terms, he further added.",
  "retrievedAt": "2025-08-11T08:35:26.909Z"
}
