{
  "title": "MNAs demand effective awareness campaign, increased taxes on tobacco products, SSBs",
  "link": "https://www.app.com.pk/national/mnas-demand-effective-awareness-campaign-increased-taxes-on-tobacco-products-ssbs/",
  "date_published": "2023-05-31T11:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP):The members of the National Assembly (MNAs) on Wednesday demanded the Lower House of the Parliament to propose increased taxes on tobacco products and sugar-sweetened beverages (SSBs) in the upcoming budget and initiate effective public awareness campaign to shun its use among masses wasting both health and money.\nMNA, Dr. Nisar Ahmad Cheema of Pakistan Muslim League Nawaz (PML-N) taking to the floor of the House on a point of order, said that the country like rest of the world was celebrating World No Tobacco Day under the theme “We need food, not tobacco”.\nHe said that smoking cigarettes was causing loss of money and health to an individual that needed to be contained to ensure healthy life.\nCheema regretted that the tobacco mafia was strong, wealthy and influential enough and running effective campaigns to mislead the public.\nThey have started another campaign of pouched (nicotine packed in small pouches) tobacco products like Velo as an alternate to cigarettes to quit smoking which was equally injurious to human health and also addictive in nature, he said.\nHe sought the Speaker to issue a ruling to the Ministry of Information and Broadcasting to run effective awareness campaigns on discouraging the used of tobacco products.\nHe also proposed the House to recommend increase in tax on cigarettes and tobacco products and also SSBs like coke and pepsi. “A glass of SSBs contains 8 spoons of sugar which is health injurious and casts negative impacts on human body.”\nMNA Dr. Ramesh Kumar Vankvani of Pakistan Tehreek-e-Insaf (PTI) said that last year, World No Tobacco Day was celebrated amid budget and he had proposed the government to increase taxes on tobacco products, and intoxicants to make it unaffordable to youth and masses of other age groups to reduce its use.\nHe added that one way was to increase taxes on tobacco, disallow under 18 youth smoking at public places and detain them if found violating so that it could bring a sense of fear among the people.\nDr. Vankwani underlined that most importantly the social awareness and responsibility should be increased to get rid of tobacco products use rising among the youth.\n“We need to bring a behavioural change in the society. There are laws but acceptance of those laws is the responsibility of the masses to ensure effective implementation,” he said.\nMNA, Shakila Luqman of PML-N said every government used to make efforts to give relief to the masses in the budget but Prime Minister Mian Shehbaz Sharif distributed free flour in Ramzan despite economic crisis.\nShe added that the cheap Russian oil being imported would also help in benefit the masses whereas the government had made all out efforts and implemented all conditions of the International Monetary Fund (IMF).",
  "retrievedAt": "2025-08-11T08:35:42.057Z"
}
