{
  "title": "National tobacco control strategy launched",
  "link": "https://www.app.com.pk/national/national-tobacco-control-strategy-launched/",
  "date_published": "2023-05-31T18:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP): The Ministry of National Health Services, Regulations and Coordination on Wednesday launched the national tobacco control strategy 2022-30.\nAddressing the launching ceremony, speakers emphasized the significance of this strategy, stating that it is a comprehensive and evidence-based roadmap that will serve as a guide in the government’s efforts to reduce tobacco use and protect the population of Pakistan from its detrimental effects.\nThe DG Health highlighted the importance of addressing emerging challenges posed by new tobacco products, innovative marketing techniques, and the influence of the tobacco industry.\nThe strategy emphasizes the need for continuous monitoring and evaluation to ensure the effectiveness of interventions and to adapt to the evolving landscape of tobacco control.\nHe added that National Tobacco Control Strategy is a comprehensive document encompassing whole aspects of Tobacco control, it’s implementation plan and advocacy with all stakeholders which is endorsed by all provincial and regional health departments.\nThe Special Secretary urged all stakeholders to actively participate in the implementation of the strategy, emphasizing that their dedication and commitment are crucial in achieving our shared goal of a tobacco-free nation.\nWorking together, we can safeguard the health and well-being of our people, particularly the future generations.\nRepresentatives of the provincial and area departments of health shared their status of tobacco control initiatives in respective provinces and are committed in resolving issues of high tobacco prevalence as top priority of the provincial governments.\nDr. Palitha Mahipala, Country Representative WHO Pakistan expressed unwavering support for the Government of Pakistan in their tobacco control agenda, reaffirming their commitment to assisting in this important endeavor.\nDr. Gan Quan, Director of Tobacco Control representing The Union, acknowledged the achievements made in Pakistan and pledged continued support to the government’s efforts in tobacco control.\nDuring the event, a recorded message from the Framework Convention on Tobacco Control (FCTC) was played, wherein a representative from the FCTC expressed appreciation to Pakistan for the development of the National Tobacco Control Strategy and stated that the document is expected to serve as a testament to the collaborative efforts and shared commitment in advancing tobacco control policies and practices in Pakistan.\nThe launching ceremony marked an important milestone in journey towards a tobacco-free nation, and it highlighted the collective commitment and collaborative efforts of all stakeholders.",
  "retrievedAt": "2025-08-11T08:35:28.934Z"
}
