{
  "title": "Low income students’ applications sought for scholarship",
  "link": "https://www.app.com.pk/national/low-income-students-applications-sought-for-scholarship/",
  "date_published": "2021-02-28T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): The Punjab government has invited applications from bright students of low income parents, for Rehmat Ul-Lil-Alameen scholarships to assist financially unstable talented students for a better chance at discovering more opportunities.\nThe students of all the public sector colleges and universities in Punjab have been asked to visit the link https://hedscholarships.punjab.gov.pk/sign-up to create their account and submit the online application by March 10.\nThe Punjab government has allocated Rs 1 billion for awarding scholarships to 15,000 students annually.\nA total of 891 under-graduates would be paid Rs 268 million as scholarships till financial year 2023-24, while a sum of Rs 350 million would be paid to some 14,000 intermediate students during current financial year and Rs 700 million per annum afterwards on SSC results basis.\nThe students must have secured at least 60 percent marks in SSC exams from any public sector school and then took admission in a government college within two years of passing the Matric to avail of this scholarship.\nAlso, the students availing any other scholarship are not eligible for the program.\nOnly those candidates are eligible for this scholarship whose family income is less than or equal to Rs. 25,000 per month and the parents must not own more than 5 acres of agricultural land or 5 marlas urban property.\nIn this need-based scholarship,  approximately 10 percent quota will be reserved for children of government employees.\nThe merit of the candidacy will be determined by the district/place of residence of the candidate and not the district/place where they are admitted.\nThe scholarships will be transferred to students through banking channels once their details are verified online.\nThe eligibility criteria for merit-based applicants is that the candidates must have the highest score in their respective district and it will be verified by the Higher Education Department (HED). The score would be matched with the data provided by the exam boards in Punjab.",
  "retrievedAt": "2025-08-11T20:25:34.676Z"
}
