{
  "title": "ECP asks for avoiding illegal practices in Senate polls",
  "link": "https://www.app.com.pk/national/ecp-asks-for-avoiding-illegal-practices-in-senate-polls/",
  "date_published": "2021-02-28T12:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): Election Commission of Pakistan (ECP) has expressed hope that the political parties, candidates, voters and election agents would not indulge in any kind of corrupt or illegal practice as defined in chapter-X of the Elections Act 2017.\nAccording to an official of ECP, as per code of conduct issued for political parties, contesting candidates, election agents and voters for Senate elections 2021, they all should abide by all directions and instructions issued by the ECP from time to time relating to smooth conduct of elections.\nContesting candidates, election agents and their supporters would not solicit the support or assistance of any person in the service of Pakistan or any public office to promote or hinder the election of contesting candidate in any manner.\nHe said as per code of conduct the political parties, candidates, voters and election agents would not propagate any opinion, or act in any manner prejudicial to the glory of Islam and ideology of Pakistan, or the sovereignty, integrity or security of Pakistan, or morality or public order, or the integrity or independence of the Parliament, judiciary of Pakistan or which defames or brings into ridicule the Parliament, judiciary or the Armed Forces of Pakistan.\nHe said while entering into the polling station, each voter would ensure that he or she did not possess mobile phone or other such electronic device or gadget which could be used to take photograph of the marked ballot paper.\nFor purposes of election expenses, a candidate would open an exclusive account with any branch of a scheduled bank before the date fixed for scrutiny of nomination papers and maintain, or cause to be maintained, a register of receipts and expenditures.\nThe candidate would not make any transaction towards the election expenses through an account other than the account opened for the purpose and a candidate may open the bank account for election expenses with an amount not exceeding the limit of election expenses provided under section 132. (Section 133 of the Elections Act, 2017)\nThe returned candidate would submit return of election expenses to the Returning Officer on Form C within five days from the date of election in accordance the sub-section (3) of section 123 of the Act whereas other contesting candidates would submit their election expenses on Form C to Returning Officer within thirty days of the publication of the names of the returned candidates as required under section 134 of the Act, he added.",
  "retrievedAt": "2025-08-11T20:25:33.508Z"
}
