{
  "title": "NA Speaker inaugurates Sui gas scheme at Gaar",
  "link": "https://www.app.com.pk/national/na-speaker-inaugurates-sui-gas-scheme-at-gaar/",
  "date_published": "2021-02-28T18:22:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 28 (APP): Speaker National Assembly, Asad Qaiser Sunday said that those doing horse-trading in Senate polls could never be sincere to the country and nations having links with corruption never achieve the hallmark of development.\nHe expressed these views while inaugurating Sui gas provision scheme at Gaar, district Swabi on Sunday. Special Assistant to KP CM on Industries, Abdul Karim Khan and MPA Aqibullah Khan also addressed the ceremony.\nThe Speaker National Assembly said that the root-cause of the crisis confronting the country today was corruption and nation has to play role in its abolition.\nAsad Qaiser criticized Maryam Nawaz for inflaming linguistic politics during bye-elections at Daska and said for the sake only one seat she had chanted the slogan of regional hatred that was tantamount to dividing nation. He said that with popular support of the people, PTI was ruling at federal as well as at provincial levels in the country.\nHe said that they were fully aware that price hike was the biggest concern of the people and attributed it to the misdeeds of those who had ruled the country for seven decades.\nThe Speaker said that when the present government assumed power, the public exchequer was empty and no fund was available even for payment of salaries and the economy was supported through some neighbours and friendly countries.\nHe said that the country had come out of the difficult situation and put on the track of development. He said that the nation has to wait little more as the government would soon overcome these hardships.\nHe said, Rashakai Economic Zone would generate new opportunities of business and would usher an era of socio-economic uplift in the area. He said that the construction of D.I. Khan Motorway would provide easy access to Gawadar.\nThe Speaker National Assembly said that the people of Khyber Pakhtunkhwa have rendered unforgettable sacrifices in war against terrorism.\nAsad Qaiser assured the people of Swabi about the resolution of their problems at their doorsteps. He said, the provision of Sui gas was long standing demand of the residents of Gaar that had fulfilled today.\nHe said, the people of the area have suffered due to Ghazi Barotha project and were rendered of unemployed. However, he said the government is taking steps for the resolution of their problems. For this purpose, he said that a consultant has also been hired and a survey is in process. He said that the flow of water would be restored soon.",
  "retrievedAt": "2025-08-11T20:25:28.944Z"
}
