{
  "title": "Asadullah Baloch for dualization, up-gradation of highways in Balochistan",
  "link": "https://www.app.com.pk/national/asadullah-baloch-for-dualization-up-gradation-of-highways-in-balochistan/",
  "date_published": "2021-02-28T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): The dilapidated roads of Balochistan are posing serious threat to the lives of commuters, seeking urgent attention of the quarters concerned for their dualization and up-gradation.\nTalking to APP, Provincial Minister for Social Welfare and Non-Formal Education, Mir Asadullah Baloch said around 30 people including women, children from Panjgoor were killed due to road accidents in the last two months.\nHe said at present the province was facing worst condition of roads where the communication system required moderation after the inception of the China Pakistan Economic Corridor (CPEC) as for better economic activities in the area, proper and smooth thoroughfares were necessary.\nAsad Baloch said the government should make a proper mechanism to control the increasing rate of road accidents in the province, adding that the narrow single lane highways were one of the major causes for vehicle collisions.\nThe government should provide quality road infrastructure and accessibility to the masses of the province, he added.\nBalochistan government should expand the Medical Emergency and Response Centers (MERC) project to construct more centers along every highway in the province,” it added.\nHe said besides the upgradation and widening of highways in the province, the fitness of the vehicles plying on the roads should also be checked and monitored on regular basis. A series of awareness campaigns should be launched across the province to sensitize the commuters regarding safe driving, he added.\nAsad Baloch said the government must take action against the drivers for over speeding which was the main reason of accidents.\nHe informed that most of the drivers were not fulfilling the basic role of driving license.\nAn official of Balochistan government told that the provincial government has planned to install tracking system in 316 buses running on Quetta-Karachi and Quetta-Chaman highway in the first phase of the project to monitor and check the movement of the buses.\nThe installation of tracker device in buses running on national highways would also control over speeding and provide the data, said official.\nThe government would be expanding the project across the province to save the human lives, he added.\nHe said all the roads in the province needed expansion and in that regard, they would approach the Federal Government.\nThe authority was taking strict action against public transporters, which were not having proper maintenance of vehicles. Overloading was a crime and vehicle owners would be imposed fine on that count also, he added.\nThe transport department having no judicial power to issue challans to the violators however, he said that the Balochistan government was making a policy to authorize transport department to ensure strict enforcement as per the law.",
  "retrievedAt": "2025-08-11T20:25:31.044Z"
}
