{
  "title": "Pakistan says India has no locus standi to comment on Gilgit-Baltistan elections",
  "link": "https://www.app.com.pk/national/pakistan-says-india-has-no-locus-standi-to-comment-on-gilgit-baltistan-elections/",
  "date_published": "2020-07-03T06:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 3 (APP):Pakistan on Friday rejected remarks by India’s Ministry of External Affairs’s Spokesperson regarding elections in Gilgit-Baltistan, saying it had no locus standi to comment.\n“The Indian government, which has been holding fraudulent “elections” in the Indian occupied Jammu and Kashmir (IOJ&K) under the barrel of Indian occupation forces, and has turned the occupied region into the world’s largest open prison, has no locus standi to comment on elections in Gilgit-Baltistan,” the Foreign Office said in a statement.\nThe Foreign Office said that Pakistan reiterated that parts of Jammu and Kashmir remained in illegal Indian occupation.\n“The Jammu and Kashmir dispute,which is the longest outstanding item on UN Security Council’s agenda, stems from India’s forcible and illegal occupation of the State of Jammu and Kashmir in 1947,” it said.\n“Pakistan also reiterates that the only resolution of the Jammu and Kashmir dispute is faithful implementation of the relevant UNSC resolutions that recognise the inalienable right of the people of Jammu and Kashmir to self-determination through democratic method of a free and impartial plebiscite under the UN auspices,” it said.\nThe Foreign Office said “baseless Indian contentions about elections in Gilgit-Baltistan cannot cover up the egregious violations of human rights committed by Indian security forces in the occupied Jammu and Kashmir.”\nIt mentioned that “heartless Indian occupation forces in Sopore killed an unarmed civilian in front of the victim’s three-year old grandson”, adding that the impunity enjoyed by Indian occupation forces under the draconian laws in place in IOJ&K was another dimension of the state-terrorism being perpetrated by India against unarmed Kashmiris.\n“We call upon the Indian government to vacate all the occupied territories, reverse all illegal actions taken in IOJ&K especially since 5 August 2019, revoke all draconian laws, allow neutral observers, international human rights and humanitarian organisations and the international media to visit the occupied region to ascertain the well-being of the Kashmiri people, and let the Kashmiris exercise their right to self-determination in accordance with UNSC resolutions,” the Foreign Office said.",
  "retrievedAt": "2025-08-11T19:26:32.200Z"
}
