{
  "title": "Unable to understand what more relaxation Maryam wants for her father: Fawad",
  "link": "https://www.app.com.pk/national/unable-to-understand-what-more-relaxation-maryam-wants-for-her-father-fawad/",
  "date_published": "2020-07-03T05:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):Federal Minister for Science and Technology Chaudhry Fawad Hussain Friday said he was unable to understand what more relaxation Maryam Nawaz wanted for her father.\nResponding to Maryam Nawaz’s statement, the minister said her father did not serve his sentence and instead went to London carrying his sack, bed and plates, and now walked around Hyde Park there.\n“I don’t think Nawaz Sharif needs any more relaxation. He has received less punishment,” Fawad said in a video message.\nHe said holding accountability was an election promise of the Pakistan Tehreek-e-Insaf (PTI) and it was important for the party to fulfill that pledge.\nAbout judge Arshad Malik’s dismissal case, he said, “Such cases tarnish the reputation of judiciary. The judiciary, the army and the cabinet are all national institutions, which should remain strong and strengthened.”\nAs regards the “minus one” formula, the minister said it could only happen if leader of lower stature led a party, but it was not possible where the leader had a bigger stature than that of his party.\nThe party would remain as much popular even if its name was changed by prime minister as “Imran Khan Party” instead of PTI, he said, adding the people had given the mandate to Imran Khan through their votes.\n“We came into power after promising the people to bring reforms and we should pay attention to that,” he stressed.\nFawad said there was no threat to the present government and it would complete its tenure.\nHe also welcomed the Sindh government’s decision making the joint investigation team reports public. “It is a good decision, the facts should come before the people” while the rest was to be decided by the judiciary, he added.",
  "retrievedAt": "2025-08-11T19:26:38.608Z"
}
