{
  "title": "Ehsaas achieves target of emergency cash disbursement among over 12 million daily wagers",
  "link": "https://www.app.com.pk/national/ehsaas-achieves-target-of-emergency-cash-disbursement-among-over-12-million-daily-wagers/",
  "date_published": "2020-07-03T05:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):Within 100 days of COVID-19 outbreak, the Rs 193.96 billion Ehsaas Emergency Cash program, launched on April 9,2020 has successfully accomplished the Ehsaas target of emergency cash disbursement among more than 12 million daily wagers (Rs 12,000 each as one-time assistance) countrywide.\nThe government’s flagship program, Ehsaas has taken the lead in radically expanding social safety nets to help mitigate the effects of the COVID-19 pandemic in the country.\nThe government has set out a new emergency cash target to reach out to around 16.163 million beneficiaries witnessing the overall success of Ehsaas Emergency Cash and its massive demand in these unprecedented times, said a news release.\nThe PM launched web-portal for COVID-19 livelihood-loss-affectees who had been laid off by employers (categories 4 and 5) on May 2, 2020 and committed that for every rupee donated, the government will match additional four Rupees and that all donations will be earmarked for Ehsaas Emergency Cash. Payments are currently underway for category 4 and 5 of beneficiaries.\nThe eligible households from across the most vulnerable groups have been identified through a combination of the existing socioeconomic registry maintained by Ehsaas, SMS registration and web-based registration with stringent verification processes.\nThe focus of this program has been on the fastest possible delivery by leveraging existing digital capabilities particularly data analytics, biometrically enabled precision payments and data driven accountability.\nTransparency safeguards and real-time evaluations in the roll out of Ehsaas Emergency cash have ensured safe cash delivery coupled with appropriate real time mitigating actions from the field such as, supplementary payment solutions for beneficiaries with biometric issues, crackdown against fraudulent elements in field, incentives for branchless banking retailers of partnering banks and waiver of SMS charges for labourers etc.\nSince the commencement of operations within 10 days of the lockdown, integrity has been the foremost principle of Ehsaas Emergency Cash disbursements. In the interest of transparency and integrity, the online information portal provides live category and area wise details of Ehsaas Emergency Cash disbursements to the public.\nTo address the need of the hour, the federal government had also opened a range of assistance initiatives through Ehsaas Rashan Portal and Ehsaas Langars, the Ehsaas Langar and Panahgah App to empower welfare organizations to play a well-coordinated role with the government in responding to the COVID-19.\nThe Ehsaas Rashan program links private sector organizations willing to donate food rations, to government-verified beneficiaries.\nTill today, as many as 738,869 requests have been received on the portal and food assistance has been kicked off. A beta version of the Ehsaas Langar and Panagah app provides public information about Langars and Panagahs countrywide.\nIn the wake of the economic hardship being experienced by the vulnerable due to the ongoing coronavirus crisis, Ehsaas has opened six Langars in Punjab, KP, Sindh and Islamabad through public private partnership. Each Langar distributes around 1,200 complimentary meals to labourers for two times daily.\nIn Islamabad and Lahore, “Ehsaas-Saylani Langar on Wheels” has been introduced as well in the context of COVID-19 to serve cooked food aid to the deserving.\nTo graduate the poorest households out of poverty so that they can come out of the shackles of poverty, Ehsaas has positively continued disbursements of interest free loans and small income generating assets nationwide.\nStriking balance between safety and social protection, cumulatively Ehsaas Interest Free loans amounting Rs. 24. 08 billion have been disbursed so far to 712, 852 borrowers countrywide.\nLikewise, through Ehsaas Amdan 25,500 assets worth Rs 1.5 billion have been transferred to deserving recipients in these difficult times.",
  "retrievedAt": "2025-08-11T19:26:37.955Z"
}
