{
  "title": "PM for redesigning master plans to turn metropolises into engines of growth",
  "link": "https://www.app.com.pk/national/pm-for-redesigning-master-plans-to-turn-metropolises-into-engines-of-growth/",
  "date_published": "2020-07-03T08:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):Prime Minister Imran Khan Friday directed the authorities concerned to redesign the master plans of major cities in a way to develop them as engines of growth for the country by generating jobs and economic activities.\nChairing a meeting to review the redesigning of master plans of major cities including federal capital and those of Punjab and Khyber Pakhtunkhwa, the prime minister said the process of master plans’ review must be moved forward keeping in view the relevant factors and socioeconomic activities.\nThe meeting was attended by PM’s Advisor on Climate Change Malik Amin Aslam, Member National Assembly and town planning expert Khayal Zaman, Naya Pakistan Housing Authority chairman and secretary housing while provincial chief secretaries participated through video link.\nThe prime minister was given a detailed briefing on the progress to redesign the master plans of Islamabad and major cities of Punjab and KP in accordance with the modern day needs.\nThe prime minister viewed that the haphazard growth of major cities during last few years had not only harmed the environment but also created complications for civic amenities, narrowed down green areas as well as cultivable lands which could imperil food security.\nThe prime minister said the objective behind incentivizing the construction industry was also to modernize the sector besides making it a job provider for youth.\nHe instructed the provincial authorities to take advantage of technology to redesign the master plans for its early completion.\nHe also sought a report within a week on the roadmap of finalizing the master plans and interim strategy till the completion of the process.",
  "retrievedAt": "2025-08-11T19:26:27.883Z"
}
