{
  "title": "COVID-19: Islamabad witnesses no death during last 24 hrs",
  "link": "https://www.app.com.pk/national/covid-19-islamabad-witnesses-no-death-during-last-24-hrs/",
  "date_published": "2020-07-03T05:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):National Command and Operations Center (NCOC) Friday said the federal capital had witnessed no death due to COVID-19 and reported 113 positive cases during the last 24 hours.\nCommenting on the situation, Minister for Planning Asad Umer said new corona cases in Islamabad were more than 700 per day in the mid of June while only 113 cases had been reported during the last 24 hours.\n“Positivity down to 5% yesterday and in single digits for the last few days consistently. Very good work done by district administration, police and health department and most of citizens of Islamabad,” he added.\nSpecial Assistant to the Prime Minister on National Health Services Dr Zafar Mirza said due to current economic situation it was impossible to implement complete lockdown in the country.\nHowever, the government was focusing on smart lockdown policy and the results of its implementation in different areas of Islamabad was quite satisfactory and only 113 cases of COVID-19 were positive out of 3,000 tests conducted during the last 24 hours, he added.\nHe said the average number of deaths due to COVID-19 in the federal capital had reduced to one only in the previous 72 hours.\nAs per the official data, the number of positive cases of COVID-19 in the federal capital was fluctuating at an average of 146 per day in the previous 72 hours. The federal capital had observed a significant drop in the number of deaths as well.\nAccording to the NCOC, the total number of confirmed cases in the federal capital had reached 13,195 with 129 deaths and 8,246 recovered cases.\nThe District Health Officer Dr Zaeem Zia, in his social media message, said a total of 64% had recovered now. Another 414 patients who were tested COVID-19 positive had qualified recovery criteria, he added.\nHe said 8,267 people had been recovered out of 12,912 total positive cases adding the total active cases were 4,645 now.\nHe said the epidemiology sciences ask for more tests and tracing which was being implemented to cope with the pandemic.\nHe said the number of severe cases of COVID-19 had reduced in the federal capital hospitals. He said the death ratio in the city was also low.",
  "retrievedAt": "2025-08-11T19:26:38.059Z"
}
