{
  "title": "Pakistan’s Google team briefs steps towards digitization, computer science studies in country",
  "link": "https://www.app.com.pk/national/pakistans-google-team-briefs-steps-towards-digitization-computer-science-studies-in-country/",
  "date_published": "2020-07-03T05:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):Minister for Information Technology and Telecommunication Syed Amin Ul Haque Friday virtually briefed by Pakistan’s Google team about Google’s initiatives currently are being undertaken and steps towards digitizing and instilling the importance of computer science studies and the use of tech in its youth.\nGoogle’s Head of Public Policy in Pakistan Nick Bauer said Google through a collaborative effort with other stakeholders in Pakistan was launching several amazing programmes like early age programming initiative, CS First and it would be the first time that such a programme is carried out in the country, said a news release.\nGoogle’s Country Head for Pakistan Farhan Qureshi briefed the minister about the previous initiatives that Google has carried out like having DSC leads in different cities of the country and organizing the first ever DSC Summit in Pakistan and how slowly but progressively, Google is establishing a foot-hold in the country which will lead to more IT related projects aimed to create somewhat a digital renaissance in Pakistan.\nIn conclusion, Founder and CEO at Tech Valley Umar Farooq thanked the minister for providing his valuable time for this meeting and requested his support regarding the early age programming initiative, Google CS First that will be carried out in collaboration with Ministry of IT and Telecom Foundation Schools in addition to providing his support on other virtual Google activities in Pakistan.\nThe minister appreciated the efforts made by Google and the team and lauded the level of work that is being carried out.\nHe also ensured to provide any kind of necessary support in the future in order to fully accompany a digital transformation in the country and hailed the importance of it at this time.",
  "retrievedAt": "2025-08-11T19:26:35.689Z"
}
