{
  "title": "Kashmir-Palestine needs immediate attention; must be resolved peacefully: AJK President.",
  "link": "https://www.app.com.pk/national/kashmir-palestine-needs-immediate-attention-must-be-resolved-peacefully-ajk-president/",
  "date_published": "2020-07-03T05:41:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK)Jul 03 (APP):Sardar Masood Khan, President Azad Jammu and Kashmir, has said that we as Muslims have to take the lead and resolve long standing issues plaguing the Muslim Ummah like Palestine and Kashmir through political conflict resolution mechanisms provided to us in the Sunnah of the Holy Prophet Muhammad (PBUH).\nCiting major events like the Treaty of Hudaybiyyah (Sulah Hudaybiyyah) and clemency announced upon the Conquest of Makkah, he said that the Prophet (PBUH) was a leader par excellence who over the period of his lifetime peacefully resolved major issues between Muslims and their rivals all over the Arabian Peninsula.\nThe AJK President made these remarks while speaking to Prof. Dr. Muhammad Zia-ul-Haq, Director General Islamic Research Institute, International Islamic University who called upon the President here at Jammu and Kashmir House.\nThe AJK President said that the Muslim world has to unite against forces trying to create a divide amongst their ranks. He said that Islam is a religion of peace and we have to propagate the true teachings of Islam. He added that the Muslim Ummah has to realize its true potential and regain its true position in the global spectrum.\nPresident Masood Khan said that despite being the oppressed, a major chunk of the Muslim population has adopted a defensive posture about Islam, Kashmir and Palestine. “We have to be proactive and start a process of result-oriented dialogue amongst fellow Muslim nations towards the resolution of these longstanding disputes” said the President.\nThe approach for humanitarian diplomacy for these territories under occupation should be immediately explored by Muslim countries all over the globe, asserted Masood Khan.\nProf. Dr. Zia-ul-Haq informed the President of the Institute’s activities. He said that this institution has been one of the leading think tanks in the country providing assistance in legislature and drafting leading documents on Islam.\nHe informed that in 1973, this institute also played a seminal role in the drafting of the Constitution and then producing its Arabic translation for dignitaries attending the 1974 Lahore Summit of the Organisation of the Islamic Conference.\nThe Director General said that various magazines and quarterly research journals – recognised as category X by HEC – are being published at the Institute. He said that a special edition of their leading Fikr-o-Nazar research journal solely focusing on Kashmir will also be published in the coming months which will subsequently be composed into a book for public dissemination.\nThe AJK President appreciated the positive role played by the Institute in helping highlighting the various issues faced by the Muslim Ummah and praised the Muslim scholars and researchers who have contributed to this cause.6\nProf. Dr. Zia presented various books and research journals published by the Institute to the President. He also invited the AJK President to visit the Institute which he said housed over 25,000 rare handwritten manuscripts and books, some dating over seven centuries.",
  "retrievedAt": "2025-08-11T19:26:42.502Z"
}
