{
  "title": "Nation fights COVID-19 with civil-military cooperation, national consensus: NCOC Report",
  "link": "https://www.app.com.pk/national/nation-fights-covid-19-with-civil-military-cooperation-national-consensus-ncoc-report/",
  "date_published": "2020-07-03T04:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):The Pakistani nation has responded to the unprecedented risk of coronavirus pandemic as a united force from the platform of National Command and Operation Centre (NCOC) where the Pakistan Army and federal ministries have set up a unique example of galvanized cooperation and joint working relationship to cope with the global threat amicably through national consensus and informed decision making.\nThe NCOC has issued its 100 days report encompassing the national efforts, decisions and actions taken to contain the contagion of coronavirus. The nation is determined in its fight against coronavirus amid federal and provincial harmony along with strong civil and military cooperation. The NCOC is the manifestation of public confidence that in 100 days since its inception on March 27 made tireless efforts while serving over 1,700 hours day and night and has become the centre of national efforts and backbone of decision-making.\nFrom the detection of the first COVID-19 case in Pakistan on February 26 to the present day, the Government of Pakistan has not only taken important steps for the welfare of the people but also increased capacity in every field.\nThe NCOC has played a key role in enhancing national efforts to contain the pandemic spread, improving the health sector and providing timely information to the masses.\nThe NCOC prepares daily agenda and recommendations to be sent to the National Coordination Committee (NCC) for accurate and prompt decision making. It is actively working on community mobilization in 66 districts along with the National Rural Support Programme.\nIn this regard, the Pakistan Army also dedicated all its most of the resources including most of its assets, troops, hospitals and laboratories for full support of the civil administration to cope with the pandemic.\nThe government launched the Ehsaas Emergency Cash Programme on March 26 to protect more than 12.3 million people, including workers and daily wagers, from hunger and distress during the lockdown.\nUnder the Ehsaas Cash programme more than Rs 148 billion has been disbursed so far whereas Rs1200 billion financial relief was given in lieu off electricity bills. More than 100,000 Pakistanis stranded in 65 countries were repatriated on 478 Pakistan International Airlines (PIA) and foreign flights.\nAt the national level, the NCOC has formulated effective standard operating procedures (SOPs) and safety guidelines against COVID-19 pandemic. It has also increased capabilities in daily statistics, analysis and information to deal with crisis situation.\nTesting capacity increased from 472 tests to more than 50,000 tests daily, number of laboratories increased from 2 to 132. In Islamabad the Isolation Hospital and Infections Treatment Center (IHITC) was completed in 35 days which is a 250-bed healthcare facility and will be operational by mid-July.\nAt present there are 1562 ventilators available for COVID-19 patients in the country whereas 1895 additional ventilators are also being provided soon. Under the ramp-up plan of healthcare facilities for coronavirus patients, 41 ventilators have been provided to various hospitals in Islamabad.\nThe provision of medical resources to all of the provinces including Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan (GB) has been ensured on priority basis.\nThe number of oxygenated beds and ventilators is being increased to enhance the capacity of various hospitals across the country through the ramp-up plan.\nBy the end of July, 2364 more oxygenated beds would be added to the existing number of beds whereas the hospitals in AJK will get 60 beds, Balochistan 200 beds, Khyber Pakhtunkhwa 390 beds, Punjab 620 beds, Sindh 445 beds, GB 40 beds and Islamabad 609 beds. As per the ramp up plan, 189 oxygenated beds have been provided to various hospitals in Islamabad.\nThrough the efforts of the NCOC, the test, trace and quarantine (TTQ) strategy was introduced to impose smart lockdown by identifying the spread and hotspots of coronavirus. The TTQ strategy helped in identifying 130 hotspots in 30 cities across the country.\nThe provincial governments are working in implementing administrative actions in these hotspot areas.\nA many as 4,271 contact tracing teams are working in different parts of the country including doctors, nursing staff, tehsil and council health workers and polio workers. So far, 550,500 people have been tracked across the country, and according to provincial governments, about 75-80 percent of them have been tested.\nFollowing the recommendations of the NCOC, Smart Lockdown was implemented in 20 cities across the country on June 12 whereas the number of infected individuals in the 112 areas declared as hotspots by the NCOC is 46,226. Implementing lockdowns in these provincial cities has significantly reduced the spread of the epidemic.\nThe NCOC has made wearing face mask mandatory at public places or outdoors across the country from May 30. And issued instructions to all quarters concerned to ensure implementation of this SOP. The public was informed about this SOP through the media and it was made mandatory to wear a face mask.\nFollowing the implementation of the Smart Lockdown across the country on June 12, it was imperative that SOPs compliance was ensured during the revival of daily need based shops, businesses and traffic to avoid further spread of the virus.\nAll districts across the country and the NCOC, after the implementation of SOPs recorded around 256,710 SOPs violations across the country, in consequence of that 44,063 markets, shops and 589 factories were sealed while 27,547 vehicles were impounded and overall around Rs 58,623,044 fine was imposed on the violators of SOPs.\nThe NCOC developed guidelines, training documentaries based on how to use personal protective equipment (PPEs) for physicians, nurses and paramedics fighting with the pandemic.\nBased on 48 proposals almost 13 designs of ventilators have been shortlisted and launched whereas 4 of them are under trials aimed to encourage local preparation of medical equipment and devices especially ventilators. Under the We Care slogan, doctors, nurses and paramedics were made aware that all possible facilities would be provided to them for their protection as front line soldiers.\nPPEs guidelines were posted in various hospitals and public places for the awareness campaign. Moreover, Chest X-ray with artificial intelligence, testing kits at NUST University along with Defense, Science and Technology Organization, Strategic Planning Division started manufacturing of PPE.\nTwo thousand front line health workers were trained so that they could perform their duties safely during the hard times. The general public was instructed to follow healthcare SOPs and ensure the safety of themselves and the health workers assisting them in COVID prevalence.\nThe NCOC also laid the foundation for a uniform information system in times of crisis and reviewed the population analysis through human and digital means. It also ensured the provision of accurate, timely and easy and effective information in 5 local languages to the public, the NCC and relevant agencies.\nIn the light of best global experiences, NCOC first devised the communication strategy and then the Ramazan strategy. On the occasion of Eid-ul-Azha, the NCOC was formulating SOPs to ensure the safety of the people in this epidemic and to enable them to perform their religious obligation in a proper way.\nIn addition, the NCOC is informing the public about the coronavirus epidemic through TV, radio, mobile messages and ringtones, newspapers and social media.\nThrough mobile communications, PTA has so far sent 2,215 million messages to its customers, including General Awareness Messages, 132 million Ring back tones, 239 million Educational Messages and 164 million Prime Minister’s COVID Relief Fund messages, 376,595 minutes airtime and 702,362 minutes Spot on Public Awareness and Information in electronic media including about 200 promos, testimonials, news coverage and press briefings. Public service messages and other information in this regard are being provided on the radio in 13 different languages.\nThese include Urdu and other regional languages. All information is being provided in print media through corporate advertisements, self-imposed advertisements of media houses, columns and editorials. All the information is being disseminated to the public through social media trends, dashboard, WhatsApp.\nThe NCOC has proved to be a key resource for federal and provincial governments, physicians, officials, the media and social groups. The Prime Minister, Army Chief, including Services Chiefs, Foreign Ambassadors, Defense Attachs, domestic and foreign media journalists, Chinese military and civil delegations visited the center and appreciated its performance.\nCommenting on the 100 days of the establishment of the NCOC, Federal Minister for Planning, Development and Special Initiatives Asad Umar said that in the last few months, “Pakistan has once again shown that when we come together, we can overcome any challenge, Pakistan Zindabad.” The National Command and Operations Center has proved to be a true reflection of a united and determined Pakistan, he added.\nFederal Minister for National Food Security and Research Fakhar Imam said the NCOC proved to be the best way to monitor and evaluate the strategy of anti-corona activities. And the concerted efforts of the provincial governments have paid off, he added.",
  "retrievedAt": "2025-08-11T19:26:43.328Z"
}
