{
  "title": "Qureshi phones Chinese FM; reiterates Pakistan’s commitment to One China Policy",
  "link": "https://www.app.com.pk/national/qureshi-phones-chinese-fm-reiterates-pakistans-commitment-to-one-china-policy/",
  "date_published": "2020-07-03T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):Foreign Minister Shah Mahmood Qureshi Friday phoned Chinese State Councilor and Foreign Minister Wang Yi wherein he reiterated Pakistan’s commitment to ‘One-China Policy.’\nDuring the conversation, the foreign minister said Pakistan firmly supported China on its core interests, including Hong Kong, Taiwan, Tibet, and Xinjiang.\nBoth sides also reaffirmed their resolve to support each other at the multilateral institutions and hoped that those institutions would foster a spirit of objectivity and coherence in advancing their goals.\nThe conversation encompassed bilateral, regional, and international issues.\nForeign Minister Qureshi underscored that Pakistan and China were ‘All-Weather Strategic Cooperative Partners’ and had preserved the fine tradition of expressing solidarity, mutual assistance and mutual support to each other in the face of common challenges.\nHe underscored that regional security situation was deteriorating as India’s belligerent posture and expansionist policies were imperiling peace in the region.\nApart from committing egregious violations of human rights in Occupied Jammu and Kashmir, India was seeking to change the demographic structure of the held territory, he added.\nThe foreign minister also briefed about the repeated violations committed by India across the Line of Control as well as targeted killing of the civilians. In the face of Indian provocations, Pakistan was exercising restraint, he remarked.\nQureshi underscored that disputes in the region should be resolved through peaceful means and agreed mechanisms rather than resorting to unilateral, illegal and coercive measures reflected in India’s decision of August 5, 2019.\nHe emphasized that the recent attack at Pakistan Stock Exchange in Karachi was supported by anti-Pakistan elements seeking to undermine its economic development and stability.\nState Councilor Wang Yi briefed Foreign Minister Qureshi about the regional situation.\nHe lauded Pakistan’s sincere and relentless efforts to promote peace and stability in the region and thanked for the support it has extended to China during difficult and challenging times.\nAccording to the Chinese Foreign Ministry statement issued in Beijing, Wang said China and Pakistan should work together to jointly tackle challenges, and defend common interests and regional peace and stability.\nHe said for a long time, China and Pakistan had always understood and supported each other, stood firmly on issues involving each other’s core interests, and were trustworthy sincere partners.\nWang Yi appreciated that Pakistan, along with more than 50 friendly countries at the 44th session of the Human Rights Council, firmly supported Hong Kong’s national security legislation and opposed the use of Hong Kong-related issues to interfere in China’s internal affairs.\nIt also reflected the unanimous call of the international community to uphold fairness and justice and follow the basic norms of international relations, he added.\nWang Yi said since the outbreak of the epidemic, China and Pakistan had given each other anti-epidemic materials assistance, setting an example for international anti-epidemic cooperation.\nIn response to the recent terrorist attacks on Karachi Stock Exchange, Wang Yi pointed out that China firmly supported Pakistan’s efforts to combat terrorism and maintain national security.\nChina hoped that Pakistan would further take effective measures to strengthen the security of Chinese personnel, institutions and projects in Pakistan and create a good security environment for bilateral cooperation and corridor construction, he added.\nThe two foreign ministers expressed determination to promote peace and development in Afghanistan. It was hoped that the next meeting of China-Afghanistan-Pakistan Trilateral Foreign Ministers Dialogue would take place at the earliest to facilitate peace and reconciliation efforts in Afghanistan.\nBoth sides reaffirmed the resolve to take measures aimed at earliest possible economic recovery in the aftermath of COVID-19.\nForeign Minister Qureshi underlined that the Belt and Road Initiative (BRI) and the China Pakistan Economic Corridor (CPEC) would become the hub of trade and economic activity, sustainable development and greater people-to-people exchanges. Pakistan and China were taking relevant measures, which would help timely completion of the CPEC projects, he added.\nState Councilor Wang Yi underscored that CPEC was a flagship project of the BRI and that its second phase would complement Pakistan’s efforts aimed at jobs creation, enhancing agricultural productivity, reducing poverty, and massive economic recovery.",
  "retrievedAt": "2025-08-11T19:26:33.579Z"
}
