{
  "title": "ECC directs to disburse Rs. 25,000 for flood affected household",
  "link": "https://www.app.com.pk/national/ecc-directs-to-disburse-rs-25000-for-flood-affected-household/",
  "date_published": "2022-08-30T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): The Economic Coordination Committee (ECC) of the Cabinet on Tuesday approved the summary and directed BISP to disburse a total of Rs. 25,000/household in calamity-hit districts for poverty score up to 32.\nThe Ministry of Poverty Alleviation and Social Safety submitted a summary for emergency cash assistance to affectees of flash floods 2022, said a press release issued here.\nFederal Minister for Finance and Revenue Miftah Ismail presided over the meeting of the Economic Coordination Committee (ECC) of the cabinet at the finance division, here at the capital.\nFederal Minister for Industries and Production Syed Murtaza Mahmud, Minister of State for Finance and Revenue Dr. Aisha Ghous Pasha, Minister of State for Petroleum, Musadik Masood Malik, Coordinator to PM on Commerce and Industry Rana Ihsan Afzal, Coordinator to the PM on economy Bilal Azhar Kayani, federal secretaries and other senior officers attended the meeting.\nUnprecedented rains and flash floods across the country have resulted in loss of lives and properties.\nIn view of above, the ECC approved the summary and directed BISP to disburse a total of Rs. 25,000/household in calamity affected districts for poverty score up to 32.\nIt was also added that the finance division would consult with BISP to discuss the financial implications and required modalities.\nFurthermore, the federal government would ask the provinces to provide their share in the relief for flood affectees.\nMeanwhile, the Ministry of Economic Affairs presented a summary on G-20 Debt Service Suspension Initiative (DSSI).\nThis debt relief, termed as DSSI-I, for IDA eligible countries to mitigate the socio-economic impact of Covid-19 was announced in April 2020. Currently, further six agreements for DSSI-III with Italy, Japan and Spain have been negotiated and finalized.\nForegoing in view, for signing of 6 debt rescheduling agreements with the 03 creditor countries by secretary EAD on behalf of the Government of Pakistan, this summary was presented in ECC.\nAfter discussion, the ECC agreed to rescheduling of the agreement proposed by EAD on account of deferred payments due to Covid-19.\nThe Ministry of National Food, Security and Research presented a summary on refixing of national wheat strategic reserves to the level of 2.00 MMT.\nIn the wake of recent rainfall and flood damages ensuing financial issues of farmers for the next wheat sowing season, rising local wheat prices and hoarding and smuggling issues, the aforementioned quantity is insufficient.\nTherefore, in order to ensure wheat availability across the border and to stabilize local wheat prices, it was proposed that the quantum of wheat strategic reserves may be retained at the level of 2 MMT.\nIn view of above, the ECC approved the revision of ECC decision for import of 3 MMT of milling wheat and allowed for maintenance of strategic reserves of wheat at the level of 2.00 MMT, including a quantity of 0.080 MMT on account of SAARC food bank.\nFurthermore, TCP was directed to arrange a further quantity of 0.8 MMT through G2G or open tender. It was added that import of 0.8 MMT wheat is allowed to the private sector with provision that subsidy shall not be provided for such imports of wheat.\nThe National FATF Coordination Committee on AML/CFT presented a summary for approval for arrangements/ expenditure related to on-site visit of FATF/APG assessors’ team. It was shared that FATF team of 15 members would visit in the first week of September in order to verify the stance of Pakistan as reported in cyclic reports.\nIn this regard, a summary for allocation of TSG of Rs. 7 million was presented.\nECC later approved this summary.\nThe Ministry of Communication submitted a summary for the extension of time to complete the business plan of NHA from June 30, 2022 to September 30, 2022.\nIt was shared that NHA had already shared information with ADB consultants for preparation of the business plan of NHA. However, additional time was required to complete the same.\nThis summary was approved by ECC after thorough deliberation with the provision that no further extension would be given. In case a further extension is sought, the Finance Division will start deducting interest on Cash Development Loans (CDL).",
  "retrievedAt": "2025-08-11T15:29:21.231Z"
}
