{
  "title": "ASEAN emerges as the fifth largest economic community in world: Ambassador",
  "link": "https://www.app.com.pk/national/asean-emerges-as-the-fifth-largest-economic-community-in-world-ambassador/",
  "date_published": "2022-08-30T14:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): Chairman of ASEAN Committee in Islamabad and Ambassador of Viet Nam Nguyen Tien Phong here on Tuesday said that the association had become the fifth largest economic community in the world, a reliable and vital partner of many countries.\nTalking to the Ambassadors of members states of Association of Southeast Asian Nations (ASEAN), he said that the advancement of regional integration, connectivity and economic linkage had been a central aspect of the association’s integration process over the past 55 years.\nHe said ASEAN played a central role in the region’s important dialogue, cooperation, and integration processes.\nASEAN has enjoyed Dialogue Partnerships with 11 countries and international organizations (including China, the US, Russia, Japan, the ROK, India, and the EU, among others); Sectoral Dialogue Partnerships with 6 Countries, including Pakistan, Türkiye, UAE, and Development Partnerships with four countries, including Germany, Italy.\nTo date, intra-ASEAN trade accounts for 25% of ASEAN’s total trade turnover.\nIts GDP in 2021 was US$3.36 trillion, an increase of 30% since the establishment of the ASEAN Community in 2015.\nIn addition, ASEAN is also the heart of a broadening economic space through a network of 8 FTA, including the ASEAN Free Trade Area and seven FTAs with key partners.\nNotably, the Regional Comprehensive Economic Partnership (RCEP) had formed a free trade area encompassing 30% of the global population and 32% of the world GDP, he added.\n“We also truly appreciate the representatives from Pakistan’s Ministries, Provinces, Business circles, Academies, Medias who have been continuously dedicating their great efforts to ASEAN-Pakistan tie in all fields,” he informed.\nAmbassador Nguyen Tien Phong further stated that the ASEAN had a long-standing cooperation with Pakistan, adding Pakistan’s trade with ASEAN had reached almost USD 11 billion in the fiscal year 2022.ASEAN and Pakistan also had cooperated in trade, industry and investment, science and technology, drugs and narcotics, environment, tourism, and human resources development, the chairman ASEAN Committee in Islamabad (ACI), added.\nASEAN has remained true to its mission and goal.\nHe concluded that it had brought into play its important roles in promoting dialogue, cooperation, and confidence-building between the countries within and beyond the region to maintain peace, stability, cooperation and development in the region.",
  "retrievedAt": "2025-08-11T15:29:24.166Z"
}
