{
  "title": "Allied govt establishes National Flood Response Center for rehabilitation of flood affectees",
  "link": "https://www.app.com.pk/national/allied-govt-establishes-national-flood-response-center-for-rehabilitation-of-flood-affectees/",
  "date_published": "2022-08-29T19:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): The allied parties in the government on Monday after mutual consultation decided to establish a National Flood Response and Coordination Center to tackle the situation of floods in the country and undertake the restoration of the flood affectees.\nThe announcement to establish the center was made in a statement issued after the meeting of the allied parties chaired by Prime Minister Shehbaz Sharif.\nThe Chairman of National Disaster Management Authority (NDMA) briefed the meeting in detail about the situation of floods in the country and rescue and relief activities.\nDuring the meeting, the situation arising out of the devastating floods in the country was reviewed in detail.\nIn the meeting, Fateha was offered for those who lost their lives in the floods and prayers were offered for the early recovery of the injured, and grief and sorrow were expressed for the families of the victims.\nThe meeting noted that the damage caused by the floods due to rains across the country particularly in the provinces of Sindh, Balochistan, Khyber Pakhtunkhwa, South Punjab, and Gilgit Baltistan was unprecedented in the last 60 years.\nThe participants appreciated the untiring efforts made under the leadership of Prime Minister Shehbaz Sharif for the rescue of flood affectees, for undertaking emergency steps for relief, regular visits to the flood-affected areas and uninterrupted assistance to the victims.\nThey also lauded the federal government for its immediate relief to the flood victims, the release of Rs five billion to NDMA, Rs 15 billion to Sindh province, a special grant of Rs 10 billion to Balochistan province, and payment of Rs one million to the family of every deceased and grant of money to the injured and for damages to the houses and for other losses.\nThe meeting emphatically applauded the decision of the Prime Minister to give immediate assistance of Rs 25000 in cash to every person affected by the floods.\nThe meeting paid tribute to the federal and provincial governments, federal and provincial departments, army, navy, air force, and every person involved in extending emergency assistance and succor to the afflicted countrymen and saluted all of them for their national passion to extend round the clock help to the people stranded in floods.\nThey thanked the international partners, world community, the United Nations, development agencies, and especially friendly countries for their help in tackling the natural disaster and expressed the hope that they would fully extend additional help in the assistance and restoration of the flood affectees.\nThey expressed complete solidarity with the flood affectees and also conveyed determination that the coalition government would not let up till the rehabilitation of the flood-affected brothers, sisters, and children in their homes, would not leave alone the citizens in distress, and would utilize all available resources for bringing normalcy in their lives.\nDuring the meeting, it was proposed that keeping in view the large-scale devastation caused by floods, a national-level comprehensive plan should be formulated for reconstruction.\nIt was decided that the federal government would complete the final assessment of the losses in a transparent manner in consultation with the provincial governments and institutions and effective plans would be made for the restoration of the affectees within a given timeframe.\nThe participants endorsed the proposal to prepare a comprehensive strategy for the future by learning lessons from the threat of climate change and present conditions so that all efforts could be made for ensuring preemptive preparation against a natural disaster.\nIt was decided to take necessary measures to enhance the capability and capacity of the administrative machinery for eradicating the illegal constructions on the rivers and waterways. Steps should also be taken for storage of the flood water.\nThe meeting supported the decision of Prime Minister Shehbaz Sharif to set up the Prime Minister Relief Fund 2022 and agreed with the decision to launch an extensive campaign to collect funds inside the country and from abroad.\nIn this connection, a campaign would be run at the government, party, and individual levels so that the task of rehabilitation of the flood affectees could be accomplished with the cooperation of philanthropists, institutions, international partners, and friendly countries.\nThe federal ministers, chiefs of armed forces, Chief Minister Balochistan, provincial chief secretaries, and high-level officials attended the meeting.\nLater the Prime Minister in tweets said that the Center will serve as a bridge between disaster management authorities, donors & government institutions.",
  "retrievedAt": "2025-08-11T15:29:32.254Z"
}
