{
  "title": "‘Sahib-e-Nisab’ must pay Zakat in advance for flood victims’ support: Ashrafi",
  "link": "https://www.app.com.pk/national/sahib-e-nisab-must-pay-zakat-in-advance-for-flood-victims-support-ashrafi/",
  "date_published": "2022-08-30T16:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Tuesday appealed the ‘Sahib-e-Nisab’ to pay their Zakat in advance in order to support the flood affected people across the country.\nAddressing a press conference here, Ashrafi who is also the chairman of Pakistan Ulema Council said due to flash floods, millions of people were under severe financial crisis as they had been deprived of their houses, livestock, and other belongings of survival due the national calamity. Allah Almighty would reward the philanthropists twice, first for paying their Zakat and second for helping their fellow beings at this trying time, he added.\nHe also urged the people who want to perform Umrah or pay homage to other sacred places abroad to give their funds to their countrymen facing critical situation due to torrential rains and flash floods in the country.\nHe said the charity organizations particularly affiliated with various religious schools of thought should come forward with a pragmatic approach and help mitigate the sufferings of marooned people without any prejudice.\nAshrafi lauded the selfless services of Rahmatul-lil-Alameen, a religious welfare entity, for facilitating cooked meal, bottled water, tents and ration to their brethren stuck in the flooded areas of the country.\nHe also expressed gratitude to the Muslim countries including Kingdom of Saudi Arabia, United Arab Emirates, Turkiye and Iran for providing all out support to Pakistan in a bid to meet the national emergency.\nHe expressed the hope that in a couple of days, more relief goods would be poured in from the Muslim world for the flood-ravaged areas of the country.\nHe also urged the political leaderships to be united at one platform to devise a unified policy to save Pakistan, nation and its properties and take collective steps to make the country economically strong and stable as national unison was need of the hour. The future of Pakistan was bright because there was paradigm shift in its economic regime and it was moving on trade instead of aid in the future, he added.\nMeanwhile, Council of Islamic Ideology (CII) Chairman Dr Qibla Ayaz also urged the people to pay Zakat in advance to help the flood-affected people.\nHe, in a statement the other day, said they should help them in every possible way such as; charity, donation and alms at this hour of trials and tribulations.\nDr Qibla said the nation was currently facing the most difficult situation and it was our religious and national obligation to help the marooned-people displaced by the flash floods across the country.\nAt this hour of difficulty, the government, political parties and all organizations should forget their group, political, religious and linguistic differences and work for the rehabilitation of the flood victims in a systematic manner, he added.\nHe said the Pakistani nation had never left its suffering brothers alone in the national emergency. In this regard, the people should provide all possible assistance to our countrymen, he maintained.",
  "retrievedAt": "2025-08-11T15:29:20.922Z"
}
