{
  "title": "Acting High Commissioner of Malaysia inaugurates study in Malaysia Education Fair in Islamabad",
  "link": "https://www.app.com.pk/national/acting-high-commissioner-of-malaysia-inaugurates-study-in-malaysia-education-fair-in-islamabad/",
  "date_published": "2022-08-30T10:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): Acting High Commissioner of Malaysia, Deddy Faisal bin Ahmad Salleh on Tuesday launched the “Study in Malaysia Education Fair” in Islamabad.\nAfter inaugurating the study fair, Deddy Faisal bin Ahmad Salleh stated that Malaysia has become one of the most preferable study destinations by the Pakistani students as it is house of the world’s leading institutes.\nOffering a degree that is well-recognised globally, Malaysian universities rank in the world’s top universities and a total of 13 in the top 600 according to QS World University Rankings 2023.\nBased on QS World University Rankings by Subject 2022, 10 Malaysian programmes were placed among the top 50 universities for the study of their academic subject.\nThe envoy said that Malaysia also offers affordability in many areas, from food, travelling, transportation and the tuition fees. The average total tuition fees per annum are approximately at US$ 4,400 for public universities & US$ 4,970 for private universities. Malaysia sits among one with the lowest cost, in which our Cost-of-Living Index is only 42.47.\nOther consideration for choosing Malaysia as study destination is that Malaysia has safe, peaceful, and vibrant communities. Malaysia is currently ranked 20th in the world’s most peaceful country based on the 2020 Global Security Index (GPI) report, providing you a safe and secure environment for your study journey, he maintained.\nIt is pertinent to mention here that the education fair is hosted by the Education Malaysia Global Services (EMGS), a company under the purview of the Ministry of Higher Education Malaysia.\nEducation Malaysia Global Services is working hard to make Malaysia a global education hub of choice and ensure the welfare of all international students who want to study in Malaysia.",
  "retrievedAt": "2025-08-11T15:29:27.700Z"
}
