{
  "title": "Chinese Ambassador hands over $300,000 emergency cash assistance for flood-affected people",
  "link": "https://www.app.com.pk/national/chinese-ambassador-hands-over-300000-emergency-cash-assistance-for-flood-affected-people/",
  "date_published": "2022-08-30T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP):Ambassador of China to Pakistan, Nong Rong on Tuesday handed over $300,000 emergency cash assistance to the Pakistan Red Crescent Society to help flood disaster-affected people.\nAddressing the donation ceremony, the Chinese Ambassador said that Pakistan is now facing a severe flood disaster, which caused many casualties and heavy economic losses.\n“We share the agony of those people who are caught in difficulties and troubles because of the flood. I am sure through our joint efforts, we will overcome the difficulties” he said.\nHe said, Chinese President Xi JinPing, the other day had sent his message of sympathy over the flood disaster to the Pakistani President Arif Alvi, expressing that China and Pakistan are all-weather strategic partners with a long tradition of mutual assistance, and China will continue to help and assist Pakistan’s relief work.\nChinese Premier Li Keqiang also gave his Message of Sympathy to Prime Minister Shehbaz Sharif on the same day, the Ambassador added.\nThe Chinese people always remember when the Wenchuan earthquake hit China in 2008, Pakistan donated all the tents in storage to stricken areas. When the flood hit Pakistan, the Chinese Government immediately expressed concern and sympathy.\nHe said the first batch of 3000 tents was also handed over under the China Emergency Humanitarian Assistance. It is a part of our donation package worthy of 100 Million RMB, including 25,000 tents and other relief materials.\nBesides that, All-Pakistan Chinese Enterprises’ Association (APCEA) has donated 15Million Rupees to the PM Flood Relief Fund. Some of the Chinese enterprises in Pakistan are still working on providing more relief materials and cash donations to the local community.\nHe added that the Chinese Government also promises to support Pakistan’s post-disaster reconstruction and promote bilateral cooperation in disaster prevention and mitigation.\nThe Ambassador further stated that the disasters have no emotion, but people do.\n“Our actions of support and assistance highlight our ironclad brotherhood,” he added.\nQuoting President Xi Jinping as saying, “When brothers come together, there is nothing they cannot achieve,” I strongly believe that with the joint efforts of the Pakistani Government and people, Pakistan is sure to overcome the flood disaster at an early date.\nMs. Mumtaz Zahra Baloch, Additional Secretary (Asia Pacific) of  Ministry of Foreign Affairs, thanked the Chinese Government and embassy for emergency cash assistance for the flood-affected people by the Red Cross Society of China to Pakistan Red Crescent Society.\nShe said Pakistan is currently facing devastating floods due to unprecedented monsoon rains.\nDuring this difficult period, China, our iron brother and closest friend has once again risen to the occasion and provided us with much-needed timely assistance.\nThere has been an extensive loss of human lives, livelihoods, livestock, crops, property and infrastructure all across Pakistan.\nFollowing the first steps of relief and rescue, the second stage of rehabilitation and reconstruction will start which would need even more substantial resources.\nShe said, “we are deeply grateful to our Chinese brethren for standing with us during this time of woe. We have received messages of condolences and sympathies from President Xi Jinping and Premier Li Keqiang”.\nChina has always been the first country to step up and support Pakistan in weal and woe. She added that we are grateful that throughout this adversity, the Government and people of China have stood with us and demonstrated compassion and generosity.\n“We are thankful for the herculean efforts of the Chinese Embassy under the leadership of Ambassador Nong for providing us with assistance,” she concluded.\nAbrar ul Haq, Chairman PRCS, Pakistan Red Crescent Society, also thanked the Chinese Government and Ambassador Nong Rong for providing emergency cash assistance.",
  "retrievedAt": "2025-08-11T15:29:19.706Z"
}
