{
  "title": "COAS felicitates NUST graduates, underscores their responsibility to figure out challenges faced by country",
  "link": "https://www.app.com.pk/national/coas-felicitates-nust-graduates-underscores-their-responsibility-to-figure-out-challenges-faced-by-country/",
  "date_published": "2023-10-23T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): Chief of Army Staff (COAS), General Syed Asim Munir Monday felicitated the the National University of Sciences & Technology (NUST) graduates on successfully accomplishing their goal and remarked that it was now incumbent upon them to figure out and analyse challenges facing the country and put their intellectual resourcefulness to find their solutions.\nChairman NUST Board of Governors, COAS, General Syed Asim Munir as chief guest at the inaugural “Master Convocation Ceremony” conferred medals upon distinction holders.\nThe annual convocation week of the National University of Sciences & Technology (NUST) commenced here at the University’s main campus, an Inter Services Public Relations (ISPR) news release said.\nThe Bachelor’s, Master’s and PhD students received degrees during the course of convocation week. Degrees are being awarded to over 3500 graduates from all NUST Schools at the main campus in the 7 core disciplines.\nAddressing the graduates, the COAS extended his heartiest felicitations to graduates, their parents and faculty.\nHe commended NUST for developing a conducive ecosystem for teaching and learning – one that nurtures brilliant minds, who are fully poised to serve the nation.\nThe army chief emphasized that education was not an option but a necessity.\nHe highlighted that today was the beginning of a new chapter in students’ lives, which heralded a significant change that demanded greater responsibility.\nHe emphasized that this newfound responsibility should manifest in their personality and choices in the journey ahead.\nEarlier upon arrival, the COAS was received by Rector NUST.",
  "retrievedAt": "2025-08-11T10:12:17.567Z"
}
