{
  "title": "Police rewriting history with its blood: Sarfraz Bugti",
  "link": "https://www.app.com.pk/national/police-rewriting-history-with-its-blood-sarfraz-bugti/",
  "date_published": "2023-10-23T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP):Caretaker Federal Minister for Interior Sarfra Bugti said that police martyrs are rewriting the history of Pakistan, with their blood.\nAddressing the 49th CTP passing out ceremony of ASPs at the National Police Academy on Monday in Islamabad, Bugti said that Pakistan is facing serious threats like terrorism and the citizens, police and law enforcement agencies have made countless sacrifices to stop this wave of terrorism.\n“We must never forget that we have sacrificed thousands of lives to ensure the survival and bright future of Pakistan,” said the minster.\nApart from IG Islamabad Police, Commandant National Police Academy, foreign diplomats and families of passing out police officers participated in the ceremony.\nThe Minister while congratulating the cadets who performed outstandingly during the training said that he was very happy to come to the passing out ceremony of the Assistant Superintendents of Police of the 49th Special Training Program.\nHe said that the role and duties of law enforcement agencies are important for the stability and socio-economic development of our country.\nPolice and law enforcement agencies are using modern technology to provide justice to victims and bring anti-social elements to justice, he added.\n“I hope that the police and law enforcement agencies are increasing the capacity of the police and law enforcement agencies as required over time to meet these challenges, improving their efficiency and professionalism in their prime responsibility,” said the minster.\nHe said, these passed out graduates, especially women, will play their key role to face the challenges faced by our society.\nHe hoped that the young officers who passed out would become torchbearers for the protection of the rights of the oppressed, irrespective of their colour, caste, religion and race.\nOfficers must realize that they can support society by mobilizing support and resources to ensure the rule of law and fundamental rights, he added.\nThe minister stressed that the community policing, gender equality and children’s rights should be the cornerstone of modern policing.\nAddressing the passing out officers, he asked them to ensure the rule of law and as protectors of the rights of the citizens of Pakistan. “Use your options judiciously. You must exercise these powers as a sacred trust. I hope you live up to their expectations.” Said the minster.\nEarlier, while delivering the welcome address, commandant National Police Academy Salahuddin said that the batch of ASPs passed out consists of 35 officers, including 8 female officers and one Pakistan Air Force officer.\nIt is a rigorous 18-month training process that includes extensive academic curriculum, police management, criminal justice, law enforcement, community policing, crime control procedures, physical training, said Salahuddin.\nHe said that it has been the effort of the National Police Academy to include the latest research in its curriculum so that the officers are aware of the latest policing trends.\nOfficers are also briefed on the topics of public transactions, police media relations and protection of vulnerable sections and the course also includes anti-terrorism training for Assistant Superintendents of Police, he said.\nThe commandant said that the mission of the National Police Foundation is to provide the best possible training not only to Assistant Superintendents of Police but to all law enforcement officers irrespective of whether they belong to the police or any law enforcement post.\nHe said that National Police Foundation has developed capacity building courses for all law enforcement agencies including Frontier Constabulary, FIA, Intelligence Bureau, Punjab and Sindh Rangers etc.\nHe also appreciated the role of United States, British High Commission, ICRC, UNODC, NCA, International Criminal Investigation and Training Assistance Program in finalizing these courses. He said that the graduating officers have been selected by the Federal Public Service Commission on full merit and they are the best people for the assigned job.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:12:27.047Z"
}
