{
  "title": "Breast cancer awareness message be disseminated from door-to-door to reduce mortality rate: President",
  "link": "https://www.app.com.pk/national/breast-cancer-awareness-message-be-disseminated-at-door-to-door-level-to-reduce-mortality-rate-president/",
  "date_published": "2023-10-23T14:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP):President Dr Arif Alvi on Monday called for disseminating the awareness message about breast cancer from door to door across the country for early detection of the disease and reducing the mortality rate.\nHe said Pakistan had successfully handled the polio disease and that experience also helped the government to successfully cope with COVID-19. Now the breast cancer awareness campaign was being run very effectively.\nAddressing a breast caner awareness programme at the Aiwan-e-Sar, the president said awareness about other key health issues, including mental health, stunting, and women health should also be raised along with the breast cancer awareness campaign as it was very important to keep women healthy for a healthy nation.\nHighlighting the importance of family system, President Alvi said that a woman was the key member of a family that must be kept healthy, financially empowered, and also safe from any kind of harassment in the society.\nHe said empowering the women economically was linked to the overall economic growth of the country.\nHe said 24% of the country’s population was suffering from mental disease that was due to a number of reasons, including diseases, and financial issues.\nPresident Alvi also stressed the need to control population by increasing the access of the people to long term contraceptive products as it was key to development of the country both in terms of health and economy.\nCiting China’s example, the president said the country’s rapid development was due to its special focus on health and education.\nHe maintained that due to lack of resources, prevention should be focused to avoid the chronic disease at a later stage.\nFirst Lady Begum Samina Alvi addressing a Breast Cancer Awareness program, at Aiwan-e-Sadr, Islamabad, on 23-10-2023.First Lady Begum Samina Alvi urged the women to learn how to make self detection to ensure timely diagnose of the disease.\n“Women should make habit of self examination for five minutes every month to minimize the death rate.”\nAppreciating the role of media in success of the campaign, the first lady said the media should continue its role in raising awareness about the disease.\nShe said she initiated the breast cancer awareness campaign five years ago and now the topic that was considered a matter of discomfort and taboo to discuss, was now being discussed at every level.\nExpressing pleasure over increasing awareness about the disease, she hoped that the campaign would help further increasing the message to every door across the country.\nShe informed that every year some 44000 women die of breast cancer and the deaths could be avoided by early diagnosis.\nShe said the early diagnose ratio in the world was 98% however in Pakistan most of the cases were reported at third and fourth stages where the death chances went high. However, she expressed her satisfaction over increasing number of cases being reported at first and second stages due to the awareness campaign.\nShe said death rate among the breast cancer patients in Pakistan was 48% which was alarmingly high. She asked the people not to feel any hesitation while discussing this disease.\nBegum Alvi said the taboos and myths about the disease were now being broken and the people were now freely discussing about breast cancer disease at every forum.\nCaretaker Minister for Health Dr Nadeem Jan on the occasion said the government needed to increase the health budget in the country up to 4% of GDP that was currently only 1% of GDP.\nCountry representative for Pakistan World Health Organizat\nFirst Lady Begum Samina Alvi urged the women to learn how to make self-detection to ensure timely diagnose of the disease.\n“Women should make habit of self-examination for five months every month to minimize the death rate.”\nAppreciating the role of media in success of the campaign, the First Lady said the media should continue its role in raising awareness about the disease.\nShe said the early diagnose ratio in the world was 98%, however, in Pakistan most of the cases were reported at third and fourth stages where the death chances went high. However, she expressed her satisfaction over increasing number of cases being reported at first and second stages due to the awareness campaign.\nShe said death rate among the breast cancer patients in Pakistan was 48% which was alarmingly high. She asked the people not to feel any hesitation while discussing the disease.\nBegum Alvi said the taboos and myths about the disease were now being broken and the people were now freely discussing about breast cancer at every forum.\nCaretaker Minister for Health Dr Nadeem Jan, on the occasion, said the government needed to increase the health budget in the country up to 4% of Gross Domestic Product which was currently only 1% of GDP.\nWorld Health Organization’s Country Representative for Pakistan Dr Palitha Gunarathna Mahipala, while addressing the ceremony, appreciated President Dr Arif Alvi and First Lady Begum Samina Alvi for raising awareness about breast cancer in the country.",
  "retrievedAt": "2025-08-11T10:12:08.437Z"
}
