{
  "title": "Pak-Turkiye enjoy versatile defence cooperation reaching new heights of cooperation: Amb Pacaci",
  "link": "https://www.app.com.pk/national/pak-turkiye-enjoy-versatile-defence-cooperation-reaching-new-heights-of-cooperation-amb-pacaci/",
  "date_published": "2023-10-23T10:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): Republic of Turkiye, Ambassador Mehmet Pacaci on Monday said versatility of defence cooperation had touched new heights with the production of four warships by Turkiye.\nHe was addressing the Distinguished Lecture Series, titled ‘Diplomatic Reflections’ at Islamabad Policy Research Institute (IPRI) here titled “Pakistan-Turkiye Relations: An Enduring Partnership.”\nAmbassador Pacaci said, “Two warships will be manufactured in Istanbul and two more at Karachi Shipyard. One has already been churned out into the high seas.”\nHe said that the bilateral relations were not only deep-rooted and time-tested, but rather had entered a new era of modern cooperation as both the countries were making new strides in technological cooperation and revitalizing geo-economics.\nHe, however, regretted that the volume of trade between the two countries was not up to the potential, as they were well behind $1 billion mark.\nHe hoped that the same should surpass well above $5 billion, and urged upon the trade and commerce bodies to work together for greater integration and initiatives.\nHe pointed out at the Free Trade Agreement (FTA) signed between the two countries, and was relieved that it was operational at the moment and is making headway in renewed cooperation. Nonetheless, he saw hurdles in its way and the prime to obstruct are geopolitical fissures as the region is in turmoil.\nAmbassador Pacaci said that more than 50 Turkish companies were presently operating in Pakistan, and hoped that many more were in the pipeline as there was immense potential of trade and investment in industrial and other ventures.\nThe learned scholar who holds a PhD in ‘Tafsir and Hadith’ and had worked relentlessly for Islamic solidarity and campaigned against Islamophobia, called for greater unity among the Muslim world, and hinted at reigniting a new spirit in the Organisation of Islamic Cooperation (OIC).\nTo a question, he said that the proposed neo-alignment between Turkiye, Iran, Malaysia, Qatar and Pakistan for advocating a new forum of Islamic states was very much on cards and must be looked into as a mark of congenial cooperation without any divide.\nAt the same time, he stressed the utility of OIC and pointed out the efforts presently being undertaken by it to address the imbroglio and massacre in Gaza.\nHe hoped that the Foreign Ministers’ moot in Cairo would be a success, and something positive would emerge out of it.\nHe blamed the United States for Israeli transgression and said that it was acting as the biggest obstacle in resolving the Palestinian crisis.\nAmbassador Pacaci said that similar cooperation in educational and cultural spheres were a landmark of commonality and added that more than 13,000 students were benefitting from seven schools and 10 Turkish campuses in Pakistan.\nPointing out at the Istanbul-Tehran-Islamabad (ITI) railway network, he said that there were multiples odds to confront, such as the meter-gauge and broad-gauge issues.\n“With Pakistan still with the old gauge railway lines, the smooth movement comes to a halt,” he observed.\nLikewise, he said that sanctions on Iran from the US and Europe act as an impediment in realising the trilateral railway feast.\nTalking about the refugee crisis, Ambassador Mehmet Pacaci observed that “terrorism is at the root-cause of all ills.\n” He said that there was much to learn and share between Pakistan and Turkiye, as both were home to refugees’ exodus owing to geopolitical upheavals.\nAbout the ongoing Israeli onslaught on Gaza, Pacaci observed that “a mechanism is being construed and Turkiye is proactively engaged in it to address the human catastrophe and ensure a permanent solution.”\nHe blamed the United Nations for failing to do its job, and advocated a two-state solution on the borders of 1967 in the Middle East.\nIn his vote of thanks, President IPRI, Ambassador (R) Dr Raza Muhammad said Gaza and the occupied territory of Palestine are under siege since long and this area is declared world’s largest open-air prison whereas the same situation persisted in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe alleged that Indian fascist regime was emulating Israeli model in IIOJK to cleanse Kashmiris from their motherland, whereas the world must take notice of this situation.\nThe President IPRI mentioned that the association of the people of Pakistan with Turkiye is not only historic but before its independence.\nHe added that Pakistan, Iran and Turkiye were well connected through roads and rail routes which could be further augmented with the addition of Afghanistan if the situation improved in the country.",
  "retrievedAt": "2025-08-11T10:12:21.783Z"
}
