{
  "title": "PM stresses upon youth to pursue ideals with devotion, dedication",
  "link": "https://www.app.com.pk/national/pm-stresses-upon-youth-to-pursue-ideals-with-devotion-dedication/",
  "date_published": "2023-10-23T17:41:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Oct 23 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday stressed that persistent struggle coupled with dedication and devotion were the keys to achieve high goals in life.\nAddressing an awards giving ceremony of 67th Army Welfare Trust (AWT) National Hockey Championship at Lt. Gen Ishfaque Nadeem Hockey Stadium, the prime minister said that past glory of the country in the game of hockey could be revived through joint efforts by all the stakeholders including the private sector.\nThe prime minister said that anything in life was achievable and if 240 million population of Pakistan whose 60 percent consisted of youth bulge, decided to achieve prominence among the commity of nations, they could achieve the feat.\n“Consistent efforts, dedication and passion are the ingredients that can open doors to success, ” he added.\nThe caretaker prime minister further said that nations were known for their notable deeds in realms of culture and knowledge, and Pakistan was once ranked high in the field of hockey.\nTerming AWT and PHF efforts and arrangements for the tournament as outstanding, he stressed upon all stakeholders and private sector to come forward and play their part for the revival of national game.\nThe prime minister also expressed his pleasure over the company of former Olympians and hockey stars and said that the occasion had revived his nostalgic feelings about the national game.\nHe urged the young players to follow the role models in the field of hockey who had brought laurels to the country.\nPrime Minister Kakar said that games like hockey, squash and cricket had promoted the soft image of Pakistan across the globe.\nHe also termed the ideas of arranging Pakistan Hockey League, a good one which would help in the revival of the game.\nThe prime minister also appreciated the organizers, teams and sponsors for their efforts.\nAt the end, he gave away prizes and medals among the winning team of MPCL that defeated WAPDA in the final match through penalty shootouts.\nEarlier, Managing Director AWT Lt. Gen (retd) Naveed Mukhtar highlighted functioning of the Trust and its support to the national tournament.\nHe said a total of 20 teams had participated in the event.\nHe urged all the stakeholders to come forward and support such like efforts.\nHe announced that AWT would sponsor national hockey championship in the next three years.\nPresident PHF, former Olympians Islahuddin, Shehbaz senior and Akhtar Rasool also spoke on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:12:10.498Z"
}
