{
  "title": "Pakistan ready to work with ASEAN states on confidence-building, conflict prevention: FM",
  "link": "https://www.app.com.pk/national/pakistan-ready-to-work-with-asean-states-on-confidence-building-conflict-prevention-fm/",
  "date_published": "2023-10-23T09:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): Foreign Minister Jalil Abbas Jilani on Monday terming a peaceful and stable Asia Pacific a priority said Pakistan stands ready to work with the member states of ASEAN (Association of Southeast Asian Nations) for attaining the goals of confidence-building and conflict prevention.\nSpeaking at the inauguration of the ASEAN Corner at the Institute of Strategic Studies Islamabad (ISSI), the foreign minister highlighted Pakistan’s efforts in forging the future prospects of its relations with ASEAN.\nJilani reaffirmed Pakistan’s support for an international order based on peaceful co-existence, amicable settlements of disputes, win-win cooperation, and shared prosperity.\nHe mentioned that Pakistan was fully supportive of the principles of ASEAN and was collaborating in a number of areas including conducting courses on finance and banking.\nHe regretted that the South Asian Association for Regional Cooperation (SAARC) which was established on the same lines of ASEAN despite its potential had fallen victim to India’s policies.\nThe foreign minister said Pakistan was currently facing economic, demographic, and economic and climate change challenges besides the creation of jobs for the young population.\nHe said Pakistan looked forward to meaningful cooperation amongst countries across the globe and termed it incumbent upon to work towards putting Pakistan on the path of sustainable economic growth.\nFor socio-economic development, he said peace and security were a fundamental requisite, hence Pakistan’s priorities in foreign policy towards the neighbourhood, as well as region, was to make it conflict-free and development-driven.\nHe stressed the need to avoid bloc politics and geo-political constructs that did not align with the geographical historical and cultural realities of the distinct regions spanned by the Indian and Pacific Oceans.\nAs a proponent of multilateralism, he said, Pakistan believed that recommitment to the fundamental principles of the United Nations charter was the need of the hour.\nHe emphasized Pakistan’s consistent aspirations for a full dialogue partnership underscoring its continued commitment to ASEAN.\nPakistan would remain a strong partner in all endeavours of peace, stability, and development of the region, he said.\nHigh Commissioner of Malaysia Mohammad Azhar Mazlan highlighted the importance laid by his country in strengthening the motives of ASEAN. He also stressed joint efforts by the member states to gain the mutual benefits of cooperation.\nDirector General ISSI Ambassador Sohail Mahmood spoke about the significance of the ASEAN in areas of regional cooperation.\nEarlier, the foreign minister along with other dignitaries unveiled the plaque of the inauguration of ASEAN Corner established at ISSI.",
  "retrievedAt": "2025-08-11T10:12:24.894Z"
}
