{
  "title": "PNSC earns 879% increase in PAT amounting Rs 23,956 mln",
  "link": "https://www.app.com.pk/national/pnsc-earns-879-increase-in-pat-amounting-rs-23956-mln/",
  "date_published": "2023-06-08T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP): The Pakistan National Shipping Corporation (PNSC) group successfully earned 879 percent increase in Profit After-Tax (PAT) amounting to Rs 23,956 million during the first three quarters of FY 2022-23 as against Rs 2,446 million in the corresponding period of the last year.\nAccording to the Economic Survey 2022-23, the PNSC has a fleet strength of 12 vessels of various types and sizes comprising of 5 Bulk carriers, 5 Aframax tankers and 2 LR-1 Clean Product tankers.\nThe corporation has recently added two Aframax Crude Oil tankers i.e. M.T. Mardan and M.T. Sargodha in its managed fleet to meet the country’s ever-rising energy needs. The corporation is currently in the process of acquiring two chemical tankers for the transportation of edible oil. The total deadweight capacity/cargo carrying capacity of the PNSC fleet is 938,876 metric tonnes.\nThe commercial performance of the PNSC from July-March FY2023 is summarized in Table 13.2. This tremendous increase in profit can be explained by an increase in shipping operations and owing to other nonroutine activities such as the sale of a tanker vessel ‘M.T. Karachi’, profit earned on revaluation of foreign assets as a result of exchange rate fluctuations.\nHence, earnings per share increased to Rs 181.40 as against Rs 18.52 during the same period. Cumulatively, the group achieved a turnover of Rs.42,379 million with a PNSC share of Rs.10,368 million during this period as compared to Rs.16,223 million having a PNSC share of Rs.6,295 million for the corresponding period last year. There venue increment of an amount of Rs.23,876 million was observed from liquid cargo segment.\nDue to this exponential increase in the revenue, the gross profit margin and net profit margin of the PNSC group was observed at 48% and 57% during July-March 2023 as compared to 24% and 15% respectively during July-March FY2022.",
  "retrievedAt": "2025-08-11T08:39:39.427Z"
}
