{
  "title": "Govt intensifies efforts to address malnutrition challenges: Survey",
  "link": "https://www.app.com.pk/national/govt-intensifies-efforts-to-address-malnutrition-challenges-survey/",
  "date_published": "2023-06-08T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): Various programs have been undertaken to provide nutrition services for the wellbeing of marginalized population groups in the light of Pakistan Vision 2025 and government’s commitments to global nutrition targets.\nAccording to Pakistan Economic Survey 2022-23, launched by Federal Minister for Finance and Revenue Senator Mohammad Ishaq Dar on Thursday, the government has intensified its efforts to address the challenge of malnutrition and mitigate its long-term social and economic consequences by focusing on the most underprivileged and vulnerable population groups.\nThe government, with the help of the international community, has carried out several rescue and relief activities such as food assistance to the affected population. Nonetheless, there is an urgent need to scale up nutrition interventions aimed at vulnerable groups in order to save lives and ensure nutrition security.\nVarious interventions and activities have been carried out by the government at the federal level during FY2023 to upscale nutrition security.\nThe formulation of a multi-sectoral National Nutrition Policy (MS-NNP) has been initiated with the support of nutrition partners to serve as a guiding document for multi-sectoral nutrition planning and programming in order to substantially reduce the level of malnutrition and to mainstream nutrition in national socioeconomic development plans.\nEarly Childhood Development (ECD) Policy framework, index and standards are being finalized.\nThe ECD policymakers’ course- “Mapping ECD Entry Points and Potential Intervention” has been organized to deliberate on mainstreaming ECD interventions in government development programs/policies. Moreover, the ECD governance structure has been established at the federal and provincial levels.\nIn order to initiate a national school meal-nutrition program, a governance structure has been recognized at the federal level in view of the recommendations of the National Consultation on School Meals-Nutrition Program to provide stewardship, coordination and decision-making for initiating school meal programs across the country in collaboration with the provinces and other partners.\nA report of the thematic session of the Turnaround Pakistan National Conference “Tackling Malnutrition and Stunting” has been formulated encompassing key policy recommendations on the thematic areas of Early Childhood Development (ECD), Tackling Triple Burden of Malnutrition using multi-sectoral approaches, and School Nutrition/ Meal Programme considering inputs given by relevant stakeholders.\nRural Poor Stimulus Facility Program “Improving Food Security and Nutrition Minimizing the Impact of Covid-19 on Livelihoods of Poorest Households in South Punjab” has been executed in Bhakkar, Khushab and Mianwali districts.\nUnder the pilot project, community food banks were established and strengthened, trainings were imparted and inputs for kitchen gardening and poultry keeping were supplied to promote dietary diversity, improve nutrition, health, and educational outcomes in the targeted districts.",
  "retrievedAt": "2025-08-11T08:39:36.557Z"
}
