{
  "title": "Pakistan to continue extending political, diplomatic support to Kashmiris; FO",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-extending-political-diplomatic-support-to-kashmiris-fo/",
  "date_published": "2023-06-08T16:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP): Pakistan will continue to extend political, diplomatic and moral support to Kashmiris for the just and peaceful settlement of the Jammu and Kashmir dispute in accordance with the United Nations Security Council’s resolutions.\nSpeaking at a weekly press conference here Thursday, the spokesperson Foreign Office said that the International Day for Innocent Children Victims of Aggression, observed on June 4, reminded the plight of the Kashmiri children who are constantly suffering from the continued siege and brutal oppression by the Indian forces.\n“The entire generation of Kashmiri children has grown up in a climate of fear, violence and repression. Kashmiri orphans suffer in economic hardship, isolation and psychological trauma. Scores of school children have been injured by pellets, bullets and teargas shells fired by the Indian forces. Many of them have lost their eye sight, fully or partially.”\nShe said the United Nations called on India to take preventive measures to protect children and ending the use of pellets against children. “We urge India to heed to this call and protect the children of Kashmir from violence, displacement and trauma.”\n“Pakistan has had a consistent policy for the last 70 years on Kashmir which affirms it as a disputed territory, that states that India is illegally occupying the land of the Kashmiri people. The solution of the Kashmir dispute lies in the UN Security Council resolutions and steps must be taken to resolve this dispute in accordance with the wishes of the Kashmiri people and the UN Security Council resolutions,” she added.\nTo a question about the incidents of May 9, the spokesperson said that Pakistan was a country of laws and it was a country which had constitutionally guaranteed human rights and fundamental freedoms and “we are a democratic setup with free and independent judiciary. The Government of Pakistan will continue to follow its obligations under the law, under the Constitution”.\n“On both your questions, I would like to underline that Pakistan will follow its laws and its international obligations in bringing to justice individuals responsible for the events of 9th May. We have received the requests that you have mentioned, and those requests have been sent from the Ministry of Foreign Affairs to the Ministry of Interior, which takes final decision in such cases.”\nTo a question regarding the United Arab Emirates’ nomination of Sultan Ahmed Al Jaber as the President of this year’s UN climate conference, COP-28, the Spokesperson stated that Pakistan believed that the United Arab Emirates’ Presidency of COP-28 was an opportunity for meaningful progress and effective global action on key areas to mitigate and reverse the negative impacts of climate change.\nOver the years, the United Arab Emirates had demonstrated a strong commitment to renewable energy sources, such as solar and wind power. Through initiatives like the Masdar City project, the Abu Dhabi Clean Energy Strategy, the UAE net zero by 2050, and clean fossil fuels, the UAE made substantial investments in leading global efforts for achieving the goal and targets of the UNFCCC and its Paris Agreement, she added.\n“The UAE has also manifested its commitment towards combating climate change by implementing several sustainable initiatives to mitigate climate change effects. For instance, the Mohammed bin Rashid Al Maktoum Solar Park, one of the largest renewable energy projects globally, contributes to reducing carbon emissions. The UAE has also invested in sustainable agriculture, water conservation, and waste management, demonstrating a comprehensive approach to addressing various aspects of the climate crisis.”\nThe spokesperson said the UAE’s strategic location also allowed it to play a crucial role in addressing climate change by serving as a bridge between the global north and global south in fostering international cooperation, knowledge sharing, and innovation to find common solutions.\n“Pakistan is confident that the UAE’s presidency of COP-28 offers immense potential for global progress in addressing the challenges posed by climate change. With its commitment to renewable energy, strategic position, sustainability-driven initiatives, technological advancements, international collaboration, and knowledge sharing, the United Arab Emirates can play a vital role in driving positive change and inspiring a sustainable future for all.”\n“Pakistan has full trust that under the stewardship of Sultan Ahmed Al Jaber as President of COP-28, we will be able to drive the global agenda on climate change in a positive direction decisively in December 2023,” she added.",
  "retrievedAt": "2025-08-11T08:39:30.435Z"
}
