{
  "title": "President urges universities to play role in preventing extremism, violence in society",
  "link": "https://www.app.com.pk/national/president-urges-universities-to-play-role-in-preventing-extremism-violence-among-students/",
  "date_published": "2023-06-08T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP): President Dr Arif Alvi on Thursday called upon the universities to play an active role in preventing intolerance, extremism, and violence in society, particularly among students, and guide them towards a positive mindset.\nThe universities, he said, should arrange regular capacity-building training sessions for their management and faculty members to inculcate in students the ability to address extremism.\nAddressing the National Vice Chancellors’ Peace Conference, the president said banning the students’ unions in universities was not a solution and stressed that there was a need to change their mindset through proper teaching methodologies.\nHe said such measures would ensure the reformation of students to help them contribute towards the country’s better future, sustainable peace and prosperity.\nThe president emphasized the need for research-based learning and said equal opportunities should be given to students and women in the field of education.\nKeeping in view the rapid development of modern technology in every sector, he said usage of modern technology was inevitable in current scenario, which he said was vital to meet the advancement of the contemporary world.\nHe said promoting good values and morality in the society was need of the hour.\nHe also pointed out the phenomenon of the “invasion of fake news” across the globe, which he said needed to be addressed on priority.\nDr Arif Alvi said highly educated IT graduates should be prepared to meet the growing needs of current and future requirements.\nExpressing gratitude over the participation of large number of women in the conference, the president said women’s role was significant in educating and training the future generations.\nHe urged sensitizing the society on creating opportunities for educated women to help them work according to their abilities.\nPresident Alvi stressed the need for promoting ethics, morality, empathy, forgiveness, and tolerance among students and society.\nHe asked the students not to indulge in activities that caused stress among them.\nThe president hoped that the challenging times would pass soon and the country would witness exponential growth within five to seven years. The country would stand on a strong footing again, he said.\nThe two-day conference was jointly organized by Higher Education Commission (HEC), Pakistan, National Counter-Terrorism Authority (NACTA), and Shaoor Foundation for Education and Awareness (SFEA).\nThe conference themed “Academic Discourse on Countering Extremism – The Way Forward” is a significant milestone in the implementation of the Peace, Advocacy, and Community Engagement through Transformation (PACT) for Tolerance project, which is built on a foundation of collaboration and cooperation between SFEA, HEC Pakistan, NACTA, and other policy-level stakeholders.\nChairman HEC Dr. Mukhtar Ahmed, sharing his thoughts on the issues within society, said that conflict permeated various sectors of society including families, and deserved a collaborative and coordinated response.\nApart from teaching, he said, as a beacon of knowledge and enlightenment, the universities had the responsibility to foster responsible citizenship and produce good human beings.\nHighlighting the importance of youth in the society, Member NACTA Muhammad Iniksar Khan highlighted the role of youth in policy-making for sustainable peace and preventing extremism in the society.\nFounder SFEA Syed Ali Amir said youth were the asset of the society and their abilities needed to be explored and utilized.",
  "retrievedAt": "2025-08-11T08:39:23.991Z"
}
