{
  "title": "Govt committed to restore essential service delivery in flood-hit areas",
  "link": "https://www.app.com.pk/national/govt-committed-to-restore-essential-service-delivery-in-flood-hit-areas/",
  "date_published": "2023-06-08T14:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): The government is committed to restoring essential service delivery and critical public health functions, with a focus on disease outbreak surveillance in flood-affected districts in order to minimize the impact of the disaster.\nAccording to the ‘Pakistan Economic Survey 2022-23’, launched by Federal Minister for Finance and Revenue Senator Mohammad Ishaq Dar on Thursday, more than one-fifth of the facilities were completely damaged.\nThe 2022 floods damaged 13 percent of the health facilities resulting in disruption of health service delivery from the community level to primary healthcare (Rural Health Centres and Basic Health Units) through the secondary level (district headquarters, tehsil headquarters, and civil hospitals).\nFor the medium to long term, there is a need to build resilient health systems and infrastructure to enhance response readiness to the crises like infectious disease outbreaks and natural hazards, while also maintaining core functions of the health systems. Recovery and reconstruction costs, including immediate additional needs, are estimated at Rs 40,294 million (US$187.6 million).\nThe estimations cover damages to the infrastructure, equipment, furniture and vehicles, with 20 percent added for resilience, Disaster Risk Reduction (DRR) and Build Back Better (BBB) and 10 percent for inflation.\nIn order to provide relief assistance to the flood affectees, National Disaster Management Authority (NDMA) initiated an extensive assistance plan including the dispatch of rescue and medical terms and food and non-food relief goods in the affected areas based on the need assessment.\nDuring the first three-quarters of FY2023, the NDMA supplied 2,044,104 mosquito nets, 7300 hygiene kits, 126,200 food packs, 18,860 first aid kits, and 350 life-saving jackets among other supplies to various provinces of the country in an effort to provide humanitarian assistance to the flood affectees.\nBesides NDMA’s efforts, international relief to various provinces included the provision of 27,090 hygiene kits, 239.4 tonnes of food ration, and 39.97 tonnes of medicine.",
  "retrievedAt": "2025-08-11T08:39:43.822Z"
}
