{
  "title": "Govt allocates around 44b rupees for HEC during 2022-23",
  "link": "https://www.app.com.pk/national/govt-allocates-around-44b-rupees-for-hec-during-2022-23/",
  "date_published": "2023-06-08T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP):The Federal Government during the period from July, 2022 to May, 2023, had allocated Rs 44.719 billion to Higher Education Commission (HEC) for the implementation of 154 development projects (138 ongoing and 16 newly approved projects) of public sector Universities/HEIs/HEC, under Public Sector Development Programme (PSDP-2022-23).\nAccording to the Economic Survey 2022-23, initially, 2.6 percent of people had access to higher education which has presently increased to 10 percent.\nMeanwhile, during the period July–December 2022, an amount of Rs 7.667 billion was released to development projects. During the period January-May, 2023 an amount of 35.212 billion were released. Hence accumulative Rs 42.879 billion were released from July-May FY2023.\nFollowing major development initiatives have been launched during the above cited period, 5000 scholarship for Balochistan and FATA students (Phase-III), scheme of 200 scholarships for the coastal region of Balochistan, establishment of federal institute at North Waziristan tribal district, PM’s Youth Laptop (100,000) Scheme (Phase-III), establishment of University of Gwadar (Phase-I) and strengthening of Lab facilities in 05 leading Engineering Universities (UET Peshawar, Taxila, Lahore, Khuzdar and NED Karachi).\nDuring the current FY 2023, 30 projects have been planned for completion, while out of these funding to 04 projects have been completed. The Increase in Access and HEC Recognized Universities Public Sector and Private Sector Universities has been increased to 247 ((Public Sector: 147 and Private Sector: 100) with tertiary enrollment of 2 million students.\nHuman Resource Development (HRD)/ Scholarship Division of HEC had announced several scholarship programmes.\nDuring the current FY 2023, an amount of Rs 8.891 billion has been allocated for 18 national scholarships schemes, including Rs 2.059 billion has been allocated for 3000 scholarships for Afghan students, 75 new scholarships have been announced in the top 25 Universities of the world on the occasion of 75th Anniversary of Pakistan, Research and Development, grant of Rs 1,020.0 million had been released to National Research Programme for Universities (NRPU).\nSimilarly, around 88 projects have been completed and new 184 research projects have been awarded from July-May FY2023. Seven projects have been awarded under Technology Transfer Support Fund (TTSF) at a total cost of Rs 72 million.\nA total of 37 Business Incubation Centers (BICs) at public sector Universities have been established by the HEC; out of which, 8 BICs were established in FY 2022 and FY2023 at an approved budget of Rs 168 million out of which Rs 112 million has been released as 1st trench.\nHEC awarded 15 projects under Innovator Seed Fund (ISF) Call 2021-22. The projects are from young and budding entrepreneurs working on innovative business ideas to convert them into sustainable businesses.\nIndividual grant of ISF award is US$35,000 with a total approved budget for 15 awards of Rs 118m out of which Rs 72.73 million was released as 1st installment in FY2023.\nThe HEC’s R&D Division organized the capacity building programs for BIC Director / Managers in four different cohorts and trained more than 50+ Directors/Managers on entrepreneurship mentoring.\nThe HEC in collaboration with SMEDA, initiated the establishment of National Idea Labs (NIL) at HEC established BICs at NUST, NED, NTU, IM Sciences and BUITEMS, while the first cohorts of NIL are in progress.",
  "retrievedAt": "2025-08-11T08:40:09.064Z"
}
