{
  "title": "Sanjrani terms his visit to Russia as historic",
  "link": "https://www.app.com.pk/national/sanjrani-terms-his-visit-to-russia-as-historic/",
  "date_published": "2023-06-08T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP):Chairman Senate Muhammad Sadiq Sanjrani on Thursday termed his four-day visit to Russia as a historic one and expressed the desire to continue such positive engagements for benefit of people of two sides.\nHe hoped that this visit would go a long way in bolstering bilateral ties, said a statement issued here.\nDuring his visit to Russia, he held meetings with Russian Parliamentarians and Government officials to strengthen ties between the two nations.\nNotably, Chairman Sanjrani met with Deputy Prime Minister Alexandar Novak,  Chairman of the state, VV Volodin, and paid respects at the monument of the unknown soldiers near the Kremlin wall by laying flowers.\nIn addition to these engagements, he delivered a significant address at the plenary session of the Federation Council of the Federal Assembly of the Russian Federation, marking a new chapter in the development of bilateral relations.\nDuring the meetings, the chairman emphasized the importance of Pakistan’s historical and political relationship with Russia.\nHe highlighted the role of regional relations in promoting social and economic development and expressed Pakistan’s commitment to the vision of regional progress.\nThe purpose of the visit was to elevate bilateral relations to new heights.\nDuring a meeting in Moscow, the chairman and Deputy Prime Minister of Russia, Alexander Novik discussed ways to strengthen bilateral relations, including trade, investment, energy, defense, culture, and exchanges of delegations.\nThey expressed satisfaction with the ongoing progress in Pakistan-Russia relations and underscored the significance of collaboration in addressing common challenges and promoting peace and stability.\nThe chairman stressed the vast investment opportunities available in Pakistan and encouraged investors from both countries to capitalize on these prospects.\nFurthermore, Sanjrani held detailed discussions with State Duma Chairman VV Valodin on issues of mutual interest.\nHe highlighted the abundance of mineral resources in Balochistan and other areas, as well as various sectors including CPEC, health, education, and information technology.\nThe chairman Senate emphasized the favorable investment environment in Pakistan, which had garnered interest from several countries.\nSadiq Sanjrani also visited the Moscow Cathedral Mosque, where he was received by the Grand Mufti Ginutuddin.\nThe Grand Mufti provided insights into the history and activities of the mosque, as well as Russia’s relations with the Muslim world.\nThe chairman commended Russia’s commitment to respecting all religions and fostering inter-religious harmony.\nHe reaffirmed Pakistan’s dedication to promoting peace in the region and emphasized the freedom enjoyed by all minorities in the country.\nAdditionally, Muhammad Sadiq Sanjrani paid homage to the unknown soldiers at the memorial near the Kremlin Wall by laying flowers.\nDuring the visit, the chairman is accompanied by Senators Manzoor Ahmad Kakar, Dilawar Khan, Ms Rubina Khalid, Ms Nuzhat Sadiq, Abdul Ghafoor Haidari, Abdul Qadir, Tahir Bizenjo, and others.They expressed deep respect for the services rendered by these brave individuals.\nDuring their stay in Moscow, Chairman Senate and the delegation also visited historical sites, lauding the warm hospitality extended by the government and people of Russia.",
  "retrievedAt": "2025-08-11T08:39:57.541Z"
}
