{
  "title": "Highlights Of Pakistan Economic Survey 2022-23",
  "link": "https://www.app.com.pk/national/highlights-of-pakistan-economic-survey-2022-23/",
  "date_published": "2023-06-08T13:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP):Following are the highlights of Pakistan Economic Survey 2022-23 launched here Thursday by Federal Minister for Finance and Revenue, Senator Mohammad Ishaq Dar:\nGROWTH AND INVESTMENT• GDP growth (FY2023): 0.29% (Provisional) against 6.1% last year.• Agriculture sector growth: 1.55 % (4.27 % last year)• Industry growth: -2.94 % (6.83% last year)• Manufacturing: -3.91% (10.86 % last year)• Construction Sector: -5.53% (1.90 % last year)• Electricity, Gas, and Water Supply, the other sub-sector of Industry posted a growth of 6.0% (3.14% last year).• Services Sector growth: 0.86% (6.19% last year).• Wholesale & Retail Trade (WRT): -4.46% (10.3% last year) – its performance is dependent on Agriculture and Industry.• Transport and Storage: 4.73% (4.09% last year) whereas accommodation and food services activities have grown by 4.11% (4.08% last year).• Information & Communication: 6.93 % (16.32% last year), due to an increase in revenue of PTA.• Nominal GDP increased to Rs. 84,658 bn (Rs. 66,624 bn last year), recorded a growth of 27.1%• Per Capita Income: $1,568 ($1,765 last year), -11.2 % Growth due to Currency depreciation, lower growth, and rising population• Total Investment: 10.2 % growth (29.1% last year), 13.6 % of GDP, (15.7 % FY 2022)• Private Investment: 6.18 % growth (27.66% last year), 8.8% of GDP (10.5 % FY 2022)• Public Investment: 14.10 % growth (39.27% last year), 3.1 % of GDP, (3.5 % FY 2022) • National Saving: 44.7 % growth (-3.8% last year), 12.6 % of GDP, (11.1 % FY 2022)\nAGRICULTURE• Agriculture sector growth: 1.55 % (4.27 % last year)• Crops sector growth: -2.49 % (8.19 % last year)• Important crops growth: -3.20 % (5.41% last year)• Other crops growth: 0.23% (11.93% last year)• Livestock sector growth: 3.78 % (2.25% last year)• Forestry growth: 3.93% (4.07% last year)• Fishing growth: 1.44% (0.35% last year)\nMANUFACTURING GROWTH• Manufacturing Growth: 3.91% (10.86% last year)• LSM growth (Jul-Mar, FY2023): -8.11% (10.61% last year)\nFISCAL DEVELOPMENT• Fiscal deficit (Jul-Apr FY2023): 4.6 % of GDP (4.9 % of GDP last year).• Primary balance (Jul-Apr FY2023): a surplus of Rs. 99.1 bn (deficit of Rs.890.2 bn last year), reflecting a slowdown in the growth of non-markup expenditures.• Total revenue (Jul-Mar FY2023): increased by 18.1 % to Rs.6,938.2 bn (Rs. 5,874.2 bn last year). Both tax and non-tax collection contributed to an increase in overall revenue.• Total Tax revenue Federal and Provincial (Jul-Mar FY2023): grew by 16.5 % to Rs. 5,617.7bn (Rs.4,821.9bn last year) on the back of a significant rise in FBR tax collection despite various economic challenges at the domestic and global levels.• Non-tax revenue (Jul-Mar FY2023): grew by 25.5 % to Rs.1,320.5 bn (Rs.1,052.2 bn last year).• Total expenditures (Jul-Mar FY2023): grew by 18.7 % to Rs.10,016.9 bn (Rs.8,439.8 bn last year).• Current expenditures (Jul-Mar FY2023): grew by 25.3 % to Rs.9,244.6 bn (Rs.7,378.0 bn last year). o Higher growth is mainly due to a 69.1 % growth in markup payments due to higher policy rates at the domestic & international levels and a\nRupee depreciation.• Development expenditures and net lending (Jul-Mar FY2023): marginal increase of 0.9 % to Rs.1,060.4 bn (Rs.1,051.1 bn last year).• Expenditures under PSDP (Jul-Mar FY2023): registered a decline of 1.8 % to Rs.1,014.0 bn (Rs.1,032.7 bn last year).• FBR tax collection (Jul-May, FY2023): increased by 16.1 % to Rs. 6,210.1 bn (Rs. 5,348.2 bn last year).\nMoney and Credit• Policy rate (FY2022), increased by a cumulative 675 bps from 7.0% to 13.75%.• Policy Rate (July-April FY2023), increased by 725 bps to 21%.• Broad money (M2) (01st July-12th May, FY2023): ?7.3% to Rs 2,026.3 bn (Rs 1,512.0 bn, 6.2% last year)• Credit to the private sector (01st Jul-12th May, FY2023): Rs 75.4 bn (Rs 1,345.2 bn last year).• Fixed investment loans stood at Rs 185.4 bn during Jul-Apr, FY2023 (Rs 366.7 bn last year).• Working Capital loans observed retirement of Rs 460.3 mn during JulyApril, FY2023 (Rs 628.9 bn last year).\nCAPITAL MARKET & CORPORATE SECTOR• During Jul-Mar FY2023, 21,117 new companies were incorporated with SECP, which is 5.9 % higher than the same period last year.• Jul-Mar FY2023, 2.96 mn lots of various commodity futures contracts including gold, crude oil, and US equity indices worth Rs 3.49 trillion were traded on Pakistan Mercantile Exchange which is 28.1 % higher than the same period last year.• The Morgan Stanley Capital International Emerging Market (MSCI-EM) Index (index of 24 emerging stock markets) declined by 1.0 percent during Jul-Mar FY2023.• Increase has been observed in the S&P 500 of the US (8.6%), CAC 40 of France (23.6%), and FTSE Straits Times of Singapore (5.1%).• The KSE-100 index of Pakistan opened at 41,540.8 points on 1st July 2022 and closed at 40,000.8 points on 31st March 2023, showing a decline of 3.7%.• Market capitalization of the PSX recorded at Rs 6,956 bn on 30th June 2022 and closed at Rs 6,108 bn on 31st March 2023, reflecting a decline of 12.2 % during the period.\nINFLATION• Average CPI Inflation rate (Jul-May, FY2023): 29.2 % (11.3 % last year).• The inflationary pressures are emanating from weaker exchange rate, supply disruptions created by flood damages, higher global food prices, and broader tariff reforms for both electricity and fuels.• Higher inflation also recorded in Iran (53.4 % in February 2023), Turkiya (43.7 % in April 2023), Egypt (32.7 % in March 2023), and Argentina (104 % in March 2023).• The Government of Pakistan is taking administrative actions, policy reforms, and relief measures to control the prices of essential items.• The government is also committed to maintaining the strategic reserves of wheat, sugar and pulses.\nTRADE AND PAYMENTS• Trade deficit (Jul-May FY2023) contained by 40.4% to $25.8 bn (deficit of $ 43.4 bn last year)• Imports (Jul-May FY2023) restricted to $ 51.2 bn ($72.3 bn last year), reflecting a decline of 29.2%.• Exports (Jul-May FY2023) reached $ 25.4 bn ($ 28.9 bn last year), declined by 12.1%.• Current Account Deficit (Jul-Apr, FY2023) narrowed down by 76% to $ 3.3 bn (1.0 % of GDP) against the deficit of $ 13.7 bn last year (3.6 % of GDP).• Remittances (Jul-Apr, FY2023) declined by 13.0% to $ 22.7 bn ($ 26.1 bn last year).• FDI (Jul-Apr, FY2023) declined by 23.2 % to $ 1.17 bn ($ 1.52 bn last year)\nPublic Debt• Total public debt (end March 2023): Rs. 59,247 bn at end-March 2023• Domestic debt (end March 2023): Rs. 35,076 bn• External public debt (end March 2023): Rs. 24,171 bn or $ 85.2 bn• Within domestic debt, the government relied on long-term domestic debt securities (floating rate PIBs and Sukuk) for the financing of its fiscal deficit and repayment of debt maturities.• The government retired T-Bills amounting to Rs 527 bn which led to a reduction of short-term maturities.• The government paid Rs 310 bn against its debt owed to SBP. The cumulative debt retirement against SBP debt stood at Rs 2.0 trn since July 2019• Within external debt, inflows from multilateral sources and foreign commercial banks remained major sources of gross external inflows.• $ 1,166 mn were disbursed under 7th and 8th review of the IMF program.• $ 1,500 mn received from Asian Development Bank under the ‘Building Resilience with Active Countercyclical Expenditures (BRACE)’ programme.• Asian Infrastructure Investment Bank (AIIB) co-financed the BRACE programme to the tune of $ 500 mn, over and above the BRACE amount.• In addition, $ 1,900 mn loans from commercial banks were also refinanced.• The government rolled over $ 3,000 mn deposits each from China and Saudi Arabia which were utilized towards budgetary support.• Saudi oil facility amounting to around $ 900 mn was utilized (around $ 100 million each month).• The government repaid international commercial loans to the tune of $ 5,541 mn, out of which $ 4,541 mn were bank loans and $ 1,000 mn was international Sukuk maturity.\nEDUCATION• According to Labour Force Survey 2020-21, literacy rate trends show 62.8 % in 2020-21 (as compared to 62.4 % in 2018-19), more in males (from 73.0 % to 73.4 %) than females (from 51.5 % to 51.9 %).• Literacy rate increases in both rural (53.7 % to 54.0 %) and urban (76.1% to 77.3%) areas.• The present government is putting its efforts and resources into the education sector to accomplish SDG-4. The initiatives of the government aim at introducing a uniform curriculum, capacity building of teachers, establishment, renovation, and up-gradation of schools and colleges, mainstreaming of religious education, and skill development.• During Jul-May FY2023, Rs 42.9 bn released to HEC for implementation of 154 development projects of Public Sector Universities/HEIs.• Cumulative education expenditures by federal and provincial governments in FY2022 estimated at 1.7% of GDP\nHEALTH & NUTRITION• The government remained committed to the mobilization of all available resources to achieve health related SDG.• The public health expenditure recorded at 1.4% of GDP during FY2022 as compared to 1.0% during FY2021.• To effectively deal with any future public health emergencies such as COVID-19, the present government expedited its efforts to execute the PSDP project for the development of the Integrated Disease Surveillance Response System (IDSRS) with the public health laboratories network.• With more than 1/5th of the health facilities completely damaged as a result of recent flood, the government showed a strong commitment to restoring essential service delivery and critical public health functions. Post Disaster Need Assessment for the health sector was carried out with estimated recovery and reconstruction cost to be Rs. 40,294 mn ($187.6 mn).• During the first three-quarters of FY2023, NDMA supplied 2,044,104 mosquito nets, 7300 hygiene kits, 126,200 food packs, 18,860 first aid kits, 350 life-saving jackets along with other supplies to flood affectees.• A total of 7,376 tonnes of relief goods ranging from winterized tents and warm clothing to food rations and medical supplies were supplied by the NDMA to the earthquake affectees of Turkiya and Syria.\nPOPULATION LABOUR FORCE AND EMPLOYMENT• According to the National Institute of Population Studies the estimated population is 229.22 mn in 2022.• According to the LFS 2020-21, total labour force is 71.76 mn out of which 67.25 mn are employed and 4.51 mn are unemployed with unemployment rate at 6.3%.• Bureau of Emigration & Overseas Employment has registered 8,29,549 workers for overseas employment in CY2022 as compared to 2,86,648 in CY2021 showing an increase of 542,901 workers.• Up till March 2023, the government has disbursed Rs 6,965 mn under Prime Minister Youth Business & Agriculture Loan Scheme for businesses.Transport and Communication• The PIA has a total fleet of 35 airplanes. The operating revenue of the PIA increased by 99.6% during CY2022 to Rs. 172,038 mn from Rs. 86,185 mn last year. Operating expenditure during this period increased by 81.2% to Rs 183,345 mn.• The NHA portfolio in the PSDP 2022-23 consisted of 115 projects with a budgetary allocation of Rs. 118,403.4 mn.• Under CPEC various road infrastructure projects such as Zhob to Kuchlak (298 km), Khuzdar-Basima (110 km), Nokundi-Mashkhel (103 km), and Hoshab-Awaran M8 (146 km) are under different stages of implementation.• Pakistan Railways network recorded gross earnings of Rs. 39,950 mn during Jul-Mar FY2023, against Rs. 43,731.59 mn last year.• Pakistan National Shipping Corporation recorded an increase of 879% in Profit-After-Tax amounting to Rs.23,956 mn during Jul-Mar FY 2023 as against Rs.2,446 mn last year.• The volume of the import cargo handled by Port Qasim Authority during Jul-Mar FY2023 remained at 26.15 mn tonnes against 35.78 mn tonnes last year showing a decrease of 27%.• The export cargo handled stood at 5.39 mn tonnes during Jul-Mar FY2023 against 6.37 mn tonnes handled last year, showing a decrease of 15%.• The cargo and container handling at Karachi Port during Jul-Mar FY2023 was 31.791 mn tonne as compared to 39.71 mn tonne last year, recording a decrease of 20%.\nENERGY• Total installed capacity of electricity in the country is 41,000 MW, out of which hydel contributes about 25.8% whereas installed capacity of thermal, nuclear and renewables is about 58.8%, 8.6% and 6.8%, respectively.• Jul-Mar FY2023, total electricity generation remained 94,121 GWh whereas Hydel, Thermal, Nuclear and Renewables generated 28.6%, 46.2%, 21% and 4.2%, respectively.• Total electricity consumption remained 84,034 GWh during Jul-Mar FY 2023. Household sector is the biggest consumer with 46.6% electricity consumption.• Industrial, agriculture and commercial sectors consumed 28.2%, 8.2%, and 7.8% of electricity, respectively.• With an addition of 3 Thar Coal-based power projects that achieved Commercial Operations Date during the current fiscal year, the total installed capacity from five Thar coal-based power generation plants has reached 3,300 MW.• 16 IPPs are being facilitated by the Private Power Infrastructure Board which are expected to complete by 2031, having an installed capacity of more than 8,338 MW.• To reduce reliance on imported coal for power production, government has planned to blend 10 % Thar coal with the imported coal.• The government approved the Framework Guidelines for Fast Track Solar Initiatives 2022 on 18th October 2022. Its key pillars include a substitution of expensive imported fossil fuels with solar PV energy, solar PV generation on 11 kV feeders and solarization of public buildings.• The 06 Nuclear Power Projects, having a net installed capacity of 3,530 MW, supplied about 18,739 mn units of electricity to the national grid, during Jul-Mar FY 2023.• The total demand for petroleum products remained at 13.01 mn tonnes during Jul-Mar FY2023.• This year witnessed a decrease in demand for furnace oil (FO), highspeed diesel (HSD), motor gasoline (MS) and high-octane blended component (HOBC) which comprises more than 95% of total demand.• Transport and Power sectors are major users of petroleum products that comprise 89.3% of total demand.• During Jul-Mar FY 2023, import of petroleum products and crude oil remained at 6118.3 thousand MT and 5858.4 thousand MT respectively.• Total Consumption of gas and RLNG stood at 2,627 MMCFD and 631 MMCFD, respectively, during Jul-Mar FY2023.• Total consumption of coal remained at 15.42 mn tonnes.Information Technology & Telecommunication• IT sector posted a trade surplus of $ 1.72 bn in Jul-Mar FY2023, showing an increase of 16.7% compared to the last year.• IT exports during Jul-Mar FY2023 recorded at $ 1.94 bn having the highest share of 35.1% in all services exports.• During Jul-Mar FY2023, the Pakistan Software Exports Board has added 07 Software Technology Parks (Faisalabad, Gujrat, Jamshoro, Karachi, Multan, Peshawar, Rawalpindi) to facilitate the IT industry.• IGNITE has established 08 National Incubation Centers (NICs) including two specialized incubators, i.e., for agri-tech and aerospace.• NICs have incubated over 1317 startups that have generated over 126,000 jobs; received a total investment of Rs 15.43 bn ($ 74 mn); and have generated a combined revenue of Rs 9.13 bn.• More than 2,300 women entrepreneurs have been empowered through the program.• The telecommunication industry attracted investment of $ 632 mn during Jul-Dec FY2023.• The revenue of the Telecom Industry remained at Rs 137.7 bn during JulDec FY2023.Social protection• The government provided Rs 400 bn to the BISP to execute the Social Protection programmes in FY2023.• BISP is currently disbursing payments to around 9.0 mn beneficiaries under Benazir Kafaalat Programme. During Jul-Mar, FY2023, Rs 128.9 bn have been disbursed.• BISP has disbursed Rs 69 bn to 2.76 mn families of flood-affected areas to help them recover their financial losses.• BISP is also implementing a Wheat Seed Subsidy programme to eligible farmers with disbursement of Rs 5,000/- per acre. Till March 2023 Rs 2.94 bn disbursed to 122,687 farmers.• Under Benazir Taleemi Wazaif Programme, 3.0 mn children have been enrolled during Jul-Mar FY2023 and Rs 23.4 bn have been disbursed.• 102,000 scholarships were awarded under Benazir Undergraduate scholarship program.• Pakistan Poverty Alleviation Fund disbursed an amount of Rs 1.6 bn during Jul-Mar FY2023 through its Partner Organizations in 149 districts across the country.• For FY2023, Rs 6.04 bn provided to Pakistan Baitul Mal.• During Jul-Mar FY2023, an amount of Rs 35.27 bn disbursed by EOBI. 16. Climate Change• National Clean Air Policy was launched in March 2023 with the objective to improve air quality in the country by reducing pollution.• COP-27 of the United Nations Framework Convention on Climate Change was held in November 2022, in Egypt.• A delegation under the leadership of Prime Minister of Pakistan attended the COP 27 and participated in several events and raised issues for countries most adversely impacted by climate change.• Under the Ten Billion Tree Tsunami Programme, a total of 2,027 mn plants were planted till March 2023, an amount of Rs. 3,296.7 mn has been utilized during Jul-Mar FY2023.",
  "retrievedAt": "2025-08-11T08:40:02.571Z"
}
