{
  "title": "TAPI project to strengthen energy security of Pakistan, region: PM",
  "link": "https://www.app.com.pk/national/tapi-project-to-strengthen-energy-security-of-pakistan-region-pm/",
  "date_published": "2023-06-08T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP):Prime Minister Shehbaz Sharif on Thursday said that being a critical component of his government’s vision, the TAPI gas pipeline project would ensure energy security, economic growth and prosperity in Pakistan as well as the entire region.\nThe prime minister, in a meeting with a high ranking delegation from Turkmenistan, said the Turkmenistan-Afghanistan-Pakistan-India (TAPI) gas project was manifestation of the strategic cooperation between Pakistan and Turkmenistan in the energy sector.\nThe delegation was headed by State Minister and Head of TurkmenGaz Maksat Babayev, a PM Office press release said.\nWelcoming the delegation, the prime minister said Pakistan and Turkmenistan enjoyed brotherly relations underpinned by common history, culture and religion.\nHe said the leadership on both sides had keen desire to further promote economic and commercial relations.\nHe underscored that Pakistan could be a gateway for quick access to Turkmenistan’s rich energy reserves.\nThe prime minister renewed the commitment for early implementation of the project and hoped that the TAPI gas pipeline would be completed at the earliest by optimizing all available resources by all relevant parties.\nIn order to expedite work on various components of the project, the prime minister nominated Special Assistant to the Prime Minister Dr Jehanzeb Khan to work as the focal person from the Pakistan side as the head of the Senior Coordination Committee.\nThe visiting Turkmenistan delegation also included Deputy Minister of Energy Annageldi Saparov, CEO and Chairman of BOD, TPCL, Muhammetmyrat Amanov as well as the Turkmen Ambassador to Pakistan, Atadjan Movlamov.\nLater, the prime minister witnessed the signing of “TAPI Gas Pipeline Joint Implementation Plan (JIP)” by Minister of State for Petroleum Dr Musaddiq Malik and Maksat Babayev, State Minister and Head of TurkmenGaz, on behalf their respective governments.\nThe JIP is aimed at accelerating the work on the TAPI Gas Pipeline project.\nThe TAPI project aims at transporting natural gas from Turkmenistan to Afghanistan, Pakistan, and India through an 1814 kilometer pipeline with a capacity to transport 33 billion cubic meters of natural gas annually.\nOnce operational, the TAPI project will transform the regional energy landscape, contributing to economic prosperity.\nng with a high ranking delegation from Turkmenistan, said the Turkmenistan-Afghanistan-Pakistan-India\n(TAPI) gas project was manifestation of Pakistan-Turkmenistan strategic cooperation in the energy sector.\nHe said that the leadership on both sides had keen desire to further promote economic and commercial relations.\nThe prime minister renewed the commitment for early implementation of the project and hoped that theTAPI would be completed at the earliest by optimizing all available resources by all relevant parties.\nIn order to expedite work on various components of the project, the prime minister nominated Special Assistant to Prime Minister Dr. Jehanzeb Khan to work as focal person from the Pakistan side as the head of the Senior Coordination Committee.\nLater, the prime minister witnessed the signing of “TAPI Gas Pipeline Joint Implementation Plan (JIP)” signed by Minister of State for Petroleum Dr. Musaddiq Malik and Maksat Babayev, State Minister and Head of TurkmenGaz on behalf their respective governments.\nThe TAPI pipeline project aims at transporting natural gas from Turkmenistan to Afghanistan, Pakistan, and India through an 1814 Kilometer pipeline with a capacity to transport 33 billion cubic meters of natural gas annually.",
  "retrievedAt": "2025-08-11T08:39:19.455Z"
}
