{
  "title": "Sherry Rehman hosts USAID delegation",
  "link": "https://www.app.com.pk/national/sherry-rehman-hosts-usaid-delegation/",
  "date_published": "2023-06-08T14:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP): Federal Minister for Climate Change and Environmental Coordination, Senator Sherry Rehman on Thursday welcomed a delegation from the United States Agency for International Development (USAID) for a high-level meeting at the Climate Ministry.\nThe USAID delegation was led by USAID’S Deputy Administrator for Policy and Programming, Ambassador Isobel Coleman, a news release said.\nIn her introductory remarks, Minister Rehman said, “We deeply appreciate your commitment to addressing the challenges faced in building climate resilience in Pakistan, particularly at the intersection of climate, health, food security and water-related rebuilding challenges.\n“During your visit to the affected areas, you witnessed firsthand the landscape of extreme vulnerability that is difficult to convey through written reports or any other means.”\n“I am sure it became evident, that after a flood event that impacted 33 million people, building resilience within a society and among communities that have been displaced and impoverished is extremely onerous. The great flood impacted every sector in Pakistan, especially the economy which withstood a massive exogenous shock, impacting the capacity of the country to recover and rebuild.”\n“With the current extreme weather conditions, climate change refuses to wait for anyone. It does not pause for us to catch up on the necessary technical capacity or rapidly adapt, and I fear that if we do not take prompt action and allocate adequate technical and financial resources on the ground, we risk falling into the trap of insufficient resilience and recovery.”\nTalking about her visits to the flood-affected areas in Sindh, Ambassador Coleman said that it was very distressing to see the impacts of floods on the vulnerable population, with areas still inundated.\nShe said that USAID announced $16.4 million in additional development and humanitarian assistance to Sindh’s flood affectees to address worsening food insecurity, and malnutrition and help curb the spread of infectious diseases.\nThe meeting aimed to emphasize significant initiatives aimed at enhancing Pakistan’s climate resilience. During the meeting, a presentation was delivered on the U.S.-Pakistani Green Alliance and USAID’s ongoing activities in the field of climate change.\nThe presentation covered important aspects such as the Climate Action Plan for Asia, the Green Alliance Implementation Plan for 2024-2029, the Recharge Pakistan Project, the Living Indus Initiative, and the Methane Mitigation Activity. These initiatives reflect the joint determination of both countries to combat climate change, promote sustainable practices, and secure funding for critical environmental projects.\nThe Minister also asked for assistance in exploring pathways to research and knowledge-building on finding low-cost alternatives to single-use plastics, as well as a broader global commitment to wind down plastic dumping in oceans and waterways.\nThe meeting between the Ministry of Climate Change & Environmental Coordination and the USAID delegation ended with a joint commitment to take several of the initiatives forward, with the Minister thanking the delegation for robust collaboration and mutual commitment to challenges associated with climate change.",
  "retrievedAt": "2025-08-11T08:39:45.386Z"
}
