{
  "title": "Balochistan govt keen to implement Balochistan Disability Act 2017",
  "link": "https://www.app.com.pk/national/balochistan-govt-keen-to-implement-balochistan-disability-act-2017/",
  "date_published": "2023-06-08T13:53:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jun 8 (APP):Balochistan government is keen to implement Balochistan Disability Act 2017 and initiated the development of Rules of Business for its successful implementation.\nThe initiative will help transform the Disability Act into practical guidelines to ensure effective implementation of the Disability Act 2017, said a news release issued here Thursday.Balochistan is the pioneer in the approval of the Disability Act in 2017 but the Act has not been fully implemented due to the absence of Rules of Business.\nIn their efforts towards ensuring the inclusion of the rights of persons with disabilities in Balochistan, the provincial Social Welfare Department along with Sightsavers held a two-day consultative workshop on the development of Rules of Business for Disability Act 2017.\nMuhammad Saleem Khosa, Director General Social Welfare Department appreciated Sightsavers and other stakeholders including HANDS, CBID Network, TSO and Quetta Online on this much-needed support especially consultations with people with disabilities. He said that it would help in ensuring the rights of persons with disabilities creating an equal access to opportunities and services for them. He requested the stakeholders for their active participation and open feedback.\nItfaq Khaliq Khan, Senior Program Manager Sightsavers said that including the voice of people with disabilities was critically important to make sure that rules of business are addressing their needs.He appreciated the Department of Social Welfare on being forthcoming and including all key stakeholders in the process. He reiterated that Sightsavers would be happy to support this initiative further to get the rules of business approved from the Parliament. He further added that approval of rules of business would be a step towards ensuring the implementation of UNCRPD and SDGs in the province.\nSecretariat Coordinator CBID Network, Asim Zafar talked about the history of disability legislation in the country and appreciated the government of Balochistan on taking the lead in the approval of the Disability Act in 2017 and now initiating the development of Rules of Business for its successful implementation.The workshop was attended by multiple stakeholders including officials of government departments, representatives of UN agencies, NGOs and various organizations of persons with disabilities and their networks.",
  "retrievedAt": "2025-08-11T08:39:51.904Z"
}
