{
  "title": "Mushaal urges UN, int’l community to declare Yasin prisoner of conscience",
  "link": "https://www.app.com.pk/national/mushaal-urges-un-intl-community-to-declare-yasin-prisoner-of-conscience/",
  "date_published": "2023-06-08T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP): Mushaal Mullick, wife of jailed Kashmiri leader Yasin Malik Thursday said that the fascist Indian government was hell-bent to commit a “judicial murder” of her husband and demanded United Nations and the international community to declare him a prisoner of conscience and protective personality to prevent his unlawful execution.\nIn a press statement, she said the notorious Modi-led government wanted to eliminate Yasin as India’s top anti-terrorism investigation agency once again sought his death sentence in a fake and concocted case.\nMushaal, who is also the chairperson of Peace and Culture Organization, urged the UN Secretary-General António Guterres to urgently intervene and avert plot of the judicial murder of Yasin, who was being merely targeted for his political beliefs.\nShe said her husband’s only crime was that he refused to accept the Indian dictates on Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe Hurriyat leader went on to say that fascist authorities deprived the voice of Kashmir of his fundamental right to defend himself in a court of law after implicating him in a concocted and fabricated case.\nShe recalled that India had a long history of using the judiciary and other state apparatus to suppress the political and democratic dissent and legitimate political voices in the occupied valley and thus was now hell-bent on eliminating Yasin by using its judiciary.\nMushaal feared that the apartheid regime, which thrived on communal divide and anti-Muslim sentiment, could use the unlawful execution of Yasin as a means to regain popularity and bolster chances of retaining power in the forthcoming Parliamentary Elections scheduled for 2024 because he was reckoned one of the top rank campaigners of Kashmiris’ right to self-determination.”\nHowever, she made it clear that the Kashmiri nation would not be terrified through such brutal tactics, as they had been exercising state terrorism and deaths for the last over seven decades.\nMushaal warned the Modi-led government to show sanity and should release Yasin and other Kashmiri prisoners as executing Yasin could not suppress the Kashmir freedom movement, however, it would further fan the fire and engulf the whole region, which would be in no one interest.\nShe said that India was behaving in the same fashion as British colonists and ignoring that India was once a colony of the British and Mushaal went on to say that Indians were firm believers that Britishers were external invaders same was the situation of IIOJK, adding that Kashmir was disputed territory as per UN resolutions and International laws so NIA had no mandate in Kashmir including other Indian agencies.\nShe asked did Indian accept Baghat Singh, Munghal Panday and Subash Chandler Bose as terrorists or heroes, adding that Yasin’s position was the same in Kashmir.\nMushaal stated that neither Baghat Singh nor Mangahal Panday or other freedom fighters were terrorists nor did killing them help the Britishers and how Yasin’s hanging would help India.\nThe Hurriyat leader stated that opening 30-year-old case without any concrete evidence depicted that it was nothing but Indian state terrorism to silence the true voice of the Kashmiri freedom fight.\nShe urged that world media, INGOs and key global actors must raise the political victimization of Yasin on the global radar so as to foil Indian nefarious plot of his judicial murder.\nMushaal reminded that India was violating all laws including the Geneva Conventions, the International Covenant on Civil and Political Rights, the convention against torture and other cruel, Inhuman or Degrading Treatment and Punishment as well as customary international law codified in Standard Minimum Rules for Treatment of Prisoners adopted by the United Nations General Assembly and Security Council in Yasin’s case.\nShe stated that the actual purpose of putting him behind bars was to break his resolve.",
  "retrievedAt": "2025-08-11T08:39:19.480Z"
}
