{
  "title": "NUST, Hong Kong’s AIM join hands to advance  Pakistan’s Agri Tech Sector",
  "link": "https://www.app.com.pk/national/nust-hong-kongs-aim-join-hands-to-advance-pakistans-agri-tech-sector/",
  "date_published": "2024-07-31T12:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP): In a landmark development towards advancing the agriculture sector of Pakistan, the National University of Sciences and Technology (NUST) and Advanced Industrial Materials (AIM), Silver Corp International Tower, Hong Kong, have entered into a historic agreement for the development of Pakistan’s technological landscape, especially in the field of agriculture.\nPakistan (with approx 881,913 Sq Km land) is using only 27.3 percent for its agriculture production. However, 47 percent of its land is agricultural land, with an import share of 5-10% (Approx 2.5 to 5 Bn $) of Food and Agriculture products varying with domestic production.\nIt presents opportunities for growth and development towards 1) Increasing Agricultural Productivity through investing in research and development, promotion of modern farming techniques, and improving water management to enhance yields. 2) Cultivating a wider range of crops to reduce the risk of crop failures and improve food security. 3) Processing agricultural products domestically, while creating jobs and increasing export earnings. 4) Sustainable practices to help mitigate the impacts of climate change and preserve natural resources.\nTo address the widened gap between food and agriculture imports and domestic requirements as a complex challenge, the recently signed Memorandum of Agreement (MoA) includes the construction of a state-of-the-art Smart Agri Tech Tower that will serve as a hub for Agri domain technological R&D, enabler for innovation and incubator for Agri-entrepreneurship prioritising the agriculture technologies and synergising industry and academia.\nThe collaboration aims to promote international partnerships, knowledge exchange and investment opportunities in Pakistan’s agricultural sector, advancing automation and research, to boost and sustain the economy through local production.\nDr Rizwan Riaz VP National Science and Technology Park / Pro-Rector Research Innovation Commercialisation, Dr Saeed ur Rehman Sarwar DG Projects, Projects Sectt from NUST Pakistan and Mr Zaeem Shiko CEO AIM Hong Kong formalised the agreement on 23rd of July 2024 with a groundbreaking ceremony planned in Aug 2024.\nMr Zaeem Shiko, CEO AIM, commented, “We are excited to partner with NUST on this transformative project.\nThis Agri Tech facility will serve as a hub for research and innovation, bringing together the best minds from academia and industry in developing cutting-edge agricultural technology products.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:15:26.767Z"
}
