{
  "title": "Govt resolved for fast, uninterrupted internet connectivity, promotion of AI infrastructure: PM",
  "link": "https://www.app.com.pk/national/govt-resolved-for-fast-uninterrupted-internet-connectivity-promotion-of-ai-infrastructure-pm/",
  "date_published": "2024-07-31T12:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP): Prime Minister Shehbaz Sharif on Wednesday said that the government was taking all-out measures to provide fast and uninterrupted internet connectivity to the people.\nThe prime minister, in a meeting with a three-member delegation of Asia Internet Coalition headed by Managing Director Jeff Paine, said that the government was implementing a strategy to attract foreign investment in the information technology infrastructure.\nThe meeting featured the discussion on data security, code of ethics for internet content, and prevention of electronic crimes.\nPrime Minister Shehbaz told the delegation that the government was working to promote a basic infrastructure based on artificial intelligence.\nHe said the government was resolved to make Pakistan achieve a distinction in AI infrastructure in the region.\nHe said under the Digital Pakistan Initiative, the whole system was being digitised and expressed the hope that the digitisation of Federal Board of Revenue would prove to be a milestone towards economic dogitisation and automation.\nDuring the briefing, it was told that consultation with all stakeholders on the draft of Personal Data Protection Bill was in progress.\nPrime Minister Shehbaz appreciated the services of Asia Internet Coalition in promoting IT and internet infrastructure in the Asia Pacific Region.\nThe delegation members apprised the prime minister of the Coalition’s services in Pakistan’s IT sector.\nMinister of State for Information Technology and Telecommunications Shaza Fatima Khawaja, IT expert Tania Aidrus and relevant senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T04:15:26.585Z"
}
