{
  "title": "Pakistan provides remarkable job opportunities to youth: Commonwealth secretary general",
  "link": "https://www.app.com.pk/national/pakistan-provides-remarkable-job-opportunities-to-youth-commonwealth-secretary-general/",
  "date_published": "2024-07-31T12:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP):Commonwealth Secretary General RT Patricia Scotland on Wednesday said that Pakistan under the leadership of Prime Minister Muhammad Shehbaz Sharif has remarkably provided opportunities, resources and support to the youth.\nShe expressed these views while addressing the Young Entrepreneurs Awards distribution ceremony here at the Prime Minister’s office.\nUnder the leadership of Chairman Prime Minister Youth Program Rana Mashhood Ahmad Khan, this program is taking significant steps to empower the youth, she said.\n“There is a need to empower the youth and harness modern technology for the prosperous future of the country and Commonwealth Organization is committed to providing all possible facilities to the innovators,” she said.\nPatricia said she is grateful to the people and government of Pakistan for their warm welcome and hospitality in the country.\n“I have worn a Pakistani dress which proves that I am also a Pakistani. The efforts of the government of Pakistan under the leadership of the Prime Minister to empower the youth are commendable,” she said.\nShe said the Pakistani government is taking steps to highlight the potential of the youth as per the Chartered Commonwealth of Nations adding efforts to provide employment and business facilities to the youth reflect their commitment.\nThe Commonwealth secretary said that 60 percent of the youth in the world are below 30 years of age, while 65 percent of the youth in Pakistan are between 18 to 30 years of age.\n“Pakistan can lead the country on the path of development by training the youth in modern technology and making them skilled so that they can also play an important role in the development of the world,” she said.\nShe said that the commonwealth recognizes the courage and determination of the youth for country’s national and economic development, as young people are the driving force to bring a change.\nShe also lauded the role of Chairman Prime Minister Youth Program Rana Mashhood Ahmad Khan for taking crucial steps for empowering youth through various initiatives and promgrammes.\nShe said that the recipients of the Young Entrepreneurs Awards need to transform themselves in the context of a rapidly changing world through the emerging multi-billion dollar market of artificial intelligence.\nSpeaking on the occasion, Rana Mashhood Ahmad Khan thanked the Commonwealth Secretary General Patricia Scotland for her maiden visit to Pakistan for strengthening the relations of Pakistan with the Commonwealth.\nHe said that Pakistan’s ranked as 3rd in the employment and opportunity category of the global Youth Development Index by the Commonwealth is a testament to the incredible potential and resilience of our young entrepreneurs.\nThis achievement is not merely a statistic but a reflection Prime Minister Shehbaz Sharif’s vision.\nUnder the Prime Minister’s Youth Loan and Agricultural Scheme, started in 2013,as many as 186 billion had been distributed among more than two lakh eighty thousand  young entrepreneurs, creating countless employment opportunities across the nation.\nHe said that during the last 18 months ,as many as Rs 110 billion had been distributed under PM loan scheme.\nThe Non -performing loans under the said scheme are less than 3 percent which reiterate the transparency and effectiveness of this loan scheme.\nThe Chairman PMYP added that the holistic approach of the Prime Minister’s Youth Programme is designed to equip the youth with the necessary skills through the Prime Minister’s Skill development programme, with advanced gadgets and offer financial assistance through PM Youth  loan schemes.\nA documentary on Pakistan culture and diversity was also exhibited on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:15:47.483Z"
}
