{
  "title": "‘Sports Kits & Track Suits’ distribution ceremony held at IMCG F-6/2",
  "link": "https://www.app.com.pk/national/sports-kits-track-suits-distribution-ceremony-held-at-imcg-f-6-2/",
  "date_published": "2024-07-31T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP):Ministry of Federal Education and Professional Training on Wednesday organised “Sports Kits and Track Suits” distribution ceremony here at Islamabad Model College for Girls, F/6-2.\nThe ceremony was attended by the Minister for Federal Education Khalid Maqbool Siddiqui as chief guest, while Chairman PCB and Minister for Interior Mohsin Naqvi as guest of honour. Secretary of Federal Education Mohyuddin Ahmad Wani, and a large number of students and teachers were also present on the occasion.\nThis initiative aims to promote physical education and encourage students to engage in sports activities, fostering a healthy body and mind. Under the project, the students of primary schools to be given track suits to wear during sports activities, promoting unity and team spirit.\n“A healthy body is essential for a healthy mind.” This initiative is a step towards nurturing well-rounded individuals who excel in both academics and physical activities.\nIn his opening remarks, Secretary Federal Education Mohyuddin Ahmad Wani, emphasized the need to establish such an Eco-system under which besides focusing children’s education, their health would also be improved.\nHe said that under the project, around 26 Gyms had been established in schools while 23 outdoor sports facilities had also been provided.\nMeanwhile, in his address, Interior Minister Mohsin Naqvi lauded the efforts of the Federal Education Minister Khalid Maqbool Siddiqui for his commitment of providing quality education to students.\nHe also commended the government’s initiative of providing lunch to primary school children, termed it a historical project.\nHe reiterated his resolve to fully support the Ministry of Federal Education for promoting healthy activities, and restructuring of ICT educational institutions, adding this cooperation would also be continued in future.\nMaqbool Ahmad Siddiqui, speaking as chief guest said that after 18th amendment, the responsibility of education was transferred to the provinces.\nHe said that several revolutionary steps were being taken in the education sector. He appreciated the efforts of teachers in ensuring the quality of education and supporting government initiatives. “We will secure the future of our country together” he added.\nOn the occasion, Sports Kits were also distributed among the female students. It is pertinent to mention here that under the project as many as 20,000 sports kits and track suits would be distributed among the students of FDE Educational Institutions.\nEarlier, Interior Minister also visited newly established modern IT Lab in the college and appreciated the education ministry’s efforts in this regard. He also asked about the ongoing IT Courses being taught in the college. The IT students briefed the Minister about the AI and other latest IT courses being taught to them.\nLater, after the event both ministers held a media talk, in which Minister for Federal Education and Professional Training Maqbool Ahmad Siddiqui said that ICT schools were being converted into exemplary in education and sports sectors.\nHe said that Sports Nurseries to be established in schools to promote games in the country.\nHe said that IPPs issue would be raised at the relevant forum and the it will be resolved with the consultation of government.\nHe vowed to bring the country out of the current crises, being an allied party of the current government.  Meanwhile, Mohsin Naqvi has assured Maqbool Siddiqui to resolve their concerns regarding IPPs.\nTo a question, he said that protest in Balochistan was a provincial matter, adding, I am in contact with the provinces on security matters including Parachinar and Balochistan.\nTo another query, he said that currently the situation in the country is balanced. In the current political situation, there is no issue that needs to be worried about, said Mohsin Naqvi.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:15:22.950Z"
}
