{
  "title": "Skill training vital to exploit potential of young population: President",
  "link": "https://www.app.com.pk/national/skill-training-vital-to-exploit-potential-of-young-population-president/",
  "date_published": "2021-07-08T16:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 8 (APP): President Dr Arif Alvi Thursday said that as the youth constituted over 68% of country’s population, they needed to be imparted various skills to make them contribute to economic development.\nAddressing the members of 2nd National Youth Council, who called on him, at Aiwan-e-Sadr, the president underscored the need for utilizing the potential of youth for country’s socio-economic development.\nHe said that the future of Pakistan was dependent on the youth who, through different skills, needed to be made professionally efficient and a productive workforce for local and international markets.\nThe president said that NAVTTC and TEVTA provided different skills and advised the youth to benefit from the skill development program under Prime Minister’s Kamyab Jawan Program.\nLauding the Program, the president said that it played a significant role in providing business loans to young entrepreneurs and skill-based trainings.\nHe congratulated the National Youth Council on their selection and advised the body to engage youth for making Pakistan a prosperous country by supporting the marginalized segments of the society.\nHe also urged the Council to create awareness among the people about the financial loans under Kamyab Jawan Program.\nHe said billions of rupees had been allocated for the program but, unfortunately, the loans available for the women and the Persons with Disabilities (PWDs) are largely unutilized due to lack of awareness among them.\nSpecial Assistant to Prime Minister for Kamyab Jawan Program, Usman Dar said that the Youth Council was a role model for the youth.\nHe briefed the president that objective of the National Youth Council was to politically engage talented youth to make them contribute to the policy making for youth empowerment and development in Pakistan.\nThe representative of UNFPA, Dr Bakhtior Kadirov appreciated the steps by the Government of Pakistan for empowering the youth and providing them opportunities especially scholarships for education, financial loans and skill development.",
  "retrievedAt": "2025-08-11T20:56:55.152Z"
}
