{
  "title": "NUMS research to help pharmaceutical industry to produce Healing Bandage",
  "link": "https://www.app.com.pk/national/nums-research-to-help-pharmaceutical-industry-to-produce-first-ever-healing-bandage/",
  "date_published": "2021-07-08T09:40:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 8 (APP): National University of Medical Sciences (NUMS) research will help pharmaceutical industry to produce the “Healing Bandage” in Pakistan which will quicken healing various kinds of wounds of the injured people across the country, said a young scientist of the university here Thursday.\n“NUMS Department of Biological Sciences has already been awarded many Higher Education Commission (HEC) and Pakistan Science Foundation(PSF) research projects which will help it move forward towards realizing the university’s vision of understanding and improving life.\nThe dawn of many innovations is not very far and we need to stay the course of the research,” said NUMS Vice-Chancellor Lt Gen Syed Muhammad Imran Majeed (Retd) while lauding the efforts of Dr. Hussain Wahedi.\nHealing Bandage can be used for 5 to 12 hours to accelerate the wound-healing process.The testing of the bandage on human subjects will be carried out in collaboration with Rawalpindi Medical University(RMU).\nThe scaffold will be developed with the help of his co-investigator, Dr. Adnan Haider from NUMS department of Biological Sciences. He will be testing the bandage on human subjects in collaboration with RMU with the help of Dr. Ammad Fahim from NUMS Clinical Trial Unit.\nThis research project will lead to the development and commercialization of a skin wound healing scaffold within two years, said Dr. Hussain Mustatab Wahedi, a PhD from South Korea in “Regenerative Medicine” who is working on a Rs10 million research project.\nHEC awarded him this project after reviewing his submitted proposal to produce an innovative Healing Bandage. It will be a step forward to provide relief to the wounded people, he added.\nHis research project will be another step in NUMS’s continuing endeavors to the commercialization of this technology for pharmaceutical industry and establishing links between the academia and the industry.\n“The safety of all the substances used in the making of the scaffold, ease of use while promoting wound healing, will not only make this scaffold a leading wound care product in the market in coming years but will serve as a pioneering approach for the development of similar products using various combinations of compounds and polymers,” said Dr. Hussain.\nDr. Hussain has already won the support of partner in the pharmaceutical industry who has committed to extending their financial support to NUMS research project",
  "retrievedAt": "2025-08-11T20:57:01.523Z"
}
