{
  "title": "Burhan Wani, a symbol of indigenous Kashmiri struggle against illegal Indian occupation: FO",
  "link": "https://www.app.com.pk/national/burhan-wani-a-symbol-of-indigenous-kashmiri-struggle-against-illegal-indian-occupation-fo/",
  "date_published": "2021-07-08T12:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 8 (APP): The Foreign Office on Thursday said Burhan Wani, through his sacrifice, had symbolized the indigenous Kashmiri struggle against the illegal Indian occupation.\nOn the fifth martyrdom anniversary of prominent Kashmiri youth leader Burhan Muzaffar Wani, the Foreign Office paid tribute to his selfless contribution to the just struggle for right to self-determination of the Kashmiri people, and through him to the oppressed people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe FO said since the martyrdom of Burhan Wani in 2016, hundreds of Kashmiri youth lost their lives at the hands of Indian occupation forces in IIOJK.\n“Despite violating every single right of the Kashmiri people, India has, to this day, failed to subjugate the Kashmiris and break their will in their just struggle,” the FO said in a statement.\nOn the fifth martyrdom anniversary of prominent Kashmiri youth leader Burhan Muzaffar Wani, we pay tribute to his selfless contribution to the just struggle for right to self-determination of the Kashmiri people, and through him to the oppressed people of #IIOJK. 1/3\n— Spokesperson  MoFA (@ForeignOfficePk) July 8, 2021\nThe Foreign Office said Pakistan would continue to stand by the Kashmiris till the Jammu and Kashmir dispute was resolved in accordance with the relevant United Nations Security Council (UNSC) resolutions and the wishes of the Kashmiri people.\n“This day should also serve as a reminder to India to end its egregious human rights violations in IIOJK, and take concrete steps towards the resolution of the Jammu and Kashmir dispute as per the UNSC resolutions,” it said.\nThe FO said Pakistan called on the international community to play its due role in this regard.",
  "retrievedAt": "2025-08-11T20:56:59.933Z"
}
