{
  "title": "President directs EOBI to pay outstanding pension dues to a widow",
  "link": "https://www.app.com.pk/national/president-directs-eobi-to-pay-outstanding-pension-dues-to-a-widow/",
  "date_published": "2021-10-05T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): President Dr Arif Alvi has set aside an impugned order of the Wafaqi Mohtasib on a widow’s plea, directing the Employees’ Old Age Benefits Institution (EOBI) to make payment of pension arrears since the death of her husband during 2017.\nThe directive was issued on the instant representation made by the complainant, Mst Ayesha Arif widow of Mr Arif Mehmood, assailing the order of Wafaqi Mohtaisb of 25-11-2020 in which it upheld EOBI’s decision of grant of pension along with payment of six months arrears under survivor’s pension against her claim made on 06-08-2019.\nAs per directive of the President’s Secretariat (Public), the compliance of the same case should be made within thirty days of the receipt of the said order.\nThe hearing of the case was held on July 14. The president in an order noted that section 22B of the Act 1976, dealt with Survivors’ pension, under which the surviving spouse became entitled to pension.\n“It nowhere inhibits or restricts the entitlement as in Section 22 (3) of the Act. Since Section 22B deals exclusively with Survivors’ pension, it operates independently,” the finding said.\nThe order further said that as general rule applicable to Muslims on the death of a Muslim, the succession opened without any intervention and the rights vested in the Muslim heir automatically as held in Ghulam Ali and others vs  Mst. Bhulam Sarwra Najis PLD 1990 SC1.\n“Thus in view of the provisions of Section 22B of the Employees’ old Age Benefits Act, 1976 and general principles, it is obvious that the complainant is entitled to pension from the date of the death of her husband. The learned Mohtasib omitted to take note of this important aspect of the case and turned down the complainant’s grievance on untenable basis,” it added.\nThe Wafaqi Mohtasib had upheld a decision of the Agency against grant of pension arrears to the complainant since the death of her husband on 29-09-2017.\nThe Mohtasib, in its order, moreover, had not found any mal-administration on part of agency in terms of Article 2 (2) of P.O. No. 1 of 1983 and rejected the complaint in terms of Regulations 23 (3) of the Wafaqi  Mohtasib (Investigation and Disposal of Complaints) Regulations, 2013.\nThe deceased husband was getting pension from the EOBI till his death. The complainant (widow) moved a plea for survivors’ pension which was allowed by the agency with effect from 01-02-2019 along with grant of only six months arrears.",
  "retrievedAt": "2025-08-11T21:23:44.685Z"
}
