{
  "title": "Proper implementation of early child marriage laws urged",
  "link": "https://www.app.com.pk/national/proper-implementation-of-early-child-marriage-laws-urged/",
  "date_published": "2021-10-05T05:54:00.000Z",
  "source": "APP",
  "content": "According to a survey report, around 140 million underage girls are supposed to get married in Pakistan by 2020 since 2011, despite many bills passed by the legislators on the Child Marriage Restraint (Amendment).\nThe overall percentage of child marriage remained high in Sindh stand with 72 percent girls and 25 percent boys becoming victims to this menace.The report reveals that child marriages are mostly practiced in the rural areas of the country and mainly rooted in some areas of Sindh province.\nHowever, the highest number of girl child marriages was recorded in the tribal areas of Pakistan.\nThe data shows that three percent of girls in Pakistan are married before the age of 15 years, and 21 percent before 18 years.\nSocial activist, Shabana while commenting on the subject said the proper implementation of the law is need of the hour from the concerned authorities to root out this menace.\nShe said that many laws have been passed by the legislators and urged to properly implement these laws in order to address the issue.\nAnother social activist, Hafsa Ahmad said the girls who were married at early age face psychological issues. They often feel isolated and disempowered and were deprived of their basic rights to health, education and safety.\nShe added child brides face more risks of experiencing health complications and suffer domestic violence due to less knowledge about their rights, she added.\nWhen contacted an official from the Ministry of Human Rights said that the present government was committed to ensure all such laws that were relating with the mental and physical development of girls.\nHe said the ministry has started the system of monitoring the implementation of such laws related with the basic rights of people of the country. He said that the ministry was vigilant and active to ensure implementation of early child marriage laws.",
  "retrievedAt": "2025-08-11T21:23:47.058Z"
}
