{
  "title": "United Nations organizes second of 12 dialogues on sustainable development in Multan",
  "link": "https://www.app.com.pk/national/united-nations-organizes-second-of-12-dialogues-on-sustainable-development-in-multan/",
  "date_published": "2023-08-25T09:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP):The United Nations in Pakistan along with the district administration of Multan organized a dialogue with local leaders on Sustainable Development Goals (SDGs).\nAround 100 local leaders, men and women among the district administration of Multan and United Nations Resident Coordinator participated in the event, according to a press release.\nThe discussions focused on four topics chosen by the participants ahead of the event: the cost of gender-based violence; food insecurity; access to basic social services with a focus on water, sanitation and hygiene; and youth employment.\nIn total, more than 1,000 local leaders living in 12 major cities across six provinces and territories will discuss the development challenges they face, and how they impede economic and social progress in their districts.\nThe dialogues would be held in the different languages spoken across Pakistan in the coming weeks.\n“These dialogues would help United Nations agencies better understand which development issues local leaders see as their priorities outside of the federal and provincial capitals,” said Julien Harneis, UN Resident Coordinator in Pakistan.\nThe 12 dialogues would engage local leaders around development issues such as access to basic social services; gender equality and women’s empowerment; climate change; sustainable, inclusive economic growth and decent work; and governance. All are key to Pakistan’s progress towards the achievement of the global Sustainable Development Goals (SDGs).\nThe dialogues will help inform discussions ahead of the global SDG Summit which the UN is organizing to accelerate progress towards the SDGs, halfway of the 2030 deadline.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:18:40.730Z"
}
