{
  "title": "Governor Punjab holds condemnation reference for Jaranwala incident",
  "link": "https://www.app.com.pk/national/governor-punjab-holds-condemnation-reference-for-jaranwala-incident/",
  "date_published": "2023-08-25T18:08:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 25 (APP):Governor Punjab Muhammad Balighur Rehman met a delegation comprising Ulema, Mashaikh belonging to different schools of thought, and Christian, Hindu and Sikh religious leaders led by Pir Nazim Hussain Shah at Governor’s House, here on Friday.\nDuring the meeting, religious scholars and religious leaders belonging to minorities expressed grief and sorrow over the desecration of the Holy Quran in Jaranwala and in response to it the burning of churches and houses.\nBishop Sebastian Shaw was also present in the meeting.\nAccording to a press release, Governor Punjab Muhammad Balighur Rehman said, “Today we have all gathered for a reference of condemnation on the Jaranwala incident.” He said that he would like to thank the Muslim community who delivered essential items to the Christian brothers and sisters after the Jaranwala incident and also the scholars who opened mosques for the Christian community.\nThe Governor of Punjab said that all religions, including Islam, teach peace, tolerance, and brotherhood. He said that scholars have a key role in inter-faith harmony. He said that Islam had spread in the subcontinent through the message of love and peace of Ulema and Sufis. He said that the Christian community has rendered unforgettable services in various fields, including education, health, defense, and law in Pakistan.\nHe further said that minorities are equal citizens in the country according to the constitution of Pakistan. He said that the government of Pakistan is committed to the rights of minorities and those responsible for both incidents will be identified and punished. He said that the Punjab government has started handing over the churches to the Christian community by restoring them in a better condition than before.\nBishop Sebastian Shaw thanked the government and the Muslim community for their solidarity with the Christian community.\nOn this occasion, the religious scholars said that the entire Muslim community is with their Christian brothers and no one’s life and property and place of worship should be threatened, while the minorities’ leaders said that desecration of any holy book is not acceptable for them.\nThe delegation comprised Bishop Sebastian Shaw, Mufti Ashiq Hussain, Sardar Bishan Singh, Bhagat Lal, Maulana Abdul Waheed Khan Ropari, Allama Syed Raza Kazmi, Syed Ali Mehdi, Mufti Imran Hanafi, Maulana Javed Naqshbandi, Maulana Abdul Aziz Sialvi and others.\nUlema and faith leaders prayed for the victims of the incident.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:18:40.950Z"
}
