{
  "title": "Preventive measures devised to deal with any eventuality due to impending flood in Mangla dam: DC Mirpur AJK",
  "link": "https://www.app.com.pk/national/preventive-measures-devised-to-deal-with-any-eventuality-due-to-impending-flood-in-mangla-dam-dc-mirpur-ajk/",
  "date_published": "2023-08-25T12:15:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Aug 25 (APP) :: Following the reports of impending heavy flood in Mangla Dam Reservoir, the Mirpur district administration has finalized all preparations and made all preventive measures to deal with any eventuality, an officials said.\nDeputy Commissioner Mirpur Ch. Amjad Iqbal told that gradual precautionary measures were being taken by the administration to counter the impending flood in the Mirpur AJK based Mangla Dam reservoir following the melting of glaciers and devastating monsoon rains on the upper reaches of the Himalayan Jammu Kashmir state. WAPDA, as a routine in monsoon rains season, informed the local administration about the flooding of the rivers falling in the reservoir of the country’s largest Mangla Dam, he told APP here Friday.\nAmjad Iqbal Chaudhry said that the population living in the areas along the periphery of the Mangla lake, besides the adjoining low lying populous areas, had been directed to shift to the safer places to avert the increased threat of the flood ravages to men and material. The district-level emergency control room has already been established at DC Office similar to the centers set up in other stipulated sites in the district close to the Mangla reservoir, he added.\nMeanwhile, the DC said similar control rooms are also being set up in the concerned Deputy Commissioners in all ten districts of AJK. With the required staff, which will function round the clock for bringing about immediate necessary safety steps in case of emergency in any part of the districts.\nThe district-level emergency cell in Mirpur district could be contacted through the official telephone numbers at the DC Office as and when required for any assistance, he added.\n/ AHR.",
  "retrievedAt": "2025-08-11T09:18:52.456Z"
}
