{
  "title": "ISSI hosts Sichuan University delegation",
  "link": "https://www.app.com.pk/national/issi-hosts-sichuan-university-delegation/",
  "date_published": "2023-08-25T14:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): The China-Pakistan Study Centre (CPSC) here on Friday hosted a four-member delegation from the Institute of South Asian Studies (ISAS), Sichuan University China at the Institute of Strategic Studies Islamabad (ISSI).\nThe delegation was led by Associate Professor Dr. Zeng Xiangyu and included Dr. Gao Liang, He Xiangyi and Li Jialun, a press release said.\nWide range of subjects including the rapidly transforming global politics, Pakistan-China relations, the ‘Decade of China-Pakistan Economic Corridor (CPEC)’, water issues in South Asia, evolving situation in Afghanistan and Pakistan’s role in the Indian Ocean Region and its maritime strategy came under discussion in the meeting.\nDG ISSI Ambassador Sohail Mahmood, in his remarks, extended a warm welcome to the visiting scholars from China. He stated that friendship with China was the cornerstone of Pakistan’s foreign policy and the time-tested, all-weather Pakistan-China strategic cooperative partnership was a factor of stability in the region and beyond.\nThe China Pakistan Economic Corridor, he added, is pivotal for Pakistan’s economic turnaround and for regional connectivity and prosperity.\nHe added that Pakistan fully supported President Xi Jinping’s vision to promote peace and development across the globe through major initiatives including the Belt and Road Initiative (BRI), Global Development Initiative (GDI), Global Security Initiative (GSI) and Global Civilization Initiative (GCI).\nSharing his perspective on major-power competition, DG ISSI Ambassador (R) Sohail Mahmood stressed that it must be managed responsibly and it should not turn into confrontation. Pakistan would continue to stress that the key drivers of international relations should be peaceful co-existence and cooperation, and not confrontation and conflict.\nEarlier, Dr. Talat Shabbir, Director CPSC, in his remarks, briefed the visiting Chinese delegation about the structure and functioning of ISSI. He lauded the efforts made by China for global development, especially the CPEC. He recalled his recent two visits to China and emphasised people-to-people contacts for enhanced connectivity.\nDr. Neelum Nigar, Director Centre for Strategic Perspectives (CSP), in her remarks, discussed the water issues in South Asia. She said that climate change and global warming were exacerbating the water-related issues and underscored the need for collective efforts to minimise such non-traditional threats.\nMs. Amina Khan, Director Centre for Afghanistan, Middle East and Africa (CAMEA), in her remarks, evaluated the situation in Afghanistan. She said that the Interim Government was in power in Afghanistan for two years now and was seeking to grapple with the issues of governance, human rights, and counter-terrorism. The world must remain engaged and induce the fulfillment of commitments made by the Afghanistan side.\nMalik Qasim Mustafa, Director Arms Control and Disarmament Centre (ACDC) said that Pakistan was a developing country, protecting its maritime interests while remaining within its resources. Pakistan has the Exclusive Economic Zone (EEZ) of almost 240,000 square kilometres and protecting its coastline is a part of its national security, he added.\nThe remarks were followed by an interactive session in which different aspects of Pakistan-China relations were discussed and the research scholars dilated on wide-ranging global and regional topics.\nIn conclusion, Chairman Board of Governors ISSI, Ambassador Khalid Mahmood, shared his views and thanked the delegation for the visit.",
  "retrievedAt": "2025-08-11T09:18:49.497Z"
}
