{
  "title": "PML-N calls for accelerated constituency delimitation to facilitate early general elections",
  "link": "https://www.app.com.pk/national/pml-n-calls-for-accelerated-constituency-delimitation-to-facilitate-early-general-elections/",
  "date_published": "2023-08-25T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): The Pakistan Muslim League-Nawaz (PML-N) on Friday suggested that the Election Commission of Pakistan (ECP) should expedite the process of constituency delimitation to facilitate early holding of general elections.\nTalking to the media after a meeting of the PML-N delegation with the Chief Election Commissioner (CEC), PML-N leader Ahsan Iqbal emphasized that the Election Commission was required to conduct elections as per the requirements of the Constitution.\nThe meeting revolved around topics concerning the forthcoming elections, during which the ECP briefed the PML-N delegation about its preparations for the upcoming general elections, he said.\nAhsan Iqbal noted that the Election Commission was informed about the proposal to augment the women representation through increased seats. He expressed the confidence that the next election would adhere to constitutional and legal norms.\nHighlighting the significance of the forthcoming elections, the PML-N leader emphasized that they would do the utmost to hold free, fair and transparent elections. The PML-N delegation asked the Election Commission to promptly announce the voter registration date.\nAhsan Iqbal conveyed that the Election Commission has provided an assurance regarding the sharing of the code of conduct with political parties. Furthermore, he said the Election Commission has given its commitment to implementing effective measures in response to the concerns raised after the incidents in 2018.\nAddressing the gathering, Rana Sanaullah mentioned that the constituency delimitation process would conclude by December 14. Subsequently, the election schedule for the 54-day period will be released.\nDuring the meeting, the PML-N delegation raised concerns about issues like the breakdown of the Result Transmission System (RTS) and result delays, similar to the occurrences in 2018.\nThey put forward the suggestion to enforce the code of conduct strictly to reduce election expenses and prevent the spread of divisive politics.",
  "retrievedAt": "2025-08-11T09:18:52.494Z"
}
