{
  "title": "PM reaffirms govt’s desire to further strengthen ties with US",
  "link": "https://www.app.com.pk/national/pm-reaffirms-govts-desire-to-further-strengthen-ties-with-us/",
  "date_published": "2023-08-25T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Friday reaffirmed the government’s desire to further strengthening bilateral cooperation with the United States in the key areas including trade and investment, energy, security, and climate change.\nHe was talking to the U.S. Ambassador to Pakistan Donald Blome who called on him here.\nAmbassador Blome congratulated the prime minister on assuming office and reaffirmed the United States’ desire for supporting Pakistan’s economic and development agenda.\nThe prime minister said that Pakistan and the US enjoyed longstanding and broad-based relations, rooted in mutual respect, common interests and shared values.\nThe prime minister emphasized that the caretaker Government’s main responsibility is to assist the Election Commission of Pakistan in the electoral process and provide constitutional continuity during the period of democratic transition.\nHe expressed satisfaction over the current positive trajectory of bilateral ties and appreciated the United States’ role in helping Pakistan to stabilize its economy and reaffirmed Pakistan’s commitment to continue the reform agenda for achieving sustainable growth.\nNoting the role that the U.S. private sector has traditionally played in supporting Pakistan’s economic growth, he hoped that that more U.S. companies would explore the investment opportunities, particularly to tap the vast potential for investment in Pakistan’s information technology sector.\nLauding the important contributions of the Pakistani-American community towards strengthening ties between the two countries, the prime minister called for increasing people-to-people contacts between the two countries.\n\"Delighted to meet with Caretaker Prime Minister @anwaar_kakar today.  Reaffirmed steadfast commitment to U.S.-Pakistan relationship, support for free and fair elections, desire to work with and through U.S. Pakistan Green Alliance to build for the future. 1/2\n— U.S. Embassy Islamabad (@usembislamabad) August 25, 2023\nMeanwhile in a social media post on X (formerly known as twitter), Donald Blome said during the meeting with PM Kakar, they reaffirmed steadfast commitment to U.S.-Pakistan relationship, support for free and fair elections, and desire to work with and through U.S. Pakistan Green Alliance to build for the future.\nHe said he also encouraged protection of religious minorities and continued partnership with International Monetary Fund (IMF) on economic recovery.",
  "retrievedAt": "2025-08-11T09:18:17.935Z"
}
