{
  "title": "PLOG expresses satisfaction over SEFRP system to disburse funds to flood affected",
  "link": "https://www.app.com.pk/national/plog-expresses-satisfaction-over-sefrp-system-to-disburse-funds-to-flood-affected/",
  "date_published": "2023-08-25T12:56:00.000Z",
  "source": "APP",
  "content": "KHAIRPUR, Aug 25 (APP): The Provincial Level Observer Group (PLOG) on Friday expressed its satisfaction after interactive sessions with the residents of village Lal Dino Ujjan at Dist Khairpur and village Bahdur Chandio at Shaheed Benazirabad District over the system devised by Sindh Emergency Flood Rehabilitation Project (SEFRP) to disburse funds to flood-affected enabling them to earn their livelihood under the Cash for Work Program.\nThe members of the forum included Dr. Ayub Shaikh writer, Dr. Altaf Siyal and Dr. Bakhshal Lashari, water experts, and Dr Sono Kanghrani, a social sector expert, a news release said.\nUnder the program, flood affectees of the selected districts have been engaged to restore the community infrastructure on a daily wage basis enabling them to earn their daily needs.\nThey are hired to restore the infrastructure of their respective areas which was destroyed by the floods including walkways, drinking water, and drainage systems. The participation of women workers is also ensured which would be up to 30% of the total workforce.\nThe disbursement under the program has started to the workers of completed schemes through their accounts in the local banks opened for this purpose. Dr. Sono Kanghrani During the feedback session said that input by the observers group would help in improving the project intervention.\nThe World Bank has for the first time taken this Initiative to constitute an independent observer group to record community and user feedback regarding project interventions. Dr. Bakhshal Lashari was of the view that this Initiative of the Sindh Government to provide assistance to the flood-affected is remarkable.\nThe wash-for-work intervention is being implemented with the help of a social mobilization partner (SRSO) to ascertain the community participation, transparency, and efficiency of the mechanism.\nSindh Flood Emergency Rehabilitation Project conducted this session to have external feedback regarding the project implementation mechanism. Aslam Leghari and Basharat Khan participated from the SEFRP side while Naseer Memon from the World Bank attended the session.",
  "retrievedAt": "2025-08-11T09:18:52.202Z"
}
