{
  "title": "ECP pledges fairness, transparency for all contesting parties",
  "link": "https://www.app.com.pk/national/ecp-pledges-fairness-transparency-for-all-contesting-parties/",
  "date_published": "2023-08-25T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): The Election Commission of Pakistan (ECP) has assured the visiting Pakistan Muslim League Nawaz (PML-N) delegation that equal opportunities will be ensured for all contesting parties, besides ensuring transparency and impartiality.\nHe further said that strict legal action will be ensured for violation of the code of conduct and for this purpose the monitoring wing has been strengthened.\nThe delegation was informed by the ECP that measures were underway to bolster the Monitoring Wing’s capacity to take punitive measures against those who violate the code of ethics.\nAs part of its ongoing consultation process with major political parties in the country, the ECP has extended an invitation to the PML-N for discussions on the election roadmap.\nThe consultative meeting was chaired by Chief Election Commissioner, Sikander Sultan Raja.\nIn addition to the members of the Election Commission, senior officers of the Commission were also present.\nThe Chief Election Commissioner (CEC) assured the delegation that the Commission will simultaneously complete the tasks of constituency delimitation and updating electoral rolls within the shortest feasible time.\nThe delegation proposed that a renewed consultation process on the code of conduct should be launched, with a focus on banning hate speech and permitting only posters and stickers to curb candidates’ expenses. Furthermore, the party should handle the media campaign, while individual candidates should not be permitted to run their own media campaigns.\nAdditionally, the CEC emphasized that the Election Commission will ensure compliance with legal protocols when engaging with political parties on matters concerning the code of conduct. Following this consultation, the code of conduct will be given its definitive form.\nThe Pakistan Muslim League-Nawaz (PML-N) delegation, including Ahsan Iqbal, Rana Tanveer Hussain, Zahid Hamid, Azam Nazeer Tarar, Ataullah Tarar, and Asad Junejo, informed the Election Commission that the Council of Common Interests (CCI) has unanimously endorsed the census results and their publication.\nThis decision is a result of the consensus among all political parties that the 2023 elections will be based on the new census data. The Constituency delimitation Schedule issued by the Election Commission was in accordance with the Constitution and the law.\nThe delegation recommended initiating a fresh round of consultations for devising a fresh code of conduct for media. They emphasized the need to ban hate speech and restrict candidates’ expenses by allowing only posters and stickers.\nAdditionally, the delegation proposed that the party should handle the media campaign, while individual candidates should not be permitted to run their own media campaigns.\nFurthermore, the delegation proposed that Election Commission officers should take on the roles of District Returning Officers and Returning Officers, as they are capable of performing these tasks more effectively. If feasible, the Election Commission should consider assigning this responsibility to its officers in the forthcoming elections.",
  "retrievedAt": "2025-08-11T09:18:46.427Z"
}
