{
  "title": "Govt to file review petition against SC’s decision of ban on import of Ajinomoto",
  "link": "https://www.app.com.pk/national/govt-to-file-review-petition-against-scs-decision-of-ban-on-import-of-ajinomoto/",
  "date_published": "2024-12-02T15:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP):The Federal Cabinet on Monday authorized the government to file review petition against the Supreme Court’s decision of ban on import of Monosodium glutamate (Ajinomoto) commonly known as Chinese salt.\nThe decision was taken on the recommendation of commerce ministry and in line with the report of the experts’ special committee that was formed to monitor the impacts of Monosodium glutamate on human health.\nThe report had termed the Monosodium glutamate safe for human health. The committee was comprised of representatives from Pakistan Scientific and Industrial Research, National Agriculture Research Center, National University of Sciences and Technology, Institute of Food and Nutritional Sciences, Federal Ministry of National Food Safety and Research, Pakistan Standards and Quality Control Authority and Board of Investment.\nThe meeting of the federal cabinet was held here under the chairmanship of Prime Minister Muhammad Shehbaz Sharif.\nThe cabinet on the recommendation of the Interior Ministry, approved the National Prevention of Violent Extremism Policy 2024.\nIn addition, the cabinet also approved in principle the proposal of the interior ministry with respect to the establishment of Islamabad Central Business District Development Authority.\nThe cabinet, on the proposal of ministry of education and professional training also gave a go ahead to the renewal of the Memoranda of Understands with respect to University of Cambridge, Saint Antony’s College University of Oxford, University of Jordan, Pecking University China, University of Hydal Berg, and Pakistan Chairs in Germany.\nFurthermore, the cabinet, on the recommendation of ministry of education and professional training approved nomination of Dr Habib ur Rehman and Dr Kamran Ansari as subject experts in the Board of Governors of University of Engineering and Technology (UET) Lahore and the nomination of Dr Mumtaz Muhammad Shah and Dr Muhammad Ahmed Farooqui as subject experts in Board of Governors of Center of Excellence in Mineralogy, University of Balochistan Quetta.\nThe federal cabinet, on the proposal of ministry of law and justice and in line with Sindh High Court orders approved the amendment in the jurisdiction of special courts.\nOn the recommendation of ministry of law and justice and in line with Balochistan High Court orders, the cabinet also approved amendments in the jurisdiction of special courts (customs, taxation and anti smuggling) Quetta and Khuzdar.\nSimilarly, on proposals of ministry of law and justice and in line with orders of Peshawar High Court, Lahore High Court, Islamabad High Court, Sindh High Court, and Balochistan High Court, the cabinet authorized the additional session judges and other relevant courts to hear the cases under lawyers welfare and protection act 2023.\nEarlier, speaking on the occasion, Prime Minister Shehbaz Sharif appreciated his economic teams’ performance saying that the country’s economy was on track to progress amid stringent clamp down on smuggling, plummeting inflation and doubled revenue collection that helped improve the eroding economy.\n“Today the inflation rate is at 70 months’ lowest level of 4.9 per cent [which was at 7.2 per cent in October 2024] which is beyond imagination and due to the team work and blessings of the Almighty,” he said while addressing the federal cabinet meeting.\nPrime Minister Shehbaz Sharif said the sentiment on ground was positive as inflation had further declined and the government would have to proceed towards growth with a focused approach to improve gross domestic product (GDP) ratio, exports, industry, employment and special economic zones (SEZs).\nHe said all these indicators were critical as inflation was the only tool that aggravates poverty and diminishes poor man’s purchasing power parity.\n“Drop in inflation will incur propitious results as the State Bank after its meeting would reduce policy rate which is its prerogative,” the prime minister said.\nPM Shehbaz reiterated that the protests held previously caused huge economic and property losses to the nation. “Pakistan Stock Exchange also crashed from its highest trading level but after de-escalation of the situation at D-Chowk it bounced back and mitigated the previous losses,” he said.\nHe also noted that the government had managed to maintain more revenue collection than the previous year. He noted that enforcement was the only tool in the short term to ensure revenue collection.\nHe mentioned that earlier due to soaring inflation, he guardedly allowed 0.79 million tonnes of Sugar export that not only helped in stabilizing the commodity prices, but rather resulted in further decline in its prices. “It will provide the country an opportunity to earn half a billion dollars from Sugar exports,” he added.\nThe prime minister underlined that smuggling had gone zero due to Pakistan Army’s complete enforcement and support as previously there were multiple law enforcement agencies on the borders but the current stringent regime remained an uphill task for them.\nThe FBR should deploy competent enforcement teams to achieve its revenue collection targets as that was how nations were built,” he added.\nThe prime minister also congratulated, Minister for Aviation, Defence Minister Khawaja Muhammad Asif and his team for achieving landmark success as the European aviation regulator lifted the ban on Pakistan International Airlines flights to Europe after more than four years.\nPM Shehbaz regretted that the former Aviation Minister’s irresponsible statement brought embarrassment and bad name to the country that caste negative impact on the national economy.\nHe also praised former Aviation Minister, Khawaja Saad Rafique and his team for making efforts in the previous regime for this cause.",
  "retrievedAt": "2025-08-10T11:51:59.017Z"
}
