{
  "title": "PWDs Day to be observed on Tuesday",
  "link": "https://www.app.com.pk/national/pwds-day-to-be-observed-on-tuesday/",
  "date_published": "2024-12-02T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 02 (APP):Like other parts of the world, Pakistan will observe “The Person with disability Day on Tuesday.\nThe theme of this year is to “Amplifying the leadership of persons with disabilities for an inclusive and sustainable\nThe leadership of persons with disabilities is epitomised by the global disability rights movement’s slogan “Nothing About Us Without Us”.\nIt connotes the basic requirements of participation, representation and inclusion and calls for persons with disabilities to actively shape the conditions of their lives.\nOne of the priorities of the global disability agenda is to advance the agency and leadership of persons with disabilities. In the past decades, persons with disabilities and organisations of persons with disabilities (OPDs) have already championed for the changes in their communities, and have been leading many of the community-led initiatives not only to advance their own rights, and well-being but also promoting inclusive development for instance enabling universal access to basic services.\nThe observance of the International Day of Persons with Disabilities 2024 (IDPD 2024) takes place against the backdrop of pivotal global developments, from the Summit of the Future to the upcoming Second World Summit for Social Development.\nThese key global Summits will complement one another in providing a continuous road-map toward disability-inclusive and sustainable peace and development.\nBy emphasising this complementarity, the theme chosen for the observance in 2024 aims to underscore the importance of leveraging the leadership of persons with disabilities to ensure disability-inclusive and sustainable peace and development for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T11:53:46.374Z"
}
