{
  "title": "COVID-19 signifies importance of dealing with threats posed by Climate Change: Amin",
  "link": "https://www.app.com.pk/national/covid-19-signifies-importance-of-dealing-with-threats-posed-by-climate-change-amin/",
  "date_published": "2021-05-04T18:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 04 (APP): Special Assistant to Prime Minister (SAPM) on Climate Change, Malik Amin Aslam, has said that COVID-19 has posed numerous challenges, however, it has created an opportunity for Pakistan to respond to threats emanating from climate change.\nDuring the time of pandemic, Pakistan has initiated green stimulus program which is focused on green employment and saving of the nature.\nHe expressed these views during his keynote address at the roundtable webinar ‘Debt swaps for green recovery: opportunities, challenges and way forward for Pakistan’ organized by Sustainable Development Policy Institute (SDPI), said a news release.\n“As the country is inclined towards clean green initiatives, this government is focusing on financing this transition through various mechanisms,” Aslam said and explained further that the first step in this regard is restructuring of ADB financing.\nThe initiative is focused on green employment whereas the Eco-system restoration fund in which $ 120 Million from World Bank is being utilized for eco-system restoration.\nBesides, the objective is to be achieved through creation of estimated 100,000 green jobs based on these activities. He added further that the government is also focusing on ‘Debt for Nature’ Swap and Green Euro bond worth $ 500 million for hydropower projects.\nDr Abid Qaiyum Suleri, Executive Director, SDPI, was of view that in current scenario, it is not only Pakistan but the countries across the globe are facing financial constraints and it has limited their window and fiscal availability for investment in green development.\n“Swapping our debt for nature, biodiversity, green and clean projects, could be a useful source for taking care of COVID-19 recoveries and social safety,” Dr Suleri said while highlighting some of the initiatives taken by government for debt swaps.\nChief SDGs Support Unit, Ministry of Planning & Special Initiatives, M Ali Kemal, informed the participants that several debt swaps agreements are taking place through which 85,000 green jobs have been created under the climate change agenda.\nBesides, $ 180 million has been generated for eco-system restoration. He added further that COVID-19 has led to the digitalization of different sectors that can be a pathway for country to improve its index.\nSamar Ihsan, Senior Joint Secretary, EAD, highlighted that in the past, Pakistan has debt rescheduling under different agreement.\nFor instance, she said, Canada who swapped for 447 million Canadian dollars for quality of education, Germany swapped 50 million euros for education, and Italy swapped 85 million dollar-50% of which was for Afghan refugees and 50% for health and education.\nThe government has been striving to explore the potential areas for biodiversity, she added.\nSobiah Becker, Climate Change Adviser, FCDO, explained that how upcoming opportunities can be utilized for debt swaps in COP-26 as well. This pandemic has shown that the planetary health is also linked with human health, she added.\nMujtaba Khalid, Head of Islamic Finance Center, BIBF was of view that there are multiple ways for approaching the climate change affected countries as Pakistan is one of them and hence, polices are required for climate action agenda.\nKhurram Lalani from Energy & Infrastructure, Resources Future, said that it was initially assumed that the pandemic will lead to less investment in green infrastructure globally, but the entire opposite has happened and 96 % of the investments have increased during the last year.\nStrategic Planning Advisor, SEED Pakistan, Omar Mukhtar opined that for building back better, we must ensure that economic recovery exists. Debt for climate swaps should be among the environmental goals.\nThe fiscal space is tough in Pakistan and the federal share of government revenue is 3300 Billion out of which 2600 Billion were paid in debt while the remaining were borrowed for expenses.\nHe said that serious capacity issues prevail in negotiation with government bodies whereas coordination between federal and provincial level for climate change goals is highly important.\nDr Sajid Amin and Dr Hina Aslam, from SDPI, also covered various aspects of the topic and said that green recovery must be a prime focused area for the government.",
  "retrievedAt": "2025-08-11T20:41:45.567Z"
}
