{
  "title": "IHC accepts ECP’s appeal for hearing in LG polls case",
  "link": "https://www.app.com.pk/national/ihc-accepts-ecps-appeal-for-hearing-in-lg-polls-case/",
  "date_published": "2023-01-02T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 02 (APP): The Islamabad High Court (IHC) on Monday accepted intra-court appeals of the Election Commission of Pakistan (ECP) and the Federation with regard to the local government elections in Federal Capital.\nA two-judge bench headed by Chief Justice Aamer Farooq heard the ICAs against the decision of a single-member bench of ordering the ECP to hold LG elections on December 31.\nThe ECP’s counsel Mian Abdul Rauf argued that the institution had postponed the elections due to increase in the number of union councils, and that its notification of December 28 (2022) was never challenged. The ECP’s director general law said the Commission announced its decision regarding the union councils on December 27 and the December 28 notification was based on it.\nMian Abdul Rauf said the two houses of the Parliament had approved the bill (regarding increase in the number of UCs). The additional attorney general said even the notification dated December 19 was also not challenged.\nThe chief justice remarked that the two sides were not coming towards the constitutional questions, and asked them to take time until the day after tomorrow for preparation.\nThe court observed that the ECP was supposed to conduct elections on December 31 as the single-member bench had only voided the Commission’s decision regarding polls.\nIt further observed that the ECP had to give a new election schedule under the new law as well. The ECP’s lawyer said the department would issue a new schedule if the elections were held in 101 UCs.\nThe ECP’s advocate prayed the court to suspend the decision of single member bench. The court asked the ECP’s lawyer to tell an appropriate and practical way that whether the institution could conduct elections in 101 UCs or not.\nThe ECP’s DG said he update the court in that regard after taking the instructions.\nThe court then adjourned the hearing till January 9.",
  "retrievedAt": "2025-08-11T05:39:40.902Z"
}
