{
  "title": "12 fresh Covid-19 cases reported in 24 hours: NIH",
  "link": "https://www.app.com.pk/national/12-fresh-covid-19-cases-reported-in-24-hours-nih/",
  "date_published": "2023-01-02T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 02 (APP): Health officials on Monday said that 12 new Coronavirus cases were reported during the last 24 hours across the country.\nAs per data shared by the National Institute of Health (NIH), the case positivity ratio is 0.39 percent while 11 patients were in critical condition.\nNo death was reported from the Coronavirus in the last 24 hours while 3,062 Covid-19 tests were conducted.\nAround 195 tests were conducted in Islamabad with four confirmed cases at ratio of 2.05% while 771 cases reported in Lahore with six confirmed cases at ratio of 0.78%.\nMeanwhile, Minister for National Health Services, Regulations and Coordination, Abdul Qadir Patel said that the government has strengthened the role of Border and Health Services in Pakistan to deal with any sub-variant of Covid-19.\nThe minister said that there was a surveillance system at all entry points of the country including airports. He said that there will be rapid tests and screening of passengers at all airports.\nHe said that the situation was completely under control and asked the general public to avoid listening to rumors. He added that the Corona case passivity ratio was just 0.3 to 0.5 in the country while 90 percent of the country’s population already got the COVID-19 vaccine.\n“An efficient system with a proper management team is fully functional in the country to remain vigilant and is ready to make an emergency plan to deal with any sub-variant of Covid-19,” the minister added.\nHe said that Border and Health Services Pakistan was ensuring the implementation of international health regulations.\nHe said that in case of any untoward situation the health system was fully prepared to deal with any sub-variant of the Omicron variant of COVID-19 including BF.7 in the country.",
  "retrievedAt": "2025-08-11T05:39:23.509Z"
}
