{
  "title": "FGRF going to rehabilitate 4 modern villages in Sehwan Sharif",
  "link": "https://www.app.com.pk/national/fgrf-going-to-rehabilitate-4-modern-villages-in-sehwan-sharif/",
  "date_published": "2023-01-02T17:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 02 (APP): Faizan Global Relief Foundation (FGRF), a non-profitable organization, is going to rehabilitate four model villages in Bajara, an area of Sehwan Sharif which was damaged by the recent monsoon rains and flash floods.\nThese model villages were constructed by former Sindh Chief Minister (CM) Syed Abdullah Shah who was the father of incumbent CM Syed Murad Ali Shah. To transform this plan into reality, the FGRF’s delegation comprising Chief Executive Officer Imran Gigi along with Chief Operating Officer (COO) Muhammad Adil Attari and Board Member Muhammad Yaqoob Attari held a comprehensive meeting with Sindh CM Murad Ali Shah on Wednesday, December 28, 2022.\nHe gave the seal of approval appreciating the FGRF’s this particular initiative besides other welfare and development works for the well-being of the people across the province.\nTalking to APP, FGRF COO Muhammad Adil Attari informed that 50 houses would be built on modern lines in each village with the facility of electricity, generated by solar energy.\nHe said the people who would be provided these residential units, would also be given ownership rights of the houses as per assurance of the Sindh CM Shah.\nHe further informed that the foundation had rehabilitated 3,000 houses with an estimated cost of Rs 150 million which were partially damaged in 25 cities including Kalam, Dera Ismail Khan, Charsadda, Rajanpur, Layah, Khairpur, Sukkur, Gambat, Shikarpur, Jacobabad, Larkana, Qambar Shahdadkot, Nawabshah (Benazirabad), Qazi Ahmed, Dadu, Sehwan Sharif, Mehar, Johi, Sujawal, Thari Meerwah, Mirpurkhas, Osta Muhammad, Dera Allah Yar, Bela, and Uthal.\nHe said the foundation had also commenced the construction work on fully damaged houses in the following areas of the country which would be completed in due course of time.\nAdil Attari, renewing his pledge, said the FGRF would leave no stone unturned until and unless the flood-affected people would be properly settled down in their own houses.",
  "retrievedAt": "2025-08-11T05:39:43.546Z"
}
