{
  "title": "Imran Khan changes his narratives like weather: Marriyum",
  "link": "https://www.app.com.pk/national/imran-khan-changes-his-narratives-like-weather-marriyum/",
  "date_published": "2023-01-02T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 02 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Monday alleged that Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan consistently changed his narratives which were nothing but packs of lies to mislead the people.\n“Imran Khan has been changing his narratives like weather (since his ouster from power),” she said in a news statement while responding to the PTI chief’s remarks in the media.\nThe minister said Imran Khan claimed that it came to his knowledge last summer that Shehbaz Sharif would become prime minister which was contrary to his earlier statements. He (Imran) used to say that he even could think Shehbaz Sharif becoming the country’s chief executive.\nImran Khan had already failed to materialize his plan to default the country, and he should better introspect on his four-year government’s performance from 2018 to April 2022.\nIronically, “foreign agent Imran Khan”, who had robbed Toshakhana and traded off national interests for diamonds, had the audacity to question what wrong he had committed, she remarked.\nMarriyum said Imran Khan acted like a dictator and took autocratic steps against his opponents on false allegations, however, not a single allegation was proved.\nNow the time had come that Imran Khan would have to answer for his wrongdoings, she added.\nThe minister said astonishingly Imran Khan had all of a sudden started commenting on the actions taken by former army chief General (retd) Qamar Javed Bajwa from 2021 to April 2022.\n“Why had he offered a life-time extension to the former army chief while the latter had hatched a plot against him?” she questioned. It was Imran Khan who had conferred the best commander award on him, she added.\nMarriyum said it was beyond comprehension why did Imran Khan not keep the people informed when the former army chief was resisting the accountability process. At the same time, he had surprisingly kept Tayba Gul hostage at the Prime Minister’s House for blackmailing the former National Accountability Bureau chairman.\nShe dared Imran Khan to tell the truth that why did he seek the support of the head of an institution to win the Senate election and also prevent his disqualification (as a member of the National Assembly), and why did he not take action when the votes of parliamentarians were bought in both the houses of the Parliament.\nThe evidence of horse-trading had come forth which proved that Imran Khan had set up a “political market” during the Senate’s election in 2018, she added. His (Imran’s) leaked audios were clear evidence of his involvement in political engineering and horse-trading.",
  "retrievedAt": "2025-08-11T05:39:38.220Z"
}
