{
  "title": "AIOU stands in solidarity with Kashmiris on Black Day",
  "link": "https://www.app.com.pk/national/aiou-stands-in-solidarity-with-kashmiris-on-black-day/",
  "date_published": "2024-10-31T11:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 31 (APP):Allama Iqbal Open University (AIOU) organized a seminar and walk on Thursday in observance of Kashmir Black Day, condemning India’s illegal occupation and inhumane actions in occupied Kashmir.\nIn the first phase, a rally was held within the university, with active participation from faculty, officers, staff, and students.\nThe participants held banners and posters with messages such as, “We Stand with You,” “Kashmir is Pakistan’s Jugular Vein,” and “Islam defines our bond with Kahsmiri people,” chanting slogans for Kashmir to become part of Pakistan.\nAfter the rally, a seminar was held to express solidarity with the people of Kashmir.\nSpeakers urged the international community and human rights organizations to take notice of the atrocities committed against the Kashmiri people, emphasizing that the Kashmir issue should be resolved according to United Nations Security Council resolutions and the aspirations of the people of Kashmir.\nThey condemned the grave human rights violations and breaches of international laws by Indian forces against the Kashmiri population and highlighted the need for effective use of social media to raise global awareness about the Kashmir issue and Indian oppression.\nIn his address, Sheikh Abdul Mateen, General Secretary of the All Parties Hurriyat Conference (AJK), expressed gratitude towards the government and people of Pakistan for their consistent political, diplomatic, and moral support to the Kashmiri people.\nHe emphasized that, after Allah, the only hope for Kashmiris is Pakistan and stressed the need for financial and moral support for their struggle.\nHe stated that a strong Pakistan is the guarantee of Kashmir’s freedom, as Kashmiris look towards a prosperous Pakistan for assurance.\nProminent speakers included Mudasir Rasheed, President of Bahaali Foundation; Jamshaid Sultan Malik, Executive Producer at PTV World; Mian Sanaullah, TV anchor and scholar; Dr. Syed Akmal Shah from the International Islamic University; Professor Dr. Shams-ur-Rahman, Chairman of the Seerat Chair at the university; Syed Ghulam Kazim Ali, Director of the Directorate of Student Advisory and Counselling Services; Dr. Kishwar Sultana, Chairperson of the History Department; and Dr. Abdul Basit Mujahid.\nThe event was organized by the Department of History with support from the Directorate of Student Advisory and Counselling Services.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:33:18.820Z"
}
