{
  "title": "Pakistan reiterates no talks with TTP; asks AIG to act against militant groups",
  "link": "https://www.app.com.pk/national/pakistan-reiterates-no-talks-with-ttp-asks-aig-to-act-against-militant-groups/",
  "date_published": "2024-10-31T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 31 (APP): Pakistan on Thursday ruled out any talks with terror outfit Tehreek-e-Taliban Pakistan and reiterated its call for the Afghan Interim Government to act against the militant groups using Afghan soil to target Pakistan.\nThe Foreign Office spokesperson Mumtaz Zahra Baloch, at her weekly press briefing, said that Pakistan rejected any offer or advice for talks with TTP as the country had done so on several occasions.\nAsked to comment on a statement by an Afghan diplomat in Islamabad, she said Afghan authorities had the responsibility to act against terror groups, primarily TTP as Pakistan had also provided the pieces of evidence to the Afghan authorities. She explained that this was not merely Pakistan’s demand but also the international community.\nThe spokesperson condemned the recent Israeli attacks on Lebanon’s Bekaa Valley and Baalbek region resulting in the tragic loss of civilian lives, including women and children, and the displacement of over a million people.\n“These airstrikes are a violation of Lebanon’s national sovereignty and territorial integrity; and constitute a serious violation of international humanitarian law and the UN Charter. Pakistan also unequivocally condemns continuing Israeli assault against the people of Northern Gaza and the indiscriminate airstrike on Beit Lahiya which has resulted in the tragic loss of over a 100 Palestinian lives, including women and children.”\nShe viewed that targeting densely populated residential areas without warning, day after day, with absolute impunity, reflected Israeli disdain for international law and human suffering. The siege of Gaza and uninterrupted Israeli attacks are piling on heaps of misery, devastation and death upon the already battered people of Gaza, she added.\nCalling Israel’s action of dismantling the operations of the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) unacceptable she said such acts were a manifestation of Israel’s systematic campaign to dehumanize the Palestinian people.\nThe spokesperson called upon the international community for an immediate cessation of hostilities in Palestine and Lebanon; protection of civilians; and unrestricted humanitarian access, besides ending Israel’s genocidal campaign against the Palestinians in Gaza.\nTo another query, she said there was no request from the governments of Palestine and Lebanon to provide search and rescue teams’ support. However, Pakistan has been providing humanitarian assistance to the people of Gaza and for Lebanon it was started recently, she said, adding, “We are providing humanitarian assistance as per the requirements of the Red Cross that includes tents, medicines, food items and shelter needs.”\nShe told the media that last week, Pakistan sent two more planeloads of humanitarian aid to Lebanon. Thus far, four special cargo planes with essential humanitarian supplies have arrived in Lebanon from Pakistan, she added.\nThe spokesperson apprised the media of Prime Minister Shehbaz’s concluded two-day visit to Saudi Arabia and ongoing Qatar visit where he would meet the Qatari leadership to discuss bilateral cooperation in trade and investment and discussion on regional developments.\nShe also highlighted the visit of Speaker of the Federation Council of Russia, Valentina Matvienko to Islamabad who held separate meetings with President Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif, Chairman of the Senate of Pakistan Syed Yousuf Raza Gillani, besides addressing the Senate of Pakistan.\nReferring to the observance of Kashmir Black Day marking the 77th anniversary of the arrival of Indian troops in Jammu and Kashmir on October 27, the spokesperson told the media that Deputy Prime Minister/Foreign Minister Ishaq Dar had addressed letters to the leadership of the United Nations and the Organization of Islamic Cooperation (OIC), highlighting the ongoing situation in Illegally Indian Occupied Jammu and Kashmir (IIOJK).\nDar has called for the full implementation of relevant UN Security Council resolutions and urged international action to address human rights concerns, including the release of Kashmiri political prisoners and activists, she said and reiterated Pakistan’s continuous political, diplomatic and moral support to Kashmiris.\nIn her response on Pakistan’s membership to the multilateral forum of BRICS, she said Pakistan had shown its interest in joining this group as it promotes inclusive multilateralism considering it fully eligible for its membership.\nCommenting on Indian extrajudicial killings of Sikhs abroad, she said Pakistan was bringing international attention to the Indian terrorist activities and clandestine designs leading to extrajudicial killings abroad and had urged the international community to force India to abstain from such efforts.\nOn Dr Aafia Siddiqui case, she said as per the US laws a convicted person could file a mercy petition to the US President and Pakistan had supported her petition. She added that the case of Dr Afia Siddiqui was special as it was close to the heart of the people of Pakistan. Moreover, the circumstances of her arrest, detention, and her trial had been debated in Pakistan and the government was following up the case in accordance with the public sentiments and the court directions.\nResponding to another query, she reiterated that Pakistan was resolved to the security of Chinese nationals in Pakistan and the commitment had also been conveyed to the top Chinese leadership.\nThe spokesperson said that Afghan authorities had the responsibility to act against terror groups, primarily TTP as Pakistan had also provided the pieces of evidence to the Afghan authorities. She explained that this was not merely Pakistan's demand but also the international community.",
  "retrievedAt": "2025-08-10T20:33:15.015Z"
}
