{
  "title": "Recognising Imran’s hypocritical face, masses have rejected protest call: Marriyum",
  "link": "https://www.app.com.pk/national/recognising-imrans-hypocritical-face-masses-have-rejected-protest-call-marriyum/",
  "date_published": "2022-06-19T07:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Sunday that the people of Pakistan have rejected the negative politics of Imran Khan and his call for agitation would prove a miserable flop.\nIn a tweet in response to former prime minister Imran Khan’s call of protest on Sunday night, she said that the people of Pakistan have recognised his fake and hypocritical face.\nTaking a jibe on Imran, she said that those who ran away on the night of May 25 now wanted to spread chaos and anarchy in the country over inflation caused by their own inefficient regime as the PTI’s narrative of “foreign conspiracy” had been buried.\nWhy should the people take to streets for those who sold national interest for a few diamonds, she asked.\nShe said why should the people come to protest on the call of a hypocrite who plundered national wealth when in power.\nWhy should the people come out for a person who deprived the working class of employment and their livelihood, she said, adding, why should the people respond to the call of those who were responsible for inflation, economic catastrophe and unemployment in the country.\nShe said that the people would not respond to the call of those who created the “storm of inflation” and signed agreements with the IMF on weak grounds.\nWhy should the people come out on the call of those who increased flour price from Rs 35 per kg to Rs 90, and sugar price from Rs 52 to Rs 120.\nThe minister maintained that the people would not pay any heed to the protest call of those who had launched a “bloody march” last month and shot dead policemen performing their duty.\n“Why should the people go out to protest for those who wanted the country divided into three parts and who sold national interest in exchange of diamond rings for four years.\nThe people would not take part in protest demonstrations for those who borrowed record money during their four-year tenure and sold Kashmir and created division in the country.\nThe minister said that the government was correcting the economic direction of the country and at this critical juncture, no violent protests would be allowed.",
  "retrievedAt": "2025-08-11T15:06:51.914Z"
}
