{
  "title": "NA panel rejects uniform property tax rate, approves clampdown on tax fraud, elite clubs - Business - DAWN.COM",
  "author": null,
  "content": "• Drops proposal for 4pc uniform rental valuation on commercial properties\n• Exclusive clubs charging Rs1m or more membership fees brought under tax net\n• Arrest powers of tax officials curbed; prior approval and inquiry mandatory\n\nISLAMABAD: A parliamentary committee on Friday rejected a proposal to fix a uniform rate for rental valuation of commercial properties, while endorsing another measure to expand the tax net to high-end clubs nationwide and reinforce safeguards against tax fraud.\n\nThe National Assembly Standing Committee on Finance resumed deliberations on the Finance Bill 2025 on Friday, as Federal Board of Revenue (FBR) Chairman Rashid Mahmood Langrial and his team addressed queries raised by committee members. The session was chaired by MNA Naveed Qamar, who provided input on various provisions of the Bill.\n\nOn the issue of a uniform 4 per cent rental valuation rate on commercial properties, MNA Mirza Ikhtiar Baig urged the tax authority to lower the proposed rate, a suggestion FBR chairman countered by insisting the rate could not be reduced.\n\nMr Rashid noted that under the existing arrangements, tax officers held discretionary power to determine rental valuations. “If the committee is unwilling to delegate authority of the uniform rate, we are prepared to withdraw the proposal altogether,” said the FBR Chairman.\n\nMNA Usama Mela said that a 4pc rate might be feasible in urban centres but would pose challenges for rural areas.\n\nThe FBR chairman responded that the system should be allowed to operate for one fiscal year and, if ineffective, adjustments could be made in the subsequent fiscal year’s budget. He emphasised that FBR’s property valuations are significantly more accurate than traditional Deputy Commissioner (DC) rates and noted the law allows room for further revisions.\n\nMNA Naveed Qamar echoed the need for flexibility, suggesting that adjustments could be made where rates appear excessive. However, FBR officials announced the withdrawal of the proposed measure following resistance from committee members.\n\nElite clubs and e-commerce\n\nThe FBR chairman informed the NA committee that clubs charging Rs1 million or more for membership — including the prestigious Islamabad Club — will now be brought within the income tax net. These clubs will be required to file detailed income and expenditure statements, aligning with broader fiscal transparency objectives.\n\nMr Rashid said the move targets exclusive membership facilities that have so far operated outside formal tax oversight. “Only clubs demanding at least Rs1m for new memberships will fall under this new compliance regime,”, the chairman clarified.\n\nMNA Muhammad Mobeen Arif also voiced concern over low taxation on e-commerce, warning of potential misuse. He stated that FBR will levy 1pc tax on online sales compared to 5pc on shopkeepers. The FBR chairman clarified that a team is working to identify the disparity.\n\nThe committee considered the proposed amendments to The Stamp Act 1899. After detailed deliberations, the committee recommended that the amendments, as revised and proposed by the committee, be passed by the Assembly.\n\nThe committee considered the proposed amendments to The Registration Act 1908. At the very outset, the ministry expressed its intention to withdraw the said amendments. Accordingly, the committee acceded to the request and allowed the withdrawal.\n\nThe committee examined the proposed amendments to The Income Tax Ordinance, 2001. After detailed deliberations, the committee approved certain proposed amendments and suggested additional corrections and revisions to several clauses. Due to paucity of time, the committee deferred consideration of the remaining provisions of the Bill to the next meeting.\n\nTax officials’ arrest powers\n\nState Minister for Finance Bilal Azhar Kayani declared on the floor of the National Assembly that arrests at the inquiry stage in sales tax cases will no longer occur.\n\nActing on Prime Minister Shehbaz Sharif’s directives to address business community concerns, the government has amended arrest clauses in sales tax laws based on recommendations from Farooq H. Naik and the standing committee.\n\nHe further said that key changes include no arrests for sales tax fraud below 50 million. Mandatory approval from a three-member FBR committee before any arrest, ensuring citizen protection. Individuals accused of sales tax fraud will now be guaranteed a right to a hearing. The discretionary arrest powers previously held by tax officials have been revoked, he further clarified.\n\nEarlier, FBR issued a statement to clear its position on the legal provisions for the arrest of those involved in tax fraud, which have already been provided under Section 37A of the Sales Tax Act 1990 along with an elaborate procedure to be followed after the arrest which involves intimating the Special Judge immediately and the production of such person before Special Judge within 24 hours.\n\nHowever, the proposed amendment now restricts the powers of the officer to arrest by making a prior inquiry after approval of the Commissioner of Inland Revenue (CIR). Only based on the findings of the inquiry will CIR authorise the investigation, which would give the investigation officer the powers of an officer in charge of a police station under the Code of Criminal Procedure, 1898 (Act V of 1898). The arrest can only be made with the prior approval of CIR if the investigation officer has reasons to believe that a tax fraud may have been committed by a person.\n\nThe new legal provision further provides that if the arrest is mala fide, the matter will be referred to the Chief Commissioner for fact-finding inquiry. This shows that in contrast to the earlier provision where an Assistant CIR could arrest an offender, the new provisions bring transparency in the process by a mandatory prior inquiry and investigation and finally permission by the CIR.\n\nMoreover, certain changes and amendments are also necessary to reassure the compliant taxpayers that the state deals with those evading taxes or involved in tax fraud with an iron hand.\n\nPublished in Dawn, June 21th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/211016153380b0b.png",
  "retrievedAt": "2025-08-20T04:21:52.453Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918606/na-panel-rejects-uniform-property-tax-rate-approves-clampdown-on-tax-fraud-elite-clubs",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:29:51.000Z"
}
