{
  "title": "KP Budget 2025-26: KP puts off budget’s approval as Imran’s consent awaited - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa government has decided to delay the process of passing its next budget until Monday (June 23) to seek approval from incarcerated founder of the ruling Pakistan Tehreek-i-Insaf and former prime minister Imran Khan.\n\nOn Thursday, Speaker of the KP Assembly Babar Saleem Swati had announced that the house would approve the provincial budget for the financial year 2025-26 only after Imran granted permission.\n\n“Chief Minister Ali Amin Khan Gandapur will meet Imran Khan [in jail]. If he approves, we will pass the budget on June 24. If he does not approve, we will follow his directions,” Mr Swati told the assembly’s budget session.\n\nHowever, late on Thursday, Mr Gandapur issued a video statement, asking the PTI’s lawmakers not to proceed with cut motions on the budget during the ongoing session.\n\nPA speaker refuses to hold discussion on cut motions until Monday\n\nHe said that as chief minister, he had declared on the floor of the house that his government would follow Imran Khan’s directions on the budget, so he was supposed to meet him in jail but despite repeated messages and public appeals, the meeting hadn’t taken place yet.\n\nThe chief minister said that it was the former prime minister’s political right to give his input on the budget of the province, which was ruled by his party.\n\nHe insisted that denying him a meeting with his party’s leader in jail, especially after the budget’s approval was linked to his consent, was a conspiracy to topple the provincial government as the Constitution allowed federal intervention under a financial emergency.\n\nMr Gandapur said the Constitution allowed the centre to take over the province in case the provincial budget was not passed.\n\nHe, however, warned that any such move would disrupt the entire system.\n\nThe chief minister said he had directed the treasury members not to proceed with voting on cut motions, as the act would initiate the process for the budget’s approval.\n\n“I am telling the institutions, the entire system and the federal government that as chief minister, I can dissolve the assembly at any time. Imran Khan has the authority to issue orders for it,” he said, adding that the next course of action will be decided next Monday.\n\nAs the assembly resumed the budget session on Friday, Speaker Babar Saleem Swati announced that the house won’t hold discussion on cut motions as it would initiate the budget process.\n\nHe added that the law department confirmed it as he consulted it last night, so it had been decided that cut motions wouldn’t be discussed until the PTI founder approved the draft budget.\n\n“The budget will not be passed with Imran Khan’s consent,” he said.\n\nThe speaker also referred to the chief minister’s video message and instructions to PTI lawmakers in the KP Assembly.\n\nLeader of the Opposition Dr Ibadullah questioned the legality of delaying the budget on political grounds and said it was a budget for 45 million people but the PTI government was making new rules by linking its approval to a nod from “one person.”\n\nHe said under the rules, it’s the government’s agenda and its business, and it had already been approved by the cabinet.\n\n“If you [ruling PTI] are not going ahead with this [budget’s approval], this will be a no-confidence in your own government,” he said.\n\nThe speaker responded that the house halted the budget process by a majority decision.\n\nHe later adjourned the sitting until 2pm on Monday.\n\nMeanwhile, opposition members in the provincial assembly said they would announce their future course of action on the matter later.\n\n“We have called legal experts and will consult them before deciding our response,” Dr Ibadullah told reporters.\n\nHe said that suspending the budget process after its approval by the cabinet was itself a vote of no-confidence in the government.\n\nThe opposition leader regretted that the regional situation, especially due to the Israel-Iran conflict, required political stability, but the PTI government lacked the will and vision.\n\nPublished in Dawn, June 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:21:38.519Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918528/kp-budget-2025-26-kp-puts-off-budgets-approval-as-imrans-consent-awaited",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:30:24.000Z"
}
