{
  "title": "Pakistan gets $20bn in external assistance - Business - DAWN.COM",
  "author": null,
  "content": "• Surpasses target for FY25 in first eleven months\n• Includes $6.89bn in fresh inflows; rest are rollovers from China, Saudi Arabia and UAE\n\nISLAMABAD: Pakistan secured nearly $20bn in foreign loans and grants during the first 11 months (July-May) of 2024-25, surpassing the annual target of $19.2bn set for the fiscal year ending June 30.\n\nAlmost half of this amount comprised legacy rollovers from China, Saudi Arabia, and the United Arab Emirates, while fresh loans and grant inflows totalled $6.89bn — about 9pc lower than the same period last fiscal year.\n\nAccording to the Economic Affairs Division’s (EAD) monthly report on Foreign Economic Assistance (FEA) released on Friday, the total FEA during July-May stood at $6.89bn, compared to $7.55bn in the corresponding period of last year, against a target of $19.4bn for 2024-25 and $17.6bn last year.\n\nThis figure does not include approximately $2bn received from the International Monetary Fund (IMF) in two tranches under the ongoing $7bn Extended Fund Facility (EFF), which is recorded separately by the State Bank of Pakistan (SBP).\n\nIncluding rollovers and IMF disbursements, total external assistance reached $20bn during the 11-month period. This comprised $3bn each in rollovers from Saudi Arabia and China, and $2bn from the UAE. Pakistan’s total annual rollover portfolio from these three countries stands at approximately $12.7bn in the form of safe deposits and loans, leaving net international reserves (NIR) at around $3bn.\n\nThe EAD noted that inflows of foreign economic assistance dropped by 8.7pc to $6.89bn, largely due to delays in the IMF programme, which caused many commercial lenders to remain cautious. In comparison, inflows during the same period last year totalled about $9bn, including IMF funds.\n\nIn May alone, the EAD reported inflows of $797m, up from $576m in April, $555m in March, $237m in February, and $830m in January.\n\nOf the $6.89bn received, around $3.9bn was allocated for budgetary support or programme loans, while $2.98bn was directed toward project financing. During the same period last year, project aid stood at $2.56bn and programme loans at $4.99bn.\n\nMultilateral lenders contributed $3.37bn in the first 11 months of 2024-25, compared to $3.14bn last year. Bilateral disbursements declined sharply to $487m, down 45pc from $889m in the same period last year.\n\nThe EAD reported receiving approximately $903m from foreign commercial lenders based in the UAE, indicating a slight rebound from last year when commercial financing had nearly dried up. However, this is well short of the $3.8bn target set for the year, reflecting the continued impact of the delayed IMF programme, challenging economic conditions, and associated credit rating concerns.\n\nThe government had also aimed to raise $1bn through international bonds and projected $9bn in inflows from China and Saudi Arabia, including a $5bn time deposit from Saudi Arabia and $4bn in SAFE deposits from China. These funds are vital to bridging Pakistan’s external financing gap under the IMF programme.\n\nIn addition, Pakistan received $1.77bn from overseas Pakistanis via Naya Pakistan Certificates, up from $1.05bn in the same period last year. The Asian Development Bank disbursed $1.39bn during the period, up from $766m a year earlier, while the World Bank contributed $1.23bn.\n\nPublished in Dawn, June 21th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:21:52.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918605/pakistan-gets-20bn-in-external-assistance",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:29:51.000Z"
}
