{
  "title": "Chief Justice Afridi, Saudi envoy discuss judicial ties - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Saudi Arabia’s ambassador to Pakistan, Nawaf bin Saeed Ahmad Al-Malkiy, called on Chief Justice of Pakistan (CJP) Yahya Afridi on Friday to discuss avenues for strengthening bilateral cooperation in the field of justice.\n\nThe chief justice warmly welcomed the ambassador, expressing appreciation for what he termed the “longstanding, historic, and fraternal ties between the two countries, rooted in shared faith and mutual respect”.\n\nDuring the meeting, emphasis was laid on expanding judicial collaboration under the framework of Saudi Arabia’s Vision 2030, which includes the modernisation and reform of the Kingdom’s judicial system.\n\nIt was noted that Pakis­tan holds Saudi Arabia in high esteem and values the opportunity to learn from each other’s judicial systems and experiences.\n\nBoth sides agreed that “meaningful collaboration through exchange programs and partnerships between judicial academies can significantly enhance capacity building and promote shared learning”.\n\nJoint training initiatives were also discussed to equip judicial officers and legal professionals with modern tools and comparative legal perspectives.\n\nThe discussion further covered areas such as the modernisation of judicial processes, the establishment of specialised commercial and labour courts, collaborative research in Islamic jurisprudence, and comparative legal studies focusing on interfaith dialogue.\n\nThe possibility of jurisprudential dialogue on the­­matic legal areas, reg­i­onal judicial engagement, and hosting a Regional Judicial Conf­ere­­nce also featured prominently.\n\nCJP Afridi reaffirmed Pakistan’s commitment to “fostering closer institutional linkages with the Saudi judiciary” and underscored “the importance of shared legal values in promoting regional stability, justice, and the rule of law.\n\nPublished in Dawn, June 21th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:22:03.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918598/chief-justice-afridi-saudi-envoy-discuss-judicial-ties",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:29:44.000Z"
}
