{
  "title": "Shikarpur DSP, three SHOs, constables booked for house robberies - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Shikarpur sessions judge on Friday summoned head muharrars along with FIR registers to the court and had them lodge cases against a DSP, three SHOs and IT in-charge of district police on charges of committing house robberies.\n\nThe court had ordered registration of cases against the police officials after receiving complaints from public but the police stations concerned had been dragging their feet over the FIRs for over a month. Finally, the judge took the extraordinary step to have the cases filed in his presence.\n\nShikarpur SSP and his PRO did not respond to Dawn’s queries when this reporter contacted them to get their comment.\n\nA case was lodged on Ms Irshad Lehar’s complaint against Khanpur DSP Rana Nasrullah, Khanpur SHO Tufail Ahmadani, New Faujdari SHO Akhtar Abro, District Police IT Branch In-charge Saifullah Chandio, head constable Abdullah Shah and others under sections 395, 365, 427, 454, 148, 149, and 220 of the PPC on charges of committing house robbery.\n\nHead muharrars summoned to court to write FIRs against police officials\n\nThe complainant stated in the FIR that about 15 to 20 persons, including the nominated police officials, arrived in her locality on police mobile vans and motorcycles, barged into her home violating the sanctity of chador and char deewari, damaged property, and robbed the family of Rs1,350,000 cash, three tolas of gold, a licensed rifle with 60 bullets, an ATM card, a checkbook, various documents and men’s and women’s clothing.\n\nA similar case was registered at Garhi Yaseen police station on the judge’s intervention in which Deen Muhammad Eisani accused SHO Hidayatullah Nandwani, his son Imran Nandwani and other police officials of forcing into his house and robbing the inmates of their valuable belongings.\n\nShikarpur police had been dragging their feet on registering cases against their colleagues despite having received the court’s orders for almost a month.\n\nMs Irshad had been raising voice at different platforms in the district against police failure to register her case and finally moved the court for justice.\n\nAs the judge received similar complaints from others and police failure to enforce court’s earlier orders, the judge summoned the head muharrirs of the police stations concerned along with the FIR registers to the court, and had them lodge cases against the accused police officials in his presence.\n\nPublished in Dawn, June 21th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:21:39.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918579/shikarpur-dsp-three-shos-constables-booked-for-house-robberies",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:30:06.000Z"
}
