{
  "title": "EU imposes measures to curb ethanol imports from Pakistan - Business - DAWN.COM",
  "author": null,
  "content": "PARIS: The European Commission has ended tariff preferences for non-fuel ethanol imports from Pakistan, answering EU ethanol makers’ calls that a surge in cheap imports from the Asian country was pressuring prices and disturbing markets.\n\nLast year, ethanol imports from Pakistan accounted for more than a quarter of all non-fuel ethanol imports, making Pakistan the largest source of imports to the EU, the Commission said in its decision published in the EU’s Official Journal on Friday.\n\nThe rise in total ethanol imports has been lasting for several years with EU customs data showing imports of non-fuel ethanol into the EU nearly doubling between 2021 and 2024 to reach 726,000 tonnes in 2024, from about 376,000 tons in 2021, it said.\n\nOf this, Pakistani ethanol imports jumped by almost 300 per cent to 393,590 tonnes between 2021 and 2022 and were still 244pc above 2021 imports in 2023.\n\nMeanwhile EU non-fuel ethanol output dropped. Last year it was 8pc lower than in 2021, it said.\n\nThe data and information available showed a coincidence in time between the evolution of imports from Pakistan and the serious disturbance to Union markets, the Commission said.\n\n“The Commission considers that there is evidence of a serious disturbance in the EU market for non-fuel ethanol, characterised by a significant increase in imports at significantly lower prices compared to EU producers and a decline in production,” it said.\n\nEU ethanol makers welcomed the move, set to last two years, although they had hoped for three-year duration and said the fact it did not include ethanol used in fuel raised concerns over potential circumvention.\n\nPublished in Dawn, June 21th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:41:25.001Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918600/eu-imposes-measures-to-curb-ethanol-imports-from-pakistan",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:29:51.000Z"
}
