{
  "title": "Canal trees felling can’t be allowed for Yellow Train metro line, declares LHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court (LHC) says that felling of the trees on the Canal Road cannot be allowed for Yellow Train or any other development project.\n\nJustice Shahid Karim on Friday was hearing multiple petitions on environmental issues, when a member of a court-formed judicial commission stated that the government was planning to launch a Yellow Train Line Electric Transit project along the canal, which might involve felling trees.\n\nAt this, the judge remarked that the court would not allow any tree-felling on the Canal Road.\n\n“In Lahore, the beauty of trees is only preserved along the canal,” the judge added.\n\nHe observed that the newly recruited force of the environment department was not being seen in the field and the vehicles emitting smoke were visible on the roads but the force was missing. He sought a report on the deployment of the environment force for prevention of smog and environmental pollution.\n\nAdvocate Mian Irfan Akram, the counsel for the Water and Sanitation Agency (Wasa), informed the court that water meters would soon be installed in Lahore. Presenting a sample of the meter before the court, he said that in the first phase, water meters would be installed at commercial sites. He said the excavation work in Lahore would be completed by the end of July.\n\nThe judge adjourned proceedings till June 27.\n\nTOLLINTON MARKET: Justice Shahid Karim sought recommendations from the judicial commission on the relocation of Tollinton Market outside the city.\n\nAn activist, Onaiz Asif, had filed a petition for shifting the market for pets and other animals outside the urban area. His counsel, Barrister Izzat Fatima, submitted her recommendations on the matter. She said that according to international standards, there should be a model market with the availability of veterinary staff.\n\nThe lawyer proposed that shops selling animals and birds should be open air and subject to regular inspection by the government. She said the Tollinton Market was located in a densely populated area and should be relocated outside the city.\n\nVerdict reserved: An anti-terrorism court on Friday reserved verdict on the bail petitions of former foreign minister Shah Mahmood Qureshi and former provincial minister Mian Mahmoodur Rashid in multiple cases of May 9 riots.\n\nATC-I Judge Manzer Ali Gill heard the bail petitions of the PTI leaders.\n\nAdvocate Rana Mudassar, the counsel for Mr Qureshi, argued that at the time of the May 9 incidents, the petitioner was not in Lahore but was in Karachi for his wife’s medical treatment. He also presented material evidence of the petitioner’s presence in Karachi.\n\nThe counsel stated that the allegation of conspiracy against Mr Qureshi regarding the May 9 attacks could not be proven. He said Mr Qureshi should be granted bail as many co-suspects in these cases had already been allowed bail.\n\nMr Qureshi had sought bail in two cases of attack on Shadman police station and burning police vehicles near the Jinnah House.\n\nThe judge also reserved the verdict on the bail plea of Mr Rashid in a case of burning police vehicles near the Jinnah House.\n\nPublished in Dawn, June 21th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:21:38.461Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918570/canal-trees-felling-cant-be-allowed-for-yellow-train-metro-line-declares-lhc",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:30:12.000Z"
}
