{
  "title": "Aviation regulator orders Air India to remove officials - World - DAWN.COM",
  "author": null,
  "content": "New Delhi’s civil aviation regulator has ordered Air India to remove three officials from their roles over “systemic failures”, according to a directive seen by AFP on Saturday, as the carrier comes under scrutiny after a deadly crash.\n\nThe instruction from the Directorate General of Civil Aviation (DGCA) did not detail whether it was linked to the June 12 crash in Ahmedabad, which killed all but one of the 242 people on board. At least 38 others on the ground were killed.\n\nThe DGCA directive noted that the airline’s voluntary disclosures “point to systemic failures in crew scheduling, compliance monitoring, and internal accountability”.\n\n“Of particular concern is the absence of strict disciplinary measures against key officials directly responsible for these operational lapses,” said the order, which was issued on Friday.\n\n“These officials have been involved in serious and repeated lapses,” it said.\n\nThe regulator has directed Air India to remove three officials named in the order “from all roles and responsibilities related to crew scheduling”, take disciplinary action, and report on steps taken within 10 days.\n\nFuture violations could also result in “licence suspension”.\n\nThe airline said on Saturday it had implemented the order.\n\n“Air India is committed to ensuring that there is total adherence to safety protocols and standard practices,” it said in a statement.\n\nInvestigators are attempting to find out what caused the airline’s London-bound plane to hurtle to the ground moments after takeoff in Ahmedabad.\n\nAir India said on Thursday that the Boeing 787-8 Dreamliner plane was “well-maintained” and that the pilots were accomplished flyers.\n\nThe cockpit voice recorder and the flight data recorder have been recovered from the crash site.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:21:33.579Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918724/aviation-regulator-orders-air-india-to-remove-officials",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T12:15:17.000Z"
}
