{
  "title": "Supreme Court reserved seats verdict ‘amended Constitution’: Justice Hilali - Pakistan - DAWN.COM",
  "author": null,
  "content": "• July 12 verdict extended three-day deadline to 15 days to allow independents to join party, remarks Justice Hilali\n• Bench ‘realised pressure endured by PTI members’, rectified situation, argues Salman Akram Raja\n\nISLAMABAD: The Supreme Court’s order in the reserved seats case amended the Constitution as it altered the constitutional deadline of three days for independent lawmakers to join a political party, Justice Musarrat Hilali has remarked.\n\nThe court’s order on July 12, 2024 — more than five months after the general elections on Feb 8 — allowed 41 PTI-backed independent lawmakers to confirm their political affiliation in 15 days.\n\nJustice Hilali made these remarks on Friday while hearing appeals filed against last year’s order.\n\nShe also asked Salman Akram Raja, who was representing PTI lawmaker Kanwal Shauzab, to comment on this constitutional amendment.\n\nMr Raja disapproved of the impression, saying the situation under which PTI contested last year’s elections was “something where the party had to swim through a river of fire and blood”.\n\nThe counsel explained the July 12 verdict did not extend the time period to 15 days from the statutory three days. Rather, it stated that these 41 out of 80 candidates should be considered to have been backed by PTI from the very beginning.\n\nThe verdict realised the “pressures endured by PTI members” and the court decided the only way to rectify the situation was to follow the procedure prescribed under Section 66 of the Elections Rules, the counsel explained.\n\nThrough the judgement, 41 members were asked to notify through affidavits to which party they belonged within 15 days. However, the candidates were never asked to join PTI, the counsel argued.\n\nThe entire electoral process, Mr Raja emphasised, was a fundamental right exercised through articles 17(2) and 19 of the Constitution.\n\nJustice Ali Baqar Najafi, another bench member, asked Mr Raja whether PTI was claiming entitlement to reserved seats in parliament.\n\n“Do you think it is the right of any political party to claim reserved seats?” asked Justice Najafi.\n\nThe counsel retorted it was the right of the people to ensure that reserved seats were allocated as per the proportionate representation system.\n\nThe Constitution mandated parliament to be filled with representatives chosen by the people of Pakistan, the counsel contended.\n\n“If elections were not fair, then why has the Supreme Court not struck them down?” questioned Justice Najafi.\n\nThe counsel said it could have been done so but the Supreme Court exercised restraint.\n\nOn constitutional deviations, Mr Raja said, it was for the first time in history a — major — political party was de-legitimised by not allowing it to contest the election.\n\nTherefore, the majority of judges in the July 12 judgment recognised that constitutional deviation was committed on account of effective de-recognition of PTI as a political party, which resulted in certain consequences.\n\nMr Raja defended PTI members, saying that to blame them for committing mistakes by identifying themselves as independent candidates and then deliberately joining the Sunni Ittehad Council (SIC) gives and impression that everything else was alright.\n\nHe added that 11 out of 13 judges on the bench that heard the case last year “ignored fictitious facts” produced before the court that PTI committed errors by joining SIC and contesting elections as independents.\n\nAll but two judges embraced the reality that PTI as a party contested and in fact won seats during the general election and therefore was entitled to reserved seats of women and non Muslims, the counsel emphasised.\n\nWhen asked by Justice Jamal Mandokhail whether the Election Commission’s decision to allocate reser­ved seats to the Baloch­is­tan Awami Party after the 2018 general elections was right or wrong, Mr Raja replied that in his view, the decision could not be called “wrong”.\n\nThe members who contested the election as independents should not be forced to join a party that they did not intend to join before the election, said Mr Raja.\n\nPublished in Dawn, June 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:41:05.898Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918557/supreme-court-reserved-seats-verdict-amended-constitution-justice-hilali",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:29:32.000Z"
}
