{
  "title": "PSX flat as regional tensions erase early gains - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) ended Thursday’s session with a slight gain, as the benchmark KSE-100 index edged up by 21 points to close at 120,023 — a marginal increase that reflected a day of early optimism followed by late selling pressure.\n\nAccording to Topline Securities Ltd, the index opened strong and remained in positive territory for most of the session, supported by reports that the Trump administration intends to exercise restraint in the ongoing Israel-Iran conflict, with a decision on potential US action expected within two weeks.\n\nHowever, continued geopolitical uncertainty led to profit-taking in the final hour, pulling the market back to near-flat levels.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, described the session as “another volatile one,” highlighting that the 120,000-point level continues to serve as a psychological support for investors. “The market showed early strength but lacked follow-through due to concerns over geopolitical tensions and the weekend session,” he noted.\n\nThe biggest positive contributions came from Hub Power, Systems Ltd, United Bank, Oil and Gas Development Company, Maple Leaf Cement, and Pakistan Petroleum, which collectively added 168 points to the index. In contrast, Packages Ltd, TRG Pakistan, Fauji Fertiliser, Pakistan Services, Engro Fertiliser, and MCB Bank together erased 180 points.\n\nOverall, market activity remained subdued. Trading volumes declined by 30.25pc to 415.2 million shares, while the total traded value fell 23.43pc to Rs15.5 billion. Worldcall Telecom Ltd led the volume chart with 42.8 million shares traded.\n\nDespite the muted close, analysts view the 120,000-point level as a key support, with market sentiment expected to remain sensitive to geopolitical developments in the coming days.\n\nPublished in Dawn, June 21th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6855e6fa5a886.gif",
  "retrievedAt": "2025-10-12T03:41:07.047Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918599/psx-flat-as-regional-tensions-erase-early-gains",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:29:51.000Z"
}
