{
  "title": "Bangladesh’s lead nears 200 in first Sri Lanka Test - Sport - DAWN.COM",
  "author": null,
  "content": "GALLE: Bangladesh edged ahead of Sri Lanka on day four of the first Test in Galle on Friday, extending their lead to 187 runs with seven wickets in hand.\n\nThe visitors finished at 177-3 after a strong partnership of 68 between opener Shadman Islam and skipper Najmul Hossain Shanto.\n\nAll-rounder Milan Rathnayake dismissed Shadman for 76 but veteran campaigner Mushfiqur Rahim, fresh off a first-innings century, joined his captain to steady the innings.\n\nThe duo built an unbroken 49-run partnership for the fourth wicket to put their side in the driver’s seat heading into the final day.\n\nBangladesh off-spinner Nayeem Hasan earlier took five wickets to halt Sri Lanka’s first-innings charge, with the visitors dismissed for 485 after lunch to trail by 10 runs.\n\nNayeem was well supported by Hasan Mahmud, who finished with 3-74.\n\nSri Lanka looked set for a useful lead after the first session, reaching 465-6 with Kamindu Mendis and Rathnayake stitching together a gritty 84-run stand for the seventh wicket.\n\nHowever, Sri Lanka then surrendered the momentum with a lower-order collapse, losing their last four wickets for 15 runs.\n\nRathnayake had shown commendable defiance for his 39 but was undone by an inside edge onto the stumps off Mahmud.\n\nKamindu followed in the next over with Sri Lanka’s score unchanged, falling to Nayeem’s off-spin as the ball kicked off the surface and caught the left-hander by surprise.\n\nHis composed 87 included eight fours and a six but he fell with a third hundred against Bangladesh within sight.\n\nNayeem said he “really enjoyed” Kamindu’s wicket.\n\n“Very happy with that ball that got him,” he said.\n\nNayeem also removed debutant Tharindu Rathnayake for a duck with another sharp off-break that went through the gate as Sri Lanka lost three wickets for just one run in 10 deliveries.\n\nHe then bowled Asitha Fernando (4) to close out Sri Lanka’s innings.\n\nThe last Test draw at the Galle cricket ground was between the same two sides in 2013.—AFP\n\n“I think the game is open for both sides,” Kamindu said.\n\n“If we are able to get three wickets early, then we are up for a challenge.”\n\nSCOREBOARD\n\nBANGLADESH (1st Innings) 495\n\nSRI LANKA (1st Innings):\n\nP. Nissanka b Hasan 187\n\nL. Udara c&b Taijul 29\n\nD. Chandimal c Shadman b Nayeem 54\n\nA. Mathews c Litton b Mominul 39\n\nKD. Mendis c Litton b Nayeem 87\n\nD. de Silva c Litton b Nayeem 19\n\nK. Mendis c Litton b Hasan 5\n\nM. Rathnayake b Hasan 39\n\nT. Ratnayake b Nayeem 0\n\nP. Jayasuriya not out 11\n\nA. Fernando b Nayeem 4\n\nEXTRAS (B-2, LB-7, NB-2) 11\n\nTOTAL (all out, 131.2 overs) 485\n\nFALL OF WICKETS: 1-47 (Udara), 2-204 (Chandimal), 3-293 (Mathews), 4-331 (Nissanka), 5-377 (de Silva), 6-386 (K. Mendis), 7-470 (M. Rathnayake), 8-470 (KD. Mendis), 9-471 (T. Ratnayake)\n\nBOWLING: Hasan 21-4-74-3, Nahid 19-0-97-0 (2nb), Taijul 41-3-156-1, Nayeem 43.2-4-121-5, Mominul 7-0-28-1\n\nBANGLADESH (2nd Innings):\n\nShadman Islam lbw M. Rathnayake 76\n\nAnamul Haque c K. Mendis b Jayasuriya 4\n\nMominul Haque c Udara b T. Ratnayake 14\n\nNajmul Hossain not out 56\n\nMushfiqur Rahim not out 22\n\nEXTRAS (B-4, LB-1) 5\n\nTOTAL (for three wickets, 57 overs) 177\n\nFALL OF WICKETS: 1-24 (Anamul), 2-60 (Anamul), 3-128 (Shadman)\n\nSTILL TO BAT: Litton Das, Jaker Ali, Taijul Islam, Nayeem Hasan, Hasan Mahmud, Nahid Rana\n\nBOWLING: A. Fernando 8-0-31-0, Jayasuriya 17-1-48-1, T. Ratnayake 14-0-51-1, M. Rathnayake 9-4-13-1, D. de Silva 8-0-27-0, K.D. Mendis 1-0-2-0\n\nPublished in Dawn, June 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6855fb71cb8db.gif",
  "retrievedAt": "2025-08-20T04:21:37.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918643/bangladeshs-lead-nears-200-in-first-sri-lanka-test",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:37:52.000Z"
}
