{
  "title": "Govt appoints Naveed Asghar as acting Wapda chairman - Pakistan - DAWN.COM",
  "author": null,
  "content": "Naveed Asghar Chaudhry has been appointed to the position of acting chairman of the Water and Power Development Authority (Wapda), according to a notification issued by the Ministry of Water Resources on Saturday.\n\nThe appointment of Asghar follows the resignation of retired Lieutenant General Sajjad Ghani earlier in the day. Ghani served in the role for almost three years before stepping down.\n\nAsghar previously served as the interim Wapda chairman in 2022 after retired Lt Gen Muzammil Hussain resigned due to “personal reasons”. He then passed the role to retired Lt Gen Ghani three months later.\n\nHe will now serve again as Wapda chairman “for a period of three months or until the appointment of [a] regular chairman […] with immediate effect and until further orders”, the ministry said.\n\nAsghar will take on the position in addition to his current role as Wapda’s Member (Finance) under the Water Resources Division.\n\nAsghar previously accompanied Ghani as he visited the sites of major projects during his time as chairman, such as the construction of Mohmand Dam on the River Swat.\n\nIn May, Ghani visited the Neelum-Jhelum Hydropower Project — located approximately 41km from Muzaffarabad — after the dam site was damaged in Indian attacks a day earlier.\n\nHe strongly condemned the attack, saying, “International laws, including the Geneva Convention, do not allow attacking water structures even during a full-scale war.”\n\nAlso in May, he persuaded the participants of a jirga to call off a two-week sit-in, assuring them that Prime Minister Shehbaz Sharif had constituted a committee to address the concerns of families whose land had been acquired for the Dasu hydropower project.\n\nDasu residents also staged protests in February and April this year, presenting various demands, including the immediate release of payments under a relocation package\n\nIn April, the Public Accounts Committee (PAC) highlighted glaring inefficiencies and massive financial mismanagement in key national hydropower projects, in particular the Dasu Hydropower Project and the Neelum-Jhelum Hydropower Project.\n\nThe next month, Ghani claimed that a number of key targets in the Greater Karachi Bulk Water Supply Scheme, better known as the K-IV Project, had been achieved.\n\nUnderlining the importance of the K-IV Project for Karachi, which was formally launched in 2011, he had directed the project team to accelerate construction activities to meet the deadlines.\n\nHowever, the project immediately faced a new setback this month, as the federal government has allocated only Rs3.2 billion in the budget against the required amount of Rs40bn for the scheme, sparking fears that the city may have to wait for “another 10 years” or more for the completion of the plan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/21161733632f264.jpg",
  "retrievedAt": "2025-08-20T04:21:32.202Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918704/govt-appoints-naveed-asghar-as-acting-wapda-chairman",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T11:36:11.000Z"
}
