{
  "title": "Ex-PML-N senator sent on judicial remand in PTI leader’s murder case - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Former Pakistan Muslim League-Nawaz (PML-N) senator Chaudhry Tanveer Khan, who had been in police remand for two days, was produced before a judicial magistrate on Friday as police sought an extension of his physical remand.\n\nHowever, the former senator was sent to judicial jail for 14 days and will be produced before the court again on July 4, 2025, after the completion of his judicial remand.\n\nChaudhry Tanveer has been charged in the murder case of former parliamentary secretary and Pakistan Tehreek-i-Insaf (PTI) member of the provincial assembly, Adnan Chaudhry.\n\nHe was taken into custody on Tuesday after his counsel informed Justice Sadaqat Ali Khan of the Lahore High Court’s Rawalpindi bench that they were withdrawing the pre-arrest bail application and had decided to join the police investigation in the case.\n\nFollowing the withdrawal of the bail petition, the police took Chaudhry Tanveer into custody in accordance with the bail cancellation order issued by the subordinate court.\n\nHe was later produced before a local court, which granted a two-day physical remand.\n\nOn Friday, after the completion of the physical remand, Tanveer Khan was presented before Judicial Magistrate Ahsan Raza amid tight security, as police sought further remand.\n\nThe counsel for the accused opposed the police’s request, arguing that his client had already joined the investigation and recorded his statement with the investigating officer.\n\nPublished in Dawn, June 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/21133924b405fc8.png",
  "retrievedAt": "2025-08-20T04:21:38.495Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918531/ex-pml-n-senator-sent-on-judicial-remand-in-pti-leaders-murder-case",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:30:18.000Z"
}
