{
  "title": "Peshawar BRT to get 50 more buses as cabinet gives go-ahead - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa cabinet on Friday approved the procurement of 50 more “identical diesel-hybrid” buses for the Peshawar Bus Rapid Transit (BRT) at an estimated cost of Rs3.2 billion.\n\nThe cabinet met with Chief Minister Ali Amin Khan Gandapur in the chair. The other participants included cabinet members, chief secretary, additional chief secretaries, administrative secretaries, and other senior officials.\n\nTransPeshawar, the operator of the mass transit in the provincial capital, had initially procured 220 buses, according to an official statement.\n\nTwenty-four buses were added to the fleet in 2022, taking their overall tally to 244.\n\nMeeting also approves termination notices for Perra’s contractual employees\n\nHowever, the procurement of more buses has become essential due to the growing public demand and the expansion of operational routes from six to eight, including the recent addition of DR-11, DR-13 and DR-14, according to the statement.\n\nAlso, the cabinet approved the merger of ADP scheme campuses of the Model Institute for State Children Zamung Kor in Swat, Dera Ismail Khan and Abbottabad and a girls campus in Peshawar with the already functional autonomous body of the Zamung Kor Model Institute for State Children, Peshawar.\n\nCurrently, 600 children are enrolled at Peshawar’s institute and 425 students in the four ADP scheme campuses.\n\nThe forum approved the signing of an agreement between Pak-Qatar Asset Management as the 13th Asset Management Company under CP Fund Rules, 2022.\n\nAccording to the statement, the provincial government, in order to address the issues of unsustainable pension expenses, has initiated pension reforms in 2015, which included the transition from an unfunded pension system to a funded pension scheme, sothe Contributory Provident Fund was introduced.\n\nUnder the new system, contributions from both employees and the government are invested in the market through professional asset management companies registered with the Securities and Exchange Commission of Pakistan.\n\nIn Jan 2022, the provincial government had begun making agreements with asset management companies with the SECP’s voluntary pension scheme licences under the Contributory Provident Fund Rules, 2022.Consequently, 12 companies entered into agreement with the government to manage the Pension Fund.\n\nThe cabinet also approved the draft amendments to the KP Right to Public Services Act, 2014, and amendment to Sub-Rule 7 of Rule 11 of the KP Public Private Partnership (Selection of Private Partner) Rules, 2021.\n\nThe rule pertains to the response time of bidders and provides a time frame of sixty days for a bidder to respond to a bid. As per the amendment the RFP shall be disseminated amongst the pre-qualified or shortlisted bidders, as the case may be, with a minimum response time to thirty days.\n\nIt constituted a committee to deliberate on Khyber Pakhtunkhwa Public Lands Utilisation and Management Bill, 2025, and present recommendations to the cabinet.\n\nThe cabinet approved the KP Non-Governmental Organisation (working in the field of human rights) Rules, 2025.\n\nIt also approved a non-ADP scheme at a cost of Rs124.016 million for the current financial year to resume payment of salaries to contractual staff of Provincial Earthquake Reconstruction and Rehabilitation Authority.\n\nThe meeting also allowed the issuance of termination notices to the contractual employees of the Perra from July 1, 2025, asking the DG of the authority to sort out the pending issues.\n\nIt approved an increase in the cost of the construction of a Category-C hospital in Balakot, Mansehra, from Rs575 million to Rs924.596 million, rehabilitation of all RHCs across Khyber Pakhtunkhwa and conversion of 50 RHCs into 24/7 facilities from Rs934.322 million to Rs 1.707 billion, and strengthening of all BHUs across the province and conversion of 200 BHUs in 24/7 skilled birth attendants facilities from Rs1.65 billion to Rs2.961 billion.\n\nThe cabinet also approved a grant of Rs.346 million for the Peshawar Institute of Cardiology for acquiring advanced equipment, Rs1.5 billion for the repair and maintenance of transformers in various districts and a supplementary grant of Rs1.04 billion for the “book adjustment” of Pesco electricity dues and liabilities against TMAs and WSSCs for 2024-25.\n\nIt also allowed Rs400 million funds for the maintenance and repair by the irrigation department during the current financial year.\n\nThe cabinet approved the inclusion of the Makniyal area in the Urban Area Development Authority of Haripur and formed a committee to examine mechanisms to check illegal cutting of trees in Arandu Gol forests in Chitral and Upper Kohistan forest divisions.\n\nPublished in Dawn, June 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:21:36.889Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918524/peshawar-brt-to-get-50-more-buses-as-cabinet-gives-go-ahead",
  "dateList": "2025-06-21",
  "date_published": "2025-06-21T00:30:24.000Z"
}
