{
  "title": "PMDC extends BDS program’s tenure",
  "link": "https://www.app.com.pk/national/pmdc-extends-bds-programs-tenure/",
  "date_published": "2024-11-29T10:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP)::Pakistan Medical and Dental Council (PM&DC) has officially announced the extension of the Bachelor of Dental Surgery (BDS) program from four to five years.\nThe new policy will be implemented in the country from session 2024-2025.\nIn a statement, President PM&DC Prof.Dr.Rizwan Taj  highlighted the significant benefits of the change.\nHe explained that the decision was made keeping in view the challenges faced by BDS graduates from Pakistan in securing training or jobs etc across the globe where 5 five-year BDS transcript is required,\nHe said that the PM&DC council has decided that the BDS course or structure in Pakistan will be a five years program including 5th year as clerkship year followed by one year structured house job or foundation year and internship.\nHe said that the additional year will allow students to gain a deeper theoretical understanding of dental sciences, improving the academic foundation required for excellence in the field.\nWith extended clinical training, students will be better prepared to handle real-world dental challenges with competence and confidence.\nThis initiative will bring Pakistan’s dental education system in line with global standards, facilitating greater international recognition of Pakistani graduates.\nThis enhancement will equip graduates with advanced skills and knowledge to strengthen their competitiveness in both local and international healthcare sectors.\nHe said that comprehensive curriculum guidelines have been finalized by the council and will soon be shared with dental colleges.\nThe PMDC is diligently collaborating with institutions nationwide to ensure the seamless implementation of the revised structure.\nThis reform is a critical step towards cultivating highly skilled dental professionals capable of addressing the evolving demands of healthcare in Pakistan and beyond.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:43:53.576Z"
}
