{
  "title": "JMC to set new standards of healthcare, research in capital: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/jmc-to-set-new-standards-of-healthcare-research-in-capital-ahsan-iqbal/",
  "date_published": "2024-11-29T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP):Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal has chaired a meeting to review progress on the Jinnah Medical Complex (JMC) project, which would set new standards of healthcare and research in the Federal Capital.\nKey officials, including Coordinator to the Prime Minister on Health Dr Malik Mukhtar Ahmad Bharath, Secretary National Health Services Prof. Khalid Saeed Akhtar, CDA chairman and representatives from Bostan Consultants, attended the meeting, a news release said on Friday.\nA detailed presentation on the project’s master plan was given by Bostan Consultants, followed by a thorough discussion.\nThe committee approved the plan, and Ahsan Iqbal proposed renaming the project as the Jinnah Medical Research Center to reflect its focus on advanced medical research and healthcare.\nThe minister emphasized the importance of modern designs, green building principles, and combining traditional construction methods with advanced techniques like precast structures to ensure top-quality construction.\nThe Pakistan Kidney and Liver Institute (PKLI) will finalize the project’s design by February 2025, with necessary approvals expected by April 2025.\nA special Project Management Unit (PMU) will oversee the work, under a dedicated project director and supported by a skilled team. A specialized consultant will be hired to ensure smooth and timely completion of the project.\nTo make the facility more comprehensive, the minister directed the inclusion of sports and recreational facilities for medical students, such as a gymnasium, sports ground and tennis court. Separate entrances for emergency patients and ambulances will also enhance the facility’s efficiency.\nAhsan Iqbal said the Jinnah Medical Research Center will be a groundbreaking project, focusing on advanced medical education and research.\n“It will set new standards in healthcare and infrastructure, benefiting the people of Pakistan and aligning with the government’s vision to improve healthcare and education for a better future,” he remarked.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:44:01.375Z"
}
