{
  "title": "PTI’s protest fervor calms down: Talal",
  "link": "https://www.app.com.pk/national/ptis-protest-fervor-calms-down-talal/",
  "date_published": "2024-11-28T19:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP):Pakistan Muslim League-Nawaz (PML-N) leader Talal Chaudhry on Thursday expressed hope that the Pakistan Tehreek-e-Insaf’s (PTI) fervor for repeated calls for protests have finally subsided.\nHe made these remarks during a news conference, where he criticized the PTI’s recent protests.\nHe stated that Bushra Bibi had claimed that they would not leave D-Chowk without the PTI founder.\nHowever, she fled the protest scene through a narrow alley, leaving party workers behind. Critics have called her actions cowardly, questioning how she could abandon supporters in their time of need, he added.\nTalal Chaudhry remarked that Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur had promised to take a bullet to the chest, but instead, he fled. A true leader leads from the front, ready to face the danger, he added.\nTalal stated that this isn’t the first time PTI leaders have abandoned their supporters; it had happened multiple times and added that leaders don’t hide in bulletproof vehicles.\nHe accused PTI supporters of trying to disturb peace in Islamabad, who were armed with weapons and tear gas shells, and accompanied by a large number of Afghan nationals.\nHe argued that such a violent protest could only be orchestrated by a trained force, pointing to videos that showed Afghan citizens firing tear gas shells.\nTalal Chaudhry accused Bushra Bibi of instigating armed individuals against the state.\nHe said that casualties did occur, but that were of Rangers and police personnel who were martyred while fulfilling their duties.\nHe stated that this was yet another attempt at rebellion, similar to the one on May 9. He pointed out that not a single person from Punjab, Sindh, or Balochistan came to participate in the protest.\nThe PTI used provincial resources to attack the Capital, but no one ventures into Kurram. The PTI launched an assault on the federation, and as long as its founder continues to portray himself as a victim, he will keep playing the victim card, he added.\nTalal Chaudhry expressed hope that Gandapur’s agitation had calmed down after the final call.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:44:07.406Z"
}
