{
  "title": "PM for efforts to quash PTI’s inimical designs of invading Islamabad",
  "link": "https://www.app.com.pk/national/pm-for-efforts-to-quash-ptis-inimical-designs-of-invading-islamabad/",
  "date_published": "2024-11-29T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday urged the country’s civil and military leadership to formulate a strategy to avert the repeat of PTI’s invasion of Islamabad aimed at sabotaging the hard earned peace and macroeconomic stability.\n“Pakistan’s image has been tarnished all over. This has been the third to fourth invasion against the federal capital during the past eight months by the PTI. There was no concept of such unholy acts and designs before 2014. It started in 2014 with the 126-day long sit-in that damaged the economy and country’s image,” the prime minister said addressing a high level meeting he chaired on the law and order situation in the country.\nThe meeting was attended by members of the federal cabinet, Punjab Chief Minister Maryam Nawaz Sharif, Chief of the Army Staff General Syed Asim Munir, and other senior government officers and law enforcement agencies.\nCalling Pakistan Tehreek-e-Insaf as “Tehreek-e-Takhreeb (Insurgency Movement), the prime minister censured its leadership for running over the federal capital repeatedly to sabotage the hard earned peace, macroeconomic stability and revival of hefty foreign capital investments into the country.\n“The country’s economy again witnessed a major blow as according to a guardedly estimate such protests cause Rs190 billion per day loss to the national economy. The impact on the exports, imports, production, services, private businesses, loss of public and private offices is huge,” Prime Minister Shehbaz said.\nHe reiterated that a mob from Khyber Pakhtunkhwa (KP) invaded the federal capital with all the public resources of KP provincial government that unleashed gunshots on the law enforcement agencies, injured people and damaged infrastructure in the capital.\n“If the country enemies are hell bent on sabotaging the country’s peace and prosperity; are we going to lie down like a lame duck and we should allow them to run over everything? This should be the last thing that we should imagine in our remotest imagination. We should make all out efforts to quash such inimical designs intended to harm the nation as these opportunities do not come again,” the prime minister said.\nThe PTI-led regime in KP, he said had no regard for declining inflation from 32% to below 7%, policy rate from 22%-15% and friendly nations interested in investing in Pakistan as the party just wanted to roll back everything.\n“Federal government’s senior leadership, COAS and his entire team are present here. Time and tide wait for none. It’s (PTI) not a political party but an abetment and a saboteurs and miscreants’ group that should be taken to task as per law.\nIt’s our national duty to expose them and, if not, history will judge us in a very bad light and posterity will not forgive us,” the prime minister said.\nCalling the KP a “beautiful” province with its people very brave, strong and patriots, he called for a focus on the development initiatives for them.\nHe said the recent killings in Parachinar city of KP was a clandestine move to damage country’s peace, but it was painful to see the KP government’s indifference to the situation.\nHe noted that the violence by PTI miscreants’ clique in Islamabad resulted in the martyrdoms of a police and four Rangers personnel with dozens of police officers and constables injured.\nThe prime minister repeated that the due to the PTI’s 126-day sit-in in 2014, the Chinese President’s visit was deferred and was rescheduled seven months later in April 2015, following myriads of efforts.\nThe prime minister also recalled the PTI’s attempts to sabotage the SCO conference hosted by Islamabad and undermine the Pakistan-Saudi brotherly relations by baseless propaganda by the party leadership.\nHe said PTI’s latest protest failed to impact the Belarusian President’s visit as the foreign dignitary successfully completed his three-day visit and also attended the luncheon reception hosted by Nawaz Sharif in Murree.\nMentioning his participation at GHQ in the funeral prayers of the Rangers’ personnel who were martyred while containing the saboteurs’ violence, the prime minister expressed gratitude to Interior Minister Mohsin Naqvi, interior secretary, IG Islamabad Police, and LEAs, as well as the chief ministers of Sindh and Punjab for their support to the federal government to cope with the violence.\nHighlighting the government’s achievements at the economic front, he said indicators were improving gradually and macroeconomic stability was being witnessed in the economy as the Pakistan Stock Exchange crossed its highest ever trading volume which was earlier achieved during Nawaz Sharif’s government.\nThe participants of the meeting also offered Fateha, led by the COAS, for the security personnel who embraced martyrdom during the PTI protest.",
  "retrievedAt": "2025-08-10T15:43:05.993Z"
}
