{
  "title": "Roundtable on governance of refugees in Pakistan, convened at ISSI",
  "author": null,
  "content": "ISLAMABAD, Apr 24 (APP):The Centre for Afghanistan, Middle East & Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI) organized a Round-Table discussion on the “Governance of Refugees in Pakistan: An Appraisal”, co-hosted by The BEYOND Project, Faculty of Law, University of Oslo, Norway.\nIntroductory remarks were given by Ambassador Sohail Mahmood, Director General, ISSI; Ms. Amina Khan, Director CAMEA moderated the session, said a press release.\nThe discussion was attended by policy makers, academics and practitioners.\nIn his remarks, Ambassador Sohail Mahmood underscored Pakistan’s more than four-decades-long commitment to hosting Afghan refugees, despite not being a signatory to the 1951 Refugee Convention. He noted that, historically, Pakistan had the distinction of handling the largest refugee case-load for the longest time.\nHe highlighted that Afghan refugees in Pakistan faced no barriers to education, healthcare, or business, with the country receiving limited international support and encountering challenges. Ambassador Sohail Mahmood also acknowledged the important role of civil society and NGOs, and called on the international community to recognise the contributions and challenges of host nations, as well as Pakistan’s consistent and principled stance.\nDuring the discussion, participants analysed Pakistan’s historical approach to the legal aspects of the refugees issue and in particular the country’s sustained generosity for over four decades in response to the continued flow of Afghan refugees.\nWhile the initial phase was marked by international support and solidarity, participants also reflected on the evolving challenges since then, including limited financial resources and reduced international support.\nThe discussion also touched on the complex regional environment, humanitarian considerations, strengthening legal frameworks, broad-based consultations, and the effects of measures for refugees return.\nThe importance of recognizing constraints and sensitivities of the host countries, understanding and supportive attitude of the international community and relevant international institutions, and forthcoming dispositions of countries of refugees’ origin was also emphasized.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:51:09.383Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/roundtable-on-governance-of-refugees-in-pakistan-convened-at-issi/",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T17:39:00.000Z"
}
