{
  "title": "New book Mard-e-Ahan Muhammad Nawaz Sharif launched",
  "author": null,
  "content": "ISLAMABAD, Apr 24 (APP):Eminent journalist Muhammad Nawaz Raza launched his latest book, Mard-e-Ahan Muhammad Nawaz Sharif, on Thursday at a distinguished gathering attended by prominent journalists, politicians, corporate leaders, and media professionals.\nThe event, chaired by Pakistan Muslim League-Nawaz (PML-N) chairman Raja Muhammad Zafar ul Haq, was organized by the Pakistan Federal Union of Journalists (Dastoor) and the Rawalpindi Islamabad Union of Journalists (Dastoor).\nAmong the prominent attendees were Lt. Gen (R) Abdul Qayyum, Federal Minister for Kashmir Affairs, Gilgit-Baltistan and SAFRON, Engineer Amir Muqam , Minister for Parliamentary Affairs Dr Tariq Fazal Chaudhry and several senior journalists and political figures.\nPML-N Chairman Raja Zafar ul Haq, praised Raza as an upright journalist with whom he shares a long-standing ideological connection.\nZafar ul Haq, offered insightful remarks on the book and its subject. He praised Raza’s meticulous research and compelling narrative, highlighting the book’s significance in documenting a crucial period in Pakistan’s political history.\nHe also shared his close ties with Nawaz Sharif and expressed his desire to write a book based on his experiences from visits to various countries. He congratulated Raza for authoring an excellent work.\nAuthor Muhammad Nawaz Raza shared his motivation for writing the book, emphasizing his aim to present a balanced and objective portrayal of Nawaz Sharif, who served the country as prime minister, chief minister, and provincial minister of Punjab.\nMinister for Parliamentary Affairs Dr. Tariq Fazal Chaidhry thanked Raja Zafar ul Haq and other participants at the launch of Muhammad Nawaz Raza’s book. He shared his close bond with Raza, describing it as a teacher-student relationship. Highlighting Raja Zafar ul Haq’s loyalty, he noted that Zafar joined the Muslim League in 1956 and never changed his party.\nDr. Tariq praised Nawaz Sharif as a historic figure known for his politics of ideology, adding that Nawaz never compromised on national interests and prioritized Pakistan’s development, especially in infrastructure. He acknowledged that Muhammad Nawaz Raza maintained journalistic integrity by offering both praise and criticism of Nawaz Sharif in his columns and book.\nCommenting on national security, he stated that Pakistan seeks peace but remains a victim of terrorism. He affirmed the nation’s resolve to defend itself and warned that any misadventure by India would be met with a strong response. He stressed that the nation stands united behind its armed forces.\nAt the very outset President of RIUJ (Dastoor), Rana Kausar, warmly welcomed the distinguished guests.\nTariq Sumair, brother of Muhammad Nawaz Raza, remarked that Raza had dedicated his life to journalism rather than family. He praised Nawaz Sharif as one of the country’s truly patriotic politicians.\nColumnist Tayyabia Zia shared that she conducted Nawaz Sharif’s first interview in 2001 and later wrote a feature on the entire Sharif family. She urged people to recognize Nawaz Sharif’s contributions, highlighting his role in developing Pakistan’s infrastructure.\nProf Tahir Naeem emphasized that Nawaz Sharif should be entrusted with the responsibility to help address the serious challenges facing the federation.\nSSP (retd) Jamil Hashmi, Journalist Hanif Khalid, Lt Gen (retd) Abdul Qayyum, Khalid Azeem Chaudhry, Jabbar Mirza, Zafar Bakhtawari, also spoke.\nAttendees at the launch event engaged in lively discussions on the book’s content, reflecting on Nawaz Sharif’s impact on Pakistan’s political landscape. They highlighted Nawaz Sharif’s key role in the country’s development, noting his significant contributions to national progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:51:32.792Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/new-book-mard-e-ahan-muhammad-nawaz-sharif-launched/",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T16:18:00.000Z"
}
