{
  "title": "Govt to support provinces in tackling climate change: Mussadiq Malik",
  "author": null,
  "content": "KARACHI, Apr 24 (APP):Federal Minister for Climate Change Mussadiq Malik said on Thursday that the federal government will support provinces in their efforts to address environmental and climate challenges.\nSpeaking to the media after a meeting with Sindh’s Climate Change Minister Dost Ali Rahimoon at his office, Mussadiq Malik explained that climate change is a devolved subject, so the provinces will lead while the federal government will help coordinate and build their capacity.\nHe noted that the world’s top ten polluting countries are responsible for most of the carbon emissions, while countries like Pakistan suffer the consequences.\nMussadiq Malik pointed out that large portions of global green funds are going to countries that are major carbon emitters themselves.\nHe added that during the meeting, it was decided to highlight Sindh’s urgent climate-related projects at the international level.\nMussadiq Malik also mentioned that Pakistan emitted 40% less carbon than the allowed limit, and the Prime Minister has instructed him to work closely with all provinces and provide full support for climate resilience.\nHe stressed that although Pakistan is affected by others’ emissions, the country won’t just focus on the problem but also work on solutions. He said that environmental projects will be organized into clusters, and the youth’s skills will be used effectively.\nSindh Minister Dost Ali Rahimoon also expressed gratitude to the federal government for its coordination and agreed that Pakistan is among the worst affected by climate change due to emissions from other nations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:52:03.394Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-to-support-provinces-in-tackling-climate-change-mussadiq-malik/",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T14:04:00.000Z"
}
