{
  "title": "No legal justification for Indian unilateral suspension of Indus Waters Treaty : Atta Tarar",
  "author": null,
  "content": "ISLAMABAD, Apr 24 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Thursday said the unilateral action of India to suspend the Indus Water Treaty had no legal justification, which denotes its disregard and ignorance of trans-boundary accord.\n“The statement from India about the suspension of Indus Water Treaty is childish and highly non-serious, which shows that they neither read the Indus Water Treaty nor ever tried to fathom its legal standing,” the minister said while addressing a news conference along with Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, Defence Minister Khawaja Muhammad Asif, Law Minister Azam Nazeer Tarar, and the Attorney General of Pakistan.\nHe said Pakistan had given an appropriate response to India’s hollow and shaky threats.\nHe said bilateral trade with India was out of the question, and through any third country, it has also been suspended today, which will inflict losses on the Indian economy.\nHe said that Pakistan’s airspace had been closed to India, which would eventually cause millions of dollars in losses to Indian airlines.\nThe Minister remarked that India could only resort to hurling hollow threats, and it was all just from their side.\nAttaullah Tarar paid tribute to Pakistani journalists who effectively pleaded country’s case in the Indian media.\nHe said the entire world knew that India did sponsor terrorism in Pakistan and had been this tactics for its political gain. He emphasized that Pakistan was a front-line state in the fight against terrorism.\nHe said the Pakistani narrative had prevailed against India, which churned out distorted narrative to divert global attention from its actions of sponsoring terrorism in Pakistan.\nIn response to a question, he said that successes had been achieved against terrorists by the security forces which are effectively tackling them, and that’s why India seemed perturbed, and it was obvious that it had been sponsoring terrorism in Balochistan and Khyber Pakhtunkhwa.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:51:40.098Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/no-legal-justification-for-indian-unilateral-suspension-of-indus-waters-treaty-atta-tarar/",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T14:44:00.000Z"
}
