{
  "title": "Progress cannot be achieved without full gender inclusion: Shaza Fatima",
  "author": null,
  "content": "ISLAMABAD, Apr 24 (APP):Federal Minister for Information Technology and Telecom Shaza Fatima Khawaja has said that technological advancement and national progress cannot be achieved without full gender inclusion.\n“The role of the Universal Service Fund (USF) in promoting Pakistan’s IT industry is significant. By connecting remote areas to the digital world, USF has empowered women, startups, freelancers, and social media influencers to tap into new opportunities, driving economic growth and innovation” she expressed these views while addressing an event “Girls in ICT for Inclusive Digital Transformation,” organized by USF in collaboration with Jazz in connection with International Girls in ICT Day 2025.\nPrime Minister Shehbaz Sharif, she said, distributed 1.2 million laptops among the youth during his various tenures, she said adding the IT Ministry provided online freelancing training to 4.5 million people through DG Skills Programs.\nThe ceremony was attended by senior officials from the Ministry of IT & Telecom, Parliamentary Secretary for IT & Telecom  Sabeen Ghori, MNA Sharmila Faruqui, CEO USF Ch. Mudassar Naveed along with other officials, CEO Mobilink Microfinance Bank Haaris Mahmood, GSMA Country Lead Saira Faisal, representatives from academia, and prominent women entrepreneurs from the telecom and IT sectors.\nShaza said that, as a Pakistani woman, she has witnessed firsthand the transformative power technology can have in a young woman’s life.\nShe was of the view that over the past years, empowering women in technology has moved from aspiration to action in Pakistan.\nShe has been a consistent advocate for women’s inclusion across all ICT sectors. Many top students in IT programs are female, and women-led tech ventures are beginning to make waves, even on global platforms.\n“This success reflects their relentless pursuit and the enabling policies that support them” the minister said.\n“Together, let us create a Pakistan where every girl can harness technology to fulfill her potential and where empowerment is not a dream, but a digital reality,” Shaza Fatima said.\nShe added that the Ministry of IT & Telecommunication has worked to build an ecosystem that supports, safeguards, and scales the ambitions of women in tech.\nFrom broadband expansion and safe online spaces to startup incubation and digital skills, every initiative is designed with inclusion in mind.\nHighlighting the National Broadband Initiatives, she said that since its inception, USF has awarded 161 projects, deployed broadband in over 21,600 mauzas, served a population base of 37.1 million people, and contracted over 4,400 telecom sites—of which more than 4,100 are already deployed. Across the country, 17,200 kilometres of Fiber Optic Cable (OFC) now run through previously unserved districts, touching more than 1,000 towns and Union Councils—connecting them to the national grid of opportunity. Women and girls in many of these areas are going online for the first time—to study, work, and lead.\n“This year, the Prime Minister has provided funds of Rs. 23 billion to the USF. The Ministry IT will continue to lead this journey with inclusivity at its core. “However, we need all of you—as mentors, investors, role models, and allies—to accelerate this momentum,” Shaza said.\nEarlier, in his welcome address, CEO Universal Service Fund, Ch. Mudassar Naveed, said it is an honour to join in celebrating International Girls in ICT Day 2025—a day marked globally under the auspices of the ITU since 2011, dedicated to encouraging girls and young women to explore careers in technology and STEM. This occasion reminds us of that inclusive digital transformation is not just a vision but a necessity.\nCEO Mudassar Naveed added that as an organization, USF is committed to connecting the unconnected.\nThe mandate is simple yet powerful: to expand high-speed telecom infrastructure to the farthest and most underserved regions of Pakistan. When a new village comes online through a USF-funded OFC network or mobile tower, a girl gains access to the world. She can now stream a tutorial, join an online class, or connect to a global community. This is where transformation begins.\nUniversal Service Fund (USF) Upcoming Initiatives, Chief Executive Chaudhry Mudassar said that USF had not started any new project for the last 2 years, which was because, on one hand, our focus was on timely completion of ongoing projects, while on the other hand, our goal was to complete field and technical work for new projects as per the directions of the Federal Minister for IT and the Board of Directors.\nCh. Mudassar Naveed revealed that USF has issued tenders for 16 projects, which means the formal phase of starting the projects has begun.\nIn upcoming projects: NG-OFC Projects: Set to connect districts like Sialkot, Sanghar, Jhang, Sajawal, and Tando Muhammad Khan to high-speed Fiber infrastructure.\nNext Generation Broadband for Sustainable Development (NG-BSD): Projecting across districts like Badin, Chiniot, Abbottabad, Kalat, Umar Kot, Gujranwala, Mandi Bahauddin, Kohat, and Khuzdar.  NGBSD (Small Lot): Attock, Sargodha, Khushab, Bahawalnagar, Sheikhupura, Hafizabad, Haripur, Mansehra, Mirpur Khas, and Sanghar.\n“These initiatives demonstrate the USF’s commitment to inclusive, future-ready connectivity for underserved communities in Pakistan,” Naveed added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:50:42.078Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/progress-cannot-be-achieved-without-full-gender-inclusion-shaza-fatima/",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T10:09:00.000Z"
}
