{
  "title": "6th Meeting of OIC Steering Committee on STI Agenda 2026 concludes successfully",
  "author": null,
  "content": "ISLAMABAD, Apr 24 (APP):The 6th Meeting of the OIC Steering Committee on the Implementation of the Science, Technology, and Innovation (STI) Agenda 2026 concluded successfully at the COMSTECH Secretariat, marking a significant step toward enhanced cooperation among OIC member states in the fields of science, technology, and innovation.\nThe high-level session brought together heads and representatives of 15 leading OIC institutions from Saudi Arabia, Kazakhstan, Turkiye, Jordan, Uganda, Bangladesh, Malaysia, and Pakistan. Participants reaffirmed their shared commitment to advancing STI collaboration within the OIC region.\nA key outcome of the meeting was the proposal for the establishment of a comprehensive OIC Technology and Innovation Portal by COMSTECH.\nThe digital platform aims to showcase innovative solutions developed by scientists, startups, and SMEs from member states.\nIt will also offer tailored data analytics and serve as a hub for the exchange of emerging technologies—promoting regional synergies and supporting the goals of the STI Agenda 2026.\nProf. Dr. Muhammad Iqbal Choudhary, Coordinator General of COMSTECH, emphasized the strategic importance of this initiative:\n“This meeting has once again demonstrated our unified vision for a prosperous OIC through science and technology. The proposed innovation portal will bridge information gaps, support data-driven decision-making, and spotlight the tremendous potential within our scientific communities.”\nAmbassador Aftab Ahmed Khokhar, Assistant Secretary General of the OIC, commended the committee’s achievements, stating:\n“This Steering Committee has set a clear path forward by promoting practical mechanisms for STI cooperation. Encouraging the implementation of national STI policies with private sector engagement is essential for sustained progress.”\nHe also lauded COMSTECH’s consistent efforts in driving forward the implementation of the OIC’s STI Agenda 2026.\nThe committee urged member states to take strategic and actionable steps toward implementing the STI Agenda. This includes aligning national priorities, developing robust STI ecosystems, securing adequate funding, and ensuring policy coherence.\nThese actions are seen as vital for enhancing research output, fostering intra-OIC collaboration, and advancing science-based socioeconomic development.\nThe participants praised COMSTECH for the excellent arrangements and warm hospitality extended during the event. The meeting concluded with the presentation of souvenirs to delegates as a token of appreciation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:52:01.411Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/6th-meeting-of-oic-steering-committee-on-sti-agenda-2026-concludes-successfully/",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T14:59:00.000Z"
}
