{
  "title": "SCP issues new Supreme Court Rules 2025",
  "author": null,
  "content": "ISLAMABAD, Aug 14 (APP):The Supreme Court of Pakistan (SCP) has formally published the Supreme Court Rules, 2025, replacing the Supreme Court Rules, 1980. This major reform reflects the Court’s commitment to modernization, digitalization, and bring justice system procedural clarity, in line with global governance of law.\nFramed under Article 191 of the Constitution, the new Rules replace outdated provisions and bring court procedures in line with contemporary legal, constitutional, and technological developments. They have come into immediate effect.\nTo carry out this revision, the Chief Justice of Pakistan constituted a committee comprising Justice Shahid Waheed, Justice Irfan Saadat Khan, Justice Naeem Akhter Afghan, and Justice Aqeel Ahmed Abbasi. The Committee engaged with Judges, the Pakistan Bar Council, the Supreme Court Bar Association, and other Bar Associations. The final draft was placed before the Full Court and approved after detailed deliberation.\nThe Supreme Court Rules, 2025 consist of seven Parts, thirty-eight Orders, and six Schedules, with approximately 280 provisions amended (including 160 from the Schedules), 60 new provisions added, and 5 outdated provisions deleted.\nKey Highlights of the Supreme Court Rules, 2025\nDigital Transition & Technological Enablement\nAll petitions and paper books must now be filed electronically; scanned copies are mandatory.\nNotices, orders, certified copies, and pleadings will be issued digitally.\nHearings through video-link are permitted.\nAffidavits may be authenticated by an Apostille.\nParties and Advocates must provide updated phone numbers, email addresses, and digital app details.\nJudicial documents sent via post will not be entertained.\nParties may inspect records or obtain copies online or in person.\nApplications marked urgent or requesting interim relief must be listed within 14 days or at the earliest practicable date.\nThe Registrar is authorized to ensure compliance with formats prescribed in the Sixth Schedule.\nCourt fees revised after decades; Advocate and official expenses updated.\nCriminal petitions are fee-exempt (except for certified copies); copies are free for petitions submitted from jail.\nHabeas corpus and Article 184(3) petitions related to criminal matters remain exempt from fees.\nThe Registrar may appoint Advocates at State expense in death sentence cases; counsel fees have been enhanced.\nAppeals, Reviews & Constitutional Matters\nIntra-Court Appeals introduced for orders under Article 184(3) and contempt proceedings.\nOne review petition permitted per judgment; it may be filed in person or through alternate counsel. Frivolous reviews may attract penalties; the security deposit has been increased.\nA party may revoke a Power of Attorney and appoint a new Advocate-on-Record.\nTransfer applications under Article 186A and Section 25A of the Family Courts Act, 1964, are now recognized.\nConstitutional Benches are formalized through a newly added chapter.\nAppeals from interlocutory orders to be heard by a bench of at least two Judges; all other appeals, including those against acquittal, by not less than three Judges.\nPaper books must be delivered in advance to the Attorney-General, Advocate-General, Prosecutor-General, and respondents, with certification of service.\nThe registrar may recall ex-parte orders upon sufficient cause.\nCompromise in compoundable offences is now formally accommodated.\nIn acquittal appeals, the Court may require surety or take coercive action if a respondent avoids appearance.\nProcedures for summoning records from lower courts have been streamlined.\nThe Registrar is empowered to supervise staff and exercise procedural powers as assigned under the Rules.\nBranch Registries are retained at all provincial capitals; filings are allowed at either Islamabad or the relevant Registry.\nAll fees, costs, security deposits, and allowances will be reviewed and revised every three years.\nWritten tests for registration as Advocate-on-Record have been abolished; Advocates with five years’ standing may apply directly.\nAdvocates may wear either a sherwani or a short black coat; wearing gowns is now optional.\nNo concise statement is required in criminal appeals. In civil matters, if security for costs is not deposited within 30 days, leave to appeal stands rescinded unless otherwise ordered.\nRespondents may seek summary dismissal of frivolous or delay-motivated appeals.\nProcedural failures shall be treated as irregularities and will not nullify proceedings; the Court’s inherent powers to ensure justice remain unaffected.\nThe Supreme Court Rules, 2025, reflect a transformative vision—integrating digital tools, promoting timely justice, and eliminating procedural rigidity. With inclusive provisions and simplified processes, the Rules usher in a new era of judicial efficiency and responsiveness in Pakistan. These Rules have also been uploaded on the Supreme Court website for the information of general Public.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:08:17.426Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/scp-issues-new-supreme-court-rules-2025/",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T19:33:00.000Z"
}
