{
  "title": "NA Deputy Speaker stresses unity, solidarity, tolerance",
  "author": null,
  "content": "ISLAMABAD, Aug 14 (APP):National Assembly Deputy Speaker Syed Ghulam Mustafa Shah on Thursday emphasized that national unity, solidarity, and tolerance are crucial needs of the time in the current situation for a strong, stable, and peaceful Pakistan.\nIn his message on the Independence Day and the occasion of Marka-e-Haq, Shah urged young people to adopt knowledge, hard work, honesty, and patriotism as their guiding principles. He said a stable Pakistan is a valuable legacy for future generations.\nShah said freedom is a great blessing from Almighty Allah, and it is the responsibility of every Pakistani to safeguard it. He added that independence is the result of the sacrifices made by our forefathers and the visionary leadership of Quaid-e-Azam.\nThe Deputy Speaker paid tribute to the Pakistan Armed Forces for their glorious victory in the Marka-e-Haq, describing it as a remarkable triumph that has sent a clear message to the world about Pakistan’s defense capabilities. He said the brave armed forces have demonstrated their global superiority by delivering a decisive response to the enemy.\nRecalling the Marka-e-Haq, Shah said the entire nation set an exemplary model of unity during the Indian aggression.\nHe noted that Pakistan’s history stands as a testament to courage, sacrifice, unity, and determination. The nation has faced every challenge with resilience and will continue to elevate Pakistan to a position of respect by achieving new heights of progress and prosperity.\nDeputy Speaker prayed for the freedom of Kashmir and Palestine. He noted that the people of Kashmir and Palestine have been struggling for freedom for decades, and emphasized that the international community should play its role in securing their right to freedom. He further stated that the ongoing serious human rights violations in Kashmir and Palestine are contrary to the fundamental principles of human rights.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:07:30.095Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-deputy-speaker-stresses-unity-solidarity-tolerance/",
  "dateList": "2025-08-14",
  "date_published": "2025-08-14T22:53:00.000Z"
}
