{
  "title": "78th anniversary of Independence of Pakistan celebrated in New Delhi",
  "author": null,
  "content": "NEW DELHI, Aug 14 (APP):The High Commission for Pakistan, New Delhi celebrated the 78th anniversary of Pakistan’s Independence here on Thursday.\nSaad Ahmad Warraich, Chargé d’ Affaires of Pakistan to India, hoisted the national flag in an elegant ceremony at the Chancery Lawns. Officers and staff of the High Commission along with their families attended the event. Messages of the President, the Prime Minister and the Deputy Prime Minister/Foreign Minister were read out on the occasion.\nPaying homage to the heroic freedom struggle, the Charge’ d’ Affaires said that under the dynamic leadership of Quaid-i-Azam Muhammad Ali Jinnah, the Muslims of the subcontinent altered the course of history in creating an independent homeland of their own as Pakistan was the fulfilment of an epic struggle for self-determination.\nThe Charge d’ Affaires said that the abiding lesson of the independence movement is that freedom is not free; the road to freedom was paved with the blood and sacrifice of countless martyrs. It is equally true that freedom cannot be taken for granted; it has to be preserved and defended every day. As recent developments affirm, Pakistan is fully capable of defending its sovereignty and territorial integrity against any external threat or aggression, he added.\nThe Chargé d’ Affaires said that during the course of the last 78 years, Pakistan has made remarkable progress on its journey towards advancement and prosperity. He eulogised the heroic sacrifices of the nation’s defenders, who laid their lives for the protection and dignity of the motherland.\nReaffirming Pakistan’s commitment to regional peace and stability, the Charge’ d’ Affaires said that the goal of regional peace can be achieved on the basis of sovereign equality, mutual trust and peaceful settlement of all disputes, including Jammu and Kashmir – while an outlook built on dialogue and diplomacy can serve as a harbinger for a bright future for South Asia, any approaches rooted in hegemonic notions of domination and control, will on the other hand, continue to hold back the promise of regional prosperity and development.\nClad in traditional attire, children of all ages, delivered heart warming performances depicting the various aspects of the freedom movement.\nA special cake was also cut by the Chargé d’Affaires, along with his spouse as well as other officers of the Mission, on this momentous occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:09:04.402Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/78th-anniversary-of-independence-of-pakistan-celebrated-in-new-delhi/",
  "dateList": "2025-08-14",
  "date_published": "2025-08-15T04:42:00.000Z"
}
