{
  "title": "SC seeks another reply from Imran Khan in contempt of court case",
  "link": "https://www.app.com.pk/national/sc-seeks-another-reply-from-imran-khan-in-contempt-of-court-case/",
  "date_published": "2022-11-02T16:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP):The Supreme Court on Wednesday directed Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan to submit a detailed reply over violation of May 25 order wherein PTI’s long march was restricted from entering D-Chowk, Islamabad.\nA five-member larger bench of the court headed by Chief Justice Umar Ata Bandial and comprising Justice Ijaz ul Ahsan, Justice Muneeb Akhtar, Justice Yahya Afridi and Justice Mazahar Akbar Naqvi heard the contempt of court case.\nThe federal government, through the interior ministry, had filed petition for initiating contempt of court proceedings against Imran for violating its May 25 order, wherein the PTI was restricted from holding its long march near the H-9 and G-9 areas of the federal capital. However, Imran Khan made his way towards D-Chowk.\nDuring the course of proceedings, Chief Justice Umar Ata Bandial said that the material available with the court justified the issuance of a notice to Imran Khan.\nHe said that the court was giving another chance to the former prime minister for an explanation. The court had been proceeding with caution and patience in this case, he added.\nHe said that the court was still giving Imran Khan a chance as according to the available material, a notice should be issued to Imran Khan.\nThe court sought a detailed reply from Imran Kham by next week and directed him that the reply should bear his signature.\nEarlier, Supreme Court Bar Association (SCBA) President Ahsan Bhoon said he was representing Imran’s lawyers, Babar Awan and Faisal Chaudhry.\nHe said that the court had previously issued notices to both lawyers. On this, the chief justice responded that the court had only sought replies from them.\nHe said that lawyers replies seem appropriate but the court would review them after hearing the arguments of the government’s counsel.\nAdditional Attorney General (AAG) Amir Rehman said that Imran had sought more time from the court for submitting his reply and had expressed ignorance about any undertaking given by his party.\nHe said that Imran Khan also expressed ignorance of the court order in his reply even he had given an assurance to the court.\nHe said that according to Faisal Chaudhry a counsel for Imran Khan, he had sought instructions regarding the march and undertaking from PTI leader Asad Umar as he could not get in touch with Imran Khan at the time.\nHe said that according to Babar Awan, none of the lawyers had named Imran Khan regarding the undertaking.\nThe chief justice said that the court had issued two orders on May 25 and asked what was the time difference between the issuance of the two orders.\nAamir Rehman said that the first order was issued at 11am and the second at 6pm.\nChief Justice Bandial said that the time between the two orders was to be utilised by PTI lawyers to seek instructions regarding the march and subsequently give an undertaking to the court.\nHe said that the court was not informed who had given the instructions.\nHe asked if lawyers did not speak to anyone, why was not the court informed?He said that an explanation on this had to be given. The court had trusted Babar Awan and Faisal Chaudhry and both of them had never said they had not received instructions, he added.\nThe chief justice asked how PTI Chief got to know about the court order.\nHe said that undertaking was given by PTI’s top leadership and the top leadership started with Imran Khan.He said that Imran Khan had sought time for submission of a detailed order.\nThe AAG said that the PTI had also violated the NOC in 2014.\nA case of contempt of court was filed in the Supreme Court against Imran Khan for calling judiciary role shameful.\nImran Khan had apologized to the Election Commission twice, he added.\nHe said that the court had shown restraint many times.\nUpon this, the chief justice said that the present case was different from the past cases.\nThe AAG said that Imran Khan came to Jinnah Avenue after passing the place reserved for the sit-in. In the Blue Area, Imran Khan gave a speech at 7:30 am, he added.\nThe chief justice addressing the AAG said that the events, he mentioned were before the arrival of Imran Khan.\nAhsan Bhoon said that Faisal Chaudhry had contacted Babar Awan on the court instructions.\nThe lawyers stated that it was not possible to go to Imran Khan in Attock, he added.\nHe said that the court ordered the government to arrange a meeting of the lawyers with Imran Khan.\nThe government did not arrange for lawyers to meet Imran Khan as after waiting for twenty minutes, the lawyers spoke to the media and left, he added.\nThe chief justice asked if the lawyers were not contacted, who gave the assurance?\nAhsan Bhoon said that the government had failed to give the facility of having a meeting to Babar and Faisal Chaudhry.\nHe asked how could they have received instructions?\nThe chief justice asked whether the lawyers had not contacted any senior leader of the PTI on phone.\nFaisal Chaudhry said that the May 5 hearing consisted of four parts as the district administration was called in the first part. The court had directed him to get in touch with the PTI leadership at 12pm, he added.\nHe said that Imran Khan carried jammers while travelling.\nHe said that he informed Babr Awan of the court directives after he was able to contact him.\nHe said he was able to get in touch with Asad Umar and also informed him about the court proceedings.\nThe chief justice asked was Asad Umar not at the rally at the time?\nHe said that photographs from the day showed he was at the rally. He asked if there were jammers, how were the counsel able to contact Asad Umar?\nHe asked what was Umar’s designation in the PTI.\nFaisal Chaudhry replied that Asad Umar was the party’s secretary general.\nHe said that no court directives were issued by the time he had contacted Umar. He said that the court order was issued at 6pm.\nHe said that he would not lie to the court.\nHe said that Asad Umar had informed him that the party had sought the Islamabad administration’s approval for holding a protest in the H-9 ground.\nThe chief justice said that the attorney general had expressed concerns regarding a law and order situation arising during the May 25 long march.\nFaisal Chaudhry said that the jurisdiction of the Red Zone began from D-Chowk. As per court orders, if the senior leadership of the PTI had met Imran Khan that day, it would have informed him, he added.\nHe said that the situation was very tense on the evening of May 25. The court had also prohibited any talks with the media, he added.\nThe chief justice said media was inside the court during the hearing that day and the court’s orders were broadcast.\nThe court had tried to create a balance on May 25, he added.\nHe said that the lawyers could have contacted Asad Umar for the second time too but that did not happen. This was the reason why the court, in an order on May 26, had said that its trust was broken.\nHe asked whether the court should not believe the lawyer’s words? He asked if contact could not be made, why was the court not told?\nHe said that the court had directed the government on PTI’s assurance.\nThe lawyers should have been present at the H-9 ground, he added.\nAhsan Bhoon said that the time was ten o’clock in the court order. When there was no contact, the court ordered a meeting with the leadership, he added.\nThe chief justice said that the court did not want to make lawyers a party to the case.\nAhsan Bhoon said that answers related to Imran Khan would be given by Advocate Salman Akram Raja.\nJustice Ijaz Ul Ahsan said that the lawyers never stated that the leadership was not contacted.\nThe court had trusted the lawyers on the clear assurance, he added.\nAhsan Bhoon said that the order to facilitate a meeting with Imran Khan was not without reason. If the lawyers had a helicopter, they would have gone to Imran Khan, he added.\nJustice Ahsan said that the court had permitted on H-9 ground regarding the location of the meeting.\nThe court was told that the roads leading to H-9 were closed, he added.\nHe observed that the PTI had misused the court’s orders.\nThe court had given protection to the PTI leadership and their supporters after which the government had removed all obstacles from the route, he added.\nChief Justice Bandial said that the court in its orders on May 26 had expressed that its trust was broken.\nHe asked why contact could not be established with Asad Umar. He said that there was no question of crossing H-9 and the court was led astray by two lawyers.\nHe said that 200,000 lives could not be burdened by calling 10,000 people.\nHe said that patients had died in ambulances during the Faizabad sit-in.\nThose who believed in democracy never protested in such a way, he added.\nLater, the court granted Imran Khan another chance to submit a response in the case within a week. The court further directed the PTI lawyer to submit videos from the May 25 march.\nThe chief justice said that whatever happened on May 25 should not take place again.\nWhile discussing PTI Senator Azam Swati’s application, the chief justice remarked that he had read Azam Swati’s statements on his custodial torture in the newspapers and was deeply saddened.\nHe said that Azam Swati had stated that his self-esteem was hurt. The self-respect was a human being’s basic right, he added.He asked how could politicians taking oath under the Constitution of Pakistan be denied basic human rights.",
  "retrievedAt": "2025-08-11T15:50:04.706Z"
}
