{
  "title": "Those in favour of martial law should learn from past experiences: Ayaz Sadiq",
  "link": "https://www.app.com.pk/national/those-in-favour-of-martial-law-should-learn-from-past-experiences-ayaz-sadiq/",
  "date_published": "2022-11-02T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP): Federal Minister for Law and Justice Sardar Ayaz Sadiq on Wednesday said that a lot had changed since the days of former president General (Retd) Pervez Musharraf’s dictatorial regime ended as the lawyers had stood up for the rule of law.\nHe expressed these views during his address at the opening ceremony of the temporary legal facility centre, in the new building of the Islamabad High Court, also saying it saddens him to see the talks and statements in favour of martial law.\nHe said the democratic system should be strengthened and the leaders who were talking about martial law should learn from the past experience and the repercussions it has had for Pakistan.\nEarlier, Islamabad High Court Chief Justice Athar Minallah inaugurated the temporary legal facility center in the new building of Islamabad High Court on Shahrah Dastur.\nOn this occasion, Islamabad High Court Judges, Session Judges, Former Law Minister Azam Nazir Tarar, Supreme Court Bar President Abid Zubair, Former President Ahsan Bhoon, High Court Bar Association President Shoaib Shaheen, Islamabad Bar President Hafeezullah Yaqoob and Islamabad Bar Council representatives were also present.\nThe temporary facility center will have room for lawyers, an attorney general office, advocate general office and a cafeteria.\nFederal Minister of Law Ayaz Sadiq said that the judiciary should be respected. “The one who got relief from the court order rejoices while the other criticises the same decision,” he added.\nHe congratulated Chief Justice Athar Minullah on his elevation to the Supreme Court and Justice Aamer Farooq on his nomination as the Chief Justice of Islamabad High Court.\nSpeaking at the ceremony, Chief Justice Athar Minullah said, “I congratulate the leadership of the lawyers. The foundation of Lawyers Complex has been laid.”\nHe agreed that the law minister had rightly stated that there were many challenges for the judiciary.\n“If litigants do not get cheap and quick justice then these buildings were meaningless. Judges and lawyers exist for litigants,” he said.\nHe said that he would not hesitate to admit that the litigants had no such confidence on the judiciary. Adding on, the chief justice said that a 70-year-old system could not be changed with a magic wand in spur-of-the-moment.\n“We also have to be accountable, we judges have no fear or fear of criticism, we are not affected by criticism, nor does criticism have any effect on us,” he added.\nHe stressed that political parties should also play their role to restore public confidence in the judiciary.\nHe said that the state would fulfil its commitment to cheap and speedy justice for the citizens.",
  "retrievedAt": "2025-08-11T15:50:03.800Z"
}
