{
  "title": "Pakistan to flag ‘Climate Finance”, loss & damage dedicated facility at COP27: Sherry",
  "link": "https://www.app.com.pk/national/pakistan-to-flag-climate-finance-loss-damage-dedicated-facility-at-cop-27-sherry/",
  "date_published": "2022-11-02T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Wednesday said the country being the worst impacted due to unprecedented natural calamities would flag the urgent need to mobilise the unmet global pledge of climate finance and a dedicated loss and damage funding stream at the COP-27 international moot to be held in Egypt.\nAddressing a hybrid media briefing carried out in-person and virtual, the minister briefed the journalists on the preparations of the Ministry of Climate Change to plead the case of the country at the 27th Conference of the Parties (COP-27) to the United Nations Framework Convention on Climate Change (UNFCCC) taking place at Sharm El Sheikh, Egypt.\nAt the onset, the she presented a three-minute video titled “A Century Breaking Year” which would be displayed at COP-27 forum highlighting the scale and impact of climate disasters faced by the country with unprecedented frequency and risk to environment, habitat, ecology, human life and property. The short video depicted prolonged droughts, glacial lake outburst floods (GLOFs), floods, recurrent heatwaves and present monsoon torrential rains’ devastation that affected 33 million population.\nSenator Rehman underlined that for the past two decades, 162 extreme events occurred in the country whereas a 300 percent increase in GLOF events was notices within just one year.Moreover, she said the country also witnessed high intensity heatwaves spiking up the temperatures to 53.7 degree centigrade in Jacobabad and other cities as the country hosted the hottest cities in the world for past 3 years.\nThe Minister said there was also serious projections highlighting food insecurity crisis because of crop damage to rise by 40 to 60 percent by 2050 whereas sea level rise was increasing rapidly threatening Thatta, Badin and Karachi to be submerged in the future due to sea intrusion.\nShe noted that there would also a threefold increase in climate induced migration from 0.7 to 2 million by 2050 whereas the country’s Post Disaster Need Assessment Report noted that some 8,330 km roads and 3,127 km railway tracks were damaged whereas one million livestock perished which was the income of an entire community in the flood affected areas.\n“There have been 1,739 deaths, 12,867 injuries, and over 2 million houses destroyed with 70% of it in Sindh in the recent monsoon floods. However, the World Bank has estimated cumulative losses of $30 billion which will have direct impact on our GDP.”\nThe Minister underscored that poverty to rise from 8.9 percent in Sindh, 7.5 to 7.7 % in Balochistan and the multidimensional poverty to rise at an alarming rate. “15 million people to get impacted through non-monetary poverty whereas the most impacted is the agriculture sector with a 0.9 percent GDP loss.”\nSenator Sherry Rehman informed that the estimation for reconstruction was underway which would be completed by the next week.\nCommenting on the preparation for COP-27, the Minister briefed that the Loss and Damage issue was placed on the provisional agenda of the COP after rigorously fighting Pakistan’s case.\n“Our priority is adaptation for long term measures to ward off climate change impacts. Pakistan is in the front line for advocacy and played a proactive role for highlighting climate finance. Our efforts will be focused on seeking $100 bln per year as promised in 2009 for climate finance and do the advocacy to increase the pledge three times.”\nShe added that Pakistan would be suggesting to develop a transparent mechanism clearly defining climate finance needs with an easy access to the funding for the developed countries most impacted due to climate change. At the moment, she said there were three climate funding facilities namely Green Climate Fund (GCF), Global Environment Facility (GEF) and Adaptation Fund whereas the last one had no funds available.\n“We are also seeking a loss and damage dedicated finance facility with rapid funding for loss and damage activities. Global Goal on Adaptation (GGA) needs to be developed on priority, and increased funding for adaptation.”\nThe Minister also noted that there was no Global Climate Risk Index of the UN which was necessary to be developed for all the countries at the UN Level.\nSherry Rehman also elaborated the activites at the Forum and said the Prime Minister’s speech during the World Leaders Summit was the most important as it was the country statement to be delivered at the COP-27.\nThe Prime Minister, she said would also jointly chair the high level roundtable with his Norwegian counterpart, another high level roundtable to launch Early Warning for All Executive Action Plan, bilateral engagements at the Prime Ministers and Ministerial levels, she said.\nSherry Rehman informed the media men that Pakistan would hold 25 panel events from November 9-18 whereas the Prime Minister and UN Secretary General would pay their visit to the pavilion of Pakistan.\nShe said the country would showcase its Living Indus Initiative Project, snow leopard conservation, mangroves protection and others highlighting its efforts in protecting the nature and fragile ecosystems.\nThe delegation, she said would comprise 14 people from the Ministry of Climate Change (MoCC), 8 technical members to handle negotiating streams, two officials from the Foreign Office including Pakistnai Ambassador for Korea and Ambassador Munir Akram, the Permanent Representative to the UN.\nResponding to media queries, she said the official badge holders would be allowed to attend the the negotiations in the official hall which would all be the technical negotiations as there would be eight negotiations taking place at a time.\nThe non-governmental organistations (NGOs) were also going from the country who were given observer badges by the MoCC and could not take the mike in the official meetings.\n“The real business will be going on at the negotiations whereas the panels to participate have been structured carefully keeping in view the importance of the negotiations and their topics.”\nThe Minister claimed that Pakistan would have the most active pavilion with multiple events taking place. She said the MoCC had a very simple delegation supported by the donors. The civil society representatives like Rafay Alam as moderator, a known environmental lawyer, SDPI Executive Director Dr Abid Suleri and civil society members were going on their own expenses at COP-27.\nShe informed that the country would also play its role in cooling down the frustration mounted up among the Small Island States like Maldives, Cameroon, and others who were at the verge extinction due to sea level rise.\n“It’s all a game of climate governance and resources and if money not received then it will be a serious problem to manage climate crisis,” she added.\nThe Foreign Minister would also attend the COP-27 where he and the Prime Minister were taking keen interest in climate change.",
  "retrievedAt": "2025-08-11T15:50:04.850Z"
}
