{
  "article_id": "2025-01-10_9d9c073cc376a0bc8170768c831fdc0d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/providing-best-facilities-to-hujjaj-govts-top-priority-ashrafi/",
    "retrieved_at": "2025-08-27T11:31:16.775Z"
  },
  "metadata": {
    "title": "Providing best facilities to Hujjaj govtâs top priority: Ashrafi",
    "author": null,
    "date_published": "2025-01-10T15:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 287,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 10 (APP):Special Representative to the Prime Minister on Religious Harmony and the Pakistani Diaspora in Middle East and Islamic Countries, Hafiz Muhammad Tahir Mehmood Ashrafi, on Friday, said that the government prioritizes providing the best facilities to the intending pilgrims (Hujjaj Karam) and was taking steps to facilitate them in collaboration with private Hajj groups. Addressing a press conference along with the Chairman of the Hajj Organizers Association of Pakistan (HOAP) Nasir Khan, he said that Saudi Arabia had appreciated the role of HOAP for making the best Hajj arrangements last year and aWe follow the regulations of the Saudi government during Hajja. He added that the Pakistani government are working to improve arrangements for the government quota and private Hajj pilgrims. Hafiz Muhammad Tahir Mehmood Ashrafi stated that the Ministry of Religious Affairs had settled the matters with the private Hajj bookings groups in the last day meeting and 904 private groups would carry out the Hajj operation 2025. He added that last year, only 14 complaints had been lodged of 90,000 private pilgrims while this year aWe will ensure no complainta. He said that the Hajj conference and Hajj Exhibition was going to start in Saudi Arabia on January 13 in which a Pakistani delegation led by Chairman HOAP Nasir Khan would participate. Special Representative to the Prime Minister on Religious Harmony thanked the Saudi government for giving respect and facilitating the Pakistan Hajj mission. Chairman HOAP Nasir Khan on the occasion said that exemplary arrangements would be ensured during Hajj 2025 while 80 per cent of intending pilgrims who were going to perform Hajj and collect the blessing of Allah Almighty would perform the Hajj at the cost of Rs one million.",
    "summary": [
      "The Pakistani government prioritizes providing best facilities to Hujjaj and is taking steps to facilitate them.",
      "The Ministry of Religious Affairs has settled matters with private Hajj booking groups for 2025.",
      "A Hajj conference and exhibition will start in Saudi Arabia on January 13."
    ],
    "keywords": [
      "Hafiz Muhammad Tahir Mehmood Ashrafi",
      "HOAP",
      "Saudi Arabia",
      "Pakistani government",
      "Hajj"
    ]
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}