{
  "article_id": "2025-01-10_5686dd18880f5d1650ebde451064366a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-felicitates-nation-on-record-increase-in-foreign-remittances/",
    "retrieved_at": "2025-08-27T11:32:06.846Z"
  },
  "metadata": {
    "title": "PM felicitates nation on record increase in foreign remittances",
    "author": null,
    "date_published": "2025-01-10T07:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 145,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 10 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday felicitated the nation on record increase in foreign remittances in December 2024, saying that the claims of those who had been chanting to halt the countryas economy had proven to be baseless. The foreign remittances during December 2024 increased to US$3.1 billion against November 2024, posting month-on-month growth of 5.6%. In a press statement, the prime minister said the remittances witnessed a record growth of 29.3% in December 2024 against same month (December 2023) of last year. aRecord increase in the foreign remittances reflects the strong commitment of the overseas Pakistanis for playing their role in development of the country,a the prime minister said. After achieving economic stability, Pakistan is now on the path of economic growth, the prime minister said adding that the government was determined to ensure national development and public welfare.",
    "summary": "Prime Minister Muhammad Shehbaz Sharif has felicitated the nation on a record increase in foreign remittances, praising the overseas Pakistanis for their role in the country's development. The remittances grew by 29.3% in December 2024 compared to the same month last year.",
    "keywords": [
      "foreign remittances",
      "Prime Minister Muhammad Shehbaz Sharif",
      "Pakistani economy",
      "overseas Pakistanis",
      "national development"
    ]
  },
  "entities": [
    {
      "name": "Muhammad Shehbaz Sharif",
      "category": "PERSON",
      "wikiDataId": null,
      "sentiment": "Positive"
    },
    {
      "name": "Pakistan",
      "category": "LOCATION",
      "wikiDataId": "Q33",
      "sentiment": "Neutral"
    }
  ]
}