{
  "article_id": "2025-01-10_46473e0a91c2a7930118e1eb39855985",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/meeting-held-to-review-preparations-about-kashmir-solidarity-day/",
    "retrieved_at": "2025-08-27T11:32:01.404Z"
  },
  "metadata": {
    "title": "Meeting held to review preparations about Kashmir Solidarity Day",
    "author": null,
    "date_published": "2025-01-10T13:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 288,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 10 (APP):Coordinator to Prime Minister for Kashmir Affairs & Gilgit-Baltistan Shabir Ahmed Usmani on Friday presided over the meeting and reviewed the preparations regarding February 5, Kashmir Solidarity Day. Federal Secretary Kashmir Affairs & Gilgit Baltistan Ali Tahir, Additional Secretary Kashmir Affairs & GB Kamran Rehman Khan, Joint Secretary Hamid Khan, Joint Secretary Azad Jammu and Kashmir Council Ali Akbar Khattak and Joint Secretary Gilgit Baltistan Council Sudheer Khattak attended the meeting, said a press release. The meeting was also attended by Convener All Parties Hurriyat Conference (APHC) Ghulam Muhammad Safi. The meeting discussed and reviewed the comprehensive plan for the upcoming events to be held on February 5 Kashmir Solidarity Day. Speaking on the occasion, Coordinator to Prime Minister Shabir Ahmed Usmani said that the Ministry of Kashmir Affairs and Gilgit-Baltistan and other relevant ministries and departments have started preparations for Kashmir Solidarity Day, to be observed on February 5. He said that the entire nation will observe Kashmir Solidarity Day with a renewed commitment to support the just struggle of Kashmiris for their inalienable right to self-determination, as enshrined in the relevant resolutions of the United Nations Security Council (UNSC). The meeting, held in AJ&K Council, brought together senior officials and focal persons from various ministries and departments, including the Ministry of Foreign Affairs, Information and Broadcasting, Interior, Information Technology and Telecom and Aviation. Representatives from Islamabad Police, Capital Development Authority (CDA), Ministry of Education, National Heritage and Culture Division, and the Cantonment Board, along with district managements of Islamabad and Rawalpindi also participated. Focal persons from all four provincial governments, Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan joined the meeting to provide their input on planning nationwide activities to mark Kashmir Solidarity Day.",
    "summary": "The Coordinator to Prime Minister for Kashmir Affairs & Gilgit-Baltistan, Shabir Ahmed Usmani, presided over a meeting to review preparations for Kashmir Solidarity Day on February 5. The event aims to show support for the just struggle of Kashmiris for their inalienable right to self-determination.",
    "keywords": [
      "Kashmir Solidarity Day",
      "Pakistan",
      "Gilgit-Baltistan",
      "Azad Jammu and Kashmir",
      "Shabir Ahmed Usmani"
    ]
  },
  "entities": [
    {
      "type": "PERSON",
      "name": "Shabir Ahmed Usmani",
      "wikidata_id": null,
      "sentiment": "Neutral"
    },
    {
      "type": "ORGANIZATION",
      "name": "All Parties Hurriyat Conference (APHC)",
      "wikidata_id": null,
      "sentiment": "Neutral"
    },
    {
      "type": "LOCATION",
      "name": "Kashmir",
      "wikidata_id": "Q1866",
      "sentiment": "Positive"
    },
    {
      "type": "ORGANIZATION",
      "name": "Ministry of Kashmir Affairs and Gilgit-Baltistan",
      "wikidata_id": null,
      "sentiment": "Neutral"
    },
    {
      "type": "LOCATION",
      "name": "Gilgit-Baltistan",
      "wikidata_id": "Q1934541",
      "sentiment": "Positive"
    },
    {
      "type": "PERSON",
      "name": "Ghulam Muhammad Safi",
      "wikidata_id": null,
      "sentiment": "Neutral"
    },
    {
      "type": "LOCATION",
      "name": "Azad Jammu and Kashmir (AJK)",
      "wikidata_id": "Q1963994",
      "sentiment": "Positive"
    }
  ]
}