{
  "title": "Three martyred in attack on police van in Quetta - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Three personnel, including a police inspector, were martyred and another injured in an ambush at a police mobile van in the Sariab area late on Wednesday night.\n\nOfficials said the tragic incident took place in the Mastung road area. The personnel were sitting in the police vehicle parked near a restaurant when armed men riding motorcycles ambushed the police vehicle.\n\n“An Inspector, two constables lost their lives on the spot as they received multiple bullet injuries, caused their instead death,” a police officer said, adding that the driver was seriously injured in the attack.\n\nSoon after receiving information about the incident police rushed to the site and shifted the bodies and the injured to hospital. The driver was identified as Khair Bakhsh.\n\nThe martyred officials were later identified as Inspector Abdul Wali, Constable Abdul Rehman, and Constable Mukhtiar.\n\nFollowing the tragic incident, Balochistan Chief Minister Mir Sarfraz Bugti condemned the attack and vowed that the blood of the martyrs would not go in vain.\n\n“The cowardly attackers will be brought to justice,” said CM Bugti, adding that the state is not weak and those attempting to disrupt peace in Balochistan would receive the harshest response. He assured that a full-scale operation will be launched against terrorists and that no space will be left for such elements in the province.\n\nJust a day ago, a Frontier Corps personnel lost his life in a gun attack in Noshki area.\n\nPolice said the victim, identified as Muhammad Zahir, was targeted by assailants riding motorcycles in the Qadirabad area.\n\nHe belonged to the district and was home on vacations.\n\nThe police moved the body to the district hospital in Noshki. The FC personnel received multiple bullet injuries that caused his death on the spot.\n\nPolice said the attack was target killing.\n\nThe body of the deceased was handed over to the family after completing medico-legal formalities.\n\nNo group has claimed responsibility for the killing, while the police have registered a case against unknown attackers.\n\nSeparately, a man was seriously injured in a hand grenade attack in Kharan town late on Tuesday night.\n\nPolice said unidentified men riding motorcycles threw a hand grenade near the Commissioner’s Office, which exploded at the roadside, resulting in injuries to a passerby.\n\nPolice shifted the injured man to a hospital.\n\nThe powerful explosion also damaged the window panes of nearby houses.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:06:55.850Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903242/three-martyred-in-attack-on-police-van-in-quetta",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:37:18.000Z"
}
