{
  "title": "Schoolteacher held for ‘torturing’ student in Attock’s Pindigheb - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: Police in Pindigheb town of Attock district on Wednesday arrested a teacher for allegedly torturing a 12-year-old student for not memorising his lesson in a private school.\n\nDespite a ban on corporal punishment, the practice still continues in schools across the country already grappling with one of the highest number of out-of-school children.\n\nTalking to media, Saadat Iqbal, the student’s father and a native of village Nathain Malkan, said that his son Mohammad Ali is enrolled in a private school located in Ahmedal.\n\nHis teacher, Maulvi Muneer Awan, subjected Ali to severe torture with sticks, inflicting serious injuries on his body, especially on his private parts.\n\nHe added that after the child returned home from school, he revealed his ordeal and was subsequently taken to the police station. After the medical examination confirmed the physical abuse, police registered a case against the teacher.\n\nThe student’s father said the teacher went underground when he registered a complaint with the school management.\n\n“The teacher physically abused my minor son in an inhuman way. He cries at night and cannot sleep due to physical and psychological trauma,” Saadat Iqbal said, calling upon the National Child Rights Commission (NCRC) and the district government for justice.\n\nThe victim, Ali also complained that the teacher in question always punished students.\n\nRimsha Kainat, an educational psychologist, told Dawn that corporal punishment had a negative effect on students and resulted in students developing a tendency to drift out of the academic circle and becoming rebellious.\n\nShe was of the view that corporal punishment had a long-lasting physical and psychological effect on children and was a major cause of school dropouts.\n\nMunaza Peerzada, president of a local non-governmental organisation (NGO), while commenting on the issue, said that the Punjab government had banned corporal punishment in schools way back in September 2005. However, the facts suggest otherwise.\n\nShe said under Article 25-A of the Constitution, there should be zero tolerance for corporal punishment.\n\nIt may be recalled that on August 13, 2011, a grade 5 student of a private school, Maqsoodur Rehman, died after being beaten by his teacher in Taxila.\n\nMoreover, Hasnain Abid, 15, was beaten to death by his teacher, Mumtaz Ahmed, with a stick for coming late to school in Hassanabdal in December 2012.\n\nWhen contacted, Investigation Officer Assistant Sub-Inspector Tufail Shahzad said that the medical examination of the victim confirmed torture.\n\nIn light of the statements of the victim, his father and the medico-legal report, police registered a case against the teacher under Sections 328-A and 506 of the Pakistan Penal Code (PPC) and arrested him.\n\nWhen contacted, District Education Authority Chief Executive Dr Ikhlaq Ahmed said that an inquiry committee had been formed to investigate the complaint against the schoolteacher.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:06:43.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903211/schoolteacher-held-for-torturing-student-in-attocks-pindigheb",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:47:25.000Z"
}
