{
  "title": "Islam permits organ donation after brain death: scholars and medical experts - Pakistan - DAWN.COM",
  "author": null,
  "content": "Leading Islamic scholars and medical professionals on Thursday signed a joint declaration affirming that Islam permits organ donation after death as a means to save or improve other human lives.\n\nA press release issued by the Dow University of Health Sciences (DUHS) said the declaration was made at a seminar hosted by the university in Karachi, where scholars and medical experts came together to address the ethical and religious dimensions of brain death and organ transplantation in Islam.\n\nThe declaration emphasised that “donating organs after death, with proper consent and ethical compliance, is not only allowed but also considered an act of sadaqah jariyah (ongoing charity) in Islamic teachings.”\n\nThe scholars stressed the need to raise awareness among Muslims about the permissibility and spiritual reward associated with organ donation.\n\nThey urged healthcare institutions and policymakers to enact clear guidelines supporting organ donation while addressing religious and ethical concerns.\n\nAmong those who spoke at the seminar were Council of Islamic Ideology (CII) Chairman Allama Raghib Hussain Naeemi, Professor Dr Noor Ahmed Shahtaz, Professor Dr Asim Ahmed, Dow Vice Chancellor Professor Muhammad Saeed Quraishy and Dow Organ Donation Society President Dr Tauqeer Abbas.\n\nThe seminar was also attended by faculty members and a large number of students.\n\nIn his welcome address, VC Quraishy was quoted as saying that Islam placed great importance on the sanctity of human life, and thus, organ transplantation was not merely a medical procedure but a significant act of service to humanity.\n\nThe CII chairman explained that brain death should be confirmed by doctors before any decision to remove life support was made.\n\n“Once brain death is declared, removing the ventilator becomes permissible, and organ donation can proceed with prior consent or the family’s approval,” Naeemi was quoted as saying. “The reuse of a ventilator for a patient with a higher survival chance can also be seen as a life-saving act.”\n\nAllama Muhammad Khan Sherani acknowledged that Islam permitted organ donation but urged that the process was “carried out with utmost caution”, given the ethical complexities involved.\n\n“Honesty and fairness are critical, especially in such sensitive matters,” he was quoted as saying.\n\nAllama Shahenshah Naqvi emphasised that since Islam highly valued the sanctity of life, donating organs to save lives was permissible, provided that the donor was not harmed.\n\nAccording to the press release, he also addressed emerging medical advancements, including the transplantation of animal organs into humans, saying that “saving human life takes precedence over the status of the donor animal.”\n\nMufti Ramzan Sialvi referred to the principle of choosing the lesser of two harms, stating that organ donation was permissible “if the dignity of the deceased is preserved”. Mufti Mazhar Fareed echoed the sentiment, stressing the importance of the donor’s intention and the “respectful handling of organs”.\n\nOn the other hand, the press release stated that Professor Dr Shahtaz warned against using deceased bodies for unnecessary experiments, especially when artificial organs were available. He reaffirmed “the need to respect human dignity”.\n\nDr Rashid bin Hamid highlighted that nearly 50,000 lives could be saved annually in Pakistan through organ donation, calling for widespread public awareness to promote this life-saving practice.\n\nOn Wednesday, a team of experts representing DUHS “successfully” completed another liver transplant, the 190th procedure in the university’s record.\n\nThe eight-hour operation was conducted on the DUHS Ojha campus and live-streamed on the university’s official website and social media platforms, offering an educational opportunity for a large gathering of medical students and trainees.\n\nAccording to officials, the complex surgery involved a 23-year-old donor, who donated a portion of his liver to his 42-year-old uncle. Both of them are in stable condition after the operation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/10192436384a9d6.jpg",
  "retrievedAt": "2025-08-25T14:06:23.562Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903354/islam-permits-organ-donation-after-brain-death-scholars-and-medical-experts",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T17:19:45.000Z"
}
