{
  "title": "Rano continues to bear brunt of official neglect in Karachi zoo - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: As the city’s weather gets intense, hopes for zoo bear Rano’s relocation to a species-appropriate sanctuary in cold season have faded as the lonely animal continues to languish in a barren cage.\n\nSources say that the Karachi Metropolitan Corporation (KMC) hasn’t yet implemented the recommendation of its own committee that had suggested the bear’s relocation to a sanctuary in Punjab over two months back. The committee couldn’t hold any follow-up meeting either.\n\n“We were expecting that the bear would be shifted to the sanctuary within a month or so. Unfortunately, this couldn’t be materialised as there is no headway in her case,” a KMC official regretted, adding that an attempt for her DNA testing failed because the team couldn’t collect proper samples.\n\nThe zoo director was not available for comments.\n\nNo action yet on experts’ advice to relocate Himalayan brown bear to Balkasar sanctuary\n\nIt might be recalled that the KMC on mayor’s directives had notified a committee on Jan 15 this year to address animal rights’ activists concerns about Rano that had been kept in poor conditions at the zoo for almost nine years.\n\nAnimal rights activists say that Rano is a Himalayan brown bear — a critically endangered species — and not a Syrian species as claimed by zoo officials.\n\nSources said the committee led by a senior Karachi University professor and comprising zoo and wildlife department officials conducted a comprehensive examination of Rano and suggested its DNA testing (to confirm the subspecies) and her relocation to a bear sanctuary in Punjab.\n\nThe members in their report had expressed concern over Rano’s “unusual behaviour” suggesting she is “under stress”.\n\nWhile the committee expressed satisfaction over the bear’s diet, physical health, and finding no wound/injuries on her body, it noticed “heavy noise” during the visit. The report stated that the noise seemed to be “beyond the permissible decibels”.\n\n“The species may immediately be transferred to the bear sanctuary at Balkasar till confirmation of the species/subspecies through DNA sequencing. Any two members nominated/advised by the senior director will visit the bear sanctuary to check the facility before shifting off the female brown bear,” the report says.\n\nIt suggested that the competent authority may take a decision to shift the bear to an appropriate habitat once her species is confirmed.\n\nRano was reportedly brought to the Karachi zoo in 2017 along with an Asiatic black bear who died in 2020. The activists demand that Rano should be sent to Balkasar sanctuary in Punjab — the only bear-specific sanctuary in Pakistan.\n\nAlso known as the Himalayan red bear, the Himalayan brown bear is a subspecies of the brown bear found in the western Himalayas. It is the largest mammal in the region, with males reaching up to 2.2 meters (7.2 feet) in length, while females are a little smaller.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f6e721b29b3.jpg",
  "retrievedAt": "2025-08-25T14:06:43.364Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903179/rano-continues-to-bear-brunt-of-official-neglect-in-karachi-zoo",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:47:15.000Z"
}
