{
  "title": "Gloves come off as US State Dept vows to keep cancelling visas - World - DAWN.COM",
  "author": null,
  "content": "• Tammy Bruce says countries must take their citizens back when US expels them\n• Immigration authorities announce social media screening for visa seekers\n• Environment of fear permeates campuses, many international students unsure of their fate\n\nWASHINGTON: A growing wave of visa revocations, detentions, and deportations is sending shockwaves across US campuses, leaving foreign students — particularly those linked to pro-Palestinian activism — facing increasing uncertainty.\n\nDays when Israeli military actions in Gaza sparked US-wide protests across American campuses are now a thing of the past. Today, universities face a new reality, where even minor infractions could lead to the cancellation of student visas.\n\nSecretary of State Marco Rubio said late last month that he has stripped visas for some 300 people and was doing so on a daily basis.\n\nIn a recent briefing, State Department spokesperson Tammy Bruce indicated that the gloves were off, saying: “[T]he department revokes visas every day in order to secure our borders and to keep our community safe, and we’ll continue to do so”.\n\nWhen asked about the cancellation of visas of vulnerable people who had sought refuge in the US, such as citizens of civil war-torn South Sudan, the State Department spokesperson was even more blunt.\n\n“Every country must accept the return of its citizens in a timely manner when another country, including the United States, seeks to remove them. South Sudan’s Transitional Government has failed to fully respect this principle by not permitting the entry of an individual that they had confirmed and documented as a citizen.”\n\nShe maintained that her department would restrict the further issuance of visas to South Sudan citizens to prevent their entry into the US. “We will be prepared to review these actions when … South Sudan is in full cooperation,” she said.\n\nOn Wednesday, immigration authorities announced they will look at social media accounts and deny visas or residence permits to people who post content considered anti-Semitic by President Donald Trump’s administration.\n\nThe move follows the cancellation of visas for students, even though the the First Amendment of the US Constitution guarantees freedom of speech.\n\nRubio had said that non-US citizens do not have the same rights as Americans and that it was at his discretion, not that of judges, to issue or deny visas.\n\nHomeland Security Secretary Kristi Noem “has made it clear that anyone who thinks they can come to America and hide behind First Amendment to advocate for ‘anti-Semitic violence and terrorism’ — think again. You are not welcome here,” said department spokeswoman Tricia McLaughlin.\n\nThe US Citizenship and Immigration Services “will consider social media content that indicates an alien endorsing, espousing, promoting or supporting anti-Semitic terrorism, anti-Semitic terrorist organizations or other anti-Semitic activity as a negative factor” in determining benefits, the statement said.\n\nThe policy will take effect immediately and apply to student visas and requests for permanent resident “green cards” to stay in the United States.\n\nStudents, varsities alarmed\n\nOn Tuesday, Ms Bruce was responding to questions from NBC News journalist Andrea Mitchell, who asked for clarification on the large-scale, and often unexplained, cancellation of student visas.\n\n“In some cases, students have said their visas were cancelled due to traffic citations, not involvement in protests or illegal activities. Is there a clear process or threshold for why student visas are cancelled,” Mitchell asked.\n\nMs Bruce responded by acknowledging the department’s actions, but remained firm on not providing specifics.\n\n“We’ve never gone into the details of the visa process,” the spokesperson stated.\n\n“We don’t discuss individual visas because of the privacy issues involved. We don’t release statistics or numbers, and we don’t go into the rationale behind what happens with individual visas.”\n\nBut the State Department’s refusal to provide a clear rationale for these decisions or disclose statistics has only increased concerns among international students.\n\nUniversities have been alarmed by the sheer volume of visa cancellations. In recent weeks, major institutions like Harvard, the University of Michigan, Stanford, UCLA, and Ohio State University have seen foreign students affected.\n\nAt Harvard, the Department of Homeland Security (DHS) revoked the visas of three graduate students and two recent graduates.\n\nMany schools, including those in California such as UC Berkeley and UC Davis, learned of these cancellations only after the fact.\n\n‘Don’t go abroad’\n\nThe situation has escalated to a point where several universities, including Brown, Cornell, and Columbia, have issued internal travel advisories urging international students to reconsider any plans to travel abroad. “Anyone who isn’t a US citizen should think hard about the need to leave the United States,” said César Cuauhtémoc García Hernández, a law professor at Ohio State University.\n\nWhile the government’s crackdown has been most notable in relation to pro-Palestinian protests, the scope of the visa cancellations is broader.\n\nMany international students are now living in a state of limbo, unsure whether their visa status will be revoked without warning. For some, a single protest or even a social media post could trigger deportation or detention. This new reality has created a chilling atmosphere on campuses, where students are advised to stay away from protests or political activity, particularly those involving Palestine.\n\nWith input from AFP\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/10082309fbb9862.jpg",
  "retrievedAt": "2025-08-25T14:07:00.420Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903224/gloves-come-off-as-us-state-dept-vows-to-keep-cancelling-visas",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:37:12.000Z"
}
