{
  "title": "Despite challenges, relief to public is top priority, PM tells JI team - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Wednesday met a three-member delegation of Jamaat-i-Islami (JI) led by Hafiz Naeemur Rehman, where both sides discussed a wide range of national and international issues from Gaza to the situation in Balochistan and Khyber Pakhtun­khwa, electricity prices as well as the Cholistan canals project.\n\nAccording to Prime Minister’s Office, both sides expressed deep concern over Israel’s continued aggression against innocent Palestinians in Gaza and the silence of international powers on the issue.\n\nThe prime minister reaffirmed the unwavering support of Pakistan for Palestinians and pledged to continue raising a strong voice against Israeli atrocities on every international forum.\n\n“Pakistan’s stance is clear — we stand firmly with our oppressed Palestinian brothers and sisters,” he added.\n\nHafiz Naeem urges taking water issue to CCI, more attention for problems of KP, Balochistan\n\nDuring the meeting, Hafiz Naeem thanked the PM for the recent reduction in electricity prices.\n\nPM Shehbaz responded by highlighting the government’s ongoing efforts to bring long-term reforms to the energy sector, saying, “Our team is working day and night to ensure sustainable solutions,” he added.\n\nHe said future reforms would be designed with the common citizen in mind to ease everyday life.\n\n“Despite challenges, public relief remains our top priority, and we will continue this mission,” he added.\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar, Federal Information Minister Attaullah Tarar, and Jamaat-i-Islami leaders Liaqat Baloch and Asif Luqman Qazi also attended the meeting.\n\nGaza issue\n\nMeanwhile, JI’s central secretariat issued a press release statin that the JI delegation, led by Hafiz Naeem, comprised Naib Emir Liaqat Baloch, Mian Aslam, Syed Firasat Shah, Asif Luqman Qazi, and Nasrullah Randhawa.\n\nSpeaking at a press conference after the meeting, Hafiz Naeem emphasised Pakistan’s moral and diplomatic responsibility to play a leadership role in the Palestinian cause.\n\nHe urged the government to form a delegation of parliamentarians and stakeholders to visit key Muslim countries. “Pakistan, along with Turkiye and Indonesia, should launch a joint naval Freedom Flotilla to break the siege of Gaza,” he said.\n\n“The most pressing global issue today is Gaza. Israel is committing genocide, while its Western backers, particularly the US, have exposed their true face,” he added.\n\nReferring to former US President Donald Trump, he said, “Trump shamelessly declares support for Israel — his stance is disgraceful.”\n\nDomestic front\n\nOn domestic issues, Hafiz Naeem said the meeting also addressed the rising cost of electricity and fuel. “We welcome the recent reduction in electricity prices but further cuts are needed. Global fuel price drops must reflect in Pakistan as well,” he added.\n\nRegarding the controversial Indus Canal Project, he urged the government to resolve the issue in consultation with all stakeholders, noting strong opposition to the project in Sindh and Punjab. “\n\nThe water crisis must be addressed through the Council of Common Interests,“ he added.\n\nHafiz Naeem pressed for completion of development projects in Karachi, saying the city has been left neglected due to the power tussle between federal and provincial authorities. “Karachi’s problems won’t be resolved through political theatrics,” he added.\n\nDiscussing Balochistan and KP issues, the JI emir called for greater attention to the issues in both provinces. “Balochistan’s resources must benefit its local people first and the PM should set up an office in the province to address local issues closely,” he added.\n\nHe also warned against ignoring the region’s grievances, referencing the fall of East Pakistan. “Balochistan’s youth must be brought into the national mainstream,” he added.\n\nThe JI chief called for urgent resolution of security challenges in Khyber Pakhtunkhwa and advocated for meaningful peace talks between Pakistan and Afghanistan. “Conflict benefits only our enemies,” he added.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/10110647476b824.png",
  "retrievedAt": "2025-10-12T02:27:43.779Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903244/despite-challenges-relief-to-public-is-top-priority-pm-tells-ji-team",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:37:18.000Z"
}
