{
  "title": "29 dead, 80 missing after Israeli strike on Shujaiya - World - DAWN.COM",
  "author": null,
  "content": "• UN rapporteur on Palestine warns not much time left to save Palestinians\n• 1,500 killed in last three weeks\n\nCAIRO: An Israeli air strike killed at least 29 Palestinians, including children, in a home in Shujaiya in Gaza City, local health authorities said on Wednesday.\n\nMedics said dozens of others were wounded in the attack that hit a multi-floor residential building in the eastern suburb of Gaza City. Many were still believed to be missing and trapped under the ruins of the building. The strike damaged several other houses nearby, medics said.\n\nHowever, the Israeli military claimed it struck a senior Hamas official responsible for planning and executing attacks from Shujaiya in northern Gaza, whom it did not identify. The military said “several steps” were taken before the attack to mitigate harm to civilians.\n\nLocal health authorities said nine other Palest-inians were killed in separate Israeli military strikes in other parts of the enclave, raising Wed-nesday’s death toll to 38.\n\n1,500 killed in three weeks\n\nIsrael resumed its bombardment of Gaza on March 18 after a two-month truce and sent troops back into the enclave. In the three weeks since, the health ministry in Hamas-run Gaza says Israeli military strikes have killed nearly 1,500 Palestinians.\n\nOver 50,800 Palestinians have been killed in Israel’s military campaign since October 2023, Palestinian authorities have said.\n\nSince late March, Israel has ordered Gazans out of territory around the edges of the enclave to create what it describes as a security zone; residents fear the aim is to “permanently depopulate” swathes of territory.\n\nMeanwhile, Arab mediators Qatar and Egypt, backed by the United States, have stepped up efforts to restore calm but have so far failed.\n\nThe UN special rapporteur on Palestine, France­sca Albanese, warned at a two-day event on Pales­tine in Paris that Israel would continue its violence against Palestinians unless action is taken, saying there is “not much time left” to save the Palestinian people.\n\nAlbanese told Anadolu that Israel has never respected the ceasefire.\n\nIsrael has not intention to halt war\n\nShe said that Israel has no intention of halting its actions for several reasons, claiming: “Because [Israeli Prime Minister Benjamin] Netanyahu will be the target of justice when he stops the war against the Palestinians.\n\n“You may have noticed that Netanyahu was going to appear in court the day after he ordered a new attack against the people of Gaza. So, the question is; was there a connection? Maybe,” she added.\n\n“I know that he has his own issues, with national and international justice, even though I think I no longer have any hope in national justice at the Israeli level or the international level because you see everyone saying they’re increasingly ready to roll out the red carpet for him,” stated Albanese.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f6f253a58c5.jpg",
  "retrievedAt": "2025-08-25T14:07:08.744Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903229/29-dead-80-missing-after-israeli-strike-on-shujaiya",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:37:12.000Z"
}
