{
  "title": "Huge factory fire erupts inside export processing zone in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "A huge fire erupted in a factory inside the Export Processing Zone located in Karachi’s Landhi Industrial Area Extension on Thursday, police and rescue services officials said.\n\nSpeaking to Dawn.com, Rescue 1122 spokesperson Hassaan Khan said that the fire erupted at the Sungraver factory and spread rapidly, prompting firefighters’ best efforts to put out the blaze.\n\nHe said it was a plastic manufacturing industrial unit, adding that five fire tenders along with two water bousers and one ambulance were busy trying to control it.\n\nThe fire was prevented from spreading further, but the thick smoke from flames was still emerging till night.\n\nKhan said the exact cause of the fire was not known, but it was suspected that a short circuit might have started it.\n\nHe added that nobody was present in the factory at the time of the fire and that was why no injuries were reported.\n\nHowever, he said the raw material present inside the factory was completely destroyed.\n\n“As there are combustible materials like cardboard, thread rolls and plastic [inside the factory], it will take some more time to control the fire,” he explained.\n\nMeanwhile, Malir Senior Superintendent of Police Kashif Abbasi, along with Deputy Commissioner Saleemullah Odho, visited the scene and directed the factory management to improve safety measures further, according to a police statement.\n\nAbbasi claimed that the fire tenders had controlled it and there were no casualties.\n\nFire incidents are common in the metropolis due to the absence of adequate fire safety measures in buildings.\n\nThirty shops were gutted when a huge fire erupted in a commercial building in Clifton in February.\n\nFour people, including one firefighter, were affected by smoke inhalation and 12 fire tenders worked for four hours to bring the fire under control.\n\nLast year, the Karachi Metropolitan Corporation (KMC) informed the Sindh High Court that it had conducted a fire safety audit of over 265 commercial buildings, and not a single one was found to have a fire safety certificate or a no-objection certificate (NOC) issued by the fire brigade department.\n\nOut of 265 buildings, around 155 did not have fire alarms and smoke detectors installed, while the status of nine such buildings was not available in this respect, the KMC report added.\n\nSimilarly, the condition of the wiring and electric system of over 155 buildings was termed unsatisfactory. Regarding access to firefighting equipment, the report said that around 200 buildings had no or unsatisfactory firefighting equipment.\n\nThe SHC had directed provincial authorities to ensure that relevant teams inspect all shopping malls in the city to ascertain safety standards in place.\n\nThe bench expressed resentment over several fire-related incidents that recently occurred at shopping and commercial malls/buildings in the metropolis.\n\nThe court had passed such directives in a case related to a fire at a shopping mall on Rashid Minhas Road in 2023. At least 11 people were killed while five others were injured after a blaze erupted inside the RJ Shopping Mall because of a suspected short circuit.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/102206279bc5bd4.png",
  "retrievedAt": "2025-08-25T14:06:23.347Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903361/huge-factory-fire-erupts-inside-export-processing-zone-in-karachi",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T18:25:35.000Z"
}
