{
  "title": "KP govt under fire over proposed changes to law on mines and minerals - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa Mines and Minerals Bill, 2025, has stirred up a firestorm of criticism, with PTI founder Imran Khan’s sister Aleema Khan calling for putting the proposed legislation on hold.\n\nThe criticism, which came mostly from the ruling PTI’s leaders and social media activists, was so harsh that Chief Minister Ali Amin Khan Gandapur had to put out a statement on Tuesday night, dismissing “rumours and misconceptions” regarding the proposed amendments.\n\nAleema Khan told reporters in Rawalpindi on Tuesday that there had been huge public uproar over the bill, so the government should not table it in the assembly until PTI founder Imran Khan approved it after release from jail.\n\nThe bill, which was tabled in the provincial assembly on April 4, was ripped apart by both ruling and opposition lawmakers.\n\nAleema calls for putting bill on hold; CM rejects ‘rumours and misconceptions’\n\nShakeel Ahmad, a former minister, asked the law minister not to table the bill.\n\n“If we make this mistake on someone’s behalf, our future generations will never forgive us,” he said, requesting the government to disown the Special Investment Facilitation Council.\n\nMr Ahmad alleged that the powers that be was a major shareholder in SIFC, with five companies made by it for mines and minerals, agriculture, tourism, oil and gas sectors.\n\nThe bill recommended the establishment of licensing and exploration sections at the directorate of the mines and minerals directorate as well as a mines and mineral force in the province.\n\nThough the bill provides for the protection of landowner rights and training and other opportunities for the local communities, it is silent about if those communities are to receive any share from the mining operations in their respective areas.\n\nHowever, it was the role of the federal mining wing, an entity of the energy ministry in the proposed legislation, which raised a few eyebrows, as the mining sector is a provincial subject in light of the 18th Constitutional Amendment.\n\nSub-section (i) of the bill’s Section 6, which deals with powers and functions of licensing authority, stated, “The authority shall implement recommendations of the mineral investment facilitation authority and may implement suggestions of the federal mineral wing in relation to powers and functions of the licensing authority.”\n\nSection 19 provides for the mineral investment facilitation authority (MIFA) but, unlike the existing KP Mines and Mineral Act, 2017, the composition of this authority has been changed in the proposed law. The authority has seven members with the provincial mines and minerals development minister being its head.\n\nHowever, the bill suggested increasing the number of members to 14, with the induction of five provincial ministers. In addition, Section 19(3) empowers the chairperson to invite any person as a co-opted member.\n\nIn the bill, the MIFA’s “powers and functions” have been expanded from 12 to 16, while advising the federal mining wing in sub-sections(f0, (g), (h), (i) and (k).\n\nSubs-section (f) provides for the authority to review fees, rents and royalties on its accord or on the suggestion of the federal mining wing. Another section gives widespread advisory role to federal entity to suggest review the formula for fixing reserve price, financial guarantees, review of model mineral agreement, making recommendations to government in respect of eligibility of title holders, powers and functions of the licensing authority, function and operation of cadaster system, mining title application register, mineral reserved area register and providing recommendation to the government and licensing authority.\n\nIn Section 2, which provides definitions, sub-section (kk) declares the large-scale mining as to be any processing of mining, with a proposed capital investment of at least Rs500 million. However, a proviso makes it binding on investors to make joint ventures with government-owned companies.\n\n“Provided further that in LSM, investors shall enter into joint-venture with government-owned companies with specific partnership ratio on such terms and conditions as may be determined by the government,” it reads.\n\nAlso, Schedule I of the bill classifies the mineral groups into 18, with minerals in each group named except that in strategic and rare earth minerals.\n\nRegarding the strategic minerals, it states that they will be defined and notified by the government, or may on the guidance of the federal mineral wing through FIMA. Also, the rare earth minerals will be defined by the provincial government or may on the guidance of the federal mining wing.\n\nA note, inserted into the schedule, reads, “The government may include or exclude any mineral or group of mineral in the above said groups as deemed appropriate from time to time by notification in official gazette.”\n\nWhen contacted, president of the Frontier Mine Owners Association Sherbandi Khan Marwat said that the Harmonisation of Minerals Act, 2025, a federal initiative while claiming to unify and regulate Pakistan’s mineral sector, had instead raised serious concerns across provinces.\n\nHe said if that legislation was to be crafted at the federal level, it should have incorporated the genuine concerns and recommendations of key stakeholders, including provincial mineral departments, mining experts and the business community.\n\n“Despite repeated consultations and assurances given to our association, its input was disregarded. When this Act finally reached the provinces, it became evident that the voices of the provinces and their business communities had been completely ignored, causing deep resentment and frustration,” he insisted.\n\nMr Marwat said that small-scale mining had been the backbone of the industry in KP, generating Rs15-20 billion in annual revenue and providing employment to over 500,000 people, whereas LSM had contributed little despite holding leases for over two decades.\n\nHe said that the bill had erased the distinction between large and small-scale mining, creating an unfair and oppressive legal framework that favoured large corporations while suffocating small investors. He also complained that the proposed legislation set the bank guarantee of Rs25 million for a small mining lease.\n\n“This Harmonisation of Minerals Act is a calculated assault on the economic sovereignty of KP and should be rejected,” he said.\n\nHowever, a mines and mineral department official insisted that the bill was aimed at regulating the mining sector like the rest of the world.\n\n“The first draft of the bill came from Islamabad and went into four revisions, each time accommodating the province and other stakeholders’ views and stand,” he said. The official claimed that around 60 per cent of the proposed law was similar to the existing Act.\n\nMines and minerals development secretary Mutahir Zeb didn’t respond to this correspondent’s requests for comments.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:27:43.007Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903197/kp-govt-under-fire-over-proposed-changes-to-law-on-mines-and-minerals",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:47:35.000Z"
}
