{
  "title": "Nepra approves slashing electricity prices by Rs1.71 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Electric Power Regulatory Authority (Nepra) on Thursday approved the government’s request to reduce electricity prices by Rs1.71 per unit for three months, according to a written decision by the authority.\n\nLast month, the government formally asked Nepra to reduce electricity rates by Rs1.71 per unit from April to June for all consumers across the country as part of the government’s efforts to reduce consumer-end tariffs and improve demand.\n\nNepra heard the government’s petition on April 4 and reserved its decision. During the hearing, it surfaced that the Rs7.41 per unit cut in power rates across the country announced by Prime Minister Shehbaz Sharif included Rs1.71 per unit relief in petroleum levy.\n\nAccording to Nepra’s decision, which has been seen by Dawn.com, the request was approved and the decision had been conveyed to the government for notification.\n\n“The Authority has no objection on the instant Motion, as it does not impact Nepra’s determined tariff, since the GOP [Government of Pakistan] has decided to provide additional subsidy from the expected collection of PDL [Petroleum Development Levy],” the decision read.\n\n“Accordingly, the request of the Ministry [of Energy] to provide [an] additional subsidy of Rs.l.71/kWh to all consumers of XWDISCOs and K-Electric (except lifeline consumers) for the period from April 2025 to June 2025 is hereby approved,” it added.\n\nAccording to Nepra, the energy minister said during the April 4 hearing that the estimated collection of PDL for 3.5 months was around Rs58.6 billion, which would be used to provide tariff differential subsidies for power sector consumers.\n\n“The federal cabinet has approved this proposal and allowed to file the motion before Nepra so that [the] benefit can be passed on to the consumers in the billing month of April 2025,” the decision read.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:06:23.372Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903338/nepra-approves-slashing-electricity-prices-by-rs171",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T13:31:21.000Z"
}
