{
  "title": "Viral Chinese AI video of US sweatshop workers mocks Trump’s tariffs - World - DAWN.COM",
  "author": null,
  "content": "A Chinese AI generated video mocking downcast American workers has been circulating on Chinese and US social media amid a growing tariff war between both countries.\n\nThe video shows overweight and over-worked, employees in a textiles factory, appearing exhausted and depressed as they stitch clothing on sewing machines.\n\nDepicting the type of clothing manufacturing jobs that have been outsourced overseas in the past decades, the 32-second clip paints a dystopian picture of what the US working world might look like as a result of Donald Trump’s sweeping tariffs, according to The Independent.\n\nWith the traditional Chinese music playing in the background of the video which ends with Trump’s campaign slogan, ’Make America Great Again, seems to be a direct swipe at the US president.\n\nMuch of the low-skilled workers’ jobs had been moved to China and other countries where labour is cheaper with the advent of mass globalisation over the past few decades.\n\nTrump’s tariffs are based on an argument of encouraging American-based goods and returning to low-skilled jobs in the US to expand the job market for Americans and strengthen the country’s own businesses.\n\nOn Wednesday, Trump announced retaliatory tariffs on China to 125 per cent, after China imposed 84pc tariffs on US goods.\n\nWith more than a million views, the video has sparked further debate on social media about Trump’s ultimate goal in imposing stiff tariffs on China —and what the impact will be, The Independent reports.\n\n“The goal is not to bring these low skilled jobs back to the US, but have China buy more US goods to offset a 300 billion [dollar trade deficit] and counting yearly trade imbalance,” said one.\n\n“Low skilled manufacturing will never come back to the US. Highly skilled manufacturing won’t come to the US because we gutted education and don’t have the highly skilled workforce,” said another.\n\nA third added: “America will become the poorest country in the world under Trump’s rule,” while a fourth mused: “iPhones are about to cost $5,000 and come with no charger.”\n\nThe TikTok video was reposted to X by user Damon Chen, who punctuated the video with a laughing-crying emoji, according to New York Post.\n\nHoward Lutnick, Trump’s commerce secretary, during an interview, told CBS that “trillions” of dollars would flow into the US in the form of new investments in America’s manufacturing sector.\n\nPointing out that the construction of new factories “takes years” and would not reduce high costs for Americans in the short term, host Margaret Brennan asked: “You said that robots are going to fill those jobs. So those aren’t union worker jobs.”\n\n“It’s automated factories,” Lutnick conceded, while promising that “Great American workers” would build and “operate” the factories brought to US shores in the coming months and years.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/04/10123958bb2eae1.jpg",
  "retrievedAt": "2025-08-25T14:06:29.540Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903312/viral-chinese-ai-video-of-us-sweatshop-workers-mocks-trumps-tariffs",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T08:04:53.000Z"
}
