{
  "title": "Jirga opposes military operation in Lakki Marwat - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: A jirga of Marwat tribe has made clear it won’t allow any military operation in the area as it is evident from the past experiences that such actions have always increased people’s sufferings, saying establishing peace and writ of the state is government’s responsibility.\n\nThe jirga held in remote Wanda Shahabkhel area of Kurrum Par belt on Wednesday was attended by a large number of people from various areas.\n\nSpeakers included former district nazim Ishfaq Ahmed Khan Meenakhel, MPA Johar Mohammad Khan, former nazim Malik Nazir Khan of Titterkhel, former Lakki tehsil nazim Haji Hidayatullah Khan, Lakki tehsil council chairman Shafqatullah Khan Khoidadkhel, former tehsil naib nazim Hafiz Asif Saleem Advocate, Malik Najibullah Khan, Yaqoob Khan of Titterkhel, Dr Mohammad Iqbal of PTI, Imranullah Marwat Begukhel of ANP and Liaquat Ali Khan.\n\n“No military operation can be successful without the support of people,” said Ishfaq Meenakhel. He said the terrorism-hit people should not be forced to take up arms for bringing peace and normalcy to the district.\n\nDeclares locals won’t vacate homes under any circumstances\n\n“It is unfortunate that the menace of terrorism is at its peak in Lakki Marwat, which is located at just a two-hour drive from both provincial and federal capitals,” he wondered, adding residents were justified in questioning peace and prosperity in the neighbouring Punjab province.\n\nHe opposed any military operation and said the locals would not vacate their homes and areas under any circumstances. “A handful of terrorists are like a sand wall in front of the state, so serious and practical steps should be taken to eliminate them,” he said.\n\nOther speakers said people would not allow terrorists to use their land for subversive acts. They declared terrorists the enemies of peace and murderers of innocent citizens.\n\nMPA Johar Mohammad, while shedding light on the decisions taken in the jirga, said the military operation was not acceptable to residents.\n\n“The people should not be forced to accept responsibility for any roadside IED attacks on security forces and other law enforcement personnel,” he added.\n\nThe lawmaker said residents had no role in attacks on the security personnel and if any such attacks occurred from any house in the area they (security forces) were free to launch action.\n\nHe said the killing of innocent people in operations would not be tolerated under any circumstances. “The jirga asks the terrorists to leave the area, otherwise the people will take up arms against them,” he said, asking people to stop their youths from joining the ranks of terrorists.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:06:40.954Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903187/jirga-opposes-military-operation-in-lakki-marwat",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:47:35.000Z"
}
