{
  "title": "Pakistan keeping eye on US tariffs: FO - World - DAWN.COM",
  "author": null,
  "content": "The Foreign Office on Thursday said it was keeping an eye on the issue of tariffs recently imposed by the US on Pakistan, as well as many countries being granted a three-month suspension from them.\n\nThe development comes as US President Donald Trump said on Wednesday that he would pause many of his new tariffs for 90 days, even as he raised them further on imports from China.\n\nTrump’s sudden reversal came less than 24 hours after steep new tariffs kicked in on imports from dozens of trading partners. The new trade barriers have hammered markets, raised the odds of recession and prompted retaliatory responses from China and the European Union.\n\nThe government on Wednesday said it was set to send a high-level delegation to the US to promote trade relations and discuss a 29 per cent tariff that has been imposed on goods the US imports from Pakistan.\n\nResponding to a question during his weekly press briefing in Islamabad, Foreign Office spokesperson Shafqat Ali Khan said that Pakistan was following the issue of tariff imposition by the US and the recent suspension on imports from most of the countries.\n\nHe added that considering the interconnected nature of global trade, the tariff imposition could have a far-reaching impact and emphasised a mutually beneficial resolution of the matter.\n\nRegarding the discontinuation of the Global Undergraduate Exchange Programme (Global UGRAD) for Pakistani students, the spokesperson said that the decision marked “the end of a 15-year engagement that played a pivotal role in promoting academic and cultural linkages besides strengthening bilateral ties focusing on education, science and technology and people-to-people contacts”.\n\nHighlighting the situation in Indian-held Kashmir, he condemned the Indian authorities’ denial of permission to hold Eidul Fitr prayers at the historic Jama Masjid and Eidgah in Srinagar, as well as on the holy night of Lailatul Qadr.\n\n“The Indian authorities are in the habit of enforcing similar curbs in Srinagar for past several years,” he added.\n\nHe continued that restraining the ordinary people from congregating on special religious occasions poses serious challenges to the religious freedom of Muslims in Indian-held Kashmir.\n\n“The Kashmiri people’s rights to freely practice their religion and of peaceful assembly must be respected.”\n\nHighlighting the other diplomatic engagements, the spokesperson mentioned the telephonic interactions of DPM Ishaq Dar with Bangladesh’s Advisor for Foreign Affairs Touhid Hossain, Saudi Foreign Minister Prince Faisal Bin Farhan and US Secretary of State Marco Rubio.\n\nDuring the discussion with Rubio, the two leaders exchanged views on bilateral relations, economic cooperation and regional security, including the situation in Afghanistan and agreed on the need to resolve the issue of US Military equipment left behind in Afghanistan.\n\nHe also briefed the media about Foreign Secretary Ambassador Amna Baloch’s ongoing official visit to Amman for the second round of Bilateral Political Consultations between Pakistan and Jordan, scheduled to be held on Thursday.\n\nDuring the consultations, different regional and international matters of mutual interest and concern, including inter alia current situation in Occupied Palestinian Territories; evolving dynamics in the Levant, developments in South Asia as well as state of cooperation in different domains of Pakistan-Jordan relations would be discussed.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1017165148c64a7.png",
  "retrievedAt": "2025-08-25T14:06:26.608Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903323/pakistan-keeping-eye-on-us-tariffs-fo",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T11:45:26.000Z"
}
