{
  "title": "Mineral wealth - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE participation of 300 delegates, including guests from overseas, in the two-day mineral summit in Islamabad has renewed hopes of growing foreign interest in Pakistan’s mineral sector, which remains mostly unexplored due to lack of financing and access to technology.\n\nPrime Minister Shehbaz Sharif has highlighted mineral resources as the lynchpin of the nation’s economic revival. Addressing the Pakistan Minerals Investment Forum, he went on to state that the country’s mineral wealth ‘worth trillions of dollars’ could free its economy from perpetual dependency on frequent bailouts from global lenders.\n\nIndeed, the recent announcement at the forum of new, significant discoveries of hydrocarbons in KP and gold-copper deposits in Balochistan underscores the presence of vast reserves of natural resources in the country waiting to be tapped.\n\nHowever, the conversion of these deposits into mines will not happen overnight in spite of a discernible international interest in the country’s mineral sector due to the new discoveries and the settlement of the Reko Diq dispute leading to its revival. Investors would want to first carry out studies to determine the size of the deposits and economic viability of undertaking exploration before committing funds rather than relying on the optimistic estimates of Pakistan’s government.\n\nThe policymakers must also avoid rushing into flawed agreements just to woo investment in this critical sector. The agreements should be transparent and based on assessment of the true value of the deposits. If the country is to truly benefit from its mineral wealth, it is also crucial to ensure that the policy and subsequent contracts under it cover the entire minerals’ value chain: the extraction of minerals to local processing and refining for production of the finished products for export.\n\nWe have seen the investors take out minerals from Saindak in raw form, with virtually little to no benefit to the country. The Reko Diq dispute also had its genesis in such a defective agreement. While the renewed focus on the mineral sector is welcome, we should not forget the reality that this wealth is found in the two provinces reeling under growing militancy and insurgency. Though the army chief promised the forum participants robust security for investors, practical measures need to be taken to allay their concerns in Balochistan.\n\nMoreover, it must be ensured that the people of Balochistan and KP have first priority in jobs, and that the proceeds from these projects are spent on the welfare of the people. The Baloch unrest is partly the result of the belief that the province’s resources are being used for the rest of the country rather than for Balochistan’s economic development. This perception will not go away unless the financial benefits accruing from these projects are directed for the development of the province and its population.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:28:14.242Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903258",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T02:35:55.000Z"
}
