{
  "title": "Home hope Noor sets up showdown against Egypt’s El Torkey in squash final - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Noor Zaman is a step away from Under-23 World Squash Championships glory after seeing off the challenge of Malaysia’s Ameeshenraj Chandran in front of a roaring home crowd and a beaming grandfather, former squash world number one Qamar Zaman, at the Creek Club here on Wednesday.\n\nChandaran had ousted home hope Hamza Khan in the quarter-finals but it was a different story against Noor as he retired during the third game of the last-four while trailing 6-11, 2-11, 4-6.\n\nNoor advances to the Thursday’s title clash against Kareem El Torkey, who overcame top seed Ibrahim Elkabbani 7-11, 11-2, 11-8, 11-5 in all-Egyptian semi-final.\n\n“To qualify for a world championship final … it’s a huge achievement for me, my family, and Pakistan,” Noor told Dawn. “My grandfather was watching courtside and it’s because of his efforts and those of my family, I’m where I am.”\n\nQamar was just as proud of his grandson.\n\n“He’s played very well,” the squash great told Dawn. “He put in the effort for this. He’s talented, and nothing comes without hard work. Our prayers are with him, and he has to work hard [to win the final].”\n\nThe 21-year-old Noor got off to a strong start to hold off points from Chandaran before breezing through the second game.\n\nExhaustion seemed to have got better for the Malaysian as Noor continued to stretch him and he eventually halted play before retiring from the match due to an injury that was building up throughout the game.\n\nThe duo’s final moments on court were bittersweet as the they embraced before Noor graciously waved to applause from the crowd and followed a visibly upset Chandaran off the court.\n\nThe crowd then witnessed a superb comeback from El Torkey, who kept his nerve in a heated second game to draw level with Elkabbani.\n\nElkabbani looked determined to regain his advantage, sliding all over the court to play the toughest of shots in the third game, but El Torkey’s skill powered him ahead.\n\nBy the fourth game, Elkabbani was taking shots at the referee just as much as he was at the ball, which ultimately proved futile as Kareem quietly worked his magic to seal his spot in the final.\n\n“He [Elkabbani] put up a great show and [despite the heated contest] we remain close friends on and off the court,” El Torkey said.\n\nEgypt will have a shot at glory on the women’s side too as top seed Fayrouz Abouelkheir overwhelmed Malaysia’s Aira Azman 3-1 in their semi-final, winning 11-8, 11-7, 8-11, 11-5.\n\nThe other women’s semi-final between Hong King’s Chan Sin Yuk and Malaysia’s Xin Ying Yee was the only clash that went the full distance.\n\nChan took the first two games 11-7, 11-6, but Xin clawed her way back by taking the next two games 11-4, 11-7. Chan then took the decider 11-3 to end Xin’s hopes.\n\nPublished in Dawn, April 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:06:54.935Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1903217/home-hope-noor-sets-up-showdown-against-egypts-el-torkey-in-squash-final",
  "dateList": "2025-04-10",
  "date_published": "2025-04-10T01:37:26.000Z"
}
