{
  "title": "CPEC contributing positively, transparently to Pakistan’s development: FO",
  "link": "https://www.app.com.pk/national/cpec-contributing-positively-transparently-to-pakistans-development-fo/",
  "date_published": "2020-05-24T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):Pakistan on Sunday said the China Pakistan Economic Corridor (CPEC), a flagship project of Belt and Road Initiative (BRI) was a transformational project contributing positively and transparently to Pakistan’s national development.\nIn a statement, Foreign Office spokesperson said Pakistan and China were ‘All-Weather Strategic Co-operative Partners’.\n“We are engaged in prompting peace, development and stability in the region based on the principles of mutual respect, mutual benefit, win-win cooperation and shared development. Our ties are based on deep mutual trust and understanding,” she said.\nThe spokesperson said the economic development and long-term prosperity of people was the government’s top priority.\nShe said Pakistan believed that regional economic connectivity would provide a critical stimulus for creating broad-based growth across the region.\n“We have reiterated many times that our total public debt relating to CPEC projects is less than even 10% of the total debt. Moreover, the public debt obtained from China has a maturity period of 20 years and the interest is 2.34 percent. If grants are included, the interest value slides down to about two percent,” the spokesperson explained.\nThus, the claims made by some of the commentators and public officials on Pakistan’s debt obligations relating to CPEC were contrary to facts.\nShe reiterated that CPEC, a long-term project, had helped address development gaps in energy, infrastructure, industrialization, and job creation.\nThe spokesperson said Pakistan and China had several mechanisms to discuss matters of mutual interest and both the countries were regularly in touch to address those issues bilaterally.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:16.560Z"
}
