{
  "title": "Shehryar asks UN to impose economic, military sanctions on India",
  "link": "https://www.app.com.pk/national/shehryar-asks-un-to-impose-economic-military-sanctions-on-india/",
  "date_published": "2020-05-23T23:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):Chairman Parliamentary Committee on Kashmir Shehryar Khan Afridi Sunday asked United Nation (UN) and developed countries to impose economic and military sanctions on India for genocide of Kashmiri people and minorities for imposing black law of Public Safety Act (PSA).\n“It is high time for UN and developed countries to impose economic and military sanctions on India for genocide of Kashmiri people and minorities and for imposing black law of PSA,” Shehryar Khan Afridi expressed these views during his visit to Chakoti Sector at the Line of Control (LOC) on the day of Eid-ul-Fitr. He also spent time with troops stationed at forward posts, said a news release.\nGeneral officer commanding Major General Amir Ahsan Nawaz briefed Shehryar Khan on the occasion.\nAddressing the troops, Shehryar Khan Afridi said, “Kashmiris live in the hearts of every Pakistani.”\nHe said Prime Minister Imran Khan had emerged as a dynamic diplomat on Kashmir around the world by becoming the true ambassador of Kashmiri people.\nImran Khan, he said, had presented the Kashmir cause with a new dimension to it due to which the world was now highlighting the Kashmir issue.\nHe said the government of Pakistan and its people had been working side by side to liberate Kashmiris from Indian domination.\nHe said on the direction of Prime Minister Imran Khan, he had come to celebrate Eid as the Chairman Kashmir Committee in Azad Kashmir to show solidarity with the soldiers who had made sacrifices for the protection of the homeland at forward posts.\nAfridi greeted Eid to all the families of martyrs in Jammu, Sirinagar, South Kashmir, North Kashmir and Azad Kashmir.\nHe felicitated Eid to every family whose house or property was destroyed in the bombardment by Indian forces.\nHe said he stands with every family whose children or youth suffered from pellet guns.\nThe chairman said due to effective strategy of Prime Minister Imran Khan, the world was now raising its voice on Kashmir.\nReferring to recent reports of the US Congressional Commission on Human Rights and Religious Freedom, Shehryar Khan said that it was time for the United Nations and developed countries to stop genocide of Kashmiri people and minorities in India.\nHe appealed international bodies to impose economic and military sanctions on India in response to the PSA laws followed by fascist Modi’s government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:22.081Z"
}
