{
  "title": "UN urged to take India to task for Kashmiris’ woes",
  "link": "https://www.app.com.pk/national/un-urged-to-take-india-to-task-for-kashmiris-woes/",
  "date_published": "2022-03-29T05:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):The All Parties Hurriyat Conference has called upon the UN Secretary General Antonio Guterres to take India to task for ruthless killings, arbitrary arrests, fake encounters and destruction of residential houses in the garb of so-called cordon and search operations.\nAccording to Kashmir Media Service, the APHC leadership in a statement issued in Srinagar said the peace-loving people of Jammu and Kashmir were facing the brunt of Indian state terrorism for refusing to relinquish their struggle for right to self-determination in accordance with the UN resolutions.\nThe APHC leadership said that the UN, OIC and the European Union must rise to the occasion to resolve the Kashmir dispute in its historical perspective.\nMeanwhile, families of the illegally detained Hurriyat leaders and activists have complained that the Modi-led fascist Indian regime was inhumanely treating them in different jails of India and the occupied territory.\nTalking to the media persons, they called upon the United Nations Human Rights Council to send its teams to ascertain the plight of the Kashmiri detainees in hell-like Indian jails.\nOn the other hand, transporters across occupied Jammu Kashmir are gearing up to observe a hunger strike on Wednesday and general strike on April 9 against a series of anti-transporters’ orders issued by the occupation regime in the territory.\nWhile equating the orders with farm laws, the transporters said these orders are meant to break the backbone of the Kashmiris associated with the business.\nAs the row over the controversial movie, ‘The Kashmir Files’ refuses to die down, a cleric addressing a gathering at a Jamia Masjid in Rajouri called for a ban on the film, slamming it for ignoring the blood and pain of Muslims.\nMoulvi Farooq said that thousands of Kashmiri Muslims had been killed, women widowed and houses were destroyed by Indian troops but their pain was never noticed by the film makers.\nIn growing intolerant India for minorities, a Muslim girl student was arrested in Karnataka’s Bagalkot district on the ridiculous charge of wishing people on Pakistan Day.The girl, identified as Kuthma Sheikh, reportedly posted the message of peace, unity and harmony to every nation on her whatsapp status.The arrest was made at the complaint of Hindutva activists. In another incident, a Madya Pradesh university has ordered a probe after some Muslim girls wearing hijab were seen offering prayers in the university campus.The All India Muslim Personal Law Board has moved the Indian Supreme Court challenging the Karnataka High Court’s verdict banning hijab in educational institutions.The Muslim Personal Law Board, in its petition, said the Karnataka High Court’s judgment has proceeded with erroneous reasons to address the issue.",
  "retrievedAt": "2025-08-11T14:37:37.230Z"
}
