{
  "title": "Conspirators to fail in toppling Khan’s government: Rashid",
  "link": "https://www.app.com.pk/national/conspirators-to-fail-in-toppling-khans-government-rasheed/",
  "date_published": "2022-03-29T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): Minister for Interior Sheikh Rashid Ahmed on Tuesday said an international conspiracy and investment was made to topple the government of Imran Khan adding that the conspirators would fail in their designs.\nAddressing a press conference here, the minister said foreign funding was being made for no confidence motion against the Prime Minister.\nImran Khan would fight till last ball and negotiation was underway with allies, he added. He said debate on no-confidence motion would start from March 31 and voting would be held on April 3.\nHowever, he said that the opposition could not bring 172 members required for success of the no confidence motion.\nHe reiterated that he stood firmly with Imran Khan whether he (PM) remained in power or not. Lauding the decision of Pakistan Muslim League (PML-Q) to support PM Imran Khan, he expressed the hope that MQM would also follow the PML-Q.\nThe entire nation stood by the PM and the mammoth PTI public gathering on March 27 was its manifestation, he added. He said the governor Punjab would issue notification of Punjab Chief Minister’s resignation.\nHe said containers have been removed and now all roads were clear in the federal capital. Rasheed said security forces arrested four terrorists harboring nefarious designs from Islamabad and they would be tried in anti-terrorism courts.\nSimilarly, as many as four terrorists involved in attack at Mosque in Peshawar were also killed in an operation. He appreciated interior ministry, Rangers, FC, Police, local administration and other law enforcing agencies for maintenance of law and order and provision of security to all public gatherings and marches.\nPersonnel of FC, Khyber-Pakhtunkhwa, Azad Jammu and Kashmir have been sent back while Rangers would also be withdrawn soon.  Replying to a question, he said he was not a part of the government negotiation team with MQM. However, he said the decision of MQM would be very decisive.",
  "retrievedAt": "2025-08-11T14:37:34.753Z"
}
