{
  "title": "Third Int’l conference on Space continues in full swing on second day",
  "link": "https://www.app.com.pk/national/third-intl-conference-on-space-continues-in-full-swing-on-second-day/",
  "date_published": "2022-03-29T09:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): The 3rd International Conference on Space (ICS-22) on “Role of Space Technology and Applications in Socio-Economic Development” continued in full swing for the second day with national and international speakers deliberating upon the latest developments in space technology and applications.\nThe conference is being arranged by Pakistan Space and Upper Atmosphere Research Commission (SUPARCO), in cooperation with Asia Pacific Space Cooperation Organization (APSCO), Islamic World Educational, Scientific and Cultural Organization (ICESCO) and Inter Islamic Network on Space Sciences and Technology (ISNET).\nMore than 56 papers were presented on the second day on the various faculties of space sciences and research.\nThe papers presented by local and international participants were under the premise set by the 5 themes of the international space conference (Space Science, Space Technology, Space Applications, Space Education and Outreach, Space Law, Policy and Regulations)  A plenary session on “Emerging Technologies in Space Applications” and “Special Session on ISNET’s Outstanding Award Program on SDGs through Space Science and Technology” were also held.\nIn the special session, results of ISNET’s first outstanding award program on SDGs were announced and talks were given by Mr. Adnan H. Aliani, Director Strategy and Programme Management Division and Officer-in-Charge Sub regional Office for South and South-West Asia at UNESCAP, Mr. Mazhar Hussain Director of Economic and Social Research Department at Statistical, Economic and Social Research and Training Centre for Islamic Countries (SESRIC), Dr. Laurent Durieux Coordinator of the Sustainable Development Goals Engagement at Group on Earth Observations (GEO) Secretariat and Ms Barira Hanif from SGDs Coordinator at NUST.\nAfter the poster review session, Workshops on “Applications of Remote Sensing Data and Hazard Modeling”, “Microgravity and Space Farming” and “Space Technology: Navigation Error Analysis Tool (NEAT)” concluded the activities of the conference. The three-day conference aims to connect space professionals, decision-makers, academicians, researchers and scientists as well as students of space science and technologies to showcase their achievements, share latest developments in space technology and applications, and voice their opinions on important space and development issues in a highly interactive and cross-disciplinary environment.\nEminent experts of different faculties of space sciences and technologies from Azerbaijan, Australia, Austria, Bangladesh, China, Canada, Egypt, Iran, Italy, Jordan, Korea, Malaysia, Mexico, Morocco, Nigeria, Peru, Switzerland, Senegal, Turkey, UAE and many more are attending the event. The concluding ceremony of the conference will be held on March 30 (Wednesday).\nPresident of Islamic Republic of Pakistan, Dr Arif Alvi will be chief guest of the ceremony",
  "retrievedAt": "2025-08-11T14:37:34.160Z"
}
