{
  "title": "Opposition’s ploy of no confidence set to prove a fiasco: Farrukh",
  "link": "https://www.app.com.pk/national/oppositions-ploy-of-no-confidence-set-to-prove-a-fiasco-farrukh/",
  "date_published": "2022-03-29T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): Minister of State for Information and Broadcasting Farrukh Habib said on Tuesday that the opposition had failed and its ploy of no confidence motion was set to prove a flop.\nTalking to the media persons outside the Supreme Court he said, “Opposition has failed, their game has flopped , external forces want to destabilize Pakistan”.\nThe minister said that the puppets of foreign masters were not going to get anything out of the ongoing situation.\nThe Opposition offered PML-Q chief ministership but Chaudhries of Gujrat preferred to work with PTI, he said, adding that today another surprise would jolt the opposition.\nFarruk said that threats were made for non-compliance on March 7 one day before a no-confidence motion was filed which was the proof that both were linked. He said that absconder Nawaz Sharif met with many anti-Pakistan people including Mohibullah.\nAbout the ‘Amr Bil Ma’ruf’ rally of Prime Minister Imran Khan he said it was a historic meeting as motorways, highways and all Islamabad roads were packed with PTI workers.\nCriticizing PML-N leader Rana Sana Ullah, he said from the same constituency from which he (Rana) had been a minister twice, he could not win in the 2018 election from even one polling station.\nThe minister said that the Article 63A case was pending in the Supreme Court and dissident members intensified contacts for return.\nHe opined that the vote of a Member of the National Assembly was thetrust of millions of voters, and the people of  the constituency would not spare the dissident MNAs.\n“We have taken allies with us before, we will take them with us in future also,” Farrukh Habib remarked.\nTaking a jibe at the opposition, he said the people who had readied “sherwanis” were about to lose as no confidence motion was doomed.\nTaunting the opposition, he said Shehbaz Sharif was to drag Zardari on the streets of Larkana, while the PPP leaders were not supposed to greet Nawaz Sharif and Fazlur Rehman was to unite the world of Islam, but nothing happened.\n“We have to thwart the external conspiracy, our negotiations with other allies in the final stages”, said Farrukh Habib. The number of members of the opposition on the day of the no-confidence vote would also be a surprise, Farrukh Habib remarked.\nFarrukh Habib said that the opposition’s long march which started from Lahore also ended in a fiasco.\nHe asked where Fazlur Rehman was when 400 drone strikes took place in Pakistan that were authorised by Nawaz Sharif and Asif Zardari. To a question he said that Prime Minister Imran Khan represented the sentiments of the Muslim Ummah and courageously fought the case against Islamophobia.\nThere was already an electoral alliance with the PML-Q, and the PTI did not offer the chief ministership of Punjab to anyone outside the alliance, Farruk said in reply to a question.\nHe said that Usman Bazdar was a courageous soldier of Imran Khan who had stood by him.",
  "retrievedAt": "2025-08-11T14:37:30.726Z"
}
