{
  "title": "Digitalization need of hour to improve work environment in Parliament: NA Speaker",
  "link": "https://www.app.com.pk/national/digitalization-need-of-hour-to-improve-work-environment-in-parliament-na-speaker/",
  "date_published": "2022-03-29T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): National Assembly Speaker Asad Qaiser on Tuesday said that digitalizing the work place would improve efficiency and productivity in the working environment of Parliament.\nThis is an era of paper less and digital based official environment, he expressed these views while inaugurating the project of “re-imagining the National Assembly of Pakistan with Google Workspace’s Advanced Productivity and Collaboration Tools” in Parliament House.\nHe also said that ensuring privacy in this digital age is a challenge and stressed on the need to ensure end to end encryption for this project .\nAsad Qaiser has said that it is first Parliament in the region which has adopted Google Workspace to digitize work processes and enhance productivity and collaboration between its members.\nHe also said that this is a per the Prime Minister’s vision of Digital Pakistan under project  “Office Communication and Productivity Suite of Applications for the National Assembly of Pakistan.”\nWhile many technology firms competed for the tender, Tech Valley, a local partner for Google Cloud in Pakistan, won the public tender with Google Workspace’s easy-to-use, secure and innovative digital productivity and collaboration tools.\nThe Speaker appreciated the efforts of the team and said: “With the latest technology and tools being enabled in the National Assembly of Pakistan in the past few months, Google Workspace has been a tremendous addition that will assist members to be more efficient.”\nGoogle Tech Valley CEO briefed that after the successful deployment of Google Workspace, a “Google Day” was observed at the National Assembly to mark this important milestone of digitizing the National Assembly’s back-end processes. During the event, a live demonstration was provided to all members to educate them on how to best leverage these tools to make their day-to-day operations more efficient.\nCEO Tech Valley, Umar Farooq added: “Multiple national and international teams have made sure that the productivity tools used by the National Assembly of Pakistan are completely secure and encrypted.”He also said that Google Workspace provides an innovative, flexible and secure cloud-native solution for people and organizations to achieve more. Its suite of tools allows users to collaborate from anywhere, anytime.\nThe solution provides a custom email for Pakistan’s National Assembly and includes applications like Email, Calendar, Meet, Chat, Drive, Docs, Sheets, Slides, Forms, Sites, and more.\nTimothy Paolini, Head of APAC Region, Google, who flew in to join the event, said: “More than three billion people worldwide use Google Workspace to learn, work and stay connected to those that matter to them. Where there’s been a fundamental shift in where and how we work, we’re proud to be supporting the National Assembly of Pakistan and empowering its members with the innovative and enterprise-grade tools they need to connect, create, and collaborate flexibly and securely on any device – whether they are returning to the office, working from home, or serving citizens on the front lines.”\nHe said that With Google Workspace, local teams are expecting more efficient and effective communications. Moreover, with the elimination of unnecessary tasks, such as rotating files from one office to another or storing and retrieving critical documents from a physical location just to get feedback from teams, these digital tools are transforming the Assembly’s traditional and time-consuming practices.Later on Speaker National Assembly Asad Qaiser and Deputy Speaker National Assembly Qasim Khan Suri also  inaugurated CCTV Control Room ( Security and Surveillance) in Parliament.",
  "retrievedAt": "2025-08-11T14:37:25.537Z"
}
