{
  "title": "President for producing IT professionals to fulfill market needs",
  "link": "https://www.app.com.pk/national/president-for-producing-it-professionals-to-fulfill-market-needs/",
  "date_published": "2022-03-29T15:36:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 29 (APP): President Dr Arif Alvi on Tuesday stressed the need of producing information technology (IT) professionals to fulfill the market requirements.\nThe Federal Government had introduced a very good IT policy and the industry could take advantage of it, he said addressing the 8th Pakistan CIO Summit and Expo 2022, organised here by the Solutions Inc.\nPresident Alvi said there were many opportunities in data, cyber security, artificial intelligence and other areas of the IT sector. With the cyber security becoming a big phenomenon, he added, the world would need some 8 million cyber security professionals by 2030.\nLikewise, he said, artificial intelligence was embedded in every human endeavour. There was a huge data available in the world, but there was a dire need to analyse it, the president added.\nHe said the IT sector would likely to make further progress. The Third Industrial Revolution had changed the situation of the world, while the Fourth Industrial Revolution brought a big change in the shape of digital economy and IT industry.\nPresident Alvi said the incumbent Federal Government since its inception had focused on the IT sector. The people had witnessed such change after 40 years.\nThe IT policy, he added, had given income tax and duty exemptions, and other incentives to the companies. The government apart from export of traditional items, encouraged the IT export also.\nHe suggested the investors and companies to invest in changing IT innovations.\nThe president said women had also many opportunities in the IT sector. They could work from home and help their families financially.\nHe said the universities had been asked to teach their students as per market needs.\nPresident Alvi said the country had to improve in the sea technology also. He also highlighted the importance of special technology zones and the steps taken for ease of doing business in the country.",
  "retrievedAt": "2025-08-11T14:37:28.258Z"
}
