{
  "title": "PM reiterates Pakistan’s principled position for resolution of Russia-Ukraine conflict through dialogue",
  "link": "https://www.app.com.pk/global/pm-reiterates-pakistans-principled-position-for-resolution-of-russia-ukraine-conflict-through-dialogue/",
  "date_published": "2022-03-29T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 29 (APP): Prime Minister Imran Khan Tuesday reiterated Pakistan’s principled position in support of immediate cessation of hostilities and resolution of Russian-Ukraine conflict through dialogue and diplomacy.\nThe prime minister received a telephone call from President of Ukraine Volodymyr Zelenskii.\nDiscussing the latest situation in Ukraine, the prime minister expressed deep regret that the military conflict was continuing.\nThe prime minister underlined that non-partisan countries like Pakistan were in a position to play a helpful role in reinforcing efforts for cessation of hostilities and a diplomatic solution.\nHe said that he had been persistently highlighting the adverse economic impact of the conflict on the developing countries, manifested in rising prices of oil and commodities.\nPrime minister Khan emphasized the importance of humanitarian relief for the civilians and underlined that Pakistan had dispatched two C-130 airplanes with humanitarian relief assistance for people in Ukraine.\nRecalling the recent OIC-Council of Foreign Ministers session in Islamabad, the prime minister informed that the foreign ministers of the Islamic countries expressed deep concern at the deteriorating security and humanitarian situation arising from the conflict in Ukraine.\nThe foreign ministers called for an immediate cessation of hostilities and expressed willingness of OIC member states to support and facilitate the dialogue process, he added.\nThe prime minister thanked for the support extended by Ukrainian authorities to evacuate Pakistani students and nationals as well as the embassy staff.\nHe also appreciated the efforts made by other countries to facilitate diplomatic solution.",
  "retrievedAt": "2025-08-11T14:37:28.068Z"
}
