{
  "title": "PM writes to MNAs to abstain from voting on no-confidence motion",
  "link": "https://www.app.com.pk/national/pm-writes-to-mnas-to-abstain-from-voting-on-no-confidence-motion/",
  "date_published": "2022-03-29T17:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): Pakistan Tehreek-e-Insaf Chairman and Prime Minister Imran Khan Tuesday directed his party’s Members of the National Assembly to abstain from voting on the no-confidence motion moved by the opposition against him.\nThe prime minister, also the parliamentary leader of the PTI in the National Assembly wrote a letter to the PTI legislators asking them to strictly follow the directions as “every/any violation of these directions shall be treated as express defection in terms of Article 63-A.”\nSigned by the prime minister and shared by PTI on its official Twitter handle, the letter mentioned that on March 28, leave was granted to move the resolution in terms of Rule 37 (4) of the Rules of Procedure and Conduct of Business in the National Assembly, 2007.\nThe PTI chairman told the legislators that the said resolution would be voted upon within a period of seven days.\n“All the members of the Parliamentary Party of Pakistan Tehreek-e-Insaf in the National Assembly of Pakistan shall abstain from voting/not attend the meeting of the National Assembly on the date when the said resolution is set out on the agenda of the National Assembly for voting,” he said\nHe directed that no PTI member would attend or make them available at the time and day of voting on the resolution of no-confidence.\nThe duly designated parliamentary members would speak on behalf of the PTI during the course of the debate on this motion.\n“All members are required to adhere to these directions in true letter & spirit and keep in mind the intent behind the provision of Article 63-A of the Constitution of Pakistan, 1973. It is made clear to all members that no member shall violate any instruction or extend any favor, relating to the vote of no confidence, to any other parliamentary party/group whatsoever,” the PTI chairman added.",
  "retrievedAt": "2025-08-11T14:37:23.726Z"
}
