{
  "title": "Religious scholars for banning anchorpersons, not well-versed with Islamic tenets",
  "link": "https://www.app.com.pk/national/religious-scholars-for-banning-anchorpersons-not-well-versed-with-islamic-tenets/",
  "date_published": "2022-03-29T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):Religious scholars and Ulema on Tuesday proposed to ban anchorpersons, not well-versed with Islamic tenets, during the special transmission of Ramazan in a bid to avoid controversies.\nIn a meeting with Religious Affairs and Interfaith Harmony Minister Pir Noor-ul-Haq Qadri, they also expressed profound concerns about some unethical programmes telecast in the holy month of Ramazan in the past, besides extending full support to the minister’s letter written to Prime Minister Imran Khan on the matter.\nThey said due to their inadequate knowledge, they could create religious chaos in the country.\nThey were of the view that private television (TV) channels should stop broadcasting such stuff in the wake of entertainment and recreational shows, which were directly in contradiction with the Islamic injunctions.\nThey should produce such informative programmes which could create religious harmony and remove differences among the people of all segments of the society, Ulema and Mashaikh maintained.\nThey also pointed out some advertisements being telecast on private TV channels which were against social, cultural and religious norms.\nIt may be mentioned that Minister Noor Qadri had written a letter to Prime Minister Imran Khan proposing that TV programmes pertaining to the Ramazan transmission should be hosted by religious scholars in order to avert controversies.\nHe said for the last few years, some anchors, who were not well-versed with Islamic teachings, had been conducting programmes during the holy month of Ramazan. Due to lack of Islamic knowledge, they had created many religious controversies and social media hype having negative impacts on the people, he added.\nNoor Qadri said there must be a dress code for the hosts and participants of programmes to keep the sanctity of the holy month of Ramazan. No controversial topics should be discussed in the programmes, while keeping the respect of all sacred personalities in view, he added.\nHe said the TV channels should avoid airing entertainment and recreational shows particularly at Sehr and Iftar timings. Moreover, such stuff should also be avoided in the religious programmes. Unethical stuff and advertisement should not be broadcast, he added.\nHe said the TV programmes should be based on such content which not only imparted true Islamic knowledge, but also promote religious harmony across all sections of the society.\nThe minister urged the prime minister to direct the Information Ministry and the Pakistan Electronic Media Regulatory Authority to issue such guidelines for all the TV channels.\nCouncil of Islamic Ideology Chairman Dr Qibla Ayaz, Central Ruet-e-Hilal Committee Chairman Maulana Abdul Khabir Azad, Arif Hussain Wahidi, Tanveer Ahmed Alvi, Ibrahim Khalil Al-Fazli, Ghulam Rasool Nasir, Syed Iftikhar Hussain Naqvi, Mufti Zamir Ahmed Sajid and Sheikh Nayar Abbas Mustafvi attended the meeting.",
  "retrievedAt": "2025-08-11T14:37:27.847Z"
}
