{
  "title": "UK Lord questions trade deal with India citing its poor human rights record",
  "link": "https://www.app.com.pk/national/uk-lord-questions-trade-deal-with-india-citing-its-poor-human-rights-record/",
  "date_published": "2022-09-07T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP): Member of the UK’s House of Lords, Lord Qurban Hussain has questioned the British government’s proposed trade deal with India, asking how it would meet Britain’s foreign policy and international principles considering the “one of the worst” human rights record of the South Asian country.\n“Looking at India’s record on human rights through the eyes of renowned international human rights organisations such as Amnesty International, Human Rights Watch and Genocide Watch, India is seen to be one of the worst human rights offenders in the world,” Lord Qurban said in a debate at the British parliament.\nForcefully and convincingly contesting the British government’s proposal of trade agreement with India, he said according to the 2022 Amnesty International report, the Indian government had drastically intensified the repression of rights in Jammu and Kashmir in the three years since the change in the status of the region.\nHe said he was eager to see the UK’s trade links with other countries, including India, improved, but he always believed that “our trade must be linked with human rights.”\nThe Lord of Pakistan-origin said the Amnesty International report noted how civil society at large, and journalists, lawyers and human rights defenders in particular, had faced relentless interrogations, arbitrary travel bans, revolving indoor detentions and repressive media policies. The access to appeals or justice via the courts and human rights bodies has also been blocked.\nAmnesty has also said that “civil society and media in Jammu and Kashmir have been subjected to a vicious crackdown by the Indian government, which is determined to stifle dissent using draconian laws, policies and unlawful practices in their arsenal… By harassing and intimidating critical voices, authorities are targeting all credible, independent sources of information in and about Jammu and Kashmir.”\nHe also quoted a 2022 Human Rights Watch report saying, “Indian authorities intensified their crackdown on activists, journalists, and other critics of the government using politically motivated prosecutions in 2021 … BJP supporters engaged in mob attacks or threatened violence, while several states adopted laws and policies to target minority communities, particularly Christians, Muslims, Dalits, and Adivasis.”\nLord Qurban said the Genocide Watch’s 2022 report, an expert, who is said to have predicted the massacre of the Tutsis in Rwanda years before it took place in 1994, warns that genocide of Muslims in India could be about to take place. Gregory Stanton, the founder and director of Genocide Watch, warned that genocide could very well be happening in India.\n“In the light of these independent reports, how can the Minister reassure this Committee that the UK’s trade deal with India would meet our foreign policy and international principles and standards,” he questioned.\nThe Lord said also asked what the UK government would do if India continued with its human rights abuses and chose to ignore those principles and standards.",
  "retrievedAt": "2025-08-11T15:32:22.998Z"
}
