{
  "title": "PTI leaders disown Khan’s statements spewing hate against ‘institutions’: Khawja",
  "link": "https://www.app.com.pk/national/pti-leaders-disown-khans-statements-spewing-hate-against-institutions-khawja/",
  "date_published": "2022-09-07T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP):Minister for Defence Khawaja Muhammad Asif on Wednesday said the leaders and close associates of Pakistan Tehreek-e-Insaf (PTI) had disowned their Chairman Imran Khan’s statements spewing hate against state institutions.\nAddressing a joint presser flanked by Federal Minister for Finance Miftah Ismail, the Minister lambasted the former premier for justifying his spiteful remarks against the senior leadership of the armed forces as his discourse on meritocracy.\nKhawaja said Imran Khan had earlier commented on the appointment of Chief of Army Staff (COAS) and yesterday had made a new interpretation of his previous narrative.\n“He is doing it under a deliberate design to attack and assess reaction of the state institutions. First attack, make institutions controversial and weak and observe their reaction then after some calculation say I just intended to discuss meritocracy through critical arguments,” the Minister said.\nHe added that throughout his political career all appointments were made on merit in the tri-services of the country ‘accept one or two’.\n“The nominations of four or five high ranking officers are sent from the leadership of the armed forces that are appointed by the Prime Minister after necessary consultation,” he mentioned.\nThe close associates of Imran Khan in his party were abstaining from commenting on his statements, he said, adding, “They are avoiding from commenting on it and a day earlier President of Pakistan who has been nominated by PTI disassociated himself from what Imran Khan had said.”\nHe sought Imran Khan to prove when there was any appointment of the armed forces’ chiefs was done without merit.\n“The current COAS was appointed by our previous government and he endorsed his appointment. In three years, he (Imran Khan) has applauded the current COAS perhaps the most appreciated by him.”\nHe alleged that Imran Khan as prime minister used to remain absent from many important meetings chaired by the COAS that were of critical nature.\nKhawaja added that Khan had left many core issues of political and security nature on the COAS to handle. After losing power he was criticising the military leadership and deliberately creating doubts about the next inline COAS.\nHe made a flurry of queries on Imran Khan asking him, “Was Buzdar’s appointment on merit? Or the appointment of Chief Minister KP was on merit? What he (Imran Khan) has done on merit? BRT inquiry was silenced. Is that merit? Tosha Khana diamonds case? 180 million pounds sent here by National Crime Agency, UK with its letter in the name of Supreme Court and was sent in Bahria Town’s liability account.\nIs that justified? Sohawa University land was procured and only 38 students were being enrolled and there was no such university on ground. Is that merit? Is selling the Toshah Khana gifts at F-7 shop merit?”\nHe quoted the maxim of law saying, “Who comes into equity must come with clean hands.” He continued, “Does this man has clean hands? No he had not. Does he probe medicines, sugar and wheat scams? He did not probe any.”\nHe commented that Imran Khan after his ouster through no confidence motion started claiming US and others for conspiring it. “You have accused US for it and then hired a lobbyist on US$25,000 to appease the US. Is that merit?”\nHe queried that what kind of merit was talking about and there should be a clear inquiry into all the allegations level against Khan.\n“We have sent recommendation for Tosha Khan case probe. We have completed the inquiry of 18 million pounds case and NAB has also taken notice of that. Imran Khan must come and face his trial.”\nHe noted that Nawaz Sharif and Maryam Sharif faced 200 court hearings in various cases personally and he used to come on video link.",
  "retrievedAt": "2025-08-11T15:32:28.151Z"
}
