{
  "title": "UNHCR hands over relief items to Sindh govt",
  "link": "https://www.app.com.pk/national/unhcr-hands-over-relief-items-to-sindh-govt/",
  "date_published": "2022-09-07T10:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP): The United Nations High Commissioner for Refugees (UNHCR) has handed over thousands of tents and other emergency relief items to the Sindh government which will benefit hundreds of thousands of flood-affected people in the province.\nThe first three of nine scheduled flights arrived in Pakistan on Monday – with the other six scheduled this week, said a statement issued here.\nThe UNHCR trucks carrying relief items were also on the road from Uzbekistan, with more convoys scheduled. Emergency relief items are being transported from Peshawar and had already reached Sukkur Humanitarian Response Facilities, the statement added.\n“A total of 18,800 tents, 310,000 blankets, 76,000 buckets, 56,500 jerrycans, 67,500 plastic tarpaulins, 112,000 sleeping mats, 150,000 mosquito nets, 140,000 solar lamps, 24,700 kitchen sets, 32,000 sanitary napkins, 4,500 soap and 3,500 dignity kits are being given to the Provincial Disaster Management Authority Sindh, the UNHCR said.\nUNHCR’s Assistant Representative for Protection Leyla Nugmanova called on Sindh Chief Minister Syed Murad Ali Shah.\nThe CM’s team briefed the UNHCR officials about the current situation in various flood-affected districts and the damages caused by floods.\nThe UNHCR Representative and Director General of PDMA Syed Salman Shah signed a memorandum to handover the items for immediate distribution to the flood victims.\nThe Sindh CM welcomed the UNHCR’s contribution, terming it timely and important. “The world is yet to understand the scale of this disaster and devastation by floods,” he said.\nLeyla Nugmanova said, “UNHCR is lending all possible support to Pakistan in this hour of need.\n“Based on our forty years of partnership and Pakistan’s extraordinary generosity for refugees, we cannot let the country and its people handle this colossal tragedy alone.\n“The world has to understand what the people in Pakistan are going through and has to step in to help fast,” she added.\nThe UNHCR has been part of the monsoon response since July when the agency started to provide relief items and assistance for refugees and host communities. In addition, the UN Refugee Agency directly provided tents to the flood affected refugees and host communities through its partners.",
  "retrievedAt": "2025-08-11T15:32:26.693Z"
}
