{
  "title": "Imran Khan’s ego ruined economy, foreign policy: Musadik",
  "link": "https://www.app.com.pk/national/imran-khans-ego-ruined-economy-foreign-policy-musadik/",
  "date_published": "2022-09-07T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP): Minister of State for Petroleum Dr Musadik Malik on Wednesday said the national economy and foreign policy were ruined due to the ego of Imran Khan, who nowadays claimed himself as a “savior” of the country.\n“It was the ego of Imran Khan which severely damaged the economy and foreign policy of Pakistan and now it is becoming the cause of his (Imran Khan) own destruction,” Musadik said while addressing a news conference.\nCiting a proverb “the fish is the last to see the water”, he said it was only Imran Khan who was not worried about his actions, as the whole nation knew what he was doing.\nIt was quite surprising that a person, who destroyed the country during his four-year rule, now considered himself a savior, he added.\nThe minister recalled how Imran Khan and his government had created energy and electricity crises in the country by patronizing the cartels and mafias.\nPakistan. he said, was was witnessing up to 14 hours of load-shedding and facing a severe gas crises when the Pakistan Muslim League-Nawaz (PML-N) came into power in 2013.\nHe said the PML-N government, during its previous tenure, made extensive efforts to end the gas and electricity shortages. 11,000 megawatts of electricity was added to the national grid, while an LNG terminal with 1.2 billion cubic feet capacity was installed.\nHowever, the Pakistan Tehreek-e-Insaf leaders while in power, only made claims that the electricity capacity installed by the PML-N government was excessive. The PTI government failed to increase the electricity generation capacity by even a single megawatt despite the rapid increase in population and demand for the commodity.\nThe minister regretted that the PTI government did not launch a single new mega project and instead changed the name of the old ones which were already contributing to the socio-economic development of the country.\nThe Imran-led government, he added, changed the name of Benazir Income Support Programme and the youth development related projects with Ehsaas Programme and Kamyab Jawan Programme, respectively.\nHe said Imran Khan as prime minister cut the ribbons of only those projects which were almost completed during the tenure of PML-N government.\nMusadik said the PML-N gave the country thousands of kilometres of road infrastructure, brought investment of billions of dollars to the country, and created massive job opportunities, but the PTI only did the lip-service during its four-year rule.\n“Nothing is on the ground whether it were trees under the billion tree tsunami, calves or chicken,” he remarked.\nThe minister said the circular debt during the PML-N government was Rs 1,100 billion, while during the PTI government it was increased to Rs 2,500 billion.\nTo a question, he said action against Imran Khan would be initiated as per the law of the land. “We do not believe in victimization, but the action will be taken against the violators as per the law and constitution,” he added.\nHe criticized the PTI chairman for hiring the services of lobbyist David Fenton in the United States, who was known as the founder of the denuclearization programme, and also getting money and land from Malik Riaz to protect his money-laundering and receiving millions of pounds from Arif  Naqvi, Chief Executive of the Abraj Capital and Investment Company, indicted by the US courts in a range of cases and could get up to 290-year jail.\nHe underlined that two mega economic scandals were made in the history of the country. The first was of $250 million by Malik Riaz in Bahria Town, which was as per the cabinet signed the paper and as per a Pakistani representative in the United Kingdom who signed the document in the British court; the amount was gifted to Malik Riaz which was one-fourth of the International Monetary Fund’s bailout package and were deposited in his account.\n“It was given in lieu of 400 kanals land which was registered in the name of Imran Khan and his wife,” he added.\nThe second case, he said, was related to Arif Masood Naqvi who was likely to be charged with 290 years imprisonment in the UK for money laundering. Imran Khan during his regime waived off Rs 250 billion investment to be made by K-Electric in Dattang Coal Project which would have benefited the Karachiites.\nDr. Musadik said the PTI government also violated the commitments made with the IMF about the subsidies for getting financial assistance.\nThe minister said that the governments of Qatar and the United Arab Emirates had shown willingness to invest in Pakistan.\nTo another question he said to meet the gas demand in the upcoming winter, the government had already issued instructions to three companies to purchase the gas.\nMore natural gas would be available for consumers as compared to the last year, he added.",
  "retrievedAt": "2025-08-11T15:32:22.128Z"
}
