{
  "title": "Denmark to provide 120,000 liters of clean water per day in flood-affected areas of Sindh",
  "link": "https://www.app.com.pk/national/denmark-to-provide-120000-liters-of-clean-water-per-day-in-flood-affected-areas-of-sindh/",
  "date_published": "2022-09-07T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP):Ambassador-Designate of Denmark to Pakistan Jakob Linulf said that Denmark would provide a major drinking water facility in flood-affected areas of Sindh, which could provide up to 120,000 liters of clean water a day.\nThe Ambassador told the media on Wednesday, “we are happy to welcome the Danish Emergency Management Agency team in Islamabad. They will be operating a clean drinking water facility in Sindh.\nAnd they will be joined by another seven team members in Karachi tomorrow”. He added that this team would set up the water purification system in Sindh and would operate in Pakistan for weeks.\nHe said the Advanced Emergency Team from Denmark consisted of Erik Breum-Christensen (team leader), Johan Theil Nielsen and Søren Larsen.\nThe Ambassador also extended Denmark’s government’s sincere condolences to the victims of the flash floods (currently more than 1,300).\nDenmark’s key priority is to provide flexible and unearmarked funding to our humanitarian, strategic partners to allow them to respond quickly in times of urgent need, such as in the case of the ongoing flooding in Pakistan, he added.\nDenmark has also supported the UN’s (humanitarian) flash appeal for Pakistan with $1.33 million to the UN Refugee Organisation, UNHCR. This funding is provided in addition to our core annual funding for UNHCR’s work in Pakistan and the region of $ 6.7 million.\nUNHCR has already started its aid work and can expand its efforts with our support. He maintained that their focus is mainly on emergency relief – providing tents and blankets – and protecting vulnerable groups, including women and children.\nDenmark is also the 6th largest donor to the UN’s Central Emergency Relief Fund (CERF), which has already provided $ 3.07 million almost two weeks ago (22.8 million DKK) for the relief work in Pakistan.\nIn addition, the Danish Emergency Relief Fund, which the Ministry of Foreign Affairs funds, has allocated almost 0.5 million USD for emergency assistance, the Ambassador added.\nHe said Denmark and Pakistan signed a Green Framework Engagement on August 31, 2022 and on August 10, 2022, our countries signed an agreement for Danish financing of sustainable infrastructure in Pakistan.\nThese engagements will allow us to cooperate more closely regarding green transition, sustainable development, and climate change mitigation. They will also assist with rehabilitation and reconstruction.\nDenmark has also offered immediate relief assistance to Pakistan and the Pakistani people who are going through this devastating crisis. “We especially share concerns about the drinking water in the affected areas.\nDiseases such as cholera, scabies, typhoid, and ringworms often occur in the wake of floods, especially due to the lack of accessibility to clean drinking water”, he concluded.",
  "retrievedAt": "2025-08-11T15:32:22.298Z"
}
