{
  "title": "Pakistan committed to reduce air pollution, emissions despite least GHG emitter: Sherry",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-reduce-air-pollution-emissions-despite-least-ghg-emitter-sherry/",
  "date_published": "2022-09-07T11:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Wednesday said despite contributing less than 1% of global greenhouse gas emissions, Pakistan was committed to improving air pollution and reducing emissions.\nIn her message on International Clean Air Day, the Minister said Pakistan at present stood at the forefront of the global environmental emergency where air quality and air pollution was one of the major environmental issues.\nMinister Rehman said, “Our cities and villages face air pollution. Pakistan is currently going through the ravages of climate catastrophe.”\nShe said the country was living through a devastating year of environmental disasters. Ministry of Climate Change in Pakistan was engaged in fighting air pollution on priority basis through its Clean Air Programme.\nThe objective of the program, she said was to coordinate activities and initiatives of major polluting sectors including industries, waste management companies and others.\nThe Ministry of Climate Change was working with various sectors to reduce dark carbon emissions, Sherry Rehman said, adding, “The Climate decade of our reckoning is now and not in 2050. This is a new normal and a dystopic one. So whatever goes down in one country effects the other.”\n“Climate change has no borders, the effects of climate change on one country will affect other countries as well,” Sherry Rehman said.\nShe suggested that all countries should make a coordinated and collective global effort to clean up their air. “Climate Change has no boundaries and we share the air that we breathe. Pakistan looks forward to working with all countries to invest in a clean and healthy future”, Sherry Rehman concluded.",
  "retrievedAt": "2025-08-11T15:32:26.153Z"
}
