{
  "title": "Germany pledges Euros 13 million for Pakistan’s flood victims",
  "link": "https://www.app.com.pk/national/germany-pledges-euros-13-million-for-pakistans-flood-victims/",
  "date_published": "2022-09-07T16:51:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 07 (APP): Federal Minister for Climate Change Senator Sherry Rehman received a call from German Minister Svenja Schulze (German Federal Ministry for Economic Cooperation and Development) and informed her on the destruction wreaked by the floods throughout the country, and the assistance required to carry out first response relief in the flood-hit areas effectively.\nMinister Svenja expressed her country’s sincerest condolences with deepest grief on the loss of precious lives and pledged Germany’s support of 13 million Euros for Pakistan in this challenging time, a news release said.\nApprising the minister of the damages incurred by the flood, Minister Rehman highlighted:“1/3 of the country is under water. The amount of rain we received this year is unprecedented, resulting in a ‘Monster monsoon.’ More than 33 million people are affected. Providing relief and rescue has become a mammoth challenge itself, since there is no dry land in sight in the southern province of Sindh, which is the worst hit.”\nDiscussing the need for meeting the humanitarian needs gap on the ground, plus the next challenge of rebuilding climate-resilient infrastructure, the federal minister remarked, “We are in dire need of transforming our social goals around climate adaptation and mitigation. Despite less than 1% contribution to the total GHG emissions, Pakistan is most severely impacted by the repercussions of the emissions.”\nThe federal minister discussed the ‘Germany Pakistan Climate Energy Initiative’ which focused on working towards enhancing Pakistan and German collaboration on the fight against climate change and energy issues.\nGerman Minister Svenja Shulze expressed solidarity with the people of Pakistan and assured the full support of the German government to for Pakistan in these trying times.\nThe main objective of the funds is to provide the most vulnerable sections of the population with assistance through an existing social security system. In addition, emergency equipment and logistical support can be provided by redirecting funds from ongoing projects.\nRehman thanked Minister Shulze for her phone call and support , and  reiterated Pakistan’s resolve to work with her German counterparts on building climate resilience together.",
  "retrievedAt": "2025-08-11T15:32:18.366Z"
}
