{
  "title": "Financial adviser for Roosevelt Hotel sale ‘quits’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The fin­ancial advisor for the privatisation of the Roosevelt Hotel in New York has resigned, forcing the Pri­vatisation Commission to look for a new firm.\n\nA leading global real estate services firm, Jones Lang LaSalle (JLL), acting as financial adviser for the hotel’s privatisation, has cited a “potential conflict of interest” for its decision.\n\nJLL, which had recommended the joint venture model for the Roosevelt, a 1,015-room historic hotel in Midtown Manhattan, has conveyed its decision to the Privatisation Commission.\n\nAnnouncing the resignation, the Privatisation Commission said on Thursday it was initiating the process to hire a new financial adviser on a fast-track basis to ensure that the privatisation of Roosevelt Hotel proceeds “in a transparent and competitive manner”.\n\nJLL has cited “hei­ghtened interest” in the hotel from many of its own clients and cancellation of its lease agreement with New York City as reasons for the decision to withdr­­aw from the assignment.\n\nJLL said these issues had put the company in a “compromising position” and it was resigning “to avoid any perceived or act­ual conflict of interest”.\n\nJLL was appointed as financial adviser in Janu­ary 2024 to advise the government on the privatisation of the hotel.\n\nThe company has alrea­­dy conducted due dilige­n­­ce on the property and sub­­mitted transaction str­ucture reports, analysing a range of options in line with international best practices.\n\nBusiness at the hotel was suspended in 2020 following financial losses incurred during the Covid-19 pandemic.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:17:59.569Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926444/financial-adviser-for-roosevelt-hotel-sale-quits",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:27:21.000Z"
}
