{
  "title": "Opposition alliance to hold another moot on 31st - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Achakzai says MPC ‘not symbolic’, aims to find durable solution to country’s problems\n• Salman Akram Raja asks people to express discontent on Aug 5 as per law, says Imran being denied legal help\n• MWM chief warns govt against obstructing protest, says will not stay silent in face of injustice\n\nISLAMABAD: Almost a week after finalising its formal structure, a six-party opposition alliance — including the PTI —said it will organise a multi-party conference in Islamabad on July 31 and Aug 1 to discuss the “deepening constitutional and political crises” and restore “true democratic representation”.\n\nIn a press conference held in the federal capital on Thursday, Tehreek Tahafuz Ayeen-i-Pakistan (TTAP) chief Mahmood Khan Achakzai, flanked by other alliance leaders, said it was time for a “serious” national dialogue to steer the country out of the troubled waters.\n\nMr Achakzai emphasised the conference would not be “symbolic”, saying it would bring together political parties, civil society and even “representatives from institutions” to find a lasting and durable solution to the problems facing the country. “From Gilgit-Baltistan to Gwadar, we will mobilise, street by street, door to door — but without violence and abuse because this struggle is principled and constitutional,” he added.\n\nHe said the opposition alliance was not formed for “political theatrics” but to restore true democratic representation through a neutral election commission, adding that it was the ‘first alliance’ not manufactured by the intelligence agencies.\n\nMr Achakzai criticised the ruling coalition for using force to suppress political opponents.\n\nHe demanded a neutral election watchdog to ensure fair representation, saying Pakistan must be governed by the ballot, not force. According to Mr Achakzai, the Shehbaz-led government has imposed control through force, which is undemocratic and unacceptable.\n\nSpeaking on the occasion, PTI Secre­tary General Salman Akram Raja said that as per PTI founder Imran Khan’s instructions, it was not just PTI’s movement but a movement representing every oppressed voice in Pakistan. “Today, we speak for all those denied justice and silenced by fear,” he said, adding that the TTAP was a “peaceful, constitutional and ideological” movement.\n\nHe asserted that Pakistan could not be run by force, as the only way forward was constitutionalism, democracy, and justice. “We urge the people to peacefully express their discontent on August 5, within constitutional bounds. This is a lawful call — no one should exploit it to justify state repression,” he said while referring to the PTI’s planned protest on Aug 5 marking the second anniversary of Imran Khan’s imprisonment.\n\nMr Raja claimed that Imran Khan was being subjected to a jail trial without access to his legal team. “I, as his lawyer, was deliberately prevented from participating in the proceedings which was a gross violation of due process and judicial transparency,” he maintained.\n\nMajlis Wahdat-i-Muslimeen (MWM) chief Allama Nasir Abbas said if democracy truly existed in Pakistan, the controversial decision regarding the reserved seats would not have been made.\n\nHe said he was disappointed that no other political party had condemned these decisions, as he accused the ‘system’ of playing a vile game with the public.\n\nThe MWM chief stressed that although the alliance did not believe in armed struggle, it would not remain silent in the face of injustice.\n\nHe announced plans for a countrywide protest on August 5, warning the government against any attempts to obstruct their demonstration.\n\nFurthermore, PTI Central Information Secretary Sheikh Waqqas Akram denounced the government’s approach ahead of the party’s planned protest movement on August 5.\n\nHe condemned the issuance of warrants for the arrest of Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur, former president Dr Arif Alvi and other key opposition figures, including Omar Ayub Khan, Asad Qaiser, Hammad Azhar, and Khalid Khurshid.\n\nHe also denounced the sentencing of the PTI protesters for their involvement in the November 26 demonstration, calling these actions a blatant attempt to suppress dissent and undermine peaceful political mobilisation.\n\nSpeaking on the occasion, TTAP leader Mustafa Nawaz Khokhar said that the first step of the movement was a multi-party conference, and all those who feel oppressed under the current government would be invited to participate in the moot.\n\nOn the occasion, PTI senior leader Babar Awan claimed that Imran Khan was a prisoner of conscience, who was allegedly being held in a solitary cell, denied basic human rights, medical care, and even clean water, which was a clear violation of international law and the Nelson Mandela prison rules.\n\n“The PTI founder is not only Pakistan’s most popular leader, but he is the hope of the people. Yet he is being treated worse than a prisoner of war. Even his lawyers and family were barred from meeting him on Thursday,” he lamented.\n\n“This is not justice — this is humiliation of democracy. If justice is denied, protest remains the only path,” Mr Awan added.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:17:48.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926442/opposition-alliance-to-hold-another-moot-on-31st",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:27:21.000Z"
}
