{
  "title": "Levies men protest merger with Balochistan police - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Large numbers of Levies personnel on Thursday protested a government decision to merge their force with the Balochistan police, arguing the move is illegal and defies a court order.\n\nPersonnel and officers from the tribal security force gathered in front of the Levies station in Chagai district’s Dalba­ndin, staging a protest and chanting slogans against the provincial government.\n\nThey announced they would not join the police, saying a petition challenging the merger was pending in the Balochistan High Court.\n\nAt a subsequent press conference, representatives of the protesting force criticised the government’s decision, calling it contempt of court and pointing to an existing stay order issued by the judiciary.\n\n“Those who don’t respect the court’s orders should not expect their directives to be followed either,” one of the protesting officers said, emphasising a commitment to resisting the merger through peaceful and legal means.\n\nThe officials stressed that the Levies force represents a unique tribal security system with a historical background dating to the British colonial era.\n\nThe Levies have played a vital role in maintaining peace and controlling crime in the region — a fact widely acknowledged by local tribes and communities, the officials said.\n\nProtesters also levelled allegations about the merger’s procedural integrity, claiming signatures approving the decision were obtained from a transferred assistant commissioner in the middle of the night.\n\nHighlighting the structural differences between the Levies and the police, the officials argued that no decision should have been made without first consulting their force.\n\nThey demanded the government revoke the merger decision without delay.\n\nIf the government is determined to dissolve the Levies, then it must offer legal benefits and compensate officers respectfully, the representatives urged.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/11082841911b24e.jpg?r=082943",
  "retrievedAt": "2025-08-17T21:19:37.099Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926403/levies-men-protest-merger-with-balochistan-police",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:05:52.000Z"
}
