{
  "title": "Govt urges social media firms to block accounts run by terrorist groups - Pakistan - DAWN.COM",
  "author": null,
  "content": "The government on Friday called on global social media organisations to immediately block the accounts of proscribed terrorist groups disseminating propaganda on their platforms.\n\nOn Wednesday, Minister of State for Interior Talal Chaudhry had highlighted how a terrorist group was using WhatsApp channels to “disseminate hateful content and harmful narratives”, urging the platform and the global community to help Pakistan combat terrorism.\n\nAddressing a joint press conference today in Islamabad alongside Minister of State for Law and Justice Barrister Aqeel Malik, Chaudhry said: “I want to request social media operators and platforms to cooperate with us on the blockage and removal of accounts, taking measures to stop mirror accounts and to share information of account holders who are operating these accounts.”\n\nChaudhry said terrorist groups and individuals, including those banned in the United States, the United Kingdom and sanctioned by the United Nations, were operating accounts on social media platforms such as X, Facebook and WhatsApp.\n\nHe said the National Action Plan (NAP) — formed in 2014 to take action against terrorists through a concerted national effort — requires taking action against those spreading propaganda on media and social media.\n\nThe agenda items of NAP include a ban on the glorification of terrorists and terrorist organisations through print and electronic media, and measures against the abuse of the internet and social media for terrorism.\n\nHe requested social media firms to block these groups; use artificial intelligence (AI) to prevent “mirror accounts”; and share information about their operators. He urged creating auto-detect and auto-block algorithms against such accounts.\n\nBarrister Malik said authorities had unearthed 481 accounts associated with proscribed terrorist groups on various platforms and reported them to social media organisations.\n\nHe urged social media firms to share information about account holders to “amplify counterterrorism operations in dealing with this newer threat”.\n\nHe also requested them to implement strict measures, which include AI methods to discover more accounts. He invited them to establish their presence in the country and sought enhanced cooperation in the digital world.\n\nMalik said Pakistan was at the forefront and had rendered sacrifices in the war against terrorism, but a new trend had surfaced on social media apps such as X, Facebook, Instagram and Telegram.\n\n“We will welcome social media platforms to set up offices in Pakistan for better coordination,” he said. “We seek coordination between social media platforms and our law enforcement agencies on social issues and the presence of terrorist organisations on social media.”\n\nHe said terror groups such as the banned Tehreek-i-Taliban Pakistan, Islamic State Khorasan Province, Balochistan Liberation Army and Balochistan Liberation Front had an active presence on social media platforms, noting they have been banned by the US and the UK as well.\n\n“Pakistan remains steadfast and is committed to our resolve to combat terrorism. Apart from operating on the ground, we have seen new trends in the digital realm,” he said.\n\nHe said the state minister for interior also highlighted how terrorist groups were “working on social media, recruiting and actively disseminating propaganda” through WhatsApp and other platforms.\n\n“These social accounts significantly enhance their social media presence, whether it through their real names of pseudonyms. It poses a threat to our nation, citizens and the rest of the world.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/25172223fb81523.jpg",
  "retrievedAt": "2025-08-17T21:16:25.506Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926532/govt-urges-social-media-firms-to-block-accounts-run-by-terrorist-groups",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T12:13:37.000Z"
}
