{
  "title": "CII supports gap between children to protect health of mother, child - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Members express differing opinions over endorsement for birth spacing\n• Scholars say family planning ‘permissible in Sharia’ for medical reasons\n\nISLAMABAD: After some debate, the Council of Islamic Ideology (CII) on Thursday declared appropriate birth spacing essential for the health of mothers and children.\n\nThe CII, which advises parliament on how to align legislation with the principles of the Holy Quran and Sunnah of the Holy Prophet (PBUH), held a one-day consultative session in collaboration with the Population Council on Thursday.\n\nIn the declaration issued after the session, CII members declared appropriate birth spacing essential for the health of mothers and children.\n\nThese methods also “align with Islamic teachings and social responsibility”.\n\nBut sources in the Council told Dawn that during the discussion, CII members were divided on the issue.\n\nOne group of traditional clerics opposed the term family planning and expressed concerns over concepts like birth spacing.\n\nHowever, another group oppo­sed their peers and expressed serious concerns over the rising population and called for the active promotion of birth control methods.\n\nThe commission decided that Islam’s principle of ‘Mizan’ (balance) supported a responsible approach to parenting.\n\nThe session titled ‘The Concept of Mizan and Ihsan (excellence) in Islam: Balancing Resources and Population — Our Survival, Our Future’ was presided over by CII Chairman Allama Dr Raghib Hussain Naeemi.\n\nThe meeting explored Islamic and constitutional perspectives on family protection, maternal and child health, and rising population.\n\nThe scholars unanimously agreed that in cases of legitimate medical or social need — such as risk to the mother’s life, severe weakness, multiple surgeries, or breastfeeding needs — temporary family planning is permissible in Shariah.\n\nIn his opening remarks, Dr Ali Mohammad Mir, senior director of programmes and research at the Population Council, said the rising birth rate was linked to serious challenges, particularly in maternal and child health, including complications and diseases that could impact future generations.\n\nHe highlighted the national narrative titled “Tawazun” (balance), which the government developed in consultation with religious leaders to promote responsible family planning.\n\nThe declaration issued after the meeting noted that Islam placed great importance on protecting life and lineage, two of the core objectives of Shariah.\n\n“Ensuring maternal and child health and family wellbeing is, therefore, a religious duty,” the declaration said.\n\nWhile the declaration added birth control methods should be used “within Islamic bounds” and not involve “harmful or impermissible practices”, it did not elaborate on permissible methods.\n\nThe scholars noted the Holy Quran encouraged mothers to breastfeed for two years, which naturally leads to spacing between births. This ensures that children receive proper health, nutrition, and education.\n\nThe session decided that the Constitution also obliged the state to ensure public welfare, quality health and education, and family security.\n\n“Therefore, balancing population and resources, securing a healthy future generation, and promoting women’s participation are national responsibilities”, the declaration said\n\nThe scholars also pledged to spread awareness among the public, clarify misconceptions and guide society toward family wellbeing.\n\nTalking to Dawn, CII member Allama Tahir Ashrafi said that issues like birth spacing and traditional misconceptions associated with them cannot be handled alone by clerics only. The state too has to play an active role, he said.\n\nNOTE: An earlier version of this report said the CII was divided over the issue of endorsement for birth spacing. It is clarified that the differences referred to emerged during discussion, not over the final announcement.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2016/05/5747190eb2b67.jpg?r=1855882535",
  "retrievedAt": "2025-08-17T21:19:34.047Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926407/cii-supports-gap-between-children-to-protect-health-of-mother-child",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:05:52.000Z"
}
