{
  "title": "Rubio lauds Pakistan’s role in global and regional peace in 1st meeting with FM Dar - World - DAWN.COM",
  "author": null,
  "content": "United States Secretary of State Marco Rubio lauded Pakistan’s role in “global and regional peace” in his first meeting with Deputy Prime Minister and Foreign Minister Ishaq Dar on Friday, the Foreign Office (FO) said.\n\nThe deputy prime minister arrived in Washington, DC, on Thursday night, on the second leg of his eight-day visit to the US. He had arrived in New York on Monday to attend “high-level signature events” of Pakistan’s United Nations Security Council (UNSC) presidency, including a conference on Palestine.\n\nA statement issued by the FO today said that Dar held his first meeting with Rubio. The two have previously talked over the telephone.\n\nThe FO said Rubio acknowledged Pakistan’s “everlasting sacrifices in the war on terror”.\n\n“Pakistan has always played a positive role in global and regional peace,” the FO quoted the US secretary of state as saying.\n\nThe FO said that detailed discussions were held on bilateral relations and potential cooperation in various sectors.\n\n“Discussions were held on promoting bilateral trade and economic relations, cooperation in important sectors, including investment, agriculture, technology [and] minerals. Counter-terrorism and regional peace were also discussed.”\n\nFM Dar paid tribute to the efforts of President Donald Trump and the US leadership in promoting global peace, adding that their role and efforts regarding the recent Pakistan-India tension were “commendable”.\n\n“Pakistan and the US seek further expansion and stability in bilateral relations,” he said.\n\nThe FO said FM Dar was optimistic about the positive progress in the ongoing trade dialogue between the two countries.\n\n“Pakistan is an attractive destination for the American business community and investors. The two countries have a common approach and interests regarding regional peace. The Pakistani community in the US is playing a bridge role between the two countries,” the FO quoted him as saying.\n\nBoth leaders reaffirmed their commitment to promoting bilateral relations and working together in various fields.\n\nDar said the two had a “comprehensive discussion on the full spectrum of bilateral relations”.\n\nHe added that both reaffirmed their commitment to the long-term bilateral partnership, with renewed focus on economic, trade, investment, information technology, artificial intelligence and counter-terrorism cooperation.\n\nWe also exchanged views on key regional and global developments. I appreciated the U.S. constructive role in facilitating the recent Pakistan-India ceasefire.\n\n“We reaffirmed the importance of close coordination at multilateral fora, including at the UN Security Council. With continued dialogue and mutual respect, I am confident we can build a more stable, prosperous, and mutually beneficial future for both our nations.”\n\nMeanwhile, the US State Department said Rubio expressed appreciation for Pakistan’s continued willingness to play a constructive role in mediating conversations with Iran and its commitment to preserving regional stability.\n\n“The two also discussed prospects for deepening bilateral counterterrorism cooperation, including countering ISIS-K, and the upcoming US-Pakistan Counterterrorism Dialogue in Islamabad this August.\n\n“The secretary underscored the importance of expanding mutually beneficial bilateral trade and exploring prospects for enhancing collaboration in the critical minerals and mining sectors.”\n\nDar is also scheduled to speak at the US think tank, The Atlantic Council, “sharing Pakistan’s perspective on regional and global issues as well as the future of Pak-US relations.”\n\nUpon arrival in the US capital, FM Dar was received by Ambassador of Pakistan to the US Rizwan Saeed Sheikh and senior embassy officials.\n\nDar’s visit comes as Pakistan holds the presidency of the UNSC this month. Pakistan assumed the UNSC presidency for July, marking its first presidency since 2013. Islamabad began its current two-year term as a non-permanent member in January 2025 and will serve through the end of 2026.\n\nAddressing a reception hosted by Pakistan’s Mission in New York on Wednesday, Dar called for an inclusive dialogue and cooperative diplomacy over confrontation amid growing turbulence across the world.\n\nThe deputy PM asserted that Pakistan’s leadership has been guided by “these very principles in both deliberations and concrete actions taken during its tenure”.\n\nThe UNSC unanimously adopted Pakistan-sponsored Resolution 2788, calling for the strengthening of international mechanisms to settle disputes through peaceful means.\n\nDar also announced Pakistan was seeking a seat at the UN Human Rights Council for the 2026-2028 term, with the Asia-Pacific Group endorsing its candidacy. Pakistan last held the membership from 2020 to 2023.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2520264724e8951.jpg",
  "retrievedAt": "2025-08-17T21:16:59.561Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926499/rubio-lauds-pakistans-role-in-global-and-regional-peace-in-1st-meeting-with-fm-dar",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T07:51:33.000Z"
}
