{
  "title": "CM Murad tells Centre to double supply to Karachi from Hub Dam - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Federal minister assures CM he will take up K-IV funding issue with PM\n• Disputes with Punjab over water distribution also discussed\n\nKARACHI: In order to address the chronic issue of water shortage in Karachi, the Sindh government on Thursday urged the federal government to double the water supply to the metropolis from Hub Dam and also bridge the funding gap of the K-IV project.\n\nAt a meeting with Federal Water Minister Mian Moeen at CM House, Chief Minister Syed Murad Ali Shah informed him that despite administrative approval, the project faced major challenges that required federal government’s urgent intervention.\n\nThe meeting was attended, among others, by Sindh Planning & Development Minister Syed Nasir Hussain Shah, Local Government Minister Saeed Ghani, Irrigation Minister Jam Khan Shoro, Wapda Chairman Naveed Asghar Chaudhry, DG Mian Riaz, and Project Director K-IV Project Wapda Aamir Mughal.\n\nThe chief minister told the federal minister that in the FY 2025-26, only Rs3.209bn had been allocated by the federal government against the actual requirement of Rs39.964bn. “This funding gap threatens delays, inflation-driven cost escalation, and potential contractor claims,” he added.\n\nA press statement issued by the CM House said that the federal minister assured the chief minister that he would brief Prime Minister Shehbaz Sharif on the progress of the project to get more funds.\n\nThe federal minister noted that most Right-of-Way (ROW) issues had been resolved by the Sindh government. However, he said, two bottlenecks – 22 acres of land in Thatta required for the construction of infrastructure for the pumping complex and a pending court case related to the pipeline alignment — were yet to be resolved.\n\nThe chief minister assured the federal minister that the land would be handed over to the project executers for the pumping station at the earliest.\n\nHe noted that out of the provincial government’s share of Rs8.5bn, he had approved the release of the fourth quarter of Rs1.27bn for the project.\n\n100pc increase in supply from Hub Dam sought\n\nMr Shah requested Mian Moeen to approve increase in the water supply from Hub Dam from 100mgd (mission gallons per day) to 200mgd. Both, the CM and federal minister, agreed to conduct a technical survey to determine water availability in the dam so that the CCI could be asked to take a decision accordingly.\n\nThe chief minister told the federal minister that currently the city received 650mgd as against a requirement of 1,300mgd. He said that in order to address the issue, the Sindh government had conceived the K-IV project, designed to ultimately supply 650mgd to Karachi from Keenjhar Lake. “The Phase-I of the project, being implemented by Wapda, is aimed at delivering 260mgd,” he added.\n\nThe federal minister told the CM that he visited the K-IV project along with P&D Minister Nasir Shah on Wednesday (July 23). The physical progress stood at 63pc with the completion targeted being 2026, he added.\n\nEcnec directives\n\nIt was pointed out at the meeting that the federal government formally granted administrative approval for the execution of the K-IV Phase-I under the modified revised PC-I, which was approved by the Executive Committee of the National Economic Council (Ecnec) on January 31, 2022. The project is approved for Rs126.404bn.\n\nThe main conditions set by Ecnec includes provision of 260mgd from Keenjhar Lake by the Sindh government; the provincial government’s contribution of 50pc share will be Rs12.77bn; timely clearance of liabilities and land acquisition; coordination of power supply, distribution network, and O&M systems; and regular steering committee meetings to monitor implementation.\n\nThe chief minister said that the provincial government was fulfilling the condition set by the federal government.\n\nInter-provincial water distribution\n\nThe chief minister asked the federal minister to facilitate direct meetings between irrigation officials of Sindh and Punjab to resolve water distribution challenges amicably.\n\nHe said that water distribution must follow the 1991 water accord. The federal minister agreed to meet with representatives of Sindh and Punjab separately to resolve the issue.\n\nRBOD\n\nThe meeting also reviewed progress of the Right Bank Outfall Drain (RBOD) project, for which a technical committee has been formed to address outstanding issues and submit a report within three days.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:18:49.563Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926388/cm-murad-tells-centre-to-double-supply-to-karachi-from-hub-dam",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:06:10.000Z"
}
