{
  "title": "Aseefa gets feedback during visit to Sindh govt hospitals - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: First Lady and MNA Aseefa Bhutto-Zardari visited two government hospitals in the metropolis on Thursday and interacted with patients’ families to gather feedback on their experiences, service quality, and staff behaviour.\n\nAccording to a press release issued by the media cell of Bilawal House, the first lady visited the Sindh Institute of Child Health and Neonatology’s Mother & Childcare Hospital in Azam Basti and the Children Hospital in Korangi No 5.\n\nShe was accompanied by Sindh Health Minister Azra Fazal Pechuho and Karachi Mayor Barrister Murtaza Wahab. At the Azam Basti hospital, they were joined by Local Government Minister and president of PPP Karachi division Saeed Ghani.\n\nDuring the visit, Ms Bhutto-Zardari toured various departments, interacted with on-duty staff and doctors and met with parents of young patients receiving care.\n\nThe press release stated that the patients “expressed their appreciation for the tireless efforts of the medical teams and acknowledged the Sindh government’s dedication to improving maternal and child healthcare services in underserved areas of Karachi”.\n\nShe lauded the provision of free-of-cost treatment for neonates, infants and children, along with the specialised healthcare services offered under the growing network of the Sindh Institute of Child Health and Neonatology (SICHN).\n\n“The dedication seen here today reflects a promising future for the health of our nation’s children and mothers,” Ms Bhutto-Zardari said.\n\nWith four centres in Karachi and others in Sukkur, Nawabshah and Larkana, the SICHN network served as a powerful reaffirmation of the government’s continued focus on free of cost, equitable, accessible, and high-quality neonatal and paediatric care, she added.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6882d1991c709.gif",
  "retrievedAt": "2025-08-17T21:18:50.841Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926390/aseefa-gets-feedback-during-visit-to-sindh-govt-hospitals",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:06:10.000Z"
}
