{
  "title": "D.G. Khan lawlessness - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE latest attack this week on a D.G. Khan cement factory convoy by the notorious Ladi gang, which clearly intended to kidnap employees and extort ransom from the factory management, underscores the deteriorating law and order conditions in the district.\n\nThe raid by criminals armed with automatic weapons, which followed a string of over 30 attacks on police in the area in the first half of 2025 by the banned TTP, is a grim reminder of the ever-deepening security vacuum in the area amid a jurisdictional dispute between law-enforcement agencies. The raid is evidence of the growing nexus between militant outfits operating in the area and local criminal gangs, often backed by powerful local tribal elders and politicians.\n\nSpiralling lawlessness underlined by numerous gang assaults on industrial establishments — as well as the kidnapping and killing of factory staff — in recent years speaks volumes for the operational freedom these gangs and militant outfits enjoy in the area.\n\nMore disturbing is the fact that some gang members believed to have been involved in earlier attacks, including arson and attempted kidnappings, remain at large, despite their nomination in FIRs. Indeed, the difficult mountainous terrain of Koh-i-Sulaiman and tribal leaders’ apparent support for the criminals make it quite challenging for LEAs to take action against them.\n\nThe jurisdictional confusion between Punjab Police and the Border Military Police adds another layer of complexity, hampering coordinated efforts to act as a unified force against the criminals. The reluctance of police to take action against the area’s politically influential tribal leaders has worsened the situation further. Yet, the authorities can hardly afford to ignore the deterioration in security in the region. It goes without saying that the current lawlessness is frightening away potential industrial investments at the expense of development in the area and thwarting efforts to generate jobs for the local population.\n\nThe situation demands that the government act proactively and decisively by ensuring very close coordination between the LEAs, and build a reliable intelligence-gathering network to conduct targeted operations. The region risks becoming another flashpoint unless the network of militants and gangs is completely dismantled. The latest attack shows that time is running out fast; the cost of further delay in moving decisively will be too high for the people of the region.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/241044535b03073.jpg?r=104632",
  "retrievedAt": "2025-08-17T21:17:23.849Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926458",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T03:26:43.000Z"
}
