{
  "title": "With stability in sight, it’s time for Pakistan to unlock sustainable growth - Pakistan - DAWN.COM",
  "author": null,
  "content": "After years of relentless crises, ranging from sky-high inflation to back-breaking unemployment, Pakistan’s economy has finally reached the much-awaited milestone of stability. The macroeconomic data for the fiscal year 2024-25 is proof that policies pursued over the last two years have had their intended effect.\n\nInflation is down to 3.2 per cent from May 2023’s 38pc despite a fuel price hike. The FY25 closed with a $2.1 billion current account surplus in a dramatic turnaround that has helped stabilise the external sector and exchange rate. Exports have surged nearly 5pc. Remittances have hit a record $38.3bn, a 27pc year-on-year increase. Even external debt is managed, easing the liquidity crisis.\n\nAs celebratory as it may sound, stabilisation — delivered at the cost of economic activity — is not the end goal; in fact, it is not even new to Pakistan. The country has been here before, and a time too many.\n\nBut what this period of stability does do is open up a window of opportunity to chart a different path forward, for which three strategic priorities demand urgent attention: energy reform, export-oriented industrialisation and critical minerals strategy.\n\nPakistan’s energy sector is struggling financially and losing industrial competitiveness. Cross-subsidies and politically managed pricing have created an irrational system where productive industries are punished through higher tariffs, which reduces demand and worsens the circular debt problem. In recent months, a lot of work has been put into ensuring that the circular debt stabilises, but this has been done through pricing adjustments that are creating an excess supply challenge in the system.\n\nTo deal with this, meaningful pricing reform is the need of the hour, starting with marginal cost pricing — especially for natural gas and electricity — and a phased end to distortive subsidies that crowd out efficiency and innovation.\n\nBut pricing alone isn’t enough. Pakistan must recognise that the future of energy lies in decentralisation. With per capita electricity consumption among the lowest in South Asia, an unreliable grid, and a rapidly evolving solar-storage-battery ecosystem, the country must pivot from 20th-century central planning to 21st-century distributed generation.\n\nRooftop solar, industrial microgrids, and battery energy storage systems are already being scaled up by industrial and residential users alike. This can transform the energy landscape, with cheaper, more reliable electricity directly improving export competitiveness and attracting globally mobile capital looking to relocate out of China and other high-cost economies.\n\nJust energy, however, cannot solve the problem at hand. A key issue plaguing Pakistan’s industrial policy has been a heartland approach to development. This cuts against the global trend of coastal areas being engines of growth, particularly export-based manufacturing. Shifting this strategy is the need of the hour, because despite record remittances and a modest rise in export receipts, Pakistan’s goods-export base remains narrow and underscaled.\n\nGiven its population and economic size, Pakistan should by now have developed multiple coastal cities with regionally competitive manufacturing and port infrastructure. Coastal areas have excess power, which means that thousands of megawatts of reliable and affordable energy can be provided at marginal costs to unlock new industrial activity and manufacturing output.\n\nIt is still not too late, and what is needed now is a bold coastal development strategy — one that brings together labour availability, energy cost advantages, and global trade access. Growing inflows of remittances can also be meaningfully leveraged to not just be used for consumption, but to help pay for imports of industrial equipment necessary to finance best-in-class manufacturing units on the coasts.\n\nSpecial economic zones along the coast— particularly around Gwadar, Karachi, and Port Qasim — can become hubs for value-added manufacturing, especially if paired with the right tariff reforms and investment incentives.\n\nPakistan should actively court global manufacturers disrupted by the ongoing trade war. This is feasible in particular because of the dramatic turnaround in relations with the United States — a trade deal with the Trump administration is near, and it could accelerate investments, provided policy provides the right enabling environment.\n\nCapital should be flowing into Pakistan at this point. Unfortunately, this isn’t happening because of the high cost of doing business, lack of cheap and reliable energy, and a legal system that can neither enforce contracts nor resolve disputes. It is not politically complex to solve these issues on the ports, and some of these conversations are occurring with both Chinese and western investors.\n\nThis is where Reko Diq offers a ray of hope and a framework for doing more in a shorter time period. The resolution of the dispute has made the mine a case study in what a resolution of key disputes can do to unlock value for all.\n\nToday, Reko Diq is being developed and operated by a Canadian company, which has contracted a Finnish firm to provide power and a Japanese company to provide mining equipment. This equipment is being developed by American labour, turning the mine into an asset in which global powers and international investors, including the World Bank and the International Finance Cooperation, have a stake.\n\nIt’s a story of what happens when global capital, governance standards, and local alignment come together.\n\nTo build on this success, Pakistan must now seek to successfully close out ongoing engagement with the United States to get American capital into the country’s critical minerals sector, while also working with multilateral and regional investors out of the Gulf to develop infrastructure and power around mining corridors.\n\nThis would lay the groundwork for a value-added critical minerals industry with refining, smelting, and manufacturing supply chains — instead of just raw material exports. Finally, having companies from multiple jurisdictions could also help alleviate the proxy war that is unfolding in Balochistan — where the Reko Diq mine is located — given that the economic interests of global companies are likely to reshape the behaviour of both global and regional powers, including potential spoilers.\n\nUltimately, the investment, development, and job creation could also support long-term efforts needed to resolve long-standing issues in Balochistan, including those related to local empowerment and development.\n\nThis strategy would also allow Pakistan to position itself not just as a source of ore but also as a node in the clean energy and digital economy supply chain, with western and Chinese businesses contributing to innovation, development, and economic activity.\n\nPakistan has seen stability before — and squandered it. This time must be different. Macro data tells us that the balance-of-payments pressure has eased. But inflation can return, and capital can flee. The only sustainable stability is that which is rooted in exports, competitiveness, and global integration. The world is changing fast, but this change offers Pakistan to finally start leading — not lagging — in that change.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/250028021fc4af1.jpg",
  "retrievedAt": "2025-08-17T21:17:06.766Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926308/with-stability-in-sight-its-time-for-pakistan-to-unlock-sustainable-growth",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T07:09:50.000Z"
}
