{
  "title": "Senate calls for swift justice in Balochistan killings - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Resolution rejects justification for such crimes on cultural grounds\n• House passes Whistleblower Protection Commission Bill, okays 20pc reward for exposing corruption\n• Navy Ordinance amended with stricter penalties for misconduct\n• Eight new senators sworn in\n\nISLAMABAD: Alarmed by a brutal act of vigilante justice in Balochistan, where a man and woman were executed in broad daylight under a jirga verdict in the name of “honour”, the Senate on Thursday called for an immediate and transparent investigation to bring all perpetrators — inclu­ding those who convened or sanctioned the jirga — to justice.\n\nIn a resolution adopted almost unanimously, the Senate declared that so-called honour killings were not “honourable”, rather constituted murder under the law and must be prosecuted as such.\n\nThe resolution, tabled by PPP parliamentary leader Senator Sherry Rehman, was supported by all parties across the aisle except JUI-F, which refused to sign.\n\nLawmakers stressed that the rule of law could not be selectively applied and that tribal or informal justice systems must not override constitutional protections and due process.\n\nThe resolution rejected any justification of such crimes on cultural, tribal or traditional grounds and condemned attempts to legitimise them under the guise of “ghairat” (honour), describing them as victim-blaming.\n\nThe resolution recalled previous legislative reforms aimed at curbing honour crimes, particularly by disallowing compoundability or conciliation in such cases. However, it expressed concern that despite these legal safeguards, implementation remains weak and justice is often subverted, especially in high-profile cases targeting women.\n\nThe House stressed that law enforcement agencies must treat such cases strictly under the relevant provisions of the Pakistan Penal Code, without compromise or discretion.\n\nIt also urged the Ministry of Law and Justice and the Mini­stry of Human Rights to conduct a thorough review of the enforcement gaps in existing laws dealing with the so-called honour crimes and reco­­mm­end actionable reforms.\n\n“This premeditated act of vigilante murders constitutes an abhorrent crime; it is a gross violation of human rights, the Constitution and the laws of Pakistan,” it said.\n\nWhistleblower commission\n\nAnother highlight of the day’s proceedings was the passage of a bill to establish an independent Whistleblower Protection and Vigilance Commission, aiming to protect whistleblowers from retaliation, promising a reward for those exposing corruption in public institutions.\n\nAs per the bill, the Commission will have civil court powers to assess complaints and conduct judicial proceedings. Whistle­blowers will be entitled to 20 per cent of any recovered amount and a certificate of appreciation.\n\nHowever, submitting false or frivolous information will carry a penalty of up to two years’ imprisonment or a fine of up to Rs200,000, which will be paid to the falsely accused. Those facing retaliation can seek redressal from the Commission, whose orders will be binding.\n\nThe whistleblower’s identity will remain confidential unless disclosed with written consent. Violators will face fines of up to Rs500,000 and imprisonment of up to two years.\n\nLaw ministry officials noted that the existing 2017 law lacked effective enforcement mechanisms. The new Commission, headquartered in Islamabad, will operate autonomously and may set up offices across Pakistan if needed. It will consist of at least three members, including a chairperson, with the government authorised to expand membership when required.\n\nNavy Ordinance amendments\n\nThe Senate also passed the Pakistan Navy (Amendment) Bill, allowing the Navy to engage in activities linked to national development or strategic interests with federal or provincial consent.\n\nThe relevant naval authority may retire or discharge any individual and has the right to accept or reject resignations. In times of war, individuals over 60 years of age may be retained in service upon the recommendation of the naval chief.\n\nAccording to the bill, officers who fail to defend ships and other assets may face the death penalty or long-term imprisonment. Refusal to fight in the event of an attack, cowardice or abandoning a ship in danger may also lead to similar punishments.\n\nNaval personnel involved in extortion or corruption will face lengthy jail terms, as will those who accept bribes, agree to bribery or cause harm or favouritism.\n\nDisclosing official information could lead to 14 years of rigorous imprisonment, and if the information harms national security or the armed forces, the individual will be tried under the Official Secrets Act.\n\nOne of the amendments reads, “A person who is or has been subject to this Ordinance commits an offence under the Prevention of Electronic Crimes Act, 2016 (Act XL of 2016) or relevant electronic, digital, social media laws, with the mala fide intention to undermine, ridicule, or scandalise, the armed forces of Pakistan, may be proceeded under this Ordinance and on conviction by a court constituted under this Ordinance, shall be punished in the prescribed manner with the same punishments as provided for in the said Act XL of 2016 or such other laws, as the case may be.”\n\nMeanwhile, Minister for Power Awais Leghari dismissed reports that Nepra had approved a multi-year tariff for K-Electric to recover its losses from consumers. Responding to a calling-attention notice by Senator Faisal Sabzwari, he explained that the reports related to the 2023-24 financial year, when the current government was not in power.\n\nSworn in\n\nIn a separate development, eight of the 11 recently elected senators from Khyber Pakhtunkhwa took the oath of office on Thursday, hours after the ECP issued their victory notifications. Those who were sworn in on Thursday included Noorul Haq Qadri, Faisal Javed Khan, Rubina Khalid, Talha Mehmood, Niaz Ahmed, Dilawar Khan, Attaul Haq and Mirza Muhammad Afridi.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6882f2047507c.jpg",
  "retrievedAt": "2025-08-17T21:17:49.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926448/senate-calls-for-swift-justice-in-balochistan-killings",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T02:56:34.000Z"
}
