{
  "title": "Litmus test for UN - Newspaper - DAWN.COM",
  "author": null,
  "content": "DEPUTY Prime Minister Ishaq Dar did not mince any words at the UN Security Council on Wednesday. Gaza, he declared, had become a “graveyard for innocent lives as well as for international law”.\n\nPresiding over the UNSC’s quarterly open debate on the Palestinian question, Mr Dar condemned what he described as a “genocide in full view of the international community — one that the UN seems unable or unwilling to stop”. It was a rare moment of moral clarity in a chamber that has too often offered empty words while an entire people are being systematically starved, bombed and erased. Indeed, Gaza today is a “nightmare of historic proportions”, in the words of Khaled Khiari, the UN assistant secretary general for the Middle East.\n\nOver 59,000 Palestinians have been killed. Aid convoys are shelled. UN schools and hospitals are reduced to rubble. A third of Gaza’s population is reportedly going days without food. Just this week, the Palestinian envoy recounted the deaths of two children — one just six weeks old — from starvation. “Children in Gaza are not starving,” he said, “they are being starved.” Yet the UN has failed to act decisively.\n\nMr Dar rightly described the situation as a “litmus test” for the credibility of the UN and the international order. The UNSC’s inaction — paralysed by geopolitical alignments and veto politics — is not mere indifference; it is complicity. Each day of delay costs lives. It emboldens impunity. It makes a mockery of international humanitarian law.\n\nPakistan’s six-point plan — calling for an unconditional ceasefire, full humanitarian access, support for UNRWA, an end to illegal settlements and forced displacement, a reconstruction framework, and a genuine two-state solution — reflects what the global consensus should be.\n\nAgainst this backdrop, efforts towards a ceasefire are teetering. Hamas has reportedly given a “positive and flexible” response to a US-backed 60-day truce proposal, agreeing to Israeli troop withdrawals and UN-supervised aid corridors. Mediators — including Qatar, Egypt and the US — remain engaged.\n\nHowever, Israel has recalled its negotiators from Doha for consultations, signalling unease over Hamas’s conditions, especially guarantees that fighting will not resume once the truce expires. Israel also insists on maintaining a limited military presence. Despite these differences, diplomatic channels remain open — but time is quickly running out.\n\nThe horror unfolding in Gaza is a collapse of the very global norms the UN was founded to uphold. The Paris peace conference, co-chaired by Saudi Arabia and France, may present a diplomatic opening, but it cannot be a substitute for immediate and forceful action. The UN’s moral failure in Rwanda and Bosnia must not be repeated in Gaza. This time, the world must not look away.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/240800530cb2f9e.png?r=080155",
  "retrievedAt": "2025-08-17T21:17:14.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926470",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T05:43:52.000Z"
}
