{
  "title": "SHC quashes NAB inquiry against Sindh Public Service Commission’s 2018 examination - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court on Thursday quashed an inquiry initiated by the National Accountability Bureau (NAB) against the Sindh Public Service Commission (SPSC) over the 2018 recruitment examination.\n\nAfter hearing arguments at length by Advocate Raj Ali Wahid Kunwar, the lawyer representing SPSC, a two-judge bench comprising Justice Zulfiqar Ali Sangi and Justice Nisar Ahmed Bhambhro, allowed the petition filed by SPSC and quashed the inquiry. It said that detailed reasons would be recorded later.\n\nEarlier, the NAB had received a complaint alleging irregularities in the Combined Competitive Examination (CCE) 2018 conducted by the commission. Several candidates, who had failed in the exam, had approached different high courts, including SHC’s Hyderabad bench, which had passed an adverse order against the SPSC in 2021.\n\nHowever, the Hyderabad bench’s order was subsequently set aside by the Supreme Court, and the 2018 examination was declared valid in 2022. The inquiry against the SPSC was also halted. In June this year, SPSC officials once again received notices — nearly three years after the Supreme Court verdict, which was challenged before the SHC.\n\nInvestigation officer fails to answer several questions posed by judges regarding evidence\n\nAt the outset of hearing on Thursday, Advocate Raj Kunwar contended that the Supreme Court had already decided the matter, adding that the appointments made through these exams could no longer fall within the purview of NAB.\n\nHe further argued that under relevant section of NAB law, an inquiry must be completed within six months. However, in this case, the inquiry was sanctioned years before, and the current investigation officer (IO) has been handling it since January 2025 but has failed to collect any substantial evidence.\n\nThe counsel submitted that as per the standard operating procedures (SOPs), if an inquiry is to be conducted against an officer of Grade 19 or 20, it required sanction from the chairman, which is mandatory. However, the sanction granted by the chairman in this case did not pertain to allegations of misuse of authority.\n\nHe alleged that NAB had been harassing the SPSC and its officials. He further claimed that an official of the commission, who had been assigned to provide information to NAB, was also subjected to harassment and was allegedly confined to a room for a considerable period of time during which NAB officials used unparliamentary language against him.\n\nCounsel Kunwar contended that NAB had published and circulated the impugned notice on the social and electronic media which, he argued, was in violation of the law.\n\nDuring the proceedings, Justice Bhambhro questioned the IO from the NAB about how he could demand examination papers that are protected under the law. The judge asked: “If you are directed to initiate an inquiry against the president or governor, would you do so?” To this, the IO responded that they are protected under the Constitution.\n\nJustice Sangi asked the IO whether, under NAB’s 2024 SOPs, he had obtained the complainant’s thumb impression or CNIC copy, to which the IO replied in the negative.\n\nJustice Sangi also inquired whether any material had been collected against the petitioner during the past six years. In response, the court was informed that collecting evidence in white-collar crimes is difficult and time-consuming.\n\nAt this, Justice Sangi observed that the IO had himself admitted that no substantial evidence had been collected, adding that the NAB chairman had not even authorised the inquiry.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/03/14104125410de1c.jpg?r=104410",
  "retrievedAt": "2025-08-17T21:19:00.028Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926392/shc-quashes-nab-inquiry-against-sindh-public-service-commissions-2018-examination",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:06:10.000Z"
}
