{
  "title": "Three Lahore policemen kidnap two citizens for ransom - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Three policemen allegedly kidnapped two citizens for Rs2.5 million ransom, subjected them to torture and threatened to kill them in a fake encounter. They released the victims after receiving ransom from their families.\n\nThe victims, including Hafiz Nadeem, had sought help from the policemen when their motorbike ran out of petrol. Instead of giving them help, the policemen kidnapped them and took them to a private building at gunpoint where they confined them.\n\nThe matter came to the limelight when the parents of the kidnapped citizens got their children released from the custody of the policemen by paying them Rs675,000 ransom and then brought the matter to the notice of the police high-ups. The suspects were later identified as constables Tauqir, Iqbal and Wajid from the Kahna Police Station.\n\nThe Raiwind police registered a case against them and arrested them after an inquiry into the matter.\n\nThe victims had sought help from them on the road\n\nThe FIR was lodged on the complaint of Hafiz Nadeem, a resident of Mustafabad (Lalyani), Kasur.\n\nAccording to the FIR, Nadeem and his cousin, Shahid, were going back to their home from a market on July 19.\n\nAs they reached Bhuya Asal, their bike ran out of petrol and they requested the two patrolling policemen for help. The policemen grilled and frisked them, declaring them suspects. They asked for the men’s CNICs for verification of any criminal case lodged against them from the Crime Record Office (CRO) Lahore. Though the policemen found no criminal record, they demanded bribes from both the victims. On their refusal to pay the bribe, the cops called another policeman on the spot. The third policeman reached there in a private car, the constables bundled the victims into it and drove away towards a private housing society on the Raiwind Road. The policemen took the victims to a private plaza where they subjected them to torture, accusing them of being drug dealers. They asked the victims to pay Rs2.5m to secure their release.\n\nThe cops presented themselves as the CCD officials and warned if they refused to pay the money, they would kill both of men in fake encounters. The policemen called their parents and also issued them threats of fake encounters, forcing them to pay Rs675,000. Of the total amount, Rs375,00 was dropped at a footpath near Lahore General Hospital (LGH), a location sent by the cops, and remaining amount was received by one of the kidnappers at his home in Kasur district. After the payment, the policemen released both the youths from ‘custody’.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/16210547413e382.jpg?r=210552",
  "retrievedAt": "2025-08-17T21:18:40.693Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926349/three-lahore-policemen-kidnap-two-citizens-for-ransom",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:06:17.000Z"
}
