{
  "title": "Crackdown cools dollar surge amid buying by SBP - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The rupee appreciated against the US dollar in both the interbank and open markets on Thursday, following a fresh crackdown on currency smuggling, according to currency dealers.\n\nExchange companies reported a decline in dollar rates, reversing the earlier upward trend despite strong economic fundamentals. The greenback had been gaining despite record remittances during FY25, which ended on June 30. Other supportive factors included a current account surplus and foreign exchange reserves exceeding the IMF’s target of $14bn.\n\nWhile the rising dollar was attributed to a shortage in both markets, several exchange companies and their associations denied any genuine scarcity. Interbank market sources, however, said banks were quoting higher rates due to constrained dollar supply. Banks reportedly charged up to Rs2.5 more per dollar than the quoted rate, claiming they were offering higher payouts to attract remittances through official channels.\n\nJust days earlier, a delegation of exchange companies, led by Malik Bostan, met a senior intelligence official in Islamabad and raised concerns over large-scale dollar smuggling to Afghanistan and Iran. The meeting led to a targeted crackdown, which helped ease pressure on the exchange rate.\n\nRupee strengthens to Rs284.41 in interbank market\n\nSome bankers insisted that the primary reason for the elevated dollar rates remained the shortage and strict regulatory oversight. They pointed out that the State Bank of Pakistan (SBP) had emerged as the biggest buyer of dollars in the interbank market. It is estimated that the central bank purchased around $8bn during FY25, though no official data has been released. However, SBP has publicly acknowledged buying dollars from the market.\n\nOn Thursday, the dollar lost 54 paise in the interbank market, closing at Rs284.41, while in the open market it dropped by 70 paisa to Rs287.60. Currency experts view the recent crackdown as a preventive measure to curb the emergence of a black market, such as the one witnessed in 2023 when the dollar traded at Dubai-linked rates of Rs335-340.Market sources reported no panic over dollar shortages, though speculative pressures and fears of price volatility persist.\n\nSBP reserves slip\n\nMeanwhile, the foreign exchange reserves held by the SBP decreased by $69 million to $14.45bn during the week ending July 18. The country’s total reserves declined to $19.917bn, including $5.46bn held by commercial banks.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:19:18.870Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926395/crackdown-cools-dollar-surge-amid-buying-by-sbp",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:05:58.000Z"
}
