{
  "title": "France defends move to recognise Palestinian state - World - DAWN.COM",
  "author": null,
  "content": "France defended its decision to recognise Palestinian statehood amid domestic and international criticism on Friday, including against the charge that the move plays into the hands of Hamas.\n\nPresident Emmanuel Macron said on Thursday that his country would formally recognise a Palestinian state during a UN meeting in September, the most powerful European nation to announce such a move.\n\nMacron’s announcement drew condemnation from Israel, which said it “rewards terror”, while US Secretary of State Marco Rubio called it “reckless” and said it “only serves Hamas propaganda”.\n\nMike Huckabee, US ambassador to Israel, quipped that Macron did not say where a future Palestinian state would be located.\n\n“I can now exclusively disclose that France will offer the French Riviera & the new nation will be called “Franc-en-Stine”, he said on X.\n\nHamas itself praised the French initiative, saying it was “a positive step in the right direction toward doing justice to our oppressed Palestinian people”.\n\nBut French Foreign Minister Jean-Noel Barrot on Friday argued that Macron’s initiative went against what the militant group wanted.\n\n“Hamas has always ruled out a two-state solution. By recognising Palestine, France goes against that terrorist organisation,” Barrot said on X.\n\nWith its decision, France was “backing the side of peace against the side of war”, Barrot added.\n\nDomestic reactions ranged from praise on the left, condemnation on the right and awkward silence in the ranks of the government itself.\n\nThe leader of the far-right National Rally (RN), Jordan Bardella, said the announcement was “rushed” and afforded Hamas “unexpected institutional and international legitimacy”.\n\nOn the other side of the political spectrum Jean-Luc Melenchon, boss of the far-left France Unbowed party, called Macron’s announcement “a moral victory”, although he deplored that it did not take effect immediately.\n\nInterior Minister Bruno Retailleau, a right winger whose relationship with Macron is tense, declined on Friday to give his opinion, saying he was currently busy with an unrelated “serious topic” linked to the “security of French people on holiday”.\n\nBut the vice president of his party, Les Republicains, Xavier Bellamy, blasted the decision as possibly “counter-productive” or, at best, “pointless”.\n\nThe move risked “endangering Israeli civilians” as well as “Palestinian civilians who are victims of Hamas’s barbarism”, he said.\n\nBellamy said that Macron’s move was a departure from the president’s previously set conditions for recognition of Palestine, which included a Hamas de-militarisation, the movement’s exclusion from any future government, the liberation of all Israeli hostages in Gaza and the recognition of Israel by several Arab states.\n\n“None of them have been met,” he said.\n\nWhile France would be the most significant European country to recognise a Palestinian state, others have hinted they could do the same.\n\nBritain’s Prime Minister Keir Starmer announced he would hold a call on Friday with counterparts in Germany and France on efforts to stop the fighting, adding that a ceasefire would “put us on a path to the recognition of a Palestinian state”.\n\nNorway, Spain, Ireland and Slovenia all announced recognition following the outbreak of the Gaza conflict, along with several other non-European countries.\n\nOnce France follows through on its announcement, a total of at least 142 countries will have recognised Palestinian statehood.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/25153023c0b47ff.jpg",
  "retrievedAt": "2025-08-17T21:16:41.673Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926526/france-defends-move-to-recognise-palestinian-state",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T10:38:55.000Z"
}
