{
  "title": "Ex-Dawn staffer Azizullah Malik passes away - Pakistan - DAWN.COM",
  "author": null,
  "content": "HYDERABAD: Dawn’s former bureau chief of Sindh, Azizullah Malik, breathed his last in the intensive care unit of a private hospital on Thursday morning. He was 95. He left behind four daughters, three sons and a widow to mourn his death.\n\nHe was suffering from chronic problem of vertigo and for the last few months, he had low haemoglobin levels and become bed ridden. Last night, he was rushed to hospital with complaints of extremely low pulse and blood pressure.\n\nMr Malik remained under care throughout the night but his condition did not improve and he passed away in the morning, according to his son Javed Malik.\n\nHe was laid to rest in the Cantonment graveyard. His namaz-i-janaza was held in Jamia Masjid in Unit-8 of Latifabad. His soyem would be held in the same mosque after Friday prayers.\n\nAmong the prominent personalities who attended his funeral included Hyderabad Mayor Kashif Shoro, MQM-P’s parliamentarians Rashid Khan and Nasir Qureshi, PPP Sindh information secretary Ajiz Dhamra, Hyderabad District Bar Association president Ashar Majeed Khokhar, Hyderabad Deputy Commissioner Zainul Abiden Memon, MQM-London representative Majeed Rajput, local JI emir Hafiz Tahir Majeed, industrialist Amin Khatri, relatives, friends and journalists.\n\nMalik remained associated with the Dawn till March 2012 having started his career in 1985-1986.\n\nBorn in 1930 in Khushab district of Sargodha division, he studied in Military College Jhelum. Being a voracious reader, he had an extensive command over world history. Few could match his writing skills and command over English language.\n\nHaving graduated from the military college, he joined police service. Following an incident, he had to quit the job and then he worked in the Hyderabad Chamber of Commerce and Industry (HCCI) before joining Dawn.\n\nHe contributed many important stories like June 1992’s Tando Bahawal tragedy, self-immolation by daughters of Tando Bahawal’s iconic character Mai Jindo outside Anti-Terrorism Court in Sept 1996.\n\nHe used to write for Saudi Gazette on Sindh’s political situation. Besides, he also reported the Hyderabad Carnage (Sept 30, 1988), infamous Pucca Qila operation of May 1990, ethnic riots in Hyderabad in the late 80s, etc.\n\nHe regularly wrote weekly ‘Hyderabad Dateline’ for Dawn. He was the first Sindh bureau chief when it (bureau) was established in the mid of year 2000.\n\nHe wrote a chapter ‘Alliances of political parties’ in a book titled The Political Parties of Pakistan by A. B. S. Jafri. It was published sometime around 2002 general elections held in October during the Gen Pervez Musharraf regime.\n\nMQM-London leader Altaf Hussain in a message expressed grief over his death.\n\nLeaders of other political parties, including those of the PPP, have also offered their condolences to the family of Mr Malik.\n\nPublished in Dawn, July 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6882d0a83b73c.gif",
  "retrievedAt": "2025-08-17T21:18:51.939Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926384/ex-dawn-staffer-azizullah-malik-passes-away",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T01:06:10.000Z"
}
