{
  "title": "School timings adjusted to ensure smooth traffic flow in Capital",
  "link": "https://www.app.com.pk/national/school-timings-adjusted-to-ensure-smooth-traffic-flow-in-capital/",
  "date_published": "2022-01-10T09:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP):District Administration Islamabad has approved the recommendation of the Islamabad Traffic Police (ITP) and adjusted the school timings to ensure smooth traffic flow in the city especially during peak hours.\nAccording to police spokesman, the office of district administration has issued the notification regarding changes in school timings. Following the directions of IGP Islamabad Muhammad Ahsan Yunus, the SSP (Traffic) Rai Mazhar Iqbal requested Deputy Commissioner Office for adjustment in timings of various schools to avoid traffic mess in peak hours.\nFollowing this request, the Deputy Commissioner Office has issued the notification and new timings would be applicable with effect from January 10, 2022 on 24 educational institutions located at PWD, DHA Phase-II, Rawat and G.T Road.\nThe educational institutions on G.T road including Dare-e-Irqam school, National Public Secondary School, the City School, Headstart School, Concordia College, Roots International College, Beacon House School System, Global School System, Superior College, City Grammar School and Concept School would follow new timings.\nLikewise, the educational institutions at Kahuta road including Beacon House School System, Faith School System, Islamic School System and Islamabad Model School have adjusted their timings.\nMoreover, Allied School at Kak Pul Islamabad, Links School, Benchmark School system, Apex Education System and Beacon House School System at PWD Market would follow timings notified by Deputy Commissioner Office.\nITP’s spokesperson said that this step would help ensure smooth traffic flow on various busy roads and avoid inconvenience to citizens.",
  "retrievedAt": "2025-08-11T14:04:38.157Z"
}
