{
  "title": "FIR against Kashmiri activists a wicked attempt to suppress critical voices: Wani",
  "link": "https://www.app.com.pk/national/fir-against-kashmiri-activists-a-wicked-attempt-to-suppress-critical-voices-wani-2/",
  "date_published": "2022-01-10T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP):Veteran rights activist and Chairman Kashmir Institute of International Relations (KIIR), Altaf Hussain Wani on Monday condemned in strong terms the Indian occupation authorities’ act of filing a concocted case under notorious UAPA against London and Saudi Arabia based Kashmiri rights activist Muzamil Ayoub Thakur and Dr. Asif Dar.\nIn a statement issued here on, the KIIR chief while terming the occupation authorities’ act as unjustified and uncalled for said that every Kashmiri, living in Kashmir or in any other part of the world, has right to speak and support the ongoing struggle for right to self-determination and expose India’s brutal suppression in the troubled region.\nBeing strong proponents of Kashmiris’ right to self-determination, he said, Thaukur and Dar have been championing the cause of Kashmir peacefully at international level and no power whatsoever can stop them from raising voice for the voiceless victims of Kashmir.\n“The fact remains that India wants to choke every dissenting voice within and outside the valley”, he said adding that after ruthless suppression in the valley India’s racist regime was now hell bent on silencing every Kashmiri who dares to call spade a spade and speaks against India’s brutal suppression and its settler colonialism policies in Kashmir.\nFiling of FIRs against the Kashmiri civil society activists, he said, was part of the apartheid regime’s nefarious game plan to enable complete silence on Kashmir.\nHe, however, maintained that implicating Kashmiri civil society activists in false and fabricated cases won’t deter them from pursuing the cause for which Kashmiris have rendered matchless sacrifices.\nUrging the world human rights organizations to take effective cognizance of matter, Wani said that India was using black laws such as UAPA, PSA and other laws to suppress political dissent in the region.\nMeanwhile, in a separate statement, the KIIR chief voiced his grave concern over the deteriorating human rights situation in the region saying that Indian occupation forces deployed in length and breadth of the Kashmir valley were involved in heinous crimes.\nThe systematic killing of Kashmiri youth by the Indian forces, he said, constitutes a serious violation of the international law for which the government of India should be held accountable.",
  "retrievedAt": "2025-08-11T14:04:38.480Z"
}
