{
  "title": "Sania Nishtar briefs diplomats on Declaration on Establishing a Global Social Protection Knowledge Platform",
  "link": "https://www.app.com.pk/national/sania-nishtar-briefs-diplomats-on-declaration-on-establishing-a-global-social-protection-knowledge-platform/",
  "date_published": "2022-01-10T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): Special Assistant to PM on Poverty Alleviation and Social Protection Dr. Sania Nishtar on Monday briefed the Heads of Diplomatic Missions in Islamabad here at Foreign Office on the “Declaration on Establishing a Global Social Protection Knowledge Platform.”\nThe Declaration is being steered by Pakistan in New York, in collaboration with a “Group of Friends on Social Protection” including Costa Rica, Nigeria and Turkey, supported by the World Bank.Dr. Sania Nishtar introduced the Declaration and apprised the participants of its conceptualization as well as the operationalization of the Global Social Protection Knowledge Platform, a press release issued by the Ministry of Foreign Affairs said.\nShe underscored that the importance of social protection had been vividly pronounced during the COVID-19 pandemic.\nDr. Sania Nishtar said that countries with robust social protection systems including Pakistan were able to contain the fallout of the pandemic better than other nations.\nIn order to benefit from each other’s experiences and share best practices, there was a need to fill the knowledge gap in the global social protection landscape, she added.\nEarlier, in his introductory remarks, Foreign Secretary Sohail Mahmood highlighted the objectives of the briefing, noting that there was a greater realization today of the need to increase investments in social protection systems to safeguard people against the shockwaves of the pandemic and future crises.\nHe called on the Heads of Missions to apprise their respective governments to support this global knowledge-sharing initiative.The participants were also informed that Ehsaas, Pakistan’s social protection program, has organized a day-long event at the Dubai Expo Pakistan Pavilion on 16 January 2022 to promote the Declaration.It is envisaged that the Global Social Protection Knowledge Platform will provide a unique opportunity for government-to-government learning and collaboration that will contribute towards progress on the 2030 Agenda for Sustainable Development.",
  "retrievedAt": "2025-08-11T14:04:19.820Z"
}
