{
  "title": "21 Pakistani universities rank among top of world",
  "link": "https://www.app.com.pk/national/21-pakistani-universities-rank-among-top-of-world/",
  "date_published": "2021-09-02T17:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 02 (APP): Times Higher Education (THE), UK which is the World leading universities rankings agency, met the Federal Minister for Education and Professional Training Shafqat Mahmood on Thursday to present the latest rankings of Pakistani universities.\nTHE team was represented by the Chief Knowledge Officer Phil Baty and Dr. Liz Shepard who is the Chief Data Scientist at THE.\nPhil Baty congratulated the Minister for brilliant performance of Pakistani Universities in the World Universities Rankings 2022. The meeting was also attended by senior officials of the Ministry of Education and Higher Education Commission.\nFor 2022 THE Rankings, the Times Higher Education team analyzed 108 million citations and 4.4 million research publications.\nIn addition, around 430,000 data points from 2144 participating institutions were also analyzed. Times Higher Education conducts an annual academic and research repute survey and its results are also used for rankings.\nFor 2021 survey there were 140,000 reputation survey votes from 22,000 respondents from around the globe. Based on this analysis only 1,662 institutions from 99 countries were allowed to compete for the Times World Universities Rankings.\nAchieving a ranking position in the THE World University Rankings is a great achievement for an institution.\nTo appear in these rankings, HEI(s) must be one of the world’s leading research university meeting strict criteria against 13 indicators. Pakistani universities have made major strides in the field of research and teaching over last three years and this is reflected through THE latest universities’ rankings.\nAs per THE analysis, Pakistan is one of the world’s fastest improving nations on a range of key metrics and is one of the top five of nations globally for improvements in research citations, international outlook and industry links. Times analysis also shows that this is not a one time achievement for Pakistani HEI(s) but this upwards trend in noticeable over last three years performance.\nTwenty one Pakistani universities make the 2022 edition of the World University Rankings, including five newly ranked this year. The total number of ranked universities has risen to 21 from just two in 2016 (the oldest ranking under the same methodology). Eleven Pakistani universities make it into the elite world top 1,000 list in 2022, up from eight last year and just two in 2016.\nQuaid-i-Azam University, leading public sector university, is ranked first among the Pakistani HEIs with an international rank between (501-600) for a second consecutive year. In addition, five Pakistani universities appear for the first time, in the world’s top 800 list.\nAn analysis of the seven universities that have appeared in all of the last five annual editions of the rankings from 2018 to 2022 reveals very positive trends. These HEIs have improved their scoring twice more than the rest of the world. There has been significant improvements in research and academic reputation.\nIn addition, the citations for Pakistani research publications have increased significantly indicating that Pakistan is not only producing more research papers but that that the researchers are engaged in quality research and publishing in high impact journals.\nPakistani universities show strong growth in the areas of Business & Economics, Physical Sciences and Life Sciences, Computer Science. Likewise, the international co-authorship of research in 2021 is also very strong. For more details on these rankings, one may refer to Times Higher Education website.\nThis remarkable progress in the field of higher education would not have been made possible without proper policy and planning by the government of Pakistan and the unprecedented dedication and hard work of the HEC team currently led by the Minister of Education and the Executive Director HEC Dr. Shaista Sohail.\nThe Higher Education Commission has been taking remarkable steps for the empowerment of higher education sector through investment in human resource, raising academic and research standards and development of physical and technological infrastructure of the universities.\nOver last three years, HEC has placed special emphasis on professional development and enhanced research opportunities for faculty members. Research grants worth billions of rupees have been offered to high quality research proposals through a careful review process involving reviewers from national and international experts.\nThis includes research grants like Grand Challenge Fund, Local Challenge Fund, Rapid Research Grants, etc. Around 50 Offices of Research, Innovation and Commercialization (ORICs) have been established in universities around the country.\nTimes Higher Education started publishing Impact Rankings since 2019. These rankings measure university contribution to community, society and the world through its work on SDGs.\nAs many as 36 Pakistani universities appear in THE impact rankings out of which 3 are among top 200 universities. These include University of Agriculture Faisalabad which holds 24th place in the world for Climate Action.\nNational University of Sciences and Technology holds 67th position in the World for Affordable and Clean Energy The Minister thanked Times Higher Education team on sharing the data and analysis with the Ministry and the HEC team.\nHe expressed delight at the increasingly positive performance of the Pakistani universities in the World University Rankings.\nHe emphasized the fact that the universities of Pakistan must aim to go higher in the rankings and for that the Ministry and HEC will work together to identify gaps in performance and support the higher education institutions in overcoming the hurdles.\nHEC team will also be working with the Times Higher Education to hold awareness seminars for the universities to guide them on how to participate in these rankings.",
  "retrievedAt": "2025-08-11T21:09:50.035Z"
}
