{
  "title": "Syed Ali Gilani passes away in Srinagar; President, PM condole death of the Kashmiri freedom fighter",
  "link": "https://www.app.com.pk/national/syed-ali-gilani-passes-away-in-srinagar-pm-condoles-death-of-the-kashmiri-freedom-fighter/",
  "date_published": "2021-09-01T19:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1, (APP): Veteran Kashmiri leader Syed Ali Shah Geelani passed away Wednesday night at his home in Srinagar, capital of Indian Occupied Kashmir at the age of 91.\nSyed Ali Geelani was born on September 29, 1929, to  Syed Peer Shah Geelani of  Zoori Munz village in Tehsil Bandipora which then formed a part of  Baramulla district.\nGeelani received his preliminary education at Sopore, and finished his studies at the Oriental College, Lahore (Pakistan).\nGeelani spent his boyhood in the headquarters of Plebiscite Front at Mujahid Manzil.\nPrime Minister Imran Khan in a statement said, he was deeply saddened to learn of the passing of Kashmiri freedom fighter Syed Ali Gilani who struggled all his life for his people and their right to self-determination.\n“He suffered incarceration and torture by the occupying Indian state but remained resolute.”\n“We in Pakistan salute his courageous struggle and remember his words, “Hum Pakistani hain aur Pakistan hamara hai.”\nThe PM said the Pakistan flag will fly at half-mast and the country will observe a day of official mourning.\nWe in Pakistan salute his courageous struggle & remember his words: \"Hum Pakistani hain aur Pakistan Humara hai\". The Pakistan flag will fly at half mast and we will observe a day of official mourning.\n— Imran Khan (@ImranKhanPTI) September 1, 2021\nPresident Dr Arif Alvi also expressed his deep grief and sorrow over the sad demise of the veteran leader Syed Ali Shah Gilani.\nIn a condolence statement, he said Kashmir was deprived of a great leader who remained steadfast against Indian imperialism all his life.\nAli Gilani was a brave, courageous and sincere leader, he said and prayed to Allah Almighty to rest the departed soul in eternal peace and grant courage to the bereaved family to bear the loss with fortitude.\nPakistan mourns the loss of Syed Ali Shah Geelani, torch bearer of the Kashmir freedom movement. Shah Sb fought for the rights of Kashmiris till the very end, under house arrest of Indian occupation. May he rest in peace and may his dream of freedom come true.\n— Shah Mahmood Qureshi (@SMQureshiPTI) September 1, 2021\nThe Foreign Office in a statement said the Government and people of Pakistan deeply mourn the passing away of the iconic leader of the Kashmiri resistance, Syed Ali Shah Geelani, under prolonged house arrest in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). The nation pays rich tribute to his life-long struggle for justice and freedom.\nSyed Ali Shah Geelani’s unflinching commitment to the Kashmir cause, in the face of persistent persecution and tremendous personal hardship, is unparalleled. He inspired three generations of Kashmiris in resisting the illegal Indian occupation and unabated tyranny. He was a true voice and hero of the Kashmiris’ struggle for self-determination, who never lost his ideological moorings for a single moment. Upright and steadfast, he would never compromise on the just cause that he led throughout his life from the core of his heart. He will be remembered for his unconditional love for Kashmir and Pakistan.\n“May his soul Rest In Peace and may he continue to be an inspiration for those carrying his mission forward to bring an end to illegal Indian occupation of Jammu and Kashmir,” the FO said.\nPakistan will continue to extend all possible support to the Kashmiri people till the realization of their legitimate right to self-determination as enshrined in the relevant UN Security Council resolutions.\nFormer President Azad Kashmir Masood Khan, former envoy Abdul Basit and others also mourned the passing away of the Kashmiri leader.\nSyed Ali Geelani, the brave and resolute Kashmiri leader,  is no more. May his soul rest in peace. People of Jammu and Kashmir and Pakistan mourn his passing away. So do freedom lovers all over the world.\n— Masood Khan (@Masood__Khan) September 1, 2021\nThe flame of freedom that Syed Ali Geelani lit for generations will  continue to burn brighter.\nHe was our hero. A freedom fighter till his last breath. Never compromised on Kashmir. May Allah bless his soul and give us all strength and wisdom to fulfil his mission of freeing Kashmir from Indian occupation. ھم پاکستانی ہیں پاکستان ہمارا ہے۔ pic.twitter.com/GUgf4xxaHS\n— Abdul Basit (@abasitpak1) September 1, 2021\nانا لله وإنا إليه راجعون\nکشمیری حریت رہنما سید علی گیلانی آزادی کے خواب آنکھوں میں بسائے اللہ کو پیارے ہوگئےآپ نے ۹۱ سال عمر پائی اور نشان پاکستان کا ایوارڈ حاصل کیااللہ انکو وہ جنت عطا فرمائے جو دنیا میں جنت میں رہتے ہوئے بھی نہ مل پائی#SyedAliGillani #سید_علی_گیلانی pic.twitter.com/xH9ywUHFIH\n— Abdullah Gul (@MAbdullahGul) September 1, 2021\nRestrictions imposed including suspension of internet services in the Valley: IGP Kashmir Vijay Kumar #JammuKashmir pic.twitter.com/qFvE9IVTkF\n— ANI (@ANI) September 1, 2021",
  "retrievedAt": "2025-08-11T21:10:00.572Z"
}
