{
  "title": "Veteran Hurriyat leader Syed Ali Gilani laid to rest at Haiderpora",
  "link": "https://www.app.com.pk/national/veteran-hurriyat-leader-syed-ali-gilani-laid-to-rest-at-haiderpora/",
  "date_published": "2021-09-02T06:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 2 (APP): The veteran Hurriyat leader and the icon of Kashmir Freedom Movement, Syed Ali Gilani in Indian illegally occupied Jammu and Kashmir has been laid to rest in tight military siege at Haiderpora in Srinagar early Thursday morning.\nAccording to Kashmir Media Service, the occupation authorities had put strict restrictions on the movement of the people and the whole area was cordoned off.\nAlthough Syed Ali Gilani and his family wanted him to be buried at Martyrs Graveyard in Srinagar, but the Indian authorities did not allow it fearing agitation from people of occupied Kashmir. He was buried just few meters away from his house in Hyderpora, Srinagar.\nA small number of people mainly some close relatives were allowed to participate in the funeral prayers and to have a last glimpse of the martyred leader.\nIndian army had laid restrictions all across the occupied valley to prevent mammoth gathering on the funeral of Syed Ali Gilani.\nSoon after the news of Syed Ali Gilani’s demise spread out, announcements were made from mosques around Srinagar calling out people to come out of their homes to pay homage to Syed Ali Gilani.\nHowever, Indian authorities used coercive measures to dissuade people from coming out of their homes. Several Hurriyat leaders and activists including Mukhtar Ahmad Waza have been rounded up by the Indian authorities as well.\nThe All Parties Hurriyat Conference has also fervently appealed to the people of Kashmir to come out of their homes and hold large protest against the cruelty of Modi regime. The APHC has asked people to hold Gaibana Namaz-e-Janza (funerals in absentia) in every nook and corner of the occupied territory.\nThe appeal has also been made to the Kashmiri and Pakistani diaspora and peace loving people all across the globe to hold protests and Gaibana Namaz-e-Janaza all across the globe.",
  "retrievedAt": "2025-08-11T21:10:00.327Z"
}
