{
  "title": "Ehsaas scholarships to enhance women empowerment: Dr. Sania",
  "link": "https://www.app.com.pk/national/ehsaas-scholarships-to-enhance-women-empowerment-dr-sania/",
  "date_published": "2021-09-02T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 02 (APP): Special Assistant to the Prime Minister (SAPM) on Poverty Alleviation and Social Protection, Dr. Sania Nishtar Thursday said Ehsaas Scholarships would enhance women empowerment through ensuring their increased role in society and businesses, breaking down the barriers.\nDr. Sania was speaking as a chief guest at the HEC-USAID Scholarship event jointly hosted by Higher Education Commission (HEC) and U.S. Agency for International Development (USAID) at the HEC Secretariat.\nUnder the umbrella of Merit and Needs based Scholarship Program (MNBSP), USAID and HEC have rolled out 700 new graduate level scholarships for women, talent hunt program for financially disadvantaged girls, and capacity building plan to support financial aid systems of forty Pakistani public sector universities.\nSpeaking on the occasion, Dr. Nishtar said that with Ehsaas Undergraduate Scholarship programme dovetailed to Ehsaas School Stipends nationwide, the unprecedented scale of Ehsaas assistance allowed Pakistan, for the first time, to look holistically at measures to improve education at all ages from pre-school to under-graduate and everything in between.\nDr. Sania observed, “A country cannot thrive when half of its population is not educated and enabled to fulfil their potential. Therefore, at its core, Ehsaas aims to empower 10 million poorest women in Pakistan and help them to achieve their potential”.\n“Providing financial access to education for the underprivileged populations, Ehsaas is running a need cum merit based Ehsaas undergraduate scholarship programme nationwide offering 200,000 scholarships worth Rs. 24 Billion over 4 years”, she said.\nTo-date, over 142,000 scholarships have been awarded under Ehsaas within two years.\nThe Ehsaas Scholarship reserves 50 percent of its places for women. By covering 100% of the tuition fees and providing additional stipend for essential living expenses, Ehsaas provides even playing field for all students, she added.\nDr. Sania thanked USAID for supporting 700 scholarships and for supporting capacity building in women universities to promote higher education for girls in Pakistan.\nUSAID has supported scholarships for meritorious but financially disadvantaged students since 2004 through the MNBSP program to assist the Higher Education Commission Government of Pakistan’s efforts to raise enrollment in Pakistani universities and meet international standards.\nJulie Koenen, USAID Mission Director/Pakistan, Embassy of the United States of America said, “We are pleased to share that in partnership with the HEC, we are more committed to supporting female education. 700 fully funded graduate level scholarships will be awarded to the most talented females preferably from rural Sindh, former FATA, South Punjab and conflict affected districts of Khyber Pakhtunkhwa.”\nShe further added that supporting sustainable donors and partners is one of USAID’s important agenda. “For better delivery of services and transparency of systems, we are very pleased to invest in enhancing capacities of university administrators of financial aid offices of 40 partners of Ehsaas Undergraduate Scholarships”.\nMichael Nehrbass, Deputy Mission Director USAID Pakistan said, “MNBSP will help to identify female students ahead of time and invest in them to encourage to apply for the available scholarship opportunities and also train them to succeed for universities’ entry tests.”\nExecutive Director HEC, Shaista Sohail also thanked the Mission Director USAID for launching the expansion program under MNBSP and acknowledged that the investment made in female education and talent hunt program are important steps to empower girls and increase access of women towards higher education, which is also an important objective of HEC.\nOther eminent guests present at the event were, USAID Mission Director Pakistan, Executive Director HEC, USAID officials, Vice Chancellors and students. The efforts of USAID for putting its tremendous contributions to invest in the female education from the platform MNBSP was lauded by the HEC, Vice Chancellors and students.\nVice Chancellors from different universities of Pakistan also praised the contribution of USAID and HEC in the field of education, providing the opportunity to students changing their lives, as many of them are contributing across various sectors of Pakistan.",
  "retrievedAt": "2025-08-11T21:09:52.038Z"
}
