{
  "title": "Austria thanks Pakistan for support in transit of its nationals from Afghanistan",
  "link": "https://www.app.com.pk/global/austria-thanks-pakistan-for-support-in-transit-of-its-nationals-from-afghanista/",
  "date_published": "2021-09-02T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 2 (APP): Foreign Minister Shah Mahmood Qureshi and his Austrian counterpart Alexander Schallenberg on Thursday exchanged views on the latest developments in Afghanistan as well as on bilateral relations.\nDuring the telephonic conversation, the Austrian Foreign Minister thanked Pakistan for its support in facilitating transit of Austrian nationals and others from Afghanistan.\nSharing Pakistan’s perspective, the Foreign Minister, who received the call, stressed the importance of peaceful and stable Afghanistan and highlighted the salience of safety and security of Afghans as well as an inclusive political settlement.\nHe stressed that there was a historic opportunity for ending 40 years of conflict in Afghanistan. Engagement of the international community with positive messaging and constructive actions was much needed, he added.\nThe Foreign Minister called for concerted efforts to stabilize the security situation, preserve the peace, and preclude any exodus of Afghans as refugees a press release issued here by the Ministry of Foreign Affairs said.\nHe underlined the need for international community to show solidarity with the Afghan people to address the humanitarian needs and support economic stability.\nThe two Foreign Ministers expressed satisfaction over the current level of bilateral engagement and pledged to further establish linkages and deepen cooperation between the two countries in all spheres of mutual interest including trade, economy, higher education, tourism and culture.\nForeign Minister Qureshi invited his Austrian counterpart to visit Pakistan on mutually agreed dates.\nForeign Minister Schallenberg accepted the invitation and said that he looked forward to welcoming Foreign Minister Qureshi to Vienna for a bilateral visit.",
  "retrievedAt": "2025-08-11T21:09:54.772Z"
}
