{
  "title": "Corn turns to be popular winter delight",
  "link": "https://www.app.com.pk/national/corn-turns-to-be-popular-winter-delight/",
  "date_published": "2022-11-29T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP): With the constant dipping of mercury and the arrival of the winter season, different corners of the twin cities of Rawalpindi and Islamabad are echoing the voice of corn sellers with their three-wheeled carts attracting people of all ages, especially children.\nThe aroma of corn and firewood rising from the wood-fired stove attracts food lovers as well as diet-conscious people.\nDuring the season, the corn hawkers can be found in every corner especially outside educational institutions, markets and offices, offering roasted corn kernels heated in the sand and sprinkled with lemon and spices.\n“The traditional winter delicacy of hot corn has always remained a favorite for my kids and they use to buy it almost every day,” said a mother while talking to APP here Tuesday.\nShe said that all other snacks available for children in their schools and outside are not healthy but these hot corns are hygienic as well as a healthy snack for my children.\nMuhammad Shafeeq, a college student while sharing his views said that corn always remains the first and favorite choice for us as a snack but recent inflation also increased the prices of corn and vendors are also fleecing the buyers by charging high.\nLast year, the rate of boiled corn was between Rs 20 to Rs 30 which is now between Rs 40 to Rs 60 which is a big jump but still, it is very economical in comparison with other snacks which are not only expensive but unhealthy as well.\nA group of working women enjoying corn on a roadside told APP that they often buy roasted or boiled corn from outside our college as it is a very healthy and nutritious snack which is free of unhygienic oil and spices.\nServed with lemon and a sprinkling of salt and pepper, these fresh maize kernels have great nutritional value and are a staple for people on the go.\nAccording to a nutritionist, Faiza Shams, corn is a complete and nutritious diet for people of all ages which is also a healthy and tasteful diet for diet-conscious people.\nNormal size corn contains vitamin B-12 and folic acid which prevents anaemia and has sufficient iron in it to increase red blood cells in the human body, she added.\nShe said that other snacks which children use to buy are not good for health as majority of them are made with substandard ingredients and unhygienic conditions. The corns are the best choice for the people of all ages as it is a best and balanced snack for all.\nA school girl, Ayza said that “Whenever I hear the voice of corn sellers in my street or I spot them outside my school I cannot stop myself from craving some as it is my all-time favorite delight.\nShe said that her parents always stop her from consuming packed snacks and fast food but due to the health and hygiene value of corn they never stop me from eating corn.\nIyaz Khan, a corn seller said that it’s a fact that the price of corn has gone up during the recent year but his profits have shrunk.\n“Last year we were charging Rs15 for a small cob and Rs 30 for a large one but now due to the increased price of material we have had to increase the prices which is badly affecting our business.\nHe said that people irrespective of their ages crowd the carts for buying hot corn in the chilly weather as it is the favorite delight of everyone but children are the more frequent customers of corn.\nHe said that they do this business only during winter but they are unable to earn handsome profit due to inflation.",
  "retrievedAt": "2025-08-11T15:56:08.177Z"
}
