{
  "title": "Israel’s annexation, occupation of Palestinian territories against humanitarian, int’l law: Ashrafi",
  "link": "https://www.app.com.pk/national/israels-annexation-occupation-of-palestinian-territories-against-humanitarian-intl-law-ashrafi/",
  "date_published": "2022-11-29T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Tuesday said the Israel’s annexation and occupation of Palestinian territories was against the humanitarian and international law.\nOn the International Day of Solidarity with the Palestinian People, he, in an exclusive talk with APP, said the people and government of Pakistan reiterated their continuous support to the Palestinian people.\n“Pakistan has always supported the Palestinian struggle and will continue to do so,” he said adding,Pakistan fully endorsed and supported Palestinian consent to negotiations in accordance with internationally recognized terms and peace agreements.\nAshrafi who is also the chairman of Pakistan Ulema Council said an unrelenting Israeli violence against Palestinians and its illegal occupation of Palestine were the undeniable facts of this conflict.\nHe said Palestinian freedom struggle would continue until the right to self-determination was achieved.“Pakistan is standing by Palestinian people and remain so until and unless they get freedom from Israel’s clutches,” he added.\nHe said for more than 75 years, Israel had been committing atrocities on Palestinians, the blood of innocent people was being shed and the world was playing the role of silent spectator over it.\nHe said Pakistan, Saudi Arabia, Turkiye, Qatar and other Islamic countries had a loud and clear stance on the resolution of Palestine issue that was a “free and independent Palestinian state”.\nAshrafi reiterated that Pakistan would continue its support to the oppressed Kashmiris and Palestinians expressing the hope that one day Kashmir and Palestine would bless with independence.",
  "retrievedAt": "2025-08-11T15:56:07.925Z"
}
