{
  "title": "Govt making all-out efforts to provide energy to people, industries through LNG: Muhammad Ali",
  "link": "https://www.app.com.pk/national/govt-making-all-out-efforts-to-provide-energy-to-people-industries-through-lng-muhammad-ali-2/",
  "date_published": "2023-11-07T08:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 7 (APP): Caretaker Minister for Energy, Power and Petroleum, Muhammad Ali on Tuesday said that to ease the lives of people and businesses, the government was making all-out efforts to provide energy to the people and industries through imported LNG, especially during winters.\nHe was addressing the 29th edition of the Annual Technical Conference (ATC) jointly organized by the Society of Petroleum Engineers (SPE) and the Pakistan Association of Petroleum Geo-scientists (PAPG).\nThe conference was attended by Faheem Haider, Chairman ATC and Chairperson SPE Pakistan Section, Mr Mohamed Al Marzouqi SPE Middle East & North Africa (MENA) Regional Director and EVP Abu Dhabi National Oil Company (ADNOC), Respectable Chief Executives and Country Heads of Oil & Gas companies, Geo-scientist, Petroleum Engineers.\nSpeaking on the occasion, this gathering of Geo-scientists and Engineers with vast experience will enable a new thought horizon that may lead to new ideas in the exploration of indigenous oil and gas in the county, he hoped.\nHe lauded the Theme of the Conference “Exploring the Unexplored: High-Risk Plays and Economic Challenges” stating that it is a pertinent focus area under the present circumstances.\nThe Minister was confident that this conference will provide wide opportunities to address current challenges and future strategy for the development of Energy Resources particularly in the area of oil & gas exploration.\n“Allah has blessed us with a huge sedimentary basin, national and multinational companies are pursuing exploration in various parts of Pakistan, and still nearly 60-70 percent area is “unexplored” and needs to be evaluated for the exploration of oil and gas to reduce import of fuel.\nWe are trying to attract FDI in the field of oil and gas and expect that learnings from this technical conference and the efforts of the professionals and their links with professionals outside Pakistan will help foreign investors become interested in investing in Pakistan’s Oil and gas Sector,” he said.\nHe went on to say that International Oil Companies (IOC) look at the assessment of “access” to the geography and technology, local communities engagement, operational doability, security and long-term sustainability of the business.\nThis is where the recent discoveries of Mari Petroleum and OGDCL will give confidence to the IOC on the technical and commercial success. However, security continues to be a challenge and this requires special focus from the Government so that the professionals can focus on “exploring” and discovering hydrocarbons in “High-Risk” Plays.\nMinister Muhammad Ali said that the country is energy deficient and our challenge is how to cope with the situation in the present economic conditions. Fossil fuel contributes about 70-80 percent to energy mix.\n“It is very challenging to move away from the exploration of oil and gas in the world particularly in Pakistan. With the increase in global oil prices and the pressures on oil prices due to war and other factors is increasing the cost of importing energy more” he informed.\nLocally, the minister said that oil and gas constitute about 70% of the energy mix and the challenge is how to meet the energy requirement of the country through indigenous resources as importing energy with the increasing import bill is becoming an economic challenge for the country.\nHe asked the participants that Technical, economic and regulatory challenges to reduce the energy import bill should be discussed during the next two days. It would be useful to hear the views of local and international experts on steps which may be taken to address these challenges.\n“We are certain that this conference will be a good platform which will provide you with unlimited benefits and will open new plays for exploring the unexplored and addressing the economic challenges. We look forward to seeing conference proceedings and recommendations that may generate remarkable initiatives in driving the industry forward” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:24:55.414Z"
}
