{
  "title": "Govt to accept decision of Senate over Motion Pictures( Amendment) Bill 2023: Solangi",
  "link": "https://www.app.com.pk/national/govt-to-accept-decision-of-senate-over-motion-pictures-amendment-bill-2023-solangi/",
  "date_published": "2023-11-07T08:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 7 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi on Tuesday said that the government has great respect for the Senate and would accept the decision of this august house on the introduction of the Motion Pictures (Amendment) Bill, 2023.\nResponding to a point of order raised by Mian Raza Rabbani, the minister said he had always firmly stood with the constitution, law and democracy adding that there was no possibility of change in the said principles.\nHe said that every bill took sufficient time in the process of preparation and the past government did the necessary work on it. The law ministry and respective legal branch had advised him to present the said bill in the House, the minister said.\nDeferring the bill, Chairman Senate Muhammad Sadiq Sanjrani said that he would give his opinion in this regard besides taking the Attorney General’s point of view.\nEarlier, on a point of order, Mian Raza Rabbani questioned the legality of introducing a bill by the caretaker minister. Citing section 230 of the Election Act 2017, he maintained that the caretaker government could not do legislation as it was only the job of the elected representatives.\nHe urged the chair not to allow the minister to introduce the bill and remove it from the agenda.\nEarlier, speaking in the Senate during question hour, Murtaza Solangi assured the House that all questions of honorable senators would properly be responded to after getting detailed answers from the respective ministries and departments.\nHe said that he had been assigned the charge of Ministry of Parliamentary Affairs yesterday and it was his responsibility to give satisfactory answers to the questions raised by the Senators.",
  "retrievedAt": "2025-08-11T10:24:33.315Z"
}
