{
  "title": "Tashkent to host ECO summit form November, 8",
  "link": "https://www.app.com.pk/national/tashkent-to-host-eco-summit-form-november-8/",
  "date_published": "2023-11-07T13:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP): Tashkent, the capital of Uzbekistan for the first time in history, will host summit of the Economic Cooperation Organization (ECO) scheduled to be held on November 8-9.\n“Our country has been a member of the organization since November 1992, but this is the first time in the history of independent Uzbekistan and this association that a multilateral summit within the framework of the ECO is being held on Uzbek soil” said an embassy of Uzbekistan in Pakistan in a news release.\nThe Economic Cooperation Organization is a regional interstate organization founded in 1985 in Tehran (Iran).\nThe goals and objectives of ECO – development of mutually beneficial trade and economic cooperation and regional interaction in transport and communication sphere fully meet the interests of our republic.\nAt present, the ECO members are Afghanistan, Azerbaijan, Iran, Kazakhstan, Kyrgyzstan, Pakistan, Tajikistan, Turkmenistan, Turkey and Uzbekistan.\nSince 1995, the ECO has had observer status in the UN and the Organization of Islamic Cooperation (OIC).\nThe ECO activities are coordinated and monitored by the organization’s Secretary General, who is elected and appointed by the Council of Foreign Ministers of the ECO member countries for a period of three years.\nIn 2022, Uzbekistan chaired the ECO for the first time. Speaking at the 15th ECO Summit in Ashgabat on 28th November 2021, President Shavkat Mirziyoyev put forward proposals for cooperation in trade, investment, transport and “green” economy.\n“We need to more fully utilize the significant potential of our countries, which have a huge market with a population of over 500 million people, in the spheres of trade and investment,” the head of our state stressed at the summit.\nAccepting the chairmanship, the President said Uzbekistan favored the development of comprehensive relations within the ECO framework.\nUzbekistan considers ECO as a platform for discussing ways to improve development and promote trade and investment opportunities in South Asia, Central Asia and the Middle East.\nWithin the framework of ECO, Uzbekistan advocates the creation of interregional transit hubs, the development of modern transport and road infrastructure, the optimisation of transport and transit tariffs, the simplification of conditions for international freight and passenger traffic and the introduction of digitalisation in the transport industry.\nIn addition, at the summit in Ashgabat, President Shavkat Mirziyoyev put forward an initiative on active joint development of “green” economy, wide introduction of resource-saving technologies in industrial sectors, and achievement of carbon neutrality.\nUzbekistan is also in favor of joining efforts to develop common approaches and provide necessary assistance to Afghanistan.\nIn this regard, the head of our state has put forward an initiative to consistently continue the implementation of major trade, transport and energy projects of regional significance jointly with Afghanistan in order to promote the economy of this country and support its people.\nThe ECO countries are the largest trade partners of Uzbekistan.\nAccording to the results of 2022, trade turnover between Uzbekistan and ECO countries totalled $12.3 billion, and in January-July 2023 – $5.8 billion.\nSince May 2018, there has been an intensification of Uzbekistan’s cooperation with ECO.\nIn particular, since 2018, ECO Secretaries General Khalil Akca, Hadi Soleimanpour, Khusrav Noziri, as well as Deputy Secretary General Hussein Burchakli have visited Uzbekistan.\nAt the same time, the participation of the Uzbek side in international events held under the auspices of ECO has been considerably intensified.\nOfficial delegations of Uzbekistan take part in the meetings of Prosecutors General, Heads of Maritime Organization s, Ministers of Transport, Tourism and Agriculture, as well as meetings of the ECO Expert Group on Mineral Resources and Heads of Veterinary Organization s of the ECO Member States.\nIn view of the coronavirus pandemic in 2020, many events were held online, including a virtual meeting of the ECO Member States, the United Nations Industrial Development Organization (UNIDO) and ECOLONER, an international energy consultancy, to discuss the ECO Clean Energy Centre project, the ECO Virtual Conference on “Prospects and Challenges of Regional Electricity Markets: Exploiting Trade and Investment Opportunities”, the first virtual meeting of the Working Group on Civil Aviation (November), the first virtual meeting of the ECO Working Group on Civil Aviation (November), and the first virtual meeting of the ECO Working Group on Trade and Investment (November).\nAs a result of the virtual meeting of the Ministers of Transport of the ECO Member States in December 2020, Uzbekistan’s initiative to include road and rail transport corridors “Central Asia – Afghanistan – Pakistan”, “Central Asia – Afghanistan – Iran”, “Uzbekistan – Turkmenistan – Iran” into the transport arteries of the ECO region was supported by all member countries of the organization and included in the final Declaration.\nIn January 2021, the first meeting of the Heads of Special Economic Zones of the ECO Member States and the 31st meeting of the Regional Planning Council were held.\nAt the regular meeting of the ECO Regional Planning Council chaired by Uzbekistan on 17-26 January 2022, on the initiative of our country, 2022 was declared the “Year of Strengthening Connectivity”.\nIt should be noted that more than 25 events were held during Uzbekistan’s chairmanship in ECO.\nThus, on 5-6 July 2022, the 7th meeting of the ministers of agriculture of the ECO countries was held in Tashkent.\nThe event was also attended by the organization’s Secretary General Khusrav Noziri.\nOn 13th December 2022, the fourth meeting of the ECO Tourism Ministers was held online, during which Shakhrisabz was selected as the ECO Tourism Capital in 2024.\nOn 5th December 2022, the President of Uzbekistan signed the law “On Ratification of the Treaty of Izmir”, strengthening the legal basis for full membership in the Economic Cooperation Organization , as well as expanding opportunities for comprehensive cooperation with the Organization ‘s Member States.\nOn 24th January 2023, the 26th meeting of the ECO Council of Ministers of Foreign Affairs (CMFA) was held in Tashkent, which was attended for the first time by the foreign ministers of all member states of the organization.\nAs a result, the Tashkent Communiqué was adopted. On the same day, the President of Uzbekistan received the ECO Secretary General.\nIt is also worth noting that ECO Secretary General Khusrav Noziri participated as an international observer at the presidential elections in October 2021, as well as at the Constitutional Referendum held in Uzbekistan on 30th April this year.",
  "retrievedAt": "2025-08-11T10:24:18.362Z"
}
