{
  "title": "Pakistan ready to replicate its unique AMA success story with developing countries: PM",
  "link": "https://www.app.com.pk/national/pakistan-ready-to-replicate-its-unique-ama-success-story-with-developing-countries-pm/",
  "date_published": "2023-11-07T15:15:00.000Z",
  "source": "APP",
  "content": "He said under the National Financial Inclusion Strategy (NFIS), the State Bank of Pakistan (SBP) and the Pakistan Telecommunication Authority (PTA) collaborated with various branchless banking providers, banks and telecom operators to introduce Third Party Provider Services in Pakistan to facilitate the unbanked and underbanked population.\n“The slogan is banking the unbanked. Before the launch of the AMA Scheme, 80% of the population was unbanked, whereas after the soft launch in December 2021 the ratio has improved by 10%. Unfortunately, of the 30% having bank accounts, only 18% (less than 5% of the total banking population) are women. With the launch of the AMA accounts 38% are women,” he told the participants.\nHe said any Pakistani holding a valid National ID Card could open a bank account digitally anywhere without any hassle in less than two minutes in a swift, easy and affordable manner in any AMA participating bank from a smart or a feature phone using a short code of *2262#.\n“The account holders can then make transactions without the need for internet connectivity. Already more than 8.5 million Pakistanis without internet facilities have bank accounts and this number is growing by 4000-5000 a day,” he added.\n“I believe Pakistan is leading in the opening of bank accounts in Edison Alliance’s 1 Billion Lives Challenge by 2030. The platform’s task is two-fold. The first is to open bank accounts without hassle and the second for the “many-to-many” model to help government and commercial organizations in social welfare and relief programmes, digital lending both Micro and Nano loans, as well as digital insurance to the masses.”\nHighlighting other innovative services being provided by Pakistan’s banking sector, he said the home remittances being processed in a transparent and swift manner with the transaction of funds through legal financial channels was of particular importance.\n“The AMA Platform is conducting a pilot project with a number of banks where the recipient gets the fund directly from the donor abroad which can then be encashed directly at any one of the participating banks on the State Bank’s PTA’s innovative “agent interoperability” method,” he added.\nCalling the AMA Scheme a “shining example” of public-private partnership, he congratulated VRG, a member of the Pathfinder Group, a long-term member of the World Economic Forum (WEF), for the remarkable achievement.\nCaretaker Finance Minister Dr Shamshad Akhtar commended the EDISON Alliance for its commitment to inclusive digital inclusion for the unbanked in developing countries.\nHighlighting making bank accounts accessible to all Pakistanis on the AMA Scheme, particularly women, she acknowledged the transformative role of Benazir Income Support Programme (BISP) in improving the lives of Pakistan’s poorest through access to education, healthcare, and poverty alleviation.\nIn his keynote presentation, CEO VRG Muhammad Salman Ali highlighted VRG’s achievement as the first Payment\nSystem Operator (PSO)/Payment Service Provider (PSP) and Third-Party Service Provider (TPSP) to migrate to the cloud with SBP approval.\nHe said the AMA Scheme has significantly contributed to the many-to-many model and VRG’s accomplishments has opened new avenues for the underprivileged and is serving as a milestone for empowering both men and women.\nDeputy Governor SBP Saleem Ullah Khan, emphasized the importance of VRG’s interoperability platform in simplifying financial transactions by the flexibility of the interoperability platform, which allows individuals to link their accounts across different banks, making agent-to-agent transactions both hassle-free and cost-effective.\nHe anticipated a twenty percent increase in the bankable population within five years and underlines the\ntransformative potential of digital wallets.\nDG Commercial PTA Arif Sargana discussed the technical and financial regulatory aspects of the project and highlighted collaboration with BISP and its positive impact on beneficiaries. He expressed support for initiatives that promote digitalization and provide solutions to address the unbanked population of Pakistan.\nDr. Amjad Saqib, Chairman BISP, underscored the significant success of AMA Scheme in providing hope and assistance to millions of beneficiaries and its impact on education, healthcare, and poverty improvement, positioning BISP as a beacon of hope for Pakistan’s marginalized communities.\nDr. Saqib noted the creation of 20 million digital accounts to benefit 9.3 million beneficiaries and its pivotal role in combating poverty and improving lives. He expressed his desire to continue collaboration with VRG and AMA Scheme.\nMr. Shakeel Ahmed, General Manager of IT at Utility Stores Corporation (USC) outlined plans for enabling digital payments through AMA Scheme, enhancing targeted subsidies for eligible individuals and enabling effective cashless payments across the country.\nAamir Ibrahim, CEO of Jazz emphasized the role of technology, including smartphones and fintech solutions, in expanding financial services.\nHe highlighted Jazz’s success in reducing cash reliance, alleviating poverty, and promoting literacy, with 43 million JAZZ bank account holders benefiting from telecom services via AMA Scheme, an impactful public-private collaboration which reaffirmed his commitment to ongoing support and collaboration to empower Pakistan.",
  "retrievedAt": "2025-08-11T10:24:08.699Z"
}
