{
  "title": "Int’l Conference on ‘Women in Islam: Status and Empowerment’ commences in Jeddah",
  "link": "https://www.app.com.pk/national/intl-conference-on-women-in-islam-status-and-empowerment-commences/",
  "date_published": "2023-11-07T07:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 07 (APP): The three-day (November 6-8) International Conference on ‘Women in Islam: Status and Empowerment’ jointly organized by the Organization of Islamic Cooperation (OIC) and the Kingdom of Saudi Arabia commenced in Jeddah to hold broad-based discussions on the role of women in an Islamic society. .\nSpecial Assistant to Prime Minister (SAPM) on Human Rights and Women Empowerment, Mushaal Hussein Mullick is heading the Pakistan delegation. She is being accompanied by the Chairperson National Commission on the Status of Women (NCSW), Nilofar Bakhtiar, and the Permanent Representative of Pakistan to the OIC, Ambassador Fawad Sher at the Conference, a press release received here on Tuesday said.\nFormer Foreign Minister and Minister of State, Hina Rabbani Khar is also participating as a Panelist.\nThe conference would focus on the rights and responsibilities of women in Islam. In addition to Islamic scholars and official delegations from the OIC Member States, a large number of female heads of State, Ministers, and representatives from various international and regional organizations are participating. Researchers, think tanks, and research centers from around the world are also attending.\nIt would deliberate on five thematic areas including; the status of women in Islam and her rights, Muslim women and the Dilemma of Islamic teachings and social traditions, Muslim women in the Gulf, Arabic and Islamic context, Muslim women in contemporary societies and, the prospects for Muslim Women’s empowerment in education and work. In addition to the statements by the official delegations of the OIC Member States, the conference will hold a special working session on each thematic area.\nThe conference on Women is being held in pursuance of Resolution No.66/49-Pol adopted by the 49th OIC Council of Foreign Ministers (CFM) in Mauritania earlier this year which called for holding an International Conference on Women in Islam.\nThe conference would produce a comprehensive document titled ‘The Jeddah Document on Women in Islam’ at its culmination on Wednesday.",
  "retrievedAt": "2025-08-11T10:24:35.297Z"
}
