{
  "title": "Liverpool lift Premier League trophy after Palace draw - Sport - DAWN.COM",
  "author": null,
  "content": "Virgil van Dijk lifted the Premier League trophy after Liverpool’s 1-1 draw with Crystal Palace on Sunday as the Reds held a title party with their own fans for the first time in 35 years.\n\nArne Slot’s side wrapped up their record-equalling 20th English crown with a demolition of Tottenham in April, but the long-awaited trophy presentation was saved for the final game of the season.\n\nLiverpool’s last title in 2020 was won during the Covid-19 lockdown, meaning the trophy was held aloft by then-captain Jordan Henderson in front of an empty stadium.\n\nThe Reds made the most of their first title celebration in a packed Anfield since 1990 as the 61,000-capacity crowd partied along with the great and good of Liverpool’s illustrious past.\n\n“It’s always special to win something, but at certain clubs maybe a little bit more,” Slot said. “I don’t think you expect anything like this. If you look at the Premier League in the last few seasons, it was always a race to the end.\n\n“To be part of it was already nice, let alone to win it.”\n\nAlan Hansen, who captained Liverpool in their last trophy lift at a full Anfield in 1990, presented the silverware to current Reds skipper Van Dijk.\n\nKenny Dalglish, Liverpool’s manager 35 years ago, was watching from the stands, as was Jurgen Klopp, who masterminded the Reds’ Premier League triumph in 2020 before leaving last year.\n\nFireworks, smoke and red ticker tape filled the air as the trophy was paraded around Anfield, with the famous Kop stand adorned with banners and flags emblazoned with slogans hailing their heroes.\n\nEven Trent Alexander-Arnold — the Liverpool right-back controversially set to leave in a widely-expected move to Real Madrid — was embraced by fans on his final appearance for his boyhood club.\n\nAlexander-Arnold had been booed after coming on as a substitute for the recent draw with Arsenal in the first game following his announcement that he will depart when his contract expires in June.\n\nWith Anfield in party mood, tearful Alexander-Arnold was granted a fond farewell as he was cheered when he came off the bench in the second half, the Liverpool-born defender responding by kissing his badge.\n\nLiverpool failed to win any of their four games after sealing the title.\n\nBut that couldn’t detract from the festive atmosphere, which was in full swing before the game even kicked off as Slot’s team were given a guard of honour onto the pitch by Palace’s players, before the Reds returned the favour to salute the FA Cup winners.\n\nIsmaila Sarr’s ninth-minute goal for Palace couldn’t spoil the occasion either. Liverpool midfielder Ryan Gravenberch, who had been booked for diving, was shown a straight red card after his foul on Daichi Kamada in the 68th minute.\n\nBut Mohamed Salah ensured Liverpool avoided defeat in their finale when he bundled home in the 84th minute.\n\nSalah’s 29th goal this season equalled the Premier League record of most goal involvements in a season, previously held by Andy Cole and Alan Shearer, who both achieved 47 in a 42-game season.\n\nThe Egypt forward finished as the Premier League’s golden boot winner for a record-equalling fourth time.\n\nLiverpool’s players gathered in one long line to sing the club anthem ‘You’ll Never Walk Alone’ in a rousing scene after the trophy presentation.\n\nThe party is set to continue on Monday when Liverpool will parade the trophy through the city on an open-top bus.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/252346001f66ae5.jpg",
  "retrievedAt": "2025-08-23T14:27:02.972Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913273/liverpool-lift-premier-league-trophy-after-palace-draw",
  "dateList": "2025-05-25",
  "date_published": "2025-05-25T18:54:28.000Z"
}
