{
  "title": "Salah voted Premier League player of the season - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Mohamed Salah has been voted Premier League player of the season for the second time after a stellar individual campaign inspired Liverpool’s march to a record-equalling 20th English title while his team-mate Ryan Gravenberch was named the young player of the season.\n\nSalah scored 28 goals — five more than anyone else — and provided 18 assists to guide the Anfield club to the title, with Arne Slot’s side winning it with four games to spare.\n\nHaving also earned the award in 2017-18, Salah became only the fifth player to win it twice after Thierry Henry, Cristiano Ronaldo, Nemanja Vidic and Kevin De Bruyne.\n\nThe 32-year-old Egyptian is on course to win another Golden Boot for most goals in a season and is five strikes ahead of Newcastle United striker Alexander Isak going into the final day of the season on Sunday.\n\nNo player before has had 46 goal involvements in a 38-game season and Salah could even break the record of 47 held by Alan Shearer and Andrew Cole, who achieved the feat in a 42-game campaign, when Liverpool host Crystal Palace at Anfield.\n\nSalah is two assists off the single-season record held by Henry and De Bruyne and with six more assists than any other player, he can become the first footballer to win the Golden Boot, Golden Playmaker and player of the season awards.\n\nHe has broken the run of Manchester City players winning the award for the past four seasons.\n\nSalah’s teammate Virgil van Dijk was the last non-City player to win the award in 2018/19.\n\nVan Dijk — who like Salah signed a new contract with Liverpool earlier in the campaign — was one of the players Salah beat in the voting.\n\nThe others were Gravenberch, Arsenal’s Declan Rice, Nottingham Forest’s Morgan Gibbs-White, Newcastle striker Isak, Brentford talisman Bryan Mbeumo, and Chris Wood of Nottingham Forest.\n\nEarlier this month, Salah was named the Football Writers’ Association player of the year, securing almost 90 percent of the votes, marking the biggest winning margin this century.\n\nGRAVENBERCH NAMED BEST YOUNGSTER\n\nGravenberch became one of the first names on the team sheet under Slot, who deployed the Dutchman as a deep-lying midfielder, and the 23-year-old has become a crucial part of Liverpool’s spine, making 36 appearances this season.\n\nHis versatility to shield Liverpool’s back line has come to the fore this season while his ability to quickly initiate attacks, cutting out passing lanes and winning back possession, has made him indispensable.\n\nNo midfielder has made more interceptions this season than Gravenberch (59).\n\nHe is also the second Liverpool player to win the youngsters’ award after Trent Alexander-Arnold won it in 2019-20, the season it was introduced.\n\nPublished in Dawn, May 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/25120901959b2f1.jpg",
  "retrievedAt": "2025-08-23T14:27:19.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913155/salah-voted-premier-league-player-of-the-season",
  "dateList": "2025-05-25",
  "date_published": "2025-05-25T00:02:11.000Z"
}
