{
  "title": "CCP warns firms of fines for prohibitive agreements - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Through a cautionary notice on Sat­urday, the Competition Com­­mission of Pakistan (CCP) has warned undertakings of financial penalties of up to Rs75 million or 10 per cent of annual turnover if they enter into prohibited agreements without seeking prior exemption.\n\nThe CCP has observed that certain agreements between undertakings and their wholesalers, dealers, agents, and retailers may constitute a refusal to deal with non-dealers and often include restrictive provisions that could violate Section 4(2) of the Competition Act 2010.\n\nThese potentially anti-competitive clauses may include resale price maintenance, market division, non-compete obligations, or other conditions that restrict competition.\n\nSuch vertical agreements — those between parties operating at different levels of the supply chain — are ‘void ab initio’ as they prevent, restrict, or distort competition unless specifically exempted by the CCP under Section 5, read with Section 9 of the Act.\n\nExemption applications submitted to the CCP are evaluated using the criteria in Section 9 of the Act. Agreements that promote production or distribution, encourage technical or economic progress, or result in efficiency gains that outweigh any adverse impact on competition may be granted an exemption.\n\nThe CCP has strongly advised all undertakings to apply for an exemption under Section 5 before entering into any such agreements to avoid potential sanctions.\n\nUnder the Competition Act 2010, the CCP is empowered to ensure free competition across all sectors of the economy, aiming to enhance economic efficiency and protect consumers from anti-competitive practices such as abuse of dominance, cartelisation, deceptive marketing, and mergers that may reduce market competition.\n\nPublished in Dawn, May 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/251103338d15720.png",
  "retrievedAt": "2025-08-23T14:27:33.486Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913164/ccp-warns-firms-of-fines-for-prohibitive-agreements",
  "dateList": "2025-05-25",
  "date_published": "2025-05-24T23:48:58.000Z"
}
