{
  "title": "China may block India’s water if Pakistan’s cut off, Karachi seminar told - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Institute of International Affairs (PIIA) organised an interactive session on ‘The Pakistan-India conflict’ in the institute library on Saturday.\n\nIt was explained by PIIA chairperson Dr Masuma Hasan there was a need to hear different voices, especially the voices of the youth, regarding the recent conflict. Therefore, they decided to call on their research assistants to talk about the different themes of the conflict, as identified by them, for the audience to then take it from there.\n\nTaking the audience through the events of the past month or so, she also reminded how India, out of the blue, with no credible evidence, held Pakistan responsible for April 22’s Pahalgam attack, which was an intelligence failure on the part of India.\n\n“Then India suspended the Indus Waters Treaty of 1960 and Pakistan suspended the Simla Agreement of 1972,” she said.\n\n“Then on May 7, India launched Operation Sindoor against Pakistan. While defending the country very well, Pakistan retaliated on May 10, which was followed by a ceasefire after US president Donald Trump’s intervention,” she added.\n\nResearch assistant Mohammad Usman presented a paper on ‘Water Assets and Resources’. He said that if India were to stop the water flow to Pakistan, it would risk flooding its own upper regions. “But if they stopped our water during the dry seasons, it could be a concern for us because the flow of water is lower and storage matters the most. It can affect our farmers, which could result in lower yields,” he said.\n\n“But if India blocked our water, it would require significant infrastructure, which will take years to build and would also require billions of dollars,” he said.\n\nIn war with India, Pakistan reasserts itself through controlled display of sophisticated force, say experts\n\n“As for the weaponisation of water, or the water bomb, a concept when the upper riparian state blocks the flow of water and then suddenly releases a significant amount of water without notifying the lower riparian state, you have a big flood. Here in the case of Pakistan and India, Pakistan is the lower riparian state and India the upper riparian state. But in the case of China and India, China is the upper riparian state and India the lower riparian state, especially in Brahmaputra. China can also block India’s water,” he pointed out.\n\nResearch assistant Syeda Maliha Sehar read a paper on the theme of ‘Political and Military Interests’. “We saw a maturity of new capabilities developed through the Pakistan-China military partnership,” she said.\n\n“By deploying Chinese-origin systems designed to destruct Indian surveillance and communications, Pakistan directly challenged the technological dominance of both Indian and Western-aligned platforms. Pakistan’s response served to dismantle long-standing perceptions of asymmetry, re-framing Pakistan, not as a reactive or inferior actor, but as one capable of leading with precision, restraint and strategic innovation. In doing so, Pakistan reasserted itself in the region’s power dynamics not through escalation but through controlled exhibition of a sophisticated force,” Maliha added.\n\nAnother young researcher Safa Rehmat spoke about ‘Cyber Warfare and Digital Espionage’. “Cyber warfare in this conflict involves hacking, data breaches and misinformation campaigns. Both the Indian Research and Analysis Wing [RAW] and the Inter-Services Intelligence [ISI], as well as the people of both countries, have developed sophisticated cyber capabilities,” she said.\n\nSpeaking about the ‘War of Narratives’, Research Assistant Syed Shahryar Shah said that perceptions came to be just as important as the conflict. “The actual conflict lasted a few days but we are carrying on with the narratives,” he said. “What matters now is not what happened but what people believe happened,” he added.\n\nAnother Research Assistant, Asif Ali, spoke of ‘The Kashmir Flashpoint’. “The Indian authorities have already begun a crackdown in Kashmir. Following the Pahalgam incident around 2,800 Kashmiris have either been questioned or detained by the Indian authorities and this is something that is likely to continue,” he pointed out.\n\nAnother paper was presented on ‘Media, Misinformation and Public Opinion’ where Safa Rehmat, again, spoke of the things reported wrongly in the media on both sides such as India attacking the Karachi port while showing old pictures of Philadelphia and also reporting that Pakistan’s Chief of Army Staff had been captured. Pakistan also chipped in by reporting the capture of Indian female air force pilot Shivani Singh and the raising of white flags of truce from the Indian side.\n\nSaad Asad Brohi spoke of ‘Regional and Global Responses’.\n\nThe discussion, which followed included a comment about it being easy to blame someone else for one’s own internal problems, which is what India did after the Pahalgam attack.\n\nSomeone also pointed out that war was not one-dimensional. There are also dimensions such as economy, diplomacy, politics, etc, to think about. It was also mentioned that the armed forces of Pakistan certainly deserve accolades, but there was also a need for good governance in this country.\n\nOne person in the audience then got up to thank Indian PM Narendra Modi for providing an opportunity for unity in Pakistan.\n\nPublished in Dawn, May 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:16:04.780Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913113/china-may-block-indias-water-if-pakistans-cut-off-karachi-seminar-told",
  "dateList": "2025-05-25",
  "date_published": "2025-05-25T00:02:22.000Z"
}
