{
  "title": "Bangladesh govt calls for unity to stop ‘return of authoritarianism’ - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Bangladesh’s interim government, which took over after a mass uprising last year, warned on Saturday that unity was needed to “prevent the return of authoritarianism”.\n\nA spokesman for the government later said Chief Adviser Muhammad Yunus held talks with the Bangladesh Nationalist Party (BNP) of former premier Khaleda Zia and the Jamaat-i-Islami on resolving the political crisis.\n\nThe country of 170 million people has been in political turmoil since ex-prime minister Sheikh Hasina was ousted by student-led protests in August last year, ending her iron-fisted rule of 15 years.\n\nHowever, after a week of escalation during which rival parties protested on the streets of the capital Dhaka, the government said political power struggles risked jeopardising gains that have been made and pleaded for people to give it their full support.\n\nDr Yunus holds talks with two major parties in an attempt to resolve the political crisis\n\n“Broader unity is essential to maintain national stability, organise free and fair elections, justice, and reform, and permanently prevent the return of authoritarianism in the country,” it said in a statement.\n\n‘Continuously obstructing’\n\nChief Adviser Muhammad Yunus, the 84-year-old Nobel Peace Prize winner who returned from exile at the behest of protesters last year, says he has a duty to implement democratic reforms before elections that are due by June next year at the latest.\n\nHowever, the government warned that it had faced “unreasonable demands, deliberately provocative and jurisdictionally overreaching statements”, which it said had been “continuously obstructing” its work.\n\nSources in his office and a key political ally said on Thursday microfinance pioneer Yunus had threatened to quit.\n\n“If the government’s autonomy, reform efforts, justice process, fair election plan, and normal operations are obstructed to the point of making its duties unmanageable, it will, with the people, take the necessary steps,” the statement said.\n\nWahiduddin Mahmud, who heads the finance and planning ministry, insisted that Yunus will not step down early.\n\n“We are going to carry out the responsibilities assigned to us,” Mahmud told reporters on Saturday. “We can’t simply abandon our duties.”\n\n‘Reconsider our support’\n\n“If he is unable to announce a specific election date by December, we will reconsider our support for his administration,” senior BNP leader Salahuddin Ahmed said in an interview on a private TV channel broadcast on Friday.\n\nAccording to Bangladeshi media and military sources, army chief General Waker-Uz-Zaman also said this week that elections should be held by December, aligning with BNP demands.\n\nPublished in Dawn, May 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:27:18.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913175/bangladesh-govt-calls-for-unity-to-stop-return-of-authoritarianism",
  "dateList": "2025-05-25",
  "date_published": "2025-05-25T00:02:16.000Z"
}
