{
  "title": "India’s water move threatens millions, UN told - World - DAWN.COM",
  "author": null,
  "content": "• Pakistan terms IWT suspension ‘dangerous escalation’\n• Officials spar over India’s targeting of civilian areas\n\nUNITED NATIONS: Pakistan has warned the United Nations that India’s unilateral decision to suspend the Indus Waters Treaty (IWT) represents a dangerous escalation that violates international law and threatens the survival of more than 240 million people.\n\nSpeaking at a UN meeting on protecting water in armed conflict on Friday evening, Pakistan urged the world community to act before such actions triggered a humanitarian catastrophe or destabilised the region.\n\n“This is a grave violation of international law, including human rights law, the treaty law and customary international law,” said Ambassador Usman Jadoon, Pakistan’s Deputy Permanent Representative to the UN, at the Arria Formula meeting convened by Slovenia.\n\n“We strongly condemn India’s unlawful announcement to hold the Treaty in abeyance and call upon India to strictly abide by its legal obligations and refrain from stopping, diverting or restricting rivers that are a lifeline for 240 million people of Pakistan. We will never accept any such moves,” Ambassador Jadoon said.\n\nHe also drew attention to Indian leaders’ alarming statements, noting that “troubling pronouncements by the Indian leadership to ‘starve the people of Pakistan’ depict a highly dangerous and perverse thinking.\n\nPakistan used the UN forum to appeal for international consensus against the weaponisation of water.\n\nAmbassador Jadoon urged the Security Council to monitor such developments closely and take pre-emptive action where necessary:\n\n“The Council must play a role by identifying situations where violations of international law, including IHL (International Humanitarian Law) principles, could jeopardise peace and security or lead to catastrophic humanitarian crisis.”\n\nPakistan’s statement highlighted three key points, legal prohibitions, obligations of warring parties and weaponisation of water. International law, including human rights law and IHL, prohibits attacks on water resources and related infrastructure. Den­ying access to water violates established norms and UN Security Council resolutions. Similarly, all parties in a conflict are bound by the IHL and must avoid actions that result in severe humanitarian consequences. Besides, using water as a tool of coercion or warfare is unacceptable and destabilising.\n\n“It is regrettable that one country, exhibiting malevolent designs, has chosen to weaponise water in addition to using it as a bargain chip,” the diplomat said.\n\nPakistan’s statement comes amid growing concern in Islamabad over India’s recent efforts to bypass treaty mechanisms and undermine the role of international mediators, particularly the World Bank, which had brokered the Treaty 1960. Officials in Pakistan view these actions as part of a broader pattern aimed at eroding cooperative frameworks and applying pressure on Islamabad through non-military means.\n\nAmbassador Jadoon reaffirmed Pakistan’s support for global efforts to ensure the protection of water resources during conflicts and emphasised the need for a “resolute, principled and united stand” against any attempts to politicise or militarise water.\n\nTerror charge rejected\n\nAt a separate meeting, delegates from Delhi and Islamabad engaged in a sharp verbal duel at the UN, after Pakistani Ambassador Asim Iftikhar Ahmad denounced the Indian military for targeting civilian areas during the recent clash.\n\nThe exchange took place at the Security Council during its debate on the Protection of Civilians in Armed Conflict on Friday.\n\nIndian Ambassador Parvathaneni Harish reacted to his Pakistani counterpart’s tough statement, and while repeating Delhi’s usual allegations said that Pakistan had no justification to talk about civilians when it is using terrorism as a policy.\n\nPakistani delegate Saima Saleem hit back, accusing the Indian envoy of relying on “disinformation, deflection and denial” as she said India was itself involved in acts of terrorism.\n\n“No amount of obfuscation can hide the facts. India brazenly kills and maims civilians in occupied Jammu and Kashmir, carries out blatant aggression against Pakistan by targeting civilians and sponsors terrorism and assassinations in my country and across the globe,” Ms Saleem, a counsellor at the Pakistan Mission, told the 15-member Council.\n\nIndia, she said, had even stooped to a new low of impeding the flow of rivers that serve as a lifeline for the 240 million people of Pakistan.\n\nShe pointed out that Pakistan, together with the international community, had condemned the Pahalgam incident.\n\n“If India had nothing to hide, it should have agreed to credible, impartial and independent investigations into the incident,” the delegate said. “On the contrary,” she added, “India continues to subject people of Indian Illegally Occupied Jammu and Kashmir to state-sponsored terrorism to suppress their legitimate freedom struggle.”\n\nBlatant aggression\n\nEarlier this month, she recalled, India committed blatant aggression against Pakistan, launching unprovoked attacks on innocent civilians, killing 40 people including seven women and 15 children and injuring 121 others, including 10 women and 27 children.\n\n“India certainly has no credibility to lecture others on the protection of civilians,” Ms Saleem told delegates.\n\nPakistan’s counterterrorism efforts and sacrifices, she pointed out, were well-known and acknowledged globally and Islamabad remains steadfast in its commitment to combat this menace.\n\nOn the other hand, she said, India continues to actively fund and support terror proxies that include Fitna Al Khawarij —the term used by the government for the banned Tehreek-i-Taliban Pakistan, Balochistan Liberation Army and its Majeed Brigade group — to kill innocent civilians in Pakistan.\n\nShe drew the delegates’ attention to the recent savage attack on a school bus in Khuzdar that took the lives of innocent school-going children and left dozens injured.\n\n“If India is genuinely committed to peace and security and good neighbourliness, it should end its state-sponsored terrorism, cease its oppression of Kashmiris, comply with its obligations under international law, UN Charter and bilateral treaties, and engage in meaningful dialogue for the peaceful resolution of the Jammu and Kashmir dispute in accordance with relevant resolutions of the Security Council and the wishes of the Kashmiri people,” Ms Saleem added.\n\nWith input from APP\n\nPublished in Dawn, May 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/25101641e1e2a2a.png",
  "retrievedAt": "2025-10-12T03:15:24.014Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913144/indias-water-move-threatens-millions-un-told",
  "dateList": "2025-05-25",
  "date_published": "2025-05-25T00:01:51.000Z"
}
