{
  "title": "Sales tax ‘largest’ contributor to inequality, poverty: World Bank - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A World Bank stu­dy says the General Sales Tax (GST) has the largest marginal contribution to the national poverty increase, while GST payments account for over 7 per cent of households’ pretax expenditure, which leads to further impoverishment among poor and vulnerable households.\n\nThe Effects of Taxes and Transfers on Inequality and Poverty in Pakis­tan says the GST has the largest ne­­g­ative impact on the poverty headco­unt; the Benazir Income Support Programme has the largest positive impact on inequality reduction.\n\nEstimations of the marginal contributions of individual fiscal instruments — or the additional impact that individual fiscal instruments have on poverty or inequality when all other fiscal instruments are included — demonstrate that GST has the largest marginal contribution to the national poverty increase.\n\nGST is allocated roughly in proportion to consumption expenditure and, therefore, is neither strongly regressive nor strongly progressive. The BISP cash transfer meanwhile de­­­monstrates the largest marginal contribution to inequality reduction. The second-largest impact on inequ­ality comes from pre-primary and pri­­ma­­ry education expenditures, it says.\n\nVulnerable households get smaller benefits than taxes paid\n\nThe study suggests that, while moving forward, Pakistan should improve its domestic revenue mobilisation and public expenditure efficiency to generate greater fiscal spa­ce. The additional fiscal space shou­­ld be prioritized to expand social expenditure and targeted transfers and to improve fiscal equity.\n\nFiscal sustainability could go together with fiscal equity if additional revenues collected from GST harmonisation are used to compensate poor and vulnerable households through well-targeted cash transfers. Expenditure reforms to improve the accessibility and quality of public health and education services in Pakistan could have long-term impacts in terms of poverty and inequality reduction, the study says.\n\nThe report says fiscal policy in Pakistan emphasized revenue collection from more frequently-impoverishing indirect taxes as well as regressive and inefficient subsidy expenditures to provide benefits while de-prioritizing progressive direct taxation which can shield poor and vulnerable households from further impoverishment, direct, targeted transfers to poor and vulnerable households, and the investments in social infrastructure which help poor and middle-income households participate productively in social, civic, and economic life.\n\nAccording to the report, richer households capture a larger share of the subsidy and in-kind benefits available and pay more of total revenues collected from direct and indirect taxes. In Pakistan in fiscal year 2019, the two richest deciles capture 34pc of total subsidy expenditure, 29pc of in-kind education benefits, and 27pc of in-kind health benefits, and pay 40pc of total revenues from indirect taxes.\n\nMost poor and vulnerable households are net payers into the fiscal system meaning that benefits received are smaller in magnitude than taxes paid. Only individuals from the poorest ten per cent of the population can expect to be net recipients — or can expect to receive more in benefits than they will pay in taxes — with a net cash gain estimated 1.2pc of pre-fiscal income. All other individuals can expect to be net payers in cash terms, with cash losses ranging from -1.8 per cent in decile 2 to -5.5pc in decile 10 (the richest decile).\n\nOver the past two decades, Pakistan has struggled with low and volatile economic growth.\n\nPublished in Dawn, May 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6832516accafc.gif",
  "retrievedAt": "2025-08-23T14:27:33.440Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913165/sales-tax-largest-contributor-to-inequality-poverty-world-bank",
  "dateList": "2025-05-25",
  "date_published": "2025-05-24T23:48:58.000Z"
}
