{
  "title": "PM urges world to stand in solidarity with Afghan people for peace, stability",
  "link": "https://www.app.com.pk/national/pm-urges-world-to-stand-in-solidarity-with-afghan-people-for-peace-stability/",
  "date_published": "2021-09-09T16:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 9 (APP):Prime Minister Imran Khan Thursday called upon the international community to stand in solidarity with the Afghan people, engage positively, and create incentives to ensure sustainable peace, stability and economic development in Afghanistan.\nHe said Pakistan had and would continue to play its role for the economic uplift, humanitarian relief and assistance to Afghanistan.\nThe prime minister was talking to Deputy Prime Minister and Minister of Foreign Affairs of the State of Qatar, Sheikh Mohammed Bin Abdulrahman Al-Thani, who called on him here.\nDuring the meeting, views were exchanged on the developments in Afghanistan and diversifying Pakistan-Qatar relations.\nThe prime minister conveyed warm regards to Amir of Qatar, a press release issued by the Prime Minister Media Wing here said.\nHe emphasized that it was vital to stabilize the security situation, prevent a humanitarian crisis, and stabilize the economy in Afghanistan.\nHighlighting that Pakistan had suffered enormously due to protracted conflict in Afghanistan, he underscored the importance of a peaceful, secure and stable Afghanistan for Pakistan and the region.\nThe prime minister lauded Qatar’s role in support of the Afghan peace process.\nIn the bilateral context, he reaffirmed Pakistan’s desire to strengthen mutually beneficial ties with Qatar.\nThe prime minister stressed the importance of enhanced collaboration in diverse areas, including trade and investment, energy, and enhancing people-to-people linkages.\nThe deputy prime minister and foreign minister of Qatar acknowledged Pakistan’s important role as well as efforts for regional peace and stability.\nHe also underscored Qatar’s commitment to maintain close contact with Pakistan on bilateral and regional matters.",
  "retrievedAt": "2025-08-11T21:11:49.349Z"
}
