{
  "title": "SME defaults rise despite SBP push for digitalisation - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The default rate in the small and medium enterprises (SME) sector continued to rise during the third quarter of FY25, despite various initiatives by the State Bank of Pakistan (SBP) and the government to improve access to finance.\n\nAccording to SBP data, the non-performing loan (NPL) ratio for SMEs increased to 15.39pc during January-March FY25, up from 14.16pc in the previous quarter (Oct–Dec FY25). The persistent rise in defaults reflects a challenging credit environment for SMEs, often cited as the backbone of Pakistan’s economy.\n\nThe financial sector views high NPLs as a major obstacle to SME financing. Banks remain reluctant to lend to the sector, not only due to credit risk but also because of the more profitable and safer option of investing in government securities. Currently, around 60pc of banks’ assets are tied up in domestic bonds, a level significantly higher than the 20pc threshold considered concerning in many developing economies.\n\nIn an effort to address barriers in SME financing, the SBP has announced the launch of a Challenge Fund for Technology Adoption and Digitalisation of SME Banking (CFS). The fund aims to support banks in developing innovative, tech-based solutions to enhance access to financial services for SMEs.\n\nUnder the scheme, the grant size will be determined based on each proposal’s financing requirements. Each bank can receive one grant and must contribute 15pc of the total project cost. The implementation period for each project must not exceed eight months.\n\nAs of March 2025, total SME financing stood at Rs311.33bn in working capital loans, down from Rs332.8bn in December 2024, indicating a contraction in short-term lending. Fixed investment in the sector was recorded at Rs2.42tr by the end of Q3, suggesting that most borrowing remains short-term while long-term investment is lagging.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/17094128eb4117f.jpg?r=094153",
  "retrievedAt": "2025-08-16T07:31:54.680Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930286/sme-defaults-rise-despite-sbp-push-for-digitalisation",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T01:15:02.000Z"
}
