{
  "title": "Convictions of PTI leaders spark protests in NA - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Minister defends power subsidy policy, denies any such facility for crypto mining\n• PTI stages walkout after Gohar, Asad not allowed to raise points of order\n• House adopts resolution for Milad celebrations, inclusion of Jinnah’s speech in curricula\n\nISLAMABAD: As the series of convictions of Pakistan Tehreek-i-Insaf (PTI) leaders and the subsequent disqualification of its lawmakers continued, members of the opposition party staged a vociferous protest in the National Assembly on Monday.\n\nThe protest started when PTI Chairman Barrister Gohar Ali Khan and former speaker of the National Assembly Asad Qaiser were denied permission by the chair to raise points of order during the question hour.\n\nCarrying portraits of ex-premier Imran Khan and other convicted PTI leaders, the opposition members chanted slogans denouncing the convictions and disqualifications, while demanding release of the incarcerated founder of the party.\n\nThe lawmakers tore up copies of the day’s agenda, threw the pieces into the air, and gathered near the speaker’s podium before staging an undeclared walkout.\n\nSoon after their exit, PTI legislator Iqbal Afridi pointed out a lack of quorum. However, a headcount confirmed the House was in order.\n\nOn the other hand, Minister for Power Sardar Awais Ahmad Khan Leghari during the question hour told the House that electricity charges for households consuming up to 200 units per month had dropped by around 60 per cent over the past nine months.\n\nHe said that out of total 35 million electricity consumers, around 18.3 million already benefited from subsidies — 90 per cent for those using up to 100 units and 70pc for those consuming between 100 units and 200 units.\n\nHowever, he pointed out that expanding the 200-unit slab to households using up to 300 units would require an additional Rs275 billion in subsidies, which was unaffordable under the current fiscal constraints. Still, the government was bearing a substantial subsidy burden for low-use consumers, he added.\n\nNo power subsidy for crypto mining\n\nResponding to another question, the federal minister clarified that no subsidised electricity had been provided to any cryptocurrency mining project in Pakistan, nor had any tariff, rate, or legal framework been approved for such ventures.\n\nHe also outlined an incremental electricity package for the entire industrial sector —without subsidies — to enhance competitiveness, particularly for export industries.\n\nHe claimed that 7,500MW of surplus power was available, and talks were underway with development partners and the International Monetary Fund to use it for grid stabilisation.\n\nOn the remarks of MNA Syed Hafeezuddin that mock drills should be arranged for citizens of Karachi to prepare them for any eventuality considering that the city was located in a seismically active tectonic zone, Minister for Parliamentary Affairs Tariq Fazal Cha­u­dhry assured the House that the National Disaster Management Authority (NDMA), in collaboration with provincial authorities, would continue to raise public awareness about natural hazards.\n\nMilad, Minorities Day resolutions adopted\n\nThe National Assembly unanimously passed a resolution urging the federal and provincial governments to celebrate the 1,500th Eid Milad-un-Nabi (Peace Be Upon Him) in a befitting manner.\n\nMoved by Pir Syed Fazal Ali Shah Jillani, the resolution called for Milad programmes at the highest level and illumination of both public and private buildings, while highlighting the importance of promoting the teachings of the Holy Prophet Muhammad (PBUH).\n\nIn connection with National Minorities Day, another resolution was passed to include in the national curriculum the historic address of August 11, 1947 by Quaid-i-Azam Muhammad Ali Jinnah to the first Constituent Assembly.\n\nIn that speech, Pakistan’s founder declared, “You are free to go to your temples, mosques, or any other places of worship in this country.\n\nYou may belong to any religion, caste, or creed — that has nothing to do with the business of the State.“ The resolution was moved by PPP lawmaker from Multan, Naveed Aamir Jeeva.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/120837486cdc058.jpg",
  "retrievedAt": "2025-08-16T07:32:30.116Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930301/convictions-of-pti-leaders-spark-protests-in-na",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T01:14:55.000Z"
}
