{
  "title": "Pakistan won’t back down if India forces war, declares Bilawal - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PPP chief describes Modi’s unilateral suspension of Indus Waters Treaty as an attack on Indus Valley civilisation\n• Attends concluding session of Shah Latif Bhitai’s urs\n\nHYDERABAD: Terming the Indian Prime Minister Narendra Modi’s decision to unilaterally suspend the Indus Waters Treaty (IWT) an attack on the Indus Valley civilisation and culture, PPP Chairman Bilawal Bhutto-Zardari has said that Pakistan always advocates peace, but if New Delhi still forces it into war, the nation will not back down.\n\n“If war is waged, then from the land of Shah Abdul Latif Bhitai we will send a message to the Modi government that we do not retreat, we do not bow down, and if you dare think about launching an attack on the Indus River, then the people of every province of Pakistan will be ready to confront you,” he said.\n\nMr Bhutto-Zardari was speaking at an award ceremony on the concluding day of the annual three-day urs of Shah Abdul Latif Bhitai in Bhit Shah on Monday evening.\n\nHe recalled that after the humiliating defeat in the recent war, India attacked Pakistan’s waters by unilaterally suspending the Indus Waters Treaty.\n\n“The Indus River is not only the country’s sole major water resource but is also deeply linked to the entire history of its people. The Indus Civilisation is connected to this river, and when Modi announces an attack on the Indus River, it is an attack on our civilisation, our history, and our culture,” he said.\n\nThe PPP chairman said that he believed that not only the people of Pakistan who are against Modi-regime’s decision], even the people of India are against their government’s decision.“\n\nTerming it the biggest attack on the Indus River in the history of the region, he added the people of Sindh have always played a front-line role, being the first to raise their voices and step into the field to protect their river, whenever such an attack has been made.\n\nTalking about his efforts to present Pakistan’s stance before the world, Mr Bhutto-Zardari said: “When this dispute began, I stood on the banks of this river and pledged to the people of this country that I would expose Modi before the world, and I can say that we have done exactly that.”\n\nHe said the Indian government’s propaganda against Pakistan, which was based on lies, was met with a strong rebuttal, and Pakistan’s voice was raised across the globe against the threats to cut off the water supply to 200 million Pakistanis. “I exposed all lies of Modi before the world,” he said.\n\nAddressing the public, the PPP chairman said that he needed the people’s support and cooperation in the struggle to save the Indus. “We must all unite to raise our voices and struggle against Modi’s brutality, against this attack and against his intentions, so that we can put an end to this injustice as well.”\n\nHe said that people of Pakistan have enough strength to confront the enemy and take back six rivers from them.\n\nTribute to Sufi saint\n\nMr Bhutto-Zardari paid rich tribute to the Sufi saint and poet Bhitai and said that his timeless teachings continued to inspire not only the people of Sindh but all of Pakistan in overcoming even the most daunting challenges.\n\nHe said that the tradition of visiting the shrine of Shah Latif and drawing inspiration from his teachings has been passed down in his family from generation to generation.\n\nHe said this year’s Independence Day and Ma’arka-i-Haq celebrations coincided with Bhitai’s urs.\n\nLater, Mr Bhutto-Zardari presented Shah Latif Awards to prominent personalities.\n\nEarlier, Sindh Chief Minister Murad Ali Shah also spoke.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689a646d3183c.gif",
  "retrievedAt": "2025-08-16T07:31:33.261Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930241/pakistan-wont-back-down-if-india-forces-war-declares-bilawal",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T01:15:37.000Z"
}
