{
  "title": "Asif fights back to reach snooker quarter-finals at World Games - Sport - DAWN.COM",
  "author": null,
  "content": "CHENGDU: Pakistan’s Mohammad Asif mounted a spectacular comeback to overcome Germany’s Alexander Widau 2-1 in a pulsating Group ‘B’ clash at the Civil Aviation Flight University’s Tianfu Cam­pus Gymnasium during the World Games on Monday.\n\nThe high-stakes encounter had fans gripped as momentum swung wildly between the two maestros. Widau drew first blood, dominating the opening frame 43-29 with clinical precision. Undeterred, Asif responded with a masterclass in the second frame, crafting a tournament-high break of 109 to level the match with a resounding 116-09 frame score.\n\nThe deciding frame proved a tense, cautious affair. Pakistan’s most decorated cueist ultimately pounced on a critical error by Widau, sealing the frame 67-32 to book his quarter-final berth.\n\n“This was pure test of nerve,” an elated Asif told APP. “When Widau took that first frame, I knew I had to dig into my deepest reserves. That century break was crucial. It broke his rhythm and gave me the psychological edge.”\n\nIn the squash event on Monday, Pakistan’s rising squash star Noor Zaman secured a spot in the plate event finals after a thrilling 3-1 semifinal victory over Japan’s Ryosei Tsukue.\n\nNoor showcased nerves of steel in the gripping encounter, overcoming Tsukue with scores of 11-7, 7-11, 11-7, 12-10.\n\nAfter splitting the first two games, Noor dug deep in a tense fourth game, saving multiple game points before clinching the thriller.\n\n“Noor showed incredible composure under pressure today,” said Pakistan’s coach Fahim Gul. “His ability to bounce back after losing the second game and then close out the match in such a tight fourth game proves his mental toughness. He’s ready for the final.”\n\nThe young sensation, who won the Under-23 champion in April this year, will now compete for gold in Tuesday’s final.\n\n“I’m grateful for the support and ready to give my all in the final,” said an elated Noor after the match.\n\nColombia’s Palomino Gaeano prevented an all-Pakistan final in the plate event, defeating Nasir Iqbal 15-13, 13-15, 11-4, 11-5 in the other last-four clash.\n\nUS BAG INLINE HOCKEY GOLD\n\nElsewhere on Monday, The United States edged the Czech Republic 4-3 in overtime to claim the inline hockey gold medal — the first roller sports title awarded at the global showpiece.\n\nThe US took control early, opening the scoring in the sixth minute and closing the first half with a 2-0 lead, while the Czech Republic created only limited chances.\n\nIn the second half, however, the Americans were unable to build on their advantage, allowing the Czechs to level the game at 3-3 by full time. The US struck again in extra time with an unstoppable attack to seal the victory.\n\nThe US women’s lacrosse team added another gold to their tally as they routed Canada 16-8 in the final.\n\nTheir were eight different scorers for the American’s with Cassidy Weeks top scoring with four goals each.\n\nThere was double delight for China too as para athlete Long Dengxi claimed freediving gold while the duo of Hu Yicheng and Zhang Xinxin also emerged victorious in the women’s synchronized event.\n\nDengxi claimed his second gold in freediving at this edition of The World Games, while Hungary’s Zsofia Torocsik broke the world record of the women’s dynamic with fins by 16 metres.\n\nFollowing his win in the men’s dynamic without fins — FFS1-FFS2 category on Sunday — the 18-year-old Dengxi added gold in the dynamic with fins, reaching 181.5 meters. Den­mark’s Casper Marti-Beckmann took silver and France’s Alexandre Boscari got bronze.\n\nIn the women’s dynamic with fins, Torocsik improved the world record from 284.0 to 300.0 meters to win the gold. Former record holder Julia Malgorzata Kozerska of Poland took silver, and compatriot Magdalena Solich Talanda earned bronze.\n\nMeanwhile at the Dong’an Lake Sports Park Multifunctional Gymna­sium, Yicheng and Xinxin delivered an almost flawless routine in the final, earning 51.340 points to secure the synchronized event title.\n\nJapan and Canada settled for silver and bronze, respectively.\n\nBelgium’s Florian Bayili successfully defended his Ne-Waza title as he defeated Mohamed Ali Alsuwaid of the UAE in the 69kg category, while France’s Estelle Gaspard dominated the women’s 52kg Fighting division in ju-jitsu.\n\nSaeed Alkubaisi delivered the UAE’s first gold in the men’s 85kg Ne-Waza as the 2024 world bronze medallist overcame Portugal’s Ramalho Pedro.\n\nGermany’s Sophie Buscher caused an upset in the women’s 57kg Fighting final, defeating two-time World Games medallist Rebekka Dahl of Denmark.\n\nIn the mixed 580kg tug-of-war final, Switzerland emerged triumphant as they overpowered Belgium 3-0.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/68993f1d627ed.jpg",
  "retrievedAt": "2025-08-16T07:31:47.388Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930318/asif-fights-back-to-reach-snooker-quarter-finals-at-world-games",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T01:15:21.000Z"
}
