{
  "title": "Poliovirus found in 36pc samples across 87 nationwide districts tested in July - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Institutes of Health on Tuesday confirmed the presence of poliovirus in 42 of 117 sewage samples collected from 87 districts across the country in July.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress.\n\nAccording to a press release issued by NIH’s Regional Reference Laboratory for Polio Eradication, out of 127 sewage samples, the institute “confirmed 75 sewage samples as negative and 42 as positive”, while the remaining 10 were still being processed in the lab.\n\nThe positive results made up nearly 36 per cent of the total samples, compared to 32pc for June, based on NIH press releases.\n\nHowever, the NIH said: “While the overall trend shows a decline in positive detections, reflecting the impact of high-quality campaigns, the virus continues to circulate in certain areas.”\n\n“July data shows steady progress in containment,” it added.\n\nSindh reported the highest number of positive samples, with 19 positive samples out of 29 tested, followed closely by Punjab with 12 positive results out of 27.\n\nIn Khyber Pakhtunkhwa, poliovirus was found in seven samples out of 31 sewage samples tested — equivalent to last month’s results but marking a sharp decline from 14 in January.\n\n“Of these seven positive sites in July, three are from south Khyber Pakhtunkhwa. In Peshawar, four out of six sites tested negative,” the statement read.\n\nOnly one sample was found to be positive in Balochistan, down from four in June, while a whopping 22 results were negative. Meanwhile, in Islamabad, three out of the four samples were positive for the disease.\n\nFour samples were under process in Punjab, three in KP, and one each in Islamabad, Gilgit-Baltistan (GB) and Azad Jammu and Kashmir (AJK), the NIH said.\n\nThe three sewage samples from GB and AJK have tested negative for the virus so far.\n\nAccording to the latest data, the total number of polio cases in Pakistan, reported in 2025, stood at 19 — including 12 from KP, five from Sindh, and one each from Punjab and GB.\n\n“Over the past year, the Pakistan Polio Programme has conducted six high-quality vaccination campaigns, four of them nationwide,” which aimed to vaccinate over 45 million children.\n\nAs per the press release, “These sustained efforts have significantly reduced both polio cases and positive environmental samples nationwide, demonstrating strong progress toward interrupting transmission.\n\n“The next sub-national polio vaccination campaign is scheduled for September 1 – 7, 2025, which will aim to vaccinate 28m children across 91 districts in all provinces and regions,” according to NIH.\n\nOn July 3, Prime Minister Shehbaz Sharif vowed to intensify polio eradication efforts with the support of international, provincial, and local teams to achieve a polio-free country.\n\nLast year, the country reported at least 71 polio cases, with the virus detected in around 90 districts.\n\nPolio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine (OPV) for every child under five during each campaign, along with the timely completion of all essential immunisations.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/121456275402818.jpg",
  "retrievedAt": "2025-08-16T07:30:35.086Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930404/poliovirus-found-in-36pc-samples-across-87-nationwide-districts-tested-in-july",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T10:35:03.000Z"
}
