{
  "title": "Climate heat extremes driving tropical bird decline: study - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Tropical bird populations have plummeted not only due to deforestation but also extreme heat attributable to climate change, according to a study published on Monday in the journal Nature Ecology & Evolution.\n\nIntensifying temperatures caused a 25-38 per cent reduction in tropical bird populations between 1950 and 2020, compared to a scenario without manmade global warming, scientists based in Europe and Australia reported.\n\n“The findings are pretty stark,” lead author Maximilian Kotz, a researcher at the National Supercomputing Centre in Barcelona and the Potsdam Institute for Climate Impact Research (PIK), said. Bird populations in the tropics now face 30 days of heat extremes per year compared to three per year in the mid-20th century, he noted.\n\n“This has major consequences for how we think about biodiversity conservation,” Kotz said by email. “Protecting pristine habitats is crucial, but without dealing with climate change it won’t be enough for birds.” Nearly half of all bird species are found in biodiversity-rich tropical regions. These often colourful animals perform essential services for ecosystems, such as dispersing plant seeds.\n\nInvasive species another threat\n\nBut birds living in these regions may already be “close to the limits” of their tolerance to high temperatures, which can cause heatstroke (hyperthermia) or dehydration. The overview study does not provide figures for individual species, but earlier literature is rich with examples of the devastating impact of rising temperatures.\n\nOne documented the heat-related decline of birds in Panama, including the king quetzal, the red-crested quetzal, the two-coloured kingfisher and the aurora trogon.\n\nAnother study published in 2017 showed how some tropical hummingbirds are now forced to seek shade to regulate their temperature in extreme heat, cutting into the amount of time they can spend searching for life-sustaining nectar.\n\nExtreme heat waves, which are becoming more frequent, represent a far greater threat than increases in average temperatures or rainfall, another result of human-induced climate change. Up to now, it has been assumed that the decline in bird populations worldwide was due mainly to other well-identified factors, especially habitat loss, pesticide use, hunting, and invasive species, especially snakes that snack on bird eggs and mosquitos carrying avian malaria.\n\nBut the new findings “challenge the view that direct human pressures have so far been the dominant driver of impacts on bird populations compared to climate change in tropical regions,” according to the authors.\n\nTo reach this conclusion, they analysed observational data from more than 3,000 bird populations around the world and used statistical modelling to isolate the effects of extreme weather from other factors. The findings help complete the picture of tropical bird decline, noted Aimee Van Tatenhove, a post-doctoral fellow at Cornell University’s Center for Avian Population Studies who was not involved in the study.\n\n“Deforestation has an obvious im­pact — trees are cut and habitat is destroyed,” she said. “We need long-term datasets like the authors used to understand how extreme temperatures impact avian populations.” “This study is an important reminder that we need to continue examining different causes of population decl­ines and apply those findings to conservation initiatives,” she continued.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/12111230293dbac.jpg",
  "retrievedAt": "2025-08-16T07:31:39.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930308/climate-heat-extremes-driving-tropical-bird-decline-study",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T01:15:29.000Z"
}
