{
  "title": "PSX hits new peak amid US investment hopes - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) kicked off the week on a bullish note, with the benchmark KSE-100 index surging to a record intraday high above 147,000 before settling at an all-time closing high of 146,929 points on Monday. Persistent economic optimism, strong corporate earnings, and expectations of foreign investment inflows drove the rally.\n\nAccording to Topline Securities Ltd, the index gained a substantial 1,547 points, or 1.06pc, during the session, after hitting an intraday high of 1,622 points. The upbeat sentiment was underpinned by reports of US companies preparing to invest in Pakistan’s energy sector, coupled with better-than-expected corporate earnings that boosted investor confidence.\n\nAhsan Mehanti of Arif Habib Corporation attributed the record close to robust financial results, a year-on-year surge in July remittances amounting to $3.2bn, a stable rupee, and optimism surrounding Pakistan-US trade talks. Speculation about a potential breakthrough in trade terms during the Chief of Army Staff’s ongoing visit to the US also played a key role in lifting market sentiment.\n\nThe energy and banking sectors led the charge, with heavyweights including Mari Petroleum, Oil and Gas Development Company (OGDC), Bank Al Habib, Meezan Bank, and MCB Bank collectively contributing 959 points to the index’s gains. The exploration and production (E&P) sector, in particular, saw strong buying interest amid expectations of a soon-to-be-announced circular debt resolution, with Mari and OGDC adding 526 points alone.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, said the bulls are “marching towards 150,000 with full excitement” as the index closed just shy of the psychological barrier at 146,929.\n\nGoing forward, analysts expect further upward momentum if progress is made on the circular debt issue. However, some degree of consolidation or a mild correction remains likely. In case of a pullback, 145,000 and 143,000 are expected to provide support, while 150,000 remains the next major resistance level.\n\nMarket activity remained robust, with trading volume rising 11.52pc to 611.2 million shares. However, the traded value declined by 3.26pc to Rs44bn. Lotte Chemical led the volume chart with 73.28 million shares traded.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689a8a4f8b621.jpg",
  "retrievedAt": "2025-08-16T07:31:53.542Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930285/psx-hits-new-peak-amid-us-investment-hopes",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T01:15:01.000Z"
}
