{
  "title": "Iran sees Armenia corridor as ‘part of US ploy’ - World - DAWN.COM",
  "author": null,
  "content": "TEHRAN/TBILISI: Iran stepped up warnings to Armenia on Monday over a planned US-backed corridor linking Azerbaijan to an exclave near the Iranian border, part of a recent peace deal between Yerevan and Baku.\n\nIn a phone call with Armenia’s Prime Minister Nikol Pashinyan, Iranian President Masoud Pezeshkian “warned against possible actions by the United States, which could pursue hegemonic goals in the Caucasus region under the guise of economic investments and peace guarantees”, according to a statement from Tehran.\n\nThe land corridor dubbed the “Trump Route for International Peace and Prosperity” is part of a deal signed last week in Washington between Armenia and Azerbaijan.\n\nUnder the deal, the United States will have the development rights of the proposed route, which would connect Azerbaijan to its Nakhichevan exclave, passing near the Iranian border.\n\nYerevan, Baku publish text of Trump-brokered peace deal\n\nIran has long opposed the planned transit route, also known as the Zangezur corridor, fearing it would cut the country off from Armenia and the rest of the Caucasus, and bring potentially hostile foreign forces to near its borders.\n\nPezeshkian said Iran “welcomes any agreement that promotes the strengthening of peace” among its neighbours, but emphasised the need to prevent the “interference of any military or security force” in implementing the corridor project, according to the statement from his office.\n\nArmenia’s deputy foreign minister is due in Tehran on Tuesday for talks on the issue, Tehran has said. On Saturday, a senior advisor to Iran’s supreme leader said Tehran will not allow the creation of the planned corridor, warning that the area would become “a graveyard for Trump’s mercenaries”.\n\nText of deal\n\nArmenia and Azerbaijan published the text of a US-brokered peace agreement on Monday, pledging to respect each other’s territorial integrity and formally put an end to nearly four decades of conflict.\n\nThe deal was struck in Washington on Friday, when Azerbaijani President Ilham Aliyev and Armenian Prime Minister Nikol Pashinyan met President Donald Trump at the White House.\n\nThe text of the greement, which was initialled by the countries’ foreign ministers, says Yerevan and Baku will relinquish all claims to each other’s territory, refrain from using force against one another and pledge to respect international law.\n\n“This agreement is a solid foundation for establishing a reliable and lasting peace, the result of an agreement between Armenia and Azerbaijan that reflects the balanced interests of the two countries,” Pashinyan wrote on Facebook.\n\nArmenia and Azerbaijan, neighbours in the South Caucasus region, have been locked in conflict since the late 1980s over Nagorno-Karabakh, a mountainous region at the southern end of the Karabakh mountain range, within Azerbaijan. Baku took back full control of the region in 2023, prompting almost all of the territory’s 100,000 ethnic Armenians to flee to Armenia.\n\nThe European Union, Nato member Turkiye and Russia have welcomed the accord, although Moscow, a traditional broker and ally of Armenia, was left out and warned against foreign meddling.\n\nThe deal explicitly bans the deployment of third-party forces along the countries’ shared border, a possible reference to Russia, which has previously deployed peacekeepers to the region and still has extensive military and security interests in Armenia. The European Union also has a mission deployed at the border to monitor ceasefire violations, which Baku has repeatedly demanded it withdraw.\n\nThe peace deal has not yet been signed by the two rivals, who both gained their independence from the Soviet Union in 1991. In a major hurdle to peace, Azerbaijan is demanding that Armenia change its constitution, which Baku says makes an implicit claim on Azerbaijani territory.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/12111801d313d25.jpg",
  "retrievedAt": "2025-08-16T07:31:40.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930305/iran-sees-armenia-corridor-as-part-of-us-ploy",
  "dateList": "2025-08-12",
  "date_published": "2025-08-12T01:15:29.000Z"
}
