{
  "title": "Training course on halal products standards, testing from May 20-24",
  "link": "https://www.app.com.pk/national/training-course-on-halal-products-standards-testing-from-may-20-24/",
  "date_published": "2024-05-02T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP): COMSTECH-SMIIC Training Course on “OIC/SMIIC Halal Products Standards and Testing: Food, Pharmaceuticals, and Cosmetics” will be held from May 20-24.\nThe training course will be jointly organized by the OIC Standing Committee on Scientific and Technological Cooperation (COMSTECH) and the Standards and Metrology Institute for Islamic Countries (SMIIC) in collaboration with the Moroccan Institute of Standardization (IMANOR).\nAccording to an official of COMSTECH, the course will be arranged at the Moroccan Institute of Standardization (IMANOR), Rabat while the last day for registration is May 03.\nIn view of the diversity of several products, including processed food and other items of daily use in the present day, authentication and confirmation of their Halal nature is a growing challenge globally.\nBeside the environmental contaminants, both biological and chemical, the addition of non-halal ingredients, which is prohibited for Muslims, are a matter of concern.\nIn recent years, awareness about Halal food and products has increased due to the cross-contamination of several industrial products in our daily life. However, with increasing globalization, many Islamic countries import these products (or ingredients) from places, which do not observe the Islamic religious laws. It is, therefore, imperative for the Muslim countries to establish Halal testing laboratories, which will ensure the ‘Halal’ status of the consumer products.\nCOMSTECH, SMIIC and other OIC institutions/organizations have been mandated by the Abu Dhabi Declaration (Second OIC Summit on Science & Technology, June 2021) to develop the capacity of Least Developed Countries of the OIC relevant to Halal (Clause # 32).\nThe objective of this training course is to encourage the harmonization of Halal Standards used in the OIC Countries and internationally by aiding in the adoption and use of the OIC/SMIIC Halal Standards.\nThe training course is designed to train the participants from Arab -OIC Member States regarding the procedures for adoption, implementation and use of the OIC/SMIIC Halal Food Standards, mainly (1) OIC/SMIIC 1:2019 – General Requirements for Halal Food and (2)  OIC/SMIIC 2:2019 – Conformity Assessment and Requirements for Bodies Providing Halal Certification as well as about the Testing Procedures standards such as Test Method for detection of porcine in Food Products and cosmetics and Test Method detection of ethanol in Food Products and cosmetics which are being developed at SMIIC Technical Committees.\nThey will also be trained on (3) Auditing of Testing Labs in line with OIC/SMIIC 35 – Conformity Assessment – General Requirements for the Competence of Laboratories Performing Halal Testing.\nThe aim is to transfer knowledge and skills and to develop the human capital while bridging the knowledge gap and enlightening the compliance requirements set forth by the regulatory bodies in the OIC Countries.\nA practical session will be conducted for a limited number of selected participants to transfer hands-on knowledge in halal laboratory testing methods.\nThe training course is designed to address the interest of scientists, research scholars, government officials, statutory policymakers, enforcement officers, and food safety auditors in OIC/SMIIC Halal Products Standards and Testing.",
  "retrievedAt": "2025-08-11T02:15:05.667Z"
}
