{
  "title": "Arms’ race likely to disturb balance of power in South Asia: COAS",
  "link": "https://www.app.com.pk/national/arms-race-likely-to-disturb-balance-of-power-in-south-asia-coas/",
  "date_published": "2024-05-02T15:45:00.000Z",
  "source": "APP",
  "content": "RISALPUR, May 2 (APP): Chief of Army Staff (COAS) General Syed Asim Munir on Thursday said that the growing arms race was likely to disturb the balance of power in the South Asia region.\nThe Army Chief was addressing the passing out parade of the Pakistan Air Force.\nThe COAS said, “Advanced technologies, including artificial intelligence, robotics and quantum computing are changing the use of air power as well as expanding its scope. However, without a strong air force, a country is at the mercy of any aggressor.”\nHe said the Pakistan Air Force had always lived up to the expectations of the nation. It patrolled the airspace in all kinds of difficulties with unparalleled bravery and professionalism, a great example of which was demonstrated before all in February 2019.\nThe Army Chief, while addressing the passing out of cadets, said, “You are the center of our hopes, the guardian of the skies and the guarantor of regional unity. You are expected to lead a life adorned with the virtues of character, courage and competence. Your conduct will be extraordinary not only for your personal ethics but also for the respected institution. You will never hesitate to sacrifice for the defence, honour and dignity of the motherland.”\nHe said the military leadership expected that the young cadets would always uphold the eternal tradition of the nation’s best spirit, professionalism and bravery.\nArticle 19 of the Constitution of the Islamic Republic of Pakistan, he said, clearly defined the limits of freedom of speech and expression of opinion.\n“Those who flout the clear restrictions imposed on freedom of expression in the Constitution cannot point fingers at others. We are well aware of our constitutional limits and expect others to uphold the Constitution,” he underlined.\nHe said that the Gaza war was the latest example of the suffering that wars could bring. “Indiscriminate killing of elderly, women and children in Gaza is proof that violence is increasing in the world.”\nThe Army Chief noted that India had illegally occupied the Jammu and Kashmir whereas the silence of the whole world on the ongoing Indian aggression in Kashmir could not suppress the voice of freedom echoing there.\n“We will continue to provide moral, political and diplomatic support to our Kashmiri brothers.”\nThe COAS advised the cadets,”Always remember that truth is power while falsehood can never be powerful. Be like Rashid Minhas, Sarfaraz Rafiqi and MM Alam who gave their services and lives to protect the dignity of the dear country. Be committed to the responsibility you are being entrusted with and remain loyal to the State of Pakistan.”",
  "retrievedAt": "2025-08-11T02:15:52.776Z"
}
