{
  "title": "High Commissioner Hawkins hosts reception to mark ‘Australia Day in Spring’",
  "link": "https://www.app.com.pk/national/high-commissioner-hawkins-hosts-reception-to-mark-australia-day-in-spring/",
  "date_published": "2024-05-02T18:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP): Australia’s High Commissioner in Pakistan Neil Hawkins Thursday held a vibrant reception to celebrate ‘Australia Day in Spring’ to mark the enduring ties between Australia and Pakistan.\nHigh Commissioner Hawkins, on the occasion, emphasised the historical ties of over 160 years and the shared ambition to capitalise on the dynamism in the two countries.\n“Australia and Pakistan are both relatively young nations but old civilisations. We share a federal system of governance, together with a rich cultural diversity, delicate ecosystems, and unique biodiversity,” Hawkins remarked.\nHe said Australia remains a steadfast supporter of a Pakistan that is democratic, inclusive, prosperous and stable, consistent with its Constitution.\nHighlighting the importance of gender equality, the High Commissioner affirmed: “We’re particularly excited to be working with our Pakistani colleagues to support their efforts to empower women and girls and unleash their full potential.”\nHawkins said, “This year we celebrate 40 years of cooperation between the Australian Centre for International Agricultural Research and Pakistan. Drawing on Australia’s own experiences, we have been helping develop the agricultural sector and implement sustainable water management practices, crucial for both nations given the impacts of climate change. We also celebrate 40 years of cooperation between our police agencies.”\n“I’m confident that more than 100,000 Australian-Pakistanis and many thousands of Pakistani and Australian alumni will bring our countries closer together. Not to mention the growing Australian involvement in the development of Pakistan’s mining sector and in building Pakistan’s emerging dairy industry.” he concluded.\nThe celebration witnessed the participation of many friends of Australia, including politicians, officials, diplomats, media, businesses and development partners.",
  "retrievedAt": "2025-08-11T02:15:49.232Z"
}
