{
  "title": "Bilawal extends solidarity to journalists, media professionals on World Press Freedom Day",
  "link": "https://www.app.com.pk/national/bilawal-extends-solidarity-to-journalists-media-professionals-on-world-press-freedom-day/",
  "date_published": "2024-05-02T13:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP): Chairman Pakistan People’s Party (PPP) Bilawal Bhutto Zardari has extended sincere solidarity to journalists and media professionals worldwide on World Press Freedom Day.\nEmphasizing the paramount importance of press freedom, he reaffirmed his party’s staunch support for the invaluable role of a free and independent press in fostering democracy.\nAccording to a press release by the Media Cell Bilawal House, he underscored that press freedom is not merely a cornerstone of democracy, but also vital for nurturing transparency, accountability, and the proliferation of diverse ideas within society. He urged that safeguarding and upholding this fundamental right should be the responsibility of every democratic government and party.\nBilawal Bhutto said that historically, the press in Pakistan has served as a watchdog, uncovering injustices, exposing corruption, and amplifying the voices of the marginalized.\nExpressing concern over challenges such as censorship, fake news, and violence faced by journalists, he urged media organizations to uphold journalistic integrity, impartiality, and professionalism in their reporting. He reiterated the party’s unwavering support for press freedom, grounded in democracy and liberty principles.\nHe underscored the 1973 Constitution’s guarantee of freedom of expression, including press freedom, a legacy of Quaid-e-Awam Shaheed Zulfikar Ali Bhutto. “Under his leadership, reforms liberalized media policies, fostering greater independence,” he noted.\nHe highlighted Prime Minister Shaheed Mohtarma Benazir Bhutto’s efforts to promote press freedom, including abolishing censorship laws and supporting independent media growth, adding that she also championed press freedom and human rights globally, underscoring their significance in democratic governance and seeking international support during dictatorial regimes.\nBilawal Bhutto noted that President Asif Ali Zardari honoured the vision and guiding principles of Shaheed Bhutto and Shaheed Mohtarma Benazir Bhutto by enshrining the “Right to Know” into the Constitution through the 18th Constitutional Amendment.\nHe expressed PPP’s solidarity with journalists in conflict zones like Indian Illegally Occupied Jammu and Kashmir (IIOJK) and Gaza, Palestine, praising their courage in reporting on human rights abuses despite grave risks.\n“Let us carry forward the torch of press freedom, illuminating pathways of accountability and fostering dialogue. Through our unwavering support, let’s empower journalists to fearlessly navigate the realms of truth, shaping a brighter future for all,” he concluded.",
  "retrievedAt": "2025-08-11T02:15:03.811Z"
}
