{
  "title": "Zong 4G prioritizes users’ well being with new SehatYab Partnership",
  "link": "https://www.app.com.pk/national/zong-4g-prioritizes-users-well-being-with-new-sehatyab-partnership/",
  "date_published": "2024-05-02T11:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP):Zong 4G, Pakistan’s leading mobile network operator,  announced a groundbreaking partnership with SehatYab, a leading tele-health platform.\nThis collaboration prioritizes user well-being by offering a comprehensive suite of mental health services accessible through the Zong 4G network said news release.\nSehatYab offers comprehensive online mental health services in Pakistan for individuals and corporates, providing confidential consultations with qualified and the best psychiatrists, psychologists, and trainers.\nThe Zong 4G and SehatYab partnership provides Zong 4G users with several valuable resources to support their mental health such as Free Online Self-Assessment Tests, helping you gain valuable insights into your mental wellbeing with free tests for adults and children.\nThese tests cover various areas, including mental health, relationships, and work stress.\nThis partnership offers discounted personalized consultations with licensed clinical psychologists and psychiatrists.\nStarting from Single consultations offering a flat 20% discount off the standard fee (Rs. 1,250 to Rs. 5000). It also offers Consultation packages comprising of 3, 6 or 10 sessions at a discounted rate of 30% off the standard fee (Rs. 1,250 to Rs. 5000). For University students there’s a 33% discount off the standard fee (Rs. 750). It further offers an additional 10% discount, on all discounted packages, maximizing their savings.\n“At Zong 4G, we recognize the importance of mental health and emotional well-being,” said Zong 4G Representative. “This partnership with SehatYab empowers our users to prioritize their mental health by providing them with convenient access to professional support and resource\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:15:26.219Z"
}
