{
  "article_id": "2025-08-21_6d734844aefeb3c2e03601f286f03efc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/intl-experts-call-for-strong-frameworks-strategies-to-build-economic-case-for-retiring-coal-power-plants/",
    "retrieved_at": "2025-08-22T00:38:09.839Z"
  },
  "metadata": {
    "title": "Int’l experts call for strong frameworks, strategies to build economic case for retiring coal power plants",
    "author": null,
    "date_published": "2025-08-21T14:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 538,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 21 (APP):International experts on Thursday underscored that while coal remains embedded in Pakistan's power system, the momentum is growing for a structured transition anchored in economic planning, just transition frameworks, and investments in renewable energy and grid modernization. The Sustainable Development Policy Institute (SDPI), in collaboration with the United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP), convened a high-level consultative discussion on \"Repurposing Coal-fired Power Plants in Pakistan - Challenges and Opportunities\", bringing together policymakers, experts, and energy leaders to chart pathways for Pakistan's transition away from coal, said a press release. Opening the discussion, Zainab Babar, Researcher SDPI set the context, highlighting the urgency of balancing Pakistan's energy needs with its climate commitments. Michael Williamson, Section Chief Energy Division at UNESCAP, said coal phase-down is now a central theme in Asia-Pacific following the 2021 Glasgow Climate Pact. \"The urgent need is to reverse the trend of coal-fired generation capacity, strengthen climate policies through NDC 3.0, phase out subsidies for fossil fuels, and accelerate support for renewables and energy efficiency,\" he emphasized. He noted that coal remains deeply entrenched, providing 56% of electricity generation in Asia-Pacific, while accounting for 76% of global consumption. He warned that the region's planned 184GW of new coal capacity risks locking in emissions for decades. Speaking on Pakistan's context, Dr Khalid Waleed, Energy Economy Expert at SDPI, described the country's \"three E's crisis\" energy, economy, and environment. He recalled how coal plants under the China-Pakistan Economic Corridor (CPEC) added 7.2 GW of capacity but at a cost to affordability and utilization. \"We are facing a planning conundrum solving one crisis often leads to another. While imported coal plants are underutilized, community-financed rooftop solar is rapidly expanding,\" he said, urging financial and technical repurposing options, including early retirement schemes, coal to clean credit initiative, Just Energy Transition Partnerships (JETPs), and local coal integration. Shah Jahan Mirza, Managing Director PPIB, underlined government targets of 40% renewable energy by 2025 and 60% by 2030, noting that with net-metered solar, Pakistan is already at 43-44% renewables in its energy mix. He confirmed that while Pakistan has no timeline for phasing out coal, the 2025-35 plan envisions no new thermal plants, with capacity additions focused on hydro, wind, and nuclear. However, he stressed that grid infrastructure remains the biggest bottleneck in scaling up renewables. David Lone, Manager, Global Electricity Transition, Rocky Mountain Institute said coal plants could be converted into flexible grid services or even green hydrogen sites, while George Mowles-Van Ger Gaag, Associate Director of Coal Asset Transition called for a national just transition framework to safeguard jobs and communities. Yuki Yasui, Managing Director, GFANZ stressed that credibility and financial viability must underpin coal-to-clean transitions, while Ali Amin Policy Fellow from Transition Pathway Initiative, The London School of Economics argued for sectoral pathways that align Pakistan with the Paris Agreement. Engineer Ubaid ur Rehman Zia, Head of Energy Unit at SDPI in his concluding remarks said Pakistan's transition debate has shifted from energy security to economic viability. \"Renewables are becoming cheaper while coal financing is nearly nonexistent. The real challenge is addressing stranded assets and capacity payments. Green upscaling and repurposing of coal power plants is the way forward,\" he remarked.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}