{
  "article_id": "2025-08-21_540e4b54e55409bd2168428287a750a8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rs-1-million-fine-imposed-in-nirm-harassment-case/",
    "retrieved_at": "2025-08-22T00:38:30.583Z"
  },
  "metadata": {
    "title": "Rs. 1 million fine imposed in NIRM harassment case",
    "author": null,
    "date_published": "2025-08-21T12:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 201,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 21 (APP): The Federal Ombudsperson for Protection Against Harassment (FOSPAH) has imposed a penalty of Rs. 1 million on a senior official of the National Institute of Rehabilitation Medicine (NIRM), Islamabad, after finding him guilty of workplace harassment and gender-based discrimination. After examining evidence, hearing witnesses, and reviewing arguments, the Ombudsperson concluded that the accused, Dr. Mazhar Hussain (Director Technical, NIRM), engaged in conduct amounting to harassment under Section 2(h)(ii) of the Protection Against Harassment of Women at the Workplace Act, 2010. The order found that his actions, including interference during an employee's approved leaves, disproportionate KPI deductions, and retaliatory proceedings, created a hostile work environment and constituted gender-based discrimination. The Federal Ombudsperson, Fauzia Viqar, imposed a fine of Rs. 1,000,000 on the accused, half of which is to be paid as compensation to the complainant, said a press release issued here Thursday. While the decision on service postings lies with the administration, the Ombudsperson further recommended that the accused be transferred to a position without administrative authority, to prevent future abuse of power and to maintain a safe workplace environment. This decision underscores FOSPAH's constitutional mandate to ensure safe, dignified, and harassment-free workplaces for all employees across Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}