{
  "article_id": "2025-08-21_e57adf5250dedc60550f79b60df76136",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ac-paharpur-holds-open-court-under-public-agenda/",
    "retrieved_at": "2025-08-22T00:39:37.093Z"
  },
  "metadata": {
    "title": "AC Paharpur holds open court under public agenda",
    "author": null,
    "date_published": "2025-08-21T06:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 197,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "DERA ISMAIL KHAN , Aug 21 (APP):On the special directives of Deputy Commissioner Dera Ismail Khan, Assistant Commissioner Paharpur, Dr. Hamid Sadeeq, convened an open court (Khuli Kachehri) in Kirri Khesoor here Thursday. The event was attended by officers from various government departments, while a large number of local citizens actively participated and presented their issues. Immediate action was taken on several public complaints, and instructions were issued to the relevant departments on the spot for swift resolution of problems. The open forum provided a platform for people to directly communicate their concerns to the administration. Speaking on the occasion, Assistant Commissioner Dr. Hamid emphasized that the district administration is fully committed to resolving public issues under the vision of Chief Minister Khyber Pakhtunkhwaas people-first agenda. He assured citizens that no one would be left unheard. aOur doors are always open for the public. I urge citizens to approach my office without hesitation in case of any difficulty. The administrationas prime responsibility is to serve the people and address their grievances promptly,a Dr. Hamid stated. The participants lauded the initiative, appreciating the efforts of the district administration in creating direct engagement between government departments and the public.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}