{
  "article_id": "2025-08-21_8d363ee3df5e9a8ce688933dfb0ca68e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nab-starts-payment-to-17500-b4u-affectees/",
    "retrieved_at": "2025-08-22T00:38:06.804Z"
  },
  "metadata": {
    "title": "NAB starts payment to 17,500 B4U affectees",
    "author": null,
    "date_published": "2025-08-21T15:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 470,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 21 (APP): A special ceremony was organized by National Accountability Bureau (Rawalpindi/Islamabad) at NAB headquarters, Islamabad on Thursday to distribute cheques of recovered funds to the victims of the B4U fraud. The ceremony was presided over by Chairman NAB Lt. Gen (R) Nazir Ahmed and attended by Prosecutor General Accountability Syed Ihtesham Qadir Shah, Director Generals, senior NAB officers and a large number of general public/scam affectees. The B4U fraud is one of Pakistan's largest financial scams, operated as an online Ponzi scheme through shell companies by Saif-ur-Rehman and his associates. Billions of rupees were collected from the public by promising a 7% monthly return. NAB initiated an inquiry into the matter on February 5, 2021, after receiving hundreds of complaints from victims and the Securities and Exchange Commission of Pakistan (SECP). During the investigation, NAB traced and froze 56 bank accounts, properties, and other assets belonging to the accused persons, while online data was downloaded and used to verify victims' claims. As a result of NAB's persistent efforts and legal action, a recovery process for Rs 7.3 billion was initiated. At the initial phase, Rs 3.7 billion is being distributed among 17500 affectees with 10000 affectees getting their whole amount and remaining 7500 will get 40 percent of their amount now while remaining 60 percent will be paid within six months after disposing of the properties of the accused. Addressing the ceremony, the Chairman NAB reiterated NAB's priorities which included focus on the public at large cases and to recover 100 per cent looted amount from the accused persons and return the same to the victims in the shortest possible time. He further emphasized the public to take utmost care in investing their hard-earned money in various schemes and make thorough inquiry before investments. The Chairman NAB appreciated the efforts and hardwork of NAB (Rawalpindi/Islamabad) team who made recoveries and disbursement of recovered amounts possible in the face of various challenges in the B4U scam. The Chairman NAB also announced Ummrah package as incentive for the whole team of NAB Rawalpindi. It was announced that in future victims will no longer need to visit NAB offices to claim their compensation. Funds will be directly transferred into their bank accounts. This milestone reflects NAB's commitment to protecting public interests, recovering looted funds, and restoring public trust. Earlier, DG NAB (Rawalpindi/Islamabad) Waqar Ahmed Chohan highlighted efforts of concerned case officers and briefed the audience on the difficulties they faced in the recovery of looted amount from the accused persons in B4U scam. The beneficiaries expressed their deep satisfaction and gratitude on NAB's efforts, stating that they had lost all hope of recovering their savings. They praised the relentless efforts of NAB Chairman Lt. Gen. (Retd.) Nazir Ahmed and NAB officials, whose hard work made this recovery and distribution possible.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}