{
  "article_id": "2025-08-21_016bde50c9ef4800774e13131af300cf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rotary-club-pakistan-corporate-hosts-grand-reception-honouring-rotary-international-delegation/",
    "retrieved_at": "2025-08-22T00:39:15.281Z"
  },
  "metadata": {
    "title": "Rotary Club Pakistan Corporate hosts grand reception honouring Rotary International delegation",
    "author": null,
    "date_published": "2025-08-21T10:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 250,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 21 (APP):Rotary Club Pakistan Corporate organized a prestigious reception in honor of the visiting Rotary International delegation, led by Rotary International President Francisco Azzaro, Trustee Chair of The Rotary Foundation Holger Knaack, and International PolioPlus Committee Chairperson Mike McGovern. In his address, President Azzaro, along with members of the delegation, lauded the Government of Pakistan's commitment and progress in the eradication of polio, acknowledging the country's remarkable efforts in partnership with Rotary, said a press release issued here on Thursday. Past Trustee Aziz Memon highlighted the on-ground challenges of polio eradication and paid tribute to the resilience and dedication of frontline polio workers serving in difficult circumstances. Justice (retd) Farrukh Irfan Khan, President of Rotary Club Pakistan Corporate, reaffirmed the Club's resolve to serve communities in need. Imran Ghaznavi, founder of the Club, urged the corporate sector to play an active role in sustainable community service and to join hands with Rotary in its humanitarian initiatives. Chief guest, Senator Syed Sarmad Ali, emphasized Pakistan's strategic importance in today's global and regional context. He described Pakistan as a resilient nation with immense potential and as an emerging hub for global tourism. The event was attended by the Italian Ambassador to Pakistan Marilina Armellin, Shahzad Malik, President ICMA, Ms Ayla Majid, the global president of the Association of Chartered Certified Accountants (ACCA), prominent corporate sector leaders and senior journalists. They appreciated Rotary Club Pakistan Corporate's efforts in establishing a platform that brings together business leadership for impactful service to communities.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}