{
  "article_id": "2025-08-21_f0a9e7365733476daf882ddcad55e5e5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ashra-rahmatul-lil-alameen-to-be-observed-from-1st-to-12th-rabi-ul-awal/",
    "retrieved_at": "2025-08-22T00:37:44.567Z"
  },
  "metadata": {
    "title": "Ashra Rahmatul-lil-Alameen’ to be observed from 1st to 12th Rabi-ul-Awal",
    "author": null,
    "date_published": "2025-08-21T16:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 313,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, August 21 (APP):The government has announced that Ashra Rahmatul-lil-Alameen will be observed across the country from 1st to 12th Rabi-ul-Awwal with devotion and reverence, featuring national and provincial-level programs in connection with the 1,500 birth anniversary of the Holy Prophet Muhammad (Peace Be Upon Him). Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf chaired an inter-provincial meeting on Thursday where key decisions were taken to mark the occasion. The meeting was attended by Federal Secretary Religious Affairs Dr. Syed Atta-ur-Rehman, Additional Secretary Dr. Sajid Mahmood Chauhan, provincial Auqaf secretaries, Minister of Auqaf AJK Hafiz Muhammad Ahmad Raza Qadri, Parliamentary Secretary Balochistan Shahnaz Umrani, and other senior officials. Highlighting the importance of the commemorations, Sardar Yousaf said the Ministry of Religious Affairs and Interfaith Harmony will organize the 50th International Seerat-un-Nabi Conference in Islamabad, with the theme: \"The State's Responsibility in Educating and Training Youth for the Constructive Use of Social Media in the Light of Seerat-un-Nabi (Peace Be Upon Him).\" He emphasized that the observance of Ashra will help spread awareness among the younger generation about the life and teachings of the Holy Prophet Muhammad (Peace Be Upon Him). Special gatherings will be held by provincial and local governments, while schools, colleges, universities, and religious seminaries will arrange joint programs, encouraging students to share their reflections on the Seerat. Sardar Yousaf said resolutions passed by the National Assembly and Senate provide the framework for nationwide Seerat gatherings. He stressed the need to address contemporary challenges including education, economy, social values, and family systems in the light of the Prophet's Sunnah. \"Only by following the Seerat of the Holy Prophet (Peace Be Upon Him) in action can we achieve success in this world and the hereafter,\" he said, adding that in today's digital age, social media has made it easier to spread the Prophet's universal message of guidance and humanity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}