{
  "article_id": "2025-08-21_5f8899b530e36990874354b1623d599c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/governor-sindh-visits-rain-affected-areas-across-karachi-assures-full-support-to-citizens/",
    "retrieved_at": "2025-08-22T00:37:44.565Z"
  },
  "metadata": {
    "title": "Governor Sindh visits rain-affected areas across Karachi, assures full support to citizens",
    "author": null,
    "date_published": "2025-08-21T16:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 427,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "KARACHI, Aug 21 (APP):Governor Sindh Kamran Khan Tessori Thursday visited various rain-affected areas of Karachi. The Governor toured M.A. Jinnah Road, Saddar, Guru Mandir, Gulbahar, Board Office, Nazimabad, North Nazimabad, Hyderi, KDA, Five Star, New Karachi, Nagan Chowrangi, Power House Chowrangi, and Surjani Town, where he met with the affected residents, listened to their grievances, and assured them of all possible assistance. During the visit, Governor Sindh, accompanied by senior MQM Pakistan leader Dr. Farooq Sattar, also distributed cooked food and bottled water among rain-affected citizens. Later, talking to the media at Governor House alongside Dr. Farooq Sattar, he said that the power system in Karachi and Hyderabad had collapsed due to the rains, leaving citizens in severe distress. He added that in Surjani Phase-II, floodwater had entered people's homes, and food and water were being provided to families on rooftops. Governor Tessori informed that he had coordinated with the Mayor of Karachi and electricity authorities, following which water had been drained from several areas, though low-lying localities were still inundated. He emphasized that the causes of these recurring issues must be identified in order to devise permanent solutions through consultation. In this regard, he assured full cooperation with the Sindh government and the Mayor of Karachi. He revealed that 1,095 complaints were received at the Governor House Complaint Cell in a single day, while more than 11,000 complaints had been registered since the cell's establishment. He stated that 11,000 bottles of water and 7,000 food packets had been distributed so far, and the relief activities were ongoing. Responding to a question, Governor Sindh said that citizens would not be left alone under any circumstances. He cited a recent emergency response to a call from Dubai regarding a stranded family in Karachi, which was acted upon immediately. He urged citizens to register electricity and water complaints on Helpline 1366 and assured them that the doors of the Governor House remain open to the public. Governor Sindh said that despite the difficult situation, the people remained hopeful, and it was expected that the issues would soon be resolved. Appealing to the federal government, he requested adequate compensation for the losses suffered by rain victims. He expressed grief over the lives lost and those injured during the torrential rains, stressing the urgent need to accelerate relief operations. He also appealed to political parties to establish relief camps, console the victims, and serve the public with a sense of responsibility. He reiterated that serving the people in their time of need is the foremost duty of those holding public office.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}