{
  "article_id": "2025-08-21_973fc42182786d3e60c9f332a7b9a4e2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kp-governor-appeals-to-overseas-pakistanis-in-brussels-for-flood-relief/",
    "retrieved_at": "2025-08-22T00:38:56.371Z"
  },
  "metadata": {
    "title": "KP Governor appeals to Overseas Pakistanis in Brussels for flood relief",
    "author": null,
    "date_published": "2025-08-21T09:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 453,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "BRUSSELS, Aug 21 (APP): Governor Khyber Pakhtunkhwa Faisal Karim Kundi has urged overseas Pakistanis to step forward in support of flood victims back home. Addressing the Pakistani community in Brussels during his three-day visit to Belgium on the invitation of the EU Kashmir Council on Thursday, he emphasized that overseas Pakistanis have always stood by the nation in times of crisis and can send their assistance directly to affected districts through the Pakistan Red Crescent Society. Highlighting the devastation caused by recent cloudbursts and floods, the Governor said climate change has struck Khyber Pakhtunkhwa after years of suffering from terrorism. \"Even the Meteorological Department cannot predict cloudbursts. Our province is now fighting the impacts of climate change after enduring terrorism,\" he remarked. On the security situation, Governor Kundi called an operation against terrorists \"unavoidable,\" stressing that militants refuse dialogue and continue to extort money, with even the Chief Minister admitting to paying extortion. \"Our soldiers and police personnel are sacrificing their lives daily. Terrorists are carrying out drone attacks, using civilians as human shields. There is no solution left but a decisive operation,\" he said, recalling that the Pakistan Peoples Party (PPP) had previously restored peace through the Swat operation. He accused the previous government of allowing militants to return and resettle in the province. \"If our army can defeat India in three days, it can also eliminate terrorism,\" Kundi declared. Speaking on regional and international affairs, the Governor said Pakistan's diplomatic and political standing rose after the recent war with India, with friendly nations including China, Azerbaijan and Turkey extending their support. He also noted Iran's gesture when its President visited Islamabad after the Iran-Israel conflict to thank Pakistan. He praised PPP Chairman Bilawal Bhutto Zardari for effectively presenting Pakistan's case on Kashmir at international forums, while also recalling the role of journalists during wartime. Governor Kundi added that Shaheed Benazir Bhutto had gifted Pakistan missile technology, which today serves as a shield against India. He described Pakistan as a leader of the Muslim Ummah and said relations with the United States were improving at all levels. Calling for overseas Pakistanis' active role in investment, industry, agriculture, minerals and tourism, he said their renewed confidence after the war with India is vital for the country's progress. He informed the community that the Governor House, through the Red Crescent, is actively delivering aid in flood-affected areas with support from Sindh, Punjab, Balochistan, and friendly nations. \"Our goal is to ensure complete relief and rehabilitation for flood victims,\" he affirmed. The Pakistani community in Brussels welcomed Governor Kundi's visit, terming it significant for Pakistan's relations with the EU. Community leaders said Pakistan's growing engagement with the European Union was in the country's best interest.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}