{
  "article_id": "2025-08-21_f904966c1f15decf2be80be256008fbc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cartelization-in-pharma-sector-causing-price-hike-senate-body/",
    "retrieved_at": "2025-08-23T07:57:09.473Z"
  },
  "metadata": {
    "title": "Cartelization in pharma sector causing price hike: Senate body",
    "author": null,
    "date_published": "2025-08-21T17:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 314,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 21 (APP): The Senate Standing Committee on National Health Services, Regulations and Coordination on Thursday expressed concern over cartelization in the pharmaceutical sector, causing unprecedented drug price hikes. Chairing the meeting, Senator Amir Waliuddin Chishti expressed grave concern that profiteering by drug manufacturers had undermined the government's policy of deregulation, which was intended to make medicines more affordable. \"If cartelization continues and deregulation fails to achieve its purpose, the bodies concerned will be asked to review the policy,\" he cautioned. Federal Minister for Health, Syed Mustafa Kamal assured the committee that a comprehensive assessment report, being prepared in consultation with stakeholders, would be finalized by September 18. During the session, Senator Fawzia Arshad raised concerns over irregularities in the upcoming Medical and Dental Colleges Admission Test (MDCAT), scheduled for October 5 with over 150,000 candidates. The committee directed robust monitoring, especially in Sindh, to prevent paper leaks, with the Minister assuring that a secure question bank and additional safeguards were in place. Legislative business included the Pakistan Medical and Dental Council (Amendment) Bill, 2025, and the Mental Health (Amendment) Bill, 2025. While the PMDC Bill was deferred for further scrutiny over concerns about political interference, the Mental Health Bill-aimed at regulating psychologists-was approved. The Committee also discussed the Prohibition of Smoking and Protection of Non-Smokers Health (Amendment) Bill, 2025. Its mover, Senator Sarmad Ali, urged tighter controls on vaping, particularly near educational institutions. The Ministry was directed to revisit outdated tobacco laws in consultation with the mover. On private medical colleges, senators criticized institutions charging fees far above the prescribed Rs1.8 million and failing to refund excess payments. The Chairman suggested mandatory audit reports, while the Minister committed to inspections in Islamabad. Senator Chishti stressed that protecting public health must remain the government's top priority, directing that the issue of drug pricing be revisited once the deregulation assessment is submitted in September.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}