{
  "article_id": "2025-08-21_3a18832ccd8d3d1d79b1c816c15c6351",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-rubina-khalid-visits-flood-hit-areas-of-buner-and-swat-assures-full-support-to-victims/",
    "retrieved_at": "2025-08-22T00:38:07.032Z"
  },
  "metadata": {
    "title": "Senator Rubina Khalid visits flood-hit areas of Buner and Swat, assures full support to victims",
    "author": null,
    "date_published": "2025-08-21T15:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 375,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 21 (APP): Chairperson Benazir Income Support Programme (BISP) Senator Rubina Khalid visited flood-ravaged areas of District Buner and Swat to express solidarity with the affected families, monitor relief operations, and reaffirm the government's commitment to stand by the victims in their time of need. During her three-day visit, the BISP chief toured severely hit localities including Pattedara and Qadir Nagar, where 26 members of a family lost their lives during a wedding ceremony due to the devastating floods. She met survivors, including Junaid, who lost seven close relatives, and directed the Director General BISP Khyber Pakhtunkhwa to immediately collect data of all such families so that they could be provided relief under a special support package. In Gokund, Senator Rubina Khalid met a blind elder who lost nearly nine family members and is now left with two children. She personally offered financial assistance to the family. Offering fateha at multiple sites, she extended her condolences to the bereaved and assured them of continued support. The Chairperson also visited Pir Baba shrine, which had been completely submerged, and a local Gurdwara where she met members of the Sikh community and expressed solidarity with them. Emphasizing dignity in relief operations, Senator Rubina Khalid urged rescue teams and NGOs to avoid showmanship while helping victims. Locals also presented her with a list of nearly 100 deceased persons, which she directed officials to verify and include in future relief packages. Highlighting environmental concerns, she cautioned residents about the dangers of plastic pollution, noting its role in climate change. She personally joined a cleanliness drive alongside locals and BISP staff to collect plastic waste. At the Swat Press Club, where a BISP Mobile Registration Vehicle (MRV) had been deployed, Senator Rubina Khalid monitored ongoing surveys and registration of new beneficiaries. She personally observed women's registration and recertification processes. She also visited a medical camp, handed over medicines, and met doctors and volunteers, appreciating their dedicated services. Speaking to the media, she appealed to philanthropists and well-off citizens to extend maximum cooperation in relief efforts while preserving the self-respect of affected families. \"BISP stands firmly with the victims in every difficult time,\" Senator Rubina Khalid reaffirmed, assuring flood-hit communities that they will not be left alone in their suffering.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}