{
  "article_id": "2025-08-21_a85760e4e7c44761d978e6b0b61bd1f4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ambassadors-of-azerbaijan-belgium-call-on-minister-for-defence-production/",
    "retrieved_at": "2025-08-22T00:38:29.406Z"
  },
  "metadata": {
    "title": "Ambassadors of Azerbaijan, Belgium call on Minister for Defence Production",
    "author": null,
    "date_published": "2025-08-21T13:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 207,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Aug 21 (APP): Ambassador of Azerbaijan Khazar Farhadov and Ambassador of Kingdom of Belgium Charles Idesbald separately called on Federal Minister for Defence Production, Muhammad Raza Hayat Harraj here Thursday. The Minister welcomed the ambassador of Azerbaijan and highly appreciated the brotherly feelings of Azerbaijan Government for Pakistan on all international forums, said a press release. Muhammad Raza Hayat Harraj appreciated existing defense cooperation between the two countries and desired to expand it further. He emphasized that Pakistan and Azerbaijan have deep roots in common faith, cultural affinities, and shared traditions. Minister proposed more frequent exchange of visits to each other's institutions to explore new areas of mutual cooperation. Meanwhile during meeting with Mr. Charles Idesbald, Ambassador of Kingdom of Belgium the Minister expressed that relations between the two countries are growing with the passage of time and bilateral relations are being enhanced in all fields. As regards to our cooperation in business sector, it is expanding gradually and expected to grow manifolds. The visiting dignitaries thanked the honorable Minister for sparing time and showed their government's commitment to continue working with the government of Pakistan in all domains. Both the envoys assured for their efforts to fully cooperate with Pakistan to further expand bilateral ties.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}