{
  "title": "Chairperson NAVTTC visit to China; Pakistan, China deepen TVET ties under CPEC Phase II",
  "author": null,
  "content": "ISLAMABAD, Jul 13 (APP):Pakistan and China have agreed to launch joint training programs in multiple fields including construction engineering, artificial intelligence, agriculture and hospitality management under the second phase of the China-Pakistan Economic Corridor (CPEC).\nFurthermore, steps have been initiated for establishing mutual recognition mechanisms for skills and vocational certifications with Saudi Arabia and Oman.\nThe milestone was achieved during a high-level visit to China by Gulmina Bilal Ahmad, Chairperson of the National Vocational and Technical Training Commission (NAVTTC) and Pakistan Side Chairperson of the China-Pakistan TVET-Industrial Center of Excellence (CPTICE) from 6th to 12th July 2025, said a press release issued here on Sunday.\nDisclosing the outcomes of the visit in a detailed briefing held at NAVTTC Headquarters,Gulmina Bilal Ahmad stated that the visit was undertaken to promote bilateral cooperation in Technical and Vocational Education and Training (TVET) between Pakistan and China. The initiative was carried out under the special instructions of Prime Minister of Pakistan Mian Shahbaz Sharif, Chairman of the Prime Minister’s Youth Programme Rana Mashhood Ahmad Khan, and Federal Minister for Education and Professional Training Dr Khalid Maqbool Siddiqui.\nThe visit was conducted under the platform of China-Pakistan TVET-Industrial Center of Excellence (CPTICE)—the only official bilateral forum for collaboration between industry and education. Its main objective was to prepare a skilled workforce for the second phase of CPEC and equip Pakistani youth with globally competitive technical skills.\nDuring the visit, the Pakistani delegation held consultations at the Embassy of Pakistan in Beijing, where discussions were held on implementing TVET-related provisions of the China-Pakistan Joint Statement. The delegation also visited the headquarters of China International Intellectual Group (CIIC) and met with its Chairman Bu Yulong, where agreements were reached on vocational training cooperation, joint curriculum development, and industry-academic linkages.\nGulmina further informed that the delegation also visited TANG International Education Group, the Chinese Secretariat of CPTICE, where a working meeting was co-chaired with Mr. Li Jinsong, the China Side Chairperson of CPTICE. It was agreed to launch collaborative training programs in construction engineering, AI, agriculture, and hospitality management. Additionally, steps were initiated for the mutual recognition of skills certifications with Saudi Arabia and Oman.\nThe delegation visited Jinan Vocational College, Anhui Water Conservancy Technical College, and the Zhejiang Institute of Mechanical and Electrical Technician, where senior officials warmly received the Pakistani delegation.\nShe added that at Jinan Vocational College, the “Project 210” smart manufacturing training model was introduced. A Memorandum of Understanding (MoU) was signed with Anhui College for the establishment of the “China-Pakistan Huijiang Workshop”, which also includes accommodation for Pakistani instructors currently under construction.\nWith the Zhejiang Institute, it was agreed to establish a “China-Pakistan High-Skilled Talent Training Center” aimed at advancing skills in smart manufacturing and e-commerce.\nThe delegation also visited Zhejiang Soton Holding Group, the world’s largest straw manufacturing company. General Manager Li Erqiao briefed the delegation on the company’s corporate training model, employee skills development framework, and green industrial practices. The model was recognized as highly relevant for Pakistan’s small and medium-sized enterprises (SMEs).\nDuring the week-long visit, several MoUs, working plans, and cooperation agreements were signed to operationalize TVET collaboration between Pakistan and China.\nThrough CPTICE, both countries will establish a coordinated mechanism for mutual training, international recognition of certifications, and alignment with global labor market demands.\nThis visit is expected to not only open new employment avenues for Pakistani youth but also ensure a skilled human resource pool for the industrial advancement required in the second phase of CPEC.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:31:27.621Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chairperson-navttc-visit-to-china-pakistan-china-deepen-tvet-ties-under-cpec-phase-ii/",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T16:10:00.000Z"
}
