{
  "title": "Interior minister pays glowing tribute to Kashmiri Martyrs, reaffirms Pakistan’s Commitment to Kashmir",
  "author": null,
  "content": "ISLAMABAD, Jul 13 (APP): Interior Minister Mohsin Naqvi has paid glowing tribute to the brave Kashmiri martyrs who sacrificed their lives on July 13, 1931. He saluted the ultimate sacrifice of the 22 martyrs who faced bullets with courage and dignity in reverence of the call to prayer (Azaan).\nHe stated that July 13, 1931, was the harbinger of free conscience against a system that sought to silence the oppressed. He added that the guns of the Dogra regime and the violence of the Indian state are different forms of the same oppression.\nMohsin Naqvi emphasized that the suppression of belief, identity, opinion, and resistance through state power in Indian Illegal occupied Jammu and Kashmir (IIOJK) is a mockery of human dignity. He said that the Modi Government, like the Dogra regime, is carrying out oppressive actions against Kashmiris and the Indian State’s policies — including the genocide of Kashmiri youth, extrajudicial killings, and silencing of journalists — are a disgrace to humanity.\nThe Interior Minister said that US President Donald Trump’s offer to mediate opened a door to peace, but India closed this door, proving its warlike mindset through its rejection of dialogue.\nHe highlighted that the call for freedom cannot be suppressed with guns, imprisonment, or curfews — this voice will live on for generations. He stressed that Kashmir Martyrs’ Day is a day of renewed commitment. He highlighted that Pakistan stands as the guardian, advocate, and guarantor of the Kashmiris’ right to freedom.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:31:53.551Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/interior-minister-pays-glowing-tribute-to-kashmiri-martyrs-reaffirms-pakistans-commitment-to-kashmir/",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T14:43:00.000Z"
}
