{
  "title": "PBM completes nationwide staff training to advance transparency, governance",
  "author": null,
  "content": "ISLAMABAD, Jul 13 (APP): Pakistan Bait-ul-Mal (PBM) has concluded a nationwide training program aimed at enhancing the professional capacity of its staff, in line with the strategic vision of Managing Director Senator Captain (Retd.) Shaheen Khalid Butt.\nLed by Director General Professor Dr. Zeeshan Danish, the initiative emphasized organizational behavior, whistleblowing, and conflict of interest policies to reinforce PBM’s commitment to transparency, merit, and good governance.\nThese efforts reinforced PBM’s enduring commitment to transparency, merit-based practices, and principled governance.\nSimultaneous training sessions were held at the Islamabad head office and various regional and provincial locations, engaging hundreds of officers and staff.\nSessions emphasised policy-driven governance and fair conduct across the organization.\nThese sessions underscored policies designed to promote a transparent and equitable workplace. Dr. Danish affirmed that every PBM employee has the right to report concerns, ensuring accountability, and announced the forthcoming establishment of dedicated committees in all PBM offices to oversee policy implementation.\nSenator Butt reiterated his goal of transforming PBM into a model institution, while Dr. Danish described the policies as a landmark in institutional reform. The training, personally led by Dr. Danish at one of the Islamabad centers, was\nsupported by key directors, including Dr. Qasim Zafar (Projects), Abdul Mannan (Monitoring & Evaluation), Kashif Nadeem (MIS), Ms. Saima Wadood (ICT), Abdul Hafeez Mahesar (Sindh), Muhammad Zaheer (Lahore), Ramzan Tahir (Multan), and Lal Badshah (KPK).\nSessions in Gilgit-Baltistan and Balochistan were conducted virtually, ensuring nationwide participation.\nParticipants praised the Managing Director and Director General for delivering engaging, learning-focused sessions in a supportive environment. The policies, available on PBM’s website and distributed during the training, were thoroughly discussed, covering objectives, complaint mechanisms, and protections for complainants.\nThis initiative reflects PBM’s dedication to enhancing service delivery and operational efficiency, rooted in the Islamic principles of charity, compassion, and accountability that guide its mission.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:31:56.479Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pbm-completes-nationwide-staff-training-to-advance-transparency-governance/",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T09:31:00.000Z"
}
