{
  "title": "KP Govt launches grand operation against encroachments on Auqaf’s properties",
  "link": "https://www.app.com.pk/national/kp-govt-launches-grand-operation-against-encroachments-on-auqafs-properties/",
  "date_published": "2021-10-02T15:51:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 02 (APP):On the special directives of Chief Minister Khyber Pakhtunkhwa Mahmood Khan, a mass scale operation has been launched against encroachments on properties of Auqaf Department and 4000 kanal land has been retrieved during last one month.\nAccording to details, 331 kanals of land has been retrieved in district Mardan, 2166 kanal in Bannu, 1460 kanal in DI Khan, 15 kanal in Kohat and six kanal have been retrieved in Peshawar.\nSimilarly, encroachments on Auqaf properties have also been identified in Mansehra, Charsadda, Swabi and districts as well and operations to retrieve those properties will be launched soon.\nThis was told in a meeting review the overall performance of Auqaf Department and progress on reform initiatives being introduced in the department held here the other day with Chief Minister Khyber Pakhtunkhwa Mahmood Khan in the chair, said an official handout issued here on Saturday.\nSpecial Assistant to the Chief Minister for Auqaf Zahoor Shakir, Secretary Auqaf Omar Khayyam and Principal Secretary to the Chief Minister Amjad Ali Khan and other concerned officials of Finance and Planning Departments attended the meeting.\nThe meeting was informed that most of the encroachments on Auqaf properties had been found in Mardan district and an operation is underway with the help of the district administration against those encroachments.\nThe Chief Minister while giving one month time period to remove encroachments on all the properties of Auqaf in district Mardan, directed the concerned authorities to take all necessary steps in this regard and said that after one month time period another meeting will be held to review progress on the matter.\nSimilarly, the Chair also gave a two-month deadline for digitization of all matters related to the collection of department’s receipts to ensure 100% transparency in the entire process, and directed the concerned quarters to ensure the completion of digitization in the given time frame.\nThe meeting was informed that a new strategy was being prepared for leasing out the Auqaf Department’s properties in the province at market rates, and with the technical assistance of Communication and Works Department, rent/lease amounts are being fixed on market rates for Auqaf properties.\nRegarding the progress made so far on the provision of honorarium to Aimma Masajid of the province including the merged districts, it was informed that data of 21493 Aimma Masajid and 293 minority religious leaders have been collected from all over the province adding that the released funds have been transferred to districts for payment of these honorariums, and very soon these honorariums will be paid on a quarterly basis.\nIt was further informed that in the light of the directive of the Chief Minister, scheme worth Rs. 500 million and Rs. 250 million had been reflected in the Annual Development Program for providing scholarships to the students of registered religious madrassas of the settled districts and Newly Merged Districts respectively adding that PC-1 of the scheme has also been submitted to the relevant forum for approval.",
  "retrievedAt": "2025-08-11T21:22:32.928Z"
}
