{
  "title": "Religious scholars vow to jointly work for development of country",
  "link": "https://www.app.com.pk/national/religious-scholars-vow-to-jointly-work-for-development-of-country/",
  "date_published": "2020-03-02T06:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP):A representative meeting of religious scholars of various schools of thought on Monday vowed to jointly work for clean and green Pakistan, creating awareness about getting both religious and modern education, health awareness, creating consciousness about obeying the country’s laws and to playing role to stop fake news in the society.\nThis was stated in a joint declaration of a brainstorming session hosted by the Aiwan-e-Sadr to get input from the religious scholars on the subjects of Clean and Green Pakistan, education, health, law and fake news.\nThe event was attended by Minister for Religious Affairs Pir Nurul Haq Qadri, Minister for Federal Education and Professional Training Shafqat Mahmood, Advisor to Prime Minister on Climate Change Malik Amin Aslam, Special Assistant to Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan, Special Assistant to Prime Minister on Health Dr Zafar Mirza, Chairman Council of Islamic Ideology Dr Qibla Ayaz and large number of religious scholars hailing from different schools of thought.\nThe religious scholars said they individually and collectively would observe cleanliness and play their role to keep the surroundings neat and clean so that our society and living manifested our character and cleanliness. The said trees and forests were very vital for environment and health and forestation and its protection was our national and religious obligation.\nThe joint statement said the scholars would sensitize the society about tree plantation and stop people from wastage of water. The joint statement said getting of religious and modern education were very much important and there was clear message of getting both religious and modern knowledge in the Holy Quran.\nThe joint statement reiterated that not only the children would be provided both the religious and modern knowledge but the people would also be sensitize about it.\nHealth of mother and child and, a healthy family and society is a guaranty to a healthy society, the joint statement said, adding that adopting precautionary measures was not only allowed in Islam but was also must for a healthy society.\nThe religious scholars said they would inform people about these issues not only in Jumma congregations but also in their private meetings.\nThe scholars in the joint statement said that the secret of development of any country was hidden in obeying the laws and reiterated their commitment to obey the laws by themselves and also motivate the people to do that.\nThe joint statement said spreading of fake and fabricated news was forbidden in Islam. The religious scholars said they would preach against such practices and besides advising the people to desist from spreading fake news and also play constructive role in stopping negative use of social and electronic media.",
  "retrievedAt": "2025-08-11T18:53:12.227Z"
}
