{
  "title": "OIC special envoy on Kashmir arrives on Monday",
  "link": "https://www.app.com.pk/national/oic-special-envoy-on-kashmir-arrives-on-monday/",
  "date_published": "2020-03-02T06:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP):Organization of Islamic Cooperation (OIC) Secretary General’s Special Envoy for Jammu and Kashmir, Ambassador Yousef M. Al Dobeay, is arriving here on Monday to visit Pakistan and Azad Jammu and Kashmir .\nHe will be leading a 6-member delegation during his stay from March 2 to 6.\nDuring the visit, the delegation will be briefed on the deteriorating human rights situation in the Indian Occupied Jammu and Kashmir (IOJ&K), Foreign office spokesperson in a press release said.\nThe special envoy and his accompanying delegation members will visit the Line of Control (LOC) to get first-hand knowledge about the loss of lives and property caused by indiscriminate firing of the Indian forces.\n“The special envoy’s visit is of particular significance in the backdrop of India’s unilateral and illegal actions of 5 August 2019 and the strong message on the Jammu and Kashmir dispute contained in the Resolutions and Communiques of the OIC Council of Foreign Ministers (CFM) and Summit meetings,” it added.\nThe Kashmiris and the people of Pakistan value OIC’s role in espousing the cause of Jammu and Kashmir at the international level.\nThe OIC has extended its steadfast support to the Kashmiri people in their just struggle for the inalienable right to self-determination. The Organization has a dedicated Contact Group on Jammu and Kashmir since 1994.\nSince 5 August 2019, the OIC has remained actively seized of the deteriorating situation in IOJ&K.\nThe OIC and its human rights body, Independent Permanent Human Rights Commission (IPHRC), have issued several statements condemning India’s actions and reiterating their principled position on the Jammu and Kashmir dispute. The OIC Contact Group on Jammu and Kashmir has met twice since 5 August 2019.\nThe Communique issued by the Contact Group’s meeting in New York at the Ministerial level reflected OIC’s strong commitment to the Kashmir cause. Under its Standing Mechanism to monitor human rights situation in IOJ&K, the IPHRC also held an unprecedented ‘Open Discussion’ on the worsening situation in IOJ&K in November 2019.",
  "retrievedAt": "2025-08-11T18:53:15.293Z"
}
