{
  "title": "Pakistan to mark World Wildlife Day for sustaining all life on earth",
  "link": "https://www.app.com.pk/national/pakistan-to-mark-world-wildlife-day-for-sustaining-all-life-on-earth/",
  "date_published": "2020-03-02T05:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP):Pakistan on Tuesday would mark World Wildlife Day like rest parts of the world with this year’s theme of sustaining all life on earth.\nA ministry of Climate Change (MoCC) official told APP that the country had last year launched its first-ever Red List of the wildlife species on the verge of extinction across the country.\nThe country, he said had lacked such credible data in the past that was the main hurdle to ascertain the status of dwindling wildlife and its habitats. The data would be compiled with the cooperation of internationally recognized wildlife conservation organizations, he added.\nThe incumbent government was earnestly working on ecological conservation as the recently launched 10 Billion Tree Tsunami programme had special wildlife component that would focus on developing wildlife sanctuaries. “This would not only help conserve wildlife rather will generate green jobs for youth and local population of the region,” he added.\nHe noted that the Red List data was a unique and all-inclusive catalog of wildlife plants, animals and species that would help provide guiding information for successful wildlife preservation and conservation initiatives.\nThis time, he said over 50 experts comprising researchers, academia, field officers and students were involved in the data collection whereas the team members had been properly trained on modern practices and trends in wildlife data sampling and analyzing.\n“The team members, included International Union for Conservation of Nature-Pakistan (IUCN-Pakistan), World Wide Fund for Nature-Pakistan (WWF-P), Zoological Survey of Pakistan, Wildlife Conservation Society Pakistan, had been engaged for the data collection,” he added.\nThe official website of World Wildlife Day mentioned that this year the day would be celebrated with the theme of “Sustaining all life on Earth”, encompassing all wild animal and plant species as key components of the world’s biodiversity. This aligns with UN Sustainable Development Goals 1, 12, 14 and 15, and their wide-ranging commitments on alleviating poverty, ensuring sustainable use of resources, and on conserving life both on land and below water to halt biodiversity loss.\nOn 20 December 2013, at its 68th session, the United Nations General Assembly (UNGA) proclaimed 3 March – the day of signature of the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES) in 1973 – as UN World Wildlife Day to celebrate and raise awareness of the world’s wild animals and plants, it added.",
  "retrievedAt": "2025-08-11T18:53:17.767Z"
}
