{
  "title": "PBM provides free accommodation to 5,500 orphan children",
  "link": "https://www.app.com.pk/national/pbm-provides-free-accommodation-to-5500-orphan-children/",
  "date_published": "2020-03-02T04:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP):Pakistan Bait-ul-Mal (PBM) is providing free accommodation facility to over 5,500 orphan children in its 55 Dar-ul-Ehsas Centres working across the country.\nAccording to document, Over 100 children are being provided accommodation facility in each Dar ul Ehsas Centre. The incumbent PTI government has enhanced the number of Dar-ul-Ehsas Centres from 36 to 55 during its tenure. The plan is to enhance the number of Dar-ul-Ehsas Centres to 80 by June 2020.\nLikewise,PBM is planning to establish 50 more Women Empowerment Centres (WECs) by June 2020. These centres imparted vocational training among 204,142 women during 2019.\nA total of 204,142 poor women were imparted vocational training besides paying education stipends to 47,000 students during last year.\nHe said PBM was running 157 Women Empowerment Centres (WECs). The women of poor families were being imparted vocational training in these centres.\nThe women trainees were being paid Rs 50 daily allowance.  The trainees having workable business plan of Rs 25,000 to Rs 100,000 would be provided personal loans in collaboration with Pakistan Poverty Alleviation Fund.\nThe loan will be returnable in the time span of 18 months first six months as grace period.\nAs many as 19,888 trainees are currently getting training from these schools. WECs plans to impart technical training among 200,000 deserving women in the next four years.\nCurrently, the WECs are imparting 16 different trades including drafting, cutting, sewing, designing, interior decoration, beautician, cooking, tie and dye, glass painting, computer and current Microsoft office applications to deserving women.\nA total of 64 WECs are working in Punjab, 30 in Sindh,32 in Khyber Pakhtunkhwa, 18 in Balochistan and 11 centres are operational in Islamabad , Azad Jammu and Kashmir and Gilgit-Baltistan. Low-income group of women/girls were trained in two shifts.",
  "retrievedAt": "2025-08-11T18:53:08.484Z"
}
