{
  "title": "Pakistan famous hub of Buddhist heritage",
  "link": "https://www.app.com.pk/national/pakistan-famous-hub-of-buddhist-heritage/",
  "date_published": "2020-03-02T03:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP):Pakistan is among the ancient regions of Asian continent who have served as the nurturing cradle for Buddhism where the great Siddhartha Gautama—-the Buddha laid the foundation of the religion that preached the path of spiritual awakening for insight to reveal the reality of nature.\nPakistan is also one of the famous hub of Buddhist heritage and artifacts in the world.  Buddhist art and craft though during insurgency in Afghanistan and Pakistan faced destruction yet many of the key historical sites were intact.\nPakistan being an Islamic state has preserved cultural heritage and historical monuments of all other religions and faiths.\nThe Buddha Stupas and mounds have rich heritage that makes it  an important pilgrimage site for the followers of Buddhism around the world.\nThere are numerous religious sites of Buddhist heritage and artifacts scattered across Pakistan. The restoration and  conservation of heritage sites along with religious tolerance is key to rebuild the confidence of pilgrims and religious tourists especially minorities.\nHowever, the incumbent government is making all out efforts to preserve and maintain the religious places of minorities with interfaith harmony that would help to ensure fundamental rights of minorities in the country.\nAn official  of DOAM (Department of archeology and Museum) Abdul Ghafoor told APP that  vallies of Taxila  Peshawar   and Swat  were the main center of inspiration  of Buddhist art and craft.\nBuddhist heritage in Taxila valley was expanded up o ten square km. Dozens of Budhist Stupa, monastic complexes dating since 3 cent. BC to 6th cent. AC are fully adorned with the variety of Buddha and Bodhisattvas  sculptures, relics caskets etc. These sculptures were made of schist stone, stucco,terracotta,  bronze, silver and gold, he added.\nRare mural painting of Jinan Wahid dheri, the largest statute of dying Budda from Bhamala Stupa, red sand stone sculpture from Badal pir were rare collection on Buddhist world, he said adding, Buddhist finds specially stucco sculptures were world’s  famous collection recovered from Taxila by Sir John Marshall DG archaeological survey of India during his large scale excavations in 1903 to 1928.\nHe wrote detailed volume of books about Taxila and Gandhara. He went on saying that artifacts discovered from Taxila were significant for their Hellenistic features. Scythian, Parthian, Kushan dominance was quite visible and distinguishable\nmaking them novel in the world.\nSculpture of Fasting Siddhartha so called Buddha discovered from Sikri Mardan was one of the most recognized stone sculptures through out the world.\nThatkh- e- Bhai, sari balol world heritage sites are an other center of Buddhist collection in Peshawar valley,during the last about four years, Bamala in Khyber Pukhtoonkhwah has emerged as a major Buddhist heritage site after the remains of\na 1700 years old sleeping Buddha statue were discovered there.\nSwat valley is another major hub of Buddhist art that remained active till tenth century. From here Buddhist art penetrated to China, Korea and Japan. Buddhist\nart of stone sculpting spread from Swat to the other parts of Buddhist centers in Pakistan.\nFeatures of Buddhist art in Swat are different and indigenous  Swat Valley has many Buddhist carvings and stupas, and Jehanabad contains a Seated Buddha statue.\nSilk route was one of the main life line of Buddhist activities which disconnected after fifth century and caused disintegration of Buddhist center in this region when white Huns with the help of Brahmin cast devastated Buddhist centers and changed them in Gupta art and Hindu crafts.\nThe Pakistan Government was paying special attention to promotion of tourism and has taken number of steps including easting visa restrictions for the tourists as well as foreign investors for boosting tourism as well as exports , he concluded.",
  "retrievedAt": "2025-08-11T18:53:07.803Z"
}
