{
  "title": "Ummah stands united for Kashmir, Palestine: AJK President.",
  "link": "https://www.app.com.pk/national/ummah-stands-united-for-kashmir-palestine-ajk-president/",
  "date_published": "2020-03-02T04:41:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 02 (APP):Azad Jammu Kashmir President Sardar Masood Khan on Monday said that Kashmiri brothers and sisters were facing Indian repression these days which never seen before.\nThey, he said, were imprisoned in their homes and were being made to live without any basic amenities.\nHe said “We, as an Ummah, must be unified in our stance and position when it comes to both the Kashmir and Palestine issue.”\nThe president made these remarks while interacting with a delegation of Islamic scholars, led by Tahir Ashrafi, Chairman Pakistan Ulema Council in the federal capital, said a statement released to media by AJK Presidential secretariat.\nThe AJK president, it continued, appreciated the positive role played by the Chairman Pakistan Ulema Council in helping to highlight the various issues faced by the Muslim Ummah.\nHe also appreciated the Council for organising seminal conferences and rallies on pertinent issues including Kashmir and Palestine.\nThe president said that as followers of Islam, the Muslims must be proud and never be apologetic of the identity.\nHe said Islam was a religion of peace and it was pertinent that as Muslims, they spread the true message of religion and fight Islamophobia and other issues facing the ummah.\nSpeaking on the current situation in Indian Occupied Jammu and Kashmir (IOJK) , the president said that the people of IOJK were going through the darkest hour in their history as they were being tortured and the youth were being rounded up and sent to so-called, “de-radicalisation camps”.\nKashmiri women were the most traumatized segment on the world, as they were facing rape, molestation and harassment on a daily basis in the occupied valley.\n“The exact number of rape and molestation cases cannot be ascertained. Their bodies are being objectified by the Indian occupation forces and they are treated as spoils of war”, he said.\nPresident Masood Khan praised the role of Muslim scholars in Pakistan for unifying the nation.\nHe added that the enemies of the Muslim Ummah wanted to create irreparable rifts in our ranks.\n“We must stand united and face this threat in a unified and dignified manner”, he asserted.\nSardar Masood said that the Muslims living in India and IOJK were facing a very real threat to their existence.\nMuslims were being lynched, burnt alive, their properties destroyed and the sanctity of Mosques in major cities of India were being violated by Hindu zealots fuelled by the extremist and fascist Hindutva ideology advocated by the BJP-RSS led Indian government, he added.\nChairman Pakistan Ulema Council Tahir Ashrafi said that the disputes of Kashmir and Palestine were not regional issues rather they were issues that the whole Muslim Ummah stood united upon.\nHe also invited the president – as Chief Guest – to the special session of the annual “Paigham e Pakistan” conference. He informed that this major event would be attended by leading theologists, Scholars, academics and researchers from over 12 Muslim countries.",
  "retrievedAt": "2025-08-11T18:53:20.360Z"
}
