{
  "title": "Firdous seeks religious scholars help in tacking fake news phenomenon",
  "link": "https://www.app.com.pk/national/firdous-seeks-religious-scholars-help-in-tacking-fake-news-phenomenon/",
  "date_published": "2020-03-02T06:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP):Special Assistant to the Prime Minister Dr Firdous Ashiq Awan on Monday sought the help of religious scholars in discouraging fake news and promoting journalism, based on Islamic principles of accuracy and verification.\nAddressing a function in connection with role of religious scholars in reformation\nof the society, she said that fake and baseless news caused destruction of various\nsocieties.\nThe government, she said kept the interest of the State far superior than its own\ninterests. National interest was linked with national narrative which needed to be\npromoted and protected by all stakeholders including media, she added.\nShe said that there was a need to discourage fake news in larger national interest.\nThe SAPM said current age was the era of mass media and information technology and\nnow wars were fought and won through media offensives instead of conventional armies.\nShe said that the present government under the leadership of Prime Minister Imran Khan\nfully believed in the freedom of expression and empowering the media as an important pillar of the state and engaging it as a partner in journey towards prosperity.\nShe said that social media was a tool which could be used for promotion of national narrative but at the same time it could also be used for disrupting socio-economic values of the society.\nShe said that the news channels get advertisements on the basis of their ratings and for this purpose, some indulged in sensationalization of issues.\nStating that media industry witnessed great growth in the country, she said profit was right\nof every business owner but that has to be done by following rules and regulations.\nShe said out of total volume of advertisements, the public sector share was only 15 per cent but when an employee of the media house was sacked the government was held responsible for this act of the management of any media house by stopping its advertisements which was totally a wrong notion.",
  "retrievedAt": "2025-08-11T18:53:12.595Z"
}
