{
  "title": "Int’l conference on Cyber Warfare & Security on Nov 23",
  "link": "https://www.app.com.pk/national/intl-conference-on-cyber-warfare-security-on-nov-23/",
  "date_published": "2021-11-22T08:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): The National Centre for Cyber Security (NCCS) at Air University Islamabad in technical co-sponsorship and joint collaboration with is organizing a two-day international conference titled&nbsp;’International Conference on Cyber Warfare & Security’ (ICCWS) from November 23- 24.\nAccording to details, Air University leads the academia by establishing Pakistan’s first dedicated academic department of Cyber Security from BS to PhD programmes and housing the secretariat of National Centre of Cyber Security.\nWith a vision to be recognized as a leading Cyber security Academic Institution in the world, Air University will be achieving yet another milestone during ICCWS 2021 by inaugurating The National Cyber Security Academy.\nThe NCSA will be a world class institution which will create experts in Cryptology, Network Security, Hardware Security, Digital Forensics and Software Security supported by hi tech Labs, and a national cyber range.\nThe 2nd annual ICCWS conference will provide an opportunity to learn, share and demonstrate ideas, strategies, and policies pertaining to cyber security. Researchers will present their original technical papers covering various domains of cyber security.\nConference content will also be submitted for inclusion into IEEE Xplore® as well as other Abstracting and Indexing (A&I) databases.\nThe two day conference will feature keynotes, technical talks, paper presentations, industry exhibits and panel discussions. It will also include technical workshops on different topics of cyber security.\nIn all, ICCWS will provide a networking platform to prominent national and international cyber security experts together with the stakeholders from the government, industry as well as from academia.\nSeveral researchers and practitioners working in cyber security and related domains are invited to share their research ideas and experiences related to the state-of-the-art and emerging areas of cyber security.\nICCWS-2021 will also include high-quality and focused technical programs on cyber security with keynote talks from prominent industry and academia experts.",
  "retrievedAt": "2025-08-11T21:38:40.423Z"
}
