{
  "title": "8171 msg service opens for Ehsaas Rashan Registration: Sania",
  "link": "https://www.app.com.pk/national/8171-msg-service-opens-for-ehsaas-rashan-registration-sania/",
  "date_published": "2021-11-22T14:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP):Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar Monday said that 8171 SMS service has been opened to facilitate the enrollment of deserving families with limited or no access to the internet.\n“Ehsaas has opened 8171 service for enrollment of families under Ehsaas Rashan Riayat for easing our the registration process after assessment through our recent field visits to 24 small cities”, she said. Under the Ehsaas Rashan Registration Drive ongoing these days, Senator Dr. Sania Nishtar, SAPM along with Ehsaas and National Bank of Pakistan teams went to 24 small cities and towns around Rawalpindi, Jhelum, Attock, Chakwal,\nMianwali, Nowshera, Peshawar and Dera Ismail Khan to educate local Kiryana shopkeepers, trader associations, district administrations, local media and public on Ehsaas Rashan programme and to get their feedback as well. Families earning less than Rs. 50,000 a month can register themselves under the Rashan programme of Ehsaas.\nOnly one member of an applicant family whose cell number is issued on his personal Computerised National Identity Card (CNIC) can enroll his family either through 8171 SMS service or the web-portal. For registration through 8171, the said member of a family can SMS his/her CNIC number to 8171.  While Kiryana shopkeepers will only be able to register through the web-portal: https://ehsaasrashan.pass.gov.pk/.\nFederal Cabinet has also approved the criteria that deserving families of foreign travelers and government employees with salaries less than Rs. 31,500 can also benefit from Ehsaas Rashan Riayat.  A monthly subsidy of Rs. 1,000 will be granted to every eligible family on the purchase of flour, cooking oil or ghee and pulses.\nA subsidy of Rs. 22 per kg will be given on the flour, Rs. 55 per kg on pulses and Rs. 105 per liter/kg on cooking oil or ghee at the designated Kiryana shops. It is mandatory for both the buyer families and Kiryana shopkeepers to have mobile SIMs issued on their own CNICs to register for this programme.\nAlso, Kiryana shopkeepers need to have their bank accounts with the National Bank of Pakistan. The designated Kiryana shopkeepers will download ‘mobile Point of Sale’ (mPOS) App in their cell phones through which they will be able to deliver the subsidy to eligible buyers.\nThe government will give a subsidy amount and a 5-8% commission to Kiryana shopkeepers directly in the bank accounts. This is to encourage them to move from cash-based transactions to electronic dealings, open their bank accounts, and install internet-enabled devices.  Lucky draws will also be held every quarter through which prizes like mobile phones, motorcycles or cash prizes would be given to grocery store owners.",
  "retrievedAt": "2025-08-11T21:38:37.139Z"
}
