{
  "title": "Abhinandan gets “fake gallantry” award in India for a “fantastic tea” in Pakistan",
  "link": "https://www.app.com.pk/national/abhinandan-gets-fake-gallantry-award-in-india-for-a-fantastic-tea-in-pakistan/",
  "date_published": "2021-11-22T15:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): The humiliation of shooting down of an Indian intruding aircraft inside Pakistan’s territory continues to haunt the Narendra Modi regime, prompting it to make yet another blunder; highest award to pilot for getting captured.\nThe pilot, who had sipped a “fantastic tea” in Pakistan after losing his aircraft, has been “honored” by the Indian government with a gallantry award, for allegedly shooting down Pakistan’s F-16 aircraft during the aerial battle. The pilot, instead, had been arrested by Pakistan Air Force after shooting his MiG21 aircraft on February 27, 2019 upon violating Pakistan’s airspace.\n“Wing Commander Varthaman Abhinandan then pursued a retreating enemy fighter bomber aircraft, and in the ensuing aerial combat, shot down an F-16 aircraft with his onboard missile,” according to the citation read out before Abhinandan was conferred award by Indian President Ram Nath Kovind.\nHowever, the conferment was questionable owing to the fact that the Indian claim of downing a Pakistan’s F-16 had been rubbished even by the US defence authorities who had counted Pakistan’s F-16s and found none missing.\n“India’s claim that one of its fighter pilots shot down a Pakistani F-16 fighter jet in an aerial battle between the two nuclear powers in February appears to be wrong… It is possible that in the heat of combat, Varthaman, flying a vintage MiG-21 Bison, got a lock on the Pakistani F-16, fired, and genuinely believed he scored a hit,” US-based Foreign Policy magazine reported on April 4, 2019.\nThe FP report was based on its conversation with two senior US defense officials who had direct knowledge of the situation and said that the US personnel recently counted Islamabad’s F-16s and found none missing.”\n“The count, conducted by U.S. authorities on the ground in Pakistan, sheds doubt on New Delhi’s version of events, suggesting that Indian authorities may have misled the international community about what happened that day,” FP report said.\nThe authorities in Pakistan also presented substantial evidences to refute Indian claims.\nThe Indian Air Force had on February 28 displayed pieces of the AMRAAM missile, fired by a Pakistani F-16, as evidence. But that, by itself, does not offer any clues on whether Abhinandan Varthaman had shot down a Pakistan Air Force F-16, as has been repeatedly claimed by the government and the IAF.\nMajor General Asif Ghafoor, who was the ISPR head at that time, revealed on Twitter that Pakistan had been in possession of the remains of all four missiles carried by the MiG-21 Bison which crashed in Pakistani territory after the Feb 27 dogfight.\n“All 4 missile seeker heads recovered intact from the wreckage & held. Pakistan and its professional Armed Forces staying humble by not drum beating. We have more truth on this to share,” he said on Twitter on April 5, 2019.\nIndia, has so far been unable to given any irrefutable evidences to counter Pakistan’s position.\nAmerican Political Scientist Christine Fair, otherwise a critique of Pakistan Army, said during a Literature Festival of Indian Army in Chandigarh: “I say this clearly with 100% certitude that there was no F-16 struck down. I do not believe you did. I believe that my bonafides as a critic of Pakistan stand for itself”\nThe Narendra Modi government opted to confer the military award to the pilot – just to play on the anti-Pakistan sentiments and cover up the embarrassment to India due to the loss of their aircraft and capture of their pilot.\nThe Vir Chakra to Abhinandan also took the security analysts with a surprise who took to Twitter to question the rationale of “celebrating the humiliation.”\n“Would like to congratulate the brave Abhinandan for taking down the F16 and then ejecting himself from the jet landing inside Pakistan to celebrate his victory over a tea. Bollywood has single handedly corrupted the entire Indian military establishment,” said Hussain Nadim, the Executive Director of Islamabad Policy Research Institute.\n“India continues to be living in a perpetual state of denial. Such a state cannot be more aptly described than the conferment of military award to Abhinandan whose aircraft MiG21 was shot down by Pakistan Air Force,” an analyst commented.\nAbhinandan as well as the political and military authorities of his country would have to live with a lie for the rest of their lives and defend their position at every single platform.\n“We were still kind enough to give Abhinandan a cup of “fantastic” tea and send him back! Get real this is not a Bollywood drama,” said MNA Naz Baloch on Twitter.\n“Is this for real? Award for drinking tea in Pakistani custody?” said Sherry Rehman, Chairperson Senate Foreign Affairs Committee on Twitter.\nJournalist Sana Jamal also questioned as why else would a pilot captured by Pakistan and beaten by mob after his jet was shot down by PAF would get an award?\n“India is probably the only country that rewards catastrophic failures, national humiliation and hate crimes,” she said.\nThe analysts also viewed that the conferment of award to Abhinandan was in fact tantamount to undermining the worth of the national award and making a mockery of those who actually fought for the nation.\nAccording to the Indian Air Force website, the Vir Chakra is conferred for “acts of gallantry in the presence of the enemy, whether on land or at sea or in the air.”\nAPP Digital Report by Ishtiaq Ahmed",
  "retrievedAt": "2025-08-11T21:38:36.268Z"
}
