{
  "title": "Envoys-designate of Japan, Norway, Poland, Cambodia present credentials to President Alvi",
  "link": "https://www.app.com.pk/national/envoys-designate-of-japan-norway-poland-cambodia-present-credentials-to-president-alvi/",
  "date_published": "2021-11-22T11:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): President Dr Arif Alvi on Monday said Pakistan offered business-friendly policies for foreign investors particularly in agriculture, information technology, telecommunication, energy, and tourism sectors.\nThe president expressed these views while talking to the ambassadors-designate of Japan, Norway, Poland, and the non-resident ambassador-designate of Cambodia, who separately called on him, at the Aiwan-e-Sadr.\nEarlier, the ambassadors-designate  Mitsuhiro Wada (Japan), Per Albert Ilsaas (Norway), Maciej Pisarski (Poland) and the non-resident ambassador-designate of the Cambodia Ung Sean presented their credentials to President Dr Arif Alvi at a ceremony.\nThe president congratulated the newly-appointed envoys and expressed the hope that they would play their role in further strengthening political, commercial, diplomatic and cultural relations with Pakistan.\nTalking to the ambassadors-designate separately, the President highlighted Pakistan’s desire to further expand bilateral trade and commercial cooperation with the friendly countries, saying that the mutual trade needed to be taken to its fullest potential.\nHe asked the ambassadors-designates to encourage the businesses of their respective countries to invest in Pakistan which is an attractive destination for investment.\nThe president apprised the envoys about Pakistan’s successful handling of the COVID-19 pandemic by introducing smart-lockdowns which led to the containment of the disease.\nHe also highlighted the need to provide humanitarian assistance to Afghanistan which had been a victim of war for over four decades.\nThe president expressed his best wishes for all the envoys for their new assignment in Pakistan and hoped that they would play their role to further cement bilateral relations during their tenures.",
  "retrievedAt": "2025-08-11T21:38:39.867Z"
}
