{
  "title": "PM approves Rs. 5 billion humanitarian assistance for Afghanistan",
  "link": "https://www.app.com.pk/national/pm-approves-rs-5-billion-humanitarian-assistance-for-afghanistan/",
  "date_published": "2021-11-22T14:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): Prime Minister Imran Khan on Monday ordered immediate shipment of in-kind humanitarian assistance worth Rs. 5 billion for Afghanistan including 50,000 MT of wheat, emergency medical supplies, winter shelters and other supplies.\nInstructing all the ministries to facilitate Afghans to the maximum, he also gave an in-principle approval for tariff and sales tax reduction on key Afghan exports to Pakistan.\nThe Prime Minister issued these order during his visit to the newly established Afghanistan Inter-Ministerial Coordination Cell (AICC) here where he chaired the first Apex Committee meeting of AICC.\nThe meeting was attended by Foreign Minister Makhdoom Shah Mahmood Qureshi, Advisor on Finance Shaukat Tarin, Chief of Army Staff General Qamar Javed Bajwa, National Security Adviser Dr. Moeed Yousaf and senior civil and military officers.\nThe Prime Minister ordered that the facility of free COVID vaccination for all Afghans entering Pakistan from land borders be continued. Pakistan has initiated free vaccination of Afghans since 13th November.\nHe also announced Pakistan’s decision to allow the 50,000 MT of wheat India has offered to provide Afghanistan as humanitarian assistance to go through Pakistan as soon as modalities are finalized with the Indian side.\nThe Prime Minister said that Pakistan will also facilitate the return of Afghan patients who had gone to India for medical treatment and were stuck there.\nWelcoming the Prime Minister, National Security Adviser Dr. Moeed Yusuf, who is also the Convener of AICC, made a detailed presentation to brief the civil and military leadership on the current economic situation in Afghanistan and the progress made by AICC in coordinating national efforts for humanitarian assistance and border facilitation for Afghans.\nThe Prime Minister appreciated the work of the AICC in coordinating Pakistan’s policy and expressed satisfaction at the improved border management protocols.\nHe ordered that capacity of border staff be further enhanced and instructed that no arbitrary closures of borders for trade should be allowed.\nThe Prime Minister also ordered that bus service between Peshawar and Jalalabad be revived to facilitate travelers on both sides.\nTo further facilitate Afghans, the visa duration will be relaxed in such a way that visas are granted within three weeks at the most.\nParticipants expressed concerns about the deteriorating humanitarian situation in Afghanistan and emphasized that Pakistan will not abandon Afghans in their time of need.\nThe Prime Minister took the opportunity to remind the international community of the collective responsibility to support Afghanistan to avoid a humanitarian crisis.\nHe highlighted that Afghans were one of the bravest nations of earth who can meet any adversity but that the world owed its support to ensure that they can live in a peaceful and stable environment after years of constant conflict.\nA senior delegation of Afghan health officials will visit Islamabad later this week to work out modalities for Pakistan’s support to Afghanistan’s health sector.\nMeanwhile, the Prime Minister instructed the National Security Adviser to visit Afghanistan to hold delegation level talks and agree on specific areas where immediate capacity building support shall be provided to Afghans.",
  "retrievedAt": "2025-08-11T21:38:38.634Z"
}
