{
  "article_id": "2025-01-01_eeb0ef110b8b68b5ce9bfd3d9c0f21a3",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882312",
    "retrieved_at": "2025-08-26T06:00:13.458Z"
  },
  "metadata": {
    "title": "Situationer: The 2024 polio counter is still ticking - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-01T01:59:03.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/010812075f7b048.jpg",
    "categories": [],
    "word_count": 893,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "- Despite end of calendar year, total tally will become clear well into January as collected samples are tested - Officials blame data forgery, use of vaccination drive as 'bargaining chip', security situation for resurgence PAKISTAN and Afghanistan are the only two countries in the world where the poliovirus is still endemic. A glimmer of hope to get out of this ignominious list emerged in 2021, when the country reported only one case of the crippling disease. The hope persisted through 2022 and 2023, with 20 and six cases, respectively. This sense of optimism even lasted through the first half of 2024, with only nine cases reported till July; before the sombering reality check - the virus not only returned, but has been resurgent. The tally from months since August has been seven, eight, 19, 13 and 12. Now, even though the calendar year has ended with the country reporting 68 cases, the count for 2024 will rise further, as samples collected this year continue being tested at the National Institute of Health (NIH). The final count for the outgoing year, therefore, is likely to come into view a few weeks into January. Resurgence and challenges Of the 68 cases that have surfaced so far, 27 were reported from Balochistan, 20 from Khyber Pakhtunkhwa, 19 from Sindh and one each from Punjab and Islamabad. In terms of districts, Dera Ismail Khan reported the highest number of cases, 10, followed by seven from Qila Abdullah. \"The cases for 2024 may continue to surface as the incubation period of the detection of the virus is three weeks after collection of the sample,\" an official of the National Insititute of Health said. The results of samples collected in the last two weeks of December are still pending. The major challenges to the eradication of poliovirus are vaccine refusals, data fudging and attacks on law enforcement personnel guarding vaccination teams, which prevent the development of 'herd immunity' against the disease. While talking to Dawn, Prime Minister's Focal Person for Polio Ayesha Raza Farooq said recent cases were increasing due to the immunity gap. Ms Farooq also pointed to data forgery as one of the reasons, as in many cases, children are marked on their fingers as being vaccinated, despite not being given the dose. \"We have taken the provinces on board and are trying to address the issue. We have increased the surveillance and revamped the communication strategy,\" she said. The virus not only became rampant in 2024, but it also expanded beyond high-risk areas. After the lone case in 2021, the country did not report any case for 15 months, the NIH officials told Dawn. \"The virus was limited to only a few districts of erstwhile Fata. Now, it has spread across the country, including three major blocks, i.e. Quetta, Karachi and Peshawar.\" Refusals The official said that parents now openly refuse vaccinations for their children and insist on marking their fingers without administering the drops. \"In a city like Islamabad, around 1,000 refusals were reported. Moreover, in a number of areas, communities link polio campaigns with their demands, such as provision of drinking water and roads,\" he said. The poor law and order situation, particularly in Balochistan and KP, was also hampering efforts to eradicate the virus as vaccine drives get delayed due to attacks on polio teams. According to the NIH official, vaccination campaigns should ideally start simultaneously in all provinces. However, these drives were postponed in some areas mostly due to law and order situation. Dr Nadeem Jan, an internationally acclaimed polio expert, said it was unfortunate that the government did not take ownership of the virus eradication programme as only two representatives from Pakistan were part of the international body dealing with the disease. He added that the Global Polio Eradication Initiative (GPEI) hub for Afghanistan and Pakistan is in Jordan, which should be shifted to Pakistan. \"The government should do the performance audit of the last 15 years of the polio programme to identify the weak areas and ensure accountability.\" Way forward According to Ms Farooq, the government has taken several steps to address data forgery and plug gaps in vaccination. The political leadership and law enforcement agencies were on board over the issue and information technology was being used to control the virus, she said. \"We have been focusing on low immunity union councils and on areas close to the Pakistan-Afghanistan border as in 2022, the virus entered Pakistan from the neighbouring countries.\" \"There are some areas, such as Kurram Agency, where it is quite difficult to hold polio campaigns, but we are trying our best,\" said Ms Farooq, who remained in the same post during the last government of PML-N. \"We have taken ownership of the programme and hope that the number of cases will reduce in 2025.\" According to Mr Jan, the government should integrate the polio eradication programme with the water, sanitation and hygiene (WASH), Expanded Program of Immunisation (EPI) and other divisions so that its acceptance could be increased. Dr Jan, who also served as health minister in the last caretaker setup, also said that attention should be paid to the issues faced by health workers responsible for administering the vaccines. He suggested career paths for vaccinators who fear that they will lose jobs if the poliovirus is fully eradicated. Published in Dawn, January 1st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}