{
  "article_id": "2025-01-01_811d8f03dcc86dfba988b7f00cfe845c",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882457/driver-kills-10-ramming-truck-into-new-orleans-crowd-in-new-year-attack",
    "retrieved_at": "2025-08-26T06:00:09.938Z"
  },
  "metadata": {
    "title": "Driver kills 10 ramming truck into New Orleans crowd in New Year attack - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-01T12:58:28.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/011951177d3ef97.jpg",
    "categories": [],
    "word_count": 623,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "A driver crashed his pickup truck into a New Orleans crowd celebrating New Year's Day and opened fire, killing at least 10 people and injuring more than 35, in an attack the FBI said it was investigating as an act of terrorism. \"This man was trying to run over as many people as he could,\" Police Chief Anne Kirkpatrick said at a televised press conference on Wednesday. \"He was hell-bent on creating the carnage and the damage that he did.\" The incident at 2:15pm PKT (9:15am GMT) occurred at the intersection of Canal and Bourbon Streets during New Year's celebrations, the city said in a statement. Bourbon Street is a historic tourist destination in the city's French Quarter, known for attracting large crowds with its music and bars. Kirkpatrick said the driver fired at police and struck two police officers from the vehicle after it crashed. The officers are in stable condition, she added. The driver died following the shootout with police, officials said. \"We know the perpetrator has been killed,\" said New Orleans City Councilman Oliver Thomas. \"As we search for a motive, remember there is no making sense of evil.\" There was no immediate word on the driver's identity. More than 300 officers were on duty at the time of the incident, police said. The city hosts the Sugar Bowl, a classic American college football game, each New Year's Day, and will also be the site of the NFL Super Bowl on February 9. New Orleans Mayor LaToya Cantrell called the incident a \"terrorist attack.\" Alethea Duncan, an assistant special agent in charge of the FBI's New Orleans field office, said: \"This is not a terrorist event.\" Later the FBI said in a statement that \"we are working with our partners to investigate this as an act of terrorism.\" Duncan said a suspected improvised explosive device was found and the FBI was working to determine if it was viable. A verified video taken by an onlooker shows at least two twisted bodies in the street, with one of them lying in what appears to be a puddle of blood. A bystander is seen kneeling over one of the bodies as a group of uniformed military personnel in green uniforms and carrying firearms runs past. President Joe Biden was briefed on the attack and the White House was in touch with the mayor to offer support, the White House said in a statement. A couple told CBS News that they heard crashing noises coming from down the street and then saw a white truck slam through a barricade \"at a high rate of speed\". \"A horrific act of violence took place on Bourbon Street earlier this morning,\" the governor of Louisiana, Jeff Landry, said on X, urging people to stay away from the area where the attack took place. The injured have been taken to at least five different hospitals, according to NOLA Ready, the city's emergency preparedness department. The incident occurred at the intersection of Canal and Bourbon Streets during New Year's Eve celebrations, the New York Times reported. A couple told CBS News that they heard crashing noises coming from down the street and they then saw a white truck slam through a barricade \"at a high rate of speed\". New Orleans has seen shootings and cars colliding with crowds at past parades. In November 2024, two people were killed and 10 others injured in two separate shootings along a New Orleans parade route and celebration attended by thousands, local media reported. In February 2017, a pickup truck driven by a man who police said appeared to be highly intoxicated ploughed into a crowd of spectators watching the main Mardi Gras parade in New Orleans, injuring more than 20 people.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}