{
  "article_id": "2025-01-01_9fe298aaf14e5d1f7eaf3978c0eb3262",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882446/trump-us-democracy",
    "retrieved_at": "2025-08-26T06:00:07.201Z"
  },
  "metadata": {
    "title": "Trump & US democracy - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-01T11:48:06.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/0313545019ed16a.jpg",
    "categories": [],
    "word_count": 758,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "IT is incredible that a man who had a stunning victory in November should arouse not just 'normal' criticism but incredible hatred. Donald Trump has admirers as well as denigrators who criticise him politely. In his book My Life, former US president Bill Clinton says Trump's claim that he had won the 2020 election produced \"a large angry crowd that he whipped into a frenzy\", even though \"judges across the country, including some appointed by him, had quickly found the charges baseless.\" And here is Niall Stokes, a seasoned journalist and commentator, who spares no adjectives and says it is hard to know where to start \"with a stupid, nasty, malevolent, greedy, lying, thieving, unethical, amoral, self-serving, corrupt, narcissistic, hypocritical, misogynistic, bullying, [...] rapist.\" Regretfully, Trump's own language is far from what it should be of an American president. During his election campaign Trump said his country was \"under siege\", US cities were being \"flooded with illegal aliens\" and Americans were being \"squeezed out of the labour force, and their jobs are taken.\" This authoritarian streak in him arouses doubts about his commitment to democracy. He is, for instance, a great admirer of Hungary's President Viktor Orban, who destroyed Hungary's democracy. Orban was rightly dubbed 'Trump before Trump' because the Hungarian president cracked down on universities to pre-empt liberal ideas from 'polluting' the younger generation. Trump's Vice President-elect is J.D. Vance who says Orban is an inspiration, who \"we could learn from in the United States.\" After losing the presidential election in 2020 Trump declared that he wanted to overturn the election. He even called for the \"termination\" of the US constitution to reinstall him as president immediately. Trump also appealed to the American state of Georgia's secretary of state to find nearly 12,000 votes to reverse the presidential results. An essay in The New York Times, referring to Trump's behaviour after he lost the 2020 election, says never has any \"president who was voted out of office been accused of plotting to hold onto power in an elaborate scheme of deception and intimidation that would lead to violence in the halls of Congress.\" The paper then asks: \"Can a sitting president spread lies about an election and try to employ the authority of the government to overturn the will of the voters without consequence?\" The NYT quoted Jack Smith, a lawyer of repute, as saying Trump knowingly spread false allegations to \"create an intense national atmosphere of mistrust and anger and erode public faith in the administration of the election.\" The Times characterises Smith's case as one that charges Trump with \"one of the most sensational frauds\" in American history, one \"fuelled by lies\" and animated by the basest of motives, the thirst for power.\" There are four charges against him: one, seeking to defraud America by overturning the election result, two counts of obstructing 'voter certification' and one count of conspiracy to violate civil rights by overturning legitimate election results. As president he has the power to pardon himself on the federal charges, but no such option would be open to him if he were convicted at the state level in Georgia. While the US Supreme Court ruled that a president can't be prosecuted for \"official acts,\" according to Campaign Legal Centre, a nonpartisan legal organisation, presidents can still be held accountable for acts that are not within their official responsibilities. Even while talking about economic issues, Trump sounds threatening. He repeatedly spoke of deportations of what he calls 'aliens' without realising that deportations will do immense harm to the American economy. Experts point out grim figures if Trump's mass deportation plan is implemented - there are 11 million illegal immigrants, and 8.3m work as \"labourised\" people. One of the biggest losers will be the hospitality industry. This industry will lose one in 14 workers, including domestic hands. A total of 3.2m people will be deported. The president-elect makes no secret of his fondness for big money. For instance, Elon Musk, whose fortunes are estimated at over $400bn, attended Trump's rallies. No wonder Trump should announce his decision to give him a major role in his administration. Trump also seeks control over institutions like the Federal Reserve Board and the Federal Communications Commission. This prompts harsh Democratic reaction. Gavin Newsom, the Democratic governor of California, says Trump has \"all the power in the world, but we're not some small isolated state and we're not going to be navel-gazing either,\" adding: \"We're going to be firm and aggressive.\" The writer is Dawn's External Ombudsman and an author.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}