{
  "article_id": "2025-01-01_3be31b11c5e2934e0db03cb867f7781b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882297/battagram-swat-residents-hit-hard-by-long-power-cuts",
    "retrieved_at": "2025-08-26T06:00:15.789Z"
  },
  "metadata": {
    "title": "Battagram, Swat residents hit hard by long power cuts - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-01T02:00:05.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 664,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "BATTAGRAM: Electric loadshedding lasting up to 20 hours a day has left residents frustrated in Battagram district with traders, vendors and labourers associated with power-based businesses losing their livelihoods. The impact of loadshedding is not limited to businesses alone; it has also affected the daily lives of residents. Mohammad Saim Khan, who runs a small woodworks factory, expressed his concerns over the impact of loadshedding on his business. \"Prolonged power suspension has hit my business hard,\" he said. \"We make wooden doors, windows and furniture through heavy electric machines, but when there is no electric supply, the work stops.\" Khan added that his machines required powerful voltage supply, which cannot be provided through ordinary generators. People demand supply from Allai Khwar power station Dawood Khan, who runs an engineering workshop, also shared his experiences. \"Our businesses have suffered a lot due to the apathy of Peshawar Electric Supply Company officials,\" he said. \"We take orders from customers for steel, iron, and aluminum works, but we cannot meet the delivery timeline due to the power outages.\" Dawood added that customers were disappointed and were trying to avoid placing orders locally. Sameer Mohammad, who runs a photocopy shop, said he had to operate photocopier machines on generators, which increased the cost of the work done,\" he said. \"But people are not paying accordingly.\" Mohammad added that he had removed machine operators and was managing operations by himself to cut costs. Ghulam Ali, a trader, emphasised the impact of loadshedding on businesses and labourers. \"On one hand, businesses associated with power are badly affected, and on the other hand, labourers are losing their jobs,\" he said. \"When businesses are not performing, who will pay the labourers?\" The residents called on Pesco and the district administration officials to address the issue of loadshedding and provide a reliable power supply. Anwar Baig, general secretary of Jamaat-i-Islami, emphasised that their top priority was to put an end to the prolonged power outages and secure five megawatts of electricity from the Allai Khwar hydropower station, which has capacity of producing 121MW power and is connected to the national grid. Baig argued that it's the people's right to benefit from locally generated resources. He pointed out that despite having electricity generation in 29 village councils of Allai tehsil, not a single electric pole had been installed to supply power to the area. This, he believes, is a clear injustice to the people of the area, who are being denied the benefits of their own resources. Meanwhile, the residents of Swat on Tuesday expressed their frustration with unannounced and prolonged power outages, which have severely disrupted their lives and livelihoods. The unscheduled loadshedding has affected households and businesses alike, leaving the community grappling with mounting challenges. They said it was for the first time they experienced prolonged power cuts during winter. \"We cannot even complete our daily tasks like washing clothes, ironing, or cooking on time,\" said Aisha Bibi, a homemaker from Mingora. \"This loadshedding has made our lives so difficult, especially in winter when we need electricity for heating.\" The impact extends beyond homes, with local businesses taking a significant hit. Tailors, who depend on electricity for their sewing machines, are among those most affected. \"We are unable to complete our customers' orders on time,\" lamented Sajid Khan, a tailor in Mingora Bazaar. \"Frequent outages mean that our machines remain idle for hours, which damages our reputation and income.\" Similarly, owners of computer shops have raised concerns over the disruption to their operations. \"We can't provide basic services like printing, photocopying, or computer repairs,\" said Farhan Ali, who runs a small computer shop in Swat Market. \"Our customers leave dissatisfied, and it's becoming increasingly difficult to sustain our businesses.\" Residents have urged authorities to address the issue promptly and ensure scheduled loadshedding with prior announcements. \"We understand the energy crisis, but at least we should be informed about the timings,\" said Khalid Mehmood, a local trader. Published in Dawn, January 1st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}