{
  "article_id": "2025-01-01_23ff5f8e9dbbf6457fd028e7cc441a7b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882376/govt-adb-sign-200m-loan-for-power-sector",
    "retrieved_at": "2025-08-26T06:00:19.228Z"
  },
  "metadata": {
    "title": "Govt, ADB sign $200m loan for power sector - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-01T01:59:23.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 386,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: Pakistan and the Asian Development Bank (ADB) on Tuesday signed an agreement to provide $200 million support to the country's ailing power distribution system through network improvement. The ADB board of directors approved the loan on Dec 10 to initially support three power distribution companies of Lahore, Multan and Sukkur - Lesco, Mepco and Sepco - through advanced metering infrastructure, data management systems, and asset performance management system (APMS). The loan agreement was signed by the secretary of the Economic Affairs Division, Dr Kazim Niaz, and ADB's Country Director Asad Aleem on behalf of their sides. Speaking on the occasion, Mr Niaz called for timely and efficient utilisation of ADB's loan and urged all concerned, particularly power distribution companies (Discos), to ensure timely completion of the project to modernise the power distribution infrastructure in the country and improve the ability of Lesco, Mepco and Sepco to deliver reliable electricity. Funding to support ailing distribution system through network improvement The $200m loan for the Power Distribution Strengthening Project aims to upgrade and modernise distribution systems to meet the country's rapidly growing electricity demand. The project will focus on reducing significant energy losses during transit and enhancing the resilience of infrastructure against climate change and disaster-related risks. In its initial phase, the project will support the three major distribution companies, paving the way for more efficient and sustainable energy delivery across these regions. The project will fund the installation of at least 332,000 advanced metering infrastructure, along with data management and communication systems, and at least 15,800 online transformer performance monitoring systems. Furthermore, the voltage of four grid stations in Sepco will also be upgraded from 66 kilovolts to 132 kV, a critical enhancement that will mitigate losses across the transmission system and address growing electricity demand. In Lesco, at least 25 grid stations will be constructed and modernised with the provision of critical equipment. High-loss 11 kV feeder lines will be replaced with aerial bundled conductor cables, and feeder line configuration will be improved. These upgrades are expected to reduce losses, enhance revenue collection and provide distribution companies with real-time data on electricity consumption and grid performance. In the event of extreme weather, they can help identify and isolate faults quickly, reducing the time required for recovery and minimising outages. Published in Dawn, January 1st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}