{
  "title": "Doctor terms pink eye curable disease",
  "link": "https://www.app.com.pk/national/doctor-terms-pink-eye-curable-disease-2/",
  "date_published": "2023-09-27T08:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP):Adenoviral conjunctivitis, commonly known as pink eye, is a viral infection of the eye that often resolves on its own within one or two weeks without medication.\nTalking to APP here on Wednesday, Consultant Eye Surgeon at Al-Shifa Trust Eye Hospital Dr. Inam Ul Haq Khan said that the public need not panic about pink eye, as it is not a pandemic and occurs periodically throughout the year.\nHe said that in most cases, patients recover fully without any specific treatment as the immune system fights off the infection.\nElaborating on the early symptoms, Dr. Inam said that pink eye involves itching, watery discharge, redness, and pain in the affected eye.\nHe said that sometimes only one eye is infected initially, while the other eye later becomes involved as the virus spreads.\nHe explained that the viral infection can also cause systemic symptoms like cough, fever, diarrhea, and swollen lymph nodes in the neck or around the ears which reflects the body’s overall immune response.\nTo aid recovery, Dr. Inam recommended building up one’s natural immunity through proper nutrition including soup, boiled eggs, and adequate hydration. “Gentle eye rinsing with clean water and artificial tears can provide symptomatic relief, but home remedies should be avoided as they may worsen the condition”, he added.\nAntibiotic eye medications are often prescribed by the consultants, Dr. Inam said adding that such medicines do not treat the underlying virus directly but prevent secondary bacterial infections which can occur when the eye’s defenses are weakened by the virus.\nDr. Inam underlined that most cases of pink eye resolve within a few weeks without needing to see an ophthalmologist. However, he advised consulting an eye specialist promptly if vision becomes blurry or symptoms seem particularly severe.\nTo limit viral transmission, he recommended that those with pink eye should avoid close contact with people having weaker immunity like children and the elderly during the infectious period. He said that resting properly allows the body to mobilize its immune system.\nAnswering a question, Dr. Inam said that vaccines are not yet available for pink eye because the adenovirus has over 17 strains that mutate frequently. “This rapid genetic shifting prevents effective, long-lasting immunization however, public education and hygiene remain key to managing seasonal pink eye outbreaks’, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:51:13.441Z"
}
