{
  "title": "Naval Chief calls for recommitting to principles of maritime safety, marine conservation",
  "link": "https://www.app.com.pk/national/naval-chief-calls-for-recommitting-to-principles-of-maritime-safety-marine-conservation/",
  "date_published": "2023-09-27T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): Chief of the Naval Staff, Admiral Muhammad Amjad Khan Niazi, in his message on World Maritime Day, demanded the nation to recommit to the principles of maritime safety and marine conservation and reaffirm its solemn pledge to the maritime world that ‘our commitment goes on’, both in spirit and in action.\n“I look forward to a profound and cumulative response by all stakeholders,” the Naval Chief said.\nWorld Maritime Day, a significant reminder of maritime safety, security, and environmental conservation, is marked annually, urging nations to work together for sustainable maritime practices, a Pakistan Navy news release said.\nUnder the aegis of the International Maritime Organization (IMO), this year holds special significance as we commemorate the 50th anniversary of the International Convention for the Prevention of Pollution from Ships (MARPOL).\nAccordingly, this year’s theme ‘MARPOL at 50 – Our Commitment Goes On’ is intended to pay tribute to our efforts under IMO’s long history of protecting the environment from pollution through the impact of shipping via a robust regulatory framework and emphasis on its ongoing commitment to prevention of our oceans from pollution.\nMARPOL’s legacy stretches over five decades, symbolizing our collective efforts against marine pollution emphasizing the duty we all hold to protect the lifeblood of our planet.\nThe Naval Chief said, “As we reflect on the journey, the statistics remain alarming; marine pollution’s ripple effects on ecosystems, economies, and livelihoods of coastal communities urge us to take more concerted actions.\nPakistan Navy stands at the forefront to conserve the maritime environment. In alignment with MARPOL principles, we have instituted measures to curtail emissions, enhance energy efficiency and, in earnest, implement pollution prevention strategies. Our ongoing efforts against marine pollution bear testimony to our unwavering commitment.”\nOn this World Maritime Day, he said as we look back to our shared maritime heritage and achievements, let us also look ahead with determination, commitment, and resolve to align our national objectives with the ongoing global shift towards sustainable and green marine practices.\n“I urge all the stakeholders to embrace these evolving paradigms. Particularly, I reiterate Pakistan Navy’s resolve to ensure maritime safety and uphold environmental mandates,” he added.",
  "retrievedAt": "2025-08-11T09:50:32.819Z"
}
