{
  "title": "RTI laws crucial to promote transparency in govt: Information Commissioners",
  "link": "https://www.app.com.pk/national/rti-laws-crucial-to-promote-transparency-in-govt-information-commissioners-2/",
  "date_published": "2023-09-27T12:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP):Chief Information Commissioner of the Pakistan Information Commission (PIC) Ijaz Hassan Awan and both Information Commissioners Shoaib Ahmad Siddiqui and Huzaifa Rahman have underscored the pivotal significance of Right to Information (RTI) laws in fostering transparency within government institutions\nIn a media statement issued in relation to Universal Access to Information Day being observed on September 28, the commissioners emphasized that Article 19-A of the Constitution granted the fundamental right of access to information to all the citizens which was however subject to certain limitations.\nThey stated that this constitutional provision was the cornerstone of a democratic society, enabling citizens to stay informed and hold government bodies accountable for their actions.\nThey elaborated on the vital role of RTI laws in empowering citizens to actively participate in the democratic process.\nWhen citizens have access to information, they can make informed decisions, engage in constructive dialogue, and ultimately contribute to better governance and the right to vote, they added.\nThe commissioners emphasized that RTI laws were a tool to ensure that government institutions remained transparent, responsive, and accountable to the people they served.\nThey stressed that these laws provided a mechanism for citizens to obtain information and documents from public bodies, thereby reducing the opacity that could often surround government operations.\nThey reassured that the Pakistan Information Commission was committed to upholding the principles of transparency through access to information enshrined in the country’s Constitution.\nThe officials affirmed their dedication to assisting citizens in their pursuit of information and ensuring that public bodies adhere to the requirements of the RTI laws.",
  "retrievedAt": "2025-08-11T09:50:39.815Z"
}
