{
  "title": "PMD announces exit of monsoon; another rain spell with snowfall",
  "link": "https://www.app.com.pk/national/pmd-announces-exit-of-monsoon-another-rain-spell-with-snowfall/",
  "date_published": "2023-09-27T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): The official exit of monsoon season in Pakistan with another rain spell accompanied by snowfall in hilly areas from Thursday to Saturday announced by the Pakistan Meteorological Department (PMD) is a clear indication of the transition from the summer to winter season.\nThis rain spell, expected in the parts of Islamabad, Punjab, Khyber Pakhtunkhwa, Kashmir, and Gilgit Baltistan will further decrease the temperatures in the country compelling the citizens to bring out the woollies with the arrival of the winter season.\nA westerly wave is likely to enter upper parts on Thursday (evening or night) bringing rain-wind/thunderstorm (moderate to isolated heavy falls) is expected in Chitral, Dir, Swat, Shangla, Buner, Mansehra, Kohistan, Abbottabad, Kashmir, (Neelum valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur), Gilgit Baltistan (Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, Shigar) from September 28-30.\nSnowfall is also expected over the high mountains in upper Khyber Pakhtunkhwa, Kashmir and Gilgit-Baltistan during the period.\nRain-wind/thunderstorm with hailstorm (at isolated places) is also expected in Kohat, Peshawar, Mardan, Swabi, Nowshera, Haripur, Kurram, Waziristan, Bannu, Dera Ismail Khan, Murree, Galliyat, Islamabad, Rawalpindi, Attock, Chakwal, Jhelum, Mianwali, Sargodha, Khushab, Faisalabad, Toba Tek Singh, Jhang, Mandi Bahauddin, Hafizabad, Gujranwala, Gujrat, Sialkot, Narowal, Lahore, Kasur and Sheikhupura on September 28 (night) and 29.\nRain-dust thunderstorms are also expected in Zhob, Barkhan, Layyah, Bhakkar, Dera Ghazi Khan, Okara, Pakpattan, Sahiwal, Multan, Bahawalpur and Bahawalnagar during the period.\nAbout the impact of the rain, the PMD has warned that wind thunderstorms may damage the loose structures like electric poles, solar panels, billboards etc.\nTemperatures are likely to drop significantly during and after the rain spell.\nThe farmers have been advised to manage their crop activities accordingly. Tourists and travelers are advised to remain cautious to avoid any untoward situation during the period.\nThe general public is advised to stay at safe places during windstorms/lightning/moderate/heavy rains.\nThe PMD has advised all concerned authorities to remain vigilant during the forecast period.",
  "retrievedAt": "2025-08-11T09:50:43.074Z"
}
