{
  "title": "ECP releases Preliminary Constituency Report and Form 5 list for public viewing",
  "link": "https://www.app.com.pk/national/ecp-releases-preliminary-constituency-report-and-form-5-list-for-public-viewing/",
  "date_published": "2023-09-27T15:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): The Election Commission of Pakistan (ECP) posted the initial constituency report and Form 5 list on its website, www.ecp.gov.pk, on Wednesday for public access.\nAccording to ECP spokesman, the website also provides access to the preliminary constituency maps. The publication of the preliminary constituencies will continue for 30 days, commencing on September 27 and concluding on October 26, 2023.\nVoters within the relevant constituency have the opportunity to submit objections (representations) regarding these initial delimitations to the Secretary of the Election Commission. These objections can be lodged at the Election Commission Secretariat, Shahra Dastur, Islamabad, until October 27, 2023.\nAfter assessing objections (representations) raised by relevant parties, the Election Commission of Pakistan (ECP) will render decisions from October 28 to November 26, 2023.\nIt is a requirement that the individual submitting objections must be a registered voter within the respective constituency.\nThe representation should be submitted to the Secretary of the Election Commission in the form of a memorandum.\nThe voter in question will personally sign the memorandum and deliver it to the ECP Secretariat, either on their own or through a designated representative.\nTo file representations, it is essential to provide (8) copies of the maps to the Election Commission. District maps can be obtained from the Election Commission by paying the appropriate fee.\nSubmissions made through methods such as courier, post, or fax will not meet the requirements. To ensure the acceptance of representations, they must be submitted as per Rule 12 of the Elections Rules 2017.\nThe Electoral Commission of Pakistan (ECP) has allocated a total of 266 seats for the National Assembly, 297 seats for the Punjab Assembly, 130 seats for the Sindh Assembly, 51 seats for the Balochistan Assembly, and 115 seats for the Khyber Pakhtunkhwa Assembly.\nNotably, the inaugural constituency for the National Assembly will be NA-1 Chitral, and the concluding one will be NA-266 Qila Abdullah and Chaman. Similarly, the first Punjab Assembly constituency is PP-1 Attock, and the final one is PP-297 Rajanpur.\nIn Sindh, the initial constituency is PS-1 Jacobabad, while the ultimate one is PS-130 Central Karachi. In Khyber Pakhtunkhwa, it commences with PK-1 Chitral and wraps up with PK-115 Dera Ismail Khan. As for Balochistan, the starting constituency is PB-1 Shirani Wajub, and the last is PB-51 Chaman.\nThe ECP’s report indicated that the final outcomes of the 7th digital census were officially released by the Pakistan Bureau of Statistics (PBS) on August 7. Subsequently, the ECP initiated the delimitation process in accordance with Section 17 of the Elections Act, 2017.\nRegarding this issue, five delimitation committees were established to draft proposals for the constituency delimitation of the assemblies. The report also detailed the ECP’s procedure for delimiting seats in the National and provincial assemblies.\nThe population of the province or area was divided by the total number of general seats, leading to the determination of the average population quota per National Assembly seat. Similarly, the population of a province was divided by the total number of general seats allotted to its provincial assembly to establish a quota per seat.\nIn the calculation of the total number of seats, any fraction equal to or greater than 0.5 was typically rounded up to one seat, while fractions below 0.5 were disregarded,” clarified the report. It further noted that, due to Balochistan’s unique circumstances, multiple districts have been combined to form a single seat. This practice has also been applied in other provinces when necessary.\n“The allocation for a district was established by dividing its population by the quota per seat of the National Assembly or, if applicable, the Provincial Assembly,” the report stated. Additionally, the report highlighted that Punjab has the largest number of seats in the National Assembly, followed by Sindh, Khyber Pakhtunkhwa, Balochistan, and Islamabad.\nBreaking it down, Punjab, with a population of 127.6 million, has been assigned 141 seats in which each constituency has been delimited with a quota of 905,595. Furthermore, the Punjab Assembly is allotted 297 seats, with each quota seat set at 429,929.\nIn Sindh, the distribution of 61 National Assembly seats for its 55.6 million population has been based on a quota of 913,052 per seat. In the case of the Sindh Assembly, the 130 seats have been apportioned with a quota of 428,432 per seat.\nRegarding Khyber Pakhtunkhwa, the census recorded a population of 40.8 million, leading to the allocation of 45 National Assembly seats.\nEach of these National Assembly seats has been delimited based on a quota of 907,913. In the context of the Khyber Pakhtunkhwa Assembly, the distribution comprises 115 seats with each seat determined by a quota of 355,270.\nIn Balochistan, a population of 14.8 million has resulted in the allocation of 16 National Assembly seats, with each constituency divided based on a quota of 930,900. For the provincial assembly, which comprises 51 seats, each seat has\nbeen delimited using a quota of 292,047.\nIn contrast, Islamabad, the federal capital with a population of 2.3 million, has been allocated 3 seats, with each seat’s quota determined at 787,954.\nLast week, the ECP announced that the general elections in Pakistan are scheduled for the final week of January 2024.\nThe election commission also determined that the ultimate list of constituencies would be released on November 30, following the review of objections and input regarding the delimitations.\nFollowing the conclusion of the 54-day election timeline, the elections will take place in the final week of January next year, as indicated in the ECP statement.",
  "retrievedAt": "2025-08-11T09:50:20.650Z"
}
