{
  "title": "Russia-Ukraine Conflict taking huge toll on food, energy: Speakers",
  "link": "https://www.app.com.pk/national/russia-ukraine-conflict-taking-huge-toll-on-food-energy-speakers/",
  "date_published": "2023-09-27T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): The Speakers at a webinar on Impacts of Russia-Ukraine War on food and energy Wednesday said the Russo-Ukrainian conflict is taking a huge toll on food and energy supplies, and is pushing the world at the brink.\nLikewise, the excessive reliance on supply chain from Ukraine, as it is the food basket of the world, is leading to rise in prices and inflation, apart from threatening the world’s peace and prosperity.\nThis emerged from a webinar on “Impact of the Russia-Ukraine Conflict on the Food and Energy Security of the Nations” organized by Islamabad Policy Research Institute (IPRI) and Ilko Kucheriv Democratic Initiatives Foundation (DIF), Ukraine, a news release said.\nThe Speakers said that the Russian invasion has weakened the supply chain drastically, and the same cannot be recovered until the war comes to an end. Ships with perishable products laden on them are stranded at more than 12 ports of Ukraine, and so is the case with impediments in supply of oil and gas to the region and beyond. They estimated that the total loss in the last 16 months is over $137 billion, and owing to Russian highhandedness, the Black Sea Grain Deal is in limbo.\nThey noted that 25 million tons of grain was shipped under the deal, before it got ruptured, and likewise Russian cruise missiles attacks on ports and energy projects have taken a definite toll, with natural gas prices rising to over 130% in Europe.\nThe session was presided over by Amb. Dr. Raza Muhammad, President, IPRI. Other speakers were Petro Burkovskyi, Executive Director, Ilko Kucheriv Democratic Initiatives Foundation (DIF); Maj. Gen. (R) Zahid Mubashir Sheikh, former ambassador of Pakistan to Ukraine; Ambassador Volodymyr Lakomov, former ambassador of Ukraine to Pakistan; Maj. Gen. (R) Wajahat Mufti, former ambassador of Pakistan to Ukraine; Dr. Mariia Bogonos, Head of the Center for Food and Land Use Research (KSE Agrocenter) Kyiv School of Economics; Dr Farah Naz, Assistant Professor, Department of Government and Public Policy, NUST; Dr. Olena Pavlenko, President and co-founder of the DiXi Group, Kyiv, and Dr. Ashfaque Hasan Khan, Principal of School of Social Sciences & Humanities.\nThe speakers noted that both the countries have a lot of potential to bilaterally interact in new spheres of developmental cooperation, and added that they have played a stabilizing role in the region.\n“The need is to keep in mind national interests and espouse a policy that is well-coordinated in an interdependent world,” Petro Burkovskyi observed. He said that one of the key observations of aggression is the undeniable fact that the European Union and NATO failed to see the real Russian aggressive designs.\nHe also noted that Pakistan and Ukraine must learn from this episode, and create new domestic energy and food markets. “It is not wise to count on a single alliance, as the response should be collective,” he remarked.\nMaj. Gen. (R) Zahid Mubashir Sheikh, former ambassador of Pakistan to Ukraine, praised the courage and resilience of the Ukrainian nation for standing fast against Russian aggression, as it was widely hoped that they will not be able to resist the onslaught.\nHe, however, regretted that bilateral ties between the two countries have been at their lowest ebb, and pointed out that during his tenure as ambassador no high-profile visit was materialised. He said mostly the cooperation was in the defence sphere, as Pakistan purchased Ukrainian tanks and hardware, and the volume of trade was less than $100 million.\nHe urged the need for expanding visa and commercial activities, and pointed out the debut visit of Ukrainian foreign minister to Pakistan in July 2023, as a step in the right index.\nAmb. Sheikh said that interdependence is the factor that drives relations in the new era, and Pakistan must take a fresh look at ties and buoy interaction.\n“Technologically both are advanced states. Pakistan is a nuclear power, whereas Ukraine is known for manufacturing quality military hardware. We need to complement and venture into manufacturing civilian and military aircraft, as well as automobiles,” he suggested.\nHe also pointed out that in the field of education, there is much room for cooperation. He noted that there were hardly 300 to 400 Pakistani students in Ukraine, whereas the Indian strength was over 12,000.\nAmbassador Volodymyr Lakomov, while elucidating the diplomatic trajectory of both the states, said that agriculture is a promising area and the cooperation could extend to new heights. He also showcased a postal stamp of Rs50 issued with initials of both the countries’ ancient heritage, and observed that this can add to be one more area of cooperation. The history between the two nations is not novel, rather the relations date back to 5000 B.C.\nHe narrated the ordeals faced by Ukrainians due to the ongoing conflict and how fast they have stood the trials of death and destruction. He said that Ukraine is ready to resume the full-fledged implementation of the Grain Deal, and blamed the closure of ports and embargo as a reason for the crisis in the supply chain.\nMaj. Gen. (retd) Wajahat Mufti, former ambassador to Ukraine, listed out four avenues in the supply chain: the producers; distributor and retailers, suppliers and consumers. He said that the invasion on February 24, had torpedoed the entire circumference of trade and commercial activities in the region.\nSpeakers also alluded to the crisis that started since 2014, in the wake of Orange Revolution and the domestic upheavals in Ukraine.\nAmbassador Mufti observed that to this day Ukraine’s joining of EU has not been completed, and the annexation of Crimea and the subsequent siege laid on Black Sea by Russia has disturbed the entire geopolitical situation.\nIt was noted that Ukraine was deprived 80% of its naval power outlets due to blockade, and it has devastated the supply chain; and seven million people are forced to migrate to regional countries.\nDr. Ashfaque explored the implications of the sanctions on Russia and dove deep into the statistics to unravel the dependency of the European nations, including Germany, Finland, Louisiana, Poland, France, and other nations on the Russian oil and gas resources. He speculated that the war will linger and will only cause casualties and destruction. There are no winners and losers in any war, therefore the clock is ticking and the states should be brought to the negotiating table.",
  "retrievedAt": "2025-08-11T09:50:39.885Z"
}
