{
  "title": "Govt  to offer interest-free loans for establishing  5,000 E-Working Centers: IT minister",
  "link": "https://www.app.com.pk/national/govt-to-offer-interest-free-loans-for-establishing-5000-e-working-centers-it-minister/",
  "date_published": "2023-09-27T13:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): Caretaker Federal Minister for Information Technology and Telecommunications Dr Umar Saif Wednesday said that the government would provide interest-free loans for establishing E-Working Centers to facilitate freelancers.\nDr. Saif, speaking to the media person said that each freelancer would receive financial assistance of Rs 100,000 to set up their E-Working Center, with the freelancer contributing the remaining funds if needed.\nThis initiative aimed to address the current challenge faced by approximately 1.5 million freelancers who lacked suitable workspaces.\nDr. Saif emphasized the potential economic impact of this move, estimating that each freelancer could earn between $25,000 to $30,000 annually, significantly contributing to the national economy.\nHe projected that these measures could increase IT sector exports by $3 billion.\nAdditionally, the government is working to facilitate access to loans and investments for IT startups, with expectations of attracting external investments totaling $1 billion within the next six months.\nIn addressing the skill gap within the IT workforce, Dr. Saif revealed that Pakistani universities currently produced 20,000 to 22,000 IT graduates, but only 2,000 to 2,200 of them secure employment.\nTo address this issue, the minister announced plans to mandate international-standard IT training for all university students across the country, potentially increasing the IT sector’s skilled workforce by over 200,000 and boosting IT exports to $5 billion.\nDr. Saif also proposed offering incentives to IT companies that repatriate funds from abroad, potentially bringing an additional $1 to $2 billion into the country.\nHighlighting Pakistan’s status as the seventh-largest mobile phone market with 190 million users, Dr. Saif outlined the government’s vision to promote local manufacturing of affordable, high-quality mobile phones.\nThis initiative aims to reduce reliance on imported phones, conserve foreign exchange, and create employment opportunities in the high-tech industry.\nDr. Saif shared plans for a National Roaming Policy, which would enhance mobile services by allowing telecom companies to share towers, ensuring better connectivity for consumers.\nIn an effort to enhance IT expertise, the National Vocational & Technical Training Commission (NAVTTC) is set to provide training to approximately 100,000 IT professionals.",
  "retrievedAt": "2025-08-11T09:50:27.607Z"
}
