{
  "title": "Judges opposing CJ Dogar’s transfer sidelined in committee reshuffling - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Five senior judges of Islamabad High Court (IHC), who challenged the transfer of the incumbent Chief Justice Sardar Mohammad Sarfraz Dogar from the Lahore High Court (LHC), have been sidelined in the recent reshuffling of key committees.\n\nThe IHC has constituted a new administrative committee, comprising four judges, in the light of amendments to the High Court Rules that have significantly reshaped the court’s internal power structure.\n\nAccording to a notification issued by the registrar’s office with the approval of the chief justice, the newly-formed committee will be headed by Justice Dogar himself, while Justice Arbab Mohammad Tahir, Justice Khadim Hussain Soomro and Justice Azam Khan will serve as members.\n\nThe formation of the new committee follows a major administrative reshuffle at the IHC which has notably curtailed the powers of senior puisne judge Justice Mohsin Akhtar Kayani. Previously considered one of the most influential judges in the court, Justice Kayani has been excluded from the administrative committee and the Departmental Promotion Committee (DPC), and has also lost his role as the inspection judge.\n\nPreviously considered one of most influential judges in court, Justice Mohsin Akhtar Kayani loses role as inspection judge\n\nSources said the new DPC would comprise Justice Soomro and Justice Azam Khan.\n\nThese developments come in the wake of amendments to Rule 237 and Rule 239 of Chapter 10 of the High Court Rules, which now grant the chief justice discretionary powers to appoint members of the administrative committee and define the duties of each administration judge.\n\nIt may be mentioned that Justice Babar Sattar along with four other judges has reportedly expressed serious concerns over the amendments in the rule, arguing that it undermines judicial seniority and due process.\n\nFive judges initially challenged the transfer and subsequent change in the senior list of the IHC before the then chief justice Aamer Farooq.\n\nFollowing dismissal of their representation, they approached the Supreme Court. However, the apex court also declined their request to reverse the seniority.\n\nThe Judicial Commission of Pakistan then approved the appointment of Justice Dogar as the chief justice of IHC.\n\nThe five judges, on the other hand, have filed an intra-court appeal against the SC’s constitutional bench decision of upholding the seniority of the IHC that raised Justice Dogar to the top.\n\nThe five judges have requested the Supreme Court not to consider justices Sardar Mohammad Sarfraz Dogar, Khadim Hussain Soomro and Mohammad Asif as judges of IHC until they take fresh oaths in accordance with Article 194.\n\nThe appeal contended that Section 3 of the Islamabad High Court Act 2010 only provides for the appointment of judges to the IHC from other provinces but makes no reference to transfers.\n\nThe appeal contended that the June 19 order impermissibly reads in “permanent” in Article 200(1) and (2) of the Constitution when no such language was contained in the provision.\n\nThe appeal pleaded that the constitutional bench had misunderstood the provisions of Article 200 by reading sub-article (1) in isolation from other provisions of the article by not holding that transfers envisioned in Article 200(1) were only for a temporary and time-specified period.\n\nPublished in Dawn, July 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:44:59.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925084/judges-opposing-cj-dogars-transfer-sidelined-in-committee-reshuffling",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T01:48:27.000Z"
}
