{
  "title": "Discos seek to refund 65 paise - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Amid a modest 2 per cent increase in power consumption in June compared to last year and over 72pc supply from cheaper indigenous sources, public sector distribution companies (Discos) have sought a refund of 65 paise per unit to consumers under the fuel cost adjustment (FCA) mechanism for electricity consumed during the month.\n\nIf approved, the ex-Wapda Distri­bu­tion Companies (Discos) would have to refund approximately Rs5.7 billion to consumers in their July bills, including previous adjustments of about Rs4.8bn.\n\nThe lower fuel cost has resulted from substantially higher costs allowed by the National Electric Power Regulatory Authority (Nepra) through a 20pc increase in the base tariff, effective July 1, 2024, which has now come to an end with the conclusion of FY25.\n\nNepra has scheduled a public hearing for July 30 to examine the request for an FCA refund to consumers.\n\nThe Central Power Purchasing Agency (CPPA), which filed the petition for a negative fuel cost adjustment for June, stated that power consumption was approximately 2pc higher than in the same month of last year and almost 7.6pc higher than in May.\n\nIt reported that electricity delivered to Discos stood at 13,310 gigawatt-hours (GWh) in June, compared to 12,367 GWh in May 2025 and 13,071 GWh in June last year.\n\nThe power companies have claimed in their petitions that the average fuel cost amounted to Rs7.68 per unit in June 2025 compared to Rs9.25 per unit in the same month last year. The reference fuel cost for the month stood at Rs8.33 per unit.\n\nThe CPPA stated that about 13,459 GWh of electricity was generated at an estimated fuel expenditure of Rs108.16bn (Rs7.87/unit) in June, of which 13,310 GWh was delivered to Discos for Rs102.22bn (at Rs7.68/unit).\n\nHydropower retained its top position with a healthy 39pc share in the overall grid compared to about 35pc share in the same month last year. The second-largest contribution to the national grid came from RLNG at 16pc followed by local coal, imported coal and nuclear power supply at almost 11pc, 10.16pc and 10pc, respectively.\n\nPublished in Dawn, July 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687af8ad1c001.jpg",
  "retrievedAt": "2025-08-17T20:45:44.061Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925149/discos-seek-to-refund-65-paise",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T01:47:58.000Z"
}
