{
  "title": "Trump says 5 jets were shot down in India-Pakistan conflict - Pakistan - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Friday that five jets were shot down during the recent India-Pakistan conflict that began after a deadly attack in India-occupied Kashmir’s Pahalgam, with the situation calming after a ceasefire in May.\n\nTrump, who made his remarks at a dinner with some Republican US lawmakers at the White House, did not specify which side’s jets he was referring to.\n\nPakistan had said it downed six Indian planes after the latter carried out deadly attacks in Punjab and Azad Kashmir, while New Delhi had claimed it had downed “a few planes”.\n\n“Something I’m very proud of [is that] we stopped a lot of wars. A lot of wars. And these were serious, serious wars; would have been going on,” Trump said.\n\n“You had India-Pakistan that was going, and in fact, planes were being shot out of the air. Five, five, four or five, but I think five jets were shot down actually,” Trump said while talking about the India-Pakistan hostilities, without elaborating or providing further detail.\n\n“It was getting worse and worse, wasn’t it? […] These are two serious nuclear countries and they were hitting each other. It seems like a new form of warfare; you saw it recently, when you looked at what we did in Iran when we knocked out their nuclear capability, totally knocked out,” he said, referring to the US strikes on Iran’s three nuclear sites.\n\nPakistan said it downed five Indian planes in air-to-air combat, later stating that figure as six. India’s highest-ranking general said in late May that India switched tactics after suffering losses in the air on the first day of hostilities and established an advantage before a ceasefire was announced three days later.\n\nAs New Delhi launched deadly air strikes on Pakistan in early May over allegations about the Pahalgam attack, which Islamabad denied, the Pakistan Air Force downed five Indian jets in retaliation. After tit-for-tat strikes on each other’s airbases, it took American intervention on May 10 for both sides to finally reach a ceasefire.\n\nWhile India claimed downing jets, Islamabad has denied any losses of planes and said it hit 26 Indian targets were hit after its three air bases were targeted.\n\nTrump has repeatedly said he prevented a “nuclear war” between Pakistan and India after Washington held talks with both sides, even crediting Chief of Army Staff Field Marshal Asim Munir for helping in it. India has differed with Trump’s claims that it resulted from his intervention and his threats to sever trade talks.\n\nMost recently, on July 7, the Trump administration doubled down on its narrative of Trump playing a central role in defusing tensions, despite India claiming otherwise.\n\nAsked about Indian officials’ repeated denials of Trump’s role, US State Department spokesperson Tammy Bruce avoided taking a position. “So many comments speak for themselves,” she said.\n\nPressed further, Bruce added, half in jest: “Everyone will have an opinion. That’s an opinion. Some opinions are wrong. Mine rarely are, but other people’s opinions can be wrong.”\n\nTrump’s statements stand in contrast to India’s official position, which maintains that New Delhi acted independently during the May crisis and that Washington did not mediate. Trump’s remarks support Pakistan’s view that quiet US diplomacy — and direct intervention from the White House — helped calm tensions.\n\nIndia’s position has been that New Delhi and Islamabad must resolve their problems directly and with no outside involvement.\n\nIndia is an increasingly important US partner in Washington’s effort to counter China’s influence in Asia, while Pakistan is a strong partner in counterterrorism.\n\nThe April attack in Pahalgam killed 26 men and sparked heavy fighting between the nuclear-armed Asian neighbours in the latest escalation of a decades-old rivalry.\n\nNew Delhi blamed the attack on Pakistan, which strongly denied responsibility while calling for a neutral investigation. Washington condemned the attack but did not directly blame Islamabad.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/19105400c1b2c26.jpg",
  "retrievedAt": "2025-08-17T20:44:17.630Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925193/trump-says-5-jets-were-shot-down-in-india-pakistan-conflict",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T05:49:25.000Z"
}
