{
  "title": "Women cricket team’s schedule for 2025-26 announced - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Pakistan women’s cricket team will play nine One-day Internationals and as many T20 Internationals on home and away basis, besides competing in the T20 and ODI World Cups during the 2025-26 activity calendar, the Pakistan Cricket Board announced on Friday.\n\nBefore participating in the 50-over ICC Women’s World Cup, Pakistan will play only one series of three matches against South Africa in Lahore from Sept 16 to 22.\n\nThe World Cup is scheduled to be held in India from Sept 30 to Nov 2 but Pakistan will play their matches of the global event in Sri Lanka under the hybrid model, according to which neither India nor Pakistan will visit each other’s venues due to political strains between the nuclear-armed neighbours.\n\nAfter the World Cup, Pakistan will play three ODIs against South Africa on their soil in February-March 2026 followed by a three-match series in Zimbabwe during April-May.\n\nOn the T20 front, Pakistan will first play a three-match series against Ireland in their backyard from Aug 6 to 10 this year. Pakistan will tour South Africa to play three matches in February-March 2026 before touring Zimbabwe for a three-match rubber in April-May.\n\nAfter ending the tour to Africa the national team will leave for Ireland in May-June to participate in a tri-series there also involving West Indies and the hosts.\n\nThe abovementioned tri-series will be followed by the ICC T20 World Cup which will be held in England from June 12.\n\nIn Pathways Cricket, Pakistan women’s U-19 squad will tour Bangladesh for a five-match T20 series in December this year. Prior to that, the National Women’s U-19 T20 Tournament will take place in Karachi from Sept 15 to Oct 6. The top performers of this\n\nEvent will feature in a three-week skills development camp followed by the pre-departure camp for the series in Bangladesh.\n\nIn the domestic section, the National Women’s One-Day Tournament will be held in Karachi from Nov 6 to 24. The four-team competition will be played on a double league basis, with international players expected to take part in the 15-match event.\n\nKarachi will also host the National Women’s T20 Tournament from March 24 to April 17 next year. The five-team competition will be played on a double league basis, comprising 23 fixtures.\n\nIn October this year, the Inter-University tournament is scheduled to take place with more details on the schedule and venues to be confirmed in due course.\n\nPublished in Dawn, July 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/18100520a3c5aec.jpg?r=100541",
  "retrievedAt": "2025-08-17T20:45:23.578Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925134/women-cricket-teams-schedule-for-2025-26-announced",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T01:48:04.000Z"
}
