{
  "title": "Revamping the ecosystem - Newspaper - DAWN.COM",
  "author": null,
  "content": "A RECENT advertisement seeking secretaries to the government from outside the existing pool is a commendable step. One hopes it marks the beginning of system-wide changes in our antiqua­ted administrative structure and processes. This experiment’s success will depend not only on the calibre of the newcomers but also on the way the supporting ecosystem evolves. To begin with, scre­ening, short-listing and interviewing should follow objective parameters — for instance, mat­ching ex­­p­erience with job requirements, a demonstrated record of adaptability and innovation, strong interpersonal skills and problem-solving abilities.\n\nThe risks in this pilot should be recognised. Those selected will either conform to existing pra­ctices and make only cosmetic changes to survive, while the more conscientious ones would quit, reinforcing the belief of proponents of the present system that outsiders are not fit for the job.\n\nWhat changes are needed to revamp the ecosystem? Those selected through this open, competitive process should enter into performance agreements with key performance indicators and be given the authority, resources and powers to discharge their duties while being held accountable for non-performance, nepotism, favouritism, corruption, etc. Every file from the secretary should not end up at the PM Office or CM Secretariat. A lack of trust in secretaries, second-guessing their judgement and looking for pliable or gullible individuals to toe the line undermines the dispensation of unbiased advice. Presently, those who don’t toe the line are shown the door. Thus merit and experience are disregarded. To prevent this, security of tenure should be guaranteed.\n\nThe main obstacle faced by newcomers are the 1973 Rules of Business — a colonial legacy not meant for a developing state. The first task is to revise these Rules as civil servants are bound to act in strict compliance with the processes and procedures embodied in this compendium. They are encouraged to maintain the status quo rather than to promote a dynamic and modern administrative structure. Too much emphasis on ritualistic compliance with procedures, rules and form has replaced concerns about the outcome for welfare and justice. Secretaries and heads of departments should be empowered to take decisions without multiple references, clearances, approvals and concurrences. Financial, administrative and procurement powers should be delegated in proportion to authority. The separation of functions and responsibilities across the Secretariat, the attached departments and autonomous bodies should be incorporated in the Rules to expedite the execution of policies and programmes. In the current weak system of audit and public procurement, compliance with outdated procedures rather than considerations for value for money, discourages principal accounting officers from pursuing effective low-cost solutions and risk-taking. Not taking decisions has become the norm\n\nWithout changes to the hierarchy, newcomers can’t introduce efficiency to governance.\n\nNewly recruited secretaries can’t work in isolation but at the apex of the entire chain of command. If changes are not made to the hierarchy, one can’t expect the new incumbents to introduce efficiency to the governance structure. Each division’s tiers should be reduced from six to three and the staff-officer ratio should be at 2:1 following the adoption of e-government.\n\nThe key to the high-quality performance of public sector institutions lies in attracting, retaining and motivating civil servants of high calibre and integrity throughout the system — at the entry, middle management and top levels. These can be accomplished by introducing a merit-based recr­ui­tment system, continuous training and skill upgradation, objective performance evaluation linked to promotions and increments, early retirement of non-performers, equal opportunity in career progression, adequate compensation, proper performance evaluation, financial accountability and result-oriented compliance.\n\nMonetising all perks and reducing the size of the Grades 1-16 staff can free up resources for paying higher cash compensation to mid-level and top managers and experts. A proposal to establish a ‘National Executive Service’ where all government officers, cadre, non-cadre and ex cadre, compete transparently after reaching Grade 19 to fill higher Secretariat positions with high pay scales, supplemented by laterally inducted technical experts, is already on the table. Success at the entry level examination at 24 years should not entitle one to reach the top without regard for performance and potential.\n\nPublic services, such as education, healthcare, potable water, sewage and waste disposal, and pu­­blic transportation, are best performed at the lo­­cal level; sadly, the lack of professional expertise hinders the capacity of elected local governments. Citizens are met by unqualified and rude clerical and junior officials. A reversal of roles is needed, whereby young and competent officers serve on the front lines of metropolitan corporations, municipal committees, district and tehsil councils. Assistant and deputy commissioners, assistant and superintendents of police and district executive officers of devolved departments should be legally empowered to resolve citizens’ issues.\n\nOne way to improve transparency and accountability, reduce transaction costs, provide convenience to citizens, minimise arbitrary discretionary powers, curb corruption and track performance and output is through digitalisation and e-government tools. Mandatory training in e-filing, messaging, document sharing, retrieval, reporting and archiving will smoothen the transition from a paper-based environment.\n\nAlong with e-government, another way to introduce a citizen-centric approach is by simplifying the rules and regulations, codifying and updating them and widely disseminating them through websites, data centres or information kiosks. Online access to government functionaries and e-filing for services can help enforce internal accountability, while allowing citizens to conduct hassle-free transactions. The establishment manual, accounting and audit rules, finance manuals and procurement rules should be revised to align with modern management practices. These manuals, after being updated, should be uploaded on to government websites to be easily accessible to all within and outside the government.\n\nIn sum, inducting professionals from outside government will work only if selection is open, competitive and based on merit, the Rules of Business are changed, the system-wide value chain from induction to severance is strengthened, hierarchical tiers are reduced, service delivery is entrusted to competent officers at the local level, e-government is practised and manuals and rules and procedures are aligned with modern management practices.\n\nThe writer was chairman, National Commission for Government Reforms (2006-2008), and adviser to the PM on institutional reforms (2018-2021).\n\nPublished in Dawn, July 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687b001c48e9c.jpg",
  "retrievedAt": "2025-08-17T20:44:22.346Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925175",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T02:20:05.000Z"
}
