{
  "title": "Moody’s upgrades Pakistan’s credit rating to Caa1 based on ‘improving external position’ - Business - DAWN.COM",
  "author": null,
  "content": "Global rating agency Moody’s on Wednesday upgraded Pakistan’s credit rating by one notch to Caa1 from Caa2, citing Islamabad’s improving external position, and changed its outlook from positive to stable.\n\nMoody’s Ratings is a credit rating system that evaluates the creditworthiness of borrowers, such as governments, corporations, or financial instruments. According to its website, the agency uses letter grades (Aaa, Aa, A, Baa, etc) to indicate the likelihood of timely repayment, with Aaa being the highest quality and C the lowest. These ratings help investors assess risk before lending or investing.\n\nWithin this scale, Caa1, Caa2, and Caa3 all fall into the “Caa” category, signalling very high credit risk and poor standing. Caa1 is the highest within this group (slightly less risky), Caa2 is one notch lower, and Caa3 is the last, meaning the greatest vulnerability to default among the three.\n\n“Moody’s Ratings (Moody’s) has today upgraded the Government of Pakistan’s local and foreign currency issuer and senior unsecured debt ratings to Caa1 from Caa2,” the international rating agency — one of the top three global rating firms — said in its statement today.\n\nIt cited Islamabad’s improving external position and changed the outlook to Pakistan’s rating to “stable” from positive.\n\nMoody’s rating outlooks fall into four categories: positive, negative, stable and developing. A stable outlook indicates a low likelihood of a rating change over the medium term, while the other three categories indicate a “higher likelihood” of a rating change.\n\n“We have also upgraded the rating for the senior unsecured [medium-term note] programme to (P)Caa1 from (P)Caa2,” it said.\n\n“The upgrade to Caa1 reflects Pakistan’s improving external position, supported by its progress in reform implementation under the [International Monetary Fund’s Extended Fund Facility (EFF) programme,” Moody’s highlighted.\n\n“The Caa1 rating also incorporates the country’s weak governance and high political uncertainty,” the agency noted.\n\n“Foreign exchange reserves are likely to continue to improve, although Pakistan will remain dependent on timely financing from official partners,” it forecasted.\n\nMoody’s went on to highlight that the “sovereign’s fiscal position is also strengthening from very weak levels, supported by an expanding tax base”. “Its debt affordability has improved, but remains one of the weakest among rated sovereigns,” it noted.\n\nExpanding upon the “stable” outlook, the agency said it reflected “balanced risks to Pakistan’s credit profile”.\n\n“On the upside, improvements in the debt service burden and external profile could be more rapid than we currently expect. On the downside, there remains risks of delays in reform implementation required to secure timely official financing, which would in turn weaken Pakistan’s external position again,” it noted.\n\n“The upgrade to Caa1 from Caa2 rating also applies to the backed foreign currency senior unsecured ratings for the Pakistan Global Sukuk Programme Co Ltd,” Moody’s said, adding that it also changed the outlook for the Sukuk programme to stable from positive.\n\n“We have also raised Pakistan’s local and foreign currency country ceilings to B2 and Caa1 from B3 and Caa2, respectively,” the agency added.\n\nIt noted that the two-notch gap between the local currency ceiling and sovereign rating was “driven by the government’s relatively large footprint in the economy, weak institutions, and high political and external vulnerability risk”.\n\nPrime Minister Shehbaz Sharif expressed satisfaction over the rating upgrade and appreciated his economic team’s efforts, the Associated Press of Pakistan reported.\n\nThe premier also welcomed the Moody’s “upgraded rating about improvement in the economic outlook for Pakistan from positive to stable”, the report quoted a press release from the PM Office as saying.\n\nPM Shehbaz reiterated that the government was committed to further improving the rating as it was reflective of the economic policies in the right direction.\n\nHailing the development, Adviser to Finance Minister Khurram Schehzad noted: “While challenges remain, this recognition reaffirms that Pakistan is on a clear path toward greater macroeconomic stability and resilience.\n\n“With Moody’s upgrade, all the three top global rating agencies have now upgraded Pakistan’s ratings with stable outlook,” he pointed out, referring to Fitch and S&P Global Ratings.\n\n“Pakistan’s external position has continued to strengthen over the past year,” Moody’s said, adding it expected further gradual improvements as progress in reform implementation under the IMF programme supports financing from bilateral and multilateral partners.\n\n“In turn, this contributes to continued increases in the sovereign’s foreign exchange reserves, albeit from still fragile levels,” it noted.\n\n“We expect Pakistan to fully meet its external debt obligations for the next few years, contingent on steady progress on reform implementation and timely completion of IMF reviews.”\n\n“Nonetheless, Pakistan’s external position remains fragile,” Moody’s cautioned.\n\n“Its foreign exchange reserves remain well below what is required to meet its external debt obligations, underscoring the importance of steady progress with the IMF programme to continually unlock financing,” it explained, estimating that Pakistan’s external financing needs were about $24-25bn in FY2026, and similar amounts again in FY2027.\n\nDetailing its rationale for the rating upgrade, Moody’s noted that Pakistan fully met its external debt obligations and added to its foreign exchange reserves in FY2025.\n\n“Reserves rose to $14.3 billion as of 25 July 2025, equivalent to about ten weeks of imports,” it said, comparing them to $9.4bn at the time of the last rating update in August 2024.\n\nThe agency also pointed out Pakistan’s successful completion of the IMF programme’s first review, unlocking a $1bn disbursement in May 2025, and a $1bn commercial loan in June 2025 by the Asian Development Bank (ADB).\n\nOutlining its rationale for the stable outlook rank, Moody’s observed that it reflected “balanced risks to Pakistan’s credit profile”.\n\nOn the upside, it said, a building track record of reforms and revenue-raising measures could unlock more financing, which in turn would further boost foreign exchange reserves and the external position.\n\n“On the downside, there remains risks of slippage in reform implementation or results, leading to delays in or withdrawing of financing support from official partners,” it warned, saying it could lead to renewed material deterioration in the sovereign’s external position.\n\n“The current government formed after the February 2024 elections faces a significant challenge to continually implement revenue-raising measures without triggering social tensions,” the agency underscored.\n\nPakistan’s fiscal position has improved from very weak levels, reflecting progress in implementing revenue-raising measures, Moody’s observed.\n\nCiting narrowing budget deficits and widening primary surpluses, the rating agency said the government debt affordability was “also improving, although it remains one of the weakest among our rated sovereigns”.\n\nNoting strengthened revenue collection, it said: “We expect the government to continue enhancing revenue administration and compliance, alongside the introduction of new tax measures.”\n\nNoting new taxes introduced on solar panels and e-commerce businesses in the recent budget, Moody’s estimated tax revenues to pick up by another 0.5 percentage points of GDP in FY2026. “However, a decline in SBP dividends will lead to an overall narrowing of government revenue to about 15-15.5 per cent of GDP,” it added.\n\n“We expect government expenditure to remain contained, even as budgeted defence spending has increased,” the agency stated, noting reduced subsidies to the power sector and debt servicing costs.\n\n“Overall, we expect the fiscal deficit to narrow further to 4.5-5pc of GDP in FY2026 (FY2025: 5.4pc),” the statement added.\n\nMoody’s also provided its assessment of Pakistan’s environmental, social and governance (ESG) credit impact scores (CISs), which communicate the impact of ESG considerations on the rating of an issuer or transaction.\n\nPakistan has a ‘CIS-5’ credit impact score, which means ESG considerations have a “pronounced impact on the current rating, which is lower than it would have been if ESG risks did not exist”.\n\nPakistan’s CIS-5 score “reflects its very high exposure to social and environmental risks, as well as its weak governance profile”, Moody’s statement said.\n\nIt then stated the country’s issuer profile scores (IPS) for the ESG categories, which are expressed on a scale of 1-5 points.\n\n“Pakistan’s E-5 issuer profile score for environmental risk reflects the country’s vulnerability to climate change and the limited supply of clean, fresh and safe water,” the agency pointed out.\n\n“Pakistan has an S-5 issuer profile score for social risk. Very low incomes as well as limited access to quality healthcare, basic services, housing and education, especially in rural areas, together with safety concerns, are important social issues,” it added.\n\n“Pakistan has a G-4 issuer profile score for governance risk. International surveys of various indicators of governance, while showing some early signs of improvement, continue to point to weak rule of law and control of corruption, as well as limited government effectiveness.”\n\nFinance Minister Muhammad Aurangzeb already urged Moody’s in July to improve Pakistan’s current Caa2 credit rating during a virtual engagement in July.\n\nSpeaking at an event in Islamabad earlier today, Aurangzeb pointed out that Fitch and S&P Global Ratings had already upgraded the country’s credit ratings this year and said he was hopeful of “the third agency” — an apparent reference to Moody’s — doing the same soon.\n\nPakistan has been postponing the launch of international bonds since July 2021 due to challenging macroeconomic conditions and resultant poor credit rating, and relying mostly on time deposits from friendly nations to meet external liabilities and stay afloat.\n\nThe agency had last upgraded Pakistan’s local and foreign currency issuer and senior unsecured debt ratings to Caa2 from Caa3 on Aug 28, 2024. It had also changed its outlook to positive from stable for improving macroeconomic conditions.\n\nIn late February 2024 — shortly after the general elections — Moody’s had retained Pakistan’s long-term credit rating at Caa3, noting that “political risks are high, following a highly controversial general election”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1316074318e6706.png",
  "retrievedAt": "2025-08-17T20:47:36.111Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930657/moodys-upgrades-pakistans-credit-rating-to-caa1-based-on-improving-external-position",
  "dateList": "2025-07-19",
  "date_published": "2025-08-13T10:38:14.000Z"
}
