{
  "title": "PSX stays flat despite current account surplus - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakis­tan Stock Exchange (PSX) experienced a volatile session on Friday, starting strong with a record-breaking rally before undergoing significant profit-taking in the latter half of the day.\n\nThis saw the benchmark KSE-100 index, which had surpassed the 140,500-point barrier during intraday trade, ultimately close with a slight loss.\n\nThe session was characterised by aggressive institutional buying and optimism about upcoming corporate earnings.\n\nAccording to Topline Securities, the KSE-100 index began on a positive note, reaching an intraday high of 1,920 points (1.38pc) due to strong local institutional buying.\n\nHowever, profit-taking set in during the second half of trading, as investors sought to book gains before the weekend.\n\nThe key contributors to the index’s positive movement included Fauji Ferti­liser, United Bank, Engro Holdings, Pakistan Ser­vices, Pakistan Aluminium Beverage Cans, and Engro Fertiliser. Together, these stocks contributed 1,052 points to the index. On the downside, Systems Ltd, Meezan Bank, Hub Power, National Bank of Pakistan, and Mari Energies lost value, dragging the index down by 345 points.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, noted that the PSX ended the week on a volatile note. The KSE-100 briefly crossed the 140,000-point mark before dipping to an intraday low of 138,344 points, down 322 points. However, the index managed to recover slightly, closing at 138,597 points, a loss of just 68 points or 0.05pc.\n\nA major highlight of the session was the announcement of a $2.1bn current account surplus for FY25 — the first annual surplus since FY03.\n\nThe surplus was driven by a combination of import compression, resilient exports, higher remittances, and effective external account management.Market participation declined, with total volume falling 21.86pc to 609.44 million shares, and traded value decreasing 20.89pc to Rs31.32 billion. Pakistan International Bulk Terminal led the volume chart, with 53.11 million shares traded.\n\nPublished in Dawn, July 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687af92e40cfc.jpg",
  "retrievedAt": "2025-08-17T20:45:42.269Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925152/psx-stays-flat-despite-current-account-surplus",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T01:47:58.000Z"
}
