{
  "title": "Senate passes bill to end death penalty for key offences - Pakistan - DAWN.COM",
  "author": null,
  "content": "• New amendment proposes life term for offences under PPC’s Sections 354-A and 402-C\n• Law introduced to meet EU’s GSP+ conditions requiring limitation of death penalty to the ‘most serious crimes’\n• PTI leader slams govt over ‘poor’ disaster response\n\nISLAMABAD: A bill seeking to abolish the death penalty for harbouring hijackers and for publicly stripping a woman of her clothes was among the four bills passed by the Senate amidst voices of dissent from both sides of the aisle.\n\nThe Criminal Laws Amendment Bill, aimed at aligning Pakistan’s laws with its international obligations under the GSP+ trade agreement with the European Union (EU), which requires limiting capital punishment to the most serious crimes, was moved in the House by Minister of State for Interior Talal Chaudhry.\n\nThe bill proposes the replacement of the death penalty under Sections 354-A and 402-C of the Pakistan Penal Code (PPC) with life imprisonment.\n\nCurrently, Section 354-A states: “Whoever assaults or uses criminal force against any woman, strips her of her clothes, and exposes her in public shall be punished with death or life imprisonment, along with a fine.”\n\nPTI’s parliamentary leader in the Senate Barrister Syed Ali Zafar remarked that the crime of stripping a woman in public is as serious as murder and stressed that death penalty for this offence should remain unchanged.\n\nSenator Muhammad Abdul Qadir questioned whether the death penalty for terrorism would be abolished.\n\nBalochistan Awami Party (BAP) lawmaker Samina Mumtaz Zehri observed that the laws concerning crimes against women should be made stricter, not lenient. She warned that easing punishments would embolden criminals. She pointed out that the conviction rate in such cases is already low due to weak prosecution, and emphasised the need for reforms in the police and judicial systems.\n\n“This is not right. This is not going to help the country or its people,” she said, opposing the amendment.\n\nLaw Minister Azam Nazeer Tarar, however, argued that harsh sentences did not necessarily deter crime. He cited the example of European countries where death penalty did not exist, yet the crime rate ws just 2pc.\n\nHe added that in Pakistan, the death penalty currently applied to over a hundred offences. He noted the punishment for stripping a woman in public was originally seven-year imprisonment, and was converted to capital punishment during the regime of Gen Zia in 1982.\n\nThe Senate also passed the Extra­dition (Amendment) Bill to address procedural delays in extradition requests, and the Pakistan Citizen­ship Act (Amendment) Bill, enabling Pakistani diaspora members to resume their Pakistani citizenship.\n\nPoor disaster response\n\nMeanwhile, the government came under fire in the Senate over what was described as a lack of preparedness that led to loss of lives and immense suffering during the recent rains.\n\nSpeaking on a point of public importance, PTI’s Barrister Ali Zafar said: “The loss of precious lives and the severe hardships faced by the people due to the recent rains are a clear indication of the government’s unacceptable negligence and incompetence.”\n\nHe stressed that this was not the first instance. Despite early warnings from the meteorological department about the monsoon’s arrival, government institutions were not prepared.\n\nHe noted: “Roads and neighbourhoods were flooded, people were forced to spend nights on rooftops, and the state machinery remained a silent spectator. This wasn’t just a natural disaster — it was a failure of governance.”\n\nHe raised critical question is there any effective system in place at the government level to deal with emergencies or not? The people go through the same ordeal every year, and the government makes the same old promises and explanations every year.\n\nHe urged the chair that the House should be told: “Where were the NDMA and the provincial institutions? where was the emergency plan? what steps were taken to improve the electricity, water and sanitation systems? Why was immediate assistance not provided to the victims?\n\nMr Zafar demanded a comprehensive report on the government’s response to the rains and called for the formation of a special parliamentary committee to investigate the matter and suggest reforms to prevent such negligence in the future.\n\nHe concluded: “It is not only the right of those who lost their lives, but the constitutional and moral responsibility of the state to protect the life, property, and dignity of every citizen. For God’s sake, don’t wait for the next disaster. Reform now so that no mother is forced to search for her child in floodwaters again.”\n\nIn response, the Deputy Chairman, who was presiding over the session, said a detailed discussion on the matter would be held on Monday, as several motions were scheduled.\n\nHowever, Ali Zafar pressed again: “Deputy Chairman Sahib, the time for debate is over. Don’t wait — act now. Decide on the proposed committee.”\n\nThe chair stated that it was not only the responsibility of the federal government but also of the four provincial governments to act during such emergencies. As other members stood to speak, the chair concluded the session, citing the approaching time for Friday prayers.\n\nPublished in Dawn, July 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:46:12.540Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925089/senate-passes-bill-to-end-death-penalty-for-key-offences",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T01:47:39.000Z"
}
