{
  "title": "PTI’s Senate poll campaign beset by political wrangling - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Deal could yield six seats for KP ruling party, five for opposition\n• Plan hinges on withdrawal of five ‘disgruntled’ PTI candidates\n• Peshawar chapter livid after its president denied ticket in favour of ‘affluent individual’\n• Candidate denies late-night media reports on withdrawal from race\n• JUI-F senator claims his party turned down ‘last-minute offer’ from PTI\n\nPESHAWAR: As political parties hold negotiations over seat adjustments for the upcoming Senate elections in Khyber Pakhtunkhwa, the PTI’s Peshawar chapter seems to be at odds with the party leadership and has vowed to contest the polls independently.\n\nOn Thursday night, leaders of opposition parties had met Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur at the CM House to chalk out the modalities of seat adjustment.\n\nThe opposition delegation was led by KP Assembly Opposition Leader Dr Ibadullah.\n\nSources said that the initial understanding developed would see the PTI get six out of 11 Senate seats, comprising four general, one technocrat and one reserved for women.\n\nIn contrast, the opposition would receive five seats, including two seats each for JUI-F and PPP (one general and one technocrat each), and one general seat for the PML-N.\n\nThis agreement, however, hinges on the withdrawal of PTI candidates Irfan Saleem, Ayesha Bano, Irshad Hussain, Khurram Zeeshan and Waqas Orakzai. But these candidates are seemingly bent upon contesting elections and have refused to bow to party pressure.\n\nIn an attempt to defuse the crisis, the PTI’s top leadership, including Chairman Barrister Gohar Ali Khan and General Secretary Salman Akram Raja rushed to Peshawar and held talks with the dissidents on Friday.\n\nAt least two rounds of meetings remained inconclusive, and the party’s 38-member political committee was expected to make a final decision.\n\nWhile there was no official word from either side till the filing of this report after midnight, media reports suggested the final round of PTI meeting ended, with the protesting aspirants agreeing to withdraw from the contest.\n\nHowever, one of the candidates while talking to Dawn denied the media reports, explaining that they had not taken any such decision in the meeting.\n\nInsiders said that the body may like to stick to the deal negotiated with the opposition. If that is the case, then the dissenting PTI figures are unlikely to withdraw their candidature.\n\nEarlier, Irfan Saleem told Dawn that the PTI-opposition arrangement benefits only “pro-establishment elements”.\n\n“Given the current scenario, we’re not ready to withdraw. The number of Senate seats PTI is getting under this arrangement is less than our actual strength in the provincial assembly,” he said.\n\nBut he added that if the PTI’s share in the Senate seats could be increased, they were ready to withdraw their candidacy.\n\n‘Peshawar’s Imran Khan’\n\nOn the other hand, PTI’s Peshawar chapter has been up in arms against the party leadership for ignoring workers in the process of awarding Senate\n\ntickets, and has threatened to stage a protest outside CM House and lay seige to the KP Assembly on polling day.\n\nThe rift deepened following the denial of a Senate ticket to Mr Saleem, a longstanding party worker and president of PTI’s Peshawar chapter.\n\n“Irfan Saleem is Peshawar’s Imran Khan,” said former district general secretary Jalal Khan at a press conference at Peshawar Press Club on Friday. He was joined by former city president Ihtisham Khan and several tehsil heads.\n\nHe said that Mr Saleem had been associated with the PTI for the last 23 years and has rendered tremendous sacrifices for the party before and after the May 9, 2023, violent protests.\n\n“PTI workers in Peshawar were happy when Irfan Saleem was nominated, as he had previously been denied tickets for both the National and provincial assemblies,” he added.\n\nJalal Khan accused the leadership of dropping Mr Saleem in favour of affluent candidate Mirza Afridi.\n\nHe said Mr Saleem suffered a lot at the hands of the law enforcement agencies after the May 9 events, whereas Mr Afridi condemned the incident during a press conference, contrary to party policy.\n\nHe also alleged that Mr Saleem’s name was removed from the list of candidates through a conspiracy orchestrated by Barrister Muhammad Ali Saif.\n\nOn July 15, the PTI KP chapter had recommended five names to Chairman Barrister Gohar for general seats, including Murad Saeed, Irfan Saleem, Faisal Javed, Khurram Zeeshan and Azhar Mashwani.\n\nA letter accompanying the recommendations said the names were listed “in order of priority, reflecting their dedication, service to the party and ability to represent PTI’s vision at the national level”.\n\nHowever, Irfan Saleem’s name was dropped following a meeting between Imran Khan and Barrister Saif at Adiala Jail, reportedly to accommodate Mirza Afridi.\n\nJUI-F ‘not interested’\n\nMeanwhile, JUI-F Senator Kamran Murtaza told DawnNewsTV on Friday that the PTI had also approached it for a potential alliance for the Senate elections.\n\nMr Murtaza said a senior PTI leader had recently contacted him to propose contesting the Senate elections jointly.\n\nHowever, the JUI-F has turned down the offer, citing its prior commitment to other opposition parties.\n\n“I told PTI that we have already given our word,” Mr Murtaza said, confirming that the JUI-F would not entertain a last-minute alliance with PTI.\n\nPublished in Dawn, July 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/17073727c2aa0c3.jpg?r=073816",
  "retrievedAt": "2025-08-17T20:46:25.562Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925091/ptis-senate-poll-campaign-beset-by-political-wrangling",
  "dateList": "2025-07-19",
  "date_published": "2025-07-19T01:47:39.000Z"
}
