{
  "title": "NA Speaker directs CDA to establish rehabilitation centres for poor",
  "link": "https://www.app.com.pk/national/na-speaker-directs-cda-to-establish-rehabilitation-centres-for-poor/",
  "date_published": "2021-09-09T19:02:00.000Z",
  "source": "APP",
  "content": "Chairing a meeting regarding the rescue, rehabilitation, education, shelter, uplift, and mainstreaming of street children in Islamabad, he gave one week time to Deputy Commissioner Islamabad and other partners to come up with a straight line of action with regard to the rescue and rehabilitation of Street Children in Islamabad before the matter is taken up with the Prime Minister of Pakistan.\nThe Deputy Commissioner was directed to assign a Special Magistrate to the issue of Street Children so cases are tackled on a timely basis.\nThe chair was briefed about the progress made so far by the Special Task Force working on the Street Children in Islamabad constituted by the Speaker. Members were informed about the problem, causes, ramifications and mitigations at length.\nInspector General of Police (IGP) Islamabad was asked to take strict action against Mafia’s working and provide fool proof security to the Rehabilitation Center which would provide shelter, feed, educate and microfinance of street children.\nKashmir Orphan Relief Trust (KORT) assured the Chair that if provided with the proper place it will assist in rescue, rehabilitation, education and shelter of the Street Children.\nThe Speaker also directed to engage the Information Ministry for the awareness campaign with regard to Street Children.\nThe Chair said that the National Assembly will expedite all the pending bills pertaining to the Street Children so that legal cover is given to the law enforcement agencies.\nSpeaker said that the Islamabad High Court will be requested for the appointment of a Special Judge for the timely disposal of cases regarding the Street Children.\nThe meeting was attended by the Members of the National Assembly from Islamabad, Chairman KORT and Pakistan Sweet Homes, Inspector General of Police and Deputy Commissioner Islamabad.",
  "retrievedAt": "2025-08-11T21:12:24.000Z"
}
