{
  "title": "APP,Cuban news agency Prensa Latina sign MoU for news exchange",
  "link": "https://www.app.com.pk/national/appcuban-news-agency-prensa-latina-sign-mou-for-news-exchange/",
  "date_published": "2021-09-10T12:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain said on Friday that Pakistan stood by Afghan people and would not leave them at these critical times.\nSpeaking on the occasion of MoU signing ceremony between the official news agencies of Pakistan and Cuba, he said that Pakistan had sent humanitarian aid to Afghanistan to avert humanitarian crisis and one C-130 was in Kabul now whereas two more planes would leave for Kabul within this week.\nHe said that Pakistan was the most important corridor for getting access to Afghanistan.Chaudhry Fawad said that the international community had appreciated Pakistan’s role in the evacuation of media persons and thousands of foreigners from Afghanistan.He said that the world was giving more respect and honour to Pakistan’s narrative now.Pakistan’s official and premier news agency Associated Press of Pakistan have signed a Memorandum of Understanding for the exchange of news with Cuban news agency Prensa Latina.\nManaging Director APP Mubashir Hassan and Ambassador of Cuba to Pakistan  Zéner Javier Caro González signed the agreement.\nMinister for Information and Broadcasting Chaudhry Fawad Hussain,Secretary Information and Broadcasting Shahera Shahid and senior officers of the ministry were also present on the occasion.\nChaudhry Fawad said that it was a historic day as two leading news agencies were signing an agreement for the exchange of news.\nHe said it was APP’s first agreement with any news agency of Latin America.\nThe minister said that with the signing of this agreement, cooperation between the APP and Prensa Latina would be beneficial for both media organizations. He said that APP would soon also sign news exchange agreements with Tajikistan, Iran, and United Arab Emirates news agencies which would increase cooperation in the information regime.\nThe minister said that Pakistan had good relations with Cuba based on mutual trust and respect.He said that both countries understand each other’s problems and challenges.\nThe minister said that on the directives of Prime Minister Imran Khan, the government of Pakistan and the Ministry of Information had been providing assistance in the evacuation of foreign nationals from Afghanistan.\nThe minister said that the government had revamped External Publicity Wing during the past few months.\nHe said that the Ministry of Information through EP Wing had issued 250 visas, 85 borders crossing NOCs and 35 media coverage requests since last month.\nHe said that Pakistan facilitated not only the evacuation of media persons from Afghanistan but also personnel of aid agencies stationed there.\nThe minister said his ministry facilitated, in evacuation and granting visas to all those foreign journalists working in Afghanistan or intending to visit there for media coverage.\nSpeaking on the occasion, the Cuban envoy thanked Chaudhry Fawad for taking personal interest in the completion of modalities for the signing of the agreement between the two agencies.He said that fake news was also a problem in Cuba and signing this agreement would prove helpful in strengthening of cooperation in the field of media.\nThanking Pakistan for helping in the evacuation of foreigners from Afghanistan, he said that sending relief goods to Afghanistan was a step worth appreciation.",
  "retrievedAt": "2025-08-11T21:12:18.502Z"
}
