{
  "title": "Qureshi urges steps to ward off humanitarian crisis in Afghanistan",
  "link": "https://www.app.com.pk/national/qureshi-urges-steps-to-ward-off-humanitarian-crisis-in-afghanistan/",
  "date_published": "2021-09-10T15:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): Foreign Minister Shah Mahmood Qureshi Friday urged the international community to urgently provide assistance to ward off a humanitarian crisis and to take steps to ensure economic stability in Afghanistan.\nThe foreign minister, during the wide-ranging talks with Foreign Minister of Spain Jose Manuel Albares Bueno here, said releasing Afghanistan’s financial assets was also a necessary measure to bring in economic stability.\nDuring the talks, views were exchanged on the latest developments in Afghanistan. Bilateral relations including cooperation in international fora were part of the parleys.\nForeign Minister Qureshi stated that Pakistan, as an immediate neighbor of Afghanistan, had paid immense price because of prolonged conflict and instability next door. As such, peace and stability in Afghanistan were in the best interest of Pakistan, he added.\nThe foreign minister hoped that the new dispensation in Afghanistan would undertake concerted efforts for peace and security and work towards taking care of humanitarian and development needs of the Afghan people.\nHe underscored that the international community must remain engaged and that the people of Afghanistan should not be abandoned.\nForeign Minister Qureshi apprised the visiting foreign minister of his regional outreach on different aspects of the evolving situation in Afghanistan, which presented challenges as well as opportunities.\nHe also apprised his Spanish counterpart regarding Pakistan’s facilitation of evacuation of over 12,000 people belonging to 30 countries and international organizations.\nForeign Minister Albares appreciated Pakistan’s role in facilitation of international evacuation endeavors.\nHe agreed that a peaceful and stable Afghanistan was key to regional peace, stability and prosperity and also lauded Pakistan’s efforts in promoting these objectives.\nIn the bilateral context, the two foreign ministers discussed the entire gamut of Pakistan-Spain relations including cooperation in political, economic, trade, energy and defence sectors.\nThey agreed on enhancing relations in all fields and stressed the importance of regular high-level exchanges. Foreign Minister Albares also appreciated the positive contributions of Pakistani community in Spain.\nForeign Minister Albares invited Foreign Minister Qureshi to undertake a visit to Spain.\nThis year marks the 70th anniversary of establishment of diplomatic relations between the two countries. The milestone would be commemorated in a befitting manner through a series of events.",
  "retrievedAt": "2025-08-11T21:12:12.374Z"
}
