{
  "title": "President for protecting, granting women’s property rights as per Islam",
  "link": "https://www.app.com.pk/national/president-for-protecting-granting-womens-property-rights-as-per-islam/",
  "date_published": "2021-09-10T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): President Dr Arif Alvi on Friday urged the need of taking steps for protecting and granting women’s property rights, as envisaged by Islam, in order to create an inclusive and egalitarian society.\nHe said that an awareness campaign was needed to educate the people about women’s rights and called upon the Ulema and Media to play their role in this regard.\nReferring to the Enforcement of Women’s Property Rights Act, 2020, the President hailed the piece of legislation as a positive step in granting women their rights and underlined the need for uniform laws in all provinces.\nHe was chairing a meeting about women empowerment here at the Aiwan-e-Sadr.\nMinister for Economic Affairs, Omar Ayub Khan, Parliamentary Secretary for Law and Justice Division, Ms Maleeka Bukhari and senior government officials attended the meeting.\nThe President said that the Enforcement of Women Property Rights Act, 2020 offered an effective and speedy grievance redressal mechanism under which any woman deprived of ownership of property or possession of her property, may file an appeal to the ombudsman.\nHe also underscored the need of using the Alternate Dispute Resolution (ADR) mechanism for resolving women’s property issues.\nThe President also emphasized the need for streamlining the projects related to women empowerment.\nFinancial inclusion of women was of paramount importance for empowering them in true spirit and they needed to be educated about the available loans and other facilities being offered through the Ehsaas Program and the State Bank of Pakistan, he added.\nOmar Ayub Khan briefed the President about various multilateral and bilateral fundings and loans being given by the World Bank, Asian Development Bank and countries to Pakistan for women.\nThe President appreciated the international organizations and countries for their financial support in this regard.",
  "retrievedAt": "2025-08-11T21:12:14.940Z"
}
