{
  "title": "Opposition parties not supporting electoral reforms to maintain their political, social status quo: Dr Awan",
  "link": "https://www.app.com.pk/national/opposition-parties-not-supporting-electoral-reforms-to-maintain-their-political-social-status-quo-dr-awan/",
  "date_published": "2021-09-10T17:12:00.000Z",
  "source": "APP",
  "content": "Addressing a presser flanked by Minister for Information and Broadcasting Chaudhry Fawad Hussain and Minister for Railways Azam Khan Swati, he said Pakistan Muslim League-Nawaz and Pakistan Peoples Party were also against the overseas Pakistanis right to vote. But, he declared that the incumbent government was committed to give the overseas diaspora their right to vote.\nHe said in today’s Senate Standing Committee on Parliamentary Affairs meeting, the committee chairman denied to give right of virtual vote to a committee member from Balochistan.\nHe said the government had seven votes but one was denied by the committee chairman. He said on Monday,a joint parliament session would be convened to initiate the fourth parliamentary year of the Pakistan Tehreek-e-Insaf government.\nHe also informed that the election reforms bill would be tabled in the National Assembly session being held on Wednesday.\nHe said it was the first time in history that the government was denied to present its stance in the committee as it wanted to respond the objections, raised on the usage of EVMs in the next general elections.\nHe said he could only reply to five objections out of 37. He further said it was also happened first time that the regulator walked out from the meeting.\nHe said the election reforms bill was presented in the National Assembly last year in October. However, it was passed after eight months, he added.\nDr Awan said opposition did not give even a single suggestion about election reforms or electronic voting machines (EVMs) or internet voting.\nHe said later, the bill was referred to the committee to decide on it in two months but it took three months and produced no productive results.\nHe said the system of entire world was based on technology and how could we stop the induction of modern inventions like EVMs to hold free, fair and transparent elections in the country. Sooner or later, we would have to adopt this method for transparency in the electoral process, he maintained.\nHe said there were almost three orders of the Supreme Court and government would soon complete this legislation in light of the following orders.\nHe said opposition was looking for National Reconciliation Ordinance but it would never succeed to get it.\nSpeaking on the occasion, Minister for Railways Azam Khan Swati said Prime Minister Imran Khan was not just thinking about the 2023 elections but he wanted to bring electoral reforms in the country to avoid election controversies in the future.\nHe said last year in October, the government proposed 49 election amendments.\nHe said since last two years, a weekly meeting was being conducted regarding EVMs in the President House and the Election Commission of Pakistan (ECP) was also attending the meetings as it was the main stakeholder of whole the system.\nHe said it seemed the ECP was following opposition’s agenda. He expressed the hope that transparent elections would be held through advance technology in 2023.",
  "retrievedAt": "2025-08-11T21:12:13.062Z"
}
