{
  "title": "EU, UN Women & FJA Train Police Instructors to Advance Gender-Responsive Policing in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Aug 22 (APP):Through funds provided by the European Union, UN Women Pakistan, in partnership with the Federal Judicial Academy (FJA), successfully concluded a three-day Training of Trainers (ToT) on Gender-Responsive Policing under the EU-financed Deliver Justice Project.\nThe training empowered 27 police instructors, nine men and 18 women from Balochistan, Khyber Pakhtunkhwa and the National Counter Terrorism Authority (NACTA) to integrate gender-responsive practices, standardize gender-based violence (GBV) training, and promote survivor-centered approaches. It also established the Federal Judicial Academy as a national coordination hub for gender-responsive policing.\n“This initiative makes clear that gender-responsive policing is not a standalone effort,” said Ms Jacqui Ketunuti, Deputy Country Representative, UN Women Pakistan. “It is part of a systemic shift where police, prosecutors, judiciary and social services must work in unison to build survivor trust and ensure justice. With the EU’s strategic support, we are not only training individuals but also shaping institutional cultures and strengthening accountability across Pakistan’s justice system.”\nJeroen Willems, Head of Cooperation at the European Union Delegation to Pakistan, reaffirmed the EU’s commitment, saying: “As the European Union, we are proud to partner with Pakistan on strengthening its rule of law institutions. Following this EU-financed training, I look forward to seeing how these trainers use their new skills to strengthen police training as well as service delivery to further enable an accessible, inclusive, and gender-responsive service to all citizens in Pakistan.”\nDirector General of the Federal Judicial Academy, Hayat Ali Shah, described the effort as a milestone: “This initiative has strengthened the foundation for a unified training culture across provinces. By equipping police instructors with survivor-centered approaches, we are moving closer to an accessible, gender-responsive justice system.”\nIn his closing remarks, Hon’ble Justice Mian Gul Hassan Aurangzeb emphasized the importance of justice delivery: “A justice system can only be credible when it protects the most vulnerable. This Training of Trainers reflects our joint responsibility to equip law enforcement with the knowledge and tools to respond effectively to gender-based violence and uphold pro-women laws.”\nThe training featured specialized sessions on the National Framework for Gender-Responsive Policing, pro-women legislation, curriculum development, and inter-academy learning. It also included a high-level dialogue with Justice Farah Jamshed of the Peshawar High Court, Member of National Assembly Huma Akhter Chughtai, Syeda Tanzeela Sabahat, Secretary LJCP, Umer Riaz, Former DG PVE NACTA, and senior police leadership, who highlighted pathways for embedding gender-responsive practices into mainstream policing and justice delivery.\nThis initiative forms part of the EU-financed €19 million Deliver Justice Project, which has been running since 2021 and aims to strengthen the rule of law, expand access to justice and protect women and marginalized groups in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-23T07:58:43.379Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/eu-un-women-fja-train-police-instructors-to-advance-gender-responsive-policing-in-pakistan/",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T11:08:00.000Z"
}
