{
  "title": "Girls Cadet College Dera to begin classes this year: Commissioner",
  "author": null,
  "content": "DERA ISMAIL KHAN, Aug 22 (APP):Commissioner Dera Zafar ul Islam Khattak on Friday announced that classes at the newly established Girls Cadet College Dera will begin this year in a rented RPDC building, with admissions opening from grade eight.\nTalking to media here at his office, he said Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur had secured Rs 209 million for the renovation of the college building. He informed that the Communication and Works (C&W) Department has been directed to complete the work within two months. The college will allocate 40 percent of seats for Dera Ismail Khan, 30 percent for Khyber Pakhtunkhwa, and 30 percent for the rest of the country, while 55 staff positions have also been approved by the Board of Governors.\nThe commissioner highlighted that joint efforts of the Pakistan Army, Frontier Corps, police, law enforcement agencies, district administration, religious scholars, and community elders had markedly improved law and order in the region.\nHe said security forces had cleared militants from Wana, reopened the main Wana Road that extremists had blocked and damaged, and ensured peaceful observance of Ashura and Independence Day across the division.\nHe added that the provincial government had transferred Rs 700 million to the National Logistics Cell for the construction of two flyovers in Dera while the work over this project is already in progress. The projects are expected to be completed by 2025-26 and will ease traffic congestion in the city.\nOn flood preparedness, Khattak said that although no major losses had been reported during the current monsoon season, the administration had finalized emergency measures. A 24-hour control room has been set up at the ADC Relief Office, and relief supplies have been pre-positioned at all tehsil headquarters to ensure timely assistance to affected families.\nHe urged upon the citizens to cooperate with the administration, avoid low-lying and riverine areas, and respect the imposition of Section 144 for their safety.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-23T07:58:44.153Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/girls-cadet-college-dera-to-begin-classes-this-year-commissioner/",
  "dateList": "2025-08-22",
  "date_published": "2025-08-22T10:44:00.000Z"
}
