{
  "article_id": "2025-02-01_9bbddcc91c5792e565b9dc16040c5be3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/coas-visits-balochistan/",
    "retrieved_at": "2025-08-27T12:18:06.877Z"
  },
  "metadata": {
    "title": "COAS visits Balochistan",
    "author": null,
    "date_published": "2025-02-01T16:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 240,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Feb 01 (APP):General Syed Asim Munir, NI(M), Chief of Army Staff (COAS), visited Balochistan where he was given a comprehensive brief on the prevailing security situation in Balochistan which was also attended by senior security and intelligence officials. COAS, Governor and CM Balochistan offered funeral prayers of the Shaheeds and also visited the injured soldiers in the Combined Military Hospital Quetta and appreciated their unwavering commitment to defending the country at all costs said an ISPR news release. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/02/WhatsApp-Video-2025-02-01-at-21.29.58.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume. COAS highlighted that those who are acting as terrorist proxies of their foreign masters who have mastered the art of manifesting double standards of hunting with the hound and running with the hare are well known to us. No matter what these so-called \"frenemies\" may do, you will surely be defeated by the resilience of our proud nation and its Armed Forces Inshallah. For the defence of our motherland and its people, we will definitely retaliate and 'hunt you down', whenever required and wherever you may be. COAS also appreciated the efforts of the valiant officers and soldiers of the Army, Frontier Corps and Law Enforcement Agencies for their courage and determination towards fighting terrorism. He reassured Army's resolve to ensuring the security and well-being of the people of Balochistan, while also reaffirming commitment to supporting the provincial government in its efforts to promote peace, stability, and development in the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}