{
  "article_id": "2025-02-01_cc5c204dd820832b5ce9eabe4307dc75",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/23-terrorists-killed-in-balochistan-during-24-hours/",
    "retrieved_at": "2025-08-27T12:17:31.190Z"
  },
  "metadata": {
    "title": "23 terrorists killed in Balochistan during 24 hours",
    "author": null,
    "date_published": "2025-02-01T12:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 240,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Feb 01 (APP):The Security Forces killed 23 terrorists in different operations in Balochistan during the last 24 hours, demonstrating great determination to purge the country of the menace of terrorism. \"In the backdrop of the heinous act of terrorism in Kalat District, multiple santization operations are being conducted by the security forces throughout the province,\" an ISPR news release said. On Saturday, in one of such operations conducted in Harnai District, own troops effectively engaged the terrorists as a result of which eleven terrorists were sent to hell, busting multiple terrorist hideouts. Earlier, on the night between January 31 and February 1, while successfully thwarting terrorists' attempt to establish a roadblock in the general area Mangocher, Kalat District, twelve terrorists were sent to hell. \"Thus a total of 23 terrorists have been sent to hell in different operations in Balochistan in last 24 hours,\" it added. On the behest of inimical and hostile forces, this cowardly act of terrorism was aimed at disrupting the peaceful environment of Balochistan by targeting mainly innocent civilians. During the conduct of operations, eighteen brave sons of the soil, having fought gallantly, made the ultimate sacrifice and embraced shahadat. The ISPR vowed that the sanitization operations would continue until perpetrators and facilitators of the heinous and cowardly act are brought to justice. Security forces of Pakistan, in step with the nation, are determined to wipe out the menace of terrorism from Balochistan and Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}