{
  "title": "Women must be taken along in development process: Dr. Arif Alvi",
  "link": "https://www.app.com.pk/national/women-must-be-taken-along-in-development-process-dr-arif-alvi/",
  "date_published": "2022-11-14T10:34:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 14 (APP): President Dr. Arif Alvi said on Monday that women should remain in the mainstream national development process and economic cycle of the country to double the development pace.\nHe cited that Hazrat Khadija (RA) was a business woman; therefore it was not justified to confine the educated women to their homes to look after the family matters only.\nAddressing the Minhaj University Lahore (MUL) Convocation 2022 here, he said that Quaid-i-Azam Muhammad Jinnah had also advocated for taking women along in the national development process.\nThe society must benefit from their skills and knowledge, however, it was government’s responsibility to provide women with harassment-free environment at their workplace. He said that 50 percent of the women students after acquiring MBBS degree did not go for practice in the field or most of them went abroad to serve there, which was unfortunate and in a way, wastage of the resources spent on them during their studies at respective educational institutions.\nDr Arif Alvi advised the graduating student that they should not isolate themselves from the society in their practical life and their motto should not be earning livelihood only, and they must use their knowledge and skills for well-being of the society and uplift the poor strata.\nAt global level, the IT industry was running short of manpower and the international community was looking towards Pakistan having youth bulge to cater to the needs of this vital sector, he said and added that Pakistan must take substantial advantage of this great opportunity.\nDr Arif Alvi said that human relationships were built on the basis of communication, asserting that people must take extra care of sharing information through social or any other media and avoid sharing unconfirmed information and out of context communication as it was unethical and against the teachings of Islam.\nIn the past, he added, the education was considered necessary to earn a livelihood, which created a state of euphoria but deprived the society of spiritual qualities.\nThe Muslim had over the past 600 years been resistant regarding gaining of knowledge which was unfortunate; he said and asserted that Allah Almighty had opened the passage to knowledge and Muslim being the inherent of ‘the knowledge’ should have continued with this inheritance to achieve successes in this world and the hereafter.\nThe nations which adopted knowledge and made the education a way to attain social well-being and economic prosperity were now advancing at fast pace in every sphere of life, he maintained.\nHe said that visionary personality of Dr Tahir-ul-Qadri had made great contributions in building Minhaj University and this institution was producing students who were complete in terms education,training and character building.\nDr Arif Alvi said that it was the beginning regarding opening the heart and door to knowledge for the graduating students, adding that man learnt a lot about the behavior and attitudes of the society in his practical life.\nHe said that the knowledge of universe was very vast, which we called external knowledge and the Muslim and other scientists, researchers worked a lot on this knowledge, while the other was internal knowledge upon which the Sufia and saints worked a lot to connect the people with internal knowledge. Man’s quest and desire to get knowledge would always be there and knowledge was increasing with the passage of time and new reaches and theories were coming forth, he added.\nOn this occasion, the President also awarded medals and degrees to some of the position holder graduates.Earlier, Prof Dr Hussain Mohiyyuddin, Deputy Chairman of MUL Board of Governors, Vice Chancellor Prof Sajid Mahmood Shahzad also spoke on the occasion and highlighted history and achievements of the varsity.",
  "retrievedAt": "2025-08-11T15:52:56.618Z"
}
