{
  "title": "Overseas minister leaves on 10-day visit abroad",
  "link": "https://www.app.com.pk/national/overseas-minister-leaves-on-10-day-visit-abroad/",
  "date_published": "2022-11-14T08:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 14 (APP):Federal Minister for Overseas Pakistanis and Human Resource Development, Sajid Hussain Turi on Monday left on a ten-day official visit to abroad in which he will meet with the authorities concerned and the Pakistani community there.\nThe purpose of the foreign visit is to create new employment opportunities for Pakistanis in different countries, to discuss the problems of the Pakistani community with the authorities of the respective countries and to promote bilateral relations, said a press release.\nThe minister will visit Switzerland, Romania, Greece, Portugal and to meet the Director General of the International Labor Organization in Geneva and discuss with him the rehabilitation and relief of the workers affected by the recent floods in Pakistan.\nIt should be noted that the Ministry of Overseas Pakistanis and Human Resource Development, with the support of ILO, has already started a cash-for-work programme for the rehabilitation of flood-affected workers in Balochistan and Sindh, which will be extended to all affected areas of the country.\nFederal Minister Sajid Hussain Turi said in his statement before the departure that Romania, Portugal, Italy, Greece and other western countries are in need of large-scale manpower and we are ready to sign agreements to send Pakistani workers and professionals to these countries.\nHe further said that he will talk to the authorities of the respective countries to facilitate the process of obtaining visas and immigration so that maximum Pakistani labour force and professionals can be sent to these countries in the shortest possible time. He added that due to overseas Pakistanis, and the country received record remittances of more than 31 billion dollars in FY22, which is a major part of the country’s economy.\nHe informed that his first priority is to provide maximum facilities to overseas Pakistanis and solve their problems immediately and in this regard he has issued orders to the community welfare attachés of respective countries to facilitate the people of Pakistan in best possible way.",
  "retrievedAt": "2025-08-11T15:52:58.548Z"
}
