{
  "title": "IHRA signs MoU to provide quality healthcare services in ICT",
  "link": "https://www.app.com.pk/national/ihra-signs-mou-to-provide-quality-healthcare-services-in-ict/",
  "date_published": "2022-11-14T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 14 (APP): Islamabad Healthcare Regulatory Authority (IHRA) and the American Association for Accreditation of Ambulatory Surgery Facilities (QUAD-A) on Monday signed a Memorandum of Understanding (MoU) to improve the quality, efficiency, and safety of healthcare services in Islamabad Capital Territory (ICT).\nAs per MoU, healthcare services will be improved in the federal capital by adopting evidence-based regulatory standards for the registration and licensing of healthcare establishments.\nThis MoU will allow IHRA to bring a truly global healthcare system, infrastructure, and standards to the Capital Territory of Islamabad through a long-term strategic partnership with QUAD-A. It is imperative to establish healthcare systems that are more resilient, centered around people’s needs and sustainable.\nThe MoU was signed in order to address the issues being faced by the country like access to affordable and quality healthcare services besides alarming health indicators and high mortality rates.\nThe Islamabad Healthcare Regulatory Authority (IHRA) is an autonomous health regulatory body enacted under the Islamabad Health Regulation Act, 2018. IHRA has been working to improve the quality, efficiency, and safety of healthcare services delivery by adopting evidence-based regulatory standards for the registration and licensing of healthcare establishments, health professionals, and equipment.\nQUAD-A is a global leader in accreditation, ensuring adherence to data-driven standards that impact the overall health and well-being of patients served in its accredited facilities. QUAD-A has worked to establish the necessary infrastructure, standards, and processes required for positively impacting the care that is delivered.",
  "retrievedAt": "2025-08-11T15:52:58.537Z"
}
