{
  "title": "Kicking away the ladder - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE ‘Liberation Day’ import tariffs announced by President Donald Trump on April 2 mark a tectonic shift in the global economic as well as geopolitical order.\n\nThe ‘Trump tariffs’ are far more than just about re-balancing trade or an effort to contain a geopolitical rival. It is the manifestation of a nativist, anti-globalisation and thinly veiled xenophobic mindset that is unlikely to roll back despite the interim pause and exemptions, or the long-term costs.\n\nMost of the commentary in Pakistan has been narrowly focused on the potential first-order effects on the country’s exports, ignoring the wider dynamic unleashed by the inward pivot by the US. (Even on trade, the partial-equilibrium analysis so far has ignored the second- and third-order effects that are likely to be set in motion despite the temporary pause in tariffs for non-retaliating countries.)\n\nThe pivot underway in the US is one for the history books, marking the end of an era. Some international economic commentators have, rightly in my view, placed the consequences of the ‘Trump tariffs’ at par with the Ming dynasty’s historic own-goal in the 15th century with the Edict of Haijin, when China decided to shut itself off from the world.\n\nWhat has also been ignored so far in the commentary here is that there is a long history of America in particular, and of the West more generally, conducting its affairs completely contrary to its stated ‘ideology’, or contrary to what it preaches to the rest of the world. And global trade is no exception. The conventional wisdom that it is for the first time that the US has suddenly moved away from ‘free trade’ is without historical basis.\n\nThe US has championed free trade and benefited immensely, but has practised it selectively.\n\nAs the title of this article, borrowed from Prof Ha-Joon Chang’s provocative book, suggests, the West has not only vigorously used protectionism as an economic development strategy for itself, but it has also actively conspired throughout history to prevent developing countries from achieving ‘developed’ status.\n\nOne of the main tools at its disposal to pursue the latter objective has been the so-called ‘rules-based order’ constructed after World War II, which used the World Bank, IMF and the World Trade Organisation to force developing countries to eschew protection for domestic industries and to completely open up their markets for competition from better-placed Western companies.\n\nThis deliberate and cynical strategy has prevented the development of an industrial base in some of the poorest countries in the so-called Third World, blocking a potential pathway to economic development. At the same time, these resource-rich countries have been consigned to exporting raw materials to the advanced economies, which more often than not are extracted (exploited) by Western transnational corporations, while becoming unwitting markets for Western products and services.\n\nPerhaps the two most egregious examples from history of the West using military power to force other countries to open their markets and accept ‘unequal treaties’ are the Opium Wars in China, and Commodore Matthew Perry’s sailing into Tokyo Bay with US warships in 1853 to force the Japanese to open their ports for American ships, their major cities for placement of US diplomats, and their entire country for trade.\n\nMore recent examples of Western countries using ‘gunboat diplomacy’ to secure their economic interests include the CIA coups to overthrow prime minister Mohammad Mossadegh in Iran in 1951 after he nationalised the Anglo-Iranian Oil Company (now BP), and against president Jacobo Árbenz in Guatemala in 1954 after he introduced land reforms that hurt the interests of United Fruit Company, a large US corporation.\n\nThe US unease with the economic rise of China, and its desperation to ‘de-couple’, should be seen in this rich historical context. Those of us growing up in the 1980s would recall a very similar angst expressed in America about the rise of another Asian economy.\n\nUnlike China today, which is labelled by the US as a ‘strategic competitor’, thus attempting to justify the use of restrictive and unfair trade practices of its own, the target for America’s ire back then was none other than a close ally — Japan. Fear of American companies being forced to shut down by more competitive Japanese exporters, or of Japanese investment ‘taking over’ America, was whipped into a nationalist and near-xenophobic frenzy.\n\nThis culminated in a slew of measures by America designed to restrict access by Japanese firms to the US market, and to force them to relocate production to the US mainland. These measures included Voluntary Export Restraints, Section 301 Trade Actions, and the ‘Super 301’ (1988 Trade Act). Growing concerns in the 1980s and 1990s about foreign acquisitions of US assets — especially by Japanese companies — also led the US to introduce specific laws and regulations aimed at vetting and, in some cases, restricting foreign investment in strategically sensitive areas.\n\nThese included the Exon-Florio Amendment (1988), which gave the president the authority to block foreign acquisitions of US companies if they “threatened national security”, and provided for review of individual deals by the Committee on Foreign Investment in the United States.\n\nIn addition, a concerted campaign took place via Congressional hearings and media coverage to amplify public pressure against Japanese exports as well as investment (much like China has been demonised in the US for the past decade).\n\nThese efforts culminated in the infamous Plaza Accord of 1985, under which the US coordinated with its allies to force Japan to massively appreciate the Japanese yen. This laid the basis for the downfall of the Japanese economy and the lost decades that have followed. In the current iteration, pro-Trump US strategists have floated the idea of a follow-up ‘Mar-a-Lago Accord’ to weaken the US dollar.\n\nOne consistent lesson from history is that Western powers will go to any length, including staging wars and coups against foreign countries, and imposing unequal treaties, to secure and protect their economic interests. Like democracy and human rights, free trade is just another useful beating stick and expendable slogan.\n\nThe writer has been a member of several past economic advisory councils under different prime ministers.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680072628b747.jpg",
  "retrievedAt": "2025-08-25T14:23:45.546Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904772",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T03:16:52.000Z"
}
