{
  "title": "Pakistan urges overhaul of UN peace missions - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan on Wednesday proposed a comprehensive reform of United Nations peacekeeping operations, urging the international community to adapt peacekeeping structures and strategies to meet the challenges of a rapidly changing global security landscape.\n\nThe proposals were presented by Foreign Minister Ishaq Dar at the third United Nations Peacekeeping Ministerial Preparatory Meeting, which Pakistan co-hosted with South Korea in Islamabad.\n\nThe conference aimed to shape the agenda for the upcoming UN Peacekeeping Ministerial Conference in Berlin, scheduled for May 13-14, where foreign and defence ministers will finalise strategies for the future of peacekeeping under the theme, “Towards a Safer and More Effective Peacekeeping: Use of Technology and Integrated Approach.”\n\n“The future of peacekeeping demands adaptation,” Mr Dar said. “As the global security landscape evolves, so should the structures and strategies be deployed.”\n\nHe laid out Pakistan’s eight guiding principles for peacekeeping reform, beginning with the need for strong political backing from the Security Council. “The Security Council must provide unified and consistent support to all peace operations,” he said.\n\nHe stressed that peacekeeping mandates must be “clear, focused, and grounded in field realities”, with troop-contributing countries actively involved from the outset.\n\n“Peacekeeping missions should not be asked to do more with insufficient resources,” he added, calling for mandates and resources to be aligned.\n\nUnderscoring the importance of professionalism, Mr Dar said deployment decisions should “be based on professional standards and track records”. He also advocated for stronger regional and cross-regional partnerships, highlighting recent progress such as UN Security Council Resolution 2719 on financing African Union-led missions. “We should also explore closer collaboration with organisations like the OIC,” he said.\n\nAddressing the safety of peacekeepers, Mr Dar emphasised that their protection must remain “paramount” amid complex conflicts and the rise of disinformation.\n\nThe foreign minister warned that UN peacekeeping today stands “at a crossroads”, challenged by “widening geopolitical divides that erode the political will essential for collective action”. He cited disinformation, destabiliing technologies, and the rise of non-state armed actors as growing threats to the legitimacy and safety of UN missions.\n\nPakistan is one of the world’s largest troop contributors to UN peacekeeping. Over the years, it has deployed more than 235,000 peacekeepers in 48 missions. A total of 181 Pakistani peacekeepers have died in the line of duty.\n\nPakistan also hosts one of the UN’s oldest peacekeeping missions, the United Nations Military Observer Group in India and Pakistan (UNMOGIP), which monitors the ceasefire in Jammu and Kashmir.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:05.819Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904740/pakistan-urges-overhaul-of-un-peace-missions",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:46.000Z"
}
