{
  "title": "Only 23,620 pilgrims allowed to avail Private Haj Scheme this year: ministry - Pakistan - DAWN.COM",
  "author": null,
  "content": "Only 23,620 pilgrims will be allowed to perform Haj under the private Haj scheme, according to a notification issued by the religious affairs ministry on Thursday.\n\nHaj, one of the fundamental pillars of Islam, is performed each year by millions of Muslims worldwide. Pakistan receives one of the highest Haj quotas from Saudi Arabia.\n\nIn January, Pakistan and Saudi Arabia signed the annual Haj agreement, under which 179,210 Pakistani pilgrims were allowed to perform Haj this year. Pakistan’s religious ministry has said that around 90,000 people would perform Haj under the government’s scheme, state-owned Radio Pakistan reported on April 6.\n\nAccording to Thursday’s notification, only 23,620 pilgrims will be permitted to perform Haj under the private scheme, despite the quota of over 179,000 pilgrims.\n\n“The list of service providers providing services with the Haj 2025 quota has been updated on the website of the Ministry of Religious Affairs and Interfaith Harmony and the Pak Hajj App [sic],” the notification read.\n\n“All such pilgrims, who have made billing with registered service providers, can check the status of their application and contract on the ministry’s website,” it added.\n\nService providers were urged to give updated Haj forms to pilgrims and to ensure that their visas are approved by April 18 (Friday), per directives issued by the Saudi Ministry of Haj and Umrah.\n\nA second notification from the ministry outlined the requirements for pilgrims, including mandatory vaccinations and information about Haj camps set up across Pakistan.\n\n“Temporary Haj camps [at] Hyderabad, Sialkot, Faisalabad and Rahim Yar Khan will be open for a few specific days, which will be informed on the Hajj Mobile App,” the second notice read.\n\n“Two days before the flight, Haj pilgrims … will receive [a] Haj visa, air ticket, identity locket, identity data sheet to be attached to the bag and a free Zong SIM for use in Saudi Arabia from the respective Haj camps,” it added.\n\nHowever, The Independent Urdu reported that during a meeting of the Senate Committee on Religious Affairs, the question of what would happen to 67,000 pilgrims was raised.\n\nIn the meeting, which was chaired by Senator Attaur Rehman, the Secretary of Religious Affairs was quoted as saying, “Our ministry has been informed by the Ministry of Foreign Affairs that Pakistan has got a quota of 10,000 private Hajj, and it will not be able to get more than that.\n\n“Now, about 67,000 pilgrims are left who will not be able to perform Hajj,” he said.\n\nThe Committee asked to write a letter to the prime minister about this issue and request a meeting, The Independent Urdu reported.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:39.526Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904882/only-23620-pilgrims-allowed-to-avail-private-haj-scheme-this-year-ministry",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T18:28:57.000Z"
}
