{
  "title": "Kulbhushan Jadhav got consular access after court martial, not appeal, Constitutional Bench told - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Defence Min­istry lawyer Khawaja Haris Ahmed on Wedn­esday informed the Sup­reme Court that Indian spy Kulbhushan Jadhav was not allowed the right to appeal in light of a 2019 International Court of Justice (ICJ) verdict, as the international court had only addressed the issue of consular access in that case.\n\nThe Indian spy’s case was mentioned before the Constitutional Bench in response to earlier arguments, claiming the right to appeal was provided to the Indian spy, but the same facility was not being extended to Pakistani citizens who had been convicted by the military courts for their involvement in the May 9, 2023 violence.\n\nAt The Hague, it was claimed before the ICJ that Pakistan was in breach of Article 36 of the Vienna Convention on Consular Relations 1963 for not providing the facility of consular access to foreign nationals accused of spying, the counsel told the seven-judge Constitutional Bench.\n\nAs a result, Pakistan enacted the International Court of Justice (Review and Re-consideration) Act 2021, Khawaja explained, adding the law allowed for the review and reconsideration of military court orders, including those related to foreign nationals, to ensure compliance with the Vienna Convention.\n\nHeaded by Justice Aminuddin Khan, the seven-judge Constitutional Bench had taken up a set of 38 intra-court appeals (ICAs) moved by the federal government, provincial governments, and the Shuhada Forum Balochistan, among others, against the Oct 23, 2023, judgement.\n\nJustice Muhammad Ali Mazhar recalled that the basis of the ICJ law was the enunciation by the superior judiciary, especially in the 2017 Said Zaman Khan case, in which more rights were provided to the accused.\n\nDuring the hearing, Justice Musarrat Hilali recalled how the Said Zaman judgement by the Peshawar High Court had initially irked the federal government, but was later cited as a defence before the ICJ in favour of Pakistan’s courts.\n\nThe judge even recalled how then-PHC chief justice Waqar Seth had received a phone call, informing him that his judgement was being quoted before the world court.\n\nMr Jadhav was captured in Balochistan in March 2016 and later confessed to his association with the Indian spy agency and his involvement in espionage and terrorism in Pakistan. In 2017, the Field General Court Martial (FGCM) had awarded him the death sentence, which was confirmed by the then army chief.\n\nThe AAG also informed the court that Attorney General for Pakistan (AGP) Mansoor Usman Awan was busy in deliberations over the question of providing the right to appeal before the superior courts to the convicts of May 9 incidents, for which he needed a couple of days.\n\nJustice Mazhar also wondered whether the right provided to the foreign national through the law was equivalent to Article 199 of the Constitution, and how they could be compared.\n\nArticle 199 (3) deals with the jurisdiction of the high court, but bars them from issuing orders in relation to a member of the armed forces or who was for the time being subject to any law relating to the armed forces.\n\nThe counsel explained that through the law, a window was opened to provide consular access to the Indian spy, while also conceding that it was a unique jurisdiction.\n\nJustice Jamal Khan Mandokhail again asked the counsel whether any proceedings against the accused could be initiated without the registration of FIRs and whether any provision in this regard existed in the Pakistan Army Act (PAA) 1952.\n\nThe counsel explained that under Section 157 of PAA, a court of inquiry was constituted. After the findings of the inquiry, the court martial proceedings were initiated against the accused, adding that there was no requirement for the registration of an FIR against people who were subject to PAA.\n\nThe counsel claimed that the procedure adopted by the military court in trying the accused on May 9 met the requirements of fair trial standards.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:09.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904756/kulbhushan-jadhav-got-consular-access-after-court-martial-not-appeal-constitutional-bench-told",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:31.000Z"
}
