{
  "title": "China and Pakistan - Newspaper - DAWN.COM",
  "author": null,
  "content": "HOW should Pakistan choose between the US and China? So far, a choice has not been foisted upon us, but the time is coming when it will be. Before that time arrives, it is a good idea to devote some structured thinking to the matter and be prepared to act.\n\nNot too long ago, a piece of advice was offered by Hina Rabbani Khar, one-time minister of state for finance and foreign minister of the country and an otherwise very smart individual whose words deserve to be taken seriously. In an internal memo that was leaked in April 2023, she cautioned against trying to appease the West and underlined the importance of maintaining the “real strategic” tie-up with China, despite mounting Western pressure. In a separate interview, Khawaja Asif echoed much the same thinking, emphasising the difficulty Pakistan faces in undertaking a rupture either way — with the US or with China.\n\nBut the time is drawing near when not making a choice will become harder and harder and it becomes necessary to make one. The imperatives driving the American trade war against China are powerful, and rooted in the emergence of China as a great power over the past quarter of a century, a fact that is not going to change any time soon regardless of what trade measures the Trump administration takes. The current round of the trade war may possibly settle down a bit, following an agreement between China and America. But the pause will be temporary before frictions flare up once again, because the underlying dynamic of a growing China and stalling America will still be there.\n\nThose in power understand how difficult this choice is for Pakistan to make. Pakistan earns its capital by participating in the markets of America and the European Union, and it spends this capital to purchase consumer goods as well as intermediate goods and machinery from China. We run a trade surplus with the US and EU and our largest trade deficit with China. On top of this, we get our bailouts from American-led institutions, with some top-ups from the Gulf kingdoms and a brief episode of rescue lending by China (which has now ended). Even these top-ups were dependent on Pakistan having an IMF relationship first.\n\nHow will Pakistan act when the time comes for it to choose between the US and China?\n\nSecond, and very importantly, Pakistan has long been the largest buyer of Chinese arms in the world. According to data from the Swedish think tank Sipri, Pakistan bought $5.28 billion worth of arms from China in the five years between 2019 and 2024. This was 81 per cent of Pakistan’s total weapons imports during this period, up by 7 percentage points from the previous five-year period before 2019.\n\nWith this arms relationship comes longer-lasting maintenance, upgrades and training relationships. Pakistan is critically dependent on Chinese supplies of spare parts to keep its stock of Chinese arms operational. This makes a rupture even more difficult to contemplate.\n\nMore than half of Pakistan’s bilateral external debt is owed to Chinese entities. This figure rises further if one takes liabilities into account as well, but for now let’s look only at the official obligations. Of $41.7bn in total external debt owed to bilateral creditors, $23.7bn is to China (including $8.2bn of swaps and deposits with the central bank). This is slightly less than a quarter of the total external debt of the country, a staggeringly high exposure through multiple instruments, and owed to multiple entities within China.\n\nGiven these exposures, it would be nearly impossible for Pakistan to make a clean break. Even an orderly reduction of these exposures, undertaken slowly over a longer period of time, would take many years to make any significant impact. Whichever way we look at it, Pakistan is deeply embedded with both the US and China.\n\nSo how would Pakistan handle matters when the time comes to choose? So far the country has successfully parried attempts to force a choice on it. For example, one unwritten condition coming with the IMF loans — something the IMF denies in its official capacity — is not to make Chinese debt repayments or service liabilities of Chinese investments in Pakistan during the programme period. This is one reason why Pakistan has accumulated large arrears with regard to its Chinese projects since 2019, and seeks rollovers of all maturing Chinese debt obligations as they come due.\n\nIn times to come, this demand could well be dilated upon. And Pakistan could find that not making a choice will be costlier than making one.\n\nOne obvious answer to the coming dilemma is to reduce our reliance on the episodic bailouts that Pakistan keeps needing every few years. That is where a significant share of the leverage that America has over Pakistan comes from. Other than the need for these bailouts, the debt exposure to the US is large, but indirect as it comes through multilateral creditors. And the trade exposure is also large, but in low-value-added products that are not likely to become a major sticking point in the superpower’s trade policy in the future. Those things can be managed much more easily.\n\nFrom China’s perspective, it seems that Pakistan has lost its shine. The country enjoyed some goodwill in China because of its role in helping bring about a thaw with the US, and its support during the years when China was shut out of the world. It also earned some goodwill in the speed and efficiency with which some CPEC projects were executed, earning the nickname of ‘Punjab speed’.\n\nBut all that is gone now. With the deaths of Chinese personnel at the hands of terrorists, coupled with repayment difficulties, China has wearied of Pakistan’s chronic demands for capital. The bailouts Pakistan requires every few years have now become the country’s Achilles heel, and unless we resolve this problem comprehensively, it will be the single biggest complicating factor in the stark decisions that lie ahead.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6800711e719aa.jpg",
  "retrievedAt": "2025-08-25T14:23:47.067Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904770/china-and-pakistan",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T03:11:58.000Z"
}
