{
  "title": "Hungary, Pakistan lift visa requirement for diplomatic passports - Pakistan - DAWN.COM",
  "author": null,
  "content": "Hungary and Pakistan agreed on Thursday to mutually lift the visa requirement for diplomatic passport-holders in each other’s countries as its foreign minister visited Islamabad.\n\nAccording to the Foreign Office (FO), Hungary’s Minister for Foreign Affairs and Trade Péter Szijjártó was on a one-day visit to Pakistan on the invitation of his counterpart Ishaq Dar. He is accompanied by a high-level business delegation to explore business opportunities in Pakistan.\n\nAddressing a joint press conference in Islamabad with Dar, Szijjártó said: “We are happy that we were able to sign the agreement to the visa requirement for diplomatic passport-holders. We have done it because we want our relation to be even more intensified.”\n\nAccording to state-run Radio Pakistan, the countries agreed on mutual visa exemption for holders of diplomatic passports. Two memorandums of understanding (MoUs) were also signed for cooperation in the culture and archaeology sectors.\n\nPakistan and Hungary agreed to enhance their cooperation across various fields and strengthen collaboration at multilateral forums, including the United Nations, the report added.\n\nIt stated that Szijjártó expressed satisfaction over the doubling of trade between the two countries, and noted the completion of food security and water management projects in Pakistan by Hungarian companies.\n\n“We are also offering four hundred scholarships to Pakistani students every year,” the minister was quoted as saying.\n\nStating that agreements were signed in the fields of culture and archaeology, Szijjártó noted Pakistan and Hungary had “rich histories”. “Both countries have made serious sacrifices in order to ensure independence [and] sovereignty,” he added.\n\nTerming Pakistan as a reliable partner, Szijjártó said: “Hungary stands up for the extension of [Pakistan’s] GSP+ programme […] beyond 2027 as well, and I think this is a mutual interest of both of us.”\n\nIn a post on X following his meeting, the Hungarian minister thanked Dar for his “hospitality as we mark 60 years of diplomatic relations with Pakistan”.\n\n“The agreements signed today are based on mutual respect, sovereignty and our shared conviction that dialogue must replace lecturing and interference in global politics,” he reiterated.\n\nAddressing the press conference, Dar said both sides have a common interest in cooperating in areas such as agriculture, energy, healthcare, information technology and industrial manufacturing.\n\nAccording to Radio Pakistan, the deputy prime minister said he apprised the Hungarian foreign minister on regional matters, including Pakistan’s principled position on the Jammu and Kashmir dispute, advocating for its resolution in line with UN Security Council resolutions.\n\nThe issue of terrorism and Afghan refugees was also addressed by Szijjártó, who hailed Pakistan’s efforts in countering the terrorism threat.\n\nThe minister stated that both countries have faced serious security challenges in their respective regions.\n\nHe said: “There’s still a big threat of terrorists coming from Afghanistan, and this threat of terror comes with the danger of launching further illegal migratory waves towards Europe.\n\n“Therefore, Hungary values and appreciates the efforts made by Pakistan,” he added, emphasising that they contributed greatly to Europe’s and global security.\n\nSpeaking about the three-year-old Russia-Ukraine war, Szijjártó said: “It’s shocking to see some European politicians trying to undermine the success of the peace negotiations in Ukraine.”\n\nHe called on European countries not to “undermine the peace efforts of [US] President Donald Trump when it comes to bringing peace back”.\n\nThe Hungarian minister stated that both sides believed in the importance of dialogue and that “mutual respect should be the basis of international politics”.\n\n“We do believe that the judgment, lecturing each other, cornering and criticising each other, which became the basis of international politics in recent years, have led to serious problems of global politics,” he added.\n\nSzijjártó called for promoting connectivity “instead of the world being divided into blocs again”.\n\nSzijjártó arrived in Islamabad earlier today, where he was received by Additional Secretary Europe Muhammad Ayyub, the Hungarian ambassador and other senior officials, the FO said on X.\n\nHe then attended the Pakistan-Hungary Business Forum in Islamabad, where expressed his country’s “strong desire to broaden cooperation with Pakistan across various sectors, including economy and trade”, Radio Pakistan reported.\n\nSzijjártó expressed the confidence that B2B meetings between the two sides today would prove successful, the report said. He also voiced support for Pakistan to remain a part of the Generalised System of Preferences Plus (GSP+) beyond 2027.\n\nAt the business forum, Commerce Minister Jam Kamal Khan expressed the confidence that B2B engagements would lead to meaningful partnerships and long-term ventures between both countries, Radio Pakistan said.\n\nKamal acknowledged the value of Hungary’s technological expertise, innovation and industrial capacity.\n\nThe FO, in a press release issued yesterday, said: “Deepening collaboration in economic, trade, energy and investment sectors is the focus of the two governments.\n\n“Pakistan attaches high importance to bilateral relations with Hungary, which have gained strength due to regular high-level exchanges and commonality of views on regional and international issues,” it stated.\n\nThe FO noted that 2025 marks the 60th year of the establishment of diplomatic relations between the two countries.\n\n“An important hallmark of strong bilateral relations has been Hungarian oil and gas company MOL’s successful investment in Pakistan since 1999,” it highlighted.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1715031818385cd.png",
  "retrievedAt": "2025-08-25T14:23:46.705Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904840/hungary-pakistan-lift-visa-requirement-for-diplomatic-passports",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T08:22:49.000Z"
}
