{
  "title": "Sindh lawyers set to begin ‘long march’ against canals project today - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The legal fraternity is gearing up for a sit-in on the Babarlo bypass located between Sukkur and Khairpur in protest against the construction of six canals on the Indus River.\n\nThe lawyers urged all political parties and members of the civil society to join them in their protest.\n\nThe call was given on Wednesday in a press conference held by the Karachi Bar Association (KBA) at their office.\n\nThe KBA leaders said that they had launched the second phase of their “non-violent civil resistance campaign” and they were prepared to begin their “long march” on Thursday (today) towards the Babarlo bypass.\n\nAll motorway routes from Sindh to the rest of Pakistan will be blocked peacefully, the lawyer leaders warned.\n\nKBA General Secretary Rehman Korai urged all political parties and members of civil society to participate in the sit-in against the controversial six canals project.\n\nKBA President Aamir Nawaz Warraich said that the protest would remain peaceful; however, if the government resorted to illegal actions, they would respond accordingly.\n\nHe announced that on Thursday they would begin their long march from the Sindh High Court parking area and proceed towards the Babarlo bypass, where they would stage a sit-in.\n\nThe protest would continue until the government rolled back the six canals and addressed other pending matters, he warned.\n\nSHCBA’s sit-ins on April 18\n\nThe Sindh High Court Bar Association on Wednesday announced that the lawyers would stage sit-ins on the National Highway in Rohri and Shikarpur on April 18 against the planned construction of new canals on the Indus and corporate farming.\n\nA statement issued by SHBCA president Barrister Sarfaraz Ali Metlo and secretary Mirza Sarfaraz Ahmed said that in a resolution, unanimously passed in the All Pakistan Lawyers and Stakeholders Convention on April 11, the bar had rejected the construction of canals and corporate farming.\n\nThe SHCBA had also urged the federal government to abolish the canals project within a week otherwise the lawyers will initiate protests.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:53.359Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904673/sindh-lawyers-set-to-begin-long-march-against-canals-project-today",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:52:15.000Z"
}
