{
  "title": "Peace, liberty in country today result of soldiers’ sacrifices, says army chief - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff General Asim Munir on Thursday asserted that the “peace and liberty” in the country today was the result of sacrifices made by soldiers.\n\nThe army chief made the remarks during an investiture ceremony held at the General Headquarters (GHQ) in Rawalpindi today, according to a press release issued by the military’s media affairs wing.\n\nThe Inter-Services Public Relations (ISPR) said COAS Munir conferred military honours, including Sitara-i-Imtiaz (military) and Tamgha-i-Basalat, on officers and soldiers of the Pakistan Army in “recognition of their exceptional valour in operations and distinguished service to the nation”.\n\nDuring the ceremony, which was attended by a “large number of senior military officials and families of the award recipients”, medals awarded posthumously were also received by the martyrs’ families.\n\nPaying homage to the martyrs and veterans, the COAS was quoted as saying: “Shuhada (martyrs) and ghazis (warriors) are our enduring pride. Their honour and reverence are a sacred trust upon every Pakistani.\n\n“The peace and liberty we cherish today are the result of the ultimate sacrifices rendered by these valiant sons of the soil.”\n\nCOAS Munir also expressed “profound admiration for the resilience and fortitude” of martyrs’ families, acknowledging their unparalleled sacrifices for the homeland, the ISPR stated.\n\nIt added that the army chief commended the “unyielding resolve” of the Pakistan Army and law enforcement agencies (LEAs).\n\nHe also appreciated their “relentless efforts in thwarting multiple terrorist threats and eliminating high-value terrorist operatives during ongoing counterterrorism operations”.\n\nGen Munir’s remarks come just two days after he vowed to remove “whatever stands in the way of Pakistan’s progress” and reaffirmed the state’s determination to counter terrorism.\n\n“Do Pakistan’s enemies think that a handful of terrorists can decide the fate of Pakistan?” he said, adding that “even ten generations of terrorists cannot harm Balochistan and Pakistan”.\n\nPakistan ranked second in the Global Terrorism Index 2025, with the number of deaths in terrorist attacks rising by 45 per cent over the past year to 1,081.\n\nMilitant violence and security operations intensified in the country in March, with the number of militant attacks surpassing 100 for the first time since November 2014, according to a report by the Pakistan Institute for Conflict and Security Studies (Picss).\n\nIn the most recent major attack, at least three policemen were martyred and 20 others were injured on Tuesday morning as a blast targeted a vehicle of the Balochistan Constabulary in Balochistan’s Mastung district.\n\nAlso the same day, eight people, including three security personnel and five residents, were injured after a roadside bomb targeted a vehicle of the Frontier Corps (FC) in Khyber Pakhtunkhwa’s Bajaur district.\n\nIn a separate development, Chairman Joint Chiefs of Staff Committee (CJCSC) General Sahir Shamshad Mirza met with Chief of Staff Lt Gen Issa Al Mazrouei of the United Arab Emirates (UAE) yesterday during his official visit to the Gulf country.\n\nH also met with UAE’s Minister of State for Defence Mohammed Fadal Al Mazrouei, and Nasser Humaid Al Nuaimi, secretary general of the government’s Tawazun Council, the ISPR said in a press release.\n\nThe discussions during the separately-held meetings focused on the regional security environment and the strengthening of bilateral defence cooperation, the statement said.\n\nCJCSC Mirza also visited the Tawazun Industrial Park and witnessed different manufacturing facilities.\n\n“The civil and military leadership of UAE appreciated the professionalism of Pakistan Armed Forces and lauded their sacrifices in the fight against terrorism”, the ISPR added.\n\nLast year in December, the CJCSC visited Kuwait, where he called on the Prince of Kuwait Sabah Al-Khaled Al-Hamad to discuss bilateral issues and defence cooperation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/17123047f87d777.png",
  "retrievedAt": "2025-08-25T14:23:46.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904836/peace-liberty-in-country-today-result-of-soldiers-sacrifices-says-army-chief",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T07:13:36.000Z"
}
