{
  "title": "KE urges Nepra not to pass on full benefit of fall in fuel cost to consumers - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: K-Electric asked the National Electric Power Regulatory Authority (Nepra) on Wednesday not to pass on the full benefit of Rs6.62 per unit decrease in fuel cost in February to consumers and instead settle it against its past claims.\n\nThe Nepra was holding a public hearing on monthly fuel cost adjustments (FCA) for electricity consumed in February, which showed the consumer had been overcharged to the extent of Rs6.62 per unit involving an amount of Rs6.662 billion.\n\nUnder automatic monthly FCA, the KE consumers qualify for a Rs6.62 per unit refund in the coming month. The KE team, which comprised its chief executive officer Moonis Alvi, chief financial officer Amir Ghaziani and finance director Ayaz Jafar, reported that Rs13.9bn on account of partial load, degradation of power plants for the period July 2023-February 2025 had been pending for independent verification.\n\nOf that, the Nepra had already set aside Rs9.4bn in its previous FCA decisions for November 2024 to January 2025. The remaining Rs4.5bn should now be adjusted by withholding transfer of lower FCA benefit for February to consumers.\n\n“The outstanding Rs4.5bn accumulated actualisation of fuel cost be withheld now instead of passing on R6.62 per unit in full to consumers so that they do not face higher bills in peak summer,” Mr Jafar asked the regulator.\n\nIt was reported that major reduction in FCA for February was because of 82 per cent (about 1600mw) cheaper power intake from the national grid in February 2025 compared to a reference 1000mw import from the national grid assumed in March 2023. Other fuels were also lower than estimated.\n\nIndustrialist Arif Bilwani protested over rejection of his review petition regarding K-Electric’s two-part tariff, including loan write-offs by the regulator, on grounds that he was not a direct party to the KE’s petition. An official of the regulator told the hearing that though his request for review stood rejected, the contents would be made part of the Nepra determination.\n\nDrought conditions\n\nMr Bilwani also pointed out that given drought conditions and unfavourable hydrological conditions, the KE and the national grid should have an overview of how the fuel costs would unfold in coming months so that industrialists, particularly exporters, could plan their production lines.\n\nTanveer Barry, a representative from the Karachi Chamber of Commerce & Industry, said KE’s adjustment of actual fuel cost based on partial load, open cycle operations, and degradation curves was not adequately justified as “independent auditors” were on the utility’s payroll.\n\nHe said the KEs arguments lacked quantitative and documentary backing, and contravene Nepra’s standard benchmark-based disallowance criteria.\n\nRegarding incremental package, Barry said incremental package has been passed on all over Pakistan, except Karachi, because KE got stay orders. He said the maximum amount of subsidy on incremental package was to be paid by the federal government, but the power division and Nepra were delaying the verification of amount to be paid by the government.\n\nHe said the process should be expedited so that required amounts could be secured through upcoming budget allocations.\n\nThe regulator will issue a decision later clarifying the FCA amount to be passed on to customer bills and the period for which they will be applicable. Fuel charge adjustments are incurred by utilities due to global variations in fuel prices used to generate electricity and the changes in generation mix.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:49.183Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904785/ke-urges-nepra-not-to-pass-on-full-benefit-of-fall-in-fuel-cost-to-consumers",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T03:30:07.000Z"
}
