{
  "title": "Dismal outlook for trade as US-China standoff deepens - World - DAWN.COM",
  "author": null,
  "content": "• WTO warns of ‘severe negative consequences’ after US slaps levies of up to 245pc on some Chinese sectors\n• In Malaysia, Xi reiterates call for unity against US ‘unilateralism and protectionism’\n\nGENEVA / WASHINGTON: Global trade is expected to plummet this year following US President Donald Trump’s tariff offensive, fuelling uncertainty that threatens “severe negative consequences” for the world, the World Trade Organisation (WTO) warned on Wednesday.\n\nSince returning to office, Trump has imposed staggering tariffs on the imports of goods from around the world. But while he placed a brief pause on made a U-turn on steeper tariffs for dozens of countries, Trump has escalated a trade war with China, slapping 145 per cent levies on Chinese goods.\n\nBeijing has countered that with a 125 per cent duty on all US products.\n\nIn the latest bout of one-upmanship, the White House has said that China could face tariffs of up to 245pc. Trump initially imposed 20pc tariffs on imports from China over its alleged role in the fentanyl supply chain, then added 125pc over trade practices that Washington deems unfair.\n\n“If the US really wants to resolve the issue through dialogue and negotiation, it should stop exerting extreme pressure, stop threatening and blackmailing, and talk to China on the basis of equality, respect and mutual benefit,” Foreign Ministry spokesman Lin Jian said, reacting to the announcement.\n\nThe reciprocal tariffs add onto any existing tariffs already in place. For example, the Biden administration had placed a 100pc levy on Chinese Electric Vehicles. With the reciprocal tariffs accounted for, this is one sector that could face the maximum 245pc duty.\n\nTrump has also ordered a probe into potential new tariffs on all US critical minerals imports, which is being seen as a major escalation. The order lays bare what manufacturers, industry consultants, academics and others have long warned Washington about: that the US is overly reliant on Beijing and others for processed versions of the minerals that power its entire economy.\n\nChina is a top global producer of 30 of the 50 minerals considered critical by the US Geological Survey, for example, and has been curtailing exports in recent months.\n\nTrump signed an order directing Commerce Secretary Howard Lutnick to begin a national security review under Section 232 of the Trade Expansion Act of 1962.\n\nThat is the same law Trump used in his first term to impose 25pc global tariffs on steel and aluminum and one he used in February to launch a probe into potential copper tariffs.\n\nAsked for comment on the order, China’s foreign ministry said on Wednesday that “artificial interference in the supply chain violates the laws of the market economy and international trade rules.”\n\nMeanwhile, Chinese President Xi Jinping continued to call on Asian nations to unite in resisting geopolitical confrontation, unilateralism and protectionism, as he aims to consolidate ties with some of China’s closest neighbours.\n\nPresident Xi is in Malaysia as part of a three-nation Southeast Asian trip that includes Vietnam and Cambodia.\n\n“In the face of shocks to the current international order and economic globalisation, our two nations will stand united with other countries in the region to jointly resist the undercurrents of geopolitical and camp-based confrontation, overcome the countercurrents of unilateralism and protectionism, and safeguard the promising prospects for development in our shared Asian home,” he said at an event with Malaysian PM Anwar Ibrahim.\n\nHe did not directly refer to the United States in his remarks in Kuala Lumpur.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:09.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904754/dismal-outlook-for-trade-as-us-china-standoff-deepens",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:06.000Z"
}
