{
  "title": "Sindh slams Punjab for diverting water during shortage - Pakistan - DAWN.COM",
  "author": null,
  "content": "• CM Murad terms Punjab’s move ‘irresponsible’\n• No water in Sindh for cotton, rice crops, irrigation minister tells Centre\n• Irsa claims all decisions taken in accordance with law\n• Naveed Qamar says real issue is water diversion for one canal, not all canals\n\nKARACHI: The canals controversy has deepened with Sindh Chief Minister Syed Murad Ali Shah strongly criticising the Punjab government for increasing water being diverted to Taunsa-Panjnad (TP) Link Canal, while the Indus Water Regulatory Authority (Irsa) claimed to have taken all decisions as per law.\n\nThe chief minister also called the Punjab’s move ‘irresponsible’, as Sindh Irrigation Minister Jam Khan Shoro wrote a letter to the federal government and Irsa to condemn the “unauthorised div­e­rsion of water from the Indus River”.\n\nThis was a second protest letter sent to Irsa from Sindh in as many days on the issue of water diversion. A previous letter, written by a government official a day earlier, pointed out that water availability in Jhelum-Chenab system was much more than in the Indus system during the first 10 days of April, yet water was being taken from the Indus.\n\nTalking to the media after inaugurating the modern Comprehe­nsive Cancer Centre at the Dow University of Health Sciences on Wednesday, the Sindh chief minister slammed the Punjab government for opening the TP Link Canal at a time when the lower riparian province of Sindh was experiencing a severe water shortage at its barrages.\n\n“We are currently facing a 50 per cent shortage of water. In such a situation, opening the TP Link Canal is ‘irresponsible’,” he said, adding that Punjab was weakening its own case, while Sindh’s position was getting stronger.\n\nHe said Sindh’s protest would continue until the formal announcement of closure of the canal projects.\n\nMeanwhile, Sindh Irrigation Minister Jam Khan Shoro stated that the Punjab government had increased the water withdrawal by 1,000 cusecs and the Sindh government had decided to protest to the federation.\n\nIn a letter addressed to the federal government and Irsa, the provincial irrigation minister condemned the unauthorised diversion of water from the Indus River, terming it “a clear violation of the agreed water distribution framework”.\n\nHe said that the provincial government sent a protest letter to the federal government and Irsa, as 3,800 cusecs of water was being taken from the Indus River through the TP Link Canal at present, indicating 1,000-cusec increase in amount of water.\n\n“There is no water for cotton and rice crops in Sindh,” he told Dawn on Wednesday.\n\nShortfall at Sukkur, Kotri\n\nThe minister explained that water shortfall at Sukkur Barrage was 4,000 cusecs, while it was around 2,300 cusecs at Kotri Barrage. “The federation and Irsa are continuing to do injustice to Sindh,” he alleged. He said this water was being taken from the share of Sindh rather than drawing it from Punjab’s own allocated share to feed the Jhelum-Chenab river system.\n\n“At a time when Sindh is already facing an acute shortage of water needed for the cultivation of essential crops such as cotton and rice, this arbitrary increase in water withdrawal is exacerbating the crisis for our farmers and threatening the province’s agricultural stability,” the minister deplored.\n\nMr Shoro said that at Sukkur Barrage, the province was currently facing a shortfall of 4,000 cusecs, while Kotri Barrage was receiving 2,300 cusecs less than its due share.\n\nHe said that the Sindh government reiterated its demand that the TP Link Canal be closed immediately and that any increase in flows through this canal must be halted to protect Sindh’s water rights.\n\nThe Sindh government also urged Irsa to ensure fair and transparent implementation of water-sharing arrangements between the provinces.\n\nIrsa’s decisions\n\nHowever, in a separate press release, Irsa clarified that the Authority was taking all decisions in accordance with Water Apportionment Accord 1991 and Irsa Act 1992 as per law.\n\nIt said the authority had also passed a resolution reposing full confidence in its chairman and members.\n\nNot all canals\n\nSpeaking to DawnNewsTV, PPP leader Syed Naveed Qamar said there was a confusion over canals issue. “The main issue is that of Cholistan Canal, particularly the diversion of water from downstream Indus to all barrages of Sindh and some parts of Punjab as well. We will not only condemn the diversion, but will also not let this happen,” he said.\n\nAsked if the issue being raised by Sindh is that of one canal only and not six canals, Mr Qamar said, “The controversy is about just one canal.” Some of the remaining canals are for Sindh and Balochistan, he added. “If you focus [on the real controversy], the issue is about the diversion of water, and not that of abandoning any specific project,” he said.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:08.088Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904748/sindh-slams-punjab-for-diverting-water-during-shortage",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:46.000Z"
}
