{
  "title": "Judges transferred to IHC not to hire lawyer to defend seniority case, SC told - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three judges of the Islamabad High Court (IHC) have chosen not to hire lawyers as the Supreme Court’s Constitutional Bench heard a case related to their transfer to the apex court and subsequent changes in the seniority list.\n\nThe bench — headed by Justice Muhammad Ali Mazhar and comprising Justices Naeem Akhtar Afghan, Shahid Bilal Hassan, Salahuddin Panhwar, and Shakeel Ahmed — took up petitions filed by five IHC judges, the Karachi Bar Association (KBA) and the IHC Bar Association, among others.\n\nIn February, Justice Sardar Mohammad Sarfraz Dogar from the Lahore High Court (LHC), Justice Khadim Hussain Soomro from the Sindh High Court (SHC) and Justice Muham­mad Asif from the Balochistan High Court (BHC) were transferred to the IHC. The controversy centres around the alteration of the judges’ seniority list after these transfers as Justice Dogar was made the senior puisne judge, which paved the way for his appointment as the acting IHC CJ after Justice Aamer Farooq’s elevation to the SC.\n\nThe federal government had already submitted a written response, in which it requested that the SC reject the petitions.\n\nIn the previous hearing, the court had issued notices to the three judges, the attorney general, and the registrar office of all four high courts.\n\nAt the outset of today’s hearing, Justice Mazhar remarked that the three judges had been sent notices and inquired where their lawyers were.\n\nTo this, the Attorney General Mansoor Usman Awan replied that he had received a message from all three judges saying that they have decided not to appoint a lawyer, and that they would accept whatever decision is made by the Constitutional Bench.\n\nHe also informed the SC that a permanent chief justice of the IHC is not being appointed, nor is this on the agenda of the Judicial Commission.\n\n“The commission is informed 14 days in advance for the appointment of a permanent chief justice. Currently, the chief justice is not being appointed,” the attorney general said.\n\nHe further said that the judicial commission would take up the matter of appointing a chief justice to the Peshawar High Court and BHC in their meeting on May 2.\n\nAdvocate Faisal Siddiqui said he had not made any request for the IHC Bar Association’s application to be withdrawn, and it had been withdrawn without his instructions to do so.\n\nJustice Mazhar said the executive council of the IHC Bar Association passed a resolution to withdraw the application.\n\n“The affected judges have filed a separate application themselves. According to the Bar Association resolution, the association’s application was filed without the permission of the executive council,” Justice Mazhar said.\n\nAdvocate Siddiqui said his statements should be part of the record, to which Justice Mazhar said: “If the bar itself is withdrawing the application, what can anyone else do?”\n\nThe court then dismissed the IHC Bar Association’s application based on its withdrawal.\n\nJustice Mazhar then inquired whether any provincial government had submitted a written response.\n\nThe Khyber Pakhtunkhwa Advocate General said they support the constitutional requests of the IHC judges. Justice Mazhar reiterated his question, to which the KP Advocate General said he has yet to submit a response.\n\nJustice Mazhar said he noticed that all relevant parties had received notices and the bench would not take long to decide.\n\nWhile speaking to Advocate Munir A. Malik, who was representing the five IHC judges, Justice Mazhar said: “We need to hear from you; we will resume daily hearings from Tuesday.”\n\n“The federal government has submitted a written response. However, the federal government has not submitted a statement of willingness of the transferred judges in its response.\n\n“The statement of willingness of the Chief Justice of Pakistan and the concerned chief justices, including the president, has not been submitted on this issue,” he said.\n\nThe attorney general said the entire process has taken place with the consent of everyone and is not controversial.\n\n“If this matter is not controversial, then you should submit a statement of willingness,” Justice Mazhar said, which the attorney general agreed he would do.\n\nJustice Afghan remarked: “We need to see where this matter stemmed from.”\n\nThe court then adjourned the hearing till April 22.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:42.525Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904841/judges-transferred-to-ihc-not-to-hire-lawyer-to-defend-seniority-case-sc-told",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T12:10:21.000Z"
}
