{
  "title": "Paramilitaries declare own ‘govt’ in Sudan - World - DAWN.COM",
  "author": null,
  "content": "CAIRO: Two years into a war that has left tens of thousands dead, Sudan’s RSF paramilitary force on Tuesday announced its own government to rival the army-backed administration it is battling.\n\nThe Rapid Support Forces, headed by Mohamed Hamdan Daglo, the former deputy to the regular army leader Abdel Fattah al-Burhan, announced the rival government amid growing international fears that Sudan could become split between the two sides, who have both been accused of abuses.\n\n“On this anniversary, we proudly declare the establishment of the Government of Peace and Unity, a broad coalition that reflects the true face of Sudan,” Daglo said in a Telegram statement. The RSF and its allies signed a charter in Kenya in February declaring a “government of peace and unity” in areas they control.\n\nThe United Nations expressed concerns that the worsening conflict in Sudan could “deepen the fragmentation” of the country, the spokesman for Secretary General Antonio Guterres said, a day after announcement of rival government.\n\n“We are extremely concerned about any further escalation in the Sudanese conflict, including steps which could deepen the fragmentation of the country and further entrench the crisis,” said the spokesman, Stephane Dujarric. Guterres’s spokesman added that there was a need to end the conflict “and establish acceptable transitional arrangements.”\n\nDaglo’s latest statement said the paramilitaries, with “civil and political forces”, had signed a transitional constitution, that was a “roadmap for a new Sudan”. That constitution provides for a 15-member presidential council “representing all regions, symbolising our voluntary unity”. Analysts have warned that Africa’s third-biggest nation could permanently splinter. With the RSF emboldened in Darfur, “the territorial division that’s occurring could mean a de facto separation,” said Sharath Srinivasan, a professor at Cambridge University who studies Sudan.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/17101735f3ba704.jpg",
  "retrievedAt": "2025-10-12T02:35:25.096Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904729/paramilitaries-declare-own-govt-in-sudan",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:52:07.000Z"
}
