{
  "title": "Doctor charged with killing 15 patients in Berlin - World - DAWN.COM",
  "author": null,
  "content": "BERLIN: Prosecutors said on Wednesday they charged a Berlin palliative care doctor with the murder of 15 patients, alleging he acted out of a “lust” for killing.\n\nThe 40-year-old suspect is accused of having killed 12 women and three men between September 2021 and July 2024 using a deadly cocktail of sedatives. German press reports identify the suspect as Johannes M., but prosecutors have not released a name.\n\nThe doctor allegedly “administered an anaesthetic and a muscle relaxant to his patients... without their knowledge or consent”, the Berlin prosecutor’s office said in a statement.\n\nThe relaxant “paralysed the respiratory muscles, leading to respiratory arrest and death within minutes”. The victims, who were all receiving care at the time, were aged between 25 and 94 years old.\n\nOn five occasions, prosecutors alleged that the suspect had “set fire to their apartments to cover up these killings”.\n\nOn one occasion, the suspect is accused of having killed two patients on the same day.\n\nOn the morning of July 8, 2024, he is alleged to have killed a 75-year-old man at his home in the central Berlin district of Kreuzberg. “A few hours later” he allegedly struck again, killing a 76-year-old woman in the neighbouring Neukoelln district.\n\nThe suspect’s alleged attempt to incinerate the crime scene failed when the fire did not catch, prosecutors said. “When he noticed this, he reportedly informed a relative of the woman, claiming that he was standing in front of her apartment and that no one had responded to his ringing,” they said.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:35:11.418Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904737/doctor-charged-with-killing-15-patients-in-berlin",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:52:07.000Z"
}
