{
  "title": "Afghan envoy says Kabul ready to take care of returning refugees - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Afghan consul general in Peshawar Hafiz Muhibullah Shakir on Wednesday said the interim government in Kabul was prepared to “take care” of Afghan refugees on return from Pakistan.\n\nHe also said a high-level delegation of the interim Afghan government would soon visit Islamabad to discuss mechanisms for the repatriation of Afghan refugees from Pakistan.\n\n“They [refugees] are worried that after living here [in Pakistan] for 45 years, they fear facing issues in Afghanistan, but let me assure them that won’t happen,” Mr Shakir told a news conference at the Afghan consulate here.\n\nThe Afghan consul general said the interim Afghan government would take care of refugees on homecoming.\n\nSays Afghan delegation to discuss repatriation with officials in Islamabad\n\nHe said a commission, consisting of 12 committees with members from almost all departments, had been formed to address issues related to the repatriation of Afghan nationals from Pakistan.\n\n“They [refugees] would have faced issues only had there been Russians or Americans in power in Afghanistan, but this won’t happen as it’s us [Afghans] in power there. The journey has begun. There is peace, and there is no problem,” he said, adding that the Afghans will rebuild their country together.\n\nThe Afghan consul general said the refugees, who lacked accommodation across the border, would be accommodated in camps established for them.\n\nHe said besides the Afghan government, philanthropists had also come forward and announced building houses and assisting the returning Afghan nationals in managing businesses.\n\nWhen asked about those Afghan nationals, who had lived for decades in Pakistan and established businesses besides owned properties, Mr Shakir said that the delegation visiting Pakistan would hold talks on how to address those problems as, besides businesses and properties, some Pakistan might owe things to Afghan nationals and some Afghan nationals to Pakistanis.\n\nHe also said that the first phase of the repatriation of Afghans from Pakistan was always difficult but it had begun and the problems would be resolved.\n\nAlthough the first phase of repatriation of unregistered Afghan nationals began in September 2023, a second phase was also launched on April 1 when the deadline for repatriation of ‘registered’ Afghan refugees expired on March 31.\n\nAccording to official documents, 509,267 Afghan nationals, including 22,148 Afghan citizen cardholders, have left for Afghanistan since Sept 2023, while repatriation of both ACC holders and illegal Afghan nationals is still under way.\n\nOn Monday, the Afghan foreign ministry expressed concerns and urged Pakistan to stop forced deportation of Afghan refugees living in Pakistan.\n\nThe Bakhtar News Agency quoted the Afghan ministry for foreign affairs as saying that Afghan Foreign Minister Mawlavi Amir Khan Muttaqi met Pakistan’s acting ambassador to Kabul Obaidur Rehman Nizamani to discuss key political and economic issues.\n\nIt added that Mr Muttaqi expressed concerns and disappointment over forced deportation of Afghan refugees and the mistreatment by certain Pakistani authorities, calling such behaviour provocative and harmful to bilateral relations. He called for a change in the approach.\n\nMr Nizamani acknowledged the concerns and said that the issue would be shared with relevant authorities in Pakistan. Both sides also emphasised the importance of taking mutually constructive steps and encouraged high-level visits and dialogue to strengthen ties.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:51.795Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904695/afghan-envoy-says-kabul-ready-to-take-care-of-returning-refugees",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:52:39.000Z"
}
