{
  "title": "Govt to seek fresh bids for PIA next week: privatisation ministry - Pakistan - DAWN.COM",
  "author": null,
  "content": "The government will publish an advertisement next week to attract new bidders for the privatisation of Pakistan International Airlines (PIA), the privatisation ministry said in a statement on Wednesday.\n\nThe government’s failed first attempt to privatise PIA cost the national exchequer $4.3 million, the National Assembly Standing Committee on Privatisation was informed on February 26.\n\nLast month, Privatisation and Investment Minister Abdul Aleem Khan said that the government would complete all the steps to privatise PIA by May, while the pri­vatisation commission approved a transaction structure for the second attempt to privatise the national carrier based on a divestment of 51 to 100 per cent of its shares of capital.\n\nAccording to a statement from the ministry, the privatisation commission had a meeting today, chaired by Muhammad Ali, commission chairman and the Adviser to the Prime Minister on Privatisation.\n\n“The Board approved the pre-qualification criteria for selection of potential bidders for privatisation of 51pc to 100pc shares of Pakistan International Airlines Corporation Limited (PIACL),” the statement read. “A fresh advertisement for [the] expression of interest for the demerger of PIACL is planned to be published next week.”\n\nThe statement added that the meeting will continue tomorrow “to consider the remaining items on the agenda”.\n\nEarlier this month, a PIA spokesperson said that the carrier’s bo­­ard of directors approved its fin­ancial results for 2024, which showed the airline achieving a net profit after around 21 years.\n\nAccording to the results for FY2024, PIA earned an operational profit of Rs3.9 billion and a net profit of Rs2.26bn. The airline’s operating margin was more than 12pc, which is on a par with the performance of any of the best airlines in the world, the spokesperson said.\n\nPIA began to be unprofitable in 2011, requiring government subsidies. By the end of 2016, the national flag carrier was saddled with $3bn in debt. At the end of 2018, the airline was burdened with $3.3bn in debt, up from $2.97bn the year before. Government bailouts were required for the carrier’s continued operation.\n\nLast year in June, the then-government had agreed to overhaul loss-making state-owned enterprises, including PIA, under a deal with the International Monetary Fund (IMF) for a $3bn bailout. But in February 2024 — right before the general elections — the election commission had asked the then-caretaker administration to “refrain” from finalising the deal.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:40.899Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904869/govt-to-seek-fresh-bids-for-pia-next-week-privatisation-ministry",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T14:43:22.000Z"
}
