{
  "title": "Commonwealth jackpot as seven nations battle for future Games - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Commonwealth sport has hit the jackpot with seven nations across four continents jostling to host future editions of the Commonwealth Games, as the race for the prestigious centennial 2030 celebration heats up.\n\nCanada, India, and Nigeria had already publicly thrown their hats into the 2030 ring, with two mystery nations also now in the mix, the governing body said on Wednesday.\n\nMeanwhile, two additional expressions of interest target future Games, including New Zealand, which has set its sights on 2034.\n\n“We are thrilled with the incredible interest from around the Commonwealth,” CEO Katie Sadleir said on Wednesday. “This positive response from four of our six regions underlines the importance and significance of the Commonwealth Games and its position as the major multi-sport event in the world sporting calendar alongside the Olympic Games and Paralympics.”\n\nThe flurry of interest follows a challenging period for the event after Australia’s Victoria state withdrew as 2026 hosts, citing cost concerns. Scotland stepped in with Glasgow taking the reins for 2026.\n\n“We cannot understate the hugely significant role Scotland has played in this change,” Sadleir added. “Glasgow 2026 will be a bridge to the Games of tomorrow an important first step in our journey to reimagine and redefine the Games.”\n\nCommonwealth Sport launched a new collaborative selection process in January, moving away from traditional bidding to allow potential hosts more flexibility and innovation.\n\n“Considering the high level of interest, we will now discuss each submission further,” said Darren Hall, Director of Games and Assurance.\n\nThe next five months will see candidates developing detailed proposals, with Commonwealth Sport aiming to recommend a 2030 host for approval at its General Assembly in Glasgow in November 2025.\n\nThe new hosting framework promises reduced costs, flexible programming, and continued commitment to Para sports, with organisers hoping the reimagined model will enable more diverse nations to stage the Games in future.\n\nThe Commonwealth Games, first held in 1930 as the British Empire Games in Hamilton, Canada, brings together athletes from Commonwealth nations and territories every four years.\n\nThe event has grown to feature over 70 teams competing in more than 20 sports, with the most recent Games held in Birmingham, England in 2022.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:34:52.291Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904721/commonwealth-jackpot-as-seven-nations-battle-for-future-games",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:59.000Z"
}
