{
  "title": "Punjab announces Rs15bn package for wheat farmers - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Financial support to be made through Kisan Card\n• Farmers’ bodies reject initiative, say it will benefit millers\n\nLAHORE: The Punjab government announced on Wednesday a package of Rs15bn for farmers amid reports of falling wheat prices at the time of harvesting, with growers holding rallies in different parts of the province.\n\nUnder the Wheat Support Fund, 550,000 wheat farmers will be given direct financial support through the Kisan Card.\n\nThe government also announced an exemption for wheat farmers from paying irrigation/fixed tax during the current year. Under the package, free storage Electronic Warehouse Receipt (EWR) facility will be provided for four months to protect wheat from climate change effects and farmers from market pressure.\n\nThe government decided to implement the EWR system in the province. The farmers storing wheat under this system will get an electronic receipt. Within 24 hours, this receipt can be given to the bank to obtain a loan up to 70 per cent of the total cost (of wheat stored).\n\nIt also decided to pay a markup against loans obtained from the Bank of Punjab up to Rs100bn to flour mills and green license holders for wheat purchase.\n\nThe cabinet’s approval will be sought for immediate and mandatory purchase of wheat by flour mills and green licence holders. Wheat storage up to 25 per cent of the total storage capacity has been made mandatory.\n\nPunjab decided to contact the federal government for the export of wheat and wheat products. The Bank of Punjab will provide financing to the private sector for the renovation and construction of warehouses for wheat storage.\n\nThe Punjab government will pay a markup of Rs5bn to provide storage facilities to the wheat farmers. The ban on transportation of wheat and flour at provincial and district borders has been lifted.\n\nChief Minister Maryam Nawaz expressed her resolve that she would not let farmers suffer any loss. Last year, the Punjab government did not buy wheat due to grain imports during the caretaker government led by Mohsin Naqvi. This led to considerable drop in wheat price.\n\n‘Package to benefit feudal lords’\n\nMeanwhile, Pakistan Kissan Rabita Committee general secretary Farooq Tariq rejected the government’s package, saying the farmers needed Rs4,000 per maund wheat rate.\n\n“This Rs15bn package is aimed at benefiting the feudal lords and influential persons and not farmers,” Mr Tariq claimed.\n\nFarmers Itehad central chairman Khalid Hussain Baath has also rejected the package.\n\n“This is not a package for farmers, but for capitalists. The EWR system is designed to benefit of the wealthy, while it exploits small farmers,” he said.\n\n“Farmers in villages don’t have storage facilities — this system is bound to fail. This package isn’t for wheat procurement, it’s a vehicle for corruption,” he said.\n\n“Five billion rupees are being handed over to capitalists in advance. The real beneficiaries of this package will be flour mills and green license holders, not the farmers,” Baath said.\n\n“The EWR system is economically murdering farmers. By dismantling the systems of Passco and the Food Department, the government is inviting disaster. The farmer has been given neither a fair price nor any guarantees,” he declared.\n\n“No official rate has been fixed — farmers are being left at the mercy of exploitation. This isn’t a relief package, it’s a continuation of anti-farmer policies. We urge the chief minister and the PM to immediately review this decision,” he demanded.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:09.664Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904755/punjab-announces-rs15bn-package-for-wheat-farmers",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:31.000Z"
}
