{
  "title": "Double-edged sword - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE generous ‘incentives package’ for Pakistani expats, announced by Prime Minister Shehbaz Sharif, is yet another symptom of the Dutch disease afflicting Pakistan’s economy. In our case, however, the disease is not linked to natural resources, which mostly remain unexplored, but to the growing reliance on workers’ abroad to stay afloat.\n\nAmid drying up foreign loan and aid flows, the dependence on remittances has had a major role in crowding out manufacturing and exports, leading to deindustrialisation over more than a decade. The package for overseas Pakistanis comprises special courts to address their cases, age relaxation in government jobs, medical college quotas for their children, relief in banking and business transaction taxes, green channel facilities at airports, civil awards, etc. It is intended to salute their contribution, in the shape of remittances, to Pakistan’s development. Separately, the government has lifted the 3pc federal excise duty on real estate transactions, which will indirectly benefit the expats, who are major investors in the property sector, as well as the developer mafia.\n\nHow does it make any sense to incentivise consumption and unproductive real estate investments — which form the core of our economic troubles — by them? Media coverage of the two-day Overseas Pakistanis Convention did not reveal any inclination on the part of the 1,200 participants from across the world to set up manufacturing units or invest in their motherland’s farm economy.\n\nNo doubt, in recent years, remittances have provided critical support to the current account. But they have also been a double-edged sword. On the one hand, they help us pay our burgeoning import bills and compensate for the dwindling foreign official and private inflows as well as stagnating exports; on the other, they are largely responsible for the rapid increase in imported consumption, unplanned urban sprawls, currency volatility, anti-export bias, etc.\n\nWith foreign investment having bottomed, remittances should be channelled into productive sectors to boost output and exports for a durable solution to the recurring balance-of-payments crisis. This can be done by making investment in industry and agriculture attractive through cost reductions, removal of policy distortions, creation of a business-friendly clime, tax reforms, policy consistency, etc. The policies governing these sectors should apply to all: local and foreign investors, as well as overseas Pakistanis. If the government wants to give incentives, these should be for those expats who are willing to bring their money home to invest in productive segments of the economy, not just in property. What is reflected in the incentive package is a Dutch disease that has made us lazy. Instead of fixing the economy through long-term structural reforms, our policymakers and politicians are again looking for shortcuts to achieve an economic turnaround.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:49.245Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904766/double-edged-sword",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T03:02:16.000Z"
}
