{
  "title": "UK police launch probe after 85 Muslim graves desecrated - World - DAWN.COM",
  "author": null,
  "content": "LONDON: British police have launched an investigation into what they have now confirmed is an Islamophobic hate crime, after 85 Muslim graves were desecrated at Carpenders Park Lawn Cemetery in Three Rivers, Hertfordshire.\n\nOfficers were first alerted to the damage in the morning of April 13. The vandalised graves were all located in a section of the cemetery reserved for Muslim burials, with many belonging to babies and young children.\n\nChief Superintendent Jon Simpson, head of Hertfordshire’s Local Policing Command, said the force had initially considered “several hypotheses” regarding the cause of the damage, but the inquiry had since led them to conclude the act was religiously motivated.\n\n“We are continuing to investigate every line of enquiry into this terrible crime, which we are now treating as an Islamophobic act,” Simpson confirmed.\n\nDesecration draws strong condemnation from community leaders, local govt officials\n\n“We would like to reassure those affected, and the wider Muslim community, that we are continuing to treat this crime extremely seriously.”\n\nThe investigation, police say, is ongoing in collaboration with Brent Council, which owns the cemetery, as authorities work to contact the families of those whose loved ones’ graves were targeted. Given the scale of the desecration and the possibility that many affected families no longer live locally, police have cautioned that this process will take time.\n\nSergeant Irfan Ishaq, Chair of the Hertfordshire Association of Muslim Police (HAMP), underscored the pain and anger felt within the Muslim community. “Since the news of this religiously motivated act reached our Muslim communities, I have been listening to and recording their feedback and concerns,” Ishaq said.\n\n“We completely understand their frustration at the delay in confirming it as a hate crime and stand with them in their condemnation of this dreadful incident.”\n\nHe said that police were continuing to prioritise identifying the affected families and providing them with support. “We recognise that news of this crime will not only impact the Muslim community, but those from all walks of life,” Ishaq said.\n\n“There will continue to be a police presence in and around the cemetery to reassure our community and provide advice where needed.”\n\nThe desecration has drawn strong condemnation from community leaders and local government officials. Councillor Muhammed Butt, Leader of Brent Council, visited the cemetery on Monday to meet grieving families.\n\n“Understandably, they are in shock,” Butt said, calling the act “disgraceful” and reaffirming the council’s commitment to assisting police in the search for those responsible.\n\n“There is absolutely no place for hate or discrimination of any kind anywhere, but particularly in London — a city where everyone is welcome, and where our diversity is one of our greatest strengths,” he said.\n\n“The council will reinstate the damaged name plaques and return Carpenders Park Lawn Cemetery to a peaceful, quiet place of remembrance for families as quickly as possible, once the police have finished their investigation.”\n\nPolice have appealed to the public for information and are particularly interested in hearing from anyone who may have witnessed suspicious activity in or around the cemetery between 1pm on Friday, April 11, and 5pm on Saturday, April 12. Detective Sergeant Anna Cornish, who is leading the investigation, urged anyone with relevant information to come forward.\n\n“This is an abhorrent incident and one that will understandably spark an emotive reaction in the community,” Chief Superintendent Simpson said, promising that the force’s detectives “will continue to work very hard and quickly to ascertain the circumstances.”\n\nOn social media platform X, Muslim campaign groups accepted anger and frustration.\n\nAn-Nisa Society, dedicated to community strengthening, said, “An Islamophobic graves desecration attack took place in the Muslim part of Carpenders Pk Cemetery yesterday. How come we did not hear about this from @Brent Council. Many of us have family members buried there & we are upset…”\n\nTell Mama UK, which documents Anti-Muslims hatred, said it strongly condemns the “abhorrent, cowardly vandalism of Muslim graves”.\n\nLabour Party politician and councillor Anne Clarke tweeted: “Very sad and angry to hear about the horrific attacks on Muslim graves at Carpenders Park Cemetery”.\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/17085917432c46e.png",
  "retrievedAt": "2025-08-25T14:24:08.391Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904749/uk-police-launch-probe-after-85-muslim-graves-desecrated",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:39.000Z"
}
