{
  "title": "Freak hailstorm upends life in country’s north - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Four killed in parts of Punjab, soldier loses his life due to deluge, lightning strikes in KP\n• ‘Golf ball-sized’ hailstones damage vehicles, solar panels; gusts uproot trees, power pylons\n• Flash floods disrupt traffic on Peshawar-Torkham Highway\n\nKHYBER/ISLAMABAD: A freak hail and thunderstorm swept across parts of Punjab, Khyber Pakhtunkhwa and the federal capital on Wednesday and claimed several lives across both provinces, damaging public and private property as well as standing crops.\n\nThe rain also induced flash floods in KP, which also affected traffic, particularly on the main Peshawar-Torkham Road, where traffic remained suspended for up to five hours due to a swollen stream. In Islamabad, hailstones “as big as a golf balls” damaged vehicles and solar panels, while Tarnol remained the most-affected area, where strong winds uprooted trees and power pylons.\n\nThe storm followed several dry and hot days in the northern part of the country, as the region witnessed ‘vertical instability’ when hot air rising from the plains of Punjab came in contact with the cold winds coming from northern Iran, leading to a temperature contrast.\n\n“Hailstones are formed due to this combination of varying temperatures, but extreme weather events are becoming more common, and the large size of hailstones was one of them,” said Dr Zaheer Babar, a spokesperson for the Met Office.\n\nThe ‘golf ball-sized’ hailstones damaged property across the capital, with multitudes of people sharing photos of broken car windscreens and windows. Homes and markets were seen littered with debris and hail, and even the roof of the Faisal Mosque sustained some damage.\n\nOne person died after a wall of a mosque collapsed in the Ratta Amral area of Rawalpindi, and two lives were lost in Gujar Khan after a wall collapsed onto a trolley passing through a street in Sohawa.\n\nIn Muzaffargarh, a shopkeeper was killed in a lightning strike in Pull Magsan.\n\nIn Khyber Pakhtunkhwa, an army man was killed after a lightning strike struck his bunker in Khyber’s Landi Kotal area. Local administration and Rescue 1122 said that sepoy Ilyas Khan, a resident of Bara, was killed on the spot after being hit by lightning. The downpour also caused flash floods, in which a car was swept away.\n\nBesides the suspension of traffic on the Peshawar-Torkham highway, the rainwater also entered the transit camp established for Afghan nationals near the Hamza Baba mausoleum, which affected the registration process of the families being deported.\n\nIn Charsadda district, heavy rain coupled with hailstorms damaged standing crops of wheat and tobacco, vegetables, fruit orchards, and uprooted trees and electricity poles. The downpour and gusts in Tangi, Shomali Hashtnagar, and other areas also played havoc.\n\nCrops and vegetables were also damaged in Bajaur tribal district due to heavy rain coupled with strong winds.\n\nResidents told Dawn that the storm started at about 3pm and was witnessed in most parts of the district. But, they mentioned that Khar, War Mamund, Lowi Mamund, Nawagai and Salarzai tehsil were among the areas most affected by the hail.\n\nFour people were slightly injured when a vehicle plunged into a deep ditch after it veered off the road due to rainfall. The incident happened near the Jar bridge in Bajaur.\n\nIn Mardan, rain and thunderstorms uprooted trees near Sharmakhano Bridge on the Mardan-Malakand road, which severely affected the traffic flow, lasting more than several hours.\n\nWheat crops in several parts of the district were also damaged due to the strong winds. The farmers feared that the damage due to rain and hail was going to affect the yield of wheat crops.\n\nMeanwhile, the Provincial Disaster Management Authority (PDMA) has said that it was fully prepared to deal with the flood situation in Khyber districts and other areas of the province. The PDMA has also sought a report about the damages caused by the heavy rains and floods from the district administration of Khyber.\n\n“We have been monitoring the situation and were in contact with the respective district administration,” said PDMA Director General PDMA Asfandyar Khattak, said a statement. All necessary steps have been taken to pay compensation and redress the losses caused by the recent floods, he said.\n\nMohammad Ashfaq in Peshawar, Ibrahim Shinwari in Khyber, Jamal Hoti in Mardan, Faiz Muhammad in Charsdda, Anwarullah Khan in Bajaur and Kalbe Ali in Islamabad also contributed to this report\n\nPublished in Dawn, April 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680038d6ec02f.jpg",
  "retrievedAt": "2025-08-25T14:23:47.012Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904758",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T02:51:31.000Z"
}
