{
  "title": "Sindh govt committed to addressing transport, water and sanitation challenges: CM Murad - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Government reaffirmed its commitment towards addressing Karachi’s urban mobility, water, and sanitation issues at a meeting with International Finance Corporation (IFC) delegation on Thursday.\n\nWith a population of 20 million, infrastructure issues in Karachi run rampant, ranging from transport, water and sanitation. Last year, urban planners and climate change experts said that Karachi had become an “unliveable” city due to pollution, crumbling infrastructure, poor sanitation and waste management system.\n\nThe meeting focused on future public-private partnership (PPP) initiatives and underscored the need for strengthening PPPs in sectors such urban mobility and water, sanitation, and hygiene (WASH) as the chief minister detailed Sindh’s legal and institutional framework regarding PPPs.\n\nHe also highlighted progress in sectors such as road networks, energy, health, education, and transport. The IFC delegation was led by Linda Rudo Munyengeterwa, Director for Public-Private Partnerships, Privatisations & Corporate Finance Advisory.\n\nDuring the meeting, held at the CM House, CM Murad emphasised Sindh government’s commitment to addressing Karachi’s transport, water and sanitation challenges, highlighting the city’s importance as Pakistan’s economic hub.\n\nTo this end, he pointed out the Sindh government’s efforts in terms of transport which included several Bus Rapid Transit (BRT) systems, including the Green and Orange lines. Meanwhile, he said, work was underway on yellow and red lines along with other infrastructure projects.\n\nHe further added that the Sindh government had already introduced e-buses in Karachi and planned to expand its fleet to 800 vehicles.\n\nThe IFC lead delegate outlined a mass transit strategy comprising four main components: BRT operations, urban rail systems, ferry services, and ride-hailing platforms.\n\nShe suggested constructing a new 18.3 km BRT system in Karachi, financed through the World Bank, along with an integrated feeder bus network.\n\nThe IFC also stressed the need for modern e-buses to reduce noise and air pollution in the city. It recommended implementing e-buses through PPP models, where operational costs, maintenance, and risks would be shared with private partners.\n\nThe lead delegate talked about IFC’s experience in advising on over 500 projects globally and emphasised the advantages of e-buses, including cost efficiency, lower maintenance, and environmental sustainability, she informed that by 2024, 80 per cent of urban transport buses in successful models would be e-buses.\n\nAddressing Karachi’s water woes, the chief minister stated that Karachi requires 1,200 million gallons of water daily, stating that the current supply is insufficient, resulting in a significant shortfall.\n\nIn this regard, he highlighted the under-construction K-IV project which is expected to add to the water supply once completed. The government is also working on plans to install desalination plants to treat seawater, he confirmed.\n\nThe CM expressed interest in initiating water-related projects through the PPP model to address the water crisis while the IFC also recommended establishing water treatment plants for industrial use and proposed that water supply and sanitation projects follow the PPP model.\n\nThe nine-member International Finance Corporation (IFC) delegation included: Country Manager Zeeshan Sheikh, regional Manager Ian Twinn, Regional Manager Mr Tonci Bakovic, Regional Operational Manager Mr Michael Opagi among others.\n\nFrom the Sindh government, Karachi Mayor Murtaza Wahab, Principal Secretary Agha Wasif, Chairman P&D Board Najam Shah, Finance Secretary Fayaz Jatoi, DG PPP Unit Asad Zamin, and other senior officials were present.\n\nThe IFC team presented various successful global PPP models and praised the Sindh government’s PPP Unit and its overall policy framework.\n\n“Sindh is a province that has been implementing PPPs since 2008, and it truly stands as an example of how public-private partnerships should be done”, said Munyengeterwa while insisting on the need for more public-private partnerships.\n\nExpressing excitement at the prospect of future partnership opportunities, Munyengeterwa said, “IFC looked forward to showcase Sindh as a model for other provinces and even other countries”.\n\n“Hopefully, your success can serve as an international example of how to do PPPs the right way,” she added.\n\nThe IFC and the Sindh government agreed to collaborate closely on future PPP initiatives in urban mobility and water management to improve service delivery and urban infrastructure in Karachi and beyond.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:23:42.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904859/sindh-govt-committed-to-addressing-transport-water-and-sanitation-challenges-cm-murad",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T12:40:15.000Z"
}
