{
  "title": "DRAP holds training session on COVID-19 vaccine adverse events monitoring",
  "link": "https://www.app.com.pk/national/drap-holds-training-session-on-covid-19-vaccine-adverse-events-monitoring/",
  "date_published": "2021-02-08T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP): Drug Regulatory Authority of Pakistan (DRAP) in collaboration with World Health Organization (WHO) on Monday arranged one day training session on monitoring of adverse event following immunization (AEFI) of COVID-19 vaccine.\nLast week, 500,000 doses of COVID-19 vaccines of SinoPharm Company donated by Chinese government has arrived in Pakistan and subsequently the vaccination drive was initiated by Prime Minster on February 2.\nIn the initial phase frontline warriors such as healthcare professionals will be vaccinated, that will be followed by elderly people.\nIn line with international practices and to ensure the safety of vaccines in the local population, it was felt that there was a need to strengthen the coordination and reporting mechanism among the different stakeholders involved in monitoring of AEFI.\nIn this regard, DRAP in collaboration with WHO organized one day training session on “monitoring of adverse events following immunization of COVID-19 vaccines”.\nRepresentatives from Pakistan National Pharmacovigilance Centre, DRAP, Federal Expended Programme on Immunization, Provincial Expended Programme on Immunization and Focal Persons of Pharmacovigilance from the provinces attended the training session.\nDr. Abdur Rashid, Director, Division of Pharmacy and Head of the Pakistan National Pharmacovigilance Centre (PNPC) briefly explained the role of the DRAP in general and the Division of Pharmacy Services in particular in the process of approval of clinical trials of COVID-19 vaccines in Pakistan and subsequent monitoring of AEFIs after their registration.\nHe explained the role and responsibilities of each stakeholder such as national pharmacovigilance centre (DRAP), Federal EPI, provincial pharmacovigilance centres and manufacturers of vaccines.\nHe also briefed about the current status of the pharmacovigilance activities in the country and explain how the activity would be structured in the future.\nAsim Rauf, CEO DRAP in his address informed that the Registration Board of the DRAP in its recent meetings has granted emergency authorization to three COVID-19 vaccines.\nHe added the safety of these vaccines could never be comprised that is why the training session has been arranged in order to strengthen the procedure and tools for collection of AEFI and to enhance the coordination among the different stakeholders.\nHe appreciated the efforts of Division of Pharmacy Services and PER for their efforts in the approval of clinical trials and registration of COVID-19 vaccines.\nHe informed that Pakistan National Pharmacovigilance Centre is also harmonizing its procedure for NRA level III.\nHe said that it is time that we must give due consideration to monitoring of the safety of these vaccines in the larger interest of the country.\nIt was also informed that safety monitoring would not only monitor the harms of COVID-19 vaccine but will also build the public trust on these vaccines that will help smooth vaccination.\nWorld Health Organization’s (WHO) Michael Lukwiya appreciated the efforts of DRAP in granting emergency use authorization to three CIVID-19 vaccines.\nHe said that these vaccines are new and there are chances that there might be rumors among the public and fake news about the vaccine’s safety. The purpose of todays’ session was to counter such fake news and rumors.\nHe said that it is in the responsibility of WHO to optimize the health of Pakistani population and to minimize the risk associated with vaccines. Furthermore, it was also international requirement that necessary refresher training may be provided to stakeholders involved in AEFI monitoring.\nHe said that WHO will continue to support such activities which primary aim is to ensure patient or public safety.\nAqsa Hashmi, Assistant Director from Pakistan National Pharmacovigilance center, Division of Pharmacy Services explained the procedures of reporting.\nThe participants were informed and trained about different methods of reporting that included reporting through E-reporting system and MedSafety mobile application.\nMedSafety App was installed in the mobiles of participants, and hands on training was forwarded.\nIn the 3rd session of the training, Expanded Programme on Immunization explained their system of AEFI surveillance. It was outlined that COVID-19 vaccination will be carried out through adult vaccination counters (AVCs) established currently at 582 health facilities across the country.\nAll AVCs will have AEFI Focal Persons will share AEFI data on AEFI reporting forms with DHO office on daily basis and these will be compiled weekly at the office of DHO.\nThese weekly AEFI reports will be entered in EPI MIS. Sindh and Punjab will share their data in hard format or excel sheets as the EPI-MIS is not yet rollout there.\nThe AEFI review committee at the national level will supervise the activities related to AEFI. Final data of AEFI will be shared with PNPC through VigiFlow.\nIn the last session, Abdul Mateen, Assistant Director, Focal Person pharmacovigilance, Pakistan National Pharmacovigilance Centre presented about VigiFlow data entry of AEFI and ADRs.\nParticipants were provided hands-on training on data entry in VigiFlow and how to use MedDRA and WHO drug for coding of ADRs, AEFIs and drugs or vaccines.\nFurthermore, the way forward for reporting of AEFI was also briefed, where it was presented that AEFI reports will be daily submitted by AEFI Focal persons to DHO office.\nThe data will be accordingly entered in EPI-MIS by DHO office, which will be shared with DRAP through VigiFlow by Federal EPI.\nThe session was concluded with aim to actively monitor the AEFI and timely report to concerned stakeholders in order to detect the risk as early as possible.\nIt was decided that Focal Persons of Pharmacovigilance of the provincial pharmacovigilance centers will coordinate with Focal Persons of EPI of the Provinces and will help them in capturing the maximum information in AEFI reporting form.\nSimilarly, if provincial pharmacovigilance centres have pharmacovigilance officers at the level of these adult vaccination counters they should also coordinate with the Focal persons of AEFI at the adult vaccination centre and help them in collection of AEFIs.\nHowever, the flow of reporting will be the same like AEFI Focal Persons at adult vaccination counters will report AEFI to DHO office on daily basis and these will be compiled on weekly basis at the office of DHO.\nThese weekly AEFI reports will be entered in EPI MIS. The final data will be shared by Federal EPI with DRAP through VigiFlow.\nSimilarly, it was also discussed that EPI should at present continue with their existing AEFI reporting form. However, they should also consider to revise their EPI-reporting form online with WHO AEFI form, with the approval of their AEFI review committee.\nIt was decided that follow-up virtual meeting should be held in the 3rd week of February most probably on 23rd of February, 2021. It was decided that Pakistan National Pharmacovigilance Centre will provide necessary logins of VigiFlow database to Federal EPI for the data entry and sharing of AEFI data with DRAP.",
  "retrievedAt": "2025-08-11T20:20:06.879Z"
}
