{
  "title": "Sardar Masood Khan invites investors to tap investment opportunities in AJK",
  "link": "https://www.app.com.pk/national/sardar-masood-khan-invites-investors-to-tap-investment-opportunities-in-ajk/",
  "date_published": "2021-02-08T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 08 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Monday said that AJK possessed huge investment potential in almost every sector of economy and invited Pakistani investors to tap all investment opportunities there for earning lucrative results.\nWhile addressing the business community here at Islamabad Chamber of Commerce and Industry (ICCI), he said the US$ 5 billion AJK economy has the potential to grow into US$ 20-30 billion economy within 10 years, which showed its attractiveness for investors.\nHe said AJK has the potential to become an engine of growth for Pakistan, adding, three tourism corridors have been identified under CPEC in AJK to improve tourism infrastructure.\nHe said that before COVID-19 pandemic, 1.5 million tourists visited AJK as it has pristine terrain with mesmerizing spots for tourists and the government was focusing on modernizing tourism infrastructure to attract more tourists.\nRepresentatives of Mirpur, Jhelum, Sialkot, Gujranwala, Bhawalpur and Karachi Chambers of Commerce & Industry also joined the session through a zoom meeting.\nSardar Masood Khan said that 3 hydropower projects under CPEC including 720MW Karot, 1120 MW Kohala, 600 MW Azad Pattan and one SEZ in Mirpur were under construction in AJK.\nHe said AJK has the world’s finest precious stones while there was great potential for investment in industry, agriculture, hospitality and other sectors and urged that Pakistani investors to capitalize on them.\nHe announced that he would host a delegation of Pakistani business community led by ICCI President Sardar Yasir Ilyas Khan in AJK to show them business and investment potential in AJK.\nHe also paid tributes to Sardar Group of Companies Chairman and Sardar Muhammad Ilyas Khan who is also fater of ICCI President Sardar Yasir Ilyas Khan for his entrepreneurial achievements as he has made huge investments in Pakistan and AJK providing jobs to several thousand people and was making significant contribution to tax revenue of the country.\nSpeaking at the occasion, ICCI President Sardar Yasir Ilyas Khan said that immense tourism potential in AJK still remained untapped and urged the government to focus on developing modern tourism infrastructure to attract more tourists.\nHe said that promoting tourism in AJK would contribute effectively towards strengthening the economy as it would attract investment, create new jobs, reduce unemployment and generate tax revenue.\nHe said that tourism contributed £106 billion to the GDP of British economy besides supporting 2.6 million jobs.\nSimilarly, tourism was contributing 11.5 percent to the GDP of Dubai capturing direct international tourism spending of $27.9 billion, which showed that Pakistan and AJK could achieve tremendous benefits by promoting tourism.\nHe urged the federal and AJK governments to consider announcing special incentives including 5 to 10-year tax holidays and abolition of duties on import of machinery and equipment for AJK to attract maximum local and foreign investors.\nHe urged that the AJK government for providing land on lease for 55-90 years to investors to give them confidence in making investment. He said that the government should take measures to attract major local and international brands to AJK, establish trainings institutes to utilize the abundant human resource of the region for economic development and reopen airports in Rawalakot and Muzaffarabad by further upgrading them that would facilitate the local and international tourists in visiting AJK.\nMian Akram Farid Chairman Founder Group said that sales tax exemption has been withdrawn in AJK and urged the decision to be revised to facilitate the businessmen in AJK.\nThe representatives of other Chambers of Commerce & Industry also shared ideas for creating a conducive environment for business and investment in AJK.",
  "retrievedAt": "2025-08-11T20:20:09.726Z"
}
