{
  "title": "Railways ministry retrieves 439.8 acres land from private individuals",
  "link": "https://www.app.com.pk/national/railways-ministry-retrieves-439-8-acres-land-from-private-individuals/",
  "date_published": "2021-02-08T07:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP): Pakistan Railways has retrieved around 439.8 acres precious land worth billion of rupees from private individuals under its anti-encroachment operation across the country from 2018 to till date.\n“The encroachment operation has been launched with the assistance of railway police and district administrations,” an official in the Ministry of Railways told APP.\nGiving details, he said the department retrieved 230.33 acres land in Punjab, 115.92 acres from Khyber Pakhtunkhwa, 81.81 acres from Sindh and 11.74 acres from Balochistan.\nThe official said that out of the total land, 66.687acres were commercial, 285.9 acres were residential and 87.213 acres were the agricultural land of the Pakistan Railways.\nHe said the government was taking several steps to retrieve encroached land from the land grabbers including detailed survey was being carried out to identify the encroached land, occupied by the individuals and under illegal occupation of various government departments.\nThe official said the campaign was being monitored by the Divisional Superintendents, Headquarters office and Ministry of Railways.\nThe Standard Operating Procedure (SOP) and joint procedure order have been issued since for strict implementation of this policy, the official added.\nHe said that First Information Reports (FIRs) were being lodged and cases were registered and sent to Pakistan Railways Judicial Magistrates for expeditious trial.\nThe issue regarding illegal occupation and possession of Pakistan Railways land by government departments and institutions has also been taken up with the concerned departments, he added.\nHe said it was an ongoing campaign which would continue till the elimination and regularization of encroachments.\nThe official said Pakistan Railways owns 167,690 acres of land across the country, of which 90,326-acre is in Punjab, 39,428-acre in Sindh, 28,228-acre in Balochistan and 9,708-acre in Khyber Pakhtunkhwa.\nHe said the Geographic Information System (GIS) survey had also been conducted under a project regarding computerization of railway land records, in which all the encroachments and leases had been recorded in the Pakistan Railways Land Management Information System (PRLMS) software.",
  "retrievedAt": "2025-08-11T20:20:13.957Z"
}
