{
  "title": "COP-29 Presidency notifies multi-stakeholder int’l advisory committee for inclusive ‘Climate Action’",
  "link": "https://www.app.com.pk/national/cop-29-presidency-notifies-multi-stakeholder-intl-advisory-committee-for-inclusive-climate-action/",
  "date_published": "2024-07-21T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): The United Nations’ 29th Global Climate Change Conference (COP29) Presidency has notified its diverse and multistakeholder international advisory committee for inclusive climate action under its motto, “In Solidarity with a Green World”.\nThe COP29 Presidency in the prevailing highly charged milieu due to the galloping impacts of global warming and climate change has come up with a comprehensive selection of a 21-member international advisory committee also called COP-29 IAC to ensure that voices and perceptions of all concerned are considered at the global fora to provide inclusive results based on shared solutions.\nThe Committee comprises notable dignitaries who will extend beneficial and critical viewpoints shedding light on various facets of climate action. The COP-29 forum in the past couple of years has become a household name from a mere oblivious international forum with all eyes glued to it for well-planned and mutually agreed strategies to combat the menace of climate change.\nThe COP-29 IAC aimed to represent diverse voices of climate advocates from different communities such as finance, academia, government, entrepreneurship, and civil society to provide multi-stakeholder guidance and expert advice to the COP-29 Presidency on key issues in the sphere of climate change.\nIt also intended to facilitate international collaboration and partnerships that enhance and promote COP-29 initiatives; ensure that preparations and decisions are informed by the latest scientific research, best practices, and innovative solutions; assist in the identification and mobilization of resources for COP programs and projects and promote transparency, accountability, and stakeholder engagement in COP-related processes.\nThe committee will offer strategic guidance and assistance to the COP-29 Presidency enabling sector-specific geopolitical, market, and other expert advice and knowledge. It also aims to review and provide feedback on COP strategies, policies, and programs; act as a consultative body to the COP-29 Presidency’s negotiated and non-negotiated outcomes, ensuring a diversity of perspectives; recommend approaches for addressing global challenges within the COP framework; engaging with Parties and non-Party stakeholders to propose and promote practical solutions for climate-related topics to support the COP-29 outcomes; and provide recommendations for improving the impact and sustainability of COP-29 initiatives. The COP-29 IAC will meet monthly operating through both in-person and online meetings.\nWHO Director-General Tedros Adhanom Ghebreyesus; Co-chair of the Nizami Ganjavi International Center and former World Bank President, Ismail Serageldin (Egypt); former President of Latvia (1999-2007), Vaira Vike-Freiberga; Board of Directors of Fortescue Metals and Fortescue Future Industries; Chair of the Board, The Global Fund to End Modern Slavery, Vice-President of the ExxonMobil (2000-2013) Jean Baderschneider; President of the 73rd session of the UN General Assembly, Former Minister of Foreign Affairs of Ecuador, Maria Fernanda Espinosa; Environmental Advocate and Turkish lead actor of Drama Ertugrul, Engin Altan Duzyatan; Former Minister of Environment, Brazil and the member of the COP-28 Advisory, Izabella Teixeira; Former President of Malawi, Joyce Banda; Former Mexican Foreign Secretary and Executive Secretary of the United Nations Framework Convention on Climate Change (UNFCCC), Patricia Espinosa Cantellano; Hungarian diplomat and president of the 77th session of the UN General Assembly, Csaba Korosi; Director of China’s National Centre for Climate Change Strategy and International Cooperation, Xu Huaqing; Former President of Bulgaria, Rosen Plevneliev; Former President of Romania, Emil Constantinescu; Fromer Executive Director, UN-Habitat, Maimunah Mohd Sharif of Malayisa and Executive Director, Sustainable Development Policy Institute (SDPI), Pakistan, Dr. Abid Qaiyum Suleri are the members of the COP-29 IAC.\nDr. Suleri is the only expert from South Asia to be a member of the IAC, a high-level forum convening former heads of states, ex-ministers, artists, innovators, and experts of global prestige.",
  "retrievedAt": "2025-08-11T03:59:58.845Z"
}
