{
  "title": "Railways all set to resume Green Line Train operations from mid-January",
  "link": "https://www.app.com.pk/national/railways-all-set-to-resume-green-line-train-operations-from-mid-january/",
  "date_published": "2023-01-08T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 8 (APP):Pakistan Railways is all set to resume Green Line Passenger Train operations from Islamabad to Karachi in mid-January as a superior service to facilitate the passengers and generate revenues for the department.\n“The train is comprised of two AC Parlor, five AC Business, six AC Standards, and four to five economy class coaches which will facilitate the passengers on the route,” an official in the Ministry of Railways told APP.\nHe said the decision was taken on the directives of Minister for Railways Khawaja Saad Rafique, who wanted the best arrangements for the Green Line passenger Train for travelers.\nThe official said that the minister also directed the official concerned for reducing the travel time of the Green Line from Lahore to Karachi to less than 20 hours which would restore the confidence of the passengers.\n“It is also decided to provide the best travelling facilities in the Green Line train including the provision of high-quality food and keeping the ticket price at an affordable level. Besides, a separate LCD will be installed on each seat of the AC Parlor to let passengers enjoy favourite videos through headphones,” he added.\nIt is pertinent to mention here that the Green Line Train had been scheduled to start operations from December 20 last but due to some financial and other issues now it would start operations from mid-January.\nTo a question, he said Pakistan Railways was also going to expedite work to improve services in the passenger trains as well as at the major railway stations by involving the private sector which would help address growing issues, especially related to cleanliness.\n“The department was of the view that the cleanliness-related services in trains and at major stations, including Lahore, Faisalabad, Karachi, Rawalpindi, Quetta, Peshawar, Khanewal, Sukkur, Sahiwal, Multan, and Bahawalpur were not satisfactory,” he added.\nHe said that if services of the private sector were hired under a fast-track policy, the hygiene conditions at stations and in trains could be improved which would also restore the confidence of passengers in the department.\nThe official said the minister also asked the officials to accelerate efforts to bring uniformity in the design and signboards of stalls at the major railway stations under a policy.\nThe official said that the government was taking several steps to improve the performance of Pakistan Railways and would provide maximum facilities to the masses.",
  "retrievedAt": "2025-08-11T05:41:55.928Z"
}
