{
  "title": "President directs SLICP to pay interest to an insurance policy holder",
  "link": "https://www.app.com.pk/national/president-directs-slicp-to-pay-interest-to-an-insurance-policy-holder/",
  "date_published": "2023-01-08T10:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 8 (APP): President Dr Arif Alvi has directed the State Life Insurance Corporation of Pakistan (SLICP) to compensate an insurance policy holder by paying the interest due in accordance with the prevailing rate as it had delayed payment of the maturity claim to the complainant without giving any reason.\nhe president in his decision observed that the complainant had obtained the insurance policy from SLICP on 31.10.1990 for the sum assured of Rs 30,000 for a period of 20 years and that the date of maturity of policy was 31.10.2020, however, SLICP made payment of the maturity claim to the complainant after a lapse of almost two years. He said that SLICP failed to justify the belated payment to the complainant and admittedly, the premiums deposited by the complainant were kept by the insurance company and it had earned profits on it, President Secretariat Press Wing said in a press release on Sunday.\nThe president held that by virtue of unexplained delayed payment to the complainant, SLICP was required to compensate the complainant by paying interest due in accordance with the prevailing rate.\nAs per details, Mukhtar Ahmad (the complainant) had purchased an insurance policy from SLICP and after its maturity on 31.10.2020, he had approached SLICP for the maturity claim but it was not paid. Feeling aggrieved, he approached the Wafaqi Mohtasib, which close the case as the complainant was satisfied with the report of SLICP and wanted to withdraw his complaint.\nLater, the complainant filed a representation with the president, which was accepted.\nAccepted the representation of the complainant, the president directed SLICP to submit its compliance report to the Wafaqi Mohtasib within 30 days.",
  "retrievedAt": "2025-08-11T05:41:53.694Z"
}
