{
  "title": "Pakistan expresses concerns over Yasin Malik’s health conditions",
  "link": "https://www.app.com.pk/national/pakistan-expresses-concerns-over-yasin-maliks-health-conditions/",
  "date_published": "2020-03-22T03:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):Pakistan has expressed its deep concerns over the deteriorating health condition of the All Parties Hurriyat Conference (APHC) leader Muhammad Yasin Malik, who is incarcerated in Tihar jail.\n“The reports of Kashmiri leader’s announcement of going on an indefinite hunger strike from April 1, this year in protest against the false charge sheet framed by the Indian government against him under the Terrorist and Disruptive Activities (TADA) Court in a 30 year old case are worrisome.\nThe victimisation of a political leader to suppress the voice of Kashmiris is highly condemnable,” a press release of Foreign Office spokesperson on Sunday said.\nThe international community, including the United Nations, Human Rights organisations and the global media must take notice of Indian government’s inhuman treatment of the Kashmiri leader who has been leading a peaceful freedom struggle for decades.\n“India must be urged to immediately release Yasin Malik and withdraw all false charges against him,” it added.\n“India must realise that by incarcerating Kashmiris leaders, it cannot subjugate the people of Kashmir. The only way to resolve the Jammu & Kashmir dispute is the implementation of relevant UNSC Resolutions that guarantee the Kashmiris’ inalienable right to self determination,” it added.\nIt may also be highlighted that Yasin Malik has serious medical conditions and needs to be provided appropriate medical treatment under the international conventions.\nThe press release further said the timing of re-opening of the case under TADA suggests that the BJP government was determined to punish the detained Kashmiri leader for resisting the illegal Indian occupation of Jammu and Kashmir.",
  "retrievedAt": "2025-08-11T18:58:54.911Z"
}
