{
  "title": "Ehsaas-Saylani Langar on Wheels to deliver food aid to poor in pandemic emergency",
  "link": "https://www.app.com.pk/national/ehsaas-saylani-langar-on-wheels-to-deliver-food-aid-to-poor-in-pandemic-emergency/",
  "date_published": "2020-03-22T04:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):Ehsaas and Saylani Welfare International Trust (SWIT) have join hands to run “Ehsaas-Saylani Langar on Wheels” to deliver cooked food aid to needy people particularly labourers and daily wagers.\nThis commenced at a busy bus station at Faizabad, the junction of twin cities Islamabad-Rawalpindi. To inaugurate the first Ehsaas mobile food unit that will distribute food two times daily, Dr. Sania Nishtar, Prime Minister’s Special Assistant on Social Protection and Poverty Alleviation was joined by Yousuf Lakhani, President, SWIT.\nMobile vans aimed to combat hunger will discourage people from congregating at one spot for free food collection and will serve at various points in cities including public places, slums and hospitals while explicitly ensuring dignity and social distance for the safety of people.\nAs people are at the risk of small income generating opportunities due to the pandemic emergency in the country, this food aid concept will be stretched out soon to a bigger, better and faster scale across all major cities of Pakistan as part of the Ehsaas framework.\nBriefing media on the occasion, Dr. Nishtar said, “Feeding poor and deserving is central to Prime Minister’s vision of welfare state. Ehsaas realizes that Corona outbreak has exacerbated an escalating poverty that will affect laborers and daily wagers the most, as people are being bound to stay at homes.” She then continued, “Ehsaas-Saylani Langar on Wheels is the dire need of the hour that will not only address hunger and nutritional needs of the impoverished, but it will also provide us an opportunity to connect with them, respond to their needs and educate them about precautionary guidelines to fight this war against Corona virus.”\n“We are deeply honoured to partner with Ehsaas and pledge full support for this tremendous cause to ease the food burden of urban poor with complete dignity and safety in these difficult times.” said President, SWIT.\nLast year in October, Prime Minister Imran Khan had launched Ehsaas Saylani Langar initiative to provide free food to the poor, laborers and homeless across the country.\nSince then, several Ehsaas-Saylani Langars have been opened and several others are under construction to feed the poor.\nThrough this program 112 Ehsaas-Saylani Langars will open throughout the country.\nSitting under the umbrella of Ehsaas, this Langar on wheels initiative will expand the capacity under the public private partnership to distribute food by removing barriers that prevent access to underserved areas and will allow for fast and flexible delivery in line with precautionary protocols set out by Ehsaas.",
  "retrievedAt": "2025-08-11T18:58:54.368Z"
}
