{
  "title": "Qureshi phones Nepalese FM; discusses ways to cooperate against pandemic",
  "link": "https://www.app.com.pk/national/qureshi-phones-nepalese-fm-discusses-ways-to-cooperate-against-pandemic/",
  "date_published": "2020-03-22T02:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):Minister for Foreign Affairs Shah Mahmood Qureshi Sunday held a telephonic conversation with his Nepali counterpart Pradeep Kumar Gyawali and discussed the situation arising from the rapid spread of COVID-19, and ways to enhance cooperation to combat the threat.\nHe reiterated Pakistan’s readiness to host the SAARC Health Ministers’ Conference and suggested that a video conference could be organized due to the prevailing global health emergency.\nQureshi said Pakistan considered SAARC an important platform for regional cooperation and appreciated Nepal’s leadership role as chair in steering the SAARC process forward despite the many odds.\nBoth the sides discussed the challenges faced by regional states and the need for joint efforts.\nThe two ministers agreed on the need to work closely to promote collective endeavours to fight common challenges.\nForeign Minister Qureshi said Pakistan had proposed that sanctions on Iran be lifted so that humanitarian relief could be provided at this time of crisis to save precious human lives.\nHe said Prime Minister Imran Khan had also proposed that developed countries might facilitate developing countries to meet the challenge through debt restructuring so that they could use limited resources to mitigate the effects of this pandemic on their economies and provide effective relief to poor people.\nThe foreign minister of Nepal appreciated the proposal and also expressed concerns on the humanitarian crisis in Iran.\nForeign Ministers Qureshi and Gayawali further noted that the ongoing year marked the 60th anniversary of establishment of diplomatic relations between Pakistan and Nepal. They reiterated mutual commitment to further strengthening bonds of friendship between the two countries, bilaterally as well as through regional and international forums.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:58:57.336Z"
}
