{
  "title": "FM calls for debt relief to developing countries",
  "link": "https://www.app.com.pk/national/fm-calls-for-debt-relief-to-developing-countries/",
  "date_published": "2020-03-21T22:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi has underscored the need for providing debt relief to developing countries so that they could utilize their resources towards mitigating the effects of Covid-19.\nHe was talking to German Foreign Minister Heiko Maas during a telephonic conversation.\nThe foreign minister briefed his German counterpart on the efforts taken by the government to contain the outbreak of Covid-19 and underscored the need for the international community to collaborate during these challenging times, Foreign office spokesperson in a press release on Sunday said.\nThe foreign minister said that in the same spirit, Pakistan was coordinating with the regional countries via the South Asian Association for Regional Cooperation (SAARC).\nDuring the recent video conference of the SAARC member states, Pakistan also called on India to lift the nearly eight months long blockade in Indian Occupied Jammu and Kashmir (IOJ&K), to ensure necessary medical supplies to contain the spread of Covid-19, he added.\nThe foreign minister further underlined that the situation in Iran was very serious and it was important that sanctions be lifted so that Iran could effectively deal with the humanitarian crisis unfolding due to Covid-19.\nQureshi informed his German counterpart that Pakistan had followed the IMF programme in letter and spirit and as a result, its economy was becoming stable.\nHowever, due to the challenge posed by Covid-19, the resources were being stretched to the limits.\nForeign Minister Qureshi offered deep condolences over the loss of lives in Germany due to the outbreak of Coronavirus (Covid-19).\nHe informed that three persons in Pakistan had lost their lives while more than 500 people were infected by the Coronavirus (Covid-19).\nThe German foreign minister informed that 68 people had lost their lives and more than 20,000 people were infected due to Covid-19 in Germany.\nHe said Germany shared the concern regarding the situation in Iran and would take up the matter at his important regional meetings next week.\nHe also agreed on the need to provide relief to developing countries in dealing with debt burden, so that they could utilize their resources towards containing Covid-19 and said that Germany would raise this issue appropriately during the forthcoming high-level meetings.\nThe two ministers also agreed to remain engaged.",
  "retrievedAt": "2025-08-11T18:58:59.423Z"
}
