{
  "title": "Corona testing capacity to reach 20,000 per day by end of April: PM told",
  "link": "https://www.app.com.pk/national/corona-testing-capacity-to-reach-20000-per-day-by-end-of-april-pm-told/",
  "date_published": "2020-04-20T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP):Prime Minister Imran Khan on Monday was apprised that the coronavirus infection testing capacity in the country would reach 20,000 per day by the end of current month, whereas at present more than 8,000 tests were being carried out on daily basis.\nThe prime minister was chairing a meeting to review the measures to contain the coronavirus infection (COVID-19) and the latest situation in the country.\nThe meeting was attended by federal ministers, including Hammad Azhar, Asad Umar, Makhdoom Khusru Bakhtiar and Syed Fakhar Imam, Special Assistant to the PM (SAPM) on Health Dr Zafar Mirza, SAPM on Information Dr Firdous Ashiq Awan, SAPM on national Security Dr Moeed Yousaf, Focal Person on Corona Dr Faisal Sultan, National Disaster Management Authority Chairman Lt Gen Muhammad Afzal and other senior officials, PM Office Media Wing in a press release said.\nAddressing the participants, the prime minister said the government was striving to maintain a balance by containing the spread of coronavirus, besides ensuring continuity in the economic activities.\nIt was cognizant of the problems being faced by the traders’ community and was making efforts, under its recent decisions, to resolve those issues with the cooperation of the provincial governments, he added.\nThe prime minister also stressed upon ensuring an effective strategy and public cooperation for maintaining social distancing and observed that wider public awareness should be created over its importance.\nHe opined that in the sovereign countries, public cooperation was sought through involvement of the people over the issues of national importance instead of using of force.\nHighlighting the critical role of doctors and paramedical staff, the prime minister said they were on the front line in the fight against the coronavirus and assured that meeting their requirements was a top priority.\nReferring to his recent meeting with the Ulema, he expressed his satisfaction that the Ulema and Mashaikhs had taken the responsibility for implementation of the plan, which had been unanimously agreed upon regarding religious obligations and congregations in the mosques.\nHe observed that implementation of the steps against the coronavirus was a joint responsibility.\nSAPM Dr Zafar Mirza gave a comprehensive briefing to the prime minister on the latest situation on coronavirus.\nMinister for Planning Asad Umar apprised the prime minister about the National Command and Operation Center’s steps and various proposals being under consideration for making the strategy further effective.\nThe prime minister was apprised that special focus was being paid on the capacity enhancement of hospitals in view of the future situation.\nThe NDMA chairman said the coronavirus related material from the third consignment was dispatched to 408 hospitals, whereas it would be doubled with the fourth consignment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:07:37.285Z"
}
