{
  "title": "Sanjrani asks NA speaker to allow NA chamber for Senate session",
  "link": "https://www.app.com.pk/national/sanjrani-asks-na-speaker-to-allow-na-chamber-for-senate-session/",
  "date_published": "2020-04-20T01:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP):Chairman Senate Muhammad Sadiq Sanjrani, Monday, wrote a letter to the Speaker of National Assembly Asad Qaisar to make the chamber of the National Assembly available for sitting of the Senate to assume its constitutional role while taking all precautionary measures in view of the health advisories.\n“In order to successfully preserve the operation of Parliament during a time of global pandemic whereby the key functions of the parliament as key legislative body are arguably most needed, it is crucial that appropriate, proportionate and reasonable measures be taken to facilitate this”, the letter said.\nHe said globally parliaments have adopted mitigation and adaptation strategies to facilitate effective working of the parliaments.\nThe Senate chamber, given the number of its members, did not allow adopting any physical distancing measures for holding senate session of the Senate.\nHe mentioned that parliamentary practices exist wherein the Chamber of Senate was used by National Assembly for holding the sessions as fire eruption destroyed the National assembly chamber in 1993.\nHe said that those were extra ordinary circumstances and today again there are extra ordinary circumstances wherein on House of Parliament cannot hold session in its chamber.\nHe said that pandemic has created unique challenges for legislatures across the world, forcing emergency provisions in parliamentary procedures, innovative techniques for connecting with citizenry and legislative actions on urgent relief packages for communities in need.\n“I am certain that together we will be successful in taking measures to protect citizenry and fight this pandemic effectively” Sanjrani writes to Qaisar in his letter.",
  "retrievedAt": "2025-08-11T19:07:43.579Z"
}
