{
  "title": "Deputy Speaker NA says collective efforts to defeat COVID-19",
  "link": "https://www.app.com.pk/national/deputy-speaker-na-says-collective-efforts-to-defeat-covid-19/",
  "date_published": "2020-04-20T01:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP):Deputy Speaker National Assembly Qasim Khan Suri Monday appreciated the historic measures taken by the government of Pakistan, under the leadership of Prime Minister Imran Khan to beat the Coronavirus (COVID-19) epidemic from the country.\nTalking to PTV news channel, Deputy speaker said the government will win the war against Covid-19 (coronavirus) pandemic through collective efforts of the public, medical professionals, law-enforcement agencies and with friendly countries.\nHe paid tribute to healthcare professionals on the front line of the fight against the novel coronavirus outbreak, promising that a collective effort would help defeat the deadly disease.\nPrime Minister is well committed to provide extra relief to Baluchistan government and its people, he said adding, the provincial government with the support of federal government is ensuring effective lockdown.\nThe Imran Khan’s government was taking sincere initiatives to provide relief to people of the country in present situation and government under the honest leadership of Prime minister Imran Khan is leaving no stone unturned in combating the covid-19 pandemic, he added.\nHe said Prime Minister Imran Khan is highly concerned with the poor segments and daily wagers class of the country and he had announced historic relief packages for poor masses of the country.\nNA speaker further urges citizens of the country to follow government guidelines and stay indoors amid COVID-19 lockdown.\nHe said he may personally visiting various areas of Quetta city and the distribution of ration bags is continued with the help of Tiger force.\nAbout the financial challenges in the wake of the lockdown, Qasim Suri said the economies all-over the world had been tested by the impact of Covid-19, but the government was providing financial support to the deserving families on priority.\nAbout initiatives for the poor, he said the government financially supporting poor families under the Ehsaas programme and each applicant is receiving 12,000 in a transparent system.\nTo a question, he said the welfare initiatives of the government for the underprivileged had been acknowledged by the whole world.\nHe also called upon all well-to-do people to come forward, as the government alone could not cater to the financial needs of the jobless.",
  "retrievedAt": "2025-08-11T19:07:44.230Z"
}
