{
  "title": "PHC moved against amendments to Law Officers Appointment Act - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: A resident has moved the Peshawar High Court challenging amendments to a law on appointment of law officers, claiming thegovernment’s move was meant to save a MNA of the ruling PTI from disqualification.\n\nPetitioner Nasrullah Khan requested the court to declare the Khyber Pakhtunkhwa Appointment of Law Officers (Amendment) Act, 2024, illegal and unconstitutional.\n\nThe petitioner is also a complainant in a reference filed with the Election Commission of Pakistan (ECP)against PTI MNA from Swat Sohail Sultan, seeking the lawmaker’s disqualification on the ground that he, after working as an assistant advocate general in the province, didn’t serve the mandatory two-year period before contesting the 2024 general elections.\n\nMr Sultan challenged the proceedings before the ECP last year and also obtained a stay order from the high court. His petition is still pending with the court.\n\nPetitioner claims govt move aimed at saving a PTI MNA from disqualification\n\nIn the petition, filed through advocate Sultan Mohammad Khan, the petitioner said that the impugned amendment had been giving retrospective effect from Dec 4, 2014, which was unconstitutional.\n\nThe respondents in the petition are the KP government through its chief secretary and the secretary of the law and parliamentary affairs department.\n\nThe petitioner said that the impugned law was enacted in Oct 2024 and through it changes were made in the KP Appointment of Law Officers Act, 2014.\n\nHe added that through the impugned Act, a new section (8a) was inserted into the law to exclude the service of a law officer from the service of Pakistan.\n\nThe petitioner said that section provided that the service of a law officer, who was appointed or had been appointed under the Act earlier, should be excluded from service of Pakistan.\n\nHe said that the government claimed that the amendment was made so as to provide clarity about the status of additional and assistant advocate general in relation to Article 260 of the Constitution.\n\nThe petitioner said that he had filed a reference before the National Assembly speaker for disqualification of MNA from NA-4 Swat-III.\n\nHe claimed that the said MNA was appointed as assistant advocate general by the chief minister on Nov 28, 2018 and his services were dispensed with by the government on March 10, 2023.\n\nThe petitioner said that the government, in order to circumvent and defeat the said reference filed against the ruling party’s MNA, misused its majority in the assembly and passed the impugned Act.\n\nHe added that the Supreme Court had clearly held while interpreting Article 260(1) of the Constitution that the offices of the assistant advocate general and additional advocate general were the “offices of profit in the service of Pakistan connected to the affairs of the state.”\n\nThe petitioner referred to the apex court’s judgement, which declared that the post of an assistant advocate general was in service of Pakistan.\n\nHe contended that the provincial legislature couldn’t change the definition of “employees in the service of Pakistan.”\n\nThe petitioner said that act had the effect of violating articles 240, 242 and 260 of the Constitution.\n\nHe argued that the impugned amendment was related to a national subject, so it was beyond the legislative competence of the provincial assembly.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:58:17.569Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893679/phc-moved-against-amendments-to-law-officers-appointment-act",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:20:14.000Z"
}
