{
  "title": "Israel suspends release of Palestinian prisoners - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: Israeli officials said the release of hundreds of Palestinian prisoners due on Saturday has been delayed, after six prisoners were freed under a fragile Gaza truce that is nearing the end of its first phase.\n\nWhile Israel was meant to release Palestinians in its custody in exchange for the six Israelis taken back home, Israeli officials said it may only happen after Israeli Prime Minister Benjamin Netanyahu convenes a security consultation.\n\n“Once the security consultation concludes, a decision will be made regarding the next steps” of the ceasefire agreement with Hamas, said one Israeli official, speaking on condition of anonymity.\n\nThe sources did not provide a clear reason for the delay.\n\nHamas frees six Israelis; terms Tel Aviv move ‘blatant violation’ of Gaza truce\n\nHamas accused Israel of a “blatant violation” of the Gaza ceasefire deal over the delay in the release of hundreds of Palestinian prisoners due on Saturday.\n\n“The (Israeli) occupation’s failure to comply with the release of the seventh batch of prisoners in the exchange deal at the agreed-upon time constitutes a blatant violation of the agreement,” Hamas spokesman Abdel Latif Al-Qanou said in a statement, accusing Netanyahu of “procrastination and stalling tactics”.\n\nSix Israelis, some of them dual nationals, were released earlier on Saturday, the last group of living prisoners under the truce’s first phase.\n\nThe Palestinian Prisoners’ Club advocacy group said Israel would free 620 inmates, most of them taken into custody after the October 2023 raids.\n\nAt a ceremony in Nuseirat, central Gaza, masked Hamas men brought onto a stage Eliya Cohen, 27, Omer Shem Tov, 22, and Israeli-Argentine Omer Wenkert, 23.\n\nAt a similar ceremony in Rafah, southern Gaza, Hamas handed over Tal Shoham, 40, and Avera Mengistu, 38. Shoham was made to address the gathering, flanked by masked gunmen dressed all in black.\n\nA sixth prisoner, Hisham al-Sayed, 37, was later released and taken back to Israeli territory, the military said.\n\nSayed, a Bedouin Muslim, and Mengistu, an Ethiopian Jew, had been held in Gaza for about a decade after they entered the territory individually.\n\nUnder a cold winter rain in Rafah, and in Nuseirat, Hamas staged a show of force after months of bombardment and strikes that killed the group’s top leaders.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ba479cd5a25.jpg",
  "retrievedAt": "2025-08-25T19:58:18.491Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893683/israel-suspends-release-of-palestinian-prisoners",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:20:05.000Z"
}
