{
  "title": "5,800 security personnel deployed in Islamabad for security of cricket teams - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Around 5,800 police, paramilitary personnel and army troops have been deployed in the federal capital under the security plan devised for cricket teams and foreign broadcasters during the ongoing ICC Champions Trophy 2025.\n\nThree matches of the Champions Trophy are scheduled to be played at Rawalpindi Cricket Stadium from February 25 to 27. The teams and broadcasters will be staying at two hotels in Islamabad.\n\nAccording to the police, the matches will be played in Rawalpindi; however, practice sessions will be conducted at different grounds in Islamabad and Rawalpindi.\n\nAs per the plan, the deployments are made in three tiers – Islamabad and Rawalpindi police in the first tier, Punjab Rangers in the second, and Pakistan Army in the third tier.\n\nMoreover, an emergency response plan has also been devised.\n\nThe cavalcade includes jammer vehicles, protection vehicles, traffic pilots, smart cars, ambulances, fire brigades and Rangers vehicles.\n\n“The motorcade in-charge will ensure bomb disposal sweeping of the route before every movement. The police officials deployed in motorcades will be equipped with SMGs, bulletproof helmets and jackets,” as per the plan.\n\nIn case of any mishap, the plan states, the motorcade personnel will form a standing guard around the cricket teams to cover them from all four sides.\n\nOfficials will be deployed at all sensitive points, including overhead bridges, metro stations, underpasses, roundabouts, culverts, bridges over nullahs, intersections and ridges.\n\nThe operations division will deploy personnel on the rooftops of high-rise buildings along the route.\n\nThe plan stated that three routes were planned to transport the cricket teams from the airport to the visiting venue and from the visiting venue to the cricket stadium.\n\nRoute supervisory officers, assisted by route area in-charges, will ensure that weapons of private security guards deputed at petrol pumps, hotels, and buildings falling on the route have been taken into police custody before the movement of VVIPs.\n\n“All sector in-charges will make sure there is proper checking of nullahs, bridges and link roads leading to main roads in their respective sectors.”\n\nThe police have been ordered to verify that abandoned, out-of-order vehicles and vehicles without number plates are properly checked and removed.\n\n“Remain vigilant against any suspicious person, vehicle or object, and immediately remove the suspicious person, vehicle, or object, ensuring that officials deployed are mentally and physically fit,” an advisory issued to the officials stated.\n\nThe supervisory officer at the venue will ensure no armed private security guard is deployed at hotels, it added.\n\nThe picket in-charge will restrict the entry of unauthorised vehicles to hotels.\n\nVehicles allowed to enter the hotel will be properly checked and luggage trucks of hotels will be allowed after proper bomb disposal sweeping.\n\nAdditionally, all police officials deployed on rooftop duty will be equipped with binoculars, a wireless set, and a G-3 rifle, coordinating with and engaging the security staff of hotels deployed at entry points for effective security.\n\nIn case of an emergency during the stay or movement, the security staff of the police at the venue, Pakistan Cricket Board (PCB) administration, district administration, Rangers, and Army will be responsible for the safe evacuation of the teams to the nearest safe house or hospital.\n\nAbout 20 buildings have been marked as safe houses and four hospitals.\n\nSafe City Islamabad is conducting surveillance with over 900 cameras during the arrival and departure of the cricket teams.\n\nIslamabad police, through the Safe City high-tech system, is also using drone cameras, 202 body-worn cameras and a vehicle tracking system to monitor all routes and accommodations.\n\nIslamabad Traffic Police have also issued a traffic plan for the Champions Trophy 2025.\n\nAccording to the plan, from February 24 to 27, the entry of all heavy traffic will be restricted from 7am to 1:30am.\n\nMore than 351 officers of Islamabad Traffic Police will perform their duties and alternate routes have been arranged for the convenience of citizens.\n\nAs per alternate routes, heavy traffic from Peshawar to Lahore should use the Taxila Motorway and Tarnol Phatak to Fatehjang motorway.\n\nTraffic from Lahore via GT Road to Islamabad and Rawalpindi should use Chak Beli Road to the Chakri motorway.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/23124431d1a92b8.jpg",
  "retrievedAt": "2025-08-25T19:58:11.259Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893660/5800-security-personnel-deployed-in-islamabad-for-security-of-cricket-teams",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:20:21.000Z"
}
