{
  "title": "Murtaza Jatoi suffers chest pain in Nara jail; booked in property fraud case at Moro - Pakistan - DAWN.COM",
  "author": null,
  "content": "HYDERABAD: National Peoples Party chief and a key leader of the Grand Democratic Alliance (GDA) Ghulam Murtaza Jatoi, currently incarcerated the Nara prison, was rushed to the cardiology ward of the Liaquat University Hospital (LUH) after he complained of chest pain on Saturday evening.\n\nHis complaint was first conveyed to the prison administration, which consulted the hospital’s medical superintendent (MS). Accordingly, the MS requested vice chancellor of the Liaquat University of Medical and Health Sciences (LUMHS) to arrange Jatoi’s medical examination, said a doctor at the LUH.\n\nA team of doctors examined the leader in the prison and recommended his admission for emergency treatment. Subsequently, Jatoi was taken to the LUH where he was checked by cardiologist Prof Dr Kashif Shaikh. According to the professor, the patient had suffered ‘chest tightness’.\n\nCiting Jatoi’s medical history, he said the patient had undergone angioplasty at the Aga Khan Hospital in July last year when two stents were inserted in his blocked coronary arteries. An earlier angioplasty had been performed in 2010, he added.\n\nAccording to the cardiologist, Jatoi had also complaints of asthma, hypertension and diabetes. He said that the ECG and Echo examinations done on Saturday evening were found normal. He said the patient had now been advised certain blood tests whose results were awaited.\n\nProperty fraud case registered\n\nThe Anti-Corruption Establishment (ACE) on Saturday disclosed that Ghulam Murtaza Jatoi and some revenue officials had been booked in a case pertaining to fraudulently acquiring two pieces of government land in Moro (Naushahro Feroze district) and selling them to some other parties last year.\n\nACE Inspector Mohammed Zaman Awan lodged the FIR (No.1/2025) under Sections 467, 468, 471, 420 and 34 of the Pakistan Penal Code (PPC) read with Section 5(2) of the Prevention of Corruption Act, 1947 (ACT II of 1947) against Ghulam Murtaza Jatoi, the then mukhtiarkar of Moro Zainul Abedin Channa and the then tapedar Aijaz Hussain. The role of revenue department’s deputy district officer, Moro, Junaid Ahmed Sammo, in the process was yet to be determined, he said.\n\nThe FIR states that a complaint regarding the matter was received from chief municipal officer of the Moro municipal committee in July 2024. The ACE had started an inquiry into the complaint (No 8) which pertained to the alleged illegal transfer of a piece of land, situated near Shahi Bazaar, along the main Moro road, belonging to this municipal committee.\n\nIt was alleged that forged and bogus entries were made in the Form-II to transfer the entry Nos.458 and 523 in the name of Ghulam Murtaza Khan Jatoi. The FIR claimed that act had been committed fraudulently and in connivance of government [revenue] officials as there was no such inherited properties.\n\nThe properties were then sold to two persons, Ghulam Sarwar Bhatti and Nazeer Ahmed Bhayo, by Murtaza Jatoi under fake sale deeds, it alleged.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:58:03.881Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893712/murtaza-jatoi-suffers-chest-pain-in-nara-jail-booked-in-property-fraud-case-at-moro",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:55:17.000Z"
}
