{
  "title": "Footprints: A LIBRARY UNDER SIEGE - Newspaper - DAWN.COM",
  "author": null,
  "content": "BISMILLAH Baloch never imagined that defending a library would mean taking blows to his head. Yet, as he stood alone on the ground floor of an abandoned hospital in Lore Karaiz, Quetta, facing five enraged drug addicts, he knew he could not back down.\n\n“They beat me up — five against one. I was left bleeding, alone,” reveals Mr Baloch, sitting in his makeshift office in the library he co-founded.\n\nThe group attacked him because he dared to challenge their dominance over the dilapidated hospital building, which they had long claimed as their den, even when it was not turned into a library by a small number of Baloch students.\n\nBut the transformation wasn’t welcomed by all. The drug addicts continued to rule the first floor, even listening to music at high volume at times, disturbing the students trying to study below.\n\nBismillah Baloch, who was in his 20s, stood his ground alone. Soon, his sacrifice paid off when the local administration intervened, evicting the squatters and enabling the students to study calmly.\n\nBut that respite proved short-lived. The same administration in Quetta has now sent a notice to the library staff to vacate the hospital building — completed in 2013 but abandoned due to lack of funds — as soon as possible.\n\nThe hospital-turned-library is situated in Lore Karaiz, a poverty-stricken town on the Sariab Road, in the southern parts of the city. I visit it on a Sunday along with Naveed Baloch, who takes me through the twisted streets of Lore Karaiz from the Sariab Road on a bike.\n\nTo my surprise, I find a group of students there, mostly females, who have come on Sunday despite being a day off, to speak to Dawn about why the library should not be evicted.\n\n“It took me much effort to convince my parents to let me come here,” says Asma Zehri, who was hunched over a book, wearing a black veil. “Finally, after being convinced, they allowed me to come here to study.”\n\nMost of the girls in the library speak for over half an hour about how the library has changed their minds and developed their reading interests.\n\n“Ever since coming to this library and reading books here, I feel like my opinion has changed — for all good reasons,” says Sidra Qasim, another girl sitting in the library room. “We cannot have the same environment at home. We can study here for hours in peace while we cannot have this luxury at home even for 15 minutes as most of us live in joint families.”\n\nFor these girls, the library is more than just a collection of books; it is a lifeline. But they fear losing this haven. “We need libraries, not hospitals,” Ms Zehri argues. “There are already many hospitals, but everyone goes to Karachi for treatment. If I fall sick, I’ll be taken to Karachi too. But where will I go if this library is shut down?”\n\nBooks behind bars\n\nWhen it comes to the news of raiding bookshops and stalls, Balochistan has been in the limelight for quite some time now. A student organisation claims that there have been raids on their bookstalls in recent weeks by the police and local authorities in Balochistan, including Nasirabad and Gwadar.\n\nIt is to be noted that the Baloch Students Action Committee (BSAC) has been organising book fairs as part of the Balochistan Book Caravan in the province, but the police and local administrations allegedly continue to raid the bookstalls.\n\n“It seems that the state is afraid of the Baloch youth’s interest in books, which is why the BSAC bookstalls are being raided across Balochistan,” Rafique Baloch, a BSAC leader, tells Dawn. “Balochistan has been turned into an information black hole, where information neither comes in nor goes out.”\n\nAccording to him, when BSAC members try to introduce books to the people in every nook and cranny of the province, they are not allowed to do so, because the books contain ideologies, knowledge, information and the awareness that the state does not want the Baloch to read.\n\n“The mindset towards Balochistan needs to be changed, because this is not the first time that books are confiscated here,” he adds. “It has been ongoing since the tenure of Dr Abdul Malik (a former Balochistan chief minister who served during 2013-15).”\n\nThe BSAC leader also claims their bookstalls do not feature a single banned book.\n\nHowever, Balochistan government spokesman Shahid Rind denies these claims. “A few days ago, the RCD Council Gwadar organised a four-day book fair in the port city. Before organising the event, they asked for government permission, which was duly granted and books worth millions of rupees were sold there. If the BSCA also wants to organise such an event, they should ask the government for permission.”\n\nLosing hope\n\nIrfan Baloch, an FSc student in his teens, is a regular visitor to the library. As its timing starts from 9am to 11pm, he sits in the library for hours to study books, except taking the lunch and tea breaks. Like the girls, he, too, has come to speak to Dawn on Sunday.\n\n“I have studied 61 books so far,” he says. “I also write the reviews of the books I read.”\n\nHere, he also attends English language and tuition classes conducted by the library founders free of cost.\n\nIn the words of Naveed Baloch, one of the founders, there are 10,000 books in their library.\n\n“Rickshaw drivers and labourers also come here to study,” Naveed insists. “We brought our sisters and female family members to the library so that the other girls in the vicinity would follow suit. And that is what happened after developing trust in the town. This is why many students, including females, have started coming to our library.”\n\nAccording to him, the introduction of the library has changed the town’s landscape in terms of reviving hope in them to pursue their dreams.\n\nHe goes on to add, in a somewhat desperate tone: “If the library is evicted, I am afraid students, especially girls, may lose their hope.”\n\nIn this regard, Mr Rind, the Balochistan government spokesman, insists that the building is meant for a hospital and the commissioner allowed and facilitated the students to turn it into a library as per an interim arrangement. But now the government wants to make it functional as a hospital.\n\n“If students want a library, they should reach out to their local representative or MPA, so that he can include funds in the budget for the library,” he says.\n\nHowever, students who come here regularly and even some residents claim that the building is unsuitable for a hospital due to narrow and twisting streets.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ba47ab78354.jpg",
  "retrievedAt": "2025-08-25T19:57:29.518Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893684/footprints-a-library-under-siege",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:20:05.000Z"
}
