{
  "title": "Cross-border movement via Torkham suspended - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: The cross-border movement of people via the Torkham border crossing was abruptly suspended on the night between Friday and Saturday after Pakistani and Afghan security forces developed differences over construction activities on both sides of the border.\n\nSources told Dawn that border security officials were engaged in arguments over the renovation and expansion of a security post on the Afghan side and the fixing of a signboard on the Pakistani side.\n\nThey said both countries had earlier agreed to inform and take into confidence each other about any new construction work close to the border or any changes to the border structure.\n\nThe sources said that customs and immigration offices had been closed, with their staff members told to leave the premises.\n\nThey also said that authorities asked all local clearing agents, traders and transporters, along with porters and daily-wage workers, to return to their homes, while the clearance of export and import goods had completely halted.\n\nAlso, residents of the nearby Bacha Maina residential compound were asked to shift to Landi Kotal for their safety over fears of any armed conflict between the two countries.\n\nFruit and vegetable dealers said that they had to reverse their loaded merchandise due to the fear of a prolonged border closure.\n\nAuthorities also directed drivers of the remaining loaded vehicles to return to safety, as many of them have already begun the return journey.\n\nSources later told Dawn that Pakistani authorities allowed coffins with bodies of six Afghans to be shifted to their home country as a goodwill gesture.\n\nThey said that the issue of “unauthorised” construction and renovation on either side of the border had been lingering on since 2016 when Pakistani and Afghan border forces exchanged heavy gunfire, resulting in casualties.\n\nThe sources added that since then, both countries had adopted a tough stand on their border positions and strictly reacted to any construction or renovation activity carried out without informing the other side.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:35:25.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893677/cross-border-movement-via-torkham-suspended",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:20:14.000Z"
}
