{
  "title": "All eyes on Cairo moot - World - DAWN.COM",
  "author": null,
  "content": "THE countdown is now underway to the Arab leaders’ moment of truth, which is a mere 10 days away on March 4. Last Friday, at an informal consultation in Riyadh, “joint efforts” to support “the Palestinian cause” were discussed.\n\nThe quotes in the paragraph above are from a Reuters report which in turn quoted an official Saudi Press Agency (SPA) release that also had a group photo of Saudi host Crown Prince Mohammed bin Salman flanked by the heads of state/ government of Jordan, Egypt, Qatar, the UAE, Bahrain and Kuwait.\n\nAmong the seven countries present, two, Egypt and Jordan, have diplomatic ties with Israel, after normalising relations decades ago. Another two, the UAE and Bahrain, normalised ties with the Zionist state during Donald Trump’s first term in office as a result of the Abraham Accords.\n\nSaudi Arabia and Qatar also enjoy close and cordial security, economic, and political ties with the US. So when all these leaders made known their opposition to Trump’s ethnic cleansing plan for Gaza, cynical observers were quick to point to their history and express doubts about the seriousness of the Arab position. These doubts remain.\n\nIt will become apparent at the summit in Cairo whether Arab leaders are willing to walk the talk on Gaza.\n\nIn recent days, many observers have tried to analyse the Arab stance. In the case of Egypt and Jordan, it was the fear of destabilisation of their own countries in the event of forced displacement of Palestinians from Gaza, which the latter are already calling Nakba II and vowing to resist.\n\nQatar has long supported Gaza with generous annual grants and US media has quoted the Saudi strongman as saying he’d normalise ties without delay but he can’t ‘sell it’ to his people without concessions such as a roadmap to the ‘two-state’ solution.\n\nDespite being a signatory to the Abraham Accords, the UAE, too, backed the call for a two-state solution going forward. It is no secret Saudi Arabia and the UAE have been wary of radical Arab groups because they have the potential to destabilise their countries, and the Trump ethnic cleansing plan would be a shot in the arm for these groups.\n\nBut the Gulf leaders know well how to manage their delicate relations with the US. At the same time as Saudi Arabia was hosting an Arab meeting ostensibly to decide ways and means to oppose the Trump plan, the Saudi Sovereign Wealth Fund was organising an event in America.\n\nAmong the attendees were Donald Trump’s son-in-law Jared Kushner, a property developer who first mooted the idea of Gaza ethnic cleansing and building a ‘Middle East Riviera’ along the Strip’s Mediterranean coast, and the US president’s special envoy and close friend, real estate tycoon Steve Witkoff.\n\nBoth backed the Trump plan. They seemed to claim the plan was rooted in concern for the Gaza Palestinians and the conditions they’d have to live in if they weren’t displaced. Of course, they couldn’t have used terms such as ‘forced displacement’, let alone ‘ethnic cleansing’. It wouldn’t be surprising if Trump thought of ‘his’ plan after listening to Kushner.\n\nAs Reuters highlighted, the SPA report did not mention the Trump plan. Neither did the cryptic SPA release mention Egypt’s plan that has been in the works since soon after Trump floated his ethnic cleansing idea on Feb 4 and about which we first heard when Jordan’s king was received at the White House a few days later.\n\nThere have been a couple of stories in the media. The UAE’s National spoke of a three- to five-year plan with a price tag of $20 billion which visualised relocating Palestinians to safe zones within Gaza, while the clearing of debris and rebuilding of destroyed infrastructure and housing units could start.\n\nWell before Trump, Israel had its own Gaza ethnic-cleansing plan. The manner in which its otherwise hi-tech military with precision weapons strike capability targeted the Strip’s infrastructure, demolishing universities, colleges, schools, hospitals and homes was tell-tale.\n\nAs was the Israeli Occupation Forces’ (IOF) destruction of water and sewerage land power generation/ distribution systems that are a basic prerequisite for human living. This was not the targeting of Hamas and others it blamed for the Oct 7, 2023, attacks and hostage-taking in occupied Palestine.\n\nEthnic-cleansing is a war crime under international law. This may not be the reason several states in the region, who are no more than US vassals, are opposing the Trump plan; their rationale is the same as what drives their pro-US polices: self-preservation.\n\nIt will become apparent in 10 days’ time with the Arab League summit in Cairo whether the Arab leaders are prepared to cough up the cash required for the task of Gaza’s rehabilitation and return to normality in whatever time frame. They will have to walk the talk.\n\nEven more significant would be the fate of Hamas and who will govern Gaza once and if the plan is agreed to by all parties. While Hamas has hinted it will withdraw in order to ensure peace and an eventual two-state solution, there is no clarity as to who will replace its administration. Hamas has also said it would retain the option of armed resistance to Israel.\n\nThe UAE has said it will back the Palestinian Authority that governs parts of the West Bank, under the chokehold of the IOF and the extreme right Israeli government, to take over in Gaza from Hamas. While other Arab/ Gulf states have so far not articulated their stance, Israel’s leader wanted for war crimes by the International Criminal Court, Benjamin Netanyahu, has said he won’t allow a PA administration in the Strip.\n\nSome of these positions may be aimed at gaining an upper hand in any talks but the issues raised also underline how vexed, complex, and precarious any negotiations process is likely to be. For now, one can only hope the next 15 months in Gaza are very different than the past hellish 15.\n\nThe writer is a former editor of Dawn.\n\nabbas.nasir@hotmail.com\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ba81e0c53b3.jpg",
  "retrievedAt": "2025-10-12T01:36:23.246Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893733/all-eyes-on-cairo-moot",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T02:03:53.000Z"
}
