{
  "title": "Elimination of terrorism must for country’s progress: PM Shehbaz - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Shehbaz announces construction of cancer hospital in D.G. Khan, university in Rajanpur\n• Premier to leave for Azerbaijan tomorrow\n\nDERA GHAZI KHAN: Prime Minister Shehbaz Sharif has said that Pakistan cannot move forward on the path of progress without eliminating terrorism even though its economy has stabilised.\n\nPeace is requisite for development and the federal government is committed to uniform progress and prosperity of all areas, including south Punjab, PM Shehbaz told a public rally here on Saturday.\n\nThe enemies of Pakis­tan, including Fitna al Khwarij, were carrying out terrorist activities in Khyber Pakhtunkhwa and Balochistan provin­ces and security forces were offering sacrifices in the fight against terrorism, he said, asking the nation to remember their sacrifices. He expre­ssed the resolve that tog­e­ther the nation would defeat the enemies of Pakistan.\n\nIn a veiled reference to the PTI, the premier said mounting ‘attacks on Islamabad’ in the past had caused immense losses to the country, explaining that even one-day strike caused billions of losses to the national kitty.\n\nThe prime minister said that his leader Nawaz Sharif had decided to sacrifice party politics for the sake of country’s progress as when the PML-N came to power, the inflation rate was over 40 per cent. The PML-N government with hard work and pro-development policies managed to bring inflation and interest rates down to 2.4pc and 12pc, respectively, he pointed out.\n\nThe PM, who was accompanied by Federal Minister for Power Awais Ahmed Khan Leghari, and other cabinet members, praised all the leaders of the region for working hard for the uplift of their respective areas. He mentioned that Mr Leghari was making untiring efforts to provide relief to the masses in electricity bills through reforms.\n\nExpressing his views in the Seraiki dialect, PM She­hbaz said Nawaz Sha­rif and he had a str­ong bond with this reg­ion. He said he worked day and night to alleviate the sufferings of the masses during the 2010 floods when destruction was witnessed everywhere in these areas.\n\n“I have come to convey that Nawaz Sharif and Punjab Chief Minister Maryam Nawaz Sharif are working day and night for the uplift of entire province, particularly for south Punjab,” he added.\n\nThe prime minister said during his previous tenures, he had worked for the establishment of Danish schools, hospitals, provision of free medicines and livestock, award of scholarships, besides allocating extra quota for the youth of the area in different sectors. He said the chief minister was expanding road and hospital network across the province.\n\nThe CM has launched Kissan cards, different health and education centres, besides working for the establishment of Nawaz Sharif cancer hospital in Lahore, he mentioned.\n\nPM Shehbaz said seeking foreign loans was no solution to the country’s economic issues. Without loans, they would change the fate of the country by shedding sweat and blood, he said, adding that he did not believe in hollow slogans.\n\nHe said that an era of progress and prosperity had dawned upon the area, announcing the construction of a cancer hospital in Dera Ghazi Khan and the establishment of a university in Rajanpur.\n\nFederal ministers Ahsan Iqbal, Rana Tanvir Hussain, Attaullah Tarar and PM’s adviser Rana Sanaullah accompanied the prime minister.\n\nEarlier, Minister for Power Awais Ahmed Khan Leghari in his welcome address said people had arrived in large numbers to acknowledge the prime minister’s development agenda.\n\nHe pointed out that PM Shehbaz had given Rs131 billion development package for this area.\n\n“PML-N is a party for the bright future of country,” he said, adding that the construction of roads in the area would usher in an era of prosperity.\n\nThe chief of Leghari tribe, Jamal Khan Leghari. also spoke and thanked the prime minister for his affection for the people of D.G. Khan and his development initiatives.\n\nForeign visit\n\nMeanwhile, the Foreign Office announced that PM Shehbaz would leave on Monday for a two-day state visit to Azerbaijan at the invitation of Azerbaijani President Ilham Aliyev.\n\nThe PM would visit Azerbaijan from Feb 24 to Feb 25, the FO added.\n\nPM Shehbaz, accompanied by Deputy Prime Minister and Foreign Minister Ishaq Dar and other senior officials, will hold talks aimed at strengthening cooperation in trade, energy, defence, education and climate, the FO stated.\n\nBoth sides are expected to sign multiple agreements during the visit.\n\nThe PM will deliver a keynote address at a business forum organised with Azerbaijan’s Export and Investment Promotion Agency.\n\nHe and President Aliyev will also visit Fuzuli in Karabakh, part of Azerbaijan’s recently reclaimed territory.\n\nThis would be PM Shehbaz’s second visit to Azerbaijan in less than a year.\n\nPakistan and Azerbaijan have longstanding diplomatic and economic ties, and the visit aims to further deepen bilateral cooperation, the FO said.\n\nBaqir Sajjad Syed in Islamabad also contributed to this report\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/23075854f538f68.png",
  "retrievedAt": "2025-08-25T19:58:20.847Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893689/elimination-of-terrorism-must-for-countrys-progress-pm-shehbaz",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:19:58.000Z"
}
