{
  "title": "Governor Kundi says KP CM trying to ‘erase province’s identity’ by renaming stadium after Imran - Pakistan - DAWN.COM",
  "author": null,
  "content": "Khyber Pakhtunkhwa Governor Faisal Karim Kundi on Sunday said Chief Minister Ali Amin Gandapur was trying to “erase the province’s identity” as he criticised the renaming of a stadium in Peshawar to Imran Khan Cricket Stadium.\n\nHis statements come after the KP cabinet on Friday approved renaming the Arbab Niaz Cricket Stadium — the lone international cricketing venue in the province — to Imran Khan Cricket Stadium.\n\nThe KP government had decided to honour former prime minister Imran’s “remarkable contributions to Pakistan’s cricketing legacy and his pivotal role in shaping the nation’s sports landscape”.\n\nIn his statement, Governor Kundi termed the stadium’s name change “extremely inappropriate”.\n\nHe accused CM Gandapur of being on a mission to “erase the province’s identity”.\n\nThe KP governor further claimed that naming the stadium after the “mastermind” of the May 9, 2023 riots “strengthens anti-state elements”.\n\nGovernment officials have often alleged that Imran, whose party supporters staged violent protests and vandalised military installations throughout the country on May 9, 2023, to protest the ex-premier’s arrest, was a “mastermind” behind those incidents.\n\nIn his statement, Kundi asserted that the people of Peshawar stood “united against the renaming of the stadium”.\n\nHe also criticised the PTI for “failing to renovate and restore the Arbab Niaz Stadium despite being in power for nine years”.\n\n“On one side, we have an incompetent government, while on the other, the federal government and PCB (Pakistan Cricket Board) have transformed stadiums in Lahore and Karachi within weeks,” Kundi remarked.\n\nSports minister Syed Fakhar Jahan had said the move was beyond politics as Imran was the biggest name in the country’s sporting history.\n\nThe stadium, according to a summary by the KP sports department presented before the provincial cabinet, was transferred to the sports board from the municipal corporation and the provincial government undertook its development in 1986-87.\n\nThe stadium was later improved and provided with facilities when the World Cup was jointly hosted by India and Pakistan in 1996.\n\nThe summary highlighted that the government, in recognition of the services of the political figures and former national and international level sportsmen, had named some sporting facilities in the province after them, including Lala Ayub Hockey Stadium and Qayyum Stadium at Peshawar Sports Complex, Hanif Khan Sports Complex Thana, Abdul Wali Khan Sports Complex Charsadda and Qazi Mohib Hockey Stadium Bannu.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/23150640cde94da.jpg",
  "retrievedAt": "2025-08-25T19:57:31.285Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893825/governor-kundi-says-kp-cm-trying-to-erase-provinces-identity-by-renaming-stadium-after-imran",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T10:57:14.000Z"
}
