{
  "title": "Citizens affected by Diamer Dam vow to continue sit-in at Chilas - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: The first meeting of the federal committee discussed issues of Diamer-Basha Dam affected people and decided to meet their genuine demands as thousands of protesters continued their sit-in at Chilas for the sixth consecutive day on Saturday.\n\nThe protesters announced that they would not allow the government to complete the dam until their 31-point charter of demands was met.\n\nThe first meeting of the committee, constituted by Prime Minister Shehbaz Sharif recently to address the grievances of the affected people, was held in Islamabad on Saturday with Minister for Kashmir Affairs and Gilgit-Baltistan Amir Muqam in the chair.\n\nThe meeting was attended by Minister for Water Resources Musadik Hussain Malik, GB Chief Minister Haji Gulbar Khan, Wapda Chairman retired Lt Gen Sajjad Ghani,\n\nCommittee formed by prime minister holds maiden meeting and promises to resolve genuine issues of affected people\n\nSecretary Kashmir Affairs and Gilgit-Baltistan Zafar Hassan, GB Chief Secretary Abrar Ahmed Mirza and others.\n\nSpeaking on the occasion, Amir Muqam said resolving the legitimate demands of the affected people of the dam was the priority of the federal government.\n\nHe said as per the instructions of the prime minister, speedy work on compensations, water and sanitation schemes, schools and other projects was underway.\n\nHe said that on the demand of the GB chief minister he will soon visit Diamer and meet the representatives of the dam affected people.\n\nThe minister for water resources said legitimate issues of the affected people would be resolved by Wapda.\n\nMeanwhile, the protesters in Chilas vowed to continue their sit-in till the fulfilment of their demands.\n\nMaulana Hazratullah, the head of the movement, said conspiracies were being hatched to sabotage the protest movement which had been started with the support of all tribes, political, religious parties, youth and social organisations. It was also backed by the GB government.\n\nHe said without resolving the issues of the affected people, the dam could not be built.\n\nHe said local people sacrificed everything for the project but the government was reluctant to solve the genuine demands of the local people who were going to be displaced after completion of the dam.\n\nThe 31 points charter of demands included 80 per cent royalty of Diamer Dam and 30pc royalty of Dassu Dam for Gilgit-Baltistan; free electricity to Diamer district and on discounted rate to the people of GB from Diamer Dam, compensation for 18,000 acres acquired for the dam, financial package for the remaining 3,000 families of affected by the dam, commercial and residential plots, education, health, sewerage projects, appointments of local people on the dam project from grade 1 to grade 16 and regularisation of contingent and daily wage employees.\n\nMeanwhile, a large number of people from other areas also arrived in Chilas to show solidarity with the protesters.\n\nOpposition leader in GB assembly Kazim Mesum said the federal government through Wapda committed injustices with Diamer Basha Dam affected people, adding local people have awakened for their rights.\n\nThe opposition leader said the federal government exploited GB people’s rights.\n\nHe warned the government to settle the issues without further delay otherwise the protest movement would be expanded to other areas.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ba3ed29033b.jpg",
  "retrievedAt": "2025-08-25T19:58:11.667Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893656/citizens-affected-by-diamer-dam-vow-to-continue-sit-in-at-chilas",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:20:20.000Z"
}
