{
  "title": "Woman attempts suicide after being publicly humiliated in Sujawal - Pakistan - DAWN.COM",
  "author": null,
  "content": "THATTA: A woman was subjected to humiliation and torture in public in Sujawal on Saturday by members of her own community after she resisted attempts by a group to demolish a wall of her family home claiming it was illegally built on a temple’s land.\n\nOverwhelmed by the trauma, the victim, Shrimati Lajwanti Devi, wife of Arjan Kumar, attempted to immolate herself but was saved in the nick of time by her relatives, who intervened to prevent a tragedy.\n\nThe incident, which has since sparked widespread outrage, was culmination of a dispute over claims on the property, which the victim says has been her family’s residence for over six decades.\n\nMs Devi later recounted her ordeal at a press conference at local press club and claimed that Dr Hoat Kumar, a prominent figure in local Hindu community, along with his supporters, had attempted to demolish the wall of her house, asserting the land belonged to a temple.\n\nShe, however, insisted that her family had legally resided on the property for 60 years and accused Dr Hoat of exploiting religious sentiments to justify his actions. “They humiliated me in front of everyone, tortured me, and tried to take away what is rightfully ours,” she said, her voice trembling with emotion.\n\n“I could not bear the shame and pain and tried to end my life but my family saved me,” she said.\n\nDr Hoat maintained that the land was designated for the temple and that Ms Devi’s family had illegally built their home on it but his claims have been contradicted by a former president of the local Hindu Panchayat.\n\nThe former leader, speaking on condition of anonymity, confirmed that the plot in question was private property and did not belong to the temple. He expressed deep regret over the incident, stating that it had brought “disgrace to the entire Hindu community of Sujawal.”\n\nHe added: “This was not about religion or faith; it was about power and control. The way Ms Devi was treated is unacceptable and has tarnished our community’s reputation.”\n\nMs Devi appealed to Sindh chief minister and other relevant authorities to take immediate action against those responsible for her humiliation and trauma.\n\nHuman rights activists and civil society organisations have also joined their voice to the growing calls for a thorough investigation into the incident and justice for the victim. “This is not just an attack on Ms Devi; it’s an attack on the dignity of every woman and every minority in this country,” said a local activist.\n\nHe said the government must ensure that such incidents were not repeated and the perpetrators were held accountable.\n\nThe incident has left the Hindu community in Sujawal divided with some supporting Dr Hoat’s claims and others expressing solidarity with Ms Devi.\n\nEfforts under way for ‘settlement’\n\nIn the wake of mounting public pressure, a committee comprising provincial minister Muhammad Ali Malkani, Syed Shafqat Hussain Shah Shirazi, Heer Soho and Giyan Chand Esarani reached Sujawal to hold talks with the affected family and make efforts to reach an amicable settlement.\n\nSources said that two provincial ministers, one from a minority community and the other representing the Sujawal constituency, had resolved the dispute and dispersed the crowd.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:58:03.592Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893710/woman-attempts-suicide-after-being-publicly-humiliated-in-sujawal",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:55:17.000Z"
}
