{
  "title": "Zelensky ‘not ready’ to sign minerals deal with US - World - DAWN.COM",
  "author": null,
  "content": "KYIV: Ukrainian President Volody­myr Zelensky is “not ready” to sign a minerals deal with the United States, a source said on Saturday, raising doubts about the proposed agreement as a rift between the two countries deepened.\n\nSince taking office last month, President Donald Trump has upended US foreign policy, making diplomatic overtures towards the Kremlin while demanding Ukraine give up its rare minerals to compensate for the wartime aid it received under Joe Biden.\n\nTrump’s national security adviser predicted on Friday that Zelensky would sign a minerals deal soon, but its contours have not been made public and Zelensky has pushed back at any arrangement that would mean “selling” his country.\n\n“In the form in which the draft is now, the president is not ready to accept, we are still trying to make changes and add constructiveness,” a Ukrainian source close to the matter said.\n\nWashington’s proposed UN text omits mention of Russian-occupied territory in Ukraine\n\nKyiv wants any agreement signed with the US to include security guarantees. The negotiations between the two countries come amid a deepening war of words between Trump and Zelensky that has raised alarm in Kyiv and Europe.\n\nOn Wednesday, Trump branded his Ukrainian counterpart a “dictator” and called for him to “move fast” to end the war, a day after Russian and US officials held talks in Saudi Arabia without Kyiv.\n\nOn Friday, the US proposed a United Nations resolution on the Ukraine conflict that omitted any mention of Kyiv’s territory occupied by Russia, diplomatic sources said.\n\n‘What kind of partnership is this?’\n\nTrump has asked for “$500 billion worth” of rare earth minerals to make up for aid given to Kyiv — a price tag that Ukraine has balked at and that does not correspond with published US aid figures.\n\n“There are no American obligations in the agreement regarding guarantees or investments, everything about them is very vague, and they want to extract $500 billion from us,” the Ukrainian source said of the proposed deal.\n\n“What kind of partnership is this? … And why do we have to give $500 billion, there is no answer,” the source said, adding that Ukraine had proposed amendments to the draft.\n\nThe United States has provided Ukraine with more than $60 billion in military aid since Russia’s invasion, according to official figures — the largest such contribution among Kyiv’s allies but substantially lower than Trump’s $500 billion figure.\n\nThe Kiel Institute, a German economic research body, said that from 2022 until the end of 2024, the United States gave 114.2 billion euros ($119.8 billion) in financial, humanitarian and military aid in total.\n\nUK support ‘ironclad’\n\nA senior Ukrainian official said that despite the tensions, talks on a possible agreement were “ongoing”, with Trump envoy Keith Kellogg praising Zelensky as “courageous” after visiting Kyiv earlier this week.\n\nUkraine still faces daily Russian bombardment and is slowly ceding ground to Moscow on the frontline. Moscow’s defence ministry earlier on Saturday claimed the capture of Novolyubivka in the eastern Lugansk region, which is now largely under Russian control.\n\nOn Monday, Ukraine will mark the third anniversary of Russia’s invasion. UK Prime Minister Keir Starmer and European Commission president Ursula von der Leyen discussed “the need to secure a just and enduring peace in Ukraine” on a call Saturday, a Downing Street spokesperson said.\n\nIn a separate call on Saturday with Zelensky, Starmer reiterated “UK’s ironclad support for Ukraine”, according to Downing Street.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:36:09.970Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893752/zelensky-not-ready-to-sign-minerals-deal-with-us",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T02:25:43.000Z"
}
