{
  "title": "Afghans denied US resettlement to be deported - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Dar says Islamabad open to negotiations with Washington on the matter\n• 80,000 Afghans already relocated, fate of over 40,000 remains in limbo\n\nISLAMABAD: Pakistan on Saturday warned that Afghan refugees not accepted for resettlement by the United States would be treated as illegal immigrants and deported.\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar, in an interview with TRT details of which were shared by the FO on Saturday, said that while Pakistan was open to negotiations with the US on the matter, refugees whose resettlement is denied would face deportation.\n\n“We will be examining the issue and will negotiate,” Mr Dar said. “However, in principle, if any refugee was meant to be taken by another country after due process — no matter the timeline — and if it doesn’t happen and the country refuses, that person will be considered an illegal immigrant in Pakistan.”\n\nHe added, “We may be forced to send such refugees back to their original country, which is Afghanistan.”\n\nSince the Taliban takeover in August 2021, approximately 600,000 Afghans have fled to Pakistan, fearing persecution. Many sought resettlement in third countries, particularly the United States. While about 80,000 Afghans have been successfully relocated, more than 40,000 remain in limbo.\n\nA significant portion — around 25,000 — had been expected to be resettled in the US. However, President Donald Trump’s abrupt suspension of the resettlement plan left roughly 20,000 Afghans uncertain about their future in Pakistan.\n\nMr Trump’s executive order on Jan 20 mandated that the secretaries of homeland security and state submit a report within 90 days on whether resuming refugee admissions under the US Refugee Admissions Programme (USRAP) would align with US interests.\n\nHowever, reports suggest that the Office of the Coordinator for Afghan Relocation Efforts, which oversees Afghan resettlement in the US, has been instructed to develop plans for closure by April, further dashing hopes for those awaiting relocation.\n\nThe Afghans slated for resettlement in third countries comprised a diverse group of individuals who had risked their lives to support the international community’s efforts in Afghanistan. This included interpreters, translators, and other support staff who worked alongside the US government and coalition forces, as well as Afghan journalists, human rights activists, and humanitarian workers.\n\nIn November 2023, Pakistan launched a crackdown on undocumented foreigners. Since then, more than 815,000 individuals have been repatriated.\n\nAfter facing pressure from rights gro­ups and foreign governments, who feared these vulnerable individuals may face persecution at the hands of the Taliban if sent back to Afghanistan, Pakistan had initially allowed Afghans awaiting resettlement in a third country to remain in the country until their cases were processed. However, Mr Dar’s latest remarks suggest the reprieve may be ending soon.\n\nPakistan currently hosts over 2.5 million Afghan refugees, about half of whom are registered with the UNHCR. Those previously registered have been granted an extension to stay until June 2025.\n\nLast month, Prime Minister Shehbaz Sharif’s office announced a three-phase plan to repatriate Afghan refugees, setting a March 31 deadline to expel Afghan nationals from Islamabad and Rawalpindi as part of broader deportation efforts.\n\nForeign governments that had agreed to take in refugees were also conveyed that they must expedite their resettlement process before the deadline or risk having those awaiting relocation deported to Afghanistan.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:35:37.343Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893690/afghans-denied-us-resettlement-to-be-deported",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:19:58.000Z"
}
