{
  "title": "Trump orders tighter curbs on Chinese investments - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: US President Donald Trump has signed a memo calling for curbs on Chinese investments in strategic sectors like technology and critical infrastructure, a move Beijing slammed on Saturday as “discriminatory.”\n\nThe move, including an expanded role for a foreign investment review panel, comes at a time of growing trade tensions and strategic competition between the world’s two biggest economies.\n\nIt is aimed at promoting foreign investment in the United States, while protecting US national security interests “particularly from threats posed by foreign adversaries” like China, the White House said.\n\nThe memo signed on Friday singles out China for “increasingly exploiting United States capital to develop and modernize its military, intelligence, and other security apparatuses.”\n\nChina’s commerce ministry spokesperson on Saturday said the “US approach unduly broadens the concept of national security, and is discriminatory.”\n\nIt will “seriously hurt the confidence of Chinese enterprises willing to invest in the United States,” the spokesperson said in a statement.\n\n“China will closely follow the moves of the US and take necessary measures to safeguard its legitimate rights and interests,” the spokesperson added.\n\nThe memo called for the Committee on Foreign Investment in the United States (CFIUS) to be used to restrict Chinese investments in key US sectors such as technology, critical infrastructure, health care and energy.\n\nCFIUS is a panel that weighs the national security implications of foreign investments in the United States.\n\n“President Trump is keeping his promise to prevent foreign adversaries from taking advantage of the United States,” the White House said.\n\nTrump early this month imposed additional customs duties of 10 percent on all products imported from China, over the country’s alleged role in the deadly fentanyl trade.\n\nBeijing has pushed back against the accusation.\n\nBut on Wednesday, the US president suggested that a trade deal with China was “possible”.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:57:50.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893761/trump-orders-tighter-curbs-on-chinese-investments",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T02:31:15.000Z"
}
