{
  "title": "German conservatives win election but far-right AfD surges, exit polls show - World - DAWN.COM",
  "author": null,
  "content": "Germany’s opposition conservatives won the national election on Sunday, putting leader Friedrich Merz on track to be the next chancellor while the far-right Alternative for Germany (AfD) came in second, its best-ever result, exit polls showed.\n\nFollowing a campaign roiled by a series of violent attacks and interventions by US President Donald Trump’s administration, the conservative CDU/CSU bloc won 28.5 per cent of the vote, followed by the AfD with 20pc, an exit poll published by ZDF public broadcaster showed.\n\nChancellor Olaf Scholz’s Social Democrats (SPD) tumbled to their worst result since World War Two, with 16.5pc of the vote share, according to the ZDF exit poll.\n\n“This is a bitter election result for the Social Democratic Party, it is also an electoral defeat,” Scholz said in a first reaction. “Congratulations on the election result,” he said in remarks directed towards Merz.\n\nThe Greens were on 12pc while the FDP hovered around the 5pc threshold to enter parliament. A late campaign surge by the far-left Die Linke (The Left) party gave it 9pc of the vote while breakaway leftist party BSW led by Sahra Wagenknecht squeezed in on 5pc.\n\nThe results set the stage for protracted coalition talks and likely mean a three-way coalition made up of one or two of the three same parties that were part of Scholz’s unpopular alliance that collapsed in November.\n\nMerz, 69, has no previous government experience but has promised to provide greater leadership than Scholz and to liaise more with key allies, restoring Germany to the heart of Europe. He said that Germany’s conservatives will do everything they can to form a government capable of taking action as quickly as possible.\n\n“Tonight we will celebrate and from tomorrow we start working,” he said in a first reaction in Berlin, surrounded by supporters. “The world out there is not waiting for us.\n\nA brash economic liberal who has shifted the conservatives to the right, he is considered the antithesis of former conservative Chancellor Angela Merkel, who led Germany for 16 years.\n\nShort of a majority in an increasingly fragmented political landscape, however, his conservatives will have to sound out partners to form a coalition.\n\nThose negotiations are certain to be tricky after a campaign which exposed sharp divisions over migration and how to deal with the AfD in a country where far-right politics carry a particularly strong stigma due to its Nazi past.\n\nThat could leave Scholz in a caretaker role for months, delaying urgently needed policies to revive Europe’s largest economy after two consecutive years of contraction and as companies struggle against global rivals.\n\nIt would also create a leadership vacuum in the heart of Europe even as it deals with a host of challenges including US President Donald Trump threatening a trade war and attempting to fast-track a ceasefire deal for Ukraine without European involvement.\n\nGermany, which has an export-oriented economy and long relied on the United States for its security, is particularly vulnerable.\n\nGermans are more pessimistic about their living standards now than at any time since the financial crisis in 2008. The percentage who say their situation is improving dropped sharply from 42pc in 2023 to 27pc last year, according to pollster Gallup.\n\nAttitudes towards migration have also hardened, a profound shift in German public sentiment since its “Refugees Welcome” culture during Europe’s migrant crisis in 2015, that the AfD has both driven and harnessed.\n\nAttitudes towards migration have also hardened in a profound shift in German public sentiment since its “Refugees Welcome” culture during Europe’s 2015 migrant crisis.\n\nMerz “knows something about the economy,” said voter Brigitte Klute after braving the cold to cast her vote in Arnsberg, Merz’s hometown. “He needs to rebuild our country a little better. So much has been lost,” she said.\n\nThe election campaign was dominated by fierce exchanges over the perception that irregular immigration is out of control, fuelled by a series of attacks in which the suspected perpetrators were of migrant origin.\n\nA Syrian refugee was arrested over the stabbing of a tourist at Berlin’s Holocaust memorial on Friday. Prosecutors said he had been planning “to kill Jews”.\n\nThe campaign has also been overshadowed by the unusually forceful show of solidarity by members of the Trump administration — including Vice President JD Vance and tech billionaire Elon Musk — for the anti-migrant AfD and broadsides against European leaders.\n\nJust before the polls opened Musk again endorsed the AfD, posting a clip of regional AfD leader Bjoern Hoecke making a speech in which he said “Germany is our country, our land, our nation … let’s take our country back!” from the globalists.\n\nHoecke has twice been fined for using a Nazi-era slogan and is deemed so radical a court said he could be described as a fascist.\n\nThe 12-year-old AfD is on track to take second place for the first time in a national election.\n\n“I’m completely disappointed in politics, so maybe an alternative would be better,” said retired Berlin bookkeeper Ludmila Ballhorn. The 76-year-old, who plans to vote AfD, said she was struggling to live on her state pension of €800 ($836.64) a month. “Rents and all other costs have soared,” she added.\n\nThe AfD, however, is unlikely to govern for now because all mainstream parties have ruled out working with the party, though some analysts believe it could pave the way for an AfD win in 2029.\n\nThe strength of the AfD, along with a small but significant vote share for the far-left and the decline of Germany’s big-tent parties, is increasingly complicating the formation of coalitions and governance.\n\nEU allies are cautiously hopeful the elections might deliver a more coherent government able to drive forward policy at home and in the bloc. Some also hope Merz will reform the “debt brake” constitutional mechanism that limits government borrowing and that critics say has strangled new investment.\n\nPolls, however, suggest another three-way coalition may be necessary if several small parties make the 5pc threshold to enter parliament, complicating talks.\n\n“A lot of my friends are likely going to vote for the conservatives because this government didn’t work so well and Merz’s international standing is quite good,” said 26-year-old civil servant Mike Zeller. “I just hope enough parties agree to a government so they can leave the AfD out.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/23224439b76a81c.jpg",
  "retrievedAt": "2025-08-25T19:57:30.080Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893836/german-conservatives-win-election-but-far-right-afd-surges-exit-polls-show",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T14:18:07.000Z"
}
