{
  "title": "Pope Francis suffers respiratory attack, condition critical: Vatican - World - DAWN.COM",
  "author": null,
  "content": "Pope Francis’s condition “continues to be critical”, the Vatican said on Saturday, saying the 88-year-old was alert but had suffered a respiratory attack that required “high-flow oxygen”, and also blood transfusions.\n\n“At the moment the prognosis is reserved,” it said, as the head of the Catholic Church prepared to spend his ninth night in Rome’s Gemelli hospital, where he was diagnosed this week with double pneumonia.\n\n“The holy father’s condition continues to be critical, therefore, as explained yesterday, the pope is not out of danger,” the Vatican said in its regular early evening update.\n\n“This morning Pope Francis presented a prolonged asthmatic respiratory crisis, which also required the application of high-flow oxygen,” it said.\n\nDaily blood tests “showed thrombocytopenia, associated with anaemia, which required the administration of blood transfusions”, it added.\n\n“The holy father continues to be alert and spent the day in an armchair even if he was suffering more than yesterday.”\n\nThe Vatican earlier confirmed the Argentine pontiff would not deliver his usual weekly Angelus prayer on Sunday, saying the text would be published, as it was last weekend.\n\nFrancis has been head of the Catholic Church since 2013 but has suffered numerous health issues in recent years, and underwent major surgery in 2021 and 2023.\n\nThis latest hospitalisation has cast doubt over his ability to continue as leader of the world’s almost 1.4 billion Catholics, fuelling speculation over his potential resignation — and who might take over.\n\nVatican Secretary of State Pietro Parolin told Italy’s Corriere della Sera daily that such discussion was normal but said he would not enter into “useless speculation”.\n\n“Now we are thinking about the health of the holy father, his recovery, his return to the Vatican: these are the only things that matter,” the cardinal said.\n\nA group of nuns and priests from around the world gathered today outside the entrance to the Gemelli hospital, where Francis is staying in a special papal suite on the 10th floor, to pray for him.\n\n“We are praying today for the holy father, Pope Francis, and our hope is that he will recover well in the grace of God,” Brazilian priest Don Wellison told AFP.\n\nFrancis has been moving between his bed, a chair, and an adjacent chapel where he prays. He has also been doing some work, the Vatican says.\n\nProfessor Sergio Alfieri, who leads the pope’s medical team at the Gemalli, said a day ago the pontiff’s condition was slightly improving, allowing doctors to incrementally lower the amount of medication he is taking.\n\nBut he made clear then that the situation was very serious, noting the pontiff’s age and general health condition.\n\n“Is the pope out of danger? No, the pope is not out of danger,” Alfieri said, but added: “If you then ask whether he is in danger of dying at this moment, the answer is still no.”\n\nFrancis has said the papacy is a job for life but has also left the door open to resigning like his predecessor Benedict XVI.\n\nHe has often joked about the scheming his health woes inevitably prompt, particularly among those who oppose his attempts at reform.\n\nAfter undergoing colon surgery in 2021, he joked that “they were preparing the conclave”, the meeting of cardinals to elect a new pope following a death or resignation.\n\nItalian Cardinal Gianfranco Ravasi told the Corriere a day ago that he did not rule out Francis stepping down.\n\nBut Cardinal Victor Manuel Fernandez, who leads the Holy See’s powerful Dicastery for the Doctrine of the Faith, said he had heard no particular manoeuvring this time.\n\n“I don’t see a pre-conclave environment, I don’t see more conversations on a potential successor than there were a year ago,” he told Argentina’s La Nacion daily.\n\n“So far I perceive a lot of respect.”\n\nThe pope maintains a punishing work schedule, and in September made a 12-day tour to the Asia-Pacific.\n\nHowever, he has suffered increasing health issues, from his colon surgery to a hernia operation in 2023.\n\nHe is also overweight and suffers constant hip and knee pain, which forces him to use a wheelchair most of the time.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/23001331065f6ad.jpg",
  "retrievedAt": "2025-10-12T01:36:09.176Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893647/pope-francis-suffers-respiratory-attack-condition-critical-vatican",
  "dateList": "2025-02-23",
  "date_published": "2025-02-22T19:14:19.000Z"
}
