{
  "title": "Musk says all US govt staff must justify their work or lose jobs - World - DAWN.COM",
  "author": null,
  "content": "Elon Musk, the billionaire advisor to Donald Trump, said on Saturday that all US federal employees must justify their work or lose their jobs, hours after the president pushed him to be “more aggressive” in slashing government spending.\n\nMusk — the world’s richest person and Trump’s biggest donor — has led the effort to fire swaths of the government workforce.\n\n“All federal employees will shortly receive an email requesting to understand what they got done last week. Failure to respond will be taken as a resignation,” Musk wrote.\n\nAccording to a copy of the email provided to AFP, federal workers were asked to submit “approximately 5 bullets of what you accomplished last week.”\n\nThe email came from the US Office of Personnel Management (OPM), with the subject line “What did you do last week?”. The deadline to reply was 11:59pm Monday, though the message did not say failure to do so would lead to termination.\n\nThe OPM did not immediately reply to AFP’s request for comment on Saturday evening.\n\nThe American Federation of Government Employees (AFGE), the largest federal employee union, vowed to challenge any unlawful terminations in a statement from national president Everett Kelley.\n\nKelley slammed Musk and the Trump administration, saying the move showed “their utter disdain for federal employees and the critical services they provide to the American people”.\n\n“It is cruel and disrespectful to hundreds of thousands of veterans who are wearing their second uniform in the civil service to be forced to justify their job duties to this out-of-touch, privileged, unelected billionaire who has never performed one single hour of honest public service in his life,” he said.\n\nSeveral federal employees told AFP that they were advised by their agencies not to respond to the email and wait for further instruction, a recommendation echoed by the National Treasury Employees Union.\n\n“I have so much work to do, I am not going to neglect actual patient care for this drama,” a physician at the Department of Veterans Affairs, who received the email, told AFP.\n\nMusk later appeared to downplay the requirements of the request, writing on X that the bar is “very low” and saying, “An email with some bullet points that make any sense at all is acceptable!”\n\nEarlier on Saturday, Trump said on his Truth Social platform that Musk was “doing a great job, but I would like to see him get more aggressive”.\n\n“Remember, we have a country to save,” the Republican leader added.\n\nTrump has put the tech entrepreneur in charge of the new Department of Government Efficiency (DOGE) advisory body, tasking him with slashing public spending and tackling alleged waste and corruption.\n\nIn the latest cuts announced Friday, the US Defence Department is to reduce its civilian workforce by at least five per cent starting next week.\n\nTrump’s administration has already begun firing many other federal workers who are on probationary status.\n\nDOGE is a free-ranging entity run by Musk, though its cost-cutting spree has been met with pushback on several fronts and mixed court rulings.\n\nA judge on Thursday denied a union bid to temporarily halt the firing of thousands of people.\n\nMusk said this week he would work with Trump for as long as he “can be helpful”, as the pair dismissed concerns over conflicts of interest due to the tycoon’s government contracts.\n\n“Elon is doing a great job,” Trump told a meeting of conservative activists on Saturday, running through a list of what he said were “some of the flagrant scams” that had been uncovered.\n\n“We love Elon, don’t we? He’s a character,” Trump added. “People said, what official position does he have? I said, ‘Patriot’.”\n\nMusk said this week DOGE was publicising its actions on its website and that the transparency would hold him accountable.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/231336385932117.jpg",
  "retrievedAt": "2025-08-25T19:57:31.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893814/musk-says-all-us-govt-staff-must-justify-their-work-or-lose-jobs",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T09:00:53.000Z"
}
