{
  "title": "SBP issues criteria for Raast participants - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: To reduce cash transactions through digitalisation, the State Bank of Pakistan (SBP) issued a criterion on Saturday to enhance the technical capabilities of participant banks involved in the instant payment system — Raast.\n\nWhile there has been a significant increase in digital payments in Pakistan over the past five years, cash transactions still constitute a considerable portion of the overall payment system.\n\nTrying to take the payment system on a fast track and minimise cash transactions, the SBP has issued Raast Participation Criteria outlining minimum requirements for the entities desirous of becoming Raast participants and having the necessary functional and technical capabilities to provide digital payment services to their customers through Raast.\n\nRaast is a state-of-the-art instant payment system launched in 2021 to facilitate instant, safe and efficient transfer of funds nationwide. It offers a bulk payment facility, person-to-person (P2P) transfers, person-to-merchant (P2M) payments, and payment initiation services.\n\nSince its launch, 44 entities, including SBP-regulated and government entities, have been onboarded on Raast as participants. The central bank envisages that the criteria will facilitate the prospective participants in onboarding on Raast, significantly enhance the number of participants, promote digital payments, and encourage innovation and competition in the payments market.\n\n“The criteria have been developed for banking and non-banking institutions. It will enhance Raast accessibility for promoting digital payment and stimulate innovation and competition in the payments market,” said the SBP.\n\nThe State Bank said it may suspend or terminate Raast participation of any entity with immediate effect if it is in the public interest or when the participant violates or breaches the criteria or any other law, rules, regulations, etc.\n\nThe central bank may act if any participant threatens Raast’s security, integrity, or reputation and if the entity fails to fulfil the responsibilities and obligations for using the Raast system as agreed with SBP or its subsidiary.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:57:50.354Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893759/sbp-issues-criteria-for-raast-participants",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T02:31:15.000Z"
}
