{
  "title": "SMOKERS’ CORNER: FAITH IN FALSEHOODS - Newspaper - DAWN.COM",
  "author": null,
  "content": "One often comes across news of people suffering from serious illnesses but refusing modern treatments and medicines. They are likely to opt for ‘alternative medicine’, such as homoeopathy.\n\nMany of these men and women deny much-needed medical assistance since they deeply believe that modern medicines are the cause of their health problems.\n\nSuch beliefs are often expected in societies where the rate of education is low. But, for example, studies show that a reluctance to get anti-Covid vaccine shots during the Covid-19 pandemic was almost as high in the United States as it was in many ‘poor’ African countries.\n\nWhat’s more, the country’s president at the time, Donald Trump, was asking people to use bleach to cure the virus. Thousands of people continued to avoid getting vaccine shots, or wear a mask, despite the fact that most of the refusers were visibly dying from the deadly virus.\n\nTanzania’s then-president John Magufuli actively discouraged people from wearing masks, and called for “herbal-infused steam therapy” to counter the virus. In March 2021, he passed away, reportedly from Covid-19.\n\nDespite the progress of science and reason, myths and conspiracy theories continue to thrive — even among educated people. From rejecting modern medicine to embracing political falsehoods, individuals often cling to debunked ideas that offer simplistic explanations for complex realities\n\nIn Pakistan, the polio virus that has been eradicated from most parts of the world is still present in certain communities. These communities believe that the polio vaccine is ‘engineered’ to lower the reproductive potency of people (especially males).\n\nAccording to the political economists Thomas Apolte and Julia Muller, “Some ideas that have been long debunked still tend to persist among some groups of individuals.”\n\nIn a study published in the June 2021 issue of the European Journal of Political Economy, Apolte and Muller critiqued the assumption that debunked ideas persist because the public mostly lacks accurate information. According to Apolte and Muller, different myths and “weird ideas” have been persistent over time, sometimes among well-educated and well-informed people.\n\nThey wrote that myths and theories that are close to one’s intuition are readily accepted. These persist because they have a “low cost” and/or require little intellectual effort from the believer. But once there’s an incentive to be had from myths/theories, the believers become more willing to invest more time and mental effort in them.\n\nThis they do to strengthen their beliefs and rationalise them in a more articulate manner. This is not to suggest that the believer in this case is exercising any critical thinking as such. Rather, they are tightening and deepening their beliefs because an incentive is on offer.\n\nIn 2007, a couple of articulate men (henceforth referred to as AM) began to appear on Pakistani TV channels. 2007 was a highly turbulent year in the country. A once-popular dictatorship was under siege from protests and Islamist terror attacks. The AM began to spout a mixture of conspiracy theories.\n\nThese were shaped to address the confusion and despondency that the dictatorship’s core constituents found themselves in. They mostly belonged to urban middle-class segments. The complex political, economic and social factors that were intensifying the turmoil were summarised by the AM as conspiracies seeded by “anti-Islamic forces” and the work of the ‘dajjal’ (in Islamic eschatology, a false messianic figure who will come forth before the ‘end of time’).\n\nWhen such claptrap was critiqued by some, the AM began to dig deeper. In a bid to bolster their claims, they remodelled certain old but persistent myths to appeal to the emotions of their already enthralled audiences. Various debunked conspiracy theories of the 19th and 20th centuries were posited in a ‘scholarly’ manner to make them seem academically sound and historically accurate.\n\nMost of the AM’s audiences didn’t have to apply much intellectual effort to explore what they were being told. Theirs was a low-cost belief and the incentive in their case didn’t go beyond simply hearing what they wanted to.\n\nOn the other hand, the AM had bigger incentives — such as the expansion of a dedicated following and higher TV ratings. So, they put more effort in ‘deepening’ their claims through ‘academic sources’, which were as questionable as the myths and theories they were ‘substantiating’.\n\nMost of the AM’s audiences were educated. So why couldn’t they realise that most of what the AM were saying had already been debunked? On a private level, some followers did investigate the claims. The incentive may have been to continue belonging to a like-minded group and gain a prominent position in the group by digging deeper to sound more expansive and literate about the myths.\n\nBut I personally witnessed how this, in certain cases, saw some folk stumble upon critiques of what the AM were saying, and then actually change their views at the expense of losing their place in the group that they were a part of.\n\nThe digging deeper bit is referred to by Apolte and Muller as “ex-post rationalising.” It kicks in when an incentive compels believers of myths and questionable theories to strengthen the beliefs. But as mentioned, it can sometimes go the other way.\n\nMyths, conspiracy theories etc, remain prevalent because they provide a simplistic context of the social, political and economic complexities that one is faced with on an almost daily basis. Intellectually, this is a low-cost exercise, and the incentive is to simply retain a somewhat ill-informed understanding of the world.\n\nHowever, for those who shape and articulate myths and conspiracy theories to bag an audience, theirs is a high-cost and high incentive game. They may be believers themselves, but many of them are also people who were simply intrigued by how promoting myths and conspiracy theories in a certain manner can easily gain one an enthusiastic (and paying) audience, and power. This is when from ‘true believers’, they become expert exploiters. Certain kinds of politicians, ‘gurus’ and cult leaders fall in this category.\n\nJust over a century ago, most scholars were convinced that the world had entered an era of the supremacy of science, reason and rationality. However, today, many of their intellectual descendants are lamenting the way that era was breached, mangled and turned into an irrational one by powerful irrationalists in government and on electronic and social media.\n\nBut even when the world was supposedly entering the era of scientific magnificence, the French political theorist Georges Sorel wrote that no amount of rational ideas based on substantiated facts can deter most people from thinking in an irrational manner. In his 1906 book Reflections on Violence, Sorel wrote that people are more often moved into action by myths than by appeals to reason.\n\nLess than three decades later, fascism enthralled millions in Europe through ideologies that banked almost entirely on myths and conspiracy theories. Today, one can see millions being enthralled by similar ideologies all over again.\n\nPublished in Dawn, EOS, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b9e1245da98.jpg",
  "retrievedAt": "2025-10-12T01:36:09.103Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893623",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:20:35.000Z"
}
