{
  "title": "Jakarta’s last carriage horses endure harsh lives - World - DAWN.COM",
  "author": null,
  "content": "JAKARTA: In a dark stable under a heaving highway in Indonesia’s capital, trucks rumble past emaciated carriage horses tied to pillars in ramshackle wooden stalls, their ribs protruding.\n\nThe steeds are used to pull traditional wooden carriages known as delman, once a staple of colonial-era transportation, but fading from view in Jakarta in an era dominated by ride-hailing apps. Now limited to just a few areas of the city, only several hundred delman horses remain to ferry tourists on weekends or public holidays.\n\nAnimal rights activists say the conditions under which the horses are kept are so harsh the practice must end. “Thank God, in here, at least the horses are protected from the sun’s heat and rain,” 52-year-old carriage driver Sutomo said under the highway.\n\nOn central Jakarta’s bustling streets, the horse-drawn carriage bells can be heard clinking in rhythm with clopping hooves that compete with the blare of car engines and horns. But Sutomo says a 4.5-kilometre jaunt around Indonesia’s national monument, or Monas, can fetch just 50,000 rupiah ($3.10) — a trip he only makes two or three times a day. “When income is low, my son, who works at a company, shares some of his salary. Thank God at least that can cover food for my family. But for the horse, we have to reduce its food,” he said.\n\nRights groups say such limited income has forced owners and some who rent the horses to ignore proper horse care, leading to malnutrition and poor living conditions.\n\nThere are about 200 carthorses still in service at around 20 stables, according to estimates, including one squalid encampment holding 15 horses. It was surrounded by garbage and plastic debris next to a smelly, polluted river.\n\n“The conditions are really, really bad,” said Karin Franken, co-founder of Jakarta Animal Aid Network (JAAN), an NGO that has been advocating for delman horses since 2014. “They are not treating the horses very well (but) very aggressively, very rough.”\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67ba871ac3d09.gif",
  "retrievedAt": "2025-10-12T01:35:52.355Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893757/jakartas-last-carriage-horses-endure-harsh-lives",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T02:25:43.000Z"
}
