{
  "title": "‘Beyond a game’ as Pakistan face India in must-win blockbuster - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan face arch-rivals India in a Champions Trophy blockbuster on Sunday as they look to get their campaign back on track in front of a sell-out crowd in Dubai on an occasion described as “beyond a game”.\n\nThe neighbours only meet in multi-nation events because of political tensions and the match is taking place in Dubai after India refused to travel to tournament hosts Pakistan.\n\nIn front of what is expected to be a full house at the 25,000-capacity Dubai International Stadium, and with hundreds of millions more watching glued to their televisions, Pakistan are under pressure.\n\nMohammad Rizwan’s side were well beaten by New Zealand by 60 runs in the opening game of the competition in Karachi and realistically need to beat favourites India to stay in the hunt for a semi-final spot in the eight-nation tournament.\n\nNew Zealand top Group A ahead of India — who beat Bangladesh on Thursday by six wickets — on a better run-rate. Pakistan are fourth and bottom of the group.\n\nThe top two teams from each of the two groups make the semi-finals. “After losing a game there is another good chance for you to win and win the third one and make it to the semis,” Pakistan coach Aaqib Javed told reporters on Saturday.\n\n“Between India and Pakistan it doesn’t matter, it’s a knockout or whatever. It’s beyond a game and that’s the beauty of India-Pakistan cricket.”\n\nHe added: “And if you look at the positives, I think that is the best time and best chance for any individual or a team to make a mark. We used to love it and all the players are waiting for the opportunity to rise above the bar.”\n\nPakistan suffered a big blow in the loss on Wednesday when top batter Fakhar Zaman suffered a muscle injury. He has been ruled out of the tournament, but Aaqib said they will still field a “good, strong team”.\n\nImamul Haq has come in as a replacement for a team that hammered India in the final of the previous Champions Trophy in 2017, beating them by a mammoth 180 runs. Pakistan have also won most of their encounters against India in the Champions Trophy, leading 3-2 across 5 matches.\n\nThat was India’s last defeat to Pakistan in an ODI match and Rohit Sharma’s men have since won five of the last six games against their greatest rivals, with one rained off.\n\nThey last met in a one-day game at the 2023 World Cup in Ahmedabad, with hosts India winning by seven wickets.\n\nAnother loss and an early exit for the hosts would take the gloss off the tournament, Pakistan’s first ICC event since co-hosting the 1996 World Cup with India and Sri Lanka.\n\nIn contrast, India lived up to their favourites tag against Bangladesh, chasing down a tricky 229 with 21 balls to spare in Dubai.\n\nIn-form Shubman Gill hit an unbeaten 101 for his second successive century after pace spearhead Mohammed Shami returned figures of 5-53.\n\nVictory for India would put them on the cusp of the last four, but vice-captain Gill warned his team of complacency.\n\n“Definitely we have been playing some good ODI cricket and Pakistan unfortunately have lost some of the matches that they have played recently but by no means are we going to take them as a lesser side,” said Gill.\n\n“I think they have got a good side and it is important for us to bring our A-game tomorrow.”\n\nDeteriorating political ties have meant the bitter rivals have not played a bilateral cricket series for over a decade.\n\nIndia last visited Pakistan in 2008, for the Asia Cup.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/231257043f45437.png",
  "retrievedAt": "2025-08-25T19:57:31.451Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893811/beyond-a-game-as-pakistan-face-india-in-must-win-blockbuster",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T08:06:12.000Z"
}
