{
  "title": "Karachi to face another major water crisis as KWSC starts line repair work - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The sole water utility of the city on Saturday advised people to store water in advance and use the commodity carefully as there would be an around 40 per cent shortfall in the regular supply for the next three days.\n\nMajor localities in almost every Karachi districts — South, Keamari, West, Korangi, Malir, East and Central — would face water shortages because of repair work on two major supply lines in the city.\n\nA spokesman for the Karachi Water and Sewerage Corporation said that the city received a total daily supply of 650 MGD (million gallons per day), but due to some repair work, the city would face a shortage of 250 MGD.\n\nHe said that during the repair work, water supply would be partially affected in old city area, Shershah, PAF Base Masroor, Landhi, Korangi, Liaquatabad, Nazimabad, Pak Colony, Gulbahar, etc.\n\nOfficial says water shortage will persist for three days\n\n“However, 400 MGD of water will continue to be supplied as usual,” he added.\n\nHe explained that repair work on the FTM 48-inch diameter and CTM 54-inch diameter pipelines began on Saturday and expected to be completed within 72 hours. The spokesman said that once the repair work was finished, the city’s water supply would improve significantly.\n\nAccording to him, repair work will be carried out in affected areas, including Manzoor Goth, Gulshan-i-Iqbal, and Peeli Kothi in Liaquatabad.\n\nHe advised people to store water in advance and use it carefully to avoid any inconvenience.\n\nThe spokesman said that the KWSC Managing Director Asadullah Khan had directed that uninterrupted water supply be ensured across the city during Ramazan.\n\n“He also instructed that all leaks in water pipelines be fixed before the holy month begins,” he added.\n\nIt may be recalled that recently the city had faced multiple water crises which persisted for weeks due to the leakage of an underground main line on University Road twice.\n\nPublished in Dawn, February 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:36:24.597Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893719/karachi-to-face-another-major-water-crisis-as-kwsc-starts-line-repair-work",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T01:55:17.000Z"
}
