{
  "title": "Govt hopes to reduce burden on salaried class: Aurangzeb - Business - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb reaffirmed the federal government’s commitment to reduce the burden on the salaried class, state-owned Radio Pakistan reported.\n\nEarlier this week, the minister had stated that the country will be able to meet its revenue goals for the year without further burdening existing taxpayers, according to an exclusive interview with Bloomberg News.\n\nAurangzeb’s statement comes as Pakistan looks to curb the criticism it has faced since last year over unpopular reforms, including record-high taxes.\n\nRaising the tax-to-GDP ratio is a key condition of Pakistan’s $7 billion loan deal with the International Monetary Fund (IMF), which was needed to shore up a faltering economy and manage its mounting debts.\n\nIn 2024, the salaried class emerged as the third-largest contributor to income tax collection in the outgoing fiscal year, following closely behind banks and petroleum products, and still surpassing the country’s affluent textile exporters.\n\nThe salaried class contributed Rs367.8 billion to income tax collection in FY24, a 39.42 per cent rise, from Rs263.8bn in FY23.\n\nSpeaking to reporters in Lahore today, the finance minister said, “The government hopes to reduce the burden on the salaried class.”\n\nIn light of his recent state visits to Saudi Arabia, the UAE and the US, the minister said that there was “no displeasure overseas” in the diaspora regarding Pakistan’s trajectory.\n\nAurangzeb represented Pakistan at the two-day Emerging Markets Conference-2025 in Saudi Arabia, which is attended by finance ministers, central bank governors, policymakers and economic experts from around the world.\n\nThe high-profile gathering included IMF Managing Director Kristalina Georgieva, Bahrain’s Finance and National Economy Minister Shaikh Salman bin Khalifa Al Khalifa and Saudi Arabia’s Vice Minister of Finance Abdulmuhsen Alkhalaf, a news release said.\n\nMr Aurangzeb’s participation underscored Pakistan’s proactive engagement in global economic policymaking and its commitment to fostering regional and international partnerships.\n\nMeanwhile today, he also highlighted positive economic indicators, including a rise in remittance senders to 35 million and an increase in Roshan Digital Account inflows, according to Radio Pakistan.\n\nAurangzeb emphasised the private sector’s vital role in driving the country’s economic progress, stating that foreign exchange reserves are steadily growing.\n\nFurthermore, the finance minister expressed his commitment to supporting the construction industry while ensuring no gambling activities in real estate.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/231435537e1512f.png",
  "retrievedAt": "2025-08-25T19:57:30.451Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893822/govt-hopes-to-reduce-burden-on-salaried-class-aurangzeb",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T10:07:58.000Z"
}
