{
  "title": "Pakistan calls for enhanced int’l, UN monitoring of IOJ&K’s human right situation",
  "link": "https://www.app.com.pk/national/pakistan-calls-for-enhanced-intl-un-monitoring-of-iojks-human-right-situation/",
  "date_published": "2020-07-16T05:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP):Pakistan on Thursday called for enhanced international monitoring and continued reporting by the United Nations on the human rights crisis in Indian Occupied Jammu and Kashmir (IOJ&K) to save lives, dignity and freedom of Kashmiri people.\nForeign Office Spokesperson Aisha Farooqui at the weekly press briefing said continued brutalization of innocent people in the Indian occupied Jammu and Kashmir had entered 346th day after India revoked the special status of IOJ&K on August 5 last year.\nShe said Kashmiris were facing illegal occupation of Indian security forces for over seven decades.\nShe mentioned that recently, the Indian occupation forces during their continued so-called cordon and search operations martyred eight Kashmiris including Idrees Ahmad Bhat, Ajaz Ahmad, Muahmmad Usman, Saifullah Mir, Zahid Ahmad and Waleed Ahmad in Kupwara, Baramulla and Islamabad districts of IOJ&K.\nThe FO Spokesperson said the UN human rights machinery in recent months had highlighted India’s non-compliance with its international human rights obligations.\n“Through several official communications, nearly a dozen UN Special Rapporteurs have raised serious concerns over India’s consistent pattern of arbitrary arrests, detentions, torture, corporal punishment, extra-judicial killings, and physical and digital lockdown in occupied Jammu & Kashmir,” she added.\nOn 89th Kashmir Martyrs’ Day, she said the government and people of Pakistan joined Kashmiris on both sides of the Line of Control (LoC) and across the globe to pay homage to the 22 innocent, unarmed Kashmiris who stood up for truth and justice against the tyranny of Dogra force in 1931.\nShe said across the world, conferences, webinars and peace walks were organized to draw the attention of the world conscience towards the long struggle for fundamental rights of the people of IOJK.\nDuring last week, she said Foreign Minister Shah Mahmood Qureshi held telephone conversations with Chinese Foreign Minister and State Councillor and Secretary General of the Economic Cooperation Organization.\n“In these interactions, the Foreign Minister shared our deep concern over the situation in IOJK and underlined the importance of urgent steps by the international community to help address the grave situation,” she said.\nOther matters of mutual interest were also discussed including COVID-19 pandemic, regional security in South Asia, suspension of Pakistan International Airline flights into European Union and the Prime Minister’s call for Global Debt Relief Initiative for developing countries.\nThe Spokesperson said on July 7, 2020, the third round of China-Afghanistan-Pakistan Trilateral Vice Foreign Ministers’ Strategic Dialogue was held via video link, where Chinese Vice Foreign Minister Luo Zhaohui, Afghan Deputy Foreign Minister Mirwais Nab and Foreign Secretary Sohail Mahmood co-chaired the dialogue.\n“All three sides held in-depth discussions and reached consensus on cooperation against COVID-19, the Afghan peace and reconciliation process, and trilateral cooperation and reaffirmed their commitment to strengthening communication and coordination and enhancing mutual trust and cooperation under the trilateral cooperation mechanism,” she said.\nFarooqui said the Foreign Secretary also held a video conference with Spanish State Secretary for Foreign Affairs on 7 July 2020.\nThey exchanged views on a broad range of subjects including response to COVID-19 pandemic, bilateral relations and close cooperation in multi-lateral fora as well as the regional situation.\nThe two sides also reviewed the situation in Afghanistan and progress in Afghan peace process.\nOn repatriation of stranded Pakistanis, the FO Spokesperson said the Ministry of Foreign Affairs and the country’s missions abroad continued to facilitate and assist fellow compatriots all across the world.\nAs of July 14, she said, 221,279 Pakistani citizens have been repatriated from different parts of the world.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:30:13.049Z"
}
