{
  "title": "Interior Minister warns of strict action against elements involved in spreading disinformation about COVID-19",
  "link": "https://www.app.com.pk/national/213545/",
  "date_published": "2020-07-16T06:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 16 (APP):Minister for Interior Brig (R) Ijaz Ahmad Shah on Thursday warned the elements involved in spreading disinformation regarding the coronavirus (COVID-19) of strict action, directing the departments concerned to closely monitor their activities and bring them to task.\n“We will take strict action against the spread of disinformation regarding COVID-19,” he said while chairing a meeting on COVID-19 Disinformation Prevention Mechanism here at the Ministry of Interior, a news release said.\nThe committee consists of nine members, with Dr Faisal Sultan holding the seat of Senior Member, while other members include representatives of Ministry of Interior, Ministry of Health, Federal Investigation Agency (FIA) , Inter Services Public Relations, Pakistan Electronic Media Regulatory Authority (PEMRA), Pakistan Telecommunication Authority and National Command and Operation Center.\nThe interior minister asked the Director Cyber Wing of FIA to closely monitor and hold the responsible ones accountable for their actions, reiterating that “strict and immediate action should be taken against these people.”\nIjaz said those involved in such actions were not pro country or its people. “The primary purpose of this committee is to ensure that correct and credible information goes to our people,” he added.\nHe vowed to utilize all available resources in finding out the elements behind spread of disinformation.\nThe minister highlighted the role of media and stressed the need for making collective efforts to effectively counter the COVID-19 pandemic.\nHe directed the DG PEMRA to ensure that no fake news was flashed on electronic media.\nHe said every institution and every individual must play its role in countering the pandemic, adding “we are doing our best by working day and night on government level.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:30:14.432Z"
}
