{
  "title": "CPEC projects to boost economic activity, job creation in KPK: NA Speaker",
  "link": "https://www.app.com.pk/national/cpec-projects-to-boost-economic-activity-job-creation-in-kpk-na-speaker/",
  "date_published": "2020-07-16T05:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP):National Assembly (NA) Speaker Asad Qaiser Thursday said the completion of China Pakistan Economic Corridor (CPEC) projects, especially establishment of industrial zones in Khyber Pakhtunkhwa (KPK) would boost economic activity and job creation in the province.\nHe said the CPEC would help create job opportunities for those people who had been effected by the coronavirus (COVID-19) pandemic.\nThe NA speaker said this during a meeting with KPK Chief Minister Mehmood Khan here at the Parliament House, said a press release issued here.\nBoth the parliamentarians discussed various issues of mutual interest and development in the province.\nCommending the KPK government performance during the COVID-19 catastrophe, Asad Qaiser said the provincial government provided relief to the public earnestly by following the vision of the prime minister .\nHe said the pandemic had disturbed the socio-economic pattern around the world and Pakistan was not an exception. He said the prime minister had envisioned Pakistan a true democratic, progressive and welfare state.\nThe speaker also informed the CM about the establishment of Pak-Afghan Parliamentary Friendship Group and its Task forces for encouraging people-to-people contacts and collaboration in Industrial, trade and economic sectors.\nHe said the Parliament would play its role in bringing Pakistan and Afghanistan more closer since both the nations had shared history, culture and socio-economic interests.\nChief Minister Mehmood Khan appreciated the speaker’s concern for the welfare of the needy and the poor.\nFollowing the vision of Prime Minister, the CM said his government was working diligently for welfare of masses.\nHe commended the speaker for his initiative of strengthening Pak-Afghan relations. Mehmood Khan said his government would provide maximum assistance for exploiting the trade potential between both the countries.\nHe said the CPEC was project to change the fortune the people of Pakistan. He said that Industrial zones established in KPK were being provided maximum assistance for making them functional within stipulated time-lines.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:30:17.324Z"
}
