{
  "title": "Govt decides K-Electric power tariff hike in phase",
  "link": "https://www.app.com.pk/national/govt-decides-k-electric-power-tariff-hike-in-phase/",
  "date_published": "2020-07-16T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP):The government on Thursday decided to increase the power tariff of K-Electric in phases to avoid sudden burden on the consumers in for the sake of bringing the price at par with other parts of the country.\nPrime Minister Imran Khan chaired a meeting here to discuss the K-Electric tariff and gas prices, which decided to apprise the people of the factual position of increasing the power tariff.\nFederal ministers Senator Shibli Faraz, Pervaiz Khattak, Dr Fehmida Mirza, Aminul Haq, Asad Umar, Omar Ayub Khan and Mohammed Mian Soomro, advisors Abdul Hafeez Sheikh and Dr Ishrat Hussain, National Assembly Deputy Speaker Qasim Suri, Khyber Pakhtunkhwa Chief Minister Mehmood Khan, and specials assistants Dr Shahbaz Gill, Nadeem Babar and Shahzad Qasim attended the meeting.\nWhile considering the proposal for hike in the K-Electric power tariff, the meeting was told that the power tariff was increased countrywide in January this year, on the National Electric Power Regulatory Authority’s recommendation. However, the K-Electric tariff was not increased making the Federal Government pay subsidy of Rs 3-4 billion per month.\nDeliberating over the matter to ascertain the gas price, it was told that local gas production was insufficient to meet the needs compelling the government to import gas. Moreover, there was a clear difference between the prices of the local and imported gas.\nThe meeting was apprised that only 27 percent of the country’s population was being supplied piped gas at low cost while the rest was using LPG (liquefied petroleum gas) paying a far higher price.\nThe prime minister instructed for a comprehensive strategy to provide relief to a major chunk of the population and emphasized for a durable solution to the issue through consultation\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:30:22.962Z"
}
