{
  "title": "President for speedy, cost-free justice to people at doorsteps",
  "link": "https://www.app.com.pk/national/president-for-speedy-cost-free-justice-to-people-at-doorsteps/",
  "date_published": "2020-07-16T04:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP):President Dr Arif Alvi on Thursday appreciating the performance of Federal Ombudsman stressed upon the provision of speedy and cost-free justice at the doorsteps of common man.\nIn a meeting with Federal Ombudsman Syed Tahir Shahbaz, the President expressed hope that the Federal Ombudsman would continue efforts to help the people against administrative injustices.\nThe Federal Ombudsman briefed the President that over 75,000 cases were disposed of in 2019, while 97 percent of decisions got implemented.\nHe said 1,039 cases and review petitions in 317 cases were filed with the Federal Ombudsman along with appeals to the President constituting four percent of the total cases.\nHe said President upheld 90 percent decisions of the Federal Ombudsman.\nSyed Tahir informed the President that 2019 was observed as the year of awareness and a comprehensive public awareness campaign was run through electronic, print and social media.\nDue to this campaign, considerable increase in number of cases was recorded in Balochistan, South Punjab and Abbottabad.\nHe said awareness seminars were also conducted in different universities and remote areas of Balochistan, Bahawalpur, Multan, Lahore, Peshawar and Abbottabad.\nThe Speaker National Assembly, Chairman Senate, Governors of Punjab, Sindh, Khyber Pukhtunkhwa and members of parliament were also briefed about the role of Federal Ombudsman.\nAbout improvement of redressal mechanism, he said the officers of 10 regional offices of Federal Ombudsman made 370 visits to 72 districts and sub districts under Outreach Complaint Resolution Programme.\nHe briefed the President that every finding was decided within a period of 60 days and the review petition within 45 days.\nHe further briefed that 247 Federal Agencies were on board; their focal persons had been nominated who were bound to decide a complaint in 30 days. In case the agency did not decide the case within 30 days, the same transferred automatically to the portal of Federal Ombudsman and registered as fresh complaint under Integrated Complaint Resolution (ICR) Mechanism.\nSyed Tahir Shahbaz said from January to June this year, more than 47,000 cases were registered which showed 38 percent increase than the previous year.\nHe said corona pandemic did not affect the registration of complaints as 60 percent due to availability of online registration system.\nThe Federal Ombudsman apprised the President on the efforts to improve the living conditions of prisoners in jails as per directions of Supreme Court of Pakistan.  He said focus of his office was to improve jail conditions by removing irritants of criminal administration justice system.\nHe said that presence of a psychiatrist and a doctor had been insured in every jail of the country. Mentally sick and addict prisoners had been segregated from other prisoners in all jails.\nHe said that he had submitted six quarterly progress reports to the Supreme Court in this regard after holding 12 meetings with the provincial chief secretaries and other stakeholders.\nHe also apprised the President of his initiatives taken for the welfare of overseas Pakistanis.  He said that one-window facilitation desks were established at eight international airports of Pakistan where officers of 12 departments remained present round the clock to help the overseas Pakistanis.",
  "retrievedAt": "2025-08-11T19:30:18.179Z"
}
