{
  "title": "ECNEC approves Rs 289 billion motorways, road projects",
  "link": "https://www.app.com.pk/national/ecnec-approves-rs-289-billion-motorways-road-projects/",
  "date_published": "2020-07-16T05:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP):Executive Committee of the National Economic Council (ECNEC) Thursday approved four projects worth Rs 289 billion for construction of national highways in different parts of the country.\nThe ECNEC meeting chaired by Adviser to the Prime Minister on Finance and Revenue, Dr Abdul Hafeez Shaikh approved the projects including construction of 306-km long Hyderabad-Sukkur Motorway at a cost of Rs 165.679 billion, construction of 47.55-km Khyber Pass Economic Corridor (KPEC) Project at a cost of Rs 77.907 billion, construction of 146-km Hoshab-Awaran-Khuzdar Section of M-8 Project, and land acquisition for Swat Motorway Phase-II at a cost of Rs 20 billion.\nThe Hyderabad-Sukkur Motorway project would be completed on Built Operate Transfer (BOT) basis envisages construction of 306 km long, 6-lane wide, access-controlled motorway, according to press statement issued by the finance ministry.\nThe motorway is proposed to be a high speed toll road facility for efficient and safe transportation, which would start from Hyderabad (end of Karachi-Hyderabad Motorway M-9) and terminates at Naro Canal (Start of Sukkur-Multan Motorway M-5).\nThe project alignment passes through Jamshoro, Tando Adam, Hala, Shahdadpur, Nawabshah, Moro, Dadu, Naushahro Feroze, Mehrabpur, Rasoolpur, Larakana, Khairpur and Sukkur.\nThe Khyber Pass Economic Corridor (KPEC) project consists of two components involving construction of Peshawar-Torkham Motorway and link road connecting motorway to Badabher (N-55) intersecting N-5 between Chamkani and Jhagra (55km) in length.\nThe project envisages construction of 47.55 km long, 4 lane wide, dual carriageway high-speed access controlled Motorway from Peshawar to Torkham.\nPeshawar Torkham Motorway is part of the Peshawar-Jalalabad-Kabul Motorway Project. The scope of work also includes construction of bridges, interchanges, flyover, subways, underpasses, box culverts, cattle creep, road furniture, drainage works, and retaining walls alongwith allied facilities.\nHoshab-Awaran-Khuzdar Section of M-8 Project envisages construction of 146 km long road from Hoshab to Awarn . There exists motorable track from Hoshab to Awaran under administrative control of C&W Department, government of Balochistan. Existing route is mostly followed while finalizing the alignment.\nThe project road starts from Hoshab and traverses through Qila Darwesh, Ashal, Dandar, Sahar Kalat, Gorari, Laljan, Duddar, Razai, Nurdin, Madak, Malar, Labach Dargo and finally terminaters at Awaran. The scope of works also includes relocation of utilities and acquisition of 29,200 kanals of land for 100m of Right of Way (ROW).\nThe Swat Motorway Phase-II project envisages acquisition of 10,000 kanals of land for construction of 04-lane motorway 79.69 km in length from Chakdara to Fatehpur as Phase-II – extension of the Swat Motorway.\nThe motorway is proposed as a high speed toll road facility for efficient and safe transportation. The Right of Way proposed for the motorway is 50m, the statement added.",
  "retrievedAt": "2025-08-11T19:30:14.744Z"
}
