{
  "title": "Construction work on Mohmand Dam in full swing: NA told",
  "link": "https://www.app.com.pk/national/construction-work-on-mohmand-dam-in-full-swing-na-told/",
  "date_published": "2020-02-11T20:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): Parliamentary Secretary for Water Resources Saleh Muhammad Wednesday informed the National Assembly that construction work on the Mohmand Dam Hydropower project, was in full swing.\nResponding to specific queries during Question Hour, he said, “Construction work of the link roads, offices and colony buildings is in progress. About 1.5 percent of construction work on Mohmand Dam Hydropower, is completed till January 2020”.\nHe said “WAPDA completed the preliminary activities of geo-tech, boring, installation of river gauging station, automatic discharge measurement, weather station and construction of Ketch track to dam site, using in house capabilities”.\nHe said that mobilization of the contractor, consultant and construction activities was in full swing which is aimed at executing work within given timelines.\nThe secretary said that surface cutting and sub-grade preparation activities, excavation and filling works were in progress. He said that surface excavation of project office and senior office hostel had been completed.\n“Cutting and filing works of various projects, colony buildings i.e high school, project office, mosque, junior offices, staff hostel, rest house, WAPDA hospital, community buildings and shopping centre playground area are in progress” he added.\nHe said that temporary access roads to inlet and outlet portals for construction of diversion tunnels had been completed while excavation for inlet and outlet structures was under process.\nHe said that contractor has started construction of access to query area for preparation of dam fill material. He said that topographic survey above water level has been completed and hydrographic survey was in progress, while re-regulation pond excavation works were underway.\nSaleh Muhammad said that contractor has prepared temporary access road to right bank tunnel outlet structure.\nResponding to another question, he said that machinery procured and installed in Golen Gol Hydropower project by civil, E&M and transmission line contractor were of good standard and meet approved specifications.\nHe said that the machinery and equipment had been procured from the approved vendors of international repute specified in the contract documents.\nHe said that full load testing and commissioning of all the three units have been performed\nsuccessfully, and since commissioning of the project in January 2019, performance of the units were satisfactory.\nHe said that quantum of water in Tarbela and Mangla reservoirs was unprecedented as compared with previous conditions. He said that present storage in dams was 237 percent and 79 percent higher than the last year and last 10 years average respectively.",
  "retrievedAt": "2025-08-11T18:47:28.070Z"
}
