{
  "title": "Mumtaz Ali calls for raising awareness about Novel corona Virus in country",
  "link": "https://www.app.com.pk/national/mumtaz-ali-calls-for-raising-awareness-about-novel-corona-virus-in-country/",
  "date_published": "2020-02-11T21:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP):Health Ministry Focal person , Dr Mumtaz Ali Khan Wednesday urged citizens to enhance awareness on the Novel Corona virus that was detected in the Chinese city of Wuhan in 2019 and that is spreading into many other countries.\n“All possible steps are being taken to deal with the coronavirus and the government is ready to tackle with any emergency situation”, he said while talking to PTV news.\nPeople should not fear the new corona-virus, assuring that it was no different from other flu viruses, he added.\n“The Ministry of Health is encouraging citizens to wear masks in public or crowded places and to wash their hands regularly with soap and clean water or use hand sanitizers”, he added.\nGovernment has decided to launch awareness campaign on a large scale about corona virus across country, he said.\nHe explained an emergency operation cell, established at the Ministry of National Heath, Services and Regulations, has been observing the situation. “Separate wards have been set up at hospitals to deal with cases of coronavirus, if any.”\n“If someone is suffering from severe cough and cold then he/she should wear a mask,” he advised.\nHe said,”Ministry of Health in cooperation with partners is conducting thermal screening on passengers at major Airports where we established center with efficient teams and is advising nationals that are in China for various reasons to contact the Embassy in that country”.\n“Pakistani authorities, through the embassy in China are in contact with the 500 students studying in different universities of Wuhan”, he added.\n“We are monitoring the situation closely,” he said, adding that Pakistani students in China had been informed about the protective measures and advised to follow the instructions.\nHe also advises that people take precautionary measures by using masks, staying hydrated and ensuring personal hygiene.\nHe praised and expressed confidence that the Chinese government would soon win the fight against the coronavirus outbreak.",
  "retrievedAt": "2025-08-11T18:47:27.192Z"
}
