{
  "title": "Turkish President arrives on two-day visit of Pakistan on Thursday: FO",
  "link": "https://www.app.com.pk/national/turkish-president-arrives-on-two-day-visit-of-pakistan-on-thursday-fo/",
  "date_published": "2020-02-12T04:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP):President Recep Tayyip Erdogan of Turkey, on the invitation of Prime Minister Imran Khan, will arrive here on Thursday on a two-day (February 13-14) visit of Pakistan.\nPresident Erdogan will be accompanied by a high-level delegation comprising cabinet members and senior government officials, as well as heads and CEOs (Chief Executive Officers) of leading Turkish corporations.\nDuring the visit, Prime Minister Imran Khan and President Erdogan will have tete-a-tete, after which they will co-chair the 6th Session of the Pakistan-Turkey High Level Strategic Cooperation Council (HLSCC) in the joint cabinet format.\nAt the conclusion of the Session, a Joint Declaration will be signed. A number of important agreements / MoUs (Memorandums of Understanding) are expected to be concluded. The two leaders will have a joint press stakeout, Foreign Office said in a statement issued here on Wednesday.\nBesides holding a separate meeting with President Dr. Arif Alvi, President Erdogan will also address a Joint Session of the Parliament of Pakistan.\nTogether with Prime Minister Imran Khan, President Erdogan will address the Pakistan-Turkey Business and Investment Forum which brings together leading investors and business-people from both sides.\nThe High Level Strategic Cooperation Council is the highest level decision-making forum, providing strategic direction to further strengthening of relations between the two countries. There are 7 Joint Working Groups (JWGs) working under the HLSCC, focused on Political Coordination; Trade & Investment; Energy; Banking & Finance; Transport & Communications; Culture & Tourism; and Education. So far, 5 sessions of the HLSCC have been held, alternately in Islamabad and Ankara.\nPakistan and Turkey have a unique and abiding relationship characterized by mutual support and exceptional mutual trust and understanding. The two brotherly countries have always been each other’s steadfast partners. Turkey supports the cause of self-determination for the people of Indian-Occupied Jammu & Kashmir. Pakistan stands by Turkey on the question of Cyprus.\nUnder the leadership of Prime Minister Imran Khan and President Erdogan, Pakistan-Turkey relations have further fortified into an enduring partnership. Both sides place a strong emphasis on forging a robust economic relationship. There is also a joint resolve to translate historic amity into vibrant cooperation in diverse fields, including in the context of combating Islamophobia, promoting Islamic solidarity, and advancing shared goals of regional peace, security and stability.\nThe visit of President Erdogan will serve to underscore the traditional solidarity and affinity between the two countries, and prove to be another significant milestone in the further deepening and broadening of the flourishing Pakistan-Turkey strategic partnership, the statement concluded.",
  "retrievedAt": "2025-08-11T18:47:18.698Z"
}
