{
  "title": "Youth, a valuable resource in country’s journey towards development: President",
  "link": "https://www.app.com.pk/national/youth-a-valuable-resource-in-countrys-journey-towards-development-president/",
  "date_published": "2020-02-12T04:50:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Feb 12 (APP):President Dr Arif Alvi on Wednesday said the world was looking towards an emerging Pakistan for its immense potential and called upon the nation to well-prepare itself to exploit the upcoming opportunities of prosperity.\nAddressing at the cheque-distribution ceremony of Kamyab Jawan Programme, the President said it was time to realize the potential of the country’s young population as a valuable resource in nation’s journey towards development.\nPresident Arif Alvi said Pakistan was becoming an attractive destination for foreign investors after it successfully defeated terrorism.\nHe said Pakistani nation and the Armed Forces deserved massive credit for overcoming difficult times and in restoration of law and order situation.\nDr Alvi said the nation must be well-equipped to benefit from the concept of Artificial Intelligence (AI), terming it a new revolution in the making.\nHe said timely learning about the AI networking and cloud-computing could open up doors of opportunities for youth by getting access to an ocean of knowledge.President Alvi lauded PM’s Special Assistant on Youth Affairs Usman Dar for overseeing the programme for\nyouth which provided them a support to initiate their businesses to earn livelihood.\nHe expressed satisfaction that merit would be observed while providing loans to youth, adding that small and medium enterprises played an important role in giving youth a right direction in setting up businesses.\nThe president said he had full confidence in youth who could prove their mettle in every field.\nHe said the Pakistani nation had become resilient to face any challenge after it surpassed several difficulties for decades including Afghanistan war and the subsequent influx of refugees.\nHe urged the nation not to feel discouraged on news creating despondency about Pakistan and always remain hopeful by looking towards the three golden principles of Quaid-e-Azam : Unity, Faith and Discipline.\nDr Alvi mentioned that Pakistan had learned from difficulties in the past to promote peace and recalled Prime Minister Imran Khan’s gesture of inviting India for cooperation on issues of common interest soon after he assumed office.\nHowever, he regretted that the offer did not meet a positive response from India, which he said was engaged in spreading hatred among different communities.\nHe said the future of India was bleak due to the destructive path it had chosen.\nPresident Dr Arif Alvi gave away cheques among the skilled youth as financial assistance for starting up of small businesses.PM’s Special Assistant on Information and Broadcasting Dr Firdous Ashiq Awan said making the country’s youth self-sufficient was the vision of Prime Minister Imran Khan to help them become useful part of a developed Pakistan.\nShe said providing opportunities to skilled and professional youth would ensure a corruption-free and strong Pakistan.\nShe said Prime Minister Imran Khan, with personally monitoring of youth emancipation projects, was in fact leading the nation’s caravan towards goals of prosperity.\nDr Awan mentioned that the Artificial Intelligence project, under patronage of President Arif Alvi, was an integral part of Digital Pakistan, launched by the prime minister.\nShe said under Technical Education and Vocational Training Authority (TEVTA), around 2,000 professionally skilled youth would be given training besides mainstreaming of 75,000 students from 70 Madaaris, establishment of 75 classrooms and five Centres of Excellence.\nShe regretted that previous governments exploited the sentiments of innocent people and did not take steps for their welfare.",
  "retrievedAt": "2025-08-11T18:47:15.706Z"
}
