{
  "article_id": "2025-04-13_f7fcb596664595ff69a6edc523f4ba44",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-police-strengthens-security-measures-in-diplomatic-enclave/",
    "retrieved_at": "2025-08-27T14:26:51.895Z"
  },
  "metadata": {
    "title": "Islamabad Police strengthens security measures in diplomatic enclave",
    "author": null,
    "date_published": "2025-04-13T17:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 196,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 13 (APP):Islamabad Capital Territory (ICT) Police have intensified security arrangements in the Red Zone, especially around the Diplomatic Enclave, to ensure the protection of embassies, ambassadorial residences, United Nations offices, and key government institutions. A public relation officer told APP on Sunday that following the special directives of Inspector General of Police (IGP) Syed Ali Nasir Rizvi, the police force remains actively engaged in maintaining law and order across the federal capital, with a focus on high-security zones. Senior Superintendent of Police (SSP) Security Division Muhammad Sarfraz Virk emphasized the critical importance of safeguarding all diplomatic and government installations in the area. He instructed officers on duty that no negligence would be tolerated and that strict vigilance must be maintained at all times. SSP Virk said police personnel have been directed to thoroughly search all vehicles, including motorcycles, entering the Red Zone, and to ensure proper registration and verification of individuals. SSP said that all government employees must carry valid departmental ID cards and cooperate with police during the checking and registration process. He said the police remain committed to providing a safe and secure environment for residents, diplomats, and government officials in Islamabad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}