{
  "title": "UNDP, Islamic Relief sign MoU to support flood-affected communities in Sindh",
  "link": "https://www.app.com.pk/national/undp-islamic-relief-sign-mou-to-support-flood-affected-communities-in-sindh/",
  "date_published": "2022-11-19T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP):United Nations Development Programme (UNDP) and Islamic Relief has signed a memorandum of understanding (MoU) to support the flood-affected communities in Sindh.\nThe partnership will create income opportunities for households affected by the floods and support the construction of community infrastructures, said a press release issued here.\nThe devastating floods in Pakistan have affected 33 million people. Recently launched Post Disaster Needs Assessment (PDNA) highlighted that millions have become homeless, livelihoods are heavily impacted, and critical infrastructure has been wiped out.\nEstimates of total damages and losses are around $30 billion. Floods have particularly impacted the poorest and most vulnerable districts. The Poverty rates for many flood-affected districts in Sindh and Balochistan, two of the most impacted provinces, were even higher. Before the floods, households in calamity-hit communities showed an average poverty rate of more than 31 percent, well above the national average of 21.9 percent. In response, UNDP and Islamic Relief will help communities with cash for work opportunities. An initial target of 10,000 cash-for-work hours will be set, with an increased focus on the inclusion of women. Simultaneously, rehabilitation schemes will also be identified in the selected districts that can be started immediately.\nSpeaking at the signing ceremony, UNDP Pakistan Resident Representative Knut Ostby highlights, “Aligned with UNDP’s Flood Recovery Vision, through this partnership, we aim to revive livelihoods and rehabilitate critical infrastructure in impacted districts of Sindh.”\n“The scale of devastation has been unprecedented for which no one was prepared. Islamic Relief strongly believes that collaborations and partnerships are vital in this hour of need to reach the most in need before another crisis emerges. Our strong community connections are helping us to reach the most in need,” said Asif Sherazi, Country Director of Islamic Relief Pakistan.\nThis collaboration is an extension of UNDP and Islamic Relief’s global and regional partnership in reaching and building resilience in conflict-affected areas.",
  "retrievedAt": "2025-08-11T15:54:03.003Z"
}
