{
  "title": "Imran Khan, Bushra Bibi acquitted in iddat case",
  "link": "https://www.app.com.pk/national/imran-khan-bushra-bibi-acquitted-in-iddat-case/",
  "date_published": "2024-07-13T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):A lower court on Saturday dismissed the imprisonment sentences of Pakistan Tehreek e Insaf (PTI)’s founder Imran Khan and his wife Bushra Bibi while acquitting them in ‘iddat nikah’ case.\nAdditional Session Judge Kamran Majoka announced the verdict on appeals filed by former prime minister and his wife challenging the convictions.\nThe court said that the applications seeking the opinion of religious scholars and medical boards are also rejected.\nIn a 28-page written judgment the court said, “The complainant has failed to prove his case against both the appellants. Accordingly, both appeals filed by appellants No.1(Imran Khan) & 2 (Bushra Bibi) are accepted, judgment of learned trial court dated 03-02-2024 is set-aside and consequently both the appellants are acquitted of the charge. They are in custody, They are directed to be released forthwith if not required to be detained in any other case. Release Robkar be issued in the name of  Superintendent Central Jail Adayala, Rawalpindi.”\nThe order said, “The complainant himself appeared as PW-1 and maintained that he pronounced divorce against appellant No. 2 (Bushra Bibi) on 14.11.2017. In this respect, the prosecution has brought on record divorce deed which shows that the complainant pronounced divorce on 14-11-2017. Learned counsel or the appellants laid much stress on the point that there is cutting on the date and month of this divorce deed which was attested by. It is true that there is some cutting on the divorce deed on date and month but appellant No.2 (Bushra Bibi) didn’t bring on record any copy of the divorce deed which was communicated to her through Farah Jameel as per statement of complainant. Certainly divorce took place between the parties and due to this reason, Bushra Bibi contracted second marriage with Imran Khan. Although, Bushra Bibi in her statement u/s 342 CrpC maintained that triple talaq was pronounced against her in mid of April 2017 by the complainant yet no proof has been brought on record in this respect, therefore, claim of oral divorce by appellant No.2 does not appeal to reason.\nFurthermore, as per the statement of Oun Chaudhry Mufti Muhammad Saeed, Nikah was performed between the appellants on 01.01.2018 and second Nika was performed in February between 14th to 18th, 2018. In statement under section 342 CrPC, Imran Khan maintained that Nikah was performed on 01.01.2018. In reply to question No.8, Imran Khan maintained that second public ceremony of ‘dua’ was held in February 2018 after taking his sons in confidence. Similar is statement of Bushra Bibi.\nThis ceremony of ‘dua’ is supported by statement of Oun Chaudhry and Mufti Muhammad Saeed that second oral Nikah was performed in February 2018. In this respect, conduct of the parties is relevant under article 21 of the Qanun e Shahdat Order, 1984 which shows that second Nikah or dowa was performed after the period of iddat.\nIn the instant case both the appellants contracted second marriate as per statement of complainant party after iddat, therefore, this marriage has become valid marriage. Similarly, under Sunni Law, an unlawful conjunction by way of marriage during iddat period renders the marriage irregular and not void and on irregular marriage become regular the moment the bottleneck is removed. Iddat period expires. However, husband marrying during iddat period cannot be made liable for consensual Zina under section 10(2), of the offence of Zina (Enforcement of Hudood) Ordinance, 1979, along with his marriage partner.\nThe court order said, “No charge as framed u/s 496-B PPC against both the appellants because there was no evidence of second witness. In these circumstances, it cannot be said that the appellants committed fornication.”\n“This court if of the view that the appellants have not gone through any marriage ceremony fraudulently or with dishonest intention because none of  the  parties claim that Nikah was not performed and fraudulently he or she was supposed  to believe that marriage ceremony was solemnized.”\nThe court said, “Counsel for the respondents has strenuously argued that the complainant was deprived from the right of Rajow, so he was defrauded by the appellants. In cross examination the respondent deposed that on the second day of marriage of the appellants he came to know of their marriage. It is surprising to note that he remained passive for about six year for his right of Rajow which period had already expired before the filing of this private complaint.”\nIt may be mentioned here that the PTI founder and his wife were currently in Adiala jail. On February 3, the two accused were sentenced to seven years imprisonment and Rs 500,000 fine each in the Iddat Nikkah case. Twenty days later, the appeal against the verdict was filed in the sessions court.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:53:52.342Z"
}
