{
  "title": "US, Pakistan committed to strengthen security ties, focus on counter terrorism, law enforcement",
  "link": "https://www.app.com.pk/national/us-pakistan-committed-to-strengthen-security-ties-focus-on-counter-terrorism-law-enforcement/",
  "date_published": "2024-07-13T08:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP): United States Ambassador Donald Bloom during his meeting with Interior Minister Mohsin Naqvi on Saturday discussed matters of mutual interests and strengthening of bilateral relations with each other.\nThe meeting focused on issues such as enhancing cooperation in combating terrorism, narcotics trafficking and bolstering security.\nBoth sides agreed to hold a joint ‘Law Enforcement Dialogue’ in coming October this year.\nMinister Naqvi emphasized the significance of US support in strengthening Pakistan’s law enforcement agencies.\nHe also highlighted the recent discussions in New York to foster collaboration between the Islamabad Police and the New York Police Department.\nA delegation from Islamabad Police will soon visit New York to explore further opportunities for cooperation including training programs.\nNaqvi reiterated the Pakistani government’s commitment to protecting all minorities while emphasizing their equal rights under the Constitution.\nHe also stated that all those accused in the recent Jaranwala tragedy have been arrested and brought before the court.\nThe meeting also touched upon the successful hosting of the T20 World Cup in the US, showcasing America’s emergence as a new hub for international cricket.\nNaqvi expressed his ongoing efforts to organize a tri-nation series between Pakistan, the USA and Canada as well as a cricket league between the USA and Canada.\nUS Ambassador Bloom commended the exciting and well-organized matches, highlighting the enjoyment of a large number of fans.\nSecretary Interior Khurram Ali Agha, Chief Commissioner Islamabad Mohammad Ali Randhawa and IG Islamabad Police Ali Nasir Rizvi were also present during the meeting.",
  "retrievedAt": "2025-08-11T03:53:40.942Z"
}
