{
  "title": "Pakistan, IMF reaches $7 bln staff- level agreement",
  "link": "https://www.app.com.pk/business/pakistan-imf-reaches-7-bln-staff-level-agreement-2/",
  "date_published": "2024-07-13T05:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP): The Pakistan and the International Monetary Fund (IMF) team have reached a staff-level agreement of $7 billion for 37-month Extended Fund Facility (EFF). The final approval of the loan will be given by the IMF Executive Board.\nThe Pakistani authorities and the IMF team have reached a staff-level agreement on a comprehensive program endorsed by the federal and provincial governments, that could be supported by a 37-month Extended Fund Arrangement (EFF) in the amount equivalent to SDR 5,320 million (or about US$7 billion at current exchange rates), according to a statement issued by IMF’s Mission Chief to Pakistan Nathan Porters after conclusion of Staff level discussion with Pakistan.\nThis agreement is subject to approval by the IMF’s Executive Board and the timely confirmation of necessary financing assurances from Pakistan’s development and bilateral partners.\nAccording to the IMF statement the program aims to capitalize on the hard-won macroeconomic stability achieved over the past year by furthering efforts to strengthen public finances, reduce inflation, rebuild external buffers and remove economic distortions to spur private sector led growth.\nThe key policy goals of the authorities’ program includes sustainable public finances, through a gradual fiscal consolidation based on reforms to broaden the tax base and remove exemptions, while increasing resources for critical development and social spending.\nIn this regard, the authorities plan to increase tax revenues through measures of 1½ percent of GDP in FY25 and 3 percent of GDP over the program.\nIn particular, the recently approved FY25 budget targets an underlying general government primary surplus of 1 percent of GDP (2 percent in headline terms).\nRevenue collections will be supported by simpler and fairer direct and indirect taxation, including by bringing net income from the retail, export, and agriculture sectors properly into the tax system.\nAt the same time, the FY25 budget provides additional resources to expand social protection by increasing both the generosity and coverage of BISP, education, and health spending,” he added.\n“A fairer balance of fiscal effort between the federal and provincial governments, which have agreed to re-balance spending activities in line with the 18th constitutional amendment through the signature of a National Fiscal Pact that devolves to provincial governments higher spending for education, health, social protection, and regional public infrastructure investment, enabling improved public service provision.\nAt the same time, the provinces will take steps to increase their own tax-collection efforts, including in sales tax on services and agricultural income tax. On the latter, all provinces are committed to fully harmonizing their Agriculture Income Tax regimes through legislative changes with the federal personal and corporate income tax regimes and this will become effective from January 1, 2025,”the statement added.\naccording to the statement reducing inflation, deepening access to financing, and building strong external buffers are key to development and resilience. Monetary policy will continue to be focused on supporting disinflation, which will help protect real incomes, especially for the most vulnerable.\nTo buffer against shocks and build reserves, the State Bank of Pakistan (SBP) will maintain a flexible exchange rate and continue to improve the functioning of the foreign exchange market and the transparency around FX operations.\nOn financial stability, the authorities plan to take measures to deepen access to financing, while strengthening financial institutions, addressing any undercapitalized banks, and upgrading their crisis management framework.\nRestoring energy sector viability and minimizing fiscal risks through the timely adjustment of energy tariffs, decisive cost-reducing reforms, and refraining from further unnecessary expansion of generation capacity.\nThe authorities remain committed to undertaking targeted subsidy reforms and replace cross-subsidies to households with direct and targeted BISP support.\nPromoting private sector and export dynamism by improving the business environment, creating a level-playing field for all businesses, and removing state distortions.\nIn this regard, the authorities are advancing efforts to improve SOE operations and management as well as privatization (with the highest priority given to the most profitable SOEs) and strengthening transparency and governance around the Pakistan Sovereign Wealth Fund and its operations.\nThey are also phasing out incentives to Special Economic Zones, phasing out agricultural support prices and associated subsidies, and refraining from new regulatory or tax-based incentives, or any guaranteed return that could distort the investment landscape, including for projects channeled through the Special Investment Facilitation Council.\nThe authorities have also committed to advance anti-corruption as well as governance and transparency reforms, and gradually liberalize trade policy.\nIMF team is grateful to the Pakistani authorities, private sector, and development partners for their hospitality during the visit to Islamabad and fruitful discussions, the statement said.",
  "retrievedAt": "2025-08-11T03:53:46.857Z"
}
