{
  "title": "Romina Khurshid chairs meeting on establishing mountaineering school in Gilgit Baltistan",
  "link": "https://www.app.com.pk/national/romina-khurshid-chairs-meeting-on-establishing-mountaineering-school-in-gilgit-baltistan/",
  "date_published": "2024-07-13T18:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):Coordinator to the Prime Minister on Climate Change and Environmental Coordination, Romina Khurshid Alam chaired PM’s committee meeting on establishing a mountaineering school in Gilgit Baltistan to promote sustainable green tourism, mountaineering education and local community engagement ensuring environmental conservation.\nThe committee discussed a thorough plan for the establishment of a mountaineering school, overseeing the implementation process from conception to reality, a news release said.\nAddressing the meeting the PM’s aide said the success of the project is in team work and the suggestions of all the participants will be incorporated to finalize the establishment of the mountaineering school.\nRomina Khurshid stressed the need for such initiatives that can help slow down global warming and overcome the devastating impacts of climate change, particularly in mountain regions.\nThe meeting decided to form three sub-committees that will design a comprehensive curriculum, identify suitable locations, prepare a detailed budget, engage with relevant stakeholders and establish a robust monitoring and evaluation system to establish mountaineering school.\nThe first sub-committee will be headed by Secretary Inter Provincial Coordination will prepare a detailed feasibility, assessing the potential sites, infrastructure requirements, and financial implications, identify suitable locations for the construction of the Mountaineering School, considering accessibility, environmental impact.\nThe second sub-committee headed by Secretary Federal Education will design a comprehensive curriculum for the Mountaineering School, incorporating international best practices and standards in mountaineering, rescue operations, and environmental conservation. Establish training programs for instructors and staff, ensuring high-quality education and skill development for students.\nThe third sub-committee headed by National High Altitude Mountaineering, Naila Kiyani will engage with relevant stakeholders, including the Government of Gilgit Baltistan, local communities, mountaineering associations, and international experts, to ensure comprehensive input and collaboration.\nFacilitate coordination with the Government of Gilgit Baltistan to align the project with regional development plans and secure necessary approvals and support, establish a robust monitoring and evaluation framework to track the progress of the project, assess outcomes, and ensure accountability of the project.\nFederal secretaries from ministries of Federal Education and Professional Training, Inter Provincial Coordination and Kashmir Affairs and Gilgit-Baltistan and executive director , NAVTTC attended the meeting while ex-Minister for Tourism, Gilgit-Baltistan, Ghulam Muhammad and Gilgit-Baltistan, and representatives from  Ev-K2-CNR, tourism educationists from  KIU Hunza and Baltistan University and mountaineers including Naila Kiani participated in the meeting online.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:53:50.668Z"
}
