{
  "title": "SBP, International Finance Corporation ink deal to boost local currency financing in Pakistan - Business - DAWN.COM",
  "author": null,
  "content": "The State Bank of Pakistan (SBP) has signed an agreement with the International Finance Corporation (IFC) — a member of the World Bank Group — to strengthen local currency financing and support private sector growth in Pakistan, according to a press release issued on Monday.\n\nAccording to the World Bank, borrowing in foreign currencies exposes clients to the risk that debt and debt service payments (as measured in local currency) increase when the local currency depreciates. However, by converting to local currency, clients are able to address that risk.\n\nThe statement released by the central bank today said that the agreement, signed under the International Swaps and Derivatives Association (ISDA) framework, would enable the IFC to “manage currency risks more effectively” and increase its investments in Pakistani rupees.\n\n“This is an important step towards unlocking financing for critical sectors of the economy and creating jobs across the country,” the SBP statement said.\n\nIt also quoted SBP Governor Jameel Ahmad as saying that promoting private sector growth in Pakistan was “paramount to successful, sustainable economic development of the country”.\n\nHe added that the partnership with the IFC was aimed at enhancing financing opportunities for the private sector.\n\nJohn Gandolfo, IFC vice president and treasurer for treasury and mobilisation, said: “With currency volatility posing significant risks to developing economies, access to local currency financing has never been more important.”\n\nHe said promoting this type of financing was a “strategic priority” for the World Bank Group and a catalyst for economic growth in Pakistan.\n\nThe statement noted that exchange rate risks remain a major challenge for companies in developing economies that borrow in hard currencies such as the US dollar while earning revenue in local currencies.\n\n“The IFC is committed to leveraging innovative financial instruments and strengthening partnerships to address the growing need for local currency financing in emerging markets. Through this partnership with IFC, the SBP aims to bolster economic resilience, promote private sector development and improve foreign exchange liquidity in Pakistan,” the statement said.\n\nThe development comes after Finance Minister Muhammad Aurangzeb, during a week-long visit to Washington, discussed private sector investment, infrastructure financing, and development cooperation in meetings with senior officials of the IFC and the Islamic Development Bank (IsDB).\n\nDuring his meeting with Riccardo Puliti, IFC regional vice president, the minister had highlighted Pakistan’s improving macroeconomic indicators and the importance of strengthening IFC’s partnership with the country.\n\n“We value IFC’s role in scaling up private sector investment, particularly through multi-billion-dollar commitments under the 10-year Country Partnership Framework,“ he had said.\n\nBoth sides had agreed to work toward early financial closure of IFC’s flagship Reko Diq project, and the minister welcomed IFC’s new regional set-up, including a regional office in Islamabad, describing it as a “significant step to deepen collaboration and support sustainable investment in Pakistan.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/2012105805bb5ac.webp",
  "retrievedAt": "2025-10-20T18:23:10.655Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950143/sbp-international-finance-corporation-ink-deal-to-boost-local-currency-financing-in-pakistan",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T07:12:10.000Z"
}
