{
  "title": "Agriculture: Disregarding sugar laws over foreign commitments - Newspaper - DAWN.COM",
  "author": null,
  "content": "The Sindh agriculture department plans to convene a Sugarcane Control Board meeting this week ahead of the upcoming sugarcane crushing season 2025-26. The crushing season formally began in October.\\n\\nIt was, however, not known whether the meeting, to be chaired by the Sindh Minister of Agriculture, would also set the minimum sugarcane crop price in addition to notifying the date of cane crop crushing for this season. It is worth noting that the Sindh agriculture department didn’t fix the minimum price of crops in FY25, in response to the International Monetary Fund’s (IMF) requirements for the government to ensure market deregulation.\\n\\nIt was during the FY24 season that the Sindh government fixed the price of Rs425 per 40kg for the procurement of sugarcane by sugar factory owners. At the beginning of every crushing season the government issues two notifications with approval of the provincial cabinet. Such government decisions are backed by the Sugar Factories Control Act 1950 (Sindh Amendment) Act 2009.\\n\\nThe law enables the provincial government to notify the date of sugarcane crushing under section 8 of the Act for a season. Under Section 16(1) of the Act, the government fixes the minimum price of sugarcane, while subsection 3 of Section 16 ‘directs’ sugar factories to pay a quality premium to cane growers at the end of crushing at the rate of 50 paisa per 40kg for each 0.1 per cent (including fraction) thereof to be calculated pro rata of excess sucrose recovery above 8.7pc determined on an overall sucrose recovery basis of each mill.\\n\\nThe government continues to go against national agricultural laws about sugarcane price ceilings in a bid to implement IMF programme conditions, halting crop price fixings\\n\\nSuch a government notification for rate fixation was binding, so sugar millers could not obtain cane from growers for less than the notified price, though growers have gotten rates over and above the notified price when crop production was lower than anticipated.\\n\\nLast year, the Sindh agriculture secretary had clarified that sugarcane prices would not be fixed due to conditions laid down under the IMF programme. Similarly, the wheat support price was not announced by the federal and provincial governments. Furthermore, the wheat crop was not procured by the Sindh food department, and the Punjab government had neither procured wheat nor fixed the minimum sugarcane price in the past seasons. There has been an outcry from farmers against such decisions by the Punjab government, which has also banned the movement of wheat, coupled with the no-procurement policy.\\n\\nBut, according to Dr Iqrar Ahmed Khan, former vice-chancellor of the University of Agriculture, Faisalabad, it seemed that the provincial government was planning something this season in the wake of the situation arising from the recent wheat crop crisis. “The IMF indeed is talking about deregulation of the market, but such deregulation has to come in totality to protect farmers’ legitimate interests, which are usually at stake due to cartelisation by sugar factory owners,” he contended.\\n\\nSindh-based growers also contend that cartelisation was seen in the province as well. There have been instances in the past in which millers denied adequate prices, irrespective of agitation by sugarcane producers. A group of sugar factories, owned by those connected to the Sindh government, dictates the terms for sugarcane prices to the disadvantage of growers.\\n\\nThe amended Sugar Factories Control Act 1950 enables the provincial government to fix the minimum price of sugarcane, and direct sugar factories to pay a quality premium to cane growers\\n\\nIt was, however, only when these mill owners ran short of sugarcane supplies for their day-to-day crushing requirements that competition among mills led to the procurement of more and more cane; only such a scenario benefits growers. Otherwise, Sindh-based millers are known to procure cane from nearby southern districts of Punjab if need be.\\n\\nPresident of the Sindh Abadgar Board (SAB), Mahmood Nawaz Shah, has also addressed a letter on October 9 to the Sindh Secretary of Agriculture, drawing his attention to the crushing season. He stated that the Sindh government should initiate the process for price fixation and commencement of crushing, as mandated by law, as soon as possible, so that timely price notifications can be shared and losses to farmers can be avoided.\\n\\n“The IMF programme is certainly being implemented in the country, but I just wonder whether, without repealing the Act of 1950, the provincial government can depart from its practice of fixing a sugarcane crop price,” discussed Sindh Chamber of Agriculture’s Vice President Nabi Bux Sathio.\\n\\nHe stated that farmers didn’t receive support prices due to the IMF programme last year. However, in the case of the sugarcane crop, a law exists to govern sugar factories and the crushing season; therefore, adherence to it must be ensured by the government, regardless of the international lenders’ conditions.\\n\\nLast year (2024-25), 16.4 million tonnes of sugarcane were crushed, leading to 1.6m tonnes of sweetener production. The recovery of sucrose content was recorded at 9.48pc in 2024-25, which was less than the 10.37pc recovered in the 2023-24 season.\\n\\nSugar factories owe billions of rupees in liabilities to growers under the quality premium head. Until 2020, an amount of Rs44bn was outstanding from 1998-99 to 2018-19 as per assessments done by the Sindh Cane Commissioner’s office in line with a Sindh High Court order dated December 19, 2019.\\n\\nPublished in Dawn, The Business and Finance Weekly, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/20084603170ac9f.webp",
  "retrievedAt": "2025-10-20T18:52:59.033Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950007",
  "dateList": "2025-10-20",
  "date_published": null
}
