{
  "title": "3-day additional charge in Pakistan Railways raises eyebrows - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The ministry of railways’ decision to entrust the Rawalpindi divisional superintendent (DS) with the additional charge of the office of Lahore DS for a brief period of just three days (October 20 to 22) despite availability of officers in Lahore has raised eyebrows.\\n\\nThe decision to assign the look-after charge to the Rawalpindi DS, as the Lahore DS is on an ex-Pakistan leave, is being seen as allegedly ‘facilitating’ certain elements win significant auctions of railway godowns and others in Badami Bagh and other prime spots for a period of five years and even more, Dawn has learnt.\\n\\n“This has never happened in the history of railways, as the additional charge on look-after basis in absence of any senior officers — whether for one, two, or three days or even for more period is always given to the next (in seniority) to the departmental head. But in this case, very surprisingly, the charge has been given to the officer (Rawalpindi DS) posted 300km away from Lahore,” explained an official source while expressing wonder over the decision. “It clearly reflects that the railway ministry has no trust on anyone to look after the charge of the Lahore DS even for three days, since the ulterior motives behind the move seems to ‘get the work done’ through the officer close to the ministry,” the official requesting anonymity told Dawn.\\n\\nAccording to a notification, the ex-Pakistan leave of Lahore DS Inam Ullah was approved on October 17 with the issuance of the no objection certificate (NOC). The notification, issued by the ministry’s deputy director (compensation) Asia Baig, further assigned the Rawalpindi DS to look after the post of Lahore DS in addition to his own duties during the leave period. Similarly, a corrigendum / addendum was issued and published in various newspapers with reference to advertisements published earlier on August 28. Through this, the auctions of five railway’s commercial properties were rescheduled for October 20 to 22 at the office of Lahore DS.\\n\\nThe decision is being seen as a move to ‘facilitate’ certain elements win significant auctions of PR godowns, other properties in Lahore\\n\\nThe properties included four godowns at Sher Shah Road (Lahore) measuring 25, 10, 50 and 40 marla respectively (October 20 & 21), one parking stand at truck adda measuring 42 marla & one parking stand near L-Xing No-4 Lahore measuring 20 marla (October 20 and 21), one shop at SDR shopping centre No-4 measuring 100 feet (October 20 and 21), one restaurant at BBG near parking stand measuring five marla (October 20 and 21), one godown near L-Xing No 43 BTW GRW-GRWC measuring 1.12 kanal (October 22), two bays under Gari Shahu bridge measuring 3000 sqft (October 20 and 21), a parking stand near L-Xing No-9 measuring 3000 sqft (October 20 and 21), a site for godown at railway road measuring 3.5 marla (October 20 and 21) and 10 shops at cement godown (October 20 and 21).\\n\\n“All the aforementioned properties, including godowns are very important in terms of earning good revenue of millions of rupees each year. And this attracts everyone, especially the business community,” the official said. “But I don’t know which properties of the aforementioned ones are to be given to the people ‘close’ to the ministry,” he said while responding to a question.\\n\\nTo another question, he said that anyone among the several officers posted in Lahore could have been given the additional charge of the office of Lahore DS. “If the ministry doesn’t trust the senior officers next to Lahore DS in Lahore division, it should have entrusted the PR’s workshop division DS or anyone posted in the headquarters with the additional charge. “It means the ministry has no trust on anyone in the PR (except Rawalpindi DS) for this brief three-day Lahore DS-ship. It further reflects that this all has been done to facilitate ‘favourit ones’ in the aforementioned auctions.\\n\\nWhen contacted, Railways Minister Hanif Abbasi expressed ignorance of the development and said: “I really don’t know about this. But I will check it out since your point (giving charge to Rawalpindi DS) seems logical,” When asked if it was done only to allegedly facilitate someone win the auctions of certain properties on lease, he dispelled the impression. “Everyone knows I always see everything in railways on merit,” he maintained.\\n\\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/20095515b9deda4.webp",
  "retrievedAt": "2025-10-20T18:52:57.691Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950044/3-day-additional-charge-in-pakistan-railways-raises-eyebrows",
  "dateList": "2025-10-20",
  "date_published": null
}
