{
  "title": "Exporters assured of govt help in removing hurdles to meat exports - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Special Assistant to the Prime Minister on Industries and Production, Haroon Akhtar Khan, has assured exporters that the government would remove hurdles in meat exports to various international markets and will extend all possible facilities to meat exporters.\\n\\nThe minister assurance came while presiding over a meeting to address the bottlenecks faced by meat exporters in exporting meat to Malaysia.\\n\\nThe meeting was attended by secretary of industries and production, Saif Anjum, along with representatives from both the public and private sectors.\\n\\nThe meeting discussed issues and recommendations related to meat exports to Malaysia. Exp­orters identified main challenges including feed quality, livestock breed, high production costs, lack of cold chain facilities, limited banking support, and documentation hurdles.\\n\\nExporters emphasised that the banking sector is not providing adequate support, forcing them to make cash payments in cattle markets. They also highlighted the absence of cold storage facilities at airports, compelling them to store meat in vehicles.\\n\\nRepresentative of meat exporters pointed out that while India exports meat at USD 3.5 per kilogramme, Pakistan’s export cost stands at USD 5 per kilogramme. They further said that Pakistan currently exports meat to Taji­kistan at the same rate. The minister acknowledged the concerns raised by exporters and affirmed that Pakistani meat is of superior quality and capable of competing in international markets.\\n\\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/200837449d1e32d.webp",
  "retrievedAt": "2025-10-20T18:42:42.370Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950078/exporters-assured-of-govt-help-in-removing-hurdles-to-meat-exports",
  "dateList": "2025-10-20",
  "date_published": null
}
