{
  "title": "Probe begins into two deaths as dengue cases soar to 3,638 in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The health department has launched an investigation into two deaths in Mardan allegedly from dengue as the province-wide infections soared to 3,638 with the emergence of 37 new cases on Sunday.\n\nSecretary health Shahidullah Khan ordered directorate general health services (DGHS) Dr Shahid Yunis to probe the deaths and intimate the department accordingly, a press release issued here said.\n\nThe action has been taken in line with the data from the Integrated Disease Surveillance and Response System (IDSRS).\n\nThe health secretary stated that the province had a history of deaths with co-morbidities in dengue and Covid-19, which is why it warranted investigating both the cases thoroughly.\n\nDept also strengthens surveillance to contain chikungunya outbreak in Peshawar locality\n\nAccording to the directives issued to the Mardan district health officer, the investigation will be led by Field Epidemiology Training Programme (FETP) frontline fellows with responsibilities to include a detailed review of the patients’ history of illness, verification of clinical management, and assessment of any contributing factors.\n\nThe investigation aims to ensure strict compliance with all standard treatment protocols for dengue.\n\nThe DGHS has emphasised the importance of a thorough and transparent inquiry, requesting a comprehensive report of findings and recommendations to be submitted to the office of the director public health at the earliest.\n\nHealth authorities have assured the public that immediate attention and cooperation are being prioritised to address concerns and uphold the highest standards of patient care. Updates on the investigation will be shared as more information becomes available.\n\nMeanwhile, the health department has strengthened surveillance to contain chikungunya outbreak in Sufaid Dheri area of Peshawar\n\nIn response to the recent rise in dengue and confirmed cases of chikungunya in Peshawar, particularly in the Sufaid Dheri, the district health officer has taken swift and proactive measures to strengthen disease surveillance and response mechanisms.\n\nAs per official notification, a dedicated disease surveillance cell has been activated under the directives of DGHS. The cell comprises key health officials, including provincial surveillance officer Dr Gul Sartaj, coordinator LHW Dr Zafar Ali Khan, coordinator surveillance Dr Saad Subhan, entomologists Haroon Afridi and Aminullah, and technical support staff for real-time data collection and reporting.\n\nThe surveillance cell will ensure timely data collection from the public and incident reporting sources and track and trace all reported cases, and coordinate immediate response actions. It will also compile daily reports on case trends, complaints, and follow-up activities to prevent further disease spread.\n\nThe Peshawar district health officer has stated that this step aims to strengthen the disease surveillance and reporting system and ensure prompt response to any emerging public health threat. He emphasised that coordinated monitoring and early detection were vital to curbing vector-borne diseases like chikungunya and dengue before they spread further.\n\nThe DHO urged citizens, particularly those residing in Sufaid Dheri and surrounding localities, to cooperate with health teams, eliminate stagnant water sources, and report any suspected fever cases immediately.\n\nThe health department has reaffirmed its commitment to safeguarding public health through rapid surveillance, timely intervention, and community awareness initiatives.\n\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/20095011c4d42be.webp",
  "retrievedAt": "2025-10-20T18:23:23.711Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949980/probe-begins-into-two-deaths-as-dengue-cases-soar-to-3638-in-kp",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T00:11:48.000Z"
}
