{
  "title": "Pakistan-Afghanistan peace hinges on Taliban halting incursions: Defence Minister Asif - Pakistan - DAWN.COM",
  "author": null,
  "content": "Defence Minister Khawaja Asif said on Monday that the ceasefire agreement between Islamabad and Kabul was linked to the Afghan Taliban’s ability to rein in terrorists attacking Pakistan from neighbouring soil.\n\nThe two countries agreed to a ceasefire in Doha at the weekend after days of border clashes that killed dozens, the worst such violence since the Taliban seized power in Kabul in 2021. Ground fighting between the one-time allies and Pakistani airstrikes across their contested 2,600-kilometre frontier were triggered after Islamabad demanded that Kabul control terrorists it says operate from safe havens in Afghanistan.\n\n“Anything coming from Afghanistan will be [a] violation of this agreement,” Asif said in his office at Parliament in Islamabad. “Everything hinges on this one clause.”\n\nThe Taliban administration and Afghanistan’s defence ministry did not immediately respond to requests for comment.\n\n“In the agreement signed by Pakistan, Afghanistan, Turkiye and Qatar, it was clearly spelled out that there would not be any incursions,” the minister said.\n\n“We have a ceasefire agreement as long as there is no violation of the agreement which is already in force.”\n\nThe banned Tehreek-i-Taliban Pakistan militant group operated out of Afghanistan to attack Pakistan “in connivance” with the Taliban, the defence minister said.\n\nKabul has previously denied such accusations.\n\nIn a separate interview to Al-Jazeera Arabic, he said the primary objective of the ceasefire agreement was to “eliminate the menace of terrorism”.\n\nAsif added that terrorism has been affecting the Pak-Afghan border areas for years.\n\nHe elaborated that both countries concluded that the immediate eradication of terrorism was essential. The two sides, he added, would make serious efforts to curb terrorism; otherwise, regional peace could face grave threats.\n\nAsif said the agreement was primarily reached through the mediation of Qatar and Turkiye, adding that both countries’ presence served as a guarantee for the accord.\n\nThe defence minister also appreciated the role played by Qatari Emir Sheikh Tamim bin Hamad Al Thani and Turkish President Recep Tayyip Erdogan in facilitating the agreement.\n\nAsif maintained that another meeting would be held next week in Istanbul to finalise the details of the agreement, and an effective mechanism would also be devised to resolve the existing issues between the two countries.\n\nHe further said that his Afghan counterpart had also acknowledged terrorism as the main cause of tension in bilateral relations, which would now be addressed.\n\nThe defence czar stated that Pakistan has suffered immense human and financial losses over the past years due to terrorism. However, he expressed hope that peace would now return and relations between Pakistan and Afghanistan would normalise.\n\nAs a result, he said, Pakistan-Afghanistan trade and transit activities would resume, enabling the latter to use the former’s ports once again.\n\nAsif also added that Afghan refugees holding valid visas and documents would be allowed to stay in Pakistan. However, a large number of undocumented refugees would continue to be repatriated, he added.\n\nThe minister said it was premature to claim satisfaction over the resolution of all concerns. “We will have to see in the coming weeks and months how effectively the agreement is implemented,” he said.\n\nIn a separate interview to Arab News, he ruled out the notion that Pakistan had conducted the airstrikes in Kabul on the urging of the United States, saying: “It is total nonsense and nothing else.”\n\nHe questioned why Pakistan would do so, saying the country had had enough of its involvement in Afghanistan for the past few decades.\n\n“We want to stay away and live like decent neighbours. We don’t want to have any involvement in Afghan affairs,” Asif said, adding that Pakistan had “no business” in Afghanistan’s relationship with India or any other country.\n\n“Absolutely not. Whatever they want to do in their own territory and doesn’t spill over to our territory, doesn’t become our business.”\n\nSpeaking later in an interview on Geo News show ‘Aaj Shahzeb Khanzada Kay Sath’, Asif said the Doha talks were not held in a bitter atmosphere and credited the Qatari and Turkish officials for it.\n\n“Not even an opportunity for confrontation was provided on any conflicting point,” he said, adding that all talk of amendments and additions or deletions was done through the Qatari and Turkish officials.\n\n“Direct interaction only happened at the opening, where both sides talked … but all of the engagement was done through Qatar and Turkiye.”\n\nAsif added the draft agreement was only one page, contrary to a longer version he said was circulating on social media. He added that an upcoming meeting in Turkiye would further refine the details, such as the mechanism to implement the deal’s aspects.\n\nQuestioned about his own thoughts about whether the ceasefire would hold, the defence minister said: “I have guarded optimism on the matter; I am hopeful but also remain cautious. Can only say something conclusively given the circumstantial evidence. It is too early at the moment, we must remain hopeful of course.”\n\nThe minister added that he hoped that the Afghan Taliban would act as a “unified government” and conclude the matter with Pakistan instead of returning tomorrow and saying that separate factions were behind the tensions.\n\nHe elaborated that in the case of any violation, Qatar and Turkiye would be asked to play their role. Asif added that the mechanism for this entire process would be decided in the meeting on the October 25.\n\nThe defence minister also stated that the entire TTP leadership was present in Afghanistan, adding that the matter would be taken up in Istanbul as well. He further said that the talks should not be taken to mean that Pakistan would negotiate or hold talks with the TTP, dismissing such a notion.\n\nQuestioned about changes in Qatar’s press releases on the ceasefire with “tensions on the border” removed in a subsequent statement, Asif acknowledged that there was debate on wherever the word was used, but ultimately Qatar’s press release had nothing to do with the draft of the agreement, adding that he could not divulge its contents.\n\n“It is between them. It has absolutely no effect on the agreement,” he said, adding that the incident had no particular implications as were being derived by others.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/201854447a52eae.webp",
  "retrievedAt": "2025-10-20T18:22:56.255Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950173/pakistan-afghanistan-peace-hinges-on-taliban-halting-incursions-defence-minister-asif",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T14:24:12.000Z"
}
