{
  "title": "Turkiye, Qatar help seal truce on western front - World - DAWN.COM",
  "author": null,
  "content": "• Pakistan, Afghanistan resolve to establish security mechanisms for lasting stability\n• Kh Asif says terrorist attacks from Afghan soil must be stopped immediately\n• Mujahid expresses Kabul’s commitment to not support terrorists targeting Pakistan\n• Next round of talks scheduled in Istanbul on 25th\n\nISLAMABAD: Pakis­tan and Afghanistan early on Sunday agreed to an immediate and permanent ceasefire and to set up mechanisms to address security concerns following marathon negotiations in Doha mediated by Qatar and Turkiye, officials announced.\n\nA communique issued by Qatar’s foreign ministry said that after a round of nego­tiations between Pakistan and Afgh­a­nistan, the two sides “agreed to an immediate ceasefire and the establishment of mechanisms to consolidate lasting peace and stability between the two countries”.\n\nDefence and intelligence chiefs of Pak­istan and Afghanistan, accompanied by senior officials, engaged in high-level talks in Doha after a week of intense border clashes along the border, triggered on Oct 9 by Pakis­tani cross-border action aga­inst terrorist sanctuaries in Afghanistan.\n\nThe conflict’s roots lie in the sharp surge in militant attacks inside Pakistan, which coincided with the Afghan Tali­ban’s return to power in 2021. Islamabad blames Kabul for not reining in the Tehreek-i-Taliban Pakistan (TTP) and other militant groups based on its soil.\n\nUN monitoring reports have, meanwhile, repeatedly confirmed linkages bet­ween the Afghan Taliban and other militant groups, reinforcing Islamabad’s concerns.\n\nThe clashes, which started on Oct 11, were the most severe since the Taliban’s 2021 takeover in Kabul and resulted in dozens of deaths, including civilians and security personnel, and hundreds of injuries, exacerbating mistrust between the two countries. A 48-hour ceasefire was agreed on Oct 15 and later extended to allow talks.\n\nPakistan’s delegation was led by Defence Mini­ster Khawaja Asif, along with National Security Adviser and ISI Chief Lt Gen Asim Malik, while Afghanistan’s Defe­nce Min­ister Mullah Moha­mmad Yaqoob Mujahid and intelligence chief Maulvi Abdul Haq Wasiq led the delegation from Kabul.\n\nTurkiye’s role\n\nThe participation of Turkiye, whose role in the process had not been previously disclosed, as a mediator in the talks added a new dimension to the mediation effort.\n\nAnkara’s involvement was notable given its decades-long experience in combating the outlawed Kurdistan Workers’ Party (PKK).\n\nTurkish security sou­rces confirmed that the country’s intelligence chief, Ibrahim Kalin, participated in the discussions. He was also pictured at the Doha meeting. A Turkish source said President Recep Tayyip Erdogan closely followed the discussions.\n\nTurkiye’s foreign ministry welcomed the Pakis­tan-Afghanistan agreement, saying, “We welcome that Afghanistan and Pakistan agreed to a ceasefire under the mediation of Turkiye and Qatar and decided to establish mechanisms to strengthen peace and stability bet­ween the two countries during the talks held in Doha.”\n\n“Turkiye will continue to support the efforts for achieving lasting peace and stability between the two brotherly countries and in the region,” it added.\n\nThe next round of talks is scheduled for Istanbul on Oct 25, where the two sides plan to establish a monitoring mechanism to verify the implementation of the ceasefire and address Pakistan’s long-standing concerns about cross-border sanctuaries of the TTP and other militant groups.\n\nAt the upcoming Istanbul meeting, it is expected that technical committees will work on finalising the terms of a monitoring framework, which is seen as a crucial step towards transforming the ceasefire agreement into lasting peace.\n\nAgreement\n\nDefence Minister Khawaja Asif, while commenting on the agreement reached in Doha, said in a post on X, “The series of terrorist incidents from Afghanistan on Pakistan’s soil will be stopped immediately. Both neighbouring countries will respect each other’s territory.”\n\nHe added that delegations will reconvene in Istanbul later this month to discuss “detailed matters”.\n\nForeign Minister Ishaq Dar called the agreement “the first step in the right direction”, but stressed the importance of follow-up.\n\n“We look forward to the establishment of a concrete and verifiable monitoring mechanism, in the next meeting to be hosted by Turkiye, to address the menace of terrorism emanating from Afghan soil towards Pakistan,” he said.\n\nAfghan Taliban spokesman Zabihullah Mujahid confirmed that “neither country will undertake any hostile actions against the other, nor will they support groups carrying out attacks against the government of Pakistan. Both sides will refrain from targeting each other’s security forces, civilians or critical infrastructure”.\n\nPakistan, as a principle, does not attack civilian targets in Afghanistan. Since the escalation of tensions on Oct 9, Pakistan has focused its strikes on military and intelligence-linked sites, including the Kabul premises of the Taliban’s General Directorate of Intelligence (GDI). That strike, however, triggered a fire in an oil tanker, leading to civilian casualties.\n\nOver the past year and a half, Pakistan has repeatedly targeted TTP sanctuaries in Afghanistan. These actions are often categorised by the Taliban as attacks on civilians. The new agreement, by prohibiting strikes against “civilians”, may complicate Pakistan’s ability to retaliate against TTP hideouts across the border in the future because of the Taliban’s categorisation of these targets as civilians.\n\nLater in the day, Mr Mujahid issued a clarification, saying, “The statements regarding the agreement are not a joint declaration. In these statements, the sentence — ‘and support will not be given to the attacks of those groups that are against the Pakistani government’ — is the consistent stance of the Islamic Emirate that the soil of Afghanistan will not be allowed to be used against any other country.”\n\n“An agreement has been reached between both parties not to undertake any hostile actions against each other, which is an important point,” he maintained.\n\nSunday’s ceasefire, though welcomed widely, is similar to earlier Taliban pledges, including those made during a Chinese-sponsored rapprochement earlier this year that led to the upgrading of diplomatic missions to ambassador level. However, those commitments were not followed by verifiable action.\n\nControversy over border\n\nThe Qatari Foreign Ministry’s statement ignited a controversy. The initial statement referenced “tensions on the border” as a key issue addressed during the negotiations in Doha. However, after objections from the Taliban, the ministry updated the statement, replacing the phrase with “tensions between the two brotherly countries.”\n\nThe alteration was hailed as a diplomatic victory by the Taliban, who have long refused to recognize the Durand Line as the legitimate border between Afghanistan and Pakistan.\n\nTaliban saw the change as a step toward affirming their territorial claims, which could further strain relations with Pakistan.\n\nPakistan’s Foreign Office did not immediately comment on the change in text of communique.\n\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f55cc1f24d1.jpg",
  "retrievedAt": "2025-10-20T18:23:50.578Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950026/turkiye-qatar-help-seal-truce-on-western-front",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T00:10:39.000Z"
}
