{
  "title": "Landlord, son booked for animal cruelty in Bahawalnagar - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALNAGAR: A landlord and his son were charged with animal cruelty after they tortured a buffalo and tried to cut off its legs for entering their home in Minchinabad on Sunday.\\n\\nThe action was taken after the footage of the injured animal went viral on social media.\\n\\nPolice said a farmer, Shahzad, a resident of Munshi Hathar, owned some cattle and one of them accidentally entered the house of the landlord, Ghulam Ali, while grazing on Oct 18.\\n\\nGhulam Ali trapped the animal and, along with his son, Asim, tried to cut off its legs with axes and stabbed it repeatedly. They threw the buffalo on the road in a critically injured state. Ghulam Ali and other influential people in the area warned the farmer against taking any legal action.\\n\\nHowever, after the news of the animal cruelty circulated on social media, the police contacted Shehzad and registered a case against the suspects.\\n\\nA police spokesperson said the main suspect had been arrested.\\n\\nUNWHOLESOME MEAT: The Punjab Food Authority sealed an illegal slaughterhouse supplying unwholesome and dead animals meat to restaurants, hotels and shops in Bahawalnagar and disposed of 350kg meat. It registered a case against three people running the slaughterhouse.\\n\\nThe FIR registered with the B Division police stated that the PFA team was informed that the meat from dead and diseased animals was being supplied to various hotels and shops throughout the city from an illegal slaughterhouse located on Shahbaz Flour Mill Street on the Haroonabad Road in Bahawalnagar. When the slaughterhouse was raided, 350kg of meat was found stored in two freezers in the slaughterhouse.\\n\\nHowever, the three people who were present there, including Mudassar Hameed, were unable to show the slaughterhouse receipt as well as the meat purchase or sale records. As soon as the team called the police and the veterinary doctor Imran Mehmood to inspect the meat, the three men fled the scene while the meat in the slaughterhouse was disposed of and sealed.\\n\\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:42:40.638Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950043/landlord-son-booked-for-animal-cruelty-in-bahawalnagar",
  "dateList": "2025-10-20",
  "date_published": null
}
