{
  "title": "Police directed to implement pilot project on criminal justice system in Peshawar - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court has directed police to implement a pilot project in the provincial capital for strengthening the criminal justice system.\n\nA larger bench consisting of PHC Chief Justice SM Attique Shah, Justice Sahibzada Asadullah, Justice Mohammad Ijaz Khan and Justice Salahud Din also sought a report from the prosecution directorate indicating how many public prosecutors and investigating officers had been trained so far by Khyber Pakhtunkhwa Prosecution Academy, along with the training contents.\n\nIn its 10-page detailed order in the petitions highlighting flaws in the criminal justice system (CJS) and seeking reforms in it, the bench issued multiple directives to different stakeholders of the system, including police, prosecution, lawyers and other relevant government departments.\n\nDuring the previous hearing, the court had formulated several questions for stakeholders, seeking their replies. The bench was hearing two public interest petitions filed by a citizen, Asifullah and a senior lawyer, Shabbir Hussain Gigyani, respectively.\n\nPHC bench seeks reports from stakeholders for introducing reforms\n\nWhile several of the respondents, stakeholders and senior lawyers had submitted their responses, the bench directed other relevant officials to submit the same.\n\nBarrister Amirullah Khan Chamkani appeared for petitioner Asifullah and pointed out that the independence of police had been compromised through the KP Police (Amendment) Act, 2024, as powers of provincial police had been limited, and the petitioner also intended to challenge the same through a separate petition.\n\nDuring the course of the hearing, the KP advocate general, Shah Faisal Uthmankhel, said that land had been acquired for the establishment of the Provincial Forensic Science Laboratory and PC-1 had been approved. However, he stated that due to a lack of budget, no further progress had been made.\n\nThe bench directed the additional chief secretary (home) and the finance secretary to submit a report identifying hurdles to the project and explaining why the required funds were not allocated for its construction.\n\nThe additional inspector general (investigation), Mohammad Alam Khan Shinwari, informed the bench that implementation of comprehensive reforms across the province was presently not practicable due to the prevailing law and order situation, shortage of financial resources and inadequacy of trained human capital.\n\nHowever, it was suggested that a pilot project might initially be undertaken in one district with the objective of strengthening criminal administration of justice, which could thereafter be evaluated and replicated in other districts based on its outcomes.\n\nUnder this initiative, the required number of trained SHOs, investigating officers, and other necessary resources and skills for its implementation would be identified. The bench directed to consider the pilot project for implementation in the Peshawar district and submit a report in that regard.\n\nThe court also sought a report from the prosecution directorate on the proposed pilot project for Peshawar, highlighting the required number of public prosecutors and other necessary resources.\n\nThe bench directed it to address in its report certain queries raised by it, including why FIRs were not available online and why challans (charge sheet) were not forwarded promptly; whether any accountability mechanism existed to evaluate the performance of district public prosecutors and public prosecutors.\n\nThe bench summoned the additional chief secretary, home and tribal affairs, inspector general of police and provincial law secretary (home) for the next date, which would be fixed later.\n\nThe bench directed the additional registrar (judicial) to issue notices to the presidents of all bar associations in the province and district and sessions judges, and they should ensure that members of their respective bars practising on the criminal side were duly informed of the matter under consideration.\n\nThe additional attorney general, Sanaullah, appeared for the federal government along with the law officer of the Ministry of Human Rights, Fahad Azhar, and a representative of the Law and Justice Commission of Pakistan, Ghina-i-Sahar.\n\nShah Faisal Uthmankhel, additional advocates general Nomanul Haq Kakakhel and Niaz Mohammad appeared along with senior police officers and those of the prosecution department.\n\nAdvocate Syed Akhtar Ali Shah, a former home secretary, submitted a 61-page written reply, addressing each of the 20 questions framed by the high court.\n\nHis submissions examined the structural causes of institutional dysfunction in the justice system, including non-registration of FIRs, false cases, misuse of laws, defective investigation and weak accountability. Central to his analysis, however, was the recognition that the crisis of justice in Pakistan was fundamentally a crisis of training, professionalism and governance.\n\nSeveral other lawyers well-versed in criminal jurisprudence, including Mohammad Nisar Khan, Tariq Yousafzai, Mian Arshid Jan, Ijaz Khan, Imtiaz Khan, Yousaf Shah Mohmand, Saeed Khan, Mohammad Sareer Khan, Sahibzada Riazatul Haq, Tafseel Khan Afridi, Arif Jadoon, Farhatullah Khan, Aminur Rehman, Khurram Ghias Khan and a former superintendent of police, Mian Naseeb Jan appeared on court notice and put forward their opinions.\n\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/20101240036a42b.webp",
  "retrievedAt": "2025-10-20T18:23:24.370Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949988/police-directed-to-implement-pilot-project-on-criminal-justice-system-in-peshawar",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T00:11:48.000Z"
}
