{
  "title": "Tax less for capital growth - Newspaper - DAWN.COM",
  "author": null,
  "content": "It is all a fiscal problem. Effective tax rates have reached a point where there is no economic incentive to invest in the economy, in the absence of which, economic growth will remain a distant dream. Total consumption as a percentage of GDP was almost 100 per cent in 2024-25; the highest ever.\n\nAny growth to be driven by consumption will be short-lived. Any sustainable growth requires massive investment in the economy’s production capacity, and that remains constrained by one of the highest effective tax rates in the world, both at a corporate and at an individual level.\n\nThe country needs an overarching and coherent industrial policy that brings together a stimulating tax policy, a marginal-price-driven power policy, and a savings regime that incentivises formal savings that can provide capital to drive investments in the economy.\n\nTaxes paid by salaried individuals amounted to Rs545 billion in FY25 — 66.7pc of which is estimated to have been contributed by roughly 129,000 individuals that belonged to the top slab.\n\nAn investment in lieu of taxes programme through a five percentage point reduction in corporate and salary taxes could create investment stimulus, generating Rs800bn in productive capital stock\n\nThese are estimates, interpolated from public data; the availability of public data on slabs can further refine this calculation. The distribution of our distorted slab structure is such that 10.8pc of total income tax payers were in the top slab. Effectively, the sovereign takes away an average of 28.6pc of top slab taxpayers’ taxable income, largely to fund a perpetual deficit.\n\nThat capital can potentially be better utilised through channelising it to private savings, and investments through directed policy interventions, rather than stimulating consumption.\n\nIt is also estimated that taxes paid by corporations amounted to Rs2.5 trillion, with only a small 0.5pc of corporates contributing 81pc of total corporate taxes paid. These are large corporations that can effectively reallocate capital, and drive investment growth — but a distorted tax regime penalises any such ventures.\n\nA policy structure where a reduction in corporate tax rates can generate surplus after-tax income that can be channelised to investment in the economy can stimulate the investment component of the GDP, rejigging the economy from consumption to growth.\n\nA five percentage point reduction in the effective tax rate of corporations and individuals can unlock Rs453bn in after-tax income (approximately Rs293bn from corporates, and approximately Rs160bn from salaried individuals), that — instead of being allocated to service perpetual deficits — can be used to stimulate private investment in the economy.\n\nAn ‘investment in lieu of taxes’ programme can be initiated, where a certain proportion of tax savings can be reallocated to investments that enhance overall productive capacity. It is critical that the same is ring-fenced to prioritising high-impact investments, rather than accumulation of land and real estate that has an abysmal impact multiplier.\n\nA sunset clause can be put into place, such that corporations are incentivised to accelerate investment in the economy, wherein any income generated from fresh investment can be taxed at a marginally lower tax rate, but results in an overall expanded tax base.\n\nSimilarly, surplus income available with individuals can be incentivised to be redirected towards savings in the directed capital market or banking instruments, which complements the overall industrial policy.\n\nAn industrial policy cannot be created in isolation, without taking into consideration the dynamics of income and capital. Incentives that enhance the participation of individuals in capital markets, or financial institutions, to fund incremental capacity will be able to redirect income away from consumption and towards investments.\n\nAssuming 70pc of the hypothetical Rs453bn in after-tax income can be invested, it could also unlock private sector credit, which can be linked to reduced tax rates for the banking sector. Assuming a 60-40 debt-equity ratio for fresh investment, capital allocation of almost Rs800bn can be unlocked for investment in the economy.\n\nPolicy levers that link the allocation of capital investment for all participants in the economy need to be at the core of any coherent industrial policy.\n\nHowever, a reduction in tax collection by Rs453bn would create a gap in the fiscal space, and considering the National Finance Commission conundrum — provinces carving out their share right at the revenue level — the quantum of such a carve-out needs to change for any investment growth to happen.\n\nIt has been demonstrated by economic performance in the last few years that the economy simply cannot grow sustainably with a distorted fiscal regime. The question that needs to be asked is whether the Rs453bn redeployed in investments could be used effectively by provinces to generate economic growth?\n\nIn the absence of economic growth, the population is suffering, irrespective of a federal or provincial jurisdiction. A pivot to investment-oriented growth will enhance economic activity across all provinces, which simply cannot be done by expanding government expenditure. Instead of giving market-distorting subsidies, there is a need to let the market find the equilibrium.\n\nThe surplus after-tax income can be financed by provinces either through increases in provincial tax income or through reducing expenditure by an equivalent amount. With a population that exceeds 250 million, the country needs more investment-oriented growth, more export-oriented investments, higher productivity, and higher-quality jobs. That simply cannot be provided by a debt-fueled government expenditure machinery.\n\nThe writer is an assistant professor of practice at IBA, member of the Thar Coal Energy Board, and CEO of NCGCLreceived before the filing of the report.\n\nPublished in Dawn, The Business and Finance Weekly, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f554fd17590.jpg",
  "retrievedAt": "2025-10-20T18:23:22.769Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950014",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T00:11:04.000Z"
}
