{
  "title": "Australia’s McKeown, O’Callaghan start post-Titmus era in style at swimming World Cup - Sport - DAWN.COM",
  "author": null,
  "content": "Mollie O’Callaghan and Kaylee McKeown launched Australia’s post-Ariarne Titmus era in style by smashing short course world records at the World Cup meet in Westmont, Illinois.\n\nOlympic 200m freestyle champion O’Callaghan swam 1:49.77 for victory in the same event on Saturday, eclipsing the previous mark of 1:50.31 set by Hong Kong’s Siobhan Haughey in 2021.\n\nMcKeown then held off fierce rival Regan Smith to win the 200 backstroke in 1:57.87 on the final night of the meet on Sunday, erasing the American’s previous best of 1:58.04 set at the short course world championships last December.\n\nMcKeown’s win turned the tables on Smith, who had edged the Australian for the 100 backstroke title on Saturday and equalled her own short course world record (54.02) in the process.\n\nWhile McKeown usually allows Smith an early lead before hunting her down, the Australian led hard from the front in the 200 and held her off to the wall.\n\n“I wanted to see what I could do tonight,” said 24-year-old McKeown, who has won the 100 and 200 backstroke gold medals at the last two Olympics.\n\n“Regan pushed me through all the way. I wanted to go out hard and hold on; it’s not something that I’m used to doing.”\n\nMcKeown owns both the short and long course 200 world records, while Smith has both in the 100.\n\nThe eye-catching performances of the Australian women come days after former teammate and Olympic 400 freestyle champion Ariarne Titmus announced her shock decision to retire from competitive swimming at the age of 25.\n\nKate Douglass grabbed another world record (50.19) for the United States in the 100 freestyle, taking down Australian Cate Campbell’s 50.25 best from 2017.\n\nIt was the versatile Douglass’s third short course world record, having already set the 200 individual medley and 200 breaststroke marks.\n\n“I kind of wanted to go for it tonight,” the 23-year-old said.\n\n“It’s definitely crazy to think that I have a breaststroke and freestyle world record. Pretty cool.”\n\nThe third and final meet in the World Cup series starts in Toronto from Thursday.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:23:10.633Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950145/australias-mckeown-ocallaghan-start-post-titmus-era-in-style-at-swimming-world-cup",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T07:32:05.000Z"
}
