{
  "title": "Sharif family convenes in Lahore to discuss key national issues - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Prime Mini­ster Shehbaz Sharif met his elder brother, PML-N President Nawaz Sharif, on Sunday to discuss key national and international issues.\n\nParty officials said Pun­jab Chief Minister Mar­yam Nawaz also joined the meeting, where subjects such as the ongoing talks with Afgha­nistan, a crackdown against the TLP, as well as the forthcoming local government polls in Punjab also came under discussion.\n\nAccording to reports, PM Shehbaz briefed his elder brother on the ongoing talks between Pakistan and Afghanistan.\n\nDuring the meeting, Nawaz Sharif reaffirmed that “no one will be allowed to look at Pakistan with malicious intent”, adding that “Pakistan is our red line, and the sons of this nation are defending their motherland without regard for their own lives”.\n\nViews were also excha­nged on the party’s strategy to ensure the victory of its candidates in the local government polls, following the Ele­ction Com­m­ission of Pak­istan’s decision to hold the long-delayed elections in December.\n\nThey said that as the first phase of the electoral exercise in which 9-member panels will be elected in each union council, will be party-less giving the winning candidates 30 days to join a political party of their preference, the meeting discussed holding the second phase of the polls in selected districts first where the PML-N has a strong following.\n\nIt was decided to take other party leaders onboard for selecting districts for the second phase of polls.\n\nSeparately, PM Shehbaz also met with Interior Minister Mohsin Raza Naqvi.\n\nAccording to the Associated Press of Pakistan, the minister briefed the premier on the law and order situation in the country, as well as ongoing development projects in Islamabad.\n\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/20073017dbd125f.webp",
  "retrievedAt": "2025-10-20T18:23:50.453Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950024/sharif-family-convenes-in-lahore-to-discuss-key-national-issues",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T00:10:39.000Z"
}
