{
  "title": "‘Curbing militancy key to financial stability’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Aurangzeb hopes for swift PIA sell-off, says govt near Reko Diq financial close\n• Remarks come as credit agencies, banks seek clarity on country’s security outlook\n\nWASHINGTON: Cur­bing militancy is essential for financial stability, Fin­ance Minister Muhammad Aurangzeb said as he wrapped up a week-long visit to Washington.\n\nOfficials accompanying the minister to the World Bank and IMF annual meetings said the security-economy link surfaced repeatedly in many of the delegation’s 65 meetings during the seven-day visit.\n\n“From credit rating agencies to commercial banks, everyone wanted to understand whether Pakistan’s security environment is now aligned with its economic recovery,” one official said.\n\nIn a media briefing, Mr Aurangzeb acknowledged that sustained stability and investor confidence depend on internal peace and political cohesion. “From a financial angle, this action is necessary,” he said, a rare admission that the country’s economic prospects are inseparable from its ability to curb extremism.\n\nHis remarks came at a time when Pakistan’s strategic significance is being increasingly recognised in world capitals. Under US President Donald Trump’s second term, Islamabad has regained Washington’s attention after years of estrangement.\n\nMr Trump’s unconventional approach has brought former adversaries into dialogue, and Pakistan has leveraged this moment adroitly.\n\nEarlier this week, Mr Aurangzeb held an exclusive meeting with US Congressman French Hill, chairman of the House Financial Services Committee — the first time a Pakistani finance minister met the head of this key congressional panel.\n\nMr Aurangzeb used the meeting to stress the importance of enhancing economic ties between Pakistan and the US.\n\nAs the finance minister emphasised the link between geopolitics and economics, Washington-based analyst Shuja Nawaz told CNN that Pakistan’s ability to defend itself against a much larger adversary has impressed the US leader.\n\n“Trump likes winners,” he said, noting that the US president sees the Pakistan army chief as “a winner who is willing to make quick decisions”.\n\nThat rapport, and the growing security cooperation — from rare earth exports to US arms sales — form a new strategic backdrop for Mr Aurangzeb’s economic diplomacy.\n\nMichael Kugelman of the Asia Pacific Foundation added, “The current global moment does benefit Pakistan due to its geographic proximity to the Gulf and its close partnerships with key stakeholders there.”\n\nAnalysts say Washington’s renewed interest in Pakistan is shaped by both geopolitical convenience and economic opportunity.\n\nFiscal credibility\n\nAgainst this evolving backdrop, Mr Aurangzeb’s Washington visit served to consolidate a narrative of fiscal stability and policy credibility. Pakistan’s credit ratings have improved, with Fitch, Moody’s and S&P Global all upgrading their outlooks. The IMF’s recent staff-level agreement for a $1.2 billion disbursement further signalled institutional confidence in the country’s reform trajectory.\n\nThe IMF’s World Economic Outlook projected 3.6 per cent growth for FY2025, though it noted that the economic impact of this summer’s floods is still being assessed.\n\nStill, global investors are beginning to return. Institutional funds, banks and advisory firms that had long viewed Pakistan as high-risk are reopening conversations — a shift attributed by senior officials to consistent fiscal signalling and a more stable security environment.\n\nPrivatisation\n\nMr Aurangzeb’s meetings with Abu Dhabi Commercial Bank (ADCB) and JP Morgan reflected a focus on diversification and modernisation of Pakistan’s financing instruments. He briefed ADCB executives on the launch of the Panda Bond and the refreshing of the Global Medium-Term Note (GMTN) programme.\n\nAt a news briefing, the minister expressed optimism about the accelerated privatisation of the national carrier and disclosed that the government was close to achieving financial close on the Reko Diq project. He urged ADCB to expand its participation in Pakistan’s financial markets and trade flows.\n\nAt JP Morgan, Mr Aurangzeb discussed the forthcoming Green Panda Bond in China and the federal cabinet’s approval of the government-to-government sale of First Women Bank to a UAE conglomerate.\n\nHe also emphasised emerging digital cooperation with Saudi Arabia through the GO AI Hub and growing US interest in the Reko Diq mining venture.\n\nPublished in Dawn, October 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/20070935e7d214b.webp",
  "retrievedAt": "2025-10-20T18:23:23.033Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950022",
  "dateList": "2025-10-20",
  "date_published": "2025-10-20T00:10:39.000Z"
}
