{
  "title": "Kamyab Jawan Programme: ‘YES’ phase II registration to be kicked off on Thursday",
  "link": "https://www.app.com.pk/national/kamyab-jawan-programme-yes-phase-ii-registration-to-be-kicked-off-on-thursday/",
  "date_published": "2020-08-11T23:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar Wednesday said the government would start registering the youth under the second phase of Youth Entrepreneurship Scheme (YES) from August 13.\nAddressing a joint news conference along with Adviser to the Prime Minister on Finance and Revenue Dr Abdul Hafeez Shaikh, Usman Dar urged the youth to visit KamyabJawan.gov.pk website from Thursday and apply for the concessionary loans, to be offered under the second phase.\nThe rejected candidate of first phase of programme could also register themselves under this phase for availing the soft loans, he added.\nHe said application form for the new phase would be upload on the Kamyab Jawan Programme’s website by August 13.\nThe ‘YES’ is a component of the government’s flagship Kamyab Jawan project launched last year to offer soft loan facility to those having workable business ideas.\nUsman Dar said applications of some 95 per cent youth were rejected in the first phase for lacking a workable business plan.\nThe SAPM said the core vision of Kamyab Jawan Programme was to create the employment opportunities in the country. An amount of Rs 100 billion was allocated for the first phase of the YES which would eventually create one million jobs.\nHe said loans would only be offered to those who had business experience and proper skills. The programme was being implemented in transparent manner and on the basis of merit, he added.\nUnder the programme, he said a dedicated category had been introduced for those people who were interested in starting their own start-ups. They would be given loans ranging from Rs 100,000 to 1,000,000 without any guarantee. He urged the youth to utilize the loans for the business purposes only.",
  "retrievedAt": "2025-08-11T19:38:54.919Z"
}
