{
  "title": "Opposition positive suggestions incorporated in FATF bills: Qureshi",
  "link": "https://www.app.com.pk/national/opposition-positive-suggestions-incorporated-in-fatf-bills-qureshi/",
  "date_published": "2020-08-12T04:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Wednesday said positive suggestions from the opposition side had been incorporated in the bill related to Financial Action Task Force (FATF).\n“I am glad with the contribution of the opposition members and some of their suggestions are very positive and the positive suggestions had been incorporated in the bill through long discussion, ” he said this while speaking in National Assembly.\nHe also appreciated the Law Minister Mohammad Farogh Naseem and his team for their efforts for evolving consensus over the bill related to FATF with opposition parties. “Long deliberations were held with the opposition parties to reach consensus on the FATF related legislation,” he added.\nHe said the terror financing and money laundering were the menace that Pakistan had to confront and eradicate.\nQureshi said that legislation on the money laundering and terror financing was in the best interest of the country.\nHe also endorsed the point of view of Naveed Qamar that legislations should be passed keeping in view fundamental rights of the people.\nOn Lahore incident, he said there were two points of view on the incident taken place during the hearing of Pakistan Muslim League (N) Vice President Maryam Nawaz.\nHe said according to the government, drama had been staged to divert the attention from the cases in which PML-N leader was summoned by the NAB.\nAbout point raised by Khawaja Asif regarding registration of FIR against Rana Tanveer who was present in the House on Tuesday, he said that registration of FIR against Rana Tanveer should be investigated.\n“Yes, we have reached an understanding as the government has accepted almost all our amendments,” said senior Pakistan Peoples Party (PPP) leader Syed Naveed Qamar.\nHe said the government had agreed to defer the remaining two bills — the Anti-Money Laundering (Second Amendment) Bill 2020 and the Code of Criminal Procedure (Amendment) Bill 2020 — and discussions on these two legislations would be held.\n“We have cooperated with the government on basis of our thinking and belief on bills related to national interest,” he added. “We have reached understanding with government on six bills related to national interest,” he added. Shah Mehmood Qureshi said, “the national interest comes above all.”",
  "retrievedAt": "2025-08-11T19:38:52.863Z"
}
