{
  "title": "PM constitutes NCC on SMEs Development",
  "link": "https://www.app.com.pk/national/pm-constitutes-ncc-on-smes-development/",
  "date_published": "2020-08-12T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): Prime Minister Imran Khan on Wednesday constituted the National Coordination Committee on Small and Medium Enterprises Development for growth of the SMEs sector in the country.\nThe prime minister directed to review and finalize the draft SME policy within two weeks, according to an official document released by the Prime Minister’s Office.\nThe secretarial support to the committee will be provided by the Ministry of Industries and Production.\nThe Minister for Industries and Production, as convenor, will brief the prime minister once a week on impediments, recommendations for improvement and overall progress on implementation of the PM’s policy guidelines.\nOther members of the committee include secretaries of Ministry of Industries, Commerce Division, Finance Division, Power Division, Petroleum Division, and Law and Justice Ministry, all chief secretaries, Federal Board of Revenue (FBR) chairman, Securities and Exchange Commission of Pakistan chairman, chief executive officers of Small and Medium Enterprises Development Authority (SMEDA), and Trade Development Authority of Pakistan (TDAP), State Bank of Pakistan deputy governor and one representative of the SMEs sector from each province.\nThe committee chairman can opt to appoint any person from the public and private sectors, if deemed necessary.\nThe committee will focus on fiscal and monetary incentives for the SMEs growth and suggest measures to address market address.\nIt will propose legislative and regulatory amendments to enhance case of doing business for the SMEs and encourage documentation for the sector.\nThe committee will suggest guidelines to reduce regulatory burden on the SMEs and come up with deliverables and targets for implementation of approved measures besides assigning responsibilities with timelines.\nIt will hold regular weekly meetings to review progress and act as a focal point for inter-provincial, inter-ministerial, inter-departmental and inter-agency coordination for implementation.\nThe committee will develop a mechanism to ensure coherent and synchronized implementation of SMEs growth measures.",
  "retrievedAt": "2025-08-11T19:38:48.473Z"
}
