{
  "title": "Ehsaas Nash-o-Numa program to be formally launched on Thursday",
  "link": "https://www.app.com.pk/national/ehsaas-nash-o-numa-program-to-be-formally-launched-on-thursday/",
  "date_published": "2020-08-12T06:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar on Wednesday announced that the first-ever ‘Ehsaas Nash-o-Numa’ program to address the issue of stunted growth faced by 40 percent of the children in Pakistan would formally launch on August 13.\nIn a news briefing, she said Prime Minister Imran Khan would formally launch the ‘Ehsaas Nash-o-Numa’ program along with her by visiting the Ehsaas Nash-o-Numa Center in Khyber Pakhtunkhwa’s Khyber tribal district.\nDr. Nishtar said the issue of stunting among children in Pakistan had always been among the top priorities of the prime minister as in his initial address to the nation soon after assuming he responsibilities, he showed the CT scan of a child affected by stunting and highlighted the gross issue.\nShe said around 40 percent of children in Pakistan suffered from stunting due to malnutrition and other reasons.\nThe highest incidence of stunting disease in Pakistan in terms of provinces and regions was in the tribal districts of Khyber Pakhtunkhwa, Balochistan, Gilgit-Baltistan and Sindh, she added.\nEhsaas Nash-o-Numa program has been launched to prevent stunting due to malnutrition in children under the age of two years, pregnant women and lactating mothers.The deserving Nash-o-Numa beneficiary women will be given a quarterly stipend including Rs 2,000 for girls and Rs 1,500 for boys besides providing healthy food sachet.\nShe said the program being implemented with the support of World Food program is the result of a year and a half of comprehensive planning, technical consultation and public-private partnership.\nIn the first phase, a total of 33 development centers are being set up in nine districts across the country including Khyber, Upper Dir, Bagh, Ghizer, Hunza, Kharmang, Kharan, Badin and Rajanpur under the program. All the 33 development centers of the first phase would be made functional by the end of August, she said.\nThe four Nash-o-Numa centers have been set up in Rajanpur district of Punjab province, six in Upper Dir and three in Khyber district of |Khyber Pakhtunkhwa while six centers will be set up in Badin district in Sindh.\nThree Nash-o-Numa centers are being established in Kharan district of Balochistan province, three in Bagh district of Azad Jammu and Kashmir and eight in Gilgit-Baltistan.\nShe pointed out that a number of facilities would be provided to the women and their children at every ‘Nash-o-Numa’ center.  A separate registration desk has been set up at each center to facilitate the deserving women.\nThe ‘Nash-o-Numa’ app has been developed to keep track of the health of the beneficiaries while a special guidebook has also been prepared to guide them.\nThe deputed staff at the registration desk will register pregnant and lactating women and their newborns in the development app and conduct a detailed examination of the height, weight and health of women and their children less than two years of age.\nThe arrangements for immunizations of affected children and women have also been made in the centers. It has been made mandatory for women beneficiaries of ‘Nash-o-Numa’ program to participate in the awareness sessions which have been specially arranged in regional languages, Dr. Nishtar informed.\nSpecial charts, posters and informative videos on food, hygiene and health had been compiled for the awareness of the women beneficiaries, she added.\nATM machines are being specially installed at all the Nash-o-Numa centers for biometric payments of quarterly stipends to the women beneficiaries. After getting healthy food packets, women will be able to get Nash-o-Numa stipend from the ATM machine set up at the center, she added.",
  "retrievedAt": "2025-08-11T19:38:50.874Z"
}
