{
  "title": "NA passes five government bills related to FATF",
  "link": "https://www.app.com.pk/national/na-passes-five-government-bills-related-to-fatf/",
  "date_published": "2020-08-12T06:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): The National Assembly on Wednesday passed five government bills related to the Financial Action Task Force (FATF) after developing a consensus between opposition and treasury benches.\nThe bill passed by the House were the Anti-terrorism (Amendment) Bill, 2020 (Sections 6, 11EE, 11J, 11N, 11O, 11OO, 11Q, 19 and 21EE); the Limited Liability Partnership (Amendment) Bill, 2020; the Companies (Amendment) Bill, 2020; the Control of Narcotic Substances (Amendment) Bill, 2020; and the Islamabad Capital Territory Trust Bill, 2020.\nThe Anti-Terrorism (Amendment) bill aimed at enhancing the effectiveness of the implementation of the orders passed by the Federal Government under the Anti-terrorism Act, 1997 and the United Nations (Security Council) Act, 1948.\nThe amendments were considered essential in the Anti-Terrorism Act, 1997.\nThe scope of the application of the penalties needs to be extended to those who are involved in terrorism in any manner outside the boundaries of the country’ in addition, it is considered essential to match the penalties, fines and restrictions for same kind of punishments and to provide legal powers to the law enforcement agencies for speedy trial and disposal of cases.\nFurthermore, the facilities required for meeting the necessary expenses through exemptions are also required to be incorporated in detail.\nThe Limited Liability Partnership (Amendment) Bill 2020 has suggested various amendments to Limited Liability Partnership Act 2017 to ensure compliance with the recommendations on anti-money laundering and countering the financing of terrorism issued by FATF. Pakistan’s 2019 Mutual Evaluation Report (MER) on FATF Recommendations issued by the Asia Pacific Group on Money Laundering (APG) highlighted lack of obligations for limited liability partnerships (LLPs) to hold ultimate beneficial ownership information. The report also highlighted lack of penalties for breach of AML/CFT requirements by LLFs.\nAccordingly, the proposed amendments are being made to ensure compliance with FATF’s recommendation aimed at enhancing the transparency of legal persons, to fulfill the recommended actions in MER, and to enhance the country’s ranking against the aforesaid standards. These are also aimed to conform to the action plan approved by the National Executive Committee on AML/CFT for compliance with the FATF recommendations.\nThe Companies (Amendment) Bill 2020 has suggested various amendments to Companies Act 2017 to ensure compliance with the recommendations on anti-money laundering and countering the financing of terrorism issued by FATF. Pakistan’s 2019 MER on FATF Recommendations issued by the Asia Pacific Group on Money Laundering (APG) highlighted certain deficiencies including lack of explicit prohibition on issuance of bearer shares or bearer share warrants, lack of obligations for companies to hold beneficial ownership information, etc.\nThe report also recommended that the persons who breach the required measures shall be made subject to effective, proportionate and dissuasive sanctions.\nAccordingly, the proposed amendments are being made to ensure compliance with FATF’s recommendation aimed at enhancing the transparency of legal persons, to fulfill the recommended actions in MER and to enhance the country’s ranking against the aforesaid standards.\nThese are also aimed at conforming to the action plan approved by the National Executive Committee on AML/CFT for compliance with the FATF recommendations.\nThe Islamabad Capital Territory Trust Bill, 2020 aimed to enhance the effectiveness of the implementation of the Orders passed by the Federal Government to cater effective administration and financial monitoring and evaluation of the trusts relating to registration, administration and monitoring of trusts registered within the territorial limits of Islamabad Capital Territory.\nAccording to the Statement of Objects and Reasons of the Control of Narcotic Substances (Amendment) Bill, 2020, Pakistan has been given final lifeline by FATF to meet the deficiencies with regard to Money Laundering and Terrorists Financing highlighted by Asian Pacific Group .\nThat vide para- 41 of recommendation No.3 of Mutual Evaluation/ Report (MER) 2019 FATF has observed a minor deficiency in Section 12 of Control of Narcotics Substances (CNSI Act 1997 that it restricts the acts of concealment or disguise by making false declaration.\nIt is highlighted that as per section 12 [c) of CNS Act1997, the scope / applicability of the said section has been confined to “making false declaration with regard to ownership, source, location or true nature of assets”. Moreover, during the meeting held at Financial Monitoring Unit (FMU), it was intimated that legal regime of Pakistan with regard to ML and TF is largely compliant, however, in case the deficiencies are not met, it may result into negative impact upon the efforts undertaken by Pakistan to comply with the requirements / observations of FATF.\nMinister for Law and Justice Mohammad Farogh Naseem on the request of Maulana Akbar Chitrali a bill- the Islamabad Capital Territory Waqf Properties Bill, 2020 was deferred.",
  "retrievedAt": "2025-08-11T19:38:51.947Z"
}
