{
  "title": "National WASH Accounts for Pakistan vital to save lives: Experts",
  "link": "https://www.app.com.pk/national/national-wash-accounts-for-pakistan-vital-to-save-lives-experts/",
  "date_published": "2024-11-03T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP):The establishment of a National Water, Sanitation, and Hygiene (WASH) Account in Pakistan is essential for building robust WASH infrastructure, tracking financial flows, and monitoring spending to ensure accountability and resilience in WASH services, asserted experts at a policy dialogue.\nThe event, organized by WaterAid Pakistan in partnership with the Sustainable Development Policy Institute (SDPI), also marked the launch of the policy brief, “Establishing National WASH Accounts for Pakistan: A Call for Evidence-Based Planning and Financing for WASH.l,” said a press release issued here.\nThe dialogue brought together policymakers, stakeholders, and WASH experts to discuss a path forward for implementing National WASH Accounts through concerted efforts at both the federal and provincial levels.\nWaterAid Pakistan’s Country Director, Mian Muhammad Junaid, underscored that over 20 countries have already established WASH Accounts, leading to structured planning, improved resource allocation, and enhanced accountability. “For Pakistan, the WASH Account would facilitate data-driven planning, meeting both humanitarian and development needs through a rights-based, integrated approach,” he stated, adding that improved WASH services have the potential to reduce the global disease burden by as much as 10%.\nHe emphasized, “Now is the time for all stakeholders to come together and act decisively to ensure that every community in Pakistan has access to safe water and sanitation.”\nThe Deputy Executive Director SDPI and lead author of the Policy Brief, Dr Shafqat Munir Ahmad, highlighted key features of the study proposing to set up National WASH Account in Pakistan. He said the study suggests connecting federal, provincial, and other administrative units’ governments through the process of WASH Accounts to streamline data collection and planning in the WASH sector to imrove the country’s ranking on the SDG-6.\nThe policy brief provides a framework for developing a National WASH Account in Pakistan to tackle local challenges relating to water, sanitation, and hygiene.\nAsghar Ali Halepoto, Chief of the Water Resource Section at the Ministry of Planning, Development & Special Initiatives raised concerns about accountability and resource management. “Data collection must be collaborative, involving citizens, government, and organizations alike,” Halepoto emphasized, adding that local councils need dedicated funds from the Ministry of Finance under a National WASH Account. “We need resilient WASH systems, especially in urban centers vulnerable to climate risks, to ensure uninterrupted services,” he noted.\nThe Pakistan Bureau of Statistics (PBS), represented by Deputy Director General Attiq Ur Rehman, underscored the role of WASH accounts in tracking Sustainable Development Goals (SDGs). “Despite having substantial data, it is fragmented,” he explained, suggesting that a WASH Account within the National Health Account framework could streamline efforts. “PBS is ready to collaborate with partners like SDPI and WaterAid to build a transparent WASH reporting system,” Rehman affirmed.\nThe Member Board of Governors of the Global Climate Change Impact Study Centre (GCISC) and former Chairman National Flood Commission, Engineer Ahmad Kamal said that water is a precious gift for lives; the water resources (surface and underground) are being depleted due to over consumption and wastage. Let us pledge to conserve water and improve WASH setor services.\nDaud Saqlain, Country Representative of Human Appeal, emphasized the challenges stemming from the multiple departments currently handling WASH services in silos. “This fragmentation has historically hindered Pakistan’s capacity to manage and track WASH-related data effectively,”  He said proposing that a dedicated WASH unit be created to oversee integration, enhance accountability, and ensure data-driven decisions. “A centralized WASH unit could transform health and governance outcomes, enabling Pakistan to meet both national needs and international standards like the SDGs,” he said.\nAsif Ali Sherazi, Country Director of Islamic Relief Pakistan, noted the critical gaps impacting public health. “Issues like open defecation, contaminated water, and childhood stunting underscore the immediate need for a cohesive WASH approach,” he remarked, stressing that a consolidated WASH account would avoid duplicative efforts and enhance provincial policies. “Our goal is a healthier, climate-resilient Pakistan, using data to drive targeted improvements,” he added.\nUNICEF Public Finance Expert Dr. Asim Bashir Khan highlighted the disjointed nature of WASH data across institutions, even with indicators from UNICEF’s Multiple Indicator Cluster Survey. “Without a standardized WASH budget classification, tracking investments is challenging,” he said, adding that frameworks like TrackFin could enhance accountability. “Water quality is tied to nutrition and health; contaminants in water supplies contribute directly to child malnutrition. A centralized WASH account would improve governance, bringing transparency and equity to service delivery.”\nThe event concluded with a strong call to action, emphasizing the urgency of implementing the National WASH Account. “Now is the time for all stakeholders to come together and act decisively to ensure that every community in Pakistan has access to safe water and sanitation. This is our opportunity to make a difference and secure a healthier, more resilient future for all,” remarked the speakers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:01:56.488Z"
}
