{
  "title": "ECP directs LEAs to ensure impartiality, fairly law enforcement in Nov 14 cantonment by-polls",
  "link": "https://www.app.com.pk/national/ecp-directs-leas-to-ensure-impartiality-fairly-law-enforcement-in-nov-14-cantonment-by-polls/",
  "date_published": "2024-11-03T13:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP):The Election Commission of Pakistan (ECP) has issued guidelines for law enforcement agencies (LEAs) providing security for the Nov 14 cantonment by-polls, directing them to remain impartial and neutral while preventing intimidation and fairly enforcing the law.\nIn a comprehensive code of conduct for law enforcers, the electoral watchdog emphasised the need to maintain impartiality and neutrality while fostering a peaceful voting atmosphere , assisting the Presiding Officer , providing guidance to voters, preventing intimidation and fairly enforcing the law.\nAs per the ECP’s code of conduct for the Cantonment Board bye-elections on November 14, 2024, law enforcement personnel, including police, must ensure free, fair, and transparent atmosphere outside polling stations including in Ward No. 06 of Rawalpindi Cantt, Ward Nos. 04 and 08 of Wah Cantt, and Ward No. 02 , 04 of Pano Aqil Cantt, so that voters are not intimidated or obstructed in any way while casting their votes.\nSecurity forces deployed at polling stations must avoid any actions that favor or oppose political parties or candidates. They are required to fully cooperate with the Presiding Officer to maintain order and ensure uninterrupted voting.\nPersonnel should act politely and professionally when interacting with voters and polling staff, while firmly addressing any situations in accordance with the law and providing guidance outside polling stations as needed.\nAdhere to the code of conduct by refraining from arguments or altercations with candidates, election agents, polling agents, observers, or media personnel.\nDo not interfere with the responsibilities of the Presiding Officer, Assistant Presiding Officer, or Polling Officer. If a personnel observe any irregularity outside the polling station, promptly report it to the Presiding Officer for further instructions. Should the irregularity persist, immediately inform the Officer In-Charge, who will take appropriate action as per their delegated authority and notify the Returning Officer.\nAccording to the code of conduct, security personnel do not arrest anyone at the polling station unless explicitly directed by the Presiding Officer and do not interfere with the counting process, but rather ensure a peaceful environment outside the polling station during counting.\nAdditionally, the security personnel assist the Presiding Officer in maintaining order outside the polling station and have the authority to remove anyone who misbehaves or disobeys lawful orders.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:01:53.251Z"
}
