{
  "title": "NDMA engages in collaborative discussions with disaster management counterparts in Thailand",
  "link": "https://www.app.com.pk/national/ndma-engages-in-collaborative-discussions-with-disaster-management-counterparts-in-thailand/",
  "date_published": "2024-07-27T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): The National Disaster Management Authority (NDMA) delegation, led by Chairman NDMA Lieutenant General Inam Haider Malik, actively participated in the 5th Board of Trustees meeting of Asian Disaster Preparedness Center (ADPC).\nThis collaborative effort aims to enhance disaster resilience across the region.The delegation also paid a visit to the Thai Military Department of Development and Disaster Relief Training Center, a news release said.\nThis exchange promotes knowledge sharing and capacity building in disaster management and relief efforts. NDMA team engaged with Thai Disaster Prevention & Mitigation Department and visited their Emergency Operation Center. Whereby the discussions centered around disaster risk reduction strategies and cooperation.\nDuring visits, Chairman NDMA highlighted the efforts regarding Anticipatory Actions in Pakistan and how these actions can be implemented in Thailand according to their hazard profile. Similarly, Pakistan would be interested in learning from Thailand’s Anticipatory Actions protocols as well as identification of areas of mutual interest with NDMA’s Think Tank National Institute of Disaster Management (NIDM).\nHe briefed about Pakistan’s status as the chair of INSARAG (International Search and Rescue Advisory Group) of Asia Pacific for 2024. He urged Pakistan and Thailand could coordinate by building partnerships with donors and financial institutions to secure resources for climate resilience projects.\nTo enhance collaborative efforts, he proposed joint simulation exercises specifically designed for Search & Rescue teams. Pak NDMA also invited members of the ADPC board of trustees, the disaster management counterpart of Thailand and the technical team to visit NDMA to witness the capabilities of Pakistan’s NEOC at NDMA HQs.",
  "retrievedAt": "2025-08-11T04:09:09.681Z"
}
