{
  "title": "PM vows to combat challenge of misinformation, fake news on social media",
  "author": null,
  "content": "ISLAMABAD, Jan 3 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday vowed to tackle the growing challenge of digital media including the fake news and misinformation on social media platforms calling it inevitable for elimination of terrorism and extremism from the country.\n“On digital front, the venom against Pakistan is being spitted through social media from some elements abroad. This is also a big challenge, which is supported by distorted facts and twisted reality,” the prime minister said while chairing the meeting of the Apex Committee of National Action Plan.\nThe meeting was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, the federal cabinet members, chief ministers of all provinces, Chief of Army Staff and other high officials.\nThe prime minister said that certain questions were being raised by distorting facts and twisting the reality on social media that were denting the state’s image.\n“If we don’t counter this challenge, all efforts (to eliminate terrorism and extremism in the country) will go waste,” he said expressing the confidence that the government would overcome such challenges.\nThe prime minister recalled how fake news were spread with regard to martyrdom of personnel of Rangers on November 26.\nThe sacrifices of the armed forces are immense which would not go waste and Pakistan will continue its journey towards peace, stability and prosperity, he added.\nPM Shehbaz Sharif on the occasion congratulated the nation as Pakistan assumed non-permanent membership of United Nation Security Council.\nHe emphasized that some Khawarij intruders were living in Pakistan especially in Khyber Pakhtunkhwa to disturb the country’s peace.\nThe prime minister pointed out that the agenda of prosperity and development was discussed in the previous day’s meeting where it was agreed that without bringing peace and stability in the country, economic development was not possible.\nThe government, he said was determined to completely eliminate Fitna Al-Khawarij from the country to ensure socio-economic development of the country.\nThe prime minister stressed that the federal government, the provinces and all relevant stakeholders in collaboration with the Pakistan security forces should make a comprehensive plan in this regard. He pledged that with unity of thought and action, the government will implement such plans in letter and spirit to resolve all challenges faced by the country.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:18:41.671Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-vows-to-combat-challenge-of-misinformation-fake-news-on-social-media/",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T10:11:00.000Z"
}
