{
  "title": "Kashmiris’ rights: New Delhi has lost battle of hearts and minds in IIOJK",
  "link": "https://www.app.com.pk/national/kashmiris-rights-new-delhi-has-lost-battle-of-hearts-and-minds-in-iiojk/",
  "date_published": "2024-08-04T12:30:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 04 (APP):Kashmir has been a burning issue since Partition of the Indian Subcontinent in 1947. Pakistan and India have fought three wars over Kashmir – in 1948, 1965, and 1999 — but have been unable to resolve the dispute.\nAfter the Partition, Indian Subcontinent, millions of Kashmiris felt unsafe and uncertain about their fate. They were required to accede to either of the two states on the basis of the geographical location and wishes of their people. Since 1947, Article 370 has given Jammu and Kashmir a semi-autonomous constitutional status.\nEarlier, under its provisions, the region had freedom in all matters except its legislature, constitution, flag and communications, foreign affairs and defence. Anger has simmered in the region and the situation, further worsened when the Modi-led regime on August 5, 2019 abrogated the special status of Jammu and Kashmir (J&K), by repealing illegal articles 370 and 35-A. The Modi-led BJP government imposed a lockdown in the occupied Kashmir, allowing Indian forces to perpetrate unspeakable crimes against the Kashmiri population, with complete impunity.\nIn Indian Illegally Occupied Jammu and Kashmir (IIOJK), the All Parties Hurriyat Conference has strongly condemned the Modi-led fascist Indian government for forcibly implementing secret and nefarious agenda of usurping all fundamental rights of the people of Kashmir, including their social, political, economic and religious rights.\nEnding this status is an attempt to usurp the rights of Kashmiri people by eradicating their fundamental rights related to their social, linguistic, cultural, economic and political existence, Mian Marghoob Ahmad, a lawmaker at Punjab Assembly told APP Sunday. With the recent abrogation of Article 370 and Article 35A, Indian parliament has maliciously allowed non-Kashmiris to resettle in Kashmir permanently, he said. Whereas actually, the Constitution of Kashmir first defines membership and then settlement. Non-Kashmiris are now allowed to buy property, keep it, and settle in Kashmir permanently.\nIt is pertinent to mention here that under the so-called constitutional changes, the existence of Gujjars (Bakarwal) in Illegally Occupied Jammu and Kashmir (IOJK), are immediately at greater risk. This Kashmiri population, occasionally and seasonally migrates with their animals to look after the animals and the land. According to the current change, regarding land as a sole property will not allow them to live on land as they have historically been doing. These changes will also be subject to population-rearrangement in Kashmir. Likewise, Kashmiris have speculated for decades that India intends to settle paramilitary families and military settlements there, as well as establishment of semi-permanent military colonies in Kashmir.\nNoted constitutional lawyer Mohsin Nawaz said that indigenous Kashmiris have long faced threats to their existence as well as their inherited rights, especially ‘relative’ land rights, as colonial relations between indigenous peoples and settler states make land encroachment profitable. This will make indigenous peoples aliens. He termed the Kashmir a largest human open jail on earth, and highlighted the latest controversy surrounding the reported extrajudicial-murders of a number of Kashmiris in the Kulgam area. Cruelty knows no bounds, and after men were being gunned down, their bodies were not returned to their families. The Indian government is losing the battle of hearts and minds in occupied Kashmir, Nawaz added.\n“The Indian occupational forces’ war crimes, state terrorism and human rights abuses had made life a nightmare for over one million oppressed Kashmiris especially women, children and senior citizens in IIOJK where life The prevailing situation in the occupied valley had become a nightmare after abolishment of its special status on August 5, he remarked.\nAll Parties Hurriyat Conference Azad Jammu and Kashmir (APHC-AJK) Convener Ghulam Muhammad Safi  said in a statement that India had imposed a military siege on some 10 million Kashmiris in IIOJK where over 900,000 Indian forces were deployed with no regards for human rights. “The Indian forces were using sexual violence, rape and molestation against women and children besides collective punishment as weapon of war in a bid to suppress the legitimate freedom movement in the held valley,” he said.\nSince 1989, he said more than 162,000 Kashmiris had been subjected to inhuman torture by Indian occupational forces, which include stripping naked, beatings with iron rods, heavy roller treatment, electrocution, hanging from ceiling, burning of the body with iron rods, solitary confinement, sleep deprivation, sexualised torture including rape, molestation and sodomy.\nWhile citing reports, he said over 100,000 Kashmiris had been killed by Indian forces since 1989 while more than 7,200 people were murdered in custody of the Indian army. Nearly 11,000 women were raped by Indian soldiers and over 110,000 children orphaned and about 23,000 women were made widows by the Indian army, Safi informed. Besides, the growing Indian atrocities in Occupied Kashmir and the August 2019 revocation have resulted in worldwide criticism against the extremist policies of Modi’s government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:22:22.153Z"
}
