{
  "title": "NPC organizes all-party round table conference on Kashmir",
  "link": "https://www.app.com.pk/national/npc-organizes-all-party-round-table-conference-on-kashmir-2/",
  "date_published": "2024-08-04T17:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):The National Press Club (NPC) here on Sunday organized an all-party round table conference titled “Five Years of Exploitation of Kashmir” as India changed the special constitutional status of Indian Illegally Occupied Jammu Kashmir (IIOJK).\nSpeaking in the conference as a chief guest, Federal Minister for Kashmir Affairs and Gilgit-Baltistan Engineer Amir Maqum said that it was the foremost responsibility of the United Nations and the Security Council to take action against India to stop gruesome human rights violation and also implement its resolution on Kashmir.\nThe minister said the atrocities against Kashmir and Palestine must be ended now, adding that a resolution will be presented in all the provincial assemblies including the National Assembly in this regard.\nHe said that Pakistan would continue support the Kashmir cause by diplomatic and politically and stood with Kashmiri people in this difficult time.\nAzad Jammu & Kashmir (AJK) former Prime Minister and President All Jammu and Kashmir Muslim Conference Sardar Ateeq Ahmad Khan said that the situation was very painful and serious for the people of IIOJK, adding that Pakistani nation’s support was a great encouragement for the Kashmiris.\nChairperson Peace and Culture Organization Mushaal Hussein Mullick said that five years had passed since the Indian initiative, during which India issued Kashmir domiciles to India for resettlement in IIOJK.\nChief of Pakistan Sweet Home Zamard Khan said that Kashmiris still want to live and die in the name of Pakistan, Pakistan’s children were with Kashmiris, on August 5. He further said that the children of Pakistan Sweet Home would take out a big rally to express solidarity with the Kashmiri people.\nKashmiri Hurriyat leader Abdul Hameed Lone, RIUJ President Tariq Ali Work, former RIUJ President Abid Abbasi, Chairperson Jammu and Kashmir Democratic Party Nabila Irshad Advocate spoke the round table conference. At the end of the ceremony members of the National Press Club (NPC) thanked the distinguished guests.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:21:46.340Z"
}
