{
  "title": "Coordination centres set up to maintain law and order during Muharram: Ashrafi",
  "link": "https://www.app.com.pk/national/coordination-centres-set-up-to-maintain-law-and-order-during-muharram-ashrafi/",
  "date_published": "2021-08-15T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Special Aide to Prime Minister on Inter-religious Harmony and Middle East, Hafiz Muhammad Tahir Mehmood Ashrafi said on Sunday that coordination centers had been set up across the country to maintain law and order situation and make effective linkage among Ulema-Mashaykh during the month of Muharramul Haram, .\nDuring a meeting with leadership of different religious schools of thought and religious scholars, he said that ideal arrangements had been made for maintaining law and order in Muharramul Haram and quick response was being made on any complaint received across the country to thwart any untoward situation.\nAshrafi also lauded the cooperation of religious scholars and leaders of all schools of thought stating that the government was grateful to the Ulema and scholars for this coordination and cooperation.\nHe said that peace and tranquility in Muharram was possible only with collective efforts of all and sundry.\nThe clerics, preachers and Zakireen must follow the Code of Conduct of Paigham-e-Pakisran, said Ashrafi, adding that religious harmony could be maintained by pursuing the philosophy, neither to leave one’s sect and nor to intervene in others beliefs.\nUlema also appreciated the arrangements and efforts made by the office of Hafiz Muhammad Tahir Mahmood Ashrafi, on the instructions of Prime Minister Imran Khan.\nThe religious scholars and Ulema-Mashaykh also announce to dissociate from those who had been involved in making sacrilegious comments, denigration and degradation of holy places.\nThe clerics also appealed the public to ensure implementation on SOPs (standard operating procedure) against Coronavirus in Majalis, processions and congregations of Muharramul Haram.\nAs far as possible, precautionary measures were being observed to ensure safety against coronavirus pandemic, he said.\nMeanwhile, talking to media persons following the meeting, Hafiz Mohammad Tahir Mahmood Ashrafi said that if what prime minister Imran Khan had said about Afghanistan in 2009 had been accepted, there would have been no bloodshed.\nPakistan was with Afghanistan and the people of Afghanistan, Ashrafi said, adding that we were facilitators of peace, not with anyone in war.\nHe said that the value of Pakistan’s army had increased after seeing the army of the Afghan government.\nThe circumstances in which the Pakistan Army had defeated the menace of extremism and terrorism was commendable, Ashrafi said.\nThe multi-billion dollar Afghan government’s army was proving to be a wall of sand.\nPakistan has brought the Afghan Taliban and the United States to the negotiating table.\nToday, Pakistan’s vision, thinking and accuracy of Pakistan’s stance had proved true before the entire world, he said.\nLeadership of different religious schools of thought and renowned scholars called on Hafiz Muhammad Tahir Mehmood Ashrafi, Chairman Pakistan Ulema Council including\nAllama Tahir-ul-Hassan,\nAllama Zubair Abid, Hafiz Kazim Raza, Allama Ghulam Akbar Saqi, Maulana Abdul Wahab Rupari, Maulana Muhammad Khan Leghari, Maulana Pir Asad Habib Shah Jamali, Maulana Aslam Siddiqui, Maulana Pir Asadullah Farooq, Maulana Tahir Aqeel Awan,\nMaulana Muhammad Ashfaq Patafi, Maulana Qari Abdul Hakim Athar, Maulana Abu Bakar Sabri, Syed Ziaullah Shah Bukhari, Maulana Mufti Zia Madni, Maulana Qasim Qasmi, Allama Zubair Abid and Pir Asad Shah Jamali.",
  "retrievedAt": "2025-08-11T21:05:15.646Z"
}
