{
  "title": "Health experts ask citizens to strictly observe Corona SOPs",
  "link": "https://www.app.com.pk/national/health-experts-ask-citizens-to-strictly-observe-corona-sops/",
  "date_published": "2021-08-15T13:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): The Ministry of National Health Services, Regulations, and Coordination on Sunday asked the citizens to strictly follow COVID-19 Standard Operating Procedures (SOPs) in offices and markets to prevent the disease in the wake of an increase in the number of delta variant cases in the country.\nAccording to an official of the ministry, people were flouting Covid standard operating procedures that are in place to control the spread of the deadly virus. He added due to negligence of citizens in the implementation of SOPS, there were reports of an increase of corona cases in cities including the federal capital.\n“COVID-19 is a deadly virus but we can control it just as we controlled it by following the SOPs during the first and second wave. The government is seeking your full cooperation in adhering to the SOPs,” the official appealed.\nHe said, “We can save precious lives including those of our near and dear ones by taking preventive measures. Wear a mask, maintain social distance, wash hands with soap frequently and avoid crowded places.”\nThe official said, “We are a strong nation and can defeat Covid-19 but for that cooperation from every citizen was imperative.\nHe said that the government was once again taking strict measures to mitigate the spread of coronavirus infection in the country. Provincial governments were following suit with health departments and administrative services enforcing necessary preventing measures at public places and encouraging people to protect themselves and others from the virus by adhering to the SOPs, he added.\nHe said that with the increase in the number of coronavirus infections, the number of patients in the hospitals has also increased. He added this has happened because we did not continue to practice SoPs.\n“We must wear a mask when going out as it reduces transmission of infection by 70 percent,” Joint Executive Director, Pakistan Institute of Medical Sciences (PIMS), Dr. Minhaj Us Siraj said.\nHe added proper hand washing with soap is very beneficial and so is social distancing. “If we continue to practice all SOPs, I assure you that we will counter the third wave of COVID-19 just as successfully as we managed the previous ones.”\n“I request people to alter their social behavior in terms of following the SOPs strictly so that neither our health system is overburdened, nor is the economic development affected.\nWe must also follow the instructions of the NCOC for avoiding mass gatherings and within our families, we must adhere to the SOPs and take special care of the elderly and those showing symptoms.”\nHe said that despite all difficulties, the first and second wave of COVID-19 was tackled by Pakistan in a very efficient manner. Responsible civic behavior of the general public made it possible and now we need the people to follow the SOPs very diligently.\n“Please ensure that you wash your hands frequently, wear the mask properly when going out, do not go out unnecessarily, and maintaining social distance with others. We need to take all possible measures to curb and curtail this disease,” Dr. Sharif Astori, a senior health expert said.\nHe said, “We managed to control the situation well, however, just as the number of cases started to decrease, we became complacent in taking precautions against the virus.”\nHe urged citizens to avoid public gatherings, wear a mask when they leave their house, including when shopping at the market and if praying at the Mosque, wash their hands with soap for 20 seconds, or with a sanitizer regularly, refrain from touching eyes, nose, mouth, and ears with unwashed hands, stay at least six feet away from other people and stay at home in case they develop COVID-19 symptoms.",
  "retrievedAt": "2025-08-11T21:05:16.030Z"
}
