{
  "title": "Waseela-e-Taleem initiative to be expanded nationwide with new stipend policy: Dr Nishtar",
  "link": "https://www.app.com.pk/national/waseela-e-taleem-initiative-to-be-expanded-nationwide-with-new-stipend-policy-dr-nishtar/",
  "date_published": "2020-11-12T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation Dr Sania Nishtar Thursday unveiled massive reforms being introduced in the Waseela-e-Taleem initiative under the umbrella of Ehsaas.\nShe said the reforms under the programme included its expansion to all the districts of the country, new stipend policy, digitized mechanism and cost-effective institutional infrastructure.\nAddressing a press conference here, she disclosed that Prime Minister Imran Khan during his visit to Balochistan on Friday would be briefed about the nationwide roll-out of Ehsaas’ Taleemi-wazaef for primary school going children under Waseela-e-Taleem programme.\nShe informed that the prime minister would join the children and their parents to witness new enrollments of deserving children in Waseela-e-Taleem.\nFollowing a briefing on the recent deep-rooted reforms introduced in the Waseela-e-Taleem under the umbrella of Ehsaas, Prime Minister would oversee details of a girl child being entered in the end-to-end digital system.\nAt the site, he would also witness the payment being made to the child’s mother, she said.\nExplaining the background, Dr Nishtar said Pakistan had been running an Education Conditional Cash Transfer for primary school going children called Waseela-e-Taleem since 2012 in selected districts.\nHowever, she said, now this programme was being expanded nationwide, representing a major quantum change.\nShe said the programme encountered a number of challenges namely high administrative cost, weak compliance monitoring system, low stipend amount and high error and fraud due to a paper-based approach.\nHowever, a comprehensive and deep-rooted reform was designed and deployed over the last year and a half, as a result of which far reaching changes had been made in the programme.\nListing the four key pillars of reforms, Dr Nishtar informed that end-to-end digitization of a number of processes was being introduced which were previously managed manually. Besides this, apps had been developed which were used by staff to register children and monitor compliance.\nShe also pointed out that the cost-effective changes in institutional infrastructure were made to expand this programme nationwide eliminating the reliance on non governmental organizations.\nDue to this, the operational cost had been reduced from eight percent to three percent.\nMentioning the third reform, she said the stipend given to the children had been modified as per Ehsaas’ new Stipend policy. the children of poorest families would now be provided conditional cash grants of Rs1,500 for boy child and Rs2,000 per quarter for girl child on attainment of 70% attendance in the school.\nFourthly, she said, the programme was being expanded to all districts of the country.\nDr Nishtar was of the view that Education Conditional Cash Transfers were an important pillar of Ehsaas and included in the Ehsaas framework as Policy #73 ‘Education Conditional Cash Transfers’.\nEducation Conditional Cash Transfers serve the dual purpose of socially assisting vulnerable households and at the same time reduce the number of out of school children, which is an important outcome for Pakistan given that there are 19.1 million out-of-school children in the country.\nThe overall budget this year was 8 billion, Dr Nishtar informed.\nAbout the Ehsaas outcomes in Balochistan, she informed that overall, under Ehsaas, there were many enhancements for south Balochistan districts of Washuk, Kharan, Chagai, Mastung, Khuzdar, Lasbela, Awaran, Panjgur, Turbat, Gwadar.\nTwo new Panagahs would be opened in two districts, one in Lasbela Industrial Zone and the other in Gwadar Economic Zone by January 31, 2021. The two new orphanages would be set up in Kharan and Turbat by December 31, 2020.\nUnder Ehsaas Amdan, two new districts of South Balochistan, Lasbela and Gwadar were being added, she said adding under Ehsaas interest free loans programme, four new districts, Gwadar, Panjgur, Awaran and Kech were being added.\nUnder Ehsaas Kafaalat, the number of beneficiaries in South Balochistan were projected to increase from currently 38,604 to 62,152 beneficiaries over the next four months, she conveyed.\nShe said Ehsaas Nashonuma programme was being introduced in Kharan and Khuzdar with registering of total 6,625 beneficiaries who would get specialized nutritious food to prevent stunting in children along with cash stipend (Rs2,000 for girl child and Rs1,500 for boy child per quarter).\nShe said under Ehsaas Undergraduate Scholarship programme, around 3,000 scholarships had been awarded to deserving and talented students of Balochistan in the year 2019-20. In Turbat district, 654 undergraduate scholarships had been awarded.\nOther than Washuk, Mastung and Kalat, the Ehsaas Survey had been completed, she said adding Ehsaas Registration desks were being set up in every tehsil after the survey to ensure that missed households could come forward and register themselves.\nShe said desks were operational in every tehsil of Turbat and were being set up in the other districts over the next three months.\nDuring the COVID-19 situation, Ehsaas Emergency Cash worth Rs2.824 billion was disbursed in 10 districts of south Balochistan among 233,254 beneficiaries, she conveyed.",
  "retrievedAt": "2025-08-11T20:00:20.891Z"
}
