{
  "title": "Maryam’s statements conspiracy to make institutions controversial: Firdous",
  "link": "https://www.app.com.pk/national/maryams-statements-conspiracy-to-make-institutions-controversial-firdous/",
  "date_published": "2020-11-12T17:31:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 12 (APP): Special Assistant to the Chief Minister (SACM) on Information Dr. Firdous Ashiq Awan on Thursday said that statements by PML-N leader Maryam Nawaz was a conspiracy to create misunderstandings among state institutions and make them controversial.\nAddressing a press conference here, she said that the so called narrative of the PML-N against the institutions had been rejected by the people of the country.\nThe SACM said the PML-N leadership including Nawaz Sharif and others had to face the law and the courts in the cases registered against them.\nNawaz Sharif should come to Pakistan and face cases using his legal rights rather giving anti-Pakistan narrative while sitting abroad, she added.\nThe opposition parties had the right to criticize the government policies but they should not indulge in weakening state institutions by giving irresponsible statements, she added.\nShe said the PTI government led by Prime Minister Imran Khan was committed to ensure rule of law in the country and it was heading with same commitment.\nDr Firdous said that development projects launched by the previous PML-N government were associated with self projection and kickbacks and the Orange Line Metro Train (OLMT) was one of them as billions of rupees were spent on this single project.\n“The hefty amount used to complete this project could be enough to establish at least 35 modern hospitals in the city”, she remarked.\nThe health sector was ignored by the past regime as they could not made medical facility available during their tenure to provide treatment to themselves, she said.\nThe PTI was first ever government which protected the public money and completed OLMT rather cornering it like past practices, she added.",
  "retrievedAt": "2025-08-11T20:00:18.658Z"
}
