{
  "title": "Opposition deprived GB people from constitutional rights to appease India: Gandapur",
  "link": "https://www.app.com.pk/national/opposition-deprived-gb-people-from-constitutional-rights-to-appease-india-gandapur/",
  "date_published": "2020-11-12T13:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Minister for Kashmir Affairs Ali Amin Gandapur Thursday said the opposition parties deliberately deprived the people of Gilgit Baltistan of their constitutional rights to appease India.\nAddressing a public meeting at Roundu, he said the government decided to change GB status four months ago but the decision was delayed due to resistance from opposition parties.\nAmin criticized the leaders of opposition parties for their double standards and boycotting the meeting called by National Assembly Speaker Asad Qaiser for discussing the matter regarding change in the GB status.\nHe criticized them for attacking national institutions, which had been rendering great sacrifices to protect the motherland from enemies.\nThe minister urged the GB people to use their ‘right to vote’ for their future generations and elect Pakistan Tehreek-e-Insaf for the development in the area.\nHe said Prime Minister Imran Khan was the first leader in history who had the courage to speak against Islamophobia and Indian subjugation in IIOJK at world fora.\n“Pakistan will never get a leader like Prime Minister Imran Khan who has compassion for poor segments of the society and determined to transform the country into Medina like state,” he remarked.\nAmin paid tribute to the sacrifices by the ancestors of GB people for their Independence, regretting that the past governments failed to provide basic rights to the people of GB despite governing the area.\nHe said the PTI government had restore wheat quota for GB people, adding that the opposition parties had filed a petition in the Election Commission of Pakistan the other day for disrupting supply of wheat in the area.\nThe minister said opposition parties had admitted their defeat even prior to the elections.",
  "retrievedAt": "2025-08-11T20:00:22.538Z"
}
