{
  "title": "Masood Khan urges youth to highlight Kashmir issue on a global scale.",
  "link": "https://www.app.com.pk/national/masood-khan-urges-youth-to-highlight-kashmir-issue-on-a-global-scale/",
  "date_published": "2020-11-12T18:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP): President Azad Jammu and Kashmir Sardar Masood Khan has urged the youth to reach out their peers around the world and effectively highlight the Kashmir issue to garner global support for the just cause of Kashmiri people.\nHe said that our youth is the future of the country and they should utilise their strengths in making Pakistan a strong nation. In the coming decades we must strive to make Pakistan the top 10 economies of the world.\nThe President made these remarks while speaking to members of a delegation representing Global Youth Association (GYA), belonging to leading universities of Islamabad and Rawalpindi.\nThe delegation was led by Kashif Zaheer Kamboh, Chairman GYA and Ms. Maria Mahtab, Central Female Lead GYA. Also present were Mr. Abdul Qadeer President GYA; and Mr. Muhammad Mukarram, Vice President GYA, among others.\nKamboh while apprising the President AJK about the various activities of GYA, said that their organisation is working closely with the youth and is engaging the general public and international civil society on the issue of Kashmir.\nSince the formation of GYA, they have held numerous workshops, conferences and seminars on Kashmir in universities throughout Pakistan.\nChairman GYA informed that they have been collaborating with youth organisations in Bangladesh to promote the true narrative on Kashmir.\nDue to their efforts, the media in Bangladesh had also published stories and articles on the factual situation in Kashmir. He also informed that they have prepared a database of leading political leaders and academics residing in OIC countries.\nRelevant information in connection to Kashmir and even the new map of Pakistan has been shared with the request that this information may be shared with their peers around the globe.\nThe AJK President commended the efforts and initiatives of GYA for sharply focusing on the Kashmir issue. GYA is one of the few organisations working towards building a global network and is helping shape the narrative of Kashmir by engaging opinion-makers and persons of influence.\nWorking closely with their peers in Bangladesh will not only help in sensitising the people on Kashmir but will also bring the peoples of the two countries closer to each other.\nMasood Khan said that Pakistan as a state is incomplete without Kashmir and the occupation of one part of Jammu and Kashmir is itself a declaration of war on Pakistan by India.\nGrave human rights violations are taking place in Indian Occupied Jammu and Kashmir and it is our core responsibility to liberate our brothers and sisters from the illegal occupation of India.\n“India has vowed to disintegrate Pakistan. We will unite and face this threat as one nation”, he said.\nThe President urged the youth to remain motivated and help economically make Pakistan stronger.\nWe should aim for excellence in our endeavours. He added that by following the teaching of the Holy Qur’an and the Holy Prophet (PBUH) we should strive towards character building and inculcating traits like honesty, sincerity and tolerance.\n“Be honest, passionate and sincere in your dealings. This is what our religion teaches us”, he advised.\nThe delegation also invited the President to an interfaith harmony and peace conference, soon to be organised by GYA.",
  "retrievedAt": "2025-08-11T20:00:18.643Z"
}
