{
  "title": "Pakistan’s textile hub revives as 50k shut power looms become operational",
  "link": "https://www.app.com.pk/national/pakistans-textile-hub-revives-as-50k-shut-power-looms-become-operational/",
  "date_published": "2020-11-12T09:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP): Faisalabad is currently experiencing a financial boom with operationalization of 50,000 power looms and expecting the opening of another 30,000 units.\nKnown as the country’s textile hub, Faisalabad for the first time after 1990, has seen a massive economic growth following a high demand of export items and the government’s recently announced incentive of electricity supply for industrial sector at reduced rates.\nPrime Minister Imran Khan in a tweet on Thursday shared a television news report about the increased economic activity in Faisalabad and the resultant shortage of 0.2 million labourers required to meet the high demand of orders in textile sector.\nMashaAllah the country is moving in the right direction despite the Covid 19 challenge. pic.twitter.com/xPhB9LEleY\n— Imran Khan (@ImranKhanPTI) November 12, 2020\nFactories and power looms in the past faced closure owing to power crisis as emerged due to apathy of previous governments. However, during the corona virus situation, Pakistan witnessed orders in textile sector diverted towards it from various countries.\nThe news report mentioned that Faisalabad had overall 1.3 million workers with one million natives and 0.3 million belonging to other districts.\nBloomberg in its recent report ‘Opening early helped Pakistan boost exports during pandemic’ also mentioned a surge in Pakistan’s textile exports.\n“Pakistan has seen orders shifting from multiple nations including China, India and Bangladesh,” said Shahid Sattar, secretary general at the All Pakistan Textile Mills Association, as quoted by Bloomberg.\n“Garment manufacturers are operating near maximum capacity and many can’t take any orders for the next six months,” he said.\nPakistan’s decision to loosen pandemic restrictions early, has helped the nation’s exports emerge stronger than its South Asian peers.\nThe Bloomberg said outbound shipments of Pakistan grew at a faster pace than Bangladesh and India as textiles, which account for half of the total export.\nIslamabad saw total shipments grow 7% in September, compared with New Delhi’s 6% and Dhaka’s 3.5%, it said.",
  "retrievedAt": "2025-08-11T20:00:25.867Z"
}
