{
  "title": "Rich tributes paid to Burhan Wani on his martyrdom anniversary",
  "link": "https://www.app.com.pk/national/rich-tributes-paid-to-burhan-wani-on-his-martyrdom-anniversary/",
  "date_published": "2021-07-09T07:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 9 (APP):Speakers at a seminar, organized to mark the 5th martyrdom anniversary of Kashmiri Youth leader Burhan Muzaffar Wani, paid rich tributes to the martyr, who became role-model for Kashmiri youth to fight against Indian occupation.\nThe conference was organized by Institute of Multi- Track Dialogue, Development and Diplomatic Studies in Muzaffarabad with an objective to educate youth of Azad Kashmir about the heroic efforts of the martyred youth leader, according to press statement issued here.\nBurhan Wani was martyred by Indian occupation forces on July 8, 2016 along with his associates in South Kashmir.\nKashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK), Azad Jammu and Kashmir, Pakistan and abroad observed July 8 as Resistance Day to pay tribute to martyrs; reiterate their commitment for continuing freedom struggle; and remind the world of its promises made to Kashmiris.\nAmong others, the seminar was addressed by Liberation cell Director Raja Sajad, Youth leader Raja Basit Ali, General Secretary Scholars foundation, Miss Samara Siduque and Kashmiri Scholar Dr Waleed Rasool.\nThe speakers said that martyrdom of Burhan Wani injected new spirit in Kashmiris’ struggle for freedom against Indian occupation as was evident from the post-Burhan martyrdom developments in IIOJK. They said, Burhan transferred the resistance movement to 4th generation of Kashmir.\nSpeaking on the occasion, Dr Waleed said that youth could play an important role in struggle against Indian occupation by following Burhan Wani.\nHe said that the youth should follow Burhan Wani in positively utilizing social media for promoting the just cause of struggle against Indian occupation and get Kashmir issue highlighted through different social media platforms.",
  "retrievedAt": "2025-08-11T20:57:09.047Z"
}
