{
  "title": "National Minerals Data Centre being established for investors’ facilitation, projects’ planning",
  "link": "https://www.app.com.pk/national/national-minerals-data-centre-being-established-for-investors-facilitation-projects-planning/",
  "date_published": "2021-07-09T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 9 (APP): The Petroleum Division, during the current fiscal year, would initiate a new project to compile the data of available minerals for facilitation of investors and future projects’ planning in the country.\nThe two-year project, titled National Minerals Data Centre (NMDC), is a joint venture of Petroleum and Planning Divisions that would be carried out at a total cost of Rs 295 million in consultation with all Provincial Mines & Minerals Departments including of Gilgit-Baltistan, Azad Jammu and Kashmir and Geological Survey of Pakistan.\n“Pakistan has world-class minerals’ resource potential but contribution in the national GDP is <1% which is considerably below the global average of 2-8% of GDP primarily due to non-availability of integrated geological, regulatory and other relevant data that is the basic requirement for investment facilitation and projects’ planning,” according to an official document available with APP.\nThe government has allocated funds amounting to Rs 263 million under the Public Sector Development Programme 2021-22 to start the NMDC project.\nUnder the project, Geographic Information System (GIS)- based integrated solutions and application development would be developed to ensure availability of online geo-spatial data and maps for investment facilitation and benefit of the stakeholders in the minerals sector.\nThe NMDC would contain information such as geological and geochemical maps, minerals sample analysis reports, airborne geophysical maps, areas granted and applied for mineral titles, roads and rails layers, geographical borderlines (province, district and town), reserves areas like ‘strategic, forest and religious places.’\nThe compiled data would be categorized for publication through web-portal as per guidelines issued by the government.\n“The exercise will be a regular activity and information will be updated accordingly.”",
  "retrievedAt": "2025-08-11T20:57:06.536Z"
}
