{
  "title": "Rs 17bln disbursed among 14,000 entrepreneurs under YES: Farrukh Habib",
  "link": "https://www.app.com.pk/national/rs-17bln-disbursed-among-14000-entrepreneurs-under-yes-farrukh-habib/",
  "date_published": "2021-07-09T10:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 9 (APP): Minister of State for Information and Broadcasting Farrukh Habib said on Friday that the government had so far disbursed soft loans amounting to Rs 17 billion among more than 14,000 young entrepreneurs under the Youth Entrepreneurship Scheme (YES) of Kamyab Jawan Programme (KJP).\nAddressing the second batch of KJP’s National Youth Council (NYC), he said the Prime Minister’s Kamyab Jawan Programme had marked a new era of entrepreneurship in the country, creating massive job opportunities for the country’s youth.\nFarrukh said it was heartening to see that out of the total disbursement, most of the loans were given without any collateral which reflected the Prime Minister’s confidence in the country’s youth.\n“A major chunk of total disbursement went to those who were unable to materialize their ideas and dreams due to financial constraints,” the minister remarked while pointing out the government’s recent decision of increasing upper limit for first tier of YES from Rs one million to two million.\nHe said at least 170,000 skill scholarships were provided to the youth across the country. It would eventually transform the youth bulge into job creators, he added.\nFarrukh appreciated Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar for implementing the KJP in a transparent manner, adding the programme was playing crucial role in making the youth financially independent and empowered.\nHe mentioned the government’s newly launched ‘Kamyab Pakistan’ programme which, according to him, aimed at steering upto six million families out of poverty. “Health card is another flagship initiative of the PTI (Pakistan Tehreek-e-Insaf) government which is meant to provide universal health insurance in Pakistan,” he added.\nThe minister said the government had successfully pull the country out of challenges left by the previous governments, adding “Now we (country) are in a take off position as our economy is set to become export oriented , while the country is moving towards food security through agriculture sector’s uplift.”\nHe said the government was focusing on those imports which could enhance production and prove productive so as to ease pressure on the rupee.\nFarrukh said the government, under the leadership of Prime Minister Imran Khan, was spending tax payers’ money with extra care to ensure economic growth in the country.\nComparing previous rulers’ junkets with Prime Minister Imran Khan’s official trip in the recent past, he said cost of the PM’s visit to Afghanistan was only $9,600 while the past rulers like Nawaz Sharif and Asif Zardari spent upto $60,000 for the same.\nAdding further, he said the prime minister made visit to America in just $67,000, whereas the past rulers did that in upto $700,000.\nHe said PM Imran Khan saved over one billion rupee out of the total over Rs 3 billion budget approved for the prime minister’s house.\nHe asked the NYC members to take inspiration from Prime Minister (PM) Imran Khan who came into the power through genuine political struggle spanning over 22 years.\nThe minister said the NYC was a platform for the youth where they could turn their dreams into the reality.\n“There is a need to expand the NYC network so that more talented youth could become the part of decision making process in the country,” he added.",
  "retrievedAt": "2025-08-11T20:57:06.529Z"
}
