{
  "title": "Envoy lauds Canadian Pakistani community, MPs role to strengthen bilateral ties",
  "link": "https://www.app.com.pk/national/envoy-lauds-canadian-pakistani-community-mps-role-to-strengthen-bilateral-ties/",
  "date_published": "2021-07-09T16:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 9 (APP): Pakistan High Commissioner to Canada Raza Bashir Tarar lauded the role of Canadian Pakistani community and their young and enterprising parliamentarians in promoting understanding and strengthening bilateral ties between Pakistan and Canada.\n“The Canadian Pakistani community and their young representatives in the Parliament are a testimony of how a community can be a voice of reason and strength in creating understating and harmony in bilateral relations between two countries,” he said while talking to a large group of Canadian Pakistanis who attended a Zoom session with him and his wife ahead of his return to Pakistan after completion of a successful term in Canada.\nThe event was hosted by Canada Pakistan Affiliated Chamber of Trade (CPACT) led by its founder Hayee Bokhari, Chairman Nasir Malik, Co-Chairman Zaheer Khan, President Uzma Khan, Vice President Iftikhar Mirza, Treasurer Amin Akhai and Secretary Iffat Kazmi.\nA large number of noted Canadian Pakistanis including MP Salma Zahid, MP Iqra Khalid, MP Sameer Zuberi, MP Marie France Lalonde, MP Chandra Arya, Ottawa Councilor Eli El Chantiry and others attended the session and expressed candid views about the legacy and work of High Commissioner Raza Bashir Tarar during his posting.\nThe high commissioner thanked the organizers and the participants for arranging the event and told them how he always looked up to the Canadian Pakistani community as a reservoir of strength and support in building bridges between Pakistan and Canada.\nHe said the recent London Ontario tragedy showed the Canadian Pakistani community could rise to any occasion with the support of Canadian government and people and continue to play its role as a caring and engaged community in the Canadian system.\nThe envoy urged the Canadian Pakistani community to remain engaged, promote linkages and build bridges by promoting tourism, trade and business collaborations between both the countries.\nHe urged the community to stand behind their elected representatives and work as human family rising above prejudices and differences and realizing that we all had to live in the same planet and had to protect it from common dangers like climate change and hateful ideologies.\nEarlier, MP Iqra Khalid lauded High Commissioner Raza Bashir Tarar for uniting the community and building on trade and cultural links and people-to people contacts.\nMP Salma Zahid thanked the high commissioner for serving the community through various initiatives such as virtual public forums and e-katcheries despite the limitations of COVID-19 to reach out to the community.\nMP Marie France Lalonde applauded Raza Bashir Tarar for demonstrating during his tenure in Canada the importance of engaging on key questions with the international community and strengthening partnership and collaboration between Canada and Pakistan through his legacy of cooperation, peace and friendship.\nMP Sameer Zuberi paid tributes to High Commissioner Raza Bashir for his excellent diplomacy and best representation of Pakistan and its interests in Canada which made every Canadian Pakistani proud of him.\nMP Chandra Arya highlighted and praised the High Commissioner’s role in having Pakistan included in Student Direct Stream, open only to seven countries so far, to allow Pakistani students quick time in visa processing to fly to Canada to pursue higher education.",
  "retrievedAt": "2025-08-11T20:57:11.856Z"
}
