{
  "title": "NAB’s effective anti-corruption strategy starts yielding results: NAB Chairman",
  "link": "https://www.app.com.pk/national/nabs-effective-anti-corruption-strategy-starts-yielding-results-nab-chairman/",
  "date_published": "2021-07-09T07:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 09 (APP): National Accountability Bureau (NAB) Chairman Justice (Retd) Javed Iqbal said after assuming the charge of coveted post, an effective anti-corruption strategy comprising Awareness, Prevention and Enforcement was chalked out to revamp the anti graft watchdog.\nChairing a meeting to review overall performance of NAB at NAB Headquarters, he said NAB’s anti-corruption strategy has proved very successful and started yielding excellent results.\nDuring the meeting, briefing was given on the overall progress of NAB, especially initiatives taken during the present management of NAB.\nThe meeting was informed that NAB during the present management of NAB has recovered Rs 533 billion directly and indirectly which is considered as record achievement with overall convictions of 66 percent.\nNAB’s anti-corruption strategy for eradication of corruption has been acknowledged by national and international organizations like Transparency International, World Economic Forum, PILDAT and Mishal Pakistan.\nIt was informed that NAB had been established in 1999 and assigned with the responsibility of eradication of corruption and recovery of looted money from corrupt elements.\nSince its inception, NAB has recovered Rs. 814 billion directly and indirectly. Presently, there are 1,273 references under trial in respected accountability courts throughout the court and their total worth is about Rs 1,305 billion.\nAs per Gilani and Gallup survey, 59 percent people have shown trust in NAB.\nThe year 2017 was the year of rejuvenation of NAB in which many initiatives were taken on the direction of NAB chairman to  pursue corruption cases on merit without any fear and favor under the enforcement strategy, which proved very successful in 2018, 2019 and 2020.\nDue to this reason, the present management of NAB has decided to continue NAB’s enforcement strategy in 2021. The salient features of NAB enforcement strategy are included.\nNAB operations start its functioning about an alleged act of corruption & corrupt practices as defined under section 9. The process initiated with verification of the contents of the complaint received and the applicability of the provisions of law.\nThis process is called complaint verification (CV) wherein the complainant is called for confirming the status and evidence available with him. Once it is determined that the alleged offence falls under NAO and available material justifies for further process, the same is processed for subsequent action.\nIn the second step, inquiry under section 18 of the NAO is authorized to confirm the committal of offence and collection of evidence to identify the alleged person(s) involved. The record / evidence collection process is supplemented with recording of statements of witnesses and accused persons.\nThis whole process is completed after due deliberations at each level by giving consideration to the role of Combined Investigation Teams (CITs) and in the Regional Executive Board Meetings (RBMs).\nNAB has itself devised to rationalize the workload and timelines have been prescribed for efficient, effective and expeditious disposal of cases putting a maximum limit of 10 months- from complaint verification-to-inquiry-to-investigation and finally to a reference in the Accountability Court.\nIn order to ensure uniformity and standardization, the standard operating procedures (SOPs) for investigation officers (IOs) in vogue were reviewed and revised in order to benefit from the experience and collective wisdom of senior supervisory officers, a system of CIT comprising of director, additional director, investigation officer and a senior legal counsel has been put in place.\nThis is not only lending quality to the work but also ensures that no single individual can influence the proceedings. The implementation of enforcement measures and prosecution matters are being monitored in NAB through daily, weekly and monthly reports and inspections.\nOnce a criminal case is established and the accused is unable to return the ill gotten / pecuniary resources, inquiry is converted into investigation under section 18 (C) to finalize the collection of evidence for filing of reference in the respective accountability court and to prosecute him with the objective of conviction and confiscation of proceeds of crime under Section 16 (a) of NAB Ordinance, 1999.\nDuring the investigation, the accused is provided an opportunity to confront the evidence collected. The accused has the option of plea bargain (PB) at this stage to return the illegal gain to avoid trials and imprisonment. In any case the disposal of this stage is referred to the Court for final approval under Section 25 (B) of NAO, 1999.\nThe enforcement strategy of NAB starts with soft initiative of fact finding without blaming any person for an alleged act of corruption and corrupt practices. The process moves with simple explanations from the complainant to clarify the charges against the accused and to confirm his position with material evidence if any.\nOn the other hand during inquiry, the collection of evidence viz.a.viz the allegations are verified with the explanations given by the accused person and statements recorded from the witnesses.\nIf the stated version of the accused is found implausible, the matter moves for an option of accepting guilt and offering for voluntary return of assets or gain acquired as a consequence of an offence committed under NAO.\nThe tougher stage approached when after finalization of investigation the trial proceedings initiated and the accused persons are facing for charges of corruption and corrupt practices framed by the accountability court and where possible conviction which may extend to fourteen years rigorous imprisonment (RI) with fine and or confiscation of assets and properties in the name of accused or his family members.\nThe operational arms of NAB are its regional bureaus which are involved in field operations i.e. conduct of CVs, inquiries, investigations, prosecution of cases at trial and appellate stages.\nThe operations Division and Prosecution Division at NAB Headquarter are providing all support for smooth conduct of operational activities in accordance with law and the standard operating procedures (SOPs).\nThe operational methodology is the guiding principles of NAB’s anti-corruption strategy which provide for effective monitoring and accountability within the organization.\nThe operational decision making is passed through a consultative process, called the Executive Board Meetings (EBMs) participated by the senior officers at NAB Headquarter and NAB’s Regional Bureaus via video links.\nThe matters concerning placement on Exit Control List (ECL), issuance of Red Notices against absconding accused, requests for Mutual Legal Assistance from foreign jurisdictions and extradition of fugitives from law are done as per law.",
  "retrievedAt": "2025-08-11T20:57:08.822Z"
}
