{
  "title": "Pakistan’s Floods; death toll touched 1,545, injured 12,860: NDMA",
  "link": "https://www.app.com.pk/national/pakistans-floods-death-toll-touched-1545-injured-12860-ndma/",
  "date_published": "2022-09-19T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): The total death toll due to devastating monsoon floods across the country on Monday was reported as 1,545 amid property losses whereas no one perished in the past 24 hours.\nMoreover, 12,860 individuals were reported injured since the onset of the rainy season.\nThe National Disaster Management Authority (NDMA) issued a 24-hour situation report released on routine basis that accounted overall life, property and infrastructure losses due to the heavy rains which lashed out various parts of the country.\nThe water inundation in many areas due to heavy rains and flash floods caused damage to 14,384 houses and killed 15,910 livestock animals in the flood-hit areas including 3,714 fully damaged and 10,670 got partially damaged during rains.\nHowever the cumulative damages so far stated that almost 12,716 km road, 374 bridges and 19,58,362 houses got damaged and 959,819 livestock animals got killed due to the heavy rains in various districts of all the provinces including that of Gilgit Baltistan and Azad Jammu and Kashmir (AJK).\nThe NDMA report highlighted that 81 districts across the country were notified as calamity hit areas with some 33,046,329 people affected, 179,281 individuals rescued in various rescue operations and 546,288 people inhabited in camps.\nThe joint surveys for damage assessment were started in 30 districts of Balochistan and some 32 teams were deployed for the survey that was likely to be completed by September 25.\nIn GB, six teams were deployed in the region that started the survey from September 12 and was expected to complete by September 20.\nIn Punjab, three survey teams were deployed in the field that initiated the survey from September 12 and was expected to complete by September 30. In KP, some six teams were on the ground to initiate the survey that commenced on September 15 and would be completed by October 15.\nIn Sindh, the survey would commence as soon as practically possible and was expected to commence from September 25.",
  "retrievedAt": "2025-08-11T15:36:16.507Z"
}
