{
  "title": "Opposition parties to be responsible if virus spread due to public gathering: Balochistan CM",
  "link": "https://www.app.com.pk/national/opposition-parties-to-be-responsible-if-virus-spread-due-to-public-gathering-balochistan-cm/",
  "date_published": "2020-10-05T10:24:00.000Z",
  "source": "APP",
  "content": "QUETTA, Oct 05 (APP):Balochistan Chief Minister Jam Kamal Khan Alyani Monday said the opposition parties would be responsible for the rise in the COVID-19 cases as public gathering could cause spread of the virus.\n“Change of date for holding rally by the opposition parties is evident from the fact that people don’t trust them and they have no justification for holding this political gathering aimed at hamper the development process going on in Balochsitan,” he said while addressing a press conference at Chief Minister Secretariat.\nBalochistan ministers including Home Minister Zia Langov, Mohammad Kha Lehri, were also present.\nThe chief minister in strong terms opposed the proposed opposition’s political gathering in Quetta said it was against the development process underway in the province.\n“Political gathering by the opposition parties in Quetta would be a great risk in the wake of COVID-19’s second wave in Balochistan,” he said.\n“Opposition parties are jealous with the performance of the incumbent government and feared that due to its excellent performance, they will not be voted in the next general elections.”\nHe said none of the government had paid due attention on the just issues of Balochistan. “First time in the history of the country, Prime Minister Imran Khan led federal government has taken historic measures for the uplift of the people of Balochsitan,” he said.\nHe said the completion of ongoing projects would user a new era in the development and prosperity of the province.\nChief Minister Jam Kamal said the opposition parties did not bother when the people were in trouble due to natural calamities but now they were intending to demonstrate power show in the province for their personal gains.",
  "retrievedAt": "2025-08-11T19:52:19.836Z"
}
