{
  "title": "AJK liberated to become part of Pakistan, not India: Masood",
  "link": "https://www.app.com.pk/national/ajk-liberated-to-become-part-of-pakistan-not-india-masood/",
  "date_published": "2020-10-05T12:59:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Oct 05 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan on Monday said the Kashmiri elders had liberated the Azad Kashmir not to incorporate it into India or create a sovereign state but to make it part of Pakistan in the light of the decision taken at the residence of Sardar Mohammad Ibrahim Khan in Srinagar on July 19, 1947.\nThe brunt of the political blunder committed by Sheikh Mohammad Abdullah and Maharaja Hari Singh shouting the slogan of sovereign Kashmir in 1947 was still being borne by the people in Occupied Jammu and Kashmir in the shape of cruel Indian subjugation, he said while speaking at a function held here to pay homage to martyrs of Thorar.\nSardar Masood advised the youth to follow the role their elders had played in Thorar, Mang and other areas of AJK for the cause of liberation from the Indian shackles.\nHe said the youth needed to offer stiff resistance to the Hindutva philosophy as that doctrine would not remain confined to mere India and occupied Kashmir, but would also engulf the whole region.\nUnder the doctrine, he added, India had already settled 1.8 million Indian Hindus in the occupied Kashmir during the last few months, and now its followers were publicly threatening to eliminate Pakistan and Azad Kashmir.\nThe AJK president said the Indian rulers considered a nuclear Pakistan as the biggest hurdle in the way of their hegemonic and nefarious designs. Therefore, the youth of Azad Kashmir should prepare themselves to not only divert the tide of the wave of Hindutva but also pledge to defeat it, he stressed.\nReferring to the latest situation of occupied Kashmir, Sardar Masood said the Kashmiris were the most valiant nation in the world, and they were fighting one million regular Indian troops. Despite suffering repression, they had been fighting the Indian occupation forces for the last 72 years.\nSimilarly, he said, some 600,000 people of 18,000 families of Azad Kashmir living along the Line of Control were also offering sacrifices on the daily basis while the AJK youth and officials, who were part of the armed forces of Pakistan, were sacrificing their lives for the defence of Pakistan and Azad Kashmir.\nNo one could say that the Kashmiri nation was inactive or had succumbed to the Indian might, he added.",
  "retrievedAt": "2025-08-11T19:52:15.747Z"
}
