{
  "title": "Around 39 million children vaccinated in five-day polio immunization drive",
  "link": "https://www.app.com.pk/national/around-39-million-children-vaccinated-in-five-day-polio-immunization-drive/",
  "date_published": "2020-10-05T10:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): An estimated 39 million children have been immunized against poliomyelitis during five-day nationwide vaccination campaign concluded on September 25.\nAccording to an official of Pakistan Polio Eradication, the nationwide campaign was implemented by a workforce of almost 270,000 frontline workers who carried out door-to-door vaccination of children under the age of five.\nHe said that this was the first nationwide campaign since February due to a four-month suspension on supplementary immunization activities during the COVID-19 outbreak in Pakistan.\nHe said that the campaign was inaugurated by provincial and district leadership across the country, while the Pakistan armed forces, members of medical associations, prominent religious leaders, celebrities, activists and leadership from across the political spectrum came forward to support the campaign.\nCommenting on the results of September campaign, Dr Faisal Sultan, the Special Assistant to the Prime Minister on National Health Services said that it was very encouraging to see all Pakistanis, from all walks of life, showing such great support for this national cause.\n“With such level of commitment, I am confident that we are going in the right direction. We have to ensure that no child is missed during these nationwide vaccination campaigns in order to protect them against the crippling polio disease.”\nAs with smaller campaigns held in July and August, frontline workers were trained on COVID-19 preventive measures, such as hand washing, the proper use of face masks and maintaining a safe distance from others especially children during door-to-door visits.\nMoreover, the programme implemented strict measures for its field staff as per the Government of Pakistan’s set guidelines on COVID-19 prevention, he added.\nData from campaigns conducted between July to September show that vaccination teams have improved their outreach in each subsequent campaign. This means more children across the country were being administered the polio vaccine and building the necessary immunity against the polio virus.\n“With each campaign we have launched since July, our frontline workers have done an exceptional job at reaching vulnerable children with the polio vaccine.\nThis would not have been possible, however, without the cooperation of concerned parents and caregivers across the country,” said Dr. Rana Muhammad Safdar, Coordinator of the National Emergency Operations Centre of the Pakistan Polio Eradication program.\n“Essential immunization also needs to be strengthened to facilitate the interruption of all poliovirus transmission, and hence, the program is focused on prioritizing essential immunization as part of the national agenda alongside upcoming door-to-door vaccination campaigns,” Dr. Safdar further highlighted.\nTo do this, the Expanded Program on Immunization (EPI) has simultaneously been conducting targeted outreach activities to ensure that children are receiving essential immunization.\nAbout 8,150 vaccination teams have been deployed across the country in order to conduct these outreach activities with communities. From January to August, around 13.6 million vaccine doses had been administered to children. Meanwhile, approximately 699,762 zero dose children, or children who had never received routine immunization, had also been identified and vaccinated.",
  "retrievedAt": "2025-08-11T19:52:19.869Z"
}
