{
  "title": "Meeting reviews preparations for upcoming JCC meeting of CPEC",
  "link": "https://www.app.com.pk/national/meeting-reviews-preparations-for-upcoming-jcc-meeting-of-cpec/",
  "date_published": "2020-10-05T13:03:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 05 (APP): A meeting to review preparations for the upcoming 10th Joint Cooperation Committee (JCC) meeting of China Pakistan Economic Corridor (CPEC) was held at Chief Minister’s Secretariat here Monday with Chief Minister Khyber Pakhtunkhwa Mahmood Khan in the chair.\nThe meeting was also attended by the Chairman CPEC Authority Lft. General (Rtd) Asim Saleem Bajwa.\nThe meeting discussed in detail the proposed mega projects of Khyber Pakhtunkhwa in energy & power, tourism, agriculture, road, industry and social sectors to be presented to the 10th JCC meeting for consideration.\nThese proposed projects include Peshawar to D.I.Khan Motorway, Chashma Right Bank Canal, Swat Expressway Phase 2, Dir Expressway, Chakdara to Chitral Expressway, Chitral to Shandoor Road, Kumrat Cable Car, Peshawar Circular Rail, Daraban Economic Zone, Mori Kari Hydel Power Project, 500 KV transmission line from Chital to Chakdara etc.\nOn this occasion, it was informed that all the necessary arrangements had been completed for the ground breaking of Rashakai Economic Zone under CPEC, and so far 700 applications have been received for setting up industries in the said economic zone.\nTalking on the occasion, the Chief Minister said that province government, through its wheeling system, was working to provide its own generated electricity to the local industries on incentivized rates to boost industries in the province with the aim to promote economic activities and generate maximum employment opportunities in the province.\nHe termed the Rashakai Economic Zone as a flagship project of the present government and said that with the establishment of Rashakai Economic Zone, a new era of industrial development will usher in the province. He said that Prime Minister Imran Khan will perform ground breaking ceremony of the project soon.\nChairman, CPEC Authority Asim Saleem Bajwa said that beside, projects of energy, industry, road and tourism sectors mega projects for the development agricultural sector in the province would also be proposed in the 10th JCC meeting for consideration so that the province could be made self sufficient in agricultural products.",
  "retrievedAt": "2025-08-11T19:52:22.868Z"
}
