{
  "title": "Shehryar, Ijaz Shah discuss crackdown on law violators with Usman Buzdar",
  "link": "https://www.app.com.pk/national/shehryar-ijaz-shah-discuss-crackdown-on-law-violators-with-usman-buzdar/",
  "date_published": "2020-10-05T10:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 05 (APP): Chairman Kashmir Committee Shehryar Khan Afridi and Federal Interior Minister Brig (retd) Ijaz Shah called on Punjab Chief Minister Sardar Usman Buzdar at his office on Monday.\nThey condemned nefarious attempts to malign the state institutions and expressed the commitment to counter every conspiracy against the state institutions, said a handout issued here.\nThe meeting decided an indiscriminate crackdown on violators of the law and the CM reiterated that the government would go to every extent to ensure the rule of law. Every possible step would be taken to protect the life and property of people, he added.\nSome elements were targeting institutions under a specific agenda and propaganda against the institutions was deplorable as well as condemnable as the country was facing numerous challenges, he emphasized.\nNo one would be allowed to take the law into his hands and the government would continue to stand firmly with the state institutions, he added.\nThe interior minister said that there was no justification for criticism of the institutions by some elements, adding that the specific agenda of the opposition, aimed at making the institutions controversial, had been exposed.\nThe opposition was bent upon defaming the country through its anti-Pakistan narrative, he deplored.\nLegal action would be initiated against those levelling accusations against the institutions, he added.\nChairman Kashmir Committee Shehryar Afridi said that those accusing institutions were not well-wishers of the country and the opposition was trying to finagle its wicked designs by making the institutions debatable.\nMaking of institutions controversial by those engaged in negative politics was equivalent to enmity with the country, he added.\nPunjab Law Minister Raja Basharat, Chief Secretary, IG Police, Additional Chief Secretary (Home), and others attended the meeting.",
  "retrievedAt": "2025-08-11T19:52:16.540Z"
}
