{
  "title": "Business community demands interim provincial status of GB",
  "link": "https://www.app.com.pk/national/business-community-demands-interim-provincial-status-of-gb/",
  "date_published": "2020-10-05T10:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): The Business community of Gilgit- Baltistan (GB) including federation and local chambers on Monday demanded for interim provincial status to the GB region for resolving the identity issue of the people to protect their constitutional rights.\nThe local chambers of commerce requested the federal government to protect the constitutional right of the people of GB by resolving the issue of identity and to give them constitutional autonomy for development and prosperity in the region.\nThe Interim Minister for Excise and Taxation of GB and Vice President of Federation Pakistan Chamber of Commerce and Industry (FPPCI) Muhammad Ali Quaid said this addressing a press conference along with business leader of Gilgit Baltistan (GB) including Ex.President Gilgit Chamber of Commerce and Industry, Qurban Ali and Interim Minister for Law and Parliamentary Affairs Yaseen Baltistani advocate here in National Press Club Islamabad.\nVice President FPCCI Muhammad Ali Quaid said that Gilgit Baltistan have huge potential in tourism industry, live stock and agriculture.\n“We need interim provincial status for increasing business activity and investment in the region.” said Ali Quaid.\nHe said that GB region has a huge potential to generate 50,000 MG hydro-electric power energy, which will not just help local industries but also will provide energy to other major industrial centers in the country.\nThe senior business leader said that after achieving the constitutional status through interim province status investment in different potential sectors including tourism and power sector expected for industrial growth in GB region.\nHe said that GB region is considered a gateway for the game changer mega project of China Pakistan Economic Corridor (CPEC) and current constitutional status of the region must need to be changed to get more benefit from this mega project.\nFormer President Gilgit Chamber of Commerce and Industry, Qurban Ali on the occasion said the people of GB has fought for the independence of the country and willingly joined Pakistan.\n“We are always supporting and standing alert behind the Armed force of Pakistan for protecting the sovereignty of the nation.” said Qurban Ali.\nHe said that the GB region has huge Geo- strategic importance and has connected with China and energy rich Central Asian States to provide economic integration to the country with these potential countries.\nHe said that there is a huge need for political , economic and social stability in the country and people of GB region want to play their due role in development and prosperity of the country.\nInterim Minister for Law and Parliamentary Affairs Yaseen Baltistani advocate also demanded for the interim provincial set up for the economic right of the GB people.\nHe was of the view that before the coming election of GB on November 15 all the stakeholder must support the interim provincial status of the GB region.\nHe said that after acquiring the constitutional right of interim provinces local people to achieve the economic right through CPEC and other mega projects.",
  "retrievedAt": "2025-08-11T19:52:20.059Z"
}
