{
  "title": "Enhanced regional cooperation vital for regional peace, development: NA Speaker",
  "link": "https://www.app.com.pk/national/enhanced-regional-cooperation-vital-for-regional-peace-development-na-speaker/",
  "date_published": "2022-07-22T11:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP):Speaker National Assembly Raja Pervaiz Ashraf has said that enhanced regional cooperation is vital for regional peace, development and progress.\nThe Speakers and Parliamentarians of Azerbaijan, Pakistan and Türkiye gathered in Istanbul for the second round of the Trilateral speakers’ meeting of the three brotherly countries said a news release was received here from Istanbul on Friday.\nThe Speaker of the Grand National Assembly of Türkiye, Prof. Dr Mustafa Sentop warmly welcomed the Speakers of Azerbaijan and Pakistan and thanked them for their participation. While addressing the forum, Raja Pervaiz Ashraf said that finding common grounds for ensuring regional security was one of the key agendas of this trilateral meeting.\nHe called for deliberating and formulating a joint vision for the governments in ensuring regional peace and security.  While Talking about the situation in Afghanistan, NA Speaker said that Pakistan was committed to peace and stability in Afghanistan, which was pivotal for regional security.\nHe also added that close cooperation and continued support between the three countries could go a long way in pursuing a long-term policy of “live and let live” aimed at utilizing all means to ensure regional peace and tranquillity.\nThe Speaker also referred to the adverse effects of the Russia-Ukraine war on regional and global peace and said that the role of NATO in the overall Russia-Ukraine conflict demonstrated the development of new security architecture in Europe and its surrounding regions, with far-reaching consequences for the entire international community.\nWhile addressing the conference, the Speaker Türkiye of the Grand National Assembly said that the three countries had great potential and therefore, their parliaments were destined to explore the possible avenues for expanding cooperation in all areas of mutual interest.\nHe added that the platform of the Trilateral Speakers’ Meeting could prove instrumental in paving the way for further cementing the existing cordial ties between the three countries.\nThe meeting adopted the Istanbul Declaration as the outcome document which emphasized the importance of extensive cooperation between the three countries for enhancing regional stability, security and prosperity.\nThe Istanbul declaration also reiterated the principled position of the three countries on the Jammu and Kashmir dispute and resolved their support for a just and peaceful resolution, in accordance with the relevant UNSC resolution and aspirations of the people of Jammu and Kashmir.\nIt was also agreed that the third round of the Trilateral Speakers’ Forum will be hosted by Pakistan in 2023.",
  "retrievedAt": "2025-08-11T15:16:47.412Z"
}
