{
  "title": "SCO Secy Gen seeks Pakistan’s role to improve trade connectivity with land-locked Central Asia",
  "link": "https://www.app.com.pk/national/sco-secy-gen-seeks-pakistans-role-to-improve-trade-connectivity-with-land-locked-central-asia/",
  "date_published": "2022-07-22T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP): Secretary General Shanghai Cooperation Organization (SCO) Zhang Ming on Friday said Pakistan due to its well-placed location could play a role in facilitating the SCO members countries for an improved regional connectivity.\nSpeaking at the Institute of Strategic Studies Islamabad (ISSI) during his four-day visit to Pakistan, he said Pakistan was ideally located to provide shorter sea access to the land-locked Central Asian countries.\nThe SCO Secretary General said, “This will facilitate the trade among SCO member states and even beyond”.\nHe said the transport corridors stand to benefit all the member states, leading to win-win cooperation.\nHe said SCO was a multi-dimensional organization in terms of its scope and functioning and Pakistan can benefit greatly from it.\nSecretary General SCO Zhang Ming talked about the structure, functions, and history of the SCO in detail.\nWhile shedding light on the difference among the member states, he mentioned that the organization was established on the guiding principles of the Shanghai Spirit.\n“Although it started as a regional security organization, it expanded its functioning later to the economy, politics, and people-to-people contacts,” he said.\nZhang said SCO was expanding and it started with the inclusion of Pakistan and India as its permanent members.\nIran applied for full membership and, after fulfilling the criteria of the membership, it will be granted permanent member status eventually, he added.\nHe informed the audience that, now, the SCO family comprised of 21 members.\nZang Ming said China was an important member country of SCO.\n“Since its inception, it has been contributing to enhancing cooperation among the member states, particularly in the area of economic development,” he said.\nHowever, he particularly emphasized that SCO functions upon consensus-based principle, hence equally empowering all the members.\nEarlier, in his welcome remarks, Dr. Talat Shabbir, Director China-Pakistan Study Center (CPSC) gave a brief introduction of ISSI vision, functions, and its five centers of excellence.\nHe highlighted the major features of SCO, its achievements, the challenges that it is facing, and Pakistan’s contributions to it.\nAmbassador Khalid Mahmood , Chairman BoG ISSI, presented ISSI memento to Zhang Ming.\nThe event was attended by academics, diplomatic community, students, and media.",
  "retrievedAt": "2025-08-11T15:16:47.227Z"
}
