{
  "title": "Pakistan’s strategic location ideal for connecting Central Asia countries with sea routes: SCO",
  "link": "https://www.app.com.pk/national/pakistans-strategic-location-ideal-for-connecting-central-asia-countries-with-sea-routes-sco/",
  "date_published": "2022-07-22T11:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP):Secretary General Shanghai Cooperation Organization (SCO) Zhang Ming on Friday termed Pakistan’s geo-strategic location ideal for connecting Central Asia countries with the sea routes.\n“Pakistan is well placed for facilitating the SCO members in improving the regional connectivity. The Central Asia countries are landlocked and Pakistan is ideally located to provide shorter sea access to these countries.\nThis will facilitate the trade among SCO member states and even beyond. The transport corridors stand to benefit all the member states, leading to win-win cooperation.\nSCO is a multi-dimensional organization in terms of its scope and functioning and Pakistan can benefit greatly from it,” said Zhang Ming while delivering a speech at the Institute of Strategic Studies Islamabad (ISSI) during his four-day visit to Pakistan.\nZhang Ming also informed the audience about the structure, functions, and history of the SCO in detail and said the organization was established on the guiding principles of the Shanghai spirit.\nThe organization expanded its functioning later to the economy, politics, and people-to-people contacts, he added.\nPakistan and India, he said, become permanent members of the organization while Iran applied for full membership and, after fulfilling the criteria will be granted permanent member status.\nHe informed the audience that, now; the SCO family comprises twenty-one members and China is an important member country of it.\nHe said that organization has been contributing to enhancing cooperation among the member states, particularly in the area of economic development.\nEarlier, in his welcome remarks, Dr Talat Shabbir, Director China-Pakistan Study Center (CPSC) welcomed the esteemed guest and gave a brief introduction of ISSI vision, functions, and its five centers of excellence.\nIn his remarks, he highlighted the major features of SCO, its achievements, the challenges that it is facing, and Pakistan’s contributions to it.\nHe was optimistic about the prospects of cooperation among the SCO member states.\nHe also informed the audience how CPSC at ISSI has been contributing to research and analyses in the field of SCO studies.\nAmbassador Khalid Mahmood, Chairman BoG ISSI, presented ISSI memento to Zhang Ming. The event was attended by academics, the diplomatic community, students, and the media.",
  "retrievedAt": "2025-08-11T15:16:48.165Z"
}
