{
  "title": "NCOC issues COVID-19 SOPs for Muharram-ul-Haram",
  "link": "https://www.app.com.pk/national/ncoc-issues-covid-19-sops-for-muharram-ul-haram/",
  "date_published": "2022-07-22T10:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP):National Command and Operation Centre (NCOC) on Friday issued COVID-19 guidelines for the safe conduct of Muharram-ul-Haram in the country.\nAs per guidelines issued by the NCOC, the main emphasis is on adherence to COVID-19 standard operating procedures (SOPs) during Majalis and processions like wearing masks and the availability and use of sanitizers.\nThe vaccination of Zakirs and participants in the Majalis will be mandatory besides reducing or minimizing the participation strength while disallowing children, the elderly, and other vulnerable groups.\nThe NCOC proposed that the venue for the conduct of Majalis should be open and spacious with proper ventilation arrangements.\nThe wearing of masks and maintenance of social distancing is mandatory during Majalis and processions. The availability of masks, sanitizers, and hand washing arrangements at the entrance will be ensured by organizing committees.\nThe capacity of the venues will be ascertained according to social distancing protocols and the number of participants exceeding the established capacity may not be permitted. Strict regulation at the entry and exit points will be ensured for avoiding overcrowding at the time of arrival and dispersal from the venue.\nThe centre also recommended that Majalis where SOPs cannot be effectively implemented such as homes and private gatherings may be discouraged. It also proposed that the elderly above 65 years, children and co-morbid may be sensitized to attend Majalis at home through live streaming.\nThe number of participants or Azadars will be kept reasonable while lengthy Majalis and processions should be avoided and reducing the timings.\nAs per SOPs, the cleaning or washing of the floor with chlorine before and after the Majalis is also necessary besides displaying COVID-19 SOPs and precautions at prominent places while SOPs compliance will be ensured by employing volunteer scouts.\nThe guidelines preferred arrangements of ‘nazro niaz’ in spacious and ventilated places with emphasis on the use of disposable utensils particularly with pre-packed boxes for distribution. The NCOC also urged avoiding overcrowding at food distribution points besides handshake and embracing.\nThe concerned federal and provincial departments will make necessary arrangements to disseminate messages of religious clerics for uniform implementation of SOPs or guidelines proposed by NCOC besides sharing strict enforcement of SOPs by the civil administration.",
  "retrievedAt": "2025-08-11T15:16:49.600Z"
}
