{
  "title": "Govt will not compromise on supremacy of law, constitution: Azam Tarar",
  "link": "https://www.app.com.pk/national/govt-will-not-compromise-on-supremacy-of-law-constitution-azam-tarar/",
  "date_published": "2022-10-20T16:49:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 20 (APP):Federal Minister of Law and Justice Azam Nazeer Tarar on Thursday praised the role played by the lawyers’ community against dictatorship saying that no compromise would be made on the supremacy of law and constitution.\nHe was addressing the launching ceremony of E-Service Online Payment System website and Android App of Khyber Pakhtunkhwa Bar Council. Vice Chairman KP Bar Council, Muhammad Ali, Chairman Executive Committee, Ilyas Khan , office bearers of District Peshawar Bar Association and large number of lawyers were present on the occasion.\nThe federal Law Minster said that struggle of lawyers with unflinching resolve to protect legal and state institutions and rights of people during dictatorship would always be remembered in golden words.\nHe said that the annual grant for the lawyers’ community has been increased to Rs 500 million and was made part of the financial budget of the current year.\nHe said the share of province bar councils in the grant would be decided by the law department and not a single bar association would be ignored from the grant.\nAzam Tarar said that lawyers Protection Act would be introduced in the form of a bill that would be enacted as the law soon.\nRelating to the matter of increasing posts of judges in Peshawar High Court, Azam Tarar said that it was a constitutional matter and work on the subject was already underway.\nHe also lauded the sacrifices of lawyers for the restoration of democracy, peaceful transfer of power and protection of state institutions.\nHe assured that the government would always safeguard rights of lawyer fraternity and welfare fund of lawyers would be increased. He said that work on the housing scheme of Supreme Court lawyers would start soon.\nLater, federal law minister distributed grant cheques among presidents of various district bar associations.\nTalking to the media after launching ceremony, Azam Nazee Tarar said that PTI Chairman Imran Khan had negated the norms of the parliamentary system by contesting election on more than one seat and depriving electorates of their rights.\nHe said that time demands that the law in this connection should be changed as these seats would become vacant in one month.\nHe said the constitution permits contesting election on more than one seat by a local but contesting of a non local is tantamount to depriving constituency people of their rights.\nFederal Law Minister told that a parliamentary committee had been constituted to introduce electoral reforms and election on more seats would also be on its agenda.\nThe minister said that he was well aware of the problems of members of KP Bar Council and that their genuine problems would be addressed on a priority basis.",
  "retrievedAt": "2025-08-11T15:45:58.820Z"
}
