{
  "title": "SC rejects plea to bar PTI’s long march, asks govt to tackle it in accordance with law",
  "link": "https://www.app.com.pk/national/sc-rejects-plea-to-bar-ptis-long-march-asks-govt-to-tackle-it-in-accordance-with-law/",
  "date_published": "2022-10-20T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): The Supreme Court on Thursday rejected the government’s plea to issue an interim order against Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan to bar him from holding the long march and directed the government to tackle the same in accordance with the law.\nA five-member larger bench headed by Chief Justice of Pakistan (CJP) Umar Ata Bandial and comprising Justice Ijaz ul Ahsan, Justice Munib Akhtar, Justice Yahya Afridi and Justice Sayyed Mazahar Ali Akbar Naqvi heard the Federal Government’s contempt of court petition against PTI chairman for violating its May 25 order wherein the party was restricted from holding its “Azadi March” near Peshawar Mor, Islamabad.\nDuring the proceedings, the chief justice quoted the government’s stance that Imran Khan had violated his earlier assurance given to the court and his party was again planning a long march and sit-in in the capital.\nStill there were only speeches, and the government could deal with the situation in accordance with the law and take action in urban areas where there were threats, he added.\nThe CJP said the law enforcement agencies had submitted their separate reports on the court’s previous order. Some 31 civilians were injured in the clash on May 25, while Imran Khan announced to end the long march the next morning.\nHe said there was no crowd at present, however, the government might approach the court if there was a crowd of people (in Islamabad).\nHe said it was the responsibility of the administration to take steps in accordance with the constitution and law. The administration should fully prepare itself for any situation and the court would intervene,even on holidays, in case there was any violation of the law from any side, however, concrete evidence would have to be brought before it, he added.\nThe chief justice said the court’s duty was to maintain a balance. The right to protest was conditional. If any political leader violated the court’s order, then there would be serious consequences, he warned, adding steps should be taken for reconciliation.\nHe said the judges were apolitical. However, the court would have to ensure a level playing field, and also it was its responsibility to protect the fundamental rights of people, he added.\nThe court also directed that the Attorney General for Pakistan (AGP) should be provided the copies of agencies’ reports on Imran Khan’s previous long march, which were submitted following its (court’s) order.\nAGP Ashtar Ausaf Ali argued that the citizens’ rights were affected by the PTI’s May 25 long march. The party had submitted an affidavit that the people would not be inconvenienced.  The court had allocated a specific place for the PTI’s sit-in but it was brought to the D-Chowk, which resulted in material losses, he added.\nHe pleaded the court to punish those who had violated its orders. The PTI chairman had called upon his workers to gather at D-Chowk in contrary to the assurance his party had given to the court.\nHe said the Srinagar Highway was opened for traffic on the court’s order allowing the PTI workers to gather at the Parade Ground, who instead reached the D-Chowk. They had entered the Red Zone, which resulted in clashes with the law enforcement agencies.\nThe AGP said the PTI workers also damaged public and private properties. The PTI’s lawyers were in contact with the party leadership during the court proceedings, he added.\nHe said a miscellaneous petition was filed on the night of May 25 requesting action against those responsible for bringing the PTI workers in the Red Zone.\nHe also read out the SC’s May 25 order, saying the court had prevented the government from arresting PTI workers. The court had also sought reports from the law enforcement and intelligence agencies, he added.\nThe AGP said it was found that the PTI had violated its assurance as per the reports submitted by the agencies to the court. He said he had not been provided copies of the reports. The bench assured that he would be given the reports.\nAGP Ausaf informed the court that policemen from Khyber Pakhtunkhwa and Azad Jammu & Kashmir had also entered the capital during the march.\nHe pleaded the court to issue an interim order, on which the chief justice asked about the order’s nature.\nThe attorney general replied that Imran Khan was declaring “the attack on Islamabad as Jihad”. For the purpose, he was inciting the people in his speeches (at public meetings), besides visiting educational institutions and universities, he added.\nHe said it was the state’s responsibility to protect the citizens’ fundamental rights. Holding a protest was a fundamental right but the government wanted that anyone from the PTI should inform the court that Imran Khan had no intention of long march, he added.\nThe court asked the AGP that whether he wanted the court to seek another assurance from the PTI.\nJustice Ijaz-ul-Ahsan said he (AGP) should review the reports first. He wanted the court orders in advance for such a situation which had not yet come up, when something would happen, then he could approach the court.\nLater, the case was adjourned till Wednesday.",
  "retrievedAt": "2025-08-11T15:45:58.121Z"
}
