{
  "title": "PM asks Punjab, KP to rise above politics & join centre’s wheat seed scheme for flood-hit farmers",
  "link": "https://www.app.com.pk/national/pm-asks-punjab-kp-to-rise-above-politics-join-centres-wheat-seed-scheme-for-flood-hit-farmers/",
  "date_published": "2022-10-20T06:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): Prime Minister Shehbaz Sharif on Thursday urged the provincial governments of Punjab and Khyber Pukhtunkhwa to rise above politics as the country grappled with the impact of flash floods and join the centre’s scheme of providing wheat seeds to farmers of the affected areas.\nChairing a review meeting of National Flood Response and Coordination Centre, the prime minister offered the two provinces to collaborate with the federal government under the scheme which will ensure funding for wheat seeds with 50 percent contribution from both sides.\nThe prime minister mentioned that Sindh and Balochistan had already agreed with the wheat scheme.\nHowever, despite the offer by the centre, Punjab and KP refused to cooperate and instead indulged in playing politics on the matter, he regretted.\n“I request you to accept the offer in view of the plight of the flood-hit farmers. And if you still reject it, then don’t twist the facts that centre is not extending you assistance,” he said in a meeting also joined by chief secretaries of Punjab and KP through video-link.\nShehbaz Sharif emphasized that Pakistan as a federation comprised its provincial units and said the situation demanded unity at national level.\nHe feared reduced produce of wheat the coming season owing to post-flood situation and rejected to allow any import of the commodity by the private sector.\n“In view of emergency situation, I will not allow the private sector to import wheat,” he said, adding that the government was aiming to get a better bidding of the wheat.\nPM Sharif said the government was effectively carrying out relief and rehabilitation work in post-flood scenario as the death toll crossed 1,700 including children.\nHe said the federal government through National Disaster Management Authority (NDMA) was ensuring disbursement of Rs 880 million compensation money and relief goods including food, water, medicines and mosquito nets among the flood-affected families across the country.\nAlso, the relief supplies received from the friendly countries is being distributed through a very transparent channel of NDMA, he said.\nHe said China was sending ‘winter tents’ of good quality in view for the flood-struck people to help them cope with the upcoming harsh season.\nThe prime minister, who recently undertook a visit to Sohbatpur area of Balochistan, said the land was still inundated and posed threat of breakout of water-borne diseases.\nThe meeting was told that a comprehensive plan for rehabilitation of flood-affected people was in progress and a report on Post-Disaster Need Assessment compiled in collaboration of the federal and provincial governments and international organizations would be presented to the prime minister.\nThe prime minister directed to finalize the report to be given to the international donor agencies regarding the estimates of flood losses.\nIt was highlighted that under the Benazir Income Support Programme (BISP), an amount of Rs 25,000 was being given to each affected family. Up till now, Rs 66.22 billion have been disbursed among 2.6 million households with people among Sindh at the highest number of 1.8 million families, KP 315,000 families and Balochistan 240,000 families.\nThe Chairman NDMA updated the meeting that tents had been distributed among flood-hit people of Sindh (123,000), Balochistan (100,000) and KP (64,000) tents. Also, 1,500,000 mosquito nets in Sindh and 500,000 have been distributed in Balochistan besides other supplies including boats and water pumps for dewatering.\nThe meeting was informed that NDMA, on part of the federal government, had provided Rs one million each to the families of deceased and in this regard Rs 890 million had been disbursed.\nWater pumps have been installed at the east and west basins of Indus River for dewatering, while power generation is being ensured through generators in areas where supply of electricity has yet to be restored.\nOn the update by Chief Secretary Balochistan regarding the problems faced by flood victims as the winter approaches, the prime minister directed provision of special winter tents donated by China on urgent basis.\nThe meeting was attended by federal ministers, Chairman NDMA, Chairman NFRCC and officials of the departments concerned. The Chief Minister Sindh and chief secretaries of the four provinces joined through video-link.",
  "retrievedAt": "2025-08-11T15:45:55.572Z"
}
