{
  "title": "Wheat seeds to be provided to Sindh, Balochistan next month",
  "link": "https://www.app.com.pk/national/wheat-seeds-to-be-provided-to-sindh-balochistan-next-month/",
  "date_published": "2022-10-20T09:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): Minister for National Food Security Tariq Bashir Cheema on Thursday informed the National Assembly that wheat seeds would be provided to the district administrations of Sindh and Balochistan provinces between 1st and 15th of next month for their onward distribution to the farmers ravaged by the floods.\nSpeaking on the floor of the house, he said the National Disaster Management Authority had been requested to procure the best available quality seeds.\nHe said a tender for the seeds procurement would be opened on the 26th of this month.\nTariq Bashir Cheema said that Rs 9 billion had been re appropriated from a PSDP and a World Bank Program for the procurement of wheat and oil seeds.\nHe said maximum efforts were being made for the rehabilitation of flood affected people.\nAlluding to the water receding in Sindh, the minister was confident that sufficient land would be available in the province for the cultivation of wheat.\nHe said that oil seeds would be cultivated where the land could not be prepared for wheat cultivation.\nThe minister said there was no wheat crisis in the country as sufficient wheat had been imported.\nHe said the seeds would also be provided to the flood affected farmers in sufficient quantities.\nMeanwhile, responding to questions during question hour, the minister said a total 188 wheat varieties had been registered so far for general cultivation in the country.\nHe said that a total of 28 wheat varieties had been registered for cultivation in Sindh .\nHe said that during 2021 in the meeting of provincial seed Council Punjab had banned seven old productivity wheat varieties for cultivation in Punjab and seed multiplication of said varieties had also been banned by the National Seed Council.\nThe Federal Certification and Registration Department has prohibited these varieties of seed according to the Seed Amendment Act 2015.",
  "retrievedAt": "2025-08-11T15:45:52.337Z"
}
