{
  "title": "BISP disburses Rs. 30,601,739,000 among 4,371,677 among Kafalat beneficiaries till today",
  "link": "https://www.app.com.pk/national/bisp-disburses-rs-30601739000-among-4371677-among-kafalat-beneficiaries-till-today/",
  "date_published": "2023-01-19T08:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):Benazir Income Support Programme (BISP) has disbursed an amount of Rs. 30,601,739,000 among 4,371,677 beneficiaries across the country under the quarterly payments of the Benazir Kafalat programme.\nTill January 19, around 55.43 percent quarterly payment amount has been paid to the beneficiaries through the designated banks and retailers, following a smooth and transparent procedure.\nAccording to the BISP, those deserving women who still have not received their quarterly payment of Rs. 7000 may visit their nearest payment center to receive the amount.\nAround 7.7 million families would receive over Rs. 55 billion in the first tranche of Benazir Kafalat payments.The beneficiaries have been advised to receive their full installment of Rs 7,000 and get the payment receipt by the quarter concerned in any case.\nTo facilitate the beneficiaries, BISP has set up a special control room for the redressal of public complaints regarding the disbursement of Benazir Kafalat payments.\nThe control room has been set up on the special directives of the Federal Minister for Poverty Alleviation and Social Safety, Shazia Marri, to ensure transparency in the distribution of the first quarterly installment for the year 2023.\nBISP has asked the beneficiaries to immediately report to BISP’s toll-free helpline 080026477 and contact the nearest BISP Tehsil Office if a person demands any kind of deduction or fee for payment.\nThe message sent by BISP would come from 8171 only and no message from any other number or code should be trusted, as it is faked and fraudulent.\nThe beneficiaries facing problems regarding receiving the payments could register their complaint on Whatsapp numbers for Punjab: 03255365520, Sindh: 03449118336 and Balochistan: 03255365469 while the complainants from Khyber Pakhtunkhwa, Azad Jammu and Kashmir and Gilgit Baltistan could contact at 03255365476.\nThe beneficiary women and transgenders of Islamabad, Punjab, Sindh and Balochistan have started receiving this money from Payment Centers or Biometric ATMs designated by Habib Bank; while in Khyber Pakhtunkhwa, Azad Jammu and Kashmir and Gilgit-Baltistan, the amount is being disbursed through Payment Centers or Biometric ATMs of Bank Al-Falah.",
  "retrievedAt": "2025-08-11T05:46:32.926Z"
}
