{
  "title": "Experts call for urgent attention to reform, modernize agriculture, control population growth",
  "link": "https://www.app.com.pk/national/experts-call-for-urgent-attention-to-reform-modernize-agriculture-control-population-growth/",
  "date_published": "2023-01-19T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):The experts have demanded urgent attention of the government and key stakeholders to reform and modernize agriculture and control population growth to ensure food security for the country’s national security.\nThis was the key message of the eminent speakers at the seminar on ‘Food Security for Pakistan’ organized by the Centre for Aerospace & Security Studies (CASS) here on Thursday, a news release.\nFormer federal minister for National Food Security and Research, Syed Fakhar Imam was the keynote speaker, while other eminent speakers included Executive Director, Sustainable Development Policy Institute (SDPI) Dr Abid Qaiyum Suleri, former Federal Secretary for Water and Power Ashfaq Mahmood, Ambassador Shafqat Kakakhel and Chairman Board of Governors, Sustainable Development Policy Institute, Islamabad.\nThe seminar was concluded by President CASS Air Marshal Farhat Hussain Khan (R), while Dr Zia Ul Haque Shamsi Director at CASS moderated the proceedings.\nIn his opening remarks, Dr Zia Ul Haque Shamsi highlighted that Pakistan being the fifth largest state in the world, and a predominantly agri-based society, was unfortunately facing serious concerns of food insecurity for various reasons. This was especially concerning because while efforts were in hand to improve farming processes through modern methods, better seeds development and resource management. Pakistan still had a long way to go in ensuring food security for its growing population at an affordable cost, he said.\nIn his keynote address on ‘Role of Agriculture Sector and Food Security in Pakistan’, Syed Fakhar Imam pointed out that national security, international security and food security were all interlinked and could not be separated from each other. He lamented that of the five major crops, wheat was grown on 36 percent of the land which was where the problem lay. Unfortunately, Pakistan has failed to evolve high-yield crop varieties, he added.\nImam argued that despite having five major agri-universities and affiliated colleges, they were not at par with international standards and had outdated curriculum. In his view, the population explosion is also a major reason that had made Pakistan an importer of wheat. Mechanization, modernization, agricultural extension, human resource development and research are key factors strengthening the agro-economy of Pakistan, he added.\nDr Abid Qaiyum Suleri underlined that triple C Crises; ‘COVID, Conflict and Climate Change’ were forcing states across the globe to question and rethink their healthcare systems, economic policies, and ways of producing and consuming food, but Pakistan, had tetra-C crises given its ‘Complacency’.\nHe pointed out that even before Pakistan’s super floods and Russia-Ukraine war, the country was ranked 9th in the list of countries facing worst food insecurity. In his assessment, the Punjab Food Department released subsidized wheat to flour mills in April 2022, as opposed to its earlier policy of releasing the stocks in September, had resulted in the current wheat flour crisis as it allowed the private sector to hoard its reserves. Dr Suleri warned that future generations of Pakistan faced high risk of malnourishment, wasting, stunting as well as low IQ.\nHe urged for shifting to precision agriculture technologies; adopting climate-smart agri-practices; integrating social safety nets for farmers, including weather index-based insurance; improving agri-institutional arrangements; offering smart subsidies; and solarization of tube wells, among others.\nWhile analyzing the availability of water for agricultural needs, Ashfaq Mahmood provided an overview of the water resources of Pakistan under the Indus Waters Treaty and transboundary waters. He informed that glaciers, snow melt, and rains were major sources of water for Pakistan.\nIn his view, the effects of global warming and climate change had made it difficult to ensure sustainable water management in the country. He proposed increasing water storage capacity by building a combination of large, medium, and small dams; harvesting rainwater, particularly in barani areas; rationalizing water withdrawals by provinces; conserving and recycling water; proactively addressing trans-boundary water issues; population control; desalinizing sea water and promoting information dissemination and rationalization of virtual water.\nAmbassador Shafqat Kakakhel expressed disappointment that the problem in Pakistan was not the preparation of plans and projects rather lacked implementation as institutional arrangements for translating them into tangible action was continuously eroding.\nHe warned that the cumulative effects of climate change would not just be on food security but would also increase poverty and slow down poverty eradication efforts. He advised adopting the perennial system of irrigation in the country.\nWhile delivering the concluding remarks, Air Marshal Farhat Hussain Khan (Retd) thanked the speakers for their in-depth analysis of food security, especially its impact on Pakistan’s security and socioeconomic development. He stressed that a malnourished population was vulnerable to exploitation by both internal and external adversaries and could not be expected to contribute to nation-building, hence, security of the state was being compromised.\nHe urged that national security should define ‘food security’ as one of the vital national interests. President CASS recommended that in order to become self-sufficient, more research and development on modernizing the agriculture sector and adopting new irrigation techniques was a need of the hour.\nThe seminar was attended by retired military officers, scholars from various think tanks, journalists and students, who actively participated in the interactive question and answer session.",
  "retrievedAt": "2025-08-11T05:46:15.017Z"
}
