{
  "title": "Pakistan to continue raising voice against human rights abuses in IIOJK: FO",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-raising-voice-against-human-rights-abuses-in-iiojk-fo/",
  "date_published": "2023-01-19T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): Pakistan will continue to raise its voice on the continuing grave human rights abuses in Indian Illegally Occupied Jammu and Kashmir (IIOJK), said Foreign Office Spokesperson here on Thursday.Speaking at the weekly press conference here, she said Pakistan will also continue to extend unstinted moral, political and diplomatic support to the people of Jammu and Kashmir in their quest for self-determination in accordance with the relevant United Nations Security Council resolutions.During the last week, Indian oppression in Indian Illegally Occupied Jammu and Kashmir (IIOJK) continued unabated, she added.She said the Indian forces continued to carry out cordon and search operations in different parts of Rajouri, Poonch and Reasi districts, harassing the local population.In a disturbing event, two Kashmiri youth were killed in a fake encounter in Budgam district after they were dislodged by the Indian troops from a vehicle and shot dead on spot, she said adding a 75-year-old under-trial prisoner, Mohammed Maqbool Khan, died in custody after he was tortured in Kupwara jail. He and his three sons were detained in August last year on trumped up charges.“For the last one month, a family in Kunan village of Kupwara has been desperately looking for the whereabouts of their son and brother Abdul Rashid Dar. A mini truck driver, Dar went missing on 15 December after he was whisked away by Army soldiers from 41 Rashtriya Rifles unit. His mother, Khera Begum, has demanded knowledge on Rashid’s whereabouts or at least a proof of life,” she remarked.“The case of Rashid Dar, though tragic, is not unique. Over the last three decades, hundreds have gone missing while in the custody of Indian security forces. According to credible counts, some 8000 persons have gone missing in IIOJK since 1989.”She told that Minister for Foreign Affairs, Bilawal Bhutto Zardari will undertake an official visit to Tashkent, Uzbekistan on 25th January 2023 to attend the 26th meeting of the Council of Ministers (COM) of Economic Cooperation Organization (ECO). The theme of the event is “Year of Strengthening Connectivity”, an area of special interest and significance for Pakistan.The Minister for Foreign Affairs will address the Council of Ministers and hold bilateral meetings with participating Ministers and other dignitaries on the sidelines of the event.As the policy making forum of ECO, the Council of Ministers approved the annual work plan of the organization. As a founding member, Pakistan remains strongly committed to the objectives of ECO which aims to promote effective regional cooperation, with focus on communications, trade, culture and connectivity.To a question, she said Pakistan’s position on the Jammu and Kashmir dispute and India’s illegal occupation of Indian Illegally Occupied Jammu and Kashmir were very clear.“Pakistan has always desired cooperative relations with all its neighbors, including India. We have consistently advocated constructive engagement and result-oriented dialogue to resolve all outstanding issues, including the core dispute of Jammu and Kashmir. However, India’s unabated hostility and retrogressive actions have vitiated the environment and impeded the prospects for peace and cooperation.”The Spokesperson said Pakistan believed the onus remained on India to take the necessary steps to create an enabling environment conducive for meaningful and result-oriented dialogue. In that context, the reversal of India’s illegal and unilateral actions of 5th August 2019 in the Indian illegally occupied Jammu and Kashmir were of critical importance.“We will appreciate if the international community, especially friendly countries will convince India to take such steps.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:46:19.142Z"
}
