{
  "title": "Sibbi-Harnai railway track to be operational soon",
  "link": "https://www.app.com.pk/national/sibbi-harnai-railway-track-to-be-operational-soon/",
  "date_published": "2023-01-19T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):Pakistan Railways has almost completed the reconstruction and renovation work on the strategic Sibbi-Harnai railway track with the assistance of the National Logistics Cell (NLC) and it would be operational very soon.\n“The railway track was made dysfunctional after a series of bomb blasts which damaged as many as 22 steel bridges in the highly rugged and inaccessible area,” sources in the Ministry of Railways told APP.\nThey said the track was badly damaged in 2006 and so far about 97 percent of the reconstruction work of the project was completed and remaining work would be completed soon.\nThe sources said that Minister for Railways Khawaja Saad Rafique had also taken keen interest in the projects and directed the concerned official to complete the project at the earliest.\nIn March 2016, they said that a contract for rehabilitation and restoration of the Sibbi-Harnai railway track along with the up-gradation of railway stations was awarded to the NLC as no other construction firm agreed to undertake the project due to the prevalent security situation and enormity of the task.\nDuring the initial survey of the track, they said it was found that 22 steel bridges of different sizes were completely destroyed and required replacement.\nThey said in addition, massive river protection work was to be undertaken to save the infrastructure. The quantum of work, non-availability of road access, and requisite resources made the project a formidable challenge.\nThe sources said undertaking the project with the sincerity of purpose and utmost sense of duty, NLC officers, engineers, and construction workers braved harsh weather conditions and a hostile security environment, and subsequently completed 97% of the rehabilitation works in record time.\nThe major task was the fabrication of steel bridges. The steel bridges were fabricated in Karachi and were transported all the way to the project site after being painstakingly assembled by NLC engineers in a befitting manner, they added.\nThey said a total of nine railway stations along with tracks have been upgraded by NLC engineers including the reconstruction of Harnai Railway Station and a complete renovation of Sibbi Railways Station, which can be regarded as the finest railway station in Balochistan.",
  "retrievedAt": "2025-08-11T05:46:23.644Z"
}
