{
  "title": "Sanjrani urges effective strategy to combat Islamophobia",
  "link": "https://www.app.com.pk/national/sanjrani-urges-effective-strategy-to-combat-islamophobia/",
  "date_published": "2023-01-19T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): Senate Chairman Muhammad Sadiq Sanjrani on Thursday urged the Muslim Ummah to get united and evolve a consensus among themselves to combat Islamophobia in an effective way.\nTalking to Syrian Ambassador to Pakistan Dr. Ramez Alraee in Parliament House, he said that fraternal and historical relations with Syria are a source of pride for the nation and hoped to expand mutual relations based on common interests.In the meeting, the issues of mutual interest, including bilateral relations, and cooperation in various fields were discussed.\nHe said that Pakistan-Syria relations are based on common faith, history and culture which reflects their joint stand on international forums.\nSanjrani said that Pakistan and Syria have common interests on various international issues. Pakistan has provided a unique opportunity to increase trade links with Central Asian states and China through its Gwadar port and China-Pakistan Economic Corridor (CPEC) routes.\nHe stressed devising a comprehensive strategy to increase cooperation in various fields especially trade between the two countries. He also stressed the need to exchange trade and parliamentary delegations of two countries.\nThe Syrian ambassador expressed his regret to the chairman regarding the devastation caused by the recent floods in Pakistan.\nDeclaring climate change as a big challenge for the whole world, both personalities emphasized the need to take measures on an emergency basis to control it.\nSyrian Ambassador appreciated Pakistan’s positive role in regional peace, and stability and said that he will continue to play his role for further improvement in diplomatic cooperation with Pakistan at all levels.\nIn the meeting, both the dignitaries stressed high-level exchanges between the two countries and emphasised taking benefits from the investment opportunities in Pakistan.",
  "retrievedAt": "2025-08-11T05:46:19.820Z"
}
