{
  "title": "US tariff on Indian rice opens market for Pakistan - Business - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The 50 per cent tariff imposed by the Trump administration on Indian goods, including basmati rice, has reshaped trade flows in the United States, providing Pakistan an opportunity to expand its share in the American aromatic rice market.\n\nPakistan’s basmati rice exports have witnessed steady growth in recent years. According to the Rice Exporters Association of Pakistan (REAP), the country exported approximately 772,725 tonnes of basmati rice in FY24, generating $876.9m — up from 595,120 tonnes worth $650.4m in the previous fiscal year. The average export price per tonne also increased from $1,092.93 to $1,134.86.\n\nData from Volza’s Global Trade platform shows that between November 2023 and October 2024, the United States accounted for 24pc of Pakistan’s total basmati exports through 1,519 shipments. Italy and the United Kingdom followed with shares of 14pc (908 shipments) and 11pc (716 shipments), respectively.\n\nTogether, these three markets consumed nearly 49pc of Pakistan’s basmati rice exports. Pakistan currently exports basmati rice to over 110 countries, with other key destinations including Australia, Saudi Arabia, the UAE, Canada, the Netherlands, and Germany.\n\nBasmati exports rose 35pc in FY24 to 772,725 tonnes, earning $876.9m\n\nAccording to the US Department of Agriculture (USDA), rice imports in the US have grown steadily over the past three decades — from 7pc of the domestic market in 1993/94 to over 25pc by 2022/23. Over 60pc of these imports consist of aromatic varieties from Asia, mainly jasmine from Thailand and basmati from India and Pakistan.\n\nWhile the US produces some aromatic rice domestically, these differ in quality and aroma from their Asian counterparts. The USDA projects continued growth in demand for aromatic rice imports in the coming years.\n\nThe tariff dispute emerged from US punitive measures targeting India’s trade and energy ties with Russia, resulting in broad tariffs on several Indian exports, including basmati rice, pharmaceuticals, and electronics. Although some sectors later received exemptions, basmati rice remained subject to the full 50pc tariff. In contrast, Pakistani basmati rice continues to face a lower tariff of 19pc, giving it a distinct pricing advantage in the US market.\n\nIndian media reports suggest that the tariff hike could reduce India’s basmati exports to the US by 50-80pc, with prices climbing to nearly $1,800 per metric tonne. Pakistani basmati, by comparison, remains priced at around $1,450 per metric tonne, making it more competitive for US importers and retailers.\n\nRetailers across the US are already reporting increased interest in Pakistani basmati rice. Khan Mohammed, a salesman at Super Halal grocery in Springfield, Virginia, noted: “Pakistani rice is already popular.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689a8a6475934.jpg",
  "retrievedAt": "2025-08-17T19:27:21.088Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930287/us-tariff-on-indian-rice-opens-market-for-pakistan",
  "dateList": "2025-07-01",
  "date_published": "2025-08-12T01:15:01.000Z"
}
