{
  "title": "Fugitive Bangladesh ex-PM denies crimes against humanity charges - World - DAWN.COM",
  "author": null,
  "content": "Bangladesh’s fugitive ex-prime minister Sheikh Hasina has denied accusations that she committed crimes against humanity, her state-appointed defence lawyer said on Tuesday.\n\nUp to 1,400 people were killed between July and August last year, according to the United Nations, when Hasina’s government ordered a crackdown on protesters in a failed bid to cling to power.\n\nHasina fled to India at the culmination of the student-led uprising in August and has defied orders to return to Dhaka, where her trial in absentia opened on June 1.\n\nProsecutors have filed five charges against Hasina — abetment, incitement, complicity, facilitation, conspiracy and failure to prevent mass murder — that amount to crimes against humanity under Bangladeshi law.\n\nDefence lawyer Amir Hossain said Hasina has denied all charges, telling journalists that he would present “arguments to seek her discharge from these allegations”.\n\nThe ousted leader’s banned Awami League, in a statement issued in London, called it a “show trial” and said that the accused “categorically denies the charges”.\n\nTo illustrate the allegations against Hasina, prosecutors have drawn up a list of key examples from their bulky dossier.\n\nThey accuse her of incitement to violence, as well as ordering the use of lethal weapons, including from helicopters.\n\nChief prosecutor Mohammad Tajul Islam said Hasina was driven by a desire to cling to power at all costs.\n\nHe pointed to her alleged push for people to “worship” her late father, the founding president of Bangladesh, Sheikh Mujibur Rahman.\n\n“Her father had the same obsession with holding on to power,” Islam said.\n\nProsecutors say Hasina holds overall command responsibility in three specific cases — the separate trials of which are ongoing — connected to the violent suppression of the uprising.\n\nThose cases are the murder of a 23-year-old student protester Abu Sayeed, the killing of six others in the Chankharpul area of Dhaka, and the killing and burning of six people in Ashulia, another suburb of the capital.\n\nHasina is on trial with two other officials.\n\nOne of them, former interior minister Asaduzzaman Khan Kamal, who faces similar charges, is also a fugitive. The second, ex-police chief Chowdhury Abdullah Al Mamun, is in custody.\n\nThe trial continues.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/011629349de8a33.jpg",
  "retrievedAt": "2025-08-17T19:24:23.454Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921441/fugitive-bangladesh-ex-pm-denies-crimes-against-humanity-charges",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T11:53:54.000Z"
}
