{
  "title": "PSX ends FY25 at record high on China loan boost - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakis­tan Stock Exchange (PSX) ended the final session of the outgoing fiscal year on a bullish note, with the benchmark KSE-100 index soaring to a record high above 125,000 on Monday. The rally was driven by aggressive buying at attractive valuations and strong year-end fund flows.\n\nTopline Securities Ltd reported that the index surged as much as 1,369 points during intraday trade before closing with a gain of 1,248.25 points, or 1pc, to settle at 125,627.31 — its highest-ever close.\n\nInvestor confidence was reinforced by China’s rollover and refinancing of $3.4bn in commercial loans, enabling Pakistan to meet the IMF’s foreign exchange reserves target of $14bn by June 30. The development provided a critical external trigger that bolstered sentiment and supported the market’s upward trajectory.\n\nHeavyweight stocks led the charge, with Fauji Fertiliser Company, Habib Bank Ltd, Bank Al-Habib, United Bank Ltd, Pakistan Oilfields Ltd, Faysal Bank Ltd and Packages Ltd collectively contributing 724 points to the index.\n\nIndex surges past 125,000 for the first time\n\nTrading activity remai­ned strong. Market volume jumped 48pc to 1.14bn shares, while the traded value declined 6.2pc to Rs35.23bn. WorldCall Telecom topped the volume chart with 139m shares traded.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, said the positive momentum carried over from last week as the index posted another all-time high close.\n\nHe added that Bloomberg’s report showing Pakistan as the global leader in default risk reduction — from 59pc to 47pc — further strengthened investor sentiment.\n\nMoreover, the number of billion-dollar listed companies in Pakistan increased to 11 from 6 since December 2023, reflecting improved valuations and capitalisation.\n\nAccording to Topline Securities, the KSE-100 index gained 60pc year-on-year in rupee terms and 57pc in dollar terms in FY25. Over the two fiscal years (FY24 and FY25), the index has surged 203pc in rupee terms and 206pc in dollar terms — a remarkable performance credited to macroeconomic stabilisation under the IMF programme.\n\nBloomberg data ranked Pakistan’s market as the eighth-best performer globally in FY25, with a total return of 57pc in dollar terms.\n\nHowever, over the two-year period of FY24 and FY25, the PSX emerged as the world’s best-performing equity market.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6863207d74100.gif",
  "retrievedAt": "2025-08-17T19:26:16.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921314/psx-ends-fy25-at-record-high-on-china-loan-boost",
  "dateList": "2025-07-01",
  "date_published": "2025-06-30T23:59:43.000Z"
}
