{
  "title": "PSX crosses 128,000 barrier on first day of FY26 - Business - DAWN.COM",
  "author": null,
  "content": "Bullish momentum continued at the Pakistan Stock Exchange (PSX) on Tuesday as the market crossed the 128,000 barrier on the first day of the new fiscal year 2025-26.\n\nThe KSE-100 index rose by 2,404.51 points, or 1.9 per cent, to stand at 128,031.82 points at 12:15pm, from the previous close of 125,627.31 points.\n\nIt then closed at 128,199.42 points, recording a gain of 2,572.11 points, or 2.05pc, from yesterday.\n\nYousuf M. Farooq, director of research at Chase Securities, attributed the rise to easing geopolitical tensions and the market “pricing in a gradual decline in interest rates alongside improving economic stability”.\n\n“Investors are also anticipating a strong corporate results season and are rerating the market’s price-to-earnings ratio toward more normalised levels,” the analyst said.\n\nHe added that in his opinion, the market had entered phase two of the bull run, characterised by increasing public participation and a broad-based rally across a wide range of stocks.\n\nAwais Ashraf, director of research at AKD Securities, said investors are increasing exposure in equities from fixed income due to the higher taxation rate imposed on fixed income in the recent budget, choosing high-dividend-yield stocks.\n\n“Continuation of monetary easing due to falling inflation driven by fiscal discipline, strong external account and focus on structural reforms would keep equities in the limelight,” Ashraf said.\n\nHe anticipated that sectors benefiting from monetary easing and structural reforms, particularly related to the energy chain, would remain prominent.\n\nYesterday, the PSX ended the final session of the outgoing fiscal year on a bullish note, with the KSE-100 index soaring to a record high above 125,000. The rally was driven by aggressive buying at attractive valuations and strong year-end fund flows.\n\nAlso on Monday, the government projected a positive export outlook and a moderate rise in inflation to a range of 5-7 per cent for 2025-26, citing improved global economic conditions and domestic recovery trends.\n\nIn its Monthly Economic Update and Outlook for June, the finance ministry said Composite Leading Indicators (CLIs) of Pakistan’s major trading partners — including the UK, US, Eurozone and China — were all operating above their long-term average of 100, suggesting a likely increase in demand for Pakistani exports.\n\nThe ministry also forecast a positive outlook for Large-Scale Manufacturing (LSM) in the coming months, driven by robust trends in cement despatches and automobile sales. “The uptick in private sector credit reflects growing production activity and improved investor confidence,” the report said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/01164329fdb72c0.png",
  "retrievedAt": "2025-08-17T19:24:36.128Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921408/psx-crosses-128000-barrier-on-first-day-of-fy26",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T08:16:37.000Z"
}
