{
  "title": "Trump signs order lifting sanctions on Syria - World - DAWN.COM",
  "author": null,
  "content": "President Donald Trump signed on Monday an executive order terminating a US sanctions programme on Syria, allowing an end to the country’s isolation from the international financial system and building on Washington’s pledge to help it rebuild after a devastating civil war.\n\nThe move will allow the US to maintain sanctions on Syria’s ousted former president Bashar al-Assad, his associates, human rights abusers, drug traffickers, people linked to chemical weapons activities, the Islamic State and ISIS affiliates and proxies for Iran, White House spokeswoman Karoline Leavitt told reporters in a briefing.\n\nAssad was toppled in December in a lightning offensive by Islamist-led rebels and Syria has since taken steps to re-establish international ties.\n\nSyrian Foreign Minister Asaad al-Shibani said Trump’s termination of the Syria sanctions programme would “open door of long-awaited reconstruction and development,” according to a post by the foreign minister on social media platform X.\n\nHe said the move would “lift the obstacle” against economic recovery and open the country to the international community.\n\nSyria’s President Ahmed al-Sharaa and Trump met in Riyadh in May where, in a major policy shift, Trump unexpectedly announced he would lift US sanctions on Syria, prompting Washington to significantly ease its measures.\n\nSome in Congress are pushing for the measures to be totally repealed, while Europe has announced the end of its economic sanctions regime.\n\n“Syria needs to be given a chance, and that’s what’s happened,” U.S. Special Envoy for Syria Thomas Barrack told reporters in a briefing call. He described Monday’s move as “the culmination of a very tedious, detailed, excruciating process of, how do you unwrap these sanctions.”\n\nThe White House in a fact sheet said the order directs the Secretary of State to review the terrorism designations of Hayat Tahrir al-Sham, a rebel group that Sharaa led that has roots in al Qaeda, as well as Syria’s designation as a state sponsor of terrorism.\n\nThe White House said the administration would continue to monitor Syria’s progress on key priorities including “taking concrete steps toward normalising ties with Israel, addressing foreign terrorists, deporting Palestinian terrorists and banning Palestinian terrorist groups”.\n\nA Reuters investigation published on Monday revealed the role of Syrian government forces in the killing of more than 1,500 Syrian Alawites over three days of massacres along the country’s Mediterranean coast in March. The Trump administration had no comment on the Reuters report.\n\nIt was not immediately clear if Washington was lifting the sanctions on any of the factions that Reuters found were involved.\n\nSyrians hope the easing of sanctions will clear the way for greater engagement by humanitarian organisations working in the country, encouraging foreign investment and trade as it rebuilds.\n\nIn the aftermath of Trump’s announcement in May, the US Treasury Department issued a general license that authorised transactions involving the interim Syrian government as well as the central bank and state-owned enterprises.\n\nHowever, the US has imposed layers of sanctions against Syria, some of which are authorised by legislation, including the Caesar Act. Repealing the measures is necessary for Syria to attract long-term investment without parties fearing the risk of violating U.S. sanctions.\n\n“We are now, pursuant to the executive order, going to look at suspension criteria for the Caesar Act,” a senior administration official said.\n\nMost of the US sanctions on Syria were imposed on Assad’s government and key individuals in 2011 after civil war erupted in the country.\n\nThe dismantling of the US sanctions programme on Syria includes terminating from Tuesday a national emergency declared in 2004 and revoking linked executive orders, according to the order signed on Monday.\n\nThe executive order also directs additional actions, including some with respect to waivers of export controls and other restrictions, the order read.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/15093950c4335fd.png?r=094646",
  "retrievedAt": "2025-08-17T19:24:48.860Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921393/trump-signs-order-lifting-sanctions-on-syria",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T05:02:16.000Z"
}
