{
  "title": "Cost of power production from gas plants increases by Re1 - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Costlier electricity result of govt decision to increase gas rate for generators\n• Power minister asks provinces to stop collecting electricity duty in bills\n\nISLAMABAD: The cost of electricity produced from gas-based power plants will go up by Re1 per unit as a result of the government’s decision to increase gas prices.\n\nA public hearing held by the National Electric Power Regulatory Auth­ority (Nepra) on Monday was informed that the government has increased the price of gas for power plants by 17 per cent from Rs1,050 to Rs1,225 per unit from today (July 1).\n\nThe government team, led by Central Power Purchasing Agency (CPPA) CEO Rehan Akhtar, added that even after the increase of Re1, power generation from gas-based plants would still be cheaper than imported coal and LNG-based generation.\n\nMr Akhtar told the public hearing that the CPPA had originally sought Rs0.1 per unit increase in monthly fuel cost adjustment (FCA) for ex-Wapda distribution companies (Discos) for electricity consumed in May which has now been revised.\n\nThe cost of production was Rs7.49 per unit instead of Rs7.39 reference rate charged to consumers in May, leading to an added cost of Rs1.25bn.\n\nHe said overall fuel prices were in line with projections but two major nuclear power plants — Chashma-1 and Karachi Nuclear Power Plant — were on the periodic natural refuelling cycle, resulting in their non-availability.\n\nHe reported the settlement of about Rs5bn with independent power producers had been actualised and required to be surrendered to the consumers, with a benefit of about Rs1.43 per unit.\n\nSince the consumers had been charged Rs0.93 per unit higher FCA during June, the actual benefit to consumers would work out to be 50 paise per unit in July.\n\nSimplified electricity bills\n\nMeanwhile, Power Minister Sardar Awais Leghari has requested provincial governments to abolish the 1pc electricity duty charged in bills.\n\nHe said the move was aimed at “removing complexity arising from multiple charges, taxes, and duties being collected through consumer bills”.\n\nThe electricity duty on power bills has an inconsequential financial impact. For example, on a monthly bill of Rs5,200, the electricity duty would be about Rs53.\n\nThe minister, in separate letters to all chief ministers, stated the federal government was simplifying electricity bills to reflect the actual cost of power consumption, rather than serving as a mechanism for collecting various additional charges.\n\n“As part of this initiative, the Power Division has decided to discontinue the collection of Electricity Duty through electricity bills starting from July 2025. We request provincial governments to explore alternative mechanisms for collecting provincial levies and duties, rather than relying on electricity bills as a collection channel”, the minister said, urging the provinces to cooperate.\n\nCriticism of Power Division\n\nOn the other hand, the Power Division came under strong criticism from Nepra, K-Electric, and Karachi-based consumers for seeking a deferment of Rs4.69 per unit negative FCA adjustment for KE consumers on account of electricity consumed in April.\n\nNepra’s member law, Amina Ahmed, ruled the division had been in “a deep slumber” for the past two years when this issue was being discussed at length and had suddenly woken up to halt the mechanism.\n\nShe said the petition for negative FCA had been in the public domain for quite some time.\n\nNow, the power division has sought a deferment without any approval from the federal cabinet and the prime minister, as required under the Constitution and past orders of the Supreme Court.\n\nThe hearing was also deferred earlier but the power division had failed so far to come up with a legal cover. Power Divison Additional Secretary Mehfooz Bhatti said the issue involved government subsidies and the government wanted to ensure uniform FCA across the country.\n\nHe said the case was in process for cabinet approval and a decision would be available in about 10 to 15 days.\n\nNepra Chairman Waseem Mukhtar and member, Ms Ahmed, indicated that such guidelines could be considered for future dispensation but the current process had to move forward because the power division was a non-entity without clear legal support from the government.\n\nKE’s CEO Moonis Alvi questioned why a proposal for uniform FCA came up when KE consumers were already paying higher FCAs.\n\nThe regulator announced it would examine the matter from a legal standpoint before making a decision.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:25:30.162Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921338/cost-of-power-production-from-gas-plants-increases-by-re1",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T02:58:36.000Z"
}
