{
  "title": "Meet Zohran Kwame Mamdani - World - DAWN.COM",
  "author": null,
  "content": "HIS rise has been swift and vertical. Donald Trump, among others, is struggling to figure out who exactly Zohran Kwame Mamdani is. They know that the newly elected Democratic mayoral candidate for New York in the Nov 4 elections stands for the liberation of Palestine.\n\nThey probably also know that he accuses Narendra Modi of mass murder in Gujarat, even if India’s supreme court has given him the proverbial clean chit for the 2002 carnage of Muslims.\n\nIn a pre-election interview, mayoral candidates were asked if they would help the Indian prime minister hold another rally in the city. All said no, but Mamdani went on to emphasise that he would never wish to meet Modi if elected mayor of New York.\n\nZohran should not perhaps worry about that possibility if reports are true about the possible resignation of Modi in September, when he attains the retirement age of 75 that he set for all BJP office bearers.\n\nBut Mamdani’s critics (and many supporters) don’t quite seem to know how or why he succeeded in toppling the Democratic Party’s applecart by upstaging its poster boy Andrew Cuomo in the race. Cuomo’s elitist supporters include Zionist Jews from Brooklyn, who reportedly helped mobilise a whopping $25 million to defeat Mamdani.\n\nThey are naturally worried by the turn of events. Mamdani’s reply to them was reassuring, even disarming. Hate crimes trouble him equally, including the current antisemitic uptick across the US. His pledge to them was his proposal for an 800 per cent increase in the city’s mayoral budget to arrest hate-crimes.\n\nTrump, nevertheless, has called him a communist lunatic, and reports are coming in of assassination threats to the 33-year-old Ugandan migrant with a winsome smile.\n\nTo appreciate Zohran’s secular and progressive Hindu and Muslim lineage, it might help to look for a clue in his middle name, Kwame. The one Kwame his parents possibly named him after, and who best fits the sketchy political profile we have of the Mamdanis, is Kwame Nkrumah.\n\nThe radical left politician led Ghana to independence from Britain but was overthrown after a short tenure as president by a Western-backed military coup while he was visiting China in 1966. Nkrumah, together with Patrice Lumumba, Kenneth Kaunda and Julius Nyerere, was an idol for post-colonial masses in Africa and beyond. South Asians saw him as a genuine friend, and Jawaharlal Nehru courted him as a comrade. Some say he was the inspiration for Martin Luther King’s doctrine of peaceful resistance.\n\nTo appreciate Zohran’s secular and progressive Hindu and Muslim lineage, it might help to look for a clue in his middle name.\n\nWe also know that Zohran was born in Kampala, where his father of Gujarati Shia Muslim origins, began his journey as a scholar with a focus on colonialism, ethnic strife and migration. Mahmood Mamdani has written outstanding books on colonialism and society, a more widely lauded being Good Muslim, Bad Muslim. To get a handle on the phenomenon, his son is, we may benefit from discussing his father’s scholarly quest.\n\nIn Good Muslim, Bad Muslim, Mamdani discusses the rise of political Islam, and answers questions that Americans have struggled with since Osama bin Laden, the former American protégé, staged a spectacular attack on the US. Mamdani dispels the easy description of ‘good’ Muslims being secular or Westernised and the ‘bad’ being slotted as pre-modern and fanatical. In his view, political Islam emerged from a modern encounter with the West. The terrorist movement at the centre of political Islam is an even more recent phenomenon, one “that followed America’s embrace of proxy war after its defeat in Vietnam”.\n\nThe book seems relevant to today’s perceptions of the Israel-Iran contest. Amid the megaphoned Western vilification of ‘mullahs’ ruling Iran, a 5,000-year-old civilisation is condemned by its parvenue rivals who were largely created from the British-French division of spoils following Turkey’s defeat in 1919. Look carefully, and all the post-Cold War Western targets were utterly secular states — from Iraq to Libya, from Algeria to Syria, and from Lebanon to Yemen. Damned if you are secular, damned if you are not.\n\nMamdani’s other acclaimed works include a signal point of departure in analysing the ethnic violence in Rwanda. Another work, Neither Settler nor Native: The Making and Unmaking of Permanent Minorities posits that the modern state didn’t begin with the 1648 Treaty of Westphalia, but sprang into being in 1492: the year of the expulsion of Jews and Muslims from Spain following the ‘Reconquista’, which coincided with the European colonisation of the Americas.\n\nZohran’s mother, Mira Nair, is a progressive filmmaker. Some of her acclaimed movies are seen in their approach as a facet of parallel cinema. Monsoon Wedding, Mississippi Masala, The Namesake are more widely applauded, though her cinematic work on life in the slums of Uganda is a class apart.\n\nNair’s films are known for their vibrant storytelling, rich cultural textures and exploration of identity, displacement and human connections. The parents’ imprint is palpable in the son’s politics.\n\nWhat makes his win even more remarkable is that Zohran “has refused to back down from his vocal support for Palestinian liberation, a position that has long been a death knell for candidates within a party whose establishment is unabashedly pro-Israel,” said The Guardian.\n\nThere are other compelling factors driving Mamdani’s success. His approach to New York differs from Frank Sinatra’s individualistic quest to arrive at “the top of the heap”. Zohran takes a leaf, instead, from Sahir Ludhianvi’s angst for Bombay. “Cheen o Arab hamara, Hindosta’n hamara/ Rehne ko ghar nahi hai, saara jahaa’n hamara.” (The far corners of the world belong to me, and I am its homeless citizen.)\n\nLike Sahir, Mamdani identifies with “those who toil in the nights, so they can enjoy the fruits of their labour in the day. Where eight hours on the factory floor or behind the wheels of a cab is enough to pay the mortgage, enough to keep the lights on, enough to send your kids to school”.\n\nThe writer is Dawn’s correspondent in Delhi.\n\njawednaqvi@gmail.com\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/686324605dfc2.png",
  "retrievedAt": "2025-08-17T19:25:46.494Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921327/meet-zohran-kwame-mamdani",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T00:00:09.000Z"
}
