{
  "title": "Blow for Thailand’s government as court suspends PM from duty - World - DAWN.COM",
  "author": null,
  "content": "Thailand’s Constitutional Court on Tuesday suspended Prime Minister Paetongtarn Shinawatra from duty pending a case seeking her dismissal, in a major setback for a government under fire on multiple fronts and fighting for its survival.\n\nThe court accepted a petition from 36 senators accusing Paetongtarn of dishonesty and breaching ethical standards, based on a leak of a sensitive telephone call with Cambodia’s influential former leader Hun Sen that was intended to de-escalate a territorial row and tense troop buildup at their border.\n\nThe leaked June 15 call triggered domestic fury and has left Paetongtarn’s coalition with a razor-thin majority after a big party abandoned the alliance and accused her of undermining sovereignty, as protest groups threaten more demonstrations to demand a new government.\n\nPaetongtarn’s battles after only 10 months in office underline an intractable power struggle between the billionaire Shinawatra dynasty and an influential establishment backed by the army — a two-decade grudge match that has seen two military coups and court rulings that have toppled multiple parties and prime ministers.\n\nShe accepted the court’s decision on Tuesday and apologised over the leaked call, during which she kowtowed before Hun Sen and criticised a Thai army commander, a red line in a country where the military has significant clout.\n\n“My true intention in the leaked conversation, my true intention 100 per cent, was to work for the country to maintain our sovereignty and save the lives of all our soldiers,” Paetongtarn told reporters.\n\nIt has been a baptism of fire for political novice Paetongtarn, who at 37 was thrust into the spotlight last year as Thailand’s youngest premier after the Constitutional Court dismissed ally Srettha Thavisin for a violation of ethical standards.\n\nPaetongtarn, the fourth member of her family to hold the top post, has been struggling to revive a stuttering economy and arrest a sharp decline in popularity, with an opinion poll released at the weekend showing her approval rating sinking to 9.2pc in June from 30.9pc in March.\n\nThai shares.SETI jumped 1.8pc after the midday break on expectations that political uncertainty could lead to further cuts in interest rates by the central bank.\n\nDeputy Prime Minister Suriya Juangroongruangkit takes over as caretaker premier while the court decides the case against Paetongtarn, who has 15 days to respond and will stay in the cabinet as the new culture minister following a reshuffle.\n\nPaetongtarn is not alone in her troubles, with influential tycoon father Thaksin Shinawatra, the driving force behind her government, facing legal hurdles of his own in two different courts this month.\n\nPolarising tycoon Thaksin appeared at his first hearing at Bangkok’s Criminal Court on Tuesday on charges he insulted Thailand’s powerful monarchy, a serious offence punishable by up to 15 years in prison if found guilty. Thaksin denies the allegations and has repeatedly pledged allegiance to the crown.\n\nThe case stems from a 2015 media interview Thaksin gave while in self-imposed exile, from which he returned in 2023 after 15 years abroad to serve a prison sentence for conflicts of interest and abuse of power.\n\nThaksin, 75, dodged jail and spent six months in hospital detention on medical grounds before being released on parole in February last year. The Supreme Court will this month scrutinise that hospital stay and could potentially send him back to jail.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/01212740565ce04.jpg",
  "retrievedAt": "2025-08-17T19:23:41.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921463/blow-for-thailands-government-as-court-suspends-pm-from-duty",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T17:17:03.000Z"
}
