{
  "title": "Pakistan calls for internal reform of UN’s counterterrorism architecture - World - DAWN.COM",
  "author": null,
  "content": "Pakistan has called for the internal reform of the UN’s counterterrorism architecture with a balanced and rights-based global framework.\n\nThe country was appointed as the vice chair of the UN Security Council’s (UNSC) Counter-Terrorism Committee on June 4. Prime Minister Shehbaz Sharif said the appointment reaffirmed the international community’s trust in the country’s counterterrorism credentials.\n\nA press release issued today by the Permanent Mission of Pakistan to the UN said that speaking at the UN headquarters a day earlier, Permanent Representative of Pakistan to the UN Ambassador Asim Iftikhar Ahmad said that the counterterrorism architecture should be capable of addressing Prolonged conflicts, while eliminating injustice, oppression and violations of international law under the pretext of counterterrorism, and ending conditions conducive to terrorism.\n\n“We must also clearly distinguish between terrorism and the legitimate struggle against foreign occupation and the right to self-determination,” he was quoted as saying.\n\n“The UNOCT must also integrate respect for human rights and [the] rule of law to prevent abuse of counterterrorism actions by member states. The more we shy away from addressing these issues, the more prolonged our counterterrorism efforts will be.”\n\nHe further said that successful counterterrorism action requires concerted efforts, which were present in the framework of international law.\n\n“He urged the international community to combat all forms of terrorism and take collective action without double standards or discrimination, prevent its exploitation for politically motivated agendas and shift public opinion away from the real challenges that we face today,” the press release read.\n\nAmbassador Asim also called for adequate changes to the sanctions regimes to incorporate new and emerging threats and an end to the stigmatisation of Islam and Muslims, it added.\n\n“While noting a surge in the emergence of right-wing, extremist and fascist movements in several countries, which are leading to terrorist violence, he (Asim) said that we see a strong inclination to see non-Muslim acts of terrorism as just violent crime,” it said.\n\nPakistan’s UN envoy highlighted that counterterrorism remained “one of the most important pillars to address threats to international peace and security”, saying that Pakistan has remained a principal victim of terrorism, with more than 80,000 lives lost and billions of dollars of losses to its economy in the war on terrorism.\n\nHe said that terrorism transcends boundaries and its evolution into new and emerging forms was being facilitated by modern ICTs in an increasingly globalised world, stressing the need for “effective and meaningful” counterterrorism efforts based on “consensually agreed-upon principles driven primarily by member states”.\n\n“Ambassador Asim expressed Pakistan’s concern with the entry of norms, soft laws and ‘non-binding guiding principles’ into the global counterterrorism discourse by either the Security Council through its 1373 CTC and/or expert reports, which do not enjoy consensus of the wider membership,” the press release added.\n\nHe proposed the establishment of a “subsidiary body as an intergovernmental framework” under the General Assembly to oversee its universal consideration.\n\nThe UN Ambassador said that integrating the work of global compact entities such as Interpol and UN agencies with national law enforcement agencies can significantly enhance information and intelligence sharing relating to the movement of terrorists and terror financing.\n\n“We must merge some of the UN entities or restrict their mandates to streamline UNOCT’s work. There are far too many agencies doing similar work, leading to duplication, including capacity building initiatives,” he was quoted as saying.\n\nThe UNSC Counter-Terrorism Committee was established by UNSC resolution 1373 (2001), adopted unanimously on September 28, 2001, after the September 11 terrorist attacks in the United States.\n\nThe committee, comprising all 15 UNSC members, is tasked with monitoring implementation of the above resolution, which requested countries to implement several measures intended to enhance their legal and institutional ability to counter terrorist activities at home, in their regions and around the world.\n\nPakistan was also appointed head of the UNSC committee established pursuant to resolution 1988 (2011), which oversees the implementation of the sanctions measures on the Afghan Taliban.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/0117095040894e3.jpg",
  "retrievedAt": "2025-08-17T19:24:06.336Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921444/pakistan-calls-for-internal-reform-of-uns-counterterrorism-architecture",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T13:30:56.000Z"
}
