{
  "title": "Sahiwal police arrest 3 for allegedly sharing sectarian content on social media - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sahiwal police said on Tuesday they arrested three men in separate cases over the last 24 hours for allegedly sharing hate speech, blasphemous content and sectarian material on social media.\n\nThe Punjab government had ordered a crackdown on hateful content on social media alongside stringent security measures, such as army deployment, as the country gears up to observe Ashura (Muharram 10) on July 6.\n\n“All suspects were arrested following the registration of three FIRs (first information reports),” Sahiwal District Police Officer (DPO) Rana Tahir said, referring to the three men booked in the past two days.\n\n“The police are maintaining zero tolerance to such incidents,” DPO Tahir asserted.\n\n“Our message to the youth is clear: they must exercise caution while using social media, especially in ways that could hurt sectarian beliefs or sacred symbols.”\n\nThe police officer stressed the urgent need to educate young people about the responsible use of social media platforms.\n\nThe arrests were made under sections 295-A (deliberate and malicious acts intended to outrage religious feelings of any class by insulting its religion or religious beliefs) and 298-A (use of derogatory remarks, etc, in respect of holy personages) of the Pakistan Penal Code (PPC), as well as section 11 (hate speech) of the Prevention of Electronic Crimes Act (Peca) 2016.\n\nThe three complaints, two of which were filed on June 29 and one on June 30, detailed the content of social media posts in which remarks “inciting sectarian hatred” against the Shia community were made.\n\nA FIR filed at the City Sahiwal police station by Sub-Inspector (SI) Mohammad Azhar mentioned two Facebook posts shared by an account.\n\nA second FIR filed at City Chichawatni Station on SI Mohammad Jaffar’s complaint mentioned a video posted on a Facebook page shared by a user.\n\nThe third FIR registered at the Ghala Mandi Station by SI Aakash Rohail was based on a WhatsApp status, a screenshot of which was printed and kept in police custody.\n\nDays ago, Sahiwal’s Okanwala Bangla police booked two individuals in separate cases for allegedly spreading sectarian hatred and sharing blasphemous content on social media under sections 295-A and 298-C (person of Ahmadi community calling himself a Muslim or propagating his faith) of the PPC and section 11 of Peca.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/01105036711b93f.jpg?r=105109",
  "retrievedAt": "2025-08-17T19:23:58.321Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921420/sahiwal-police-arrest-3-for-allegedly-sharing-sectarian-content-on-social-media",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T14:00:03.000Z"
}
