{
  "title": "PTI-backed lawmaker Chaudhry Usman Ali ‘joins PML-N’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The stren­gth of the ruling coalition in the National Assembly increased on Monday as a PTI-backed independent member joined PML-N.\n\nThe development came two days after the Supreme Court’s decision to deny PTI reserved seats in the National and provincial assemblies.\n\nThe decision was a se­­rious blow to the main op­­position party, which was facing numerous challe­n­ges, including internal di­­s­­­cord among its leaders.\n\nMNA Chaudhry Usman Ali, who joined PML-N, also called on Prime Minister Shehbaz Sharif on Monday and congratulated him on the federal budget 2025-26.\n\nAccording to the Prime Minister’s Office, Mr Ali expressed confidence in the government’s policies.\n\nThe lawmaker also discussed matters related to his constituency with the prime minister.\n\nThe MNA from Sahiwal had reportedly been awarded development grants worth Rs200 million for 17 uplift projects in his constituency.\n\nThese development schemes will be completed by the end of 2026.\n\nMr Ali won the 2024 general election as a PTI-backed independent candidate, defeating PML-N’s Chaudhry Muham­mad Ashraf, who had won the seat thrice.\n\nMr Ali secured 107,494 votes, compared to Mr Ashraf’s 96,174.\n\nIt was reported that Mr Ali also voted for the 26th Amendment introduced by the PML-N coalition government.\n\nAccording to reports, more PTI-backed independent MNAs might follow Mr Ali and join the ruling party in the near future.\n\nTalking to Dawn, PTI Infor­ma­tion Secretary Sheikh Waqqas Akram said that Mr Ali had alre­ady left the party as he was the only MNA who openly voted in fa­­vour of 26th Constitutional Amendment.\n\n“Later, the PML-N led government gave him Rs 200 million for the schemes in his constituency,” he claimed. He said that Mr Ali’s uncle was a PTI ticket holder from Sahiwal, but later suggested the ticket be given to his nephew (Usman), who is a businessman.\n\nMr Akram claimed that the MNA had taken an oath never to deceive Imran Khan, and had even recorded a video to get votes from the people of his constituency.\n\nBut later, he started saying that the government was threatening him, which was also affecting his business. “He then said he was left with no choice but to support the government,” Mr Akram said.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686350480b431.jpg",
  "retrievedAt": "2025-08-17T19:25:32.533Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921343/pti-backed-lawmaker-chaudhry-usman-ali-joins-pml-n",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T03:03:57.000Z"
}
