{
  "title": "Pakistan and India exchange lists of prisoners - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan and India exchanged the lists of prisoners in each other’s custody through diplomatic channels, the Foreign Office said in a statement on Tuesday.\n\nThe exchange of lists took place in pursuance of the Agreement on Consular Access, 2008. The agreement requires both sides to share the lists of prisoners in each other’s custody on January 1 and July 1, every year.\n\nAccording to the statement, “The government of Pakistan handed over a list of 246 Indian or believed-to-be-Indian prisoners (53 civilian prisoners and 193 fishermen) to a representative of the Indian High Commission, Islamabad. Simultaneously, the government of India shared a list of 463 Pakistani or believed-to-be-Pakistani prisoners (382 civilian prisoners and 81 fishermen) to a diplomat from the High Commission for Pakistan, New Delhi.”\n\nIt said the federal government called for the immediate release and repatriation of all those Pakistani prisoners and fishermen who had completed their respective sentences and whose national status stood confirmed.\n\nIt added that a request for special consular access was also made for all believed-to-be-Pakistani prisoners, including the physically- and mentally-challenged prisoners, for expeditious confirmation of their national status.\n\n“The government of India has been urged to provide consular access to all those prisoners to whom consular access is still awaited. The Indian side has also been urged to ensure safety, security, and well-being of all Pakistani prisoners in Indian custody.\n\n“The government of Pakistan remains committed to addressing humanitarian matters as a priority. It will continue its endeavours to ensure early return of all Pakistani prisoners in Indian jails,” the statement concluded.\n\nThe issue of prisoners remains a sensitive humanitarian concern in the strained bilateral relations. The Pakistan-India Judicial Committee on Prisoners, established in 2007 to address such matters, has been inactive since its last meeting in 2013 due to heightened tensions and the suspension of comprehensive bilateral dialogue by India.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/30165522406dcaa.jpg?r=165732",
  "retrievedAt": "2025-08-17T19:24:22.496Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921424/pakistan-and-india-exchange-lists-of-prisoners",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T11:41:03.000Z"
}
