{
  "title": "Kane double fires Bayern into Club World Cup last eight - Sport - DAWN.COM",
  "author": null,
  "content": "MIAMI GARDENS: Harry Kane scored twice as Bayern Munich overcame determined resistance from Flamengo to book their place in the Club World Cup quarter-finals with an entertaining 4-2 victory on Sunday.\n\nVincent Kompany’s side will now play European champions Paris St-Germain in Atlanta on Saturday for a place in the last four.\n\nFlamengo, backed by a huge and passionate following at Hard Rock Stadium, bow out of the tournament despite a performance of real determination from Filipe Luis’s team.\n\nIt took just six minutes for Bayern to grab the lead when Joshua Kimmich whipped in a corner and Flamengo defender Erick Pulgar’s header flashed into his own net off the far post.\n\nFour minutes later and Bayern had doubled their advantage. Dayot Upamecano won the ball inside Flamengo’s half and fed Kane whose low shot deflected off Leo Ortiz and rattled into the bottom corner.\n\nThe German champions looked like they were going to run away with the game but the three-times Copa Libertadores champions were able to find a foothold in the game.\n\nLuiz Araujo forced Manuel Neuer into action with a dangerous snap shot and then the winger went close again with a shot on the turn which flew just wide of the post.\n\nFlamengo were rewarded for their efforts in the 33rd minute when after the dangerous Araujo played the ball in from the left, the ball fell to Gerson who unleashed a thunderbolt which rocketed past Neuer to bring the bulk of the 60,914 crowd to their feet.\n\nBut all that good work from the Rio team was undone four minutes before the break when Araujo’s poor clearance landed straight at the feet of Leon Goretzka who had the time and space to settle himself before, from over 20 yards out, placing his shot into the corner to make it 3-1.\n\nFlamengo came out determined to respond once again and they reduced the deficit again in the 55th minute when Michael Olise handled a cross from Giorgian de Arrascaeta at close range.\n\nIt was the kind of tough call that has become normal in the modern game and former Chelsea midfielder Jorginho took advantage of the opportunity with an ice-cool conversion.\n\nBut for all Flamengo’s energy, they lacked composure and quality at key moments in the final third — something that could never be said about Bayern.\n\nThe contest was finally settled in the 73rd minute when Konrad Laimer won the ball in midfield and fed Kimmich who in turn slipped the ball through to Kane who confidently beat Agustin Rossi with one of his trademark precision and power drives.\n\nOnce again it was the ability to be clinical in the final third that proved to be the major difference and Flamengo boss Luis doffed his cap to Bayern’s killer touch.\n\n“It’s up to us to simply recognise the superiority of our opponent. They are very good, we knew that. At this level, any mistake is fatal. Those who deserved to go through got through,” he said.\n\nKane conceded it had been hard to finish off Flamengo’s resistance.\n\n“It was a tough game against a good team. I think we played well for long periods of the match, but they kept coming back. They made it difficult for us, especially in the second half,” he said.\n\n“That made the fourth goal so important for us. It will be another tough game against PSG. They’ve had an incredible season. We’ve already played them and won — we need to take that feeling into the game, even though we know it won’t be easy. But we’ve shown that we can beat anyone.”\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68631b13edabd.gif",
  "retrievedAt": "2025-08-17T19:26:11.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921284/kane-double-fires-bayern-into-club-world-cup-last-eight",
  "dateList": "2025-07-01",
  "date_published": "2025-06-30T23:59:50.000Z"
}
