{
  "title": "Bisham seminary teacher held for ‘assaulting’ student - Pakistan - DAWN.COM",
  "author": null,
  "content": "SHANGLA: Police arrested a seminary teacher for allegedly molesting an 11-year-old boy studying at the madressah in Bisham city of Shangla district on Sunday evening.\n\nThe victim told Bisham police that he had been learning the Holy Quran from Qari Abdur Rahim for the last three months. He said that after class on Sunday evening, the Qari called him into his room and locked the door behind him. “He took off my trousers and began to assault me. Despite my screams, he continued to assault me and then threatened to kill me if I tell anyone about it,” he said in the FIR.\n\nMohammad Imran, Moharrar at Bisham police station, confirmed to this scribe that the accused was arrested and his two-day physical remand was obtained from local court on Monday.\n\nHe stated that the FIR was filed against him under sections 506 and 376 of Pakistan Penal Code (PPC). He said that further investigation into the case was under way.\n\nBisham seminary teacher held for ‘assaulting’ student\n\nAWARENESS: An awareness rally was organised in the district headquarters of Alpuri on Monday to educate people about the monsoon and inform them about safety measures to avoid hazards associated with river conditions.\n\nThe rally was held under the supervision of assistant commissioner in Alpuri on the special instructions of deputy commissioner of Shangla. The participants of the rally reached from Alpuri to Dheri Bazaar in vehicles. Holdign banners, they also walked through Belay Baba and Dheri Bazaar.\n\nA large number of participants included the TMO of Alpuri, SHO of local police station, officials of Rescue 1122, elected public representatives, and union presidents from Belay Baba and Dheri Bazaar. The main objective of the campaign was to raise awareness among people about the dangers of heavy monsoon rains and to encourage them to adopt safety measures.\n\nThe participants of the rally urged people to follow government instructions to ensure their safety. They advised them to call Rescue 1122 for timely assistance in case of any emergency.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:25:05.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921376/bisham-seminary-teacher-held-for-assaulting-student",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T03:57:29.000Z"
}
