{
  "title": "Man in Bahawalnagar drowns while saving suicidal wife - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALNAGAR: A young man drowned in Sadiqia Canal while trying to rescue his angry wife who attempted suicide by jumping into the canal after exchanging arguments with him at Mandi Sadiq Ganj on Sunday.\n\nThe deceased was identified as Shahid Mewati, 22, a resident of Kanganpur of Kasur district. According to his family, Mewati married 19-year-old Salma of Mandi Sadiq Ganj of Bahawalnagar district six months back. However, Salma went back to her parents some days back and started living there as she was furious with her in-laws.\n\nOn Saturday, Shahid visited Salma residence to convince her to come back. Meanwhile, the couple exchanged harsh words. At this, Salma jumped into a nearby Sadiqia Canal while Shahid, who did not know how to swim, also jumped into water to save her. Hearing hue and cry of the family, some locals rushed to the spot and rescued the girl but they could not save Shahid who was swept away by the strong waves of the canal.\n\nRescue 1122 spokesman Atiqur Rahman told Dawn a team comprising 12 divers went to the spot and searched for the body from the water after day long efforts.\n\nMURDER: A man allegedly shot his wife dead over a petty issue in Haroonabad.\n\nThe FIR registered with Saddar police stated that Ambreen Bibi (35) of Chak 59/4-R married Akmal Bhatti (36) of the same area some 12 years ago. The couple had five children. The couple often argued over domestic issues. Following some heated arguments, Akmal shot Ambreen dead and fled.\n\nAfter an autopsy at tehsil headquarters hospital, the victim’s body was handed over to the family.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/thumbnail/2025/08/11095605e9eac17.jpg",
  "retrievedAt": "2025-08-17T19:25:26.189Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921350/man-in-bahawalnagar-drowns-while-saving-suicidal-wife",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T03:18:51.000Z"
}
