{
  "title": "Two women die, 15 injured as truck overturns near Faisalabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: Two women died and 15 other persons, including children, were injured when the truck carrying them overturned after hitting the divider on M-3 Motorway, 12 kilometres from Jaranwala Interchange near Faisalabad on Monday.\n\nAccording to Rescue 1122, the members of an extended family were going to the Tarinda Muhammad Panah area of Rahim Yar Khan from the Kahna area of Lahore to condole the death of a relative.\n\nThe rescuers say that the accident occurred when the driver lost control of the vehicle, which hit the divider and overturned.\n\nAs a result, Rabia (55), wife of Abdul Ghafoor and Samia (30), wife of Shabbir, died on the spot, while the rescuers shifted 15 wounded people to Jaranwala Tehsil Headquarters Hospital.\n\nThe bodies were later handed over to the families of the deceased.\n\nThe injured include Anam (13), Azra (37), her husband Abdul Aziz (41), their daughters Khadija (13), Ammara (16), Hurain (7) and son Ayan (6), besides Shamshad (35), her son Adnan (6), deceased woman Rabia’s husband Abdul Ghafoor (59), their daughter Malaika (19), Munawar (51), his Asma (40), Gul Muhammad (63) and Nazir (49).\n\nMeanwhile, in another incident, a biker, identified as Farzand Ali (55), died after being hit and run over by a speeding bus on Khurrianwala Road near Chak 103-RB, Phlahiwala.\n\nA woman, Sidra Yousaf (60), who was riding pillion and was seriously injured in the accident, was shifted to Allied Hospital, Faisalabad.\n\nKIDNAP BID: Locals thwarted an attempt to kidnap a baby girl from Kot Hasnana locality near the shrine of Mai Challian Wali at Jhang on Monday and handed over two beggar women and their as many accomplices, allegedly involved in the crime, to police.\n\nAs per the police, the suspects tranquilised the girl and were about to take her away when locals caught them.\n\nOn being informed of the incident, a Kotwali police team led by SHO Amanullah Qamar arrived there and arrested the suspects.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/201059215a023fa.jpg?r=110021",
  "retrievedAt": "2025-08-17T19:25:25.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921348/two-women-die-15-injured-as-truck-overturns-near-faisalabad",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T03:17:31.000Z"
}
