{
  "title": "No casualties reported as 4.4-magnitude earthquake jolts Lahore, parts of Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "A 4.4-magnitude earthquake jolted Lahore and other parts of Punjab on Tuesday, according to the Pakistan Meteorological Department (PMD).\n\nThe earthquake was recorded at 6:39am, with the epicentre 25 kilometres south-southwest of Lahore at a depth of 14 kilometres. According to the Provincial Disaster Management Authority (PDMA) spokesperson, tremors were felt in Kasur, Okara, Sheikhupura, Mureed and other districts of Punjab.\n\nThere have been no immediate reports of casualties. The respective administrations are inspecting buildings across the province for any sign of damage.\n\nAs per PDMA, the District Emergency Operation Centres across Punjab, including the Provincial Control Room of PDMA, have been placed on alert for the next 24 hours in case of any aftershocks.\n\nPDMA has advised people to report damages to the 1129 helpline.\n\nOn June 30, another earthquake of 3.9 magnitude was recorded at 2:07pm, 35 kilometres west of Dera Ghazi Khan in Punjab at a depth of seven kilometres. The same day, Balochistan recorded a 4.8-magnitude earthquake at 11:11am, 40 kilometres southwest of Zhob at a depth of 20 kilometres.\n\nEarlier on Sunday, a moderate 5.5 magnitude earthquake struck Musakhail, a remote district of Balochistan that borders Punjab, injuring five people and damaging dozens of mud houses. A day prior, low to moderate intensity earthquakes hit parts of Karachi and Pasni in Balochistan.\n\nThe country has experienced many low-intensity earthquakes over the past few months. Pakistan straddles the boundary where the Indian and Eurasian tectonic plates meet, making the country susceptible to earthquakes.\n\n– Additional reporting by Imran Gabol.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/06/666f5af681f16.jpg",
  "retrievedAt": "2025-08-17T19:24:35.410Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921410/no-casualties-reported-as-44-magnitude-earthquake-jolts-lahore-parts-of-punjab",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T08:07:38.000Z"
}
