{
  "title": "MWM slams curbs on Muharram gatherings in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Majlis Wahdat-i-Muslimeen Chairman Senator Allama Raja Nasir Abbas has stro­ngly condemned the Punjab government’s restrictions on Muhar­ram religious gatherings and processions, calling such actions un­­constitutional, illegal and discriminatory.\n\nSpeaking at a press conference alongside senior party leaders at the National Press Club here on Monday, the MWM chairman said: “Azadari of Imam Hussain (AS) has been observed for centuries. It is a religious practice and a constitutional right of all schools of thought in Pakistan. Yet, every year, unnecessary hurdles and tensions are created for the people observing Muharram rituals.\n\n“Punjab government officials are treating peaceful mourners as criminals and those officials’ performance can be gauged by the fact that ban on delivering of Muhar­ram Majalis speeches have been imposed even on some clerics and religious scholars who are now deceased.”\n\nHe condemned the FIRs being filed against organisers and participants of Majalis, as well as bans on entry of clerics and religious scholars in different districts and restrictions on the use of sound systems.\n\nMinister says measures in place to ensure law & order this month\n\nHe described bans on Azadari processions and inspections of Im­­ambargah as hostile acts against the religious freedom guaranteed by the Constitution of the country.\n\n“No one has the right to interfere with our religious rites. These are not just mourning gatherings of Imam Hussain; these are part of the faith for Shias as well Sunnis of Pakistan,” the MWM Senator said.\n\nSenator Abbas appealed to the Federal Interior Minister to take serious notice of the Punjab government’s actions and ensure that Azadari continues without obst­r­uction in all parts of the country.\n\nHowever, provincial minister Azma Bukhari defended her government’s measures. Addressing a press conference in Faisalabad, she claimed that comprehensive security measures were being ado­­pted across the province to ensure peace and order during Muharram.\n\nMs Bukhari said the government was committed to upholding interfaith unity and preventing any disruption to the sanctity and solemnity of Muharram gatherings and processions. However, public cooperation in this regard was imperative, she said and appealed to religious scholars of all sects to play a role for the pea­ceful observance of Muharram.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/27095709e714902.jpg?r=095826",
  "retrievedAt": "2025-08-17T19:26:39.873Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921307/mwm-slams-curbs-on-muharram-gatherings-in-punjab",
  "dateList": "2025-07-01",
  "date_published": "2025-06-30T23:59:36.000Z"
}
