{
  "title": "FBR misses FY25 target by Rs163bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Despite two downward revisions, the Federal Board of Revenue (FBR) missed its revenue collection target by nearly Rs163 billion for FY25, primarily due to sluggish economic growth and a dip in imports that dampened sales tax collection.\n\nProvisional figures show the FBR collected Rs11.737 trillion against the revised target of Rs11.900tr. However, the collection reflects a year-on-year growth of 26.19pc from Rs9.301tr in FY24.\n\nThe government had initially set a target of Rs12.913tr in the budget, which was later revised down to Rs12.33tr and subsequently to Rs11.9tr, reflecting a cumulative downward revision of over Rs1tr to accommodate widening fiscal gaps.\n\nThe budgetary shortfall amounted to Rs1.176tr. However, following downward revisions in the annual revenue collection target to Rs11.90tr, the adjusted gap narrowed significantly—bringing the final shortfall to Rs163bn.\n\nFBR officials attributed the underperformance to over-optimistic projections regarding import volumes, inflationary pressures, and expected high economic growth that failed to materialise.\n\nProvisional collection hits Rs11.74tr vs twice-revised goal of Rs11.9tr\n\nIn June alone, the FBR collected Rs1.499tr, falling short by Rs166bn against the monthly target of Rs1.664tr. Despite this, the June collection was 26pc higher than the Rs1.190tr collected in the same month last year. Officials expect a few billion rupees more to be received in the coming days.\n\nThe persistent shortfall also underscores weak tax compliance, particularly in domestic sales tax collection, despite the withdrawal of major exemptions on items such as stationery and infant formula. Sales tax revenues remained below expectations, suggesting gaps in enforcement and collection processes.\n\nKey factors behind the shortfall included lower tax receipts from imports, subdued manufacturing activity, and a sharp decline in inflation — which dropped to a record 0.3pc in recent months.\n\nIn the FY25 budget, the government introduced Rs1.761tr worth of new revenue measures. Yet, revenue collection still lagged behind the revised target.\n\nThe FBR issued Rs493bn in refunds and rebates to taxpayers during the year, up from Rs480bn a year earlier. Refunds in June stood at Rs33bn, compared to Rs27bn in June 2024.\n\nDuring July-June, income tax collection reached Rs5.781tr, falling short by Rs42bn against the target of Rs5.823tr.\n\nThis reflects a 28pc increase from Rs4.531tr collected last year.\n\nSales tax collection amounted to Rs3.90tr, missing the Rs3.969tr target by Rs69bn, though it marked a 26pc increase over last year’s Rs3.089tr.\n\nCustoms duty collection stood at Rs1.284tr, falling short of the Rs1.350tr target by Rs66bn, though it grew by 16pc compared to Rs1.104tr last year.\n\nThe Federal Excise Duty (FED) collection surpassed its target, reaching Rs767bn against the projected Rs759bn — a growth of 33pc from last year’s Rs577bn.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68632110d17b0.gif",
  "retrievedAt": "2025-08-17T19:26:17.895Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921313/fbr-misses-fy25-target-by-rs163bn",
  "dateList": "2025-07-01",
  "date_published": "2025-06-30T23:59:43.000Z"
}
