{
  "title": "Consolidating power - Newspaper - DAWN.COM",
  "author": null,
  "content": "THIS past week, the worst-kept secret in town finally became public when the court, in its infinite wisdom, decided to award the PTI’s reserved seats to the ruling alliance and beyond. In doing so, some have pointed out, the newly minted bench of the Supreme Court has delivered what it was meant to.\n\nLengthy articles will appear in the coming days, as will long monologues on television, explaining the legal intricacies behind this decision, referencing articles, sections and subsections of the law and the Constitution, which will make no sense to those of us without legal degrees.\n\nHowever, the rest of us will continue to wonder how the blue-eyed parties can end up with seats for which they have no corresponding strength in parliament in terms of directly elected seats.\n\nAfter all, the reserved seats are allocated on the basis of the directly elected seats won by a party (which it seems the PTI is not). This was succinctly pointed out by journalist Majid Nizami on X, who wrote that the PML-N has three directly elected seats from KP but the party will get five reserved seats for women from the province; the JUI-F has two MNAs but will get three reserved seats; and the PPP will get two when it has only one directly elected MNA.\n\nOrdinary people will not really be able to figure out this mathematical equation but they are aware of a simpler principle of Pakistan’s history: this decision has followed the time-honoured tradition of our courts, where politics (and power) trumps legalese, rather than the other way around.\n\nIndeed, for months now, the messengers on television screens had been informing less-informed mortals that the PTI was never going to get the reserved seats. And it wasn’t because the PTI would then gain some super powers and be in a position to push back. Nope.\n\nThis decision was never about the PTI. It was about giving the ruling alliance a two-thirds majority. Best to avoid the kind of tamasha and to-ing and fro-ing that accompanied the 26th Amendment; so much petrol and air-conditioning is wasted as meetings are held and allies and/ or other parties are cajoled to vote with the government. In this time of austerity, such expenses are best not incurred.\n\nJust when we think there is nothing more to reveal they shed another fig leaf.\n\nAnd so much money will be saved as more of the planned legislation will now go through at lightning speed. The menu is extensive, we are told. From providing a legal cover to the hybrid system, to sprinkling some executive glitter on someone’s sheer power, to rolling back the 18th Amendment, there is no end to the predictions. The talk is as varied as there are mouths, goes the Urdu saying. It also holds true of what will now pass from parliament in the coming days and months.\n\nNeither is the plan simply to push through legislation. The canals might be back with a bang, while there is also talk of sending the PTI government in KP home, in a move reminiscent of the 2022 vote of no-confidence. Decisions will now be made because they can; reaction and public anger will prove to be no hurdle. We are in an ‘I am on top of the world looking down…’ moment.\n\nNo one doubts it, and there is little resistance. The political parties gave up a long time ago. Ordinary people, on the other hand, are exhausted, partly from economic pressures and partly from the violence, or the threat of it, inflicted on them. If in the PTI, Imran Khan, his wife and leaders such as Yasmin Rashid have now been behind bars for months and years, no one expects this to change soon.\n\nIn Balochistan, Mahrang Baloch has been silenced, and there is little outrage over this, while Ali Wazir, too, appears to be a case of out of sight, out of mind. Manzoor Pashteen, on the other hand, has disappeared into oblivion.\n\nNo wonder then that those in power think they can get away with anything. And just when we think there is nothing more to reveal they shed another fig leaf. The obscene salary hikes they awarded themselves in the budget were still being discussed when this judgement was announced.\n\nThis happened while terrorist attacks are once again in the news cycle. Half of the country appears to be beyond the writ of the state, and there are deaths from attacks, the effects of climate change and even poverty, but they should keep quiet because there might be another attack by India.\n\nThere is little left to say as the powerless brace themselves for what is to come. For come it will; a legacy that the state and society will grapple with for decades.\n\nThe 1980s left us with a jihad factory and violence from non-state actors that continue to be a challenge. The noughties left us with a newer breed of jihadis, along with a real estate juggernaut and wounds in Balochistan that are now infected. What next?\n\nLastly, it is also necessary to remember that once power is consolidated, the slow journey to weakening also begins. Back in 2002, it seemed as if no one could stop the US, as after the quick and successful invasion of Afghanistan it blithely entered Iraq in order to reshape the Middle East.\n\nWhile the region continues to pay the price of that adventure, the story of the weakening of the world’s superpower can also be traced back to those years.\n\nCloser to home, once the PML-N had staved off the PTI dharna, it seemed as if there would not be a popular challenge to the party in Punjab. Then came Panama.\n\nThe PPP’s rule in Sindh seemed unassailable — until recently, when the canals were announced. And similarly placed was Pervez Musharraf in the summer of 2006 when the Supreme Court struck down the Steel Mills privatisation. One never knows what is lurking around the corner.\n\nThe writer is a journalist.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6863242120816.png",
  "retrievedAt": "2025-08-17T19:24:58.226Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921326/consolidating-power",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T00:00:09.000Z"
}
