{
  "title": "Alcaraz survives Fognini scare to launch Wimbledon defence - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Holder Carlos Alcaraz blew hot and cold on a blazing Monday at Wimbledon but the Spaniard survived a massive scare to beat dangerous Italian Fabio Fognini 7-5, 6-7(5/7), 7-5, 2-6 6-1 and reach the second round.\n\nAlcaraz, bidding to become only the fifth man since tennis turned professional in 1968 to win three consecutive Wimbledon titles, arrived at the All England Club on an 18-match winning streak but the second seed looked out of sorts at times.\n\nHe recovered his level when it mattered most and prevailed to avoid becoming only the third defending champion to lose in the Wimbledon opening round after Manuel Santana in 1967 and Lleyton Hewitt in 2003.\n\nA gracious Alcaraz led the tributes to Fognini in what was the 38-year-old’s final Wimbledon appearance.\n\n“First of all, I don’t know why it’s his last Wimbledon because the level he has shown, you know, he can still play three or four more years. It’s unbelievable,” Alcaraz said.\n\n“He’s a great player. I’m just a little bit sad … but just happy to have lived and shared the court many times with him and in the locker room.”\n\nAlcaraz had to save a couple of break points at 2-1 down in the opening set and three more in his next service game before breaking for a 6-5 lead with a sublime drop shot followed by a lob as fans on Centre Court expected normal service to resume.\n\nFognini conceded the opening set but clawed his way back after surrendering his serve to force a tiebreak in the next and the veteran drew level at one set apiece when Alcaraz missed a simple passing shot at the net.\n\nAlcaraz, who frequently reached for iced towels during the changeovers, regained his grip on the match by winning the third set despite more wobbles, only to lose the next and appeared rattled heading into the decider.\n\nHe moved through the gears, however, and pumped his fists after surging to a 3-0 lead and closed out the contest with no fuss after a lengthy break due to a spectator needing medical attention in the stands.\n\nThe wobbly display was a surprise for fans of the five-times major champion, who is now on a career-best winning streak after lifting titles in Rome, the French Open and at Queen’s Club.\n\nUp next for Alcaraz is a meeting with local qualifier Oliver Tarvet.\n\nRUNE, MEDVEDEV MAKE EARLY EXIT\n\nEarlier on Monday, eighth seed Holger Rune and ninth seed Daniil Medvedev bowed out of the tournament in the first round.\n\nRune blew a two-set lead against Chile’s Nicolas Jarry as he was beaten 4-6, 4-6, 7-5, 6-3, 6-4 in three hours and 34 minutes on Court Three at the All England Club.\n\nThe 22-year-old is yet to make it past the quarter-finals at any of the four Grand Slams, with his best run at Wimbledon ending in the last eight in 2023.\n\nJarry, ranked 143rd, will face American world number 62 Learner Tien in the second round.\n\nMeanwhile, Medvedev found the roasting conditions and a French opponent who had not won a match on grass for three years too hot to handle as the ninth seed suffered a 7-6(2), 3-6, 7-6(3), 6-2 loss to Benjamin Bonzi.\n\nThe Russian, who reached the semi-finals at the All England Club for the last two years, got all hot and bothered as Bonzi brought out what he described as his “A-game” to dispatch the 2021 US Open champion on Court Two, which felt like an oven throughout the three-hour match.\n\nWith Medvedev desperate to preserve his 100% record of reaching at least the second round at Wimbledon, he took out his frustrations on his racket, smashing it to the ground after Bonzi had got the better of him yet again in the third set.\n\nIn the women’s section, Aryna Sabalenka kept her cool to cruise into the second round on the hottest opening day in the history of the championships.\n\nTop seed Sabalenka used ice packs to beat the heat during her 6-1, 7-5 victory over Cana­dian qualifier Carson Branstine on sweltering Court One.\n\nTwo-time Wimbledon finalist Ons Jabeur broke down in tears before retiring from her first-round match against Viktoriya Tomova.\n\nTunisia’s Jabeur was trailing 7-6(7/5), 2-0 when she brought a premature end to her clash with the Bulgarian world number 111.\n\nElsewhere, former French Open champion Jelena Ostap­enko was beaten 7-5, 2-6, 6-2 by Bri­tain’s Sonay Kartal.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/686319cc6ac3b.gif",
  "retrievedAt": "2025-08-17T19:26:03.859Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921272/alcaraz-survives-fognini-scare-to-launch-wimbledon-defence",
  "dateList": "2025-07-01",
  "date_published": "2025-06-30T23:59:50.000Z"
}
