{
  "title": "Government sees exports rising, inflation at 5-7pc in FY26 - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Monday projected a positive export outlook and a moderate rise in inflation to a range of 5-7 per cent for 2025-26, citing improved global economic conditions and domestic recovery trends.\n\nIn its Monthly Economic Update and Outlook for June, the Ministry of Finance said Composite Leading Indicators (CLIs) of Pakistan’s major trading part-ners — including the UK, US, Eurozone and China — were all operating above their long-term average of 100, suggesting a likely increase in demand for Pakistani exports.\n\nFor June, inflation is expected to remain between 3–4pc. The ministry also forecast a positive outlook for Large-Scale Manufacturing (LSM) in the coming months, driven by robust trends in cement despatches and automobile sales. “The uptick in private sector credit reflects growing production activity and improved investor confidence,” the report said.\n\nOn the external front, rising remittances and exports are expected to keep the current account in surplus during FY25.\n\nFrom July to May FY25, the current account posted a surplus of $1.8bn, in stark contrast to a deficit of $1.6bn during the same period last year.\n\nRemittances, export growth and fiscal discipline drive economic optimism\n\nGoods exports rose 4pc to $29.7bn, while imports increased 11.5pc to $54.1bn, widening the trade deficit to $24.4bn from $20bn a year earlier. Key export gains were seen in knitwear (14.5pc), garments (16.4pc), and bedwear (10.6pc). Major import increases were recorded in palm oil (26.3pc) and electrical machinery (13.6pc), while crude oil imports declined 1.7pc.\n\nService exports grew 8.5pc to $7.6bn, with imports rising 6.6pc to $10.3bn, resulting in a $2.7bn services trade deficit. IT exports surged by 18.7pc to $3.5bn.\n\nWorker remittances saw a sharp increase of 28.8pc, reaching $34.9bn from $27.1bn in the same period last year, led by higher inflows from Saudi Arabia and the UAE.\n\nNet foreign direct investment (FDI) stood at $2bn, slightly down from $2.1bn a year ago.\n\nChina remained the top investor with $790.4m, followed by the UK with $229m and Hong Kong with $215.2m. The financial services sector attracted the most FDI at $628.9m, followed by power ($562.8m) and oil & gas exploration ($265.6m).\n\nHowever, foreign portfolio investment recorded net outflows, with $312.5m from the private sector and $311.9m from the public sector. As of June 13, the country’s foreign exchange reserves stood at $17bn, including $11.7bn held by the State Bank of Pakistan.\n\nOn the fiscal side, the report noted that revenue growth outpaced expenditure growth during July-April FY25, reflecting the success of the government’s fiscal consolidation drive.\n\nThe fiscal deficit declined to 3.2pc of GDP, down from 4.5pc in the same period last year, while the primary surplus improved to 3.2pc of GDP from 1.5pc a year earlier.\n\nPublished in Dawn, July 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68632108c8bef.gif",
  "retrievedAt": "2025-08-17T19:26:19.102Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921312/government-sees-exports-rising-inflation-at-5-7pc-in-fy26",
  "dateList": "2025-07-01",
  "date_published": "2025-06-30T23:59:43.000Z"
}
