{
  "title": "Six Karachi policemen get life imprisonment for trafficking drugs - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A sessions court on Monday sentenced six policemen to life imprisonment after 77 kilograms of charas were recovered from their official police van as the contraband was being transported from Jamshoro to Karachi for illegal supply.\n\nAdditional District and Sessions Judge (South) Abdul Hafeez Lashari found six police officials of CIA Jamshoro — Ghulam Abbas, Muhammad Yaqoob, Aijaz Ali Mallah, Abdul Hameed, Rahib Hussain and Ahmed Nawaz — guilty of possessing a total of 77kg of charas. He sentenced them to life imprisonment and awarded an additional two-year sentence under Section 155-C of the Police Order, 2002.\n\n“Evidence available on record established that all the accused, were serving police constables, and they misused their official position, uniform, weapons, and a government-issued police mobile to transport a huge quantity of Charas. This act directly attracts the offence under Section 155(c) of the Police Order, 2002, which deals with misuse of authority by a police officer for wrongful gain or to cause wrongful loss to any person.\n\nThe investigation officer produced official documents showing that the accused were posted at CIA Centre Jamshoro and that the mobile used in the offence was officially allotted to the Incharge CIA. Furthermore, the contraband was recovered from the government vehicle, and the accused were in police uniforms at the time of arrest. These facts establish that the accused committed an offence under Section 155(c), as they clearly abused their lawful authority to engage in illegal drug trafficking,” the court noted.\n\nThe judge observed: “This case strikes at the very heart of public trust, when those sworn to uphold the law instead betray it, the damage reverberates far beyond the courtroom. Police officers are not merely enforcers of justice but they embody the covenant between the state and its citizens. Their participation in criminal acts fractures that covenant, eroding faith in institutions meant to protect society.\n\nIt is a profound violation, for when guardians of law became agents of corruption, the belief of people in justice itself fades. This betrayal demands more than legal consequences. It calls for systemic reckoning. For a society to heal, institutions must not only punish the guilty but restore their own integrity through transparency, accountability, and an unrelenting commitment to the rule of law. Only then can the shattered trust begin to mend.”\n\nThe court also imposed a fine over 500,000 each, on default they would serve additional imprisonment.\n\nAccording to state prosecutor Shakeel Ahmed Abbasi, in July 2021, the Boat Basin police had received a tip-off that a police mobile was transporting a large quantity of charas for illegal supply. Acting on the information, a patrolling team intercepted the vehicle and apprehended six policemen. Two sacks containing charas, weighing a total of 77 kilograms, were recovered from the official police van.\n\nDuring the trial, the defence contended that the seized narcotics produced in court had melted and were not in their original condition. However, the court observed that this objection held no legal merit and noted that charas is a substance that can melt or deform due to heat or pressure.\n\nThe accused, in their statements recorded under Section 342 of the Criminal Procedure Code, claimed they had been arrested by the Rangers personnel at the Jamshoro Toll Plaza. The court dismissed their claim, stating it lacked any supporting evidence.\n\nThe court noted that the prosecution presented consistent and credible evidence — including the FIR and witness testimonies — clearly establishing that the arrests were made near Khayaban-i-Sahil, opposite Sunrise Apartments in Clifton, as mentioned in the FIR.\n\nA case was registered at the Boat Basin police station under Sections 6/9(C) of the Control of Narcotic Substances Act.\n\nPublished in Dawn, july 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/13103009d0d0056.jpg?r=103159",
  "retrievedAt": "2025-08-17T19:25:44.578Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921261/six-karachi-policemen-get-life-imprisonment-for-trafficking-drugs",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T00:00:04.000Z"
}
