{
  "title": "Two traffic policemen gunned down in Lakki Marwat - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two traffic policemen were martyred as unidentified gunmen opened fire on them in Khyber Pakhtunkhwa’s Lakki Marwat district on Tuesday, according to police.\n\n“The traffic cops were on their way to Tajazai Adda for duty on motorcycles when they were fired at on Longkhel Road near Gulbaz Dehqan village,” read a statement by Lakki Marwat police spokesperson Shahid Hameed.\n\n“The martyrs include Israel and Sanaullah, both of whom hailed from the Longkhel [area],” it added.\n\nThe police cordoned off the area and initiated an investigation.\n\nLakki Marwat District Police Officer (DPO) Mohammad Jawad Ishaq specified that the four attackers were riding on two motorcycles and stole the policemen’s submachine guns.\n\nDPO Ishaq further said, “The traffic personnel were dressed in civilian clothes when they were targeted.”\n\nLakki Marwat has seen a rise in attacks in recent months that reflect an increasing militant presence in the area, although unrest dates back to the early 2000s. Militant activity has resurged in recent years, straining local peace efforts and heightening fears of renewed instability.\n\nLast week, the leader of the Shahab Khel peace committee and two of his companions were shot dead by terrorists in Lakki Marwat.\n\nIn June, police said they destroyed several hideouts of terrorists in the forest located along the Kurram and Gambila Rivers in the district during a search and strike operation.\n\nEarlier that month, three terrorists were killed while a cop was martyred in the district’s Kot Kashmir area during a gun battle with the police and local peace committee.\n\nMeanwhile, two suspected terrorists were shot dead after an exchange of fire with police and Counter-Terrorism Department (CTD) personnel in KP’s Bannu district, a police officer said on Tuesday.\n\nPolice and CTD conducted a joint operation against the criminals in Bannu’s Domel tehsil, leading to an exchange of fire from both sides for over 20 minutes, a statement by Regional Police Officer (RPO) Sajjad Khan read.\n\n“Resultantly, two terrorists were shot dead, while their accomplices managed to escape after taking advantage of darkness and nearby bushes,” the statement added.\n\nThe suspects were identified as Hussain Ahmed and Inaam alias Tooru, a resident of North Waziristan’s Haider Khel village.\n\n“The slain terrorists were involved in several major attacks and IED (improvised explosive device) blasts,” RPO Sajjad added.\n\nThe police recovered two AK-47 rifles, four hand grenades, six magazines, 150 bullets, and two mobile phones from the suspected terrorists.\n\nThe alleged terrorist Inaam was wanted by the police and CTD in five different cases for attacking and killing police officers, while Ahmed was wanted in three different terrorist incidents.\n\nRPO Sajjad noted that the Bannu police and the CTD had averted a possible major terrorist attack due to timely action. He said an operation to arrest the escaped suspects has been intensified.\n\nHe asserted that the CTD and police were determined to establish law and order in the area and completely eradicate terrorism.\n\nLast month, several suspects were arrested and a cache of heavy weapons was seized during a joint operation carried out by the police, CTD, and the army in Bannu.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/051412551c02b52.png?r=141542",
  "retrievedAt": "2025-08-17T19:24:42.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921395/two-traffic-policemen-gunned-down-in-lakki-marwat",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T06:11:00.000Z"
}
