{
  "title": "NCHR to engage students, experts in developing tech-driven solutions for challenges faced by SCP",
  "author": null,
  "content": "ISLAMABAD, Sep 24 (APP):The National Commission for Human Rights (NCHR), in collaboration with the Supreme Court of Pakistan (SCP), is launching “Rewiring Rights: Hackathon for Justice”-a first-of-its-kind, four-day national program designed to harness youth-led innovation for judicial reform,said in  a Press Release issued here on Wednesday.\nSupported by the United Nations Development Programme (UNDP), the European Union (EU), Accelerate Prosperity (AP) and KfW, the initiative will convene interdisciplinary student teams and young founders to develop scalable, tech-driven solutions for some challenges facing Pakistan’s justice system. Implementing partners are the National Incubation Center for Aerospace Technologies (NICAT) and O Ventures.\nThe hackathon comes at a critical time: more than 2.1 million cases remain pending in courts across the country as of late 2022, and marginalized groups-including women, rural communities, and persons with disabilities-continue to face systemic barriers in accessing justice.\nThese barriers undermine timely justice delivery and disproportionately affect vulnerable groups. For example, according to the UNFPA Disability Accessibility Assessment of Government Gender-Based Violence Services, courts in KP and Punjab lack the infrastructure to effectively communicate with persons with disabilities, particularly those with hearing and speech impairments.\nOver four days, participants will engage in workshops, mentorship sessions, and collaborative problem-solving to design solutions ranging from digital platforms and Al tools to service blueprints and data-driven interventions. A competitive pitch process will allow teams to present their prototypes before a distinguished jury of legal, tech, and human rights experts. The most promising ideas will be supported for further development, with the potential to be scaled nationally.\nChairperson NCHR, Rabiya Javeri Agha, emphasized the initiative’s importance in reimagining Pakistan’s justice system: “Our courts and institutions need fresh ideas that are inclusive, accessible, and innovative. By engaging students and young founders, this hackathon channels the energy of Pakistan’s youth into justice reform, proving that technology and human rights are not separate spheres, but powerful allies in ensuring dignity, equality, and accountability for all.”\nThis initiative builds on the momentum of the “Promise to Action Conference co-hosted by NCHR and UNDP in April 2025, which underscored the need for translating commitments to justice and equality into concrete, citizen-focused solutions. The Hackathon embodies that spirit-transforming dialogue into innovation, and pledges into practical pathways for reform.\nWith more than 60 percent of Pakistan’s population under 30, NCHR believes empowering youth through initiatives like “Rewiring Rights: Hackathon for Justice is vital to bridging the gap between citizens and institutions.\nAnchored in human rights education and aligned with the Sustainable Development Goals, the Hackathon promises not only to generate practical solutions but also to inspire a generation of change makers who see justice as both their right and responsibility.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:26:39.617Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nchr-to-engage-students-experts-in-developing-tech-driven-solutions-for-challenges-faced-by-scp/",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T22:37:00.000Z"
}
