{
  "title": "SC declares contempt proceedings against former Deputy Registrar",
  "author": null,
  "content": "ISLAMABAD, Sep 24 (APP): The Supreme Court of Pakistan on Wednesday has issued a detailed judgment on the intra-court appeal filed by former Deputy Registrar of the Supreme Court, declaring the contempt proceedings against committee members as void.\nIn a significant constitutional and judicial ruling, the apex court held that no judge can initiate proceedings under Article 204 of the Constitution against a fellow judge, as such matters fall exclusively within the jurisdiction of the Supreme Judicial Council under Article 209. The court observed that judges enjoy constitutional protection, and any allegation of misconduct or mismanagement must be inquired into only by the Council, not by a regular bench.\nThe judgment noted that the orders passed by a regular bench on January 21 and January 27, 2025, stood ineffective, since after the 26th Constitutional Amendment, such cases automatically stood transferred to constitutional benches, stripping regular benches of jurisdiction.\nThe controversy arose during hearings on petitions challenging Section 221-A(2) of the Customs Act, 1969, when a regular bench directed that the cases be relisted before it. However, upon failure to fix the files, the bench issued a show-cause notice to Additional Registrar (Judicial) Nazar Abbas and initiated contempt proceedings against him. Abbas filed an appeal against the notice.\nAllowing the appeal, the Supreme Court ruled that such inter-judicial proceedings undermine the system of justice, observing that the regular bench proceeded in violation of constitutional provisions. It further held that initiating contempt action against committee members was unsustainable and ineffective, adding that such steps damaged the institutional dignity of the judiciary and disturbed harmony among judges.\nConsequently, the court declared the contempt proceedings against the committee members null and void and set aside all related orders.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:27:30.308Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-declares-contempt-proceedings-against-former-deputy-registrar/",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T17:58:00.000Z"
}
