{
  "title": "Riyadh to host FII9 Summit with global leaders, investors, policymakers",
  "author": null,
  "content": "ISLAMABAD, September 24 (APP):The Future Investment Initiative (FII) Institute has unveiled the program and speaker lineup for its flagship FII9 Conference, set to take place from October 27 to 30, 2025, at the King Abdulaziz International Conference Center (KAICC) in Riyadh.\nHeld under the theme “The Key to Prosperity: Unlocking New Frontiers of Growth,” the event will convene more than 15 heads of state, alongside world leaders, policymakers, investors, and innovators, to address the paradoxes shaping the global future – balancing progress with consequences, innovation with constraints, and fragmentation with connectivity.\nAccording to the Saudi Press Agency on Wednesday, FII9 will feature over 600 speakers across more than 230 sessions, reaffirming its position as a global platform for investment, dialogue, and impact. The conference will open with Yasir Al-Rumayyan, Governor of the Public Investment Fund (PIF) and Chairman of the FII Institute Board of Trustees, presenting the 4th Priority Compass – a landmark survey drawing insights from tens of thousands of people across 32 countries representing two-thirds of the world’s population.\n“FII9 is where global leaders align capital with purpose,” said Richard Attias, Chairman of the Executive Committee and Acting CEO of the FII Institute. “The Priority Compass ensures our discussions are not abstract, but rooted in the real concerns of people across the world.”\nThe summit will host high-level debates, fireside chats, and Board of Changemakers sessions on issues including economic cooperation, trade rules for global security, sustainable energy solutions, and responsible innovation.\nProminent confirmed speakers include Saudi Minister of Investment Khalid Al-Falih; Aramco President and CEO Amin Nasser; Pershing Square Capital Management Founder Bill Ackman; Brookfield CEO Bruce Flatt; Carlyle Group Co-Founder David M. Rubenstein; Guggenheim Investments President Dina DiLorenzo; JPMorgan Chase CEO Jamie Dimon; Citi CEO Jane Fraser; BlackRock CEO Laurence Fink; TotalEnergies Chairman Patrick Pouyanné; Bridgewater Associates Founder Ray Dalio; State Street Corporation CEO Ronald O’Hanley; and Alphabet and Google President Ruth Porat.\nThe members-only summit will draw thousands of delegates and global media representatives for four days of discussions and deal-making, reinforcing Riyadh’s growing role as a hub for international cooperation and investment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:26:43.644Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/riyadh-to-host-fii9-summit-with-global-leaders-investors-policymakers/",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T20:40:00.000Z"
}
