{
  "title": "Gaza has become a graveyard for humanity, global conscience; time for action, not words: Dar",
  "author": null,
  "content": "UNITED NATIONS, Sep 23 (APP): Pakistan on Tuesday calling Gaza a graveyard for the humanity and the global conscience, urged the United Nations Security Council and the broader international community to act decisively, uphold human dignity, ensure accountability and justice for the Palestinian people.\n“Gaza has become a graveyard for the humanity as well as for the global conscience… Hospitals, schools and markets lie in ruins. Roads and fatalities have been shattered. The very fabric of society has torn apart. Over 64,000 lives have been lost and over 100,000 have been injured. These are not mere statistics. They were grieving mothers, vanquished fathers, suffering children and revered elders,” Deputy Prime Minister and Foreign Minister Senator Ishaq Dar said in his national statement at the UN Security-Council’s meeting on “The situation in the Middle East, including the Palestinian question” here.\nHe said that the Palestinian people are enduring unimaginable suffering, an unbearable daily toll of human lives, the destruction of homes and neighbourhoods, and the obliteration of essential infrastructure.\nHe said that the humanitarian situation in Gaza has reached catastrophic proportions as famine was now a reality in Gaza City, putting over half a million people at grave risk.\nThe deputy prime minister told the UNSC that the dozens of Palestinians were killed each day and 300,000 people had been uprooted and nearly one million faced imminent displacement.\n“The roar of fighter jets, the plumes of smoke from tank fire and the collapse of buildings. What must this relentless violence mean for women, children and the most vulnerable? And what of the hostages caught in the crossfire whose lives hang in the balance?”\n“The time for action is upon us,” he said and called for urgent and concrete measures including immediate unconditional and permanent ceasefire, full unhindered humanitarian access to Gaza and the immediate lifting of the blockade to allow life-saving aid, and a categoric end to any forced displacement of Palestinians from the lands.\nIshaq Dar reaffirmed Pakistan’s unwavering support for the Palestinian people in their just struggle for dignity, justice and self-determination through the establishment of a sovereign, independent and contiguous Palestinian state on pre-1967 borders with Al-Quds al Sharif as its capital.\nHe welcomed the two-state solution conference shared by France and Saudi Arabia and also appreciated the recent recognitions of the state of Palestine by numerous member states.\n“The time for words has passed. The time for action is now,” he concluded.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:28:02.295Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gaza-has-become-a-graveyard-for-humanity-global-conscience-time-for-action-not-words-dar/",
  "dateList": "2025-09-24",
  "date_published": "2025-09-23T23:18:00.000Z"
}
