{
  "title": "WWF-Pakistan honours environmental heroes with 2024 Conservation Awards",
  "link": "https://www.app.com.pk/national/wwf-pakistan-honours-environmental-heroes-with-2024-conservation-awards/",
  "date_published": "2024-12-06T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP): WWF-Pakistan on Friday hosted a prestigious awards ceremony here to recognise exceptional contributions to environmental conservation and environmental stewardship.\nAwards were conferred to five distinguished individuals in recognition of their significant contributions to safeguarding Pakistan’s natural heritage.\nThe Syed Asad Ali Conservation Award was presented to Muhammad Idrees Nauman of the Wildlife and Fisheries Department, Azad Jammu and Kashmir, for his courageous rescue of a female common leopard stranded 300 feet in a tree.\nMeanwhile, the T.J. Roberts Conservation Award was conferred to Rizwana Aziz of the Punjab Wildlife and Parks Department for her extraordinary efforts in combatting illegal poaching and wildlife trade, strengthening enforcement measures, and raising awareness for wildlife conservation in Punjab.\nThe George Schaller Conservation Award recognised Sana Raja of the Islamabad Wildlife Management Board for her outstanding contributions in rescuing and rehabilitating endangered species, including common leopards.\nThe Herbion Nature Conservation Award, sponsored by Herbion Naturals, recognizes outstanding contributions to the research and conservation of medicinal plants and floral studies.\nIn its inaugural year, the award was presented to Dr Farooq Ahmad of the Punjab Agriculture Department for his groundbreaking work in wetland restoration and biodiversity conservation in Pakistan’s Salt Range region.\nDr. Ahmad’s efforts have led to the protection of over 60,000 acres of land, the promotion of eco-tourism, and significant advancements in environmental education.\nEstablished in partnership with Ahmer Bilal Sufi, Advocate of the Supreme Court of Pakistan and President of the Research Society of International Law, the Al-Mizan Award for Environmental Justice was presented to Raja Waseem Ahmed, an environmental activist. His legal advocacy in Kahoon Valley, district Chakwal, has safeguarded local groundwater and biodiversity, highlighting the crucial role of legal frameworks in environmental protection.\nPresent at the occasion, Ahmer Bilal Sufi lauded the contributions of all recipients and underscored the importance of legal advocacy in achieving sustainable conservation outcomes. “Through these awards, we honour the individuals who have shown compassion towards conservation. Their selfless acts inspire not only us, but the country as well”, he added.\nDuring this keynote address, Syed Rizwan Mehboob, Chairman of the Scientific Committee and Board Member WWF-Pakistan, said “I admire the dedication of these unsung heroes and firmly believe in the vital role that these conservationists play in advancing WWF-Pakistan’s mission to protect the natural world”.\nSpeaking on occasion, Hammad Naqi Khan, Director General WWF-Pakistan, praised the award recipients as true champions of environmental conservation. He highlighted that their tireless efforts embody the core values of WWF-Pakistan, showing the power of passion and persistence in protecting our planet’s most valuable resources. Khan emphasized that their commitment inspires change and ensures a better future for generations to come.\nThe ceremony concluded with a call to action for increased cooperation and innovative solutions to protect Pakistan’s rich biodiversity. These awards not only celebrate past successes but also inspire future generations to champion the cause of conservation.",
  "retrievedAt": "2025-08-10T12:38:34.646Z"
}
