{
  "title": "Tarar, Meta’s global head discuss digital child safety",
  "link": "https://www.app.com.pk/national/tarar-metas-global-head-discuss-digital-child-safety/",
  "date_published": "2024-12-06T11:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP): The Federal Minister for Law and Justice and Human Rights, Senator Azam Nazeer Tarar met with Meta’s Global Head for Human Rights Policy, Miranda Sissons to discuss critical issues related to digital child safety, online protections, and human rights advocacy.\nThe meeting highlighted the success of the “Take It Down” initiative, a collaboration between the Ministry of Human Rights, designed to safely remove harmful and non-consensual content, protecting minors from online exploitation. The launch of the Urdu version of the platform enhances accessibility, broadening its reach to Pakistan’s youth.\nThe meeting further emphasized the ministry’s continued commitment to child rights protection, highlighting ongoing initiatives such as digital literacy campaigns and public awareness programs focused on cyberbullying and online exploitation. These efforts are essential in safeguarding children and empowering families to navigate the digital landscape safely.\nBoth parties also discussed the need for digital law compliance mechanisms, aligning policies with human rights standards to address online harm, extremism, and ensuring that digital platforms remain sensitive to Pakistan’s cultural and religious values. The Minister emphasized the importance of META and inter-ministerial cooperation, particularly with the Ministry of Information Technology and the Ministry of Interior, to effectively implement policies safeguarding human rights in the digital realm.\nSissons recognized the challenges of managing risks on online platforms and expressed Meta’s strong commitment to working closely with the Ministry for long-term solutions. The discussions also highlighted the importance of strengthening the Prevention of Electronic Crimes Act (PECA) 2016, aiming to improve digital governance frameworks while protecting constitutional freedoms. Both parties emphasized the need for policies that balance online safety with respect for cultural sensitivities, reinforcing a shared commitment to enhancing the digital landscape.\nBoth parties agreed on the importance of continuous public awareness campaigns, the development of child safety educational content, and strengthening collaborative efforts to address emerging digital threats. They emphasized the need for ongoing dialogue and shared responsibility to ensure a secure digital environment for all.\nThe meeting concluded with mutual appreciation for the progress made and thanks for the continued collaboration in advancing child protection and human rights in the digital space.",
  "retrievedAt": "2025-08-10T12:39:37.995Z"
}
