{
  "title": "Azam Tarar announces establishment of National Commission for Rights of Minorities soon",
  "link": "https://www.app.com.pk/national/azam-tarar-announces-establishment-of-national-commission-for-rights-of-minorities-soon/",
  "date_published": "2024-12-06T16:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP):Federal Minister for Law, Justice and Human Rights, Azam Nazir Tarar Friday announced that the National Commission for the Rights of Minorities will soon be established.\nAddressing the Christmas celebration event, The Christmas Story, at the Pakistan National Council of the Arts (PNCA), the federal minister said, “The cabinet committee has approved the draft of the long-awaited National Commission for the Rights of Minorities.”\nProminent dignitaries, including Federal Secretary for Information and Broadcasting, Ambreen Jan, Acting Foreign Secretary, Najeeb Durrani, Ambassador of Palestine to Pakistan, Dr. Zubair Mohammad Hamadallah,former MNA Aasiya Nasir and Air Chief Marshal Mujahid Anwar Khan were present on the occasion.\nThe federal minister elaborated that the approval of the draft came after an intense four-hour cabinet meeting. “This long-awaited draft has been formulated in consultation with minority representatives from Parliament and civil society.”\n“We have aimed to make the commission more independent, granting it powers similar to the National Commission for Human Rights and the Ombudsperson,” he stated.\nTarar expressed optimism that the commission would serve as an effective platform for addressing grievances and promoting inclusivity. “We have ensured a balanced representation of all minorities and non-minorities in Pakistan,” he remarked.\nHe said that the draft would soon be available on the ministry’s website and would be presented in the National Assembly and Senate for further discussion.\nStressing unity, he said, “The Constitution of Pakistan clearly states that Pakistan belongs to all of us—Muslims, Christians, Hindus, Sikhs, and others. Our identity and pride lie in being Pakistanis.”\nThe minister also expressed solidarity with the people of Palestine and said, “Our hearts bleed for the atrocities being faced by our brothers and sisters in Palestine and Lebanon. Let us not forget them and pray for their safety and peace,” he urged.\nChairman of the Minorities Commission made by the Supreme Court of Pakistan,  Dr. Muhammad Shoaib Suddle congratulated young performers for their outstanding presentations and highlighted the significant contributions of the Christian community to Pakistan.\n“This country belongs to all its citizens, as Article 25 of the Constitution ensures equal rights and protection under the law for everyone,” he said.\nBishop Azad Marshall also addressed the gathering, appreciating the organizers’ efforts and emphasizing the need to stand in solidarity with Palestinians.\n“While we celebrate Christmas, we must not forget the sufferings of Palestinian Christians and Muslims alike,” he remarked.\nThe event, organized by the Islamabad Christian Fellowship, featured vibrant activities, including tableaus, carols, a cake-cutting ceremony, and decorative stalls, captivating the audience.\nA large number of families attended the celebration, which emphasized messages of love, hope, and interfaith harmony.\nA documentary, presented on the occasion, showcased the invaluable contributions of the Christian community to Pakistan’s progress, from the pre-partition era to the present.\nIt highlighted their achievements in health, education, human rights, defense, and other sectors, portraying them as an inspiration for the nation.\n“Today, we honor the unsung heroes of our Christian community whose dedication and achievements continue to inspire us all,” the documentary concluded.\nThe event was attended by dignitaries, officials from the PNCA, and the Ministry of Information and Broadcasting, making it a memorable celebration of unity and inclusivity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:45:49.827Z"
}
