{
  "title": "Establishment Division promotes 1,875 officers, abolishes 61 posts in efficiency drive, Senate body told",
  "link": "https://www.app.com.pk/national/establishment-division-promotes-1875-officers-abolishes-61-posts-in-efficiency-drive-senate-body-told/",
  "date_published": "2024-12-06T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP):The Senate Standing Committee on Cabinet Secretariat informed on Friday that, over the past four years, the establishment division has promoted 1,875 officers out of 4,943 and eliminated 61 posts as part of a right-sizing initiative designed to enhance efficiency.\nThe Senate Standing Committee on Cabinet Secretariat, chaired by Senator Rana Mahmood ul Hassan, reviewed and discussed reforms aimed at strengthening the civil service and governance. The forum noted that significant progress was made on various key legislative issues and ongoing reforms within the federal bureaucracy.\nThe meeting examined the Establishment Division’s current initiatives to enhance governance. Special Secretary Sara Saeed provided updates on the successful completion of the Establishment Division’s transition to an e-office system.\nSara Saeed, in response to senators’ questions, emphasized the creation of a Civil Services Reform Committee, comprising federal ministers such as Ahsan Iqbal and Musadik Malik, as well as senior secretaries.\nThis committee is tasked with identifying systemic issues and suggesting improvements to strengthen the public service sector.\nThe Standing Committee also held an in-depth discussion on the performance evaluation practices for civil servants. Senator Sadia Abbasi voiced concerns about the existing methods, highlighting their detrimental effect on the efficiency of the civil service.\n“The current system for assessing civil servants has significantly impacted performance, and courts have consistently raised objections to this approach. A more effective system for evaluating officers’ performance is needed,” Senator Abbasi stated.\nAmong the notable items on the agenda, the Civil Servants Amendment Bill 2024 introduced by Senator Qurat-ul-Ain Marri, sparked considerable debate. The bill, which proposes a 10% quota for women and 5% for minorities in the civil service, aims to promote inclusivity and diversity within Pakistan’s public administration. The Committee decided to seek the final opinion of the Establishment Division on this bill in the next meeting.\nIn addition to civil service matters, Senator Anusha Rehman introduced the Abandoned Waqf Property Management Amendment Bill 2024, aimed at improving governance in the management of religious and abandoned properties.  Senator Rehman, who expressed dissatisfaction over the Cabinet Division’s response, particularly regarding the Rs14 billion allocated for the Abandoned Waqf Property Board, a body with all six of its officers currently on deputation.\n“There are serious questions about the financial transparency of this institution. Why is there a need to reinvest its surplus?” Senator Rehman queried, pointing out the inadequacies in the current management structure of the Waqf properties.\nIn further developments, Senator Abdul Qadir raised concerns regarding the salaries of civil servants, advocating for a salary increase to enhance performance. “The pay scale issue must be addressed if we want to fix the performance of civil servants,” he stated, noting that high-ranking officials’ salaries were significantly impacting public perception.\nFinally, the committee reviewed updates on the Balochistan Package which was restarted earlier this year after being discontinued in 2020, signalling ongoing efforts to address regional disparities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:46:57.304Z"
}
