{
  "title": "NA Committee on Science and Technology meeting called off over absence of key officials",
  "link": "https://www.app.com.pk/national/na-committee-on-science-and-technology-meeting-called-off-over-absence-of-key-officials/",
  "date_published": "2024-12-06T17:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP):The 5th meeting of the National Assembly Standing Committee on Science and Technology was called off on Friday due to the absence of the key officials.\nThe meeting, chaired by MNA Khawaja Sheraz Mehmood, expressed unanimous displeasure over the non-attendance of the concerned officials.\nThe committee was set to discuss key agenda items, including a comprehensive briefing from the Pakistan Standards and Quality Control Authority (PSQCA) on its performance over the past three years. The briefing was to cover the Authority’s achievements, challenges in fostering technological innovation and industrial collaboration, operational setup, resource allocation, and structural or administrative hurdles impacting its efficiency.\nHowever, no progress could be made due to the absence of the concerned Secretary.\nThe committee expressed annoyance over the absence, highlighted that it undermines the importance of National Assembly Standing Committees, which are the highest forums for oversight and accountability.\nIt was unanimously decided that future meetings would not proceed unless both the Secretary and the Minister of Science and Technology were present.\nThe committee also recommended that the Minister of Science and Technology personally attend all subsequent meetings to ensure resolution of pending issues.\nThe members emphasized that the absence of key officials disrespects the sanctity of the forum and hampers the committee’s ability to fulfill its mandate.\nThe meeting was attended by MNAs Shahnaz Saleem Malik, Seema Mohiuddin Jamili, Ramesh Lal, Mahtab Akbar Rashid, Sadiq Iftikhar, Sher Afzal Khan, Khurram Shahzad Virk, Mian Ghous Mohammad, Muhammad Moazzam Ali Khan, and senior officers from the Ministry of Science and Technology and PSQCA.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:44:27.629Z"
}
