{
  "title": "PMD forecast rain-wind/thunderstorm with snowfall over hills in country’s upper parts",
  "link": "https://www.app.com.pk/national/pmd-forecast-rain-wind-thunderstorm-with-snowfall-over-hills-in-countrys-upper-parts/",
  "date_published": "2024-12-06T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP): Pakistan Meteorological Department (PMD) has forecast rain-wind/thunderstorm with snowfall over the hills in upper parts of the country due to the cold wave conditions affecting most parts of the country from December 08-14 which would help provide relief to those residing in the smog affected areas.\nA westerly wave was likely to affect upper parts of the country from December 07. The PMD has forecast a significant drop in day and night temperatures due to the cold wave conditions.\nDay temperatures are likely to drop (04-06) degree celsius below normal in Punjab, Khyber Pakhtunkhwa, Gilgit-Baltistan and Kashmir while 05-07 C below normal temperatures in Balochistan and Sindh.\nCold with gusty winds are likely in Sindh, Balochistan and parts of Punjab. Frost is also likely to develop over plains.\nModerate rain-wind/thunderstorm with snowfall over the hills is expected in Chitral, Dir, Swat, Malakand, Buner, Shangla, Manshera, Abbottabad, Kohistan, Astore, Ghizer, Gilgit, Hunza, Skardu, Neelum Valley, Muzaffarabad, Rawalakot, Kotli, Haveli and Bagh from December 07th (night) to December 11 with occasional gaps.\nLight to moderate rain-wind/thunderstorm with snowfall over the hills is expected in Murree, Galliyat, Islamabad, Rawalpindi, Attock, Jhelum, Chakwal, Sialkot, Hafizabad, Gujranwala, Lahore, Sargodha, Khushab, Faisalabad and Jhang from December 07th (night) to December 08 (afternoon).\nAbout the possible impacts, the PMD advised the farmers to manage their activities keeping in view the weather forecast particularly frost conditions.\nThe citizens should avoid long period of outdoor exposure in cold and windy weather during night and morning hours.\nThe tourists and travelers visiting mountainous areas are advised to remain cautious during the period.\nAll concerned authorities have been advised to remain alert and take necessary measures to avoid any untoward situation particularly in northern areas.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:40:08.624Z"
}
