{
  "title": "Chairman CDA inaugurates digital smart parking management system at F-7 Markaz",
  "link": "https://www.app.com.pk/national/chairman-cda-inaugurates-digital-smart-parking-management-system-at-f-7-markaz/",
  "date_published": "2024-12-06T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP):Chairman CDA Muhammad Ali Randhawa inaugurated digital smart parking management system at F-7 Markaz during the event of oath taking ceremony of trader’s union.\nDuring the event, Chairman CDA stated that the authority has been making many efforts to maintain and uplift the Marakazs of Islamabad.\nHe also stressed the needs for the Marakazs having its own revenue stream for their uplift.\nIn this connection, he stated that the digital parking is an important initiative and the revenue generated from the digital parking will be utilized for development and uplift of the Marakaz. The digital parking initiative is being introduced throughout Islamabad in a phased manner.\nChairman CDA also highlighted that the Digital smart Parking will not only ensure revenue generation, but will also help in mitigating traffic congestion with better traffic management.\nThe Digital Parking will also provide complete visibility to CDA about the revenue being generated on daily basis. It will also facilitate the public by introducing multiple digital payment options including payment via digital wallets, debit cards and credit cards.\nDuring the event, the members of the Trader’s Union also presented their suggestions and concerns regarding the development and betterment of Marakazs.\nChairman CDA assured the members of the Trader’s Union that their suggestion and concerns would be carefully reviewed, and CDA would make its utmost efforts to address those concerns while viable suggestions would be taken into considerations in the policy and decision making.\nThe event was also attended by Member T&D, Deputy Commissioner (ICT) and the relevant CDA officers while the members of the Trader’s Union were also present.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:46:40.331Z"
}
