{
  "title": "Committee constituted for drafting rules regarding judges appointments",
  "link": "https://www.app.com.pk/national/committee-constituted-for-drafting-rules-regarding-judges-appointments/",
  "date_published": "2024-12-06T18:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP):The Chairman Judicial Commission of Pakistan and Chief Justice of Pakistan on Friday constituted a committee for drafting rules to regulate procedure and criteria for appointment of judges.\nThe committee would drafting rules and share the same with the Secretariat of the Judicial Commission of Pakistan by 15th December, 2024. Mr. Justice Jamal Khan Mandokhail, Supreme Court’s Judge is appointed chairman of the committee and other members include Mr. Mansoor Usman Awan, Attorney General of Pakistan, Barrister Syed Ali Zafar, Senator, Mr. Farooq Hamid Naek, Senator and Mr. Akhtar Hussain, Senior ASC.\nThe committee will have support of the officials including Niaz Muhammad Khan, Secretary JCP, Mr. Zafar Iqbal, Research Officer, Supreme Court and Mr. Qaiser Abbas, Research Officer, Supreme Court.\nThe Committee is expected to furnish the draft rules by 15th December, 2024.The meetings of the Judicial Commission of Pakistan, Judicial Commission of Pakistan (High Court of Sindh) and Judicial Commission of Pakistan (Peshawar High Court) were convened today on 6th December, 2024 (Friday). The Chief Justice of Pakistan, Mr. Justice Yahya Afridi chaired the meetings.\nThe JCP unanimously decided to accord highest priority towards framing of rules relating to regulating its procedure including the procedure and criteria for assessment, evaluation and fitness for appointment of Judges. The committee authorized the Chairman/chief justice of Pakistan to nominate members out of the commission for the purpose of constituting the committee.\nMr. Justice Munib Akhtar joined the meeting through video link Supreme Court, Branch Registry, Karachi. The members attended the meetings in person include, Mr. Justice Yahya Afridi, Chief Justice of Pakistan / Chairman JCP, Mr. Justice Syed Mansoor Ali Shah, Judge Supreme Court, Mr. Justice Munib Akhtar, Judge Supreme Court, Mr. Justice Amin-ud-Din Khan, Judge Supreme Court, Mr. Justice Jamal Khan Mandokhail Judge, Judge Supreme Court, Mr. Justice Muhammad Shafi Siddiqui, Chief Justice of High Court of Sindh, Mr. Justice Ishtiaq Ibrahim, Chief Justice of Peshawar High Court, Mr. Justice Ijaz Anwar, Judge of Peshawar High Court, Mr. Justice Muhammad Karim Khan Agha, Judge of High Court of Sindh, Mr. Azam Nazeer Tarar, Federal Minister for Law and Justice, Mr. Mansoor Usman Awan, Attorney General for Pakistan, Sheikh Aftab Ahmad, MNA, Barrister Ali Gohar, MNA, Barrister Ali Zafar, Senator, Mr. Farooq Hamid Naek, Senator, Mr. Zia ul Hassan Lanjhar, Minister for Law and Parliamentary Affairs, Sindh, Mr. Aftab Alam Afridi, Minister for Law, Khyber Pakhtunkhwa, Mr. Akhtar Hussain, Senior ASC, Ms. Roshan Khursheed Bharucha, Nominee of the Speaker National Assembly, Mr. Munir Hussain Lughmani, Representative of the Khyber Pakhtunkhwa Bar Council and Mr. Qurban Ali Malano, Representative of Sindh Bar Council.\nThe meetings took up for consideration the agendas including Constitution of Rules Committee for preparing draft rules for procedure of Judicial Commission of Pakistan,   Nomination of Mr. Justice Shahid Bilal Hassan Judge Supreme Court of Pakistan as judge for Constitutional Benches in the Supreme Court. Nominations for appointment as Additional Judges for Peshawar High Court and High Court of Sindh and to consider the 02 names of sitting Judges of the High Court of Sindh for the Constitutional Benches.\nThe Commission also approved the nomination of Mr. Justice Shahid Bilal Hassan, a judge of the Supreme Court for the constitutional benches of the Supreme Court.\nIn its second meeting, the Judicial Commission of Pakistan (Peshawar High Court) the agenda of appointment of Additional Judges for the Peshawar high court was deferred till 21st December, 2024. It was also decided to extend the date of submission of nominations for appointment of Additional Judges till 10th December, 2024.\nThe Judicial Commission of Pakistan (Sindh) nominated Mr. Justice Adnan-ul-Karim Memon and Mr. Justice Agha Faisal as Judges of Constitutional Benches of the High Court of Sindh by a majority vote. In the meeting of the Judicial Commission of Pakistan (High Court of Sindh) the agenda for appointment of Additional Judges for the High Court of Sindh was deferred till 21st December, 2024. It was also decided to extend the date of submission of nominations for appointment of Additional Judges till 10th December, 2024.\nEarlier, in a joint preliminary meeting, the Commission received a detailed presentation from the IT experts in using technology in order to reduce the massive paper load involved in the decision-making process of the Commission.\nThe Chief Justice of Pakistan / Chairman of the Commission informed the participants that the move is intended to reduce the burden of the secretariat and members of the Commission. The members of the Commission appreciated the efforts and agreed to switch to the technology gradually for ease of the members.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:43:39.181Z"
}
