{
  "title": "NOWPDP launches “Shanakht” to highlight importance of PWDs",
  "link": "https://www.app.com.pk/national/nowpdp-launches-shanakht-to-highlight-importance-of-pwds/",
  "date_published": "2024-12-06T08:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP): The Network of Organizations Working for People with Disabilities (NOWPDP) has launched the National “Shanakht” Campaign to address the under-representation of persons with disabilities (PWDs) in the national database and the subsequent impact on inclusive policy development.\nThe initiative was unveiled on the International Day of Persons with Disabilities (PWDs) accompanied by a powerful video aimed at challenging societal attitudes and stigmas surrounding disability.\nThe video emphasizes the importance of recognizing the potential of every individual, enabling them to live independent and fulfilling lives.\nNOWPDP’s Shanakht Campaign brings together voices from diverse social, economic, and political sectors across Pakistan, united in their support for PWDs.\nA proud recipient of the Zero Project Award 2025, NOWPDP has been working for the empowerment of persons with disabilities (PWDs) since 2008 and has transformed the lives of over 100,000 individuals in the past 16 years.\nRecognising the systemic nature of marginalization experienced by PWDs, through its 7 pillars, NOWPDP provides guidance, identity, welfare, education, skills development, and employment opportunities to PWDs.\nFor PWDs to be recognized as citizens of the state and gain access to basic rights is the first step towards ensuring their inclusion and equitable participation in all spheres of life. However, a majority of PWDs and the general public remain unaware of the existence and importance of Special CNICs – the official identity document specifically issued for PWDs that not only grants them their due rights and recognition but also entitles them to certain government-mandated benefits.\nAccording to NOWPDP CEO Omair Ahmad, the organization has already facilitated over 15,000 PWDs in obtaining Disability Certificates and Special CNICs through its One-Window Camps. However, the majority of PWDs are still unaccounted for, highlighting the need for the Shanakht Campaign to ensure that PWDs are recognized as equal citizens, entitled to their basic rights and the opportunity for inclusive participation in all aspects of life.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:41:00.690Z"
}
