{
  "article_id": "2025-05-11_c745b62fdaf7f792c31ca1b931889ee5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sardar-awais-lauds-armed-forces-on-historic-success-against-india/",
    "retrieved_at": "2025-08-27T15:20:48.642Z"
  },
  "metadata": {
    "title": "Sardar Awais lauds armed forces on historic success against India",
    "author": null,
    "date_published": "2025-05-11T11:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 304,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 11 (APP): Federal Minister for Power Sardar Awais Ahmed Khan Leghari on Sunday congratulated the nation on 'Thanksgiving Day', and called it a moment to honor Pakistan's unity and strength in the face of recent Indian aggression. Speaking on the occasion, Leghari praised the country's leadership and armed forces for their role in defending the nation against external aggression. \"When the enemy attacked, Pakistan stood firm and made history,\" he said in a statement issued here. The minister said timely decisions by Prime Minister Muhammad Shehbaz Sharif and other political leaders led the country to success. \"I pay tribute to Prime Minister Shehbaz Sharif and all leaders who guided Pakistan through this testing time,\" he added. Sardar Awais said that the response of the Pakistan Armed Forces and their performance was a source of pride for the nation. \"Every move by the enemy was met with a strong response. Our forces showed courage and professionalism that made every citizen proud,\" he said. He also lauded the the sacrifices and commitment of armed forces and called it a shared victory for both the forces and the people of Pakistan. Reaffirming Pakistan's stance, Leghari said the country seeks peace but will not accept threats to its sovereignty. \"Pakistan has shown the world that while we desire peace, it should never be mistaken for weakness,\" he noted. He added that if war is forced upon Pakistan, the response will be decisive. The minister praised the resilience of the nation, saying, \"Our people have proven they have the courage to face any challenge.\" He emphasized that Pakistan will never compromise on its sovereignty, dignity, or territorial integrity. \"Alhamdulillah, Pakistan has emerged as stronger nation. This was made possible by the grace of Allah, the unity of our people and the vision of our leaders,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}