{
  "article_id": "2025-05-11_749b9c878e7e10b8a3f646ea277ef5ec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-welcomes-president-trumps-statement/",
    "retrieved_at": "2025-08-27T15:20:52.526Z"
  },
  "metadata": {
    "title": "Pakistan welcomes President Trump’s statement",
    "author": null,
    "date_published": "2025-05-11T09:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 358,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 11 (APP): Pakistan on Sunday welcomed the statement by the United States (US) President Donald J. Trump regarding Pakistan-India relations and appreciated his willingness to support efforts aimed at the resolution of the longstanding Jammu and Kashmir dispute that has serious implications for peace and security in South Asia and beyond. \"We acknowledge with appreciation the constructive role played by the United States, alongside other friendly states, in supporting the recent ceasefire understanding between Pakistan and India; a step towards de-escalation and regional stability,\" the Foreign Office said in a statement issued here. Earlier, President Donald J. Trump wrote on his Truth Social wall, a social media platform saying: \"I am very proud of the strong and unwaveringly powerful leadership of India and Pakistan for having the strength, wisdom, and fortitude to fully know and understand that it was time to stop the current aggression that could have lead to the death and destruction of so many, and so much. Millions of good and innocent people could have died! Your legacy is greatly enhanced by your brave actions. I am proud that the USA was able to help you arrive at this historic and heroic decision.\" Pakistan, it said, reaffirms that any just and lasting settlement of the Jammu and Kashmir dispute must be in accordance with the relevant United Nations Security Council resolutions and must ensure the realization of the fundamental rights of the Kashmiri people, including their inalienable right to self-determination. Pakistan remains committed to engaging with the United States and the international community in efforts to promote peace, security, and prosperity in the region. \"We also look forward to deepening our multifaceted partnership with the United States, particularly in the areas of trade, investment, and economic cooperation,\" the Foreign Office statement added. President Trump had mentioned in his Truth Social post: \"While not even discussed, I am going to increase trade, substantially, with both of these great Nations. Additionally, I will work with you both to see if, after a \"thousand years,\" a solution can be arrived at concerning Kashmir. God bless the leadership of India and Pakistan on a job well done!\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}