{
  "title": "October 8 to be observed as National Resilience Day: President",
  "link": "https://www.app.com.pk/national/october-8-to-be-observed-as-national-resilence-day-president/",
  "date_published": "2021-10-07T19:07:00.000Z",
  "source": "APP",
  "content": "In a message on the occasion of remembrance of 8th October earthquake, he said the catastrophic earthquake resulted in the loss of thousands of human lives, besides affecting livelihoods of the people and damaging the health, education and road infrastructure of the country.\n“The day is also a reminder that we live in a region marked as highly vulnerable to natural disasters, and there is a strong need to strengthen and equip our departments and create awareness among the people about disaster prevention and preparedness.\n“Over the years, Pakistan has witnessed multiple natural disasters in the form of earthquakes, landslides, and recent urban flooding which caused the loss of millions of dollars, not to mention the irreparable loss of lives,” he added.\nThe president noted that the people of Pakistan had faced disasters with courage and resilience, however, there was a strong need for unrelenting efforts to boost our capabilities, understand the role of climate change and global warming in causing fires, heatwaves, floods and cyclones.\nDuring the Covid-19 pandemic, the government devised a wise strategy to effectively respond to the pandemic and contain it by enforcing the policy of smart-lockdowns and creating awareness among the people, he added.\nDr Arif Alvi said, “It is heartening to state that the international community widely acknowledged Pakistan’s strategy to overcome the pandemic.”\nThe government of Pakistan was determined to make communities resilient, build the capacity of departments like the National\nDisaster Management Authority (NDMA), and make Pakistan a prosperous and stronger country.“Today, we reaffirm our resolve to continue to invest our energies in this direction to make our future generations safer.”",
  "retrievedAt": "2025-08-11T21:25:32.556Z"
}
