{
  "title": "Sindh govt hand in glove with profiteers fleecing consumers by selling costly wheat flour: Farrukh",
  "link": "https://www.app.com.pk/national/sindh-govt-hand-in-glove-with-profiteers-fleecing-consumers-by-selling-costly-wheat-flour-farrukh-2/",
  "date_published": "2021-10-08T10:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Friday said the Sindh government was hand in glove with the mafia fleecing the consumers by selling wheat flour at higher rates.\nAddressing a press conference along with Special Assistant to the Prime Minister on Maritime Affairs Mahmood Maulvi here, he said the ruling elite of Sindh including Asif Zardari, Bilawal Bhutto and Murad Ali were responsible for adding fuel to the injury of people by not releasing the public stock of wheat to the flour mills.\nHe said profiteers and hoarders were at par with the Sindh cabinet and they were being facilitated to mint money at the coast of poor consumers, adding, the ruling elite had its share in the ill-gotten money.\nHe said it was responsibility of the government release wheat stock as such interventions help stabilize its prices. He reiterated the demand that the Sindh government should release the government stock of the wheat at the earliest to provide relief to the consumers.\nThe Punjab and KPK governments had been releasing the public stock to flour mills at subsidized rates of the respective provinces to stabilize the prices of the commodity whereas Sindh government had not released any public sector stock so far.\nHe said in Punjab and KPK, flour mills were provided 40 kg of wheat at Rs 1950 and which they were selling at Rs 1100 per 20 kg bag.\nOn the contrary the people of Sindh especially Karachi were purchasing 20 kg flour bag at Rs 1450 to 1500 which was unjustified.\nHe said Ministry of National Food Security and Research, a couple of days ago, wrote a memorandum to the Sindh government with the observation that pricing trend in Sindh indicated that due to delay in release of wheat from public stock by the food department, prices were unstable in the province.\nThe minister said despite having the public wheat stock about 1.269 MMT, no releases had been started so far by Sindh government.\nThe memorandum said in the absence of public interventions, the traders and hoarders were making profit by increasing prices and fleecing the common consumer.\nFarrukh said in past, wheat worth Rs 13 billion in Sindh was eaten by rodents, perhaps this time also the wheat stock had been wasted by the government. He said the stock was not eaten by the rodents, it was sold by the Sindh rulers and pocketed the money.\nTo a question, he said during past one year the federal government had given Rs 24 billion subsidy to Utility Store Corporation and during past one and half year Rs 30 billion subsidy were given to Utility Stores Corporation where commodities were available at 15 to 20 per cent cheaper than the open market rates.\nHe said the government was also working on a scheme of direct subsidy to the poor people and its modalities were being finalized. He said either they would be given ration cards or would be given cash subsidy, adding, decision in this regard would be made soon.\nFarrukh said the government was also holding consultations with ghee mills owners and mulling to reduce taxes on the commodity and provide relief to the consumers in cooking oil and ghee prices.\nHe said the Federal Government had been working on many uplift programs in Sindh especially Karachi adding, the government gave Rs 1100 billion package to Karachi, besides Rs 450 billion package for other districts of the province.\nHe said the federal government had built green line bus project for Karachi people and its buses had arrived. Similarly it was working on water supply project K-IV, remodeling of nullahs, Karachi Circular Train and Karachi Trade Corridor. On the other hand the Sindh rulers were busy in making fake accounts and transferring money to their foreign banks.\nSpecial Assistant to Prime Minister on Maritime Affairs Mahmood Maulvi said if the Sindh government had not purchased enough quantity of wheat at the time of harvesting, it should inform the federal government which so that it could be released from its reservesto stabilize the price of the commodity.\nHe said the Sindh people in general and Karachi people in particular gave mandate to Pakistan Tehreek-e-Insaaf and it would not leave them on the mercy of the Sindh government.",
  "retrievedAt": "2025-08-11T21:25:27.486Z"
}
