{
  "title": "China, U.S. agree to bring ties back to right track after Switzerland meeting",
  "link": "https://www.app.com.pk/national/china-u-s-agree-to-bring-ties-back-to-right-track-after-switzerland-meeting/",
  "date_published": "2021-10-08T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP): China and the United States agreed to work together for bringing bilateral relations back to the right track during their latest round of key talks in Zurich, Switzerland.\nThe consensus was reached during talks held Wednesday between Yang Jiechi, a member of the Political Bureau of the Communist Party of China (CPC) Central Committee, and the US National Security Advisor Jake Sullivan.\nThe two sides, in a candid manner, had a comprehensive and in-depth exchange of views on China-U.S. relations as well as international and regional issues of common concern, China’s CGTN television channel reported.\nThe meeting was described as constructive, and conducive to enhancing mutual understanding.\nWhen China and the United States cooperate, the two countries and the world will benefit; when they are in confrontation, the two and the world will suffer seriously, said Yang, also director of the Office of the Foreign Affairs Commission of the CPC Central Committee.\nThe U.S. needs to have a deep understanding of the mutually beneficial nature of China-US relations and correctly understand China’s domestic and foreign policies and strategic intentions, said Yang, adding that China opposes defining relations between the two nations as “competitive.” He said that China attaches importance to the positive remarks on China-U.S. relations made recently by U.S. President Joe Biden, and has noticed that the U.S. side said it has no intention of containing China’s development and is not seeking a “new Cold War.”\nChina hopes the U.S. could adopt a rational and pragmatic China policy, and, together with China, follow a path of mutual respect, peaceful coexistence and win-win cooperation, with respect for each other’s core interests and major concerns. During the meeting, Yang expounded China’s solemn position on issues related to Taiwan, Hong Kong, Xinjiang, Tibet and human rights as well as on maritime issues, urging the United States to truly respect China’s sovereignty, security and development interests, and stop using these issues to interfere in the Asian nation’s internal affairs.\nThe U.S. expressed its adherence to the one-China policy. The two sides also exchanged views on climate change and regional issues of common concern and agreed to maintain regular dialogue and communication on important issues.",
  "retrievedAt": "2025-08-11T21:25:20.241Z"
}
