{
  "title": "Govt is privileged right to pass ordinance under Article 89; Maleeka",
  "link": "https://www.app.com.pk/national/govt-is-privileged-right-to-pass-ordinance-under-article-89-maleeka/",
  "date_published": "2021-10-08T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP):Parliamentary Secretary for Law and Justice Maleeka Bokhari on Friday said that the government is empowered to pass ordinances under Article 89 of the Constitution.\nIn response to Senator Raza Rabbani’s statement, Maleeka said that Rabbani is a senior lawyer and an expert in understanding the constitutional and legal complexities.\nShe said that Raza Rabbani had played a key role in drafting the 18th Amendment and if he was aware that Article 89 of the Constitution was unconstitutional, he would removed from the 18th Amendment.\nThe government exercised its constitutional right through Article 89 of the Constitution, she added.\nShe said that the government brought the NAB ordinance to give a legal cover to the tenure of Acting Chairman.\nAs far as the observance of the Constitution was concerned, Raza Rabbani was told that the step taken by the government were in accordance with the Constitution and this constitutional privilege had not been taken away in the 18th Amendment, she added.\nShe said that the government had made it clear that it wanted to introduce this ordinance as an act in Parliament so that the process of consultation could begin in Parliament.\nThe Pakistan Tehreek-e-Insaf (PTI) believed in consultation, advancing legislation and improving the justice system, she added.\nShe said that if the opposition had any positive suggestions that could improve the draft law, the government would welcome it. The opposition could bring a better amendment to the draft law when the act would be introduced in Parliament, she added.\nMaleeka said that the opposition should must present its submissions in the forum of Parliament. Like other opposition leaders, Raza Rabbani was repeating the same thing that the government had been acquitted by passing this ordinance.\nShe said that If Raza Rabbani read Constitution carefully, he would understand that all the ministers and cabinet members of PTI comes under the definition of public office holder.\nIf there was a complaint of corruption against any member of the government, the NAB had right to proceed with the investigation.\nThe PTI always welcome accountability in its ranks, she concluded.",
  "retrievedAt": "2025-08-11T21:25:37.969Z"
}
