{
  "title": "October 8 affected lost entire generation during devastating earthquake: Gandapur",
  "link": "https://www.app.com.pk/national/october-8-affected-lost-entire-generation-during-devastating-earthquake-gandapur/",
  "date_published": "2021-10-08T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP):Minster for Kashmir Affairs and Gilgit Baltistan Ali Amin Khan Gandapur Friday said that the Kashmiri people had lost an entire generation in the devastating earthquake of October 8, 2005, which had heavily affected Azad Jammu Kashmir (AJK) and Khyber Pakhtunkhwa (KP).\nIn his special message on the occasion of October 8 Earthquake Anniversary, he said that the memories and grief for losing their loved ones were still alive in the hearts of the affected people after 16 year of the earthquake 2005.\nThe Federal Minister has also expressed deep sorrow over the loss of life and property due to the earthquake in Balochistan.\n“We have to work out a systematic plan to protect our generations from increasing natural disasters and evolve an effective strategy for disaster mitigation, optimum preparedness of disaster management to cope with the emergency situation, said Ali Amin Gandapur.\nPakistan, he said was facing immense challenges amid environmental pollution and global warming.\nAmin said Prime Minister Imran Khan has a vision to tackle climate change through the Ten Billion Tree Tsunami Plantation project which was being praised globally.\nThe development of the construction sector has to be made as per the geographical features and terrain of the country, he said, adding, “Strict enforcement of construction codes and laws essential for enduring natural disasters is also imperative for disaster resilient infrastructure.”\nGandapur said the Pakistan Tehreek-e-Insaf (PTI) government was fighting to eradicate mafia in every sector for a bright and safe future of the coming generations.\n“The government is ensuring quality and merit in every field through transparent governance,” he concluded.",
  "retrievedAt": "2025-08-11T21:25:23.855Z"
}
