{
  "title": "Logo launched to commemorate 70th anniversary of Pakistan-Thailand diplomatic ties",
  "link": "https://www.app.com.pk/national/logo-launched-to-commemorate-70th-anniversary-of-pakistan-thailand-diplomatic-ties/",
  "date_published": "2021-10-08T16:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP): A joint logo to commemorate the 70th anniversary of the establishment of diplomatic relations between Pakistan and Thailand was launched here Friday at a virtual ceremony.\nThe ceremony featured the relaying of recorded messages by Foreign Minister Shah Mahmood Qureshi and Deputy Prime Minister and Foreign Minister of the Kingdom of Thailand Don Pramudwinai.\nThe proceedings were co-led by Asim Iftikhar Ahmad, Additional Secretary (Asia Pacific), and Darm Boontham, Director General (South Asian, Middle East, and African Affairs) in Thailand’s Ministry of Foreign Affairs.\nOfficials from both the foreign ministries and embassies in Islamabad and Bangkok also attended the ceremony.\nIn his video message, Foreign Minister Qureshi noted that Pakistan and Thailand were trusted friends and the enduring relationship had continued to grow and diversify over time with sustained commitment of leadership of both countries.\n“Our relations are anchored in mutual confidence, understanding and cooperation. The bond between our lands and peoples are rooted in history, going back to the rich Buddhist Gandhara heritage of Pakistan of which Taxila is quite well known to Thai people,” he said.\nDeputy Prime Minister and Foreign Minister Don Pramudwinai felicitated the government and people of Pakistan, echoed the sentiments of friendship and cooperation and looked forward to further strengthening and deepening of the binding ties between Thailand and Pakistan in the years to come.\nIn addition to unveiling of the Joint Logo, a video ‘7 Decades – 7 Milestones’ was also played.\nOn the special occasion of the 70th anniversary, both sides have planned a series of events to commemorate this historic milestone in a befitting manner.",
  "retrievedAt": "2025-08-11T21:25:20.248Z"
}
