{
  "title": "102 Pakistani, 64 foreign cadets pass out at 114th Midshipmen Commissioning parade",
  "link": "https://www.app.com.pk/national/102-pakistani-64-foreign-cadets-pass-out-at-114th-midshipmen-commissioning-parade/",
  "date_published": "2020-12-26T13:19:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 26 (APP): The 114th Midshipmen Commissioning Parade was held comprising 102 Pakistani and 64 Midshipmen from friendly countries at Pakistan Naval Academy Pakistan Naval Ship (PNS) RAHBAR, here on Saturday.\nChief of the Naval Staff, Admiral Muhammad Amjad Khan Niazi graced the occasion as Chief Guest, said a Pakistan Navy press release.\nWhile addressing the ceremony, Chief of the Naval Staff highlighted the technological strides and recent acquisitions made by Pakistan Navy and underscored the responsibility and challenges entrusted upon newly commissioned officers.\nThe Admiral said Pakistan was a peace loving country and desires to maintain amiable and friendly relations with all its neighbours.\nHe underlined that our desire for peace and readiness must not be misconstrued as our weakness as the Armed Forces of Pakistan were fully cognizant of all such nefarious designs and stand fully ready to foil them, whatever may be the cost.\nThe chief guest advised the newly commissioned officers to be grateful to Allah Almighty and remain resolute while taking up the sacred task of defending the motherland and put in their best to live up to the expectations of the nation in line with Pakistan Navy traditions.\nThe Naval Chief congratulated the commissioning term for practically joining proud community of the maritime defenders of Pakistan. He also felicitated Midshipmen from friendly countries on becoming commissioned officers.\nEarlier in his welcome address, Commandant Pakistan Naval Academy, Commodore Sohail Ahmad Azmie highlighted the quality training being imparted to Pakistani as well as friendly countries’ cadets at Pakistan Naval Academy.\nWhile addressing the commissioning term, comprising one Jordanian, 07 Qatari and 56 Royal Saudi Naval Forces (RSNF) and 102 Pakistani Midshipmen, the Commandant urged them to hold fast the ideals of Honour, Duty and Loyalty to keep the nation’s interests first and foremost.\nLater, the Chief Guest gave away prizes to the distinction holders. The prestigious Quaid-i-Azam Gold Medal was conferred upon Lt Asad Munir PN. Midshipman Muhammad Hassan Jalal claimed the coveted Sword of Honour for his overall best performance, whereas, Midshipman Muhammad Usman Ahmed Khan clinched Academy’s Dirk.\nBeside, Officer Cadet Hamza Malik was awarded Chairman Joint Chiefs of Staff Committee Gold Medal and Midshipman Hussam Mohammed Al Rashidi from Royal Saudi Naval Forces (RSNF) won Chief of the Naval Staff Gold Medal. The Proficiency Banner was claimed by Main Top Squadron.\nThe ceremony was attended by senior military officers, civil dignitaries and parents and relatives of passing out Midshipmen.",
  "retrievedAt": "2025-08-11T20:11:21.641Z"
}
