{
  "article_id": "2025-08-03_7f3c440f5c7a557b4d98d9c280935371",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/business/pides-deregulation-plan-promises-billions-in-farmer-benefits/",
    "retrieved_at": "2025-08-03T15:43:21.741Z"
  },
  "metadata": {
    "title": "PIDE’s deregulation plan promises billions in farmer benefits",
    "author": null,
    "date_published": "2025-08-03T17:16:52+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 503,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 3 (APP): The Pakistan Institute of Development Economics (PIDE) has released a game-changing policy blueprint titled \"Towards a Free Market: A Blueprint for Wheat Sector Deregulation,\" authored by Dr Muhammad Faisal Ali and Dr Sobia Rose. Published as policy viewpoint, the document calls for the full and structured deregulation of Pakistan's wheat sector, arguing that the long-standing Minimum Support Price (MSP) policy has failed to stabilize markets, protect farmers, or ensure consumer welfare. Instead, it has led to unintended consequences-benefiting large landholders, flour millers, and middlemen-while accumulating a circular debt of PKR 680 billion in Punjab by 2023, said a press release issued here Sunday. The authors note that the MSP regime distorts incentives, discourages crop diversification, and consumes substantial taxpayer funds annually for procurement and storage. They argue that the government's abrupt withdrawal from the wheat market in the previous year disrupted market dynamics, allowing millers to form cartels and depress farm-level wheat prices to levels that barely covered production costs. A gradual, transparent transition to a market-driven system was recommended, but it was not followed. However, deregulation has happened, but how could it sustain in these challenging circumstances? It needs a clear policy framework, which is outlined here. Key proposals include long-term policy consistency (a clear 5-10 year commitment) to build investor and farmer confidence, removing inter-provincial and cross-border restrictions on wheat movement, limiting the government's role to maintaining 10-15 percent of total demand as strategic reserves, and ensuring that procurement for these reserves is exclusively from small farmers, who make up 64 percent of the farming community. The policy viewpoint also calls for eliminating flour (atta) and bread (roti) price controls, which can distort supply chains in a deregulated environment. Crucially, PIDE recommends promoting oilseed cultivation-such as rapeseed, mustard, and sunflower-highlighting that these crops are approximately PKR 5,036 more profitable per acre than wheat. Shifting just 10 percent of wheat cultivation (2.14 million acres) to oilseeds could generate an additional PKR 10.8 billion in farmer income. Furthermore, reducing dependency on imported edible oils (which cost USD 2.2 billion in FY 2024) would conserve foreign exchange and strengthen food security. The policy also stresses the importance of accurate demand estimation, noting conflicting estimates ranging from 24.6 million to 32.5 million tonnes, which have led to poor planning and unnecessary imports. To address this, the authors propose a Centralized Comprehensive Data Portal (CCDP) under the Ministry of National Food Security & Research, featuring real-time data on stocks, production, demand, pricing, and market trends. They also advocate for yield-based subsidies, input vouchers, and digital platforms to connect farmers directly with buyers. According to the report, aligning national wheat yields with those of progressive farmers could add PKR 609 billion to the economy. This shift-from support-price dependency to profitability-driven farming-could unlock vast economic potential, encourage innovation, and build long-term resilience in Pakistan's agri-economy. PIDE urges federal and provincial governments to commit to a clear, consistent deregulation roadmap, while ensuring market fairness, farmer protection and food security through robust oversight and data-driven policy.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}