{
  "article_id": "2025-08-03_c89a9e92c702c293f6ccaf3f65a39c81",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/sports/wcls-hypocrisy-forces-pcb-to-slap-blanket-ban-on-future-participation/",
    "retrieved_at": "2025-08-03T15:42:50.433Z"
  },
  "metadata": {
    "title": "WCL’s hypocrisy forces PCB to slap blanket ban on future participation",
    "author": null,
    "date_published": "2025-08-03T15:30:36+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 457,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "LAHORE, Aug 03 (APP): The Pakistan Cricket Board (PCB) on Sunday slapped blanket ban on the participation of Pakistan Champions' future participation in the World Championship of Legends (WCL) competitions after the WCL failed to maintain neutrality in the recent edition. The decision was taken during the 79th BoG meeting of the PCB held virtually under the chairmanship of Chairman Mohsin Naqvi. The WCL, in its recently concluded 2025 edition, had exhibited discrimination and bias to favor Indian Champions against all sporting laws and values after it declined to play its matches against Pakistan Champions. The meeting reviewed with considerable disappointment WCL's appalling conduct of awarding points to a willfully forfeiting team, and the content of the press releases of the WCL announcing the cancellation of the scheduled India versus Pakistan legends matches, which were tainted with hypocrisy and bias. The meeting took exception to the contents of the said press releases which highlighted a duality where the narrative of \"peace through sport\" was selectively applied and believed that the sporting events are held hostage to political expediency and narrow commercial interests. The BoG said the PCB has always advocated for the separation of sports and politics. Our unwavering belief is that cricket, like other international sports, should solely serve as a platform for goodwill, healthy competition, and mutual respect. For a tournament involving legendary players to be dictated by sentiments that undermine this fundamental principle is not only regrettable but also deeply concerning for the future of independent sporting events. The meeting further reviewed that the WCL's apology for \"hurting the sentiments\", whilst being farcical, inadvertently acknowledges that the cancellation was not based on cricketing merit, but rather on succumbing to a specific nationalistic narrative. This bias, masquerading as sensitivity, sends an unacceptable message to the international sporting community. The PCB media release said \"In light of this unfortunate development, which underscores a clear and intolerable pattern of external influence and a disregard for the principles of sporting neutrality, the PCB is compelled to take a firm stance. The PCB can no longer condone participation in an event where the fundamental principles of fair play and unbiased administration are compromised by external pressures\". It further said \"The PCB remains committed to promoting cricket globally and fostering healthy sporting rivalries. However, we cannot allow our players to be part of events where the spirit of the game is overshadowed by skewed politics that undermines the very essence of sportsmanship and the gentleman's game\". The virtual BoG meeting was attended by Sumair Ahmed Syed, Salman Naseer, Zaheer Abbas, Zahid Akhtar Zaman, Sajjad Ali Khokhar, Zafarullah Jadgal, Tanveer Ahmed, Tariq Sarwar, Muhammad Ismail Qureshi, Anwaar Ahmad Khan, Adnan Malik, Usman Wahla (special invitee) and Mir Hassan Naqvi (Additional Secretary).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}