{
  "article_id": "2025-08-03_06ab42e09f7e254c55ae7536e312296d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/dpm-fm-calls-on-iranian-president-reaffirms-deep-commitment-to-brotherly-ties/",
    "retrieved_at": "2025-08-10T10:27:59.569Z"
  },
  "metadata": {
    "title": "DPM/FM calls on Iranian President; reaffirms deep commitment to brotherly ties",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 193,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 03 (APP): Deputy Prime Minister/Foreign Minister Senator Mohammad Ishaq Dar Sunday called on President of the Islamic Republic of Iran Dr. Masoud Pezeshkian. Welcoming the Iranian President, the Deputy Prime Minister/Foreign Minister reaffirmed Pakistan's deep commitment to its historic and brotherly ties with Iran, emphasizing their strong foundations in shared history, common cultural heritage, faith, and mutual respect, Foreign Office Spokesperson said in a press release. President Pezeshkian appreciated Pakistan's support and reaffirmed Iran's resolve to improving bilateral collaboration in various areas of shared interest. He also looked forward to meaningful discussions with Pakistani leaders to further reinforce the political and economic ties between the two friendly nations. Later, talking to media, Deputy Prime Minister/Foreign Minister Senator Mohammad Ishaq Dar reiterated that Pakistan stood by its brotherly country Iran and would continue to support it in trade, economic and other fields. He also welcomed the Iranian president's statement which resonated with the vision of the prime minister to take the trade volume between the two countries to $10 billion. \"It is very heart-warming and a need of the hour to expand the economic activities by building economic coordination together,\" he emphasised.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}