{
  "article_id": "2025-08-03_23bd4f76a1d78cf7b8ba0e21f2d295a8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/sports/global-outcry-grows-as-india-turns-sport-into-a-political-weapon/",
    "retrieved_at": "2025-08-03T15:42:17.249Z"
  },
  "metadata": {
    "title": "Global outcry grows as India turns sport into a political weapon",
    "author": null,
    "date_published": "2025-08-03T16:33:30+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 719,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "By Hasnain Gardezi ISLAMABAD, Aug 3 (APP): In a disturbing trend that has sparked condemnation worldwide, India's increasing politicization of sport, particularly its boycott of Pakistan in major events like the recent World Champions League (WCL), has triggered alarm across the international sporting community. A platform once meant to unite is now being undermined by geopolitical posturing, drawing sharp criticism from athletes, officials, and fans, even within India. Sport has historically offered a rare sanctuary from political hostility. From Ping Pong diplomacy between the U.S. and China to South Africa's post-apartheid rugby victory, the playing field has often healed divisions. Cricket itself once helped thaw Indo-Pak tensions, as seen during the early 2000s tours. That spirit now lies in ruins. The Indian legends' boycott of the WCL match against Pakistan, under the pretext of Pahalgam attacks, led to the match's cancellation, humiliating Indian cricket and frustrating global fans. Prominent Indian players like Shikhar Dhawan and Harbhajan Singh publicly refused to play, turning a game into a geopolitical statement. Facing mounting global and domestic criticism, the Indian government has distanced itself from the decision, subtly shifting blame onto the Board of Control for Cricket in India (BCCI). By framing the boycott as a sporting rather than political choice, it attempts to shield itself from accountability, a move increasingly viewed as disingenuous by both local critics and international observers. The backlash to India's politicized boycott has been fierce and widespread, cutting across continents and cricketing loyalties. Former Pakistan captain Wasim Akram was among the first to denounce the move, saying, \"Cricket should bring us closer, not push us apart.\" Legendary West Indian fast bowler Michael Holding echoed the sentiment, warning that \"players and fans deserve better than political games.\" From Australia, Pat Cummins raised concerns about the fairness of tournaments shaped by political interference, While Inzamam-ul-Haq and Saqlain Mushtaq urged international bodies to hold India accountable for undermining the spirit of global sport. Joining this growing chorus, former England star Kevin Pietersen issued a blunt rebuke on social media: \"Politics always destroys sport! ALWAYS!\" - a message that resonated strongly across cricketing platforms already abuzz with discontent. Australian great Ricky Ponting, reflecting on the increasingly politicized tone of India-Pakistan cricketing encounters, observed, \"There's more edge to these games... the build-up will be different than it is to any other game they play.\" His comment highlighted how political pressure continues to distort what should be purely sporting rivalries. Brett Lee called the India-Pakistan boycott a \"tough situation,\" urging mutual respect between the two nations. He stated, \"We're here for a tournament-we pushed for it.\" Criticizing the last-minute withdrawal, he added, \"If India didn't want to play, they should've said so earlier. Practicing, then pulling out-that's not right.\" Even within India, public figures, former cricketers, and journalists have criticized the boycott as a short-sighted move driven by domestic political compulsions. Social media has become a flashpoint, with hashtags like #CricketNotPolitics and #BoycottTheBoycott exposing the widening gulf between public sentiment and state policy. As the chorus of condemnation grows louder, the credibility of Indian cricket, and the moral standing of its governing bodies, faces unprecedented scrutiny on the world stage. International bodies are now under pressure to respond. The International Olympic Committee has previously penalized India for denying visas to Pakistani athletes. Analysts argue it's time for the International Cricket Council (ICC) and others to enforce consistent standards. If India continues politicizing participation, global sanctions, including disqualifications or event hosting bans, must be seriously considered. Sporting integrity cannot be selectively applied. No country, regardless of its influence, should be allowed to manipulate the rules without consequence. India's ongoing refusal to engage Pakistan, from match boycotts to lobbying against hosting rights, reveals a broader strategy of regional dominance through soft power. These acts deny athletes fair competition and erode the foundational values of international sport. If India continues to use sport as a political weapon, then global bodies must act, not just in words, but through concrete measures. Fairness, respect, and inclusion must remain non-negotiable pillars of global sport. The world is watching and the choice lies with India, to uphold the values that make sport a unifying force, or continue down a path of isolation and politicization. It is time to return sport to its rightful place , as a bridge, not a barrier.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}