{
  "article_id": "2025-08-03_99c4abe30ae1e42910d04c2ae287a902",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/business/ahsan-iqbal-meets-president-cikd/",
    "retrieved_at": "2025-08-03T15:43:23.482Z"
  },
  "metadata": {
    "title": "Ahsan Iqbal meets President CIKD",
    "author": null,
    "date_published": "2025-08-03T17:04:27+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 319,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 3 (APP): Minister for Planning, Development and Special Initiatives, Professor Ahsan Iqbal has met with Lu Hao, President of China's Development Research Center (DRC) and Centre for International Knowledge on Development (CIKD). During the meeting, both sides discussed further strengthening economic cooperation between Pakistan and China, said a press release issued by the Ministry of Planning Development and Special Initiatives on Sunday. The strong economic collaboration between Pakistan and China is key to national development, he said adding that CPEC has transformed the everlasting friendship between Pakistan and China from political cooperation into a comprehensive economic and social partnership. He emphasized that Pakistan is eager to learn from China's economic and reform successes, and termed China's scientific planning as a guiding light for achieving long-term and sustainable development. The minister noted that under the Uraan Pakistan program, the country's economy is moving toward stability, with the target of becoming a one-trillion-dollar economy by 2035. He further stated that all indicators of Pakistan's economy are showing positive trends, a fact also acknowledged by international institutions. He mentioned that the policy rate has declined from 23% to 11%, while the Pakistan Stock Exchange has crossed 140,000 points. He pointed out that China imports nearly 2 trillion dollars worth of goods annually, while Pakistan's share remains negligible. He added that Pakistan seeks to expand trade and exports with China and that gaining access to Chinese markets is a key economic objective. Referring to past challenges, the Minister highlighted that political instability and lack of policy continuity had hindered the country's development process. On this occasion, Minister Lu Hao expressed confidence in Pakistan's strategy to build an export-led economy. During the meeting, it is agreed upon to enter into a partnership and cooperation agreement between Ministry of Planning and China's Development Research Center . Under the agreement, China will support Pakistan's economic development through joint research, training programs, and expert exchanges.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}