{
  "article_id": "2025-08-03_de08805d40068ce63647a015537750ed",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ifa-seizes-3035kg-unsafe-food-fines-113-outlets-rs2m-in-july-crackdown/",
    "retrieved_at": "2025-08-03T15:42:06.528Z"
  },
  "metadata": {
    "title": "IFA seizes 3,035kg unsafe food, fines 113 outlets Rs2m in July crackdown",
    "author": null,
    "date_published": "2025-08-03T20:37:21+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 489,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 03 (APP):The Islamabad Food Authority (IFA) carried out over 1,200 inspections across the city during July, leading to heavy fines, product seizures, and closure of several outlets found violating food safety laws. In an exclusive talk with APP, Deputy Director Operations of IFA, Dr Tahira Siddique, shared the IFA's monthly report covering the period from July 1 to July 31, a total of 1,276 inspections were conducted at food-related businesses across the federal capital. She said that the operations aimed to ensure compliance with hygiene and safety standards in restaurants, bakeries, general stores, food processing units, and roadside vendors. Following these visits, 856 outlets were issued improvement notices, directing them to address hygiene issues and improve storage, handling, and cleanliness conditions. In cases of serious violations, fines were imposed on 113 businesses, amounting to Rs2.01 million. In addition, 58 establishments were sealed for non-compliance and repeated breaches of food safety regulations, she added. The authority also responded to 51 public complaints, inspecting the locations and addressing the issues raised, Dr Tahira said. As many as 425 food licenses were issued to businesses meeting the basic legal and hygiene standards. In one case, a First Information Report (FIR) was also registered against a food outlet for grave violations. Meanwhile, during the inspections, the IFA confiscated and discarded a significant quantity of unsafe, expired, or low-quality food items. A total of 3,035 kilograms/liters of various food materials were destroyed. In which 1,050 kg of substandard or spoiled meat was seized and destroyed. Meanwhile, 923 kg/liters of spoiled or adulterated milk and dairy items were discarded. Similarly, 249 kg of previously served or stale food was found and discarded from eateries. Furthermore, 227 kg/liters of food past its expiry date was removed from shelves. As many as 41 liters of oil unfit for cooking was destroyed and 15 kg of salt lacking iodine content was discarded. A total of 20 kg of tea mixed with harmful substances was seized and 12 kg of banned MSG, often used in fast food, was also removed. While, 265 liters of unfit or expired drinks were discarded and 233 kg/liters of various low-quality or spoiled food materials were seized. Meanwhile, 1,577 sachets of the banned product were confiscated and destroyed. To monitor food quality, 34 food samples were collected from different outlets and sent for laboratory testing. The test results will determine further action, including possible legal proceedings against businesses selling adulterated or unsafe food, the Deputy Director added. She said the month-long operations are part of a broader effort to ensure food safety in the capital. Regular inspections, public awareness campaigns, and strict enforcement of laws will continue in the coming months to protect consumer health. Businesses were also reminded to acquire valid food licenses and maintain records of ingredients, production dates, and expiry labels to avoid penalties. The IFA encouraged residents to report food safety violations through its helpline or online platforms.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}