{
  "title": "Capital to get another drug addicts’ rehabilitation center: Ijaz Shah",
  "link": "https://www.app.com.pk/national/capital-to-get-another-drug-addicts-rehabilitation-center-ijaz-shah/",
  "date_published": "2021-11-24T11:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Minister for Narcotics Control Syed Ijaz Shah Wednesday said that the government would open one more center in the federal capital for the rehabilitation of drug addicts.\nAddressing a drug-burning ceremony organized by the Anti-Narcotics Force (ANF) here, he said “We are fighting to eliminate the drug menace from the country effectively but there are only three drug rehabilitation centers which are extremely insufficient for treatment of the patients.”\nAmong others, the ceremony was attended by the diplomatic staff, students of universities, schools, and colleges besides renowned actors. Drugs worth billions of dollars were burned at the end of the event.\nThe minister asked the private sector people, having enough resources, to come forward and play their role in establishing such facilities in the country so that timely treatment and rehabilitation of the treatment could be carried out efficiently.\nThe federal government alone could not deal with the problem as there were six million drug addicts in the country as per the year 2012-report, he said adding the federal and provincial departments, and masses would have to make joint efforts to purge the menace of drugs from the society.\nHe asked the masses especially the youth to join hands with the government to eliminate drugs from society and ensure the safety of future generations.\nThe minister also stressed cutting the supply line besides taking measures for the drug reduction demand, with special focusing on the awareness-raising and rehabilitation of drug addicts in the society.\n“We are not the drug-producing state, but a victim of drugs.”\nThe minister appealed to the young generation to wage a holy war against the drug and work together to make Pakistan a drug-free state. “We have to fight on a war-footing against the menace by joining hands with each other,” he added.\nHe said Pakistan Tehreek-e-Insaf government had devised the first-ever Anti Drug Narcotics Policy at federal, provincial, and district levels to fight against the menace with collective efforts.\nPointing out the shortage of ANF staff, the minister said that 4,000 staff was not enough to fight this hazard.\nHe also congratulated ANF Director General Major General Ghulam Shabeer Narejo for arranging the drug-burning ceremony.\nOn the occasion, the DG ANF said that a drug burning ceremony was an annual event in which drugs that recovered by the law enforcement agencies by putting their lives in danger to secure the future of the country’s next generation.He said Pakistan was working with the United Nations and neighboring countries to control drug traffickers.\nThe DG said the money being collected from the drug was used in terrorist activities.\nHe also informed the ceremony participants that the two jawans of the ANF had embraced martyrdom in Balochistan province while fighting with the smugglers.\nHe said the ANF was in the practice of holding regular seminars in educational institutions to create awareness among the students against drug use.",
  "retrievedAt": "2025-08-11T21:39:16.652Z"
}
