{
  "title": "Government provide all resources to empower country’s youth:Tarin",
  "link": "https://www.app.com.pk/national/government-provide-all-resources-to-empower-countrys-youthtarin/",
  "date_published": "2021-11-24T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): Adviser to the Prime Minister on Finance and Revenue Shaukat Tarin on Wednesday said the young generation is an asset of a nation, the future of any nation cannot be bright without providing them education and health facilities.\n“The developed countries of the world have educated their young generation and given them health and technical training”, he said. Adviser of Finance and Revenue Shaukat Tarin said this while addressing the ‘Kamyab Jawan Convention’ along with Federal minister for Planning, Reforms and Special Initiatives, Asad Umer here.\nAdviser said that the government would use all its resources to empower the youth.\nHe said that countries like Japan lacks the resources, but it has made its place in the world by equipping its 140 million populations with education and technical training.  Adviser said that Japan is today the world’s third largest economy.\nSimilarly, China and Singapore brought their people to the forefront in the field of education and skills and today these countries are developed. Today, China is the world’s second largest economy and will soon become the world’s first, he said.\nShaukat Tarin said that the government has given loans of Rs. 26 billion to the youth through ‘ Kamyab Jawan ‘ program? Similarly, the government has also started a “Kisaan Program”which will provide interest free loans to farmers, he said.\nHe said that according to the vision of Prime Minister Imran Khan, 4 million families would be provided interest free loans, financial assistance for house building and a ‘Health Card’ through Pakistan program.\nAdviser said that Rs 1.4 trillion would be given to low income people in Pakistan in the next four years through all these programs.\nHe said that according to the vision of Imran Khan, financial assistance and good living would be provided to the deprived sections of the society, which would make the dream of the ‘State of Madinah’ come true.\nOn the occasion, Minister for Planning, Reforms and Special Initiatives, Asad Umer said that the ‘Kamyab Jawan’ have given loans of billions of rupees through the program to empower the youth.\nHe said that there is a difference between kings and leaders. Leader thinks of generations and Imran Khan is formulating policies thinking about the future of the young generation.",
  "retrievedAt": "2025-08-11T21:39:25.607Z"
}
