{
  "title": "Pakistan Post has become a profitable organization: Murad Saeed",
  "link": "https://www.app.com.pk/national/pakistan-post-has-become-a-profitable-organization-murad-saeed/",
  "date_published": "2021-11-24T11:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Federal Minister for Communications and Postal Services Murad Saeed on Wednesday said that Pakistan Post has become a profitable organization as its revenue started increasing.\nAddressing Pakistan Post Employees at a function, the minister congratulated the entire nation that an institution which had more expenses than revenue and was in deficit, today this institution has become profitable.\nHe said that Pakistan Post overall system was made transparent and there was no political interference in the department. “Our goals have been to move the department from deficit to profitability, move towards innovation and introduce new initiatives,” he added.\nThe minister said that law has been enacted, those employees who do not work can be fired and forced retirement is also possible, but those who have done good work will be rewarded on a monthly and annual basis to encourage them.\nMurad said that various new initiatives were taken by introducing urgent mail service, EMS for overseas and digital system.\n“We started transferring foreign remittances to the country through Pakistan Post,” he said. The minister said that Electronic Money Order (EMO) service was expended to different parts of the country. He said that a new project aiming to enter the logistics sector was near completion, which would be launched soon.\nHe said that out of 40 observations of Financial Action Task Force (FATF), 13 observations were on Pakistan Post when we came in power, adding that meeting these targets were the most difficult task which was successfully achieved.\nThe minister said that 83 to 87% of the revenue of Pakistan Post was spent on staff salaries, adding that that is why we started providing digital franchise post office under public-private partnership. “With this initiative, one franchise post office will create job opportunities and will also increase revenue of Pakistan Post.\nHe said that Overseas Pakistanis working in Saudi Arabia, Qatar, Dubai, Kuwait and other Arab countries would now be able to send money to their families through Pakistan Post.\nHe said that Pakistan’s institutions were on the verge of collapse due to political interference.\nThe minister said that the digitization of Pakistan Post will be completed by the end of the financial year 2021-22, adding that more facilities will be provided to the employees of Pakistan Post.",
  "retrievedAt": "2025-08-11T21:39:16.595Z"
}
