{
  "title": "MoU signed to restore 50,000 degraded forest lands",
  "link": "https://www.app.com.pk/national/mou-signed-to-restore-50000-degraded-forest-lands/",
  "date_published": "2021-11-24T14:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Special Assistant to Prime Minister (SAPM) on Climate Change Malik Amin Aslam Wednesday said that private sector could play a vital role in restoring the country’s degraded forest landscape for achieving environmental and economic sustainability.\nWhile addressing a press conference here on the occasion of MoU signing for forest restoration and carbon offset programme, the PM’s aide further said that degradation and loss of forests had already destabilisd natural systems on a scale unseen in human history and the world had already lost nearly half of the six trillion trees that existed on Earth before the onset of agriculture 12,000 years ago.\nThe MoU was signed among World Wide Fund for Nature – Pakistan (WWF-P), Engro Foundation and the Ministry of Climate Change, under which they together will combine their efforts under a joint Forest Restoration Programme and restore 50,000 acres degraded forest lands in various parts of the country at a cost of Rs 600 million.\nWWF-Pakistan would conduct the monitoring of the afforestation at the 50,000 acres area.\nMalik Amin highlighted that collaboration and partnerships between corporate sector and government were key to the country’s goal to conserve, restore and grow billions of trees for achieving sustainable development goals including climate resilient, food security, access to safe drinking water and sanitation, fighting hunger, malnutrition and disease.\nThe SAPM regretted that despite fervent conservation programmes launched in different countries, the world continued to lose around 15 billion more trees each year due to unsustainable business practices, human production and consumption patterns, resulting in slowdown in economic growth, surging poverty, diseases, hunger, species loss and extinction.\n“However, private sector, which has devoured massive forests and converted into commercial areas, can play a vital role under its corporate social responsibility (CSR) head for conserving and restoring degraded forest landscapes are essential to combating global climate change and preventing biodiversity loss and achieving environmental and economic sustainability,” said Malik Amin.\nHe warned, “Without conserving and restoring degraded forest landscapes and protecting, we would only jeoperdise efforts and gains made so far for achieving sustainability of businesses and economies, which provide jobs and feeds millions.”\nMalik Amin highlighted that it was heartening to note that nongovernmental and non-profit organisations – and some corporate leaders – had long advocated the case for private sector engagement in forest landscape restoration.\nNow it seemed to be an unprecedented window of opportunity for companies and NGOs to work together with governments to advance the world’s goals on protecting the planet, fighting poverty, hunger and loss of biodiversity, he said.\nForests are critical to the sustainability of the planet. They sequester carbon, regulate global temperatures and freshwater flows, recharge groundwater, anchor fertile soil and act as flood barriers, highlighted Malik Amin and added that the forest resources harbour 80 percent of the world’s terrestrial biodiversity and considered a treasure trove of innovation and a source of subsistence and survival for 350 million people.\nHighlighting the protection and conservation of forests, the PM’s aide told the media that the cost to business is increasingly evident. More than half of our annual global GDP, or $44 trillion, is potentially threatened by nature loss because business depends on nature and its services.\n“As trees vanish, the services they offer are naturally weakened, lowering the productivity/health of soils and natural carbon sinks, diminishing the people’s access to clean drinking water, safe sanitation, food and reducing our resilience to extreme weather events,” he remarked.\nEarlier, WWF-Pakistan Director-General Hammad Naqi Khan told the media that Forest landscape restoration1 is an important approach to restoring deforested and degraded land.\nIt involves bringing together people with diverse and diverging views and interests to create a plan in which both people and nature win, he added.\nEngro Corporation President and CEO Ghias Khan said that realising the full benefits that forests provide and the planet so dearly needs requires more than simply keeping current forests standing, a daunting goal that governments along could achieve with their available scant resources.\n“However, here we believe and understand that corporate sector must play its role as a corporate responsibility towards environmental sustainability for restoring deforested and degraded lands across landscapes in the country to regain.",
  "retrievedAt": "2025-08-11T21:39:24.104Z"
}
