{
  "title": "Rs 18bln doled out to reward blue-eyed journalists, channels in PML-N last tenure: Fawad",
  "link": "https://www.app.com.pk/national/rs-18bln-doled-out-to-reward-blue-eyed-journalists-channels-in-pml-n-last-tenure-fawad/",
  "date_published": "2021-11-24T15:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Wednesday said PML-N Vice President Maryam Nawaz doled out Rs 18 billion from national kitty to reward blue-eyed journalists and media channels at federal and Punjab levels in their last tenure.\nAddressing media, he said Maryam Nawaz doled out these public funds as head of  a media cell at the Prime Minister’s House during PML-N previous tenure.\n“With approval of the party’s media cell, supervised by Maryam Nawaz, Rs 9,625,430,902 were utilized for funding of federal government (advertisements), while around Rs 10 billion for Punjab government.”\nFlanked by Minister for Energy Hammad Azhar, the minister announced to share the record with media persons after the briefing.\nHe said advertisements for the Federal and Provincial governments were managed by the ‘notorious media cell’ set up by the Pakistan Muslim League-Nawaz (PML-N) to reward specific journalists over stories in their favour.\nFawad said the story about media cell in 2015 had pointed out that a special media cell had been working under the direct supervision of Maryam Nawaz at the Prime Minister House.\nInitially, 15 members were made part of the cell and later, Rs 20 million were allocated for additional recruitment and was mandated to run targeted media campaigns, he added.\nHe said Maryam Nawaz in Wednesday’s news conference affirmed that she was supervising the cell during PML-N tenure. A video clip of Maryam’s news conference was also screened.\nFawad said admission of Maryam of curtailing or blocking advertisements for specific television channels was certainly an immoral and illegal act.\n“The handling of public fund by a private person is a crime under the jurisdiction of the FIA (Federal Investigation Agency), but also liable of disqualification,” he said while pointing out that Maryam had already been disqualified under Article 62 and 63 of the Constitution.\nThe minister said Maryam’s admission had proved that as to how the PML-N carried out ‘systematic manipulation’ of the media during its last tenure.\nMinister for Information and Broadcasting Chaudhry Fawad Hussain said it was an eye-opening revelation for the journalist community and media organizations.\nWith this, it could be assumed that as to how much difficulty was being faced by the Pakistan Tehreek-e-Insaf when it had not alternate such resources.\n“We do not have the resources to dole out the huge amount of Rs 15 to 18 billion to someone. We have decided to conduct a serious inquiry to probe the matter,” he said.\nHe said thorough investigations would be conducted how a private person (Maryam) was running the show, following the confession of Maryam Nawaz that she was awarding and punishing the journalists and media houses despite having no official position. It might be noted that the misappropriation of public money was a separate criminal case, he added.\nThe details of the doled out amount collected by Information ministry has already been shared. While provinces were being asked to share the amount spent by that media cell among media houses and journalists from provincial exchequer. The details taken would be shared accordingly.\nResponding to a question, the minister said Maryam was calling the shot as the then Minister for Information and Broadcasting Pervaiz Rashid was a puppet.\nTo a query, Fawad said PML-N was trying to sabotage corruption cases. The appeal against corruption cases were in court and they should simply present the evidence before the divisional bench to enable it to analyse the evidence.\nTo another question, he said a common man was of the opinion that looted money should be recovered from all those thieves. Simple was that Nawaz Sharif should return the looted money, if he did not want to serve jail term, he added.\nTo a query, he said Maryam’s confessions were also a test case for journalist organization what was their opinion on the entire episode.\nResponding to a question Hammad Azhar said Maryam Safdar had confessed that, she ran the media cell, and blocked the ads of some media channels during PML-N’s regime.\nShe did not mention the names of media houses which were rewarded as it was obvious that – if one was indulged in punishing someone, he or she might have rewarded someone for their services. PML-N would have to answer squandering public money, he added.\nHe said such dirty tactics were tantamount to resorting to fascism. On the other hand PML-N was used to accuse Pakistan Tehreek-e-Insaf (PTI) as a fascist party on posting a tweet, or challenging a media houses’ accusations.\n“Maryam should clarify why some media houses still remembered her anxiously.\nThe answers of all questions would be dug out in the inquiry,” he said adding the findings of inquiry would be duly shared.\nThe freedom of media could not be compromised, Hammad said adding that PML-N leadership was confessing their crimes right from the ownership of Avenfield apartments to media cell and hopefully remaining confessions would come to fore also. PTI government would share the different tactics were being used by PML-N to control media, he added.\nHe said PML-N had doled out plots to many journalists, also targeted their opponents and deprived many of journalists from their jobs, however such tactics would no more be tolerated.\nResponding to a question Hammad said it could be assumed that the emergence of different fake videos and audio tapes were the handy work of Maryam’s media cell.\n“Had such confessions of influencing media were made by the daughter of a prime minister in a western country – their whole family would have landed in jail,” he added.",
  "retrievedAt": "2025-08-11T21:39:23.933Z"
}
