{
  "title": "Maryam leveling baseless allegations against judiciary: Gill",
  "link": "https://www.app.com.pk/national/maryam-leveling-baseless-allegations-against-judiciary-gill/",
  "date_published": "2021-11-24T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Adviser to Prime Minister on Political Communication Shahbaz Gill on Wednesday said that Maryam Safdar is leveling baseless allegations against Judiciary through a fake audio.\nTalking to Mediapersons at Prime Minister House, he said that Maryam is certified liar who had submitted fake documents in the court.\nHe said that Calibri Queen Maryam Nawaz always tells lies.\nPakistan Muslim League-Nawaz (PML-N) is engaged in a propaganda campaign against the judiciary in an attempt to make its role controversial, he added.\nIn reference to an audio clip circulating on social media allegedly claiming that the former chief justice of Pakistan (CJP) Saqib Nisar gave orders on someone’s directions to keep Nawaz Sharif and Maryam Nawaz behind bars, Shahbaz Gill said that a private channel had brought real video of Saqib Nisar on screen, which proves that the audio was fabricated.\nThere was no doubt that the former Gilgit-Baltistan chief judge had taken several benefits from Sharif family in the past, he added.\nHe said that Maryam Safdar do not have ethics to talk about the Judges.He said that by mentioning some groups in Judiciary, Maryam always tried to defame the senior judges of apex court.\nHe said that Maryam talked about the banning of advertisements of some channels, adding, today she again asked the question from the reporter of her favourite channel.\nHe said that Maryam leveled fake allegations against current chief justice including Saqib Nisar.\nPML-N always tried to defame those judges who punished them on corruption, Gill said.\nHe said Maryam Safdar also tried to defame the Pakistan Army by leveling the fake allegations against top slots.\nPML-N, in past, abused the Benazir Bhutto Shaheed by leveling baseless allegations on her.\nIt was an old bad habit of Sharif family to lie about the institutions, he told.\nHe said that if you criticize five judges of the court then surely you are attacking the entire institution.",
  "retrievedAt": "2025-08-11T21:39:25.636Z"
}
