{
  "title": "Political rancor hits National Assembly condolence sitting - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Assembly’s condolence sitting for late PTI MNA Mian Azhar on Monday turned contentious as treasury and opposition members were seen engaged in heated exchanges and accusations of political victimisation.\n\nThe treasury members, including two ministers, reminded the opposition Pakistan Tehreek-i-Insaf lawmakers as to how the top leadership of the PML-N was cruelly put behind bars during the last government under Imran Khan when the latter lashed out at the government over their ongoing “political victimisation”.\n\nThe house witnessed rumpus on a couple of occasions due to sloganeering by the PTI members during the speeches of Information Minister Attaullah Tarar and Law Minister Azam Nazeer Tarar when they justified the recent court convictions of the top PTI leadership in the May 9 rioting case.\n\nThe PTI members entered the assembly hall carrying the portraits of Imran Khan and all those leaders who were recently convicted by an anti-terrorism court over their alleged involvement in the rioting incidents in which a number of military installations were attacked in May 2023 after Mr Khan’s arrest.\n\nAt the outset, National Assembly Speaker Sardar Ayaz Sadiq announced that as per past tradition they would not transact any business and would only pay tributes to late MNA Mian Azhar, who died in Lahore on July 22.\n\nWhile paying tributes to late MNA, PTI’s Ali Muhammad Khan and Sardar Latif Khosa criticised the government over the recent conviction of their top leaders, including parliamentarians, and alleged that due to ongoing crackdown on the opposition, Hammad Azhar, the son of late Mian Azhar, could not properly attend the funeral of his father.\n\nAli Muhammad Khan described the conviction of opposition leaders in both houses of the parliament Omar Ayub Khan and Shibli Faraz as ‘a mourning day for the democracy’. He regretted that Hammad Azhar could not meet his father during his last days. He said ex-premiers Zulfiqar Ali Bhutto and Nawaz Sharif also went through a similar situation in the past and questioned as to how long politicians would face such things.\n\nMr Khan also declared that his party would go ahead with their planned countrywide protests on Tuesday (today) for the release of the incarcerated party founder.\n\nTaking the floor, Mr Khosa asked, “Do you want to murder democracy?” He informed the lawmakers about the brief participation of Hammad Azhar in the funeral fearing his arrest in fake cases. Mr Khosa asked the government to withdraw cases against Hammad Azhar or admit that someone else was ruling the country. He regretted that on one hand, the treasury members were visiting the residence of late MNA to offer condolences and on the other hand, they were bent upon “victimising” his son.\n\nInformation Minister Attaullah Tarar said the PTI leaders had been convicted in the May 9 cases as per the law. He advised the opposition members to approach courts if they had objection to the decisions. He recalled that the court had not allowed former prime minister Nawaz Sharif to attend his mother’s funeral despite repeated requests. He said at that time the judge had stated he could not do so because of the orders from “high-ups.”\n\nLaw Minister Azam Nazeer Tarar said the PTI had always rejected the talks offer from Shehbaz Sharif when he was in the opposition as well as in power. He also highlighted the alleged victimisation of PML-N’s Rana Sanaullah during the PTI’s government.\n\nThe National Assembly will meet again on Tuesday (today) at 11am.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/05091344564edcb.png",
  "retrievedAt": "2025-08-16T07:04:41.262Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928836/political-rancor-hits-national-assembly-condolence-sitting",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:20:40.000Z"
}
