{
  "title": "Weather pundits warn of heaviest rain spell in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Provincial Disaster Management Authority (PDMA), Punjab and the Pakistan Meteorological Department (PMD) on Monday warned that a spell of heavy torrential rains will begin on Aug 5 (today), persisting till August 7, warning of urban flooding in some cities.\n\nOfficials warn that urban flooding is feared in Lahore, Rawalpindi, Gujranwala and Islamabad over the next 72 hours.\n\nAccording to the PDMA fact sheet, heavy rains have already claimed 163 lives so far this season, besides leaving 579 people injured and 215 homes damaged across Punjab.\n\nThe PDMA also predicted moderate to high-level flooding in the Chenab and Jhelum rivers from August 5, with thunderstorms expected in upper catchment areas.\n\nPDMA Director General Irfan Ali Kathia placed all emergency centres on high alert, stating, “Our field teams are monitoring the situation 24/7, especially in vulnerable areas like Murree where landslides remain a serious threat.”\n\nMeanwhile, the current rains and floods have filled the Tarbela Dam up to 91 percent of its full capacity and the Mangla Dam to 60pc, while major rivers currently show normal flow levels, say officials.\n\nResidents in low-lying areas of 19 districts, including Faisalabad, Sialkot and Bahawalpur, have been advised to move to safer locations.\n\nThe PDMA has activated its emergency helpline 1129 and deployed special teams to prevent water accumulation in vulnerable cities.\n\nChief Minister Maryam Nawaz has ordered immediate financial assistance for affected families as the province braces for what meteorologists predict could be the heaviest rainfall of this monsoon season.\n\nThe PDMA urged people to keep children away from storm drains and waterways. “One moment of carelessness can cost lives in these conditions,” it cautions.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/03082149d3d6c88.jpg?r=082157",
  "retrievedAt": "2025-08-16T07:03:58.582Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928775/weather-pundits-warn-of-heaviest-rain-spell-in-punjab",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:23:11.000Z"
}
