{
  "title": "IHC orders talks with BYC to clear capital streets - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) on Monday ordered the deputy commissioner of Islamabad to negotiate with the Baloch Yakjehti Committee protesters and clear roads that have been blocked for weeks, crippling a local business.\n\nChief Justice Sardar Mohammad Sarfraz Dogar issued the directive while hearing a petition from a petrol station operator whose business has been severely disrupted by the prolonged demonstration near the National Press Club.\n\nDuring the hearing, key officials including Advocate General Islamabad Ayaz Shaukat, Deputy Commissioner Irfan Nawaz Memon, SSP Operations Shoaib Khan, and DSP Legal Sajid Cheema were present.\n\nThe chief justice questioned the administration for allowing the lengthy disruption.\n\nInstructs city administration to protect rights and property of others as well\n\n“Under what law is someone’s property being blocked?” he asked city officials in the courtroom. “The steps you’ve taken are insufficient. You must protect the rights and property of others.”\n\nThe petition was filed by M/S Awan Associates, which operates a PSO fuel station.\n\nIt challenged indefinite road closures that have paralysed business and, according to the petition, violated multiple constitutional rights.\n\nIslamabad Advocate General Ayaz Shaukat told the court that no official permission had been granted for the protest, which is being led by members of the Baloch Yakjehti Committee.\n\n“We disperse them, but they return,” he said.\n\nDeputy Commissioner Memon said the administration could offer an alternate location for the protest.\n\nThe chief justice instructed him to negotiate with the demonstrators and inform them they could not continue occupying the current site.\n\nHe ordered the submission of a compliance report at the next hearing.\n\n“The direction has been given. It’s not the court’s job to spoon-feed the administration,” the chief justice remarked before adjourning the case.\n\nThe petition filed through advocate Kashif Ali Malik cited respondents in the case include the Federation of Pakistan, Capital Development Authority (CDA), chief commissioner, deputy commissioner, and inspector general of Islamabad.\n\nDuring the hearing, the petitioner’s lawyer told the court that key routes — Nazim-ud-Din Road, Shaheed-i-Millat Road, and Polyclinic underpass — have remained closed for weeks, causing a “drastic decline” in customers.\n\nHe said the blockade also hampers access for emergency vehicles and suppliers, rendering operations “unsustainable”.\n\nMr Malik argued the closures violate fundamental rights to life, movement, trade, property, and education as guaranteed in Constitution.\n\nCiting Supreme Court precedents, he contended that protests cannot override the public’s right to healthcare, education, or livelihood.\n\nWhile acknowledging protests are a protected right, the petition stressed that such demonstrations cannot “paralyse the entire locality” or indefinitely restrict public movement.\n\nThe court has been asked to declare the road closures “illegal, unconstitutional, and without lawful authority” and to order the immediate restoration of traffic.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/05084239cb716bd.png",
  "retrievedAt": "2025-08-16T07:04:32.594Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928831/ihc-orders-talks-with-byc-to-clear-capital-streets",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:20:40.000Z"
}
