{
  "title": "A question of timing - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE May 9 convictions are here. Wholesale. And after a long wait — during which time most of those who were behind bars remained behind bars and most of those who had managed to wrangle some form of freedom continued to remain outside.\n\nSo far, this situation has not really changed as we wait to see if any of the well-known names who have been convicted are found and arrested.\n\nNone of this is surprising — neither the judgements nor the convictions/acquittals. And not even the names of those who were able to escape being tried in the first place.\n\nSo far, in the three decisions which have come forward, among others, Yasmin Rashid and the other prisoners in Lahore have been found guilty, as have key PTI leaders in the various assemblies — from Omar Ayub in the National Assembly to Shibli Faraz in the Senate and the Punjab opposition leader Ahmed Bachchar.\n\nThe judgements appear to have given a starring role to the key prosecution witnesses, who hid in Zaman Park, and heard the PTI’s ‘evil’ planning. The testimony of these police officers established for the courts the case against the party leaders and workers, who took part in these discussions.\n\nAnd while time may have dimmed recollections of May 9, these two star witnesses are now etched in the memory of even those who heard any of the commentary about these cases with half an ear.\n\nIt is hard to understand why the judgements have come now.\n\nSince then, checking under the table or behind the sofa has become as mandatory as the quick move to stuff phones in sofa crevices or under a pile of cushions during casual discussions in Islamabad. Beware of the Big Brother who may be listening through the phone and be equally afraid of the police wallah under the coffee table.\n\nBut in the confusion of who has so far been convicted and who has been spared, the real question here is: why? Two years later, when those who have been able to escape have escaped and those who are never to be forgiven languish in jail, it is hard to understand why the judgements have come now. What is the point?\n\nFor those who are never to be forgiven were already in jail, and those who were as free as the other parliamentarians continue to be somewhere out there, with the police searching for them. And doubting Thomas that I am, I wonder if any of them will be caught.\n\nBut I digress. The main question still remains, why? And why now?\n\nIt is not as if the government or its allies needed more seats in parliament for stability or legislation. It is already sitting pretty and the numbers, whenever needed, are easy to complete, as the 26th Amendment showed.\n\nIt could be to weaken the PTI; many say this when asked. But in recent times, the party has revealed quite comprehensively that it is incapable of functioning coherently or strategically; its internal rifts have rendered it incapable of action, before or after Aug 5, and the limited access to Imran Khan adds to the confusion.\n\nCombine this with the allegations that most of those making the decisions within the party are compromised and it seems there is little reason for any concern or fear.\n\nBut when these questions are asked, those with bigger and wiser brains (bigger and wiser than those inside the head of subeditors), feel that it is essential to prove not just that the party is weak and dysfunctional but also that it can be broken or fragmented further.\n\nIt is to send a message. A message not just to the party but also to prove that those in charge are in control and confident about their position. This is being linked to recent international events such as the Indo-Pak conflict, the reaction to it worldwide and especially the newfound warmth with the White House.\n\nIt goes without saying that, internally, there is little reason for any questions about the control of the system.\n\nBut that is not all. Somewhere, there is also concern and an effort to prove that May 9 has been forgotten. It was a terrible event and it has to be taken to its logical conclusion. There is concern that if it was abandoned, or the cases allowed to languish, then it may send the message that it was a day used simply for political purposes and then forgotten.\n\nAnd if this is not the case, the culprits of the day must be brought to ‘justice’ so the people at large (within the country) know how serious it is. This is also why the military courts’ judgements have also been announced.\n\nPerhaps this is also why many of the same people who spent months informing all and sundry that what happened on May 9 was unforgiveable now speak about the possibility of forgiveness if an apology is sought.\n\nThis idea of an apology had also been mentioned over the past two years, but the intensity with which it is now echoing across TV screens and elsewhere should not be taken lightly.\n\nIf this last issue is of concern, then it is worth asking if such judgements, which are raising further questions, will be able to change the larger perception. Especially because in the process, the judicial system has suffered further collateral damage.\n\nAnd there is risk of more, in case those convicted manage to file appeals and the higher courts hear these cases. Generally, a lot more attention is paid to the proceedings in the high courts and beyond. And upholding these judgements there will not be easy, in terms of the credibility of the post-26th Amendment judiciary.\n\nBut then, who would even heed these words? Credibility is a word that is becoming rather irrelevant.\n\nThe writer is a journalist.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68914d9314e8b.png",
  "retrievedAt": "2025-08-16T07:03:38.522Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928848/a-question-of-timing",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:19:45.000Z"
}
