{
  "title": "Senate body calls for expediting work on ML-1 rail project - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Over 1,200 acres of PR land in Karachi encroached by govt depts, private individuals: officials\n• Members of Standing Committee on Railways seek steps to reclaim encroached land\n• Express concern over inoperative routes, frequent accidents and passenger safety\n\nKARACHI: The Senate Standing Committee on Railways on Monday recommended expediting work on the Main Line-1 (ML-1) project, which aims to upgrade and modernise key infrastructure to enhance freight and passenger connectivity from Karachi to Peshawar.\n\nChairing a meeting of the committee at the Divisional Headquarters of Pakistan Railways (PR) Karachi, the chairman of the Standing Committee Jam Saifullah Khan emphasised that railway station upgradation efforts must be equitably distributed among all provinces.\n\nThe committee members — Senators Nasir Mehmood, Asad Qasim, Dost Ali Jeesar, Dost Muhammad Khan and Ashraf Ali Jatoi — PR secretary and chairman Syed Mazhar Ali Shah, CEO Amir Ali Baloch and other senior officers attended the meeting.\n\nWhile deliberating on the long-pending ML-1 project and the vulnerable Sukkur-Multan section, the standing committee chairman urged the ministry to expedite the initiative.\n\nHe also directed that proper planning be undertaken to safeguard railway tracks from waterlogging and flood damage, which have severely impacted operations in the past.\n\nThe chairman railways briefed the committee that the ML-1 project is among PR’s top priorities, as it is the central railway line linking Karachi with the entire country. For this reason, the project will commence from Karachi, and efforts are underway to initiate development work at the earliest, he added.\n\n‘344 acres of encroached land retrieved’\n\nThe committee was briefed on the removal of encroachments from railway lands and informed that 307 acres are under encroachment by government departments and 954 acres by private individuals, while a total of 344 acres of encroached land worth Rs3.3 billion has been retrieved in the Karachi division over the past three years.\n\nThe committee urged provincial governments to assist in reclaiming this land. It also expressed concern over stay orders issued by local courts, which delay land recovery efforts. The divisional superintendent railways proposed that, before issuing such stays, courts should hear the ministry’s position.\n\nThe committee also noted a lack of adequate support from district administrations and police during anti-encroachment operations, despite prior coordination and notifications from PR.\n\nSenator Mehmood raised the issue of frequent train accidents, expressing concern over the recurring loss of innocent lives. In response, the committee directed the Ministry of Railways to take immediate and concrete steps to reduce the frequency of such incidents and ensure passenger safety.\n\nTo revive inoperative routes, the committee recommended that the ministry coordinate with provincial governments — following the example of Punjab — to seek funding from provincial budgets for infrastructure development and the operation of intercity fast trains.\n\nWhile discussing train operations, the committee was informed that the Karachi Railway Division has 624 kilometres of operational routes, whereas 439 kilometres remain inoperative. The committee expressed concern over this high ratio of non-functional segments and emphasised the need to revive economically viable routes.\n\nOn staffing matters, the secretary briefed the committee about ongoing efforts to rationalise workforce numbers due to the implementation of digital technologies. He noted that legacy systems are being replaced and that specialised staff would be recruited to operate new digital systems efficiently.\n\n‘Collaboration with provinces’\n\nThe committee was also briefed that PR is working on various development projects in collaboration with provincial governments.\n\nThe secretary of railways informed the committee that efforts are underway to engage all provinces in collaborative railway infrastructure projects and the operation of viable intercity train services.\n\nThe meeting was informed that Punjab has committed to development work on 350 railway level crossings, and a Lahore-Rawalpindi fast train project is under consideration. In Sindh, a Karachi-Rohri fast train and other projects are under discussion with the provincial government.\n\nRegarding passenger amenities, the committee was informed of recent improvements at several stations, including the installation of ATMs, information desks, drinking water facilities, washrooms, tuck shops and escalators. The chairman directed that escalators should also be installed at high-traffic stations like Hyderabad and Rohri, where passengers face significant challenges.\n\nAddressing staff welfare, the committee raised serious concerns over delays in the payment of pensions, GP funds, commutation, benevolent funds, marriage grants and farewell salaries to retired and current employees. Representatives from various employee unions were also heard.\n\nThe secretary informed the committee that multiple requests have been made to the Ministry of Finance for special funds to clear pending liabilities. Despite recommendations from the committee itself, no separate allocations have been made, and the Ministry of Railways lacks sufficient resources to meet these commitments on its own, he added.\n\nOn security issues, Senator Qasim raised concerns about safety at railway stations in Balochistan, particularly Quetta. The DIG informed the committee that additional personnel have been deployed following incidents such as the Jaffar Express attack, and new security plans are being developed to further enhance passenger safety.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/05102823317d242.jpg",
  "retrievedAt": "2025-08-16T07:04:05.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928794/senate-body-calls-for-expediting-work-on-ml-1-rail-project",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:23:05.000Z"
}
