{
  "title": "Balochistan govt told to operate flights from Quetta to Iran, Iraq for Arbaeen pilgrims: defence minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "Defence Minister Khawaja Asif assured the National Assembly on Tuesday that the government was taking measures for Arbaeen pilgrims following an overland travel ban, saying the Balochistan government had been directed to operate direct flights from Quetta to Iran and Iraq.\n\nEvery year, Shia Muslims from Pakistan travel by land route to Karbala in Iraq via Iran to take part in Arbaeen rituals during the Islamic month of Safar. Arbaeen marks the end of a 40-day mourning period following Ashura, the anniversary of Imam Hussain’s martyrdom in the Battle of Karbala.\n\nLate last month, the government announced that Pakistani Zaireen (pilgrims) would be barred from travelling by road to Iran and Iraq for Arbaeen due to security concerns. The decision immediately drew flak from the Sindh government, senators, the PTI and PPP, while Iran advised pilgrims to secure an e-visa for the pilgrimage by August 7.\n\nSpeaking in the NA today, the defence minister acknowledged that the ban was enforced due to serious security concerns, particularly because of the threat of terrorist attacks targeting pilgrim convoys.\n\n“To mitigate these risks, the federal government has authorised the Balochistan government to operate direct flights from Quetta, allowing pilgrims to safely travel by air to their destinations,” he said.\n\n“Iran has so far allowed one such flight; we are pressing them to start frequent flight operations as well.”\n\nArrangements had also been made for onward transportation of pilgrims from airports in Iran and Iraq to their intended sites, he said.\n\n“Advertisements had been published over the past four days inviting private carriers to operate on the route, and all licensed private airlines had been allowed to provide services,” he told the NA.\n\n“Chartered flights have also been approved to maximise the number of pilgrims able to travel safely.”\n\nHe urged potential operators and the market to take full advantage of the permissions granted, while acknowledging that these measures were aimed at offering maximum facilities while avoiding the security hazards of road travel.\n\nAsif further said that the matter was discussed during the recent visit of the Iranian president to Pakistan, adding that Iran had allowed an additional flight to facilitate the movement of Pakistani pilgrims.\n\n“I want to assure the House and the people across Pakistan that the government is fully committed to ensuring safe, comfortable, and timely transportation for all Arbaeen pilgrims,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/0516434543f33dc.jpg",
  "retrievedAt": "2025-08-16T07:03:07.888Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928888/balochistan-govt-told-to-operate-flights-from-quetta-to-iran-iraq-for-arbaeen-pilgrims-defence-minister",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T10:42:00.000Z"
}
