{
  "title": "PFUJ slams ‘crackdown’ on freedom of expression - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Marking its 75th year of struggle for press freedom, the Pak­is­tan Federal Union of Jour­nalists (PFUJ) issued a sc­­athing declaration on Sun­day at the close of its three-day executive council meeting, condemning an “escalating crackdown” on freedom of expression and media independence.\n\nThe meeting, held from Aug 1 to 3 and chaired by PFUJ President Afzal Butt, concluded with a call for the withdrawal of proposed amendments to the PECA and the Punjab Defamation Bill 2024.\n\nThe PFUJ’s federal executive council (FEC) termed both pieces of legislation “unjustified, anti-media, and refle­ctive of an authoritarian mindset”.\n\n“The federal and provincial governments must refrain from implementing anti-media and anti-freedom of expression po­­licies, which have already damaged Pakistan’s reputation,” the PFUJ declaration said.\n\nCondemning a number of recent actions by the authorities, the council ex­­pressed “grave concern over blatant violations of fundamental rights of ex­­pression”. The actions constituted “arbitrary detention, harassment, and censorship”, according to the declaration.\n\n“The PFUJ will not tolerate attempts to curtail freedom of expression and free speech,” the FEC said. “Citizens’ digital righ­­ts must be respected, protected, and preserved.”\n\nIt called for immediate withdrawal of PECA 2025 and the Punjab Defamation Bill, an end to layoffs in both print and electronic media, enforcement of the Eighth Wage Board Award, development of a defined career path and pay structure for journalists, including those in digital media, and safety measures for media workers.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/24112331b23d602.jpg?r=112345",
  "retrievedAt": "2025-08-16T07:04:40.247Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928835/pfuj-slams-crackdown-on-freedom-of-expression",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:20:40.000Z"
}
