{
  "title": "Pakistan approves first ferry service licence - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Licence granted to UK-based ‘Sea Keeper’ seven years after operator applied for it\n• Ministry fast-tracks approval amid suspension of land travel to Iran, affecting pilgrims\n• Ferry service to link Iran and GCC countries with Karachi and Gwadar ports\n\nISLAMABAD: While a large number of pilgrims en route to Iraq have been stranded due to a sudden ban on land travel to Iran, the government has approved the first ferry service licence.\n\nApplications by ferry operators have been pending since 2017 -18. Taking a fast-track route, the Ministry of Maritime Affairs on Monday approved the first ferry service licence to an international ferry operator.\n\nThe UK-based company — ‘Sea Keeper’— will operate ferry routes connecting Pakistan with Iran and the Gulf Cooperation Council (GCC) countries.\n\nThe government is under serious pressure from around one million pilgrims who attend Arbaeen (Chehlum of Imam Hussain) in Karbala, as land travel to Iran has been stopped without any notice recently.\n\nFederal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry has led the move by fast-track approval to ferry service operators who had filed applications in 2017 and 2018.\n\nThe minister emphasised that ferry service will not only provide the pilgrims going to Iraq and Iran a safe and secure travel but it also provides an opportunity for boosting regional connectivity as well as economic activity via sea routes.\n\n“Initial operations will commence from the ports of Karachi and Gwadar using modern ferry vessels equipped with essential amenities to ensure safe, affordable travel. Expansion of routes and port calls is planned based on demand and bilateral agreements”, the minister said in a statement.\n\nThis ferry service launch forms part of Pakistan’s broader strategy to develop its blue economy, improve trade logistics, and promote maritime tourism, reflecting a renewed commitment to sustainable regional sea transport infrastructure, the minister stated.\n\nSources in the Ministry of Maritime Affairs confirmed that more ferry services licences are expected to be issued in near future as the licence committee was scrutinising the cases.\n\nThe Licensing Committee comprises officials from the Ministry of Maritime Affairs, Ministry of Defence, Ministry of Foreign Affairs, Ministry of Interior, and representatives from the Pakistan National Shipping Corporation (PNSC) and port and shipping authorities.\n\nThe PNSC will be the regulator of ferry companies ensuring the technical aspect of ships and their services.\n\nMeanwhile, a senior official of Karachi Port Trust told Dawn that the ferry terminal has already been established at the Karachi port.\n\nOnce the relevant formalities are notified, the terminal will be handed over to the Federal Investigation Agency (FIA) for immigration and passport duties.\n\nOther relevant departments, including Customs and security agencies, will also deploy staff at the ferry terminals in both Karachi and Gwadar.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/02074357655d883.png?r=074713",
  "retrievedAt": "2025-08-16T07:04:12.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928757/pakistan-approves-first-ferry-service-licence",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:20:51.000Z"
}
