{
  "title": "Turkiye confers highest military award on Pakistan naval chief - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of the Naval Staff (CNS) Admiral Naveed Ashraf was conferred Turkiye’s highest military award — titled Legion of Merit of the Turkish Armed Forces — for his efforts towards “defence and maritime cooperation” between the two nations, the Pakistan Navy said on Tuesday.\n\nPakistani armed forces routinely conduct joint military exercises with other nations to increase combat readiness and identify problems in logistics, training, and current military doctrine.\n\nPakistan Navy, in its statement, said the commander of Turkish Navy, Admiral Ercument Tatlioglu, “presented [the] award to Adm Naveed Ashraf in recognition of his efforts to strengthen defence & maritime coop b/w the two countries”.\n\nThe award ceremony was held at the headquarters of the Turkish Naval Forces, where he was also given a guard of honour.\n\nPakistan’s naval chief called upon Turkiye’s Defence Minister Yasar Guler, Chief of General Staff Metin Gurak, and the Commander of the Turkish Navy Fleet, Admiral Kadir Yildiz.\n\nThe two sides discussed collaborative avenues between Pakistan and Turkiye’s navies, mainly “regional maritime security, defence cooperation,” and increased interaction via “joint exercises, mutual visits, training and exchange programmes”.\n\nThe CNS visited the Istanbul Naval Shipyard, where he was briefed on the Pakistan Navy’s Milgem project.\n\nPakistan Navy signed the contract for four Milgem class corvettes with Turkiye in 2018.\n\nUnder the contract, two ships are to be constructed at the Istanbul Naval Shipyard and the other two at the Karachi Shipyard and Engineering Works.\n\nThe naval chief also observed submarine construction at Golchuk Naval Base. Following this, he visited Turkish naval ships, including “TCG Oruçreis, S/M PIRIREIS and NDU”, the statement said.\n\nThe naval chief paid his respect to Turkiye’s founder, Mustafa Kemal Atatürk, by laying a wreath at his mausoleum.\n\nOn July 10, a delegation led by Turkish Defence Minister Yasar Güler called on Pakistan Air Force Chief Air Marshal Zaheer Ahmed Baber Sidhu, where both sides agreed on the establishment of dedicated joint working groups to streamline and accelerate progress across various sectors of mutual interest.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/05142928e1ea0b7.jpg",
  "retrievedAt": "2025-08-16T07:03:00.602Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928890/turkiye-confers-highest-military-award-on-pakistan-naval-chief",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T10:58:48.000Z"
}
