{
  "title": "Order on Bahria Town properties’ auction reserved - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) has reserved its verdict on petitions against the proposed auction of Bahria Town properties.\n\nThe assets were attached in connection with a plea bargain agreement reached in the £190 million case.\n\nEarlier this year, the National Accountability Bureau (NAB) issued a public notice to auction six Bahria Town properties in Rawalpindi and Islamabad after Mr Riaz, the chairman of Bahria Town, and his son Ali failed to pay the amount agreed in the plea deal to settle the case.\n\nHowever, the IHC stayed the auction. Last month, the accountability watchdog moved the court to vacate the stay order.\n\nAn IHC division bench, comprising Chief Justice Sardar Muhammad Sarfraz Dogar and Justice Mohammad Asif, reserved the judgment on Monday after hearing detailed arguments from both sides.\n\nState-run PTV says NAB to hold auction on Aug 7\n\nSenior lawyer Farooq H. Naik appeared on behalf of Bahria Town, while prosecutor Rafay Maqsood represented the National Accountability Bureau (NAB).\n\nMr Naik argued that NAB’s auction notice was “illegal, deceptive, and issued with mala fide intent”.\n\nHe said Bahria Town was not a party to the plea bargain case and had been wrongfully targeted.\n\nHe added that Mr Zain, who had pledged Bahria Town properties as collateral, had applied for cancellation of his plea bargain, and that application was still pending. “If the plea bargain is under judicial scrutiny, NAB cannot lawfully proceed with the auction,” Mr Naik submitted.\n\nHe contended that NAB’s move to attach and auction Bahria Town’s properties lacked legal basis, as the company itself had not been declared an accused in any reference related to the £190 million case.\n\nThe NAB prosecutor rejected Bahria Town’s position, stating that Mr Riaz and his son had entered into a plea bargain with NAB but failed to pay the agreed-upon amount.\n\nNAB decided to auction the properties to recover the outstanding amount under Section 33E of the NAB Ordinance, 1999.\n\nMr Maqsood stated a similar plea had earlier been dismissed by a trial court, after which the petitioners approached the IHC, which issued the stay order on June 12, on the day of the auction.\n\nNAB subsequently filed an application to vacate the stay order.\n\nThe NAB prosecutor pointed out the Lahore High Court’s Rawalpindi Bench had directed the petitioners to approach the auction committee, and that attempts to invoke the IHC’s stay order before that bench had been rejected.\n\nBahria Town’s counsel described the move as a violation of due process, warning it would damage investor confidence and the business environment.\n\nThe court echoed the concern, stressing the need for transparency and legal clarity, particularly when dealing with assets not directly tied to any accused individual.\n\nSeparately, a late night tweet from state broadcaster PTV‘s X account announced that NAB had set a date for the auction of Malik Riaz’s properties. It said the auction would take place on August 7, 2025, at the NAB Rawalpindi Office, Sector G-6/1, Islamabad.\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:03:36.275Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928834",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:20:40.000Z"
}
