{
  "title": "Trump says he will ‘very substantially’ raise tariffs on India in next 24 hours over Russian oil purchases - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump on Tuesday said he would increase the tariff charged on imports from India from the current rate of 25 per cent “very substantially” over the next 24 hours, given India’s continued purchases of Russian oil.\n\n“India has not been a good trading partner, because they do a lot of business with us, but we don’t do business with them. So we settled on 25pc but I think I’m going to raise that very substantially over the next 24 hours, because they’re buying Russian oil,” he told CNBC in a televised interview.\n\n“They’re fuelling the war machine, and if they’re going to do that, then I’m not going to be happy,” Trump said, adding that the main sticking point with India was that its tariffs were too high.\n\nHe did not provide a new tariff rate for India.\n\nTrump last week said he would impose a 25pc tariff on goods imported from India and added that the world’s fifth-largest economy would also face an unspecified penalty, but gave no details. Later, Trump mou­nted a sharp attack and said: “I don’t care what India does with Russia. They can take their dead economies down together, for all I care.”\n\nOver the weekend, two Indian government sources told Reuters that India will keep purchasing oil from Russia despite Trump’s threats. In turn, White House Deputy Chief of Staff Stephen Miller had accused India of effectively financing Russia’s war in Ukraine by purchasing oil from Moscow.\n\nTrump had made the same threat about substantially raising tariffs a day ago.\n\nResponding to the threat, India’s Ministry of External Affairs (MEA) issued a statement claiming that the US and the European Union “targeted” New Delhi for purchasing Russian oil after Moscow invaded Ukraine in 2022.\n\n“India began importing from Russia because traditional supplies were diverted to Europe after the outbreak of the conflict,” the statement read. “The US at that time actively encouraged such imports by India for strengthening global energy market stability.”\n\nThe MEA highlighted in its statement that the very nations criticising India were engaging in trade with Russia themselves, adding that the goods exchanged include energy, fertilisers, mining products, chemicals, iron and steel and machinery and transport equipment.\n\n“Where the United States is concerned, it continues to import from Russia uranium hexafluoride for its nuclear industry, palladium for its electric vehicle industry, fertilisers, as well as chemicals,” the MEA statement added.\n\n“In this background, the targeting of India is unjustified and unreasonable. Like any major economy, India will take all necessary measures to safeguard its national interests and economic security.”\n\nIndia, the world’s third-largest oil importer, is the biggest buyer of seaborne Russian crude, a vital revenue earner for Russia as it wages war in Ukraine for a fourth year.\n\nThe US levy on India exceeds those agreed by some other nations in deals with the Trump administration. For example, the tariff on Vietnam is set at 20pc and on Indonesia at 19pc, with levies of 15pc on Japanese and European Union exports.\n\nLast week, Trump said Washington had reached a trade deal with India’s arch-rival Pakistan that Islamabad said would lead to lower tariffs on its exports.\n\nSince India’s short but deadly conflict with Pakistan in May, New Delhi has been unhappy about Trump’s closeness with Islamabad and has protested, casting a shadow over trade talks.\n\nDespite former public displays of bonhomie between Trump and Indian Prime Minister Narendra Modi, India has taken a slightly harder stance against the US in recent weeks.\n\nTrump has repeatedly taken credit for the India-Pakistan ceasefire he announced on social media on May 10, but India disputes his claim that it resulted from his intervention and trade threats.\n\nBy declaring the Indian economy dead in the water, Trump has put Modi and his party in a bind. Until recently, the ruling Bharatiya Janata Party was canvassing support for the US president’s election. Its supporters were holding special prayers and muttering mystical chants for Trump’s victory. There was at least one temple created where a sculptured image of Trump was worshipped.\n\nBut Trump has ignored the lavish praise and called out India’s energy imports from Russia and its tariff regime as non-negotiable.\n\nThe Indian government said it was trying to figure out a response by consulting all the “stakeholders”, a euphemism for angry businesses whose hopes were riding on Modi’s daring ability to play both sides of the street.\n\nThat appears to have hit a dead-end.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/051808305af79f6.jpg",
  "retrievedAt": "2025-08-16T07:02:55.184Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928905/trump-says-he-will-very-substantially-raise-tariffs-on-india-in-next-24-hours-over-russian-oil-purchases",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T13:09:11.000Z"
}
