{
  "title": "Body recovered from receding glacier in Kohistan after 28 years - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: Body of a man, who had gone missing nearly three decades ago in the remote mountainous Spat Valley of Kolai-Palas (Kohistan) district has been recovered after the glacier that buried him melted rapidly due to unusually hot weather.\n\n“The body of a man, who was swept away by a glacier over 28 years ago, has been found by locals after the massive glacier melted in recent days,” district police officer Amjad Hussain told reporters on Monday.\n\nAccording to locals, the deceased, identified as Naseerudden, was buried under the glacier along with his horse while returning from Allai area of Battagram.\n\nThey said the man was associated with cattle trade. His body was found intact and still recognisable, and his national identity card was also recovered from his clothing.\n\n“A group of visitors spotted the body and informed nearby villagers, who buried it at a local site and later informed the bereaved family,” DPO Hussain said.\n\nHe said Naseerudden had left behind a daughter and a son, who were still alive and currently residing in the Allai area of Battagram.\n\n“The rumours are circulating that the man was murdered, but these are entirely baseless. His brother survived the tragedy,” Mr Hussain clarified.\n\n“At the time of the incident, the family and residents even attempted to search 150 feet deep into the glacier but were unsuccessful,” a resident said. “Now, the body would be shifted to our native village in Koz Shayar, Gohir Abad, for formal burial.”\n\nPublished in Dawn, August 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/1109072881c133a.jpg?r=090745",
  "retrievedAt": "2025-08-16T07:03:44.728Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928721/body-recovered-from-receding-glacier-in-kohistan-after-28-years",
  "dateList": "2025-08-05",
  "date_published": "2025-08-05T00:23:22.000Z"
}
