{
  "article_id": "2025-05-14_1fde278a318ecc742555d5cdb3d148a4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kamal-asks-nih-to-enhance-local-vaccine-production/",
    "retrieved_at": "2025-08-27T15:26:57.791Z"
  },
  "metadata": {
    "title": "Kamal asks NIH to enhance local vaccine production",
    "author": null,
    "date_published": "2025-05-14T14:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 213,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 14 (APP):Federal Minister for Health, Syed Mustafa Kamal on Wednesday visited the National Institute of Health (NIH) and directed significant enhancement in local vaccine production. During his visit, the Minister also called for a comprehensive national strategy on water and sanitation. He toured various facilities at the NIH, including the vaccine production unit, public health laboratories, the Polio Regional Reference Laboratory, and the Water and Food Testing Laboratory. He also inspected the National Health Data Center. The visit concluded with a detailed briefing by NIH Chief Executive Officer Dr Muhammad Salman. Speaking to scientists and staff, Kamal emphasized the potential of NIH in advancing public health and urged full utilization of its capacities. He stressed the need for Pakistan to achieve self-reliance in vaccine development and production. \"The NIH must lead efforts in strengthening indigenous vaccine capabilities to protect our population and reduce dependency on imports,\" Kamal stated. Highlighting the impact of contaminated water on public health, the Minister directed that water and sanitation must become a core focus of NIH's disease prevention strategy. \"Most diseases affecting our people are waterborne. Without addressing water contamination, we cannot realize the vision of a healthy Pakistan,\" he said. Kamal also called for nationwide awareness campaigns and active stakeholder engagement to tackle these challenges.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}