{
  "article_id": "2025-05-14_5668e92abed39d261472af55c6220838",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/huawei-signs-mou-with-edu-ministry-to-train-300000-pakistani-students-in-ict-skills/",
    "retrieved_at": "2025-08-27T15:26:56.863Z"
  },
  "metadata": {
    "title": "Huawei signs MoU with edu ministry to train 300,000 Pakistani students in ICT Skills",
    "author": null,
    "date_published": "2025-05-14T14:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 388,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 14 (APP):In a landmark step toward Pakistan's digital transformation, Huawei Technologies signed a Memorandum of Understanding (MoU) with the Ministry of Federal Education and Professional Training (MoFEPT) to train students from the Federal Directorate of Education (FDE). This initiative marks the first phase of Huawei's ambitious plan to train 300,000 Pakistani youth in cutting-edge ICT skills. Minister for Federal Education and Professional Training Dr. Khalid Maqbool Siddiqui chaired the MoU signing ceremony between the Ministry of Federal Education and Professional Training and Huawei Technologies Pakistan (Pvt) Ltd. The MoU was formally signed by Mr. Nadeem Mahboob, Secretary of MoFEPT, and Mr. Ahmad Aziz, Manager Development at Huawei, in a ceremony where both parties exchanged documents. The collaboration aims to equip Pakistani students with advanced technical expertise, fostering a skilled workforce ready to drive the nation's digital future. Secretary Education Mr. Nadeem Mahboob emphasized that this partnership will accelerate Pakistan's IT exports and job creation, while Mr. Ahmad Aziz reaffirmed Huawei's dedication to bridging the digital skills gap through globally recognized certifications. This initiative underscores Huawei's long-term partnership with Pakistan, aligning with the government's vision of a tech-driven economy. With third-party validation ensuring training quality, the program is set to empower youth and position Pakistan as a hub for IT talent. The MoU will lead to 300,000 youth to be trained in IT and emerging technologies by the end of the year, while 60,000 trainees will receive high-tech training (AI, cloud computing, cybersecurity, big data). Similarly, 240,000 trainees will undergo basic IT skills development. 15 Pakistani universities have already integrated Huawei's AI, cloud, and cybersecurity courses, with 20,000+ students trained so far. The Memorandum of Understanding (MoU) will provide ICT training to students under the Federal Directorate of Education (FDE) in Islamabad, with additional outreach in Azad Jammu & Kashmir (AJK) and Gilgit-Baltistan (GB). The initiative, part of the Prime Minister's Youth Program, aims to equip 146,367 students with essential digital skills, leveraging 1,300+ labs across these regions. The program will include summer camps starting June 2025, targeting 50,000 students initially, with a focus on AI, cloud computing, and cybersecurity. Huawei will support training and certification, while MoFEPT will provide facilities and trainers. This collaboration underscores Huawei's commitment to Pakistan's digital future, building on its existing partnerships with 15 universities that have already trained over 20,000 students.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}