{
  "article_id": "2025-05-14_176ea773590a640ceef4336389379818",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pak-turkiye-parliamentary-friendship-group-meets-turkish-ambassador/",
    "retrieved_at": "2025-08-27T15:27:20.858Z"
  },
  "metadata": {
    "title": "Pak-Türkiye Parliamentary Friendship Group meets Turkish Ambassador",
    "author": null,
    "date_published": "2025-05-14T13:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 191,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 14 (APP):The Pakistan-Turkiye Parliamentary Friendship Group (PFG) held a meeting with Dr. Irfan Neziroglu, the Turkish Ambassador to Pakistan, at the Turkish Embassy in Islamabad. According to a press release, Shaista Pervaiz Malik, MNA and Convener of the PFG, led the delegation, which included members Rai Hassan Nawaz Khan, Mirza Ikhtiar Baig, Sharmila Sahiba Faruqui Hashaam, Farah Naz Akbar, and Nikhat Shakeel Khan. The meeting aimed to express Pakistan's deep appreciation to Turkiye for its strong support during recent tensions with India. The group acknowledged Turkiye's consistent solidarity at various forums, highlighting the enduring friendship between the two nations. Ms. Malik emphasized the importance of inter-parliamentary dialogue in strengthening cooperation and mutual understanding. The PFG remains committed to enhancing parliamentary exchanges and collaboration in areas such as education, culture, trade, and sports. Both sides discussed the shared values of peace and regional stability, recognizing Turkiye's constructive role in promoting harmony. They agreed to pursue regular engagements to ensure ongoing dialogue and strategic partnership. In closing, the PFG members reiterated their gratitude for Turkiye's steadfast friendship and their commitment to deepening this vital partnership for the benefit of both countries.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}