{
  "article_id": "2025-05-14_adfbea7b5a58b4f6508815b602488f85",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/provincial-governments-nadra-sign-agreements-to-enhance-crvs-system/",
    "retrieved_at": "2025-08-27T15:26:52.943Z"
  },
  "metadata": {
    "title": "Provincial governments & NADRA sign agreements to enhance CRVS system",
    "author": null,
    "date_published": "2025-05-14T15:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 316,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 14 (APP):Advancing the Government of Pakistan's \"Udaan Pakistan\" initiative for digital transformation, National Database and Registration Authority (NADRA), in collaboration with provincial governments, has rolled out the deployment of digital Birth and Death Notification Tools in healthcare facilities across the country. Under the National Registration and Biometric Policy Framework, NADRA is taking concrete steps to modernize Pakistan's Civil Registration and Vital Statistics (CRVS) system. Digital tools are being installed at healthcare facilities to enable real-time, accurate and complete recording of vital life events - such as births and deaths - at the point of occurrence. The data collected through this system will serve as a foundational element of the federal government's \"Udaan Pakistan\" program, supporting technology-driven reforms and fostering economic activity through the development of robust digital infrastructure. These accurate statistics will also fuel transformative national projects such as Digital ID and the Digital Economy. In line with these efforts, NADRA is leading the implementation of the Digital Economy Enhancement Project (DEEP) - a collaborative initiative supported by the World Bank and implemented in coordination with other national stakeholders. To operationalize this system across the country, including in Azad Jammu and Kashmir (AJ&K) and Gilgit-Baltistan (GB), a series of formal agreements are being signed between NADRA and respective provincial governments. A recent signing ceremony in Karachi was attended by Mr. Saeed Ghani, Provincial Minister for Local Government, Housing, and Town Planning, Sindh. The agreement was signed by the Secretary of Health and Secretary of Local Government on behalf of the Sindh government, and by the Director General NADRA Karachi. Earlier, a similar agreement was signed in Quetta between NADRA and the Government of Balochistan, represented by the Provincial Secretary of Health, Secretary of Local Government, and Director General NADRA Balochistan. Further agreements with other provinces, as well as with the governments of AJ&K and GB, are scheduled to be signed in the coming days.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}