{
  "article_id": "2025-05-14_20f9e4b6fbee959c23aae4290b4947ef",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sdpi-wpc-call-for-reform-accountability-legislative-action/",
    "retrieved_at": "2025-08-27T15:27:00.490Z"
  },
  "metadata": {
    "title": "SDPI, WPC call for reform, accountability, legislative action",
    "author": null,
    "date_published": "2025-05-14T14:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 662,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, May 14 (APP):Women parliamentarians, civil society actors and policy experts here on Wednesday gathered at a high-level roundtable titled \"Raising Her Voice in Politics\", jointly hosted by the Sustainable Development Policy Institute (SDPI) and the Women's Parliamentary Caucus (WPC) comprising parliamentarians from National Assembly and Senate of Pakistan PPP, PML-N, PTI, JUI and MQM-P to spotlight Pakistan's persistent gaps in women's political representation and to push for immediate party and legislative reforms. In her welcome remarks from Chairperson, Women Parliamentarians Caucus, MNA Shahida Rehmani, who lauded SDPI for organizing the forum. \"It's a shared goal to not only include women in political parties but empower them to shape their own futures,\" she said. Dr Rehmani further stated, \"Despite of 5 percent quota requirement under the Elections Act 2017, compliance remains weak, these figures reflect not just under representation but active gate keeping within party structures.\" Dr Rehmani also emphasized that women faced systemic challenges within political parties and called for urgent solutions to ensure gender parity. She underscored the need for a binding 33 percent representation in all new political formations and highlighted gender policy equality as the critical path forward, said a press release. As per the SDPI research, Pakistan's demographic reality further underscores the urgency of reform. Women make up 49 percent of the country's population, with 59 million registered female voters as of 2024. However, only 42 percent of women cast their votes in the last general election a 5 percent decline from 2018. Despite this numerical strength, women's influence in political decision-making remains minimal. An SDPI analysis of the constitutions of 19 political parties represented in Parliament found that only five parties complied with the 5 percent women's general seat nomination requirement. Notably, the Balochistan National Party and Awami National Party included 9 and 10 women, respectively, in their Central Executive Committees - highlighting a few examples of positive practice, though far from the norm. To better understand the legal framework, SDPI reviewed the Political Parties Order (PPO) 2002 and the Elections Act 2017. While the 2013 amendment to PPO 2002 enabled the introduction of a 5% nomination quota for women on general seats, another provision - calling for 33% representation of women political workers in all elected and non-elected bodies of political parties - was sidelined during legislative discussions and remains unimplemented. In light of these findings, Mr. Qasim Shah, Deputy Executive Director SDPI, stated \" A set of recommendations for urgent legislative and institutional reform. First, Section 208 of the Elections Act 2017 should be amended to require political parties to ensure at least 33 percent representation of women as office bearers in both elected and non-elected bodies - proportionate to the female population. Second, Section 202 of the same Act, which mandates a minimum of 2,000 members for party registration, should be revised to include a mandatory requirement of 33 percent female membership, ensuring gender-inclusive party formation from the outset.\" Parliamentarians and Senators present at the roundtable welcomed these recommendations and voiced their support for institutional reform, gender audits, and accountability within political parties. They emphasized the need for a shift away from tokenism toward meaningful inclusion. In his vote of thanks, Dr. Abid Qaiyum Suleri, Executive Director, SDPI, said, \"It's not enough to offer symbolic seats or fulfill quotas on paper. For democracy to be inclusive, women must be empowered to lead from the front. Marginalization of women is a global issue. Even the United Nations has yet to elect a woman Secretary General,\" he said, citing the \"One for Eight Billion\" campaign. Dr. Suleri urged an amendment to the Election Commission Act 2019 to enforce women's inclusion in political processes. In her closing remarks, MNA Tahira Aurangzeb of PML-N praised SDPI's efforts and reaffirmed the Caucus's commitment to progressive reforms. \"Women should comprise 50 percent of all political parties,\" she said. \"They not only bring inclusivity but also utilize development funds more effectively. Punjab's progress under female leadership is testament to that.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}