{
  "article_id": "2025-05-14_62f548845b2de5de0f95d6c9a2b02815",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/steps-underway-to-upgrade-sukkur-airport-to-international-standard-says-zeb-jaffar/",
    "retrieved_at": "2025-08-27T15:27:56.054Z"
  },
  "metadata": {
    "title": "Steps underway to upgrade Sukkur Airport to international standard: Says Zeb Jaffar",
    "author": null,
    "date_published": "2025-05-14T10:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 248,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 14 (APP):The National Assembly was informed on Wednesday that steps are being taken to upgrade Sukkur Airport to international standards, including improvements to its runway. Responding to a question during the National Assembly's question hour, Parliamentary Secretary for Aviation Zeb Jaffar stated that efforts are in progress to develop Sukkur into an international airport. She said Pakistan International Airlines (PIA), being a state-owned entity, must operate in line with international market dynamics to ensure sustainability. This includes consideration of foreign exchange rates and operational costs. Addressing concerns raised by MNA Haji Jamal Kakakhel, Zeb Jaffar assured that complaints regarding high airfare from Quetta would be reviewed. Responding to a supplementary question from MNA Alia Kamran, she acknowledged that airfare generally increases during Eid and other festive occasions due to heightened demand across all transport sectors. She added that PIA has recently returned to profitability, earning over Rs 26 billion. Efforts are underway to further enhance this performance. In response to a question from Zartaj Gul, Jafar said that in regions where PIA does not operate, private airlines have been licensed to provide air travel services to ensure accessibility. She clarified that PIA does not offer free travel facilities, except for concessional fares granted to employees' families. Jaffar reiterated that the transformation of Sukkur Airport into an international facility is a priority, and work on runway upgrades is currently ongoing. Presently, the PIA fleet includes 19 aircraft: six Boeing 777s, eleven Airbus A320s, and the rest ATRs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}