{
  "article_id": "2025-05-14_087adc545e53546249427a099801c5d8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sc-reinstates-sales-tax-amendment-act-for-fata-and-pata/",
    "retrieved_at": "2025-08-27T15:28:42.252Z"
  },
  "metadata": {
    "title": "SC reinstates Sales Tax Amendment Act for FATA and PATA",
    "author": null,
    "date_published": "2025-05-14T08:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 233,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 14 (APP):The Supreme Court's constitutional bench has reinstated the Sales Tax Amendment Act for the formerly Federally Administered Tribal Areas (FATA) and Provincially Administered Tribal Areas (PATA), suspending the Peshawar High Court's earlier verdict that had nullified the act. The case concerning the exemption granted under the Sixth Schedule of the Sales Tax Act for residents of FATA and PATA was heard on Wednesday by the five-member Constitutional Bench, headed by Justice Amin-ud-Din Khan. Other members of the bench included Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Syed Hasan Azhar Rizvi, and Justice Shahid Bilal Hassan. During the hearing, counsel for the Pakistan Vanaspati Manufacturers Association (PVMA), Advocate Hafiz Ehsan Ahmed Khokhar, argued that the high court does not have the authority to legislate in place of Parliament. He maintained that the Peshawar High Court exceeded its jurisdiction by granting relief beyond what was requested in the petition. The Supreme Court, in its order, suspended the Peshawar High Court's decision and reinstated the Sales Tax Amendment Act in the erstwhile FATA and PATA regions. The apex court also issued a stay order on the appeals filed by the association. Notices were issued to all parties, and further proceedings on the appeals have been adjourned for an indefinite period. It is worth noting that the Peshawar High Court had previously declared the said Sales Tax Amendment Act null and void.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}