{
  "article_id": "2025-05-14_f106f99c32ac61837cddb4e2ef09015c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/uaf-assistant-professor-conferred-digital-green-talent-award/",
    "retrieved_at": "2025-08-27T15:27:53.504Z"
  },
  "metadata": {
    "title": "UAF assistant professor conferred Digital Green Talent Award",
    "author": null,
    "date_published": "2025-05-14T11:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 288,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "FAISALABAD, May 14 (APP):German Federal Ministry of Education and Research has conferred the Digital Green Talent Award on Pakistan scientist Dr Muhammad Haroon-ur-Rashid, who is working as Assistant Professor in the Department of Forestry & Range Management University of Agriculture Faisalabad (UAF). A spokesman said here on Wednesday that this prestigious international recognition is awarded to only 20 outstanding scientists from around the globe by acknowledging their exceptional contributions to sustainable development. He said that the award is meant to promote the international exchange of innovative green ideas at the intersection of digitalization and sustainable development. It focuses on how digitalization can promote greater sustainability in science and society. Aspiring young scientists are invited to Germany for a three-month research stay to turn their ideas and ambitions into reality, he added. He said that Dr Muhammad Haroon-ur-Rashid holds a PhD in Forest Ecology and has contributed significantly to sustainable forestry and climate change mitigation. He worked on the Trees Outside Forests project at Michigan State University under USDA funding, focusing on enhancing green cover beyond traditional forest areas. Currently, Dr Haroon is working on the carbon sequestration potential of bamboo, promoting nature-based climate solutions. As the Focal Person of the Green Youth Movement Club at the UAF, he actively engages youth in environmental stewardship, climate action, and plantation drives, fostering a culture of sustainability and green innovation among students. It is worth mentioning here that UAF holds a galaxy of scientists who are proving their mettle globally. Having the distinction of being first-ever agricultural institution in the subcontinent and established in 1906 on the recommendation of famine commission, it has played a pivotal role and made hallmark contribution for the food security, agriculture and rural development, spokesman added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}