{
  "title": "Railways upgrade 181 un-manned crossings in country",
  "link": "https://www.app.com.pk/national/railways-upgrade-181-un-manned-crossings-in-country/",
  "date_published": "2023-12-03T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP):Pakistan Railways has converted approximately 181 un-manned level crossings to manned level crossings across the country, out of 550 identified by the department over the entire railway network in over one year.\n“The relevant provincial government provided the finances to Pakistan Railways for the up-gradation of un-manned level crossings in the country,” official sources in the Ministry of Railways told APP.\nThey said the department was taking several steps including the up-gradation of unmanned and vulnerable railway level crossings across the country in collaboration with respective provincial governments.\nThe sources said there were two types of level crossings over the Pakistan Railways network, un-manned and manned level crossings, adding that the un-manned level crossings were without gate leaves.\n“There is a total of 1,565 unmanned level crossings over the entire railway network and as per railway policy in vogue, the up-gradation of any unmanned or manned level crossing is the responsibility of road owning authority,” they added.\nThe said that un-manned level crossings without gates leaves and gate men, were previously provided where ‘Kacha path’ with low traffic volume crosses the railway track to facilitate movement of locals, farmers and carts at their own risks.\nHowever, they said, “Due to high risk of accidents on existing un-manned level crossings, construction and provision of new un-manned level crossing is completely banned on entire Railway system as per Railway policy for level crossings from 2019.”\nThe sources said that a joint survey of Pakistan Railways and the Provincial Government was also conducted in 2013-14 to identify accident-prone/vulnerable un-manned level crossings across the country.\nThey said that it also mentioned Section 12 of the Railway Act of 1890 that the district administration or road authority should bear the expenses for the upgrade of these unmanned level crossings.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:49:29.895Z"
}
