{
  "title": "Asghar Mall College holds Punjab’s first-ever informative documentaries’ contest, exhibition",
  "link": "https://www.app.com.pk/national/asghar-mall-college-holds-punjabs-first-ever-informative-documentaries-contest-exhibition/",
  "date_published": "2023-12-03T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP):The Government Graduate College Asghar Mall Rawalpindi has organised the Punjab’s first-ever in-house informative documentaries competition and exhibition on the history of over a century-old Alma mater of the garrison city.\nThe informative documentaries’ exhibition and competition titled “We Picturized the History of an Era into Pictures” was participated by 13 BS and Intermediate level departments out of the total 22 departments of the college that also comprise of intermediate level.\nThe students were tasked to make documentaries on mainly “our college, our department, History of Asghar Mall College, Library, Hostel, and Any Informative Topic about the College”.\nThe documentaries were selected from 8 out of 12 departments’ submissions by their respective teams for the competition English, Chemistry, Geography, Zoology, History, Statistics, Mathematics and Intermediate.\nThe competition was supervised by the Principal Government Graduate College Asghar Mall Rawalpindi Prof Dr Abdul Kabir Mohsin and Vice Principal Moeen Qureshi.\nHead of Department of Urdu, Prof Baqir Waseem rendered the duties of stage secretary at the Competition. He said Asghar Mall College is the first institution in the Punjab province to hold such a competition on compiling its history which will be guiding step for the students to explore media, arts, data archiving and information handling in the digital age through this activity.\nThe competition jury included the Chief judge Naveed Anjum, Director and Producer Aur TV, Sajjad Haider, journalist from Capital TV and Ali Jabir Malik jounralist from APP.\nThe documentaries showcased “Basera” titled on Hostel by the Department of Mathematics, Our College by the Department of Statistics, Library by Intermediate team, History of Government College Asghar Mall Rawalpindi by the Department of English, Brief history of Zoological Science by Department of Zoology, History of Geography Department by the Department of Geography, Department of Chemistry team created its documentary on the department’s history, and the Department of Mathematics team’s documentary was titled ‘Riazi Daan’ (mathematician).\nSpeaking on the occasion, Principal of the College Prof Dr Abdul Kabir Mohsin appreciated the departments’ faculty for amicably organizing the competition. He said the teachers have successfully accomplished the task of compiling and showcasing the documentaries. “It will trigger a new passion among the students to explore new venues of digital age and social media for creating content as a source of information and entertainment,” he added.\nThe documentaries, he said is not only an activity of imparting skills but rather, a practice to challenge in the intelligence quest and creativity among the male and female students seeking education in this prestigious institution. He said, “Such activities inculcate the spirit of teamwork, dedication, commitment, courage, sacrifice and above all national service which is crucial for promoting sense of patriotism and social work in the young minds.” He expressed his best wishes for the students and wished success in their future endeavors.\nVice Principal, Academics, Prof Tariq Ehsan said the present era is of media and it is important to make the students acquainted to the emerging trends of social media. The effort was a tedious task to make documentaries for the first time which helped us incorporate new skills into the students and the college faculty would continue such endeavors with the same zeal and motivation, he added.\nVice Principal, Administration, Prof Abdul Moeen Qureshi said that the college was among the supreme institutions of the province that produced a lot of talented and successful personalities of Pakistan.\n“Today’s program is an effort to polish the creative aspect of the student’s imagination and the successful accomplishment of their task is the proof to the expansion of their skills,” he said.\nProf Qureshi said the internet has changed the working and thinking of the people at large and the students should be well aware of all these technologies to serve the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:49:53.732Z"
}
