{
  "title": "NDMA showcased Pakistan’s strategic project Green Pakistan Initiative at COP28",
  "link": "https://www.app.com.pk/national/ndma-showcased-pakistans-strategic-project-green-pakistan-initiative-at-cop28/",
  "date_published": "2023-12-03T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP): The National Disaster Management Authority (NDMA) on Sunday showcased Pakistan’s strategic project Green Pakistan Initiative during a plenary discussion “Strengthening Delivery: Aligning development, humanitarian and climate finance” organised by IFAD and Green Climate Fund (GCF) at the 28th Conference of the Parties (COP28) at UAE meeting.\nChairman NDMA, Lieutenant General, Inam Haider Malik participated in a special session and highlighted Pakistan’s Proactive Disaster Management enhancing indigenous capacities to prevent and minimise disaster losses, a news release said.\nHe also discussed climate-smart agriculture collaboration with the International Fund for Agricultural Development (IFAD). The Chairman NDMA stressed the need to provide climate finances to undertake projects in disaster-hit countries like Pakistan.\nHe also held a meeting with Practice Manager, Climate Change and Disaster Risk Management, South Asia Region, World Bank, Abhas Jha at COP28, Dubai.\nBoth discussed possible collaborations with WB for long-term sustainability and extended scope of National Emergencies Operations Center (NEOC) operations, capacity strengthening interventions. The World Bank official assured of their support and potential collaborations to strengthen the overall disaster risk management (DRM) system in the country.\nAt another sideline meeting with the CEO IRC, David Milliband, the NDMA Chairman apprised of the operations of the NEOC established at the NDMA and its critical role in anticipating disasters well in advance to ensure timely actions for saving losses of lives and properties. The CEO IRC outlined the work being carried out by IRC, and stated that IRC is now investing in Anticipatory Actions with a belief that it can play a crucial role in averting humanitarian disasters.",
  "retrievedAt": "2025-08-11T10:49:34.643Z"
}
