{
  "title": "Sindhi Cultural Day celebrated with enthusiasm by Soormiyun at PNCA",
  "link": "https://www.app.com.pk/national/sindhi-cultural-day-celebrated-with-enthusiasm-by-soormiyun-at-pnca/",
  "date_published": "2023-12-03T12:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 03 (APP): Soormiyun, a cultural organization, in collaboration with Sindh Cultural Department and Takori hosted a vibrant and colorful celebration of Sindhi Cultural Day at the Pakistan National Council of Arts (PNCA) in Islamabad.\nThe event, held here yesterday, aimed to showcase the rich heritage of Sindhi culture while emphasizing the importance of cultural harmony and empowering women belonging to diverse backgrounds and fields.\nThe event was presided over by Federal Education Minister Mr Madad Ali Sindhi.\nFederal Minister for Information and Broadcasting Mr Murtaza Solangi graced the event as the chief guest, adding prestige to the Sindhi cultural program.\nThe theme of the event revolved around providing a platform for promoting cultural harmony, women role in mitigating the hazards of Global warming, and empowering women from various walks of life.\nThe highlight of the program was the performance of the captivating Soormiyun song, which beautifully encapsulated the spirits of Soormiyun working in Islamabad.\nThroughout the celebration, various activities were organized to foster cultural understanding and importance of unity.\nTabloos showcasing the diversity of Sindhi culture, as well as panel discussions, were conducted to promote cultural harmony, peace, women role in climate change and gender equality by women empowerment.\nGulnaz Sheikh, the founder of Soormiyun, expressed that these programs extend beyond a one-day event.\nAccording to Sheikh, Sindh is the land of Sufism and we being Shah Latif’s Soormiyun are spreading the main message of cultural diversity, love, peace, and gender equality within cultural values by empowering women.\nSheikh emphasized, “Soormiyun envisions a society where there is no place for extremism but cultural diversities flourish and are celebrated and today’s event is a testament to our commitment to fostering these ideals.”\nIn this event people from all communities were invited and it not only showcased the vibrant Sindhi culture but also served as a reminder of the power of cultural exchange in promoting understanding and unity among diverse communities.\nSoormiyun remains steadfast in its mission to continue organizing events that contribute to the promotion of cultural diversity, peace, love, gender equality and women empowerment in society.\nThe celebration of Sindhi Cultural Day serves as a beacon of hope and inspiration for a future where cultural diversity is embraced, and women are empowered to realize their full potential.",
  "retrievedAt": "2025-08-11T10:49:45.201Z"
}
