{
  "title": "ECP, political parties to discuss election code of ethics on Wednesday",
  "link": "https://www.app.com.pk/national/ecp-political-parties-to-discuss-election-code-of-ethics-on-wednesday/",
  "date_published": "2023-10-10T09:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): The Election Commission of Pakistan (ECP) and various political parties are set to meet at the ECP secretariat on Wednesday to discuss the draft code of conduct for the upcoming general elections.\nAccording to an ECP official, the Election Commission had previously held an initial consultative session with political parties to deliberate on various election-related issues.\nIn preparation for the upcoming meeting, the ECP has provided political parties with an initial code of conduct. This draft is expected to be an essential component in the final preparations for the upcoming general elections.\nThe ECP has already distributed a preliminary code of conduct to political parties, and this draft is anticipated to play a crucial role in the final arrangements for the upcoming general elections.\nThe draft code of conduct highlights the significance of political parties, candidates, and election agents in safeguarding the rights and freedoms of the people of Pakistan, as guaranteed by the Constitution and the law.\nFurthermore, it cautions against engaging in actions or expressing views that might jeopardize Pakistan’s ideology, sovereignty, integrity, security, or the independence of its judiciary.\nAdditionally, the draft code imposes limitations on public officeholders, including the president and prime minister, preventing them from involvement in any capacity in election campaigns.\nAccording to an ECP official, a copy of the draft Code of Conduct has been dispatched to political party leaders to allow them to offer their input during the consultation process. Additionally, the draft Code of Conduct can also be accessed on the Election Commission’s website at www.ecp.gov.pk.",
  "retrievedAt": "2025-08-11T10:01:38.307Z"
}
