{
  "title": "Secretary BISP hosts E-Katcheri session on Tuesday",
  "link": "https://www.app.com.pk/national/secretary-bisp-hosts-e-katcheri-session-on-tuesday/",
  "date_published": "2023-10-10T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): Secretary of the Benazir Income Support Programme (BISP), Amer Ali Ahmad, conducted a Live E-Katcheri session on Tuesday here at the BISP Headquarters.\nThis online interactive session, hosted on BISP’s official Facebook page, served as a follow-up to a meeting held last week, dedicated to address the unresolved complaints related to the tranche disbursement under the Benazir Kafaalat Programme.\nDuring the Live E-Katcheri, Secretary BISP actively engaged with BISP beneficiaries and the general public, listening to their live calls and inquiries.\nHe took the opportunity to directly communicate with the beneficiaries and understand the challenges they encounter during the registration process.\nThe issues brought up during the session primarily revolved around eligibility status and non-provision of financial assistance.\nIn response, Secretary BISP promptly issued directives to the officers concerned to establish direct contact with the affected beneficiaries and resolve their concerns within a day. A total of 897 complaints have been resolved so far, leading to the recovery of more than Rs. 1.4 million.\nIn a swift response to these matters, BISP management has taken immediate action against the agents responsible for deductions. To date, 12 First Information Reports (FIRs) have been registered, and eight agents have been arrested.\nOne specific complaint regarding the unauthorized withdrawal of funds from a beneficiary’s stipend was addressed decisively by Secretary BISP.\nHe directed the Human Resources department to immediately issue suspension orders of the concerned officials in the respective region to ensure a swift and just resolution.\nAmer Ali Ahmad emphasized the commitment of the Benazir Income Support Programme to ensure the efficient and transparent disbursement of financial assistance to eligible beneficiaries.\nHe stated, “The Live E-Katcheri is an integral part of our ongoing efforts to address grievances and concerns raised by our beneficiaries. We are dedicated to providing timely solutions and improving the overall experience for those who rely on BISP for support.”",
  "retrievedAt": "2025-08-11T10:01:16.531Z"
}
