{
  "title": "General Shaheen proposes solutions for development in merged tribal areas",
  "link": "https://www.app.com.pk/national/general-shaheen-proposes-solutions-for-development-in-merged-tribal-areas/",
  "date_published": "2023-10-10T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): A gathering of intellectuals on Tuesday convened under the Forum for Inquiry, Knowledge, and Review (FIKAR), a think tank project affiliated with the Pakistan Development Foundation, a prominent social organization, involving a concise discussion on the developmental progress in merged tribal areas.\nThe gathering had the participation of 15 heads of diverse institutions. It was presided over by Lt. Gen. Retired Shaheen Mazhar Mahmood, former Corps Commander of Peshawar, and co-hosted by Muhammad Bilal Sethi, Chairman of the Pakistan Development Foundation and Prof. Dr. Qibla Ayaz, Chairman of the Council of Islamic Ideology.\nAddressing the forum as a keynote speaker, Gen Shaheen said the merger of tribal areas into Khyber Pakhtunkhwa (KP) was a significant step in 2018 aimed at integrating these historically marginalized regions into the mainstream. However, it brought about several challenges he said highlighting their possible solutions.\nTo meet governance and administration issues, he proposed to conduct capacity-building programmes for local administrators and civil servants to adapt to the provincial administrative system. He emphasized to establish transparent and accountable mechanisms for the delivery of government services to ensure effective governance.\nTo improve the security mechanism, Gen Shaheen opined to strengthen law enforcement agencies in the merged districts to combat militant groups and enhance intelligence-sharing and coordination with the Afghan government to address cross-border security concerns.\nFor economic development, he asked to promote investment in key sectors such as agriculture, tourism, and small-scale industries to spur economic growth and provide training and support for entrepreneurship and job creation initiatives.\nIn order to improve infrastructure and services, he urged to develop a comprehensive infrastructure development plan, including road construction and healthcare facility expansion besides prioritizing education and healthcare by building more schools and hospitals and training healthcare workers.\nShedding light on the land and property rights, he underlined the need to establish clear land ownership records and mechanisms for dispute resolution and conduct land surveys and provide legal assistance to residents to secure their property rights.\nRegarding social and cultural integration, Gen Shaheen was of the opinion to encourage dialogue between traditional leaders and government officials to find a balance between cultural customs and modern governance and promote cultural exchange programmes to foster mutual understanding and integration.\nFor their true representation, he proposed to ensure fair and inclusive representation of tribal populations in provincial and national assemblies through effective electoral processes and promote political participation and awareness among tribal communities.\nAddressing the issue of economic dependence, he emphasized on developing long-term economic sustainability plans, diversifying revenue sources beyond federal assistance and attract private sector investment and promote local industries to reduce dependence on external funds.\nConcluding his proposals, Gen Shaheen said it was crucial to involve local communities in decision-making processes, engage with civil society organizations, and monitor progress through regular assessments and feedback mechanisms.\nHe said the long-term commitment and collaboration among various stakeholders were essential for the successful integration and development of these historically marginalized regions.",
  "retrievedAt": "2025-08-11T10:01:14.100Z"
}
