{
  "title": "President for greater collaborations to improve recovery of missing children",
  "link": "https://www.app.com.pk/national/president-for-greater-collaborations-to-improve-recovery-of-children/",
  "date_published": "2023-10-10T11:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): President Dr Arif Alvi on Tuesday called for greater collaborations among the civil society, non-governmental organizations (NGOs), national and provincial government departments to raise awareness about the issue of abducted and missing children.\nHe said that steps should be taken to ensure the implementation of Zainab Alert Response & Recovery Act (ZARRA) 2020 throughout the country to protect and safeguard our children.\nThe president expressed these views while chairing a meeting regarding the implementation of Zainab Alert Response & Recovery Act (ZARRA) 2020, at Aiwan-e-Sadr, President Secretariat Press Wing said in a press release.\nThe meeting was attended by Secretary Ministry of Human Rights Allah Dino Khowaja, Director General ZARRA, representatives of different NGOs working for children’s rights, and senior government officials.\nDuring the meeting, the president emphasised the need for awareness at the grassroots levels about the ZARRA Act and responsibility of police officials to ensure timely registration of complaints and FIRs about the missing children.\nHe also called for raising awareness about the ZARRA helpline “1099” among the people to timely register complaints.\nThe president said that response time of the local police to missing children’s complaints should be improved and they should take prompt action to find missing children as the first 24 hours after a child’s disappearance were critical for their recovery.\nHe called for increasing cooperation among the civil society and government departments to protect and recover missing children, besides providing psycho-social counselling to affected children and their families.\nDuring the meeting, the president highlighted the need for further improving the implementation of ZARRA Act by identifying gaps and shortcomings in its implementation at the provincial and district levels.\nHe said that after taking input and advice from civil society and NGOs, corrective measures should be taken to bring about improvements.\nThe president said that ZARRA’s coverage should be extended to the entire country by allocating adequate resources and creating awareness among the people.\nHe also called for ensuring better management of alerts and complaints about missing children on 1099 helpline, PM Citizen Portal and ZARRA app by ensuring 24/7 service to the complainants.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:01:25.875Z"
}
