{
  "title": "France to organise 2nd edition of “Choose France Pakistan – Education Tour” in Lahore, Karachi",
  "link": "https://www.app.com.pk/national/france-to-organise-2nd-edition-of-choose-france-pakistan-education-tour-in-lahore-karachi/",
  "date_published": "2023-10-10T12:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP):France will organise the 2nd edition of “Choose France Pakistan – Education Tour” in Lahore and Karachi on October 17, and 19 respectively.\nThe “Choose France Pakistan – Education Tour” is back in 2023 to explore Lahore and Karachi. The programme included a wide range of fields such as management, engineering, humanities, finance, business and sciences.\nEleven top-notch French universities are part of the delegation, such as Sciences Po Paris, Centrale Nantes and EDHEC.\n“Choose France Pakistan – Education Tour” is a government initiative from France, organised by the French Embassy in Pakistan, Campus France Pakistan and their local partners, in order to promote studying in France, said a news release.\nThe Education fairs in Lahore and Karachi will give the opportunity to students to interact directly with French universities, learn more about the 1700 programmes taught in English at the Bachelor and Master levels, and get details about the 183 scholarship programmes available for Pakistani students. This year, four French business schools are part of the delegation.\nAccording to the latest Financial Times world rankings, French business schools are still topping the ranking. The four best Master in Finance pre-experience 2023 are French; among the five best Masters in Management 2023, three are French, including the one ranked #1.\nFor MBA and Executive Education, a French institution is ranked in the top position: INSEAD, an institution with a large alumni network in Pakistan. During this “Choose France Pakistan – Education Tour”, French delegates will also visit Pakistani universities to discuss partnership opportunities to strengthen the academic cooperation between France and Pakistan in the areas of business & management, sciences & engineering and social & political sciences. Did you know? Campus France is a French public organisation under the umbrella of the French Ministry of Higher Education and Research and the French Ministry for Europe and Foreign Affairs, which provides official and free counselling and support to international students who are looking forward to pursuing higher studies in France.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:01:45.918Z"
}
