{
  "title": "Pak-Uzbek trade volume reaches over $250m: Envoy",
  "link": "https://www.app.com.pk/national/pak-uzbek-trade-volume-reaches-over-250m-envoy/",
  "date_published": "2023-04-09T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 9 (APP): Ambassador of Uzbekistan to Pakistan, Oybek Arif Usmanov has said that bilateral trade volume between Pakistan and Uzbekistan had reached over $250 million by the end of 2022 and both countries were focusing on exploring more avenues of trade and investments in multiple sectors to enhance trade.\nHe said that the implementation of the Preferential Trade Agreement (PTA) between Pakistan and Uzbekistan and the recently signed nine Memorandum of Understanding (MoUs), would further increase trade volume to $1 billion between both countries.\nThe Ambassador made these remarks while talking to APP during an Iftar dinner hosted by the Embassy of Uzbekistan for journalists and experts.\nManaging Director of Associated Press of Pakistan (APP), Muhammad Asim Khichi was the chief guest of the event.The Ambassador welcomed all the guests and said that the Pak-Uzbekistan friendship had reached new heights.\nBoth the countries have very cordial relations and their leadership is playing role in deepening bilateral ties and cooperation.\nExplaining the trade turnover between Uzbekistan and Pakistan, the Ambassador said that the trade volume in 2014 was amounted to $36 million, in 2018 it became $ 98 million, in 2020 amounted around $120 million and in 2021 it reached $180 million and now in 2022, it reached to $250 million, he added. He said that these figures show that Uzbek-Pak trade volume is increasing rapidly.\nNow, Uzbekistan is a largest trade partner of Pakistan in Central Asia and Pakistan has been listed among the top 10 main foreign trade partners for Uzbekistan, he added.\nThe envoy further stated that the Pakistani importers were interested in Uzbek textile, petrochemical products, foodstuff, pure Uzbek silk products and agricultural machinery. “The Uzbek importers are receiving Pakistani textile and leather garments, pharmaceutical products, chemicals, food items and agricultural products”.\nThe Government of Uzbekistan, he told has created a favorable and attractive investment environment for the Pakistani business community and around 207 joint venture companies are successfully operating in Uzbekistan.\nMoreover, the two sides have started to work out the joint manufacturing for agricultural machinery and home appliances products with Uzbek investments in Pakistan.\nThe implementation of these projects in Pakistan can help the mechanization and modernization of the agricultural sector and decrease the prices for electronic products within the country, he concluded.",
  "retrievedAt": "2025-08-11T08:15:47.281Z"
}
