{
  "title": "NA all set to celebrate golden jubilee of 1973 Constitution",
  "link": "https://www.app.com.pk/national/na-all-set-to-celebrate-golden-jubilee-of-constitution-1973/",
  "date_published": "2023-04-09T07:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 09 (APP): The National Assembly (NA) under the leadership of Speaker Raja Pervez Ashraf, is all set to celebrate the 50th anniversary of the Constitution of Pakistan 1973, a landmark document that laid the foundation of a democratic and progressive society in the country.\nThe month-long celebrations will commence on April 10, with a series of events to commemorate the founding principles of federal parliamentary democracy, social justice, and equality, as enshrined in the Constitution, 1973.\nThese activities have been meticulously chalked out by a Parliamentary Advisory Committee, constituted by the Speaker, drawing Members from both Houses of Parliament and headed by seasoned parliamentarian Senator Main Raza Rabbani.\nThe Speaker will inaugurate the celebrations by laying the foundation stone of the Constitution Monument at the site approved by the Advisory Committee, opposite Parliamentary Lodges, D-Chowk, Islamabad. The monument will serve as a permanent reminder of the importance of the Constitution in the nation’s history.\nThis will be followed by a wreath-laying ceremony at the Memorial of the Unsung Heroes of Democracy in the Parliament House, paying homage to those who fought for democracy and constitutionalism in Pakistan.\nThe Speaker will also inaugurate an exhibition showcasing rare pictures of the Constitution’s framers, inspect a commemorative stamp, and then head to the second floor of the Parliament to inspect the original Constitution and other manuscripts.\nThe celebrations will culminate in the National Assembly Session (National Constitution Convention) in the main assembly hall, attended by parliamentarians and people from all walks of life.\nThe Convention will be chaired by the Speaker. Prime Minister Muhammad Shehbaz Sharif, Chairman Advisory Committee Senator Mian Raza Rabbani and other attendees will pay tribute to the framers of the Constitution and reflect on how it has served as a cornerstone of democracy, justice, and equality in Pakistan.\nThe session will also pass a number of resolutions related to the Constitution’s recognition as a binding document, its incorporation into the national curriculum, homage to the Constitution’s framers, and declaring the State Bank building (old National Assembly Hall) as a National Monument.\nThe celebrations will be followed by a joint session of the Parliament, scheduled for 2 pm, which will continue the discussions and reflections on the importance of the Constitution in shaping the destiny of Pakistan.\nThe golden jubilee celebrations of the Constitution 1973 promises to be a landmark event in Pakistan’s history, celebrating the ideals and principles that define the country’s democratic and progressive identity.\nThe month-long activities include speech contests in educational institutions, quiz competition, exhibitions, special programmes by electronic media, newspaper supplements and an international constitution convention on May 10.",
  "retrievedAt": "2025-08-11T08:15:51.639Z"
}
