{
  "title": "Golden jubilee celebrations of 1973 Constitution to start tomorrow",
  "link": "https://www.app.com.pk/national/golden-jubilee-celebrations-of-1973-constitution-to-start-tomorrow/",
  "date_published": "2023-04-09T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 09 (APP):The comprehensive one-month-long celebrations in connection with the Golden Jubilee of the 1973 Constitution will formally start on April 10, 2023 (Monday).\nA committee comprising Senators and Members of the National Assembly (MNAs) under the chairmanship of Senator Mian Raza Rabbani has prepared an elaborate program following which one-month celebrations are being organized throughout the country in this connection.\nSpeaker National Assembly Raja Pervaiz Ashraf will lay the foundation stone of the Constitution of Pakistan 1973 Memorial on the commencement of the Golden Jubilee celebrations at D-Chowk in front of the Parliament House and Parliament Lodges.\nSpeaker National Assembly along with the Members of Parliament will visit the memorial of Martyrs of Democracy in the garden of the Parliament House.\nLater, Speaker Raja Pervez Ashraf and Members of Parliament will visit an exhibition to see photos taken at the time of approval of the 1973 Constitution in the National Assembly. They will review the draft Constitution of Pakistan in detail in front of the National Assembly Hall.\nA national constitutional convention has also been organized in the National Assembly. Different segments of society including constitutional heads of the provinces, vice chancellors of universities, women, social and political workers and students have been invited to attend the convention.\nMNAs, especially the ministers and opposition members have also been invited to ensure their presence at the event.\nSpeaker National Assembly Raja Pervaiz Ashraf said we have to give a message to the youth on this day that while rising above our differences, we have the capabilities to celebrate our successes and national festivals in a befitting manner.",
  "retrievedAt": "2025-08-11T08:15:37.779Z"
}
