{
  "title": "British-Pakistani, Enaam sets 3rd fastest time at Indianapolis",
  "link": "https://www.app.com.pk/national/british-pakistani-enaam-sets-3rd-fastest-time-at-indianapolis/",
  "date_published": "2023-04-09T11:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 9 (APP): Enaam Ahmed, a British-Pakistani Formula racer, set the third-fastest time during the morning session on the 2.4-mile road course at the prestigious Indianapolis Motor Speedway.\nThe road course comprises 14 corners and is renowned for hosting some of the world’s most talented racing drivers.\nOnly the elite racers are hired by brands and groups to drive cars on these unusual tracks, says a message received here on Sunday. The test took place in preparation for Round 2 of the Firestone Indy NXT Championship.\nThe day started on a chilling morning which led to an hour delay and cancellation of lunch break. As soon as action started 20 drivers got down to business.\nEnaam was racing against several experienced drivers in the series which made his third fastest time of 1:14.86 even more impressive. The fastest time of 1:14.62 was set by Hunter McElrea of New Zealand.\nEnaam Ahmed told this reporter that he is racing with support from US-based Pakistani professionals who are keen to see him compete in the Greatest Spectacle in Racing, Indianapolis 500 in 2024.\nEnaam Ahmed His next race is on April 30th at Barber Motorsports Park in Birmingham, Alabama. Enaam Ahmed is the first ever and the only Pakistani to be a World Champion in Karting, beating the records of Formula One drivers Lewis Hamilton and Max Verstappen.\nNot only that, Enaam Ahmed is also the British Formula 3 Champion, the first ever high-level Formula Championship winner in the history of Pakistan and beating the record of Ayrton Senna by winning 13 races in one season.\nThe 23-year-old is going places around the world with his winning streaks on the dangerous tracks, driving cars at an average 200 miles per hour – making sure that his car carries both British and Pakistani flags.\nEnaam is one of the brightest and most exciting young racing talents in motorsport. He has been winning Championships and breaking records from the age of 14. Enaam Ahmed is also the most successful Pakistani heritage racing driver ever in the history of motorsport because he is also known as the most successful British Formula 3 driver in history.Enaam Ahmed was born to Pakistani parents in London 23 years ago.\nIt was at the age of eight that he started taking interest in racing. His parents started funding their son’s passion by sending him to local Go-karting tracks for children but they had no idea that their son would become a European and world champion at the age of 14, winning it one year younger than Lewis Hamilton who was 15 when he became the world champion.",
  "retrievedAt": "2025-08-11T08:15:47.564Z"
}
