{
  "title": "MNAs give mixed response on federal budget",
  "link": "https://www.app.com.pk/national/mnas-give-mixed-response-on-federal-budget/",
  "date_published": "2021-06-19T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP): Parliamentarians from both opposition and treasury benches in the National Assembly on Saturday continued debate on the federal budget for fiscal year 2021-22.\nThe treasury benches lauded the government for presenting people-friendly budget with no new tax while the opposition members criticized that no relief was given to the masses in the budget.\nResuming budget debate, Abdul Qadir Patel of Pakistan Peoples Party Parliamentarian (PPPP) said the government set unrealistic revenue collection target which could not be achieved.\nHe claimed that the government could not achieve any single target set for the current fiscal year.\nHe alleged that excessive borrowing was done with no visible development programme.\nAbdul Qadir said prices of essential items witnessed 30 per cent increase during the last three years while the people’s income remained same.\nHe said Benazir Income Support Programme was set up through act of parliament and it could not be packed up without the parliament nod.\nNiaz Ahmed Jakhar of Pakistan Tehreek e Insaf (PTI) while taking part in the budget debate, said criticism should not be for sake of criticism rather it should be constructive.\nContrary to the opposition claims, he said no new tax was imposed in the budget and very soon people would see its fruits.\nHe said the government has presented welfare oriented budget despite challenge of COVID-19.\nHe said the PTI led government has put the country on road of progress and prosperity. All the socio indicators also reflected that the country was making progress, he added.\nHe said interest free loans were announced for the business and farmers in the budget. People could get upto Rs 0.5 million interest free loan for business and Rs 2,50,000 for agriculture, he added.\nHe said PTI government introduced health cards for the all people irrespective of caste, creed and affiliation.\nHe also expressed the hope that dream of South Punjab province would materialized as separate secretariat has already been inaugurated.\nTaking part in the debate, Khurram Dastagir of Pakistan Muslim League (PML-N) said fudge figures were given in the budget. He said unrealistic revenue collection target was fixed for the next year which could not be achieved.\nHe said political leaders including Khawaja Muhammad Asif, Syed Khursheed Shah and Ali Wazir were in jails but their production orders were not issued.\nHe urged the chair to issue production orders of detained members so they could represent their constituencies.He said despite bumper crops, prices of flour and sugar remained high.\nHe went on to say that the power theft has increased while recoveries have decreased due to in-efficiency of the government.\nShehryar Afridi of PTI said the whole world appreciated the steps taken by Pakistan during COVID-19. He said the government under the leadership of Prime Minister laid the foundation of Welfare state on the pattern of Riyasat e Madina.\nHe said keeping in view, the Ehsaas programme of the government, even UNHCR-UN Refugee Agency gave financial package to the Afghan refugees.\nThe PM has successfully raised Palestine, Kashmir and Islamophobia issues at all international fora, he added.\nComing hard on the past PML-N government, he said that the then interior Minister Nisar Ali Khan had conceded presence of black water in the capital.\nThe PML-N government not only provide bases to USA for carrying out drone attacks but also received hefty funds under head of collateral damage, he added.\nHe said thousands Computerized National Identity Cards of Pashtoons were blocked during the PML-N regime.\nHe said the government allocated huge amount of Rs 260 billion for the uplift and welfare of the poor segment of the society in the budget.\nHe said the government inherited huge current account deficit of US $ 19.8 billion which now was in surplus.\nThe country’s exports witnessed unprecedented surged and stood at US $ over 25 billion owing to the prudent policies of the government, he added.\nShehryar said those industrialists who had left the country during PML-N regime were now coming back and again set up their industries in Pakistan.\nThe per capita income has jumped to US $ 1500 from US $ 1300, he said.\nHe said global perception about Pakistan has totally been changed and now Pakistan was leading owing to the policies introduced by the government.\nRegarding National Accountability Bureau cases, Afridi said these cases were registered by PML-N and PPPP against the leaderships of each other.\nHe urged the fugitive leaders to come back to the country and face their cases in courts of law.\nHe also urged the opposition to come to parliament and support the government into bringing reforms in criminal and judicial system.",
  "retrievedAt": "2025-08-11T20:51:56.378Z"
}
