{
  "title": "Govt working for development of GB on PM’s instructions: Asad Umar",
  "link": "https://www.app.com.pk/national/govt-working-for-development-of-gb-on-pms-instructions-asad-umar/",
  "date_published": "2021-06-19T12:40:00.000Z",
  "source": "APP",
  "content": "GILGIT, Jun 19 (APP): Federal Minister for Planning and Development Asad Umar has said that in the light of Prime Minister Imran Khan’s instructions, we were working for the development of Gilgit-Baltistan on priority bases.\nHe explained that the development package included in PSDP envisaged hydel power generation and transmission projects, connectivity projects for tourism, youth skill and scholarship programme, upgrading of health system and water and sanitation projects.\nWhile addressing a press conference here in Gilgit on Saturday, he said that the message of the Prime Minister Imran Khan to the people of Gilgit-Baltistan was that if Gilgit-Baltistan develops in the true sense, then the whole of Pakistan would be prosperous.\nAsad Umar said that under the integrated development plan for Gilgit Baltistan, 19 mega projects had been included in the Federal PSDP, out of which 11 projects were approved so far by ECNEC and CDWP for which Rs 56 billion was allocated this year, adding that 135 billion would be spent till completion. The rest of the projects would also be approved soon.\nHe said that 50 billion would be spent on Gilgit-Chitral Expressway under China-Pak Economic Corridor (CPEC). He said that with the completion of these projects, Gilgit-Baltistan would develop in real sense and prosperity would come here.\nHe said that apart from the federal PSDP, the federal government would also take steps to take Gilgit-Baltistan out of backwardness.\n“The projects in various sectors will not only herald a new chapter of development and progress in Gilgit Baltistan but will also help address the problems of the area and create numerous employment opportunities, said Asad Umar.\nFor the upgradation and betterment of Internet service in Gilgit Baltistan, the Federal Minister said that spectrum auction would be held in the next 2-3 months.\nHe said that incubation centers were being set up at a cost of Rs 500 million to enhance the business skills of the youth of Gilgit-Baltistan.\nResponding to a question on making Gilgit-Baltistan an interim constitutional province, the Federal Minister said that the entire national leadership was agreed that Gilgit-Baltistan should have constitutional rights.\nHe said that there was no backdoor diplomacy from India in this matter, adding that soon Gilgit-Baltistan will be included in the constitutional mainstream.\nHe appealed to the people to get vaccinated against corona virus as soon as possible, adding that for this purpose, mass vaccination centers are being set up at 6 places in Gilgit-Baltistan.\nThe Minister added that the federal government was providing 30 mobile units to Gilgit-Baltistan which would be used for vaccines in remote areas.",
  "retrievedAt": "2025-08-11T20:51:56.664Z"
}
