{
  "title": "Dr. Moeed to attend SCO meeting in Dushanbe; no interaction planned with Indian counterpart",
  "link": "https://www.app.com.pk/national/dr-moeed-to-attend-sco-meeting-in-dushanbe-no-interaction-planned-with-indian-counterpart/",
  "date_published": "2021-06-19T13:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP): National Security Advisor, Dr. Moeed W. Yusuf is leaving for Dushanbe on Sunday to participate in the 16th meeting of the Secretaries of the Security Council of the Shanghai Cooperation Organization (SCO) member states being held on 22-23 June 2021.\nDuring the visit, the National Security Advisor (NSA) will participate in the joint session of the National Security Advisors of the member states and also sign the Protocol of the Sixteenth Meeting of the Security Council Secretaries, official source in the National Security Division told APP on Saturday.\nLast year, the meeting was held virtually in which India had walked out on Dr. Yusuf’s refusal to remove Pakistan’s political map from his background.\nDuring the visit, Dr. Yusuf may also meet with his counterparts from Russian Federation, Tajikistan, Uzbekistan, Kyrgyzstan, Kazakhstan and China to discuss matters of mutual interest.\nThe office of the NSA has confirmed that Dr. Yusuf will not be meeting his Indian counterpart who will also be attending the SCO summit.\nIt may be remembered that Prime Minister Imran Khan has already reiterated the Pakistan’s stance that there will be no dialogue with India till it revisits its illegal and unilateral action of August 5.\nThere is speculation that the Afghan NSA, Hamdullah Mohib will also be in Dushanbe. Afghanistan is an Observer of the SCO but is not invited to the meeting.\n“Mohib has recently made multiple baseless accusations against Pakistan. Pakistan has responded formally, accusing him of undermining the progress towards peace in Afghanistan. Pakistan has reportedly stopped engaging with him,” an official said.\nIt is therefore not surprising that no meeting is expected between the NSAs of Pakistani and Afghan in Dushanbe either.\nThe upcoming SCO meeting is of special importance as Prime Minister Imran Khan is expected to visit Dushanbe for the SCO Heads of State Council meeting later this year.\nPresident of Tajikistan Emomali Rahmon already visited Pakistan on 2-3 June 2021 and met with President Dr Arif Alvi and Prime Minister Imran Khan.\nIt may be mentioned here that established on 15 June 2001, this year was also the 20th anniversary of the establishment of the SCO.\nChina, Kazakhstan, Kyrgyz Republic, the republic of Tajikistan and the Republic of Uzbekistan are the founding members of the Organization. Pakistan joined SCO in 2017.",
  "retrievedAt": "2025-08-11T20:51:50.936Z"
}
