{
  "title": "FM Qureshi calls for renewed focus on geo-economics",
  "link": "https://www.app.com.pk/national/fm-qureshi-calls-for-renewed-focus-on-geo-economics/",
  "date_published": "2021-06-19T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 19 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Saturday called for a renewed focus on geo-economics by the Asian countries and stressed upon the need for promotion of a rules-based global order.\nThe foreign minister was participating in a high-level panel discussion on ‘Regional Cooperation in Asia’ along with the foreign ministers of Kyrgyzstan, Malaysia, Tajikistan and Uzbekistan in Antalya Diplomacy Forum, in Turkey.\nForeign minister Qureshi also highlighted the challenges being faced by Asia in form of unresolved disputes, tensions induced from within and without, renewed arms race, containment policies, unilateralism, poverty, COVID-19 and climate change.\nForeign minister Qureshi, is on an official visit to Turkey to participate in the Antalya Diplomacy Forum, where several global political leaders, and diplomats have gathered for discussions on important thematic global issues. The theme of the Forum is ‘Innovative Diplomacy: New Era, New Approaches’.\nAs an economic hub, Asia’s global role is undeniable. It is therefore imp to continue having such exchanges where the need to strengthen regional cooperation is centre stage. In such an interconnected world, expanding the scope of regional relations for economic growth is pivotal https://t.co/cifhrM6WOu\n— Shah Mahmood Qureshi (@SMQureshiPTI) June 19, 2021\nHighlighting the potential of Asia in the 21st Century, foreign minister Qureshi drew attention to the possibilities of cooperation that existed on the continent.\nHe emphasized that connectivity and greater regional integration in form of trade and investment would pave the way for a successful Asian century.\nIn this context, he noted that China Pakistan Economic Corridor (CPEC), as a flagship project of Belt and Road Initiative, offered great opportunities for the countries of the region.\nForeign minister Qureshi also underlined three pillars of Pakistan’s policy of regional connectivity, development partnerships, and peace and prosperity.\nIn his remarks, he also laid out five steps to promote greater regional cooperation in Asia including focus on sustainable development, poverty alleviation, engagement with the international community and international financial institutions for debt relief for the developing countries in Asia in order to provide them with fiscal space to deal with the challenges, arresting illicit financial flows out of Asia gained from proceeds of crime and corruption and tackling climate change.\nDuring the discussion, the foreign ministers on the panel called for increased multilateralism to deal with the challenges faced by Asia and agreed on the need for a renewed focus on transit and connectivity projects in the region.",
  "retrievedAt": "2025-08-11T20:51:58.208Z"
}
