{
  "title": "FM underlines significance of all inclusive intra-Afghan dialogue",
  "link": "https://www.app.com.pk/national/fm-underlines-significance-of-all-inclusive-intra-afghan-dialogue/",
  "date_published": "2021-06-19T16:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):Foreign Minister Shah Mahmood Qureshi while reiterating Pakistan’s abiding interest in a peaceful, secure and stable Afghanistan said that the only way forward towards peace in Afghanistan was through reconciliation, coexistence and talks among Afghans.\nTalking to TOLO news, an Afghanistan based Tv channel, he stressed upon future arrangements in the country that were acceptable to all Afghans and observed that there was a need for flexibility from Afghan leaders to move the peace process forward.\n“We want Afghanistan to be peaceful and stable because we feel that a peaceful Afghanistan, a stable Afghanistan, gives us the regional connectivity that is required,” the Tv channel on Saturday quoted the foreign minister as saying.\nHe said for economic security, investments and promotion of bilateral trade and regional trade, peace and stability in Afghanistan was must as it was not only a requirement of Afghanistan but also Pakistan’s desire as well.\n“You know, we benefit from it,” he added.\nQureshi further said that the world’s approach had changed that peace could not be achieved in Afghanistan through a military solution.\n“We have been advocating for years that there is no military solution to the Afghan conflict. What has changed is this new approach that what is required is a negotiated political settlement that we were advocating,” he added\nHe said peace could only come to Afghanistan if all Afghans sit and reconcile, adding Pakistan suggested an inclusive system that would be helpful in reconciliation and promoting the peace process.\n“We’re willing to help in pushing forward the peace process, and as you know we’ve facilitated the peace process and there is acknowledgment of that. We’re willing to help in Afghanistan’s reconstruction, rehabilitation. We’re willing to partner with Afghanistan. Yes, we will be partners for peace,” he said.\nForeign minister Qureshi further hoped that Afghanistan would not be plunged into another civil war.\nAbout Pak-Afghan ties, he reiterated that Pakistan wanted a sovereign, democratic and peaceful Afghanistan. To a query, he said it was time to move ahead instead stuck in the past.\nHe said Pakistan was not responsible for the squabbling that was going on in Afghanistan.\nThe foreign minister also categorically rejected Taliban sanctuaries in Pakistan and said that their leadership was in Afghanistan.\nTo a question, Qureshi said that India used its presence in Afghanistan to conduct subversive activities inside Pakistan, adding it bothered Pakistan if Afghan soil was used against it by India.\nThe foreign minister further regretted that under Prime Minister Imran Khan, their peaceful gestures were not reciprocated by New Delhi.\nInstead, they took steps and measures that vitiated the atmosphere, Qureshi said while referring to India’s illegal and unilateral actions on Indian Illegally Occupied Jammu and Kashmir. “The situation there is very delicate and simmering,” he observed.\nAbout vision for Pakistan, the foreign minister said it was deeply rooted in the vision and values advocated by the founding father Quaid e Azam Muhammad Ali Jinnah.\nHis party also strongly believed in these values which are Islamic, democratic and welfare state.\nThe minister also emphatically rejected reports about Pakistan’s willingness to allow US bases to operate on its soil after American forces leave Afghanistan.",
  "retrievedAt": "2025-08-11T20:51:59.156Z"
}
