{
  "title": "Panahgah’ management strives for sustainability of pro-poor project",
  "link": "https://www.app.com.pk/national/panahgah-management-strives-for-sustainability-of-pro-poor-project/",
  "date_published": "2021-06-19T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP): Prime Minister’s Focal Person on Shelter Homes Naseem ur Rehman said on Saturday that efforts were underway to make the ‘Panahgah’ model sustainable by mobilizing multiple stakeholders including philanthropists, businessmen, students, civil society and others.\nNaseem ur Rehman told this to APP after an interactive session with a meticulously selected group of students and teachers of Grammar School Rawalpindi here at one of the Islamabad-based Panahgah near Peshawar Morr, Sector G-9.\nHe said the interactive session was part of the pilot project launched by the ‘Panahgah’ management to boost sustainable efforts with mobilization of different stakeholders including civil society, students of universities, colleges and schools, and people from other walks of life.\nThe focal person said the initiative was aimed at social development of the people so that the society could evolve as a whole with socio-economic uplift of the poor segments of the country, especially daily wage earners who were being provided shelter in the government owned facilities (Panahgah) across the country.\nHe said the students, during the session, evinced keen interest in the safety, security and sustainability aspects of ‘Panahgahs’ and pledged support for the public service initiative, dedicated to serve the poor daily wage earners.\nNaseem said he had urged the students to actively participate in the community service which would eventually groom them for a responsible and fulfilling role.\nHe said the session was followed by a question-answer session which was meant to help them understand effective functioning of ‘Panahgahs’ in the areas of security, safety and sustainability.\nAt the end of session, he said students mingled with the Panahgah’s workers and beneficiaries to get a first-hand feel of the quality of food and basic services that was now reaching hundreds of needy workers.\nNaseem said the network of Panahgahs had been expanded across the country as more than 100 shelter homes were providing quality services to the daily wage earners on the regular basis.\n“The ‘Panahgah’ management is striving to improve the basic services beyond bed and breakfast to include water, sanitation and hygiene for promoting healthy lives,” he added.",
  "retrievedAt": "2025-08-11T20:51:54.664Z"
}
