{
  "article_id": "2025-07-17_27f38c80fc0bfca7710ef85e39d51d19",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-ndma-ministers-for-climate-planning-to-prepare-comprehensive-disaster-management-plans/",
    "retrieved_at": "2025-08-27T09:45:31.574Z"
  },
  "metadata": {
    "title": "PM directs NDMA, Ministers for Climate & Planning to prepare comprehensive disaster management plans",
    "author": null,
    "date_published": "2025-07-17T16:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 621,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 17 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday directed the National Disaster Management Authority (NDMA) chair and federal ministers for climate change and planning to join heads with the provinces for developing a comprehensive disaster management plan based on the lessons learnt from this year's devastating rains and cloudburst events. The prime minister visited the National Emergencies Operation Centre (NEOC) at the National Disaster Management Authority (NDMA) headquarters, where he was briefed on the country's monsoon situation, disaster response efforts, and the increasing intensity of weather patterns. Prime Minister Shehbaz Sharif commended NDMA's efforts and lauded the role of modern technology and skilled human resources at the Authority. He said, \"NDMA always provides an encouraging environment, and it is because of its modern infrastructure and highly capable team. This is my second visit here, and I am pleased to see the dedication.\" The prime minister highlighted recent cloudbursts and heavy downpours in Chakwal, Lahore, Islamabad, and hilly areas, acknowledging the severity of weather conditions. He remarked that while southern parts of the country saw less rainfall impact, the northern and central regions continue to face significant risk. PM Shehbaz appreciated the provincial governments for their response, especially Punjab under Chief Minister Maryam Nawaz, for their effective disaster handling and coordination with NDMA and PDMAs, resulting in comparatively fewer losses. He also prayed for those who lost their lives and wished a swift recovery for the injured, while stressing the need for proactive preparations. \"As projections show increased cloudburst activity, we must prepare accordingly. The federal government and NDMA must maintain close coordination with provinces,\" PM Shehbaz said. The prime minister pledged full support from the PM Office in procuring necessary disaster response equipment and emphasized the importance of federal-provincial cooperation in strengthening human resources, capacity building, and equipment for rescue and relief operations. \"Pakistan contributes minimally to global greenhouse gas emissions but ranks among the top ten most climate-vulnerable countries. This is a challenge, but also an opportunity to build a climate-resilient nation, especially in agriculture and infrastructure.\" The Prime Minister also thanked the Information Minister for public awareness efforts and directed that such initiatives be scaled up nationwide. With an urgent call for unified national response and long-term climate adaptation, PM Shehbaz Sharif concluded his visit by reiterating the federal government's commitment to protecting lives, property, and infrastructure in the face of intensifying climate challenges. During the briefing, Chairman NDMA Lieutenant General Inam Haider Malik informed the Prime Minister that this year's monsoon intensity is 60-70 per cent higher than last year, and averaging 65 per cent more than anticipated across the region. Traditionally limited to eight to nine spells, the current monsoon season has already seen two to three additional spells, he added. So far, he said 178 lives have been lost and around 500 people injured due to rain-related incidents. While last year's projections had indicated rising impacts in northern Punjab, Azad Jammu and Kashmir (AJK), Islamabad, and upper Khyber Pakhtunkhwa (KP), this year the brunt has shifted towards lower and upper Punjab, Islamabad, and AJK, with the trend expected to persist for the next 3 to 4 weeks. General Inam further noted that four to five more monsoon spells are expected, with the current third spell, beginning on June 26, coming to a close. The NDMA has maintained active coordination with provincial departments and Chief Secretaries to implement early warning systems and mitigation measures, he added. According to the NDMA, future monsoon seasons will likely begin two weeks earlier, and with increased severity. The coming seven days will remain critical for Punjab, AJK, and northern KP. Federal Ministers Dr Musadik Masood Malik, Prof Dr Ahsan Iqbal and Attaullah Tarar were also present on the occasion.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}