{
  "article_id": "2025-07-17_f7c396389f0b18139abbaf73293fac5b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/jf-17-thunder-c-130-aircrafts-land-at-uk-to-participate-in-royal-intl-air-tattoo-2025/",
    "retrieved_at": "2025-08-27T09:49:04.858Z"
  },
  "metadata": {
    "title": "JF-17 Thunder, C-130 aircrafts land at UK to participate in Royal Int’l Air Tattoo 2025",
    "author": null,
    "date_published": "2025-07-17T06:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 256,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jul 17 (APP): Contingent of the Pakistan Air Force comprising state-of-the-art JF-17 Thunder Block-III fighter aircraft and the C-130 Hercules transport aircraft has landed at the Royal Air Force Base Fairford, United Kingdom, to participate in the prestigious Royal International Air Tattoo - 2025 (RIAT). PAF's participation in RIAT, one of the world's largest military airshows, underscores Pakistan Air Force's commitment to showcasing its professional excellence, operational capability and the indigenous strength of its aviation industry, said a news release issued by Inter Services Public Relations (ISPR). Adding to the operational significance of this international deployment, Pakistan Air Force's JF-17 Thunder Block-III fighters executed successful Air-to-Air Refuelling operations enroute to United Kingdom with the support of a PAF IL-78 aerial refuelling tanker. The intricate refuelling operation demonstrated PAF's long-range operational capabilities and the proficiency of its air and ground crew in conducting extended operations beyond national borders. JF-17 Block-III is an EASA Radar and Long Range BVR equipped 4.5 generation multi-role fighter aircraft which is capable of undertaking wide variety of combat missions bolstering airpower application in the face of contemporary challenges thereby strengthening national security. There is a palpable sense of enthusiasm across the United Kingdom following the recent Pakistan India conflict, as aviation enthusiasts and defence observers were eagerly looking forward to the arrival of the Pakistan Air Force's JF-17 Thunder Block-III. The aircraft's combat-proven capabilities and operational excellence have garnered significant global attention, making its appearance at RIAT a highly anticipated highlight in the aerospace and defence community, the press release said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}