{
  "article_id": "2025-07-17_52025f6e6c82be353c369cdf55befcd9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/experts-for-strengthening-pak-oceania-ties-through-climate-action-people-to-people-diplomacy/",
    "retrieved_at": "2025-08-27T09:48:06.656Z"
  },
  "metadata": {
    "title": "Experts for strengthening Pak-Oceania ties through climate action, people-to-people diplomacy",
    "author": null,
    "date_published": "2025-07-17T12:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 429,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 17 (APP)::Experts, Diplomats and Academics from Pakistan and Oceania came together on Thursday to stress the importance of strengthening the people to people diplomacy, climate cooperation, and cultural ties between the two regions. The Event, titled: \"Bridging gaps between Pakistan and Oceania\" was organized by the Consortium of Asia-Pacific Studies (CAPS) and brought together a diverse panel of voices from Pakistan, Australia, Fiji and Papua New Guinea. In his opening remarks, Dr. Khuram Iqbal the President of CAPS emphasized the need for strengthening institutional partnership between the two regions, particularly in areas such as climate change and mitigation, sustainable development like Eco-tourism and people to people diplomacy. The Pro-Vice-Chancellor of Fiji National University, Dr. Isimeli Tagicakiverata, called for deepening maritime cooperation between Pakistan and Oceania. \"Our coastal and island communities face similar vulnerabilities in the face of rising sea levels, ocean degradation, and extreme weather events,\" he said. \"There is immense potential for joint research, blue economy initiatives, and student mobility across maritime regions.\" Speaking on the diplomatic dimension, the Former Ambassador of Pakistan to Australia Naela Chohan highlighted the importance of strengthening Pakistan's outreach to Pacific island nations. \"These countries are not just small island states-they are critical voices in the global climate conversation,\" She remarked. \"Pakistan must engage more consistently with Oceania through climate diplomacy, development cooperation, and multilateral platforms.\" Delivering a keynote address, the Secretary General of CAPS, Mr. Sardar Baksh, a noted expert on climate change, highlighted the deepening environmental challenges faced by both Pakistan and Oceania. \"From rising sea levels and erratic weather patterns to water scarcity and displacement, climate change is a shared crisis that demands a shared response,\" he said. Mr. Baksh called for enhanced joint cooperation between Pakistan and Pacific Island nations, particularly in the areas of climate adaptation, early warning systems, and sustainable development. \"We must move from dialogue to action, building regional alliances grounded in science, solidarity, and sustainability,\" he added. Adding a youth perspective, students from the Institute of Business, University of Papua New Guinea, shared their views on entrepreneurship, green innovation, and cultural dialogue with Pakistani counterparts. \"As students, we see ourselves as part of the climate solution,\" Junior Yama said. \"It is time for our generation to lead with ideas, activism, and cross-cultural friendships.\" The conference concluded with a joint call for the institutionalization of dialogue between Pakistan and Oceania through joint research projects, academic partnerships, regional climate forums, and enhanced diplomatic presence. Speakers unanimously agreed that climate change presents a common challenge that transcends geography, and can only be tackled through collective commitment.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}