{
  "article_id": "2025-07-17_ce072a9075f6af4a8f5528809fadfbb8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-urges-provincials-govt-to-establish-uniform-legal-marriage-age-of-18/",
    "retrieved_at": "2025-08-27T09:44:52.683Z"
  },
  "metadata": {
    "title": "NA body urges provincials govt to establish uniform legal marriage age of 18",
    "author": null,
    "date_published": "2025-07-17T18:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 366,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 17 (APP):The committee on Gender Mainstream urged the provincial governments to establish a uniform legal marriage age of 18 years for both men and women, helping reduce health risks associated with early marriage, promote-gender equality, and enhance educational and economic opportunities for young women. The committee held on Thursday in Committee Room of Ministry of Human Rights, which was chaired by Dr Nafisa Shah commended the passing of Child Marriage Restraint Act 2025 referring to it as a milestone. Reporting on progress in the provinces the Secretary Human Rights reported that Punjab has constituted a committee to review the Child Marriage Restraint Bill, the Government of Balochistan reported that the Bill has been approved by the Cabinet and is currently pending, while the Government of Khyber Pakhtunkhwa stated that the bill has been forwarded to the Council of Islamic Ideology for comments and all provincial governments have been urged to expedite the legislative process. The Special Committee also expressed concern on Pakistans ranking on the Global Gender Gap Index at 148 and called upon the government to notify a cabinet committee on gender mainstreaming that would take practical steps towards Gender Parity. The Committee urged that Pakistan's low ranking in the gender parity index can be attributed to its weak performance in economic participation and opportunities for women, as well as the persistent under representation of women in politics and decision-making roles, both of which significantly hinder progress toward achieving gender equality. The Acting Chairperson of the National Commission on the Status of Women (NCSW) informed the Committee that the NCSW had conducted extensive consultations with parliamentarians, youth groups, civil society organizations, and legal experts regarding Child Marriage Restraint Act. She reiterated the Commission's support for setting 18 years as the minimum legal age for marriage. Further that the National Dialogue on Gender Gap has been conducted on 26th June, 2025 by NCSW and one of the key recommendations from the dialogue was the establishment of a National Task Force on Gender Data Synchronization. The meeting was attended by members of national assembly including Aqeel Malik, Shahida Rehmani, Khawaja Izhar Ul Hassan, Sher Ali Arbab, Senator Fawzia Arshad, and Officers of the concerned Ministries/Divisions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}