{
  "article_id": "2025-07-17_df9bfeb800c32403d7ddb34186ea8866",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rawalpindi-admn-launches-evacuations-from-low-lying-areas-amid-torrential-rain/",
    "retrieved_at": "2025-08-27T09:49:08.636Z"
  },
  "metadata": {
    "title": "Rawalpindi Admn launches evacuations from low lying areas amid torrential rain",
    "author": null,
    "date_published": "2025-07-17T06:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 308,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jul 17 (APP):: The Rawalpindi Administration on Thursday began evacuating people from low-lying areas that were flooded due to heavy rain, which had been pouring over the twin cities for more than 15 hours. The district administration sounded sirens to warn residents about the flooding caused by the heavy rain. The water level in Leh Nullah was rising and currently measured about 21 feet at Katarian and 20 feet at Gawalmandi. According to the Pakistan Meteorological Department, over 230 mm of rain had fallen in the twin cities, a spokesman for WASA Rawalpindi said. Because of the weather, the deputy commissioner declared a one-day holiday in Rawalpindi district and asked people to stay at home unless absolutely necessary. He urged citizens to cooperate with the teams from the Water and Sanitation Agency (WASA), Rawalpindi Waste Management Company, and the administration, and warned them to avoid going near water in low-lying areas. Rainwater had collected at many spots on Murree Road, especially at Committee Chowk underpass, Murree Chowk, Banni Chowk, Jamia Masjid Road, Iqbal Road, and other city roads, causing traffic disruptions. A WASA spokesman said their staff, along with heavy machinery, was working hard to drain water from roads and low-lying areas. All resources were being used for drainage, with operations personally supervised by WASA Managing Director Saleem Ashraf. The spokesman added that Punjab Minister for Housing Bilal Yasin and Secretary Housing Noorul Amin Mengal were in constant contact with the WASA managing director. According to the Pakistan Meteorological Department, rain measurements included 132 mm at Saidpur Village, 164 mm at Golra (near E-11), 185 mm at Bokra (CTTI I-12), 152 mm at PMD (H-8/2) in Islamabad, and 158 mm at Shamsabad (RAMC). In Rawalpindi, 235 mm was recorded at Katcheri (near Chaklala), 196 mm at Pirwidahi, 220 mm at Gawalmandi, and 200 mm at New Katarian.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}