{
  "article_id": "2025-07-17_fb09270998233c123353cb60fba0b8c4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rain-floods-disrupt-power-supply-across-iesco-region-restoration-work-underway/",
    "retrieved_at": "2025-08-27T09:45:41.432Z"
  },
  "metadata": {
    "title": "Rain, floods disrupt power supply across IESCO region; restoration work underway",
    "author": null,
    "date_published": "2025-07-17T16:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 248,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 17 (APP):Widespread rainfall and floodwaters on Thursday disrupted power supply and damaged the distribution system across the Islamabad Electric Supply Company (IESCO) region, with Rawalpindi City Circle, Chakwal Circle, Jhelum Circle, and adjoining areas among the hardest hit. According to IESCO spokesperson, the downpour and overflowing seasonal streams led to the collapse of 43 high-tension (HT) poles and 7 low-tension (LT) poles, causing complete power outages on several feeders including Shahpur Syedan, Basharat, Tharpal, Jhand Khan, Mort, Hasnot, New Sangoi, I-14/3, Officer Colony, and Ameer Hamza Colony. In addition, rainwater entered residential areas in various localities, prompting the company to temporarily suspend power supply in affected zones as a precautionary measure to ensure public safety in accordance with established safety protocols. The situation has also led to a rise in feeder and transformer faults, along with an increase in individual consumer complaints across the IESCO region. IESCO Chief Executive Muhammad Naeem Jan has placed all operational wings-including construction, GSO, and GSE formations-on high alert, instructing officers and technical staff to remain in the field for rapid response. A central control room in Islamabad is monitoring restoration efforts around the clock. Despite operational difficulties posed by wet terrain and standing water, field teams are actively engaged in efforts to install new poles, wires, and transformers in affected areas. The company reaffirmed its commitment to restore electricity at the earliest possible time while ensuring safety standards are maintained. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/07/WhatsApp-Video-2025-07-17-at-7.17.27-PM.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}