{
  "article_id": "2025-07-17_5d1cbccf8d296f8a55685678504bbb11",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/iiui-alkhidmat-razi-hospital-sign-mou-for-staff-healthcare/",
    "retrieved_at": "2025-08-27T09:48:47.428Z"
  },
  "metadata": {
    "title": "IIUI, Alkhidmat Razi Hospital sign MoU for staff healthcare",
    "author": null,
    "date_published": "2025-07-17T09:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 199,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 17 (APP):The International Islamic University Islamabad (IIUI) and Alkhidmat Razi Hospital Rawalpindi have signed a Memorandum of Understanding (MoU) to provide quality inpatient and emergency healthcare services to university employees, their dependents, and parents. Under the agreement, the hospital will offer services in general medicine, pediatrics, gynecology, surgical consultation, discounted lab tests, and 24/7 emergency care. The collaboration also includes health awareness and preventive campaigns benefiting the broader IIUI community, including students. Speaking on the occasion, IIUI Vice President (Administration & Finance) Prof Dr Abdul Rehman said the MoU is a major step toward staff welfare and institutional healthcare. \"Access to timely and quality healthcare is fundamental to employee well-being,\" he added. Director Administration Dr Inam-ul-Haq said the partnership also focuses on awareness, adding, \"We aim to reduce hesitation in seeking medical care through health education for all age groups.\" The MoU was signed by Zahid Ali, Chairman Alkhidmat Razi Hospital, and Dr. Inam-ul-Haq from IIUI. Those present included Dr Usman Zafar, Abdul Hameed, Atiq-ur-Rehman Chughtai, Sajjad Siddiqui, Dr Wakeel Hussain, Muhammad Bilal Awan, Dr Asma Mansoor, Hassan Shabbir, and Zara Shah. Special recognition was given to Muhammad Bilal Awan and Hassan Shabbir for facilitating the partnership./APP-rzr-mkz",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}