{
  "title": "PML-N believes in economic agenda: Ahsan Iqbal",
  "author": null,
  "content": "LAHORE, Jan 04 (APP):Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal has said that the PML-N government believes in economic agenda and did not want any sort of political disruption in the country.\nHe said this while addressing a degree show, Master of Visual Art, at National College of Arts here. He said that the government was taking all possible measures within the limit of Constitution and law to keep the things moving in the right direction.\nAhsan Iqbal said that the government was making sincere efforts, adding that reasonable dialogue from both sides always yields positive results.\nHe said that the country was facing new war of terrorism and added that in the apex committee’s meeting\nthe political, military leadership and chief ministers of all provinces expressed resolve that there would be zero tolerance against terrorism and terrorists.\nHe said that with the grace of Allah Almighty, terrorism would be eliminated from the country the same way it was rooted out in the past.\nTo a question he said that the government of Pakistan had always conveyed it to the government of Afghanistan through dialogue that it should stop Afghan land to be used for terrorism in Pakistan.\nHe said that the Pakistani people had made numerous sacrifices for the people of Afghanistan and were facing consequences till today. He hoped that Afghanistan would take notice and not allow any group to use Afghan land for carrying out terrorism in Pakistan.\nTo another question, he said that the government was focusing on expanding skill training programmes, adding that a hefty amount of Rs 20 billion had been given to the ministry of education and national vocational and technical training commission, so that development programmes could be expanded besides ensuring international certification.\nHe said without international certification it was difficult to place human resources in other countries.\nHe said that the ‘Uraan Pakistan’ programme would yield positive results. Ahsan Iqbal said, “It is a high time to move with unity and diversity for achieving desired results.”\nHe said that young generation was the future of the country and now entire focus should be on celebrating the country’s 100 years in a most befitting manner. He further said that a successful country’s had always established peace, ensured political stability, continuity of policies  and adopted reforms.\nIn 77 years, Pakistan tried multiple times to take off but unfortunately did not achieve desired results, he added.\nHe said that the country’s economic indicators were moving in the right direction and collective efforts were necessary to make it a $3 trillion economy by 2047. It is very unfortunate that wrong impression of Pakistanis is being highlighted, he said and added that the world considers Pakistanis as hard working and intelligent people.\nHe further said that there was a need to respect other opinions and not to misguide people. He said, “Democracy is not about making people fight with each other.”\nIt is high time to channelize positive energies of youngsters and now entire focus should be on an economic ‘long march.’ He appreciated the National College of Arts for providing talented human resource in the country’s creative industry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:21:36.406Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pml-n-believes-in-economic-agenda-ahsan-iqbal/",
  "dateList": "2025-01-04",
  "date_published": "2025-01-04T12:56:00.000Z"
}
