{
  "article_id": "2025-05-22_ee074e9903d62133f8cf42df3016738c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/indias-reported-plan-to-curtail-pakistans-water-a-desecration-of-indus-treaty-violation-of-intl-norms-engr-arshad/",
    "retrieved_at": "2025-08-27T15:48:00.758Z"
  },
  "metadata": {
    "title": "India’s reported plan to curtail Pakistan’s water a desecration of Indus Treaty, violation of Int’l norms: Engr. Arshad",
    "author": null,
    "date_published": "2025-05-22T16:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 595,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 22 (APP):India's reported move to double the length and capacity of the Ranbir Canal-drawing water from the Chenab River protected under the Indus Waters Treaty (IWT) of 1960-has been strongly condemned by renowned water and energy expert Engineer Arshad H. Abbasi as a desecration of the historic treaty and a violation of international norms. In an exclusive interview with APP, Abbasi referenced a recent investigative report by five Reuters journalists published on May 16, which revealed India's alleged intentions to expand the canal from 60 to 120 kilometers and boost its water carrying capacity from 1,400 to 5,300 cusecs. This, he warned, could lead to the diversion of nearly 20 percent of the Chenab River's flow, translating into an annual loss of over 5 million acre-feet (MAF) of water for Pakistan. \"This move could deliver a crippling blow to our agriculture,\" Abbasi said. \"Punjab, our agricultural heartland, produces nearly 68 percent of Pakistan's food grains. A loss of this magnitude-estimated at $10 billion in global market value-would be catastrophic.\" \"India's proposed expansion violates these limits by several orders of magnitude,\" Abbasi cautioned. \"If implemented, it would be tantamount to tearing up the treaty-a grim signal of unilateral revocation.\" Abbasi described the move as a blatant violation not only of the IWT but also of international commitments and decisions made under the International Court of Arbitration in the Kishanganga case. \"This isn't just a legal violation,\" he said. \"It's the desecration of a treaty that symbolized cooperation in a region marked by conflict.\" According to the treaty's Annexure C, India's permissible usage for canals like Ranbir is strictly capped: 1,000 cusecs during the Kharif season (April 15 to October 14) and 350 cusecs during the Rabi season (October 15 to April 14). Abbasi highlighted the lack of transparency and accountability in Indo-Pak water data exchange. Although the treaty requires the two countries to share river and canal data regularly, Abbasi noted that India often provides data in outdated formats-via fax or postal mail-rendering verification difficult. \"There is no independent mechanism to verify whether India is already exceeding its treaty limits,\" he said. \"If they are operating the Ranbir Canal at its full capacity of 1,400 cusecs year-round, they are already in breach.\" Historically, Pakistani officials were allowed to inspect the western rivers-Indus, Jhelum, and Chenab-two to three times a year. However, current geopolitical tensions and the partial suspension of treaty protocols have disrupted this process. \"Without regular inspections and real-time monitoring, we are operating in the dark,\" Abbasi remarked. \"This is a recipe for mistrust and instability.\" Abbasi also recalled the foresight of late Barrister Harun ur Rashid, former Bangladeshi Ambassador to the UN, who had warned in 2001 that India might one day use water as a diplomatic weapon against Pakistan. He connected current developments to India's long-standing irrigation ambitions, pointing to the Accelerated Irrigation Benefits Program (AIBP) launched in the late 1990s. \"The Ranbir and Pratap Canal expansion projects were conceived in 2003 but kept dormant, perhaps until the geopolitical moment was right to use them as leverage,\" he suggested. He posed a sobering question regarding the timing of the current escalation: \"Was the tragic Pahalgam incident used as a pretext to operationalize these projects, in a bid to unilaterally undermine the treaty?\" Despite the ominous outlook, Abbasi remains hopeful that investigative journalism will play its part. \"We now look to the five Reuters journalists who broke this story to delve deeper into India's power corridors and uncover the full extent of these plans-before the first shovel hits the ground,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}