{
  "article_id": "2025-05-22_0ade466c28ef01f2831d7693f5c63cdd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/khuzdar-attack-part-of-broader-strategy-to-internally-destabilize-pakistan-senator-kamran-murtaza/",
    "retrieved_at": "2025-08-27T15:48:24.485Z"
  },
  "metadata": {
    "title": "Khuzdar attack part of broader strategy to internally destabilize Pakistan: Senator Kamran Murtaza",
    "author": null,
    "date_published": "2025-05-22T13:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 914,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 22 (APP): Participating in the debate in Senate on Khuzdar martyrdom, Senator Kamran Murtaza stated that the martyrdom of young girls reflected proxy warfare and regional hostilities driven by India. These incidents, he added, seem part of a broader strategy to internally destabilize Pakistan. Senator Kamran Murtaza said such attacks reflect a shift from India's past direct aggression to covert tactics, including terrorism within Pakistan. He emphasized that Pakistan's restrained, strategic response had exposed the aggressor globally and prompted a proportional reply. While calling for peace, he noted, the enemy continues to sponsor internal destabilization. Syed Waqar Mehdi called the attack especially tragic, noting the victims were children simply pursuing education. He emphasized that soldiers and civilians have already sacrificed greatly and acknowledged the security forces' success in eliminating many terrorists from banned groups. Recalling the 2014 APS massacre, Syed Waqar Mehdi noted that the National Action Plan was devised with unanimous support but its implementation has been weak. He urged a thorough review of the plan to address security and administrative gaps and called for renewed political unity to eliminate terrorist networks completely. Senator Mehdi accused India of waging a covert war against Pakistan, targeting civilians and religious sites from Kashmir to Bahawalpur. He praised the Pakistan Armed Forces for their strong response, including downing Indian aircraft and countering intelligence efforts, stating, \"The message was loud and clear-India will remember it.\" Senator Mehdi voiced distrust in India's BJP and RSS leadership, urging vigilance and unity across political lines to defeat terrorism. He affirmed that with public support for the military, Pakistan can counter foreign conspiracies, including India's 'Akhand Bharat' ambitions, stressing, \"We must stand together to overcome these challenges.\" Senator Abdul Qadir termed the attack as a heart-wrenching assault on innocent students, particularly young girls. He accused Indian-backed elements of promoting terrorism to destabilize Balochistan, stating, \"The people of Khuzdar are shedding tears of blood. Even in the harshest wars, children are spared, but our enemies have lost all sense of humanity.\" Senator Qadir highlighted past attacks, including those in South Balochistan, the Jaffar Express tragedy, and a railway station bombing, pointing to India's support through finances, training, and intelligence. He noted that many, like Kulbhushan Yadav, are working to destabilize Pakistan. Expressing solidarity with the victims' families, he assured justice would be served. Quoting the Quran, he said martyrs are alive and supported by Allah, stressing that no terrorist can weaken a nation united in this belief. Senator Khalida Ateeb urged unity among parliamentarians to combat recurring attacks on Pakistan's security and children. She called for strict policy implementation to prevent future tragedies and highlighted how the violence stems from a long-standing agenda targeting the nation's vulnerabilities, as pointed out by Senator Kakar. Senator Ateeb criticized India's misjudgment of Pakistan's unity and resilience, stating they underestimated the nation's strength. She called the Khuzdar attack both tragic and alarming, stressing that the ongoing targeting of children is part of a broader hostile plan. She urged for serious strategies, not just speeches, to address the issue. Senator Ateeb praised the armed forces, stating that if provoked, Pakistan's military would demonstrate its strength, shattering the dream of Akhand Bharat. She also called for resolving regional disputes like Kashmir and water distribution, urging the international community to help prevent conflict between the two nuclear powers. The Senator concluded her speech with a couplet: \"Apna dastoor hai dushman ko dua bhi dena, Aur zalim ho to bharpoor saza bhi dena.\" (\"It is our tradition to bless even our enemies - but if the oppressor is ruthless, we give a fitting reply.\") Senator Abdul Wasay emphasized that women and children must be protected under any law, even during conflict. He criticized the enemy for resorting to cowardly tactics after failing to defeat Pakistan militarily. He called for unity among all political parties and institutions. Senator Wasay concluded by calling for mutual understanding and national solidarity to combat terrorism and secure Pakistan's future. Senator Bilal Ahmed Khan highlighted India's history of bombing civilian areas and killing innocent children, exposing its true nature. The senator vowed that Pakistan would respond to such terrorism with strength and resilience.The senator vowed that the nation would respond to such acts of terrorism with strength and resilience. Senator Umar Farooq called for a joint parliamentary session to address national security breaches and restore public trust. Senator Kamil Ali Agha highlighted India's excessive defense spending of $88 billion annually and suggested another potential aggression. He also criticized Prime Minister Modi's extremist mindset, citing the Gujarat massacre as an example. Senator Agha noted that India's recent moves coincided with Pakistan's successful counter-terrorism operations, suggesting an attempt to divert attention. He alleged Israeli involvement in fueling tensions and called for full implementation of the National Action Plan. He also emphasized strengthening ties with Afghanistan and warned that hostile elements within Pakistan were being exploited by India to create unrest. JUI-F Senator Maulana Atta ur Rehman urged lawmakers to refrain from decisions that could provoke religious groups or undermine national unity. He called for collective introspection and a return to core values, emphasizing gratitude to Allah and the need to avoid actions that may invite divine displeasure. Dr Zarqa Suharwardi Taimur, Senators Umer Farooq, Aon Abbas Bappi, Ashraf Ali Jatoi, Khalil Tahir Sandhu, Falak Naz, Sarmad Ali, Nasir Mehmood and Shahadat Awan also spoke on the Khuzdar attack, strongly denouncing the incident and emphasizing the need for national unity in the face of such challenges. APP/szm-rzr-tsw",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}