{
  "article_id": "2025-05-22_ba16a30733f4b9fec6a7700aa20c936f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-fully-confident-of-its-nuclear-security-regime-fo-spokesperson/",
    "retrieved_at": "2025-08-27T15:47:35.469Z"
  },
  "metadata": {
    "title": "Pakistan fully confident of its nuclear security regime: FO Spokesperson",
    "author": null,
    "date_published": "2025-05-22T18:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 194,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 22 (APP):Pakistan remained fully confident in the strength of its comprehensive nuclear security regime and the robustness of its command and control structures, Foreign Office Spokesperson said on Thursday. In response to a media query regarding remarks made by former US National Security Advisor, John Bolton, to an Indian media outlet, concerning Defence Minister Rajnath Singh's statement on Pakistan's nuclear weapons, the Spokesperson in a statement said, \"It is ironic that John Bolton's remarks were prompted by a statement from Rajnath Singh-a leader affiliated with a Hindu extremist organization, known for repeatedly issuing threats of aggression against Pakistan.\" In reality, he said the international community should be more concerned about India's nuclear arsenal being controlled by individuals like Rajnath Singh, who harbor well-documented hostility toward Pakistan and Muslims, and exhibit dangerous delusions of grandeur. \"The escalating radicalization of India's political landscape, media, and segments of its society raises legitimate nuclear security concerns. These concerns are further exacerbated by the persistence of a nuclear black market in India, highlighting serious deficiencies in its nuclear security framework - as evidenced by recurring incidents of theft and illicit trafficking of sensitive nuclear materials,\" he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}