{
  "article_id": "2025-05-22_8c602c673373ce376b847966e6e7a280",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-hails-hutchison-ports-long-term-investment-as-vote-of-confidence-in-pakistans-economy/",
    "retrieved_at": "2025-08-27T15:48:24.906Z"
  },
  "metadata": {
    "title": "PM hails Hutchison Ports’ long-term investment as ‘Vote of Confidence’ in Pakistan’s economy",
    "author": null,
    "date_published": "2025-05-22T14:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 249,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 22 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday highlighted Hutchison Ports' nearly three decades of investment in the country and described the company's sustained engagement as a \"clear sign of confidence in Pakistan's economic policies.\" The prime minister welcomed CEO of Hutchison Ports, Eric Ip for a high-level meeting here, where the two discussed ongoing and future investment initiatives in Pakistan's maritime and port sectors, a PM's Office news release said. \"Pakistan's ports are entering a new era with the integration of modern technology, and Hutchison Ports is playing a key role in this transformation,\" the Prime Minister noted. He especially emphasized the importance of upgrading port infrastructure, including the installation of advanced scanners for customs assessment, where Hutchison Ports' support is considered invaluable. Reaffirming his government's commitment to attracting and facilitating foreign direct investment, Prime Minister Shehbaz stated: \"We are providing all necessary facilities to international investors and continuously working to make our policies more investment-friendly.\" During the meeting, Eric Ip praised Pakistan as a favorable destination for long-term investment and expressed strong interest in expanding Hutchison Ports' footprint in the country. He noted that the company is actively working to introduce cutting-edge technologies at the Karachi Port, aiming to raise operational efficiency and global competitiveness. The session was also attended by key government officials, including Federal Minister for Finance Muhammad Aurangzeb, Federal Minister for Economic Affairs Ahad Khan Cheema, and Federal Minister for Maritime Affairs Junaid Anwar Chaudhry, along with senior representatives from relevant institutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}