{
  "article_id": "2025-05-22_3ea7b9df44c1e5292d9d5c71118e54ef",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-pm-confer-baton-of-field-marshal-on-coas-asim-munir/",
    "retrieved_at": "2025-08-27T15:47:38.240Z"
  },
  "metadata": {
    "title": "President, PM confer baton of Field Marshal on COAS Asim Munir",
    "author": null,
    "date_published": "2025-05-22T17:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 976,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 22 (APP): President Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif on Thursday jointly conferred the baton of Field Marshal upon Syed Asim Munir, Chief of the Army Staff during a special investiture ceremony at President House here. The prime minister handed over the baton to Field Marshal Asim Munir during the ceremony. Quaid of Pakistan Muslim League (N) Nawaz Sharif, federal cabinet ministers, governors, chief ministers, members of Parliament and services chiefs attended the ceremony. Deputy Prime Minister Ishaq Dar and Chairman Pakistan Peoples Party Bilawal Bhutto Zardari were also in attendance. In his remarks, the President said, \"Today, we are gathered here to honour our valiant armed forces and heroes of the Army, Navy, and Air Force who defended the sovereignty and territorial integrity of our motherland against unprovoked Indian aggression. The entire nation is proud of all of you.\" \"It is a matter of great pleasure for me to confer the baton of Field Marshal upon Chief of Army Staff Field Marshal Syed Asim Munir Nishan-e-Imtiaz Military in recognition of extraordinary service to Pakistan during this turbulent period, and with full confidence in his command and character.\" \"I, as President of Pakistan, hereby promote General Syed Asim Munir to the full rank of Field Marshal and confer the baton of the Field Marshal. As Supreme Commander of the Armed Forces, I was more than happy to approve the conferment.\" The President said, \"Field Marshal Syed Asim Munir, your military career is forged with courage and refined by wisdom, a commitment to lead with vision, strength and honour at the highest level of our armed forces.\" Under Field Marshal Asim Munir's wise leadership, Pakistan's Armed Forces created an unprecedented level of operational cohesiveness,he remarked. He noted that throughout three weeks of Marka-e-Haq, Field Marshal Asim displayed a pragmatic understanding of the need to avoid escalation. \"Our diplomatic response was also appreciated by the world. Our media also played a role in highlighting the truth.\" He thanked the entire Pakistani nation, who stood united and resilient in the face of the enemy's aggression. \"Our brave Armed Forces and citizens presented a united front and became a solid wall. Our victory was both military and moral. The world witnessed our strength, our restraint, and our resilience.\" He reiterated that Pakistan was a peace-loving nation and believed in peaceful coexistence. \"But our desire for peace must never be mistaken for weakness. We will not tolerate any attack upon our soil, and if needed, we will fight for every inch in the air, sea, rivers, jungles, and deserts. Any act of aggression will be met with full force at our command,\" he asserted. President Zardari said, \"This conferment of the rank of Field Marshal is a national recognition of the Chief of Army Staff Syed Asim Munir's remarkable services to the homeland. It is an acknowledgement of his firm leadership in defending Pakistan's frontiers.\" \"Field Marshal Syed Asim Munir may this baton remind you not only of the power vested in you but the duty to wield it wisely, humbly and justly. The nation has placed a sacred trust in you which comes with great responsibilities,\" he continued. He said, \"On behalf of the people and the government of Pakistan, I extend my heartfelt gratitude to Field Marshal Syed Asim Munir. You have made your nation proud of you, and we all wish you success in all endeavours and salute your lifelong service to the nation.\" Speaking on the occasion, Prime Minister Shehbaz Sharif said Field Marshal, Syed Asim Munir, Chief of Army Staff, led the brave armed forces of Pakistan with unflinching courage and outstanding service in remarkable victory against India during Operation Bunyanum Marsoos. \"Today is a moment of profound national pride and historic importance for Pakistan.\" He said that they salute their national heroes, COAS Field Marshal Asim Munir, Chairman Joint Chiefs of Staff Committee General Sahir Shamshad Mirza, Air Chief Marshal Zaheer Ahmed Babar Sidhu and Chief of the Naval Staff Admiral Naveed Ashraf. \"You have led our brave armed forces to a remarkable victory against an enemy, caught in its own web of arrogance and hubris,\" he added. \"Our armed forces not only defended the nation's frontiers but also took the battle deep into the enemy's territory, and within no time, the aggressor was brought to its knees and was taught a lesson.\" He said what transpired during those challenging times was not only an outstanding military victory but also a moral and diplomatic triumph. He said at the very heart of this remarkable success was the leadership of Syed Asim Munir who led from the front and the nation achieved the most glorious victory. \"Today we have gathered here to pay our tribute to Field Marshal, Syed Asim Munir, Chief of Army Staff who during the operation commanded the armed forces and with resolute courage safeguarded sovereignty and territorial integrity of the country. \"In those crisis filled days, Asim Munir provided able leadership with unwavering resolve and determination and gave a jaw breaking response to the enemy. General Asim Munir showed faith, foresight, courage and discipline, \" he went on to say. He said the Operation Bunyanum Marsoos was an example of effective coordination between the political and military leadership which were working together like never before day in and day out. \"It is primarily on account of these joint efforts that the nation faced economic challenges and the threat of terrorism and the recent incident of an act of terror in Khuzdar,\" he added. He said, \"Today I join the entire nation in acknowledging the meritorious services of Field Marshal Syed Asim Munir whose name will be etched in the annals of our national history.\" He urged the nation to show same resolve, unity and solidarity while keeping the country on the path to peace, progress and prosperity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}