{
  "title": "No differences between government and allies: Governor",
  "link": "https://www.app.com.pk/national/no-differences-between-government-and-allies-governor/",
  "date_published": "2020-07-06T01:57:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 06 (APP):Governor Punjab Chaudhry Mohammad Sarwar has said that the government and its allies were on the same page and determined to solve peole’s probelms.\nTalking to a party delegation led by Allama Asif Alvi at the Governor’s House here on Monday, he said the opposition parties were pursuing their own vested interests through protests and conspiracies against the government.\nGovernor said that there is no other leader like Prime Minister Imran Khan because 220 million Pakistanis trust him completely. He said The government and allied parties are united for the development and prosperity of the country but the opposition parties which have made big claims of protest against the government vowing to protect personal interests.\n“The opposition parties are working for personal aggrandizement and these opposition parties have been completely exposed in front of the nation”, he said.\nHe said the governmmt will foil all attempts to destabilize the country and the governmmt will lead the country successfully.\nGovernor said COVID-19 pandemic was not yet and the people must adopt precautionary measures to avoid health hazards.\nPunjab Governor Chaudhry Mohammad Sarwar strongly condemned the unprovoked firing of Indian forces on the LOC and said that we are proud of our armed forces. He said India is pursuing a policy of destroying peace in the region and unprovoked Indian firing on the LOC is also terrorism.\nHe said that International organizations including the United Nations should take notice of Indian terrorism and stop the menace in Kashmir.\nChaudhry Sarwar said Narendra Modi’s governemnt must stop atrocities against innocent Kashmiris immediately and the United Nations should abide by its resolutions and give Kashmiris the right to self-determination.",
  "retrievedAt": "2025-08-11T19:27:26.432Z"
}
