{
  "title": "PM for coordinated strategy for easy availability of wheat, flour",
  "link": "https://www.app.com.pk/national/pm-for-coordinated-strategy-for-easy-availability-of-wheat-flour/",
  "date_published": "2020-07-06T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 06 (APP):Prime Minister Imran Khan Monday directed all the provincial chief secretaries for formulation of a  well-coordinated strategy under the Minister for National Food Security for equal pricing of wheat and flour in all the provinces, besides ensuring sufficient stock of these commodities with regard to requirement of any province.\nThe prime minister was chairing a meeting to review measures for bringing down prices of essential commodities, PM office media wing in a press release said.\nThe prime minister observed that strategy should focus on farmers and common man as in the past, the elements involved in hoarding and undue profits had not only deprived the farmers from their just profits but also forced the ordinary people to purchase flour at exorbitant prices.\nThe meeting was attended by Minister for National Food Security Syed Fakhar Imam, Adviser on Finance Dr Abdul Hafeez Shaikh, Adviser on Commerce Abdul Razak Dawood, Special Assistant to Prime Minister Dr Shahbaz Gill and senior officials.\nChief secretaries of Punjab, Sindh, Balochistan, and additional secretary of Khyber Pakhtunkhwa attended the meeting through video link.\nThe chief secretaries presented a detailed comparative briefing regarding reduction of prices of essential items, steps taken in this regard and the outcome.\nThey also briefed the meeting about the availability of medicines including oxygen with regard to coronavirus pandemic.\nThe prime minister directed that there should be no impediments in the inter-provincial transportation of wheat as the provision and availability of regular and low-price wheat was his government’s priority.\nThe chief secretary Punjab said that so far, they had recovered 716 tons of flour, and 16008.5 tons of sugar worth more than Rs 1 billion during the crackdowns against the big hoarders. Due to these measures, the price of sugar in Punjab had been comparatively lower than other provinces.\nHe further informed that after the approval by provincial cabinet, the provincial government on Tuesday would be releasing wheat worth 35 billion rupees which would not only reduce shortage of flour but also gradually bring down prices of wheat and flour.\nThe prime minister appreciated the steps taken by Punjab government.\nThe prime minister further desired effective measures against the hoarders in the light of sugar JIT report.\nHe also directed for adoption of zero tolerance against adulteration in food items.",
  "retrievedAt": "2025-08-11T19:27:18.389Z"
}
