{
  "title": "CPEC a parallel world order focusing on economic cooperation, development: Masood",
  "link": "https://www.app.com.pk/national/cpec-a-parallel-world-order-focusing-on-economic-cooperation-development-masood/",
  "date_published": "2020-07-05T21:42:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jul 06 (APP):Azad Jammu Kashmir President Sardar Masood Khan has said that the China-Pakistan Economic Corridor was one of six main projects coming under the mega Belt and Road Initiative (BRI) project.\nComparing the BRI to the Marshall Plan, he said that this project was of considerable economic and strategic importance as this unparalleled transcontinental project will connect countries and continents; thereby, creating a parallel economic world focusing on economic cooperation and development.\nThe President made these remarks while addressing a Q&A session organized by Islamabad Institute of Conflict Resolution (IICR) on “China-Pakistan Economic Corridor and its impact on Societal Emancipation of Pakistan and Afghanistan”. The session was moderated by Maj. Gen. (R) Raza Muhammad, member IICR Advisory Board, AJK Presidential Secretariat later told media Monday.\nMasood Khan said that CPEC – a $62 billion spanning around 15 years project – comprises of ports, power generation plants and infrastructure development, which has now been made holistic and substantive with the addition of socio-economic development projects like skill development, employment and people to people contacts. “.The focus is not merely on Gawadar Port but Gawadar and every other city of Pakistan, skill development, improving our overall human resource capital and indexes. The CPEC has transformed into an organic relationship between two brotherly nations”, he said.\nThe President said that there is an overwhelming national consensus on CPEC. “All political leaders, political parties and stakeholders have been brought on board. The people of Balochistan are very optimistic for CPEC”, he said while adding that India has been trying to jeopardize peace in Pakistan by carrying out proxy wars in not only Balochistan but other areas of the country. “We have to brush aside these risks and stay the course”, he said.\nThe AJK President that CPEC must not be mistaken as a substitute for the growing Pakistani economy rather it shall act as a catalyst for economic transformation, modernize its industry, develop its maritime economy, build its human capital, and diversify its trading partners and sources of investment.\nResponding to a question, the President said that in 2015 when CPEC was finalized, the US State Department gave a very positive statement over this initiative saying it would help towards development. But later during the Trump administration, the US expressed reservations. India, he said objects because they cannot bear to see Pakistan economically progress. India has contested that CPEC passes through a disputed territory (GB and AJK) – which in turn accentuates Pakistan’s stance that this area is a disputed territory while all the while India claims it as their “integral” part, he said. ”India’s claims lack clarity and are instead counter-intuitive”, said Masood Khan.\nMasood said that India, the lynchpin of QUAD, has tried to garner the support of Australia, USA and Japan in an attempt to sabotage CPEC by claiming it to be a disruptive programme. “Despite the opposition of India and its allies, completion of the Corridor will not see any delays. We have to look at the bigger picture; this project not only benefits Pakistan and China but the whole region including CARs and Afghanistan.\nHe said that China has established its writ in the Galwan Valley during the recent Ladakh standoff with India. India, he said is facing national humiliation and their reaction is more of self-emulation rather than punitive.\nThis standoff, said Masood Khan, will have an impact on the situation in IOJK as India brought Ladakh and Jammu and Kashmir under union rule. He said that India further went on to issue fake maps bringing GB, AJK, Ladakh and Aksai Chin within India’s “so-called” territorial boundaries. China has in the recent past facilitated an informal debate on Jammu and Kashmir in the UN Security Council and now, not only does Pakistan and China have an economic alliance but also a military alliance and united against India’s expansionism.\nTo another query, the AJK President said that Afghanistan has always been very keen to join the CPEC. He added that the Afghan’s leadership and Pakistan’s government have a greater understanding and keenness in the project and despite complicating factors like security issues in Afghanistan, US presence along with the opposition of India, the ground is being prepared for including and incorporating Afghanistan in CPEC. Pakistan has recently played a positive role in the Afghan peace talks and its stock has increased in Washington too and is seen as a peacemaker, facilitator and mediator, he said while hoping the diplomatic process continues and there is peace and security not only in Afghanistan but the whole region.\nBeing asked about the apprehensions of debt-trap diplomacy rumoured by India, US and its allies; the President said that Pakistan does not more than 10 per cent of its total debt to China. He said that $33 billion of CPEC’s principal amount was not credited to Pakistan but instead was given to their corporations. The amount given directly to Pakistan under concessional and preferential credit lines amount to only $12 billion, said the President.\n“We are a sovereign nation and we are fully capable of paying back these debts extended to us on a concessional basis”, he said.\nThe AJK President also rejected the notion that China could be the next East India Company and trashed observations that the BRI and CPEC could somehow lead to colonialism. The President said that historically China has never been a colonial power; Pakistan is a strong, pivotal country in the comity of nations and the East India Company, he said, was an imperial legacy.\nDespite all these challenges, the AJK President said that our leadership has to focus on economic development. “We can meet all the upcoming challenges if we are economically robust and have a rich human capital”, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:27:31.605Z"
}
