{
  "title": "PM opens country’s first-ever indigenous ventilator production unit",
  "link": "https://www.app.com.pk/national/pm-opens-countrys-first-ever-indigenous-ventilator-production-unit/",
  "date_published": "2020-07-06T06:50:00.000Z",
  "source": "APP",
  "content": "HARIPUR, Jul 6 (APP):Prime Minister Imran Khan on Monday inaugurated the facility of country’s first-ever indigenously made ventilators at National Radio and Telecommunication Corporation (NRTC) in Haripur.\nThe Prime Minister opened the project of local manufacturing of portable ventilators named ‘SafeVent SP100’, having the FDA/CE approval as economical and reliable ventilator in terms of usage and safety.\nTerming the occasion as ‘landmark achievement’, he said abundant talent in the country could help gain self-reliance in technological innovation and vowed the government’s strong support to such initiatives.\nThe Prime Minister commended the initiative of NRTC team and the Ministry of Science and Technology for successfully producing locally-made ventilators.\nHe said Pakistan’s response to coronavirus pandemic and adopting strategy of smart lockdown while keeping economy afloat was widely acknowledged.\nHe mentioned that the government would focus on introducing and implementing comprehensive health reforms.\nThe Prime Minister visited various sections of NRTC and the production facility of ventilators.\nManaging Director NRTC Brig. Tofique Ahmed gave a detailed briefing to the Prime Minister about the history, sectors of research and development, products and services of NRTC.\nHe said NRTC was indigenously providing services in diverse areas including communication equipment, e-policing, electro-medical equipment, and hardware and software.\nThe inaugural ceremony at NRTC was attended by Minister for Science and Technology Fawad Chaudhry, Minister for Energy Omar Ayub, PM’s focal person for COVID-19 Dr Faisal Sultan and Chairman National Disaster Management Authority (NDMA) Lt. General Muhammad Afzal.\nThe NRTC has already produced 15 units of SafeVent SP100 and has a production capacity to manufacture 250-300 units per month.",
  "retrievedAt": "2025-08-11T19:27:18.924Z"
}
