{
  "title": "FO summons senior Indian diplomat over ceasefire violations",
  "link": "https://www.app.com.pk/national/fo-summons-senior-indian-diplomat-over-ceasefire-violations/",
  "date_published": "2020-07-06T02:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 6 (APP):A senior Indian diplomat was summoned at the Ministry of Foreign Affairs here on Monday to register Pakistan’s strong protest over the ceasefire violations by the Indian occupation forces along Line of Control (LoC) on July 5, resulting in serious injuries to five civilians including three children.\nThe indiscriminate and unprovoked firing of Indian forces in Nikial Sector seriously injured 10 and a seven-year-old Junaid and Aryan respectively, Jahan Begum, 70, Zubaida Bibi, 50, Kamran Shafique, 15 in Truthi and Ghim Bala village.\nThe Foreign Office said the Indian occupation forces along LoC and the Working Boundary (WB) had been continuously targeting civilian populated areas with artillery fire, heavy-caliber mortars and automatic weapons.\nThis year, India has committed 1,595 ceasefire violations to date, resulting in 14 martyred and 121 seriously injured.\nCondemning the deplorable targeting of innocent civilians by the Indian occupation forces, it was underscored that such senseless acts are in clear violation of the 2003 Ceasefire Understanding, and are also against all established humanitarian norms and professional military conduct.\n“These egregious violations of international law reflect consistent Indian attempts to escalate the situation along the LoC and are a threat to regional peace and security,” the Foreign Office said.\nIt was added that by raising tensions along the LoC and the WB, India could not divert attention from the grave human rights situation in the Indian Occupied Jammu and Kashmir (IOJ&K).\nThe Indian side was called upon to respect the 2003 Ceasefire Understanding, investigate this and other such incidents of deliberate ceasefire violations and maintain peace along the LoC and the WB.\nIt was urged upon to allow the United Nations Military Observer Group in India and Pakistan (UNMOGIP) to play its mandated role as per the United Nations Security Council (UNSC) Resolutions\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:27:23.395Z"
}
