{
  "title": "Development, uplift of merged tribal areas amongst govt’s foremost priorities: PM",
  "link": "https://www.app.com.pk/national/development-uplift-of-merged-tribal-areas-amongst-govts-foremost-priorities-pm/",
  "date_published": "2020-07-29T03:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):Prime Minister Imran Khan on Wednesday said the development and uplift of merged tribal areas (previously known as FATA) was amongst the foremost priorities of the present government. He also directed to ensure the timely issuance of funds allocated for infrastructure development in the merged areas. The prime minister was presiding over a meeting held here to discuss the issues of Khyber Pakhtunkhwa particularly the matters relating to energy and review the progress regarding development process in the merged areas.\nFederal Ministers Asad Umar, Umar Ayub Khan, Governor KP Shah Farman, Chief Minister Mehmood Khan and officials of the concerned federal and provincial departments attended the meeting. The meeting discussed the pace of development work in the merged areas, expenditures during the fiscal year 2019-20 and the budget allocated for the current fiscal year.\nDuring the meeting the matters relating to implementation of wheeling regime in power sector, provincial representation in the concerned departments in energy sector, payments of net hydel profits, proposed amendment in power sector policy 2015 and issues relating to the implementation of Chashma Right Bank Canal project.\nRegarding the implementation of wheeling regime and the benefits for industrial sector under this system, the prime minister directed the National Electric Power Regulatory Authority (NEPRA) to address issues about the implementation of wheeling regime as soon as possible in consultation with the stakeholders so as to benefit from the system. He also directed to ensure the representation of provinces in boards of directors of concerned institutions in power sector.\nAbout the payments of net hydel profits, the prime minister directed the Ministries of Energy, Finance, Federal Board of Revenue (FBR) and the provincial government to finalize the procedure in that respect. Regarding the proposed amendment in Power Policy 2015, he directed that the matter should be considered in the Cabinet Committee on Energy.\nAbout the Chashma Right Bank Canal, the prime minister directed to complete within six months the feasibility of this project, which was very important for socioeconomic development of the province especially the development of agriculture so as to further progress on the project.",
  "retrievedAt": "2025-08-11T19:33:48.246Z"
}
