{
  "title": "‘Tiger Force volunteers’ can register via mobile app for plantation drive: Usman Dar",
  "link": "https://www.app.com.pk/national/tiger-force-volunteers-can-register-via-mobile-app-for-plantation-drive-usman-dar/",
  "date_published": "2020-07-29T02:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):Special Assistant on Youth Affairs Usman Dar Wednesday said that Tiger Force volunteers will fully participate in tree plantation drive on ‘Tiger Force Day’ on August 9 and a ‘Tiger force app’, which would registered the volunteers for tree plantations campaign has been launching.\nTalking to a private news channel, Usman Dar said that it has been decided to increase the number of volunteers in the tiger force, and registration in this regard would open in the next few days through a mobile phone application for maximum involvement in tree plantation drive.\nHe said under the vision of Prime Minister Imran Khan, present government is taking steps to make a clean and green Pakistan. Youth can play effective role to mitigate this challenge through plantation, so that Pakistan can be saved from the risk of climate change.\nStudents through social media platforms can spread awareness in order to protect the environment. We have to make the sustainable utilization of our resources for the further successive generations, he added.\nWe welcome innovative and sustainable ideas from youth and are offering both mentoring and funding opportunities as well, he mentioned. He invited all civilians, legislators, ministers and officials to participate in the drive. He said the Tiger Force volunteers will plant one million saplings across the country on that day.\nThe Special Assistant said the forest department will identify the sites of tree plantation, and the Tiger Force volunteers in collaboration with the district administration will plant the saplings. The Special Assistant said one million youth have been registered under Tiger Force, and the government has so far benefited from three hundred thousand volunteers.\nHe said these volunteers have played an important role during the Coronavirus crisis.\nHe said the services of Tiger Force are being lauded at international level. He also said that the youth empowerment programme (Kamyab Jawan Pakistan) aims at creating opportunities for knowledge, skills and leadership development of the youth to further “Agenda 2030”.\nHe also pledged transparency and merit as the cornerstones of the Kamyab Jawan loan programme. ‘Naya Pakistan’ represents a new way of thinking in which merit has to be ensured across the board there no any political influence worked, he added.",
  "retrievedAt": "2025-08-11T19:33:51.533Z"
}
