{
  "title": "Technology works: Pakistan effectively fights COVID-19",
  "link": "https://www.app.com.pk/national/technology-works-pakistan-effectively-fights-covid-19/",
  "date_published": "2020-07-29T00:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):When many countries in the world are reporting thousands of cases a day, Pakistan seems little to worry about this pandemic as on Wednesday National Command and Operation Centre (NCOC) reported only 1,879 patients admitted in 734 hospitals across the country.\nAs per latest daily, 244,883 patients recovered so far across Pakistan making it a significant count while only 227 ventilators have been occupied across the country out of 1,859 vents allocated for COVID-19.\nAll this was made possible due to improving testing capacity as 1,909,846 tests have been conducted so far with 21,256 tests in just last 24 hours. Only 936 new cases were reported across the country during last 24 hours while 21,256 tests were conducted in a day.\nPakistan had move away from the past practice of normal manual level of tackling the pandemic to technology evidence based method as this model had worked well in China.\nTerming the Pakistan’s early success in controlling COVID-19) as ‘crushing the curve’, Special Assistant to Prime Minister on National Health Services Dr Zafar Mirza said “Alhamdulillah, we have the lowest number of deaths in Pakistan due to COVID-19 in last three months.”\n“We had a peak of 153 deaths on June 20 and in last 24 hours we had just 20 deaths. This is 87% reduction in COVID-19 related deaths. Due to government’s effective strategy the cases of corona were decreasing and the situation was improving in the country,” he said.\nPakistan relied on technology and understanding. Its decision making was based on information and reliable data of NCOC. The practice of data collection, correlation, collation and informed decisions making helped in containment efforts.\n“Our strategy was based on speedy testing, contact tracing and isolation, ensuring services to admitted patients and observing shortages and immediately addressing these shortages through use of domestic technology,” an official at Health Ministry told APP.\nAt National Command and Control Center Lieutenant General Hamood Uz Zaman Khan and DG Operations and Planning NCOC Major General Asif Mehmood Goraya worked day and night to ensure implementation of NCC decisions.\nThe team ensured excellent coordination mechanism with the federating units besides improvement in the healthcare system of the country to cope with the challenge, capacity building of the healthcare professionals, and increased availability of beds for the patients, uninterrupted availability of crucial medicines, use of digital technology for contact tracing and disease projection.\nThe NCOC moved scientifically and identified top 30 cities as COVID-19 hotspots with max Infected using auto trace and NITB maps. At an average 3-8 million population with 10-30 % of infected people remained under 300-500 smart lockdowns (SLDs) on rolling basis since adoption of this policy in entire country.",
  "retrievedAt": "2025-08-11T19:33:57.440Z"
}
