{
  "title": "Pakistan to mark Youm-e-Istehsal to highlight Indian illegal action: Moeed",
  "link": "https://www.app.com.pk/national/pakistan-to-mark-youm-e-istehsal-to-highlight-indian-illegal-action-moeed/",
  "date_published": "2020-07-28T23:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):Special Assistant to the Prime Minister on National Security and Strategic Policy Planning Dr Moeed Yousuf on Wednesday said Pakistan would mark August 5 as Youm-e-Istehsal to highlight unilateral Indian action of abrogating the special constitutional status of Occupied Jammu and Kashmir and its military siege with record brutalities and suppression.  He was addressing an interactive session ‘Hope for Kashmir’ ( Kashmir Ki Umeed) with press secretaries and diplomatic attaches of foreign missions in Pakistan.\nMoeed said the government and Prime Minister Imran Khan believed that the world should know the truth about Indian oppression of innocent Kashmiris as human rights violations were not allowed in any country. India had been committing serious human rights abuses in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).  He said Pakistan had raised the Kashmir issue before the world so that the international community could take stock of it. A year had lapsed after the Indian illegal action of August 5, 2019 to abolish the constitutional status of IIOJK and now the Muslim majority there was being turned into a minority, with continuous genocide and jailing of innocent Kashmiris.\nThe SAPM said artificial political activities were being carried out in the held valley to divert the world’s attention. India had stated on record that thousands of additional troops had been sent to the IIOJK, who were involved in killings, using pellet guns and forced disappearances of Kashmiris. He said India had intensified its atrocities in the IIOJK in the guise of coronavirus pandemic and the international community needed to wake up now.\n“Pakistan has raised the issue of Kashmir at the international level for the first time. Prime Minister Imran Khan approached the world as a lawyer and ambassador of Kashmiris.”\nHe said Pakistan would continue to support the Kashmiris till they achieved their right to self-determination.\nHe said India was persistently carrying out provocations on the Line of Control by targeting the civilians. Pakistan had given access to the foreign media and the United Nations envoys to the areas around the LoC while India had flatly refused to give on the ground inspection to them.",
  "retrievedAt": "2025-08-11T19:34:00.605Z"
}
