{
  "title": "Govt wants thorough investigation into petrol shortage issue: Omar Ayub",
  "link": "https://www.app.com.pk/national/govt-wants-thorough-investigation-into-petrol-shortage-issue-omar-ayub/",
  "date_published": "2020-07-29T01:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 29 (APP):Minister for Energy Omar Ayub Khan on Wednesday said the government wanted to hold a thorough investigation into the fuel shortage, occurred during the last month, so that the elements involved in hoarding and creating artificial scarcity of petrol could be brought to task.\nAccordingly, a commission had been formed by the Federal Cabinet in its last meeting, the minister said during question hour-session of the National Assembly. He said petrol sales stood almost 28 percent as compared to same period of the last year, but question was that where the stocks had gone. Definitely, some Oil Marketing Companies (OMCs) and dealers were involved in creating artificial shortage to make a quick buck, which was evident from the fact that there was no fuel shortage after the government announced increase in the price of petroleum products for the month of July, he added.\nThe minister said a system of automation was being introduced to maintain the sales data of OMC depots and nozzle sale of petroleum pumps aimed at keeping an eye on demand and supply needs in the country.\nReplying to a question, Omar Ayub said currently eight oil refineries including Attock Refinery Limited (ARL-Rawalpindi, Pakistan Refinery Limited (PRL- Karachi), National Refinery Limited (NRL- Karachi), Pak-Arab Refinery Limited (PARCO- Mahmood Kot), Byco Petroleum Pakistan Limited (BPPL-I Hub), Enar Petroleum Refining Facility (ENAR-I Karachi), Enar Petroleum Refining Facility (ENAR-II Karachi) and Byco Petroleum Pakistan Limited (BPPL-II Hub) were operating in the country.\nBesides, he said a number of projects were in different phases of implementation under which Gwadar Refinery, PARCO Coastal Refinery, SIOT Refinery, Falcon and Khyber Refinery would be established aimed at achieving self-sufficiency in the oil production sector.",
  "retrievedAt": "2025-08-11T19:33:55.419Z"
}
