{
  "title": "Shibli for new paradigms to address Kashmir issue",
  "link": "https://www.app.com.pk/national/shibli-for-new-paradigms-to-address-kashmir-issue/",
  "date_published": "2020-07-29T01:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 29 (APP):Federal Minister for Information and Broadcasting Senator Shibli Faraz on Wednesday said that political leadership, academia, foreign office and intelligentsia would have to think out of the box and find a new paradigm to the outstanding Kashmir issue after the traditional approaches had failed.\nResponding to the media men during a seminar ‘Yaum-e-Istehsal-e-Kashmir’ (Day of Exploitation in Kashmir) at the Governor’s House here, he said it had been seven decades since the United Nations Organization (UNO) took up the issue but the issue had remained unresolved, adding that the Indian government took unilateral decisions and annexed state of Jammu and Kashmir in a day, urging a new approach to free the state from Indian brutality.\nTo a query, the Information Minister said the government may approach the human rights organizations in other countries of the world to highlight human rights violation and brutalities in the Indian Occupied Kashmir (IOK), adding that these bodies might press their governments which would ultimately gear up efforts to force India relinquish its despotic rule.\nTo another query, Shibli said the governments in the past adopted a pacifist approach towards the resolution of Kashmir issue and did not take up the plight of downtrodden Kashmiris before the international community with as much force as was required. He said the political forces across the board and stake-holders were on the same page regarding the resolution of Kashmir issue and a united effort was required to arouse conscience of the world.\n“Prime Minister Imran Khan raised the issue forcefully at the UN and drew attention of the world towards the most urgent issue, and Prime Minister’s voice made U.S. President Donald Trump offer mediation on the Kashmir issue,” he responded. He said PM Khan’s speech at the UN helped in sensitizing the world on Kashmir issue, adding that the international media highlighted Kashmir issue and the world got aware about the seriousness of this issue.\nThe Information Minister, “Kashmir is matter of our national security, besides being an unfinished business of the partition.”\nTo a query, he said resignation of an advisor or SAPM did not make any difference, adding that people come and go but the states last. He said resignation was part of a government’s working, adding that the declaration of assets by the advisors or SAPMs was not required by law but Prime Minister Imran Khan should be given credit for making his cabinet accountable.\nResponding to a question, the Minister said, “We are least concerned about opposition which does not even have a road-map. The opposition parties are pursuing personal agenda and convene All Parties Conference (APC) as soon as they fear accountability”.\nAbout PPP Chairman Bilawal Bhutto’s sojourn in Lahore to destabilize the government, he said Bilawal Bhutto Zardari had turned the PPP into a regional party, adding that PPP, today, was non-existent in the provincial metropolis.\nTo a question, he said the PTI government had inherited all the problems due to the wrong-doings of the opposition. Earlier, addressing the seminar, Federal Information Minister Shibli Faraz expressed concern that international community did not show any reaction to what India did in held Kashmir, adding that the silence on human rights violation in IOK had created doubts that international community selectively condemned human rights violations and took action against countries as per its choice. Shibli said time would tell what India had done through this ugly action and added that this incident had strengthened the spirit of Pakistanis to fully back the Kashmir issue.\nThe Federal Minister said, “People of Pakistan stand with innocent people of held Kashmir who are facing worst brutalities and human rights violations at the hands of Indian forces”.\nHe said August 5 would mark a year of the draconian Indian laws which annexed the state of Jammu and Kashmir. The day would be observed as the Day of Exploitation of Kashmiris and special programs would be held at international level and in all nook and corners of the country to further highlight Kashmir cause and to expose ugly face of India. He expressed the hope that the dream of people of occupied Kashmir would turn into reality.\nPunjab Governor Chaudhry Mohammad Sarwar said after August 5, 2019 incident PM Imran Khan had said that he would become ambassador of Kashmir, adding that the vision with which Imran Khan had raised Kashmir issue on international forum was exemplary.\nThe Governor said that he had been working on Kashmir and Palestine issues for last forty years and there would be not a single country where he had not raised Kashmir issue.\nHe said, “It is a big achievement of incumbent government, media and overseas Pakistanis that we have made Kashmir issue an international news.”\nChaudhry Sarwar said that India through its heinous actions had changed the thinking of people and now people recognized India as an extremist country not a secular one.\nHe said that unfortunately international community had not shown the reaction which it had to show against human rights violations in held Kashmir. He said, “We need to tell to international community that Mosques in India are being converted into temples while in Pakistan work has been done on Kartarpur corridor and temples are being renovated besides protection of the worship places of minorities.”\nHe said, “World knows that Pakistan is a tolerant society and it wants good relations with its neighbouring countries.” The Punjab Governor said, “Parliamentary groups play very vibrant role in international relations so we need to use all possible tools to make a success of Kashmir issue.” PFUJ Secretary General Rana Azeem and Senior Analyst Salman Ghani also spoke on the occasion.",
  "retrievedAt": "2025-08-11T19:33:54.268Z"
}
