{
  "title": "PM departs to Pakistan after concluding five-day historic visit to China",
  "link": "https://www.app.com.pk/global/pm-departs-to-pakistan-after-concluding-five-day-historic-visit-to-china/",
  "date_published": "2024-06-08T14:24:00.000Z",
  "source": "APP",
  "content": "XI’AN, Jan 08 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday departed to Pakistan after concluding his historic and fruitful five-day visit to China where he held extensive meetings with the Chinese leadership, authorities, companies, investors and businessmen.\nAt the airport, the prime minister was seen off by Shaanxi Province Vice Governor Chen Chunjiang, senior Chinese and Pakistan Embassy officials.\nPrime Minister Sharif’s visit etched as another milestone in further solidifying of Pak-China bilateral ties, bilateral trade, strategic partnership and the initiation of second phase of China Pakistan Economic Corridor (CPEC), PM Office Media Wing said in a press release.\nThe prime minister said that his recent visit to China added a new dimension to the bilateral ties between Pakistan and China and thanked the Chinese leadership including President Xi and Premier Li Qiang for their hospitality.\nHe said that the friendship between the two countries was unprecedented.\nDuring the visit, the Chinese business people and investors met with the Pakistani counterparts, he said, adding that Chinese progress in information technology, agriculture, minerals and other sectors was worth emulating.\n“The economic partnership between China and Pakistan will benefit the people of the two countries. The positive outcome of the recent visit will have long- lasting impacts,” the prime minister was quoted as saying.\nSeparately, on his X account, the prime minister extended his heartfelt gratitude to the people and Government of China for the warm hospitality throughout this remarkable and immensely fruitful visit.\n“Under President Xi Jinping’s visionary leadership, China is reaching new heights and In order for Pakistan to flourish and progress, there are abundant lessons we can glean from our steadfast ally. Pakistan and China are proud to be Iron Brothers!” he further added in the post.\nhttps://x.com/CMShehbaz/status/1799436528336454087",
  "retrievedAt": "2025-08-11T03:04:59.630Z"
}
