{
  "title": "US consul general, Punjab minister discuss interfaith harmony",
  "link": "https://www.app.com.pk/national/us-consul-general-punjab-minister-discuss-interfaith-harmony/",
  "date_published": "2024-06-08T12:40:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 08 (APP):Consul General of USA Kristen Hawkins called on Provincial Minister of Minority Affairs Ramesh Singh Arora in his camp office.\nPolitical/Economic Chief Douglas Johnston, Political Specialist M Daim Fazil, Secretary HR Ali Bahadur Qazi and other persons were also present in the meeting. There was a detailed discussion on promoting interfaith harmony with the cooperation of both countries.\nThe provincial minister told the consul general that as soon as the government was established in Punjab, the protection of the rights of religious minorities was being ensured. “Punjab Chief Minister Maryam Nawaz Sharif went to Kartarpur and opened the Baisakhi festival. She also reached Maryamabad and distributed 10,000 Easter grants. Besides, on the instructions of the Chief Minister, cheques of educational scholarships have been distributed among minority students,” he added.\nHe said that by increasing the minority development fund in the budget, religious tourism would be promoted and religious places of worship would be constructed and repaired. He emphasized digital learning so that the young generation can also compete with developed countries in the field of IT.\n“It is desired that the quality of life of the people living in rural areas should also be improved. According to the vision of Chief Minister Maryam Nawaz Sharif, all Pakistanis living in Pakistan have equal rights and all enjoy religious freedom,” he added. Ramesh Singh said that they were ensuring the implementation of 5% quota in jobs and 2% in higher education for the youth of religious minorities while trying to allocate quota in medical and engineering colleges also.\nIn response to a question from the consul general, the provincial minister said that no major damage could be done due to the timely action of the police and law enforcement agencies in the incident that occurred in Sargodha, but civil society, religious leaders, etc needed to play their positive role in ensuring prevention of incidents like Jaranwala and Sargodha in future.\nFor this, several seminars and awareness schemes are being held  from the platform of the department so that  society can be made peaceful, he added.\nThe consul general appreciated the steps being taken by the Punjab government to promote peace and interfaith harmony and assured their full support in the future while Provincial Minister Ramesh Singh also presented a commemorative shield to the consul general on behalf of the department.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:05:41.353Z"
}
