{
  "title": "Climate Change conference: CJP emphasizes adoption of eco-friendly measures",
  "link": "https://www.app.com.pk/national/climate-change-conference-cjp-emphasizes-adoption-of-eco-friendly-measures/",
  "date_published": "2024-06-08T18:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): Chief Justice of Pakistan Qazi Faez Isa on Saturday emphasized the need for adopting environment friendly measures and a healthy lifestyle to cope with the prevailing climate-related challenges.\nThe Law & Justice Commission of Pakistan hosted a conference titled ‘Conference on Climate Change: Navigating Climate Governance: Executive Action and Judicial Oversight’ in the building of the Supreme Court of Pakistan. The Conference was graced by Chief Justice of Pakistan, Qazi Faez Isa and also attended by members of the Judiciary, diplomats, representatives of international organizations, lawyers, media and civil society.\nAddressing the conference the chief justice said that whenever we consult doctors, they advise us to stop smoking and do walk.\nHe said that a rise in the human body’s temperature indicates illness. Similarly, today earth is also facing ailment like a fever as it was absorbing a lot of smoke into it, he said. The chief justice highlighted that that plastic products were being manufactured across the world but we lacked a solid mechanism to dispose of it.\nThe CJP emphasized on returning to a healthy lifestyle which is close to nature, adding that every physician is now advising people to prefer eating vegetables instead of meat.\nThe earth is sick, ill and telling us its condition and on the other hand the world is emitting a lot of smoke, he said.\nChief Justice Qazi Faez Isa said that earth is a living organism but unfortunately it was not treated that way. The spiritual crisis is also the cause of climate crisis, he said, adding that wastage is a sin in the religion of Islam.\nHe said that we are depleting natural resources and diminishing ourselves. He emphasized to bring change in our behaviors to conserve environment by reducing reliance on fuel intensive for travels and activities. Science can guide mankind beyond horizons, the chief justice maintained.\nHe said that we need to walk. Bicycles can be provided to all judges if they want, suggested CJP.\nThe natural environment can be saved from further destruction by avoiding wastage of resources, he said.\nHe said that Pakistan has been facing severe impacts of climate change like devastating floods, flash droughts, scarcity of water resources and excessive heat despite the country’s total contribution to the global emissions being less than 1%.\nSC’s Senior Puisne Judge Justice Mansoor Ali Shah said that climate change deeply affecting our societies and marginalized communities. The Pakistan made global headlines after millions of people effected due to 2022 floods, which also caused a financial loss worth $15 billion.\nHe said that Pakistan fifth most vulnerable country due to climate change and Pakistan is a 15th most water stressed country. The 26 districts in Punjab have faced extreme heat waves and 15% increase water scarcity, he added.\nJustice Shah said that the climate change has increased health risk, induced migration and displacement. It also developed food and energy security in the region.\nHe said that climate change intricately linked to human rights , increases intensity and frequency of disaster and aggravates air quality and infectious diseases.\nMarginalized groups are having less access to healthcare facilities and also losing their family heritage which was irreplaceable, he said.\nHe said that it wants inclusive climate policies and ensure of rights and justice to the people. But it’s not possible without climate finance which is not an aid but the right to ensure climate resilience. The COP-28 also demanded parties to join funds to support developing nations for this, he said.\nIt demands executive and judiciary to come together to address multidisciplinary challenge that should be addressed by legislature, executive, judiciary to holistically assess the existential threat.\nSecretary Law and Justice Commission Riffat Inam Butt said that Pakistan is facing adverse effects of climate change. We as policy makers and legislators and civil society will have to come up with effective governance strategy. The climate disruptions could displace up-to 200 million people by 2030.\nGlacial Lake Outburst (GLOF) is forcing 3 million people from homes and numerous fatalities are demanding effective strategies, she said, adding that Climate change is not an environmental but human rights issue.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:05:18.029Z"
}
