{
  "title": "Chairperson BISP conducts surprise visit of payment campsite to check facilities",
  "link": "https://www.app.com.pk/national/chairperson-bisp-conducts-surprise-visit-of-payment-campsite-to-check-facilities/",
  "date_published": "2024-06-08T12:03:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 08 (APP): Chairperson Benazir Income Support Programme (BISP), Rubina Khalid, conducted an unannounced visit to the BISP Payment Campsite at Dhoke Kashmirian, Rawalpindi, to personally monitor the arrangements and payment process.\nDuring her visit, Rubina Khalid interacted with women beneficiaries who had come to receive their stipend under the Benazir Kafaalat initiative.\nShe took the opportunity to listen to their concerns, particularly about the slow payment process.\nRubina Khalid advised the beneficiaries to receive their full stipend amount of Rs. 10500 and always ask for the bank receipt upon receiving their payment.\nIn response to her findings during the surprise visit, the chairperson promptly convened a meeting with all Director Generals of BISP and representatives of the partner banks at the BISP Headquarters.\nDuring the meeting, Rubina Khalid reiterated the programme’s commitment to the well-being and convenience of its beneficiaries. “The well-being and convenience of our beneficiaries are our top priorities. The disbursement process must be smooth and efficient, allowing beneficiaries to receive their stipends without any unnecessary delays or complications,” she stated.\nRubina Khalid highlighted the importance of treating beneficiaries with respect and dignity throughout the stipend disbursement process. “We don’t want to put our beneficiaries in difficulties. They should be given stipend money with full respect and dignity,” she affirmed.\nExpressing serious concern over the absence of Point of Sale (POS) agents and the slow cash disbursement process at the payment campsites, the chairperson directed senior management to address these issues urgently with the partner banks.\nShe stressed the need for a swift resolution to ensure that BISP beneficiaries do not face any hardships during the disbursement process.",
  "retrievedAt": "2025-08-11T03:05:19.597Z"
}
