{
  "title": "Romina Khurshid Alam calls for global action to fight ocean pollution, address climate change impacts",
  "link": "https://www.app.com.pk/national/romina-khurshid-alam-calls-for-global-action-to-fight-ocean-pollution/",
  "date_published": "2024-06-08T12:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): Coordinator to the Prime Minister on Climate Change, MNA Romina Khurshid Alam said that as the world celebrates World Ocean Day, the present government has firmly reaffirmed its commitment to the global efforts for preserving and protecting marine ecosystems in the country and anywhere in the world.\nIn a press statement issued here on Saturday, MNA Romina Khurshid Alam said that this year’s theme, ” Catalyzing Action for Our Ocean & Climate,” very much resonates deeply with Pakistan’s coastal communities, whose lives and livelihoods are intricately connected with the health and sustainability of the oceans.\nShe said that as a coastal nation, Pakistan is committed to playing its part in advancing marine conservation efforts.\n“As a nation with a rich maritime heritage, we recognise the vital role that oceans play in supporting life on Earth, regulating our climate, and providing resources that sustain livelihoods,” Romina Khurshid Alam said.\nThe initiatives of Mangroves restoration in Pakistan has resulted in 300% increase of mangroves since 1992, which drew global appreciation for the government’s conservation efforts, the PM’s coordinator highlighted.\nThrough initiatives such as marine protected areas, community-based conservation projects such as national mangroves restoration initiative, and public awareness campaigns, the present government was striving to safeguard our oceans and promote their sustainable use, she highlighted.\nShe also said that the present government was very much aware of the national and global environmental and climate change-related challenges facing the oceans and efforts are being made to address marine pollution, promote sustainable fisheries management, and conserve marine biodiversity.\nPakistan is blessed with a resource-rich coastline of about 1,046 kilometers along the Arabia sea, which harbours a diverse array of marine life and ecosystems. From the bustling ports of Karachi to the tranquil shores of Gwadar, Pakistan’s coastal areas are not only vital hubs of economic activity but also rich reservoirs of unique biodiversity of global repute.\nThe PM’s coordinator said that pollution, overfishing, climate change, and habitat destruction threaten the delicate balance of marine ecosystems worldwide, jeopardising the well-being of millions of people who depend on the oceans for their sustenance and livelihoods.\n“Oceans globally are facing grave challenges, including pollution, overfishing, habitat destruction and the impacts of climate change. Besides, growing amount of plastic waste dumping in oceans is a major environmental threat to oceans’ sustainability,” Romina Khurshid Alam said\nHighlighting further the plight of rapidly pollution oceans around the world, mainly because of untamed dumping of plastic waste, Romina Khurshid Alam said that around 9.5 million tons of plastic waste is dumped into oceans worldwide, which poses risk to the fish and other oceanic biodiversity.\nShe, however, underlined the urgent need for collective action by all government and non-governmental stakeholders and communities to address the myriad challenges facing the country’s oceans.\n“We urge all nations to strengthen cooperation, implement effective policies, and adopt sustainable practices to ensure the health and resilience of marine ecosystems for present and future generations,” she said.\nRomina Khurshid also reaffirmed her government’s commitment to the the global efforts for preservation and sustainable use of our oceans.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:05:41.685Z"
}
