{
  "title": "SC maintains deaths sentence to Pervaiz Musharraf in high treason case",
  "link": "https://www.app.com.pk/national/sc-maintains-deaths-sentence-to-pervaiz-musharraf-in-high-treason-case/",
  "date_published": "2024-01-10T12:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): The Supreme Court of Pakistan on Wednesday maintained the death sentence of former president Pervaiz Mushraf while\nupholding the verdict of the special court in the high treason case.\nThe apex court said heirs of former president didn’t pursue the case despite the repeated notices, hence the appeal was dismissed. The apex court also turned down the verdict of Lahore High Court (LHC) in which it had terminated the special court.\nIt noted that the special court announced the sentence to Pervaiz Musharraft on December 17, 2019 and he filed appeal in SC on January 16, 2020.\nPetitioner’s lawyer Salman Safdar informed the court that former president passed away on February 5, 2023 and his appeal was fixed for hearing on November 10, 2023. The lawyer told the court that he had conveyed several messages to the family of ex-president to pursue the case but he received no response.\nThe court further said that it had served notices to the legal heirs of Pervaiz Musharraf at their available addresses in Pakistan and abroad. The notices were also published in the newspaper, it added.\nA four-member bench, headed by Chief Justice of Pakistan Qazi Faez Isa and comprising Justice Mansoor Ali Shah, Justice Amin ud Din Khan and Justice Athar Minallah, heard the case.\nIt may be mentioned that the LHC had terminated the special court after declaring it against the law.SC maintains deaths sentence to Pervaiz Musharraf in high treason caseISLAMABAD, Jan 10 (APP):The Supreme Court of Pakistan on Wednesday maintained the death sentence of former president Pervaiz Mushraf whileupholding the verdict of the special court in the high treason case. The apex court said heirs of former president didn’t pursue the case despite the repeated notices, hence the appeal was dismissed. The apex court also turned down the verdict of Lahore High Court (LHC) in which it had terminated the special court. It noted that the special court announced the sentence to Pervaiz Musharraft on December 17, 2019 and he filed appeal in SC on January 16, 2020.Petitioner’s lawyer Salman Safdar informed the court that former president passed away on February 5, 2023 and his appeal was fixed for hearing on November 10, 2023. The lawyer told the court that he had conveyed several messages to the family of ex-president to pursue the case but he received no response.The court further said that it had served notices to the legal heirs of Pervaiz Musharraf at their available addresses in Pakistan and abroad. The notices were also published in the newspaper, it added.A four-member bench, headed by Chief Justice of Pakistan Qazi Faez Isa and comprising Justice Mansoor Ali Shah, Justice Amin ud Din Khan and Justice Athar Minallah, heard the case.It may be mentioned that the LHC had terminated the special court after declaring it against the law.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:31:34.111Z"
}
