{
  "title": "Win-Win mindset crucial for effective climate change negotiations",
  "link": "https://www.app.com.pk/national/win-win-mindset-crucial-for-effective-climate-change-negotiations/",
  "date_published": "2024-01-10T17:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP):While the outcome of COP28 is being criticized, there is no good or bad COP for climate; what is important is applying the Win-Win mindset which is crucial for effective climate change negotiations, said Dr Abid Qaiyum Suleri, Executive Director, SDPI. He was speaking at seminar titled “SDPI’s Response To COP28:From Consensus To Realization” organized by SDPI here today, according to a press release.\nHe said that the commitment to transition away from fossil fuels is a yet welcome decision and hoped that the government of Azerbaijan will follow in the footsteps of the UAE government and will continue to build this momentum on fossil fuel transition ultimately leading to fossil fuel phase out. He said that this decision will open new avenues for investment, technology development, global stock take and greater global cooperation.\nHe said that world governments mobilized US$30 Trillion to combat COVID-19; the same spirit is needed to combat the climate pandemic too. Following individual personal interests might enable  countries to become climate smart but will not last long and only a Win-Win approach can be effective in the long-run.\nAmbassador of Azerbaijan to Pakistan, Mr. Khazar Farhadov addressing the session said that climate action cannot move forward without economic development which underlines the key role of the private sector in driving economic growth. This calls for the governments to develop policies in consultation with the private sector.\nShedding light on the impact of conflicts on the environment, he said that Azerbaijan aims for a clean environment realizing the grave environmental impact of conflicts experienced by Azerbaijan.\nHe informed that the government of Azerbaijan has termed 2024 “Green World Solidarity Year” and plans to increase the share of renewable energy by 30% and inhibit greenhouse gas inhibition to 35% by 2040 and  40% by 2050. He stressed that the country is ambitious to deliver on its national climate commitments and aims to strengthen multi-lateral partnerships and global cooperation which is also evident from the plans to export 4GW of renewable energy to Europe through the Black Sea.\nAmbassador Shafqat Kakakhel, Chairperson of BOG SDPI, said that COP28 succeeded in operationalizing the Loss and Damage Fund, and a total of US$800 million was pledged by countries as the baseline. COP28  also recognized that the global community had not delivered in any area including mitigation, adaptation, adoption of science and technology, and weak partnerships but the decision to transition away from fossil fuels is a big success.\nHe stressed that COP-29 will have to deal with new quantified financial goals and  must use the US$100 billion as the baseline and the ceiling must be escalated with more financial assistance flowing from developed to developing countries for effective and sustainable climate action.\nDr Shafqat Munir, Deputy Executive Director, Policy Outreach, SDPI said that financing for adaptation and disaster risk reduction cannot continue in silos anymore. He said that the outcome of COP depends on what negotiators want and not what academia, and developing countries’ experts suggest in a political economy context. He highlighted that while US$ 700-800 million has been committed for climate loss and damage fund, realistically developing countries require 290- 580 billion dollars. This huge gap can be bridged through an adequate increase in global funding and nationally generated resources.\nSyed Qasim Shah, Deputy Executive Director, SDPI said that 36% of emissions arise from the dairy sector alone,\nand delivering on the Global Methane Pledge without an elaborately designed plan is not possible. A\ncritical reality is that 40% population in Pakistan is insecure 12% is severely insecure and small farmers are already financially burdened with adopting new technologies to adapt to climate change.\nHe stressed that technology transfer and global financial cooperation remain in this aspect.  Dr Khalid Waleed, Research Fellow SDPI, said that in terms of diversity and inclusivity, the COP28 can be  regarded as a brilliant success. However, in the context of transitioning away from fossil fuels met with mixed\nHe suggested that Pakistan should consider signing the Hydrogen pledge as Pakistan’s IGCEP 2023, VRE share will be more than triple by 2030 and National Energy Efficiency and Conservation  Authority is also working on Energy efficiency measures as well. These pledges will enhance the capacity  and bring more investment in Pakistan.\nZainab Naeem, Associate Research Fellow stressed that developing the mechanism for funds transfer and pressure to meet conditionalities must be alleviated considering developing countries’ GHG share and financial constraints. She urged the public sector to present a comprehensive roadmap for the  private sector to increase the flow of investments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:31:16.998Z"
}
