{
  "title": "Cabinet approves reconstitution of committee on missing persons",
  "link": "https://www.app.com.pk/national/cabinet-approves-reconstitution-of-committee-on-missing-persons/",
  "date_published": "2024-01-10T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP):The Federal Cabinet on Wednesday approved the reconstitution of its committee on missing persons headed by the law minister.\nThe reconstitution is being done on the recommendation of the Ministry of Interior. The position became vacant after the resignation of the previous head of the committee, Sarfraz Bugti.\nThe cabinet meeting, chaired by Caretaker Prime Minister Anwaar-ul-Haq Kakar, also approved reguralisation of 227 daily-wage teachers as proposed by the Federal Directorate of Education and recommended by the Federal Public Service Commission in line with the Islamabad High Court’s decision of 2018.\nFor the construction of the Supreme Court Karachi Registry building, the cabinet on the recommendation of Ministry of Law and Justice as endorsed by the Supreme Court Building Committee, approved the transfer of federal courts and tribunals across the city.\nIt approved the summary regarding the operationalization of the Livestock and Dairy Development Board so as to fulfill the legal requirements for the appointment of chief executive, in line with the decisions of the Islamabad and Balochistan high courts.\nThe cabinet gave in principle approval to the Cannabis Control and Regulatory Authority Ordinance 2024 and forwarded it to the Cabinet Committee for Legislative Cases.\nUnder the authority, necessary guidelines would be formulated for the cultivation, extraction, refining, and medicinal and industrial use.\nPM Kakar vowed to continue the anti-polio mission of the government till the complete eradication of the crippling disease.\nThe meeting offered Fateha for the security officials protecting the polio eradication team who were martyred in a terrorist incident in Bajaur.\nThe prime minister paid tribute to the martyred personnel and said the State would not forget their invaluable sacrifice for the homeland.\nHe said the officials sacrificed their lives for the safety of future generations.\nHe said the terrorists could not deter the resolve of the nation to fight polio.\nThe cabinet approved the decisions of the Economic Coordination Committee taken during the meetings held on 13th, 15th and 20th December, 2023.\nThe cabinet gave approval to the decisions taken by the Cabinet Committee on State Owned Enterprises on 28th December, 2023.\nIt approved the decisions taken by the Cabinet Committee on Legislative Cases in a meeting held on 22nd December, 2023.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:31:42.113Z"
}
