{
  "title": "PMD forecasts minimum temperature of 10°C for Karachi in coming days",
  "link": "https://www.app.com.pk/national/pmd-forecasts-minimum-temperature-of-10c-for-karachi-in-coming-days/",
  "date_published": "2024-01-10T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): Karachi may experience coldest night of the winter as Pakistan Meteorological Department (PMD) on Wednesday forecast minimum temperature of 10°C in coming days.\nChief Meteorologist Sardar Sarfaraz, speaking to a private news channel revealed that the minimum temperature recorded this winter season was 11.5°C in December. However, residents could experience even colder weather in the next three to four days, with a minimum temperature reaching 10°C.\nComparatively, last year’s chilling January 14 saw temperatures plummet to 6°C in the port city, he said.\nSarfaraz further emphasized that this cold spell is expected to linger for the next two to three weeks.\nThe current humidity level stands at 60%, and the winds blowing from the northeast are measured at a gentle 3 kilometers per hour, he mentioned.\nDespite the current cold snap, the chief meteorologist noted that this winter has not been as frigid as in previous years. However, he urged residents to be prepared for the upcoming drop in temperatures.\nIn a global context, the chief meteorologist referred to a recent report by the EU’s climate service, highlighting that the year 2023 has officially claimed the title of the hottest on record.\nThe report indicated an unprecedented temperature increase of approximately 1.48°C, attributing it to human-induced climate change and the influence of the El Niño weather phenomenon.\nThe report detailed that from July onwards, nearly every day set new global air temperature records, establishing an exceptional and prolonged spell of warmth. As Karachi faces colder temperatures, the global climate continues to grapple with the consequences of rising temperatures and climate change.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:32:05.507Z"
}
