{
  "title": "NCOC stresses for wearing of masks mandatory to prevent COVID-19",
  "link": "https://www.app.com.pk/national/ncoc-stresses-for-wearing-of-masks-mandatory-to-prevent-covid-19/",
  "date_published": "2020-10-13T10:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): National Command and Operation Centre (NCOC) Tuesday stressed for declaring wearing of masks mandatory in public gatherings like other countries to bound public for adhering to COVID-19 related SOPs.\nThe Forum also suggested for imposing fines on masses to ensure wearing of masks in public gatherings and keeping social distance to avoid contracting novel Coronavirus.\nThe meeting presided over by Federal Minister for Planning, Development and Special Initiatives and Chairman NCOC Asad Umar, was also attended by the National Coordinator NCOC, Special Assistant to Prime Minister on Health Dr Faisal Sultan, Minister for Interior Syed Ejaz Shah, Minister for Religious Affairs Noor ul Haq Qadri, while the Chief secretaries of provinces also participated through video link.\nDuring the meeting, the participants reviewed the overall situation of novel outbreak in the country, measures taken to prevent people from it and suggestions for further improvement.\nDuring the meeting, it was agreed that we should emphasized in compliance of SOPs specially wearing of masks and media should be engaged in that regard.\nThe Forum was apprised that 3497 smart lockdowns have been imposed in 103 Districts across Pakistan. It was also told that 52% corona tests were being done due to pro-active strategy of Trace, Test and Quarantine(TTQ) strategy.\nAsad Umar said that actions have consequences and so far we as a nation in cooperation with all stake holders have taken right steps which helped us in saving precious lives and contain disease spread.\nAsad further told that people’s proactive response had been the key point so far in successfully preventing from COVID-19. The people of Pakistan had shown great maturity and responsibility to not only protect themselves but following guidelines to ensure other’s safety and wellbeing, he added.\nFederal Minister Asad Umar paid great tribute to Media for their effective messaging for behavior change and help in reaching out to the masses. People of Pakistan and media were two important pillars which made the entire effort a success, he lauded.\nAsad Umar said that Risk mitigation is important to check possibly second wave of corona in country.\nHe emphasized that in light of NCC meeting yesterday, there was need to ensure safety measures including wearing of face mask and following health guidelines.\nChief secretary Sindh apprised the forum that we were monitoring education and marriage halls and administrative measures will be ensured in line of health guidelines issued by NCOC.\nWhile Chief secretary KP told the forum that we had taken administrative measures against certain restaurants and marriage halls for violations of COVID protocols.\nIn his talk, Chief secretary Balochistan apprised the forum that due to following NCOC TTQ strategy there was positive improvement in pandemic cases in Balochistan.",
  "retrievedAt": "2025-08-11T19:53:47.892Z"
}
