{
  "title": "New Delhi’s policies towards Kashmir have made talks impossible: Dr Moeed",
  "link": "https://www.app.com.pk/national/pakistan-stands-for-peace-kashmiris-principal-party-in-any-dialogue-dr-moeed-2/",
  "date_published": "2020-10-13T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP):  Special Assistant to the Prime Minister (SAPM) on National Security Dr Moeed Yusuf  Tuesday said Pakistan stood firmly for peace in the region through dialogue but New Delhi’s draconian policies towards Kashmiris had made talks impossible.\nIn the first interview by a senior Pakistani official to an Indian news outlet since India’s unilateral and illegal actions on 5th August 2019, he reiterated Prime Minister Imran Khan’s stance that if India took one step forward, Pakistan would take two steps forward, said a press release.\nHe outlined pre-conditions necessary for any dialogue and said New Delhi must release all political prisoners in Indian Illegally Occupied Jammu and Kashmir (IIOJK), lift the military siege, reverse the domicile bill and stop all human rights violations against Kashmiris before any dialogue could begin.\nNew Delhi must release all political prisoners in Indian Illegally Occupied Jammu and Kashmir (IIOJK)\nSpeaking to spoke with India’s renowned journalist Karan Thapar, he reminded Indian audiences that today, even pro-India Kashmiri politicians have publicly admitted that no one in IIOJK was willing to live under Indian occupation anymore.\nDr Yusuf emphasized that Kashmiris remain the principal party in the dispute according to Pakistan and their wishes and aspirations should be addressed in any dialogue.\nI appeared on @thewire_in to talk about peace in the region. Exposed previously unrevealed information about regular Indian state sponsorship of terrorism against Pakistan and laid out clear conditions for forward movement centered on the Kashmiri people. https://t.co/WzFuXydGzy\n— Moeed W. Yusuf (@YusufMoeed) October 13, 2020\nDrawing a contrast between Pakistan and India, Dr Yusuf said Prime Minister Imran Khan’s government was dedicated to pursuing economic security and connectivity for the prosperity of Pakistan and the region, but policy makers in New Delhi remained blind sighted by Hindutva ideology.\nlift the military siege\nHe said India had lost the neighbourhood because of the expansionist policies of the BJP government, while Pakistan was pursuing peace in its neighbourhood.\nResponding to Indian allegations about terrorism, Dr Yusuf said Pakistan had facilitated investigations in all cases pending in courts but India was delaying the investigations by not providing evidence in the case.\nHe said not finding a resolution to terror cases helped India in its false narrative of terrorism.\nstop all human rights violations against Kashmiris\nDr Yusuf called out India for being unable to bring the perpetrators of the Samjhuta and Babri Masjid cases, Malegaon blast case and others to justice while it accused Pakistan of delays which spoke to double standards.\nTaking an aggressive approach towards Indian sponsored terrorism in Pakistan, the SAPM on National Security revealed new details about millions of dollars in payments made to Tehrik-i-Taliban Pakistan (TTP) leadership by the Research and Analysis Wing (RAW)officer through Indian embassy funds.\nHe said Pakistan knew the names and ranks of officers in touch with terror leadership and would soon reveal Indian activities to the world through a detailed dossier based on lengthy investigations.\nHe also revealed that India had financed anti-Pakistan terrorist groups and supported their merger with the TTP earlier this year.\nIndia had financed anti-Pakistan terrorist groups and supported their merger with the TTP\nFor the first time, Dr Yusuf also blamed India for sponsoring the heinous Army Public School (APS) attack in which over 100 innocent children lost their lives, saying that Pakistan had record of eight phone calls made from India to TTP commander before the attack.\nHe said Indian intelligence handlers based in a neighbouring country had directed the attacks on the Chinese consulate in Karachi, Pearl Continental Hotel in Gwadar and Pakistan Stock Exchange attack in the last two years.\nHe also revealed how Balochistan Liberation Army terrorists were receiving treatment in a hospital in New Delhi.\nBalochistan Liberation Army terrorists were receiving treatment in a hospital in New Delhi\nKashmiris Principal Party\nDebunking latest propaganda by India on Gilgit Baltistan and Kashmir issue, Dr Yusuf said Pakistan stood by United Nations Security Council resolutions as the way forward for resolving the dispute and fulfilling the aspirations of over eight million Kashmiris.\nHe said Indian propaganda would not shake the principled stance of Pakistan on the Kashmir issue.\nPakistan stands for peace and would welcome any dialogue with India if the lives of Kashmiris in IIOJK were normalized\nThe SAPM said Prime Minister Imran Khan had directed his office to open space for the government in the region and find solutions to lingering problems, but his counterpart in India was pursuing an opposite direction.\nHe highlighted that Pakistan stands for peace and would welcome any dialogue with India if the lives of Kashmiris in IIOJK were normalized, Kashmiris were recognized as the rightful principal party in any dialogue, and India stopped sponsoring terrorism against Pakistan.\nHe also pointed to Pakistan’s response on February 27, 2019 and warned that any misadventure from India would result in an equally swift response from Pakistan.\nany misadventure from India would result in an equally swift response from Pakista",
  "retrievedAt": "2025-08-11T19:53:46.071Z"
}
