{
  "title": "NCOC issues fresh COVID-19 guidelines about public gatherings",
  "link": "https://www.app.com.pk/national/ncoc-issues-fresh-covid-19-guidelines-about-public-gatherings/",
  "date_published": "2020-10-13T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP):The National Command and Operation Centre (NCOC) Monday issued fresh guidelines related to all types of public gatherings keeping in view the prevalence of COVID-19 and its potential to spread.\nAccording to the NCOC, the corona prevention guidelines on public gatherings less marriages and sports had been prepared with input from the provinces.\n“The public gathering covers the situation when people are assembled on any given space, indoor or outdoor, for some purpose such as cultural events, religious gatherings, sports events, entertainment or cultural events, parties, political gatherings or other similar events,” the NCOC said.\nIt added the types of public gatherings were entertainment or cultural gatherings, public gatherings of unions or associations or any such group, religious gatherings, political gatherings, family gatherings and civil society group gatherings.\nThe NCOc said separate standard operating procedures (SOPs) were being issued for sports related gatherings while marriage being frequent and obligatory activity had been excluded. A separate SOP comprising strict restrictions had already been issued.\nIt said public gatherings should be discouraged in view of their potential to become super spreaders and preferably no public gathering be held except those related to economic activity.\nIf holding of public gatherings was unavoidable, then the same should be held in well-defined venues which facilitate enforcement of SOPs, it added.\nAccording to the SOPs for indoor events, maximum participation would be 500 persons or 50% of capacity whichever was less, duration of the event or activity should not exceed three hours and all persons would be seated and there would be no standing participation while inter chair distance would be minimum three feet or more.\nSimilarly, for outdoor events the main focus would be on entry or exit control, density control, social distancing with the SOPs, including all persons would be seated and there would be no standing participation while inter chair distance would be minimum three feet or more, the duration of the event or activity should not exceed three hours while rallies, walks or gatherings on the roads, streets and other ill-defined places should be avoided.\nIt added organizers would be responsible for ensuring compliance of the SOPs, particularly masks, social distancing and provision of COVID safety kit like a mask and a mini hand sanitizer to each person.\nThe NCOC said no public gatherings would be held in cities where positivity ratio was consistently higher and was within second slab (6-9%) or above as laid down in instructions “Quantified Triggers and Corresponding NPIs” already issued.\nIt said the children and elderly should be discouraged to participate while the people with COVID or respiratory illness related symptoms must not be allowed to attend. Individuals with comorbidities such as chronic illnesses including diabetes, high blood pressure or heart disease would not be allowed to participate.\nIt said there would be no attendance without mask, no handshake or hugging. It added no meals or light refreshment should be allowed in any type of gathering, drinking water facilities should be dispersed at multiple locations to avoid crowding and preferably water bottles should be provided to the participants, otherwise disposable glasses should be used.\nIt said that anti COVID awareness board or banners at the venues would be displayed by organizers and there would be periodic announcements for masks, social distance and other SOPs through sound system during conduct of the event by the organizers.",
  "retrievedAt": "2025-08-11T19:53:41.755Z"
}
