{
  "title": "Govt to pay special focus to educational uplift of Balochistan: Minister",
  "link": "https://www.app.com.pk/national/govt-to-pay-special-focus-to-educational-uplift-of-balochistan-minister/",
  "date_published": "2022-06-02T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 02 (APP): Federal Minister for Science and Technology Agha Hassan Baloch Thursday reiterated the present government’s resolve to raise the living standard of the underprivileged people in the country with special emphasis on educational development of the people of Balochistan.\nThe minister was speaking in a meeting with the Governor Balochistan, Jan Muhammad Jamali, who called on the former.\nMinister of State for Energy and Power Division, Muhammad Hashim Notezai was also present at the meeting.\nThe meeting discussed the issues related to developmental projects in the province.\nIt was stressed upon utilizing the potential of youth in Balochistan province through means of modern education and skills development for the prosperity of the country.\nGovernor Balochistan raised the long-pending issue of COMSATS University land in Jaffarabad Balochistan.The federal minister reassured that three new campuses of COMSATS University at Quetta, Jaffar Abad and Gwadar, already approved, would be established on a priority basis to provide the state of art higher education facilities and uplift the standard of education in the field of science and technology.\nThe federal minister said that soon Pakistan Science Foundation will announce scholarships for the bright students of Balochistan to excel in different fields of life.\nCrash vocational training programs will be initiated in different divisions of the province and foreign training programs would also be part of this initiative to empower the people and maximize the employment opportunities, he added.\nGovernor Balochistan appreciated the Federal Government’s initiatives and support for the province.",
  "retrievedAt": "2025-08-11T15:00:53.389Z"
}
