{
  "title": "Govt taking steps to improve performance of Pak Railways: Senate informed",
  "link": "https://www.app.com.pk/national/govt-taking-steps-to-improve-performance-of-pak-railways-senate-informed/",
  "date_published": "2022-06-02T07:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 02 (APP):Minister of State for Law and Justice Malik Shahadat Awan on Thursday informed the Senate that government is taking steps to improve the performance of Pakistan Railways (PR) and would provide maximum facilities to the people.\nReplying to supplementary questions during Questions Hour in Senate, he expressed the hope that there would be an outstanding performance of railways in future, adding that the last three years performance of PR was in front of us as number of tragic accidents took place.\nAwan said that ministry had purchased 20 locomotives in 2017, adding that at present all the DE locomotives are in working condition.“The reliability and availability of this particular fleet has mostly remained above 95 percent against the bench marck of 85% “, he added.\nShahadat Awan said that the Railways infrastructure in Balochistan is being maintained as per available resources in order to provide safe and secure travel to the passengers.\nMinister of State said that Railway Track in Balochistan consists of Sibi Quetta-Chaman, Spezand-Taftan and Sibi-Hurnai and some portion of Jacobabad Sibi Section.\nHe said that improvement of passengers’ amenities has been carried out by providing wash room, drinking water and renovation of waiting rooms at various station buildings.\nIn addition, Shahadat Awan said that ten stations’ buildings have been renovated and rehabilitated on Sibi Harnai-Khc section, alongwith repair of 25 bridges.\nMeanwhile, Federal Minister for Parliamentary Affairs Murtaza Javed Abbasi said that the contract of rehabilitation of track between Sama Satta-Bahawalnagar on Sama Satta-Amruka section has been awarded to M/s FWO, adding that the contract agreement was signed on March 19, 2021.\nHe said that the total cost of contract of rehabilitation of track between Sama Satta- Bahawalnagar awarded to FWO is Rs.7735.000 million.\nHe said that the government would work on the proposal under consideration of the government to up-grade and rehabilitate Narowal-Kartarpur railaway track.",
  "retrievedAt": "2025-08-11T15:00:57.188Z"
}
