{
  "title": "LG polls in Islamabad on July 31",
  "link": "https://www.app.com.pk/national/lg-polls-in-islamabad-on-july-31/",
  "date_published": "2022-06-02T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 2 (APP): The Election Commission of Pakistan (ECP) on Thursday issued schedule for the local government elections (LG) in Islamabad stating that balloting in the federal capital would be held on July 31.\nAccording to a notification issued by the ECP, the nomination papers would be filed with the returning officers concerned from June 13 to June 16.\nThe names of the candidates would be published on June 17.\nThe scrutiny of the nomination papers would be carried out from June 20 to 22, followed by filing of appeals against acceptance or rejection of nomination papers from June 23 to 25.\nLikewise, appeals would be disposed of by June 29, while revised list of candidates would be published on June 30.\nThe intending candidates would have the option to withdraw their nomination papers on July 01. Last date for withdrawal of candidature and publication of revised list of\ncandidates would be July 01.\nElection symbols would be allotted to contesting candidates and publication of list of contesting candidates would be July 02. Polling would be held on July 31, while the results would be consolidated ?on August 05.\nIn further guidelines to ensure the elections were held fairly and honestly and to ensure that corrupt practices were prevented, the ECP barred executive authorities from announcing development projects or using state resources to influence polls in favour of a candidate.\nIt warned that any government official who misused their position to influence the elections would be proceeded against under the law.\nThe ECP also barred transfers and postings of government officers or granting them leaves in divisions for which the election schedule had been issued without the commission’s prior approval.",
  "retrievedAt": "2025-08-11T15:00:47.170Z"
}
