{
  "title": "Amin says, Ministry launches three more projects to connect 6 districts of Sindh to digital world",
  "link": "https://www.app.com.pk/national/amin-says-ministry-launches-three-more-projects-to-connect-6-districts-of-sindh-to-digital-world/",
  "date_published": "2022-06-02T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 2 (APP): Federal Minister for Information Technology and Telecommunications (MOITT) Syed Amin-Ul-Haque on Thursday launched three more projects worth Rs. 5 billion for 6 districts of Sindh to connect the people of Sindh to the digital world.\nThe agreement in this regard was signed by Haaris Mahmood Chaudhry, Ministry of IT and President and Group CEO, PTCL and Ufone, Hatem Bamatraf.\nThe signing ceremony was also attended by Sindh Chief Minister Syed Murad Ali Shah and Federal Minister for IT and Telecom Syed Amin-Ul-Haque, Chief Secretary Sindh Dr Muhammad Suhail Rajput, Secretary IT and Chairman USF Board, Mohsin Mushtaq and senior officials and diplomats, said a news release issued here.\nAddressing the event, the Chief Minister of Sindh Syed Murad Ali Shah said that there was a time when technological advancements and economic conditions in some parts of the country were at a very crucial stage, and they had hampered the daily lives of millions of people in the country.\nHe said that to overcome all these challenges and in line with the vision of Digital Pakistan, the Ministry of Information Technology (IT) and Telecommunication through Universal Service Fund (USF) was running diverse projects which were playing a huge role in the socio-economic development of the people.\nIn his address, Federal Minister for IT and Telecommunications Syed Amin-Ul-Haque said that USF was awarding the contracts to lay OFC in un-underserved districts of Dadu, Jamshoro, Larkana, Kambar ShahdadKot, Hyderabad and Badin in Sindh.\nThese projects, worth over Rs. 5 billion, will connect a total of 207 towns and Union Councils (UCs) through 2,192 km of OFC, benefiting a population of 4.2 million residents in these areas, he said and added, this will play a huge role in the socio-economic well-being of the people by providing them with e-suite services in all sorts of life, he added.\nSyed Amin-Ul-Haque further said that the Ministry of IT and Telecommunication through USF aimed to connect all the citizens of the country as digitalization had become a priority for businesses and communities. Under its Next Generation Optic Fiber (NG-OF) Network and Services program, USF has contracted over 16,000 km of Optic Fiber Cable (OFC) to benefit 31.5 million populations across the country, he expressed.\nThe Minister said that by providing access to information and e-suite services, such as e-healthcare, e-finance, e-agriculture and e-education, the ministry was enabling the rural and remote communities of the country to compete better and support the economic development to bring a positive impact on the Gross Domestic Product (GDP) of the country by contributing to the United Nations (UN) Sustainable Development Goals (SDGs).\nReferring to the current political situation in the country, the Minister said that MQM stayed with PTI for 3 years and 7 months and during this time, his party tried its best to identify the wrongdoings of the government and provide full support to good decisions.\nHe said that during this period, the MQM and its people were called sophisticated and dignified, but with the secession from the government on March 30, MQM was suddenly declared terrorists and traitors.\nOn the occasion, President, Group CEO, PTCL and Ufone, Hatem Bamatraf said, “PTCL, being a national company, continues to serve as the backbone of connectivity in Pakistan.\nIn an effort to play our vital role in providing uninterrupted and quality communication services in far-flung areas of the country, we have once again collaborated with Universal Service Fund, we are committed to supporting the under served communities by empowering them for a better future”.\nEarlier in his welcome address, CEO of Universal Service Fund (USF) Haaris Mahmood Choudhry highlight the details of the projects and said, the USF is spreading the benefits of the Information and Communication Technologies (ICTs) to all corners of Pakistan. USF strives to provide IT and Telecommunication services in un-underserved areas of Pakistan to bridge the digital divide in line with the vision of Digital Pakistan, he added.",
  "retrievedAt": "2025-08-11T15:00:55.036Z"
}
