{
  "title": "Week-long-polio immunization drive concludes",
  "link": "https://www.app.com.pk/national/week-long-polio-immunization-drive-concludes/",
  "date_published": "2022-06-02T10:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 02 (APP): A week-long national immunization drive against polio concluded on Thursday during which over 43 million children under the age of five years received lifesaving vaccines across the country.\nThe campaign was synchronized with Afghanistan so that children on both sides of the border received vaccines at the same time and are protected from polio.\nOver 340,000 trained and dedicated polio workers were engaged in the vaccination drive to inoculate the children at their doorstep. A supplementary dose of Vitamin A was also administered to the eligible children.\nDr Shahzad Baig, Coordinator of the National Emergency Operations Centre, Polio Eradication Initiative (PEI), expressed satisfaction over the successful conclusion of the immunization campaign.\n“Pakistan has made enormous progress over the last 18 months, but we need to drive even harder to achieve the results we want. We need to ensure all eligible children are vaccinated during each campaign to build their immunity against polio,” Dr Baig said.\nHe said that the programme has intensified its efforts to address challenges related to vaccine hesitancy, community engagement and service delivery, to counter the long-standing issues following the emergence of new polio cases in South KP.\nThere have been six cases reported in North Waziristan recently after a gap of 15 months. The programme has taken various initiatives to reduce the risk of virus transmission, focusing on specific geographical areas.\nVaccination of children in various transit points for children on the move with their families strengthens further.\nThe Sehat Tahhafuz Helpline 1166 and 24/7 WhatsApp Helpline 0346-777-65-46 assisted parents and caregivers in reporting missed children and responding to queries on immunization. The repeated polio vaccination campaigns are imperative for building immunity among children and preventing possible death or lifelong paralysis.",
  "retrievedAt": "2025-08-11T15:00:54.565Z"
}
