{
  "title": "Pakistan-born artist Shazia Sikander wins Fukuoka’s Arts and Culture Prize 2022",
  "link": "https://www.app.com.pk/national/pakistan-born-artist-shazia-sikander-wins-fukuokas-arts-and-culture-prize-2022/",
  "date_published": "2022-06-02T11:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 2 (APP): Shazia Sikander, a Pakistan-born miniature artist, has won Fukuoka Prize in Arts and Culture for introducing innovation in the traditional art forms using the latest digital technology of miniature painting, which follows conventions dating back to the Mughal Empire.\nAccording to a press release issued here on Thursday by the Embassy of Japan in Islamabad, Japan’s Fukuoka Prize Committee announced the Fukuoka Prize 2022.\nFukuoka Prize is awarded in three categories: Grand Prize, Academic Prize, and Arts and Culture Prize. Besides, Shazia Sikander, this year’s Prize laureates include Japanese Taiko Drummer Hayashi Eitetsu for Grand Prize and Historian Prof. Timon Screech from the U.K for Academic Prize.\nIn September this year, the laureates will officially be invited to Fukuoka, Japan, to receive their respective awards.\nThere were three Pakistani recipients of the Fukuoka Prize in the past. Late Nusrat Fateh Ali Khan, the legendary qawwali maestro, Dr Uxi Mufti, a specialist in preserving folk heritage; and Yasmeen Lari, architect, architectural historian, and heritage conservationist.\nBorn in Lahore, Shahzia Sikander earned her Bachelor of Fine Arts degree in 1991 from the National College of Arts (NCA) in Lahore. She was awarded “Tamgha-e-Imtiaz” (Medal of Excellence) by the Pakistani government in 2005 in recognition of her outstanding contribution in the field of arts. She now lives in New York.\nFukuoka Prize was established in 1990 by Japanese Fukuoka city and Fukuoka City International Foundation and is given to individuals, groups or organizations for their splendid work in preserving Asian culture.\nThe prize aims to increase awareness of Asian cultures and institute a broad framework for exchange and mutual learning among the peoples of Asia. This year marks the 32nd anniversary of the inception of the Fukuoka Prize. Over the last 31 years, the prize has been presented to 118 leading figures in their respective fields.",
  "retrievedAt": "2025-08-11T15:00:53.957Z"
}
