{
  "title": "India forcing Kashmiri Pandits to migrate to pave way for Muslims’ genocide",
  "link": "https://www.app.com.pk/national/india-forcing-kashmiri-pandits-to-migrate-to-pave-way-for-muslims-genocide/",
  "date_published": "2022-06-02T13:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 2 (APP): The Indian government, like it did in the decade of 1990s, was again forcing the Kashmiri Pandits to migrate from the Indian Illegally Occupied Jammu and Kashmir (IIOJK), and the blame for this migration was once again being put on Pakistan and the Kashmiri freedom lovers.\nAccording to credible information reaching here, after getting the occupied valley free from Hindu Pandits, a plan of Muslims’ genocide would be implemented.\nThe plan was aimed at trying to artificially alter the demography of Muslim population in the occupied valley.\nThe Indian government was implementing a plan to settle the Pandits at separate colonies on Israeli pattern. However, the Kashmiri Pandit community was protesting over the BJP government’s discriminatory treatment.\nWith Kashmiri Pandits already unsatisfied over failure of fulfilling the promise of providing security and the poor law and order situation in the valley, efforts were also being made by the Indian government to create hatred between the Kashmiri Pandits and Muslims.\nAccording to the information, the talks of atrocities on Hindu Pandits in IIOJK were nothing but mere lies and propaganda.\nSince the civilians were never ever targetted in the Kashmiri freedom struggle, the claim of targeting Pandits was also incorrect.\nIndia has been portraying since decades the Kashmiris’ freedom struggle as terrorism.\nUnder a planned strategy, India through buying some people in IIOJK promoted them as militant organizations and defamed the original freedom struggles.\nHurriyat leadership, which never forced the Kashmiri Pandits to leave IIOJK, was even today ready to take responsibility of protecting Hindu Pandits.\nMuslims, who were in favour of the Kashmiri Pandits’ presence in IIOJK, also wanted their participation in the Kashmiris’ self-determination.\nThe illegal Indian act of August 5, 2019 not only made the life of Kashmiris miserable but also turned the whole region into destabilization and unrest.\nAccording to the information, contrary to Indian claims that the situation in IIOJK was returning to normalcy was, in reality, a rhetoric and lie for the outside world. The real situation in IIOJK was altogether different.",
  "retrievedAt": "2025-08-11T15:00:52.113Z"
}
