{
  "title": "Palestine part of Pakistan’s DNA; Mushahid tells Istanbul Int’l Conference",
  "link": "https://www.app.com.pk/national/palestine-part-of-pakistans-dna-mushahid-tells-istanbul-intl-conference/",
  "date_published": "2024-04-27T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP): Senator Mushahid Hussain Sayed on Saturday said that Palestine was part of Pakistani DNA whereas Palestinians resistance to brutal occupation was fully justified under international law and the UN Charter.\nHe was addressing the three-day Istanbul International Conference, inaugurated by President Erdogan and being attended by parliamentarians and political leaders from 80 countries, a news release said on Saturday.\nMushahid Hussain, who is member of the 12-member Executive Board of Parliamentarians for Palestine and Al Quds, said the entire people and political parties of Pakistan support the just cause of Palestine, as Pakistan’s policy on Palestine was first enunciated by the Father of the Nation, Quaid e Azam Muhammad Ali Jinnah, even before the independence of Pakistan’.\nCondemning the Gaza conflict, Mushahid termed it the ‘first live televised genocide in modern history’, adding that ‘both Muslim regimes and West countries have let down the Palestinians, except for public opinion in Muslim and Western countries’.\nGiving Pakistan’s track record of supporting Palestine, Mushahid Hussain referred to Pakistan being the only non-Arab country to take part in two Arab-Israeli Wars in 1967 and 1973, plus first recognition of PLO under Yasser Arafat took place at the Lahore Islamic Summit in 1974.\nMushahid urged an immediate ceasefire and steps to establish an independent Palestine with Jerusalem as its capital. The Pakistan Parliamentary Delegation attending the conference includes Senator Mushtaq Ahmed, MNAs Sheryar Meher, Chaudhry Shahbaz and Junaid Akbar. The Pakistani delegates also met President Erdogan and Speaker of Turkish Parliament, Dr Noman Kurtulmus.",
  "retrievedAt": "2025-08-11T02:09:07.278Z"
}
