{
  "title": "Mohsin Naqvi directs new IG Islamabad to wipe out crime from capital",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-directs-new-ig-islamabad-to-wipe-out-crime-from-capital/",
  "date_published": "2024-04-27T08:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP): Federal Minister for Interior Mohsin Naqvi on Saturday directed the new Inspector General of Police Islamabad to improve law and order situation and crackdown against criminals in the capital.\nIn a high level meeting here, Mohsin Naqvi assigned a task to the police officials to conduct a strong crackdown against the gangs involved in the sale and purchase of drugs and apprehend also the drug mafia with the use of modern technology.\nHe said that drug paddlers are the enemies of the future of Pakistan and thus strictest action be taken against them while the surveillance outside educational institutions also be increased to stop the sale of intoxicants including ice and arrest the sellers.\nThe new Inspector General of Police Ali Nasir Rizvi gave a detailed briefing to the minister interior about the law and order situation in the meeting which was also attended by all DIGs and CTOs.\nThe minister ordered to ensure foolproof security of foreign nationals living in Islamabad and to establish a special protection force for the security of foreign nationals in Islamabad while special attention should be given to the security of all important offices and places including the red zone and diplomatic enclave, he added.\nHe also ordered an effective action against beggar mafia and professional beggars in the city roaming freely in the city.\nThe minister asked the police to ensure 100% registration of First Information Report (FIR) on the complaints of citizens while using delaying tactics or denying registration of FIR will initiate an action against concerned police station and SHO, he warned.\nThe minister also directed IG police to immediately deal with promotion cases of capital Police saying that the promotion is the employee’s right that he should get on time because promotion will improve morale of police force.\nThe minster ensured the police officials that the steps will be taken to bring the salaries of Islamabad Police at par with the Punjab Police while ordered to fill the vacant posts in Islamabad police through fair rand competitive recruitment process.\nThe minister also sought a comprehensive plan to solve the traffic problems in Islamabad while identifying areas of high traffic congestion and suggesting workable solutions, adding that Islamabad Safe City system will have to be equipped with modern requirements like Lahore Safe City.\nHe said that the government is determined to improve the condition of police stations in Islamabad and good results will be obtained in a few months’ time.",
  "retrievedAt": "2025-08-11T02:09:09.012Z"
}
