{
  "title": "ICCI to launch comprehensive dengue awareness campaign",
  "author": null,
  "content": "ISLAMABAD, Jun 05 (APP):President of Islamabad Chamber of Commerce and Industry (ICCI), Nasir Mansoor Qureshi, has emphasized that dengue prevention is a shared responsibility and affirmed ICCI’s commitment to facilitating awareness campaigns and anti-dengue spraying operations across major commercial and industrial areas of the capital in coordination with relevant stakeholders.\nHe made these remarks while addressing a largely attended Dengue Awareness Session organized by ICCI in collaboration with the District Administration, Islamabad Capital Territory.\nThe session aimed at mobilizing the business community and relevant institutions to take preventive action against the potential threat of dengue outbreaks.\nQureshi said that ICCI will actively mobilize its member associations and volunteers from various markets to support ongoing awareness efforts and promote community-level engagement.\n“We believe in preventive and corrective measures rather than punitive actions, and therefore appreciate the District Administration’s decision to suspend inspection raids until June 20, giving traders time to ensure compliance with safety protocols,” he said.\nHighlighting the importance of a coordinated approach, he urged that Ulemas be engaged to deliver dengue prevention messages in Friday sermons, and that educational institutions incorporate awareness content into their morning assemblies.\nHe also called for electronic media channels to fulfill their public service duty by airing dengue prevention messages as a core responsibility.\n“The chamber will extend full logistical and communication support to distribute educational materials among business owners, workers, and the wider community,” he concluded.\nEarlier, Dr Abdul Sattar, Dengue Focal Person at the Directorate of Health Services, CDA, delivered a detailed presentation outlining the causes of dengue larva growth, symptoms of the disease, and effective preventive measures.\nIn his welcome address, Senior Vice President ICCI Abdul Rehman Siddiqui reaffirmed ICCI’s dedication to public health and highlighted the Chamber’s efforts in partnership with the business community.\nDelivering the closing remarks, Vice President ICCI Nasir Mehmood Chaudhry announced that soon after Eid-ul-Azha, the Chamber, in collaboration with all relevant departments, will launch an extensive awareness drive, including educational sessions in every major business hub.\nThe event concluded with a comprehensive question-and-answer session, providing attendees the opportunity to seek expert guidance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:49:17.918Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/icci-to-launch-comprehensive-dengue-awareness-campaign/",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T14:05:00.000Z"
}
