{
  "title": "PTI loses mobilization power, future moves unlikely to yield tangible gains: Siddiqui",
  "author": null,
  "content": "ISLAMABAD, Jun 05 (APP):Pakistan Muslim League Nawaz (PML-N) senior leader and head of Senate parliamentary party Senator Irfan Siddiqui has asserted that Pakistan Tehreek-e-Insaf (PTI) has lost its ability to mobilize any movement following the events of May 9, 2023, adding that any attempt by PTI to launch a movement would only lead to further difficulties and yield no tangible gains.\nTalking to a private channel on Thursday, he stated that Khan Sahib was grappling with intense despair. On one hand, he asserted that PTI was the largest party, capable of mobilizing millions on the streets to ignite a revolution. Yet, he questioned why, if PTI truly holds such influence, it is seeking support from figures like Mahrang Baloch. He further remarked that in its current state of desperation, PTI might even contemplate aligning with the BLA, while forming any meaningful political alliance remains beyond its reach.\nIrfan Siddiqui said PTI never desired for negotiations, democratic processes or parliamentary traditions, adding that the party was now incapable of forming any meaningful or effective political alliance based on a broader purpose or ideology, as evidenced by the bitter experiences of Maulana Fazlur Rehman and Mahmood Khan Achakzai.\nQuoting Imran Khan, he said that Khan sahib was calling on the youth to rise and fill the jails simply because he himself was imprisoned, but he said, you are in jail due to your own actions, so why should the youth of Pakistan jeopardize their future and suffer the consequences of your mistakes?\nIrfan Siddiqui dismissed the claim that any government or establishment official met Imran Khan in jail or made him an offer, calling it self-deception meant to mislead his followers and saying if such an offer was made, Khan should name the person openly.\nHe said Imran Khan targeted the opposition with false cases, but the current government has done no such thing to PTI, adding that they used to jail people on fake heroin charges, accuse others of ephedrine smuggling, treason, or even rent disputes, whereas we are not resorting to such tactics.\nIn response to a question, the PML leader said that when Khan sahib was out of jail, at the height of his popularity, and personally leading protest rallies, he achieved nothing significant, so what does he expect to accomplish now from behind bars?\nSenator Irfan Siddiqui said PTI neither struggled politically nor endured any real hardships to gain power, instead they rode into the corridors of power on the back of military support.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:49:41.575Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pti-loses-mobilization-power-future-moves-unlikely-to-yield-tangible-gains-siddiqui/",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T11:42:00.000Z"
}
