{
  "title": "Finance minister reviews progress on digital asset legislation",
  "author": null,
  "content": "ISLAMABAD, Jun 5 (APP):A follow-up meeting of the Pakistan Crypto Council (PCC) was held here Thursday to review progress on the development of a comprehensive regulatory framework for digital and virtual assets in Pakistan.\nThe session was chaired by Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb, according to press release issued by the Finance Ministry.\nThe meeting was attended virtually by Bilal Bin Saqib, Minister of State/Special Assistant to the Prime Minister on Blockchain and Crypto and Chief Executive Officer of the Pakistan Crypto Council.\nOther participants included the Governor of the State Bank of Pakistan (SBP); Chairman of the Securities and Exchange Commission of Pakistan (SECP); Secretary, Law & Justice Division; and Secretary, Ministry of Information Technology & Telecommunication.\nDuring the meeting, the Ministry of Law and Justice tabled a draft of the proposed legal framework, developed through close collaboration with members of the Pakistan Crypto Council, key stakeholders, and technical experts.\nThe draft legislation outlines a robust regulatory structure for digital and virtual assets, encompassing governance mechanisms, licensing protocols, and investor protection provisions.\nDesigned in alignment with international best practices and evolving global standards, the proposed framework seeks to position Pakistan as a forward-looking participant in the digital asset ecosystem.\nFinance Minister Muhammad Aurangzeb lauded the collaborative efforts of all involved and underscored the importance of swiftly finalizing and operationalizing the framework to provide legal certainty and harness the economic potential of blockchain and crypto technologies in the country.\nDuring the meeting, the draft was thoroughly reviewed and refined. It was collectively agreed that in-principle approval process will be fast-tracked to ensure timely enactment and effective implementation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:48:28.329Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/finance-minister-reviews-progress-on-digital-asset-legislation/",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T16:48:00.000Z"
}
