{
  "title": "PM declares India’s water threats violation of IWT, orders urgent national response with united front",
  "author": null,
  "content": "ISLAMABAD, Jun 05 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday termed India’s unilateral suspension of the Indus Waters Treaty (IWT) as “a blatant violation and act of water aggression” and warned that Pakistan will give a befitting response under the decisions taken in the April 24 National Security Committee (NSC) meeting.Chairing a high-level meeting on water resources at the Prime Minister’s House here, he vowed that, just as Pakistan achieved victory in the recent war, it would also triumph on the water front.The high-level meeting brought together Deputy Prime Minister and Foreign Minister Ishaq Dar, Field Marshal COAS General Syed Asim Munir, federal ministers, chief ministers of all four provinces, Prime Minister of Azad Jammu and Kashmir, Chief Minister of Gilgit-Baltistan, and senior federal and provincial officials.“This is a battle of justice, and like every battle we have fought with unity, we will defeat India’s water aggression with resolve and wisdom,” said the prime minister. He emphasized that living nations confront challenges head-on and make strategic, lasting decisions to protect their future generations.PM Shehbaz Sharif said that the Indian threats to weaponize water by attempting to violate the 1960 Indus Waters Treaty are increasing each day. He highlighted that the Treaty, a binding international agreement, does not allow any party to unilaterally withdraw, and India’s claims are politically and legally hollow.All provincial chief ministers, along with the leadership of AJK and Gilgit-Baltistan, strongly condemned India’s water threats and unanimously reaffirmed their support for the federal government’s position. The Prime Minister lauded this united stance, calling it “a reflection of our collective national resolve to protect Pakistan’s water security.”Emphasizing the urgency of enhancing water storage, PM Shehbaz Sharif ordered the establishment of a high-powered committee under Deputy PM Ishaq Dar to oversee funding strategies for new dam projects. The committee will include all provincial chief ministers, the Prime Minister of AJK, and relevant federal ministers, and is directed to submit its recommendations within 72 hours.“We will prioritize the construction of non-controversial reservoirs. Wherever there is unanimity, we must act without delay. These dams are not political — they are a national necessity,” the Prime Minister said. He made it clear that any project with cross-provincial consensus will be fast-tracked and completed on a priority basis.A detailed briefing was given during the meeting on Pakistan’s water infrastructure. Officials informed the participants that construction of the Diamer-Bhasha Dam is underway and expected to be completed by 2032, while the Mohmand Dam is likely to be completed by 2027. Currently, Pakistan has 11 dams with a total storage capacity of 15.318 million acre-feet. Under the Public Sector Development Programme (PSDP), 32 small and large dams are under construction, while 79 projects are underway under annual development programs.PM Shehbaz also pointed to the serious problem of silting in existing reservoirs like Tarbela and Mangla, which has drastically reduced their water retention capacities. He said bold decisions must be taken now, or history will judge today’s leadership harshly.“We owe it to our 240 million people to act decisively. This is not about politics — it’s about survival. The future generations must remember this leadership with respect for the choices we make today,” he declared.PM Shehbaz congratulated the Finance Minister, Economic Affairs Minister, and relevant secretaries for successfully securing loans from the World Bank and Asian Development Bank despite strong Indian lobbying. “India tried to sabotage our projects at the ADB for three days, but failed. Our diplomatic victory is a testament to Pakistan’s principled stand and growing credibility,” he noted.Concluding the meeting, the Prime Minister reaffirmed his unwavering belief in the collective strength of Pakistan’s national, provincial, and military leadership. “Just as our brave armed forces stood firm in the battlefield, we must now stand united in securing every drop of water for our people,” he said.The meeting was attended by Deputy Prime Minister Ishaq Dar, Field Marshal COAS General Asim Munir, Defense Minister Khawaja Asif, Planning Minister Ahsan Iqbal, Law Minister Azam Nazir Tarar, Information Minister Attaullah Tarar, Power Minister Owais Leghari, Water Resources Minister Muneeb Wattoo, and other key federal cabinet members. Punjab Chief Minister Maryam Nawaz, Sindh Chief Minister Murad Ali Shah, KP Chief Minister Ali Amin Gandapur, Balochistan Chief Minister Sarfraz Bugti, AJK PM Anwarul Haq, and GB Chief Minister Gulbar Khan were also present, along with senior civil and military officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:49:42.961Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-vows-united-national-response-to-indian-water-threats/",
  "dateList": "2025-06-05",
  "date_published": "2025-06-05T10:46:00.000Z"
}
