{
  "title": "Pakistan Navy Commissions 3rd offshore patrol vessel PNS HUNAIN in Romania",
  "link": "https://www.app.com.pk/national/pakistan-navy-commissions-3rd-offshore-patrol-vessel-pns-hunain-in-romania/",
  "date_published": "2024-07-26T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP): Pakistan Navy has commissioned its Offshore Patrol Vessel (OPV), PNS HUNAIN at Constanta Port, Romania, where Chief of the Naval Staff, Admiral Naveed Ashraf graced the occasion as the Chief Guest.\nChief of the Defence Staff of Romania General Gheorghita Vlad and Chief of Romanian Navy Vice Admiral Mihai Panait also attended as guests of honour, a Pakistan Navy news release said.\nWhile addressing the ceremony, Chief of the Naval Staff emphasized on the significance of the project and highlighted the additional set of capabilities added to PN sphere of operations with the induction of PNS HUNAIN. He expressed his confidence that induction of these multipurpose and highly adaptive platforms; equipped with state-of-the-art weapons/ sensors suite, will further enhance PN forward presence and perpetual operational readiness vis-à-vis deployment on Regional Maritime Security Patrols (RMSP) in the Indian Ocean Region.\nChief of the Naval Staff Admiral Naveed Ashraf commended the exceptional professionalism and dedication of DAMEN Shipyard and expressed confidence in the prospects of future cooperation in delivering cutting-edge technologies to Pakistan Navy.\nThe newly commissioned, PNS HUNAIN is a multipurpose and highly agile platform of medium size tonnage. The ship is a state-of-the-art electronic warfare, anti-ship & anti-air warfare capable platform with modern self-protection and terminal defence systems. The ship is also capable of embarking multirole helicopter and can operate independently as well as part of a Task Force for enhanced duration to undertake a number of missions while safeguarding the Maritime interests of Pakistan.\nThe commissioning ceremony was attended by high level dignitaries from Pakistan, Romania and Netherlands, including the Pakistani community in Romania.",
  "retrievedAt": "2025-08-11T04:08:39.434Z"
}
