{
  "title": "Modi running ‘hate mongering campaign’ against Sikhs: SFJ leader",
  "link": "https://www.app.com.pk/national/modi-running-hate-mongering-campaign-against-sikhs-sfj-leader/",
  "date_published": "2024-07-26T13:23:00.000Z",
  "source": "APP",
  "content": "CALGARY (Canada), July 26 (APP): Leader of Pro-Khalistan Sikhs For Justice (SFJ), Gurpatwant Singh Pannun has said that Indian Prime Minister Narendra Modi is running a “hate mongering campaign” against Sikhs, directly and through proxies, as tension grows between Indian and Canadian Sikhs ahead of Khalistan Referendum voting in Calgary on weekend.\nThe SFJ is organising the Khalistan Referendum voting at Municipal Plaza in Calgary, while Sikhs are holding large scale car rallies and billboard campaign locally to drum up support for the event.\nThe Indian government has expressed its nervousness just hours ahead of Khalistan Referendum voting in the Canadian city which is set to draw thousands of pro-Khalistan Sikhs to take part in the voting on the question of Punjab’s separation from India, according to a statement.\nTensions have risen as Sikhs accused Hindutva supporters of vandalising Khalistan Referendum posters and in Alberta’s capital Edmonton a Hindu temple coming under a graffiti attack from the unknown men, leading to a war of words between SFJ leader and India’s most wanted man Gurpatwant Singh Pannun on one hand and the Indian government and pro-BJP Canadian MP on the other.\nGurpatwant Singh Pannun, who survived an assassination plot by the Indian state last year, has called out the local pro-Indian Canadian MP Chandra Arya for attacking Sikhs.\n“When a democracy adopts different yardsticks to measure or implement the rule of law and freedom of expression, it only exposes its double standards. We expect Canada to take action against anti-India elements who have repeatedly threatened Indian leaders, institutions, airlines, and diplomats with violence,” Ministry of External Affairs (MEA) spokesperson, Randhir Jaiswal said during the weekly media briefing.\n“We would like to see stronger action at the same level of seriousness on the threats posed to us as well,” he added.\nCanadian Member of Parliament Chandra Arya wrote on X, “During the last few years, Hindu temples in the Greater Toronto Area, British Columbia, and other places in Canada have been vandalised with hateful graffiti. Gurpatwant Singh Pannun of ‘Sikhs for Justice’ last year publicly called for Hindus to go back to India.”\n“Khalistan supporters publicly celebrated in Brampton and Vancouver the assassination of Prime Minister Indira Gandhi and brandished images of deadly weapons. As I have always been saying, Khalistani extremists seem to get away with ease with their public rhetoric of hate and violence,” he said.\nResponding to MP Arya’s statements provoking violence against Pro Khalistan Sikhs in Canada, Sikhs For Justice General Counsel Gurpatwant Singh Pannun fired back stating that “MP Arya should go back to his motherland, as at the directions of his master Indian PM Modi, Arya is running a hate mongering campaign against Sikhs and has effectively abandoned his allegiance to Canada”.\nGurpatwant Singh Pannun said: “Every action and word of MP Arya resonates with the Hindu Supremacist Modi regime which is responsible for assassination of Shaheed Nijjar and transnational repression against Sikhs in Canada.”\nDemanding Arya’s disqualification as Canadian MP, Pannun stated: “Arya is adherent of Modi’s Hindutva Ideology that promotes use of violence to suppress dissenting political opinion, which is In direct conflict with the fundamental principles of Canadian democracy as enshrined in the Charter of Rights. July 28 Khalistan Referendum Voting in Calgary is dedicated to aa pro Khalistan Canadian Sikhs who, following the Canadian Values, attained martyrdom in Punjab while fighting India’s injustice.”\nLast year, Pannun’s close associate and Khalistan Referendum Canada head Hardeep Singh Nijjar was killed on Canadian soil by the Indian secret service agents. Canadian PM Justin Trudeau has directly blamed India.\nThe 45-year-old Hardeep Singh Nijjar was fatally shot outside the main Sikh temple in Surrey, a Vancouver suburb with a significant Sikh population. Nijjar was Chief Coordinator of Khalistan Referendum campaign in Canada. Nijjar, Pannun, UK based Paramjeet Singh Pamma and others were designated Terrorist by the Indian government in 2020. Nijjar was also President of Guru Nanak Sikh Gurdwara in British Columbia – Canada’s biggest Gurdawara.\nThe Khalistan Referendum voting campaign is being organised under the supervision of the independent Punjab Referendum Commission (PRC) which will announce the results when all phases are completed. Starting since October 31, 2021 from London UK, the voting has so far been held in several countries and cities across the UK; Geneva Switzerland; Paris (France); Rome and Milan (Italy), Australian cities of Melbourne, Brisbane and Sydney; American city of Houston; Canadian cities of Brampton, Mississauga, Malton (Ontario), Vancouver (British Columbia) and now Calgary.",
  "retrievedAt": "2025-08-11T04:08:40.069Z"
}
