{
  "title": "PML-N pledges for no to malicious smear campaign against women in politics: Romina",
  "link": "https://www.app.com.pk/national/pml-n-pledges-for-no-to-malicious-smear-campaign-against-women-in-politics-romina/",
  "date_published": "2024-07-26T12:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP): Coordinator to the Prime Minister on Climate Change and Environmental Coordination, Romina Khurshid Alam on Friday said the Pakistan Muslim League-Nawaz (PML-N) along with its female leadership has pledged to say no to malicious smear campaigns against women in politics.\nAddressing a media briefing flanked by Minister of State for IT and Telecommunication, Shaza Fatima Khawaja, women Members of the National Assembly, Shaista Pervaiz Malik, Syeda Nosheen Iftikhar and the others, the PM’s aide vehemently condemned the malicious campaign against Punjab Information and Culture Minister, Azma Zahid Bokhari launched after an alleged so-called objectional video of the provincial minister intending to damage her prestige.\nRomina Khurshid Alam said the women serving in politics, media, and all other fields of society deserved great respect, whereas her party and the current government vowed to snub such filthy tactics and those who think they could disregard women of Pakistan would have to face their fate.\nShe underlined that the culprits of this heinous crime should be taken to task as per the law. “The Constitution of Pakistan protects women and the State of Madina and our religion including all other faiths do not allow such disrespectful attitude towards women,” Romina Alam said.\nShe while alluding to the PTI founder said the people who were perpetrating such dirty tactics needed to know their character.\n“A woman who leaves her home has determination for her family and loved ones. We are thankful to our leadership and our party that supports its party members and never plays the woman card. The cursed faces (perpetrators) will be watching us and I want to tell them that we as women can compete with thousands of people like you,” Romina said.\nSenior MNA, Shaista Pervaiz Malik on the occasion also condemned the video incident. She said she was representing 50 per cent of the population, the entire women of the society, adding, “It was an adage in our culture that women, the mothers and daughters are respectful and their honour prestige belongs to all in our society but a political party has used women for its political mudslinging.”\nShe added that no society allows disrespect of women and their use as a tool for nasty politics.\n“Azma Bokhari is a brave woman and we all as women are supporting her,” she said.\nMalik alleged that (the PTI founder) does politics under the garb of religion, women, international powers and maligning of state institutions.\nThere should be a redline for all to avoid using foul language and crooked political gimmicks against women, she said.\n“Mian Nawaz Sharif always snubbed the use of bad language against women on the floor of the Parliament and public processions. We as women have achieved our space with great effort in this society and we don’t want to lose it,” she added.\nShe urged her party workers to support and respect Minister Azma Bokhari and sympathise with her but did not react to this incident and refrained from responding to it.",
  "retrievedAt": "2025-08-11T04:07:51.885Z"
}
