{
  "title": "No one can claim to be Muslim without unconditional faith in Khatam-e-Nabuwwat: SC",
  "link": "https://www.app.com.pk/national/no-one-can-claim-to-be-muslim-without-unconditional-faith-in-khatam-e-nabuwwat-sc/",
  "date_published": "2024-07-26T14:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP): The Supreme Court of Pakistan in a decision on a criminal review petition No.2/2024 stated that no one can claim to be Muslim until he/she has unconditional faith in ‘Khatam-e-Nabuwwat’ of Prophet Muhammad Peace Be Upon Him (PBUH).\nIt said that the court has clearly stated in the verdict that the both group, which called themselves Ahmadi, are non-Muslims in accordance with Sharia, Constitution and the law. These groups have no right to spread their believes in Muslims at public or private forums. The court has clarified this point while accepting the appeal of the Punjab government, it said.\nA press release issued by the top court said that the decision in the criminal review petition was announced on July 24, and it was written in Urdu language so general public can easily understand it.\nIt said that the top court has sought guidance from authentic educational institutions and except this, other individuals were also given opportunity to submit written arguments during hearing. The apex court also viewed the proceeding of Parliamentary Committee and took guidelines from on record statements of committee members including Mufti Mehmood, Maulana Zafar Ahmed Ansari, Maulana Abdul Haq, Maulana Shah Ahmed Norani, Maulana Abdul Mustafa Azhari, Maulana Syed Muhammad Ali Rizvi, Maulana Saddar Al-Shaheed, Maulana Nematullah, Professor Ghafoor Ahmed and other scholars. Except this, the writings of Syed Abul Ala Modoodi and others scholars are also viewed, which has been mentioned in the order.\nThe press release said that the decision has also been in line with the previous judgments of Supreme Court and Federal Shariat Court (FSC). Despite this, the people who didn’t appear before the court after provision of repeated opportunities have started baseless allegations and presenting their opinion as more strong over the stance of worthy scholars, which is inappropriate act, it said.\nIt said that the Constitution gives the right of freedom of expression to the citizens but it cannot be used against immenseness of Islam or for damaging the integrity of the country.\nIt said that making a propaganda by giving false meaning to the court verdict is not the service to nation and country but it comes under a meaning of riot on earth which is prohibited in Islam. The Constitution and law also do not permit for such act, it said.",
  "retrievedAt": "2025-08-11T04:08:20.498Z"
}
