{
  "title": "Pakistan to warmly host CHG-SCO meeting; matters within SCO framework to be discussed: DPM Dar",
  "link": "https://www.app.com.pk/national/pakistan-to-warmly-host-chg-sco-meeting-matters-within-sco-framework-to-be-discussed-dpm-dar/",
  "date_published": "2024-10-13T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Sunday said that Pakistan was ready to host Council of Heads of Government (CHG) of Shanghai Cooperation Organization (SCO) meeting on October 15-16 in Islamabad in which different significant issues would be discussed under the SCO framework.\nTalking to media after his visit to review arrangements for the upcoming CHG-SCO meeting, the deputy prime minister and foreign minister said that certain countries had requested for bilateral meetings on the sidelines of the CHG-SCO which were finalized.\nReplying to a query, he said that India had not requested for such bilateral meeting and only the matters related to SCO framework would be discussed by the SCO member states at the multilateral forum.\nMinister for Information and Broadcasting Attaullah Tarar also accompanied the deputy prime minister and foreign minister during a walk with the mediapersons to provide them first-hand information about the preparations of SCO summit.\nAbout invitation to Afghanistan, the deputy prime minister and foreign minister said that since 2021, the Observers Status of that country had been virtually suspended as Afghanistan had neither been invited to nor participated in SCO meetings.\nTherefore, he said, Pakistan could not take decision alone in this regard as the decisions were taken on the SCO forum by the member states.\nDar, to another question, said Pakistan is a host to CHG-SCO and would fully meet the responsibility.\nAbout the North-South and South-South connectivity, he said the discussions with the relevant countries were in progress and continuing on the bilateral and multilateral levels.\nBut within the SCO framework and protocol, certain matters would be discussed under specific scope of discussions and within its contours, he further clarified.\nThe deputy prime minister said that the entire region required integration and peace and it was the core objective of the PML-N leadership including former prime minister Muhammad Nawaz Sharif, besides it was also included in the PML-N manifesto.\nHe enumerated the incumbent government’s efforts to bring down inflation ahead of the target set for the next year.\nDar advised those quarters who had been claiming that Pakistan was in diplomatic isolation to reassess their projections as Pakistan had become a hub of regional trade and investment and referred to the recent visits of Malaysian premier and the Saudi delegation.\nWith the SCO member states, matters related to the trade and commerce had also been discussed continuously, he added.\nAbout Palestine issue, he said Pakistan had been vociferously raising it at all the global fora which included the prime minister’s address at the UNGA, Pakistan’s efforts at the OIC and other international fora where they had effectively raised the Palestine, Gaza and Lebanon issues.\nPakistan had sent 10 consignments of humanitarian assistance to Palestine and further steps were on anvil for the relief aid, he added\nTo a query, the deputy prime minister and foreign minister urged a specific political party without naming (PTI) it to take back its call for protest on October 15 in the larger national interests.\nHe said for the sake of politics, it was not good for the same political party that had been repeating the same scenario of 2014. Due to their protest, Chinese president’s visit had been postponed.\nDuring all parties conference on Gaza, the same political party did not attend it, he said, adding what message, they wanted to give?\nIt had already crossed all the red lines in the past and attacked the state institutions, Dar observed and stressed upon its leadership to rectify its wrong decision and call off their protest on 15 October in the large national interests.\nThe deputy prime minister also lauded the relevant miniseries for making arrangements for the upcoming SCO event.",
  "retrievedAt": "2025-08-10T20:02:32.029Z"
}
