{
  "title": "ICT police finalize security measures for SCO Summit 2024, deploying 93% of force: IG Rizvi",
  "link": "https://www.app.com.pk/national/ict-police-finalize-security-measures-for-sco-summit-2024-deploying-93-of-force-ig-rizvi/",
  "date_published": "2024-10-13T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): Islamabad Capital Territory (ICT) police, under the supervision of Inspector General (IG) Police Syed Ali Nasir Rizvi, is preparing for the upcoming SCO Summit 2024, with a comprehensive security plan now in place.\nInspector General (IG) Police Syed Ali Nasir Rizvi stated on Sunday that the ICT Police have developed an integrated security strategy to ensure safety during the event.\nIG Rizvi said that security duties have been finalized at various venues, airports, routes, funnel areas, hotels, and residences of delegations, including the Noor Khan Air Base.\nIG Syed Ali Nasir Rizvi stated that the Islamabad Police have developed an integrated traffic plan to minimize difficulties for citizens during the event.\n“Search and information-based operations are ongoing to ensure full security for all foreign heads of state, delegations, and guests,” Rizvi said.\nIG Rizvi, said the security efforts involve collaboration across multiple agencies, including the Ministry of Foreign Affairs, District Administration, Pakistan Army, Rangers, Frontier Corps, other provincial police, intelligence agencies, traffic police, and the special branch.\n“Islamabad Police has deployed 93% of its force for the security arrangements, amounting to over 9,500 officers and personnel,” IG Added.\n“The presence of these security forces aims to convey to our guests that Islamabad is a safe and protected city,” IG Rizvi added.\nAli Nasir Rizvi called for public cooperation to ensure the success of the summit, asserting that it represents the respect of Pakistan and its capital.\n“We are working diligently to present a successful summit, and with the help of all stakeholders, we will achieve this goal,” Rizvi expressed determination.",
  "retrievedAt": "2025-08-10T20:02:35.588Z"
}
