{
  "title": "Governor urges PTI to defer protest call in national interest",
  "link": "https://www.app.com.pk/national/governor-urges-pti-to-defer-protest-call-in-national-interest/",
  "date_published": "2024-10-13T09:19:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 13 (APP):Governor Punjab Sardar Saleem Haider Khan has said that Pakistan Tehreek e Insaaf (PTI) should stop pursuing selfish political goals and call off the October 15 protest at D-Chowk, Islamabad in the larger national interest.\nIn an interview with APP here on Sunday, Sardar Saleem Haider Khan said that prime ministers of nine countries would arrive in Pakistan to attend the SCO summit on October 15 and 16 which was a matter of pride for the country and all political forces should work to present a positive image of the country instead of taking to the streets.\n“I understand that PTI is a political force but when it comes to the national prestige, we should give up politics, avoid personal agenda and put Pakistan first,” he said, adding that heavens would not fall if PTI called off the protest for a week or so.\nOn destructive politics, the Governor Punjab said PTI leadership needed to understand that\npolitics of obstinacy had brought them to the verge where one wrong step could be fatal for their firebrand politics, adding that there was no room for stubbornness in politics. He urged the PTI leadership to take the path of dialogue and play productive role in taking the country ahead rather than leading it to anarchy.\nSardar Saleem Haider Khan said constructive politics also serves interests of the PTI leadership, expressing the hope that PTI had recently shown signs of change in their approach to politics.\n‘Good or bad, the general election is over. PTI should play the role of a good opposition in the parliament and I welcome their role as opposition. I will hail their good intentioned opposition,’ Governor Punjab responded.\nOn the SCO summit in Pakistan, Governor Punjab Sardar Saleem Haider Khan said it was a matter of immense pleasure that the SCO was being held in the country under Pakistan’s chairmanship and the country is coming out of the diplomatic isolation.\nReferring to previous PTI government, he said Pakistan was pushed into by a haughty person some years back. He said it was a good omen that the friendly countries have started to pay attention to Pakistan after many years and the SCO summit is the best opportunity to win gaze of the world.\n“It appears the PTI has fastened its ‘revolution horse’ to the hitchrack in the stable and it should let it rest for the time being. The PTI may harness its ‘revolution horse’ again once the SCO summit was over in Islamabad,” the governor said referring to some semblance of political restraint by the PTI leadership.\nOn the agrarian economy, the Governor Punjab said the subsequent governments failed miserably to look after the agriculture sector of the country, adding that it was painful that the country had to import food items despite being an agricultural country. He regretted lack of storage facilities in case of a bumper crop, adding that farmers need to be protected.\nHe stressed the need for paying attention to the problems faced by the farmers for the good of\neconomy, adding that things had started to improve under the current government.\nAbout disagreement on appointment of vice chancellors, the Governor Punjab said that he did not\nhave any disagreement with the Maryam Nawaz-led Punjab government, adding that how could he destabilize his coalition government. “I want the Punjab government to succeed as PPP is a stakeholder in Punjab and the centre,” he responded, adding he believed right persons were vital for achieving educational excellence at centers of higher learning.\nThe governor said he did not want the PPP and PML-N coalition government to earn a bad name for some wrong decisions.\nHe pointed out that matters were still in a deadlock on the matter of appointments of right persons as vice chancellors but hoped the good sense would prevail between the government and governor’s office. He said the government needs to pick the right persons so that the students do not pick petrol bombs or indulge in abusive behaviors as happened during the previous regime.\nTo a query, Governor Punjab Sardar Saleem Haider Khan hailed President Asif Ali Zardari for the success of the coalition government despite differences, adding that President Zardari embodies vision and would to make democracy work in the country.\nHe said fair and free election was vital to the strengthening of democracy and it was only possible through an independent, impartial and just election commission, so that no stake-holder raises a finger at election results be it local government, general or by-polls. He said President Zardari may make all political forces sit at one table including a ‘lost’ political party.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:03:16.848Z"
}
