{
  "title": "Minister reaffirm Pakistan’s unflinching support to Kashmiris",
  "link": "https://www.app.com.pk/national/minister-reaffirm-pakistans-unflinching-support-to-kashmiris/",
  "date_published": "2020-02-03T23:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP):Minister for Interior Brig (R) Ijaz Ahmad Shah Tuesday reaffirmed Pakistan’s unflinching support to the people of Indian occupied Jammu and Kashmir and urged the world to help oppressed Kashmiris in exercise their right to self determination.\nPrime Minister Imran Khan as an Ambassador of Kashmiri people has availed all international forums for peaceful resolution of Kashmir, he said in his message regarding Kashmir Solidarity day to be observed on February 5 (tomorrow).\n“On this day, we reinforce our support for the Kashmiri brothers and should promise to stand for their legitimate right,” he added.\nHe expressed hope that the people of Kashmir would get their rights soon and bear the fruit of their prolonged struggle.\nWithout achieving a peaceful solution over the issue Pakistan and India’s relations cannot be normalized.\nFor years, we have fought and then made peace; but the recent decision taken by the Indian Government, on August 5, 2019, that revoked the special status of Jammu and Kashmir by abrogating Article 370 of the Indian Constitution has not only undermined humanity but has also brought International attention to the Kashmir dispute once again, he maintained.\nIndia’s justification of revocation that it will enable the people of Kashmir to access the government programs that include the right to education and right to information gets nullified by the forced cutting of communication lines and imposition of curfew in the valley.\n“This is not only inhumane but ironic and tragic at the same time. The revocation has not only changed the status of the State of Jammu and Kashmir but has snatched away the identity of Kashmiris as well,” the minister remarked.\nPakistan has given the message of peace on all fronts but the recent irresponsible statement from Narendra Modi reflects his extremist mindset.\n“Let it be very clear that Pakistan armed forces are fully capable of defending its land on all fronts and our peaceful approach should not be confused with our weakness,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:44:41.505Z"
}
