{
  "title": "Youth urged to play effective role in sharing Indian brutalities on social media",
  "link": "https://www.app.com.pk/national/youth-urged-to-play-effective-role-in-sharing-indian-brutalities-on-social-media/",
  "date_published": "2020-02-03T21:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP):Minister for Communications Murad Saeed on Tuesday urged country’s youth to play their effective role in sharing persistent Indian brutalities in Kashmir on social media, so that the real face of Indian secularism could be exposed before the world community.\nAddressing Solidarity with Kashmir Youth Conference at Convention Centre, he vowed continued support for Kashmiris till their success, besides urging to build a strong national narrative on Kashmir.\nThe conference was organized by District Administration Islamabad Capital Territory (ICT) in collaboration with National Highways Authority (NHA) in connection with Kashmir Solidarity Day being observed on February 5 (Wednesday).\nMurad Saeed lauded the efforts of ICT administration for enhancing awareness among the youth about Kashmir cause, saying since 1986, over 100,000 innocent and unarmed Kashmiris have already been martyred. Kashmiris were rendering unmatched sacrifices for Kashmir cause and for winning freedom from the clutches of brutal Indian forces.\nHe urged the students of over 400 schools and colleges of Federal Directorate of Education (FDE) and private sector to play their role in promoting Kashmir cause.\nTerming Indian Prime Minister Nerandera Modi as Adolf Hitler and terrorist, he said Prime Minister Imran has exposed the real face of India and Modi in his speech delivered in the United Nations General Assembly last year.\n“The nation is united on Kashmir issue and all segments of society were unanimous about the cause. India had martyred Burhan Wani but hundreds of more Wanis have already born there to resist Indian occupation. Kashmiris have great affection for Pakistanis and they wanted to be part of the country.”\nPakistanis will observe Kashmir Solidarity Day on Wednesday in a befitting manner. Prime Minister Imran Khan will address Azad Kashmir Legislative Assembly.",
  "retrievedAt": "2025-08-11T18:44:43.903Z"
}
