{
  "title": "Govt committed to improve living standard of poors: Senators",
  "link": "https://www.app.com.pk/national/govt-committed-to-improve-living-standard-of-poors-senators/",
  "date_published": "2020-02-04T00:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP):Pakistan Tehreek-e-Insaf Senators Tuesday expressed that incumbent government under the sincere leadership of Prime Minister Imran Khan was committed to improve the living standards of the low income people and the matter of parliamentarians’ salary issue would be address after the problems of common men.\nTalking to private news channel , Senator Faisal Javed said, the timing of the bill was wrong” and salaries would be increased once the country’s economic situation stabled.\nHe said Imran Khan a man who feels the pains of poor, adding, real change which had not come earlier, will come now under the vision of Imran Khan.\nSenator Faisal Javed said government initiated austerity campaign keeping in view the economic crises of the country.\nHe criticizes PML-N , PPP leaderships that the self-proclaimed kings of past rulers now who buy palaces and expensive properties abroad have broken all records of corruption in their formers governments.\nHe said the nation is paying a high price for political leaders’ corruption but our focus is only to stable economy and control inflation after that we will discuss the matter of salaries.\nHe said that the PTI government is taking Pakistan in the right direction and the government is working for public welfare.\nEvery step is being taken by the government for the betterment of the country, he added.\nHe said the PTI never indulged in the politics of personal interest nor would ever do so.\nNational interest is always given priority, he added.\nPTI Senator Shibli Faraz said the bill regarding increment of the parliamentarians untimely.\nParliamentarians facing some issues with low income salaries that we can realized but government would address the issue of economy first for the welfare of the common people, he added.\nHe explained the country had “not come out of the economic crisis yet and a raise in lawmakers’ salaries at this wrong time would put an unnecessary burden on the treasury.\nPublic money needs to be spent on public relief first, he added.\nHe said in these circumstances, it is not reasonable for country’s representatives receive an increase in their salaries.\nThe country is facing with an economic crisis and the government is concentrating to provide relief to masses from inflation at any cost, he added.",
  "retrievedAt": "2025-08-11T18:44:39.743Z"
}
