{
  "title": "IGXEP to regulate future energy demand, supply in Pakistan: Omar Ayub Khan",
  "link": "https://www.app.com.pk/national/igxep-to-regulate-future-energy-demand-supply-in-pakistan-omar-ayub-khan/",
  "date_published": "2020-02-04T01:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP):Power Division is in the process of finalizing Integrated Generation Expansion Plan (IGXEP) for the national Grid which will regulate future energy demand and supply with most affordable and feasible power projects.\nThis was revealed by Federal Minister for Power and Petroleum, Omar Ayub Khan in a meeting with Canadian High Commissioner MS. Wendy Gilmour here Tuesday, said a press release.\nBriefing regarding the IGXEP, the Federal Minister said that National Transmission and Dispatch Company under the Power Division was working on the plan.\nHe said that the plan would ease out future generation with exact demand and supply forecast along with location i.e. where to install the power plants, nature of fuel (renewable or other sources), availability of evacuation system and most importantly the affordability of prices.\nThe Federal Minister while briefing the Canadian High Commissioner on the renewable energy projects and investment potential of Power Sector said that the Government was looking forward to increase dependence on indigenous energy resources and bring it upto 80% by the year 2030.\nHe said that the share of Renewable Energy Alone from current 2500 MW would be increased to 8000MW that was 20% by the year 2025 and 20000 MW approx. that was 30% of total energy mix by year 2030.\nHe said that together with Hydel Resources, the share of Renewable Energy would become 60% by the year 2030 that would not only increase dependence on indigenous resources but also result in saving of huge amount of foreign exchange.\nOmar Ayub Khan further informed that Government has for the first time introduced competitive bidding for new renewable energy projects that would contribute in bringing down the electricity prices in the country.\nHe said that Power Sector in its Generation, Distribution and Transmission sub-sectors offered $ 80 billion market.\nMs. Wendy Gilmour appreciated the plan that Government was pursuing for utilization of indigenous resources for electricity generation. She termed the plan as “Excellent”. She said that Canadian Investors were keenly following the Government Policies and considering various options.\nSecretary Power Division, Irfan Ali was also present during the meeting.",
  "retrievedAt": "2025-08-11T18:44:34.689Z"
}
