{
  "title": "Govt providing underprivileged class access to education: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/govt-providing-underprivileged-class-access-to-education-ahsan-iqbal-2/",
  "date_published": "2022-11-30T08:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP):Federal Minister for Planning Development and Special Initiatives, Professor Ahsan Iqbal said here Wednesday that the government was committed to providing the underprivileged class access to education.\nAddressing the International Summit on Higher Education and Workforce Development the minister said that the access to higher education was one of the keys to growth and development.\nThe Summit was organized under the auspices Higher Education System Strengthening Activity (HESSA) Project.\nThe HESSA project is providing technical assistance to 16 Pakistani universities distributed across all provinces in improving their institutional and technical capacities in delivering market-relevant education and research, with an overarching goal of enhancing the employability potential of graduating students.\nThe summit was a timely initiative within the context of Pakistan’s development priorities as US support for Pakistan’s Higher Education System has a long history which ranges from primary and basic education to establishing Centers of Excellence to strengthening overall higher education systems, said the Minister.\nAhsan Iqbal said that youth in Pakistan are not only concerned about their future education, but also about their livelihoods, their mental health, and well-being.\nThe Planning Ministry has already developed a Mental Health Psychosocial Support Handbook.Therefore, mainstreaming this group and its energy into the socioeconomic development process will be critical to the overall socio-economic development of Pakistan, he added.\nIt is noted that Pakistan’s estimated youth unemployment is between 8.5 to 10 percent, with 80 percent youth workforce having a low level of education and poor skills base primarily due to the gaps in quality, access, and relevance of the skills vis-à-vis what is needed in the market.\nWe as a nation face key challenges as to how to equip our young population with the knowledge and skills required to support the national development agenda and priorities.\nOn the other hand, it will be the biggest missed opportunity if we fail to harness the potential and capacities of our youth in the right direction, he remarked.\nThe International Summit is the first among a series of policy dialogues, symposiums, seminars, and experts’ consultations on issues related to higher education for advancing sustainable development.\nThe summit was attended by US Ambassador to Pakistan Donald Blome, Senator of Utah State, Dr. Keith Grover, Chairman Higher Education Commission (HEC",
  "retrievedAt": "2025-08-11T15:56:22.385Z"
}
