{
  "title": "U.S, Pakistan join hands to elevate higher education sector",
  "link": "https://www.app.com.pk/national/u-s-pakistan-join-hands-to-elevate-higher-education-sector/",
  "date_published": "2022-11-30T09:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): The United States through its embassy in Islamabad has joined hands with the government of Pakistan to elevate the higher education sector of the country.\nIn this regard, United States Ambassador Donald Blome joined officials from the University of Utah and Federal Minister for Planning Development and Special Initiatives, Ahsan Iqbal, to inaugurate the International Summit on Higher Education and Workforce Development on Wednesday.\nThe summit was organized by the U.S.-funded Higher Education System Strengthening Activity (HESSA) and focuses on the role of higher education in the 21st century, highlighting the fluid nature of learning and employment, and exploring how universities can reposition themselves in this ever-changing landscape.\nOn the occasion, Federal Minister for Planning Development and Special Initiatives, Ahsan Iqbal said that the government of Pakistan is open to improving the higher education system and is looking into various options to capitalize on the abundant youth potential in the country.\nHe appreciated the Pakistan’s 75-year partnership with the US government and celebrated the support provided by the US government to academia through specialized investment in higher education.\nHe further added that academic institutions and the public and private sectors should join hands to accelerate this development. Ahsan Iqbal tasked Pakistani higher education officials to improve higher education.\nAmbassador Donald Blome while highlighting the 75 years of partnership between the US and Pakistan said, “In a country where more than 60 percent of the population is below the age of 30, we must continue to help youth achieve their full potential.”\nChairman of the Higher Education Commission of Pakistan (HEC), Dr. Mukhtar Ahmed said that HEC would continue working with the U.S. government to build a cadre of experts to improve graduate employability.\nSenator Keith Grover, Utah State Senator from the United States noted, “it is the ultimate goal of an institute to provide necessary skills for youth so they can positively contribute to the workforce both locally and globally.”\nHESSA is supported by the United States through USAID, and is implemented in collaboration with 16 Pakistani public universities and other stakeholders, with a focus on strengthening universities’ capacity to deliver market-driven education, research and graduate employability.",
  "retrievedAt": "2025-08-11T15:56:22.125Z"
}
