{
  "title": "Pakistan, Turkiye enjoy shared bonds of historical, cultural affinities: Hina Khar",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-enjoy-shared-bonds-of-historical-cultural-affinities/",
  "date_published": "2022-11-30T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): Minister of State for Foreign Affairs Hina Rabbani Khar on Wednesday said that the ties between the people of Pakistan and Turkiye were closely marked with shared bonds of historical and cultural affinities.\nAddressing at a cultural night organized at Jinnah Convention Center to celebrate the 75th anniversary of the establishment of ties between the brotherly countries of Turkiye and Pakistan as a chief guest, she said few countries in the world enjoyed such excellent ties.\nShe opined there also existed complete unanimity and alignment of opinion between the two countries. These links were not only contemporary but also permanent, she added.\nThe minister of state said that the ties between the two countries had transformed into a strategic partnership, characterized by multiple high-level exchanges, including the visits of Prime Minister of Pakistan to Turkiye in June and November 2022, the Joint Inauguration of MILGEM Corvettes PNS KHAIBER, and signing of the Trade in Goods Agreement in August 2022, that aimed at achieving bilateral trade target of US $ 5 billion in the medium term.\nThe minister of state while recalling the generous humanitarian support provided by Turkiye during the natural calamities, said that the people and the government of Turkiye had generously supported the people of Pakistan during 2005 earthquake, 2010 floods and in the recent floods that had devastated large parts of Pakistan.\nShe also lauded the medical and health facilities set up by Turkiye to serve the people of Pakistan.\nTurkish Ambassador to Pakistan Dr Mehmet Pacaci and a number of other ambassadors also attended the ceremony.\nHina Khar further said that both countries had been the founding members of different multilateral fora of cooperation, progress and development of the region including the Economic Cooperation Organization (ECO).\nAs the founding members, both countries shared the same aspirations for the world and the region, she added.\nShe said the brotherly countries of Turkiye and Pakistan were also committed to high-level strategic partnership.\nThe minister of state said that they were committed to enhancing the bilateral trade volume to $5 billion in the next three years.\nThe Pakistanis have found Turkiye as a great tourism destination, she observed.\nShe expressed the optimism that the close camaraderie between the generations of both countries would continue in future and the upcoming generations would further strengthen the same bonds of close affinities, brotherhood and affection.\nThe cultural night was jointly organized by the Ministry of Foreign Affairs, Islamabad and Embassy of Turkiye that brought to the fore the rich cultures of Pakistan and Turkiye. The ‘Sama’ performance of whirling Dervishes from Konya, Turkiye and instrumental Tabla performance from Pakistani artists, along with traditional delicacies from both the countries, kept the large audience entertained throughout the evening.\nEarlier in the morning, the two countries held simultaneous tree plantation ceremonies at their respective Ministries of Foreign Affairs, to mark the 75th anniversary of establishment of diplomatic ties.\nThe tree was planted jointly by Pakistan’s Minister of State for Foreign Affairs Hina Rabbani Khar and Ambassador of Turkiye to Pakistan Dr. Mehmet Pacaci, in Islamabad; while Turkish Deputy Minister for Foreign Affairs Faruk Kaymakci, and Pakistan’s Ambassador to Turkiye Dr. Yousaf Junaid planted the tree in Ankara. Indeed, Pakistan and Turkiye relationship had stood the test of times and continues to grow deeper and higher with each passing day.",
  "retrievedAt": "2025-08-11T15:56:18.597Z"
}
