{
  "title": "75th anniversary of Pak-Turkiye diplomatic ties marked",
  "link": "https://www.app.com.pk/national/75th-anniversary-of-pak-turkiye-diplomatic-ties-marked/",
  "date_published": "2022-11-30T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): A tree plantation ceremony was held in the Turkish Ministry of Foreign Affairs in Ankara on Wednesday to commemorate the 75th anniversary of the establishment of diplomatic relations between Pakistan and Türkiye.\nThe event, hosted by Turkish Deputy Minister Ambassador Faruk Kaymakci, was attended by Ambassador of Pakistan to Türkiye Dr. Yousaf Junaid, officials of Pakistan Embassy and Turkish diplomats.\nDeputy Minister Kaymakci highlighted how the two states had supported each other during critical times, as the relationship evolved from a strategic perspective.\nHe expressed hope that this special relationship would further grow from strength to strength symbolized by the tree saplings planted today, a press release issued by Pakistan Embassy in Ankara said.\nIn his remarks, Ambassador Yousaf Junaid recalled that the relationship between the two nations described by the Prime Minister as “Two Hearts One Soul” was much older than 75 years.\nHe underscored the long tradition of extending mutual support on all core issues, which testified to the enviable amity existing between the two sides.\nThe Ambassador expressed satisfaction on the existing robust institutional frameworks in place to take the relationship forward.\nIn particular, he referred to the economic and connectivity opportunities and the recently signed Trade in Goods Agreement as the harbinger of a new future of this relationship.\nThe tree plantation ceremony was followed by a bilateral meeting of the Ambassador with Deputy Minister Ambassador Kaymakci.\nIn the meeting, both sides took stock of the successful visit of Prime Minister Shehbaz Sharif in Istanbul on 25-26 November 2022 and agreed to follow-up on the decisions taken during the visit.",
  "retrievedAt": "2025-08-11T15:56:16.394Z"
}
