{
  "title": "Defence, Martyrs Day commemorated in Ankara",
  "link": "https://www.app.com.pk/national/defence-martyrs-day-commemorated-in-ankara/",
  "date_published": "2024-09-10T19:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): Pakistan’s Defence and Martyrs Day was commemorated in Ankara,Türkiye, paying tribute and homage to the indomitable courage of the armed forces and martyrs who sacrificed their lives in successfully defending the motherland from threats to Pakistan’s sovereignty, territorial integrity and stability.\nAccording to a message received here, Turkish Minister of Trade Prof. Dr Omer Bolat graced the occasion as chief guest and Commander Turkish General Staff (TGS) General Metin Gurak as guest of honour. Among other guests were Former Minister for Interior Efkan Ala, Member Parliament Dr. Hasan Sert, Governor Ankara Vasip Sahin, Former Chairman SSB Prof. Dr Ismail Demir, Turkish ambassador designate to Pakistan Irfan Neziroglu, Deputy Commerce Minister Mustafa Tuzcu , Deputy Chief of TGS General Kemal Yeni, , high ranking Turkish civil and military officials, ambassadors, members of the diplomatic corps, defence & military Attaches, media persons and members of Pakistani community.\nIn his remarks, Turkish Minister of Trade Prof. Dr Omer Bolat appreciated exemplary and historic bilateral relations, in particular flourishing defence ties and excellent cooperation between the armed forces of Pakistan and Turkiye. Referring to Ambassador Junaid as his special friend, Minister Bolat acknowledged his role in further strengthening of bilateral ties and economic cooperation between the brotherly countries.\nMinister Bolat highlighted that trade volume between Pakistan and Turkiye has increased by 42% in the first eight months of the year and both countries are committed to reaching the 5 billion USD trade target, set by the leadership.\nWhile highlighting strategic Pakistan Turkiye partnership, Commander Turkish General Staff (TGS), General Metin Gurak paid tribute to the sacrifices of the martyrs and valour of Pakistan Armed Forces. He stated that mutual sharing of experiences and expertise in the defence industry between Pakistan and Turkiye would strengthen the defence of both countries.\nAmbassador Dr. Yousaf Junaid began his speech with prayers for the Turkish Gendarmerie soldiers, who lost their lives, in an accident, while on duty in Tunceli. Highlighting the significance of September 6th, ambassador Dr. Yousaf Junaid stated that over the past 77 years, three major wars were imposed on Pakistan, apart from several skirmishes and numerous rounds of unprovoked clashes. Our perseverance has left a lesson that peace-loving, brave and self-respecting nations, determined to sacrifice lives for their country could not be defeated by force and belligerence.\nAmbassador Junaid reiterated that Pakistan believes in dialogue over conflict and in cooperation over confrontation. Unfortunately, the non-resolution of Jammu and Kashmir dispute is hampering the pace of positive development in the region. Resolution of the Kashmir dispute according to United Nations Security Council resolutions and aspirations of the Kashmir people is vital for regional peace and security, he added. Ambassador thanked the Turkish nation for standing with Pakistan and Pakistani people through thick and thin.\nMessages of the President Asif Ali Zardari, Prime Minister Muhammad Shehbaz Sharif, Chairman Joint Chiefs of Staff Committee General Sahir Shamshad Mirza were read out on the occasion.\nPakistani nation commemorates Defence Day on 6th September each year to honour the sacrifices of Pakistan’s valiant armed forces, their professionalism, dedication and devotion with which they have served the nation. The 1965 war stands out in Pakistani history as a symbol of unwavering national resolve, courage, strong will and unmatched spirit of sacrifice.",
  "retrievedAt": "2025-08-10T21:00:31.982Z"
}
