{
  "title": "Dar calls unity among all political parties for strengthening democracy",
  "link": "https://www.app.com.pk/national/dar-calls-unity-among-all-political-parties-for-strengthening-democracy/",
  "date_published": "2024-09-11T11:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): Deputy Prime Minister Ishaq Dar on Wednesday called for unity among all the political parties for the strengthening of democracy and the Constitution, warning that ongoing political conflicts could undermine the respect of the parliament.\nSpeaking in the National Assembly on point of order, Ishaq Dar highlighted that political engagement is essential, but red lines should not be crossed.\nWelcoming Chairman Pakistan Peoples Party (PPP) Bilawal Bhutto Zardari’s proposal, he said the government fully endorsed the proposal to form high-powered committee of the Parliament so that a policy can be evolved to take the country forward with collective wisdom.\nIshaq Dar recalled that discussions for the Charter of Democracy (CoD) began in February 2002 between the PPP and the Pakistan Muslim League-Nawaz.\nDespite a history of bitterness between the two parties, Ishaq Dar said that they signed the CoD in May 2006 to restore the constitution and strengthen democracy.\nDeputy Prime Minister said the charter was subsequently endorsed by all major political parties, including Imran Khan’s party at the time.\nIshaq Dar stressed that continuous internal conflicts among parties could tarnish the dignity of the parliament, adding that just because production orders were not issued during the previous government does not mean they cannot be issued now.\nHe supported the idea of the committee in question and urged for an open examination of how Pakistan’s economy, which was the 24th largest in the world in 2017, fell to the 47th position by 2022.\nIshaq Dar also called for an analysis of the substantial expenditure on counter-terrorism and the resurgence of terrorism, questioning the reasons behind this trend.\nHe emphasized that production orders are a privilege of the Speaker and suggested that the Speaker should form committees with genuine terms of reference to determine solutions for national issues.\nHe assured that the government would fully support such efforts.\nPakistan Tehreek-e-Insaf (PTI) Chairman Gohar Ali Khan said his party has no intention to quit any assembly and will continue playing its role for the cause of democracy.\nMuttahida Qaumi Movement-Pakistan leader Mustafa Kamal commended Speaker Ayaz Sadiq’s efforts for upholding the sanctity of the Parliament.\nPakhtunkhwa Milli Awami Party Chief Mehmood Khan Achakzai assured the Speaker of entire opposition’s support for the supremacy of the Constitution and strengthening of the Parliament.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:59:41.872Z"
}
