{
  "title": "Govt to unveil a comprehensive plan soon to promote football: PM",
  "link": "https://www.app.com.pk/national/govt-to-unveil-a-comprehensive-plan-soon-to-promote-football-pm/",
  "date_published": "2024-09-11T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): Prime Minister Shehbaz Sharif on Wednesday assuring all possible measures for the promotion of the football game in the country, announced that the government would soon unveil a comprehensive plan in this regard.\nThe prime minister, in a meeting with Pakistan’s Street Child Football Team which represented Pakistan in the Norway Cup 2024, also asked the authorities concerned to fully restore the departmental sports and present a report, according to a PM Office press release.\nHe said the fabulous performance of the street child football team manifested the fact that the Pakistani youth had the potential to prove their mettle globally if given ample opportunities.\nThe delegation comprised Captain Muhammad Adeel, top scorer Muhammad Kashif, team manager Syed Muhammad Awais, Executive Director of Muslim Hands Syed Javed Gillani, Director Global Operations Arsalan Nusrat, and Communication Director Muhammad Rehan Tahir.\nTerming the players as the bright stars of Pakistan, Prime Minister Shehbaz said that the Pakistan Street Child Football Team was bringing fame to the country. He also lauded the role of Muslim Hands in promoting Pakistan Street Child Football.\nThe players thanked the prime minister for hosting them and acknowledging their achievement in the game.\nThe representatives of the Muslim Hands briefed the prime minister about the organisation’s contribution to promoting street football in the world including Pakistan.\nMinister for Information and Broadcasting Attaullah Tarar, Minister of State for Information Technology Shaza Fatima Khawaja, Chairman of PM Youth Program Rana Mashhood Ahmed Khan, PM’s coordinators Romina Khurshid Alam and Badar Shehbaz, and senior officers also attended the meeting.",
  "retrievedAt": "2025-08-10T20:59:41.856Z"
}
