{
  "title": "IWMB to dismantle restaurants on Pir Sohawa Road, restore public access to ridge inside MHNP",
  "link": "https://www.app.com.pk/national/iwmb-to-dismantle-restaurants-on-pir-sohawa-road-restore-public-access-to-ridge-inside-mhnp/",
  "date_published": "2024-09-11T08:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP):Before large restaurants were built on the ridge on Pir Sohava Road in the heart of Margallah Hills National Park (MHNP), the breezy hill top with great views of the city was visited freely by the public.\nThe Islamabad Wildlife Management Board (IWMB) intends to restore this hill top to free public access.\n“The buildings will be dismantled from September 12th and the area around them rewilded and re-integrated into the natural landscape that surrounds them as per the orders of the Supreme Court of Pakistan,” am IWMB news release said.\nIWMB has notified an implementation committee comprising Govt officials from the District Administration, Islamabad Police, Capital Development Authority, Ministry of Climate Change and restoration experts and concerned citizens who have set up an enforcement task force. Machinery and labor provided by CDA will dismantle the restaurants including the removal of debris.\nA restoration model for the hill top has been approved by members of the committee and an architect will be hired. The hill top will be transformed into an open air space that promotes both public engagement and wildlife conservation. The plan is to create a Margallah Viewpoint that enhances public enjoyment while promoting awareness of indigenous flora and fauna. For this there will be:\n-Installation of comfortable benches for visitors to relax and enjoy the scenic views.\n-Planting of local flora to support biodiversity and create a natural habitat for wildlife.\n-Installation of educational displays featuring indigenous wildlife species to raise awareness about local biodiversity.\nA water harvesting system will be installed along with a reservoir to promote sustainable water use and management. The retaining walls of the terraces will remain but concrete inside will be removed for plantation. There will also be a small Emergency Response Facility with an area for quick response and first aid services, specifically for firefighting emergencies.\nThere will be implementation of a lighting management policy to switch off solar lights at sunset to minimize disturbance to wildlife. In the end all this is being done to protect their precious habitat. IWMB wishes to thank the Chief Justice of the Supreme Court Qazi Faez Isa for his landmark judgement upholding the earlier Islamabad High Court judgement by Justice Athar Minallah. As the CJ wrote in his order of 21st August 2024, “We must fulfill our designated role as stewards of the earth (khalifa fil ardh), embrace, protect and conserve the natural world; in it lies our survival, and our salvation”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:00:45.139Z"
}
