{
  "title": "IFA seals ketchup unit; discards over 1000 kg sauces, 100 kg ketchup",
  "link": "https://www.app.com.pk/national/ifa-seals-ketchup-unit-discards-over-1000-kg-sauces-100-kg-ketchup/",
  "date_published": "2024-09-11T07:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP):Deputy Director Operations (DDO) of Islamabad Food Authority (IFA) Dr. Tahira Saddique led by a food safety team (FST) has conducted a raid at a ketchup production unit in Model Town.\nDuring the operation, the IFA seized over 1,000 kilograms of sauces, 100 kilograms of ketchup, 130 kilograms of apricot sauce, and 82 kilograms of illegal additives. The authority immediately sealed the unit after discovering violations of food safety regulations.\nTalking to APP, Dr Tahira Saddique said that the IFA has intensified its efforts to combat the production and sale of unsafe food products. A recent raid uncovered serious violations at a ketchup manufacturing unit in Model Town, leading to significant seizures and the closure of the unit.\nShe said that the ketchup did not meet the required standard of brix, a key indicator of sugar content in the product. The investigation revealed that the ketchup and sauces were being produced using powdered apricot paste mixed with banned colors, raising concerns about consumer safety.\nThe raid also uncovered a range of other health risks. Inspectors found insects in the storage drums, as well as broken floors and non-food utensils being used in the production process, further compromising the hygiene of the products, she added.\nFurthermore, the labels on the products were found to be misleading, containing inaccurate information about the contents. This amounted to deceiving customers and violating labeling regulations.\nDue to these violations, the unit was sealed, and the Islamabad Food Authority vowed to continue taking strict action against those involved in producing unsafe food.\nDr. Tahira emphasized that no business would be allowed to operate if it fails to meet health and safety standards.\nThe Islamabad Food Authority’s ongoing crackdown aimed to eliminate unsafe food production practices in the region and protect consumers from harmful products.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:00:52.198Z"
}
