{
  "title": "PM assures maximum facilitation of sportsmen to bring laurels to country",
  "link": "https://www.app.com.pk/national/pm-assures-maximum-facilitation-of-sportsmen-to-bring-laurels-to-country/",
  "date_published": "2024-09-11T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): Prime Minister Shehbaz Sharif on Wednesday assured the government’s all-out support to the sportsmen to facilitate their participation in international contests and enable them to bring laurels to Pakistan.\nThe prime minister, talking to the office bearers of the Pakistan Mixed Martial Arts Federation and athletes at the PM House, appreciated the Pakistani athletes for winning 12 medals in the International Mixed Martial Arts Federation Championship held here.\nThe delegation comprised President of Pakistan Mixed Martial Arts Federation Umar Ahmed, champions Eman Khan and Bano Butt, Brave Combat Federation winners Rizwan Ali, Zia Mashwani and Ismail Khan.\nFederal Minister for Information and Broadcasting Attaullah Tarar, Minister of State for Information Technology Shaza Fatima Khawaja, Chairman of PM Youth Program Rana Mashood Ahmed Khan, Coordinator to PM Romina Khurshid Alam, Badar Shehbaz and relevant senior officers were also present.\n“Pakistan’s biggest asset is its talented youth. I wish the Pakistani players to keep bringing laurels to Pakistan globally in the international contests. You are a great asset to Pakistan. Your talent gives immense satisfaction for Pakistan’s bright future,” the prime minister remarked.\nHe assured that the government would extend all-out cooperation to mixed martial arts as the promotion of sports was among its priorities.\nRecalling his contributions to the sports while being Punjab chief minister, he mentioned the establishment of the Pakistan Sports Endowment Fund and ensuring transparency in the selection process of the sportsmen.\nBeing the prime minister, this is my responsibility to extend maximum support to the players to make them participate in international competitions.\nHe also appreciated the Mixed Martial Arts Federation for holding the international event in Pakistan.\nThe members of the delegation apprised the prime minister of the recently held international contests held by the Federation in collaboration with PM Youth Program.\nAs the delegation put forward their proposals for the promotion of mixed martial arts in the country, Prime Minister Shehbaz instructed the authorities concerned to present an action plan on the suggestion.\nDuring the meeting, the athletes also expressed their appreciation for the Federation and PM Youth Program for their facilitation and the prime minister for hosting them at the PM House.\nLater, MMA Federation President Umar Ahmed, in his remarks, said that the Asian MMA Championship 2024 was participated by around 300 athletes from across 18 countries. Pakistan has bagged 12 medals including two gold medals won by Eman Khan and Bano Butt in their respective categories.",
  "retrievedAt": "2025-08-10T20:59:41.860Z"
}
