{
  "title": "Monsoon floods damaged schools, disrupted education in Sindh: UNICEF",
  "link": "https://www.app.com.pk/national/monsoon-floods-damaged-schools-disrupted-education-in-sindh-unicef/",
  "date_published": "2024-09-11T17:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): United Nations International Children’s Emergency Fund (UNICEF) on Wednesday said that monsoon floods in Sindh had forced thousands of children out-of-school, as Pakistan struggled with recurring extreme weather events disrupting education and putting young lives at risk.\n“Children in Sindh are facing serious setbacks in their education due to extreme weather conditions, with 230,000 students impacted by school closures caused by severe monsoon floods”, UNICEF’s representative in Pakistan, Abdullah Fadil said.\nThe floods have swept through southern Pakistan, damaging over 1,300 schools, and fully destroying 228 of them. In addition, more than 450 schools are not operational because they are surrounded by floodwater, according to recent data from Sindh’s Education Department.\nThe immediate consequence is that many children are missing out on their education. Sindh is no stranger to such climate-related disruptions. The government has already announced an education emergency, with 26.2 million children out-of-school nationwide. Further disruptions caused by the floods risk worsening the situation for those in already vulnerable areas.\n“From heatwaves to floods, children are constantly being prevented from attending school due to these climate-related shocks. Pakistan, already struggling with an education crisis, cannot afford to see more children falling behind,” Fadil said.\nHe emphasized the need for a swift return to normalcy, expressing hope that floodwaters will recede quickly so that children can return to school. However, he also warned that prolonged school closures may discourage children from going back at all, worsening the education crisis.\nSince July 1, the monsoon season has claimed 76 lives in Sindh, half of whom were children. Swollen rivers have submerged homes across the region, displacing 140,000 children and families in 10 districts declared calamity-hit.\nOn the ground, UNICEF teams are working quickly to assess the needs of affected communities. They are coordinating with the government and local partners to develop immediate and long-term plans to restore access to education and help families recover, he added.\nThis isn’t the first time Sindh has been hit hard by extreme weather. The province was the worst affected by the devastating floods of 2022, which destroyed vital infrastructure, including health and education facilities.\nFadil reiterated the urgent need for investment in education that can withstand the impacts of climate change. “The monsoon has once again disrupted lives in Pakistan, with children losing not just their homes but also their schools,” he said.\nHe stressed that the country must prioritize climate-resilient education systems and services for children. “We need a coalition of partners to come together, innovate, and adapt in order to mitigate the effects of climate change on education in Pakistan,” Fadil added.\nUNICEF and its partners aim to focus on building education systems that can better withstand extreme weather conditions in the future, so children can continue learning even in the face of climate-related disruptions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:59:16.276Z"
}
