{
  "title": "Syrus Sajjad Qazi bids farewell to 34-year diplomatic career",
  "link": "https://www.app.com.pk/national/syrus-sajjad-qazi-bids-farewell-to-34-year-diplomatic-career/",
  "date_published": "2024-09-10T19:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): Foreign Secretary Ambassador Syrus Sajjad Qazi concluded his illustrious career on Tuesday upon reaching the age of superannuation, ending a distinguished 34-year tenure during which he served the country in multiple capacities.\nSpeaking at the farewell reception held at the Ministry of Foreign Affairs, Ambassador Syrus expressed his gratitude to all the ambassadors and superiors he worked with, acknowledging the unique impact each of them had on shaping his personality.\nHe recognized the contributions of his staff members throughout his career by naming each one and expressing his gratitude for their support.\nHe expressed gratitude to the team at the Foreign Secretary’s Office for their support and assistance. He also extended thanks to all the foreign ministers with whom he collaborated and acknowledged the deputy prime minister/foreign minister for his leadership.\nDeputy Prime Minister and Foreign Minister Muhammad Ishaq Dar paid tribute to an exceptional public servant and distinguished officer of Pakistan’s Foreign Service. He highlighted Muhammad Syrus Sajjad Qazi’s 34 years of exemplary service to the country.\nDar acknowledged Syrus’s numerous contributions, noting his pivotal role in shaping Pakistan’s foreign policy and managing global diplomacy with steadfast commitment and integrity over more than three decades.\nAs Foreign Secretary and previously as Ambassador to Turkiye and Hungary, Syrus significantly advanced Pakistan’s foreign relations and global partnerships, playing a crucial role in shaping diplomatic efforts worldwide.\nDar praised Syrus for his clear assessments and strategic advice, which have been invaluable to the Government of Pakistan. His profound insights and deep understanding of foreign policy priorities and national interests stood out in high-level meetings.\nIn recent months of close collaboration, Dar observed Syrus as a brilliant individual with sharp intellect and a strong dedication to serving Pakistan. Syrus’s unwavering honesty and commitment to transparency and ethical governance were particularly noteworthy.\nDar came to rely on Syrus’s wise counsel and understanding of Pakistan’s foreign policy challenges and priorities. Syrus’s ability to calmly assess complex situations, provide sound advice, and uphold his principles was truly inspiring.\nDar also noted the confidence Syrus inspired among leadership within the Ministry and foreign counterparts. His dedication to the Ministry and the welfare of officers and staff was evident.\nSyrus’s steady presence will be missed by many as he has inspired a new generation of diplomats who will continue to\nserve Pakistan for years to come. As a member of the Federal Public Service Commission, Syrus is expected to make further contributions to the development of the Foreign Service of Pakistan.\nIn his 34 years of service, Syrus has left an indelible mark on both Pakistan’s foreign policy and the Ministry of Foreign Affairs. Dar congratulated Syrus on his distinguished career and conveyed best wishes for a fulfilling new chapter as a member of the Federal Public Service Commission. On behalf of the Ministry of Foreign Affairs and the Government of Pakistan, heartfelt gratitude was expressed for his dedicated service, with sincere hopes for continued success in all future endeavors. Syrus will be missed, and his contributions will be deeply appreciated and valued.\nIn her speech marking the occasion, the new Foreign Secretary Amna Baloch expressed gratitude to the outgoing foreign secretary for his exceptional leadership and significant contributions throughout his 34-year diplomatic career. She commended his professionalism, sharp insight, and approachable demeanor.\nShe highlighted his adept handling of the shifting geopolitical landscape, praised his humanitarian approach and exceptional interpersonal skills, and wished him and his family the best for his upcoming role as a Member of the FPSC. She also paid tribute to his outstanding diplomatic career.\nAmbassador Muhammad Syrus Sajjad Qazi assumed charge as the 32nd Foreign Secretary of Pakistan on August 17, 2023. Ambassador Qazi was most recently serving as Special Secretary (Administration) at the Ministry of Foreign Affairs.\nBorn in 1964, Ambassador Qazi joined the Foreign Service of Pakistan in 1990. He holds an MBBS degree as well as a Master’s Degree in Public Diplomacy. He is married, with three children.\nHe was previously Pakistan’s Ambassador to Türkiye (2017-2022) and Hungary (2015-2017). Ambassador Qazi has extensive experience of working on both bilateral and multilateral issues.\nHe has served in Pakistan’s Mission to the United Nations in Geneva (1995-1999), the High Commission of Pakistan in New Delhi (2005-2006), and the Embassy of Pakistan in Washington, DC (2006-2013).\nAt the Headquarters, Ambassador Qazi has worked as Desk Officer for the United States (1992-1995), as Desk Officer on\nhuman rights-related issues in the UN Division (1999-2002), and on the Foreign Secretary’s staff (2004-2005).\nHe also served as the Joint Secretary for Foreign Affairs at the Prime Minister’s Office from 2013 to 2015. Ambassador Qazi also served on deputation with the United Nations Development Fund for Women (UNIFEM) in Islamabad from 2002 to 2004.",
  "retrievedAt": "2025-08-10T21:00:32.436Z"
}
