{
  "title": "Virus takes 104 lives, infects 3,256 more people",
  "link": "https://www.app.com.pk/national/virus-takes-104-lives-infects-3256-more-people/",
  "date_published": "2021-05-19T09:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP): The national tally of total active COVID-19 cases on Wednesday was recorded 66,377 with 3,256 new cases during the last 24 hours.\nAccording to the latest update issued by the National Command and Operation Centre (NCOC), 4,440 virus patients recovered and 104 died. Eighty eight (88) were under treatment in the hospitals, 43 of them were on ventilators and 16 out of the hospitals in their respective quarantines or homes. Most of the deaths were occurred in Punjab followed by Sindh.\nThere were 4,549 Covid infected patients under treatment in critical care among 188 admitted during past 24 hours in various Covid dedicated healthcare facilities.\nThe national Covid positivity ratio during past 24 hours was recorded 7.79 percent.\nThe maximum ventilators were occupied in four major areas including Lahore 58 percent, Multan 68 percent, Bahawalpur 48 percent and Peshawar 37 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) were also occupied in four major areas of Gujranwala 51 percent, Multan 60 percent, Swabi 47 percent and Peshawar 42 percent.\nAround 567 ventilators were occupied elsewhere in the country while no Covid affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 41,771 tests were conducted across the country on Tuesday, including 14,041 in Sindh, 16,051 in Punjab, 6,198 in Khyber Pakhtunkhwa (KP), 2,814 in Islamabad Capital Territory (ICT), 1,521 in Balochistan, 342 in GB, and 804 in AJK.\nAround 799,951 people were recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 882,928 cases were detected that also included the perished, recovered and under treatment Covid patients so far, including AJK 18,360, Balochistan 24,064, GB 5,439, ICT 79,552, KP 127,609, Punjab 329,913 and Sindh 301,247.\nAbout 19,856 deaths were recorded in the country since the eruption of the contagion.\nAround 4,835 were perished in Sindh among eight of them died in hospital and three out of hospital on Tuesday. 9,563 in Punjab had died with 63 deaths occurred in past 24 hours.\n50 of them in the hospital and 13 out of hospital. 3,827 in KP where 23 of them died in hospital on Tuesday, 735 in ICT among two of them died in the hospital on Tuesday, 270 in Balochistan among three of them died in the hospital on Tuesday, 107 in GB and 519 in AJK among two of them succumbed to the deadly virus in the hospital on Tuesday.\nA total of 12,552,339 corona tests were conducted so far, while 639 hospitals were equipped with Covid facilities. Some 4,994 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:44:38.048Z"
}
