{
  "title": "PM visits site of Mohmand Dam to oversee construction work",
  "link": "https://www.app.com.pk/national/pm-to-oversee-mohmand-dam-construction-work-today/",
  "date_published": "2021-05-19T05:39:00.000Z",
  "source": "APP",
  "content": "MOHMAND, May 19 (APP): Prime Minister Imran Khan visited the site of Mohmand Dam on Wednesday to review the ongoing construction work.\nChairman Water and Power Development Authority (WAPDA) Lt Gen (retd) Muzammil Hussain briefed the prime minister on the progress of the project.\nThe Mohmand Dam hydropower project is the first mega dam in five decades, the groundbreaking of which Dam was performed by Prime Minister Imran Khan on May 2, 2019.\nThe Mohmand Dam being constructed on Swat River will help in areas including flood protection, agriculture and crop needs, water security and environment-friendly electricity supply.\nThe dam costing Rs 309.6 billion will be constructed 218 meters high with a storage capacity of 1.293 million acre feet water and will generate 800-megawatt electricity.\nIn the areas of electricity, irrigation and flood protection, Mohmand Dam will save Rs 51 billion annually. It will yield an annual revenue of Rs 45.76 billion and create over 6,100 job opportunities.\nOn directions of Prime Minister Imran Khan, the work on the project is in full swing which even was not halted during the pandemic.\nThe work is in progress at nine different sites and the WAPDA is committed to complete the project by year 2025.\nWork in full swing at Mohmand Dam. PM Imran Khan is visiting to review the construction work. This dam ll have water storage capacity of 1.293 MAF & help generate 800 MW of electricity. Chairman @wapda_pr Lt Gen Muzammil Hussain will brief the PM about the progress on the project\n— Senator Faisal Javed Khan (@FaisalJavedKhan) May 19, 2021\nTwo canals are being constructed in Punjab, which on completion will greatly improve the supply of cheap electricity as well as water for agricultural purposes. It will produce 2.86 billion units of power annually.\nThe Mohmand Dam will save Peshawar, Nowshera and Charsadda from floods and will irrigate around 180,000 acres of land.",
  "retrievedAt": "2025-08-11T20:44:35.535Z"
}
