{
  "article_id": "2025-04-22_f964a68b4df869cb942db7cee64ae30a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/jazz-unveils-new-leadership-principles-to-power-its-transformation-into-digital-service-company/",
    "retrieved_at": "2025-08-27T14:46:00.616Z"
  },
  "metadata": {
    "title": "Jazz unveils new leadership principles to power its transformation into Digital Service Company",
    "author": null,
    "date_published": "2025-04-22T12:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 250,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 22 (APP): As Jazz accelerates its evolution from a telecom operator to a full-fledged ServiceCo, the company has launched a bold set of Leadership Principles to anchor this transformation in a culture of purpose-driven leadership, accountability, and inclusion. Designed for every level of the organisation-from frontline employees to the Executive Leadership Team-the principles serve as a unifying framework to inspire action, foster ownership, and build a future-ready workforce, said a news release. \"This is more than a framework-it's a mindset shift,\" said Tazeen Shahid, Chief People Officer at Jazz. \"We're building a culture where leadership is not defined by role, but by behaviour. These principles will guide how we show up for each other, our customers, and the country.\" The Leadership Principles are structured across four tiers-Everyone, People Managers, Female Leadership Team (FLT), and the Executive Leadership Team (ELT)-reflecting Jazz's commitment to inclusive leadership development at every level. Each tier sets out clear behaviours aligned with Jazz's values: acting with integrity, thinking customer-first, embracing diverse perspectives, and shaping the future through innovation. With over 73 million connectivity customers, 100 million+ digital users, and a growing presence in fintech (JazzCash), entertainment (Tamasha), digital self-care (SIMOSA), InsurTech (FikrFree), and enterprise cloud solutions (Garaj), Jazz's transformation into a ServiceCo requires not just strategic change-but cultural clarity. These Leadership Principles are the foundation of that shift. By redefining leadership for the digital age, Jazz is investing not just in products, but in people-and in a future where every employee leads with purpose.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}