{
  "title": "PCB suspends player NOCs for overseas T20 leagues: report - Sport - DAWN.COM",
  "author": null,
  "content": "The Pakistan Cricket Board (PCB) has suspended all no-objection certificates (NOC) for players who want to participate in T20 leagues outside Pakistan, ESPNcricinfo reported on Tuesday.\n\nAccording to the report, PCB Chief Operating Officer Sumair Ahmad Syed issued a notice to the players and their agents, making the announcement.\n\nThe notification, seen by ESPNcricinfo, read: “With the approval of chairman PCB, all NOCs for players with respect to participation in leagues and other out of country tournaments are hereby put on hold until further orders.”\n\nAccording to the publication, the reason behind the move is currently unknown.\n\n“Reports have suggested the PCB aims to tie NOCs to a performance based system, the criteria for which has not been made public. The goal, from the board’s perspective, is for players to incentivise national and domestic performances. However, there is no information on how long such an evaluation will take before the current suspension on NOCs is lifted,” the report said.\n\nAccording to ESPNcricinfo, seven Pakistani players, including Babar Azam, Muhammad Rizwan, and Shaheen Afridi, are expected to take part in Australia’s Big Bash League (BBL) which will be held in December.\n\nAdditionally, 16 Pakistani players, including Naseem Shah, Saim Ayub and Fakhar Zaman, are in the shortlist to participate in the International League T20 auction which will be held on October 1 in the United Arab Emirates (UAE), it said.\n\nMeanwhile, Pakistan’s own domestic first-class tournament, the Quaid-e-Azam Trophy, will begin on October 6, with 18 regional teams, divided into three groups, vying for a win.\n\nThe development comes two days after the Green Shirts lost the Asia Cup 2025 final against arch-rivals India, after also having lost twice to the Indian team in previous matches during the tournament. The tournament had come on the heels of Pakistan winning the T20 International tri-series which included Afghanistan and the UAE.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/30140043558ed38.webp",
  "retrievedAt": "2025-10-12T00:18:59.425Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945639/pcb-suspends-player-nocs-for-overseas-t20-leagues-report",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T09:43:02.000Z"
}
