{
  "title": "People suffer as Sindh govt employees prolong strike against pension reforms - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR/LARKANA/HYDERABAD: Thou­sands of patients had to suffer agonising disruption in their treatment at almost all government healthcare facilities, including major hospitals, on Monday as Sindh government employees prolonged their strike over newly introduced pension reforms.\n\nThe strike, observed on a call given by the Sindh Employees Alliance (SEA) for Sept 23-27, continued on Monday without any formal announcement.\n\nLabour leaders address­ing participants of different rallies, demonstrations and sit-ins held in all cities and towns of the province told the audience that the strike was being prolonged due to Sindh government’s indifference towards their sustained struggle and even the five-day strike.\n\nThe SEA had on Saturday declared end to the strike on Saturday as per the original schedule and announced that in the next phase, a sit-in would be held outside Bilawal House in Karachi on October 6 if its demands were not met by then.\n\nHealth, education, revenue and over 35 other departments stay shut for a seventh consecutive day over pension reforms\n\nPatients and their attendants at all government hospitals and healthcare units were seen desperately seeking doctors’ advice and treatment but in vain due to absence of doctors, paramedics and other staff at OPDs. Only emergency services were available at these facilities.\n\nDepartments stay shut\n\nMore than 40 departments, including health, education and revenue, remained shut across Sindh for a seventh consecutive day causing immense problems to millions of people seeking official services.\n\nAt each department, scores of people, including those coming from far flung areas, were seen being turned back by striking employees present outside their locked offices.\n\nAt Sukkur Civil Hospital, patients and attendants of in-house patients were seen waiting outside the locked OPDs and begging doctors and paramedics to spare a few minutes to give their advice. But they were denied any help.\n\nThe number of patients visiting the hospital along with their attendants rain into hundreds by the evening.\n\nThe agitating employees held a demonstration on the hospital’s premises and kept raising slogans against pension reforms and the ruling party’s indifference towards their plight.\n\nThey vowed to continue the strike until their demands were met.\n\nIn Larkana, a complete lockout of hospitals, universities, colleges, schools and departments was observed on Monday on SEA’s call.\n\nThe alliance’s main demands are withdrawal of the ‘black law’ pertaining to pension and the release of the Disparity Reduction Allowance (DRA).\n\nMale and female doctors, paramedics, officers, clerks and other employees wore black armbands and held a sit-in for four hours in the scorching heat in front of the Larkana Press Club. They carried banners and placards inscribed with their demands and kept raising slogans.\n\nThe SEA strike is supported by Government Secondary Teachers Association, Primary Teachers Association, APCA Sindh, Gazetted Officers Association, Sindh Professors and Lecturers Association (Sukkur region), Highways CBA, All Universities Employees Association, Pakistan Paramedical Staff Association, Pakistan Medical Association, (Hyderabad) and many other organisations.\n\nSPLA rejects pension reforms\n\nThe central executive meeting of the Sindh Professors and Lecturers Association (SPLA) decided to reject the Sindh government’s pension reforms and announced full support for the Sindh Employees Alliance in their demand to withdraw the so-called reforms.\n\nThis was decided in a meeting held on Monday at Government Degree Boys College, Gulistan-i-Jauhar, under the chairmanship of the central president of SPLA, Professor Munawar Abbas.\n\nIt was decided to take legal action against the freezing of house rent, conveyance allowance and medical allowance and stressed that the same be increased in line with inflation.\n\nPTI submits resolution in PA\n\nThe opposition Pakistan Tehreek-i-Insaf (PTI), Sindh, on Monday threw its weight behind the ongoing protest of government employees, with its lawmaker Sajad Ali Soomro tabling a resolution in the Sindh Assembly demanding immediate withdrawal of pension reforms.\n\nThe resolution stated that the provincial government had attempted to deprive employees of their economic rights under the guise of reforms. It described the move as ‘economic murder’ of employees and urged the government to address their legitimate demands without delay.\n\nThe resolution warned that depriving employees of their pension was tantamount to ‘robbery of rights’ and an ‘act of sheer injustice’. It said government servants depend on pension for their livelihood after retirement, and stripping them of this facility was unacceptable.\n\nHighlighting the impact of the ongoing strike, the PTI lawmaker said educational institutions across the province had been closed for a week, placing students’ future at serious risk. He cautioned that further closures would not only affect education but also disrupt wider public services.\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68daf77e1fb29.gif",
  "retrievedAt": "2025-10-12T04:27:54.854Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945475/people-suffer-as-sindh-govt-employees-prolong-strike-against-pension-reforms",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:53:51.000Z"
}
