{
  "title": "Work on Chashma Lift Canal to begin soon, says KP governor - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: Khyber Pakhtunkhwa Governor Faisal Karim Kundi has said that Chashma Lift Canal project would be inaugurated soon as the federal government and Wapda are serious about its execution.\n\nDuring an interaction with local political activists and social figures on Monday, the governor said that after necessary revisions, the work on the long-awaited project would finally begin.\n\nThe governor said efforts were underway to expand public services in Dera, with Nadra, passport and other government offices being set up in major villages to provide facilities at the doorstep of citizens.\n\nMr Kundi said party workers who stood firm during difficult times would not be forgotten. He reaffirmed his commitment to service-oriented politics.\n\nOn this occasion, the youth representatives praised the governor for highlighting local issues and for projecting a positive image of the province.\n\nSimilarly, Governor Kundi, during his visit to Dera, also held a series of meetings with local political and social leaders to discuss regional issues and development needs.\n\nA delegation led by PPP leader Sardar Haji Mohammad Aqeel Damra met the governor and raised concerns over difficulty in getting gas connections, excessive electric load shedding, ‘malpractices’ in food department, and ‘corruption’ in supply of government medicines.\n\nLater, former provincial minister and head of Dera Aman Jirga Sardar Abdul Haleem Khan Qasuria hosted a dinner in honour of the governor.\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:19:13.596Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945511/work-on-chashma-lift-canal-to-begin-soon-says-kp-governor",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:52:29.000Z"
}
