{
  "title": "Eight shops gutted in Upper Dir market fire - Pakistan - DAWN.COM",
  "author": null,
  "content": "LOWER DIR: Eight shops were gutted when a fire broke out in Dog Dara Bazaar in Upper Dir in the early hours of Monday.\n\nLocal residents immediately rushed to the spot and managed to put out the fire after several hours of effort as no firefighting arrangements were available in the area at that time.\n\nWitnesses said valuable goods, furniture, and other items worth millions of rupees were reduced to ashes. The incident caused a severe financial setback to the affected traders, many of whom depended solely on their shops for livelihood.\n\nResidents complained that the absence of firefighting facilities in Dog Dara and nearby areas forced them to battle the flames with limited resources. They demanded the government establish a fire brigade system in Sheringal and other remote areas to prevent similar losses in the future.\n\nPolice said the exact cause of the fire could not be immediately determined. An investigation has been launched.\n\nDPO VISITS CHECKPOSTS: The newly-posted Lower Dir district police officer Taimur Khan visited Zaimdara police station on Monday.\n\nHe inspected the daily diary record, armoury, storehouse, lockups, residential barracks, and investigation files at the police station.\n\nLater, the DPO visited Kalpani checkpost, Gal and Suri Pao police posts, where he met with the officials and examined security arrangements. He inspected the CCTV cameras, and instructed the policemen to further tighten and streamline security checks to monitor suspicious individuals and vehicles effectively.\n\nHe directed policemen to treat citizens with courtesy, resolve their issues on priority, and turn police stations and checkposts into facilitation centres for the public.\n\nRECOVERED: A car stolen from Malakabad, Balambat in Lower Dir on Sept 22, was recovered four days later in Swat after police tracked it through CCTV footage from multiple locations.\n\nInvestigation officer Tariq Amin examined camera footages from Balambat, Timergara, and along the Chakdara-Shamozo Road. The car was traced to Mingora, where it was last seen taking a U-turn in Rahimabad area.\n\nAfter an extensive search of parking lots and vacant plots, the vehicle was finally recovered from an empty plot on Monday. Police said the suspects had been arrested and further investigation was under way.\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:19:13.429Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945512/eight-shops-gutted-in-upper-dir-market-fire",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:52:29.000Z"
}
