{
  "title": "ADB says sustained reforms, disaster resilience key to Pakistan’s continued economic growth - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan’s improved macroeconomic conditions have contributed to an uptick in growth in fiscal year 2025, underpinned by increased investment driven by continued policy reforms and economic stability, the Asian Development Bank (ADB) said in a report today.\n\nAccording to the Asian Development Outlook (ADO) September 2025, the ADB’s annual flagship economic publication, Pakistan’s growth is projected to continue in the medium-term, with real gross domestic product (GDP) growth forecast at three per cent in fiscal year 2026 as macroeconomic stability deepens through sustained reforms addressing structural vulnerabilities.\n\nIt said that economic reform had progressed considerably under the International Monetary Fund’s (IMF) Extended Fund Facility (EFF) that began in October 2024.\n\n“Policy consistency and climate resilience remain vital to maintaining the growth momentum. Downside risks to the outlook remain high,” the ADB report said.\n\nMeanwhile, ADB Country Director for Pakistan Emma Fan was quoted as saying, “Pakistan’s growth prospects remain positive. However, the country continues to face structural challenges, compounded by recurring disasters such as the recent floods. In this context, consistent reforms and policy implementation are essential for reinforcing policy credibility, sustaining economic momentum, and enhancing the country’s resilience.”\n\nThe report said that in the new fiscal year, economic activity is expected to strengthen, supported by improved external buffers and renewed business confidence following the US-Pakistan trade agreement.\n\nHowever, the damage caused to infrastructure and farmland by the recent floods may weigh on growth, it said.\n\n“Recovery and rehabilitation efforts, bolstered by fiscal incentives for the construction sector announced in the FY2026 budget, are expected to partially offset the adverse impact,” it added.\n\nIt further said that average inflation is projected to increase to six per cent in fiscal year 2026, reflecting the impact of flood-related supply chain disruptions on food prices and the increase in gas tariffs. “In response, the central bank is expected to adopt a cautious approach to easing monetary policy to stabilise inflation within its medium-term target range of five per cent to seven per cent,” it said.\n\nIt further stated that investment is anticipated to increase with greater business confidence, declining interest rates, and adherence to fiscal consolidation, which will lower government borrowing needs and allow more lending for private investment. Key tariff reforms under the updated National Tariff Policy 2025–2030 and liquidity support for exporters through a digitalised income tax refund system will improve export competitiveness, also encouraging private investment, the report added.\n\nWorkers’ remittances will be bolstered by maintaining external stability through a robust policy framework and a stable exchange rate, and by the need to support families back home who struggle to recover from the floods. Higher remittances may partly offset a decline in private consumption resulting from lower agricultural output and, consequently, reduced farm incomes, it detailed.\n\nIt noted that the government aims to sustain fiscal consolidation by increasing revenue and containing spending. The FY2026 budget targets a primary surplus equal to 2.4 per cent of GDP and an overall deficit of 3.9 per cent, gradually declining over the medium-term. Tax revenue is projected to reach 13.2 per cent of GDP in fiscal year 2026, underpinned by tax administration and policy efforts, it said.\n\nMeanwhile, the report stated that the external balance is forecast to remain stable over the medium-term. Export growth is expected to remain subdued by flood-related disruption to rice and cotton production. However, improved liquidity — driven by faster tax refunds and lower production costs under supportive monetary conditions — may help offset the impact of reduced agricultural output, it said.\n\nImports are expected to grow faster as food imports increase to address flood-induced shortages and raw material imports increase because of the expected recovery in manufacturing, thereby widening the trade deficit. However, a more functional foreign exchange market with a flexible exchange rate is expected to ensure resilience in workers’ remittances and keep the current account nearly balanced in fiscal year 2026, the report said.\n\nHigher multilateral and bilateral inflows, including flood relief and assistance, along with ongoing central bank foreign exchange purchases, are expected to raise gross international reserves in June 2026 to $17.7 billion, providing 2.8 months of import cover, it said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:18:59.675Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945627/adb-says-sustained-reforms-disaster-resilience-key-to-pakistans-continued-economic-growth",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T07:38:53.000Z"
}
