{
  "title": "AJK paralysed by competing protests, communications blackout - Pakistan - DAWN.COM",
  "author": null,
  "content": "• At least one person killed, policeman among dozen injured\n• JKJAAC, ‘peace rally’ participants accuse each other of fomenting violence\n• Protest leaders call for another gathering at Lal Chowk today\n\nMUZAFFARABAD: At least one person was killed and over a dozen others were injured — including a policeman — in the Azad Jammu & Kashmir (AJK) capital on Monday, as the region observed a shutter-down and wheel-jam strike amid a communications blackout.\n\nThe strike, called by the Jammu Kashmir Joint Awami Action Committee (JKJAAC) over the issue of its unfulfilled charter of demands, saw rival groups stage simultaneous protests, which accused each other of fomenting violence during an otherwise peaceful demonstration.\n\nMobile and internet services have remained suspended in AJK since Sunday noon, and sources said the curbs could continue until Wednesday.\n\nThe casualties occurred around Neelum Bridge after midday, when a ‘peace rally’ led by Muslim Conference leader Raja Saqib Majeed clashed with the JKJAAC protesters who were gathered there.\n\nThe strike was announced last week, after JKJAAC-government negotiations remained deadlocked over the abolition of elite privileges and seats reserved for the Pakistan-based refugees from Indian-occupied Jammu and Kashmir.\n\nWitness accounts\n\nWitnesses claimed that participants of the peace rally fired upon peaceful JKJAAC demonstrators “without any provocation”.\n\nGhulam Mustafa, a bystander, said one bullet hit Mohammad Sudheer, 30, who owned a crockery shop at Tahli Mandi Road. “By the time we reached CMH, he had lost consciousness due to excessive bleeding,” he said.\n\nAn official at the Combined Military Hospital confirmed that Sudheer died during treatment.\n\nMohammad Basharat, 50, a shopkeeper in Shokat Lines, was wounded by shrapnel.\n\nHe claimed that demonstrators had tried to make space to let Mr Majeed’s convoy pass, but said that members of his posse came out of their vehicles and attacked them.\n\nAccording to another eyewitness, the peace rally was protected by police and paramilitary troops. Police lobbed tear-gas shell on JAC demonstrators, and fired at them.\n\nPeople at the hospital showed spent bullet casings, which they said they had collected them from the ground while trying to rescue injured people.\n\n“When the action committee had already given a call for lockdown for Sept 29, why was Mr Majeed allowed to hold a so-called peace march on the same day?” questioned 20-year-old shopkeeper Raja Safeer, who was among those in the emergency ward.\n\nDue to the communications blackout, neither local officials nor Mr Majeed could not be reached for comment.\n\nIncidentally, some local media reports suggested that the peace rally had been fired upon by JAC protesters, but this could not be independently verified.\n\nAnother gathering today\n\nLater in the evening, hundreds of people gathered at Muzafarrabad’s Lal Chowk, where JAC leaders including Shaukat Nawaz Mir delivered charged speeches.\n\nMr Mir alleged that some elements wanted to create a May 9-like situation in AJK for reasons best known to them, and urged the army chief to take stock of the situation.\n\nMr Mir called on the charged crowd to reassemble at the same spot at 11am today (Tuesday) for the next course of action.\n\nAll businesses and shops remained shuttered and street vendors away almost across the AJK, while roads also remained deserted.\n\nReports also suggested that similar gatherings were staged in Rawalakot and Sudhnoti, while in Bhimber, a rally was led by PM Chaudhry Anwarul Haq’s brother, Ehsanul Haq, who is associated with the PTI.\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68db047736e52.jpg",
  "retrievedAt": "2025-10-12T04:27:01.027Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945570/ajk-paralysed-by-competing-protests-communications-blackout",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:49:43.000Z"
}
