{
  "title": "Serbia arrests 11 accused of stirring religious hate - World - DAWN.COM",
  "author": null,
  "content": "BELGRADE: Serbian police have arrested 11 people over hate-motivated acts in France and Germany, including defacing Jewish sites and placing pigs’ heads near mosques, authorities said on Monday.\n\nA twelfth suspect, “currently on the run”, is accused of training the group nationals on “the instructions of a foreign intelligence service”, the Interior Ministry said in a statement, without specifying their nationality.\n\n“Their objective was also to spread ideas advocating and inciting hatred, discrimination and violence based on differences,” the statement said.\n\nFrance has launched a series of investigations in recent years into acts of vandalism linked to foreign interference, with many observers pointing the finger at Moscow.\n\nThose attacks have often targeted the country’s significant Jewish and Muslim communities, at a time of heightened tensions over the conflict in Gaza. The heads of nine pigs, considered impure in Islam, were found in early September outside mosques in Paris and the surrounding region, sparking outrage and alarm over rising anti-Muslim hatred.\n\nAccording to the ministry, between April and September, the group alle­gedly committed a num­ber of attacks in Paris and its surroundings, including throwing green paint on the Holocaust Museum, several synagogues and a Jewish restaurant.\n\nThey also posted stickers with “genocidal” content and left pig heads near Muslim religious sites, some of which were tagged with French President Emmanuel Macron’s name.\n\nIn Germany, “concrete skeletons” inscribed with messages were also left at the Brandenburg Gate. France is home to the world’s largest Jewish population outside Israel and the United States, as well as a substantial Muslim community sympathetic to the plight of the Palestinians in the Gaza Strip.\n\nSeveral EU nations have reported a spike in both anti-Muslim hatred and antisemitism since the beginning of the conflict in October 2023, according to the EU Agency for Fundamental Rights.\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:19:25.772Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945545/serbia-arrests-11-accused-of-stirring-religious-hate",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:50:23.000Z"
}
