{
  "title": "JUI-F chief rejects US-sponsored Gaza peace plan without Hamas - Pakistan - DAWN.COM",
  "author": null,
  "content": "Jamiat Ulema-i-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman on Tuesday rejected the 20-point peace plan for Gaza announced by US President Trump yesterday, saying that it could be a formula for Israel’s expansion, but it cannot be one for the recognition of a Palestinian state or the liberation of Jerusalem.\n\nAccording to a statement issued by the JUI-F media cell, addressing a press conference in Lahore today, Fazl said: “Today is the day of Trump and (Israeli Prime Minister Benjamin) Netanyahu.”\n\nA day earlier, Trump, alongside Netanyahu, unveiled a 20-point plan for Gaza, seeking to broker a ceasefire, a hostage exchange, demilitarisation, and a transitional governance structure.\n\nThe two leaders have warned that Israel would “finish the job” against Hamas if the Palestinian group rejects the deal.\n\nKey Muslim nations have thrown their weight behind the plan while Washington’s European allies have urged Hamas to accept it.\n\nTrump said that “Hamas and other terror organisations will play no role in the governance of Gaza, at all”.\n\nThe JUI-F chief noted that Hamas is an elected party of the people. “So ignoring Hamas means that you are trying to force a decision on them.”\n\nHe said that at present, the US has made Hamas indifferent in all its talks and narratives, “while the real side is Hamas”.\n\n“The Palestinian issue can never be resolved without recognising Hamas as the real party,” he added.\n\n“It’s surprising that the US is brazenly backing this criminal (Netanyahu),” he said.\n\nFazl declared that no decision can be forced on the Palestinian people until they decide for themselves.\n\n“Israel does not recognise the existence of Palestine and Palestine does not recognise the existence of Israel.”\n\nHe added that in such a situation, the two-state solution may be anyone’s suggestion or wish, but no one has the right to force their wish on Palestine.\n\nDuring his press conference, Trump had said: “The prime minister and the field marshal of Pakistan … they were with us right from the beginning. In fact, they just put out a statement that they fully believe in this pact,” Trump said, referring to a statement issued on Monday by PM Shehbaz Sharif. “They back this 100 per cent,” he said.\n\nEarlier, in a post on X, PM Shehbaz Sharif welcomed the US president’s “20-point” plan to bring the Israeli invasion of Gaza to an end.\n\nThe JUI-F chief took a dig at PM Shehbaz and Chief of Army Staff (COAS) Field Marshal Asim Munir.\n\n“They (PM and COAS) should look at their previous and recent statements themselves to see how much they contradict.”\n\nThe PTI has also expressed its “deep concern” over Trump’s peace plan for Gaza as it “seeks to determine the future of Palestine without ensuring the free will and consent of the Palestinian people”.\n\nA statement shared by PTI Information Secretary Sheikh Waqas Akram on X read: “The recognition of Jerusalem as Israel’s capital and the acceptance of the occupied Syrian Golan Heights as Israeli territory are in clear violation of international law and UN resolutions, and they undermine global efforts for a just and lasting peace.”\n\nIt added that former prime minister Imran Khan has “consistently reaffirmed Pakistan’s principled position that peace in the Middle East can only be achieved through a fair two-state solution, one that fully reflects the aspirations of the Palestinian people themselves”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/3020103934af81e.webp",
  "retrievedAt": "2025-10-12T00:18:57.814Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945665/jui-f-chief-rejects-us-sponsored-gaza-peace-plan-without-hamas",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T15:39:31.000Z"
}
