{
  "title": "US mulls supplying Ukraine with long-range missiles - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON/MOSCOW: US President Donald Trump’s envoy Keith Kellogg has floated the possibility of long-range strikes by Ukraine against Russia with American weapons, following the administration’s recent pivot on the conflict.\n\nIn a Fox News interview broadcast on Sunday, Kellogg was asked whether Trump had authorised strikes deep into Russian territory — days after Moscow was accused of sending fighter jets and drones that violated the airspace of several European nations.\n\n“Reading what (Trump) has said and reading what Vice President (JD) Vance has said, as well as (Secretary of State Marco) Rubio, the answer is yes,” he said.\n\n“Use the ability to hit deep. There are no such things as sanctuaries.”\n\nVice president Vance said in a separate Fox News programme on Sunday the US was having “conversations” on whether to give long-range Tomahawk cruise missiles to Kyiv, a request Trump has previously denied.\n\nMoscow warns of escalation risk if Washington sends Tomahawks to Kyiv\n\n“It’s something that the president is going to make the final determination on,” Vance said, referring to the missiles, adding that the US was “looking at a number of requests from the Europeans”.\n\nTrump said last week after meeting Ukrainian President Volodymyr Zelensky that Kyiv was in a position, with the European Union’s help, to fight and win “all of Ukraine back in its original form.” Russia annexed the Ukrainian Black Sea peninsula of Crimea after an operation in 2014 and now controls regions in eastern and southern Ukraine following Moscow’s full-scale invasion in February 2022.\n\nIt marks a shift on Ukraine for Trump, who told Zelensky during a televised Oval Office bust-up in February that “you don’t have the cards” to beat Russia. Russia has vowed to press on with its offensive in the three-and-a-half-year-long conflict, with the Kremlin recently dismissing Trump’s claim that the country was a “paper tiger” with a floundering economy.\n\nKremlin reaction\n\nKremlin spokesperson Dmitry Peskov said in a press briefing on Monday that there was “no panacea that can change the situation on the front for the Kyiv regime”.\n\n“There’s no magic weapon. Whether it’s Tomahawks or other missiles, they won’t be able to change the dynamic.”\n\nRussia said that its military was analysing whether or not the United States would supply Tomahawk cruise missiles to Ukraine for strikes deep into Russia, a step that Russian officials say could trigger a steep escalation.\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68db010b6a1e3.gif",
  "retrievedAt": "2025-10-12T00:19:25.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945554/us-mulls-supplying-ukraine-with-long-range-missiles",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:49:43.000Z"
}
