{
  "title": "Gold hits Rs403,600 per tola - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Gold prices reached a record high of Rs403,600 per tola on Monday, up Rs5,900 from Saturday, as consumers continue to face fluctuating rates announced by the gold trade body.\n\nAccording to the All Pa­­kis­­tan Gems and Jewel­lers Association (APGJSA), the official one-tola bullion rate peaked at Rs398,800 on Sept 23.\n\nHowever, traders were already quoting rates bet­ween Rs401,100 and Rs401,600, diverging from the official figures without clear justification.\n\nOn Monday, while the association announced the rate at Rs403,600 per tola, traders were reportedly offering lower rates between Rs401,500 and Rs402,500. Similar disparities have occurred previously, prompting law enforcement agencies to express concerns over transparency, speculation, and smuggling in the bullion market.\n\nDes­pite assurances from jewellers to standardise rates and increase transparency, inconsistencies persist.\n\nIt remains unclear whether the daily rates issued by the APGJSA, which are based on global gold prices and the interbank rupee-dollar exchange rate, are intended for jewellery buyers or merely serve as a reference point for the market.\n\nA jeweller explained that open market rates fluctuate according to demand and supply, with investors dominating the market rather than retail jewellery buyers. He noted that trading activity at the Bullion Hall on Zaibunnisa Street has been sluggish, although daily rates continue to be announced.\n\nOn Monday, the association quoted the 10-gram gold rate at Rs346,021, an increase of Rs4,637 from Saturday. Domestic gold prices rose following a $59 per ounce jump in the world market to $3,818 per ounce. Inter­nationally, gold prices surged due to renewed investor interest in safe-haven assets amid expectations of US interest rate cuts and escalating geopolitical tensions.\n\nSilver prices also hit a record high, with the 24kt silver rate reaching Rs4,792 per tola, up Rs88 from the previous rate. World silver prices surged to $46.93 per ounce, up 1.7pc, marking a 14-year high.\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68db0258b815c.gif",
  "retrievedAt": "2025-10-12T04:27:14.552Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945563/gold-hits-rs403600-per-tola",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:49:42.000Z"
}
