{
  "title": "SC removes bar on IHC judge - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Justice Jahangiri returns to bench after high court revises duty roster\n• SHC to hear judge’s plea against cancellation of law degree today\n\nISLAMABAD/KARACHI: The Supreme Court’s Constitutional Bench (CB) on Monday suspended an Islamabad High Court (IHC) order restraining Justice Tariq Mahmood Jahangiri from performing his judicial functions.\n\nFollowing the decision, the IHC revised its duty roster and restored Justice Jahangiri to judicial work.\n\nBefore adjourning further proceedings until today (Tuesday), Justice Shahid Bilal Hassan, a member of the five-judge CB, asked counsel on both sides to assist the court on how the IHC took up the matter without first deciding the objections raised by the court office when the petition was filed.\n\nThe bench, headed by Justice Aminuddin Khan and comprising Justices Jamal Khan Mandokhail, Muhammad Ali Mazhar, Syed Hasan Azhar Rizvi and Shahid Bilal Hassan, was hearing an appeal filed by Justice Jahangiri of the IHC, challenging the Sept 16 restraining order.\n\nA two-judge division bench, headed by Chief Justice Sardar Mohammad Sarfraz Dogar and comprising Justice Mohammad Azam Khan, had issued the interim order while hearing a writ petition by Advocate Mian Dawood under Article 199 of the Constitution.\n\nThe petition questioned the validity of Justice Jahangiri’s law degree from the University of Karachi and sought a writ of quo warranto, asking “by what authority” the judge holds judicial office.\n\nMonday’s hearing in the packed Courtroom No. 4 was also attended by five IHC judges — senior puisne judge Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Raffat Imtiaz.\n\nAll entered the Supreme Court premises as ordinary litigants through the general reception area rather than using the entry reserved for judges and lawyers.\n\nThe five IHC judges have already filed petitions challenging the administrative powers being exercised by the IHC chief justice, alleging that such powers have been used to undermine the judicial authority of high court judges.\n\nDuring the proceedings, Justice Mandokhail recalled that the Supreme Judicial Council (SJC) is scheduled to meet on Oct 18 to hear several complaints against superior court judges.\n\nThe CB made it clear that it would only examine the Sept 16 restraining order and not the main petition questioning Justice Jahangiri’s degree.\n\nThe order was suspended after the bench consulted among themselves after senior counsel Munir A. Malik, appearing for Justice Jahangiri, argued that allowing the IHC order to stand would send a damaging signal against the judiciary.\n\nThe original petitioner in the IHC, Mian Dawood, and Additional Attorney General Chaudhry Amir Rehman waived notices when the CB issued them.\n\nWhen Munir Malik requested the suspension of the IHC’s unilateral order, Justice Aminuddin Khan remarked that the CB would not repeat the same mistake.\n\nThe counsel, however, insisted that the principle of comity required that the Sept 16 order be suspended.\n\nAfter a brief consultation among themselves, the judges suspended the order and adjourned the hearing until Tuesday.\n\nDuty roster revised\n\nFollowing the CB order, the IHC revised its duty roster and restored Justice Jahangiri to judicial functions following the Supreme Court’s suspension of the order that had earlier barred him from hearing cases. Justice Jahangiri had been excluded from the sitting roster after being suspended by an IHC division bench.\n\nEarlier on Monday, Justice Jahangiri, along with four other IHC judges, appeared before the Supreme Court. Following the proceedings, the other judges — Justices Mohsin Akhtar Kayani, Babar Sattar, Sardar Ejaz Ishaq Khan and Saman Rafat Imtiaz — resumed their scheduled benches and continued regular court business, while Justice Jahangiri remained sidelined until the apex court’s decision.\n\nThe revised duty roster issued for Tuesday formally re-included Justice Jahangiri, confirming his return to judicial work after days of suspension.\n\nSHC hearing on petition\n\nMeanwhile, the Sindh High Court (SHC) is set to hear a petition filed by Justice Jahangiri today (Tuesday), challenging the cancellation of his law degree.\n\nJustice Jahangiri has impugned the decisions of KU’s Unfair Means Committee (UMC) and Syndicate, which cancelled his degree in August last year.\n\nThe IHC judge recently approached the SHC, but at the time of filing, the court’s additional registrar (writ) raised several objections, including questions about the maintainability of the petition and the delay in filing it.\n\nHowever, the IHC judge submitted that the court would be satisfied about these objections at the time of hearing of his petition.\n\nThe petition is fixed before a two-judge regular bench of the SHC comprising Justice Muhammad Iqbal Kalhoro and Justice Mohammad Abdur Rahman.\n\nIn his petition, Justice Jahangiri contended that the “illegal and mala fide” cancellation of his LLB degree occurred in the context of his “unflinching judicial independence”.\n\nJustice Jahangiri claimed that when the campaign to have him removed through the SJC failed, “a new strategy” was adopted by misusing official processes and institutions. He said the degree cancellation became the basis for the IHC’s decision to restrain him from judicial duties.\n\nHe described the KU Unfair Means Committee’s decision as “shocking and surprising,” noting that the committee revived the issue after 32 years without issuing him a notice or providing reasons.\n\nKBA appeal\n\nSeparately, Karachi Bar Association (KBA) President Amir Nawaz filed an appeal in the Supreme Court challenging the SHC’s Sept 25 order, which had dismissed a set of petitions against the cancellation of Justice Jahangiri’s law degree over non-prosecution.\n\nFiled through senior counsel Faisal Siddiqi, the appeal argued that the SHC had erred by holding that the issue of maintainability had to be decided first before hearing applications for recusal or questions of jurisdiction of the SHC’s constitutional bench.\n\nThe petition contended that the SHC’s reasoning was irrational and illegal.\n\nMalik Asad in Islamabad also contributed to this report\n\nPublished in Dawn, September 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:26:54.590Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945564/sc-removes-bar-on-ihc-judge#:~:text=SHC%20hearing%20on%20petition",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T01:49:43.000Z"
}
