{
  "title": "Govt raises petrol, diesel prices by Rs4 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The federal government on Tuesday increased the price of petrol by Rs4.07 per litre and that of high-speed diesel (HSD) by Rs4.04 per litre for the next fortnight.\n\nAccording to the press release issued by the Finance Division, the petrol price now stands at Rs268.68 per litre from Rs264.61 per litre. Meanwhile, the price of diesel has jumped to Rs276.81 per litre from Rs272.77 per litre.\n\nIt added that it decided on these new rates upon the recommendations from the Oil and Gas Regulatory Authority (Ogra) and the relevant ministries.\n\nWidely used in motorcycles, rickshaws, and private vehicles, petrol has a direct impact on the budgets of middle- and lower-income households. HSD fuels heavy transport, agricultural machinery, and trains. Its price is considered highly inflationary, influencing the cost of food and other essential goods.\n\nThe government currently imposes no GST on petroleum products, but char­ges significant levies. These include Rs79.50 per litre on diesel and Rs80.52 per litre on petrol and high-octane products, which also cover Rs2.50 per litre under the CSL.\n\nIn addition, customs duties of around Rs16-17 per litre apply to both petrol and diesel, regardless of whether the products are imported or locally produced.\n\nMeanwhile, Ogra on Tuesday also notified a decrease in the price of liquefied petroleum gas (LPG) by Rs.6.70 per kilogramme for the month of October. After the reduction, a 11.8kg cylinder of LPG, which cost Rs2,527.47 in September, will now be sold for Rs2,448.33, down by Rs.79.14 or 3.13 per cent.\n\nIn a statement, a copy of which is available with Dawn.com, Ogra said: “The LPG producer price is linked with Saudi Aramco-CP and US dollar exchange rate. As compared to previous month Saudi Aramco-CP has decreased by 3.78pc. The average dollar exchange rate has slightly increased by 0.23pc.“",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:18:57.837Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945671/govt-raises-petrol-diesel-prices-by-rs4",
  "dateList": "2025-09-30",
  "date_published": "2025-09-30T18:58:16.000Z"
}
