{
  "title": "PAC orders special audit of both houses of Parliament",
  "link": "https://www.app.com.pk/national/pac-orders-special-audit-of-both-houses-of-parliament/",
  "date_published": "2022-09-28T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): Chairman Public Accounts Committee Noor Alam Khan on Wednesday directed Accountant General of Pakistan to conduct special forensic audit of both Parliament houses to ensure transparency.\nA meeting of the Public Accounts Committee was held in the Parliament House to examine the appropriation of funds to the National Assembly and Senate Secretariats for the year 2018-19.\nThe forensic audit of the National Assembly Secretariat of the last one year would be regarding appointments, promotions and foreign visits made by MNAs and Officers/Officials of the National Assembly.\nAlso PAC directed the auditor general to conduct audit regarding honorarium paid to the employees of the National Assembly Secretariat, Senate Secretariat, Finance Division and Federal Board of Revenue.\nAuditor assured to conduct audit of all Ministries/Divisions/Departments regarding honorarium paid to their employees.\nMoreover, one honorarium would be allowed in future to all employees of both the Secretariats.\nIn addition, the PAC took briefings from the DC Islamabad regarding the National Assembly and Senate Secretariats Employees Cooperative Housing Societies.\nMeanwhile, the committee showed displeasure over the letter written by the Senate Secretariat to the PAC, challenging the latter’s authority for ordering the removal of glass walls established in front of the office of the Chairman Senate.\nThe PAC held that it represents parliamentarians from both houses.\nTherefore, the committee reiterated its earlier directive and directed the secretary Senate to remove the glass wall established in the corridor in front of the Office of the Chairman Senate.\nThe Chairman PAC and senators also requested the Chairman Senate to remove the glass walls. Moreover, it was agreed by every member that previous directive of the PAC in above regard would be implemented.\nThe committee directed secretary Senate to remove the pictures immediately from the right side of the corridor as it was causing discomfort for the worshipers praying Namaz.\nThe committee also directed to withdraw the letter written by Senate Secretariat to the PAC.\nThe committee showed displeasure regarding baseless news item regarding the visit of the delegation from the National Assembly to Canada.\nThe secretary National Assembly clarified there were two MNAs including Honorable Speaker and three officials, as the expenses of the two officials were borne by the sponsors who had invited them.\nThe committee directed the deputy commissioner Islamabad to stop using the name of National Assembly and the Senate by the management of the National Assembly and Senate Secretariat’s Employees Cooperative Societies.\nThe committee directed the secretary Senate and National Assembly’s secretary to revoke the NOC issued in favor of the Senate Secretariat Employees Cooperative Society pertaining to use the name of the Senate Secretariat.\nThe committee directed the secretary National Assembly Secretariat to take action under E& D rules against the lady official who was involved in fraud.\nThe committee observed that MNAs/Senators are entitled to be treated from government hospitals and directed the secretary, Cabinet Division, Establishment Division and member of National Health Services Regulations and Coordination to direct autonomous bodies/corporations to get treatment of their respective employees from government hospitals instead of private hospitals.\nThe Committee regularized the two grants pertaining to the National Assembly and Senate\nSecretariats.",
  "retrievedAt": "2025-08-11T15:38:49.066Z"
}
