{
  "title": "PM chairs NSC meeting; high-powered committee under Interior Minister approved to probe audio leaks",
  "link": "https://www.app.com.pk/national/pm-chairs-nsc-meeting-high-powered-committee-under-interior-minister-approved-to-probe-audio-leaks/",
  "date_published": "2022-09-28T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 28 (APP): The National Security Committee (NSC), in its meeting held here Wednesday with Prime Minister Muhammad Shehbaz Sharif in chair, approved the constitution of a high-powered committee led by Interior Minister Rana Sanaullah to probe the issue of audio leaks.\nThe meeting, which besides Federal Ministers was attended by Services Chiefs, heads of intelligence agencies and other senior officials, pondered over the audio leaks matter.\nAfter consultation, the meeting also decided to prepare “Legal Framework” about cyber-security and in that respect directed the Ministry of Law and Justice for the preparation of legal framework.\nThe meeting agreed to review the security, safety and the protection of official communications in view of current changed environment of modern technology and cyberspace so as to check any interruption in the security system.\nThe heads of intelligence agencies gave a detailed briefing about the security of importance places including the PM House, cyberspace and other related aspect.\nThe meeting was told that investigations about the audios circulating on social media were underway.\nIt was also told about the fool-proof security arrangements at PM House, after the identification of some aspects regarding security.\nThe meeting was apprised of emergency steps being taken to ensure the security of important places and buildings including the PM House and Ministries so as to avoid any such situation in future.\nThe meeting also reviewed the historic flood devastation, rescue and relief measures and the current security situation.\nThe participants expressed their grief over loss of lives since June 14 due to floods and offered condolences to the bereaved families. They also offered Fateha for the departed souls.\nThe meeting also reviewed the steps taken for immediate support of 33 million flood affectees, their shifting to the safe places, supply of food, medical treatment and provision of other necessary items.\nThey also lauded the role played by the civil administration and the relevant departments, and especially of the army, navy and air force for saving lives of those trapped in floods, their safe evacuation, and provision of food and other items and appreciated their passion to serve even in the most difficult situation.\nThe participants also acknowledged civil society, media and philanthropists for their role and support for the affected people and expressed the hope that they would continue contributing in this noble cause with such display of spirit.\nThe meeting also paid tribute to the martyred army officers and Jawans of Lasbela army aviation helicopter crash incident in Balochistan and said that the nation saluted their martyrs and their families.\nThe participants reiterated the resolve that support and rehabilitation of the flood affected people would remain a priority as a national agenda and expressed determination that these efforts would continue with same display of passion, focus and coordination till rehabilitation of the countrymen.\nForeign Secretary Sohail Mahmood gave a briefing about the prime minister’s recent participation in the Shanghai Cooperation Organization summit and 77th United Nations General Assembly session in New York.\nHe also apprised the meeting of prime minister’s bilateral meetings with different heads and leaders of the member countries.",
  "retrievedAt": "2025-08-11T15:38:47.245Z"
}
