{
  "title": "Hajj without official permission strictly forbidden under Islamic principles, legal regulations: Ashrafi",
  "link": "https://www.app.com.pk/national/hajj-without-official-permission-strictly-forbidden-under-islamic-principles-legal-regulations-ashrafi/",
  "date_published": "2024-05-05T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 05 (APP):Pakistan Ulema Council (PUC) Chairman and Hajj Organisers Association of Pakistan (HOAP) Patron-in-Chief, Hafiz Muhammad Tahir Mehmood Ashrafi has unveiled a comprehensive code of conduct in a bid to ensure a smooth and hassle-free pilgrimage experience for private Hajj pilgrims.\nHe, in a recent press talk, emphasized the importance of booking Hajj journeys only through authorized organizers, cautioning against fraudulent activities perpetrated by unauthorized groups through social media platforms. He urged intending pilgrims to remain vigilant and avoid falling prey to such scams, which exploit the religious sentiments of innocent people for monetary gain.\nMoreover, Ashrafi addressed the issue of unauthorized pilgrimage by Pakistani diaspora in Saudi Arabia, emphasizing that performing Hajj without official permission is strictly prohibited according to Islamic principles and the law of the land. He warned that individuals caught without proper authorization would face consequences, potentially tarnishing the reputation of the country.\nHighlighting another concern, Ashrafi discouraged pilgrims from engaging in disruptive behavior, such as taking selfies and videos during Hajj rituals, which could inconvenience fellow pilgrims. He stressed the importance of focusing on religious duties and maintaining decorum for a seamless pilgrimage experience.\nIn addition, Ashrafi urged pilgrims to refrain from engaging in political activities during the Hajj season, particularly at Haramain Sharifain and other sacred sites in Saudi Arabia. He underscored that such actions are not only contrary to Islamic teachings and Shariah but also reflect poorly on Pakistan in the international community.\nAshrafi also commended the government’s efforts, particularly Chief of Army Staff General Syed Asim Munir, for their support in facilitating Hajj pilgrims. He acknowledged the army chief’s initiatives to stabilize the exchange rate and safeguard the livelihoods of those dependent on Hajj-related industries.\nThe code of conduct, grounded in the Holy Quran and the Hadiths of the Prophet Muhammad (Peace Be Upon Him), underscores the necessity of undertaking Hajj with Halal wealth, refraining from disputes, and embodying dignity and humility throughout the pilgrimage. It highlights the sacredness of the Hajj period and the significance of sincere intention solely for the pleasure of Allah.\nPilgrims are urged to acquire comprehensive knowledge of the rituals and seek guidance when needed. They must adhere to the guidelines set by the Ministry of Religious Affairs and Interfaith Harmony and appointed leaders of Hajj and Umrah groups, prioritizing obedience to Allah and His commandments.\nSaudi Arabia’s efforts to facilitate pilgrims are acknowledged, including the Route Makkah programme benefiting Pakistani pilgrims. Patience is emphasized in facing challenges, be it delays at airports or congestion on roads.\nThroughout their stay in Makkah and Madina, adherence to regulations is paramount, with specific directives for women and individuals with disabilities.\nRegarding the stoning of the Jamarat, pilgrims are advised to follow scholars’ guidance and avail themselves of provisions for ease. The code of conduct aims to ensure a spiritually enriching and harmonious pilgrimage experience, rooted in devotion, humility, and obedience to Allah’s commandments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:18:38.558Z"
}
