{
  "title": "Railways directs to accelerate efforts for retrieving occupied land",
  "link": "https://www.app.com.pk/national/railways-directs-to-accelerate-efforts-for-retrieving-occupied-land-2/",
  "date_published": "2024-05-05T10:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 5 (APP):Pakistan Railways directed all the Divisional Superintendents (DS) to accelerate efforts for retrieving around 13,972 acres of land occupied illegally by private individuals and different government departments across the country.\n“Around 5,809 acres were occupied in Punjab, 1,181 acres are under encroachment in Khyber Pakhtunkhwa, 5,948 acres in Sindh and 1,034 acres land occupied in Balochistan,” an official in the Ministry told APP.\nHe said the category of land under illegal occupations included commercial, residential, agricultural, and various persons or departments.\nGiving details of the land, the official said that around 769 acres were commercial in all the provinces, 3,309 residential, 5,512 acres agricultural and 4382 were under encroachment of various persons or departments.\nThe official said the department had also decided to accelerate its ongoing anti-encroachment operation against land grabbers across the country to recoup its land from different individuals, groups, and even business organizations that were using it for residential, commercial, and agriculture purposes for decades.\n“The joint procedure orders have been issued to all Divisional Superintendents of Pakistan Railways to retrieve the railway land from encroachers,” the official added.\nAccordingly, he said the anti-encroachment operations for retrieval of encroached Railway land all over the Railway network are being initiated by the concerned divisions, and notices are issued to encroachers under the Possession\nOrdinance 1965 for the vacation of Railway land/structure within 14 days.\nThe official said that Pakistan Railway Police, District Administration, and law enforcement agencies are informed of necessary assistance in anti-encroachment operations.\nTo further control and restrict new encroachments, he said the responsibilities defined for Railway officers within Railway Station premises, Station Master concerned, within/around the colony premises, inspector of works, and Railway Police.\n“The anti-encroachment schedules, on a three-month basis, are being prepared and sent to all concerned in line with the joint procedure order,” he said adding that the operation will be launched with the assistance of Railway Police and district administrations of the relevant provincial governments.\nThe official said PR owned 167,690 acres of land across the country, of which 90,326-acre was in Punjab, 39,428-acre in Sindh, 28,228-acre in Balochistan, and 9,708-acre in Khyber Pakhtunkhwa.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:18:35.828Z"
}
