{
  "title": "86 % land acquired for Diamer Basha Dam so far",
  "link": "https://www.app.com.pk/national/86-land-acquired-for-diamer-basha-dam-so-far/",
  "date_published": "2020-10-02T07:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 02 (APP): The government has acquired around 32,139 acres of land, out of total 37,419 acres land required for the construction of Diamer Basha dam.\nSources told APP that almost 86 per cent land for the mega project had been acquired so far.\nThey informed that construction work on resettlement of model village at Harpan Das was in progress and almost 95 per cent work had already been completed.\nSimilarly, construction of Project Colony at Thor was in progress and overall progress was 85 per cent. Construction of Right Bank Periphery Road (RBPR) was under process, they said.\nContracts for RBPR-01 and 02 had also been awarded and so far 86.50 per cent and 40 per cent respectively work has been completed. They said procurement of Contractor for RBPR-03 and 04 was in progress.\n3.6 MW Thor Hydropower Project was operational since June 26, 2019 and electricity was being supplied to locals as goodwill gesture till commencement of work on main dam. 3.0 MW Thak Powerhouse was under construction with 94 per cent progress.\nThe Contracts for Consultancy Services and main dam works had also been signed.\nThe government had released/ spent Rs. 107.199 Billion against Land Acquisition & Resettlement since 2009-10 up to June 30, 2020, whereas Rs. 3.365 Billion had been released / spent by WAPDA as bridge financing.\nThe government had also released/spent Rs. 43.805 Billion against Dam Part up to June 30, 2020.\nIt is pertinent to mention that Diamer Basha Dam will provide water for agriculture, mitigate floods and low-cost hydel electricity for economic development in the country.\nThe project has a gross storage capacity of 8.1million acre feet (MAF) and power generation capacity of 4500 megawatt (MW), with annual generation of 18.1 billion units per annum. Construction of the project will enhance life of Tarbela Dam by 35 years.",
  "retrievedAt": "2025-08-11T19:51:43.521Z"
}
