{
  "title": "Number of registered voters surpasses 115 mln in Pakistan",
  "link": "https://www.app.com.pk/national/number-of-registered-voters-surpasses-115-mln-in-pakistan/",
  "date_published": "2020-10-02T14:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 02 (APP):The total number of registered voters has reached 115,748,753, including 64,078,616 (55 percent) males, 51,667,599 (45 percent) females and 2,538 (0.002 percent) transgender.\nAccording to the latest data released by the Election Commission of Pakistan (ECP) on Friday, 9,793,344 new voters have been added since the general election 2018 when the total registered voters were 105,955,409.\nPunjab with 66,236,144 voters, including 36,371,326 males (55 percent), 29,862,932 females (45 percent) and 1,886 transgender (0.003 percent) leads in terms of total number of voters, followed by Sindh with 24,351,681 registered voters, including 13,443,983 males (55 percent), 10,907,267 females (45 percent) and 431 transgender (0.002 percent).\nKhyber Pakhtunkhwa has 19,533,964 registered voters, including 11,076,630 males (57 percent), 8,457,201 females (43 percent) and 133 transgender (0.001 percent), and Balochistan has 4,801,131 total registered voters, including 2,753,946 males (57 percent), 2,047,104 females (43 percent) and 81 transgender (0.002 percent).\nSimilarly, the number of total registered voters in Islamabad are 825,833 with 432.731 (52 percent) male voters, 393,095 (48 percent) female voters and seven transgender (0.001 percent) voters.\nAccording to ECP officials, the updated voter lists will be displayed from October 4 at the offices of district election commissioners and registration officers for general public. The Commission has also updated its SMS service 8300 to assist the public.\nThe voters they can check their registration as per voters’ lists while sending SMS with their Computerized National Identity Card (CNIC) number to 8300. They can also get help from the district election offices phone numbers or the ECP helpline, besides its website.\nThe voters can download Form-21 (registration or transfer of vote), Form-22 (objections or omission of vote) or Form-23 (correction in details) and submit with the respective offices of Form Registration Officers and Assistant Registration Officers.",
  "retrievedAt": "2025-08-11T19:51:40.567Z"
}
