{
  "title": "Nawaz can deliver ’emotional speeches’ in courts on his return to country: Fawad",
  "link": "https://www.app.com.pk/national/nawaz-can-deliver-emotional-speeches-in-courts-on-his-return-to-country-fawad/",
  "date_published": "2020-10-01T19:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP):Federal Minister for Science and Technology Chaudhry Fawad Hussain Thursday said Nawaz Sharif could deliver ’emotional speeches’ in courts here as the process for his repatriation from London was underway.\nThe Pakistan Muslim League-Nawaz (PML-N) leader would be soon in Pakistan to face cases, he said while talking to newsmen here at the signing ceremony of a memorandum of understanding (MoU) with Lahore Qalandars.\nHe said Nawaz Sharif was making emotional speeches from London nowadays like Che Guevara.\nHe was leading a new kind of revolution as he wanted his party workers to come to the streets while himself along with his family enjoying life in London’s restaurants.\nChaudhry Fawad said Nawaz Sharif claimed to have knowledge of everything but he did not know how he had purchased his apartments and how his daughter Maryam Nawaz became owner of so many assets.\nThe minister said Nawaz Sharif in his speeches had recited the oath taken by army personnel, but he forgot the oath which he had taken as the country’s prime minister that he would not indulge in conspiracies.\nHe said during his government, Nawaz Sharif spent Rs 23 billion to keep the dollar at Rs 100. When the Pakistan Tehreek-e-Insaf came into power, Pakistan did not have forex reserves to fulfill country’s requirement for two weeks and the economy had come to a standstill, he added.\nThey knew that they had built missiles, the JF Thunder and the motorways, but they did not know how much money they had made, he wondered.\nThe minister alleged that Nawaz Sharif was now blackmailing the institutions and wanted to create divisions among them.\nHe said Nawaz Sharif’s speech was telecast live which showed that the media was free in the country.\nFawad said Nawaz Sharif had again raised a question about Imran Khan’s assets irrespective of the fact that the prime minister had given the proofs to the court about the resources to build the Bani Gala’s house.\nAs regards the MoU signed by the Ministry of Science & Technology with Lahore Qalandar, the minister said it was a big step towards introducing technology in sports in Pakistan. Australia had already in the process to introduce a cricket ball fitted with micro-chip.\nHe said Sialkot’s industry exported sports goods worth Rs 350 million. Currently, Pakistan’s major export was only football in sports. In the past, tennis balls were also exported, but their manufacturing had been disbanded, he added.\nFawad said the sports companies will be provided the material to manufacture different technology based items.\nHe announced that an MoU would also be signed with the Pakistan Cricket Board (PCB) in the next few days to bring technology in the sports. The PCB, the Pakistan Super League and his ministry work together on introduction of technology in sports, he added.",
  "retrievedAt": "2025-08-11T19:51:43.754Z"
}
