{
  "title": "DRAP, NIH directed to take urgent steps for ensuring anti-rabies vaccines",
  "link": "https://www.app.com.pk/national/drap-nih-directed-to-take-urgent-steps-for-ensuring-anti-rabies-vaccines/",
  "date_published": "2024-01-14T10:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP): Federal Ombudsman Ejaz Ahmed Qureshi on Sunday has directed the heads of the Drug Regulatory Authority of Pakistan (DRAP) and the National Institute of Health (NIH) to take urgent steps for ensuring fast-track availability of the anti-rabies vaccines in the government hospitals of the Islamabad Capital Territory (ICT) and remove all bureaucratic bottlenecks in this regard.\nIt may be recalled that in response to a public complaint received recently in his office, he took a serious notice of the non-availability of this essential vaccine in the Islamabad’s Government hospitals and summoned the senior officials of both these organizations on January 09, 2024 to unearth the root cause of the situation. He had also directed the DRAP to\nconduct a thorough probe as to why the NIH was not manufacturing this essential vaccine.\nAs a follow-up measure, the office of Wafaqi Mohtasib immediately issued a notice to both these organizations i.e. NIH and DARP and the Registrar of the Wafaqi Mohtasib initiated a probe into the matter. It was revealed that apart from lengthy official procedures, bureaucratic delays, gross negligence, mismanagement and fluctuation of the dollar rate resulted in this unfortunate situation. He has directed that responsibility may be fixed for the shortage of this essential vaccine and necessary steps may be initiated for avoiding recurrence of such incidents in future.\nThe matter is being vigorously followed up by the Office of the Wafaqi Mohtasib and all the stakeholders have assured that they would spare no efforts in this regard. It may also be informed that 02 hearings have already been held in the Wafaqi Mohtasib’s office in this regard which were attended by the representatives of the organizations concerned.",
  "retrievedAt": "2025-08-10T23:36:38.074Z"
}
