{
  "title": "Diverse array of electoral symbols/candidates spice up Capital’s election landscape",
  "link": "https://www.app.com.pk/national/diverse-array-of-electoral-symbols-candidates-spice-up-capitals-election-landscape/",
  "date_published": "2024-01-14T15:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP):In the bustling political arena of Islamabad, the electoral battleground is set with an intriguing mix of candidates and symbols as in total 119 contenders are vying for victory across three capital’s constituencies, each armed with their distinctive election emblem.\nThe District Returning Officer (DRO) Islamabad has allotted electoral symbols to the candidates who are contesting the forthcoming General Election 2024 from all three national assembly constituencies of the federal capital, ICT spokesman Dr Abdullah Tabasum said while talking to APP on Sunday.\nIn NA-46, where 44 candidates are in the race, Mustafin Kazmi stands out as an independent candidate with the unique Parachute symbol. Renowned lawyer Shoaib Shaheen joins the fray with the graceful Dove as his election symbol.\nThe competition heats up in NA-47, where a total of 37 candidates are in contention. Among them, 25 are independent candidates, bringing diversity to the ballot. Notably, Chaudhry Ilyas Mehrban holds the Battery symbol, while Mustafa Nawaz Khokhar marks time with the Clock symbol. Adding a dash of spice, a transgender candidate sports the Green Chilli as their election emblem.\nIn NA-48, a field of 38 candidates is vying for victory while independent candidate Raja Khuram Nawaz stands out with the Pomegranate symbol, while PTI’s Ali Bukhari adds an interesting twist by contesting independently in the same constituency.\nAs election fervor intensified, the distinctive symbols promise a visually captivating electoral journey in the heart of Pakistan’s political landscape.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:37:11.467Z"
}
