{
  "article_id": "2025-04-14_e1483f27b8c95fc1b0c70bc6d88b7726",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/eu-delegation-meets-azam-tarar-discuss-bilateral-ties/",
    "retrieved_at": "2025-08-27T14:27:43.518Z"
  },
  "metadata": {
    "title": "EU delegation meets Azam Tarar, discuss bilateral ties",
    "author": null,
    "date_published": "2025-04-14T14:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 441,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 14 (APP): A European Union delegation, led by Serban Dimitrie Sturdza, Chair of the Delegation for Relations with the Countries of South Asia (DSAS), met with the Federal Minister for Law & Justice and Human Rights, Senator Azam Nazeer Tarar. The delegation included Dr. Riina Kionka, EU Ambassador to Pakistan, along with Members of the European Parliament Michael McNamara (Renew, Ireland), Ruth Firmenich (NI, Germany), Cristina Stanculescu, Songul Dogan, and Liviu Adrian Natea, said a press release. The meeting reaffirmed the strength of Pakistan-EU bilateral relations, underscoring shared commitments to democratic values, human rights, and inclusive development. Both sides acknowledged the positive trajectory of cooperation under the GSP+ framework, with the Minister appreciating the EU's support and emphasizing Pakistan's resolve to align its legal and institutional frameworks with international human rights conventions. The minister highlighted Pakistan's steady progress in promoting democracy, constitutionalism and the rule of law, despite complex internal and regional dynamics. He reaffirmed the country's strong commitment to peace, pluralism, and institutional resilience as part of its vision for a stable and inclusive future. He further noted that Pakistan's democratic institutions are actively working to promote dialogue, tolerance, and constitutional protections for all communities. \"Pakistan's commitment to democratic governance remains unwavering. As we continue to navigate complex political and security challenges, we expect our international partners, including the European Union, to recognize and acknowledge our ongoing journey toward a more inclusive, just and peaceful society,\" the Minister stated. Azam Nazeer Tarar briefed the delegation on the government's plan to establish a National Commission for Minorities (NCM) through an Act of Parliament, with quasi-judicial powers to independently address grievances and monitor rights violations. He noted that while the existing independent human rights bodies; NCHR, NCSW, and NCRC are functioning effectively within their respective mandates, the establishment of the NCM will further strengthen the institutional framework for protecting minority rights, reinforcing the government's broader commitment to accountability and fundamental freedoms. The EU delegation appreciated Pakistan's steps to implement reforms in areas such as access to justice, protection of fundamental rights, and institutional transparency. The ongoing cooperation under the \"Promotion of Human Rights in Pakistan II\" project and the outcomes of the 14th Pak-EU Joint Commission were acknowledged as positive indicators of continued engagement. Both parties reiterated their intent to strengthen existing dialogue mechanisms, including the Joint Commission, the Strategic Engagement Plan, and enhanced cooperation in trade and investment. These platforms will continue to address shared global challenges such as climate change, regional instability, and human rights concerns. The meeting concluded with a reaffirmation of mutual respect, partnership, and a shared vision for a just, democratic, and equitable global order.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}