{
  "article_id": "2025-04-14_420c8ce151cb2a584a26a4ca40e4908a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/policy-dialogue-calls-for-urgent-reforms-to-curb-open-waste-burning/",
    "retrieved_at": "2025-08-27T14:29:21.975Z"
  },
  "metadata": {
    "title": "Policy dialogue calls for urgent reforms to curb open waste burning",
    "author": null,
    "date_published": "2025-04-14T17:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 268,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 14 (APP):Leading environmental experts, policymakers, and private sector representatives Monday emphasized the need for urgent policy reforms, technological innovation, and cross-sector collaboration to combat Open Waste Burning. They convened at a high-level policy dalogue on \"Tackling Open Waste Burning Through Policy Reforms\" to address Pakistan's growing waste management crisis. Organized by the Institute of Urbanism (IoU) with support from the Royal Academy of Engineering (RAE), the event highlighted the severe environmental and public health impacts of open waste burning, particularly in informal settlements. With 49.6 million tons of municipal solid waste generated 30-40 per cent remains uncollected-much of it burned in open spaces, releasing toxic pollutants. Dr. Ejaz Ahmad, Executive Director of IoU, called open waste burning a \"public health emergency.\" \"Integrated policy reforms can empower local governments and communities to build sustainable waste systems,\" he stressed. Waleed Hameed, Director at Five Star Pvt. Ltd., highlighted private sector potential, \"Investing in scalable waste-to-resource solutions can drive circular economies. Collaboration is key.\" Dr. Hamid Iqbal of Rawalpindi Waste Management Company (RWMC)noted: \"Operational capacity must expand to serve informal settlements, where open burning is rampant.\" Dr. Samia Qadeer, Professor at Allama Iqbal Open University, urged that Pakistan needs a national household waste policy. Academia must support evidence-based reforms. Zeeshan Ahmed from WWF-Pakistan warned: \"Open burning releases deadly pollutants like dioxins, worsening air quality and accelerating climate change.\" Afsheen Tajammul of 2Insects advocated for eco-entrepreneurship, Circular business models and formalizing informal waste workers can reduce reliance on burning. The IoU and RAE will compile findings into a policy brief for federal and provincial governments, pushing for immediate regulatory action.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}