{
  "article_id": "2025-04-14_fef5e769b9cc38980be4ef8fe8492433",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/intl-collaboration-essential-in-addressing-global-challenges-ayaz/",
    "retrieved_at": "2025-08-27T14:29:20.475Z"
  },
  "metadata": {
    "title": "Int’l collaboration essential in addressing global challenges: Ayaz",
    "author": null,
    "date_published": "2025-04-14T18:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 634,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 14 (APP):Speaker National Assembly Sardar Ayaz Sadiq on Monday said that international collaboration is essential in addressing global challenges such as terrorism and climate change. During a meeting with the European Union Parliamentary Delegation, led by Serban Dimitrie Sturdza (ECR, Romania), Chair of the delegation for Relations with South Asian countries, he said Pakistan continues to face the grave challenge of terrorism, which he stressed is not a localized issue but a global menace. Ayaz Sadiq said that the spread of gun and drug culture from Afghanistan has severely impacted Pakistan's internal security. He pointed out that over $8 billion worth of advanced weaponry, left behind by NATO and US forces in Afghanistan are now being used by terrorist groups against Pakistan. \"Afghanistan has unfortunately become the epicenter of regional terrorism,\" he remarked, emphasizing that both Khyber Pakhtunkhwa and Baluchistan provinces have borne the brunt of these threats,\"he added. The Speaker also briefed the delegation that Pakistan has fought multiple wars against terror, often on behalf of the international community. \"This is not a war that any one nation can win alone-it requires a unified global response,\" he added. He strongly condemned the recent attacks in Baluchistan, especially the tragedy involving the Jaffar Express, calling the perpetrators \"anti-state elements who have crossed all bounds of humanity.\" Ayaz Sadiq reaffirmed Pakistan's determination to eradicate terrorism, praising the bravery and sacrifices of the armed forces. Reiterating Pakistan's commitment to democratic principles, the Speaker said, \"The continuity of democracy is essential for national development.\" He underscored the historic significance of the 26th Constitutional Amendment related to judicial reforms and noted his own role in bridging the gap between opposition and treasury benches. Ayaz Sadiq also highlighted that, in the spirit of democratic values, he issued production orders for arrested members of parliament-especially from the opposition-to ensure their right to participate in assembly sessions and voice their opinions freely. The Speaker said the issue of enforced disappearances is often exaggerated. He said that for enhancing parliamentary diplomacy, the National Assembly established parliamentary friendship groups in 2014, which are playing an effective role for enhancing parliamentary diplomacy. Ayaz Sadiq said that parliamentary caucus on Child Rights, the SDGs Secretariat, the Young Parliamentary Forum, and the Gender Mainstreaming Committee have been established for ensuring fundamental rights for marginalized segment of society. He stressed that climate change poses an existential threat to humanity and called for enhanced international cooperation to combat its effects. \"Pakistan has been at the frontline of climate-related disasters, including devastating floods,\" he said, expressing gratitude to the European Union for its consistent support during these crises. The Speaker reiterated Pakistan's stance in support of oppressed communities around the world, including those in Kashmir and Palestine. He emphasized the need for justice, peace and human dignity in international issues. He also reiterated Pakistan support for the resolution of the Ukraine issue through dialogue. Serban Dimitrie reaffirmed the European Union's continued support for Pakistan across the social and economic sectors. He acknowledged Pakistan's sacrifices in the war on terror and its longstanding hospitality toward Afghan refugees. \"The challenges of today whether terrorism, economic instability, or climate change-require collective global efforts,\" he said adding that the EU values Pakistan as a key partner in promoting democracy, freedom of speech and rule of law. Irish delegate Michael McNamara shared Ireland's experiences in dealing with terrorism and emphasized the importance of inter-parliamentary cooperation and trade. \"The trade agreements between Pakistan and European countries play a vital role in strengthening bilateral relations, especially in areas like human rights, labour rights, and climate resilience,\" he noted. The meeting was also attended by Deputy Speaker National Assembly, Syed Ghulam Mustafa Shah and members of the National Assembly Munaza Hassan and Danial Chaudhry; and Dr. Riina Kionka, Ambassador of the European Union to Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}