{
  "article_id": "2025-04-14_0a0408ae4494b76a255549e805f68e8b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistani-overseas-delegation-visits-lok-virsa/",
    "retrieved_at": "2025-08-27T14:29:05.047Z"
  },
  "metadata": {
    "title": "Pakistani overseas’ delegation visits Lok Virsa",
    "author": null,
    "date_published": "2025-04-13T19:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 389,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 13 (APP):A high-level delegation of overseas Pakistanis participating in the Overseas Pakistanis Convention in collaboration with the Overseas Pakistanis Foundation visited Lok Virsa on Sunday. Special arrangements were made by the Ministry of Overseas Pakistanis, the Ministry of Foreign Affairs and the Ministry of Information and Broadcasting for a grand welcome at Lok Virsa. Overseas Pakistanis were warmly welcomed to the Lok Virsa with the beat of drums and regional folk music. Parliamentary Secretary for National Heritage and Culture Farah Naz Akbar welcomed the distinguished guests on their arrival at Lok Virsa. Delegations of overseas Pakistanis from different parts of the world including America, Europe, Gulf and African countries visited the Lok Virsa Museum, Handicraft Bazaar, Craft Village and various cultural stalls. On this occasion, they also watched live musical performances by folk artists. The melodies, traditional instruments and dances of different regions entertained the delegations and they applauded them. Overseas Pakistanis were taken to visit the pavilions of different provinces set up at Lok Virsa, which reflect the cultural heritage of all the federal units, including Azad Kashmir and Gilgit-Baltistan. On this occasion, Lok Virsa officials informed the overseas Pakistanis about the colorful culture of Pakistan and the various pavilions. Parliamentary Secretary Farah Naz Akbar, while talking to the media, said that about one thousand overseas Pakistanis from different countries are participating in the Overseas Convention. He said that Prime Minister Muhammad Shehbaz Sharif has provided an opportunity to Pakistanis living abroad to meet through the Overseas Convention, which is a positive step for everyone. He said that organizing the Overseas Convention is a good initiative of the government and a strategy will be formulated by sitting together on the issues related to overseas Pakistanis and the problems they face. On this occasion, Mansoor Mehboob Chaudhry, an overseas Pakistani from Saudi Arabia, while talking to the media, said that he was warmly welcomed by the government, for which he is very grateful. Expatriate Hafiz Muhammad Shabbir told the media that he has been brought here from the airport in a warm manner, for which we are grateful to the government. He said that the purpose of coming here is to find maximum investment opportunities so that we can serve our country. Overseas Pakistanis from Europe have also appreciated the Pakistani government's initiative in organizing the convention.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}