{
  "article_id": "2025-04-14_c8afd6f5b46fa84c2e2d432b3c0e2445",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/experts-urge-global-action-to-protect-threatened-bustard-species/",
    "retrieved_at": "2025-08-27T14:28:05.394Z"
  },
  "metadata": {
    "title": "Experts urge global action to protect threatened bustard species",
    "author": null,
    "date_published": "2025-04-14T17:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 270,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 14 (APP):Conservationists and wildlife experts have called for urgent, coordinated efforts to protect rapidly declining bustard populations, citing threats from hunting, habitat destruction, and climate change. The appeal was made during a workshop on Monday at the Multi-species Action Plan (MsAP) for Bustard Conservation, organized by WWF-Pakistan and Bustards Without Borders (BWB) at a local hotel here. The workshop highlighted that bustards-migratory birds traversing Central Asia, the Middle East, and South Asia-are facing severe population declines due to illegal hunting and poaching, habitat degradation, and climate change disruptions. The proposed Multi-species Action Plan (MsAP), set for adoption at CMS COP15 in 2026, outlines priority conservation measures to safeguard these species across their migratory routes. Syed Ghulam Qadir Shah, Member (Coordination) of the Pakistan Climate Change Authority (PCCA), emphasized that bustards are ecological indicators. \"Their decline signals ecosystem imbalance. Conserving them means protecting biodiversity that sustains all life,\" he stated. Dr. Mimi Kessler, Co-Chair of the IUCN Bustards Specialist Group, stressed that evidence-based strategies are critical. \"We must invest in research to understand threats and implement effective conservation,\"she said. Rab Nawaz, Senior Director at WWF-Pakistan, warned that bustards symbolize ecosystem health, and their loss threatens natural heritage. \"The MsAP provides a framework for coordinated, cross-border action,\" he added. Dr. Rainer Raab of Bustards Without Borders called for united global efforts, while Eva Fejes from Hungary's Ministry of Agriculture highlighted Hungary's role in sharing conservation expertise. Following the workshop, a four-day field trip to Cholistan, Punjab will allow experts to assess habitat conditions, discuss conservation, and develop actionable strategies. \"Saving bustards requires immediate, science-backed, and unified efforts,\" concluded workshop participants.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}