{
  "article_id": "2025-04-14_218108360684ded4c1c40ae755a3bb6a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sc-summons-reports-on-forest-lands-across-the-country/",
    "retrieved_at": "2025-08-27T14:28:33.339Z"
  },
  "metadata": {
    "title": "SC summons reports on forest lands across the country",
    "author": null,
    "date_published": "2025-04-14T09:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 280,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 14 (APP):The Supreme Court has summoned comprehensive reports from all provincial governments and the federal government regarding the forest land case. A five-member constitutional bench headed by Justice Aminuddin Khan, and comprising Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Syed Hasan Azhar Rizvi and Justice Shahid Bilal Hassan was conducting the proceedings. During the hearing, the apex court directed all provinces and the federal government to submit detailed reports, including data on encroached and reclaimed forest land. Justice Jamal Mandokhail questioned the status of the forest land issue within Islamabad's jurisdiction, to which the government counsel responded that the matter had been resolved. Justice Mandokhail remarked that \"We don't just want reports, we need to see the reality,\". Highlighting the harsh conditions in cold regions, Justice Mandokhail asked, \"What should people in Ziarat do when temperatures drop to minus 17 degrees Celsius-should they stop cutting trees without any alternative? Has the government provided alternate energy sources in cold areas?\" The government counsel informed the court that LPG is being supplied to Ziarat. Justice Muhammad Ali Mazhar then questioned whether any subsidies are being provided to the impoverished residents of mountainous regions. Justice Aminuddin Khan stated that it is the government's responsibility to provide better facilities to the people, while Justice Mazhar pointed out that reports have been submitted since 2018, but no significant progress has been observed. Justice Hasan Rizvi noted that forest land in Sindh is being eroded by the sea, and Justice Mandokhail added that it is not the Supreme Court's job to plant trees. The Supreme Court adjourned the hearing indefinitely after directing the federal and provincial governments to submit their detailed reports.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}