{
  "title": "Religious scholars commemorate Hazrat Umar’s martyrdom day highlighting his achievements",
  "link": "https://www.app.com.pk/national/religious-scholars-commemorate-hazrat-umars-martyrdom-day-highlighting-his-achievements/",
  "date_published": "2023-07-20T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP): Ulema and Mashaykh from all corners of the country on Thursday gathered to observe the solemn day of the Martyrdom of Hazrat Umar Farooq (Radhi Allah Anho) with unwavering religious fervor.\nThe commemoration, which took place on the first day of Muharram, saw numerous religious gatherings organized across the country, including in Islamabad and Rawalpindi.\nThe purpose of these gatherings was to remember and reflect upon the life and sacrifice of Hazrat Umar Farooq (RA), the second caliph of Islam, and a revered figure in Islamic history.\nBorn in the year 584 CE in the city of Makkah, Hazrat Umar Farooq (RA), also known as Umar ibn al-Khattab, embraced Islam during the early years of the prophet-hood of the Holy Prophet Muhammad (Peace Be Upon Him).\nThroughout his life, he played a significant role in the development and propagation of Islam. Following the passing of Hazrat Abu Bakr Siddiq (RA), he assumed the mantle of leadership as the second caliph and exhibited wisdom and fortitude in his responsibilities.\nPakistan Ulema Council Chairman and Prime Minister’s Special Representative on Interfaith Harmony and the Middle East, Hafiz Muhammad Tahir Mahmood Ashrafi, shed light on the numerous achievements of Hazrat Umar Farooq (RA).\nHe stated that his martyrdom had a profound impact on the Muslim Ummah, however, despite the grief of losing their beloved leader, the Muslims remained united and steadfast in their commitment to the principles of Islam, fostering a sense of community and solidarity among believers.\nHe emphasized Hazrat Umar Farooq (RA) as a symbol of justice and fairness, stating that his martyrdom reinforced the importance of upholding these values in the eyes of Islamic law.\nDuring his caliphate, he said the Islamic Empire experienced significant territorial expansion, with his successors continuing his legacy by further spreading Islam to distant lands.\nFurthermore, he said Hazrat Umar’s (RA) caliphate played a crucial role in the codification of Islamic law and jurisprudence, with his rulings serving as the foundation for the development of the Shariah.\nThe late caliph’s dedication to education was also highlighted by Ashrafi, noting that he established schools and institutions to promote learning and his martyrdom inspired a renewed commitment to knowledge and scholarship within the Muslim community.\nHe said the principles and leadership style of Hazrat Umar (RA) continued to inspire future Muslim leaders, guiding them in their governance and decision-making.\nAs the Muslim Ummah commemorates the martyrdom of Hazrat Umar Farooq (RA) on the first day of Muharram, he said his life and sacrifice remained a timeless source of strength and guidance for Muslims worldwide.\nThey drew from his teachings, working towards unity, justice, and progress in their communities, perpetuating the enduring legacy of this great Islamic leader, he maintained.",
  "retrievedAt": "2025-08-11T08:57:45.573Z"
}
