{
  "title": "PIA restructuring crucial to overcome deficit: Saad Rafique",
  "link": "https://www.app.com.pk/national/pia-restructuring-crucial-to-overcome-deficit-saad-rafique/",
  "date_published": "2023-07-20T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP): Minister for Aviation Khawaja Saad Rafique on Thursday underscored the pressing need to restructure Pakistan International Airlines (PIA) to tackle its staggering deficit which remained at Rs. 80 billion this year.\nSpeaking here at National Assembly after moving the Pakistan Airports Authority Bill, 2022, and the Pakistan Civil Aviation Bill, 2022, he said both aimed at fulfilling international requirements and PIA services will be restored to various countries including the United States, Europe, and Britain.\nThe primary focus of these bills is to ensure that the regulatory body and airport authority operate independently, thereby eliminating any concerns about layoffs within the Civil Aviation Authority (CAA).\nHe warned that if immediate reforms are not adopted, this deficit may escalate further in the coming days.\nThe minister adamantly rejected rumors of downsizing within the aviation department and clarified that no CAA employee will face unemployment due to the restructuring efforts.\nHe emphasized that these measures were intended to benefit overseas Pakistanis and their families, who often bear the burden of exorbitant fares on other airlines.\nHe said that a statement from the former federal minister created problems for PIA, assuring that all audits and tests have been successfully cleared, demonstrating their commitment to transparency and accountability.\nRegarding the outsourcing of airports, the minister clarified that outsourcing does not equate to privatization.\nCiting examples from other countries, including India, he stated that outsourcing aims to improve airport operations through the engagement of proficient operators.\nKhawaja Saad Rafique pointed out that even Madina Airport has been successfully outsourced for enhanced services.\nIn a significant development, the House later passed the Pakistan Airports Authority Bill, 2022, and the Pakistan Civil Aviation Bill, 2022, after a thorough clause-by-clause reading and the incorporation of necessary amendments. The bills mark a crucial step towards revitalizing the national flag carrier and ensuring compliance with international standards.",
  "retrievedAt": "2025-08-11T08:57:36.049Z"
}
