{
  "title": "Seminar held on “China-Pakistan Relations in International Dynamics” at Fudan Uni",
  "link": "https://www.app.com.pk/national/seminar-held-on-china-pakistan-relations-in-international-dynamics-at-fudan-uni/",
  "date_published": "2023-07-20T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP): The 15-member delegation visiting China participated in a seminar, titled “China-Pakistan Relations in International Dynamics,” organized by the Pakistan Study Centre, Fudan University, Shanghai.\nThe delegation, being led by Ambassador Sohail Mahmood, Director General ISSI includes diplomats, leading academics, researchers and media persons. The seminar was moderated by Dr. Talat Shabbir, Director China-Pakistan Study Centre (CPSC) and Dr. Zhang Jiegen, Associate Professor and Executive Director, Pakistan Study Centre, Fudan University.\nDG ISSI Ambassador Sohail Mahmood was the keynote speaker of the seminar.\nDr. Zhang Jiegen, in his welcome remarks, gave a brief overview of the Fudan University and Pakistan Study Centre.\nIn his introductory remarks, Dr. Talat Shabbir stressed the peaceful rise of China for the good of humanity across the globe and highlighted that the Pakistan-China friendship has grown from strength to strength, where both countries enjoy a symbiotic relationship based on trust, goodwill, and close cooperation.\nAddressing the seminar on “The Philosophy of Chinese Diplomacy: From Global Development Initiative, Global Security Initiative to Global Civilization Initiative,” Prof. Lin Minwang noted that President Xi Jinping’s three Initiatives were linked to the “Chinese dream for the world” which envisaged a shared future for all including both its immediate neighbors and the world community.\nHe said that China’s role in developing the Asian Infrastructure Investment Bank (AIIB), and its role in stabilizing the situation in Afghanistan was a testament to China’s commitment towards an international community where China is not a ‘free-rider’ but a responsible power.\nDuring his remarks, Dr. Tahir Mumtaz Awan, dilated on the theme, “The Friendship Diplomacy and Emerging Chinese Initiatives for Global Good.”\nHe stated that China’s various Initiatives were complemented by its other projects aiming at South-South Cooperation, people-to-people exchanges, health projects, and efforts for enhanced environment cooperation indicating China’s expressed desire for shared prosperity across the globe.\nExpressing his views on “Pakistan’s Development Model and the CPEC,” Prof. Zhang Jiadong underlined that Pakistan holds immense potential in terms of its labor dividend and infrastructural development. Pakistan’s unique geography and its good relations with major powers further position it to be a bridge between various parts of the world. In this milieu, CPEC and Pakistan’s pivot to geo-economics complement each other.\nDr. Ayesha Alam, in her remarks, discussed the theme “CPEC: A Gateway to Regional Connectivity.” She stressed that China’s development projects including six-major corridors in various parts of the world are a testament to China’s commitment to global development. She further highlighted that it is the collective responsibility of both Pakistan and China to counter anti-CPEC propaganda which usually emanates from India and the West.\nExpressing his views on, “Regional Implications of China-US Strategic Rivalry,” Prof. Xin Qiang highlighted that the China-US rivalry is seen as a long-term, systematic, and global rivalry. He observed that it would manifest itself in all corners of the world and would likely affect various dimensions including economy, security, hi-tech, and even architecture.\nDr. Kausir Takrim spoke on the topic, “China-US Strategic Rivalry: Implications for Pakistan,” and contended that the broadening China-US rivalry, among other things, invites increasing competition between Pakistan and India.\nProf. Guo Xuetang spoke on the topic “India’s New Challenge to China-Pakistan Relations and the Regional Stability” and highlighted various dimensions of Pakistan-China relations in the context of increasing US-India ties. He, inter alia, stressed the importance of economic strength to deal with new challenges in an effective manner.\nIn his keynote address, Ambassador Sohail Mahmood highlighted the key features of the evolving global and regional environment and its implications.\nNoting that the world was witnessing an intensification of geopolitics and traditional and non-traditional security threats, he highlighted deepening conflicts and multiple crises being simultaneously faced by the world including climate change; economic downturn; extreme poverty coupled with growing inequality; weaponization of trade, and accentuation of hate-speech and Islamophobia.\nHe stressed that these crises required peaceful coexistence and cooperation to be the main drivers of international relations; however, there was a growing drift away from multilateralism and towards ‘bloc confrontation’ and a ‘new cold war.’\nHe noted that in this challenging environment, China remained globally engaged and was making efforts to turn the situation away from confrontation and toward cooperation and win-win solutions.\nThe speeches were followed by a question-and-answer session. The seminar concluded with a message of optimism for the world in general and Pakistan-China friendship in particular, where all the participants cherished the long-standing partnership of both countries and expressed a desire for deeper collaboration in diverse fields.",
  "retrievedAt": "2025-08-11T08:57:36.015Z"
}
