{
  "title": "Universal access to clean, affordable energy crucial for socio-economic justice, inclusive growth",
  "link": "https://www.app.com.pk/national/universal-access-to-clean-affordable-energy-crucial-for-socio-economic-justice-inclusive-growth/",
  "date_published": "2023-07-20T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP): Research Fellow and Advisor, Sustainable Development Policy Institute (SDPI), Dr Hassan Daud Butt remarked that increasing access to clean affordable energy remains the biggest challenge for the government.\nEnergy access has crucial linkages with all aspects of human security and without reliable, clean energy the health, education, and economic sectors will continue to demonstrate poor performance.\nHe was speaking at a roundtable discussion on “Fostering Green, Affordable, and Inclusive Energy Transition in Impoverished Regions of Pakistan” jointly organized by SDPI and UNESCAP here on Thursday.\nResilient infrastructure, investment, and financing are crucial to developing the ecosystems and building on the wisdom of rural communities, and including local, indigenous knowledge is at the heart of universal access to clean and affordable energy, he added.\nMicheal Williamson, Chief of Section, UNESCAP, stressed that the transition to clean, renewable energy is an essential component of climate action under SDG7 in terms of its carbon emission mitigation potential, efficient energy model, and social justice and stressed that everyone should have access to reliable clean energy, reiterating that no one should be left behind.\nEnergy inequality and climate action with renewable energy can cause a paradigm shift that can present viable solutions to the challenges of import dependence, price fluctuations of fossil fuels, emissions reduction, and recovery from events like Covid-19.\nAmer Zafar Durrani, President Reenergia, highlighted that insufficient power generation, poor transmission and distribution infrastructure, high supply cost to remote areas, poor policy and regulatory environment, weak planning and institutional infrastructure, and financing gaps continue to hinder off-grid solutions.\nHe stressed that scaling up renewable energy solutions will increase procurement efficiencies and ensure reliable supply, while simultaneously ensuring social and environmental safeguards.\nAisha Khan, Chief Executive, of the Civil Society Coalition for Climate Change (CSCCC) urging for policy continuity and simplifying the regulatory environment, she stressed that energy is the single largest drain on the economy and renewable energy should be considered pivotal to mitigate the widening socio-economic gap.\nUbaid ur Rehman Zia, Lead Energy Unit, SDPI mentioned that although in 2021 93.6 percent (pc) of the population had access to electricity, only 77 pc had access to grid electricity.\nBased on the SDG7 Roadmap developed by PPIB, UNESCAP, and SDPI; Pakistan will achieve universal access to electricity by 2027 which is challenging as 40.8 pc of the population will rely on polluting cooking fuels and technology in 2030. Well-planned and concerted efforts will be needed to achieve universal access to clean cooking by 2030, he stressed.\nAnis Zaman, UNESCAP, highlighted that only 77 pc of the population has access to grid electricity which considering the population of Pakistan is alarming. Private finance is pivotal to increasing access of the public to safe, reliable, and affordable energy, particularly in impoverished areas in developing countries.\nAqeel Jafri, Director of Policy, Alternative Energy Development Board (AEDB) stressed that capitalizing on the international climate funds is possible by ensuring that renewable energy projects are inclusive, innovative, and sustainable to ensure affordable energy access to the population. He stressed that the way forward for RE uptake in Pakistan lies in a strong public-private partnership.\nNafees Ahmed Khan, Renewable Energy Specialist, Pakistan Poverty Alleviation Fund (PPAF) reiterated ensuring sustainability of energy projects executed in impoverished areas. He informed that 3800 projects have been completed to provide 12MW energy and 68 mini and micro solar grids and 5 micro-hydro grids have been completed to electrify remote areas which lacked connectivity to the national grid.\nAfia Malik, Senior Research Economist, PIDE called for scaling up decentralized renewable energy access by policy transformation and development targets that are clear and consistent and developed in consultation with the local private sector, CSOs, and relevant public institutions at national and sub-national levels to ensure affordable energy access following a bottom-up approach.\nWaqas Ahmed, Head of Policy, Bank of Punjab urged the government to negotiate subsidized financing for renewable energy with IMF to enable the availability of finance to support the transfer of technology for indigenous technology development so the NDCs can be achieved.\nMohsin Phulpoto, Lead – Sustainability Initiatives JS Bank, informed that JS Bank has secured US $54 million from Global Climate Fund for the promotion of RE technologies in Pakistan in the coming decade and supports environmental sustainability and gender inclusion in these projects.\nDr Abr-e-Rehmat, Lecturer, University of Gujrat highlighted stressed highlighting low cost, economic interest, and employment generation in the impoverished regions to garner the interest of the households in transitioning to renewable energy.\nDr Khalid Waleed, Research Fellow, SDPI remarked that inequality in the latest form is climate inequality and urged building on local knowledge and devolving power to local governments to enable effective decision-making and policy implementation to expedite universal energy access.",
  "retrievedAt": "2025-08-11T08:57:46.588Z"
}
