{
  "title": "Nawaz have keys to resolve country’s crises: Javed Latif",
  "link": "https://www.app.com.pk/national/nawaz-have-keys-to-resolve-countrys-crises-javed-latif/",
  "date_published": "2023-07-20T10:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP): Federal Minister Javed Latif said that the former Prime Minister Nawaz Sharif was holding the prospect of leading the country out of its crises, provided that obstacles like the mines in his way are cleared.\nTalking to media persons here Thursday, he said despite the prevailing despondency, Pakistan possesses a formidable force in the form of Nawaz Sharif, a leader with the potential to navigate the country out of the economic quagmire. Nawaz Sharif will expedite the completion of China Pakistan Economic Corridor (CPEC) within a year, aiming to revitalize and turn around the nation’s economy, he expressed.\nHe said Pakistan Tehreek-e-Insaf (PTI) chief, Imran Khan should be arrested and prosecuted for allegedly conspiring against the nation, following the confessions of Azam Khan, former principal secretary of Imran Khan.\nJaved Latif acknowledged that there may have been some delay in unmasking Imran Khan’s true nature, but now approximately, 90 percent of the people were aware of his character. Only around 10 to 20 percent of misled youngsters continue to support him. The public has gained insights into the characters involved in plotting against the country since 2017.\nMian Javed Latif wondered why none of the individuals implicated in the events of May 9 and 10, presumed to be false and an attack on Pakistan, have been addressed or dealt with accordingly. This raises valid concerns about the handling of the situation and calls for a thorough investigation to move forward, he added.\nThe minister expressed his belief that delaying justice until September was not acceptable. He emphasized that the welfare of the entire state should not be compromised for the sake of one individual. He also mentioned that conspiracies against Pakistan were losing their potency and if the complete truth was revealed, it would have the potential to resolve all the issues faced by the country.\nMian Javed Latif remarked that the revelations about the cypher were not novel. He pointed out that such actions were carried out under the pretext of serving foreign interests while causing harm to the people’s well-being. He further highlighted that those individuals who were brought forth in such situations were later exploited to undermine the state. He also made a distinction, stating that Zulfiqar Ali Bhutto, Nawaz Sharif, and Imran Khan cannot be compared as they have different approaches and ideologies.\nThe federal minister mentioned that Bhutto faced execution, Nawaz Sharif was forced into exile and Imran Khan’s leadership allegedly weakened the state. He revealed that during two National Security Council meetings, it was concluded that there was no conspiracy involving the cypher. However, despite this conclusion, Imran Khan continued to support the cypher’s statement and no action was taken against those who facilitated him, he expressed.\nLatif asserted that Article 6 should be enforced against those who violate the state’s constitution, incite rebellion, and undermine the strength of the nation. He stated that the characters involved in the events of 2017 and the recent Cypher issue share similarities.\nThe motives behind these conspiracies are now evident to everyone and no longer concealed, he told and added, despite politicians’ sacrifices for the country, they will not allow the state to be endangered for the benefit of any one individual. It is imperative to hold all those involved in these conspiracies accountable, he said.\nHe stressed that those who believed chaos and civil unrest were the only options should understand that PML-N could still prove to be a powerful force, provided that obstacles in Nawaz Sharif’s path are removed.",
  "retrievedAt": "2025-08-11T08:57:49.313Z"
}
