{
  "title": "Kabul Expo attracts over 600 investors from region, including Pakistan",
  "link": "https://www.app.com.pk/national/kabul-expo-attracts-over-600-investors-from-region-including-pakistan/",
  "date_published": "2023-07-20T13:37:00.000Z",
  "source": "APP",
  "content": "KABUL, July 20 (APP): Over 600 investors and businessmen from Afghanistan, Pakistan, Iran and Turkmenistan are participating in the 2nd Imam Abu Hanifa International Expo and Trade Fair being held Kabul.\nArranged by the Afghanistan Chamber of Commerce and Industries from July 16-22, the Expo is also being participated by a huge number of women traders and industrialists along with their products.\nBeing termed a positive step towards the revival of Afghan economy and its access to regional and international markets, the event is being participated by Trade Development Authority of Pakistan and over 25 renowned Pakistani industrialists, which is the largest trade delegation in the event.\nThe Imam Abu Hanifa Expo is a mega event considering the history of Pakistan-Afghanistan trade relations.\nThe event would not only help promote the local products of Afghan businessmen but also enhance their linkages with the regional partners.\nThe Expo is part of the efforts of the Pakistan-Afghanistan Joint Chamber of Commerce aimed at purely promoting bilateral trade relations, regardless of political interests.\nThe opportunity given to the Pakistani participants to market their products at the Expo would help promote bilateral joint businesses as well as commercial ties.\nPakistan is already the largest trading partner of Afghanistan and is providing all possible support to the positive initiatives of the interim Afghan government.\nPakistan and Afghanistan have common values ​​that transcend borders and unite the people of both sides into brotherhood and love.\nIf the potential of Pak-Afghan natural cooperation is fully realized for the promotion of bilateral trade, the doors to prosperity will open for both countries.\nIn his address at the opening ceremony, Chief Executive of TDAP Muhammad Zubair Motiwala said that Pakistan was the largest trading partner of Afghanistan.\nHe emphasized that traders and businessmen on both sides should benefit from opportunities presented by the Expo. Pakistan always supports such bold steps which could generate a conducive environment for business communities of the region, he added.\nMotiwala stated that Pakistan is also playing all possible facilitation for Afghanistan’s smooth global trade through the transit facility provided by Pakistan.\nHe said that Pakistan has granted massive tariff concessions on all Afghan fruits and vegetables exports to Pakistan.",
  "retrievedAt": "2025-08-11T08:57:46.010Z"
}
