{
  "article_id": "2025-06-10_49373a403e087365f37c03d961b5a6ba",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-cabinet-approves-finance-bill-announces-salary-pension-hikes/",
    "retrieved_at": "2025-08-27T10:58:49.610Z"
  },
  "metadata": {
    "title": "Federal cabinet approves finance bill, announces salary, pension hikes",
    "author": null,
    "date_published": "2025-06-10T17:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 230,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 10 (APP):The federal cabinet on Tuesday approved the Finance Bill, announced 10 percent adhoc relief allowance in salaries, 7.5 percent in pensions and reduced income tax rates for the upcoming fiscal year. According to the approved bill, inflation allowance was given to federal secretariat employees from grades 1 to 16. The cabinet also approved a 10 percent ad-hoc relief in salaries and a 7.5 percent increase in pensions. Under the new tax structure, salaried individuals earning up to Rs 600,000 annually were exempted from income tax. Those earning between Rs 600,000 and Rs 1.2 million were required to pay 1 percent tax on the amount exceeding Rs 600,000. For annual salaries between Rs 1.2 million and Rs 2.2 million, a fixed tax of Rs 6,000 and an additional 11 percent tax on the amount above Rs 1.2 million was imposed. The individuals earning Rs 2.2 million to Rs 3.2 million annually were required to pay a fixed tax of Rs 116,000 along with a 23 percent tax on the amount above Rs 2.2 million. Those with annual salaries between Rs 3.2 million and Rs 4.1 million had to pay a fixed tax of Rs 346,000 and 30 percent on the amount exceeding Rs 3.2 million. The employees earning above Rs 4.1 million were taxed Rs 616,000 with an additional 35 percent on the amount above Rs 4.1 million.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}