{
  "article_id": "2025-06-10_45fad064ff2ca60a8a16358c68c08674",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-allocates-rs-1912-481-mln-for-law-justice-divisions-schemes/",
    "retrieved_at": "2025-08-27T11:01:59.833Z"
  },
  "metadata": {
    "title": "Govt allocates Rs 1912.481 mln for Law & Justice Division’s schemes",
    "author": null,
    "date_published": "2025-06-10T13:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 264,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 10 (APP):The Federal Government has allocated a total of Rs 1912.481 million under the Public Sector Development Programme (PSDP) for seven ongoing and three new development schemes of Ministry of Law and Justice Division for the fiscal year of 2025-26. According to the budgetary document released on Tuesday, out of the total allocation, an amount of Rs 216 million had been allocated for the three new schemes while Rs 1696.481 million allocated for seven ongoing schemes. The Federal Government had allocated Rs 100 million for a new scheme of construction of Admin Block of Supreme Court Branch Registry at Quetta while Rs 100 million for the Expansion of Supreme Court Branch Registry at Karachi. Meanwhile, under the ongoing schemes, the government had allocated an amount of Rs 1696.481 million including the contruction of Litigants Facilitation Center for Litigants of District Courts in Sector G-10/1, Islamabad, Rs 1,138.371 million, while the construction of Legal Fecilitation Center, Islamabad High Court (IHC) at Constitution Avenue, G-5/1, Islamabad, Rs 201.785 million, and the Automation of Federal Courts/Tribunals (Phase-II) (Revised), Rs 170 million. Similarly, Strengthening and Capacity Enhancement of Legal Wings of the Ministry of Law and Justice and Federal Ministries/Division, Islamabad (Revised) Rs 110 million, while the Construction of New Building for Supreme Court, Branch Registry at Karachi Rs 30 million. Furthermore, the government allocated Rs 27 million for the Archiving and Digitalization of Legislation and Record of MInistry of Law and Justice (Revised) and Rs 19.325 million has allocated for the Strengthening of Planning and Monitoring Unit in Ministry of Law and Justice, Islamabad (Revised).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}