{
  "article_id": "2025-06-10_6224d5b24e77b00cb07209da44605626",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/scci-urges-reforms-to-unlock-economic-growth-welcomes-dialogue-on-budget-2025-26/",
    "retrieved_at": "2025-08-27T10:58:49.941Z"
  },
  "metadata": {
    "title": "SCCI urges reforms to unlock economic growth, welcomes dialogue on Budget 2025-26",
    "author": null,
    "date_published": "2025-06-10T18:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 364,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Jun 10 (APP):The Sarhad Chamber of Commerce and Industry (SCCI) on Tuesday reaffirmed its commitment to constructive engagement with the government, urging policymakers to revisit and integrate business-friendly proposals to support sustainable economic growth under the Federal Budget 2025-26. Speaking at a press conference held at the Chamber House here, SCCI President Fazal Moqeem Khan said the business community remains hopeful that the government will consider the Chamber's comprehensive recommendations aimed at reviving industry, particularly in regions like Khyber Pakhtunkhwa that have been significantly affected by past challenges. President Moqeem Khan acknowledged the difficult fiscal environment under the current IMF program, and emphasized the need for pragmatic, growth-oriented steps. \"We understand the constraints, but believe it is still possible to build a progressive and inclusive economic roadmap by incorporating input from the real stakeholders, the business community,\" he noted. The press briefing was attended by senior SCCI leaders, including Senior Vice President Abdul Jalil Jan, former FPCCI President Ghazanfar Bilour, ex-president Haji Muhammad Afzal, and prominent members of the Chamber's executive body and trade community. The united presence reflected a strong call for continued dialogue and cooperation with the government. While identifying areas needing improvement, the Chamber also welcomed the government's willingness to engage and expressed confidence that amendments could be made before the final approval of the fiscal budget. \"We urge the authorities to review taxation policies and bring balanced measures that support both large industries and small traders,\" said Haji Muhammad Afzal, who also represents the FPCCI in the region. Former FPCCI President Ghazanfar Bilour stressed the importance of protecting the middle class and ensuring that fiscal policies encourage domestic investment. \"By creating an enabling environment, we can turn challenges into opportunities and retain valuable local capital,\" he said. The SCCI leadership reiterated that a truly business-friendly budget is essential for long-term economic stability and social development. They called upon the government to roll back excessive powers granted under recent FBR regulations and consider incentives that boost productivity, exports, and employment. In conclusion, the Chamber reaffirmed its readiness to collaborate with policymakers for national economic betterment and urged all stakeholders to work towards a budget that is fair, forward-looking, and inclusive.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}