{
  "article_id": "2025-06-10_5de0f9d1245805ebd72e1c3571740d3d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-government-allocates-rs-5418-million-for-suparcos-space-projects-in-psdp-2025-26/",
    "retrieved_at": "2025-08-27T11:02:01.380Z"
  },
  "metadata": {
    "title": "Federal Government allocates Rs. 5,418 million for SUPARCO’s Space Projects in PSDP 2025-26",
    "author": null,
    "date_published": "2025-06-10T13:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 201,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 10 (APP):The federal government has allocated Rs. 5,418.523 million for Space and Upper Atmosphere Research Commission (SUPARCO) in the Public Sector Development Programme (PSDP) 2025-26 to advance Pakistan's space capabilities through six ongoing and new projects. An amount of Rs. Rs 4,418.523 million has been allocated for the four ongoing projects while Rs. 1,000 million has been reserved for the two new projects. Among the ongoing projects, the highest allocation of Rs. 1,518.523 million has been made for the \"Establishment of Pakistan Space Centre\" while significant funding of Rs. 1,300 million has been earmarked for the \"Establishment of Deep Space Astronomical Observatories in Pakistan\". The Pakistan Optical Remote Sensing Satellite (PRSS-O2) program has received Rs. 1,200 million allocation while Rs. 400 million will go for Pakistan Multi-Mission Communication Satellite System (PakSat-MM1). Among the new space exploration projects, Rs. 600 million has been allocated for the ambitious \"Pakistan Manned Space Mission\" program and Rs. 400 million for development of the \"Pakistan Lunar Exploration Rover\" (PLEXR) for the Change E-8 Mission, representing Pakistan's first foray into lunar exploration. These allocations demonstrate Pakistan's commitment to developing indigenous space capabilities, including satellite communications, remote sensing, and now manned space missions and lunar exploration.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}