{
  "article_id": "2025-06-10_e4f0a5ce8d7d1069c788c609151f31d8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/business-community-applauds-incentives-for-construction-sector-in-budget/",
    "retrieved_at": "2025-08-27T10:58:49.064Z"
  },
  "metadata": {
    "title": "Business community applauds incentives for construction sector in budget",
    "author": null,
    "date_published": "2025-06-10T17:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 207,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 10 (APP):The Business community on Tuesday termed the federal budget 2025-26 as largely inspiring, welcoming several positive initiatives particularly for the construction sector, which drives nearly 50 allied industries and plays a pivotal role in employment generation and tax revenue. Addressing a press conference, President Islamabad Chamber of Commerce and Industry (ICCI) Nasir Mansoor Qureshi praised the government's allocation of funds for a cancer hospital in Islamabad and the significant reduction in stamp duty from 4% to 1%, calling these steps commendable. He urged the government to focus on sustainable industrial growth instead of primarily chasing tax targets and reiterated that the business community supports taxation, but it must be rational, realistic, and free from coercion. He also urged for a reduction in interest rates to single digits, which would support economic expansion and urged the government to revisit agreements with Independent Power Producers (IPPs) to bring down energy costs and eliminate the burden of peak-hour charges on consumers and businesses. At the outset, Qureshi paid rich tribute to the Pakistan Armed Forces, especially the Pakistan Air Force, for enhancing national prestige in the recent Pak-India clash and securing export orders for JF-17 Thunder jets, a move expected to boost the country's defence production sector.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}