{
  "article_id": "2025-06-10_8fcb267c13f2bf6e49f964300caaa9d7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rs-3550-mln-earmarked-for-kagb-and-safron-in-psdp-2025-26/",
    "retrieved_at": "2025-08-27T11:01:11.617Z"
  },
  "metadata": {
    "title": "Rs 3,550 mln earmarked for KA&GB and SAFRON in PSDP 2025-26",
    "author": null,
    "date_published": "2025-06-10T13:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 266,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 10 (APP): The federal government has allocated a sum of Rs. 3,550 million for completing ongoing and also for new projects of Kashmir Affairs and Gilgit Baltistan and SAFRON under the Public Sector Development Programme (PSDP) during the upcoming financial year 2025-26. According to a budget document issued here on Tuesday an amount of Rs. 1750 million has earmarked for the Strengthening Institutions for Refugees Administration (SIRA). The government has allocated Rs. 1800 million for the Hosting Community Support Program (HCSP). The Government has allocated Rs 495 million for Establishment Division for on-going schemes including Rs 100 million for Reconstruction of Boundary wall sewerage system and provision of solar tubewell and over head water tank at PARD, Peshawar, Rs 100 million for reconstruction of staff welfare working women hostel at sector G-7 Islamabad. Rs 200 million earmarked for construction of residential facilities for female officers in H-8/4 Islamabad. Rs 95 million allocated for new scheme digitalization of in-house processes and automation of examination system of Federal Public Service Commission (FPSC). The federal government has allocated Rs 70,338 million for Cabinet Division for on-going projects including Rs 70,000 million for sustainable development Goals achievement programm (SAP), Rs 138 million earmarked for infrastructure development of Islamabad techno polls, Rs 100 million for Rehabilitation and up-gradation of building of national archive of Pakistan and Rs 100 million allocated for enhancement of combat efficiency /security measures of 6-squadron and up-gradation of power supply to solar system. Under the Public Sector Development Programm Rs 50 million has been allocated for rehabilitaion and up-gradation of regional office building ,NAP Karachi.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}