{
  "article_id": "2025-06-10_173e35a4b64aaa448816c52ebbf2c872",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-allocates-rs-23270-mln-for-planning-commission-projects-in-psdp-2025-26/",
    "retrieved_at": "2025-08-27T11:01:34.902Z"
  },
  "metadata": {
    "title": "Govt allocates Rs.23,270 mln for Planning Commission projects in PSDP 2025-26",
    "author": null,
    "date_published": "2025-06-10T13:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 204,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 10 (APP):The federal government will spend around Rs.23,270 million on 21 projects of the Planning, Development and Special Initiatives Division under the Public Sector Development Programme (PSDP) during the upcoming financial year 2025-26. According to a budget document, an amount of Rs.2,095.141 million has been allocated for 10 ongoing development projects and Rs.21,175 million for 11 special initiatives schemes of the Planning Division. Among ongoing schemes, Rs.500 million for the construction of plan house at administrative sector, F-5/2 Islamabad while Rs.300 million for feasibility and construction of PIDE (campus), at H-16, Islamabad. An amount of Rs.250 million earmarked for the capacity building and institutional strengthening of Ministry of Planning, Development & Special Initiatives while Rs.200 million for the competitive grants program for policy-oriented research. Among Special Initiatives, the government has allocated Rs. 18,000 million for the post-flood 2022 reconstruction program: Resilience enhancement and livelihood diversification in Balochistan whereas Rs.1,000 million for the rising together projects for the uplift of 20 poorest districts of Pakistan (50:50). The government has allocated Rs.500 million for the national multi-sectoral nutrition programme to reduce stunting and other forms of malnutrition whereas Rs.375 million for the centre of excellence of CPEC counterpart NDRC's academy of macroeconomic research, China.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}