{
  "title": "NDRMF working out plan to transform IIA into ‘zero emission’ EV-based airport",
  "link": "https://www.app.com.pk/national/ndrmf-working-out-plan-to-transform-iia-into-zero-emission-ev-based-airport/",
  "date_published": "2023-11-19T10:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP): The National Disaster Risk Management Fund (NDRMF), a dedicated financial entity focused on investments in disaster risk reduction, risk financing, and climate change, is working on a plan to transform the Islamabad International Airport (IIA) into an emission-less electric vehicle (EV)-based airport, which will be the first of its kind and an environmentally friendly initiative.\nPakistan approved its EV policy back in 2019 with its global nationally determined commitments (NDCs) pledged under the United Nations Framework Convention on Climate Change (UNFCCC) meeting of its conference of the parties to the convention (COP) forum to convert 30 percent of transport over EVs by 2030.\nAn official of the NDRMF told APP that it was a unique initiative to set a model of EVs replicable across the country and enable the key players to initiate steps for rolling out better options for introducing electric vehicles in the market.\nHe added that it was a tedious task, and the fund was making dedicated efforts in this regard to achieve its objective.\n“Moreover, the Fund is also working on the country’s first ever risk financing strategy, which will be tabled at the highest-level forum of the federal cabinet for approval.”\nThe fund, he said, had redefined its role as a financial intermediary working to strengthen the fiscal space of the country in terms of dollar value by promoting carbon markets, saffron, and olive oil harvesting-like initiatives, whereas it was also venturing into updating the oceanographic data of the country, which was also done back in 1986.\nThe country has huge knowledge gaps in disaster and climate risk modeling that need to be addressed through modern and advanced technological solutions providing informed and real-time data.\nTo address that issue, the Fund has established a special data center with the assistance of the Pakistan Space and Upper Atmosphere Research Commission (SUPARCO), which will be rolled out in January 2024 and will be accessible to all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:35:44.482Z"
}
