{
  "title": "PMD issues dengue outbreak warning for month of October",
  "link": "https://www.app.com.pk/national/pmd-issues-dengue-outbreak-warning-for-month-of-october-2/",
  "date_published": "2024-09-29T08:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP):The Pakistan Meteorological Department has issued a warning of potential dengue outbreak in month of October indicating that the ideal conditions for the disease have emerged.\nThe department said that dengue may see a significant rise in October, particularly in ten major cities across Pakistan, including Karachi, Lahore, Peshawar, Rawalpindi, Islamabad, Hyderabad, Faisalabad, Sialkot, Larkana, and Multan. The other regions affected by post-monsoon rainfall are also at risk.\nOver the past decade, dengue fever has severely impacted the health of population, particularly during the post-monsoon season.\nThe period from September 20 to December 05 has become increasingly dangerous for dengue spread, with environmental factors playing a significant role.\nAccording to the PMD, dengue transmission is triggered when temperatures remain between 26 C and 29C for three to five weeks, with humidity levels of around 60 percent.\nSimilarly, rainfall exceeding 27mm, combined with a time lag of up to three weeks, further increases the risk.\nThe disease-carrying mosquitoes are most active two hours after sunrise and two hours before sunset, with breeding coming to a halt only when temperatures drop below 16 C.\nBased on a detailed analysis of historical data and the current climate outlook, the PMD experts have warned that conditions have become highly conducive to dengue onset since mid-September.\nThe PMD has urged all relevant stakeholders, including national health agencies and dengue control centers, to take immediate preemptive measures in the affected districts.\nThe authorities have been advised to remain vigilant and regularly consult the PMD website for updates and guidance on controlling the outbreak.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:26:24.208Z"
}
