{
  "title": "Over 25 students injured in clash between two student groups at Quaid-e-Azam University",
  "link": "https://www.app.com.pk/national/over-25-students-injured-in-clash-between-two-student-groups-at-quaid-e-azam-university/",
  "date_published": "2024-09-29T11:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP):More than 25 students were injured in a violent clash between two student groups at Quaid-e-Azam University in Islamabad last night and university administration has lodged a complaint against members of both groups involved in the incident, sparking concerns over campus safety.\nA violent confrontation took place between the Punjabi Students group and Pakhtun Students group at Quaid-e-Azam University late on the night of September 28, 2024. The clash, which erupted near the university hostels, saw dozens of students from both sides engaging in a physical fight, a police officer said while talking to APP on Sunday.\nAccording to a report filed by the English campus manager of Quaid-e-Azam University, Lieutenant Colonel Nadeem Abbas, the incident began when a guard from hostel number 5 informed him of an altercation in the square above Karachi Heights. Upon investigating, it was found that some Punjabi students had assaulted Muzammil Marwat, a member of the Pakhtun Students group, who suffered serious head injuries during the attack.\nFollowing the initial confrontation, tensions escalated as students from both groups began to gather in large numbers. Around 70 to 80 students from the Punjabi Students group, led by Punjab Council Chairman Rana Hassan, assembled near hostel number seven. They were reportedly armed with sticks and iron rods.\nMeanwhile, around 300 students from the Pakhtun Students group gathered at the New Cafeteria under the leadership of Pakhtunkhwa Community Students Chairman Asad Turi. Many of them were also seen carrying sticks and iron rods. Turi reportedly addressed his group raising violent slogans, after which the students marched towards hostel number seven, where they clashed with the Punjabi Students group.\nThe violent exchange between the two groups lasted for approximately 40 minutes. During this time, over 25 students were injured. The university administration called the police to intervene, and the situation was eventually brought under control.\nThe police registered a case at Secretariat police station under FIR No-458/24 on September 29. The case was filed under sections 324, 506, 148, and 149 of the law, which deal with causing harm, issuing threats, and unlawful assembly. Both groups now face legal action as authorities investigate the full extent of the incident.\nThe clash has raised concerns among the student body and the administration about the rising tensions between student groups on campus. This is not the first time such an incident has occurred at Quaid-e-Azam University, and many are calling for stricter measures to prevent future violence.\nThe university has yet to release an official statement on the matter, but students and staff alike are urging for calm and peaceful dialogue to resolve the underlying issues between the groups. Moreover, the campus remained on high alert as authorities work to restore order and ensure the safety of all students.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:26:02.270Z"
}
