{
  "title": "The smell of negligence: CDA’s garbage trucks turn Expressway commute into a nightmare",
  "link": "https://www.app.com.pk/national/the-smell-of-negligence-cdas-garbage-trucks-turn-expressway-commute-into-a-nightmare/",
  "date_published": "2024-09-29T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): Every day, Islamabad Expressway, the city’s major artery, becomes a landfill as overloaded and improperly covered waste management trucks from the Capital Development Authority (CDA) spill litter onto it. This transforms daily commutes into a nightmare, particularly for bikers.\nWith approximately 1,200 tonnes of garbage generated daily by the capital, this careless and unhygienic disposal highlights the CDA’s negligence in waste management. The situation has prompted urgent pleas for action from frustrated travelers, forced to navigate an unsanitary and stinky environment that threatens both their comfort and health.\nThe annoyed commuters have expressed their outrage on this situation when talking to APP.\nAhmed Khan, a bank official who travels from Model Town Hummak to Melody Islamabad, shared, “I can’t believe this is what our city has come to. Every day, it’s like driving through a pungent trash dump.”\nAnother commuter, Bilal Ahmed, a government employee who rides his bike from Jinnah Garden to the Secretariat, recounted a particularly terrible experience. “On a rainy day, I got splattered with garbage on my way home. And It was a nightmare. I had to take a bath and change clothes as soon as I got home, and I lost my appetite for days because of it.”\n“Despite numerous complaints, there seems to be little response from the civic body. Their failure to enforce proper waste management protocols raises questions about their commitment to public health and safety. Commuters continue to experience unpleasant odors and hazardous conditions. “It’s unacceptable,” said Zahid Shah, who commutes daily from Sihala to F-7 and vice versa.\nThe CDA currently collects garbage from the city and temporarily dumps it at I-11 before transporting it to Losar. They are also working on establishing a proper transfer station at I-9, expected to be completed in six months.\nThe CDA has frequently proposed setting up a “scientific landfill” site, only to change plans later. They are now looking to acquire land in Losar after negotiations with the Rawalpindi administration. However, they have relied on temporary arrangements due to the unavailability of a landfill site in Islamabad. This lack of a proper landfill has even been brought before the Islamabad High Court, which directed the CDA to resolve the issue, underscoring the urgent need for a sustainable solution.\nAn official of Sanitation Department in a recent statement to media had informed that they were in talks to procure land in Losar for a proper landfill site, noting that the board had approved a six-month extension with Rawalpindi Waste Management Company for this purpose.\nLast year, the CDA proposed sites at Kuri and Dhoke Jando near Nicholson’s Monument, but previous proposals have faced rejection. The lack of a landfill site has even been brought before the Islamabad High Court, which directed the CDA to resolve the issue. “It is unfortunate that a city of around three million people has no proper landfill,” said a lawyer involved in the case, emphasizing the environmental and health risks.\nAn official from the CDA mentioned that the agency spends over two billion rupees annually on waste management. If a proper landfill site were developed, it could potentially generate revenue through waste-to-energy projects. Previously, the CDA dumped garbage in the residential area of I-12 until a court ruling in 2022 shifted outside residential zones.\nIn the past, the CDA had chosen a site at Kuri village based on recommendations from international consultants, but this project was shelved in 2011, allegedly to appease housing scheme owners. Since then, the civic agency has moved temporary landfill sites from one location to another.\nInterviews with CDA workers reveal the reality behind the litter problem. According to them, garbage used to be dumped in the Tang Bhata area. While CDA policy dictates that trucks should be covered with a green cloth, this is often ignored. “It’s a pity,” one worker admitted. “The cloth is frequently not secured, and sometimes the trucks are so overloaded that garbage spills out onto the roads.”\nAs the capital established in 1960 faces various challenges, the growing burden of waste management has become a serious problem for residents of Rawalpindi and Islamabad. Public health is at risk, and the demand for permanent solutions is intensifying. It’s time for the CDA to take decisive action, prioritize waste management, and restore the cleanliness of the capital’s roads. The urgency of this situation cannot be ignored.",
  "retrievedAt": "2025-08-10T21:25:47.627Z"
}
