{
  "title": "COMSTECH-Mauritania to collaborate through joint Science and Technology Capacity Building Program",
  "link": "https://www.app.com.pk/national/comstech-mauritania-to-collaborate-through-joint-science-and-technology-capacity-building-program-2/",
  "date_published": "2024-09-29T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP):COMSTECH- the OIC Standing Committee on Scientific and Technological Cooperation has announced research fellowships for students, scholars and institutions in Mauritania in order to strengthen the ties and build scientific capacity in Mauritania.\nAccording to an official source, these research fellowships have been announced by the COMSTECH and National Agency for Scientific Research and Innovation, Mauritania under the Joint Science and Technology Capacity Building Program.\nCOMSTECH shares a long-standing brotherly relationship with Mauritania and this program will further strengthen the scientific cooperation between the two countries.\nUnder the COMSTECH-Mauritania Program, Research Fellowships will be offered to young researchers and early stage scientists/engineers in Mauritania to enable them to spend six months at a relevant center of excellence in many listed institutions of OIC member states, especially Pakistan.\nThe purpose of these fellowships is to enhance the research and development capacity of promising researchers and engineers from Mauritania at the beginning of their research career, helping them to foster linkages for further collaboration in their fields.\nBesides this program, Mauritania students and scholars may also participate in other COMSTECH programs which are launched and publicized through COMSTECH website and social media.\nSimilarly, the Research and Development institutions of Mauritania may collaborate with COMSTECH Center of Excellence institutions for exchange of knowledge, expertise, technology and resources to develop their capacities and devise solutions.\nThe last date for application submission will be December 10 and all the details of the program are available at the web link: https://comstech.org/comstech-mauritania-program-nov-2023/.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:26:24.501Z"
}
