{
  "title": "ECP completes priority training for over half a million election staff",
  "link": "https://www.app.com.pk/national/ecp-completes-priority-training-for-over-half-a-million-election-staff/",
  "date_published": "2024-01-04T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 04 (APP): The Election Commission of Pakistan (ECP) has completed priority-based training for 579,191 election supervisory staff out of the total 985,413 appointed for the smooth conduct of the 2024 general elections.\nAn ECP spokesman said on Thursday that the Commission had  initiated training for nearly one million election staff during the last  week of November, 2023, which would conclude by February 1, 2024.\nThe remaining 406,222 election supervisory staff, including District Returning Officers, Returning Officers, Presiding Officers, Assistant Presiding Officers, and others would be imparted training before the deadline, he added.\nStrict disciplinary action was being taken against the staff who remained absent during the training programme, the ECP spokesman said.\nHe said in compliance with the ECP’s special directives, the central control room had been fully operational since December 26, 2023, addressing and resolving complaints promptly.\nTo date, the central control room had received 45 complaints, all of which had been resolved, he added.\nThe spokesperson said the central complaint cell at the Election Commission Secretariat also handled 165 complaints, promptly processing and issuing necessary instructions to the relevant authorities.\nHe said a network of 180 control rooms had been activated at the provincial, divisional, and district levels, collaborating with the Central Control Room to monitor elections and swiftly address complaints.\nMonitoring teams deployed nationwide in every district had also been mobilized to actively remove promotional materials daily, addressing violations of the code of conduct by candidates, the spokesperson added.\nHe said the District Monitoring Officers had issued notices for various Code of Conduct violations, and subsequent legal action would be taken following inquiries.",
  "retrievedAt": "2025-08-10T23:23:05.337Z"
}
