{
  "title": "Pakistan to always champion Jammu & Kashmir cause: PM",
  "link": "https://www.app.com.pk/national/pakistan-to-always-champion-jammu-kashmir-cause-pm/",
  "date_published": "2024-01-04T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP): Prime Minister Anwaar-ul-Haq Kakar on Thursday said that Pakistan would always champion the Jammu and Kashmir cause and its resolution as per the United Nations Security Council resolutions and the wishes of the Kashmiri people.\nHe was speaking at the ongoing Envoys’ Conference being held at the Ministry of Foreign Affairs from January 4-6, 2024.\nPakistan’s envoys from important capitals are participating in the conference and are deliberating on various facets of Pakistan’s foreign policy.\nWelcoming the prime minister, Foreign Minister Jalil Abbas Jilani outlined the framework of discussions at the Envoys’ Conference and its importance as a deliberative forum on diplomatic challenges and opportunities for Pakistan in view of the global and regional developments.\nHe underscored the need for strengthening the anchoring role of the Foreign Office in foreign policy formulation and implementation.\nThe prime minister, in his key-note address, shared his perspective about the pressing demands on the conduct of Pakistan’s foreign policy to align it with present-day imperatives.\nHe said that the foreign policy should be guided by a vision of Pakistan as a progressive, economically ascendant state that prioritizes the socio-economic well-being of its people.\nIt should also continue to aim for peace and mutually beneficial relations across the globe, he added. Pakistan would continue to stand for international law and purposes and principles of the United Nations Charter, mainstreaming economic diplomacy and support the Palestinian cause, the prime minister said.\nHe termed the conference timely and relevant against the backdrop of profound transformations taking place in the region and around the globe.\nHe reaffirmed his trust in Pakistan’s diplomacy and diplomats in their capability to fully deliver despite pressing odds, and expressed the hope that the deliberations of the conference would lead to practical suggestions to navigate Pakistan’s foreign policy through present day challenges.\nPM Kakar extended his best wishes to the Foreign Office and Pakistani diplomats in safeguarding the country’s interests and advancing its global stature.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:23:34.636Z"
}
