{
  "title": "NTL and NRTC forge partnership for indigenous biometric technology development",
  "link": "https://www.app.com.pk/national/ntl-and-nrtc-forge-partnership-for-indigenous-biometric-technology-development/",
  "date_published": "2024-01-04T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 04 (APP): National Database Regulation Authority (NADRA) Technologies Limited (NTL) and National Radio & Telecommunication Corporation (NRTC) inked a Memorandum of Understanding, signalling a joint effort in the indigenous co-development and production of biometric technologies.\nAccording to the press release issued on Thursday, The signing ceremony took place today at NADRA Headquarters, formalizing this collaborative venture.\nNTL, renowned as a system integrator for Digital Identity Solutions using the Pakistan ID Stack, brings a wealth of expertise to the partnership. Its domestic offerings include its flagship product e-Sahulat and a bouquet of biometric verification services enabling fintech and telecom sectors. Internationally, NTL has successfully implemented projects in e-governance, e-passports, smart identity cards, and civil registration.\nNRTC, with its specialization in telecommunication equipment, electronic systems, surveillance platforms, and software solutions, adds its state-of-the-art design and manufacturing capabilities to the collaboration. Renowned for both defence and civil sector products, NRTC operates with distinction at home and abroad.\nThis collaboration is geared towards the indigenous design and production of biometric and identity-related technologies, serving both local and international markets.\nThe MoU was signed by MD NRTC, Brigadier Muhammad Asim Ishaque, and CEO NTL, Gohar Ahmad Khan, marking a significant milestone in the joint pursuit of indigenous technological advancements. Senior management from both NTL and NRTC witnessed the signing ceremony.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:23:26.901Z"
}
