{
  "title": "PM assures govt support to promote locally-developed crop varieties",
  "link": "https://www.app.com.pk/national/pm-assures-govt-support-to-promote-locally-developed-crop-varieties/",
  "date_published": "2023-10-30T16:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 30 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday assured of his government’s support to promote the locally-developed new varieties of crop seeds of wheat, sugarcane, soybeans and others with a view to reducing dependence on imported ones.\nThe prime minister, while visiting the stalls of different agricultural products set up by the agriculture universities of the country at an exhibition here, assured that the government, through swift decision-making, would remove all the impediments in the introduction of new seeds.\nDuring the briefing, he was told that the country’s agricultural research entities had developed new seeds of wheat, sugarcane and soybeans which were climate resilient and had the potential of giving up to three times more yield by consuming far less water than the existing varieties.\nThe prime minister, who was accompanied by Caretaker Punjab Chief Minister Mohsin Naqvi was told that the federal government would have to amend the rules to promote the locally-developed crop seeds.\nTo this, the prime minister assured that the government would make the required decisions within a week.\nThe prime minister, who interacted with the representatives of the universities, was told that a new heat-resistant wheat seed has been developed to provide three times more yield.\nIt was said that the genetically modified soybean seed would help the country compete with the world market besides supporting its poultry industry and reducing the import of edible oil.\nSimilarly, the new sugarcane variety would consume one-thrid water and reduce crop duration from 13 months to five years with far more yield.\nThe prime minister was also briefed on the production of olive, honey, and new varieties of cotton as well as the modern spray equipment.\nAs the prime minister visited the stall set up by Ayub Agricultural Research Institute (AARI), Chief Scientist Agricultural (Research), Dr. Muhammad Akhter told him that the Institute had evolved 705 varieties and hybrids of crops, fruits and vegetables which were popular and extensively cultivated over around 90 percent area across Punjab. All of the varieties are high-yielding, climate-smart and disease resistant.\nIt was told that the AARI developed new wheat varieties having a yield potential of 80 monds per acre in irrigated and 53 monds per acre in rain-fed conditions.\nAs far as cotton is concerned, its FH-333 variety is heat-tolerant with a yield potential of 90 monds per acre in early sowing and 50 in seasonal.\nSimilarly, the AARI’s rice varieties have a high yield potential of 80 monds per acre having the longest grain in the world. The AARI’s sugarcane varieties have a yield potential of over 2200 monds per acre.\nHaving produced olive varieties BARI Zaitoon-1, BARI Zaitoon-2 and Gohar, the Institute has already started exporting olive oil as over two million olive plants had been planted over 15,000 acres in Pothwar region.",
  "retrievedAt": "2025-08-11T10:18:30.916Z"
}
