{
  "title": "Clean energy Pakistan’s top priority: Caretaker Energy Minister",
  "link": "https://www.app.com.pk/national/clean-energy-pakistans-top-priority-caretaker-energy-minister/",
  "date_published": "2023-10-30T07:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 30 (APP): Caretaker Minister for Energy Muhammad Ali has said that clean energy was the top priority of Pakistan.\nHe stated this while talking to the Ambassador of Denmark to Pakistan Jacob Linulf who visited the Power Division here Monday, said a press release.\nThe minister said that the world was witnessing a much-needed transition towards clean energy in the wake of climate change. Pakistan, being more vulnerable to impacts of the global climate change, has also to adapt to and mitigate the Climate Change at the country level, he said.\nHe said that the government of Pakistan had recently approved the National Electricity Plan 2023 which provided guidelines, implementation mechanisms and tools for the realization of the National Electricity Policy goals for the power sector. The Plan 2023 targets to have a share of 40 percent from renewables (including hydropower) by 2025 and 60 percent by 2030, he told.\nThe minister said that Denmark’s support based on their expertise and experience would certainly be beneficial for Pakistan in making the transition towards cleaner and greener energy mix and in fulfilling Pakistan’s commitments towards Climate Change targets and Sustainable Development Goals.\nThe brief of the update on Danish Energy Transmission Initiative (DETI) project was also discussed in the meeting.\nThe ambassador expressed his aim to take the cooperation between the two countries to the next level.\nThe minister discussed the possible plan to expand sustainable energy, particularly focusing on wind and solar energy. Power Sector plays an important role in Climate Change mitigation and accordingly the government is giving top priority to just energy transition in Pakistan.\nHe said that the true success of the transition was to have the real impact in the area of sustainable energy. The aim is to gradually decrease the tariff and move towards utilization of indigenous resources, he expressed.\nThe minister stressed on the importance of mapping out a plan in collaboration with Denmark as it has already completed its energy transition.\nThe updates of the DETI project, the government-to-government contact and the stakeholders were discussed in the meeting. There are two thematic areas of the project, one being energy planning and modelling, and the other being the integration of renewable energy.\nThe agenda for the Conference of Parties (COP-28) meeting was also discussed. There will be two scenarios discussed in COP-28 with respect to DETI. The one scenario will be the green scenario where the progress of wind and solar energy will be discussed and the other scenario will be the economic aspect.\nThe grid constraints were also taken into consideration. The minister said that the agenda will be designed to attract maximum green investment in Pakistan.\nFor future collaboration, it was decided that the analysis of the existing transmission and distribution network in order to identify the bottlenecks and recommend a way forward for induction of more renewable energy capacity, especially with regards to the Interconnection Ready Zones (IRZs) identified in the Locational Study carried out by the World Bank will be done.\nThe DETI will provide advice and recommended measures to decrease the impact of seasonal demand variations (between summer and winter) in order to improve energy supplies while maintaining system stability, especially considering the impact of new VRE additions as per IGCEP 2022-31.\nThe minister said that the power division aimed for progressive and extensive cooperation with Denmark to achieve its green energy milestones.\nThe ambassador appreciated the efforts of Pakistan for the transition of energy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:18:45.238Z"
}
