{
  "title": "Govt allows educational institutions to resume classes at middle level: Shafqat",
  "link": "https://www.app.com.pk/national/govt-allows-educational-institutions-to-resume-classes-at-middle-level-shafqat/",
  "date_published": "2020-09-22T08:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP):The government on Tuesday announced to reopen educational institutions at middle level classes (6-8) across the country from September 23 (today) under strict anti-COVID-19 standard operating procedures (SOPs).\nMinister for Education and Professional Training, Shafqat Mahmood formally announced the decision during a televised media briefing along with Special Assistant to the Prime Minister on National Health Services, Dr Faisal Sultan here at the National Command and Operations Center (NCOC).\nHe said that the decision for reopening of schools was taken in the meeting held at NCOC, participated by the provinces, Azad Jammu and Kashmir, Gilgit-Baltistan and Dr Faisal Sultan along with his team, he told.\nShafqat informed that the educational institutions of district Rawla Kot AJK will not be opened from tomorrow, while Sindh province has also refused to open the institutions from tomorrow. Sindh has asked to further review the COVID-19 situation for next one week before reopening of educational institutions, he said.\nAfter strictly monitoring the COVID-19 situation for next one week, he said that the government would be able to make a decision for reopening of the primary level institutions (1-5) on September 30\nShafqat said the educational institutions including universities, intermediate (11th and 12th) and secondary (9th and 10th) classes had already been allowed to resume their studies from September 15.\nIn the second phase, he said, the students of sixth, seventh and eighth classes have been allowed to attend their schools on September 23 (today).\n“It was really a difficult and tough decision to reopen the educational institutions,” he said, adding that constant monitoring of the first phase was carried out before commencing of the second and third ones.\nShafqat dispelled the wrong impression that schools were being closed due to some new case of pandemic, saying the educational institutions were being closed for not following the SOPs.\nAll decision were being taken on the basis of statistics and with the recommendations of ministry of health, he said adding that the next meeting will be held on September 29 to review the current situation for pandemic before reopening of last phase of educational institutions.\nHe also clarified that under the decision of NCOC taken in July, all educational institutions were allowed to take routine exams.\nHe, however, said that there was no reason to postpone the exams any more.\nHe urged the parents, students and teachers to strictly follow the SOPs to prevent from the pandemic.",
  "retrievedAt": "2025-08-11T19:49:42.098Z"
}
