{
  "title": "President confers Hilal-e-Pakistan on outgoing Chinese envoy",
  "link": "https://www.app.com.pk/national/president-confers-hilal-e-pakistan-on-outgoing-chinese-envoy/",
  "date_published": "2020-09-22T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP): President Dr Arif Alvi on Tuesday conferred the Hilal-e-Pakistan award on the outgoing Chinese Ambassador Yao Jing in recognition of his service to strengthen bilateral ties between the two countries.\nAt a ceremony held here at the Aiwan-e-Sadr, the president decorated Ambassador Yao Jing with the country’s second highest civil award, given to the people for their meritorious contribution to the national interests of Pakistan.\nThe event was attended by Senate Chairman Sadiq Sanjrani, National Assembly Speaker Asad Qaiser, federal ministers and high government officials.\nLater, Ambassador Yao Jing called on the president and discussed matters pertaining to bilateral relations between the two countries.\nPresident Alvi termed China a close friend, which had always supported Pakistan on its all issues of national interest.\nHighlighting the economic and strategic significance of China Pakistan Economic Corridor (CPEC), he stated that the Corridor would increase regional connectivity and countries of the region, particularly Afghanistan and Central Asian countries, would enormously benefit from it.\nHe emphasized the need for further strengthening defence cooperation between the two all-weather friends, adding that Pakistan was looking forward to the visit of President Xi Jinping which would further boost bilateral cooperation in the areas of trade, economy and defence.\nThe president appreciated the efforts made by the outgoing ambassador for further promoting and solidifying bilateral relations, and mentioned that many infrastructure and development projects were completed during the tenure of Yao Jing.\nThe ambassador assured that China would continue its efforts to promote peace and connectivity in the region.\nHe specially thanked President Alvi for being the only head of state to visit China during the COVID-19 pandemic in March 2020.",
  "retrievedAt": "2025-08-11T19:49:47.916Z"
}
