{
  "title": "Cabinet decides to reassess buildings declared ‘protected heritage’ in Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh government on Thursday decided to reassess 3,371 “Protected Heritage” buildings in Sindh through committees of experts, following reports that some have deteriorated so severely that they pose safety risks and no longer retain their original heritage value.\n\nThe decision was made in the Sindh cabinet meeting which was chaired by Chief Minister Syed Murad Ali Shah which discussed host of issues ranging from launch of the CNIC-based vehicle registration to the transfer of MDCAT examination responsibility to IBA-Sukkur.\n\nAmong the key decisions included the formation of “a committee or multiple committees of experts” to reassess the 3,371 buildings currently declared as Protected Heritage across the province.\n\nThese heritage sites were originally identified and notified under the Sindh Cultural Heritage (Preservation) Act, 1994. Earlier, an Advisory Committee was constituted to guide preservation efforts. Subsequent surveys — including one by NED University in 2008-9 and a departmental re-survey in 2017-18 — concluded with 3,371 sites being declared Protected Heritage due to their architectural and historical significance.\n\nKey govt decisions include launch of CNIC-based vehicle registration; transfer of MDCAT responsibility to IBA-Sukkur\n\n“However, over the years, many of these buildings have faced structural decay due to environmental exposure, unauthorised alterations, and lack of maintenance-especially in the case of privately owned properties,” said a statement issued by the CM House after the meeting.\n\n“Some structures have deteriorated to the point of becoming dangerous and may no longer retain their original heritage value. Given this, the culture department proposed three options for reassessment committees, each comprising experts in architecture, conservation, urban planning, history, and structural engineering. The cabinet approved the constitution of committee (s) to assess the buildings and submit their report with recommendations to the government.”\n\nAlongside the approval of the reassessment initiative, the statement said that the cabinet also sanctioned Rs20 million for the execution of this important project, which aims to revisit, re-evaluate, and re-categorise the declared heritage sites across Sindh.\n\nThe cabinet also finalised a comprehensive MDCAT Admissions Policy for the MBBS and BDS programmes across public and private medical and dental colleges in the province, in compliance with the Pakistan Medical and Dental Council (PMDC) Act, 2022 and a Sindh High Court directive.\n\n“Sukkur IBA Testing Agency (SIBA) has been designated as the current testing agency due to its satisfactory performance in MDCAT-2024, but future selections will remain performance-based,” said the statement.\n\n“The health department retains the authority to conduct the admissions process directly or through any nominated medical university. A supervisory committee will be notified by the department to oversee the process when handled by a university.”\n\nThe MDCAT policy, it said, includes strict adherence to PMDC rules for merit determination, pass percentages, and eligibility. Sindh domicile is mandatory for applicants, with verification through Juvenile Cards and Biometric authentication.\n\nThe seat allocation and distribution for all medical colleges and universities will be published in the Annual Prospectus, which cannot be altered by the admitting universities, said the statement.\n\nThe provincial cabinet also approved “in-principal” the CNIC-based vehicle registration model and its legal amendments to bring Sindh’s system in line with global best practices and recent reforms in the Islamabad Capital Territory.\n\nBefore the approval, the statement said, the cabinet reviewed the proposal forwarded by the excise department to introduce a CNIC-based vehicle registration system, along with Personalised Registration Marks (PRMs).\n\n“The new system will link registration marks directly to a vehicle owner’s CNIC rather than the vehicle’s chassis, allowing owners to retain and reuse their personalised number plates even after selling their vehicle. The Vehicle Identification Number (VIN) will now be based on the chassis number, which remains the permanent identifier of the vehicle,” said the statement.\n\nThe PRMs, it said, can be retained, reused, or surrendered by owners. The system enables real-time traceability of vehicles and aligns with international standards. The CNIC-linked registration promotes easy tracking of taxpayers’ assets and improves administrative convenience, added the statement.\n\n“The CM directed the Excise & Taxation Department to develop the CNIC-based system and then begin its testing, followed by amending the necessary law. The CNIC-based vehicle registration would not be implemented immediately, but the CM would hold follow-up meetings to oversee its implementation once it has been properly tested,” said the statement.\n\nThe cabinet also approved amendment to the Sindh Boards of Intermediate and Secondary Education (Amendment) Act, 2025, enabling the appointment of BS-19 and BS-20 officers as Chairmen of the education boards across the province. The amendment comes in response to administrative challenges and the limited availability of BS-21 officers, who were previously eligible for these roles.\n\n“The new amendment to Section 15(1) now permits the appointment of BS-19/20 officers by transfer as chairmen,” said the statement.\n\n“The chairmen will continue to serve a three-year term, with eligibility for reappointment. The Controlling Authority retains the power to make appointments either by direct recruitment or transfer. The latest amendment aims to ensure smoother appointments and more effective governance of Sindh’s education boards.”\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:16:19.756Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929369/cabinet-decides-to-reassess-buildings-declared-protected-heritage-in-sindh",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T00:27:25.000Z"
}
