{
  "title": "NAB gets bids for three Bahria Town properties - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Accountability Bureau on Thursday sold off one already-sealed Bahria Town property, and received conditional bids for two others — at a combined value of Rs2.27 billion — in a long-awaited auction.\n\nThe auction of three remaining properties, owned by controversial real estate tycoon Malik Riaz, was shelved due to a “lack of qualifying bids”.\n\nAlthough mediapersons were invited to cover the auction, they were not allowed to witness proceedings, which were held behind closed doors at NAB’s regional headquarters for Rawalpindi/Islamabad.\n\nFollowing the auction, journalists seated in a separate committee room were handed a paper carrying brief details of its outcome.\n\nDozens of private vehicles were seen parked outside the NAB headquarters, ostensibly belonging to the bidders.\n\nAccording to NAB’s advertisement, six properties were scheduled to be auctioned. However, only three were sold: Rubaish Marquee fetched Rs508 million, while the bureau received conditional offers of Rs876m and Rs881.5m for two of the property developer’s corporate offices.\n\nNAB claimed that Rubaish Marquee was auctioned at Rs20m above its reserved price of Rs488m, while the other two properties were sold at the reserved prices set by the bureau.\n\nA source in NAB told Dawn that the conditional offers for the two corporate offices were submitted as the bidders wanted to change the purpose of these premises in order to carry out other businesses at these venues.\n\nThe remaining three properties — Arena Cinema (reserve price Rs1.1bn), Bahria Town International Academy (Rs1.07bn), and Safari Club (Rs1.2bn), all located in Bahria Town, Rawalpindi — will be auctioned later.\n\nNo date has been announced yet for the next auction.\n\nNAB documents stated that the properties were auctioned due to a default of a plea bargain amount in a reference filed against Zain Malik, Malik Riaz’s son-in-law and one of the owners of Bahria Town housing schemes.\n\nMalik Riaz is currently abroad and is reportedly avoiding arrest in other references filed against him, including the high-profile £190m Al-Qadir Trust case and the Bahria Town Karachi case.\n\nThe auction followed the Islamabad High Court’s dismissal on Tuesday of petitions filed against the sale of six Bahria Town properties in Rawalpindi and one in Islamabad, thus allowing NAB to proceed with the auction scheduled for August 7.\n\nFollowing the IHC go-ahead, Bahria Town approached the Supreme Court in a bid to restrain NAB from holding the auction.\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:15:33.969Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929441/nab-gets-bids-for-three-bahria-town-properties",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T02:13:33.000Z"
}
