{
  "title": "Govt suspends mobile data services in Balochistan until Aug 31 for ‘security reasons’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Balochistan government spokesman Shahid Rind on Friday said that mobile data services in the province have been suspended until August 31 over “security reasons”.\n\nIn recent months, the security situation in Balochistan has worsened, as militants, long involved in a low-level insurgency, have stepped up the frequency and intensity of their attacks. In February, nearly 62 per cent of the total terrorism-related deaths in the country occurred in Balochistan.\n\nThe move came after a notification issued by the Balochistan Home Department on Aug 6, seen by Dawn.com, ordered the immediate suspension of data services until Aug 31, citing the “peculiar law and order situation” in the province.\n\n“It is, therefore, requested to please direct the concerned authorities for suspension/closure of 3G and 4G services in the entire province … to avoid any untoward incident,” the notification read.\n\n“The service has been suspended because they (militants) use it for coordination and sharing information,” Rind said, according to Reuters.\n\nThe suspension follows the government announcement from last month banning Pakistani Zaireen (pilgrims) from travelling by road from Quetta to Iran and Iraq due to national security concerns.\n\nOn March 11, the Pesha­war-bound Jaffar Express train became the target of an unprecedented hijacking, when terrorists fired on the locomotive and took over 400 passengers hostage.\n\nMedia reports said that security forces had surrounded the area and launched a clearance operation to rescue all passengers. Radio Pakistan reported that security forces had rescued 80 hostages held by the terrorists.\n\nInter-Services Public Relations Director General Lt Gen Ahmed Sharif Chaudhry said on March 12 that the clearance operation, launched after the train’s unprecedented hijacking in Balochistan, ended with all 33 terrorists being killed.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/0708583649532a4.jpg?r=085909",
  "retrievedAt": "2025-08-16T07:14:22.029Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929528/govt-suspends-mobile-data-services-in-balochistan-until-aug-31-for-security-reasons",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T10:20:03.000Z"
}
