{
  "title": "Another organ trade network busted in a week in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: In the second such incident reported within a week, police on Thursday arrested a member of an alleged organ trafficking ring operating from a private house in a housing society in Rawalpindi.\n\nSix other suspects, including a surgeon, managed to escape during a pre-dawn raid, according to the police.\n\nEarlier this month, Airport police had also unearthed a similar illegal operation in which a man was found undergoing a kidney removal procedure.\n\nPolice said on Thursday that Sub-Inspector Wasim Sarwar registered an FIR with the Rawat police, stating he and his subordinates heard screaming of an individual from inside a house during an anti-crime patrol at 12 o’clock midnight in Rafi Block, Phase VIII of Bahria Town.\n\nHe said an ambulance and other suspicious vehicles were also seen moving outside the house. “When the police reached the house located on the main road at 12:10am, they heard screams from inside,” the SI said.\n\nHe stated in the FIR that the police knocked on the door and rang the doorbell, but no one responded from inside. Considering human lives were at stake, they entered the house along with a lady constable and heard noises coming from one of the rooms.\n\nAs the police entered the room, they found a man fastened to a stretcher with pieces of rope. He was on a drip and shouting loudly: “Save me, save me.” Another person standing guard in the room attempted to escape.\n\nThe SI added that the police apprehended the man, who after interrogation revealed his name as Zafarullah Khan Cheema, a resident of district Hafizabad. Upon seeing the police, six individuals inside the house jumped over the walls and escaped.\n\nAccording to the arrested suspect, the names of those who escaped were Imran, resident of Dhamial, Rawalpindi; Dr Manzoor (surgeon), resident of Hazro, Attock; Dr Aamir, of Mansehra; Gul Nawaz (assistant), Attock; Zeb (assistant), Attock, and Rafiq alias Fika.\n\nIt transpired later that the person on the stretcher was Hanan Zaid, resident of Sector I, Phase VIII, Bahria Town.\n\nHe informed the police that the suspects had called him for a job at the house. When he arrived, they gave him a glass of juice. After drinking the juice, he began feeling unwell and became semi-conscious. He said the suspects then took him to a hospital in the PWD area and conducted medical tests on him before he lost consciousness.\n\nWhen he regained consciousness, he found himself tied to a stretcher in the same house, and said he was experiencing seizures.\n\nWhen he asked why he had been tied up, they told him, “You’ve your medical done, and you have a damaged kidney that needs an operation. After that, you will get a job.”\n\nHe added that the suspects had forcibly kidnapped and detained him and intended to remove his kidney to sell it.\n\nZafarullah Cheema, now in police custody, told investigators that various people had been brought to the house, where their kidneys were removed and sold for transplants to both domestic and foreign clients.\n\nUpon searching the rooms inside the house, police seized medical equipment and medicines used in the operation theatre. A case has been registered under relevant sections of the law, and an investigation is underway.\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/301045355203216.jpg?r=104546",
  "retrievedAt": "2025-08-16T07:15:56.647Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929401/another-organ-trade-network-busted-in-a-week-in-rawalpindi",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T00:27:41.000Z"
}
