{
  "title": "Arshad Nadeem marks one year since historic Paris gold with London rehab - Sport - DAWN.COM",
  "author": null,
  "content": "A year ago to the day, Arshad Nadeem stunned the world with a monstrous javelin throw that propelled him to global stardom and salvaged Pakistan’s plummeting sports glory with its first individual gold medal at the Paris 2024 Olympics.\n\nThe javelin star sweetened the deal when his 92.97m throw shattered the Olympic record — not once, but twice, to the delight of a roaring crowd at Paris’ Stade de France.\n\nBut a year on from the historic triumph, Arshad is undergoing physiotherapy in London following surgery on his calf muscle.\n\nThe two upcoming Diamond League championships he was set to compete at this month have been scrapped from his sports calendar as he recovers in time for the World Athletics Championships in Tokyo in September.\n\nBut there is no disappointment from Arshad or his coach Salman Butt, who doubles as his mentor, manager, and much more.\n\n“Things are looking good for Tokyo,” he told Dawn.com in a call from London. “We’re hoping to accomplish a lot there.”\n\nA gold medal at the World Championships will complete his trifecta after his gold in the Paris Olympics and the 2022 Commonwealth Games. Arshad made this year’s international debut in style when he won gold with an 86.40m throw at the Asian Athletics Championship in Gumi, South Korea, in May.\n\nButt acknowledged that the scratched competitions are not ideal, and the aim was to compete at least four or five times ahead of the world championships.\n\n“The thing is, sports and injury go together. That’s just how it is.”\n\nHe emphasised the importance of rectifying the recurring injury as they flew to Cambridge and underwent surgery within six days.\n\nContrary to any doom and gloom, Arshad is now pain-free and going full steam ahead with his training in London as he wraps up his last few physiotherapy sessions.\n\nHe’ll return to Pakistan soon, where he’ll continue training for the next six weeks before heading to Tokyo in an attempt to make history once again.\n\nThe Pakistan High Commission in London honoured Arshad with a shield to commemorate one year since his Olympic triumph.\n\n“All officers and staff of [the high commission] were present to honour our national hero,” it said in a post on X.\n\nHigh Commissioner Dr Muhammad Faisal said: “Arshad Nadeem’s achievement has highlighted the importance of track & field athletics to the youth of Pakistan.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/08111728d4a75c6.png",
  "retrievedAt": "2025-08-16T07:14:29.948Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929503/arshad-nadeem-marks-one-year-since-historic-paris-gold-with-london-rehab",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T08:43:23.000Z"
}
