{
  "title": "99 die from malnutrition in Gaza this year, says WHO - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: The World Health Organisation said on Thursday that 99 people were now known to have died from malnutrition in the Gaza Strip so far this year, with the figure likely an underestimate.\n\nInternational outrage over the humanitarian situation in Gaza has ratcheted up pressure on Israel, with UN agencies warning of famine in the devastated Palestinian territory.\n\nWHO chief Tedros Adhanom Ghebreyesus called for scaled-up, sustained and unimpeded aid to be allowed to flow into Gaza, via all possible routes. Gazans “have limited access to basic services, have faced repeated displacement and are now suffering from a blockade of food supplies”, Tedros told the UN correspondents’ association ACANU.\n\n“Malnutrition is widespread and hunger-related deaths are rising,” he said. “In July, nearly 12,000 children under five years were identified as suffering from acute malnutrition — the highest monthly figure ever recorded.\n\nAgriculture accounted for around 10pc of Strip’s economy before conflict, but has now fallen to 1.5pc\n\n“So far this year, 99 people have died from malnutrition, including 29 children under five. These reported numbers are likely underestimates,” he said. The Israeli government is under mounting international and domestic pressure to end the war.\n\nTent city farming\n\nWith food scarce and aid hard and sometimes deadly to come by, Gaza farmer Ibrahim Abu Jabal is growing vegetables in the harsh conditions of a sprawling displacement camp to sustain his family.\n\nAbu Jabal, 39, has turned a small patch of soil near the family’s tent in Gaza City into a vegetable garden, where he tends to rows of tomatoes, cucumbers and peppers, surrounded by tens of thousands of other Palestinians displaced by the Israel-Hamas war. “Our bodies need tomatoes, cucumbers,” he said.\n\n“And these products are expensive here. Not just expensive — they’re not even available. There are no tomatoes, and even if there were, we wouldn’t have the money to buy them.” The displaced farmer has cultivated the sandy plot of 120 square meters (about 1,300 square feet), using seeds from dried vegetables and relying on an erratic water supply.\n\n“Due to the situation we’re going through… and the soaring prices of vegetables, I had to return to my old profession,” said Abu Jabal.\n\nHe said he had prepared the plot “so I can start planting again, just so my children and I can survive another day, or a little longer.”\n\nWater in Gaza, much like food, is in precariously low supply, and to keep his garden green, Abu Jalal usually has to carry large jugs he fills from a nearby pipe where water flows only one hour a day. Israel is under growing pressure to bring an end to the war in Gaza, where UN warnings that famine was unfolding have heightened global concern for the territory’s more than two million Palestinian inhabitants living through a humanitarian crisis.\n\nAid access ‘blocked’\n\nIsrael in late May began easing a complete aid blockade that had lasted more than two months, but only a trickle of food and other basic supplies has entered Gaza since then. Before the conflict, agriculture accounted for around 10 per cent of the Gaza Strip’s economy, with about a quarter of the population at least partially supported by agriculture and fishing.\n\nBut on Wednesday the UN’s Food and Agriculture Organization said that just 1.5pc of the territory’s farmland remained accessible and undamaged, citing the latest satellite data.\n\n“People are starving not because food is unavailable, but because access is blocked, local agrifood systems have collapsed, and families can no longer sustain even the most basic livelihoods,” the agency’s Director-General Qu Dongyu said.\n\nHungry Gazans have increasingly been forced to brave chaotic scenes at a handful of distribution points managed by the Israel- and US-backed Gaza Humanitarian Foundation.\n\nOn July 22, the UN rights office said Israeli forces had killed more than 1,000 Palestinians trying to get food aid in Gaza since the GHF started operations in May — nearly three-quarters of them in the vicinity of GHF sites.\n\nAbu Jabal said his nine-year-old daughter had been injured near a charity kitchen.\n\nReferring to the GHF operation, he said that “the American aid does not satisfy people’s hunger.” “For someone who has nine children like me, what can a single box of aid really do?”\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68957c825066e.jpg",
  "retrievedAt": "2025-08-16T07:14:52.503Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929483/99-die-from-malnutrition-in-gaza-this-year-says-who",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T04:25:54.000Z"
}
