{
  "title": "Pakistan set to become first South Asian country to ratify Unesco underwater heritage convention - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan is set to become the first South Asian nation to ratify the 2001 Unesco Convention on the Protection of Underwater Cultural Heritage (UCH), marking a significant step toward safeguarding its submerged maritime legacy, a statement from the Press Information Department (PID) said on Friday.\n\nIn recent years, underwater cultural heritage has attracted increasing attention from both the scientific community and the general public. For scientists, it represents an invaluable source of information on ancient civilisations, maritime practices, human use of land and marine environments, and climate change, according to Unesco.\n\nThe announcement was made by Federal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry during a meeting with Unesco representative Dr Cristina Menegazzi in Islamabad today. The two sides discussed collaborative efforts to document, preserve, and promote Pakistan’s rich underwater archaeological resources.\n\n“Pakistan is set to become the first South Asian nation to ratify the 2001 UNESCO Convention on the Protection of Underwater Cultural Heritage (UCH), marking a significant step toward safeguarding its submerged maritime legacy,” the statement said.\n\nMaritime archaeology, a specialised discipline that explores the relationship between humans and bodies of water through historical artefacts, is gaining prominence in coastal nations with rich nautical histories, as per the statement.\n\nIn Pakistan’s case, this includes shipwrecks, submerged landscapes, ancient maritime infrastructure such as piers and lighthouses, and historic trade routes along the Arabian Sea.\n\n“We are committed to preserving our maritime cultural heritage and will soon ratify the 2001 Convention,” Minister Chaudhry was quoted as saying in the statement.\n\n“This will position Pakistan as a regional leader in protecting underwater cultural heritage and strengthen our voice on international platforms concerning climate change and cultural preservation.”\n\nThe minister underscored the government’s focus on environmentally responsible exploration. “Any scientific activity in maritime archaeology must be conducted in a way that respects and protects marine ecosystems,” the minister was further quoted as saying.\n\n“The use of non-invasive technologies like remote sensing, diver-based observation, and photogrammetry will be prioritised, while excavations will only be carried out under strict scientific guidelines.”\n\nThe statement added: “In line with efforts to preserve both submerged and coastal heritage, Chaudhry also requested Unesco’s assistance in registering historic maritime buildings in Karachi.\n\n“These include over 70-year-old structures under the Maritime Affairs Ministry, such as the Marine Fisheries Department and the iconic Marine Lighthouse. The minister proposed establishing a maritime historical museum to house and exhibit this coastal legacy.\n\n“Unesco possesses valuable digital archives and marine archaeological data from across the globe,” according to Chaudhry. “We wish to collaborate in scientific research and mapping of Pakistan’s underwater cultural heritage, which has been largely unexplored.”\n\nThe minister emphasised that Pakistan’s engagement in this field will not only highlight its cultural wealth but also align with global efforts to combat climate change. Submerged archaeological sites, he noted, serve as key indicators of past sea levels and climate patterns, offering insights into the environmental shifts that affect coastal communities today.\n\n“Dr Menegazzi welcomed Pakistan’s intention to join the global community in protecting underwater heritage and expressed Unesco’s willingness to support technical and scientific cooperation in the area,” the statement read.\n\nLast year, experts at Unesco-sponsored workshop at Mohenjo Daro said that while disasters cannot be stopped, preventive measures could be adopted to reduce the risk of destruction to heritage sites, monuments and museums, and minimise harm.\n\nA Unesco delegation has also previously called on the Sindh government to discuss the restoration project of the world heritage Makli’s tombs of Shaikh Jiyo and others, which have been severely affected by rains, floods and other natural disasters.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/08155110e5de01c.jpg",
  "retrievedAt": "2025-08-16T07:14:22.796Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929509/pakistan-set-to-become-first-south-asian-country-to-ratify-unesco-underwater-heritage-convention",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T09:57:08.000Z"
}
