{
  "title": "PTI’s leaders of opposition in NA, Senate removed from posts - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI’s Opposition Leader in the National Assembly Omar Ayub Khan and Opposition Leader in the Senate Shibli Faraz, were removed from their seats, according to notifications by the respective houses’ secretariats that came to light on Friday.\n\nOn Tuesday, the Election Commission of Pakistan (ECP) had disqualified the Senate and National Assembly opposition leaders, Sunni Ittehad Council chief Hamid Raza and other PTI lawmakers following their convictions in cases related to the May 9 riots.\n\nAccording to the notification by the National Assembly Secretariat dated August 7, “ Consequent upon disqualification and de-notification of Leader of the Opposition Omar Ayub Khan from being a member of the National Assembly (NA-18 Haripur) under Article 63 of the Constitution of the Islamic Republic of Pakistan … the office of the Leader of the Opposition in the National Assembly has become vacant with effect from August 5th, 2025.“\n\nA similar notification for Faraz was issued by the Senate Secretariat: “Consequent upon disqualification and de-notification of Leader of the Opposition in the Senate Senator Syed Shibli Faraz, from being a member of the Senate under Article 63 of the Constitution of the Islamic Republic of Pakistan … the office of the Leader of the Opposition in the Senate has become vacant with effect from 5th August”.\n\nThe Peshawar High Court (PHC) on Wednesday halted ECP from taking any action against PTI leaders Faraz and Ayub.\n\nA notification from the ECP had said Faraz, Ayub, Kharal, Raza, MNA Rai Hassan Nawaz Khan, Gul, MPA Muhammad Ansar Iqbal, MPA Junaid Afzal Sahi and MPA Rai Muhammad Murtaza Iqbal were now disqualified under Article 63(1h) (a person shall be disqualified from being elected [if] … he has been, on conviction for any offence involving moral turpitude, sentenced to imprisonment for a term of not less than two years) of the Constitution and their seats were vacant.\n\nOn May 9, 2023, PTI supporters, protesting the party founder Imran Khan’s arrest, staged violent protests throughout the country, vandalising military installations and state-owned buildings, while also attacking the Lahore corps commander’s residence. Following the riots, thousands of protesters, including party leaders, were arrested.\n\nLast month, an anti-terrorism court (ATC) in Faisalabad senten­ced over 100 leaders and workers of the PTI, including several key opposition figures, to jail terms of up to 10 years in connection with the May 9 riots.\n\nNA Opposition Leader Khan, Senate Opposition Leader Faraz, MNA Zartaj Gul, Raza, Sheikh Rashid Shafique (nephew of former interior minister Sheikh Rashid), Kanwal Shauzab, Farah Agha, Rai Haider Kharal and Muhammad Ahmad Chattha were among those sentenced to 10 years of rigorous imprisonment.\n\nAyub had lambasted the ATC’s “bogus verdict” in a post on X, saying that he would contest it and the ECP’s disqualification in court.\n\nHe also posted a video of himself at the Peshawar High Court with other PTI leaders and lawyers, saying the court had given him a few days and bail would be granted to him on filing his appeal.\n\nThe ECP disqualification followed other recent disqualifications of PTI leaders and lawmakers.\n\nOn July 29, the ECP had disqualified MNA Abdul Latif from the NA-1 constituency (Upper and Lower Chitral), raising questions over the haste with which a flurry of similar decisions were taken in recent days.\n\nOn July 28, the commission had disqualified Senator Ejaz Chaudhry, MNA Mohammad Ahmed Chatta and MPA Ahmad Khan.\n\nOn December 21 and 26 last year, a military court had sentenced over 50 PTI leaders and activists, including Imran Khan’s nephew Hassaan Niazi, to up to 10 years for their involvement in the May 9 riots.\n\nThe ATCs have been hearing May 9-related cases daily to meet a deadline set by the Supreme Court for the conclusion of trials by August.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/3114475449f73b5.jpg?r=145013",
  "retrievedAt": "2025-08-16T07:14:08.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929551/ptis-leaders-of-opposition-in-na-senate-removed-from-posts",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T15:13:10.000Z"
}
