{
  "title": "More than half of all poll petitions still pending: Fafen - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: More than half of election petitions still await decisions by tribunals despite the passage of more than one and a half years, according to Free and Fair Election Network (Fafen).\n\nThrough its systematic tracking, Fafen has identified 374 election petitions — 124 challenging the electoral outcomes in the National Assembly (NA) constituencies and 250 in the provincial assemblies’ (PA) constituencies.\n\nSo far, approximately two-thirds (62 per cent) of the petitions related to NA constituencies, and half (50 per cent) of those pertaining to PA constituencies, remain undecided.\n\nAccording to Fafen update, between April 21 and July 31, 2025, election tribunals decided 35 election petitions related to the General Elections 2024 (GE-2024). With these decisions, the total number of resolved petitions reached 171, accounting for 46pc of the overall caseload pending before 23 tribunals across the four provinces.\n\nElection tribunals only decided 35 petitions between April and July, report says\n\nDuring the reporting period, 28 of the 35 decided petitions were from Punjab, three each from Sindh and Khyber Pakhtunkhwa, and one from Balochistan. In Punjab, the four Lahore-based tribunals decided 15 petitions, the Bahawalpur tribunal decided nine, while the Rawalpindi and Multan tribunals decided two cases each.\n\nIn Sindh, the two Karachi tribunals decided three petitions. In Khyber Pakhtunkhwa, the Bannu tribunal decided three cases. In Balochistan, a Quetta tribunal decided one petition.\n\nWhile Punjab tribunals have gained pace in deciding peitions, adjudication process in the remaining three provinces has slowed noticeably since April this year. As many as 12 out of the 23 election tribunals have not decided any petition since April 21, 2025.\n\nOverall, Balochistan’s three tribunals collectively decided 44 out of 52 petitions (85pc) filed for NA and PA constituencies. Punjab’s eight tribunals resolved 94 out of 192 petitions (49pc). Khyber Pakhtunkhwa’s six tribunals decided 12 out of 43 petitions (28pc), while Sindh’s five tribunals disposed of 21 of 84 petitions (25pc).\n\nOut of 124 petitions challenging NA constituency results, 47 (38pc) were decided so far. These include 30 from Punjab, nine from Balochistan, five from Sindh, and three from Khyber Pakhtunkhwa. Regarding PA constituencies, 124 out of 250 petitions (50pc) were decided, including 64 from Punjab, 35 from Balochistan, 16 from Sindh, and nine from Khyber Pakhtunkhwa.\n\nOut of the 171 petitions decided so far, 168 were dismissed, while only three were accepted. Among the 168 dismissals, 81 petitions (48pc) — including 24 related to NA constituencies and 57 to PA constituencies — were dismissed on grounds of non-maintainability. Another 22 petitions (13pc) — three from NA and 19 from PA constituencies — were dismissed after petitioners failed to prove their case during trial proceedings.\n\nIndependent candidates, supported by PTI, make the largest group of petitioners with 55pc of the total petitions filed by them, followed by PML-N candidates (13pc), PPPP candidates (8pc), unaffiliated independent candidates (7pc) and JUI-F candidates (7pc). As many as 16 other parties’ candidates cumulatively account for the remaining 12pc of the total petitions.\n\nAround 65pc petitions of independent candidates, 54pc of PPPP, 54pc of PML-N, 40pc of JUI-F, and 38pc of PTI-backed independent candidates were disposed of till date.\n\nThe returned candidates belonging to PML-N make the largest group of defendants with 39pc of the petitions challenging their victory, followed by PTI-backed candidates (16pc), MQM-P candidates and PPPP candidates (13pc each), unaffiliated independents (6pc) and JUI-P (5pc). As many as 11 other defendant parties’ candidates cumulatively account for the remaining 8pc petitions.\n\nSo far, 84 verdicts of election tribunals have been challenged before the Supreme Court. Among these, three appeals were initiated by returned candidates against whom election petitions have been accepted.\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/2409532471be091.jpg?r=100100",
  "retrievedAt": "2025-08-16T07:15:12.388Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929454/more-than-half-of-all-poll-petitions-still-pending-fafen",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T02:43:05.000Z"
}
