{
  "title": "Putin calls Xi, Modi and other foreign leaders ahead of planned meeting with Trump - World - DAWN.COM",
  "author": null,
  "content": "Russian President Vladimir Putin spoke to the leaders of China, India and three ex-Soviet states on Friday in a flurry of calls to brief them on his contacts with the United States about the war in Ukraine.\n\nPutin met US President Donald Trump’s envoy Steve Witkoff in Moscow on Wednesday, after which the Kremlin said a summit between Putin and Trump could take place as early as next week. No venue, date or agenda have been announced.\n\nTrump, pressing for an end to the 3.5-year war, had set a deadline that expires on Friday for Russia to agree to peace or face new sanctions on Moscow and countries that buy Russian exports. China and India are the biggest buyers of Russian oil.\n\nChina’s President Xi Jinping told Putin in a phone call that China is pleased to see Russia and the US maintaining contact and improving ties to advance a political resolution of the Ukraine crisis, Chinese state broadcaster CCTV said.\n\nChina is a major backer of Russia in its confrontation with the West, as well as Russia’s biggest trading partner. Putin is due to visit China in September for events marking the 80th anniversary of the end of World War Two.\n\nThe Kremlin said that Putin also discussed his talks with Witkoff with Indian Prime Minister Narendra Modi. Trump this week announced an additional 25 per cent tariff on Indian goods to penalise New Delhi for its purchases of Russian oil.\n\n“Had a very good and detailed conversation with my friend President Putin. I thanked him for sharing the latest developments on Ukraine,” Modi said in a post on X.\n\nOn Thursday, Putin spoke with South African President Cyril Ramaphosa, who expressed South Africa’s “full support to peace initiatives that will end the war and contribute to a lasting peace between Russia and Ukraine”.\n\nSheikh Mohammed bin Zayed Al Nahyan, president of the United Arab Emirates, met Putin in Moscow on Thursday and Putin said the UAE was a possible venue for the Russia-US summit.\n\nRussia, China, India, South Africa and the UAE are all members of the BRICS group of countries which Moscow sees as a counterweight to US political and economic dominance.\n\nPutin on Friday also discussed the outcome of Witkoff’s visit in calls with his ally Alexander Lukashenko, president of Belarus, and with the leaders of Kazakhstan and Uzbekistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/07151135bb9fcb0.png?r=151530",
  "retrievedAt": "2025-08-16T07:14:03.174Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929563/putin-calls-xi-modi-and-other-foreign-leaders-ahead-of-planned-meeting-with-trump",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T18:32:15.000Z"
}
