{
  "title": "JUI-F jirga holds Sindh govt responsible for lawlessness - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: “Grand Sindh Aman Jirga” organised by Jamiat Ulema-i-Islam-Fazl Sindh chapter on Thursday held Sindh government and police responsible for unabated rise in lawlessness across the province and observed that law enforcers were more preoccupied with providing protocol than establishing peace.\n\nThe jirga, second by the JUI-F, presided over by the party’s provincial emir Maulana Abdul Qayyum Halejvi was attended by tribal elders and dignitaries who presented suggestions for the restoration of peace and end of raging tribal feuds in Sindh.\n\nJUI-F Sindh’s secretary general, Rashid Mehmood Soomro, said while briefing media persons about the jirga’s proceedings at a local hotel that according to the decisions taken by the jirga, a 35-member peace committee of tribal elders and dignitaries would lead ‘reconciliating’ missions to different parties involved in tribal feuds.\n\nHe said that the missions would go to all those who had taken up arms and ask them to lay down weapons and cooperate with the government for the establishment of peace and order, because Sindh was being doomed by lawlessness.\n\nHe said that Kashmore, Shikarpur, Jacobabad and Ghotki, among several other areas, had turned into no-go areas where thousands of people had been killed by criminals so far and even at this moment over 400 people were in dacoits’ captivity.\n\nHe said that street crime was at its peak in Karachi, Hyderabad and Mirpurkhas but representatives of the Sindh government were singing ‘peace’. Despite launching an operation and allocating a budget of Rs2 billion for law and order, there was no sign of peace in the province, he said.\n\nHe said that this jirga was to cooperate with police, army and Rangers. “We have united for ending tribal feuds. We want the children in the riverine areas to get education,” he said.\n\nHe said that dacoits were now kidnapping innocent children. If tribal leaders played their role, tribal feuds could come to an end, he said, adding since criminals enjoyed political support targeted operations were necessary.\n\nHe condemned armed attack on Dr Kirpal Das in Sukkur and demanded that innocent Priya Kumari be recovered immediately and that those picked up by Shikarpur police be produced in court.\n\nMaulana Soomro said: “We consider the Sardars who did not attend the jirga to be responsible for the law and order situation.” Invitations were sent to about 150 tribal chiefs to attend the peace jirga, but only 34 chieftains, tribal elders and other respected individuals turned up, he said.\n\n“The Sardars associated with the government did not attend the jirga, which shows they are not serious about restoring peace and order in the province,” he added. He announced that the jirga’s decisions would be sent to the president, prime minister, chief minister of Sindh, DG Rangers, and other authorities concerned in the form of a letter.\n\nHe said that on Sept 11, the JUI-F would launch ‘Sindh Peace Caravan’ from Kashmore, which would pass through Shikarpur, Sukkur, Naushahro Feroze, Thatta, Hyderabad and other areas, and culminate in a sit-in in front of the Chief Minister House in Karachi.\n\nOn Aug 25, important decisions about law and order in Sindh would be taken at JUI-F’s general council meeting in Karachi in the presence of the party chief Maulana Fazlur Rehman, he said.\n\nSardar Mohammad Ibrahim Jatoi, Moazzam Ali Abbasi, Dr Pappu Khan Chachar, Tegho Khan Teghani, Sardar Abdul Nabi Khan Thahim, Mir Mehboob Ali Khan Soomro, Mir Iftikhar Khan Loond, Anwar Ali Khan Soomro, Advocate Mohammad Ali Khan, Ravi Kumar Khatri, Mir Shahzain Khan Bijarani, Sardar Sajjad Ali Khan Ghanio, Advocate Nooruddin Chohan, Sardar Hussain Bux Dharejo, Iqbal Ahmed Bijarani, Sardar Ali Gohar Khan Indhar, as JUI-F Sindh’s naib emir Syed Siraj Ahmed Shah Amroti and other party leaders attended.\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/081013481f9974b.jpg",
  "retrievedAt": "2025-08-16T07:16:10.110Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929356/jui-f-jirga-holds-sindh-govt-responsible-for-lawlessness",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T00:27:26.000Z"
}
