{
  "title": "Policeman escorting Chinese team dies in Haripur road accident - Pakistan - DAWN.COM",
  "author": null,
  "content": "HARIPUR: A policeman deployed on the security of a Chinese delegation died while six others, including a deputy superintendent of police, were injured here on Thursday when a mobile van overturned near Chechiyan interchange of Hazara Motorway, some four kilometres from Haripur city.\n\nThe incident, according to police, occurred when the front tyre of the escort van burst and the driver lost control of the vehicle, causing the vehicle to overturn.\n\nThe police said the mobile van was carrying seven policemen, including DSP of the SSU deployed to escort the Chinese delegation that was on its way to Islamabad from China Camp Balakot in Mansehra.\n\nWhen the police van reached near the Chechiyan Interchange of Hazara Motorway in the limits of Haripur district, the front tyre of the vehicle suddenly burst, causing the van to overturn. As a result all the policemen were injured.\n\nThe rescue workers shifted the injured officials to Haripur Trauma Centre, where the doctors pronounced one of the seven injured as martyred, while six others were admitted for multiple injuries.\n\nThe martyred SSU’s jawan was identified as Muhammad Tahir Javed, a resident of Bannu district, while the injured were: DSP Amir Muhammad, head constable Rehman Gula and foot constables Muhammad Arif, Muhammad Asif, Safeer Ahmed and Saqib.\n\nThe police and the security forces reached the site of the accident and started a formal investigation into the cause of the crash. Police, however, said that the members of the Chinese delegation travelling in a separate vehicle remained unharmed and reached their destination safely in Islamabad.\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/101234168efea4b.png?r=154244",
  "retrievedAt": "2025-08-16T07:15:49.255Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929416/policeman-escorting-chinese-team-dies-in-haripur-road-accident",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T00:27:48.000Z"
}
