{
  "title": "Tirah tribes distance themselves from TTP-Bar Qamberkhel agreement - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: Various stakeholders have shown reservations over the agreement inked between banned Tehreek-i-Taliban Pakistan (TTP) and Bar Qambarkhel tribe of Tirah on August 5 agreement.\n\nThey said that there was no mention of withdrawal of TTP and other militant groups from the valley in the agreement. Some of them said that the agreement would provide an opportunity to armed groups to strengthen themselves in the region.\n\nLocal observers said that the entire agreement was a ‘farce’ aimed at grossly befooling Bar Qambarkhel tribe in the name of a so-called peace accord as TTP men refused to leave the area and also renewed their pledge to continue their armed struggle against security forces.\n\nThey said that it was not mentioned in the five-point agreement that militants would refrain from fighting against security forces as they only accepted the demand of Bar Qambarkhel about not launching an attack on forces from private houses.\n\nFear the accord will pave way for more bloodshed in the region\n\n“At the same time, TTP has warned of retaliation if security forces try to capture them or kill them inside a house. It makes this agreement more ambiguous as TTP has clearly indicated through this clause of the agreement that they will stay side by side with locals,” a Bara-based political activist told Dawn.\n\nRequesting anonymity, he said that government might use the agreement as a raison d’etre for launching the much-anticipated military operation in Tirah as TTP refused to adhere to Bar Qambarkhel’s demand of complete pullout from its soil.\n\nHe said that the agreement also created schism among various tribes of Tirah as neither of those tribes (Malakdinkhel, Akkakhel, Sipah, Kamarkhel, Adamkhel, Zakhakhel and Shalobar) was taken onboard by Bar Qambarkhel elders while striking the ‘deal’.\n\nA jirga of Malakdinkhel, held in Bagh-Maidan Markaz soon after the August 5 agreement, explicitly distanced itself from it.\n\nThe participants of the jirga unanimously said that no agreement, whether with militants or government officials, would be accepted to them, if they were not made part of it.\n\nAhmad Ali, a social activist, said that although Bar Qambarkhels were rejoicing signing of the so-called peace agreement, they themselves would suffer in the long run as none of the militant group was willing to lay down arms and instead TTP invited Bar Qambarkhel tribesmen to assist them in their ‘jihad’ against security forces.\n\nHe said that the agreement would help TTP to freely mingle with local tribesmen while cultivating ‘friendly’ relationship with them and thus luring the younger and mostly unemployed lot into their ranks.\n\n“TTP and other armed groups are not here (Tirah) for their summer vacations or on a joy trip of the region but they are\n\nhere for a specific purpose of waging an armed struggle against security\n\nforces which ultimately will result in more fighting and increased lawlessness,“ he said.\n\nShabir Jan Afridi, another young political activist, said that the agreement could not last long as it failed to either ensure a militant pullout or a ceasefire between militants and security forces.\n\nHe said that the agreement was Bar Qambarkhel specific while the rest of the major tribes were still apprehensive about their insecurity as militants affiliated with TTP, Lashkar-i-Islam and Hafiz Gul Bahadar group were still having strong presence in areas other than Bar Qambarkhel.\n\nHe also questioned as to who would take responsibility for stopping security forces from indiscriminate use of mortar firing in most parts of Tirah valley which had caused deaths of several innocent people since the emergence of militants in the region.\n\n“I don’t think that this agreement will ensure peace in restive Tirah valley but will instead pave the way for more bloodshed and a possible military operation, which the government is contemplating for a long time,” he said.\n\nA trader in Tirah was particularly worried about cases of extortion. He said that in most cases the ‘target persons’ were forewarned of dire consequences by militant groups if they dared to speak against such incidents.\n\nRequesting anonymity, he said that militant groups had already collected Ushr and Zakat from most of the well-to-do residents of Tirah and now their announcement of taking action against those, who had collected that money, would not help as nobody would dare to testify against them.\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:15:57.523Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929417/tirah-tribes-distance-themselves-from-ttp-bar-qamberkhel-agreement",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T00:27:48.000Z"
}
