{
  "title": "Hesitant Pakistan face ODI challenge in West Indies - Sport - DAWN.COM",
  "author": null,
  "content": "TAROUBA: Pakistan will enter the territory they reportedly tried their best to avoid recently when they take on the West Indies in the opening fixture of the three-match One-day International series in Tarouba, Trinidad and Tobago on Friday.\n\nThe format hasn’t been Pakistan’s cup of tea lately. They had a disastrous run in the 2023 World Cup before they bounced back to beat Zimbabwe, Australia and South Africa on the road under Mohammad Rizwan’s captaincy. But failing to register a victory in the ICC Champions Trophy earlier this year before getting whitewashed by New Zealand away from home restored Pakistan’s status as an ordinary ODI side.\n\nWith the next 50-over World Cup still two years away, the Pakistan Cricket Board (PCB) apparently shelved rising concerns over the national side’s state in the format, reportedly having requested their West Indies counterparts to replace the three matches with as many T20Is. The request was turned down by the West Indies Cricket Board owing to their own worries over their qualification for the 2027 showpiece.\n\nThe shortest format quite evidently remains Pakistan’s priority with all their focus on next year’s T20 World Cup in India and Sri Lanka, where they will play their matches.\n\nUnder recently appointed white-ball head coach Mike Hesson, Pakistan conducted skills development camps keeping in view the requirements of the T20 game, which makes it hard to guess the approach they may take in the West Indies ODIs.\n\nRizwan, however, has returned as the captain after being quietly removed from the T20 post but from the format’s side as well. He will make a comeback to the Pakistan side along with his former T20 opening partner Babar Azam. Both last featured in Pakistan colours against New Zealand in April.\n\nThe national side will go into the series with what look like a balanced squad on paper with Abdullah Shafique returning after his Champions Trophy snub and flamboyant youngsters Mohammad Haris and Hasan Nawaz — the only uncapped player in the side — given the chance to prove their mettle in the longer format.\n\nHesson’s liking for all-round options looks evident with the presence of his trusted aide and vice-captain Salman Ali Agha along with in-form Faheem Ashraf and Mohammad Nawaz.\n\nThe pace battery boasts the experience of Hasan Ali, Shaheen Shah Afridi and Naseem Shah, as the latter two look to win back the fans after enduring difficult times in the Pakistan jersey over the last couple of years.\n\nSufiyan Moqeem, meanwhile, has emerged as the spin-bowling partner to Abrar Ahmed after delivering some brilliant spells during the 2-1 T20I series win over the West Indies last week with his chinaman bowling.\n\nPakistan, however, received a setback in the form of Fakhar Zaman’s injury just ahead of the series, but they have not named a replacement for the veteran opener.\n\nThe first one-day will be a day-night affair while the second and third matches will be day fixtures and Rizwan said his men — who were involved in two practice sessions since their arrival in Tarouba — have prepared accordingly.\n\n“We’ve worked hard during practice here,” he said in a video released by the PCB on the eve of the match. “The schedule is a bit different, with both day and day night matches, we’ve practiced accordingly.\n\nRizwan believed the momentum from the T20I series win against the hosts in Florida will drive the side to go for more.\n\n“The boys are carrying great momentum from the T20 series, we’ll try to take it forward in the ODIs,” said the skipper. “We have some good youngsters in Sufyan and Abrar, who’ll come in handy here. Rhythm will be key for the pacers. Nawaz has been doing well over the past one year and it’s good to have him in the side too.”\n\nWest Indies coach Darren Sammy believes the series presents an opportunity to strengthen their case for a spot at the 2027 World Cup.\n\n“Pakistan presents a different test and challenge as we continue our push for automatic qualification for the 2027 World Cup,” Sammy said. “While qualifying is our immediate goal, maintaining a winning mentality and team cohesion is essential for long-term success.\n\n“The upcoming matches agai­nst teams like Pakistan, who are ranked higher, provide crucial opportunities to earn valuable ranking points to improve our standing ahead of the World Cup.”\n\nWest Indies are currently ranked 10th in the ODI team rankings, while Pakistan sit on the fourth spot, below India, New Zealand and Australia.\n\nSquads:\n\nWEST INDIES: Shai Hope (captain), Jewel Andrew, Jediah Blades, Keacy Carty, Roston Chase, Matthew Forde, Justin Greaves, Amir Jangoo, Shamar Joseph, Brandon King, Evin Lewis, Gudakesh Motie, Sherfane Rutherford, Jayden Seales, Romario Shepherd\n\nPAKISTAN: Mohammad Rizwan (captain/wicket-keeper), Abdullah Shafique, Saim Ayub, Babar Azam, Mohammad Haris, Hasan Nawaz, Salman Ali Agha, Mohammad Nawaz, Hussain Talat, Faheem Ashraf, Sufiyan Moqim, Shaheen Shah Afridi, Naseem Shah, Hasan Ali.\n\nPublished in Dawn, August 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/06111401050adc7.png?r=111559",
  "retrievedAt": "2025-08-16T07:16:18.075Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1929418/hesitant-pakistan-face-odi-challenge-in-west-indies",
  "dateList": "2025-08-08",
  "date_published": "2025-08-08T00:27:20.000Z"
}
