{
  "title": "Swedish embassy, UN Women Pakistan kick off global drive against gender-based violence",
  "link": "https://www.app.com.pk/national/swedish-embassy-un-women-pakistan-kick-off-global-drive-against-gender-based-violence/",
  "date_published": "2021-11-26T17:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): As the ’16 Days of Activism against Gender-Based Violence’ campaign has kicked off across the globe, the Swedish embassy and UN Women Pakistan Friday organized an event titled ‘2020 in retrospective – Celebrating Pledges Made to End Violence Against Women’.\nThe Swedish Embassy and UN Women Pakistan have joined hands to eradicate violence against women in order to avoid gender-based violence and create awareness among the women about their fundamental rights to live freely in the society.\nThe event aimed at eulogizing the services rendered by human rights activists and feminists’ champions who have played their active part in accelerating efforts to end violence against women in the past year.\nWelcoming the guests at the auspicious ceremony, Swedish Ambassador Henrik Persson appreciated the concerted efforts of stakeholders to stand against gender-based violence.\nHe added,“No country is unaffected. Gender-based violence is found everywhere. Clear policies, legislation and changes of attitude are necessary. The self-evident right of women, girls to decide over their own bodies is being challenged. It must be defended.”\nIn 2020, under the global theme of “Orange the World: Fund, Respond, Prevent, Collect!”, he said the UN Women Pakistan encouraged participants to make commitments for ending violence against women, and a number of pledges were received by our partners to bridge funding gaps, show political will for calling for an end to violence, and ensure essential services for survivors of violence.\nUN Women Country Representative for Pakistan Sharmeela Rasool while addressing the event said let’s pledge and joins hands to stop this violence against women and making this society violence free and better place to live.\nShe said there is a dire need to make pledge here for concrete steps and actions against gender-based violence and discuss the issues and find out the ways to stop and eradicate this evil from Pakistan.\nShe said, “Although there is no vaccine to eradicate Violence Against Women–we must come together & strive hard to find redress for survivors. But more importantly, to find ways to prevent it.”\nShe also applauded the meaningful steps taken by the awardees in solidarity for ending violence against women and girls.\nShe said, “We haven’t responded to the shadow pandemic of violence against women in a way we have responded to the current pandemic of Covid-19. Without us acting together, we will not be able to end this grave violation of human’s rights. I appeal to all women and girls, men and boys to be the voice of the voiceless, break the cycle of violence and don’t just be a passive bystander.”\nMinistry of Human Rights Secretary Inamullah Khan, addressing the event as the chief guest said, “Domestic violence acts have been promulgated by all four provincial governments.\nThe Ministry of Human Rights has also introduced domestic (prevention and protection) Bill, 2021 which has been under consideration by the Parliament. Sensitization and awareness raising of public is one of the regular features to end violence against women.”\nTo symbolize hope and a brighter future for women, UN Women Global Ambassador, Muniba Mazari recited a poem ‘Still I rise’ by Maya Angelou.\nThe event ended with a celebratory performance by Natasha Humera Ejaz, a singer and songwriter from Islamabad and members of UN Women Pakistan team.\nLater, awards were distributed among top human rights activists to appreciate the commitments and actions taken on pledges made. Nine awards were presented to awardees from the federal capital, Balochistan, Khyber Pakhtunkhwa, and Sindh.\nThese include: Amna Baig, Assistant Superintendent of Islamabad Police; Asad Qaiser, Speaker of the National Assembly; Hayat Ali Shah, Director General of Federal Judicial Academy; Munazza Hassan, Secretary Women Parliamentary Caucus; Rukhshanda Naz, Ombudsperson for Protection Against Harassment at the Workplace Khyber Pakhtunkhwa; Nuzhat Shirin, Chairperson of Sindh Commission on the Status of Women; Sabira Islam, Ombudsperson for Protection Against Harassment at the Workplace Balochistan; Umair Khan, Communications Specialist at TransPeshawar; Zafar Buledi, Secretary, Women Development Department, Balochistan.\nThe event was attended by the senior government officials, diplomats and other development partners as well.",
  "retrievedAt": "2025-08-11T21:39:48.098Z"
}
