{
  "title": "Uplift of 14 Sindh districts a priority under Rs 444 bln development package: PM",
  "link": "https://www.app.com.pk/national/uplift-of-14-sindh-districts-a-priority-under-rs-444-bln-development-package-pm/",
  "date_published": "2021-11-26T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Prime Minister Imran Khan on Friday said under the Sindh Development Plan of the federal government, the uplift of 14 districts was a priority.\nChairing a high-level meeting to review implementation of Rs. 444 billion Sindh Development Plan, the prime minister said the objective was to improve the socio-economic status of the residents of Sindh.\nThe prime minister directed that priority must be given to less-developed and rural areas of Sindh to ensure prosperity.\nHe regretted that the previous governments ignored the development of Sindh.\nThe prime minister directed the concerned departments to fast-track work on Hyderabad-Sukkur Motorway and construction of sports complexes in Badin, Ghotki, Thar, Mirpur Khas, Tando Muhammad Khan, Hyderabad and Sanghar.\nHe also stressed transparency, quality of work and adherence to timelines while implementing Sindh Development Plan.\nThe Sindh Development plan includes projects related to roads and motorways, housing, Information Technology and Telecom, water resources, health, higher education, vocational training, disaster management, railways, energy and establishment of sports facilities.\nThe meeting was informed that overall the Sindh Development Plan comprises 48 Public Sector Development Programme (PSDP) projects, 50 non PSDP projects and seven public-private partnership projects.\nThe government has approved 26 new PSDP projects and allocated financial resources for fiscal year 2021-22.\nAn amount of Rs. 16.304 billion has been authorized by Planning Commission for eight federal government divisions and organizations.\nThe meeting was attended by federal ministers Dr. Fehmida Mirza, Asad Umar, Muhammad Hammad Azhar and senior officials.",
  "retrievedAt": "2025-08-11T21:39:50.453Z"
}
