{
  "title": "Dr Sania Nishtar delivers talk on poverty alleviation, empowerment at NUST",
  "link": "https://www.app.com.pk/national/dr-sania-nishtar-delivers-talk-on-poverty-alleviation-empowerment-at-nust/",
  "date_published": "2021-11-26T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr Sania Nishtar Friday delivered a talk on “Poverty Alleviation and Empowerment through Ehsaas Programmes” at the main campus of National University of Science and Technology (NUST). The event was hosted by NUST Institute of Policy Studies (NIPS).\nDr Sania Nishtar, who is also a distinguished member of NIPS Advisory Council, expounded the theory of change behind the Ehsaas programmes that incorporate an all-encompassing approach towards capacity building of millions of underprivileged households.\nShe said that there were different brands of the initiative under three broad categories: nationwide programmes, district-specific programmes, and new programmes, such as Ehsaas Tahafuz, which provides protection against catastrophic expenditures.\nSeveral other care programmes include Ehsaas langars, orphanages, shelter and old-age homes, being run either completely by the Government or under private-public partnerships.\nShe highlighted that a one-window centre for approaching them was already functioning in Sitara Market, Islamabad.\nShe asserted that the timely intervention through Ehsaas had had encouraging outcomes in the wake of Covid-19, highlighting that one of the steps taken under the auspices of Ehsaas during the pandemic was grant of stipends to most deserving marginalised women in the country.\nDr Nishtar elaborated that the Ehsaas programme was fully aligned with Prime Minister’s Naya Pakistan vision, adding around 50,000 scholarships were currently being provided to students across the country.\nShe apprised the audience that a new public donation mechanism was under formulation and soon people would be able to donate to the programme.\nShe added that the mechanism would enable donors to keep a track on where and how their donations were utilised.\nDr Nishtar also had an interactive session with Ehsaas scholarship awardees studying at NUST. The event was attended by NUST staff, faculty and students.\nEarlier in his welcome remarks, Engr Javed Mahmmod Bukhari, Rector NUST and Patron NIPS, stated that Ehsaas was by far, one of the most comprehensive poverty alleviation and social safety programmes, comprising multiple initiatives vis-à-vis equal opportunity creation, social safety net, eradication of geographic poverty pockets, and pro-poor human capital development.\nThe Rector maintained that NUST shares the vision of and is a staunch proponent of inclusive growth through creating educational opportunities for all.\nWhile mentioning that as many as 600 students of NUST are recipients of Ehsaas scholarship, he highlighted that the university inspires talented youth from all strata of society to pursue higher education at NUST, and accommodates students from low-income families under its need-based scholarships in overwhelming numbers.",
  "retrievedAt": "2025-08-11T21:39:47.961Z"
}
