{
  "title": "President for concerted efforts to promote family planning, check population growth",
  "link": "https://www.app.com.pk/national/president-for-concerted-efforts-to-promote-family-planning-check-population-growth/",
  "date_published": "2021-11-26T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): President Dr Arif Alvi on Friday underscored the need for concerted efforts to promote family planning and check the growing population of the country.\nHe called upon all the stakeholders to take measures for achieving the goals spelt out in the Action Plan on population.\nThe President expressed these views while chairing the 5th meeting of the Federal Task Force on Alarming Population Growth in Pakistan held here at Aiwan-e-Sadr.\nSpecial Assistant to PM for National Health Services, Regulations and Coordination (NHSRC) Dr Faisal Sultan, Chief Minister Gilgit-Baltistan Khalid Khurshid, Health Minister Sindh Dr. Azhra Fazal Pechucho, Minister of Population Punjab Col ® Hashim Dogar, Chairman Council of Islamic Ideology (CII) Dr Qibla Ayaz, Chief Secretary Punjab via video link, Provincial Secretaries of Punjab, KPK, Sindh, DG Population, Dr. Sabina Durrani,  Country Director Population Council, Islamabad, Dr Zeba Sathar, Country Representative of the United Nations Population Fund (UNFPA), technical experts and senior officials of the federal and provincial governments attended the meeting.\nMinistry of NHSRC gave a detailed presentation on the implementation status of decisions taken in the 4th meeting of the Federal Task Force on Population.\nIt was informed that the provincial governments were allocating more funds, enhancing the availability of contraceptives, raising awareness through media and training the human resource for family planning and population control.\nThe chair was briefed that Ulemas, Khateebs and religious leaders were being engaged to promote healthy family during their sermons, particularly in the province of Punjab.\nAddressing the meeting, the President said that the Ulema and Media had vital role in educating the people about the family planning in their Friday sermons and talk shows.\nHe advised the provincial governments to adopt an integrated approach and share their expertise, research and experiences with each other regarding their family planning strategy.The President lauded the Ministry of National Health Service, Regulations & Coordination and UNFPA for organizing International Donors Conference.",
  "retrievedAt": "2025-08-11T21:39:48.042Z"
}
