{
  "title": "J&K dispute resolution, essential for lasting peace in S. Asia: DPM/FM Dar",
  "author": null,
  "content": "ISLAMABAD, Feb 05 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Wednesday said that Pakistan consistently maintained that a peaceful resolution of the Jammu and Kashmir dispute in accordance with the relevant UN Security Council resolutions and wishes of the Kashmiri people, which was essential for a lasting peace in South Asia.\n“The United Nations must honor the commitments it had made 77 years ago and take steps for implementation of the Security Council resolutions on Jammu and Kashmir. For its part, Pakistan will continue to lend its full moral, diplomatic and political support for the Kashmiri people’s struggle to achieve self-determination,” the DPM/FM said on the occasion of Kashmir Solidarity Day.\nEvery year, he said the ‘Kashmir Solidarity Day’ was observed to express Pakistan’s unwavering support to the Kashmiri people’s just struggle for realization of their inalienable right to self-determination.\nThe relevant UN Security Council resolutions provided that the final disposition of Jammu and Kashmir would be made in accordance with the will of the people, expressed through the democratic method of a free and impartial plebiscite conducted under the auspices of the United Nations, he added.\nThe deputy prime minister/foreign minister said however, over the last seventy-seven years, India had made consistent efforts to suppress the wishes of the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“India’s illegal and unilateral actions of 5 August 2019 were a blatant violation of international law including the UN Charter, 4th Geneva Convention, and the relevant UN Security Council resolutions,” a press release quoted the DPM/FM as saying.\nDar further said that India had since been engaged in efforts to further strengthen its control over IIOJK. However, the genuine aspirations of the Kashmiri people could not be undermined through domestic legislation, judicial verdicts or administrative actions.\n“Today, India has created an environment of fear and intimidation in IIOJK. The number of political prisoners remains in thousands. Properties of the dissenters are being confiscated as a means of punishment,” he added.\nThe human rights defenders were not allowed to freely undertake their activities, he said, adding in this backdrop, India must allow unrestricted access to the UN and OIC observers, international media and human rights organizations to IIOJK to obtain first-hand information about the situation.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:24:37.568Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/jk-dispute-resolution-essential-for-lasting-peace-in-s-asia-dpm-fm-dar/",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T06:53:00.000Z"
}
