{
  "title": "Romina Khurshid reaffirms strong support for Kashmir’s struggle on solidarity day",
  "author": null,
  "content": "ISLAMABAD, Feb 05 (APP): On the occasion of Kashmir Solidarity Day, Coordinator to the Prime Minister for Climate Change, Romina Khurshid Alam has reaffirmed unwavering support for the people of Jammu and Kashmir in their long-standing struggle for self-determination, justice, and human rights.\nIn her message, Romina Khurshid underscored that Kashmir Solidarity Day serves not only as a reminder of the ongoing atrocities faced by the Kashmiri people under Indian occupation, but also as an important occasion to reiterate Pakistan’s firm commitment to their cause. She emphasized that Pakistan stands in full solidarity with the Kashmiri brothers and sisters as they continue their peaceful struggle for their inalienable rights, which remain denied by the Indian government.\nRomina stated that Kashmir Solidarity Day is a significant occasion that highlights the plight of the Kashmiri people while also calling upon the international community to uphold the rights of Kashmiris to freedom, dignity, and justice.\nShe reminded the global community of its obligations to recognize the legitimacy of the Kashmiri people’s demands for self-determination as enshrined in international law, particularly the United Nations resolutions on Kashmir.\n“The Kashmiri people have endured immense suffering over the years. Pakistan will continue to advocate for their rights until they are fully realized,” said Romina Khurshid Alam in her statement. “We salute the unwavering resilience and courage of the Kashmiri people, who continue to struggle for their right to self-determination in the face of grave adversity. Pakistan will keep raising their voice on every international forum, ensuring the world does not ignore their struggle for justice and peace,” she added.\nRomina Khurshid stated that the hearts of Pakistanis and Kashmiris beat together. She emphasized that every Pakistani stands united with the people of Kashmir in their rightful struggle for justice and self-determination. This solidarity reflects Pakistani people’s unwavering commitment to supporting the Kashmiri people in their pursuit of freedom, dignity, and peace, and to raising their voices on international platforms until their legitimate rights are fully realized.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:24:05.792Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/romina-khurshid-reaffirms-strong-support-for-kashmirs-struggle-on-solidarity-day/",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T12:45:00.000Z"
}
