{
  "title": "Sardar Masood Khan calls for global actions to restore Kashmiris’ rights",
  "author": null,
  "content": "ISLAMABAD, Feb 5 (APP):Sardar Masood Khan, the former president of Azad Jammu and Kashmir (AJK), urged the United Nations, the Organization of Islamic Cooperation, and other human rights organizations to step forward and restore the rights of the oppressed Kashmiris, which have been denied by the Indian government for the last seven decades.\nThe former president made these remarks during a podcast on Radio Pakistan in connection with Kashmir Solidarity Day on Wednesday.\nHe stated that the celebration of Kashmir Solidarity Day around the world sent a message to the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) that they were not alone in fighting against the state terrorism of Indian forces.\n“Denying the due rights of Kashmiris is an injustice, which must be corrected as per the numerous resolutions of the UN,” the former president said.\nHighlighting the importance of raising a voice for the Kashmir cause, the former president said it was high time to accelerate efforts and speak out against the brutalities in IIOJ&K, as India has been attempting to erase the special status of Kashmir since 2019.\nHe mentioned that the Kashmiris had clearly expressed their desire for freedom and liberty to choose their own statehood, and the Indian government must listen to these voices.\nThe former president emphasized that Pakistan, the UN, and the people of Kashmir were ready to address this conflict through a democratic process, such as a plebiscite or referendum under the supervision of the UN.\nHowever, he added, India was unwilling to do so due to its stubbornness.\nSuggesting possible solutions to resolve the seven-decade-long dispute, he stated that diplomacy was the ultimate solution, as confrontation, conflict, violence, and military options were not viable choices.\n“We must reach out to diplomatic circles and multilateral institutions to highlight the Kashmir cause and not rule out the option of third-party mediation,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:24:33.109Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sardar-masood-khan-calls-for-global-actions-to-restore-kashmiris-rights/",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T11:02:00.000Z"
}
