{
  "title": "AIOU starts six-week training course in GB’ Skardu to boost tourism sector",
  "link": "https://www.app.com.pk/national/aiou-starts-six-week-training-course-in-gb-skardu-to-boost-tourism-sector/",
  "date_published": "2021-09-27T13:20:00.000Z",
  "source": "APP",
  "content": "The introduction of hotel management courses for the youth of Gilgit-Baltistan will boost the tourism sector with proper hospitality in tourist destinations.\nThe efforts of Allama Iqbal Open University (AIOU) to equip the youth with vocational education will be beneficial in the socio-economic development of the country.\nAIOU is rendering commendable services in the field of vocational education in Gilgit-Baltistan, said Education Minister, Gilgit-Baltistan, Raja Muhammad Azam Khan and Tourism Minister Raja Nasir Ali Khan in their address to the graduation ceremony of the second batch of six-week hotel management training course for youth in Gilgit and Skardu.\nThey further said that vocational education is one of the main pillars of the economic stability of any society.\nBoth the ministers thanked AIOU, Alight Pakistan, and TAF Foundation for organizing a skill-based training course for the youth of Gilgit and Skardu.\nSecretary Education, GB, Iqbal Hussain and Parliamentary Secretary Education, Surayya Zaman also appreciated the services of Allama Iqbal Open University for the promotion of education in Gilgit-Baltistan and Skardu.\nAddressing the ceremony, Tourism Minister, Raja Nasir Ali Khan said that a huge number of tourists visit GB but due to lack of proper hospitality and hotel facilities in these areas, tourists face difficulties. On the other hand, educated youth in these areas are facing huge unemployment.\nDr. Zahid Majeed, Focal Person of AIOU, while representing VC, AIOU Prof. Dr. Zia Ul-Qayyum said that the hotel industry is moving towards rapid development and the VC has directed us to initiate this course and graduates will get decent employment opportunities, he added.\nKamran Iftikhar Lone, Deputy Chairman, Alight Pakistan and Dr. Hina Hussain Kazmi, CEO, TAF Foundation said that AIOU Alight Pakistan and TAF Foundation are jointly providing the best opportunity for the youth to shape their future through skill courses.",
  "retrievedAt": "2025-08-11T21:20:07.834Z"
}
