{
  "title": "Master Plan of Islamabad being reviewed after 53 years: Senate told",
  "link": "https://www.app.com.pk/national/master-plan-of-islamabad-being-reviewed-after-53-years-senate-told/",
  "date_published": "2021-09-27T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): Minister of State for Parliamentary Affairs, Ali Muhammad Khan on Monday informed the Senate master plan of Islamabad was being reviewed after 53 years besides bringing reforms in Capital Development Authority (CDA) on the directives of Prime Minister Imran Khan.\nWinding up discussion on a motion moved by Senator Mushtaq Ahmed that this house may discuss the damage caused to lives and property due to torrential rains in Islamabad on July 28 and the policy of the government to cope with such situation in future, the minister said the entire district administration, its allied departments, police and military personnel promptly acted.\nThe Deputy Commissioner Islamabad personally supervised the whole operation, he added.  He supported the suggestion of Senator Mushtaq Ahmed for carrying out thorough investigation into incident and fix responsibility on those who created illegally plots along the ‘Nullahs’.   The issue was also discussed in the federal cabinet, he added.\nHe said the government had no objection to refer the matter to the committee for addressal of reservations expressed by Senator Mushtaq Ahmed. The chair referred the matter to the standing committee on interior for detailed discussion.\nEarlier, moving the motion Senator Mushtaq Ahmed said illegal commercial plazas were constructed in E-11 by encroaching the Nullah caused urban flooding in Islamabad for the first time.\nHe said the urban flooding caused million of rupees damage to the properties of the peoples besides human loss in the incident.\nHe alleged that there were mafias in CDA who allowed creation of such illegal plots along the Nullahs.\nHe also demanded a high level commission to probe the issue and strict accountably of the concerned officials involved in this illegal practice.\nHe also suggested that small dams should be built on rainy Nullahs which would help enhance beauty of the capital.",
  "retrievedAt": "2025-08-11T21:20:04.859Z"
}
