{
  "title": "Covid-19 national positivity plummets below 4 percent",
  "link": "https://www.app.com.pk/national/covid-19-national-positivity-plummets-below-4-percent/",
  "date_published": "2021-09-27T10:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): The national tally of Covid-19 active cases on Monday was recorded 50,651 with 1,757 more people tested positive for the deadly virus and 1,765 people recovered from the disease during the last 24 hours.\nThirty-one corona patients died during past 24 hours, 29 of whom were under treatment in different hospitals and two of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Khyber Pakhtunkhwa (KP). Out of the total 31 deaths occurred, 12 of them died were under treatment on ventilators.  There were 4,033 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nNational Covid positivity ratio during past 24 hours was recorded 3.6 percent.  The maximum ventilators were occupied in four major cities including Sargodha 60 percent, Peshawar 37 percent, Lahore 49 percent and Multan 86 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of Covid patient) was also occupied in four major cities of Swabi 48 percent, Sargodha 49 percent, Peshawar 44 percent and Multan 44 percent.\nAround 475 ventilators were occupied elsewhere in the country while no Covid affected person was on ventilator in Azad Jammu and Kashmir (AJK), Balochistan and Gilgit Baltistan (GB).   Some 48,732 tests were conducted across the country on Sunday, including 16,050 in Sindh, 15,388 in Punjab, 10,905 in Khyber Pakhtunkhwa (KP), 4,361 in Islamabad Capital Territory (ICT), 867 in Balochistan, 503\nGilgit Baltistan (GB) and 658 in AJK. Around 1,162,177 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.  Since the pandemic broke out, a total of 1,240,425 cases were detected that also included the perished, recovered and under treatment Covid-19 patients so far, including AJK 34,046,\nBalochistan 32,861, GB 10,299, ICT 105,120, KP 173,210, Punjab 429,081 and Sindh 455,808.      About 27,597 deaths were recorded in country since the eruption of the contagion.  Around 7,350 people perished in Sindh, 13 of them died in the hospitals and two out of the hospitals on Sunday.\n12,559 people died in Punjab with six deaths occurred during past 24 hours. All of the deceased died in the hospitals.\nAs many as 5,507 people expired in KP, nine of them died in hospitals on Sunday, 916 individuals died in ICT, one of them died in the hospital on Sunday, 346 people died in Balochistan, 184 infected people perished in GB, and 735 people died in AJK.\nA total of 19,240,519 corona tests have been conducted so far, while 640 hospitals are equipped with Covid facilities across the country. Some 4,275 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:20:06.864Z"
}
