{
  "title": "FM reminds int’l community to engage with new reality in Afghanistan; help avoid economic collapse",
  "link": "https://www.app.com.pk/national/fm-reminds-intl-community-to-engage-with-new-reality-in-afghanistan-help-avoid-economic-collapse/",
  "date_published": "2021-09-27T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): Foreign Minister Makhoodm Shah Mahmood Qureshi has once again urged the international community to engage with the new reality in Afghanistan and unfreeze the assets so that things did not fall apart.\nAppearing in Al-Jazeera programme, the foreign minister said that they have been urging the ‘international community to engage with the new reality in Afghanistan, so that things do not fall apart and so that there is semblance of order’.\nThe foreign minister expressing his view over freezing of about $10billion in Afghan assets said “Afghan needs an economic injection and that money could become handy if available. Unfreeze it and make it available for the Afghan people. There is a humanitarian crises in the making and use that money to address the crises.”\nHe suggested that there could be ways and means to ensure that the money be reached to the needy and not misused and in this connection, the UN could play a role.\nForeign minister Qureshi, to a query replied, that it certainly concerned them if there was a total economic collapse in Afghanistan.\n“The collapse could lead to exodus, a huge influx of refugees moving in different directions towards, Pakistan, Iran and Tajikistan. It could destabilize the entire region.  And we are very concerned about that,” he elaborated his point of view.\nHe further said the economic collapse could give space to terrorists. It would have serious consequences not only for Pakistan but for the entire region. The consequences could roll out of the region, he cautioned.\nTo a query, Qureshi said that there was uncertainty when Taliban took control of the government on August 15, but the anxiety had gone down due to the reasons that there was no bloodshed and chances of major civil war had been averted.\nMoreover, there was announcement of general amnesty and commitment by Taliban that there would be no revenge. There was more calmness, he added.\n“So I don’t think people are restless at the moment, but yes, things remain uncertain and if not some challenges are not addressed—taken rigidly, they can take the different turn,” the foreign minister opined.\nAbout recognizing Taliban set up by Pakistan, the foreign minister said “We are watching and observing as the things unfold and we will take a decision at an appropriate time”.\nAbout US’s invasion of Afghanistan after 9/11, the foreign minister observed that perhaps, they had no choice as there was compulsion due to public opinion.\nHe said the US should have focused on what they had after disseminating Al-Qaeda network. They should have worked towards a reconciliation, peace and reconstruction efforts in Afghanistan.\n“The country could have gone to normal. The bulk of the money had been spent on security and less on development. The government of Ashraf Ghani lost credibility because the Afghan people felt that life under them was not improved and not secured. There was squabbling and infighting and they were not certain about their future,” he added.\nResponding to another query about allegations of Amrullah Saleh, former acting president of Afghanistan, Qureshi said that he used to speak of someone else language. He was briefed by India and on their payroll.\nThe foreign minister said Pakistan had undertaken a number of operations to clean up its tribal areas of terrorists and it did it successfully at the cost of huge losses.\nThere was surveillance and monitoring on its part, he said, adding whenever Pakistan was accused of having safe havens for terrorists, the blaming quarters were invited to come to these areas and see the situation themselves.\nThe foreign minister said India should stop its spoiler’s role in the region. In Afghanistan, its role was not helpful in the peace process, as a matter of fact, they were obstructionist in the peace process and collided with the Ghani’s government by blocking the negotiation process.\nAbout an inclusive government in Afghanistan, the foreign minister said that gradually, it appeared Taliban had accepted the idea mentally over inclusion of ethnicities.\n“Pakistan has been advocating for more inclusive approach,” he said, adding in politics, you have to make compromises and make moves to accommodate all points of views from both sides.\nThe foreign minister to another query replied that Afghans were very independent minded people who took their own decisions.\n“We as policy decided not to interfere in their internal matters. We will help when asked to help,” he said reiterating to achieve the shared objectives of peace and stability in Afghanistan.\nHe asserted that Pakistan would do whatever it could to achieve peace and stability in Afghanistan. “We have no business in interfering with their internal matters,” he maintained.\nQureshi said that it concerned Pakistan if the TTP elements had been set free from jails in Afghanistan.\nTo a question about female education in Afghanistan, he said to his information, girls were going to schools and colleges and not being restricted. The women could be accommodated in the cabinet.\nQureshi said Taliban had urged the people who were in the government service to come back and resume work. “It takes time to bridge the trust deficit,” he added.\nThe foreign minister said Pak-Afghan borders were kept open and not closed.\n“The question is— would you allow people in to your country without documentations visa or passports. You don’t. There are certain norms you have to follow,” he contended.\nQureshi said in the past, these borders were porous and Pakistan paid the price. And it was accused of cross border movements, but eventually, Pakistan fenced the border for better management and regulations.\nResponding to a question, he said Taliban had made a clear commitment that Afghan soil would not be used against any country including Pakistan. “I hope they will live up to that promise,” he added.\nAbout sophisticated weaponry left behind by the US forces, the foreign minister said if it ended in the wrong hands, it obviously concerned them.\nRegarding cancellation of home series by New Zealand and British cricket teams, Qureshi said that he wished they had visited Pakistan.\nHe said they had assured the teams of security and protection. To reduce their anxiety and make them feel more protected, they had suggested that stadiums would be kept empty. “But the game should go on. They pulled back which was disappointing,” he added.\nTo a query regarding elections in Afghanistan, he said “Let the things settle down and let things calm down. Let the people feel secure. Then we (international community) can talk about representation”.",
  "retrievedAt": "2025-08-11T21:20:05.259Z"
}
