{
  "article_id": "2025-04-17_f79dcd262f5a212fe398b323bc3f3b7c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/paf-c-130-aircraft-airlifted-bodies-of-8-pakistani-nationals-from-iran/",
    "retrieved_at": "2025-08-27T14:34:45.603Z"
  },
  "metadata": {
    "title": "PAF C-130 aircraft airlifted bodies of 8 Pakistani nationals from Iran",
    "author": null,
    "date_published": "2025-04-17T16:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 197,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "RAWALPINDI, Apr 17 (APP): On the special directives of the government, a Pakistan Air Force C-130 aircraft airlifted the mortal remains of eight Pakistani nationals from Zahedan, Iran, to Bahawalpur. The deceased, all residents of Bahawalpur district, tragically fell victim to a heinous terrorist attack in Iran's Sistan-Balochistan province, said a press release issued by Inter Services Public Relations (ISPR) here. Following the completion of medico-legal procedures and necessary documentation, the bodies were handed over to the Consul General of Pakistan in Zahedan and subsequently repatriated to Pakistan in the early hours of Thursday. Upon arrival at Bahawalpur Airport, a solemn ceremony was held to receive the deceased, with civil and military officials in attendance to pay their respects and offer condolences to the bereaved families. The Pakistan Armed Forces stand united with the nation in this hour of grief and reaffirm their unwavering resolve against terrorism in all its forms. The Chairman Joint Chiefs of Staff Committee and Services Chiefs have expressed deep sorrow over the tragic loss of precious Pakistani lives. They extended heartfelt condolences to the families of the victims and prayed for strength, patience, and fortitude for them in bearing this irreparable loss.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}