{
  "article_id": "2025-04-17_ba94ba0c4f4b361c435b06dbc7103d4f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nhsd-holds-event-to-mark-intl-day-of-happiness/",
    "retrieved_at": "2025-08-27T14:35:11.713Z"
  },
  "metadata": {
    "title": "NHSD holds event to mark Int’l Day of Happiness",
    "author": null,
    "date_published": "2025-04-17T16:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 249,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 17 (APP):The Network for Human and Social Development (NHSD), Lacompte, and Reach to Be Heard organized an event to mark the International Day of Happiness. The event featured an exhibition with 30 stalls, a conference, and a ceremony where shields were distributed, said a press release issued here on Friday. Key attendees included Superintendent of Police (SP) Mubashera Javed from the National Highways and Motorway Police, Fajer Rabia Pasha, Executive Director of Pakistan Alliance for Girls Education, Dr. Saadia Mushtaq, Dr. Moghees Ikram Ameen from NHSD's Board of Directors, Assistant Commissioner Nishaa Ishtiak from the Chief Commissioner's Office ICT, and Air Vice Marshal (Retd) Khalid Masood Rajpoot. Participants engaged in various activities and visited the stalls, contributing to the day's focus on well-being and social connection. The Motorway Police set up a specialized road safety stall to disseminate essential road safety practices, enhancing public awareness and encouraging responsible conduct among attendees. Officers from the Motorway North Zone and Mobile Education Units (MEUs) engaged with attendees, offering guidance on traffic rules, emergency responses, and preventive measures. SP Mubashera Javed visited all the stalls and emphasized the need for responsible behavior on the roads. The event not only celebrated the principles of happiness and well-being but also reinforced the vital importance of road safety in everyday life. The International Day of Happiness, established by the UN in 2012, aims to promote a more inclusive and balanced approach to economic growth that prioritizes the happiness and well-being of all people.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}