{
  "article_id": "2025-04-17_088ea5207bed815b7b1dba0702f39b7b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pak-army-officers-jcos-soldiers-awarded-for-rendering-meritorious-services-to-nation/",
    "retrieved_at": "2025-08-27T14:36:04.976Z"
  },
  "metadata": {
    "title": "Pak army officers, JCOs, soldiers awarded for rendering meritorious services to nation",
    "author": null,
    "date_published": "2025-04-17T11:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Apr 17 (APP):Investiture ceremonies were held at Peshawar, Lahore and Karachi Corps to honour the bravery and meritorious service of its officers and soldiers. In Peshawar, Corps Commander Peshawar, Lieutenant General Omer Ahmed Bokhari was Chief Guest on the occasion. Next of Kin of two Junior Commissioned Officers and 47 Soldiers received Tamgha-i-Basalat on behalf of Shuhadas. Four officers were awarded Sitara-i-Imtiaz (Military) and 11 officers were awarded Tamgha-i-Imtiaz (Military) for rendering meritorious services to the nation, said a press release issued by Inter Services Public Relations (ISPR) here Thursday. In Lahore, Commander Lahore Corps, Lieutenant General Fayyaz Hussain Shah, Hilal-e-Imtiaz (Military) conferred on Tamgha-i-Basalat (T Bt) on three Junior Commissioned Officers (JCOs) and twenty-four soldiers for their supreme sacrifices for the motherland. Twenty-eight officers were awarded Sitara-i-Imtiaz (Military), and seventy-two officers were awarded Tamgha-i-Imtiaz (Military) for rendering meritorious services to the nation. Next of kin (NOK) of Shuhada received their awards (T Bt) posthumously. In Karachi, Corps Commander Karachi Lieutenant General Muhammad Avais Dastgir awarded 10 officers with Sitara-e-Imtiaz (Military), 4 Officers with Tamgha-e-Imtiaz (Military) and 16 Soldiers with Tamgha-e-Basalat for their meritorious service. Across all three ceremonies, heartfelt tributes were paid to the Shuhada, and the unwavering commitment of Pakistan Army to national defence and security was honored with deep reverence. A large number of senior Army officers and families of awardees attended the ceremonies.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}