{
  "title": "Pakistan strongly condemns extra-judicial killing of eleven more Kashmiris",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-extra-judicial-killing-of-eleven-more-kashmiris/",
  "date_published": "2022-06-24T16:08:00.000Z",
  "source": "APP",
  "content": "Addressing a weekly press briefing here, the Foreign Office Spokesperson said since India’s illegal and unilateral actions of 5 August 2019, more than 636 Kashmiris had embraced martyrdom in fake ‘encounters’ and so-called ‘cordon-and-search operations. This year alone, 113 extra-judicial killings of Kashmiris had been recorded.\nIndia must realize that use of brutal force against the Kashmiri people, extra-judicial killings, custodial torture and deaths, forced disappearances, incarceration of Kashmiri leadership and youth and other methods of subjugation had failed in the past and will not succeed in the future, he added.\nHe said Pakistan also urged the international community to hold India responsible for its brazen suppression of innocent Kashmiris and play its due role in ensuring a just and peaceful resolution of the Jammu and Kashmir dispute in accordance with the relevant UN Security Council resolutions and the wishes of the Kashmiri people.\nHe referred to the recent virtual address of Foreign Minister Bilawal Bhutto Zardari to UN Group of Friends meeting on countering disinformation.\nBilawal provided some of his own suggestions such as creating campaigns for public awareness regarding disinformation and enhancing the capacity of governments, particularly in developing countries, to filter through false information and to limit online hate speech.\nThe spokesperson said Pakistan last year took an initiative together with like-minded countries that led to the consensus adoption of a resolution by the UN General Assembly on the issue of countering disinformation for promotion and protection of human rights and fundamental freedoms.",
  "retrievedAt": "2025-08-11T15:08:36.821Z"
}
