{
  "title": "Turkish ambassador pays farewell call on Interior Minister",
  "link": "https://www.app.com.pk/national/turkish-ambassador-pays-farewell-call-on-interior-minister/",
  "date_published": "2022-06-24T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP): Outgoing Ambassador of Turkey to Pakistan Ihsan Mustafa Yurdogul paid a farewell call on Minister for Interior Rana Sana Ullah Khan here on Friday at the Interior Ministry.\nDirector General Federal Investigation Agency Roy Tahir and other senior officials of Turkish embassy were also present in the meeting, said a statement issued here.\nPak-Turkey bilateral relations besides curtailing illegal immigration and human Trafficking to Turkey from Pakistan were came under discussion.\nThe Interior Minister apprised the Ambassador about his yesterday conversation with his Turkish counterpart Suleyman Soylu.\nThe minister thanked the ambassador and Turkish government for their excellent hospitality to Prime Minister Shahbaz Sharif and his delegation during the recent official visit to Turkey.\nHe said it has been decided to expedite action against elements involved in illegal immigration and human trafficking from Pakistan to Turkey. FIA, NADRA and Turkish immigration department were devising a joint strategy to eliminate illegal immigration and human trafficking.\nThe ministers said that preventing illegal immigration and human trafficking was our common goal and Pakistan would provide full support in this regard. Administrative and technical modalities have already been finalized to stop illegal immigration, he added.\nHe said people involved in human trafficking earned bad name to the country adding that action against such elements was imperative.\nRana Sanaullah said Turkey was our best friend and brotherly Islamic country adding that had always helped Pakistan in hour of odd.\nHe said the recent visit of PM Shehbaz Sharif and his delegation to Turkey would have far-reaching results. President Recep Tayyip Erdogan and PM Shehbaz Sharif had a very useful meeting during the recent visit and it would further expand and strengthen the bilateral relations.\nThe Ambassador appreciated Pakistan’s efforts to eliminate illegal immigration and human trafficking. Better coordination between the two brethren countries would help eradicate human trafficking and illegal immigration, he said.\nRana Sanaullah formally invited his Turkish counterpart to visit Pakistan through the Turkish Ambassador.",
  "retrievedAt": "2025-08-11T15:08:46.944Z"
}
