{
  "title": "Govt urged to exploit renewable, eco-friendly energy solutions",
  "link": "https://www.app.com.pk/national/govt-urged-to-exploit-renewable-eco-friendly-energy-solutions/",
  "date_published": "2022-06-24T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP): The experts in two different researches have urged the government to exploit the untapped potential of renewable and eco-friendly energy solutions to manage its growing energy crisis.\nAs Pakistan was facing severe natural gas shortage for the last couple of years, it has started relying on Liquefied Natural Gas (LNG), however, the government needed to explore other energy sources to save environment. There are other green energy options like solar and wind that can provide cheap environment-friendly energy sources and the country needs go for these options.\nThis was the crux of one of the two reports “Gas Monitor – Pakistan” & “Tabeer LNG Terminal, Socio-Economic & Environmental Analysis” launched by the Indus Consortium held about the gas provision as an energy source in the country at a ceremony here on Friday, said a news release.\nThe reports launch was attended by representatives of academic institutions, member of GROW Green Network, which is an umbrella of environmental organizations of Pakistan working for the promotion of renewable energy, independent researchers, member of Renewable Energy coalition Pakistan and alliance for climate Justice and Clean energy.\nSharing findings of the Gas Monitor – Pakistan report, Dr Amanullah Mahar, Director, and Center for Environmental Sciences, University of Sindh, Jamshoro, said that since LNG, fossil gas is a very high carbon intensive fuel and cannot be called “transition” fuel source to a cleaner energy system.\nHe explained that fossil gas (methane) can be leaked from the re-gasification, transport, and consumption and processing of it. After carbon dioxide (CO2), methane is the second most abundant anthropogenic greenhouse gas and responsible for 20% of worldwide atmospheric emissions. The methane is 25 times more potent than CO2 at absorbing atmospheric heat.\nWhile presenting findings of another report on “Tabeer LNG Terminal, Socio-Economic & Environmental Analysis”, an independent sustainability consultant Fatima Fasih said that keeping the global LNG markets and their volatility in consideration, it was clear that LNG was no longer a financially-viable source of fuel.\nShe said, “Instead of focusing on short-term monetary gains and quick gains in energy for the economy, public and private institutions should focus on building stronger energy security within Pakistan and develop a greener economy through a just and equitable energy transition towards renewable energy.”\nShe suggested that solar and wind power have shown remarkable success in Pakistan from economic perspective and should be invested in to increase their ratio within the country’s energy mix and help the country transition towards a just and sustainable energy transition.\nIqbal Hyder, Board member of Indus Consortium and Executive Director Laar Humanitarian Development Programme (LHDP), while concluding his remarks, said that the livelihood of population inhabiting along the coastal areas was directly dependent on mangrove forests.\nHe cautioned that any additional construction or industrial operations in these areas would exacerbate the declining socioeconomic conditions of the local communities. “We need to recognize the valuable indigenous knowledge for local fishing and rejuvenate the current worsening fishing populations.”\nThe Gas Monitor – Pakistan report focuses on the case of the development of Pakistan’s gas sector, especially LNG. It discusses how increasing reliance on LNG is posing challenges to the country’s economy on one hand and the release of methane gas emissions is deteriorating the environment on the other.\nThe monitor also comes up with a set of recommendations that present a potential way out of this entrenched dependence and its associated impacts.\nAn analysis of the socioeconomic and environmental impacts of the Tabeer LNG terminal, Port Qasim, Karachi, investigates the Environmental Social Impact Assessment (ESIA) and explores the Corporate Social Responsibility criterion with a set of recommendations.\nIndus Consortium is an umbrella organization of over 60 civil society organizations across the country, working on DRR, climate change, green development, and green finance. It also envisions a democratic and equitable society where all citizens enjoy equal economic, cultural, and political rights, with a mission to work for local communities to enhance their resilience and participation in green development.",
  "retrievedAt": "2025-08-11T15:08:48.186Z"
}
