{
  "title": "PM desires implementation of faceless customs assessment system in other cities",
  "author": null,
  "content": "ISLAMABAD, Jan 13 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday said that after functioning in Karachi, the faceless customs assessment system should be broadened and implemented in other cities as soon as possible so that all imports across the country could benefit from this system.\nThe prime minister chaired a review meeting on the matters related to the Federal Board of Revenue (FBR).\nThe meeting was attended by Minister for Economic Affairs Ahad Khan Cheema, Minister for Law and Justice Azam Nazeer Tarar, Minister of State for Finance and Revenue Ali Pervez Malik, and other senior officials, PM Office Media Wing said in a press release.\nThe prime minister observed that significant progress had been achieved in the digitization and reforms within the FBR in previous months, adding for the first time in history, a system with faceless digitization system had been introduced in the customs process, marking a significant milestone in the digitization of the FBR.\nThe prime minister directed the Ministry of Information Technology and Telecommunication and FBR to work together to further improve the faceless customs assessment system.\nHe desired that the system should be shifted to artificial intelligence by minimizing the human intervention.\nHe also directed for the development of a comprehensive strategy for the implementation of the track and trace system in various industrial sectors.\nThe meeting was briefed over the recent FBR reforms. The faceless customs system at all Karachi port terminals would be made fully operational by the end of February 2025, it was told.\nBesides, efforts were underway to ensure its operation nationwide soon. A central control room was being established to monitor the faceless customs system, it was further added.\nThe meeting was apprised that body cameras and tablets would be used to make the inspection recording system more transparent. Whereas mobile signal jammers and CCTV cameras were also being installed at all terminals to enhance the transparency of the inspection system.\nA transparent recruitment process for the new customs system had been initiated while a track and trace system had been implemented in all industrial units of the tobacco, fertilizers, sugar, and cement industries, the meeting was briefed.\nThe implementation of the track and trace system led to a significant increase in revenue from the tobacco, sugar, cement, and fertilizer industries in the fiscal year 2023-2024 compared to the previous corresponding year.\nFurther improvement in revenue from these industries was expected with the full implementation of the track and trace system this year, it was added.\nThe meeting was told that under the prime minister’s directive, the upgradation of the web-based One Customs began and its design was expected to be completed by the end of March.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:36:29.221Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-desires-implementation-of-faceless-customs-assessment-system-in-other-cities/",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T13:33:00.000Z"
}
