{
  "title": "Any attempt to disturb nation’s peace to be met with decisive, overwhelming force: COAS",
  "author": null,
  "content": "RAWALPINDI, Jan 13 (APP): Chief of Army Staff (COAS) General Syed Asim Munir, NI (M) on Monday categorically said that any attempt to disturb the peace of the nation will be met with decisive and overwhelming force.\n“The enemy may try to sow discord and fear, but we will not relent. Hostile elements will be dealt with an iron hand. They will continue to suffer heavy losses, and their capacity to inflict harm will be decimated,” said the COAS during his visit to Peshawar.\nAccording to Inter Services Public Relations (ISPR) news release, the Army Chief visited Peshawar, where he was provided with a comprehensive briefing on the prevailing security situation and the ongoing counter-terrorism operations targeting Fitna Al Khwarij.\nBriefing was also attended by Federal Minister of Interior and Chief Minister Khyber Pakhtunkhwa.\nDuring his visit, the COAS praised the unwavering resolve and unmatched sacrifices of Pakistan Armed Forces and law enforcement agencies, who have been instrumental in dismantling terrorist networks and thwarting their nefarious agenda.\nHe stated, “As we stand united against the forces of evil, I am immensely proud of the remarkable achievements of our security forces. Through their dedication, courage, and supreme sacrifices, we have successfully degraded the operational capabilities of terrorist organizations, both within our borders and beyond. Our forces have relentlessly pursued and eliminated key terrorist leaders, dismantled their infrastructure, and neutralized their cells, sending a clear message that terror has no place in our land. This war is ongoing and we would take it to its logical conclusion, InshAllah”.\nThe COAS further emphasised the relentless efforts of law enforcement agencies in ensuring the safety and security of citizens, foiling numerous attacks, and maintaining peace and order. He highlighted that every operation has been a testament to the courage, professionalism, and operational readiness of the security forces, who continue to thwart the evolving threats posed by terrorists.\nThe COAS also lauded the exceptional morale of the troops, who remain steadfast in their commitment to safeguard the sovereignty of the nation. He affirmed that the Pakistan Armed Forces and law enforcement agencies stand as an unbreakable force, resolute in their mission to protect the motherland and its people.\nThe COAS also separately interacted with politicians of Khyber Pakhtunkhwa belonging to different political parties.\nThe participants resolved consensus on the need for one political voice and public support against the scourge of terrorism.\nThe political representatives showed vivid clarity on unflinching support of the Armed Forces and LEAs in nation’s fight against terror and agreed on the need for a unified front beyond political colours against the extremist philosophy of terrorist groups.\nEarlier, upon arrival, the COAS was received by the Corps Commander Peshawar.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:35:39.218Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/any-attempt-to-disturb-nations-peace-to-be-met-with-decisive-overwhelming-force-coas/",
  "dateList": "2025-01-13",
  "date_published": "2025-01-13T17:22:00.000Z"
}
