{
  "title": "Character building as important as education: Farrukh Habib",
  "link": "https://www.app.com.pk/national/character-building-as-important-as-education-farrukh-habib/",
  "date_published": "2022-02-26T18:57:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Feb 26 (APP): State Minister for Information & Broadcasting Farrukh Habib has said that character building is as important as education for the new generation.\nAddressing a prize distribution ceremony in a local school here on Saturday, he said, “We collectively must concentrate on our youth to make them a true, committed and patriotic Pakistani”.\nHe said that in first three years of the life, a kid was like a clean paper and his family particularly his mother inscribe on it the social, moral and other values. Farrukh Habib said, “Our youth have talent but they need encouragement”.\n“Training is also important like education and we must take steps of encouraging students and in this connection, prizes can also be given to the students who observe cleanliness in their class or school”, he added. He also stressed the need of promoting and projectingour role models so that the new generation could follow their footsteps.\nHe said that there was dire need to build confidence in the students so that they could serve the nation and put the country on road to progress and prosperity by utilizing their God-gifted abilities. About Sehat Card, he termed it as a major step in providing health cover to the every individual of the country, adding the card holder family could get free medical treatment up to Rs.1 million from the hospital for their own choice.\nHe said that PTI government was committed to promote a uniform syllabus by eliminating the class differences.He said with the blessing of Allah Almighty, the PTI government declared Seerat-un-Nabi (Peace Be Upon Him) as an integral part of syllabus so that the people could learn and follow the teachings of the Holy Prophet (PBUH) which was imperative to transform the countryinto a true Islamic welfare state.Later, the state minister also distributed prizes and gifts among the position holder students.",
  "retrievedAt": "2025-08-11T14:24:56.508Z"
}
