{
  "title": "Minister Salik emphasises devotion, effective communication for Hajj welfare staff to enhance pilgrims experience",
  "link": "https://www.app.com.pk/national/minister-salik-emphasises-devotion-effective-communication-for-hajj-welfare-staff-to-enhance-pilgrims-experience-2/",
  "date_published": "2024-06-02T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 02 (APP): Minister for Religious Affairs and Interfaith Harmony, Chaudhry Salik Hussain has urged the Hajj welfare staff (Moavineen-e-Hujjaj) to perform their responsibilities with devotion as serving the pilgrims is a sacred duty.\nHe said this on the occasion of orientation sessions held by the Hajj mission for supporting staff in Makkah to make them aware of assisting pilgrims during the Hajj days.\nEmphasizing the need for effective communication, the minister suggested that guides fluent in various Pakistani languages should be deployed to assist pilgrims visiting the Haram Sharif for Umrah or prayers. “This move would enhance the experience of pilgrims and help them navigate the area with comfort, given Pakistan’s multicultural nature with language diversity,” he added.\nHe urged the supporting staff to ensure that the pilgrims should be provided with the best possible facilities and services during their stay for Hajj, showing compassion and empathy towards them in addition to their duties.\nThe minister noted that properly marked and men-supported bus pick-up points could facilitate the transportation of pilgrims to and from their residences. He urged guides to be proactive in guiding pilgrims to the right ways towards their destinations, ensuring they were readily available to assist those who may feel distracted or lost on their way to their residences.\nIt is important to note that over four hundred members of Hajj welfare staff currently performing duties in transport, accommodation, and food departments, have already received orientation sessions to prepare them for their roles during the Hajj days.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:54:19.438Z"
}
