{
  "title": "Young singers qualify for 1st Punjab Music competition final",
  "link": "https://www.app.com.pk/national/young-singers-qualify-for-1st-punjab-music-competition-final/",
  "date_published": "2024-06-02T15:13:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 02 (APP): Divisional competitions of the first Punjab Music Competition were held at the Punjab Arts Council (PAC) here on Sunday.\nSingers who secured top three positions from competitions held separately in Attock, Jhelum, Chakwal, Murree, and Rawalpindi districts participated in the divisional level competitions.\nThe event is the culmination of a series of qualifying competitions for the first Punjab Music Competition’s grand final which will be held in Lahore.\nThe district-level winners performed beautiful songs and received great applause from the audience.\nAccording to the spokesman PAC, Shazia Rizwan Member Punjab Assembly and President Rawalpindi Chamber of Commerce and Industry(RCCI), and member Board of Management PAC Rawalpindi Saqib Rafiq were the chief guests of the event.\nAddressing on the occasion, Shazia Rizwan stated that the promotion of arts and culture was a top priority of the government. She emphasized that parents should support their children in extracurricular activities along with their academic pursuits.\nShe mentioned that the music competition has brought the hidden talent of the youth to the forefront. She praised the Arts Council team for organizing the music competition.\nPresident RCCI Saqib Rafiq noted that showcasing cultural elements provided the audience with an awareness of different aspects of their culture.\nAppreciating the young singers, he stressed for continuation of such healthy competition for further promotion of the Punjab culture. Director Arts Council, Sajjad Hussain informed that the Arts Council had selected the best talent from across the division, who would represent the division in the provincial competitions to be held in Lahore.\nAfzal Latifi, Nawaz Ali Hazravi, and Rubina Khanum performed their duties as judges during the competitions.\nMuhammad Adeel, Haider Ali, and Nazakat Ali Shad secured first, second, and third positions in the divisional competitions, winning cash prizes of Rs 40,000, Rs30,000 and Rs 20,000 respectively in the division level final. The grand finale of the first Punjab Music Competition will be held on June 23 in Lahore.\nThe stunning event witnessed massive gatherings including students, parents and officials from Punjab Arts Council.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:53:56.263Z"
}
