{
  "title": "PMDC President hails launch of online portal as key digital transformation",
  "link": "https://www.app.com.pk/national/pmdc-president-hails-launch-of-online-portal-as-key-digital-transformation/",
  "date_published": "2024-06-02T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 2 (APP): The President of the Pakistan Medical and Dental Council (PMDC), Prof. Dr Rizwan Taj said on Sunday the launch of the PMDC Updated Online Portal was a significant step in the digital transformation of the Council’s services.\nIn an interview with a private news channel, he said that this initiative reflects the PMDC’s commitment to improving administrative efficiency and supporting the medical community in Pakistan. By eliminating the need for in-person interactions, the new portal streamlines processes reduces the risk of human error, and addresses the longstanding backlog of pending cases and registrations, he added.\n“The launch of the PMDC updated Online Portal sets a new standard for service delivery in the healthcare sector,” Dr aj remarked.\nThe innovative portal was specifically designed to facilitate registration and documentation processes, overcoming previous hurdles in the issuance of cases, he added.  He said that the portal be regularly updated after thorough checks to cover any existing loopholes.\nDrTaj also shared that the updated portal has already demonstrated its effectiveness by processing more than 5,000 cases in just 20 days.\nHe further said that this initiative was part of a broader effort by PMDC to streamline administrative procedures, ensuring that medical graduates can obtain their necessary certifications without delays. He said that the portal was designed to be user-friendly and secure, offering a smooth user experience and robust security measures to protect applicants’ information.\nIt also features a straightforward process for fee payments and a reliable system for monitoring and managing application statuses, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:54:43.414Z"
}
