{
  "title": "PIDE’s RASTA supports 40 research projects in 12 months",
  "author": null,
  "content": "ISLAMABAD, Apr 17 (APP):The Pakistan Institute of Development Economics (PIDE), under its flagship Research for Social Transformation and Advancement (RASTA) program, funded approximately 40 research projects, including evaluation studies of major federal and provincial government initiatives, during the incumbent government’s first 12 months.\nLaunched in July 2020, RASTA is Pakistan’s largest social sciences research network. It aims to establish a high-quality research ecosystem by connecting academia and think tanks across the country.\nRASTA produces rigorous, evidence-based policy research to support Pakistan’s public policy formulation.\nAccording to an official report available with APP, the program currently operates through an extensive network of over 70 national universities, more than 12 international institutions, and a growing community of over 4,300 researchers and academics.\nPIDE, an autonomous research organization, functions under the administrative control of the Ministry of Planning, Development and Special Initiatives.\nThe RASTA program is designed to bridge the research–policy gap, foster a localized research network, serve as a platform for knowledge generation and dissemination, revisit the country’s future policy agenda, and enhance policymaking capacity.\nWith these goals, the program aims to cultivate indigenous intellectual communities and generate impactful knowledge.\nIts outcomes are expected to contribute significantly to various facets of public policy, offering the government research-backed insights aligned with its developmental vision.\nDuring the initial three-and-a-half years of the program, Rs 393 million, 63% of the total allocated budget of Rs 628 million was spent. In contrast, Rs 235 million (37%) was utilized in the most recent 11-month period alone.\n“The same pattern is evident in the publication of reports and dissemination activities, which show a marked improvement during the first 11 months of the current government compared to the earlier phase. This notable progress has been made possible by the increased release of funds from the Ministry of Planning, Development and Special Initiatives,” the report added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:36:34.473Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pides-rasta-supports-40-research-projects-in-12-months/",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T09:29:00.000Z"
}
