{
  "title": "Pakistan, Hungary agree to deepen cultural, diplomatic cooperation",
  "author": null,
  "content": "ISLAMABAD, Apr 17 (APP):Pakistan and Hungary on Thursday agreed to strengthen bilateral cooperation in different fields, including diplomacy, culture and cultural heritage, besides reiterating mutual support for peace and multilateralism.\nThe bilateral ties were discussed in a meeting between Deputy Prime Minister and Foreign Minister Ishaq Dar and Hungary’s Minister for Foreign Affairs and Trade Péter Szijjártó who arrived here on an official visit. Both leaders also led their respective sides in the delegation-level talks which followed the signing of accords of cooperation in different sectors.\nAddressing a joint press stakeout following their meeting and talks, Deputy Prime Minister Dar said that Pakistan and Hungary desired to strengthen cooperation in agriculture, healthcare, Information Technology and industrial manufacturing, citing huge potential.\nHe said that both countries commemorated 60th anniversary of diplomatic relations this year—a partnership that has flourished across political, economic, scientific, and cultural spheres.\nCalling Pakistan and Hungary trusted friends and partners, with ties rooted in shared understanding of peace, and development, he said both sides discussed enhancing cooperation and addressing regional and global challenges.\nDPM Dar reaffirmed Pakistan’s commitment to strengthening ties under Hungary’s “Eastern Opening Policy,” developed under Prime Minister Viktor Orbán and aligning closely with Pakistan’s own vision.\nCommending Hungary’s contributions to Pakistan’s development, and the successful operations of the Hungarian MOL Group in the country he said that the recently held third Joint Commission further fortified plans to leverage Hungarian expertise in agriculture, water management, and other sectors.\nBesides, the Business Forum held earlier on the day showcased these opportunities as the Hungarian minister was accompanied by 17 businessmen from different sectors.\nDar expressed gratitude for Hungary’s continued support for the GSP+ scheme and said that MoUs and agreements signed during the visit would give a new impetus to cultural ties.\nHe said both countries signed an agreement to abolish visa requirements for diplomatic passport holders, further deepening government-to-government and people-to-people connections.\nThe deputy prime minister told the media that during the meeting, he underscored Pakistan’s principled stance on Jammu and Kashmir and reiterated steadfast support for the Palestinian cause based on the two-state solution.\nHe briefed the Hungarian delegation on the situation in Afghanistan and the associated security challenges.\nBoth sides emphasised the need for a peaceful resolution to the conflict in Ukraine and the importance of constructive dialogue.\nIn his remarks, the Hungarian Minister Péter Szijjártó welcomed the signing of the agreement to abolish visa requirements for diplomatic passport holders and expressed Hungary’s desire to intensify bilateral relations.\nHe emphasized that mutual respect should guide international politics and that judgmental and critical attitudes had led to problems in global politics. He said that instead of dividing into blocs, international politics should promote connectivity.\nRegarding accords on cultural cooperation, he said both nations had rich histories and cultural heritages as sources of strength.\nAppreciating Pakistan’s efforts in combating terrorism, he acknowledged the serious security challenges in the region, especially in relation to Afghanistan, including the threat of terrorism and illegal migration.\nHe reaffirmed his country’s support for the extension of the GSP+ program to Pakistan, calling it a mutual interest.\nHe highlighted recent successes in economic cooperation, including the doubling of trade volume.\nHe told the media that Hungary had carried out 16 humanitarian programs for Christian communities in Pakistan and offered 400 scholarships to Pakistani students annually.\nCalling it the most common success story, he referred to the $400 million investment of Hungarian company MOL in Pakistan over the last 25 years to boost both Pakistan’s energy security and Hungary’s economic interests.\nReplying to a question, he said Hungary could offer cooperation in food security, water management, and medical technologies.\nTo a question, Deputy Prime Minister Dar highlighted Pakistan’s efforts to engage with Afghanistan, including the appointment of a Special Envoy. He also announced his upcoming visit to Kabul in the next few days.\nEarlier, the Deputy Prime Minister Ishaq Dar and the Hungarian Foreign and Trade Minister Péter Szijjártó signed an agreement on visa exemption for diplomatic passports holders and two Memoranda of Understanding to promote cooperation in culture and archaeology domains.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:36:24.863Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-hungary-agree-to-deepen-cultural-diplomatic-cooperation-2/",
  "dateList": "2025-04-17",
  "date_published": "2025-04-17T10:28:00.000Z"
}
