{
  "title": "New Zealand hand sorry Pakistan biggest defeat to clinch T20 series at home - Sport - DAWN.COM",
  "author": null,
  "content": "New Zealand’s ruthless pace attack carved up Pakistan to deliver a crushing 115-run win in the fourth T20 on Sunday and clinch the five-match series.\n\nThe home side moved 3-1 ahead after defending 220-6 in Mount Maunganui and then dismissing a ragged Pakistan for just 105 in the 17th over.\n\nJacob Duffy claimed 4-20 and fellow seamer Zak Foulkes 3-25 as Pakistan suffered their biggest T20 loss by runs against all nations, eclipsing a 95-run defeat against New Zealand in Wellington nine years ago.\n\nThe tourists were reduced to 9-3 after two overs with Duffy bagging two scalps in his first over, both caught by wicketkeeper Mitch Hay.\n\nDuffy’s first victim was Hasan Nawaz for one, two days after the Pakistan opener blasted a maiden century in game three in Auckland to keep the series alive.\n\nTeetering at 56-8, Pakistan’s innings had some credibility restored thanks to 44 off 30 balls from allrounder Abdul Samad.\n\nThe only other batsman to score in double figures was Irfan Khan with 24.\n\nIt was New Zealand’s second biggest T20 win by runs, nearly surpassing their 119-run drubbing of the West Indies in 2018, at the same Bay Oval venue.\n\nEarlier, Finn Allen raced to 50 off just 20 balls, putting on 59 for New Zealand’s opening stand with Tim Seifert, whose 44 took 22 deliveries.\n\nSeifert was the first of three batsmen dismissed by seamer Haris Rauf, who claimed 3-27.\n\nAllen struck six fours and three sixes while captain Michael Bracewell was nearly as effective at the death, blasting 46 not out off 26 balls.\n\nGame five is in Wellington on Wednesday.\n\nNew Zealand: Tim Seifert, Finn Allen, Mark Chapman, Daryl Mitchell, James Neesham, Mitchell Hay, Michael Bracewell (capt), Ish Sodhi, Zak Foulkes, Jacob Duffy, Will O’Rourke\n\nPakistan: Mohammad Haris, Hasan Nawaz, Salman Agha (capt), Irfan Khan, Shadab Khan, Abdul Samad, Khushdil Shah, Abbas Afridi, Shaheen Shah Afridi, Haris Rauf, Abrar Ahmed\n\nUmpires: Chris Brown (NZL), Wayne Knights (NZL)\n\nTV umpire: Kim Cotton (NZL)\n\nMatch referee: Jeff Crowe (NZL)",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/231502189cc9fb2.jpg",
  "retrievedAt": "2025-08-25T15:23:29.788Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899822/new-zealand-hand-sorry-pakistan-biggest-defeat-to-clinch-t20-series-at-home",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T06:30:08.000Z"
}
