{
  "title": "PPP’s rights body demands journalist Farhan Mallick’s release - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Human Rights Cell of the Pakis­tan Peoples Party (PPP) has condemned the arrest of journalist Farhan Mallick, demanding his immediate release and a transparent investigation into the matter.\n\nIn a statement issued on Saturday, HRC president and former senator Farhatullah Babar criticised agencies for arbitrarily arresting citizens on vague and unsubstantiated allegations of ‘anti-state’ propaganda.\n\nHe highlighted that once arrested, the accused is subjected to judicial abuse, including harassment, intimidation, mental torture in custody, and unnecessary delays in court proceedings — only to be eventually proven innocent and released.\n\nThis has unfortunately become a standard operating procedure of the Federal Investigation Agency (FIA) to suppress dissent and freedom of expression, particularly since the enactment of the Prevention of Electronic Crimes Act (Peca), 2016, he stated.\n\nMr Babar pointed out that a key reason for this disturbing trend is the FIA’s failure to submit the mandatory six-monthly reports to parliament for scrutiny, as required under Section 53 of Peca. He urged parliament to ensure the FIA’s compliance with this provision.\n\nHe also referred to a ruling by the Senate chairman outlining the type of information these reports should contain, the procedure for their submission, and the necessity of discussing them in parliament.\n\nDemanding Farhan Mallick’s im­­mediate release, Mr Babar emphasised the need to uphold citizens’ constitutional rights to freedom of expression and access to information, as well as the international human rights covenants signed by Pakistan. He warned against the executive’s arbitrary interpretation of terms like ‘national security’ and ‘anti-state’ to silence dissent and evade public scrutiny.\n\nExpressing concern over the misuse of Peca to stifle free speech, the PPP leader called on the government to respect both national and international human rights laws.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:23:59.393Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899754/ppps-rights-body-demands-journalist-farhan-mallicks-release",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:42:43.000Z"
}
