{
  "title": "Fish harbour to get facelift before EU audit next month - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Karachi Fish Harbour is set to get a major facelift before an audit by the European Union (EU) in the first week of April.\n\nThe audit by the Director for Health and Food, Audits and Analysis of the European Commission will evaluate the facilities of exporters sending fishery products to EU countries.\n\nThe Marine Fisheries Department (MFD) has informed the relevant authorities that the audit will assess compliance with European Commission standards for fishery products allowed into the regions.\n\nThe European Commission regulations require continuous assessment of all stages of production, processing, distribution, storage and export, including fishing boats, landing sites, auction halls and processing establishments.\n\nIn November 2024 and January 2025, the MFD sent letters to stakeholders expressing dissatisfaction with poor sanitation at the Karachi Fish Harbor, including landing sites and auction halls with serious deficiencies in the supply chain.\n\nMore exporters vying to get permission for Europe exports\n\nMFD had asked the Karachi Fish Harbor Authority (KFHA) and Fishermen Cooperative Society Limited (FCSL) to improve fishing boats, landing sites and auction halls, which are approved by the MFD for landing fishery products intended for EU exports.\n\nThe MFD said hand washing facilities, waste washing stations, supply of potable ice from approved ice plants, hygiene, sanitary conditions, etc, must be enforced to avert any possible ban on exports to the EU.\n\nMohammad Zafar Iqbal Kundi, the Pakistan Fishery Exporters Association (PFEA) chairman, told Dawn that fish processing units and exporters were ready for the EU audit.\n\nHe added that efforts were underway at the harbour to comply with EU standards before Eidul Fitr.\n\nCurrently, only four exporters are allowed to export fishery products to the EU.\n\nThree more have sent their documents for approval.\n\nIn the upcoming visit, the EU team will audit the units of four approved exporters as well as that of three who have submitted their application for exports to the EU, the PFEA chairman said.\n\nHe added that more exporters have submitted their requests to the MFD which will be sent to the EU if pending applications of three exporters were approved.\n\n“We can earn foreign exchange of $200-300 million per annum from [eports to] the EU countries if the number of exporters reaches 12,” Mr Kundi said.\n\nZahid Khemtio, the managing director of KFHA, told Dawn that other government departments also have a role to play in ensuring compliance with EU standards.\n\nHe said the Sindh Solid Waste Management Board has been engaged to keep the harbour clean, while encroachments around the harbour have also been removed.\n\nAnother official of the KFHA said 611 boats have been modified as per EU standards. The KFHA is planning to line up these boats before the EU team.\n\nThe KFHA has conducted an anti-encroachment operation in the area where Fishermen Cooperative Society Limited had made illegal allotments.\n\nThe preparation was conducted with the assistance of the Keamari district administration and police.\n\nThe harbour authority is modifying iron trolleys for auction halls, fitting them with fibre coating.\n\nMore than 100 stainless steel trolleys, besides large numbers of plastic pallets, plastic fish crates and baskets, were being provided for landing, handling and transporting fishery products, the KFHA official said.\n\nEfforts were also being made to get rid of stray dogs, while abandoned and non-operational fishing boats were being removed to clear the channel.\n\nNeed for more exporters\n\nPakistan’s overall fish and fishery products exports during the first eight months of the fiscal year 2025 were 125,945 tonnes ($263.5 million) as compared to 126,962 tonnes ($262m) in the same period last fiscal.\n\nOverall fish exports in FY24 were 200,709 tonnes ($410m) versus 214,542 tonnes ($496.5m) in FY23.\n\nAccording to experts, EU countries offer better prices compared to other regions.\n\nAccording to Mr Kundi of PFEA, Pakistani exporters get $3 for a kg of squids exported to China. However, the same fetches $6 in the European market.\n\nHe called Europe “a good market” for Pakistani shrimp, squid and cuttlefish.\n\nAs only four exporters are allowed, the volume of exports to the EU is very low, but it can be enhanced if more exporters get the green signal after meeting the requirements, he said.\n\nThe EU, with 27 countries, is a potential market of $6bn, and every country offers better prices than its peers, he added.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:07:43.614Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899745/fish-harbour-to-get-facelift-before-eu-audit-next-month",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:43:00.000Z"
}
