{
  "title": "Iran unveils missile systems on strategic Gulf islands - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Revolutionary Guards have unveiled new missile systems on three strategic islands in the Gulf, saying they can target nearby “enemy bases, vessels, and assets”, state media reported on Saturday.\n\nThe weapons were deployed on Greater Tunb, Lesser Tunb, and Abu Musa near the Strait of Hormuz, a globally vital shipping lane.\n\nThe Guards recently held military manoeuvres in the area.\n\nSaturday’s announcement comes with Iran poised to respond to a letter from US President Donald Trump urging a resumption of nuclear talks and warning of possible military action if Iran refuses.\n\n“We have a tactic that we must arm” the island group “and make it operative”, said Alireza Tangsiri, naval commander of the Islamic Revolutionary Guard Corps, the ideological branch of Iran’s military.\n\n“We are capable of attacking enemy bases, vessels, and assets in the region,” he told state television.\n\nThe new systems “can completely destroy any target within 600 kilometres (370 miles)”.\n\nOn Friday, supreme leader Ayatollah Ali Khamenei said US threats against Iran “will get them nowhere”, and warned that “if they do anything malign to the Iranian nation, they will get a hard slap”.\n\nOn Thursday, Foreign Minister Abbas Araghchi described Trump’s letter as “more of a threat” but said it appeared to offer opportunities and noted that Tehran would respond “in the coming days”.\n\nIn remarks broadcast on Friday, US Middle East envoy Steve Witkoff said Trump was trying to head off armed conflict with Iran by building trust with Tehran.\n\nHe said the president’s letter was not intended as a threat.\n\nIran has controlled the three Gulf islands since 1971, despite their sovereignty being disputed with the United Arab Emirates for decades.\n\nIn September, Tangsiri said Iran was “expanding” its defence capabilities on the islands.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:23:30.386Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899829/iran-unveils-missile-systems-on-strategic-gulf-islands",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T08:05:37.000Z"
}
