{
  "title": "Families say tattoos landed Venezuelan migrants in Salvadoran jail - World - DAWN.COM",
  "author": null,
  "content": "MAIQUETA: Lawyers and relatives of Venezuelans flown from the United States to a notorious jail in El Salvador believe the men were wrongly labelled gang members and terrorists because of their tattoos.\n\nJhon Chacin, a professional tattoo artist, has images of “a flower, a watch, an owl, skulls” and family members’ names etched onto his skin. Last October, the 35-year-old was arrested at the Mexican border for entering the United States illegally.\n\nThen last weekend, after not hearing from him for several days, shocked family members spotted him in a video of shaved and chained prisoners at a maximum security prison in El Salvador. He was one of 238 men declared as a member of Venezuela’s Tren de Aragua — a terrorist group under US law — and deported by US President Donald Trump.\n\n“He doesn’t have a criminal record, he’d never been arrested,” Chacin’s sister Yuliana, who lives in Texas, said. She is convinced her brother was designated a gang member because of his body art.\n\nAt the US detention centre, before being deported, “ICE (immigration) agents told him he belonged to a criminal gang because he had a lot of tattoos.” In the western Venezuelan city of Maracaibo, family members of several other deportees denied their loved ones were criminals.\n\nTwenty-­three-year-old Edwuar Herna­ndez Herrera, known to family and friends as Edward, left Venezuela in 2023. He made a fraught journey across the jungle-filled Darien Gap before reaching the United States, where he was detained.\n\nHe has four tattoos — his mother and daughter’s names, an owl on his forearm and ears of corn on his chest, according to his mother Yarelis Herrera.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67df692fb560e.gif",
  "retrievedAt": "2025-10-12T02:08:18.979Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899769/families-say-tattoos-landed-venezuelan-migrants-in-salvadoran-jail",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:52:43.000Z"
}
