{
  "title": "Pakistan look to level New Zealand T20 series as Henry remains out - Sport - DAWN.COM",
  "author": null,
  "content": "MOUNT MAUNGANUI: A predominantly young Pakistan squad led by Salman Ali Agha look to maintain the momentum when they face New Zealand in the fourth T20 International in Mount Maunganui on Sunday.\n\nThe hosts lead the five-match series 2-1. After winning comprehensively the first two games of the series, New Zealand were surprised by the tourists in a high-scoring third game at Auckland’s Eden Park where Salman and his men chased down a mammoth 205 in just 16 overs, largely through young opener Hasan Nawaz’s record-breaking century (105 not out off 45 balls), the right-hander’s first in T20 Internationals.\n\nA victory for Pakistan will keep the series alive with the fifth and final game scheduled for Wednesday in Wellington.\n\nThe average first-innings score at Mount Maunganui’s Bay Oval since 2020 is 176 which suggests that Sunday’s game may not produce the fireworks that featured the outing in Auckland. Though it may remain slightly cloudy, no weather interruption is expected in the fourth game.\n\nMeanwhile, New Zealand Cricket (NZC) announced that their premier fast bowler Matt Henry will miss the remainder of the T20 series against Pakistan as he continues his injury rehabilitation.\n\nOriginally named in the squad for the fourth and fifth T20s, NZC said that the 33-year-old pacer will not join the team and will instead focus on his recovery.\n\nRight-armer Henry injured his right shoulder while diving in the outfield during New Zealand’s ICC Champions Trophy semi-final win against South Africa in Lahore. The injury, along with an ongoing right knee issue, forced him to miss the tournament’s final against India in Dubai.\n\nZak Foulkes, who was initially selected for the first three games of the Pakistan series, has been retained as a replacement.\n\nAdditionally, Henry’s fellow paceman Will O’Rourke, who was originally picked for the first three games, will now feature in the final two as well, replacing Kyle Jamieson in the hosts’ bowling line-up.\n\nJamieson was named player-of-the-match for his impressive figures of 3-8 in New Zealand’s win in the first T20. He missed the second match before returning for the third, where he had a tough outing, conceding 0-54 as Pakistan cruised to a nine-wicket victory.\n\nRevised New Zealand squad for last two T20s: Michael Bracewell (captain), Finn Allen, Mitchell Hay, Tim Robinson, Tim Seifert, Mark Chapman, Zakary Foulkes, Daryl Mitchell, James Neesham, Jacob Duffy, Will O’Rourke, Ben Sears, Ish Sodhi.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/2310485474d2ea1.jpg",
  "retrievedAt": "2025-08-25T15:23:46.366Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899733/pakistan-look-to-level-new-zealand-t20-series-as-henry-remains-out",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:43:19.000Z"
}
