{
  "title": "Hamilton off the mark for Ferrari before Piastri takes Chinese GP pole - Sport - DAWN.COM",
  "author": null,
  "content": "SHANGHAI: Lewis Hamilton roared to his maiden win in Ferrari red in the Chinese GP sprint on Saturday but the man he beat — McLaren’s Oscar Piastri — later scored his first-ever pole position in main race qualifying.\n\nPiastri will be joined on the front row for Sunday’s 56-lap race by the Mercedes of George Russell after a thrilling day of action at the Shanghai International Circuit.\n\nHamilton was only fifth in qualifying but the day already belonged to the seven-time world champion.\n\nThe 40-year-old controlled the 19-lap sprint race from pole to take the chequered flag in only his second weekend for Ferrari.\n\nIt added a sprint victory to his record six grands prix triumphs in Shanghai.\n\nHamilton was greeted by a crescendo of cheers from the massed fans, who unfurled huge banners displaying his number 44.\n\n“That is a really, really special weekend so far,” the Englishman told reporters.\n\n“China and Shanghai has always been really good to me since my first race here back in 2007. It’s a track that I really do love driving on.\n\n“It’s hard to put into words what it feels like.”\n\nHamilton later said that Ferrari had altered his car’s set-up for qualifying.\n\n“We made some changes,” Hamilton said. “Nothing major, but the car was really hard to drive. It wasn’t hugging the road.”\n\nHamilton enjoyed clean air out in front of the pack during the sprint, but it was clear that tyre degradation was high for any cars trying to follow those in front closely.\n\n“I don’t know how that will affect the pace for tomorrow,” said Hamilton, who will start on the third row alongside team-mate Charles Leclerc.\n\n“Everyone showed today it was really difficult to follow.”\n\nThe second row for Sunday’s main race will be filled by Piastri’s team-mate and championship leader Lando Norris and world champion Max Verstappen of Red Bull.\n\nIsack Hadjar, Kimi Antonelli, Yuki Tsunoda and Alex Albon completed the top 10.\n\n“It means a lot,” said Piastri of his first grand prix pole position. “We’ve been close a few times now. To have the first grand prix pole it did mean a bit more.\n\n“Pretty pumped to be honest, I’ve worked hard for it,” added the Australian, who was running second in his home race a week ago before a late spin.\n\n“The start of the season has been strong, just obviously the result in Melbourne was a shame, but I feel like I’ve been doing a good job otherwise.“Norris finally found some pace after coming eighth in the sprint.\n\n“I’m always disappointed if I’m not on pole but Oscar deserves it today,” said Norris, who won the season-opener in Australia last week.\n\nVerstappen, who is chasing a fifth consecutive world championship, said he may need the front-runners to retire to have a chance in Sunday’s race.\n\n“We are not fast enough. It was tough. But we are working on it and trying to do better,” said the Red Bull driver.\n\n“I feel comfortable, confident, but sometimes my input is not what I’m getting back from the car and that makes it quite difficult to nail every corner.”\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67df628392da6.gif",
  "retrievedAt": "2025-10-12T02:08:00.855Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899731/hamilton-off-the-mark-for-ferrari-before-piastri-takes-chinese-gp-pole",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:43:19.000Z"
}
