{
  "title": "Italy’s talks with Starlink stalled: minister - World - DAWN.COM",
  "author": null,
  "content": "ROME: Negotiations on a potential contract between Elon Musk’s satellite internet operator Starlink and the Italian government have stalled, reflecting broader geopolitical tensions, Italy’s defence minister said on Saturday.\n\nPrime Minister Giorgia Meloni’s government is aiming to guarantee encrypted communications between the government, diplomats and defence officials operating in risky areas and Starlink is among the contenders to provide the system.\n\n“It seems to me that everything has come to a standstill,” Guido Crosetto was quoted as saying by newspaper La Repubblica.\n\nHe said it was partly due to the fact that discussions moved from technical aspects to “statements” by and about Musk, without elaborating about those statements.\n\nStarlink is a dominant force in the sector with around 7,000 active low-orbit satellites and it has been offering its services in Italy since 2021. Sources have told Reuters Rome was considering a five-year deal worth a total of 1.5 billion euros ($1.62 billion) with the company that is part of Musk’s SpaceX group.\n\nBut talks between the government and Starlink have sparked outrage among opposition politicians who question the wisdom of handing a national security contract to a foreign businessman and close ally of U.S. President Donald Trump.\n\nMeloni has put the alliance with the United States at the heart of Italy’s foreign policy, but Trump’s actions, which have antagonised Rome’s European allies, are forcing her to perform a political balancing act.\n\nAt home, she is under pressure from her coalition partner, the far-right League, to keep supporting Trump and Musk.\n\nOn Friday, the League’s leader and Meloni’s deputy Matteo Salvini said he had a phone call with US Vice President JD Vance, in which he praised “the remarkable American capabilities in key areas such as satellite communications”.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:23:57.914Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899748/italys-talks-with-starlink-stalled-minister",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:43:00.000Z"
}
