{
  "title": "Youm-i-Ali observed across Sindh amid strict security - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI / HYDERA–BAD: The martyrdom of Hazrat Ali was observed across Sindh and all mourning processions in major cities and towns ended peacefully on Saturday amid tight security.\n\nIn Karachi, the main Youm-i-Ali procession was taken out from Nishtar Park and after passing through its traditional route, it terminated at Imambargah Hussainia Iranian in Kharadar in the evening.\n\nAs part of security measures, all entry points along the route of the procession were sealed off by placing containers till late in the night.\n\nDuring the procession, Imamia Students Organisation (ISO) organised congregational Zuhrain prayers on M.A. Jinnah Road. A larger number of participants offered prayers led by Maulana Talib Mousavi.\n\nAddressing the participants of the procession, the ISO leaders strongly condemned US attacks on Yemen and the Israeli regime’s atrocities in Palestine.\n\nAfter the prayers, the ISO also held a protest demonstration against Israel and the United States and other global forces for their “anti-Islam” agenda and ongoing atrocities against innocent people of Palestine.\n\nThe route of the main procession was completely sealed and no entry or exit was permitted. All those intending to join the procession were first frisked by scouts before being allowed entry. Those who had earlier come to attend the majlis at Nishtar Park underwent at least three layers of security checks, all managed by the scouts.\n\nShops situated along the route of the procession were sealed by police since Sunday night, while police and Rangers personnel remained deployed on rooftops for monitoring the procession.\n\nA team of the bomb disposal unit swept the route ahead of the procession. At the culmination of the procession, buses were arranged at Tower for the transportation of the participants of the procession.\n\nThe Karachi police claimed to have deployed 5,367 personnel as part of their security plan for the procession.\n\nA police spokesman said that strict security measures were taken along the route of the procession and that the personnel deployed were ready to deal with any possible situation.\n\n“The personnel on security duty included 76 senior officers, 725 officers, 3,469 head constables and constables, 137 women police personnel, 70 personnel of the Special Branch, while 75 personnel of the Rapid Response Force have been deployed,” he added.\n\nSome 815 traffic police personnel were also there to maintain the flow of traffic in the metropolis, while walk-through gates were installed at the entry and exit points of the procession.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67df6141a9b31.gif",
  "retrievedAt": "2025-10-12T02:07:45.132Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899729/youm-i-ali-observed-across-sindh-amid-strict-security",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:43:26.000Z"
}
