{
  "title": "Plan to cut costs, boost exports - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Ministry of Commerce has developed a comprehensive plan to boost the export of value-added textile goods by implementing pragmatic interventions to lower production costs, improve economies of scale, and conduct focused marketing events.\n\nThe policy was discussed at length during the meeting headed by Commerce Minister Jam Kamal on Saturday. It was attended, among others, by Commerce Special Secretary Ahmed Mangnejo and Director General (Textile) Mudassar Raza Siddiqi.\n\nAn official announcement said that the plan evolved after a thorough appraisal of key barriers to trade in comparison with regional competitors, market insights, global sales forecasting and changing geopolitical situation.\n\nDirector General Textile Mr Siddiqi presented a short to medium to long-term work plan to the commerce minister to boost exports of Pakistan’s textiles and apparel sector by opting for pragmatic interventions to reduce the cost of manufacturing, enhance economies of scale and target marketing events.\n\nThe plan focuses on diversifying to high-value-added finished products, including technical textiles, expanding to non-traditional markets, simplifying the non-tariff and technical barriers to trade, getting access to potential markets, and developing and implementing a national action plan on sustainability and circularity.\n\nIt was also pointed out that the plan facilitates export-centric R&D projects at the firm level, aligning academic activities with industrial needs and, most importantly, developing national Micro, Small and Medium Enterprises (MSME) development programmes.\n\nMr Siddiqi apprised the minister that Pakistan’s textiles and apparel industry, a cornerstone of the nation’s economy, has showcased remarkable resilience in the face of global economic headwinds and domestic challenges and regained its lost momentum with a growth rate of 9.3 per cent in the first eight months of 2024-25 compared to the corresponding period last year.\n\nHe further underscored that the apparel exports grew 19pc, hitting an all-time high of $6.2bn in 8MFY25.\n\nMr Jam acknowledged that export performance reflects the government’s commitment to focusing more on exports of value-added finished products while maximising the utilisation of locally-produced input materials.\n\nThe DG Textile shared that Pakistan, once ranked as the third largest producer of cotton, has dropped to sixth position globally. Comparing the case of Pakistan with Brazil, he highlighted that both countries have almost the same crop acreages. However, the yield per hectare in Brazil is three times higher than Pakistan’s due to the adoption of high-technology seed varieties, precision agriculture, mechanised harvesting, rainfed irrigation, and renewable energy.\n\nMr Jam emphasised that the latest disease-resistant and climate-resilient seed varieties, prohibition of uncertified seeds and chemicals in the local market, and adoption of good agricultural practices will certainly help to revive local cotton production and profitability of farmers.\n\nThe minister further noted that Pakistan is one of the few countries with a complete textile and apparel value chain and contributes to its socio-economic development. He emphasised implementing strategic interventions to address key challenges and unlock the sector’s full potential.Through collaborative efforts and supportive policies, the minister expressed optimism about increasing textiles and apparel exports. He encouraged focusing on potential in existing markets, exploring new markets, diversifying more to high-value finished products, and uplifting Micro, Small and Medium Enterprises.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67df65447b2b4.gif",
  "retrievedAt": "2025-10-12T02:08:31.934Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899744/plan-to-cut-costs-boost-exports",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:43:00.000Z"
}
