{
  "title": "Call for conservation of freshwater resources coincides with Earth Hour - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: From 8:30pm local time on March 22, WWF’s Earth Hour, the world’s largest grassroots environmental movement, returned for its 19th edition with the ‘Biggest Hour for Earth’ in support and celebration of our planet.\n\nWorld Wildlife Fund (WWF) said Earth Hour was a beacon of positivity, hope, and inspiration to rally as many people as possible in over 180 countries and territories.\n\nThis year, Earth Hour coincided with World Water Day, calling for conserving freshwater resources and addressing the adverse impacts of climate change.\n\nTo observe Earth Hour, events were organised in major cities across Pakistan and attended by goodwill ambassadors, policymakers, government officials, civil society organisations, and youth, said WWF.\n\nMultiple landmarks in Islamabad, including the President House, Prime Minister House, Parliament House, Supreme Court of Pakistan, Islamabad High Court, Pakistan Monument, D-Chowk, Pak-China Friendship Centre, Convention Centre and Jinnah Avenue switched off their lights to show commitment to the Earth.\n\nWhile in Karachi, Mohatta Palace and OICCI building observed Earth Hour. The main buildings in Lahore, including the Punjab Assembly, Alhamra - Lahore Arts Council, Wapda House, and Shalimar Gardens, switched off their lights.\n\nIn his message, President Asif Ali Zardari said: “On this year’s Earth Hour, we stand with the global community in reaffirming our commitment to energy conservation, environmental sustainability, and climate action. As we switch off non-essential lights, let this act serve as a symbol of our resolve to reduce energy consumption, minimise our carbon footprint, and protect Pakistan’s ecosystems.”\n\nHe said Pakistan faced energy challenges as rising fuel costs, power shortages and inefficient energy use put immense strain on the economy and environment. He said to build a secure and sustainable future, it was imperative to take decisive action to conserve electricity, reduce fuel consumption and adopt renewable energy resources.\n\nA statement issued by WWF said Prime Minister Shehbaz Sharif also said despite contributing less than one per cent to global greenhouse gas emissions, Pakistan was among the most climate-vulnerable countries.\n\nThe prime minister said his government was actively pursuing policies that integrated climate action across all sectors with initiatives designed to build resilience and sustainability. The government’s commitment to renewable energy expansion, plastic waste reduction and green job creation was laying the foundation for long-term environmental stewardship.\n\nHowever, policies alone are not enough - true change begins at home. “Every action, no matter how small, strengthens the collective momentum toward a sustainable tomorrow,” he added.\n\nSenate Chairman Syed Yousaf Raza Gilani remarked that the upper house of parliament recognised the global significance of Earth Hour as a catalyst of collective action.\n\nThis year’s alignment with ‘World Water Day’ under the theme ‘Give an Hour for Water’ underscored the urgency of addressing Pakistan’s water challenges - a priority echoed in our national development agenda. “As stewards of public trust, we acknowledge the critical role of energy and water conservation in mitigating environmental degradation and building climate resilience,” he added.\n\nWWF-Pakistan Director General Hammad Naqi Khan said: “Pakistan is confronting drastic climate events, including super floods in 2022, recurring heatwaves, frequent wildfires, and the challenges of severe droughts and erratic rainfall patterns. These incidents put pressure on natural resources, causing biodiversity loss and negatively impact human populations. Earth Hour is a powerful reminder of the urgency of addressing these challenges. It is not just about switching off lights but about switching on a global movement for change.”\n\nIn her message, WWF-Pakistan goodwill ambassador and TV actress Ushna Shah said Earth Hour was more than a moment that had continued to inspire and mobilise people across the globe. It reminded everyone of collective actions and responsibility to create a more hopeful and resilient future for people and our planet.\n\nOther goodwill ambassadors, including Sophiya Anjam, Aisamul Haq, Samar Khan and Ayesha Omar, joined the movement by sharing social media messages, videos, and photos, showcasing how they were giving an hour to Earth.\n\nAs part of the Earth Hour, WWF-Pakistan organised tree plantation drives at Karachi University and the University of Sargodha, which involved hundreds of students and faculty members. WWF-Pakistan also organised a webinar to educate and raise awareness on climate change and water challenges in Pakistan.\n\nSince 2007, Earth Hour has been known for its “lights off” moment. As landmarks and homes across the world switch off, supporters are also invited to symbolically switch off and ‘Give an hour for Earth’, spending 60 minutes doing something - anything - positive for our planet. In 2024, over 1.5 million hours were given to our planet by supporters around the world.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:23:45.336Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899678/call-for-conservation-of-freshwater-resources-coincides-with-earth-hour",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:43:38.000Z"
}
