{
  "title": "Peace and progress in Afghanistan necessary for regional stability: envoy - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan’s special envoy for Afghanistan, Ambassador Muhammad Sadiq Khan on Sunday said that peace and progress in Afghanistan were necessary for regional stability.\n\nSpeaking as a guest of honour for the flag-hoisting ceremony at the Pakistani embassy in Kabul on Pakistan Day, the envoy emphasised that his country and Afghanistan’s economic interests were intrinsically linked with one another.\n\nEarlier, the envoy had met Afghanistan’s Acting Foreign Minister Mawlawi Amir Khan Muttaqi in Kabul, where they vowed to sustain their diplomatic engagement to address ongoing bilateral challenges, including trade, security and the status of Afghan refugees in Pakistan.\n\n“Pakistan and Afghanistan must synergise their efforts to foster regional economic development,” he said, adding that the neighbouring country remained “one of the most important regional partners of Pakistan”.\n\nA significant development in trade relations is the reopening of the Torkham border after a 27-day closure. The crossing was shut on Feb 21 due to a dispute over construction activities and was reopened following negotiations mediated by a jirga.\n\nCurrently, the border is operating under a temporary arrangement until April 15, with ongoing negotiations for a long-term solution. Islamabad has expressed the hope that a permanent agreement will be reached before the current mechanism expires.\n\n“Both countries must work together to enhance bilateral trade and galvanise regional connectivity,” Khan highlighted.\n\nHe also said that the country remained committed to developing a strong and mutually beneficial relationship with Afghanistan.\n\nPakistan’s Head of Mission Ambassador Ubaid-ur-Rehman Nizamani, in his remarks on the occasion, called for honouring the sacrifices of armed forces and renewing the pledge to work towards a stronger and prosperous Pakistan.\n\nHe underscored the need of reinvigorating the country’s resilience to overcome all internal and external challenges.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/23152602c14e0a6.jpg",
  "retrievedAt": "2025-08-25T15:23:29.939Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899846/peace-and-progress-in-afghanistan-necessary-for-regional-stability-envoy",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T10:47:34.000Z"
}
