{
  "title": "NAP it in the bud - Pakistan - DAWN.COM",
  "author": null,
  "content": "DESPITE the media focus on the reported ‘hard state’ remarks by the army chief at the Parliamentary Committee on National Security (PCNS) meeting earlier this week, the huddle also saw agreement on a renewal of comprehensive counterterrorism measures such as the National Action Plan (NAP).\n\nThe NAP was developed and approved by consensus after the terror attack and massacre of students at the Army Public School in 2014 and, as Baqir Sajjad Syed recalled in his Dawn report on the PCNS meeting, was designed to combat terrorism through judicial reforms, strengthened law enforcement and measures against terror financing. It was revised in 2021.\n\nItem No 14 in the original NAP, and No 10 in the 2021 revised version, calls for reconciliation efforts in Balochistan side by side with all necessary kinetic operations to tackle rising militancy, even terrorism targeting civilians, in the province.\n\nThe main difference between the new and old action points is that while the older version called for the provincial government to take the lead in the reconciliation, the 2021 version did not prescribe who’d lead the process (if it were ever to start).\n\nIt is important for all thinking people in the country, including Balochistan, to come up with concrete suggestions.\n\nIt is not clear whether the later version was an acknowledgement of the criticism particularly in Balochistan of the set-up seen as foisted on the province via selected rather than elected people, and that would have much to lose if a genuinely elected system were to be ushered in.\n\nThe critics’ reference is to the disenfranchisement of the Baloch, which started with the subversion of the provincial government, ahead of the crucial Senate elections in March 2018, by the same intelligence officials who are being blamed today for facilitating the return of TTP militants to the merged districts a little after PTI’s Imran Khan became prime minister in 2018.\n\nGiven the civil-military resolve to tackle militancy/ terrorism in a multi-dimensional, structured manner, it is important for all thinking people in the country including Balochistan to not just criticise and condemn but also come up with concrete suggestions.\n\nI have been talking to many such people including Baloch friends and offer my own list of measures that may restore some sanity to the discourse and re-engage constitutionalists such as former Balochistan chief minister Sardar Akhtar Mengal, who stated he had given up hope.\n\nPoliticians such as Dr Malik Baloch, a Baloch nationalist, who remains a peaceful advocate of his province’s rights, should be listened to, not just invited to meetings and then ignored. As chief minister, he strived relentlessly to present his constituents’ legitimate concerns, within the confines of the federation, and get them addressed by the centre, the Council of Common Interests and every other institutional forum. The mild-mannered politician failed.\n\nHe’d also been tasked, along with his coalition partner PML-N’s retired Lt-Gen Qadir Baloch, to initiate a dialogue with estranged Baloch leaders in a reconciliation attempt, but was made to cut a sorry figure because, despite a positive response from the interlocutors, there was no follow-up. The state was either never interested or changed its mind.\n\nThese politicians and others like them who have placed their faith in the Constitution and federation are unpalatable to the state for one reason: they reflect and articulate the concerns of those who elect them.\n\nAs a first step, this has to change. It is time to acknowledge that their master’s voice may serve as dutiful echo chambers but can’t deliver and have zero cred.\n\nAs already mentioned in these columns, the question of the missing must be addressed. It would take courage to start our very own truth and reconciliation process. But no more courage than that being displayed by our soldiers who face a hail of bullets every day to do their duty and offer the supreme sacrifice.\n\nOne of Pakistan’s brightest minds and foremost public policy expert/ intellectual Rafiullah Kakar points out several other issues too. He told Shehzad Ghias Shaikh’s Pakistan Experience podcast that all the goodwill created by the 18th Amendment, the NFC award and Aghaz-i-Huqooq-i-Balochistan package between 2008 and 2013, which encouraged nationalists to contest the 2013 elections in droves, has evaporated due to the centre’s intransigence and mala fide political engineering.\n\nEconomic rights present a picture not dissimilar to the political rights of the province. For example, even before the passage of the 18th Amendment, the ownership of all natural resources, minerals (with the exception of gas and oil) belonged to the provinces.\n\nDespite this, the Saindak contract signed in 2002 gave a 50 per cent share of the profit to the Chinese, 48pc to the centre and 2pc (yes, two) to the Balochistan government. The 18th Amendment (2010) awarded 50pc ownership in gas and oil production to Balochistan. This was to cover all new contracts.\n\nIn Aghaz-i-Huqooq, it was pledged that Saindak would be handed over to Balochistan in 2012 to decide the terms of contract renewal, etc, but the Balochistan government was arm-twisted into agreeing to a five-year extension, as the then chief minister Raisani wilted under pressure. The contract was extended twice again in 2017 when Dr Malik’s efforts were thwarted and, unsurprisingly, BAP also relented in 2022 for yet another extension.\n\nAnother irritant is natural gas where Balochistan produces at least seven to eight times what it consumes and the consumption is subsidised; here too there is just one loser.\n\nThe advocates of status quo say the sheer spread of the province renders unviable any infrastructure to deliver gas everywhere. Then what would they say about the remarkably sad statistics from the Benazir Income Support Programme where, as per three different criteria, Balochistan’s population makes up 9pc to 10pc of the country’s poorest but only receives 3pc to 4pc allocation under this widely acclaimed poverty alleviation scheme?\n\nThere is a lot more to say and do, but Balochistan can be brought back from the brink into the mainstream. It is not easy to cede control. It will take political will.\n\nThe writer is a former editor of Dawn.\n\nabbas.nasir@hotmail.com\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67df7e8dda73a.jpg",
  "retrievedAt": "2025-10-12T02:08:23.089Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899791/nap-it-in-the-bud",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T03:23:59.000Z"
}
