{
  "title": "Torkham border reopens for pedestrians - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Stranded Afghans allowed to return amid complaints of visa curbs\n• 4,000 Afghans cross back into their country; 1,100 Pakistanis return home\n• Officials face difficulty in working online as immigration system still inoperative\n\nKHYBER: Thousands of stranded Afghan nationals rushed to the immigration offices at Torkham on Saturday as authorities reopened the border crossing for pedestrian movement after nearly month-long restrictions.\n\nAccording to immigration officials, over 4,000 Afghans crossed back into Afghanistan, including 1,900 individuals with valid passports, while around 2,150 were deported. In contrast, 1,100 Pakistanis returned home on the first day of restored pedestrian movement.\n\nDespite the reopening, officials struggled to fully restore the online immigration system, which had been damaged during cross-border clashes between the Pakistani and Afghan forces on March 3 and 4. As a result, most entries were processed manually.\n\nAuthorities announced that only Afghans with valid visas stamped on their passports would be allowed to enter or exit Pakistan, while those carrying only Tazkiras (Afghan national identity cards) would be barred from crossing in either direction.\n\nThe restriction left hundreds of Afghans dejected, particularly those who had been waiting for weeks since the border partially reopened on March 19 for trade and critically-ill patients.\n\nMany Afghans with only Tazkiras questioned why they were being denied re-entry to their own country, especially when Pakistan had already announced plans to deport all undocumented Afghan nationals by March 31.\n\nThey argued that Pakistan had never refused Afghan Tazkira holders the right to return to Afghanistan, especially when they would not be allowed back into Pakistan without a visa.\n\nAn Afghan national holding a passport but no visa said on condition of anonymity that obtaining a Pakistani visa had become an uphill task as it required an online application, submission of passports and a long waiting period of several months.He said many Afghan Tazkira holders also had valid passports but lacked Pakistani visas and were denied permission to return home on Saturday.\n\nMeanwhile, trade activities at the border have also picked up. Customs officials said that in the past two days, 740 vehicles carrying coal, soapstone and dry fruits entered Pakistan from Afghanistan. In contrast, around 450 export vehicles, including 133 Afghan Transit Trade Goods carriers, crossed into Afghanistan.\n\nPublished in Dawn, March 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67df2c08566e3.jpg",
  "retrievedAt": "2025-10-12T02:08:41.951Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899686/torkham-border-reopens-for-pedestrians",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T01:42:32.000Z"
}
