{
  "title": "Relatives not allowed to meet, deliver food to Mahrang Baloch in Quetta District Jail, family alleges - Pakistan - DAWN.COM",
  "author": null,
  "content": "Relatives are not being allowed to meet and deliver food to Dr Mahrang Baloch while she is in custody in Quetta District Jail, the Baloch Yakjehti Committee (BYC) leader’s cousin alleged on Sunday.\n\nThe BYC’s chief organiser and 16 other activists were arrested from their protest camp at Quetta’s Sariab Road, while a police crackdown on its sit-in against alleged enforced disappearances continues.\n\nAsma Baloch told Dawn.com that more than 24 hours have passed, but Mahrang has not been produced in court nor is she allowed access to legal counsel.\n\n“The authorities at Quetta District Jail did not allow us to meet my sister [cousin] and we were not allowed to deliver food and other essential items to her,” Asma alleged, adding that these items were returned by jail authorities.\n\n“This morning we waited outside the jail for more than two hours and kept requesting to meet her, but we were denied access and not allowed to deliver clothes and food.”\n\nThe BYC has issued protest calls on social media platform X in both Karachi and Quetta for March 24 (tomorrow), with the protest at the Karachi Press Club organised in collaboration with civil society members.\n\nThe demonstrators will protest the “illegal detention” of both Mahrang and Bebarg Baloch in the two cities, calling the arrests “a direct attack on fundamental human rights, justice, and freedom of expression”.\n\nAccording to the X posts, the protest at the Karachi Press Club is scheduled for 4pm, while the protest in Quetta is scheduled for noon.\n\nMeanwhile, the situation in Quetta returned to normal on Sunday — a day after a partial shutdown — while a shutter-down strike continued for a second day in some cities across Balochistan in response to a call by the Baloch Yakjehti Committee’s (BYC), which demanded the release of its leadership.\n\nMahrang had been leading the protest against the arrests of BYC activist Bebarg Baloch, his brother, and Bolan Medical College Vice Principal Dr Ilyas Baloch and his family members. Dr Ilyas and his relatives have been released. The participants were also protesting against the alleged burial of 13 bodies without identification.\n\nThe strike call had been issued after the BYC claimed on Friday that three of its protesters were killed by blank shots allegedly fired by the police. However, Quetta Commissioner Hamza Shafqaat had denied the claim, saying the deaths resulted from alleged firing by “armed elements accompanying BYC leadership”.\n\nAccording to a Dawn.com correspondent, the situation in Quetta returned to normal today after the provincial capital observed a partial shutdown and wheel-jam strike yesterday.\n\nA Dawn.com correspondent confirmed that mobile internet services had resumed in Quetta after being suspended for four days. The suspension caused difficulties for users, in the city particularly traders and students.\n\nThe correspondent added that the provincial administration gave no reason for the suspension.\n\nWhile the main businesses and markets remained open on Saturday, Sariab Road, Brewery Road as well as some other areas on the city’s outskirts had remained closed.\n\nShops in Gwadar and Surab, where a strike was reported yesterday, also reopened today, Dawn.com correspondents said.\n\nOn its side, the BYC issued a call for another protest at the Qambrani road in Quetta at 4pm today.\n\nIt said the protest was against the state’s actions in Balochistan as well as the arrest of Mahrang and other leaders, and urged the province’s people to come out of their homes to support the movement.\n\nIn a statement on Mahrang’s X account, her sister urged the public to raise their voice for the “safe release of Mahrang Baloch, Beboo Baloch, Bebagar Baloch, and their friends”.\n\n“As long as she (Mahrang) remains unlawfully detained by the state of Pakistan, I will be managing this account and providing updates on her situation,” the post purportedly made by her sister said.\n\nAmnesty International called for Mahrang’s release in a post on X, stating that she had been unlawfully detained for over 38 hours.\n\n“More than 38 hours since Mahrang Baloch’s unlawful detention, she is still being denied access to her lawyers and family,” Amnesty wrote. “There are also worrying reports of continued arbitrary arrests and detentions across Balochistan province.\n\n“Pakistani authorities must immediately release Mahrang Baloch and all others being detained for exercising their right to peaceful protest, and refrain from implicating Baloch activists in frivolous cases to unlawfully prolong their detention,” the NGO said.\n\nAccording to Hub Deputy Superintendent of Police (DSP) Imam Bakhsh Baloch, six people, including Imran Baloch, the former chairman of the Baloch Students Organisation (BSO), have been arrested.\n\nThe DSP told Dawn.com that Imran Baloch was arrested in connection with two previously registered cases, while investigations are underway into the other arrested suspects.\n\n“Imran was absconding in both cases,” the DSP said.\n\nHowever, shutter-down strikes continued in Kech’s Turbat as well as in Panjgur, Noshki, Kalat and Chagai districts, Dawn.com correspondents reported.\n\nProtests by BYC supporters were also held in Kech and at Bhawani near Hub on the Karachi-Quetta Highway, where traffic had been suspended yesterday due to road blockades.\n\nThe BYC shared purported visuals of closed shops in Kech, Noshki, Kharan, and Kalat. Videos shared by the committee also showed dozens, mostly women, at a sit-in in Kech and a rally purportedly held in Chagai.\n\nIn another post, the BYC claimed that one protester was arrested earlier today at Hub as “police and security personnel launched a crackdown on the protest camp, where families of missing persons and BYC activists were peacefully gathered”.\n\n“They dismantled the tent, fired tear gas, and opened fire, sabotaging the protest,” it added.\n\nOn Saturday, strikes had been reported in Mastung, Khuzdar, Hub, Bela, Surab, Gwadar, Dera Murad Jamali and some other areas as well.\n\nMeanwhile, the roads in Khuzdar, Surab, Kalat and Mastung were opened last night after talks were held with the local administrations. Traffic had been suspended yesterday between Quetta and Karachi, as well as Quetta and Taftan due to the blocking of highways.\n\nBy late Saturday night, the supporters of BYC were present in the Saroyan area and ‘clashes’ between the protesters and the BYC continued. Police were using tear gas to disperse the mob.\n\nReports also suggested that the post office of Balochistan University and many shops on Sariab Road had been torched while a heavy contingent was present in the area to disperse the protesters.\n\nIn a statement yesterday, Shafqaat had denied the claim that the police had killed three people by firing at the protesters during the BYC Quetta sit-in. The commissioner said BYC initiated a protest on March 21 demanding the recovery of the bodies of individuals killed during the Jaffar Express operation.\n\nHowever, the protest quickly turned violent as BYC protesters and their armed accomplices allegedly resorted to stone-pelting, indiscriminate firing, and attacks on law enforcement personnel. During the unrest, three individuals lost their lives due to alleged firing by “armed elements accompanying BYC leadership”.\n\n“Civil authorities and police emphasised that the deceased individuals’ bodies needed examination to ascertain the actual circumstances of their deaths. Despite knowing that all three — one of whom was an Afghan national — were killed by their own associates, the BYC leadership refused to hand over the bodies.\n\nMeanwhile, a first information report (FIR) was filed with Civil Lines police station in Quetta on March 19 against Mahrang and 12 other named suspects over the attack on Civil Hospital.\n\nAccording to the FIR, seen by Dawn.com, Baloch has been charged under Sections 124A (sedition), 147 (punishment for rioting), 149 (every member of unlawful assembly guilty of offence committed in prosecution of common object), 153A (promoting enmity between different groups), 186 (obstructing public servant in discharge of public functions), 337AD (fighting and vandalism), 342 (punishment for wrongful confinement), 353 (assault or criminal force to deter public servant from discharge of his duty), 356 (assault or criminal force in attempt to commit theft of property carried by a person) and 505 (statements conducing to public mischief) of the Pakistan Penal Code.\n\nThese sections were read with Section 11V (directing terrorist activities) of the Anti-Terrorism Act, 1997.\n\nAccording to the FIR, up to 150 people stormed the morgue at Civil Hospital and took the bodies of the terrorists killed during the Jaffar Express train hijacking.\n\nSeparately, Haq Do Tehreek chief Maulana Hidayatur Rehman said he was ready to mediate between the government and the BYC to reduce the tensions.\n\nRehman, also a Balochistan MPA from Jamaat-i-Islami, said in a statement issued by the HDT that the “people of Balochistan cannot afford more bodies”.\n\nExpressing concern over the recent incidents in Quetta related to the BYC, Rehman said “peace cannot be established with violence and coercion”.\n\nRehman said he was ready to mediate, with the agreement of the parties, so that the “release of the prisoners and public relief were possible”. He stressed that any further conflict would not be in the public interest as the people were the most affected by the current situation.\n\nCorrection: An earlier version of this story incorrectly stated that Asma Baloch was Mahrang’s sister. The error has been rectified.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/23165535177db2a.png",
  "retrievedAt": "2025-08-25T15:23:30.596Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899848/relatives-not-allowed-to-meet-deliver-food-to-mahrang-baloch-in-quetta-district-jail-family-alleges",
  "dateList": "2025-03-23",
  "date_published": "2025-03-23T12:39:56.000Z"
}
