{
  "title": "Any compromise on health tantamount to compromising national security, development: PM",
  "link": "https://www.app.com.pk/national/any-compromise-on-health-tantamount-to-compromising-national-security-development-pm/",
  "date_published": "2024-12-12T10:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Prime Minister Shehbaz Sharif on Thursday recognising the provision of accessible healthcare to all citizens regardless of their socioeconomic status as a moral imperative of the government said that any compromise on health was tantamount to compromising the security, prosperity, and development of where no risks could be taken.\nThe prime minister, in his message on Universal Health Coverage Day, annually observed on December 12, reaffirmed Pakistan’s commitment to the advancement of the global momentum towards Universal Health Coverage (UHC).\nHe said that this year’s theme, “Health: It’s on the government,” underscored the pivotal role of governments in ensuring that no one had to choose between essential healthcare and basic necessities such as food, shelter, or education.\nHe said that in pursuit of this goal, the government had introduced transformative initiatives, such as the Sehat Sahulat Program, spearheaded by the Ministry of National Health Services, Regulation & Coordination under the banner of “Sehat Sub Kay Liye” (Health for All).\nHe said that the program, which has garnered international recognition from esteemed organizations like the WHO, provided free health coverage to millions of families, prioritizing the most vulnerable segments of society.\nAdditionally, the government had made significant investments in healthcare infrastructure and ensured access to essential, life-saving medications, especially in rural and underserved areas.\n“Moving forward, Pakistan remains steadfast in its commitment to achieving the health-related targets outlined in the Sustainable Development Goals (SDGs) by 2030. We will continue to collaborate with the United Nations and other global leaders to develop and strengthen frameworks that prioritize health as a fundamental human right,” the prime minister resolved.",
  "retrievedAt": "2025-08-10T13:43:02.321Z"
}
