{
  "title": "SCBAP appreciates momentum of clearing backlog at SCP",
  "link": "https://www.app.com.pk/national/scbap-appreciates-momentum-of-clearing-backlog-at-scp/",
  "date_published": "2024-12-12T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP):Mian Muhammad Rauf Atta, President Supreme Court Bar Association of Pakistan (SCBAP) has appreciated the momentum at the Supreme Court in reducing the backlog of pending cases terming it a significant step towards dispensation of justice.\nIn a written statement issued here Thursday, the President SCBAP said that during the month of November 2024, the total number of cases instituted in the Supreme Court was 1,487, while 2,901 cases were disposed of, thus reducing the total pendency of cases to 58,487, according to the statistics available on its website.\n‘We appreciate this development as an encouraging step toward the expeditious dispensation of justice to the public at large, which is a primary duty of the Supreme Court. We believe that if the momentum continues with the same thrust, thousands of cases will be disposed of in the coming months, enhancing the overall efficiency and productivity’.\n‘We would like to express our highest recognition for the Chief Justice of Pakistan, Mr. Justice Yahya Afridi, who precisely anticipated the growing burden on the Supreme Court over the years and took decisive and effective measures to reduce the massive backlog. These measures have also facilitated in restoring public confidence on the institution.\nIt goes without saying that the formation of the constitutional bench in the Supreme Court, now responsible for addressing all constitutional and political matters, has also paved the way for reducing this backlog, which previously consumed the efficiency of the Court in fulfilling its primary task of providing swift and effective justice to the public.\nHowever, much still needs to be done, as the task ahead is gigantic. Nevertheless, we are fully confident that the Supreme Court, under the leadership of its paterfamilias, will leave no stone unturned in resolving the issue of backlog as well as other bottlenecks, to provide expeditious, inexpensive, and timely justice.\nOn behalf of the legal fraternity, the Executive Committee of SCBAP and most importantly, the litigant public, we once again extend our gratitude to the Chief Justice and all other judges of Supreme Court, for undertaking such vital initiatives’.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:43:24.746Z"
}
