{
  "title": "SAQE organizes seminar ‘People’s Agenda for Transforming Education; from Silos to Systems’",
  "link": "https://www.app.com.pk/national/saqe-organizes-seminar-peoples-agenda-for-transforming-education-from-silos-to-systems/",
  "date_published": "2024-12-12T17:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): The Society for Access to Quality Education (SAQE) during the 15th Annual Convention here on Thursday organized a seminar on policy dialogue titled “Citizen’s Agenda for Gender-Responsive, Inclusive, and Resilient Education”.\nThe theme of seminar was “People’s Agenda for Transforming Education; from Silos to Systems”, said a press release.\nExecutive Director, SAQE Zehra Arshad highlighted that addressing the education emergency requires inclusive policy planning with every stakeholder meaningfully engaged and guided by up-to-date gender-disaggregated data.\nHuma Chughtai, Member National Assembly, said that state has guaranteed right to education for every child. She urged for the adoption of “Charter of Education” to synergize efforts from every actor for sustainable solution of the Education Emergency.\nPresident of Board of SAQE, Harris Khalique, pointed out that while Pakistan constitutes 4 percent of the world’s population, it accounts for 11 percent of the global out-of-school children population.\nChief SDGs, Muhammad Ali Kemal, Planning Commission emphasized on addressing leakages in education financing along with overall investment in education. He urged for ensuring universal child registration so every child and their rights are acknowledged.\nDr Shahid Soroya, Director General, Pakistan Institute of Education informed that National Education Policy Framework has been developed with consensus of provincial authorities to effectively devolve education policy planning to grass-root level and ensure policies reflect local needs.\nAbid Gill, Deputy Chief Advisor, JICA AQAL highlighted the alarming decline in student transition rates—from 28 million children enrolled at primary to just 4 million at intermediate level—as a reflection of public mistrust in public education system. “Unless every child receives quality and skills-based education, Pakistan’s youth bulge will become a liability instead of an asset,” he cautioned.\nDr Faisal Bari, Dean School of Education, LUMS stressed that that the public education system is ill-equipped to cater to 26 million out-of-school children and the 2 percent annual increase in population of school-going children.\nKhadija Bakhtiyar, CEO, Teach4Pakistan stressed that declaring education emergency is not solution but long-term education policies and skilling youth through education system is crucial. She stressed on building an ecosystem where every actor works with synergy so the efforts can be reinforced.\nThe Annual Convention also featured a session “Reimagining Education – A Youth-led Blueprint for Systemic Change” where youth manifesto for education was presented.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:42:31.625Z"
}
