{
  "title": "AIOU holds 15-day training workshop for religious translators",
  "link": "https://www.app.com.pk/national/aiou-holds-15-day-training-workshop-for-religious-translators/",
  "date_published": "2024-12-12T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): A certificate distribution ceremony of the fifteen-day workshop for religious translator training was held on Thursday at Allama Iqbal Open University (AIOU).\nVice Chancellor of Allama Iqbal Open University, Professor Dr. Nasir Mahmood, was the chief guest, while Dean of the Faculty of Arabic and Islamic Studies, Professor Dr. Shah Mohyuddin Hashmi, presided over the event.\nProfessor Dr. Nasir Mahmood, shedding light on the significance of translation, stated that the field of translation was one of the most challenging disciplines. It is not just about transferring words from one language to another; it involves an entire history and culture, and attention to detail is crucial for accurate translation, he said.\nHe further emphasized that the participants who have benefited from this workshop now have the responsibility to pass on this knowledge to others.\nProfessor Dr. Shah Mohyuddin Hashmi congratulated the participants and assured that such training workshops would continue and create new opportunities for translators.\nHe added that the students who participated in this workshop would act as ambassadors of the knowledge they gained and play an important role in its promotion.\nOrganized with the joint cooperation of the Department of Islamic Thought, History, and Culture at Allama Iqbal Open University and Jamia al-Mustafa Al-Alamia (Pakistan Chapter), the workshop focused on translating religious texts from Arabic and Persian into Urdu, will enhance their creative skills.\nA total of 22 students at MA level participated in the workshop, while 22 resource persons trained them in modern translation techniques.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:43:20.593Z"
}
