{
  "title": "MOL celebrates 25 years of success in Pakistan",
  "link": "https://www.app.com.pk/national/mol-celebrates-25-years-of-success-in-pakistan/",
  "date_published": "2024-12-12T17:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): MOL Pakistan, a leading stakeholder in Pakistan’s energy sector celebrated its 25th anniversary of operations in the country.\nThe occasion commemorated the company’s role and achievements not only in building the country’s exploration; and production sector and contributing to its energy security, but also in positively impacting the lives of the local communities for two-and-a-half decades, said a news release.\nAs a fully owned subsidiary of MOL Group, MOL Pakistan plays an important role in its international portfolio, representing 7% of the group’s total hydrocarbon production.\nThe celebrations were attended by top officials from the government and the oil &amp; gas sector.\nOn the occasion, Chief Guest Federal Minister for Commerce Jam Kamal Khan lauded MOL Pakistan’s innovative approach, use of advanced technologies, and adherence to international best practices, significantly transforming Pakistan’s oil and gas sector.\nKamal added “Pakistan is on a path of stability and development, with the energy sector playing a key role. MOL Group’s 25-year legacy reflects a partnership of mutual trust and\nMr. Zsombor Marton, Executive Vice President, Exploration and Production of MOL Group while speaking to the audience said “Celebrating 25 years of success in Pakistan as an operator in exploration and production despite all challenges, far away from our Central and Eastern European core region is the proof of strong partnerships we have built with the\ngovernment of Pakistan and with the local communities, and shows the resilience of MOL Pakistan and the strength of MOL Group’s international operations. Just recently, even after\n25 years, in a mature area like TAL Block we were able to secure new discoveries with the Razgir-1 well.\nThe 25-year milestone reflects the dedication of our almost 500 colleagues and the trust of our joint venture partners in the company’s vision. As we move forward, we remain committed supporting the energy supply security with state-of-the-art technology in Pakistan, furthering innovation, strengthening collaborations, and supporting the socio- economic development of the communities we serve”.\nGovernor of Khyber Pakhtunkhwa, Faisal Karim Kundi, assured that the province was open to further investments in the oil and gas sector.\nHe emphasized the government’s commitment to going the extra mile to address any challenges faced by companies like MOL Pakistan.\nPakistan People’s Party senior leader Syed Naveed Qamar, highlighted MOL Pakistan’s pivotal role in mitigating natural gas shortages during the early 2010s.\nHe commended the company for ramping up exploration and production activities in the Tal Block, significantly contributing to the country’s energy needs at crucial times.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:42:31.614Z"
}
