{
  "title": "OPF set up 24 educational institutions in country, more than 17000 students studying",
  "link": "https://www.app.com.pk/national/opf-set-up-24-educational-institutions-in-country-more-than-17000-students-studying-2/",
  "date_published": "2024-12-12T08:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP):Overseas Pakistanis Foundation (OPF) has established a high-quality education system comprising 24 educational institutions throughout the country including Azad Jammu & Kashmir.\nThese include two state-of-the-art colleges, OPF Girls College, F-8/2 Islamabad, and OPF Boys College, H-8/4, Islamabad and 22 secondary and higher secondary level educational institutions.\nAn official source told APP here on Thursday, that at present more than 17,000 students are studying at OPF institutions out of which more than 2500 students are children of overseas Pakistanis. 1282 teaching and non-teaching staff are employed in these institutions.\nHe said that OPF works under the Ministry of Overseas Pakistanis and Human Resource Development (OP&HRD) and had been established under the Emigration Rules made under Emigration Ordinance 1979, Articles of Association, and Memorandum of Overseas Pakistanis Foundation, OPF Education Division is vested with the following responsibilities including giving of scholarships, stipends or grants to the children of the emigrants for studies in the field of science, technology, art and management in Pakistan and abroad.\nThe education system provides quality education for the children of Overseas Pakistanis from Pre-Nursery to Graduation Level. Educational institutions in Islamabad also provide education in O & A Level streams. OPF provides the structures, human resources, budget, and administrative & management support to ensure that the quality of service delivery is maintained at a high level, he added.\nOPF was constantly drawing up strategies, policies, and plans for educational reforms and development at OPF Educational institutions. The Education Division drafts relevant rules and regulations for schools in the OPF Education System and supervises their implementation.\nThe source revealed that OPF Girls College was established, in 1985, in the heart of the Capital city, Sector F-8/2 Islamabad, on an area of 100 kanals. The college has been providing quality education from Pre-nursery to Graduation level to the children of Overseas Pakistanis and the general public for the last 29 years. Presently 4,800 students are enrolled in the college out of which 702 are children of Overseas Pakistanis. The institution has a hostel facility for the children of OPFs. It can provide boarding/lodging facilities to more than 100 students from the Primary to Graduation\nTransport facility for pick and drop of students was also available at the College. 450 highly qualified teaching/non-teaching staff put their hearts and heads for the excellence of the institution. Due to their untiring efforts and dedication, OPF Girls College has now become a symbol of prestige and its academic and financial performance over the years has remained outstanding.\nOPF Boys College was established in 2001 at H-8/4 Islamabad in an area of 56 kanal. The college provides quality education from the Middle to the Intermediate level. Presently more than 1400 students are studying in the College out of which 256 are children of Overseas Pakistanis. 122 teaching and non-teaching staff are making their full efforts to win the confidence of parents and students. A hostel is being constructed for the provision of boarding/lodging for students coming to study at OPF Boys College, Islamabad, from other parts of the country, particularly for the children of overseas Pakistanis. The college also provides a transport facility for the pick & drop of students.\nOPF has established 22 other educational institutions in different cities of the country including Azad Jammu & Kashmir. These educational institutions provide quality education from the Pre-Nursery level to the Secondary/Higher Secondary Level. 10,879 students are enrolled in these 22 educational institutions out of which 1,550 are children of Overseas Pakistanis. These institutions are affiliated with boards of intermediate & secondary education in their respective regions. The educational institutions established in Azad Jammu & Kashmir are affiliated with Federal Board of Intermediate and Secondary Education, Islamabad.\n100% assurance for admission to the children of overseas Pakistanis at OPF educational institutions.\n50% concession in tuition fee at all OPF institutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:43:44.116Z"
}
