{
  "title": "Director Excise & Taxation fined for withholding information",
  "link": "https://www.app.com.pk/national/director-excise-taxation-fined-for-withholding-information/",
  "date_published": "2024-12-12T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): The Pakistan Information Commission (PIC) has imposed a fine equivalent to ten days’ salary on the Director of Excise and Taxation, Islamabad, for failing to disclose information requested under the Right of Access to Information Act, 2017.\nAccording to a news release,  a citizen, Saddia Mazhar, submitted an information request to the Excise and Taxation Department, in August 2024, seeking details regarding alcohol permits and sales in Islamabad.\nThe requested information included the total number of alcohol permit holders, beer purchases by these license holders since January 2023, a list of establishments licensed to sell alcohol, excise duties collected from these establishments, and the total supply made to these license holders.\nDespite the request, the Excise and Taxation Department failed to respond.\n“Following this non-compliance, Saddia Mazhar filed an appeal with the Pakistan Information Commission. The Commission issued multiple notices to the Director, Excise and Taxation, but no representative appeared, nor was the requested information provided. On November 14, 2024, a final show-cause notice was issued under Section 20(1)(f) of the Right of Access to Information Act, 2017.”\nIn its order issued on November 26, 2024, the Commission expressed concern over the “deliberate obstruction of the Act’s implementation”. The Commission noted that the officer had been given sufficient opportunities to respond, including notices sent through registered post, but failed to comply or appear.\nThe Commission emphasized that such conduct undermines the purpose of law ensuring transparency and accountability in public offices. It also comes in the way of the Act passed by the legislature. The Commission has restraint to enable the public official to provide the information but in vain.\nConsequently, the Commission imposed a fine equivalent to the salary of ten days on the Director of Excise and Taxation for willfully delaying or obstructing the disclosure of information. Pakistan Information Commission directed the Chief Commissioner, Islamabad Capital Territory, Secretary, Ministry of Interior, and Accountant General Pakistan Revenues to ensure compliance with the order. Notices have also been issued to these authorities to report compliance at the next hearing.\nThe Pakistan Information Commission reaffirmed its commitment to upholding the principles of transparency and accountability enshrined in the Right of Access to Information Act, 2017.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:42:55.516Z"
}
