{
  "title": "China-Pakistan Media Corridor important for further development of relationship, people to people contact: Federal Secretary Information",
  "link": "https://www.app.com.pk/national/china-pakistan-media-corridor-important-for-further-development-of-relationship-people-to-people-contact-federal-secretary-information/",
  "date_published": "2024-12-12T18:49:00.000Z",
  "source": "APP",
  "content": "BEIJING, Dec 12 (APP): Federal Secretary, Ministry of Information, Ambreen Jan on Thursday emphasized the importance of focusing on China-Pakistan Media Corridor for the development of existing relationship between the two countries and connecting the hearts and minds of Pakistani and Chinese people together.\nShe made these remarks while addressing a well-attended and memorable ceremony here marking the premier of first ever Pakistan-China co-produced film, Batie Girl in Beijing.\nThe federal secretary pointed out that during last visit of Prime Minister Shehbaz Sharif to China, two very significant MOUs were signed between the Ministry of Information and the Chinese government. These MOUs dealing with co-production of films and drams are going to further strengthen the bond of people to people contact and understanding each others culture.\nAmbreen Jan said that cooperation between the film industries of Pakistan and China is not new as around 12 Pakistani movies were shown in China from 1957 to 1991.\nShe said that the making of this movie by Syed Jamal Shah and his Chinese counterpart is the big opening for the film industries of both the countries and expressed the confidence that this cooperation would pave the way for further collaboration in the film industry in the coming years.\nIn his remarks at the ceremony, Pakistan Ambassador to China, Khalil Hashmi said that the film represented an artistic collaboration and a profound celebration of Pakistan and China friendship; it also showed how art and storytelling can inspire and connect.\nHe said that the two countries plan to continue connecting and bringing our people together through co-production of new films.\nHead of China Film Administration, Mao Yu warmly welcomed the Pakistani delegation and congratulated the organizers on successful holding of premiere of Bati Girl which is co-production of Pakistan and China.\nHe said that witnessed by Chinese Premier Li Qiang and Prime Minister Shahbaz Sharif, an agreement in this regard was signed between the China Film Administration and Ministry of Information and Broadcasting in Beijing.\nHe expressed the confidence that following the signing of film co-production agreement, more outstanding China-Pakistan films will be co-produced to further enhancing the cooperation between the two countries.\nThe re-release of Batie Girl, a landmark co-production between Pakistani and Chinese filmmakers, is set for December 16 on the Chinese mainland. Titled-The Girl from Ironclad-Brotherly Pakistan, the film tells the touching story of a friendship between a Chinese woman and a Pakistani teenage girl, united by their love for football.\nThe movie originally premiered in China on November 11, 2021, and later in Pakistan in August 2023, featuring Chinese actress Wang Jiajia and Pakistani actress Shaiza Channa. The film celebrates Pak-China friendship and the enduring spirit of sportsmanship through the lens of mutual support and cultural understanding.\nThe story follows Lu You, a Chinese athlete whose football career is tragically cut short by injury. Seeking solace, she travels to a remote Pakistani village, where she encounters Nasha, a spirited teenage girl with a passion for football. Despite their cultural differences, the two forge a deep bond, embarking on a transformative journey of self-discovery and resilience.\nBatie Girl has gained widespread recognition, both in Pakistan and China, as well as at international film festivals, including the Silk Road International Film Festival and the Pingyao International Film Festival.\nThe film has been praised for its universal themes of friendship, perseverance, and the triumph of the human spirit.\nThe audience gave a well deserved applause to both producers, Syed Jamal Shah and Xie Peng on their remarkable production. The film will be released on December 16 in over 7000 cinemas in China.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:42:31.626Z"
}
