{
  "title": "Kashmir conflict at crossroads: 2025 set to be game-changer; say experts",
  "link": "https://www.app.com.pk/national/kashmir-conflict-at-crossroads-2025-set-to-be-game-changer-say-experts/",
  "date_published": "2024-12-12T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): The coming year holds critical significance for the Kashmir conflict, declared Senator Mushahid Hussain Syed during a webinar titled “Human Rights for All: Amplify Kashmir’s Voice to the World,” organized by Friends of Kashmir International on International Human Rights Day here Thursday.\nIn his keynote speech, Senator Mushahid emphasized the importance of 2025, when Pakistan will secure an observer seat at the UN Security Council. He urged the Pakistani government and the overseas Pakistani and Kashmiri diaspora to utilize this opportunity to highlight the Kashmir issue and garner international support, said a press release.\nMishal Hussain Malik, Chairperson of the Peace and Culture Organization, drew attention to ongoing human rights violations in Indian-administered Kashmir and highlighted the plight of her husband, Yasin Malik, who remains in Indian custody under dire conditions, and called for urgent international support.\nOther speakers, including World Freedom Movement President Muzzammil Ayub Thakur, media professional Yasir Rehman, researcher Tayyaba Khurshid, and Hurriyat leaders Parvez Ahmed and Manzoor Shah, focused on the oppressive Indian laws affecting the region. They advocated for youth activism and a cohesive strategy to address the Kashmir conflict effectively. Speakers asserted that lasting peace in the region hinges on recognizing Kashmiris’ right to self-determination.\nAbdul Hameed Lone, Vice Chairman of Friends of Kashmir, highlighted the adoption of the Universal Declaration of Human Rights (UDHR) in 1948 as a complete framework for human rights. However, he lamented India’s failure to uphold its obligations under the international charter, citing the absence of the “Right to Life” for Kashmiris living under a climate of fear and oppression.\nThe session concluded with remarks from Friends of Kashmir International Chairperson Ghazala Habib. She proposed the formation of an action committee to elevate the Kashmir issue across various platforms and called for global appeals to secure the release of Kashmiri political prisoners like Asiya Andrabi and Shabir Ahmad Shah. Ghazala urged overseas Pakistanis and Kashmiris to play a pivotal role in resolving the Kashmir dispute per UN resolutions, emphasizing a need for swift action to ensure justice for the region’s oppressed population.",
  "retrievedAt": "2025-08-10T13:43:02.299Z"
}
