{
  "title": "Right of Syrian people to decide their destiny, free from foreign interference: FO spox",
  "link": "https://www.app.com.pk/national/right-of-syrian-people-to-decide-their-destiny-free-from-foreign-interference-fo-spox/",
  "date_published": "2024-12-12T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Pakistan on Thursday said that it was the right of the Syrian people to determine their own future and make decisions about their destiny which any foreign interference or external imposition should not determine.\n“We are following developments in Syria and are concerned about the escalation in violence… We express full support for the sovereignty, unity and territorial integrity of Syria. Any solution to the Syrian situation should correspond to the aspirations of the Syrian people for their security, stability and development,” Foreign Office spokesperson Mumtaz Zahra Baloch said at her weekly press briefing.\nShe said that Pakistan had always supported the efforts aimed at finding a comprehensive solution to the crisis in Syria\nShe said Pakistan was deeply concerned at Israeli aggression against Syria and its illegal seizure of Syrian territory and widespread destruction of Syrian infrastructure and civilian and military installations. This assault on the sovereignty and territorial integrity of Syria is a grave breach of international law, she added.\n“We express support for the sovereignty and territorial integrity of Syria and reject Israeli acquisition of territory by force. We reaffirm our support for the UN Security Council Resolution 497, which declares Israeli annexation of the Golan Heights “null and void and without international legal effect.”\nRegarding the repatriation of stranded Pakistanis from Syria, the spokesperson said that the foreign ministry and Pakistan’s missions in Syria and Lebanon remained actively engaged in facilitating the process.\n“Around 475 Pakistanis including around 250 zaireen have crossed the Syrian border into Lebanon. They will be transferred from Beirut to Islamabad. We appreciate the support extended by the Government of Lebanon in facilitating the safe return of the stranded Pakistani nationals from Syria.”\nAbout Wednesday’s terror attack in Kabul killing an Afghan interim minister, she said Deputy Prime Minister and Foreign Minister Ishaq Dar had expressed “shock” at the incident as “any terror activity with whatsoever motive, shall be condemned and Pakistan has unequivocally condemned terrorism in all its forms and manifestations.”\nShe reiterated that Pakistan was deeply concerned about the activities of terror groups endangering the lives of Pakistani people.\n“The terror groups that found hideouts in Afghanistan and operating against Pakistan remain a serious concern for Pakistan. This issue is on the agenda between Pakistan and Afghanistan. We have always emphasized dialogue to resolve the issues, and we hope that we will be able to ensure that these terror groups do not pose a threat to Pakistan’s security,” the spokesperson remarked.\nAsked about the engagement of Pakistan with the upcoming US administration on the issue of terrorism, she said that it was in the mutual interest to continue dialogue and cooperation on issues related to terrorism and transnational organized crimes. This remains a priority for Pakistan in its engagement with the US and other friendly countries.\nHighlighting the diplomatic engagements that took place during the last week, she mentioned the 7th Pakistan-Tajikistan Joint Commission on Trade, Economic, Scientific-Technical Cooperation held here on Wednesday wherein two sides reaffirmed their commitment to enhance bilateral cooperation in trade, energy, agriculture, manufacturing, education, and tourism.\nThey discussed the importance of devising mechanisms to boost bilateral trade, remove barriers, and establish a Joint Coordination Committee on Transit Trade under the Tajikistan-Pakistan Transit Trade Agreement.\nSpokesperson Baloch said that Pakistan welcomed the UNGA resolution of Wednesday demanding an immediate and unconditional ceasefire in Gaza; and removal of restrictions against UNRWA in its aid operations in Gaza Strip and West Bank.\n“We call for an immediate cessation of hostilities in Palestine; end to genocide in Gaza; protection of civilians and civilian infrastructure; unrestricted humanitarian access to those in urgent need, full support to UNRWA and its mandated humanitarian activities and healthcare to those in urgent need. We also urge the international community to hold Israel accountable for its war crimes and crimes against humanity in occupied territories.”\nShe said that in this week of commemorating 77 years of the adoption of the Universal Declaration of Human Rights, Pakistan expressed its solidarity with the people of Indian Illegally Occupied Jammu and Kashmir who continued to suffer widespread human rights abuses by the Indian occupation forces.\n“We urge India to end the suppression of the rights and freedoms of the Kashmiri people who shall be able to exercise their right to self-determination, as enshrined in the relevant UN Security Council resolutions,” she said and reaffirmed Pakistan’s continued political, diplomatic and moral support to Kashmiri people,” the spokesperson said.\nTo another query, she said Pakistan will participate in the D-8 summit being held in Cairo on December 19 to focus on the investment in youth and SMEs sectors. The summit will also have a special session on the humanitarian situation in Gaza and Lebanon, she informed.\nForeign Office spokesperson said that around 475 Pakistanis including around 250 pilgrims have crossed the Syrian border into Lebanon. They will be transferred from Beirut to Islamabad.",
  "retrievedAt": "2025-08-10T13:43:03.395Z"
}
