{
  "title": "Mount Sulaiman landslide affect large part of Balochistan-KP highways",
  "link": "https://www.app.com.pk/national/mount-sulaiman-landslide-affect-large-part-of-balochistan-kp-highways/",
  "date_published": "2023-04-02T13:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 02 (APP): Heavy landslides have occurred in the Mount Sulaiman range, due to recent rains in the border hilly areas of Balochistan and Khyber Pakhtunkhwa.\nSpokesperson of National Highway Authority (NHA) on Sunday told, a large part of the Balochistan-Khyber Pakhtunkhwa highway has been affected by the landslide at Dhana Sar on the National Highway (N-50) after which traffic has been suspended.\nOn the instructions of Federal Minister for Communication Maulana Asad Mehmood, the field staff and machinery of NHA have been mobilized to remove the landslide debris from the road.\nMeanwhile, Secretary Communications and Chairman NHA Captain (R) Muhammad Khurram Agha were in constant contact with NHA field officers in Balochistan-Khyber Pakhtunkhwa.\nMember Balochistan Shahid Ehsanullah was himself supervising the restoration work and has expressed hope for complete opening of traffic soon.\nAt present, the NHA staff and machinery were active to remove landslide debris from the road while more heavy machinery has been called from Zhob and Quetta.\nHowever, the NHA has opened road for light traffic while the affected road would be completely restored for all types of traffic within 24 to 30 hrs.\nAgha Inayatullah, General Manager Balochistan-North, has requested the Commissioner and Deputy Commissioner to stop the traffic in Zhob and Saifullah,\nHowever, passengers coming from Khyber Pakhtunkhwa can use the alternative route (N-70) Loralai-DG Khan Highway.\nThe NHA has appealed the passengers heading in the affected direction to be aware of the weather conditions before traveling.\nThe NHA is always ready to deal with all kinds of emergencies and is committed to provide the best road services to the nation.",
  "retrievedAt": "2025-08-11T08:11:31.582Z"
}
