{
  "title": "AJK govt. determined to deliver quality medicare at people’s doorstep: AJK PM",
  "link": "https://www.app.com.pk/national/state-govt-determined-to-deliver-quality-medicare-at-peoples-doorstep-ajk-pm/",
  "date_published": "2023-04-02T08:28:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK), Apr 02 (APP): Prime Minister of Azad Jammu and Kashmir Sardar Tanveer Illyas has said that his government was determined to ensure the delivery of quality medical facilities to the masses close to their doorstep across the AJK.\nHe was talking to a delegation of Mirpur Healthcare Community led by Dental Surgeon Dr. Adnan Marghoub Khan and Dr. Ijaz Raja who called on him here late Saturday.\nThey briefed the premier about the issues relating to the hospital and medical college. They also presented a charter of demands on behalf of the community.\nThe AJK Prime minister agreed upon all the demands and assured the visiting delegates that all their legitimate demands would be fulfilled and whatever problems faced by the community would be addressed on a priority basis. He also assured the delegation that during his next visit to the city, he would pay a detailed visit to Benzair Bhutto Shaheed Medical College.\nThe delegation included Dr. Ashfaq Ahmad Raja, Dr. Tahir Mehmood, Dr. Gohar Latif, Dr. Ahmed Naeem Kayani, Dr. Shoaib Khan, Dr. Majid Altaf, Sajid Ahmad Chaudhry and others, whereas Medical Superintendent Divisional Headquarters Teaching Hospital Mirpur Dr. Amir Aziz and Principal Benazir Bhutto Shaheed Medical College Professor Dr. Faisal Bashir was also present on the occasion.\nMeanwhile, Central Chairman Zakat Council Chaudhry Muhammad Siddique also called on Prime Minister Sardar Tanveer Ilyas Khan. Speaking on the occasion, the PM directed the concerned authorities to ensure fair distribution of Zakat among the poor and needy in Azad Kashmir. The PM said that as per his announcement, an amount of 6000 and 12000 rupees should be paid as zakat and dowry funds to the needy.\nThe Chairman of Central Zakat Council, Chaudhry Muhammad Siddique, briefed the Prime Minister about the issues related to the Zakat Council.\nThe Prime Minister assured him that all the problems faced by the Council would be addressed on a priority basis.\nOn this occasion, the government ministers including Chaudhry Yasir Sultan, Chaudhry Ali Shan Soni, Chaudhry Maqbool Gujjar were also present.",
  "retrievedAt": "2025-08-11T08:11:35.657Z"
}
