{
  "title": "Senate body receives briefing on MDCAT exam",
  "author": null,
  "content": "ISLAMABAD, Feb 11 (APP):Senate Standing Committee on Health on Tuesday received briefing on Medical and Dental College Admission Test (MDCAT) exam from Pakistan Medical and Dental Council (PMDC).\nThe meeting which was held under the chairmanship of Senator Amir Waliuddin Chishti was informed by PMDC officials that the PMDC is changing the structure of MDCAT exam under its new act.\nThey said that under this new structure, the question paper of a candidate will not match with another candidate.\nThe committee was informed that a national level syllabus is being prepared for the MDCAT exam to address the complaints related to out-of-syllabus questions.\nThe PMDC officials said that now the domicile holder candidate will take the exam in respective  province.\nThey said that before the PMDC exam, all the provincial governments and vice chancellors of medical universities are contacted for coordination.\nThe President PMDC said that there are complaints about charging additional fees by medical colleges. He added the matter is under discussion.\nThe chairman asked the President PMDC to make next MDCAT error-free. He said that PMDC will be responsible if any complaint is received in future.\nThe sub-committee submitted its report on registration of private medical colleges and redressal of grievances to the standing committee.\nThe committee also received briefing from CEO Drug Regulatory Authority of Pakistan (DRAP).\nThe CEO DRAP said that monitoring involves registration in the first phase, safety in the second phase and quality assurance in the third phase.\nHe said that currently 19 regulatory authorities and two institutions are working on it in the world.\nThe CEO said, “We also follow the standards set by the institutions.”\nHe said that DRAP has no power to penalize a pharmaceutical company for manufacturing substandard drugs. He added penalties are administered by drug courts.\nHe said that so far 650 drug manufacturing licenses have been issued.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:36:09.587Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-body-receives-briefing-on-mdcat-exam/",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T17:12:00.000Z"
}
