{
  "title": "Punjab govt taking steps for women to excel in scientific, technical fields: CM",
  "author": null,
  "content": "LAHORE, Feb 11 (APP):Punjab Chief Minister Maryam Nawaz Sharif has said that the role of women in science and technology is not only necessary but indispensable.\nIn her special message on the International Day of Women and Girls in Science, she stressed the importance of equipping young girls with modern scientific and IT skills to drive progress, adding that the Punjab government is taking significant steps to advance women and girls in scientific and technical fields.\nCM Maryam Nawaz highlighted the Honhar Scholarship Program, which provides full tuition coverage for thousands of female students, particularly in scientific disciplines. “Now, no girl in Punjab will be deprived of pursuing her dreams due to lack of resources,” she assured.\nThe chief minister explained that the Laptop Scheme aims to provide female students with access to modern technology, enabling them to enhance their educational and professional abilities. “Through this initiative, our daughters will strengthen their skills and contribute to the global digital economy,” she said, emphasizing the growing role of women in the digital market.\nMaryam Nawaz also announced the launch of a free Wi-Fi program in Lahore, specifically benefiting public spaces and female students. She noted, “Pakistan’s development is deeply tied to the empowerment of women.”\nThe CM said, “We will ensure every facility is available to our daughters to help them excel in science, technology, and IT at global standards.” She added, “We are building a Punjab where women are at the forefront of development, leading the way in progress.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:37:20.169Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/punjab-govt-taking-steps-for-women-to-excel-in-scientific-technical-fields-cm/",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T12:48:00.000Z"
}
