{
  "title": "Riaz Pirzada warns against irresponsible statements on water issue in Parliament",
  "author": null,
  "content": "ISLAMABAD, Feb 11 (APP):Federal Minister for Housing and Works Mian Riaz Hussain Pirzada has emphasized that water is a sensitive issue and should not be trivialized through irresponsible statements in Parliament.\nSpeaking on the Point of Order in the Parliament House, he highlighted that the Council of Common Interests (CCI), which includes the Prime Minister and Chief Ministers is responsible for addressing water disputes.\n“When I was in the Inter-Provincial Coordination (IPC), discussions took place regarding water-sharing issues between Sindh and Punjab, as well as Balochistan. However, nowadays, misleading statements are made on television, creating the impression that people’s rights are being usurped. Rights are not taken away in this manner; Bahawalpur also lost when river water was blocked,” he stated.\nHe further explained that Bahawalpur’s water share is also stored in the Diamer-Bhasha Dam, and if Punjab receives its share, Bahawalpur should also be given its due portion. “We demand that the portion of Punjab’s water allocated in the river be shared with Bahawalpur as well.”\nPirzada criticized the misinformation being spread, arguing that no new rivers have been created nor has any infrastructure been developed to support such claims. He called for responsibility and truthfulness from both from the Government’s Leaders and the Opposition, stating that reckless statements damage the credibility of the Parliament and the country’s image.\nHe also pointed out that senior politicians from Sindh, including Khurshid Shah and Naveed Qamar, have extensively discussed the water crisis in CCI meetings, acknowledging it as a serious issue that even sparks international disputes. However, he firmly opposed any exploitation of Bahawalpur’s water rights in the name of distributing resources to the desert areas.\n“As representatives of Bahawalpur, we are present in the Assembly and fully capable of protecting our region’s interests. No one else needs to speak on our behalf. We will continue to raise our voices to ensure fair water distribution for our people,” he asserted.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:36:59.404Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/riaz-pirzada-warns-against-irresponsible-statements-on-water-issue-in-parliament/",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T13:09:00.000Z"
}
