{
  "title": "Three security personnel martyred in Kurram attack - Pakistan - DAWN.COM",
  "author": null,
  "content": "KURRAM: Three security personnel were martyred and four others seriously injured as terrorists ambushed security forces in Takre Patti Chinarak area of central Kurram with heavy weapons, on Sunday.\n\nAccording to police sources, the insurgents ambushed security personnel with heavy automatic weapons in Takre Patti Chinarak area. Three security personnel embraced martyrdom while four other personnel sustained serious injuries in the attack.\n\nThe sources said that the bodies and the injured personnel were shifted to Combined Military Hospital, Tal.\n\nIn recent weeks, security forces have burnt down houses of several facilitators of terrorists in different parts of central Kurram on complaints of sheltering insurgents.\n\nThe mop-up operation against the militants has been going on for a long time in central Kurram. Due to the presence of insurgents in the mountain ranges along Khyber-Orakzai border, transportation routes, including the main Parachinar road across the district, continues to be blocked for several months, leaving local population trapped in their homes, with serious shortage of food and medicines in the area.\n\nMany residents of Parachinar have been staging protest sit-in at the Parachinar Press Club against the blockade of roads for the last several months.\n\nThe participants of the protest sit-in have also been demanding the release of tehsil chairman Agha Muzammil Hussain, opening of the main Parachinar road, relief package for families affected by unrest, and a martyrs’ package for the families of 500 people who died due to lack of treatment and medicines in the area, triggered by road closure for several months.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:52:33.652Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896958/three-security-personnel-martyred-in-kurram-attack",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:19:49.000Z"
}
