{
  "title": "India clashes injure four in Champions Trophy win celebrations - World - DAWN.COM",
  "author": null,
  "content": "At least four people were injured in the central Indian town of Dr Ambedkar Nagar on Sunday in clashes that erupted when revellers celebrating India’s Champions Trophy win lit firecrackers outside a mosque, officials said.\n\nIndia won the Champions Trophy title on Sunday evening after beating New Zealand by four wickets in the final in Dubai, claiming its second successive global title.\n\nThe clashes in Dr Ambedkar Nagar, earlier known as Mhow, involved stone pelting from both sides, officials said, and several cars, shops, and bikes were also vandalised and torched.\n\nThe town is located about 200 kilometres from Madhya Pradesh state’s capital Bhopal.\n\n“Some processions were being taken out in which some people lit firecrackers outside the masjid (mosque), after which there was a disagreement between both sides,” senior police officer Hitika Vasal told reporters.\n\nPolice used tear gas shells to quell the violence, local media reported.\n\nVideo footage showed deserted lanes with police personnel in riot gear, as some cars with shattered windows and others blackened as a result of being torched stood by the side.\n\nThe footage also showed glass shards on the road and shops that had been vandalised.\n\n“The situation is currently under control,” another senior police officer, Nimish Agarwal, told reporters, adding that police patrols had been started in sensitive areas.\n\nHindu-majority India houses the world’s third-largest Muslim population and clashes during celebrations of cricketing victories are not uncommon.\n\nPolice in the western state of Maharashtra had to similarly use force to control crowds celebrating India’s win over arch-rival Pakistan in the same tournament last month, local media had reported.\n\nActivists, opposition groups, and some governments have accused the Prime Minister Narendra Modi-led federal government of discriminating against Muslims, and failing to act against those targeting them.\n\nModi and his government have denied the allegations.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:05:04.499Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897014/india-clashes-injure-four-in-champions-trophy-win-celebrations",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T07:38:06.000Z"
}
