{
  "title": "At Haqqania, Fazl declares killing Muslims ‘not jihad’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Visiting the Darul Uloom Haqqania a week after it was rocked by a deadly suicide attack, Maulana Fazlur Rehman made a fiery speech denouncing the killing of Muslims and religious scholars as “not jihad, but militancy”.\n\nAddressing seminary students at the Akora Khattak institute, the chief of his own faction of the Jamiat Ulema-i-Islam (JUI-F) questioned whether playing with the lives of innocent Muslims could be termed ‘jihad’.\n\nHe said that taking up arms against Muslims and religious scholars could be the result of someone’s personal vendetta or myopia, or a conspiracy, but it could not be termed ‘jihad’ by any stretch of the imagination. “It is terrorism,” he maintained.\n\n“You are murderers, ruthless, criminals. Why are you deceiving yourself,” the Maulana asked, referring to the affiliates of banned outfits.\n\nAsks students not to allow contradictions to pollute their minds\n\nJUI-S leader Maulana Hamidul Haq Haqqani was among the six persons perished in the suicide bombing at the seminary in Nowshera on Feb 8. The JUI-S leader was leaving for home after Friday prayers when the suicide bomber targeted him, according to police.\n\nDuring his condolence visit to the seminary, the Maulana said he felt it was not an attack on Maulana Haq, rather an attack on his (Fazl’s) own home and seminary.\n\nThe JUI-F chief told the gathering that mosques were being targeted. Recently, a person was dragged out of a mosque and shot dead, he said, adding that another religious scholar was offering Taraweeh prayers when he was murdered.\n\n“Is there any morality left?” he asked, pointing out that religious scholars and 90 of his party workers had been slain during a gathering in Bajaur.\n\n“Hazrat Shaikh Maulana Hassan Jan is a martyr. Should I call my teacher a martyr and the killer a Mujahid?” he asked, telling the gathering not to give space to such contradictions in their minds.\n\nThe JUI-F chief said that he heard about a possible military operation at the Jamia and had warned some top leaders to stay away from any such action during a meeting with them.\n\nHe said when he told them that an operation was being planned, “they looked at each other as to how did I [Maulana] knew about it and silently looked at me. But I told them that if you plan anything such like that, it will cost you”.\n\nHe also claimed that some officials retreated and the plan was trashed when he warned them that if they tried it, they would have to face him (Fazl).\n\nHowever, he told the students that this spell of militancy would pass and religion would be upheld by scholars and seminaries. “These are black storms — they come and will pass, but these seminaries, religious scholars and JUI will uphold religion,” he remarked.\n\nThe Maulana said that a fatwa issued by religious scholars from Pakistan and Afghanistan was in place. He seemed to be referring to an edict - passed by Afghan Taliban leader Hibatullah Akhundzada - declaring cross-border attacks, including those on Pakistan, “haram”.\n\nAfter this, he said, any aggression against fellow Muslims could not be considered ‘jihad’.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67ce0e12a5809.jpg",
  "retrievedAt": "2025-08-25T15:05:43.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896891/at-haqqania-fazl-declares-killing-muslims-not-jihad",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:19:38.000Z"
}
