{
  "title": "A lapse in data-driven policymaking - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan is likely to receive $1 billion as the second tranche of the $7bn Extended Fund Facility (EFF) before June. Reports indicate that the ongoing International Monetary Fund (IMF) review acknowledges the government’s efforts to stay on the agreed stabilisation path.\n\nWhile the IMF’s validation provides some economic comfort, lasting political stability in Pakistan remains elusive until promised economic gains materialise and translate into tangible relief for the public.\n\nThe majority of citizens, struggling under prolonged economic strain, cannot be expected to wait indefinitely for the benefits of what Finance Minister Muhammad Aurangzeb calls a policy of “inclusive sustainable growth”. The government must urgently move beyond revenue generation and cost-cutting to implement proactive, people-centric policy interventions.\n\nHowever, without evidence-based planning and a robust implementation strategy capable of shifting socioeconomic indicators to reflect real progress, this journey appears challenging, if not improbable.\n\n“Mere high-sounding proclamations and initiatives such as ‘Uraan Pakistan’ won’t sway the public. They expect and deserve better, tangible results,” remarked an Islamabad-based analyst anonymously.\n\nAt least four consecutive governments have relied more on subjective assessments rather than actual insights into citizens’ needs, behavioural shifts, and socio-economic status\n\nFormer federal secretary and ex-caretaker Sindh minister for revenue, industry and commerce Yonus Dagha stressed the need to build government capacity for effectively addressing persistent economic challenges.\n\n“The IMF programme is essentially a bookkeeping exercise aimed at presenting better figures to the board by the end of the programme. Nowhere in the world has it successfully improved socio-economic conditions — if anything, it has worsened them.\n\n“We need thinking minds and feeling hearts at the policymaking level to drive meaningful change. The nation urgently needs not just immediate relief but also an environment that enhances skills, equipping people to navigate the challenges of the high-tech world before them,” he noted in response to a query.\n\n‘In a world where adjustments are driven by advanced technological tools, relying on five-year-old data for decision-making is damaging’\n\nAn economist from Islamabad advised managing expectations from the current government. “The last time I checked with PBS [Pakistan Bureau of Statistics], they mentioned fresh data might be available by year-end. But since our policies are not data-based anyway, it hardly makes a difference,” she remarked.\n\nThe PBS is responsible for collecting and disseminating official data in the country. Among its key exercises are two surveys that provide insights into citizens’ lives and its overall quality. The Pakistan Social and Living Standards Measurement (PSLM) survey gathers data on health, education, family planning, fertility, marriage and child-related indicators, while the Household Income and Expenditure Survey (HIES) focuses on people’s income and spending patterns. The variables in HIES are also disaggregated by consumption quintiles. The most recent available PLSM survey is from 2019-20, and the latest HIES dates back to 2018-19.\n\nThis suggests that the policy approaches and interventions of the four successive governments — Imran Khan, Shehbaz Sharif’s first tenure, caretaker prime minister Anwaar ul-Haq Kakar and the current Shehbaz-led government — have shared one common trait: reliance on subjective assessments rather than data-driven insights into citizens’ needs, behavioural shifts, and socio-economic status.\n\nThe absence of updated and relevant datasets has also compromised Pakistan’s ability to trace, track and report progress on Sustainable Development Goals effectively.\n\n“In a world where adjustments are driven by real-time data and advanced technological tools, relying on five-year-old data for decision-making or evaluating policy effectiveness is not just flawed; it’s damaging. It raises serious doubts about the government’s intent and highlights a stark disconnect between policymakers and the public,” remarked another economist from Lahore.\n\nWhen asked in Islamabad about the prolonged delay in PLSM and HIES, Chief Statistician Dr Naeem uz Zafar assured that his organisation is aware of the urgency and is actively working to collect, process and release the results soon.\n\n“The extensive exercise of housing and population census conducted between 2021 and 2023 led to the suspension of all other surveys. In 2024, data collection resumed for the Labour Force Survey (LFS), HIES, and the Integrated Agriculture/Livestock Census. Two-quarters of LFS and HIES data have been collected so far, with fieldwork for all four quarters set to conclude by June this year. Preliminary results are expected to be available by October. Meanwhile, initial findings from the Agriculture/Livestock Census will be released in May. The PSLM is scheduled to commence in 2026,” he stated in response to queries.\n\nGohar Eijaz, former caretaker minister for industry and finance, refrained from commenting on the IMF’s demands, worsening socio-economic indicators or data gaps. Instead, he emphasised the crippling impact of soaring energy prices in Pakistan. “Tangible relief in energy costs is essential to reconnect with the public,” he noted.\n\nMiftah Ismail, former finance minister and secretary-general of the Awaam Pakistan Party, advocated policy reforms. “The government must undertake substantive reforms,” he remarked.\n\nSeveral members of the government’s economic team were contacted for input, but no response was received by the deadline.\n\nPublished in Dawn, The Business and Finance Weekly, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:52:51.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896883/a-lapse-in-data-driven-policymaking",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:19:56.000Z"
}
