{
  "title": "Hamas pushes for phase two of Gaza truce talks - World - DAWN.COM",
  "author": null,
  "content": "• Holds dialogue with mediators in Cairo; demands include full Israeli pullout, end to blockade, reconstruction and funding\n• Israeli forces strike northern Gaza\n• Palestinian widow narrates ordeal of living ‘among dogs and rats’\n\nCAIRO: Hamas reiterated on Sunday its insistence on moving directly into negotiating a second phase of the Gaza truce, as Israel announced it would dispatch a delegation to Doha for further talks.\n\nMeanwhile, Israel carried out an air strike in northern Gaza, rattling the already fragile ceasefire.\n\nRepresentatives of Hamas met with mediators in Cairo at the weekend, emphasising the need for humanitarian aid to re-enter the besieged territory “without restrictions or conditions”, according to press release of the group.\n\nThe high-level delegation also stressed the need for “moving directly to begin negotiations for the second phase” of the deal, which will aim to lay the groundwork for a permanent ceasefire.\n\nHamas’s demands for the second phase include a full Israeli withdrawal from Gaza, an end to the blockade, the reconstruction of the territory and financial support, an official told AFP.\n\nHamas spokesperson Abdel Latif Al-Qanoua said indicators were so far “positive”.\n\nIsraeli Prime Minister Benjamin Netanyahu’s office meanwhile said it would send delegates to Doha on Monday.\n\nIsrael has maintained it wants an extension of the truce’s first phase until mid-April.\n\nThat initial period ended on March 1 after six weeks of relative calm that included the exchange of 25 living prisoners and eight bodies for the release of about 1,800 Palestinians held in Israel.\n\nThe truce also enabled the flow of vital food, shelter and medical assistance into Gaza.\n\nAfter Israel turned the pipeline off again, UN rights experts accused the government of “weaponising starvation”.\n\nDisplaced Palestinian widow Haneen al-Dura told AFP she and her children spent a month and a half living on the street “among dogs and rats” before receiving a tent.\n\n“As the family’s provider, it was distressing and I couldn’t sleep at all during the night,” she said.\n\nBesides, at their regular weekend rally in Tel Aviv, families of Israeli prisoners demanded the government fully implement the ceasefire.\n\n“The war could resume in a week — they have even picked a name for the operation,” Einav Zangauker, the mother of Matan Zangauker, told the crowd.\n\nShe said the war won’t bring the prisoners back home, it will kill them.\n\nIsraeli air strike\n\nIsrael carried out an air strike in northern Gaza on Sunday, rattling the fragile truce it prepared for fresh talks in Doha on the future of its ceasefire with Hamas.\n\nDespite the end of the truce’s initial phase a week ago, both sides have refrained from returning to all-out war, though there have been sporadic episodes of violence. Sunday’s air strike was the latest of daily strikes reported by Israel since Thursday.\n\nThe Palestinian group has repeatedly called for an immediate start to negotiations on the ceasefire’s second phase, which was negotiated by the United States, Qatar and Egypt aiming to bring a permanent end to the war.\n\nIsrael says it prefers an extension of phase one until mid-April, and cut off aid to Gaza over the impasse.\n\n“We call on mediators in Egypt and Qatar, as well as the guarantors in the US administration, to ensure that the occupation complies with the agreement…and proceeds with the second phase according to the agreed-upon terms,” Hamas spokesman, Hazem Qassem, told AFP.\n\n“To date, only 10 per cent of the required medical supplies have been allowed in, exacerbating the crisis,” Gaza health ministry spokesman Khalil al-Dakran said, adding that the “continued closure of the crossings threatens the lives of patients in Gaza”.\n\nInternational support for the Arab plan for Gaza reconstruction and governance grew on Saturday when the 57-member Organisation of Islamic Cooperation adopted it.\n\nBritain, France, Germany and Italy separately gave their backing.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67ce0ba69e46e.jpg",
  "retrievedAt": "2025-08-25T15:05:42.911Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896890/hamas-pushes-for-phase-two-of-gaza-truce-talks",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:19:44.000Z"
}
