{
  "title": "Karachi records first Naegleria death of 2025 - Pakistan - DAWN.COM",
  "author": null,
  "content": "Karachi recorded its first death from Naegleria fowleri as a 36-year-old female died from the disease last month, health officials said on Monday.\n\nThe woman was a resident of Gulshan-e-Iqbal and died at a private hospital in Karachi on February 23, according to Meeran Yousuf, media coordinator to the Sindh Health Minister.\n\n“The patient began experiencing symptoms on Feb 18 and was admitted to hospital a day later. The presence of Naegleria fowleri was confirmed in the patient on Feb 24, a day after the patient had passed away,” he said.\n\nUpon investigation, it was noted that the patient had not participated in any water related activities. Her only exposure was regular use of water to perform ablution (wuzu) five times a day at home.\n\n“This is the first death from Naegleria fowleri in 2025,” Yousuf said.\n\nPopularly known as “brain-eating amoeba”, Naegleria fowleri is responsible for the disease called Primary Amoebic Meningoencephalitis (PAM). The infection is fatal in 98 per cent of the cases.\n\nA free-living amoeba, Naegleria, is commonly found in warm fresh water (such as lakes, rivers, and hot springs) and soil. Only its one species, Naegleria fowleri, infects people.\n\nIt infects people when water containing the amoeba enters the body through the nose. This typically happens when people go swimming, diving, or when they put their heads under fresh water, like in lakes and rivers.\n\nThe amoeba then travels up the nose to the brain where it destroys the brain tissues and causes the PAM.\n\nThe first symptoms of the PAM usually start about five days after infection that may include headache, fever, nausea, or vomiting. Later symptoms can include stiff neck, confusion, lack of attention to people and surroundings, seizures, hallucinations, and coma.\n\nAfter symptoms start, the disease progresses rapidly and usually causes death within five days. The germ cannot survive in cool, clean and chlorinated water.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:04:59.164Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897038/karachi-records-first-naegleria-death-of-2025",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T13:05:07.000Z"
}
