{
  "title": "Russia claims counter-offensive into Ukraine’s Sumy region - World - DAWN.COM",
  "author": null,
  "content": "KYIV: Russia on Sunday announced it had captured territory in Ukraine’s Sumy region for the first time since 2022 in a cross-border offensive as Kyiv struggles to hold onto territory in Russia’s neighbouring Kursk region.\n\nRussia also claimed the recapture of four new villages in its Kursk border region as its troops pushed on against Ukrainian soldiers who had seized territory there.\n\nKyiv wants to use the territory it holds in Kursk as a potential bargaining chip in any peace negotiations.\n\nUS and Ukrainian negotiators are set to meet for talks in Saudi Arabia next week, with US President Donald Trump’s administration keen to secure a ceasefire and a “framework” for a peace agreement.\n\nThe United States has cut off Ukraine’s access to intelligence sharing and satellite data in a bid to force it to negotiate.\n\nThe Russian defence ministry said in a briefing that its forces, in a counter-offensive, had “liberated” the small village of Novenke in Sumy near the border with Kursk.\n\nRussia briefly occupied parts of Sumy at the start of its all-out invasion in 2022 but has not conquered any territory there since.\n\nRussian President Vladimir Putin said in mid-February that his forces had entered this part of northeastern Ukraine, a claim branded a “lie” by Kyiv, although it has acknowledged isolated attacks.\n\nNovenke is located about a kilometre (less than one mile) from Kursk and Russian military bloggers said its capture brought troops closer to blocking a major Ukrainian supply route. Kyiv has not yet commented on Russia’s claim to have captured Novenke.\n\nIncursion’s ‘final phase’\n\nUkraine’s state Centre for Countering Disinformation on Saturday denied reports of a “massive breakthrough” by Russia, saying its own forces were destroying small groups trying to cross the border.\n\nRussia on Sunday announced the recapture of the villages of Lebedevka, Malaya Loknya, Cherkasskoye Porechnoye and Kositsa in Kursk, bringing its troops closer to taking back the Ukraine-held town of Sudzha, about 10 kilometres (six miles) away.\n\nUkraine launched its incursion into Kursk last August, seizing territory as a buffer zone. But since then, Russia has taken back more than two-thirds of the territory.\n\nA Russian army commander, Apti Alaudinov, wrote on Telegram on Saturday that “all units have launched a large-scale offensive across all areas on the Kursk section of the front”.\n\nA Russian military blogger, Yevgeny Poddubny, on Sunday wrote that the Kursk incursion “is in its final phase”. Prominent Ukrainian journalist Yuriy Butusov wrote on Sunday that holding onto the Kursk territory was no longer tactically justified.\n\nGas pipe\n\nUkraine’s General Staff on Saturday confirmed reports that Russian special forces had used an underground gas pipe to reach the outskirts of the main town controlled by Ukraine in the region, Sudzha.\n\nKyiv said its aerial reconnaissance had spotted the troops, who were “being detected, blocked and destroyed”. Russian military bloggers wrote that troops crawled some 15 kilometres (nine miles) through a pipe with a diameter of 1.4 metres.\n\nThey hailed the attack as a feat, said the troops had achieved their objective, and that fighting was ongoing in Sudzha. Russia supplied gas to Europe via Ukraine until January of this year and Sudzha was a hub for transferring and measuring gas. Russia also claimed the capture of another village in east Ukraine.\n\nIts troops are advancing in the Donetsk region and are close to crossing a symbolic border into the central Dnipropetrovsk region, which so far has been free of fighting. The defence ministry said troops had taken the village of Kostyantynopil, around 13 kilometres from the regional frontier and 50 kilometres west of the large Russian-held city of Donetsk.\n\nRussia’s advances come as the prospect of peace talks appears increasingly likely, with Ukrainian and US negotiators meeting next week in Saudi Arabia.\n\nUS Middle East envoy Steve Witkoff said his team wanted “to get down a framework for a peace agreement and an initial ceasefire as well” at the talks set for Tuesday.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67ce36d4c104d.gif",
  "retrievedAt": "2025-10-12T01:52:33.634Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896941/russia-claims-counter-offensive-into-ukraines-sumy-region",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:20:13.000Z"
}
