{
  "title": "Locals stranded in GB as snowfall blocks roads - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Thousands of people remained stranded in upper areas of Astore district on Sunday due to blocked main and linking roads due to record snowfall which triggered avalanches a week ago, cutting off several uppers areas from other parts of the country.\n\nDasakram, Chilam, Manimarg, Darle, Kala Pani, Mir Malik, Nanga Parbat Rupal Valley, Parsheng and many other areas of GB remained cut-off, causing serious problems for the people living in those areas like shortage of medicines, food items and no electricity and mobile phone network.\n\nAvalanches in the affected areas badly damaged roads and knocked out power lines.\n\nPeople living in disconnected areas have been forced to bring their patients to hospitals on shoulders or by dragging them on mattresses for miles to hospitals as roads are blocked by layers of snow.\n\nLocal people rescued a patient from Chilum area in Astore and brought him to Astore city hospital by keeping him on the mattress and dragged the mattress on snow for miles.\n\nLocal resident Aqil Hussain Baqiri told Dawn that it is painful to see patients being shifted to and from hospitals and from one area to another on mattresses or on people’s shoulders as stretchers and wheelchairs cannot be used due to heavy snow on roads.\n\nMany patients are still awaiting treatment and medicines in areas cut-off by the massive snowfall and blocked roads.\n\nLocal people said that if immediate rescue measures are not taken, the situation may become more serious. They said the Gilgit-Baltistan government should take steps to restore roads and provide medical facilities, food items and other essential goods to the people trapped in the snow-affected areas on emergency basis.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/101420191d5a95b.jpg",
  "retrievedAt": "2025-10-12T01:53:08.663Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896951/locals-stranded-in-gb-as-snowfall-blocks-roads",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:19:50.000Z"
}
