{
  "title": "Pain haunts two Khyber families after Morocco boat tragedy - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: Profound grief and pain were written large on the faces of the family members of Wali Mohammad and Ajmal Faraz, who went ‘missing’ after the January 2 incident of boat capsizing near Moroccan shores with media report suggesting that as many as 44 Pakistanis were among those, who were perished in the tragedy.\n\nWali Mohammad, 44, Ajmal Faraz, 20, are residents of Ghundi and Gharreeza villages, respectively, of Jamrud tehsil in Khyber tribal district. Their families have no clue about their whereabouts after the last voice contact with them through mobile phone from the ill-fated boat from an undisclosed location before embarking on their fateful journey.\n\nShah Fahad, the teenage son of Wali Mohammad, and Khan Faraz, the father of Ajmal Faraz, told Dawn that both of them pleaded with them for good wishes and prayers for their safe onward journey when they boarded the boat on January 2.\n\nKhan Faraz, however, insisted that his son should send him a video or pictures of the boat they were boarded so that he and his wife could also see the condition of the boat. But he could not get his request fulfilled and heard only his son’s voice message.\n\nRelatives of Wali Mohammad and Ajmal Faraz have no clue of their fate\n\nHe said that it was only a week later that they heard about the boat capsizing incident and since he and his family were waiting impatiently to find any clue about the wellbeing of his son as there was no mention of his son in either list of dead or the survivors.\n\nLatif Abad, a retired FC official and elder brother of Wali Mohammad, also narrated the same ordeal while arguing that their entire family was still waiting for ‘good news’ about the survival of his missing brother.\n\nHe said that both Wali Mohammad and Ajmal Faraz went to Saudi Arabia for Umrah in September 2024 and it was from there that they both decided to try their luck on a perilous voyage to Europe as both had long been cherishing to go abroad and find for themselves some decent source of livelihood.\n\nHe said that it was presumed that both Wali Mohammad and Ajmal Faraz, bearing passport numbers RE0165131 and JH891694,1 respectively, had collectively paid a hefty amount of approximately Rs4 million to their agents, who had gone underground after the boat incident.\n\nLatif said that it was only once that they were able to make a contact with the two agents Rana Liaqat and Qari Usman on their foreign mobile numbers soon after the boat tragedy but since then their mobile phones were permanently switched off.\n\nKhan Faraz told Dawn that though his son had been aspiring to go to Europe since his school days when he was very young, his wife had strongly objected to his desire to go abroad for fear of losing him permanently.\n\nHe said that his son was a salesman in a shop owned by one of his uncles in Peshawar Karkhano Market, as he had abandoned his studies prior to his leaving for Umrah and onward journey to Europe.\n\nWali Mohammad’s teenage son Shah Fahad said that their entire family was deeply distressed and faced persistent grief as they had no idea about the whereabouts or wellbeing of his father while they all prayed for his safety day in, day out.\n\nBoth Latif Abad and Khan Faraz conceded that they had not made any contact with Federal Investigation Agency nor had they approached police in their efforts to trace their missing men.\n\nThey made a passionate appeal to the Prime Minister of Pakistan, the foreign minister, the interior minister and the FIA to help locate their missing relatives, dead or alive.\n\n“We are now so desperate that any news, whether they are God forbids dead or luckily alive, shall reach us so that both our families get some consolation while we pass through a continuous mental torture,” both Khan Faraz and Latif Abad concluded in choked voices while trying to stop tears roll down their cheeks.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cdf5d7191bc.jpg",
  "retrievedAt": "2025-10-12T01:52:36.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896848/pain-haunts-two-khyber-families-after-morocco-boat-tragedy",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:20:38.000Z"
}
