{
  "title": "North Sea tanker and cargo ship collision injures 32 - World - DAWN.COM",
  "author": null,
  "content": "A major rescue operation was under way after a collision between an oil tanker and a cargo ship in the North Sea on Monday, which sparked a huge blaze and left 32 people injured.\n\nThe injured had been brought ashore for treatment “in three vessels”, the Grimsby port director Martin Boyers told AFP, adding that “ambulances were queueing on the quay”.\n\nThe operation was being coordinated by the UK Coastguard after “reports of a collision between a tanker and cargo vessel off the coast of East Yorkshire”, a Coastguard spokesperson said. The spokesman added the Coastguard was assessing the likely counter-pollution response required.\n\nImages on UK television channels showed a huge plume of thick, black smoke and flames rising from the scene about 16 kilometres off the coast.\n\nThere were reports of “fires on both ships” that UK lifeboat services were responding to, the Royal National Lifeboat Institution (RNLI) confirmed to AFP. There were also reports that “a number of people had abandoned the vessels”, RNLI added.\n\nThe International Maritime Organisation confirmed to AFP that “the current focus is on the firefighting and search and rescue operation.”\n\nUK Transport Secretary Heidi Alexander said she was “concerned to hear of the collision between two vessels in the North Sea this morning and am liaising with officials and HM Coastguard as the situation develops”. She also thanked all the emergency services which rushed to the scene.\n\nThe alarm about the collision near the port city of Hull in East Yorkshire was raised at 0948 GMT. A Coastguard helicopter, aircraft, and lifeboats from four towns and other nearby vessels were part of the large rescue operation, the Coastguard added.\n\nSwedish tanker company Stena Bulk confirmed it owned the oil tanker involved in the accident, adding that it was operated by Crowley, a US-based maritime company.\n\nThe tanker was named the Stena Immaculate by the online ship tracking service Marine Traffic, which said the vessel was anchored near its destination, Immingham, near Hull.\n\nIt had travelled from Greece loaded with petroleum products, according to Bloomberg.\n\nThe Associated British Ports (ABP), which operates the Port of Hull and Immingham, said it was “aware” of the incident and was “assisting” the Coastguard. The Marine Traffic shipping tracker said the cargo ship involved was the Portuguese-flagged “Solong”, owned by the German company Reederei Koepping.\n\nVessels with firefighting capabilities have been dispatched to the scene off the northeast coast.\n\nCollisions remain rare in the busy North Sea. In October 2023, two cargo ships, the Verity and the Polesie, collided near Germany’s Heligoland islands in the North Sea. Three people were killed and two others are still missing, considered dead.\n\nThe Isle-of-Man-flagged Verity, which was carrying steel from the northern German port of Bremen to Immingham, sank.\n\nIn October 2015, the Flinterstar freighter — carrying 125 tonnes of diesel and 427 tonnes of fuel oil — sank after colliding with the Al Oraiq tanker 8km off the Belgian coast on October 6, 2015.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/102002305703260.jpg",
  "retrievedAt": "2025-08-25T15:04:58.983Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897049/north-sea-tanker-and-cargo-ship-collision-injures-32",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T15:06:58.000Z"
}
