{
  "title": "Djokovic crashes out at Indian Wells as Alcaraz sails through - Sport - DAWN.COM",
  "author": null,
  "content": "INDIAN WELLS: Five-time champion Novak Djokovic tumbled out of the Indian Wells ATP Masters on Saturday, falling in his first match to lucky loser Botic van de Zandschulp as two-time defending champ Carlos Alcaraz advanced.\n\n“No excuses for a poor performance,” 24-time Grand Slam champion Djokovic said after 37 unforced errors in a 6-2, 3-6, 6-1 defeat.\n\n“It doesn’t feel great when you play this way on the court,” he added. “But congratulations to my opponent — just a bad day in the office, I guess, for me.”\n\nDjokovic is just the latest in van de Zandschulp’s string of superstar victims.\n\nHe stunned Alcaraz at the US Open last year before beating Rafael Nadal in Davis Cup in what proved the Spanish great’s last match.\n\n“I think I kept my cool during the whole match,” said van de Zandschulp. “I know if I go into the match and lose my cool, especially against the big players, it’s going to be a really tough day. That’s always one thing I’m trying to do well.”\n\nAfter 14 unforced errors in the first set, Djokovic cleaned things up in the second, grabbing a quick break on the way to a 3-0 lead.\n\nDjokovic pumped his fist after belting a forehand winner to the corner for his first break chance of the match and after consolidating the break nodded his head in satisfaction.\n\nThe rallies remained tense affairs and Djokovic’s frustration was clear at times, but after he was broken when serving for the set he closed it out on his next service game.\n\nIt was only a brief respite. Van de Zandschulp kept the pressure on both from the baseline and at the net and Djokovic’s errors began to pile up again.\n\nVan de Zandschulp took control with a break for 3-1, reeling off the last five games as Djokovic was unable to stop the bleeding.\n\n“The first three games, four games of the third set were quite close,” Djokovic, seeded sixth, said.\n\n“Had my chances. Was just some awful mistakes.”\n\nItalian Matteo Arnaldi sprung another upset, beating seventh seed Andrey Rublev 6-4, 7-5. Djokovic and Rublev followed top seed Alexander Zverev and fourth seed Casper Ruud as second-round casualties.\n\nWith Zverev out and world number one Jannik Sinner serving a three-month drugs ban, world number three Alcaraz is the highest seed left in the men’s draw.\n\nAlcaraz, trying to join Djokovic and Roger Federer as the only men to win three straight Indian Wells titles, eased into his defence with a 6-4, 6-2 victory over France’s Quentin Halys.\n\nHe admitted he was feeling some nerves to start the match, but they evaporated amid a strong all-around performance.\n\nOne early break staked Alcaraz to the first set. He roared to a 4-0 lead in the second behind a formidable service display and wrapped up the win in 67 minutes.\n\n“I was nervous at the beginning of the match,” he told a supportive crowd. “The first match is never easy so I was trying to be focused on my game.\n\n“I just tried to be relaxed, as relaxed as I can. Can always be better, but I’m ready for the [next] round and excited.”\n\nWomen’s world number one Aryna Sabalenka opened her campaign with a 7-6 (7-4), 6-3 victory over rising US talent McCartney Kessler.\n\nMadison Keys, who denied Sabalenka a third straight Australian Open title as she claimed her long awaited first Grand Slam in Melbourne, subdued hard-hitting Russian Anastasia Potapova 6-3, 6-0 in her first match since then.\n\nAmericans Taylor Fritz and Coco Gauff — seeded third in their respective draws, both advanced.\n\nFritz, the 2022 men’s champion, defeated Italian qualifier Matteo Gigante 7-5, 6-3.\n\nGauff survived 21 double faults to claw out a 6-3, 3-6, 7-6 (7-4) victory over Japan’s Moyuka Uchijima.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67ce26925d38e.gif",
  "retrievedAt": "2025-10-12T01:52:50.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896938/djokovic-crashes-out-at-indian-wells-as-alcaraz-sails-through",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:20:04.000Z"
}
