{
  "title": "Musk backs US’ Nato exit as EU faces new reality - World - DAWN.COM",
  "author": null,
  "content": "BRUSSELS: Elon Musk, senior adviser to US President Donald Trump, has supported the US exit from Nato, saying on his social media platform that it “doesn’t make sense for America to pay for the defence of Europe.”\n\nDespite verbal broadsides by President Donald Trump and Musk against Nato and the EU, the European Commission chief Ursula von der Leyen said on Sunday the bloc still sees the United States as “allies”.\n\nThe senior adviser to US President Donald Trump was responding to a post on X early Sunday that asserted the US should “Exit Nato now!”\n\n“We really should,” the billionaire co-founder and chief executive officer of Tesla said.\n\nEuropean Commission chief hopes ‘common interests outweigh differences’ with Washington\n\nMusk’s comments came at a time when the future of the North Atlantic Treaty Organisation (Nato), which will mark its 76th anniversary in April, hung in the balance.\n\nTrump has repeatedly threatened to slap tariffs on the Euro­pean Union, and his alignment with Russia on Ukraine has deeply unsettled European officials.\n\nThe US leader has also thrown up questions about US security commitments to Europe under the Nato umbrella.\n\nVon der Leyen was asked in a news conference if she saw a need to redefine Brussels’s approach to Washington, to which she said the answer was “a clear no”.\n\n“Yes, there are differences … but if you look at the common interests that we have, they always outweigh our differences,” she said, adding: “We will have our differences. We have to sort them out.”\n\nVon der Leyen, speaking in general terms, stated that in the world today “everything has become transactional”.\n\nThere was a growing sense of urgency within the 27-nation EU because “something fundamental has shifted. Our European values — democracy, freedom, the rule of law — are under threat,” she said.\n\nWhen questioned specifically about the future of the transatlantic relationship with the US, von der Leyen said that, while an allied bond persisted, “this does not mean that the pattern that we had the last … 25 to 30 years … is still the right one”.\n\nShe stated that the changing tone of US ties was “a very strong wake-up call, and Europe’s moment now really [is] to step up in defence and giving ourselves the posture that we need”.\n\nThe bloc has already sent a clear signal it is moving in that direction, with an EU summit on Thursday agreeing to mobilise about 800 billion euros to boost defence spending, which has long been urged by Washington, the EU chief said.\n\n“We are allies, but this means that all allies have to take their responsibilities,” she said. Von der Leyen added that within the “next weeks”, she would call the bloc’s first-ever meeting of EU commissioners focused on “external and internal security, to energy, defence and research” and including cybersecurity, trade and “foreign interference”.\n\nPublished in Dawn, March 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:05:37.896Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896886/musk-backs-us-nato-exit-as-eu-faces-new-reality",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T01:19:44.000Z"
}
