{
  "title": "Monsoon threat to persist by August end, NDMA  warns ; relief, search operations intensify",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP):National Disaster Management Authority (NDMA) Chairman Lt Gen Inam Haider on Monday warned that monsoon conditions will remain precarious until the end of August, with normalization expected by late September.\nSpeaking at a joint press briefing with Information Minister Attaullah Tarar and Climate Change Minister Dr Musadik Malik, NDMA chief stated that the ongoing monsoon spell is expected to subside by Friday. However, he warned that the country remains at risk of further torrential downpours, with two to three additional spells likely in the coming weeks. Last spells will be ended by September 10. He added that the overall situation is expected to normalize by the end of September.\nThe NDMA chief revealed that the ongoing monsoon season—has triggered 670 deaths and over 1,000 injuries, with 80 to 90 individuals still missing. Search operations are underway, and if the missing are not found, they will be added to the official death toll.\nMore than 425 relief camps have been set up in flood-hit areas, offering essential supplies and medical care. Displaced families are also being accommodated in government buildings, including schools. Food distribution under the Prime Minister’s Ration Programme is ongoing, in coordination with provincial governments and relevant authorities.\nLt Gen Haider said special Army units have been deployed on the directions of the Chief of Army Staff (COAS), critically injured individuals were being airlifted to hospitals. Field ambulances are actively transporting patients, and major hospitals are fully engaged. The National Emergencies Operation Center (NEOC) remains on high alert, continuously releasing multi-source data to support relief efforts.\nPakistan Army Aviation bases have activated reserve systems to support emergency evacuations during the ongoing monsoon emergency. Severely injured individuals will be airlifted to major hospitals, while large Combined Military Hospitals (CMHs) across the country have been placed on high alert.\nThe NDMA is coordinating closely with the Armed Forces and provincial authorities to ensure swift medical response and logistical support in flood-hit regions.\nHe said climate change is accelerating glacial melt, unleashing water and debris that inundate low-lying areas and damage vital infrastructure. Rehabilitation of roads, bridges, and essential services is in progress.\nThe NDMA chief added that the losses survey in Gilgit-Baltistan has been completed, and consolidated damage data will be shared by September 10. Rain-related damage assessments are being compiled through an integrated mechanism involving federal and provincial departments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:50:39.622Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/monsoon-threat-to-persist-by-august-end-ndma-warns-relief-search-operations-intensify/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T22:10:00.000Z"
}
