{
  "title": "UK’s BRAVE Programme transforms flood-hit school in Badin into a safe haven for learning and shelter",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP):In the aftermath of the devastating 2024 floods that swept away homes and halted education across Badin, Government Girls Primary School (GGPS) Chanri has emerged as a symbol of resilience.\nThe GGPS Chanri, once ill-equipped to handle repeated disasters, has been transformed into a safe space for learning and shelter through UK support under the BRAVE (Building Resilience and Addressing Vulnerability in Emergencies) programme.\nThe 2024 floods were not the first to batter Chanri village. Each time disaster struck, families sought refuge in the school, with up to 175 people crammed into its limited space. But conditions were dire. “There were no toilets, no clean water, no lights,” recalled teacher and activist Faheem Ali Memon. “Women and children suffered the most.”\nThat reality has now changed. Through the BRAVE programme, implemented with Concern Worldwide and the SAMI Foundation, the school has been upgraded with working toilets, handwashing stations, and a hand pump for clean drinking water. A 5KW solar power system keeps lights and fans running even during outages, allowing families to stay cool, safe, and connected in emergencies.\nThese improvements have gone beyond disaster response as they have revitalised education. Hygiene sessions led by the school’s Hygiene Club are instilling healthy practices in children, who in turn share them with their families. Enrollment has risen by 20 percent, with more girls attending regularly.\n“This support has brought back our dignity,” said Mairaj, a local elder. “Now, when floods come, our women and children have a clean, private place to stay. It’s more than a shelter- it gives us strength.”\nTalking to APP, Headmistress Ms. Reeta praised the changes, noting that the upgrades have strengthened both learning and disaster preparedness. “The UK-supported upgrades were a blessing. Now we have electricity, water, and sanitation all the time. We can even stay connected during disasters and receive early warnings.”\nFor the people of Chanri, GGPS is no longer just a school. It is a beacon of safety, a centre of learning, and a place where hope is rebuilt. In a district where floods often bring fear and displacement, the BRAVE programme has shown how targeted support can safeguard futures.\nThis year’s monsoon rains continue to threaten communities across the country, but BRAVE remains active, supporting vulnerable areas and standing ready to mobilise a national-level response if disaster strikes again.\nGGPS Chanri’s journey reflects what is possible when immediate relief is paired with long-term planning: a community strengthened, dignity restored, and futures protected.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:50:59.532Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/uks-brave-programme-transforms-flood-hit-school-in-badin-into-a-safe-haven-for-learning-and-shelter/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T21:12:00.000Z"
}
