{
  "title": "OGDCL completes Jhal Magsi development project as per PM’s instructions",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP):Oil and Gas Development Company Limited (OGDCL) has announced the successful completion and commissioning of the Jhal Magsi development project, alongside the launch of a series of Corporate Social Responsibility (CSR) initiatives in the remote Jhal Magsi district of Balochistan.\nThe initiative was undertaken in compliance with Prime Minister Muhammad Shehbaz Sharif’s directives for the fast-track development of Jhal Magsi district.\nThe fast-track development was made possible through incentives approved by the government, said a news release of  the OGDCL.\nThe project is currently producing around 14 Million Standard Cubic Feet per Day (MMSCFD) of pipeline-quality gas and 45 Barrels per Day (BPD) of condensate.\nThe gas has been injected into the Sui Southern Gas Company Limited (SSGCL) network through a newly built 98-kilometer pipeline constructed by SSGCL from the Jhal Magsi field to its tie-in point.\nDevelopment work on the project began in February 2024 after the government of Pakistan approved incentives, including the conversion from the 1997 Petroleum Policy to the Marginal Field Gas Pricing Policy.\nThe project was accorded high priority to address the country’s energy needs and was completed on an accelerated timeline despite various technical and territorial challenges.\nThe scope of work included the installation of an Amine Unit, Dehydration Unit, Hot Oil Package, power generation facilities, and gathering systems.\nThe Jhal Magsi Field consists of two wells and is a joint venture operated by OGDCL, which holds a 56 percent working interest. Pakistan Oilfields Limited (POL) holds 24 percent, while Government Holdings Private Limited (GHPL) has 20 percent.\nAs part of its community development efforts, OGDCL has launched several Corporate Social Responsibility (CSR) initiatives in the Jhal Magsi district.\nThese include the construction of the OGDCL Grammar School (50 percent completed) and a Mother & Child Health Care Facility in collaboration with Indus Hospital (60 percent completed).\nThe company has also built 84 climate-resilient houses, awarded fully funded four-year scholarships to students at Sukkur IBA, and provided technical training to 55 local youth through NAVTTC, with 30 already trained and 25 in progress.\nTo improve healthcare facilities in the remote district, OGDCL has gifted two ambulances, organised annual free eye camps, and provided ration bags to 800 families.\nFurthermore, two RO plants and an underground water tank have been installed to ensure clean drinking water. OGDCL has also sponsored the Jhal Magsi Desert Rally to support local culture and sports.\nThe successful commissioning of the Jhal Magsi Development Project, along with OGDCL’s CSR initiatives, reflects the company’s commitment to national energy security and community development in its operational areas.\nThese efforts are in line with Prime Minister Muhammad Shehbaz Sharif’s instructions to accelerate development in remote areas, ensuring that local communities benefit directly from national resource development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:50:36.394Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ogdcl-completes-jhal-magsi-development-project-as-per-pms-instructions/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-19T00:15:00.000Z"
}
