{
  "title": "ITP intensifies enforcement drive, over 9,400 violations penalized; 287 rickshaws impounded in one week",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP):Islamabad Traffic Police (ITP) took strict action against more than 9,400 traffic violations during the past week as part of its rigorous enforcement campaign against motorists and motorcyclists flouting traffic laws.\nA police spokesperson told APP on Monday that during the week-long drive, action was taken against 1,433 vehicles and motorcycles, with 873 motorbikes and 560 vehicles shifted to police stations for serious violations committed during driving.\nHe said 535 motorists were fined for lane violations, 53 for driving without a licence, 1,556 for illegal parking, and 630 for driving against the traffic flow.\nHe said action was also taken against 828 vehicles with fancy number plates, 713 drivers involved in signal violations, 797 motorcyclists riding without helmets, and 52 vehicles operating without fitness certificates. To curb overloading of heavy transport, 2,738 challans were issued.\nAccording to the spokesperson, rickshaws remain prohibited in the federal capital and 287 rickshaws were impounded for violation. The enforcement teams also utilised drone technology, issuing 73 challans and providing awareness to 45 drivers.\nCTO Captain (R) Zeeshan Haider directed that indiscriminate action must continue under the special campaign.\nHe instructed traffic officials to adopt a zero-tolerance policy against underage drivers and those without licences. “Strict legal action will be taken against one-wheelers and stunt performers,” he said, urging citizens to cooperate with traffic personnel and prove themselves responsible citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:50:40.500Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/itp-intensifies-enforcement-drive-over-9400-violations-penalized-287-rickshaws-impounded-in-one-week/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-18T21:20:00.000Z"
}
