{
  "title": "Flash flooding likely in tributaries in river Kabul, hill torrents of D G Khan in next 24 hours: FFD",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP): The Flood Forecasting Division (FFD) Lahore has predicted flash flooding in the tributaries of river Kabul and hill torrents of DG Khan Division & Nullahs of Eastern Balochistan during the next 24 hours.\nNullahs of river Ravi and Jhelum (downstream) are also likely to attain low to medium level flows while low flood is also likely in River Ravi at Shahdara during the said period.\nFederal Flood Commission (FFC) said that River Indus is flowing in medium flood at Tarbela, Kalabagh, Chashma and Taunsa and low flood at Guddu.\nAccording to daily FFC report on Monday, River Kabul is also experiencing low flood with rising trend at Warsak while River Ravi is in low flood with rising trend at Jassar.\nMeanwhile, River Sutlej is flowing in low flood with falling trend at Ganda Singh Wala and Sulemanki.\nWater Level in Tarbela Reservoir is at elevation of 1546.60 feet, which is just 3.40 feet below its maximum conservation level (MCL) of 1550 feet. Mangla Reservoir stands at 1213 feet which is 29 feet below its MCL of 1242 feet.\nThe combined live storage of Tarbela, Chashma and Mangla reservoirs stands at 10.657 MAF, which is about 80.03 % of the total available live storage capacity of 13.316 MAF.\nThe FFD, Lahore has predicted scattered thunderstorm/rain of moderate intensity with isolated heavy fall over Islamabad, Punjab (Rawalpindi, Gujrat, Gujranwala, Lahore, Sahiwal, Multan, DG Khan and Bahawalpur Divisions) and Sindh Province including the upper catchments of rivers Indus and Jhelum. Isolated thunderstorm/rain with one or two heavy falls may also occur over upper catchments of rivers Chenab, Ravi and Sutlej including Eastern Balochistan, Sargodha and Faisalabad Divisions during the next 24 hours.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:51:24.332Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/flash-flooding-likely-in-tributaries-in-river-kabul-hill-torrents-of-d-g-khan-in-next-24-hours-ffd/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-19T04:58:00.000Z"
}
