{
  "title": "Pakistan, Nepal can broaden collaboration in gender equality, SDGs, climate change: Romina",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP): Parliamentarians from Nepal and Pakistan on Monday vowed to boost synergies for joint efforts and experience sharing in areas of gender mainstreaming and climate justice as both the nations face similar challenges due to climate change, environmental degradation, and disaster resilience.\nThe Sustainable Development Policy Institute (SDPI) and Friedrich-Ebert-Stiftung (FES) Pakistan jointly hosted a welcome lunch and interactive session with visiting Nepali parliamentarians and officials and their Pakistani counterparts, focusing on advancing gender-responsive budgeting, climate justice, and regional cooperation on sustainable development, said a press release.\nDr. Sajid Amin Javed, Deputy Executive Director SDPI, welcomed the Nepali delegation and extended warm regards from SDPI’s Executive Director Dr. Abid Qaiyum Suleri. He underscored the importance of mainstreaming gender in development planning and stressed that “no justice is complete without gender justice.”\nIn her special remarks, Romina Khursheed Alam, Prime Minister’s Coordinator for Climate Change and Environmental Coordination, highlighted the importance of joint regional action. “Pakistan and Nepal can broaden their collaboration in diverse areas, particularly gender equality, SDGs, and climate change,” she said.\nRecalling her work with the Asian Forum for Population Development, she emphasized the need for synergies across South Asia, noting that children and youth must be central to any gender matrix. “Women are change-makers and leaders, and we must lead this drive together,” she added, proposing the creation of a South Asian Parliamentarians’ Group to foster knowledge sharing and joint solutions.\nHead of the Nepali delegation, Nagina Yadav, Nepalese Parliamentarian hailing from Nepali Congress Party expressed gratitude to SDPI for hosting the dialogue and voiced solidarity with Pakistan over the tragic losses from recent cloudbursts in Khyber Pakhtunkhwa.\n“Nepal is also facing the same risks from climate-induced disasters. Women and children are the most vulnerable and should be prioritized in development initiatives,” she said. She underscored cultural affinities between Pakistan and Nepal, expressing confidence that joint initiatives would deliver impressive regional impacts.\nDr. Shafqat Munir, Deputy Executive Director of SDPI, moderated the discussion, while officials from the Prime Minister’s Secretariat, including Deputy Secretary, PM Secretariat, Naeem Saleem, also participated.\nThe visiting Nepalese Women Parliamentarians Delegation included Nagina Yadav, Puja Chaudhary, Sarita Bhusal and Gaura Nepali, founder Chairperson, Center for Dalit Women in Nepal, and Laxmi Ghimire, Under Secretary in the National Planning Commission (NPC). Felix Kolbitz, Country Director, Friedrich-Ebert-Stiftung Pakistan Office and Member National Assembly from Pakistan Peoples Party, Dr Shazia Sobia Aslam Soomro were also present on the occasion.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:49:48.932Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-nepal-can-broaden-collaboration-in-gender-equality-sdgs-climate-change-romina/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-19T01:57:00.000Z"
}
