{
  "title": "NDMA issues travel advisory as landslides cut off northern routes",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP):The National Disaster Management Authority (NDMA) has urgently advised against travel to northern Pakistan, especially Gilgit-Baltistan, following severe landslides and flash flooding caused by continuous monsoon rains.\nThe advisory calls on citizens to avoid non-essential travel to affected areas and warns against using unsafe alternate routes.\nNDMA officials stressed the importance of prioritizing personal safety and urged travelers to refrain from movement on damaged roads and hazardous detours.\nHeavy rainfall has severely disrupted transport infrastructure across Gilgit-Baltistan, leaving several key roads and bridges impassable.\nIn Ghanche District, the collapse of Somro and Saltoro bridges has cut off access to surrounding areas. In Skardu, the Baghicha Bridge has sustained damage, and although an alternate route exists, authorities have deemed it unsafe for travel. In the Ghizer region, roads from Diyan and Thale Broq to Ghizer are closed, with no viable detours available.\nRoads in Shandur, Khaltai, Dain, and Ishkoman remain fully blocked, while routes from Hopper to Nagar, Gulmit to Gojal, and Gilgit to Jaglot are also inaccessible.\nIn Astore, the Chilm Road is closed, with limited access possible only via Deosai. Additionally, roads from Thangol Nala to Shigar and from Kargil to Kharmang have been shut to traffic.\nThe Karakoram Highway has been severely affected by glacial floods and landslides, particularly in Gulmit, Gojal, and Hunza. Several bridges have been buried under debris, stranding travelers and disrupting trade with China via the Khunjerab Pass.\nNDMA is actively coordinating with federal and provincial agencies to ensure timely dissemination of information and facilitate emergency preparedness. Law enforcement agencies have been directed to enforce travel restrictions, and Section 144 may be imposed in high-risk zones if necessary.\nCitizens are strongly advised to avoid travel to flood-affected regions, refrain from using unverified or unsafe alternate routes, and follow instructions issued by local authorities. The public is also urged to cooperate with law enforcement and rely only on official sources for updates.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:51:04.828Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ndma-issues-travel-advisory-as-landslides-cut-off-northern-routes/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-19T06:24:00.000Z"
}
