{
  "title": "Elements involved in APP corruption case tried to exert political pressure: Tarar",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Monday said the Federal Investigation Agency (FIA) had registered an FIR in the Associated Press of Pakistan (APP) corruption case after completing a detailed inquiry that confirmed the gravity of the offense.\nSpeaking at a meeting of the National Assembly’s Standing Committee on Information and Broadcasting, chaired by MNA Pullain Baloch at PEMRA Headquarters, he said that FIA’s process differs from routine police complaints, requiring thorough investigation to establish cognizable offenses.\nThe minister said those involved had attempted to use political influence to secure reinstatement, but the APP management, under its managing director, took decisive action to resist pressure and ensure accountability. He praised the Managing Director, APP, Muhammad Asim Khichi for his integrity and dedication, noting that despite immense pressure, he actively opposed corruption and took decisive action to address the issue.\nThe minister assured that strict action would be taken without discrimination. The investigation is ongoing, with continuous coordination between the ministry and FIA to ensure accountability and transparency. “No one will be spared under political pressure,” he stressed. He said that he was personally in contact with FIA to take strict action without bias.\nTarar also briefed the committee on the financial challenges faced by Pakistan Television (PTV) after the withdrawal of subsidies, pointing out the heavy costs of hiring foreign producers, commentators, and equipment for broadcasting international cricket series. However, he noted that PTV Sports’ ratings remained “twice as high” as private sports channels, underlining its national role as the state broadcaster.\nTarar also noted that PTV was giving full coverage to opposition parties, with political representatives and analysts from all sides invited to programs, which were not edited or censored.\nHe added that PTV Home is being considered for outsourcing, while PTV World is undergoing a complete revamp to meet modern broadcasting standards.\nThe minister appealed to the committee to consider the necessity of downsizing and restructuring PTV’s workforce.\nOn employees’ welfare, the minister said merit-based reforms are being introduced in PTV, and efforts are being made to ensure timely payment of salaries and pensions.\nAttaullah Tarar, drew attention to television channels’ “corporate social responsibility,” observing that most public service messages were aired after midnight to fulfill regulatory requirements, while peak viewing hours were reserved for paid advertisements. He stressed that such messages should be broadcast during the day for maximum public impact.\nThe committee members expressed concern over delays in PTV employees’ salaries and pensions, warning the situation could worsen if not addressed urgently.\nOfficials from the Ministry of Information and Broadcasting informed the committee that salaries and pensions had been cleared till June 30, 2025. They said the discontinuation of the Rs 35 license fee had deepened the financial crisis, but on the Prime Minister’s directions, the Finance Division had committed Rs 11 billion annually, to be released quarterly. They acknowledged that arrears were still pending but assured that PTV’s financial system was under review.\nChairman Pullain Baloch said that the issue had been raised repeatedly over the last several sessions. He instructed that a comprehensive briefing on employees’ salaries be presented in the next meeting.\nThe committee, discussed various agenda items, including briefings on constitution of PEMRA Council of Complaints; briefing by PEMRA on recommendations of Sub Committee on “The Pakistan Electronic Media Regulatory Authority (Amendment) Bill 2024 (Private Members Bill)”; regulation of Web-TVs and Over-the-Top (OTT) platforms; corporate social responsibility of PEMRA licensees and Regulation of commercial and non-commercial FM radio licenses.\nThe committee also discussed recommendations of the subcommittee on the PEMRA Amendment Bill 2024. Chairman PEMRA, Saleem Baig, said the authority agreed with the proposals after consultations with producers and stakeholders. He stressed that excessive censorship would limit diversity, and that pre-screening of dramas before airing was not practical.\nMNA Asia Naz Tanoli said the goal was not to impose blanket restrictions but to ensure media reflected social realities. She suggested including a representative from the advertising sector in PEMRA’s Council of Complaints. Mehtab Akbar Rashdi emphasized the need for dramas to address pressing social issues.\nThe committee also took up the issue of regulating Web TV and OTT platforms. PEMRA officials explained that rules had yet to be finalized and until then, such platforms could not be regulated. Chairman PEMRA said the draft rules had been with the Cabinet Committee on Legislative Cases (CCLC). The Information Secretary added that the rules were sent back by CCLC for improvements and had since been resubmitted.\nShe explained that since the Information Ministry is not the competent authority to approve them independently, the revised draft will first go back to the CCLC for clearance before being presented to the federal cabinet. She added that while the exact timeframe depends on how long the CCLC takes to address its reservations, the ministry is actively following up to ensure progress, and final approval rests with the cabinet.\nOn FM radios, PEMRA officials informed the committee that 171 commercial and 68 non-commercial licenses had been issued, with all commercial stations currently operational.\nRegarding the recent incident of journalist Khawar Hussain’s death in the Sanghar district, Federal Minister for Information and Broadcasting Attaullah Tarar assured the committee that he would personally call IG Sindh police about this matter and would submit a report in the next committee meeting.\nChairman Pullain Baloch and other members of the committee extended their congratulations to the Information Minister and the Secretary Information on being recently conferred with civil awards. The committee acknowledged their contributions to the field of information and media.\nThe meeting concluded with Fateha for those who lost their lives in recent floods in KPK, Kashmir and Gilgit-Baltistan.\nThe meeting was attended by Attaullah Tarar, Federal Minister for Information and Broadcasting, Parliamentary Secretary for Information and Broadcasting Barrister Daniyal Chaudhry, MNAs; Nadeem Abbas, Kiran Imran Dar, Asia Naz Tanoli, Mehtab Akbar Rashdi, Sehar Kamran, Rana Ansar , Asif Khan, Syed Amin Ul Haque, Muhammad Moazzam Ali Khan, Secretary M/o Minister for Information and Broadcasting, Ambreen Jan, Chairman PEMRA, Muhammad Saleem and officers of concerned departments under ministry.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:49:02.212Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/elements-involved-in-app-corruption-case-tried-to-exert-political-pressure-tarar/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-19T04:38:00.000Z"
}
