{
  "title": "First Caravan of Pakistani motorcycle tourists receives warm welcome in Tajikistan",
  "author": null,
  "content": "ISLAMABAD, Aug 18 (APP): The State Committee for Tourism Development, Tajikistan warmly welcomed the first caravan of Pakistani motorcycle tourists as part of their land journey across Central Asia.\nAn official farewell ceremony for the group of 14 Pakistani motorcyclists was held in Islamabad prior to their departure.\nUpon arrival in Tajikistan, the “Friendship Caravan” was introduced to the cultural and historical landmarks of the ancient city of Khujand, said a release issued here on Monday.\nThe guests had the opportunity to admire its rich heritage and traditions.\nIn Dushanbe, the Pakistani motorcyclists planted a symbolic “Tree of Friendship” on Dusti Square, next to the monument to Shah Ismail Somoni. This gesture stands as a symbol of the strategic partnership and friendly relations between Tajikistan and Pakistan.\nThe program of the tour continues in Dushanbe, where the guests are exploring the capital’s historical, cultural, and tourism opportunities.\nFollowing their stay in the capital, the caravan will continue its journey to the Childara and Darvaz regions.\nThe visit of the motorcycle caravan is receiving wide coverage on Tajik state television and media platforms, underscoring the importance of people-to-people exchanges and cultural diplomacy.\nAll events of this historic tour are jointly organized by the State Committee for Tourism Development under the Government of the Republic of Tajikistan together with the executive authorities of the city of Dushanbe, the Khatlon, Sughd, and Gorno-Badakhshan Autonomous Regions.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-20T04:49:03.716Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/first-caravan-of-pakistani-motorcycle-tourists-receives-warm-welcome-in-tajikistan/",
  "dateList": "2025-08-18",
  "date_published": "2025-08-19T03:43:00.000Z"
}
