{
  "title": "Prisoner killed, two wounded in attack inside Khairpur Central Jail - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: A prisoner was killed and two others were wounded on Khairpur Central Jail premises when five armed men opened fire at inmates as they disembarked from a van and were walking towards the inner gate of the jail on Tuesday.\n\nJail sources said that the five armed attackers, who had surprisingly managed to get past security at the gate of the outer boundary wall of the jail, hid themselves near the main gate.\n\nAs soon as the van passed through this gate and the prisoners disembarked the attackers start­ed shooting indiscriminately at them, killing Hashim Rind on the spot and seriously wounding two others, Imamuddin Rind and Sikandar Gopang, they said.\n\nThey said the jail police fired back at the attackers and managed to arrest one of the suspects, Wahab Rind, after he fell injured.\n\nPolice shifted the wounded prisoners and the assailant to Khairpur Civil Hospital for treatment.\n\nKhairpur SSP Hassan Sardar Niazi, DIB Incharge Ali Gul Mallah and SHO A-Section police station visited the crime scene and gathered details from the police officials and prisoners about the attack.\n\nThe prisoner’s body was handed over to his family after post-mortem examination at the hospital.\n\nThe sources said that it was inexplicable how the suspects managed to get past the security at the jail’s outer gate along with their weapons, remained hidden on the jail premises for quite some time till the jail van brought back the prisoners from district court and easily fled without getting caught.\n\nHashim Rind and Imamuddin Rind were in the jail facing charges of murdering a jail police official Alam Khan Rind’s son Nasir Hussain Rind, who was brutally killed in Sunhro Rind village three months ago.\n\nEarlier, efforts were made by different people to settle the dispute between the two groups of Rind community but the jail police official Alam Khan Rind, refused.\n\nOn Tuesday, Hashim and Imamuddin went to the district court to appear in the Nadir Hussain murder case, when the attacker, Wahab Rind, and his four associates, sneaked into the jail and attacked the litigants on their return to the jail.\n\nThe attack had raised fears of further bloodshed as people of both groups had taken up positions in their areas.\n\nAlam Khan Rind was not available for comments and no other police official responded to calls made by the reporter to seek their version.\n\nPublished in Dawn, June 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:45:21.104Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919829/prisoner-killed-two-wounded-in-attack-inside-khairpur-central-jail",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T00:03:11.000Z"
}
