{
  "title": "Vaccinations stall globally as Pakistan sees 2nd highest number of zero-dose children in South Asia - Pakistan - DAWN.COM",
  "author": null,
  "content": "Life-saving childhood vaccination coverage has stalled in recent decades, leaving millions of children at risk for deadly diseases with Pakistan having the highest number of children with zero doses in South Asia after India, according to a new study by British medical journal Lancet.\n\nThe Lancet is a 200-year-old peer-reviewed weekly medical journal from the United Kingdom. Since its launch, the journal has expanded into a family of more than 20 speciality journals and has set up several global Lancet Commissions on various important issues in medicine and healthcare.\n\nIn a press release issued a day ago, the journal said that since its inception in 1974, the World Health Organisation’s Essential Programme on Immunisation (EPI) achieved “unprecedented progress”, averting the deaths of an estimated 154 million children worldwide through routine childhood vaccination.\n\nHowever, it said that as per a major new analysis from the Global Burden of Disease Study Vaccine Coverage Collaborators, “Despite the progress of the past 50 years, the last two decades have also been marked by stagnating childhood vaccination rates and wide variation in vaccine coverage.\n\n“These challenges have been further exacerbated by the COVID-19 pandemic, leaving millions of children vulnerable to preventable diseases and death.”\n\nThe authors of the study, titled: “Global, regional, and national trends in routine childhood vaccination coverage from 1980 to 2023 with forecasts to 2030: a systematic analysis for the Global Burden of Disease Study 2023”, said that the latest estimates should be taken as a “clear warning” that global immunisation targets for 2030 would not be achieved without “transformational improvements in equity”, according to the press release.\n\nIn 2019, the WHO set ambitious goals for improving vaccine coverage globally through the Immunisation Agenda 2030.\n\nAccording to data from 2023, which the analysis is based upon, more than half of the world’s 15.7 million unvaccinated children were living in just eight countries, with 53 per cent in sub-Saharan Africa and 13pc in South Asia.\n\n“Despite the monumental efforts of the past 50 years, progress has been far from universal. Large numbers of children remain under and un-vaccinated,” senior study author Dr Jonathan Mosser from the University of Washington’s Institute for Health Metrics and Evaluation (IHME) was quoted as saying.\n\nThe journal pointed out that the Covid-19 pandemic exacerbated challenges with global coverage rates of the original EPI-recommended vaccines declining sharply beginning in 2020, resulting in an estimated 15.6m children missing the full three doses of the diphtheria-tetanus-pertussis vaccine or a measles vaccine between 2020 and 2023, as well as 15.9m children not receiving any polio vaccine and 9.18m missing out on the tuberculosis vaccine.\n\n“The Covid-19 pandemic also reversed previous gains in reducing the number of unvaccinated zero-dose children globally, which peaked at 18.6m before falling to 15.7m by 2023. The study estimates that disruptions to immunisation services during the Covid pandemic resulted in around 12.8m additional unvaccinated zero-dose children globally during the four pandemic years (2020-2023).”\n\nIt stressed that “accelerated progress” would be necessary to achieve the 2030 target of halving the number of zero-dose children compared to 2019 levels, with only 18 of 204 countries and territories estimated to have already met this target as of 2023.\n\nIt added that population pressures would also add a “double burden to already overstretched healthcare systems that are ill-equipped to handle the substantial growth in vaccine target populations”.\n\nThe study’s authors called for more concerted efforts to tackle vaccine misinformation and hesitancy to increase vaccine acceptance and uptake.\n\nThe study also found that Pakistan had the highest number of children with zero doses of vaccines after India in South Asia, with 419,000 children falling into that category.\n\n“Increasing numbers of wild-type polio cases have been reported in Pakistan and Afghanistan,” the press release stated.\n\nLast month, the Pakistan Polio Programme launched the third drive of the year against the crippling disease at the National Emergency Operations Centre.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress.\n\nIn April, in a bid to support routine vaccination, Unicef handed over 31 refrigerated trucks to the Federal Directorate of Immunisation, with the support of Gavi, the Vaccine Alliance.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:26:51.963Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920031/vaccinations-stall-globally-as-pakistan-sees-2nd-highest-number-of-zero-dose-children-in-south-asia",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T11:59:50.000Z"
}
