{
  "title": "Three children die after taking poisonous milk in Pindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: A woman was fighting for her life in the emergency of the Holy Family Hospital (HFH) after her three children died apparently due to food poisoning.\n\nHowever, the police have launched an investigation to ascertain the real circumstances in which the tragic incident happened in the limits of Banni police, where Ms Zunaira, 23, and her husband, a sanitation worker, Salam Masih, 25 were residing with their three children.\n\nZunaira Bibi said in her few worded statement recorded with the police that she had put the milk pot in the refrigerator last night. She said that on Tuesday she gave the milk to her children and she also drank a cup. But later their condition started deteriorating and subsequently they were shifted to the Holy Family Hospital HFH) by their neighbours.\n\nThe deceased were four-year-old Minsha, two-and-a-half-year old Novail and eight-month-old baby Marisha.\n\nBodies of children were shifted to mortuary of the hospital for postmortem.\n\nPolice said that the mother of children was stated to be out of danger as she was under treatment in the hospital.\n\nOn the other hand, following the tragic deaths of three children, the City Police Officer Syed Khalid Hamdani has taken notice of the incident and directed the DSP and SHO concerned to launch investigation into the incident.\n\nPolice spokesman said that according to initial investigation the incident happened due to taking poisonous meal or drink. Investigation into the incident was initiated after collecting evidence from the scene.\n\nThe spokesman said that the postmortem of the deceased was conducted, however, the real cause of the deaths could be known after the postmortem report is received.\n\nPublished in Dawn, June 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:45:03.743Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919947/three-children-die-after-taking-poisonous-milk-in-pindi",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T03:40:02.000Z"
}
