{
  "title": "Punjab predicted to receive 25pc more monsoon rains this year: PDMA - Pakistan - DAWN.COM",
  "author": null,
  "content": "Punjab is predicted to receive 25 per cent more monsoon rains this year, Provincial Disaster Management Authority (PDMA) Director General Irfan Ali Kathia said on Wednesday.\n\nSeparately, Karachi is expected to receive rainfall on June 27 (Friday), the Pakistan Meteorological Department (PMD) said — potentially ending an ongoing wave of extreme heat and humid weather.\n\nThe PMD has already forecast monsoon rain across the country from Wednesday, June 25. Monsoon rains fall across the region from June to September, offering respite from the summer heat and are crucial to replenishing water supplies.\n\nMonsoon rains have commenced in Punjab and first spell will continue till July 1, the PDMA said in a statement, adding that rainfall with strong winds and thunderstorms are predicted in most districts of the province.\n\nRelief Commissioner Punjab Nabeel Javed has instructed commissioners and deputy commissioners across the province to remain alert. He said all relevant departments including Rescue 1122 and WASA are on alert.\n\nThe PDMA said rains with strong winds are predicted in Rawalpindi, Murree, Galiyat, Attock, Chakwal, Mandi Bahauddin, Hafizabad, Gujarat, Jhelum, and Gujranwala. Lahore, Faisalabad, Sialkot, Narowal, Toba Tek Singh, Jhang, Sargodha and Mianwali are also expected to receive rain.\n\nRainfall is predicted in south Punjab including Multan, Dera Ghazi Khan, Bahawalpur and Bahawalnagar from June 26-28.\n\nThe PDMA director general has issued a alert to the district administrations on the instructions of the chief minister. “Monsoon rains are predicted to be 25pc more this year,” he said.\n\n“An alert has been issued to the Department of Health, Irrigation, Construction and Communications, Local Government and Livestock,” he added.\n\n“Citizens are requested to take precautionary measures in extreme weather conditions, stay in safe locations during thunderstorms and avoid unnecessary travel.” He said tourists should plan their travel as per weather conditions.\n\nHe warned of landslide risk in Murree, Galiyat and other mountainous areas due to heavy rains. Citizens should stay in safe places to protect themselves from lightning and call the PDMA helpline 1129 in case of emergency.\n\nIn a related development, the PMD has issued a three-day weather forecast for Karachi division which predicts isolated rain and thunderstorm on Friday evening.\n\nThe weather will remain partly cloudy, hot and humid, today with the maximum temperature between 34-36 degrees Celsius and humidity level at 72pc in the morning.\n\nFor tomorrow, the weather in the city has been forecast as partly cloudy and humid, with chances of isolated light rain and drizzle. The maximum temperature will remain between 35-37 degrees Celsius and humidity levels of 70-80pc.\n\nOn Friday, the Met Office has forecast hot and humid weather with chances of isolated rain and thunderstorm in the evening. The maximum temperature will remain between 35-37 degrees Celsius with humidity level between 70-80pc in the morning with southwesterly winds blowing.\n\nAccording to the Met Office, “monsoon currents are penetrating upper and central parts of the country and likely to intensify further.\n\n“A westerly wave is moving toward the upper parts of the country and is likely to become more active by tomorrow (Thursday).”\n\nUnder its influence, dust storm and rainfall with thundershower is expected in Tharparker ,Umerkot, Mirpurkhas, Badin, Thatta and Dadu districts tomorrow.\n\nIt added that rainfall with thunderstorm is likely in Sukkur, Larkana, Jacobabad, Khairpur, Ghotki, Kashmore, Dadu, Nosheroferoz, Shaheed Benazirabad, Hyderabad, Tharparker, Mirpur Khas, Sanghar, Jamshoro, Tando Allahyar, Tando Muhammad Khan, Thatta, Badin and Karachi division on June 27 with occasional gaps.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:26:56.501Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920014/punjab-predicted-to-receive-25pc-more-monsoon-rains-this-year-pdma",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T08:42:02.000Z"
}
