{
  "title": "Govt employees violently clash with police in Quetta - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Police arres­ted over two dozen government employees’ on Tuesday after clashes erupted while they were protesting against their salaries not being increased in line with federal government scales.\n\nPolice lobbed tear gas shells when the protesting employees became unruly and pelted police with stones during their demonstration.\n\nThe employees took to roads in Quetta carrying placards and banners scribed with their demands and chanted slogans against the government.\n\nPolice resorted to baton-charge and used tear gas to disperse the protesting employees, during which around a dozen demonstrators received injuries.\n\nLaw enforcement officials also used batons against media men covering the protest.\n\nTear gas, batons used against protesters demanding higher wages\n\nThe protests by the Government Employees Grand Alliance, erupted after the Balochistan government failed to announce salary and benefit increases in the provincial budget similar to those provided at the federal level.\n\nFollowing unsuccessful negotiations, employees locked government offices and schools and planned to march towards the Balochistan Assembly to stage a sit-in.\n\nBut police prevented them by using roadblocks, closing Zarghoon Road, when protestors forcibly attempted to reach the assembly building, police again used tear gas and baton charge.\n\nThe city experienced massive traffic jams.\n\n“We have arrested around 30 demonstrators from different areas during clashes with security personnel,” SP City Noman Zafar said, adding that some leaders of the grand alliance were among them.\n\nLeaders of the alliance accused the government of “torturing the protesting employees instead of accepting their demands”.\n\nThey demanded immediate implementation of their 18-point charter, including salary increases in line with inflation, a disparity allowance, reversal of “anti-employee pension reforms”, and automation of the retirement process.\n\nBalochistan Chief Minister Mir Sarfraz Bugti defended the police action, saying protesting employees were “attempting to prevent the assembly session from taking place.”\n\nSpeaking in the assembly, he said the demands would add a burden of Rs40 billion to the provincial budget, which is “not feasible within the current financial constraints”.\n\n“I understand that inflation and unemployment are serious issues, but the reality is that our non-development expenditure is rapidly increasing, while development budgets are consistently being cut,” Mr Bugti said.\n\n“We are allocating 80 per cent of our budget to just 2pc of our employees.”\n\nMr Bugti added that provincial ministers were sent to engage with protesters, but they “remained adamant about stopping the assembly session.”\n\n“If the employees think they can halt assembly proceedings through protests, this is not acceptable,” he warned.\n\nWhile acknowledging the right to protest, the chief minister noted the Balochistan High Court has banned protests by government employees and Section 144 was imposed.\n\nPublished in Dawn, June 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:27:23.990Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919872/govt-employees-violently-clash-with-police-in-quetta",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T00:02:45.000Z"
}
