{
  "title": "LHC denies post-arrest bail to Imran in eight May 9 cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court on Tuesday denied post-arrest bail to incarcerated PTI founding chairman Imran Khan in eight cases related to the May 9, 2023 riots, including the Jinnah House attack.\n\nA two-judge bench comprising Justice Syed Shahbaz Ali Rizvi and Justice Tariq Mahmood Bajwa announced a short order, which had been reserved the previous day, on the former prime minister’s bail petitions. The bench will issue a detailed verdict later.\n\nThe other cases involve attacks on Askari Tower at Liberty, PML-N offices in Model Town, Shadman police station, the burning of police vehicles near Jinnah House and violence at Sherpao Bridge.\n\nOn Nov 27 last year, an anti-terrorism court had denied bail to the former PM in these eight cases.\n\nThe bail petitions, filed through Barrister Salman Safdar, argued that the prosecution had failed to establish any connection between the petitioner and the incidents mentioned in the FIRs.\n\nProsecution claims PTI founder instructed party leaders, workers to attack military installations\n\nThey claimed that Imran Khan had been implicated in the May 9 cases as part of a well-orchestrated plan aimed at harassing and humiliating him for political reasons, despite the fact that he was in NAB custody at the time.\n\nThe petitions further stated that the only allegation against the petitioner was of “abetment,” which the prosecution had presented in vague terms. It was also argued that the trial court overlooked the fact that similar allegations had already been dismissed due to inconsistencies in the investigating agency’s narrative.\n\nThe petitions requested the LHC to overturn the trial court’s decision and grant bail to the former premier in all eight FIRs.\n\nOpposing the bail, the prosecution told the court that the PTI founding chairman had instructed party leaders and workers to attack military installations.\n\nIt said an audio recording allegedly of the PTI founder had been forensically examined and was to be matched with his voice. However, the accused had refused to undergo a voice-matching test.\n\nThe prosecution maintained that the Jinnah House attack case was distinct from the others as Imran Khan had been specifically nominated in the FIR. It added that substantial evidence existed against him, making him ineligible for bail.\n\nPublished in Dawn, June 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:45:02.624Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919908/lhc-denies-post-arrest-bail-to-imran-in-eight-may-9-cases",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T00:02:33.000Z"
}
