{
  "title": "Talks with US regarding trade, reciprocal tariffs to conclude next week: finance ministry - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan and the United States have decided to conclude trade talks focused on reciprocal tariffs next week after a virtual meeting between Finance Minister Muhammad Aurangzeb and US Commerce Secretary Howard Lutnick.\n\nThe negotiations are part of a broader push to reset economic ties at a time of shifting geopolitical alignments and Pakistan’s efforts to avoid steep US duties on exports.\n\n“Both sides showed satisfaction on the ongoing negotiations and resolved to conclude the trade negotiations next week,” the finance ministry said in a statement, adding that a longer-term strategic and investment partnership is also under discussion.\n\n“The discussion focused on meaningful engagement in trade, investment and deepening economic ties mutually beneficial to both sides, with technical-level trade-related discussions to be concluded next week,” it added.\n\nPakistan faces a 29 per cent tariff on exports to the US under President Donald Trump’s measures to target countries with large trade surpluses with the US. Pakistan’s surplus was around $3 bn in 2024.\n\nTo offset the imbalance and ease tariff pressures, Islamabad has offered to import more US goods, including crude oil, and to open up investment opportunities through concessions for US firms in Pakistan’s mining sector.\n\nEarlier this week, the two countries co-hosted a webinar promoting investment in Pakistan’s mineral sector, including the $7bn Reko Diq copper-gold project.\n\nSenior officials from both governments and US investors discussed public-private partnerships and regulatory reforms. The US Export-Import Bank is reviewing financing proposals worth $500 mn to $1 bn in Reko Diq.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:26:52.862Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920049/talks-with-us-regarding-trade-reciprocal-tariffs-to-conclude-next-week-finance-ministry",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T12:50:55.000Z"
}
