{
  "title": "Roadside explosion in KP’s Parachinar kills four - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four people were killed and as many injured after an improvised explosive device (IED) exploded on Wednesday in the Pewar area of Parachinar in Upper Kurram district of Khyber Pakhtunkhwa.\n\nDPO Habibullah said police teams reached the site of the explosion in Sharamkhel, Pewar, and launched an investigation. He confirmed that four people were killed and four others were injured in the explosion.\n\nThe medical superintendent of DHQ Parachinar Hospital Mir Hassan Jan identified the victims as Nawab Ali, Amir Hussain, Hidayat Hussain, and Manzar Ali.\n\nHe added the injured namely, Muhammad Konain, Shafaat Hussain, and Hassan Ghulam were provided first aid and have been taken to Peshawar for further treatment.\n\nSpeaking to media, an injured victim Hassan Ghulam said they were heading towards a hill to collect firewood when the explosion occurred on the roadside.\n\n“The incident is very unfortunate. The terrorists should be caught and punished,” he said. Besides his four companions, two horses were also killed in the explosion.\n\nThe tribal elders of the area condemned the incident and called for arresting the terrorists immediately for attempting to sabotage peace efforts. They called for conducting a high-level investigation into the incident.\n\nIn December last year, Kurram remained cut off from the rest of the country due to violent tribal clashes that claimed more than 100 lives.\n\nAll roads in Kurram, including the Parachinar-Peshawar highway, remained closed to traffic for a month after a vehicular convoy was attacked in Bagan area, in which at least 50 people were killed.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:26:55.495Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919995/roadside-explosion-in-kps-parachinar-kills-four",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T06:50:26.000Z"
}
