{
  "title": "Punjab CM orders crackdown on hateful content on social media - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Chief Minister Maryam Nawaz has issued directions for a crackdown on those involved in spreading hateful content on social media.\n\nPresiding over a meeting to review arrangements regarding Muharram here on Tuesday, the CM sought an emergency plan from the administration.\n\n“Those found involved in spreading hateful content on social media should be arrested forthwith,” the CM said and directed the authorities to ensure a complete ban on displaying banners, posters and wall-chalking throughout the province. She also directed to arrest of those violating the ban on flying drones during Muharram.\n\nShe asked the ministers, commissioners, deputy commissioners, RPOs and DPOs to personally oversee the security arrangements for Muharram.\n\nThe CM sought the strict implementation of the code of conduct and a zero-tolerance policy. She asked the officer to launch mock drills of security arrangements and install sabeels for processions and gatherings of Muharram. She also directed to provide refreshing drinks, lemon water and cold water bottles during processions along with identification and monitoring of sabeels.\n\nThe CM said that water sprinklers should be set up to protect the mourners from the heatstroke and humidity. She instructed the officials to set up field hospitals and clinics on wheels for Ashura processions and further directed to issue effective traffic management plans as well as timely traffic advisories. She also instructed the authorities to make arrangements for the timely drainage of water in case of rainfall.\n\n“The spirit of Muharram should be implemented. Hanging electric wires poses a big risk; emergency operations should be carried out in this regard. There should be no power outage during Ashura and streetlights should not be turned off,” she said and directed the officers to ensure that the manholes were properly covered in all areas, including private housing societies.\n\n“Patchwork is done every year on Muharram, how come potholes resurface on the procession routes again? In the context of war, Muharram should be considered highly sensitive; Pakistan’s enemies will not let this opportunity go. Negative forces are unnerved at the success of Operation Bunyan-um-Marsoos. All stakeholders must remain alert,” she said.\n\nPUNJAB POLICE: The Punjab Police finalised security arrangements for Majalis and mourning processions across the province during Muharram.\n\nPunjab Inspector General of Police Dr Usman Anwar chaired a meeting via a video link at the Central Police Office to review the security arrangements.\n\nPunjab Additional IG Operations Shahzada Sultan briefed the meeting about the security measures taken to ensure a peaceful and safe Muharram.\n\nAccording to the Punjab Police spokesperson, over 38,000 Majalis will be held and more than 9,200 mourning processions will be taken out across Punjab during Muharram. He said over 232,000 officers and personnel would perform security duties during the first 10 days. In Lahore, he said, more than 28,000 officials would be deployed for Muharram security.\n\nSimilarly, over 53,000 community volunteers and more than 38,000 volunteers would assist in the security of majalis and mourning processions, respectively.\n\nAddressing the meeting, the IGP directed the officers to ensure implementation of security SOPs, saying that due to the prevailing situation in the region, the security of Muharram had become more challenging. Any attempt by anti-state elements to incite sectarianism, religious hatred, or disturb law and order should be thwarted by using all the available resources, he said.\n\n“Any trouble or flash points should be resolved in consultation with stakeholders before Muharram,” he said.\n\nThe IGP directed the RPOs and DPOs to ensure coordination with peace committees, scholars of various sects and organisers of mourning processions and majalis.\n\nThe Punjab Police would have the full support from the Pakistan Army and Rangers, as well as other security institutions during the first 10 days of Muharram, he said.\n\nPublished in Dawn, June 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:45:17.553Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919931/punjab-cm-orders-crackdown-on-hateful-content-on-social-media",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T03:16:13.000Z"
}
