{
  "title": "Hearing of reserved seats case may be stalled for a month - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The hea­ring of review petitions in the reserved seats case may be stalled as a senior counsel has sought a mon­th-long adjournment since he is away on vacation.\n\nThe 11-member Consti­tutional Bench of the Sup­reme Court held a hearing last Friday and adjourned the case until Monday. However, the hearing didn’t take place due to the demise of the mother of Justice Jamal Khan Mandokhail, a member of the bench. Later, the proceedings were adjourned until further directions.\n\nOn Tuesday, the court announced the proceedings would resume on Thursday.\n\nAs the hearing was announced through a supplementary cause list, senior counsel Hamid Khan moved an application for adjournment from June 23 to Aug 5.\n\nMr Khan, who is representing the Sunni Ittehad Council, sought the postponement since he is on a vacation until Aug 5.\n\nUnder these circumstances, the application said, the case may be adjourned “in the interest of justice”.\n\nEarlier, it was decided that Salman Akram Raja, who is appearing on behalf of PTI leader Kanwal Shauzab, will conclude his arguments whenever the case resumes. After that, Mr Khan was expected to present his arguments for a day or two.\n\nNow, with the filing of the adjournment application, it is unclear whether the constitutional bench will continue the hearing or postpone it on general adjournment.\n\nThe 11-judge bench, headed by Justice Aminuddin Khan, also included justices Mandokhail, Muhammad Ali Mazhar, Syed Hasan Azhar Rizvi, Musarrat Hilali, Naeem Akhtar Afghan, Shahid Bilal Hassan, Muhammad Hashim Khan Kakar, Salahuddin Panhwar, Aamer Farooq and Ali Baqar Najafi.\n\nThe bench is hearing nine review petitions moved by the PML-N, PPP, Election Commission of Pakistan and other applicants.\n\nPublished in Dawn, June 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:27:25.127Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919877/hearing-of-reserved-seats-case-may-be-stalled-for-a-month",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T00:02:45.000Z"
}
