{
  "title": "Nato summit commits to higher spending and collective defence - World - DAWN.COM",
  "author": null,
  "content": "Nato leaders on Wednesday backed a big increase in defence spending and restated their commitment to defend each other from attack after a brief summit tailor-made for United States President Donald Trump.\n\nIn a short statement, Nato endorsed a higher defence spending goal of 5 per cent of GDP by 2035, a response to a demand by Trump and to Europeans’ fears that Russia poses a growing threat to their security following the 2022 invasion of Ukraine.\n\n“We reaffirm our ironclad commitment to collective defence as enshrined in Article Five of the Washington Treaty that an attack on one is an attack on all,” the statement said, after Trump had sparked concern on Tuesday by saying there were “numerous definitions” of the clause.\n\nBut just before the summit opened, Trump had said of fellow Nato members: “We’re with them all the way.”\n\nTrump lauded the “tremendous” summit in the Hague as leaders wrapped up a meeting that saw the alliance back his demand to ramp up defence spending.\n\n“I think the summit was fantastic. It was a big success,” Trump told Dutch Prime Minister Dick Schoof.\n\nThe 32-nation alliance, for its part, heeded a call by Trump for other countries to step up their spending on defence to reduce Nato’s reliance on the US.\n\nNato Secretary General Mark Rutte acknowledged that it was not easy for European countries and Canada to find the extra money, but said it was vital to do so.\n\n“There is absolute conviction with my colleagues at the table that, given this threat from the Russians, given the international security situation, there is no alternative,” the former Dutch prime minister told reporters in his home city of The Hague.\n\nThe new spending target, to be achieved over the next 10 years, is a jump worth hundreds of billions of dollars a year from the current goal of 2pc of GDP, although it will be measured differently.\n\nCountries would spend 3.5pc of GDP on core defence — troops and weapons — and 1.5pc on broader defence-related measures such as cyber security, protecting pipelines and adapting roads and bridges to handle heavy military vehicles.\n\nAll Nato members have backed a statement enshrining the target, although Spain declared it does not need to meet the goal and can meet its commitments by spending much less.\n\nRutte disputes that, but accepted a diplomatic fudge with Spanish Prime Minister Pedro Sanchez as part of his efforts to give Trump a diplomatic victory and make the summit go smoothly.\n\nSpain said on Wednesday that it did not expect its stance to have any repercussions.\n\nRutte on Wednesday likened Trump to a “daddy” intervening in a schoolyard brawl after the US leader used profanity when describing the war between Israel and Iran.\n\nIn comments to the press during a Nato summit in The Hague, Trump had compared fighting between Iran and Israel to children quarrelling.\n\n“They’ve had a big fight, like two kids in a schoolyard. You know, they fight like hell, you can’t stop them. Let them fight for about 2-3 minutes, then it’s easy to stop them.”\n\nRutte laughed and added: “And then daddy has to sometimes use strong language to get [them to] stop.”\n\nOn Tuesday, following a ceasefire deal between Iran and Israel, Trump said the countries had been fighting “so long and so hard that they don’t know what the f*** they’re doing.”\n\nNato did not immediately respond to a request for comment.\n\nTrump also compared on Wednesday the impact of US bombing of Iran’s nuclear sites to the end of World War Two, when the United States bombed Hiroshima and Nagasaki.\n\n“I don’t want to use an example of Hiroshima, I don’t want to use an example of Nagasaki, but that was essentially the same thing. That ended that war. This ended the war,” Trump said.\n\nTrump struck a conciliatory tone towards Nato allies on Wednesday, framing the deal on increased defence spending as a “great victory for everyone” at their summit.\n\nEverything was carefully choreographed at the gathering in The Hague to keep the volatile US president on board: from chopping back the official part of the meeting to putting him up overnight in the royal palace.\n\nThe strategy seemed to be working, with Trump seeming keen to share the plaudits for a deal set to see the 32 countries commit to spending 5 per cent of output on defence by 2035.\n\n“It’s a great victory for everybody, I think, and we will be equalised very shortly, and that’s the way it has to be,” said Trump. “I’ve been asking them to go up to 5pc for a number of years, and they’re going up to 5pc … I think that’s going to be very big news.\n\nHosting the meeting, Nato Secretary General Mark Rutte told reporters that Trump was in an “excellent mood” at the dinner hosted on Tuesday by King Willem-Alexander in his royal palace, and that the US leader appeared inspired by his hosts.\n\n“The day begins in the beautiful Netherlands. The King and Queen are beautiful and spectacular people. Our breakfast meeting was great!” he posted on the Truth Social network.\n\nEntering the meeting, leaders lined up to declare the summit’s planned spending hike as “historic”.\n\nBelgian Prime Minister Bart De Wever said: “As Europeans, we should realise that our long break from history is over.” The continent needed to take responsibility for its own security, “in a very difficult time”, added De Wever.\n\nWith that deal all but clinched, attention turned to the basic foundation of the alliance — its mutual defence clause that says an attack on one is an attack on all.\n\nTrump rattled his allies by appearing to cast some doubt on the validity of this promise, known as Article Five of the Nato treaty, telling reporters on the way to The Hague that it “depends on your definition.\n\n“There’s numerous definitions of Article Five.”\n\nBut Rutte played down the comments, saying he believed that Trump and the United States were still “totally committed” to Article Five.\n\nAnd when pressed about the collective pledge while meeting Rutte on Wednesday, Trump said: “We’re with them all the way.”\n\nBritain’s Prime Minister Keir Starmer dodged multiple questions seeking clarity over Washington’s stance.\n\n“We live in a very volatile world and today is about the unity of Nato, showing that strength,” said Starmer.\n\nIn an earlier message, probably not designed for public consumption, Rutte heaped flattery on Trump, praising him for bringing everyone on board for the spending hike.\n\n“Europe is going to pay in a big way, as they should, and it will be your win,” Rutte wrote in a gushing, caps-filled missive to Trump, who promptly posted it on social media. “You are flying into another big success in The Hague.”\n\nUnderpinning the leaders’ discussions on defence was Russia’s invasion of Ukraine, with Trump meeting the war-torn country’s president, Volodymyr Zelensky, on the summit sidelines.\n\nZelensky said he discussed a ceasefire in Ukraine with Trump in a 50-minute meeting, which he called “long and substantive” on social media.\n\n“We discussed how to achieve a ceasefire and a real peace. We spoke about how to protect our people,” he said.\n\nA source in the Ukrainian presidency told AFP Zelensky was “satisfied with the conversation and grateful to Trump.”\n\nMeanwhile, Trump said the meeting “couldn’t have been nicer”.\n\nZelensky is playing a less central role here than at previous summits, to avoid a bust-up with Trump after their infamous Oval Office shouting match.\n\nBut Trump described him as a “nice guy” and added that he was talking to Russian President Vladimir Putin about the war, saying: “I think progress is being made.”\n\nRutte said that allies would send the message that support for Kyiv was “unwavering and will persist”.\n\nBut despite his insistence that Ukraine’s bid for membership remains “irreversible”, Nato will avoid any mention of Kyiv’s push to join after Trump ruled it out.\n\nHungary’s Kremlin-friendly Prime Minister Viktor Orban was more categorical. “Nato has no business in Ukraine,” he said. “My job is to keep it as it is. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/251732180cbada6.jpg",
  "retrievedAt": "2025-08-20T04:26:48.675Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920050/nato-summit-commits-to-higher-spending-and-collective-defence",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T11:54:58.000Z"
}
