{
  "title": "Trump says China can buy Iranian oil, but urges it to purchase US crude - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Tuesday that China can continue to purchase Iranian oil after Israel and Iran agreed to a ceasefire, a move that the White House clarified did not indicate a relaxation of US sanctions.\n\n“China can now continue to purchase oil from Iran. Hopefully, they will be purchasing plenty from the US, also,” Trump said in a post on Truth Social, just days after he ordered US bombings of three Iranian nuclear sites.\n\nTrump was drawing attention to no attempts by Iran so far to close the Strait of Hormuz to oil tankers, as a closure would have been hard for China, the world’s top importer of Iranian oil, a senior White House official told Reuters.\n\n“The president continues to call on China and all countries to import our state-of-the-art oil rather than import Iranian oil in violation of US sanctions,” the official said.\n\nAfter the ceasefire announcement, Trump’s comments on China were another bearish signal for oil prices, which fell nearly 6 per cent on Tuesday.\n\nAny relaxation of sanctions enforcement on Iran would mark a US policy shift after Trump said in February he was re-imposing maximum pressure on Iran, aiming to drive its oil exports to zero, over its nuclear program and funding of militants across the Middle East.\n\nTrump imposed waves of Iran-related sanctions on several of China’s independent “teapot” refineries and port terminal operators for purchases of Iranian oil.\n\n“President Trump’s greenlight for China to keep buying Iranian oil reflects a return to lax enforcement standards,” said Scott Modell, a former CIA officer, now CEO of Rapidan Energy Group.\n\nIn addition to not enforcing sanctions, Trump could suspend or waive sanctions imposed by executive order or under authorities a president is granted in laws passed by Congress.\n\nTrump will likely not waive sanctions ahead of coming rounds of US-Iran nuclear talks, Modell said. The measures provide leverage given Tehran’s demand that any deal includes lifting them permanently.\n\nJeremy Paner, a partner at law firm Hughes Hubbard & Reed, said if Trump chooses to suspend Iran oil-related sanctions, it would require lots of work between agencies.\n\nThe US Treasury would need to issue licences, and the State Department would have to issue waivers, which require Congressional notification.\n\nOil traders and analysts in Asia said they did not expect Trump’s comments to have a near-term impact on Chinese purchases of oil from either Iran or the US.\n\nIranian oil accounts for roughly 13.6pc of China’s oil purchases this year, with the discounted barrels providing a lifeline to margin-squeezed independent refineries. US oil accounts for just 2pc of China’s imports, and Beijing’s 10pc tariffs on US oil deter further purchases.\n\nChina has long opposed what it has called Washington’s “abuse of illegal unilateral sanctions”. China’s embassy in Washington did not immediately respond to a request for comment about Trump’s post.\n\nLarger purchases of Iranian oil by China and other consumers could upset US ally Saudi Arabia, the world’s largest oil exporter.\n\nThe impact of US sanctions on Iran’s exports, however, has been limited since Trump’s first administration when he cracked down harder on Tehran.\n\nTrump has “flashed the Glock” this year with sanctions on Chinese trading companies and terminals, Modell said, referring to revealing a gun. But the results have been far more “minimum pressure” than maximum, Modell added.\n\nState Department spokesperson Tammy Bruce told reporters that Trump had signalled what he wanted to happen and that his administration is focused on delivering that. She would not say what the process would entail.\n\n“But clearly we are focused on making sure that (the) guiding hand of President Trump prevails and moves this government forward, so we will have to wait and see when it comes to what that ends up looking like,” Bruce said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/06/251102334967ff8.png",
  "retrievedAt": "2025-08-20T04:26:56.092Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919991/trump-says-china-can-buy-iranian-oil-but-urges-it-to-purchase-us-crude",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T06:22:51.000Z"
}
