{
  "title": "Nepra slashes base power tariff by Rs1.49 for FY26 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Electric Power Regulatory Authority (Nepra) on Wednesday slashed the base power tariff by Rs1.49 per unit for the next fiscal year.\n\nNepra Spokesperson Safeer Hussain confirmed the development to Dawn.com and said the proposal had been sent to the federal government.\n\nLast month, against high hopes, the government sought revision in the base electricity tariff for the next fiscal year, proposing only 30 paise to a maximum of Rs2.25 per unit reduction in consumer rates under seven different scenarios.\n\nOnly in one unlikely case of normal circumstances and a stable exchange rate at Rs280, the average base tariff would reduce by Rs2.25 per unit in fiscal year 2025-26 to Rs24.75 from the prevailing rate of about Rs27 per unit.\n\nIn case of local currency depreciation to Rs300, the base tariff reduction would be around 30 paise per unit. The reduction mainly stems from lower capacity payments.\n\nThe average Power Purchase Price (PPP) would be on top of about Rs8.16 to Rs9.52 per unit fuel cost, taking the total electricity price to range between Rs34 and Rs35 per unit, excluding taxes, fees, duties and surcharges.\n\nElectricity demand is projected to grow between three and five per cent in all cases, but only if the exchange rate remains stable at Rs280. The exchange rate has been assumed to be Rs300 in all six other cases. In addition, US inflation has been taken at 2pc, Pakistan inflation at 8.65pc, besides 11.9pc Karachi Interbank Offe­red Rate, 4.07pc international interest rate, and transmission losses at 2.80pc.\n\nThe Nepra determination would be taken to the federal cabinet for approval and subsidy allocation, and the power division would file a follow-up tariff table to Nepra for subsidy punching for various consumer categories and slabs be­­fore formal notification with effect from July 1 as already committed to the International Monetary Fund.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:26:51.960Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920066/nepra-slashes-base-power-tariff-by-rs149-for-fy26",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T15:59:05.000Z"
}
