{
  "title": "NA speaker constitutes executive committee to outline attainable goals for PIPS",
  "link": "https://www.app.com.pk/national/na-speaker-constitutes-executive-committee-to-outline-attainable-goals-for-pips/",
  "date_published": "2022-11-21T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): National Assembly (NA) Speaker Raja Pervaiz Ashraf on Monday stressed the need to enhance the performance capacity of Pakistan Institute of Parliamentary Services (PIPS) and its role to support legislators and their supporting staff.\nHe expressed these views while presiding over the meeting of Board of Governors of PIPS here.He said, “PIPS as an organization has evolved over the years as supportive organisation for federal and provincial parliaments yet there is need to improve its work.”\nHe stressed on the need to keep on updating the PIPS on modern ways so that it could achieve its organizational goals.\nThe speaker expressed the hope that PIPS would follow the directions of members of Board of Governors as they are experienced and seasoned parliamentarians.\nHe sought the suggestions of all members of Board of Governors to enhance organizational capacity of PIPS. As per the suggestion of members of Board of Governors, president Board of Governors PIPS speaker constituted an executive committee to outline attainable goals of PIPS.\nHe also recommended to form an advisory committee to enhance the performance of PIPS. The speaker also stressed on the need to gear up the plan for establishment of PTV Parliament.\nThe matters pertaining to establishment of PTV Parliament, parliamentary study programmes conducted by PIPS. Members Board of Governors stressed on the need to enhance collaboration with public universities to make young generation aware of parliamentary procedures and its importance.\nResponding to briefing regarding Developing E-Portal for Members Parliamentary, the members said mobile friendly website be developed so that members can be informed timely.\nYoung Parliamentary subject expert programme, legislative council of experts constituted by PIPS, Rationale for creating new posts, establishment of Parliamentarians Resource Centre (PRCs) at provincial parliament were other matters which were deliberated in committee meeting. The members expressed their displeasure over the allocation of non-Research staff at Parliament centres.\nThe members Board of Governors also stressed on the need to review the performance targets of PIPS. They also sought details of memorandum of understandings signed by PIPS.\nSenate Deputy Chairman Mirza Muhammad Afridi appreciated the performance of PIPS and stressed on the need to support PIPS staff so that PIPS can perform better.\nMinister for Information and Broadcasting Marriyum Aurangzeb expressed dismay over the lack of research based input for capacity building of parliaments. She also stressed to make PIPS as an effective tool to assist federal and provincial legislatures.",
  "retrievedAt": "2025-08-11T15:54:24.392Z"
}
