{
  "title": "Lahore’s Jallo worker ‘opens’ tigers enclave, lets big cat roam park - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: In a shocking incident on Sunday, one of the three tigers at Jallo Park here came out of its enclosure after an employee allegedly opened its door deliberately.\n\nFortunately, the beast was sedated by the staff and moved back to the enclosure without anybody getting harmed.\n\nAs per park officials, they were informed by an employee, Sharif Masih, around 9am that a white male Bengal tiger named ‘Rosha’ had escaped from its enclosure and was roaming in the park. Rosha was brought to the park in 2022.\n\nThe staff concerned immediately rush to the spot and found the beast out of its enclosure, while its door was left ajar.\n\nThe beast was later sedated, moved back to enclosure\n\nThe staff cordoned off the park’s area where the big cat was roaming and tranquilised the beast with sedative shots fired with a special gun.\n\nAfter the tiger fell unconscious under the effect of sedatives, he was moved back to its enclave.\n\nLater, the tiger was administered another injection by vets to revive its consciousness.\n\nAccording to vets the tiger has regained conscious and is quite fine after reversal of the sedation.\n\nAs per official sources, an initial inquiry revealed that the Sharif Masih, who had the duty to feed the tigers, had intentionally opened the door of the enclosure, allowing the beast to come out.\n\nThough the motive of this act was not clear so far, it was surely meant to create panic among the park visitors, the sources say.\n\nThey said the keys of the tiger’s enclave were with Masih.\n\nAs per a spokesperson for the wildlife department, Masih was immediately taken in custody by police for further interrogation and a terrorism case was being registered against him.\n\nHe said that taking notice of the incident, that could have tragic consequences, the wildlife department has formed a three-member committee comprising Lahore Zoo director,\n\nWildlife Lahore deputy director and a veterinary officer from Safari Park, to probe into the matter within 12 hours and submit a report.\n\nPunjab wildlife high-ups praised the team that acted promptly to tranquilise the tiger and safely shifted it back to its cage without any causality.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a010725f482.gif",
  "retrievedAt": "2025-08-25T19:19:32.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889429/lahores-jallo-worker-opens-tigers-enclave-lets-big-cat-roam-park",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:20:09.000Z"
}
