{
  "title": "United lose to Palace, Spurs ease pressure on Postecoglou - Sport - DAWN.COM",
  "author": null,
  "content": "MANCHESTER: Manchester United slumped to another meek home defeat as Crystal Palace won 2-0 at Old Trafford on Sunday, while Tottenham eased the pressure on Ange Postecoglou by beating Brentford 2-0.\n\nJean Philippe-Mateta was Palace’s hero with both goals in the second half as United suffered a fifth defeat in their last six home league games.\n\nVictory takes the Eagles above the Red Devils in the table as Oliver Glasner’s side climb to 12th.\n\nThree consecutive wins for United had lifted the mood around Old Trafford but it was back to square one for Ruben Amorim after another home display lacking in creativity and riddled with defensive lapses.\n\nAmorim’s decision to start without a natural striker backfired with both Rasmus Hojlund and Joshua Zirkzee left on the bench.\n\nMidfielder Kobbie Mainoo started in a centre-forward role after scoring in a 2-0 victory over Romanian side FCSB in midweek.\n\nThe England international’s scuffed strike came back off the post in United’s best effort of a bright opening before their attacking threat fizzled out.\n\nPalace have lost just one of their last seven league games to recover from a miserable start to the season.\n\nThe visitors missed the creative spark offered by Eberechi Eze for the first hour as an injury meant he was only fit enough for a cameo appearance off the bench.\n\nBut Eze made an instant impact as from his free-kick Maxence Lacroix’s header came back off the bar and into Mateta’s path to fire home.\n\nWorse was to follow for United as Lisandro Martinez had to be stretchered off with what appeared a serious knee injury.\n\nPalace showed no mercy to secure the three points when Daniel Munoz charged through the middle of the home side’s defence and unselfishly squared for Mateta to knock in his sixth goal in five games.\n\nMeanwhile, Spurs eased fears they could be dragged into a relegation battle as Postecoglou’s injury-ravaged side kept a rare clean sheet to see off Brentford.\n\nThe Bees were left to rue a number of missed chances against Tottenham’s makeshift defence with Micky van de Ven and Cristian Romero again absent.\n\nBrentford also lent the visitors a helping hand with the opening goal.\n\nHakon Valdimarsson flapped at Son Heung-min’s corner and Vitaly Janelt headed into his own net on 29 minutes.\n\nYoane Wissa’s header came off the bar as Brentford pushed for an equaliser.\n\nBut Spurs picked them off on the counter-attack when Pape Sarr prodded through Valdimarsson’s legs from Son’s pass.\n\nVictory lifts Tottenham to 14th and 10 points clear of the relegation zone.\n\nIn Saturday’s late match, struggling Wolverhampton Wanderers stunned high-flying rivals Aston Villa 2-0 in the Midlands Derby to end a run of four straight defeats and move out of the relegation zone.\n\nJean-Ricner Bellegarde scored the opener in the 12th minute, lighting up Molineux with an angled shot rifled in at the near post after Pablo Sarabia played the ball through, and Matheus Cunha made it 2-0 deep into second-half stoppage time.\n\nThe three points, against a side who sealed a Champions League last 16 spot in midweek, lifted Wolves out of the bottom three.\n\n“We played as a team with true spirit, working together and suffering together,” said Wolves manager Vitor Pereira after his side’s first league win of 2025. “We know it’s a long way, a difficult way. With our supporters and this spirit we can do it.”\n\nVilla, who made four substitutions at the break and had a goal disallowed in the second half, stayed eighth in the standings.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a0033689458.gif",
  "retrievedAt": "2025-10-12T01:07:10.400Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889390/united-lose-to-palace-spurs-ease-pressure-on-postecoglou",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:49.000Z"
}
