{
  "title": "Uzbek investors interested in investment in Balochistan, says envoy - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Uzbekistan amba­ssador to Pakistan, Ali Sher, has reaffirmed his country’s commitment to strengthening trade relations with Pakistan and stressed that Uzbek investors are keen to explore investment opportunities in Pakistan, particularly Balochistan.\n\nHe made these remarks in a meeting with a delegation of the Quetta Chamber of Commerce and Industry (QCCI), headed by Haji Muhammad Ayub Mariani, President of QCCI, and Senior Vice President Haji Akhtar Kakar in Islamabad.\n\nThe Uzbek ambassador extended an invitation to Balochistan’s business community to participate in an exhibition showcasing Uzbek products. The event is scheduled to take place in Lahore in the current month.\n\nThe QCCI leaders highlighted vast investment opportunities in Balochistan, particularly in agriculture, mining, and livestock.\n\nThey expressed interest in Uzbekistan’s collaboration in modernising Balochistan’s mining sector and urged for exchange of trade delegations to further enhance bilateral trade.\n\nThey noted that Pakistan’s current exports to Uzbekistan stand at approximately $150 million, while imports range between $300m and $350m.\n\nBoth sides stressed the need for increasing these figures to meet evolving trade demands.\n\nAmbassador Sher also extended an invitation for a business delegation from Balochistan to visit Uzbekistan to explore investment opportunities and engage with the Uzbek business community.\n\nThe QCCI officials welcomed the invitation and confirmed their participation in the Lahore exhibition.\n\nAdditionally, they accepted the ambassador’s invitation to visit Uzbekistan after Eidul Fitr, where they will visit Samarkand, Bukhara, and Termez before meeting business leaders in Tashkent to finalise trade agreements.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:16:02.103Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889455/uzbek-investors-interested-in-investment-in-balochistan-says-envoy",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:34.000Z"
}
