{
  "title": "Criminal probe launched into Israel PM’s wife - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: Israeli police are conducting a criminal investigation into Sara Netanyahu, the wife of Israeli Prime Minister Benjamin Netanyahu, the office of the state attorney said in a letter made public on Sunday.\n\n“A criminal investigation was opened” into suspected criminal offences, the office said in a letter to an Israeli opposition lawmaker who had accused Sara Netanyahu of tampering in her husband’s corruption trial after the broadcast in December of a television news investigation.\n\nNaama Lazimi, Knesset member for the Democrats, shared the letter on X on Sunday confirming the criminal investigation was launched on Dec 26, adding that her office had contacted the state attorney following the investigation by Israeli Channel 12’s Uvda news programme.\n\nThe show alleged that Sara Netanyahu had tried to intimidate a key witness in her husband’s ongoing corruption trial. She also organised demonstrations to harass the Attorney General, his deputy and other individuals deemed hostile to her husband, according to the programme.\n\nThe state attorney’s office added the investigation was being “conducted by the Israel Police accompanied by the cyber department of the state attorney’s office”.\n\nIn December, Benjamin Netanyahu testified in the corruption trial in which he faces charges of bribery, fraud and breach of public trust in three separate cases, calling the charges against him “ridiculous”.\n\nThe trial, which had been delayed many times since it first began in May 2020, is scheduled to last for months, with an appeals process that could further prolong matters.\n\nNetanyahu, who filed multiple requests to delay the proceedings based on the wars in Gaza and Lebanon, has steadfastly denied any wrongdoing.\n\nIn the first case, Netanyahu and his wife are accused of accepting more than $260,000 worth of luxury goods such as cigars, jewellery and champagne from billionaires in exchange for political favours. He is the first sitting premier to face criminal trial in the country.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:07:08.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889450/criminal-probe-launched-into-israel-pms-wife",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:56.000Z"
}
