{
  "title": "Over 100 structures razed in Attock anti-encroachment drive - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: On the direction of the Punjab government, the district administration of Attock carried out a drive against encroachments and demolished over 100 illegal structures while over 20 truckloads of encroached material, especially merchandise, were confiscated.\n\nThis was stated by deputy commissioner Rao Atif Raza while briefing newsmen about the drive launched in all six tehsils of the district on Sunday. He said the anti-encroachment drive will continue until encroachments were completely eliminated.\n\nResponding to a question, he said that the elimination of encroachments was inevitable in order to remove obstacles in the smooth traffic flow. He maintained that encroachments in most of the places and areas caused traffic congestion.\n\nThe next operation would be carried out to retrieve illegally grabbed state land and in this connection, all key points were being identified by officials of the revenue department.\n\nThe DC also urged all relevant agencies to work in coordination for the successful removal of illegal structures and vendors.\n\nDC Attock says elimination of encroachments inevitable to ensure smooth traffic flow in district\n\nIn Attock city, Assistant Commissioner Shagufta Jabeen led the anti-encroachment drive launched by officials of the municipal committee, district council and Rawalpindi solid waste management.\n\nPaved encroachments illegally extended on public paths, especially in Meena bazaar, Kutchery bazaar and Sarafa bazaar were demolished by utilising heavy machinery. On this occasion, the anti-encroachment staff led by Chief Officer Sardar Aftab Ahmed Khan faced tough resistance and clashes between anti-encroachment staff and traders were reported.\n\nLater, after negotiations led by additional deputy commissioner Anil Saeed and traders’ representatives, the operation resumed and all extended portions of shops, markets and makeshift stalls were removed.\n\nIn Hassanabdal, an anti-encroachment squad led by assistant commissioner Arif Qureshi was launched at the main bus stand, Shah Johlan road and the main bazaar and Hazara road. Heavy machinery was utilized to raze illegally erected structures on Hazara road.\n\n“Final notices were served to encroachers on all roads and bazaars especially on the intercity routes to remove encroachments and a cleanup operation would be launched against the illegally erected structures across the city on Monday,” said Arif Qureshi while talking to newsmen.\n\nA similar operation was carried out in Hazro town led by assistant commissioner Ayesha Badar during which sheds, shelters, walls and pavements were removed from Hazro main bazaar, Ziaul Haq road, Dua Chowk, Fawara Chowk, Circular road.\n\nIn Fatehjang, a grand operation was also launched led by Assistant Commissioner Humera Shah and enrichments on Rawalpindi-Kohat road, Rawalpindi-Fatehjang road, Sher Shah Suri road, police station road, Station Road, Karam Khan road and slaughterhouse road were removed.\n\nMs Shah said shopkeepers had been instructed regarding display of their brands and uniformity in their branding.\n\nThe AC said the main choke point caused by an encroachment was identified and a wall of the local police station was encroaching on the public pathway, adding a notice for removal of the structure was issued to the police.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:07:11.012Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889358/over-100-structures-razed-in-attock-anti-encroachment-drive",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:20:16.000Z"
}
