{
  "title": "Kurram residents bemoan road closures - Pakistan - DAWN.COM",
  "author": null,
  "content": "KURRAM: Four more bunkers were demolished as part of ongoing efforts to enforce a peace agreement in parts of Lower Kurram, on Sunday.\n\nSo far, 22 bunkers have been demolished as per the peace accord signed between the warring sides last month.\n\nHowever, locals have complained that helicopter flights from Parachinar to Peshawar are too few and far between, while continuous road closures have taken a toll on students, among other segments of society, who have been unable to begin their academic year.\n\nTrade Union President Haji Imdad said that bringing goods in through convoys once or twice a week for millions of besieged people was not enough. Convoys should be sent daily and supply routes should be opened for general transport as well, he said.\n\nJirga in capital\n\nMeanwhile, the representatives of the warring groups sat down for talks at former senator Sajjad Syed Mian’s residence in Islamabad.\n\nAlthough emissaries of both sides and members of the Grand Jirga, which solemnised the peace accord, attended, no government representative was present. However, the talks were held in a cordial atmosphere.\n\nThe leaders of both parties — Jalal Hussain and Munir Bangash — said that it was necessary to immediately stop the misuse of social media.\n\nMore bunkers dismantled; jirga decries ‘misuse’ of social media to fuel conflict\n\nThe second session of the jirga, to be held today, will feature discussions regarding other measures, including the opening of transportation routes and establishing peace.\n\nJirga leaders said that the people of both sides were facing difficulties due to the unrest, which needs to be resolved immediately.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/03102133fb410a1.jpg",
  "retrievedAt": "2025-08-25T19:19:42.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889458/kurram-residents-bemoan-road-closures",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:34.000Z"
}
