{
  "title": "EXPLAINER: How new cybercrime law puts digital rights at stake - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE acronym “Peca” has been all over the news lately, and many would be scratching their heads, wondering if this brouhaha is something you — the reader — should take seriously. The short answer is yes, you should be concerned. Very concerned.\n\nPeca is short for the Prevention of Electronic Crimes Act, the law that governs online spaces in Pakistan. The reason you’ve been hearing about it non-stop is because last week, the government made wholesale changes to the law that make it very easy to prosecute people whose opinions may differ from the official line.\n\nIn the state’s view, the move was necessary to counter the menace of “fake news” and save people from online crimes, but it’s never quite that simple.\n\nLawyers, journalists and rights experts say the amended law gives the authorities extraordinary powers and violates the fundamental right to free speech, guaranteed by the Constitution.\n\nAlthough it’s mainly journalists protesting against the amended Peca for now, it would be foolish to think the threat is only posed to one community or profession. Vague language and harsh punishments mean anyone can face prosecution for what they say or do online\n\nAlthough it’s mainly journalists protesting against the amended Peca law for now, it would be foolish fallacy to think the threat is limited to one community or profession alone.\n\nEvery Pakistani who uses social media now has to be really watchful of their digital footprint. The vague language used in the law has expanded the definition of crimes in such a way that any individual could face punitive action for what they might say or do — even inadvertently — on the internet.\n\nThis article aimed to break down the complex jargon used in the 18-page draft and explain what the provisions mean how they could affect you and those around you.\n\nUnlawful content\n\nThe most holistic change in the law brought about through the amendments is the expanded list of unlawful content. Section 2R added to the law through the amendment, states that content posted online would be deemed unlawful if it:\n\n“(a) is against the ideology of Pakistan, etc.;\n\n(b) incites the public to violate the law, take the law in own hands, with a view to coerce, intimidate or terrorize public, individuals, -groups, communities, government officials and institutions;\n\n(c) incites public or section of public to cause damage to governmental or private property;\n\n(d) coerce or intimidate public or section of public and thereby preventing them from carrying on their lawful trade and disrupts civic life;\n\n(e) incites hatred and contempt on religious, sectarian or ethnic basis to stir up violence or cause internal disturbance;\n\n(f) contains anything obscene or pornographic in contravention of any applicable law:\n\n(g) is known to be fake or false or there exist sufficient reasons to believe that the same may be, fake or false beyond a reasonable doubt;\n\n(h) contains aspersions against any person including members of Judiciary, Armed Forces, Majlis-e-Shoora (Parliament) or a Provincial Assembly; or\n\n(i) promotes and encourages terrorism and other forms of violence against the State or its institutions.“\n\nWhile most of these provisions specifically state the nature of the content that will be deemed unlawful, two of the (g) and (h) need closer scrutiny.\n\nThe provision (g) vaguely describes “fake news”, leaving much to interpretation with the use of words like “sufficient reasons to believe” and “beyond a reasonable doubt”.\n\nThe provision (h) is even more consequential because of how the terms “aspersion” and “person” are defined in the new law.\n\nSection 2(iiia) added to the law defines aspersion as “spreading false and harmful information which damages the reputation of a person”. Under the amended Peca law, a “person” is “a legal or natural person and includes a body politic or corporate”.\n\nIt essentially means that anything said against a natural person (human) or even public and private companies could be deemed unlawful and liable to be punished. For example, if a person criticises their electricity company for loadshedding, it could also be construed as “aspersion”.\n\nLawyer Abdul Moiz Jaferii tells Dawn that the previous PTI government also tried to introduce a similar amendment in Peca in 2022, but the law was struck down by the Islamabad High Court.\n\nSocial media platforms\n\nThe amended Peca law has also redefined the term “social media platform”. It says that a social media platform means two things:\n\n“(a) any person that owns, provides or manages online information system for provision of social media or social network service;\n\n(b) a website, application or mobile web application, platform or communication channel and any other such application and service that permits a person to become a registered user, establish an account, or create a public profile for the primary purpose of allowing the user to post or share user-generated content through such an account or profile or enables one or more users to generate content that can be viewed, posted or shared by other users of such platform but shall not include the licensees of Pakistan Telecommunication Authority.“\n\nThere was no definition for social media platforms in Peca before the amendment. However, the new definition of this term includes apps like Facebook, X, Instagram, Snapchat, etc and “communication channels” used to access these platforms, including VPNs.\n\nThis seems like an effort to provide legal cover to authorities if they decide to block VPNs in future.\n\nOver the past few months, PTA and the federal government have repeatedly talked about blocking VPNs, which are being widely used since X was banned in February 2023.\n\nHowever, the government was told that Peca only allows for online content to be blocked and there was no law to block communication channels used to access content. Now there is.\n\nFake news\n\nIn Section 26A of the amended law, fake news is defined as any information about which a person “knows or has reason to believe to be false or fake and likely to cause or create a sense of fear, panic or disorder or unrest”.\n\nAny person found guilty of spreading such information could be sentenced to up to three years in prison or fined up to Rs2 million, or both.\n\nAs per the law, the victims of “fake and false information” can file a complaint with the Social Media Protection and Regulatory Authority (SMPRA), one of the four new bodies being set up under this law.\n\nIn legal jurisprudence, a complainant is usually the aggrieved party who is directly impacted by the committed crime. However, Section 2(via) of the amended law says that for all offences outlined in Peca, a complainant can be the victim or “an individual having substantial reasons to believe that the offence has been committed”.\n\nLegal experts say that the provision allowing third parties—who are neither the victim nor the accused—to file complaints was liable to be misused as these complaints have been repeatedly used to lodge frivolous FIRs, mostly for political witchhunts and settling scores.\n\nAnother punitive action outlined under the amended law is that disseminating information “believed to be fake” would be a non-bailable, non-compoundable and cognisable offence.\n\nCompoundable offences are the ones where victims and accused are not allowed to reach a compromise. For such crimes, punishment cannot be commuted or reduced on the premise of a compromise, says Mr Jaferii, the legal expert.\n\nA cognisable offence is a crime for which the police don’t need a warrant to arrest the accused.\n\nIt essentially means that any person accused of sharing “fake information” will be arrested without a warrant, will not be granted bail for as long as the trial goes on and cannot settle the matter out of court.\n\nFour new authorities\n\nSMPRA is the first of the four bodies to be set up under the new law. It will, among other things, “regulate” unlawful or offensive content on social media; enlist, block or issue guidelines to social media platforms; hear complaints in case of the violation of Peca; and issue directions to block or remove unlawful or offensive content The provision seems to be a renewed attempt to force social media companies to register with local authorities.\n\nThe SMPRA will have nine members, including a chairperson, who will be appointed by the federal government. They will pass orders to remove or block “fake and false” content within 24 hours of complaint.\n\nHowever, the chairperson will also have “exclusive powers” to immediately block content in case any situation requires immediate action. How the urgency of the situation would be determined has not been defined in the law.\n\nHowever, there are serious concerns over the body’s role as an independent regulator, as Section 20 states that it will be “binding on the authority” to block or take down content at the federal government’s request.\n\nThe language of Section 20 implies that SMPRA “will be a subservient body to the federal government” rather than act as an independent regulator, says Mr Jaferii.\n\nThe amended Peca has also provided legal “indemnity” to any decision made by the authority or federal government as it cannot be challenged in courts.\n\nHowever, Mr Jaferii believes this is a “standard boilerplate clause” which courts often choose to ignore if the complaint alleges abuse of process, excess of jurisdiction or malicious intent.\n\nThe Social Media Complaint Council will be the second organisation to come into being under this law to “receive and process complaints” against the violation of Peca. As of now, there is no clarity in the law as to how the function of this council would be different from the SMPRA.\n\nAnother body to be formed under the law is the Social Media Protection Tribunals. It will have three members: a chairman who should be qualified to be a high court judge, a journalist and a software engineer, all appointed by the federal government.\n\n“Any person aggrieved by any decision of the [SMPRA] may prefer an appeal before the tribunal,” says the law about the tribunal’s function.\n\nThe decision given by the tribunal can only be challenged in the Supreme Court. This provision effectively ruled out the possibility of filing appeals with the high courts, which is cheaper and more accessible.\n\nMr Jaferii says the provision would only make the appellate process “more arduous and expensive”.\n\nThe fourth body to be set up under the law will be the National Cybercrime Investigation Agency, only a month after the government disbanded ths agency.\n\nAs per the law, NCCIA will replace FIA’s Cyber Crime Wing and conduct “investigation and prosecution of the offences” specified in Peca.\n\nAmmar Jaffri, who used to head FIA’s National Response Centre for Cyber Crime, says creating multiple authorities to deal with a specific nature of crime would result in conflict and redundancy.\n\nHe explains that a number of existing organisations, like the National Telecommunication and Information Technology Security Board, National Computer Emergency Response Team of Pakistan and PTA, have more or less similar functions.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/679ff63a1f2d2.jpg",
  "retrievedAt": "2025-08-25T19:19:15.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889378/explainer-how-new-cybercrime-law-puts-digital-rights-at-stake",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:20.000Z"
}
