{
  "title": "Addressing issues in raising productivity - Newspaper - DAWN.COM",
  "author": null,
  "content": "Initiatives like Uraan Pakistan are aimed at unlocking the country’s potential and transforming it into a hub for innovation and investment, says Planning and Development Minister Ahsan Iqbal.\n\nTo move in that direction, a working group has been set up to review the problems of businessmen and investors every month, keeping them informed about the government policies and steps to be taken to remove bottlenecks, if any. Observing that the decision will ensure a continuous engagement between the public and the private sector, Mr Iqbal says this initiative was the first step towards achieving economic prosperity.\n\nThe move may be seen in the context of the Ministry of Finance report released on Jan 27 that two of the three major real economic sectors — agriculture and industry — grew slower than targeted economic growth, but it assured that the country is well positioned for continued growth momentum during the current year.\n\nFurthermore, the government will reportedly make efforts to ensure judicial utilisation of corporate social responsibility funds; it has advised industries to impart skills to their workers needed to increase productivity.\n\nIt may be worthwhile for policymakers, corporate bodies as well as other organisations to study global diversity, equity and inclusion policies (DEI) and examine how its essence can be adapted.\n\nPolicymakers and corporate bodies ought to examine and adapt global diversity, equity and inclusion policies to attain a productive workforce\n\nAt its core, an effective DEI policy demonstrates an organisation’s commitment to creating a workplace culture that embraces and celebrates differences while striving for fairness and equality. By establishing clear expectations and standards, the DEI policy aligns the efforts of leaders, managers, and employees towards building a more inclusive workplace where everyone has equal opportunities to contribute and thrive.\n\nIt would be advisable for all Pakistani eligible organisations to voluntarily adopt DEI initiatives under a phased programme with the government’s encouragement and the active support of respective trade bodies.\n\nAn effective DEI policy demonstrates an organisation’s commitment to creating a culture that embraces equality\n\nThe expense of DEI programmes, including a rise in wages, would be more than compensated by increased productivity and value-added diversified products by skilled and motivated manpower. The progress may be published in every organisation’s annual reports and may also be monitored by a government agency.\n\nCurrently the business community is not as optimistic about economic recovery as the government is largely indicated by the industrial sector’s reaction to the State Bank policy rate cut to 12 per cent. High interest rates discourage investments in the productive sector and push investors towards speculative markets, such as real estate and stocks, further straining the economy, says Karachi Chamber of Industry and Commerce President Muhammad Jawed Bilwani. Pakistan’s policy rate, he noted, remains significantly higher than India’s 6.5pc, which has adopted a proactive monetary policy to stimulate industrial growth and attract investment.\n\nBusinesses have been operating under great strain due to an unprecedented increase in input costs, including energy tariffs, fuel prices, expensive raw materials and a volatile exchange rate. Generally, the industry thinks that a single-digit policy rate will revive the economy.\n\nLooking at mixed positive and persisting negative trends in the economy, Dr Hahiz A. Pasha says, “Overall, the time has come when the extent of the trade-off between stabilisation of the economy and growth in the GDP must be re-examined.”\n\nA competitive industrial sector is essential for economic growth, Prime Minister Shehbaz Sharif said last Monday and assured businessmen, “We are committed to easing the cost of doing business in the country.”\n\nThe federal government has also reportedly decided to review the Public Sector Development Programme FY25 to empower local governments and district/tehsil administrations. A recent high-level meeting chaired by the prime minister also reportedly decided to conduct a comprehensive technological, legal, and constitutional review of the 18th Amendment and National Finance Commission awards, taking into account the latest census data, as per Article 160 of the Constitution.\n\n“Most elusive is the very idea of an effective and inclusive governance system,” writes Nayab Khalid, an MPhil student in Public Policy at the Pakistan Institute of Development Economics, in a Business Recorder article. “Devolve power to the local representatives and develop them in close network between the state and the marginalised communities,” she elaborates.\n\nWhile a state-citizen bond is essential for cohesion, Ms Khalid notes that the crucial link between the state and the citizen has gradually weakened. Local governments must be empowered with resources, authority and autonomy. Federal, provincial, and local institutions and civil society should cooperate with each other openly.\n\nTo speed up reforms, Dr Ishrat Husain says the widening gap between the general population’s expectations and the government’s actual deliveries should be a wakeup call for altering past conduct, practices and behaviour.\n\nPublished in Dawn, The Business and Finance Weekly, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:19:21.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889139",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:42.000Z"
}
