{
  "title": "On the wounds of Partition - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAST week, the Gurmani Centre for Languages and Literature at Lums hosted a screening of the forthcoming documentary film, Buhay Khulay Rakhi (Keep the doors open).\n\nDirected by Nida Mehboob and produced by historians Ali Usman Qasmi, Ilyas Chattha, and Ali Raza, the film centres on stories of trauma, identity, and belonging of those separated from their families during the partition of Punjab in 1947.\n\nWhile scholars have chronicled the horrors of that upheaval across several decades, this new film draws attention to the children who were orphaned in the violence, adopted temporarily by others, and subsequently sent to Pakistan on the basis of their religion. With kin killed or displaced in Par­tition, and communities segregated on the basis of faith, the eventual status of many such children was as wards of a newly independent state.\n\nThe number of such cases is sizable. Their stories, however, have only recently come to light thanks to the remarkable work of chroniclers such as Khayyam Chohan. Mr Chohan, whose work features prominently in the aforementioned film, runs a YouTube channel called Desi Infotainer.\n\nAmong the vast quantities of tripe that passes for popular content on Pakistani YouTube, his is a rare outlet dedicated to a truly remarkable and educational cause: commemorating and recording people’s personal narrations of Partition, with a special focus on reuniting (digitally and in some instances in real life) families and communities who now lie on either side of the border.\n\nSeven decades and three generations removed, what good does it do to unearth the wounds of Partition on YouTube?\n\nDuring the post-screening discussion, Mr Chohan laid out his motivation for the channel: providing an alternative to mainstream and official accounts of Partition, which usually focus on national politics and ascribe blame for violence to other communities, while sidestepping the actual experience of the people involved. His own words were clear in stating that for the accuracy of historical record there remains no substitute for eyewitness accounts and personal experience.\n\nThe task of curating a people’s history of Partition is not a new one. It has in the past been carried out most notably by The Citizens Archive of Pakistan among others.\n\nWhat makes Khayyam Chohan’s initiative distinctive is its reliance on social media attention, both to collect stories and to provide a new online public space for the sharing of memories and connections. As one historian described it, the comments section of these Partition stories on this channel act as a space for collective mourning across national boundaries.\n\nBut there is more to it than just mourning. Alongside reckonings with trauma and grief, these online spaces act as a site for reflection, appreciation, and communal reorientation. Accounts of Muslim children taken in and given a home by Sikh families (and vice versa) during a time of mass violence and displacement elicit both gratitude and relief among viewers. Many comments are confessional, with open admissions of misplaced bias, taught prejudice, and incorrect notions of the ‘other’.\n\nMr Chohan’s greatly accurate lament is that social media came too late. Many of those who experienced the division of Punjab have already passed. A large number were scattered all across the globe. Valuable accounts and testimonies were lost. Many traumas remained unprocessed, many questions — of belonging, identity, and community — rendered unanswerable.\n\nBut seven decades and three generations removed, what good does it do to unearth the wounds of Partition on YouTube?\n\nIt achieves not one but several worthy objectives. It achieves the tangible, personal gain of those whose stories are narrated, whose loose ends can be tied, and who attain some manner of closure or reunification (even if just digital).\n\nBeyond personal gain, there is an owed debt to our shared history, which remains unpaid to this day. Any commemoration of an event impacting millions of common lives, many of which were lost, is a worthy endeavour, especially beyond its usual telling as a (involuntary) sacrifice for achieving statehood and national destiny.\n\nAnd lastly, for a region that still lapses into violent aspirations — sectarian, religious/communal, or nationalistic — showcasing and retelling the costs of previous such aspirations is an urgent and necessary task.\n\nIt is well documented that the outbreak of violence around Partition appeared as a frenzy that tore communities apart at the altar of political and material objectives. Short-lived though it was, it left behind grief and dislocation, such as of the orphaned children who were eventually cared for by the state. ! The momentary lapse into violent frenzy around 1947 is of an unmatched scale, but at its core it does not appear too different from the episodic flaming of religious sentiment through blasphemy accusations or sectarian differences that plagues the country today.\n\nNaïve as the thought may be, one hopes that showing people the horrific extent such violent frenzy has achieved in the past, and the damage it left behind, might just force some reluctance and hesitation towards doing it again.\n\nThe work of digital platforms like Khayyam Chohan’s Desi Infotainer and Nasir Dhillon’s Punjabi Lehar have, in their own ways, taken on these important tasks. They and others in their genre are adopting the responsibility of building humane ties at a time when inter-state relations are at their lowest ebb, and religious and other identity-based differences remain cannon fodder for political objectives in both countries.\n\nSuch initiatives frequently trigger nationalist and conservative anxieties, especially among those who equate critical reflections on Punjab’s partition with an assault against the very notion of Pakistani and Muslim political identity.\n\nThe truth is that these initiatives are indeed a confrontation. A much-needed and belated one, but only against conceptions of statehood that thrive on burying the history of their own people; and against conceptions of faith identity that thrive on fanning perennial hate despite the massive toll levied in the past.\n\nThe writer teaches sociology at Lums.\n\nX: @umairjav\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a0136ed7b20.png",
  "retrievedAt": "2025-10-12T01:07:13.647Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889441/on-the-wounds-of-partition",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:20:29.000Z"
}
