{
  "title": "Pakistan needs unity more than ever, says PM Shehbaz after Kalat attack - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Monday saluted the sacrifices of the armed forces and said that Pakistan needed unity now more than ever before in its 78-year history.\n\nHis remarks came after 18 soldiers were martyred and 23 terrorists were killed in various sanitisation operations across Balochistan on Friday. The Inter-Services Public Relations (ISPR), the military’s media wing, said that the operations took place in the districts of Harnai and Kalat.\n\nSpeaking at a meeting in Quetta today, PM Shehbaz said: “I think today, in our 78 years, we are in need of unity the most. This is not the time for politics but we have to tackle this national challenge first, and we can engage in politics [later].\n\n“In the attacks … in which 23 khwarij were sent to hell and 18 soldiers embraced martyrdom, I feel this was the ultimate sacrifice during this new wave of terrorism,” the prime minister said, using the state’s official term for terrorists.\n\nHe said that the nation saluted “the martyrs and the ghazis (warriors)” and stood with them completely, adding that he visited the injured today at the hospital.\n\n“They were in high spirits and they said, ‘We are getting the best hospital facilities here and if we have had to sacrifice a limb, it’s not an issue as we would have sacrificed our lives for the nation as well,’” he continued.\n\nPM Shebaz expressed that the “brave sons of the nation” and their spirit made him believe that the province would achieve its goals under the leadership of the army chief and Balochistan chief minister.\n\n“We have to stay united and use our energies to tackle this challenge,” he emphasised. “In the past, political stakeholders made mistakes because of which we are playing with blood today,” he added without elaborating.\n\nPakistan has recently witnessed an uptick in terrorist activities, especially in Khyber Pakhtunkhwa and Balochistan.\n\nIn a separate incident, security forces killed 10 terrorists during multiple operations in KP, the ISPR had said last week.\n\nTwo soldiers were also martyred and five terrorists were killed in a foiled attack on a security checkpost in Balochistan’s Qila Abdullah district, the military’s media affairs wing said last week.\n\nTerror attacks have increased since the banned Tehreek-i-Taliban Pakistan (TTP) broke a fragile ceasefire agreement with the government. With at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for the civil and military security forces of Pakistan in a decade.\n\nEqually alarming were the cumulative losses of civilians and security personnel: 1,612 fatalities, accounting for over 63 per cent of the total recorded the past year and marking 73pc more losses compared to 934 outlaws eliminated.\n\nThe overall fatalities recorded last year were a record nine-year high, and over 66pc more than in 2023. On average, nearly seven lives were lost daily.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/03163303c61daaf.jpg",
  "retrievedAt": "2025-08-25T19:19:07.543Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889505/pakistan-needs-unity-more-than-ever-says-pm-shehbaz-after-kalat-attack",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T12:21:44.000Z"
}
